{
  "id": 573,
  "title": "101 Dalmatians",
  "starring": [
    "Glenn Close",
    "Jeff Daniels"
  ],
  "runtime": 103,
  "genre": [
    "Family",
    "Comedy"
  ],
  "description": "An evil, high-fashion designer plots to steal Dalmatian puppies in order to make an extravagant fur coat, but instead creates an extravagant mess.",
  "releaseYear": "1996",
  "mpaaRating": "G",
  "imageUrl": "https://image.tmdb.org/t/p/w500/8o2ADoAyG796UwTjwBFjPyBz0yG.jpg",
  "categories": {
    "plot": 6.75,
    "acting": 6.0,
    "ending": 6.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 6.0,
    "funny": 6.5,
    "action": 4.0
  },
  "reviews": [
    {
      "rating": "8",
      "text": "A very entertaining film that has some hilarious stuff to share and some great acting (especially from Glenn Close).  Overall, the film is very entertaining and it sticks to the Disney's animated film very well.  I really enjoy this film."
    },
    {
      "rating": "9",
      "text": "This movie is a classic! Maybe I am the only one who actually prefers this version to the animated one, but I am a Disney lover and think this one has more depth. Glenn Close was perfect casting for Cruella De Vil. She is actually evil, and really brings the character to life. Plus the dogs are so much cuter in real life!"
    },
    {
      "rating": "10",
      "text": "Is a decent remake of the original 1996, with an excellent rendition of actress Glenn Close."
    },
    {
      "rating": "5",
      "text": "I know that this film is an epic, but I will not be influenced by this or I will base my critique on the fact that a film is epic or not. I actually think the movie a big failure in cinematic terms. But for watching with family at times like Christmas or Easter is perfect, and the kids do not dislike."
    },
    {
      "rating": "10",
      "text": "Esta película es un gran clásico de culto familiar Live Action de Disney y punto."
    },
    {
      "rating": "5",
      "text": "not terrible, but not that good."
    },
    {
      "rating": "7",
      "text": "i just like the part that all the dogs barks to send news about the puppies"
    },
    {
      "rating": "3",
      "text": "101 Dalmatians was one of the worst remakes I have ever seen. The original was so much better. This one has cringy gags and disappointingly bad acting from actors that are respected worldwide. Stick to the original."
    },
    {
      "rating": "5",
      "text": "Despite a superb performance from Glenn Close as Cruella de Vil 101 Dalmatians never achieves more than any other mid-level Disney film like Beethoven. It's far from terrible but almost everything in it has been seen before and you'd be much better off watching the more entertaining cartoon version."
    },
    {
      "rating": "6",
      "text": "Entertaining film but surreal."
    },
    {
      "rating": "6",
      "text": "This, for me, is truly something of a unique film. It has all the corniness and cheap slapstick of a plethora of other comedies cashing in on popular trends  which in this case, was \"Home Alone\"  while otherwise being painfully sappy. Yet, for some reason, \"101 Dalmatians\" doesn't bother me when it's corny. And I think it's because it's so thoroughly and consistently corny that you just end up buying into this strange pseudo-cartoon world they build. It knows how silly it is and just enjoys itself nonetheless, and the result is a movie you really just can't help but like. It's so innocent and fluffed with lighthearted chuckle that it's very hard to call it unenjoyable, no matter how bad one might consider it. And of course, you have Glenn Close turning in a gleefully over-the-top performance as Cruella DeVil  who, by the way, turns everything she touches into some awesome piece of art direction  and an affectionately charming and humorous Hugh Laurie as one of her bumbling dognappers. This was never meant to be taken seriously. That's clear from the start. And I honestly have to call it a guilty pleasure."
    },
    {
      "rating": "5",
      "text": "101 Dalmatians was a heartwarming, enjoyable Disney movie in 1961. This version doesn't smother the name, but it takes a more sinister angle that is trying to be more than it is. Perhaps Cruella's antics just didn't translate well from animation to live action."
    },
    {
      "rating": "4",
      "text": "This is one of the most boring, dull, annoying and most unnecessary live action remakes of all time. Honestly, who wants to watch some trashy remake when they can watch the original heartwarming animated classic. There's a good Cruella performance but apart from that all I can say is. Why?"
    },
    {
      "rating": "10",
      "text": "I just rewatched this movie in 2019, I was willing to forgive if any CG was bad, but I didn’t have to. Movie is amazing!  Even better than the cartoon. Glenn close is absolutely fantastic and sooo true to the cartoon. The dog and animal trainers did a great job as the communication between the animal is very well done, I appreciated every aspect of the movie, the two Dalmatian mom and pop look very similar to the cartoon and VERY WELL trained!  They should rerelease this movie. More people need to see it and review it. ( how can Aquaman the movie get better review than this , Aquaman was awful)I am an adult and I absolutely enjoyed it, must see film. Good for adults and kids!!!! Again kudos to the dog trainers"
    },
    {
      "rating": "5",
      "text": "For such a remake to the animation one, it's pretty much okay. Nothing bad about it, but nothing good about it either. 101 Dalmatians will either pass away the time or you'll eject the disc out of the Blu-ray/DVD player depending on your taste in movies."
    },
    {
      "rating": "5",
      "text": "The film tries to be a \"good-friend\" of the original animated classic, but it fails on his boring story-telling and it also tries quickly to make unforgettable characters, but its failure is a big as his direction and interpretations."
    },
    {
      "rating": "6",
      "text": "This film is a live-action that repeats and updates the story of \"101 Dalmatians\", an animated film that Disney launched in the early sixties. The plot has some minor changes and is brought to our time, but its virtually the same in both films. One of the most drastic changes, however, is that the animals in this film don't speak, even though they demonstrate intelligence and know how to face danger. The human cast has Jeff Daniels, Joely Richardson, Joan Plowright and Hugh Fraser, very experienced British and American actors, but its Glenn Close who stands out, in the iconic role of the villain, Cruella De Vil, giving us one of the most remarkable performances of her career so far, and the best interpretation of what, for many, is Disney's biggest villain. Remarkable! The team that created the costumes of this character also deserves congratulations, combining charm and good taste with Cruella's sinister attraction by genuine fur (of course, in the film they weren't real fur). Situational jokes are the strongest part of the film, thanks to Hugh Laurie and Mark Williams, who brought to life the two absolutely stupid thugs who were supposed to keep the dogs under control. They're the main comic element, contrasting with the sweetness of those little puppies. It's a great movie for the whole family to watch together, have a laugh and spend some quality time together."
    },
    {
      "rating": "5",
      "text": "So the movie isn't terrible.  For me it just doesn't compete with the animated version."
    },
    {
      "rating": "6",
      "text": "The movie is fun and very silly at times. The dogs are great but the movie drags at times and can be boring."
    },
    {
      "rating": "6",
      "text": "A true classic. Who doesn't like this movie. If you haven't seen it, I really recommend it. Especially for kids."
    },
    {
      "rating": "7",
      "text": "----------------------------------7.3/10-----------------------------------"
    }
  ]
}