{
  "id": 2858,
  "title": "10 Cloverfield Lane",
  "starring": [
    "Mary Elizabeth Winstead",
    "John Goodman"
  ],
  "runtime": 104,
  "genre": [
    "Thriller",
    "Science Fiction",
    "Drama",
    "Horror"
  ],
  "description": "After getting in a car accident, a woman is held in a shelter with two men, who claim the outside world is affected by a widespread chemical attack.",
  "releaseYear": "2016",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/84Dhwz93vCin6T1PX6ctSvWEuNE.jpg",
  "categories": {
    "plot": 8.140625,
    "acting": 8.189655172413794,
    "ending": 8.10344827586207,
    "soundtrack": 8.0,
    "cinematography": 8.333333333333334,
    "familyFriendly": 6.0,
    "funny": 8.25,
    "action": 8.25
  },
  "reviews": [
    {
      "rating": "9",
      "text": "Maybe the best sci fi movie of the past 30 years. The buildup is tense and the payoff had me digging my nails into the armrests. I'm going back again on Sunday. I loved it!"
    },
    {
      "rating": "8",
      "text": "When J.J. Abrams released Cloverfield in 2008, it arrived cloaked in secrecy. Now, some eight years later, the film’s so-called “blood relative” (Abrams’ term, not mine), comes with a similar marketing strategy. Going-in, viewers are unlikely to be certain what to expect and, emerging, they might not be quite sure exactly what they witnessed.  The problems with 10 Cloverfield Lane result from attempts to tie it, however tenuously, to the earlier movie. Take away the disappointing, disjointed, and anti-climactic final act, and this is an effective white-knuckle psychological thriller. And, although the final 15 minutes don’t ruin the movie, they detract from its better parts.\r The premise is simple: following a car accident, Michelle (Mary Elizabeth Winstead) awakens to find herself chained to a wall in what appears to be a basement. She soon learns that she has been brought to this place by the hulking, rather scary Howard (John Goodman), for her “own good.” The basement is actually a doomsday bunker with three occupants: survivalist Howard; his former handyman, Emmett (John Gallagher Jr.); and Michelle, whom Howard rescued from her smashed car. In the outside world, all is not well. According to Howard, apocalyptic events have occurred. His plan is for the three of them to shelter in place and wait it out until things are safe. Michelle thinks he’s crazy. Emmett isn’t so certain.\r By using double-bluffs and red herrings, director Dan Trachtenberg crafts a claustrophobic psychological thriller that hums along nicely. Hitchcockian misdirection abounds. From moment-to-moment we’re never quite sure who (or what) Howard really is: a lonely savior whose paranoia has been validated or a creepy kidnapper acting out a twisted delusion? Is the situation outside the bunker real or a figment of Howard’s warped mind? Did “the Ruskies” attack? Or aliens? Or nothing at all? Perhaps Howard faked the mutilations of some pigs to “prove” that the air isn’t safe? So many questions… At times, 10 Cloverfield Lane has a similar vibe as the TV series Lost which, not coincidentally, was produced by Abrams’ Bad Robot Productions.\r While keeping us guessing, 10 Cloverfield Lane provides several nail-biting scenes. Sound is an important part of how the tension is amplified - every noise is loud and the insistent musical score throbs. 10 Cloverfield Lane doesn’t employ “found footage” like the original Cloverfield. Camera movement is smooth and clean and the shots are composed to emphasize how cramped and uncomfortable the limited space is. The movie is presented from Michelle’s perspective and its tone varies with her mood. Her opinion of Howard and the situation changes frequently and the film reflects that. There’s even a goofy musical montage that shows the three companions playing board games and putting together puzzles like any “normal” family.\r Winstead is a good choice to play the heroine because she’s strong yet feminine. (She previously appeared as Bruce Willis’ daughter in the fourth Die Hard film and as the lead in the prequel to John Carptenter’s The Thing.) John Goodman is a perfect Howard - Goodman has the rare talent of being able to play both a cuddly, likeable guy and a frighteningly dangerous one. In 10 Cloverfield Lane, he’s asked to do both.\r The film’s failing is that, in linking it to Cloverfield, it abandons the elements that made the majority of the movie effective. The final fifteen minutes don’t work as a way to wrap up this story or as an introduction to a larger (generic) canvas. They feel tacked-on and rushed. Nevertheless, as weak as the conclusion may be, it doesn’t obfuscate the good things to precede it. 10 Cloverfield Lane is packed with suspense and tension and offers some of the best bait-and-switch work of any recent psychological thriller. It’s easy to forgive any missteps toward the end when considering the entire package."
    },
    {
      "rating": "8",
      "text": "I loved it all, except the last 10 or so minutes. You feel scared the whole time, small rooms, creepy guy who has many mysteries, and only short moments when the characters are alone. The acting was great, as I expected. The ending was terrible though, it changes the genre to something I didn't want."
    },
    {
      "rating": "8",
      "text": "This movie has an incredible atmosphere,amazing build up,brilliant acting especially from John Goodman and it keeps you interested until the horribly disappointing ending which I won't get into. But overall 95% of this movie is great and you should defiantly check it out."
    },
    {
      "rating": "8",
      "text": "great Little sci-fi thriller Flick. has a great atmosfear and John Goodman is just plain creepy."
    },
    {
      "rating": "8",
      "text": "Very suspensive movie, very unpredictable. This is a fine example how to make a good movie with only 3 characters lol. Anyway the movie leaves you hanging and waiting for a sequel at the end."
    },
    {
      "rating": "9",
      "text": "This was a very well acted movie that kept me entertainingly uncomfortable by Goodman's performance.  It is a movie that kept me guessing and was willing to take some really big risks that I found to be refreshing compared to a lot of movies that simply follow the formula.  If nothing else it will be a movie that sticks with you."
    },
    {
      "rating": "8",
      "text": "10 Cloverfield Lane is tense and populated by developed and layered characters. The acting furthermore elevates this film from other similar film in the monster genre."
    },
    {
      "rating": "8",
      "text": "+Engaging premise+Fantastic cast+Great use of tension-Poor use of 'cloverfield'10 Cloverfield lane is an excellent sci fi premise that uses its tense atmosphere to make you question its characters motives and at various points allows you to understand more of what is really happening along with the protagonist. I was always engaged I just wish they hadn't simply 'tagged' cloverfield into the title and given it more credit as it's own original idea. If you're a fan of scifi/thriller/mystery give this a look!"
    },
    {
      "rating": "8",
      "text": "10 Cloverfield Lane was a very good movie but boring in one part , everything else is very good , interpretations of John Goodman , and Mary Elizabeth Winstead outstanding , the theme very well managed , but has lived in a bunker with a psychopath , you want to deal with on the alien apocalypse, this theme has addressed most of the movie , and the ending left me very impressed and it was exciting , just one of my favorite film. \"10 Cloverfield Lane\" was surpassed the quasi-antecessor 2008 film \"Cloverfield\"."
    },
    {
      "rating": "8",
      "text": "I liked this movie. It has been years since a good well made suspense drama has been created without stupid characters or scripts. John Goodman gives a great performance here and his fellow cast mates hold their own. The only flaw of this movie is at the very end there should have been an extra 10min or so to show where our main character decides to do and what really going on in the world but in all a good movie"
    },
    {
      "rating": "8",
      "text": "This is not a cloverfield sequel more a huge reference that is put together really well with great acting and amazingly well done tension build up wich keeps building up during the whole movie if you saw the first movie cloverfield you kind of know what's going on outside of the bunker but you dont know entirely.What stops me from rating this movie higher is the last 15 or so minutes as they feel like they were put in last minute just so they could call it 10 cloverfield lane but there still a good setup for if they want too turn cloverfield into a franchise.But with the budget they had making this movie I cant speak badly about it it is a great movie that will have you on the edge of your seat through out the whole thing and i cant recomend it more WATCH THIS."
    },
    {
      "rating": "8",
      "text": "You gotta respect a movie that ends the way this movie does. You just gotta, it's the law.\r Aside from that, watch this movie because even if you hate it, you'll be supporting the good and pure original ideas department, which has been starving in a basement for a long time now.\r At least I think it's an original idea. Too lazy to research that."
    },
    {
      "rating": "7",
      "text": "A masterclass in suspense - although not strictly related to 2008's 'Cloverfield', despite the name. All three main characters also managed to be distinctly unique and unpredictable when interacting with each other. The ending was a little rushed & meaningless, but it doesn't take away from how excellently creepy the rest of the film is."
    },
    {
      "rating": "9",
      "text": "這部電影的特色，在於能以有限的空間，營造出懸疑緊張的氣氛，縱使不見恐怖的事物，亦令人駭然。PS:The fat guy is hentai. XD"
    },
    {
      "rating": "8",
      "text": "The biggest problem in Cloverfield (2008), was the previous part of the actual stuff and how that affected the whole movie after that, in here, yes, there is a explanation of what is going on in the character's life, and it does work, because it is fast and works to let you know the character just fine so as it is crucial for the story to happens, so it isn't for free or anything bad, it is a great way to introduce in here. The story overall it is really fine, they first try to give us a mystery, for those that already know the Cloverfield franchise that mystery won't work, because these people will already know what is true or not about what is going on outside, but for those that are going to watch it without knowing what the series is about, i think that it will be really nice to figure things and never be sure of the outside world, just like the characters.  Wich lead us to say that the characters would be extremely important to work, there are only three characters to interact and they had to be really good and different, and that is exactly what it is, each character have his function for the narrative and all work, you truly care about what is going on. The sequence of facts feels really natural and well done, you first got a mystery from the character, Michelle, perspective, wich works, than you got slowly introduced to the situation by Howard's words, and then got to know the whole bunker and it's rules in a way that you understand very well without getting any boring. The character of Emmett does give a nice personality contrast to work with Howard and for Michelle, the chemistry works fine. During the course of the story there are some really good plot twists, while it goes it does give some more layers to the characters and things got way more scarier and definely got my attention more and more, you got to know the characters more deep and caring more and more for them. There are a few moments where things felt, not just rushed, but the characters could have said something better, like invent things and use creativity, like it was already shown that they had creativity, doing something smart instead of just tearing things apart that easy. There some dialogues where things feels a little unnatural.More at the end there are a big tone difference compared to the whole movie, i do think that in some moments at the ending things went well and in others it got lost, there are somethings that felt just to easy or didn't really made me buy, but in overall the ending worked for me. I read another person saying about a metaphor in this story, and i found it really interesting, so i'm gonna put it in here.  So it will have some SPOILERS in this paragraph. It consists in facing the unknown, getting out of the comfort zone. The person said that the characters would represent characteristics from the character Michelle, Emmett would represent hesitation and fear, Howard accommodation and safety. The movie talks much about umconfortable/safety for being in a bunker. All the attempts to leave the bunker are frustrade by Howard. And only when Emmett, the hesitation, dies, the protagonist can overcome Howard and leave the bunker to face aliens, wich would represent the unkown itself. So it would be like she overcame the hesitation, get away of the sense of safety in the comfort zone for literally confront the unkown. The last scene would reinforce this, when she hear in the radio that a city is already under control and Houston are still in war and in need for help, and then she chooses Houston to go.  END OF SPOILERS. The technique aspects in here are very good, it can give different senses for who is watching, a claustrophobic moment or a discovering with open plans. The camera movimentation and closing up are really good. The sound design are also nice, hearing things depending from where they are was really important, the mis-en-scene was good, you could have a good idea of how it would feel to be inside of that bunker. The design of the whole place is really nice, you can get where is where or where they are going, it is fluid. The soundtrack is really good, we do hear a lot of songs in this movie as well, and they really worked fine, it helped on giving the scenes some structure. The acting works really fine. Mary Elizabeth Winstead is great, she gave many aspects in here, trying to be conviction, being extremely nervous but holding it down, she really convinces me in everything she did, very good performance. John Goodman is also very fine in this film, he first give a calm character that is trying to do the right thing, but you can clearly see that he is unstable, that he could do anything in any moment and that gives some thriller to the movie. John Gallagher Jr. have a more trickster and joking kind of way, his character isn' much challenging but he did fine."
    },
    {
      "rating": "8",
      "text": "A movie that’s biggest let down is that it is supposed to be a part of the Cloverfiled series when it reality it would of been much better as its own thing. If it cut its ties to Cloverfield, attempted some more impressive camerawork and had a better ending, it certainly would of been one of the best movies of the year. Strong acting from John Goodman and Mary Elizabeth Winstead is what really holds this movie together.Rating - 78%"
    },
    {
      "rating": "8",
      "text": "Incredibly tense and well-paced with sudden bursts of comedy to relieve the tension, 10 Cloverfield Lane is a wonderfully dark look at a life spent entrapped and its toll on the human psyche, without preaching or talking down on its viewers. It's incredibly suspenseful, with enough payoff at the ending to keep you satisfied with the build up. John Goodman, as always, steals every scene he is a part of, using phenomenally creepy yet endearing versions of his character one after the other.\r My only complaint, and I understand why they did this, is that the ending felt a bit like a big-budget ending that didn't fit the rest of the film. Yes, the payoff is good and unexpected (at least for me), it drags on a bit out of its own bunker and dips its feet in the water of a big-budget action sci-fi film. I see why they did this; it leaves the opportunity for sequels of greater name value or production value. And there's not necessarily anything wrong with that concept, it's just that it didn't fit the rest of the film thematically.\r Having said that, 10 Cloverfield Lane is one of the most suspenseful movies I've seen in recent years, keeping shots tight and balanced with great performances from all three of the main characters."
    },
    {
      "rating": "9",
      "text": "10 Cloverfield Lane is brilliant from beginning to end. The story is gripping and very unpredictable. The acting is possibly some of the best I've ever seen in ANY forms of entertainment media, and that's saying quite a lot. The characters feel like real humans and develop in realistic ways. There isn't much more I can say about it. I suggest that you watch it."
    },
    {
      "rating": "8",
      "text": "10 Cloverfield Lane is very good non-standard and unpredictable horror. The film is not perfect, but unlike most modern horror movies in this film there is no terrible stupidity."
    },
    {
      "rating": "8",
      "text": "\"Produced by JJ Abrams\" is generally all it takes to get my ass in a theater seat these days and I rushed in to see 10 Cloverfield Lane as quick as I could and I was not disappointed. We all know that this film really came out of nowhere a couple months ago when the film was revealed only 2 months before it came out.\r Some people may find this film to be slow but I felt that it went by so fast. This film is 103 minutes and when it was over it felt like 50 minutes had past. Key men behind the first film returned as producers in Abrams, Drew Goddard and the director of the first film Matt Reeves. Rookie filmmaker Dan Trachtenberg deserves a pat on the back after a great debut and I'm sure we will be hearing that name again on some more big productions. The cast was so great! John Goodman is outstanding. I honestly feel like there is no one who could have pulled off the role of Howard the way he did. Its nice to see him in a mainstream film because he is such a talented guy and we don't seem to see as much of him anymore. Goodman's character is so mysterious and you really never know whether he's a good guy or a bad guy. I think that Mary Elizabeth Winstead did not reach Goodman's level but she was very good as well and is probably the best I have seen from her so far in her career. Then you have John Gallagher Jr. who was strong and likeable as well.\r Most of this movie has a very independent feel through the first 2 acts and I was very fine with that and the first two acts are the high points of the film. With JJ involved it definitely feels similar to the \"Hatch\" in Lost which I love. There are so many tense moments where you are so engaged and I found myself attached to Winstead's character Michelle. You are really rooting for her the whole way through.\r The third act took me out of the story just slightly when the monsters finally show up because it is just such a shift into a whole different type of danger. I still thought the monsters looked good and they were pretty scary while they were around. I recommend that this film be viewed in the theater just so you can get the experience of seeing the monsters on the big screen.\r I was fine with the ending too, which was obviously a huge cliff hanger and as long as we get another movie I'm 100% fine with it. I would not rule out the fact that we are seeing another Cloverfield film that starts up right where the last one left off. I was not be shocked by an announcement of another movie before the end of 2016. I'll have my fingers crossed."
    },
    {
      "rating": "9",
      "text": "If you're planning on watching the movie, {and I thoroughly recommend you do} make sure you take your seat with an empty bladder! The tension builds brilliantly to the point where you don't want to be leaving the theatre for anything!\r Surely to be one of the best movies of 2016."
    },
    {
      "rating": "9",
      "text": "If you like films that keep you on the edge of your seat and films that are action packed, 10 Cloverfield Lane is your type of movie. Based on these, and more, qualities and great acting from John Goodman, the film is one of the most enjoyable films in 2016 - So far."
    },
    {
      "rating": "8",
      "text": "Ending was bad, switched genres.  First 90% - psychological thriller.  Last 10% - science fiction.  Would have been so much better with an ending that matched the rest of the movie.  Either the writers don't understand the concept of genre or they're lazy."
    },
    {
      "rating": "8",
      "text": "John Goodman, Mary Elizabeth Winstead and first time director  Dan Trachtenberg takes the audience on a heart pounding thrill ride that is 10 Cloverfield Lane. Never does this movie slow down, it constantly builds a daunt and claustrophobic atmosphere, that will leave you guessing what is actually happening until the very end that will most likely improve upon multiple viewings. So far, my favorite movie of 2016."
    },
    {
      "rating": "9",
      "text": "A surprising film that is compelling, disturbing and intriguing in equal measure. The performances are excellent, the pacing is beautifully executed, and the storyline is thoroughly engaging, with a number of moments I did not see coming. The claustrophobic setting coupled with the heightened tension of the plot made for a gripping, if somewhat stressful experience. Much better than I was expecting, this is well worth your time. 8.67/10"
    },
    {
      "rating": "8",
      "text": "Do not tie this movie to Cloverfield.  Even though, this movie is from the same period after the original events went down, the movie is good all by itself.  I went expecting pieces (creatures, characters, storylines, etc.) from the original movie so I was disappointed in that.  I did get my screams and creatures.  It is just different."
    },
    {
      "rating": "8",
      "text": "A claustrophobic, bite-your-nail-to-the-quick thriller that ultimately redefines franchise film development. Sure, the specific narrative thrills are different from those of Matt Reeves' 2008 creature-feature predeccessor, but make no mistake - this quasi-sequel's heart is just as black, if not darker than the film before it. Thanks in no small part to one of the most impressive directorial debuts in recent memory, a truly engrossing mystery at the center of all things, and what could quite feasibly be John Goodman's best onscreen role since \"Walter Sobchak,\" \"10 Cloverfield Lane\" places yet another clear tick mark in the \"W\" column for producer J.J. Abrams"
    },
    {
      "rating": "8",
      "text": "What a fantastic movie! 10 Cloverfield Lane delivers, big time. It is one of the best thrillers to come out of Hollywood in awhile.\r This movie along with Ex_Machina are leading the charge in the reemergence of the slow burn Hitchcockian thriller. It's great to see this kind of film to come back into the fore.\r It gets very tense throughout the course of this movie. There is a brilliant scene at a dinner table where two characters laughing and joking around with one another ratchets up the tension instead of relieving you of it. How many movies can you say have done that?\r All the performances are superb. There are lots and lots of closeups of a characters face and all of the actors (but mostly Mary Elizabeth Winstead), have to convey many thoughts and feelings to the audience with just their facial movements. The standout performance though is John Goodman's, he is a very nuanced character who's lumbering presence is felt even when he is not onscreen.\r This is a top notch thriller, the kind I would like to see more of in the coming years. I also hope there is a third installment in this \"case file\" movie franchise, because: so far, so great!"
    },
    {
      "rating": "10",
      "text": "Can't wait 'til next one.  This is the dark, gritty, and thoughtful movie you waited for.  I like the dark DC and kid friendly Marvel.  I'd hate if they made movies in the same style."
    },
    {
      "rating": "10",
      "text": "Oh how I wanted this movie to be good, and it wasn't just good it's brilliant. Starring the fabulous John Goodman, Scott Pilgrim's girlfriend and some dude with a beard. The acting and atmosphere is simply amazing. Although not what you expect I'm calling it a monster movie, and it's a monster movie actually worth your time (looking at you Godzilla). Loved it from start to finish, gripping, shocking, intense, it's a definite recommendation. Seriously, get to a cinema and see this movie,"
    },
    {
      "rating": "8",
      "text": "10 Cloverfield Lane is an intense and compelling movie that keeps you guessing til the very end. It is a psychological thriller with twists and turns at every corner. The claustrophobic setting is suspenseful and truly chilling. With a captivating performance by John Goodman that keeps you guessing if he is crazy or not. Lives up to all of its horror and Sci Fi, with surprises along the way, enough to keep you on the edge of your seat. Definitely an intriguing yet disturbing 2016 film. Solid story and tension built up throughout the film. Well directed and worth the money! Recommended for anyone that is looking for a modernized suspenseful thriller"
    },
    {
      "rating": "8",
      "text": "A master class in tension. Its ability to switch tone on a dime and make you second guess your preconceptions is impressive. A standout performance by Mr. Goodman that is sure to draw at least a nomination."
    },
    {
      "rating": "8",
      "text": "Outstanding!\rThrilling, chilling, unnerving, and uncomfortable. 10 Cloverfield Lane boasts an intriguing script, air-tight direction, haunting sound development, and is carried by a powerhouse performance from John Goodman. Goodman takes the film above and beyond what it maybe should have been, delivering the well-written mix of nervous tension and entertaining comic relief. Nearly every moment, start to finish, is directly moving the story along while keeping the audience guessing at every turn. What I take away from the film in a negative light is that the climax cuts off a well-crafted tension that felt as if it had just gotten rolling. This is also, obviously, a huge respect for the craft. But perhaps the worst thing about this film is its title. Had the title been different and the relation to Abrams's former project of the same name been alluded, the film would have been much more rewarding in the end. I mean, this outing is an entirely different beast than its \"blood relative.\" Connecting the relation before seeing the new outing only hinders the well-built mystery. I feel like Abrams should've thought that through. However, as it stands, 10 Cloverfield Lane is a highly entertaining thriller that crawls its way deep beneath the skin. Highly recommended and well-worth a big screen view."
    },
    {
      "rating": "9",
      "text": "So far the best film of 2016. The film is like an intense ride that keeps going. It keeps you at the edge of the seat waiting for moments and asking \"What could possibly happen next?\" The film mixes a slew of genre from scifi to horror to psychological thriller. John Goodman is at his peak and a defining role since Argo. Dan Trachtenberg is a new and promising director and delivered very well. Go see it and you won't be disappointed."
    },
    {
      "rating": "9",
      "text": "I enjoyed the first Cloverfield movie for the most part, but the frenetic pacing and shaky camerawork made for an exhausting experience. 10 Cloverfield lane is a totally different experience for most of the movie, and to say much more would be giving too much away. Just go and see it. I doubt you'll be disappointed."
    },
    {
      "rating": "8",
      "text": "Consistently tense and superbly acted, 10 Cloverfield Lane is a thrilling and exciting time at the movies. The self-contained feel helps build suspense and drive characters in a very naturalistic manner, and provides some insane, unexpected twists. John Goodman is a gift from God."
    },
    {
      "rating": "9",
      "text": "First, this isn't a sequel to Cloverfield nor does it take place in the same universe as Cloverfield, so if you go see this, don't get mad that the Clover monster isn't ripping through the city again. Now that that's out of the way, this is going to be a completely spoiler-free review, unless you don't want to know about, um, character names. But seriously, the less you know about this movie, the better, so I'm not going to give anything away that wasn't in any of the trailers. In 10 Cloverfield Lane, a woman, Michelle, gets in a car accident and wakes up in an underground bunker. Her captor, Howard claims to have saved her life and that everyone outside the bunker is dead. Another man is also in the bunker, named Emmet, and tensions arise between the three as Howard becomes increasingly suspicious, and Emmet and Michelle mount an escape plan. While Cloverfield, was an intense, in-your-face monster flick, 10 Cloverfield Lane is a completely different beast altogether. Instead of the vast area of New York City, this movie takes place in the confines of a doomsday bunker, so the scares come from paranoia and suspense than a giant monster attacking the city. All three cast members are excellent in their roles, especially John Goodman as Howard. His awesomely creepy performance makes this one of his most memorable roles. Mary Elizabeth Winstead and John Galleger Jr. are incredible as well. You may recognize her as Wendy from Final Destination 3. Winstead's character definitely isn't a damsel in destress here; Michelle is crafty and smart like Nancy from A Nightmare on Elm Street. John Galleger Jr. also provides some witty comic relief while also seeming a bit suspicious himself. 10 Cloverfield Lane is a restrained, suspenseful and well-crafted psychological thriller that calls to mind both Misery and The Twilight Zone, and if this anthology series continues, it'll be hard to match the standards set by this and its predecessor."
    },
    {
      "rating": "10",
      "text": "The film keeps you guessing till the end which is an awesome thing. Great acting all around particularly Mary Elizabeth Winstead! Loved it, highly entertaining!!!"
    },
    {
      "rating": "9",
      "text": "Predictable but very good indeed. Goodman is getting a lot of praise but Mary Elizabeth Winstead was even better. The real star though is the pacing and tension."
    },
    {
      "rating": "8",
      "text": "10 Cloverfield Lane is a smart psychological thriller that has deeper meanings within it. Great cast and a director that did a superb job of keeping you at the edge of your seat. The best movie so far this year."
    },
    {
      "rating": "8",
      "text": "10 Cloverfield Lane is a very well-crafted and intense film, elevated by a fantastic performance from John Goodman. A mix of thriller, sci-fi, horror, and drama, 10 Cloverfield Lane also works in some moments of comedy to lighten an incredibly bleak mood. Director Dan Trachtenberg does a great job here creating tension and letting it build to a very good pay-off. As mentioned, Goodman is phenomenal with an intense and entirely gripping performance that plays very well into the air of mystery the film possesses. Mary Elizabeth Winstead is great here and John Gallagher Jr was also quite good. The film is a very compelling and thought-provoking one, lending itself greatly to further study as to character motivations and what all is really going on throughout the film. Some have criticized the ending, but I really am a fan. I thought it was a thrilling end to a thrilling film. Overall, 10 Cloverfield Lane is a very good film that has some filler and is not perfect by any stretch of the imagination, but it still a good thriller that really gets the gears in the brain turning."
    },
    {
      "rating": "9",
      "text": "I don't even want to go into detail into any scene, just go watch it. Experience this for yourself because it is something significantly special. Expect a claustrophobic thriller packed with a commentary on risk, chance, consequence and conspiracy as well as a smooth, exciting blend with the first. Totally worth your time."
    },
    {
      "rating": "9",
      "text": "10 Cloverfield Lane is barely a sequel to the original Cloverfield story-- and that's what makes it so great. It finds an original story to tell, taking place (with the exception of a couple scenes) in an underground bunker. The acting, screenplay, and effects are all above average, and the movie finds exciting ways to tell the story, including an ambiguous ending, opening up the door for more sequels. It will probably go down as one of the best sci-fi movies of 2016."
    },
    {
      "rating": "8",
      "text": "If you like the flintstones and you likes cloverfield, then this is the movie for you. There isnt any shaky cam for the most part, and the acting is absolutely fantastic, especially from John Goodman. He plays the part of the average Redditor who has planned for the end of the world for the majority of his life. There was not a single moment in the entire film (Other than the abismal ending) that i was not glued to the screen. I was however a little disappointing that the bunker was not further underground. The poster made it seem like the thing was kilometers below the surface, but when i think of it that would have been overkill.\r Over all i rate this film a 7/10. I take one point off for the missing jigsaw piece, one point off for not being able to see them complete the game of monopoly over the 3 years they were down there, and one point off for the alien vagina spaceship that combusted on contact with whiskey. Also i add one point for just being so much better than all the other crap that has come out recently. So actually its an 8/10."
    },
    {
      "rating": "9",
      "text": "Holy Hell this movie was a huge surprise. A lot better then the previous. At first i was a little sceptic but my god was there so much suspense i almost screamed in the theatre because i wanted to know what was gonna happen, and the acting was superb john goodman ur amazing, Stop right now whatever ur doing and go watch this movie"
    },
    {
      "rating": "8",
      "text": "Tenuously connected to 2008’s ‘Cloverfield’ but very much its own film, this is a superbly acted thriller which is edge of the seat stuff. A lot of the drama takes place in a bunker that is sheltering three people from an unknown outside terror which, according to the viewpoint of one of the three- Michelle, may not exist. The actors are great and the claustrophobic feel in the bunker is well utilised enabling the suspense and tension to build effectively. In fact, so good are the scenes within the bunker at questioning the motives of John Goodman's character that one almost forgets to consider whether the terror they are hiding from is real or not. Only when the action moves outside does one immediately guess what the truth of the situation is. The score and the terrific sound effectively jangle the nerves throughout contributing to a very impressive feature film debut by director Dan Trachtenberg. The ending leaves some room for a sequel which, in the event, could be as different from this film as this one is from ‘Cloverfield’."
    },
    {
      "rating": "7",
      "text": "Three quarters of this film are extremely tension filled with some surprises along the way.  The last quarter while interesting leaves me scratching my head in many ways.  Overall this will definitely not be a forgotten film.  B+"
    },
    {
      "rating": "9",
      "text": "Wow! What can I say other than this movie completely exceeded even the highest of my expectations! Being such a huge fan of 2008's Cloverfield, I was certainly intrigued and looking forward to seeing just how much this film would expand upon that film in terms of the storyline or the monster. However, what I got from this film was definitely much more than I expected to get, and in a good way! The story, setting, atmosphere, etc was all so tense and mysterious from start to finish! Even the small, yet highly effective cast kept things plenty entertaining and interesting. Mary Elizabeth WInstead and John Gallagher Jr. both give solid performances, but holy hell brace yourself for John Goodman, who delivers such a menacing and chilling as hell performance, and undoubtedly his most memorable one in a long time! As for the story and its connection to Cloverfield, without giving anything away, the final twenty minutes or so should be enough to satisfy those who were dying to know if it ties in with that film in any way, but it's also effective in the sense that it can make the film stand out on its own really well too. Overall, this not only satisfied my cravings for more Cloverfield, but it also provided  unexpectedly tense and suspenseful entertainment from start to finish!"
    },
    {
      "rating": "8",
      "text": "Shot with a pleasant paradigm shift from the found-footage style that 'Cloverfield' so famously helped popularise, 10 Cloverfield Lane is a powerful but wonderfully strange air-tight narrative about looking life in the face. Its transition from a suspense thriller to a balls to the wall science fiction film shows its subversiveness - and flaunts itself proudly as an experiment - something that so many sequels (spiritual or chronological) dare not do."
    }
  ],
  "recommendations": [
    "bad_times_at_the_el_royale",
    "unbreakable",
    "split",
    "a_quiet_place_part_ii",
    "last_night_in_soho",
    "zodiac",
    "the_call",
    "the_mothman_prophecies",
    "the_next_three_days",
    "the_invisible_man",
    "the_prestige",
    "reminiscence",
    "good_time",
    "the_accountant",
    "shutter_island",
    "us",
    "signs",
    "a_walk_among_the_tombstones",
    "glass",
    "prisoners",
    "terminal",
    "the_others",
    "midnight_special",
    "the_little_things",
    "the_lodge"
  ]
}