{
  "id": 2381,
  "title": "10 Things I Hate About You",
  "starring": [
    "Julia Stiles",
    "Heath Ledger"
  ],
  "runtime": 97,
  "genre": [
    "Comedy",
    "Romance",
    "Drama"
  ],
  "description": "On the first day at his new school, Cameron instantly falls for Bianca, the gorgeous girl of his dreams. The only problem is that Bianca is forbidden to date until her ill-tempered, completely un-dateable older sister Kat goes out, too. In an attempt to solve his problem, Cameron singles out the only guy who could possibly be a match for Kat: a mysterious bad boy with a nasty reputation of his own.",
  "releaseYear": "1999",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/ujERk3aKABXU3NDXOAxEQYTHe9A.jpg",
  "categories": {
    "plot": 7.8125,
    "acting": 7.666666666666667,
    "ending": 7.2,
    "soundtrack": 8.0,
    "cinematography": 5.0,
    "familyFriendly": 6.0,
    "funny": 7.266666666666667,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "10",
      "text": "Relates to children of this era and tells them the story of Taming of the Shrew in a modern world. If Shakespeare was here today he would of approved most probably!"
    },
    {
      "rating": "10",
      "text": "I'm not normally one for Romantic teen movies, but I really enjoyed this movie.The whole cast do a great job, but special praise has to go to Heath Ledger, who sadly is no longer with us. He's great in this movie, as is the rest of the cast.Larisa Oleynik looks absolutely stunning in this movie, and you can see why its a case of love at first site for Cameron."
    },
    {
      "rating": "10",
      "text": "Love the film, but agree with the San Francisco Chronicles review, the charachters change far to much and it just seems to unrealistic. still a great film!"
    },
    {
      "rating": "9",
      "text": "It was funny and not bad for a chick flick, I liked most of the music."
    },
    {
      "rating": "8",
      "text": "What Brings It Up: Simply put, it's funny. What Brings It Down: Like most teen movies, it's kind of a silly plot. Overall, I'm not too fond of the teen genre, but this film sets an example that other ten films should strive to achieve."
    },
    {
      "rating": "9",
      "text": "This film works because the audience are given a group of well rounded characters; many of which are quite likable, which helps. These are then put into a sequence of situations that resolve themselves into a satisfactory conclusion. Of course we are taken on quite a journey before this conclusion and I can see how some may find the plot a little hard to follow. Fortunately I have read the Shakespeare play and even seen it performed and so am familiar with all its twists and turns. I love the way it"
    },
    {
      "rating": "8",
      "text": "Classic teen movie. Who could not love this movie? One of the best ever, with a great cast and an interesting story... (for what it is) Purely enjoyable."
    },
    {
      "rating": "7",
      "text": "I resisted seeing this film for a long time, and to be honest I've no idea why. 10 Things I Hate About You is relatively self-aware for a highschool rom-com, and affectionately pokes fun at some of the genre's most annoying cliches. It also has a wacky comic energy and some hilarious dialogue which is the perfect mix of the bright and verbally dexterous and the very, very crude. There are decent performances across the cast, particularly from the effortlessly natural Julia Stiles and Joseph Gordon-Levitt, and Heath Ledger as a borderline sociopathic rebel-turned-lover-boy. Allison Janney is also brilliant as the entertainingly filthy school counsellor and aspiring erotica writer. It makes a refreshing change for a teenage comedy film to have a believably-aged cast, though the key players were aged 18-20 when the film was made, at least they weren't in their late twenties or early thirties as they sometimes are in Hollywood highschool films. Where the film pleasingly has its own identity for most its run-time, it does disappointingly sink to the level of every other teenage romantic comedy in its final act. At this point it feels a little like screenwriting pair Karen McCullah Lutz and Kirsten Smith ran out of interesting ideas and just delivered all the soppy stuff you come to expect from this kind of film. And though Ledger is delivers a good performance, his accent is all over the place, and this is accounted for with some clumsy exposition about his character spending his early life in Australia. It might have been a little less jarring if Ledger stuck to one dialect or the other. Despite a generic ending and a couple of story elements that don't quite work, 10 Things I Hate About You is a smart, fun, heart-warming and hilarious romantic comedy, and this is coming from someone who doesn't really like romantic comedies."
    },
    {
      "rating": "8",
      "text": "I just really enjoy this movie. It's fun to see some well known actors (Heath Ledger, Julia Stiles, and Joseph-Gordon Levitt) in earlier roles. It's a fun adaptation of the beloved Bill Shakespeare play. A good date movie, because both man and woman can get something out of it."
    },
    {
      "rating": "9",
      "text": "Excellent movie full of great characters.  The late Heath Ledger was very good in this (as well as everything else he did) as was Julia Stiles.  It requires you to not think too much of course, but most good movies are like that, that's what they are for after all."
    },
    {
      "rating": "7",
      "text": "This one is a ton of fun. Heath Ledger and Julia Stiles are really good here and the writing is witty and funny throughout. As far as teen comedies go, 10 Things I Hate About You is a very good one due to its fun story, funny moments, and the way it just feels so high school. This film just feels high school, which works well in its favor, because it gives it an authentic feeling. Thanks to the comedy here, some actually quite powerful moments, and just pure enjoyment one can derive from this one, 10 Things I Hate About You is a success. However, it is not without its shortcomings. For one, plausibility of many things that happen here is up for debate. Based on what I know about high school, some of the stuff depicted here won't happen. For one, non-spoiler here, but you can't just decide to go to prom the night of, you have to pay well in advance for that stuff. Little things like that add up and really throw the whole thing into question. However, the characters do feel real, from Heath Ledger and Julia Stiles' mysterious, often rumored about characters to Joseph Gordon-Levitt's whiny little loser. An interesting twist on the Shakespeare play, 10 Things I Hate About You is a fun high school film that should manage to entertain you and get you to laugh numerous times."
    },
    {
      "rating": "7",
      "text": "If you like movies like \"Mean girls\", \"Freaky Friday\" and etc - you wil definitely enjoy this one! This will remain as one of the classic comedy teenage movies!"
    },
    {
      "rating": "9",
      "text": "Classic teen flick accurately representing the late 90s.  I'm still writing because they said this has to be 150 characters long, so im still writing because apparently i haven't reached that yet."
    },
    {
      "rating": "10",
      "text": "\"10 things I Hate about You\" is a really fun movie.  Good plot, interesting scenery, fun gags.  It definitely feels like it borrows from other films around this era, but it all comes together well.  I give it an A, make a point to go see this movie."
    },
    {
      "rating": "6",
      "text": "classic american high school movie with some good laughs, but not good enough to make this movie very good."
    },
    {
      "rating": "10",
      "text": "This film can be watched in any generation whether it's the 90's or now and it still raises relevant problems for teenagers. It's exactly what all teenagers go through, problems with relationships which will be relevant in any day and age"
    },
    {
      "rating": "7",
      "text": "This is one of my favorite Teen Comedies, it's very wise and great modern day Shakespeare Adaptation. Heath Ledger puts on a charming performance, Stiles And Levitt put on great performances too"
    },
    {
      "rating": "7",
      "text": "10 Things I Hate About You might be the most authentic and humorous hight school movie ever made. It is not so raunchy and not too sweet, they now where to stop. It is really good!"
    },
    {
      "rating": "9",
      "text": "Featuring what is to this day considered one of Julia Stiles finest performances (if not her finest), as well as a remarkably brilliant performance by Heath Ledger, making this teen flick one of the best teen movies to come out of the 90s."
    },
    {
      "rating": "7",
      "text": "I watched this again about a year ago and I still enjoyed the movie.  Laugh out loud moments, and waves of nostalgia for my younger years.\r Heath Ledger was funny and entertaining (and so young!)."
    },
    {
      "rating": "6",
      "text": "WHAT I LIKED: '10 Things I hate about you' is actually a lot of fun because it doesn't take itself too seriously, but still manages to build characters that we can connect to and care about.\rWHAT I DIDN'T LIKE: Striking the balance on that though is always going to be tricky, and thus this film can't get away from just how cringe-worthy it is, but in taking itself less seriously, it ends up fairly story-less\rVERDICT: For what it is it's one hell of an enjoyable ride - even if it doesn't quite hit the right balance between emotional moments, and spoof comedy."
    },
    {
      "rating": "7",
      "text": "Típica película romántica para adolescentes en la secundaria, esta buena  ."
    },
    {
      "rating": "8",
      "text": "10 Things I hate about You is a 1999 American comedy film directed by Gil Junger. The main actresses are Julia Stiles as Katharina “Kat” Stratford and Luisa Oleynik as Bianca the younger of the Stratford sisters.  The main actors are heath Ledger as Patrick Verona and Joseph Gordon-Levitt as Cameron James.  The film was inspired by Shakespeare’s comedy The Taming of the Shrew. The screenwrited hinted at this in the family name of the two protagonists, who are named after William Shakespeare’s hometown Stratford-upon-Avon.The film tells about two sisters, Bianca and Kate, who are very different from each other. In fact while Bianca is very sweet and girly, Kate is determined and rebellious. Their father will only allow Bianca to date boys when her sister Kate goes out with a boy herself. Cameron, a new and nerdy schoolmate, falls in love with Bianca and to go out with her he pays another boy, the tough and mysterious Patrick, to ask Kate out. Will they get engaged in spite of their differences? This film showcases 11 upbeat and lively songs played by bands that are not well known in Italy. The genres are rock and punk. Some actors starring in this movie became famous, like Julia Stiles and  late Heath Ledger. The film is set in the 1990’s and the actors are all good-looking. Especially the male ones who are particularly charming. The best scene of this film is when Bianca gave Joey, a guy she was dating, a punch in the face to avenge both her sister and herself for being such a jerk. Another good scene is when Kate reads out her sonnet in the English Lit. class. Very romantic indeed! The film tells about teenagers and their love life. Its is a good movie to see because it portrays a true-to-life story with some romance and comedy. Although the plot is sometimes a bit granted and cheesy, it is an entertaining movie with a pinch of poetry and some nice gags.It is great for teenagers and “ex” teenagers who want to dream on about the foregone high-school days."
    },
    {
      "rating": "6",
      "text": "A decent rehash of Taming Of The Shrew that repurposes the whole concept as a Okayish romantic teen film. It's one of the better films of the whole early-2000s Shakespeare rehash craze, but it's not especially great."
    },
    {
      "rating": "8",
      "text": "This movie came out when I was going into high school and I really like it back then.  I watched it recently again and everything just works for me."
    },
    {
      "rating": "6",
      "text": "Esta película se puede ver en cualquier generación, ya sea en los 90 o en la actualidad, y aún plantea problemas relevantes para los adolescentes. Es exactamente lo que at"
    },
    {
      "rating": "8",
      "text": "In the opening scene, there is a group of very feminine women in a girly convertible listening to music. The song was very cutesy and playful but as soon as Kat, one of our main characters, drove up next to them in her rusty old car, the music changed to something more aggressive, giving a careless vibe to Kat. She gives the girls an annoyed look just as the music did. This was a great way to begin the film. It gave us an insight to Kat´s personality without actually telling us, which they do later on in the film. Kat is called a ¨difficult woman¨ that many people fear and stay away from but it was much better to show us instead of telling us directly. Especially in the beginning of the film. The plot of the story was different. I´ve never seen any films with a storyline as such. Yes, the story was very entertaining and moving, but I wish there was a greater emphasis on Patrick Verona, played by late actor Heath Ledger, truly falling in love with the difficult woman Kat Stratford. When I first watched the film, I thought he was still doing it for the money but it turned out that he accidentally fell in love. I was confused the first few times watching the film but other than that, the film is great! I still question the name of the film though. I´m not quite sure that was the best title. The script of the film was also great. In my opinion, the best character with the best lines was Cameron James. His crush for Bianca, Kat´s younger sister, was so pure. He was so sincere with his intentions for Bianca. He truly is the ideal man. This dude literally learned french for Bianca. You can't find anyone like that anymore. He was, as gen z would say, down bad. He knew from the moment he saw Bianca, he liked her. He knew her personality and didn´t let other people change his mind, despite there being many rumors about her. He was indeed right about her. There's always that ¨good guys never get the girl¨ trope, but this film defied that from the very beginning, giving out beloved Cameron a shot for the girl early on in the film. This film is totally worth watching. It is my comfort movie. It's funny, a little weird and has awesome characters. I truly recommend it."
    },
    {
      "rating": "9",
      "text": "filme bom, achei engraçado ela ser neutra e no final terminar com o cara assim. mas achei otimo, me deu esperanças."
    },
    {
      "rating": "9",
      "text": "Es de romance, cliché, tiene buen soundtrack, no es empalagosa pero sigue siento de amor y esas cosas"
    }
  ],
  "recommendations": [
    "clueless",
    "17_again",
    "easy_a",
    "me_and_earl_and_the_dying_girl",
    "the_edge_of_seventeen",
    "friends_with_benefits",
    "leap_year",
    "the_duff",
    "the_spectacular_now",
    "sleeping_with_other_people",
    "last_vegas",
    "booksmart",
    "freaky_friday",
    "sisters",
    "how_to_be_single",
    "blockers",
    "no_strings_attached",
    "a_cinderella_story",
    "50_first_dates",
    "stardust",
    "eddie_the_eagle",
    "ghostbusters",
    "the_princess_bride",
    "the_holiday",
    "pitch_perfect"
  ]
}