{"id": 2340, "title": "127 Hours", "starring": ["James Franco", "Amber Tamblyn"], "runtime": 94, "genre": ["Adventure", "Drama", "Thriller"], "description": "The true story of mountain climber Aron Ralston's remarkable adventure to save himself after a fallen boulder crashes on his arm and traps him in an isolated canyon in Utah.", "releaseYear": "2010", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/h0RMdn0rfl9l5hWXz3tUh6QVkhi.jpg", "categories": {"plot": 7.366666666666666, "acting": 8.4, "ending": 7.625, "soundtrack": 7.6, "cinematography": 7.6, "familyFriendly": 3.0, "funny": 6.0, "action": 9.25}, "reviews": [{"rating": "9", "text": "Surely one of the best films of the year, Boyle's effort I believe is a triumphant and revolutionary new take in film of a person that is in complete solitude, an upbeat soundtrack and by blending fear, tension, and humor all into one. I think that probably what is the most moving though is that this film is able to take hold of you and when you're let go in the end; the only thing you can think of is that you are just glad to be alive."}, {"rating": "9", "text": "With bizarre cinematography and a talk show like environment, what Danny Boyle announces to the audience in \"127 Hours\" is not James Franco as the winner (Still, he was cool). He presents to us that, between all those blood, sweat, and urine spilled, its the perseverance of man that claims victory."}, {"rating": "9", "text": "What an inspirational story. I had high hopes for this movie, and it delivered.  Anyone not seeing this film because of the \"money shot\" needs to see it. Yes, it happens and is necessary, but it doesn't dominate the film. It truly puts your trivial daily problems in perspective.  Franco is outstanding, and Danny Boyle delivers yet again."}, {"rating": "10", "text": "In the past 16 years he's made Shallow Grave, Trainspotting, The Beach, 28 Days Later, Millions, Sunshine, Slumdog Millionaire, and now 127 Hours. Danny Boyle is not human, he is the God of Cinema! In my lifetime I thought I would never see another Kubrick, I was wrong. Boyle is Kubrick on speed. I only wish I could be around for his entire career as I was priviledged to be with Kubrick, but to quote Warren Zevon - \"Enjoy every sandwich\"  I will Mr. Boyle, I will."}, {"rating": "9", "text": "Aron Ralston(James Franco) wasn't always a loner, the anomic man we see shouting \"me, the music, and the night\" as he rides toward the Utah mountains, on a bike, all by his lonesome and loving it. Aron's solitary trek to Bluejohn is juxtaposed against shots that depict large masses of people which preceded his frenzied peddling into oblivion. He's running away from something. But what? The free spirit can't hardly wait to leave civilization behind, preferring the outback to the city, and the people who reside there, and possibly, the people who don't reside there anymore. How Aron got to this extremity is a mystery. That's the heart of \"127 Hours\", which is adapted from his 2004 memoir \"A Rock and a Hard Place\". The flashbacks that the film provides calculatingly leaves out the particulars which would account for his solitary ways. Aron is avoiding something painful. The narrative that his reflections form leaves a lot to the imagination. When the self-proclaimed superhero isn't musing over the mother he ignores, interspersed with fantasies about food and drink, and, of course, escape, the suddenly thoughtful man reminisces about the relationship he had carelessly abdicated from. Aron fixates on the moment after sex, not the sex itself, since by all appearances, sex no longer interests him(the two hikers, played by Amber Tamblyn and Kate Mara, go unmolested), but perhaps, intimacy does, in which he remembers a woman's touch at the same time an ant traverses over the same cheek as that fingertip. As Aron brushes off the offending insect, perhaps, the error of his ways(loving nature more than people) finally dawns on him, realizing too late that this love for the outdoors can't be reciprocated. The dismissal of the ant is representational of the way he brushed aside his college girlfriend, who he first locked eyes with, ironically enough, in an area dense with warm bodies, a car crammed full of young libertines, stripping down to nothing with the snow falling just outside their fogged-up windows. Aron's memories are selective ones, but the moviegoer can hazard a guess as to to how this seemingly normal man, so at ease in mixed company, packed like sardines, could end up feeling estranged from the crowd at a basketball game. Aron entered that arena as part of a couple, but he left alone, and presumably, has been single from that moment on. What happened? Although the father is referred to at the outset of \"The King of Comedy\"-inspired interview that Aron conducts with himself, the elder Ralston is, more than likely, dead, since the father figures only in his childhood reflections, and ultimately, gets no final \"I love you\" from the prodigal son during that last entry in his video log. Something changed the trajectory of Aron's life, a galvanizing event that led him to the outback, but the filmmaker shrewdly withholds the particulars behind this fundamental transmutation in the man through omission. Like Scooby-Doo(seen twice in the film), the moviegoer is confronted with a mystery, a solvable one, because the clues provided by Aron's psyche indicates a familial tragedy. Quite pointedly, he tells the girls, \"Can't take off my face,\" like all those Scooby-Doo villains who were unmasked at the end of every episode. They weren't monsters, after all, but Aron is, that's how he feels. When he leaves the two hikers, one of them says, \"I don't think we figured in his day at all,\" and she's probably right. Aron is f*cking the pain away. In a sense, he's f*cking the rock formation. Penetrating the cut, Aron runs his hand across the flat surfaces as if he was caressing skin. All that touching, though, comes back to bite him. Arguably, the boulder that traps his hand can be construed as a metaphor for \"vagina dentata\", the toothed vagina myth. Humiliated by the rock formation's rebuffing of his overtures, Aron gets ready to utilize the free hand on himself as revenge sex against nature, but because he's a gentleman at heart, the spurned lover turns off the video camera, in which a freeze-frame of some prime cleavage would have served as his inspiration. This lust, however, makes him human again. Aron is over the mountain. She's a biter."}, {"rating": "10", "text": "Excellent story.  Beautifully shot.  Great acting by James Franco.  Uplifting theme.   Very, very intense.  The guy the seat next to me passed out from the intensity.  Not for the squeamish."}, {"rating": "7", "text": "This movie should have been a lot better than it is.  The story is interesting and gripping.  What prevents this movie from being great is the screenplay.  The first 30-40 minutes is great and the the last 15-20 minutes is great.  The 20-30 minutes in the middle is the problem.  We should be feeling more scared and claustrophobic than we are.  We shouldn't be distracted by a \"game show\" sequence that is so phony and contrived that it kind of ruins the mood.  But, it is not long and starts and finishes well.  It just could have been much better."}, {"rating": "10", "text": "Surreal movie with a nearly flawless performance by Franco.  The magic of the book was captured in gripping detail.  Inspiring and beautiful to watch.  Really no negative criticisms.  Simply divine."}, {"rating": "9", "text": "Visually compelling with a stunning acting performance by Franco. He plays an average American, a outdoor jock, self absorbed, funny, foolish, smart, passionate, young, and yes heroic. it is a raw story but done glossy, moving, dramatic, and tastefully gory. A risky gut wrenching  scene that well scare away the faint of heart, pity though., Finally, one powerfully emotional ending that soared."}, {"rating": "9", "text": "Danny Boyle's filmmaking skills turn a relatively static situation into dynamic cinema. This film is based on the true story of Aron Ralston (played by James Franco), who was hiking alone in Utah, when his arm got trapped under a bolder. To keep it involving, his attempts to free himself are intercut with his survival efforts, flashes of imagination, and even humor. The exceptional editing and Franco's compelling performance solidify the effect. The self-amputation scene isn't so harrowing that it should keep you away."}, {"rating": "9", "text": "In the end, Boyle and Franco create a masterpiece. â"}, {"rating": "10", "text": "What a true inspiring movie based on the mountain climber named Aron Ralston (played by James Franco), witch is arm got trapped by a fallen bolder in an isolated canyon in Utah. The next days, he goes throw misery will trying to escape, also reviewing his life and express his deep feeling to his love ones by filming himself. Wow, I gotta say, this is one outstanding movie ! All the emotions and expressions are so realistic and true, even the story itself. You don't need millions of effects to make a good movie. '' 127 Hours '' proves it. An Oscar worthy right here, thanks to the performance of James Franco. It's also well written and directed of course. Definitely a must see !"}, {"rating": "9", "text": "Not too many movies have moved me quite like this one. This film mainly deals with the psychological roller coaster that Aron Ralston was forced to ride and not necessarily on actual escape. It forces you to examine how you might handle this horrific experience, which can be quite disturbing as there are really no good options. Careful if you have a weak stomach. Many in the theater were taking a break outside the door, ghost white and sweaty."}, {"rating": "9", "text": "Incredible story. Incredible performance. Franco is automatically an Oscar contender, if not winner, with this one. A testimony to the human spirit and will to survive. Glad we saw it at the theater."}, {"rating": "9", "text": "This is a really good movie and the movie and James Franco deserve nominations. It's beautifully shot and captures the full experience. This is a hard movie to sit through in some parts and the \"cutting off of the arm\" scene doesn't help. My only problem is that this movie is based on a man who did an unbelievably stupid thing and it was a freak accident. This is a bit of a problem because even though he made it out alive the movie portrays him as more af a hero. This isn't entirely bad, but this is just my take on it. Still, go see the movie. You won't regret it."}, {"rating": "10", "text": "I like to judge movies based on how long after the credits I am still thinking about the film. I saw this nearly two weeks ago and I still cannot wait to see it again. Danny Boyle really pulls out all the stops for this one as a fusion of style and story that make the film far more entertaining than it should be. You may know the ending before you see it, but you have know idea of the journey that will take you there."}, {"rating": "9", "text": "Ask yourself before going into this film, am I prepare to watch a guy cutting off his arm (slowly), am I prepare to see James Franco face throughout the entire film? Well, if you're not, see it anyways. Directed by Danny Boyle and starring James Franco, 127 Hours is really another masterpiece after Boyle's Slumdog Millionare. With flashy images and colors, Danny Boyle's style is showing up more in his films. 127 Hours is about a guy cutting off his arm. That is the plot, basic and simple. Aron Ralston is a hardcore biker who loves to climb and one day, just as you predicts, he got trapped. Being stuck in between a rock for 5 days with limited food, little water, no heat, and no restroom can really change a person's point of view. Seeing how he survives the five days feels like I'm watching a camping film. But 127 Hours is more than that, it has this hidden feeling that you feel bad for this guy. With his charming personality, James Franco was able to portray Aron Ralston accurately. This guy was really funny throughout the film even though he had to cut off his own hand. But whenever the movie focuses on how Aron survives, it becomes a movie about survival. This film is strictly about the art of cutting one's hand. 127 Hours gathers all the style of Danny Boyle and put it all together. And with James Franco playing the lead, it couldn't have been better."}, {"rating": "7", "text": "Danny Boyle is back, with another inspirational flick filled with charming directorial tricks. However, unlike his other recent films, he finally gives us a fleshed out character whose struggles we actually care about. Because of this, I believe it's fair to say that 127 Hours is the best Danny Boyle film of the last ten years, and one of the best films of 2010."}, {"rating": "9", "text": "127 Hours is a film that defines connection. The message is similar to that of Into the Wild, Sean Penn's masterpiece, but this film has Danny Boyle and more importantly James Franco's amazing touch added on it. The editing, the style, are both beautifully attached to overarching story. The use of flashback although with minimal images was brilliantly played out and brought everything together. This movie is a must see, there are very few films that I have seen this year that I would say that for as well. James Franco's portrayal of Aron is enough to go see this movie. The last 10 minutes are some of the most epic and was unbelievably well done. My overall view is GO SEE THIS MOVIE, there aren't very many comparable out right now like this."}, {"rating": "6", "text": "127 Hours is a fine film. That said, once you've seen it there is nothing to really draw you back. I enjoyed the respectable performance from James Franco and Danny Boyle's sharp directing. And that tendon tweaking scene... OOooowwwwww!"}, {"rating": "9", "text": "My waiting to see this film started when i heard it mentioned on a podcast i listen to. Straight away i was in. I must of watched the trailer one hundred times, it was like music to me. I was a big fan of buried so i pretty much knew i would like this film as well. James Franco is always a fave of mine and he did pretty much everything right in this movie. I found it sum what surprising that slumdog millionaire was called the feel good movie of the year to me this was a million  times more feel good than Boyles previous film ever was. It made me appreciate life. Like Buried i got choked up a bit but unlike buried i was cheering at the end knowing he was finally free."}, {"rating": "9", "text": "Combining Danny Boyle's inspired directing with a stand-out performance from James Franco, \"127 Hours\" is a harrowing, heartfelt but uplifting experience."}, {"rating": "10", "text": "This is a deeply moving film. It is one of those films that can change your life when you watch it, and that my friends, it what makes a movie truely great."}, {"rating": "8", "text": "Wow. Such a mind-blowing movie. The quality of the screenplay was really good. Almost like HD-like-movie. I thought the movie flows beautifully... From how detailed what Aron saw, felt and experienced. It is almost like a real documentary show, but amazingly, turned out to be a dramatical movie. Like what Boyle described this movie; \"an action movie with a guy who can't move.\" = precisely correct. I loved how accurate & genuine James Franco's acting was. I love how the scenes are beautifully taken. Definitely reflect nature's beauty. The climax part - where he amputated his arm was unimaginely painful, but portrayed very well by Franco. Very good film. Kudos to the whole team esp. Danny Boyle & James one-man-star Franco"}, {"rating": "10", "text": "Of course it's violent and shocking, but it's also personal, beautiful, relatable, and above all inspiring. It is a movie for the weak of heart, but strong of stomach"}, {"rating": "8", "text": "I have enjoyed Danny Boyle's work, though I found myself let down by Sunshine, so naturally I was all for seeing 127 Hours. I thought it was excellent and very interestingly done. I think the movie could have been a tad longer, but that in mind, 127 Hours is a superb-looking movie, definitely one of the best-looking and impressive movies of 2010 in my eyes. I just loved the wonderful cinematography and landscapes and also the kinetic editing and visual effects. The story is compelling and well paced, beautifully put together by well staged and thoughtfully thought out flashbacks and hallucinations. The music is fitting and dynamic, the conclusion is harrowing and I think heart-wrenching and a lot of effort is taken into making the audience empathise with Ralston. Other than the technical aspects, what really stood out about 127 Hours was Boyle's superb direction, it is wonderfully tight throughout, and the mesmerising tour-de-force that is James Franco's lead performance. All in all, excellent. 8/10 Bethany Cox"}, {"rating": "10", "text": "RyanGee and many reviewers have pinpointed the reason this film will be so successful and a contender for the Oscars. Add equal parts of Danny Boyle's energetic concept, cinematography, editing and Rahman's music, stir and splash in a hefty portion of James Franco's incredible acting chops. I consider this to be part of the upper tier of 2010's top 10."}, {"rating": "8", "text": "127 Hours is a horrific yet uplifting film that depicts the fragility of the \"one-man army\" mindset of human and how the possession of valiance can overcome personal flaws. Coming from an award winning Slumdog Millionaire, director Danny Boyle returns with a film based on the true story of Aron Ralston, a mountain climber who was forced to amputate his arm after his arm had been trapped by a boulder. Portrayed by James Franco, the film recreates Ralston's \"127 hours\" of isolation and how he was able to survive by expressing self-control and personal motivation. Danny Boyle's film, in my opinion, surpasses his somewhat overrated Slumdog Millionaire, due to the fact that Boyle tried to break limits without losing the reality of the story, something that was flawed in his previous effort. But drawing from the success of his Slumdog, Boyle uses the same brilliant style of cinematography within this film. This aspect of the film provides a modern essence to the film and adds a fast-pace to an otherwise lengthy story. Comparisons set aside, 127 Hours is a brilliant film that can stand alone from its directorial background. The build-up of pressure and suspense essentially drives the film. At first glance, 127 Hours's task to create an interesting experience from a single setting and character would seem too daunting. But Boyle is able to set the momentum through flashblacks and personal insights; but because of the restrained limit of the story, the engagement of the film experiences its own monotonous flaws. The film relies on pressure, and that is formed by the audience's connection with Franco and the urgency of the character's fate. James Franco's (who turned down a role in Inception for this film) character is practically the sole individual of the film, yet he makes no mistakes. Franco is able to integrate a subtle breakdown while able to suffice restraint, creating emotion that the audience attaches itself to. 127 Hours is an outstanding film that is emotional up to its final conclusion. The final scene is one of the more memorable scenes I have seen this year, as it is a rupture of sentiment that is built up by the whole film. Even though at times it has its moments of repetitiveness, Boyle's film is one of this decade's landmark due to the fact that it was able to create an emotional roller coaster from an one-angled story. Grade: A"}, {"rating": "6", "text": "This is a well made movie given the limits of the story. Unfortunately, this is not a story that really interested me. My rating is biased by that. Boyle is a great director and I applaud his work. The film did spark a heated theological debate between the three of us who saw it. The Christian among us thought that God saved him. The Buddhist among us thought that his misfortune was caused by his lack of connection or respect for nature. The agnostic who is yours truly thought that God did not have anything to do with the boulder falling on him or his cutting off his arm. I saw it as a random event."}, {"rating": "10", "text": "After seeing this film I was impressed by how James Franco captivated my interest and even made me cry. Is not easy watching a film in which is there is only one person, accompanied by flashbacks and illusions. But I have to say it was brutally amazing. How the tension, desperation, and sadness reflects on one person thinking he is going to die for shore and the end is spectacular, I really couldn't expect more of it. This is definitely one of the best movies I have ever seen."}, {"rating": "0", "text": "A waste of time - reading a five line storyline is just as rewarding as seeing this film. Sure, it's a true and painful story, but you don't have to give high scores out of sympathy for a guy stupid enough to get himself into that situation. And, there's no higher meaning to this film/story and no fundamental truth to be learned. There's even not enough beautiful scenery to make it worthwhile."}, {"rating": "3", "text": "I didn't like this movie. Honestly it is pretty much boring. The acting is good but it is totally wasted here. There are only a few parts were it gets interesting and then after a few minutes it gets boring again. i don't know why this movie has positive reviews."}, {"rating": "5", "text": "This was pretty interesting bio-pic!!! I couldn't image going through something like this!!! Even though this film felt a little \"Hollywood\" in spots, it still was great story. Also a great performance by James Franco."}, {"rating": "1", "text": "I feel so sorry for James Franco being stuck with such horrible direction.  I felt like I was seeing a 60s movie with the sepia tones over the flashbacks.  How ridiculous.  The shot through the bottom of the water bottle was so trite (and also a little disgusting).  I guess it was hard to make a movie about stupid guy getting caught in bad situation because of his own stupidity but a director might have made a difference.  The movie is horrible and a waste of money."}, {"rating": "0", "text": "Guy is roaming around canyons. Meets 2 chicks randomly and establishes himself as a bad ass by being a quirky but funny and amusing wackjob. They invite him to a party later. Oh how bad ass you are, canyon-biker-adventurer guy. Guy randomly taking pictures of things. Guy jumps down dangerous crevice for no reason, and immediately gets arm jammed. Rest of movie is guy yelling about his arm jammed, and trying to get his arm unstuck. Memories, nightmare and premonitions as filler in between his trying to get his arm unstuck. Pretty much a lot of the same stuff you see from survival adventure movies/books. Reminds me of the \"stuck in mt everest\" survival stories, but much more boring. A lot of it relies on shock and gore. People who have lurked the internets for too long will not find this interesting."}, {"rating": "3", "text": "I don't usually go to movies where I know the ending unless I have read the book and the book was great.  This is a interesting story with a message.  The message however was blurred for me by what seem to be overreaching attempts to be creative.  The crowded hustle and bustle flashes were out of place and could have been done much better to fit the film.  Instead they are just a distraction.  James Franco is very good in his role as Aron Ralston which is fortunate for the filmmaker because  he's really the only character in the film."}, {"rating": "10", "text": "Althought this film mainly sustains itself by the editor's work, James Franco delivers the performance of a lifetime. Finally Boyle's versatility has paid off."}, {"rating": "0", "text": "go to work and stop climbing rocks like a baby! immature guy!go to work and stop climbing rocks like a baby! immature guy!go to work and stop climbing rocks like a baby! immature guy!"}, {"rating": "10", "text": "One of the best films I have ever seen. If you didnt like it its because you didnt get it, and because you are completely retarded. Knowing the premise of the film gives you absolutely no idea as to what this film is actually about."}, {"rating": "0", "text": "After watching the first 15 minutes, during which not one meaningful word or sentence had been uttered, but which nauseated me because of the horrible fast-switch editing (it felt like a commercial for Nike), I fast forwarded because everything was just so extremely predictable and boring. In addition, in the first 5 minutes of the movie, there are at least 20 brand names clearly visible. That is usually not done, unless you get paid for it the brands.\rI cannot believe that this flick was nominated for an Oscar...how low can you go ?"}, {"rating": "10", "text": "127 Hours is a fantastically flawless film. Director Danny Boyle has brought us from the zombie infested streets of London to the slum-filled streets of Mumbai, combining stellar acting and outstanding stories to create a unique experience with each. With 127 Hours, he uses those same aspects but in turn creates an absolutely cherishable film that manages to stick with you long after the first viewing. The plot involves the true story of Aron Ralston (James Franco) who, while hiking solo in the deserts of Utah, managed to find his way into a crevice where his arm became pinned against a rock wall by a large boulder. 5 days after the incident, he manages to finally amputate his arm with a dull knife and tries to find a way to escape the hellish conditions of the desert. During that 5 day period, Aron manages to scramble through his bad past memories with his father, mother, sister, and his girlfriend and he tries to figure out what problems occurred with each of them, and if he was able to fix them at the time. He also tries to stay alive as best as possible through various events that test his remaining strength. The climax which is both shocking and upsetting, truly resembles what a man would put himself through in order to survive the inevitable. The finished product is so relentlessly breathtaking that you're literally at a loss of words when the credits roll by. Danny Boyle's directing is top-notch that include scenes of the beautiful Utahan deserts to the jaw dropping visuals of the graphic amputation scene that combines itself with ear piercing music that signifies that pain and agony of the whole act. Boyle makes it feel as if the audience is also trapped with Ralston, helping him fight as a means of survival and feeling each emotion he experiences. The film takes the majority of its time in the crevice with the boulder, but it releases the tension of the aspect by showing the flashbacks with Ralston's loved ones, which are actually always welcomed to help steer away from the incoming doom that Ralston will likely have to face. James Franco is simply phenomenal. Never have I ever witnessed an actor portray a character as broken, emotional, and as hurt as James Franco has. His flawless and beautiful performance is definitely Oscar worthy, if that. The story flows quickly and steadily, never jumping ahead or back at a pace that's difficult to follow. Its climax is a hard one to come by and you'll be able to tell of Ralston's coming doom as he takes his first steps into the deep crevice. 127 Hours is a incredibly flawless film. Its location is beautiful to the occasion of Ralston's predicament, ironically. Its directing is superb with its lingering camera angles and fast paced cuts. Finally, James Franco's performance is indeed one for the books and you'll become more and more attached to the character of Aron Ralston over time. 127 Hours is a beautifully written and beautifully shot film that pushes the limits and delivers one tour de force that's unlikely to be forgotten."}, {"rating": "5", "text": "A simple one line movie. I only enjoyed the last 5 min of it thats where the juice is rest the movie is as straight as a line, no twist totally predictable. I guess this is not the sort of work that on expects from such a distinctive director. From my perspective wasting your time just to watch the 70 min of the movie which only contain a person trying to free himself is not that attractive. In one word..    Boring"}, {"rating": "1", "text": "The thing about Aaron Ralston is - thereâ"}, {"rating": "3", "text": "This feels like a long Music Video. The could be much more focus on storytelling and skip the creative play with new camera functions. There was so much more potential to tell a great adventure story with lots of \"real\" flashbacks as well some more information about the rescue at work. Movies like these should also not be afraid to provide a much longer epilogue to give perspective to the events and the life of a nut case."}, {"rating": "0", "text": "Not  a single negative review by critics? Looks so strange to me.None even acquainted with the story by Jack London \"Love of life\"?.Ok Ok everybody just doing his job-critics,producers and  movie goers.The bottom line?I am sorry for all aforementioned ..and actors as well.."}, {"rating": "0", "text": "Is it watchable? No. Plot: Super-duper idiot steps on loose boulder wedged between canyon. Falls down. Nothing happens for 1.5 hours apart from him doing stupid stuff like drinking all his water instantly. Looks at knife. Knife is blunt. Checks again 1 second later. Is sharp as can be. Cuts arm off (takes suprisingly long.). Puts wound in bag which he urinated in. Runs off. Helicopter spawns out of nowhere to whisk him off. The end! Review: it sucks badly."}, {"rating": "2", "text": "Insanely dull, highly linear storyline (if there's even a storyline) that gives no surprise - i knew how it was going to end right at the start of the incident...  And the protagonist claims he's an engineer in front of a real engineer that is me? With his various stupid, un-engineering acts?  C'mon, a very very bad move.  To invoke empathy & ****  With its ****ty, 'incoherent' rock music soundtrack? i dun think so..."}, {"rating": "10", "text": "127 Hours is one of the best drama film I've seen in years! I really can't say much probably because there's so much to tell but I will say that you may want to prepare yourself into a very graphical scene during the film."}, {"rating": "3", "text": "What a shame. After such a glorious win for Danny Boyle for Slumdog, this is unfortunately a piece of trash. I give credit where credit is due though. The directing style was different, and it was an unusual story from the rest of Hollywood crap. However, in the end it did nothing for me. James Franco was annoying and mediocre at best. It was dreadful to watch and the second time I saw it was worse."}, {"rating": "7", "text": "127 Hours 7/10........................................................................................................................................"}], "recommendations": ["the_grey", "no_country_for_old_men", "you_were_never_really_here", "the_rover", "first_man", "a_history_of_violence", "everest", "the_walk", "good_time", "hugo", "enemy", "the_perfect_storm", "the_american", "in_the_heart_of_the_sea", "hereafter", "a_ghost_story", "the_place_beyond_the_pines", "bad_times_at_the_el_royale", "the_good_shepherd", "the_beguiled", "the_power_of_the_dog", "dunkirk", "the_finest_hours", "the_master", "interstellar"]}