{"id": 2817, "title": "12 Angry Men", "starring": ["Martin Balsam", "John Fiedler"], "runtime": 97, "genre": ["Drama"], "description": "The defense and the prosecution have rested and the jury is filing into the jury room to decide if a young Spanish-American is guilty or innocent of murdering his father. What begins as an open and shut case soon becomes a mini-drama of each of the jurors' prejudices and preconceptions about the trial, the accused, and each other.", "releaseYear": "1957", "mpaaRating": "NR", "imageUrl": "https://image.tmdb.org/t/p/w500/ppd84D2i9W8jXmsyInGyihiSyqz.jpg", "categories": {"plot": 9.666666666666666, "acting": 9.742857142857142, "ending": 10.0, "soundtrack": 5.0, "cinematography": 10.0, "familyFriendly": 4.0, "funny": 10.0, "action": 10.0}, "reviews": [{"rating": "10", "text": "The power of movie dialogue really makes this movie a true classic.The story to 12 Angry Men is one man on a jury stands alone in a case in which most are initially convinced one way but one by one may be convinced another way.12 men in one room just talking about one murder case and them sharing they opinions if the person that may have committed murder is guilty or not, now many things here could have went wrong, you got to have the best writer, the best director and the best actors to make this movie work and it payed off so well and I think this is cinema's greatest risk of doing something new with the story, giving it a twist and a edge and 12 Angry Men paid off brilliantly.The acting from every singe actor in this movie all do realistic, believable, funny and serious performance's and they all add a lot of weight and drama to their character's. I wish I can bring up every single actors name in this cast but I'm not since these 12 of them and it's going to take up the all page and I can't talk about every singe actor and go into detail about them one at a time, but I can say that everyone in the movie did a flawless work of acting that's pure Oscar worthy and the kind of drama acting they should show kids in drama school. Nicely done fellas.Sidney Lumet directed this movie and this has to be some of the best directing I've seen from this guy. He really added a lot to this movie when it came to story and characters and the back and forward they have with each other and it worked by his direction.The characters in the movie (The Twelve Angry Men) don't really like each that much as in every scene they at each other's throat trying to confidence the other men in the room that the man is guilty for murder while that person and the other's bring up some really solid points that this man is guilty or not guilty for murder. As a viewer myself I got really interested in the case and trying to think if he's guilty or not, so this movie does a fantastic job of giving the viewer a opinion on the case and see if you think he did it or not.For problems with the movie: I don't have any.Overall 12 Angry Men is such a classic movie with excellent performances from everyone, the writing outstanding and the directing was some of the best. You haven't seen 12 Angry Men then I say go see it, it's worth your time."}, {"rating": "10", "text": "Despite the fact that ‘12 Angry Men’ was produced near 60 years ago, the messages it conveys is very much relevant to today’s world and society. It gives a lot of food for thought regarding issues of prejudice and is a prime example as to how a negotiation should and should not be done. My main take away from this film would be the importance of keeping an open mind when approaching people and issues. We need to be constantly be aware of our own personal bias and think critically, never taking things at face value. Through this process, we can then be more enlightened and make wiser decisions and opinions."}, {"rating": "9", "text": "A movie with a great message. A film that every movie lover is obliged to see."}, {"rating": "10", "text": "This film is, without any doubt, a masterpiece and one of the best films of all time. It is undoubtedly a must-see movie."}, {"rating": "10", "text": "12 Angry men is one of the best works of American cinema. With its story that represents an accurate picture of what being on a jury can be like. It engages audiences with its murder mystery plot making every line of dialogue of somewhat importance to unraveling the truth about the mystery."}, {"rating": "8", "text": "Can a movie about 12 angry men in 1 room for more than an hour be any good? Yes. Yes it can. \"12 Angry Men\" is a really cool movie that has lots of moments that made me say \"Ahhhaaa!\". The characters are really interesting and entertaining throughout, and some are really likable/hate-able, in a good way. I was interested for the whole movie, that alone makes it worthy of a few points."}, {"rating": "10", "text": "Phenomenal movie. The story, the development, the emotions. Camera angles are brilliant. I watched this movie several times. If you want to watch a great movie, watch this one. It's not in color and it does not matter."}, {"rating": "10", "text": "This classic court movie gave me enormous suspence and thrill. What a masterpiece!"}, {"rating": "10", "text": "Intense courtroom drama which has 12 very different people, all males, struggling with a murder case involving a young Puerto Rican boy that seems cut-and-dried. However, juror Henry Fonda does not believe it to be as sure-fire as it appears. He votes not guilty and what follows is a chain of events that will test the views, beliefs and thoughts of the other 11 members. Fonda is great, but Lee J. Cobb steals every scene (and that is not easy to do in a film like this). Ed Begley, Martin Balsam, Jack Warden, Jack Klugman, Joseph Sweeney, E.G. Marshall and John Fiedler are among the other individuals caught in a situation that is much more difficult than it appears on the surface. An excellent character-study that should be studied and embraced by all present and future film-makers."}, {"rating": "10", "text": "I am a small business owner with more than 60 employees and this movie is part of our company orientation meaning that each new hire is required to watch this movie and discuss with this colleagues. It defines our company DNA: never accept the majority opinion without your own input, always defend your point and never give in. Truly a masterpiece."}, {"rating": "10", "text": "One if the greatest movie ever made,  Sidney Lumet’s debut holds good even today, This Movie is a Perfect example of how to use limited resources - Space and use camera, lighting, framing and editing."}, {"rating": "9", "text": "Fantastic Movie ."}, {"rating": "10", "text": "Sidney Lumet's use of styled realism, the tension that builds up from different personalities, and cracking dialogue make \"12 Angry Men\" a perfect masterpiece that is contemporary in any age."}, {"rating": "10", "text": "The story is flawless in every way possible. The acting is pretty good. The editing is pretty good. The character-development is spectacular. Nothing bad to say about it. It's the only non-documentary movie I would give a 10/10."}, {"rating": "10", "text": "My score 100Metascore / User score 96 / 94Tomatometer / Audience score 100 / 97IMDB 89(96)"}, {"rating": "10", "text": "12 Angry Men is perhaps the best chamber film I've watched. A real diamond of American cinema. Now they are no longer filming, and they are unlikely to be able to. 1 room and 12 people who are just talking. What can be called more boring in the cinema than conversation? And in its simplicity, linearity and realism, there is a feeling that this is not even a film, but just a video shooting of what is happening. Magnificent cinema, the brightest example of art."}, {"rating": "9", "text": "Example that less is more, 12 Angry Men is ridden by only a scenario, 12 characters and a killing script, giving a show of dynamism in few resources."}, {"rating": "10", "text": "12 men seated in a room discussing whether or not a man should be judged for is crimes. A movie that completely revolves around the characters and ideas rather than anything else. I adored this movie simply because it is a movie that appears to be so simplistic and yet is able to convey a deeper message than any other. The elaborate discussion of right vs wrong, justice vs. injustice, and the ability of humanity to deliver doubt. A personal favorite simply because it was able to keep me entertained while doing so little."}, {"rating": "10", "text": "Best movie ever ever ever ever ever made!!!! Period!!!!If you don't like this film, not only you have no taste at all, but you have no idea about cinema. A masterpiece!!"}, {"rating": "10", "text": "12 Angry Men illustrates the difficult process of arriving at a common consensus when 12 jurors were tasked to evaluate the innocence of an 18-year-old boy accused of first-degree murder. This movie, though stylistically simple due to the lack of scene changes, manages to provide an engaging watch by interweaving the intricacies involved in negotiations. Several techniques were reflected in the film, namely separating people from the problem, distinguishing positions and interests, and the importance of using objective criteria to invent and evaluate options. Definitely worth a watch."}, {"rating": "10", "text": "Best movie of it's kind ever.  The actors? Amazing. The story? Amazing.  Watch it, now."}, {"rating": "10", "text": "12 angry men did a great job representing the different characteristics and personalities that were involved in that room. It showed how hostile a jury can be even when evidence may seem so true, every angle must be examined. I loved how some of the jury members would actually get so angry to the point that they would end up committing a murder! Throughout the entire movie you were just on your seat for what shocking new evidence or a point of view would change the minds of each jury member. It was funny to think it was 11 against 1 and that 1 man voiced his opinion so well that the rest of the group was able to change their stubborn results. If you have an opinion speak it! It could potentially save a life!"}, {"rating": "8", "text": "12 men in one room deciding the fate of another. What should be a boring movie is really a brilliant one. With an excellent script, The cast does a fantastic job selling their characters and the turmoil each one goes through as they ultimately find their way to the truth."}, {"rating": "10", "text": "This is the master class of film making, acting and directing.  On the surface it is about 12 jurors that are counseling about a verdict in a murder case. On the inside it is as much about the jurors themselves, justice, life philosophies, psychology, group dynamics and responsibility. The whole movie takes place in just one room. There are no distractions and each misstep would hurt this movie badly. This is the ultimate strength of this movie. There are no mistakes, out of character moments, bad dialogues, wasted scenes or other errors. The cast and the acting is so close to perfection as possible. Each juror delivers his role in such a genuine way that I cant find a single flaw in this movie. If I praise the actors I must also praise the director Sidney Lumet. He should definitely have gotten more Oscars in his career (He made many great movies).  I want also to mentioned that I first watched this movie when I was 12 or 13 years old just by zapping trough the channels. This was something that shouldn't work at this age. I stopped zapping and started to watch this movie with fascination. As I got older it got even better as I did understand many things more with my additional life experience. Overall this is a timeless classic that is deservedly highly praised and should be watched by everyone at least once."}, {"rating": "9", "text": "Intense but I think I liked it. At this point just watch it so you don't feel left out...."}, {"rating": "10", "text": "\"IT'S JUST 12 MEN IN A ROOM FOR AN HOUR AND A HALF! BORING! 0/10!\" This is why people love this movie haha. It is 12 different men with different outlooks on life being isolated in a confined space having to use the English language as a mean to compromise and persuade one another during a murder investigation for 90 minutes. Yes. Yet it's one of the most riveting movies I've ever seen, few movies have had me this invested. Seeing our main character, played brilliantly by Henry Fonda, at the start of the movie being completely alone voting against the execution one by one convincing the 11 other men to vote the same as him is an experience I think everyone should experience. During the final act I lost count of how many times I said \"This **** guy\" out loud. A very solid movie choice for a first black and white experience. Brilliant, just brilliant."}, {"rating": "10", "text": "Uma obra magnifica, com um dos roteiros mais poderosos da história do cinema. Este tipo de obra nos mostra que não é necessário nada em abundância para que se possa produzir um bom filme. É necessário apenas muito.. muito talento."}, {"rating": "9", "text": "This is a timeless classic. Stunning performace by the cast. For a low budget movie this is a suprising piece of entertainment."}, {"rating": "9", "text": "The movie was a bit predictable, but the execution was so Damn good! Especially The ending! 9,5/10"}, {"rating": "9", "text": "A very good movie with very few resources, the best directors are those who do more with less and that's why Sidney Lumet was a genius of cinema."}, {"rating": "8", "text": "‘12 Angry Men’ does not use names and could be set anywhere. Each character represents the different characters in society and its deeply-rooted flaws. Hence, it paints a bigger picture of constitutional inequality and susceptibility to manipulation within the American judicial system that all countries can relate to, including Singapore. Hence, this movie serves as a poignant warning that everyone has a social responsibility to respect the judicial system as a platform to protect individual rights, regardless of background."}, {"rating": "10", "text": "A Pure masterclass Piece of cinema!Not even a single sec i felt it was shot in the single room with just arguments It's really gripping.Every single sec makes us feel We are going in a way Making the judgement of not guilty! Ending explains the all when two different perspectives people are eager to make there point!It's really a Classic!"}, {"rating": "10", "text": "96 minutes, 12 men, in a room. But nobody said that it is boring film. Sidney Lumet is genius artist. I fund it when I saw Find me Guilty and I believe it surly when I saw 12 Angry men."}, {"rating": "10", "text": "Exceptional utilization of symbolism, intentional framing, and cinematography to highlight the subtle but significant reaction of each juror's exchange. For a show that was created a long time ago, it is still able to teach valuable and relevant lessons to its viewers. ‘Prejudice always obscures the truth’. To uncover more than what meets the eye, the movie brought us on a journey from the start point of a seemingly undeniable crime, to the end point of feelings being opposite from the surface decision. What seemed to be an undeniable murder on the surface convinced 11 out of the 12 jurors to vote ‘guilty’, with juror 8’s vote of ‘not guilty’ causing an uproar that started the process of negotiation in an attempt to understand as much as possible before making a decision."}, {"rating": "8", "text": "The movie is great because it's just 12 guys arguing about whether someone is guilty or not and it's very interesting."}, {"rating": "10", "text": "عالی پیشنهاد میکنم حتما ببینید شاهکار اور هنری"}, {"rating": "9", "text": "Utterly spectacular film.It is about responsibility to all of us.Film tells us how it is bad to be apolitical ."}, {"rating": "10", "text": "12 angry men is basically a courtroom drama with diverse characters, brilliant screenplay, and a tight script-making it a flawless thrillride.The movie is about 12 people trying to decide whether a boy is guilty or not. It ultimately teaches us about the value of human life.It is perfect movie for me - a movie without any flows ."}, {"rating": "9", "text": "it seems cool,very informative and protesting drama.i have ever seen like that before"}, {"rating": "10", "text": "I gave it a watch and oh boy. This movie is captivating from start to finish and in my opinion is perfectly cast.The movie is set in one room for the whole duration, but because of the depth of dialogue and the constant need for the characters to convince each other - your imagination runs wild. You create the scenes and are brought along for the ride without seeing anything. It's like they found a perfect way of making a film, play out like a book.There's one scene, towards the end where one character, whose been stubborn all the way through is starting to be really bigoted and crass. Each character slowly stands up and faces away from him, whilst he's ranting on...he's eventually left on his own, symbolising the whole groups shift in emotion.  powerful."}, {"rating": "10", "text": "Um dos meus filmes favoritos de todos os tempos! Uma obra simples, que consegue contar uma história muito fascinante e bem escrita, além de contar com excelentes atuações e uma incrível direção. Um filme completamente atemporal."}, {"rating": "7", "text": "It's impossible to make a more entertaining movie with 12 men shouting to each other in a room for 97 minutes."}, {"rating": "10", "text": "Best directorial debut in history! Sidney Lumet has certainly directed one of the greatest films in cinema history with the script and screenplay made to perfection by Reginald Rose. A stellar and perfectly picked cast with Henry Fonda leading the line. A film very unlucky not to win best any Oscars but another great film in Bridge on the River Kwai just piping it however, I do think that 12 angry men should have won best writing over Bridge on the River Kwai however it still a complete classic which deserves all the praise in the world. What makes this film so good is that it is so compelling and edge of the seat action of a different sense to an action film. A film that continuously makes you think. A real classic and an extremely breathtaking film"}, {"rating": "10", "text": "bom demais, faz pensar sobre a ingenuidade do julgamento humano, pifio e falho"}, {"rating": "10", "text": "In what is arguably one of the greatest films ever made, Henry Fonda gives what is possibly the finest performance of his career."}, {"rating": "9", "text": "12 Distinctive Characters all played perfectly, predictable plotting but effective directing."}, {"rating": "10", "text": "Classic and timeless movie with a very intelligent plot about the US court system and great dialogues. The characters are well written, also the acting is on a high level."}, {"rating": "10", "text": "There are a few wonderful courtroom dramas out there, Anatomy of a Murder, To Kill a Mockingbird and Witness for the Prosecution immediately springing to mind. 12 Angry Men is so brilliant, it could very well be the definitive courtroom drama on film. Sidney Lumet's direction is masterly, and although the action takes place on one set(an actual New York drawing room) there are a huge variety of innovative camera angles and visual set-ups. The screenplay is sophisticated and smart, and the story is compelling and intelligent. The film is also brilliantly made, and the acting is superb. Henry Fonda especially dominates the film, with an integrity that makes his character so wonderful, but the other actors are wonderful as well, Ed Begley, Jack Warden, John Fiedler, Lee J Cobb, Rudy Bond et al. are all impeccable support to Fonda. Overall, brilliant courtroom drama. 10/10 Bethany Cox"}, {"rating": "10", "text": "From theater to cinema, and from there to eternity. There is not a single monotonous or boring element in this closed-door, small-space drama; all the time we are aware of what would be -and why- of the final verdict. A film that is like a good wine: the older it is, the better."}, {"rating": "2", "text": "Pour un film de Sidney Lumet, c’est étonnamment regardable. Il faut dire que le réalisateur de somnifères s’est limité à une heure et demi, ce qui est déjà conséquent pour un tel huis-clos procédurier. Ici, on ne suit pas le procès mais on refait le procès en coulisses et on s’engueule… et surtout on assiste à un numéro de manipulation magistral !Pensez donc, un homme seul retourne les 11 autres comme des crèpes ! au nom bien sûr de la lutte (finale) contre l’affreuse peine capitale et parce que cet homme seul est un bisounours à faire mourir de honte Jésus et potentiellement un communiste refoulé : on ne voit pas d’autre explication.Car les faits sont tout de même patents et ressassés, puis balayés au fur et à mesure par des interprétations sujettes à caution et particulièrement discutables. Il aurait fallu une affaire bien plus ambigüe pour rétablir la balance et partant, le doute.Ici, on a l’impression fort désagréable de s’être fait manipuler pendant une heure et demi : tout était écrit d’avance et les faits s’y sont pliés bien gentiment, ne nous laissant qu’une illusion de rebondissements qui n’en sont pas. Non, on avale pas de telles couleuvres : récusez ce film en définitive bien merdique qui se fout de notre gueule !"}], "recommendations": ["spotlight", "the_good_shepherd", "the_social_network", "the_master", "hotel_rwanda", "no_country_for_old_men", "perfume_the_story_of_a_murderer", "joker", "the_big_short", "crash", "manchester_by_the_sea", "hereafter", "revolutionary_road", "the_last_duel", "hidden_figures", "fight_club", "argo", "blood_diamond", "the_last_king_of_scotland", "roma", "just_mercy", "american_history_x", "nocturnal_animals", "cloud_atlas", "risen"]}