{
  "id": 3018,
  "title": "12 Mighty Orphans",
  "starring": [
    "Luke Wilson",
    "Vinessa Shaw"
  ],
  "runtime": 118,
  "genre": [
    "History",
    "Drama",
    "Action"
  ],
  "description": "Haunted by his mysterious past, a devoted high school football coach leads a scrawny team of orphans to the state championship during the Great Depression and inspires a broken nation along the way.",
  "releaseYear": "2021",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/aIY2QF211NLB1AOjZPFImusCLI1.jpg",
  "categories": {
    "plot": 8.75,
    "acting": 10.0,
    "ending": 1.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 6.0,
    "funny": 5.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "6",
      "text": "A sweet, old school family movie. It was so much fun to hiss @ \"Newman\" every time he did something really bad onscreen. Very well edited. You have to cheer for the underdogs in this movie."
    },
    {
      "rating": "10",
      "text": "Inspirational on all levels for overcoming life circumstances and trauma involving war, loss of parent/s, death of dreams, abuse mental and physical, violence, poverty, lack of opportunity, substance abuse.  The creation of community and the importance of education and character and winning through values and perseverance in the 1930s true story setting — I am going for a 3rd time and I am not one to watch movies repeatedly."
    },
    {
      "rating": "10",
      "text": "Great feel good movie! Coach Rusty Russell and his wife Juanita were an inspirational Christian couple that changed literally thousands of children's lives during their time on Earth!"
    },
    {
      "rating": "5",
      "text": "If you've ever seen movies about a sport, its players overcoming adversities, and of course their mentor, then you've already seen this."
    },
    {
      "rating": "1",
      "text": "12,000 mighty cliches. Martin Sheen is terrific, Luke Wilson OK, Wayne Knight bad (some of that is the writing and dull direction). I doubt even the Cartoon Network would hire Lane Garrison after his \"performance.\" The kids give the most honest and real performances... especially Jake Austin Walker, his scene in the barn towards the end is powerful and genuine - he steals this movie... but watch it on Lifetime when they play it."
    },
    {
      "rating": "5",
      "text": "I wanted to like it, but it is predictable, sappy, and formulaic. Think Hoosiers but with orphan playing football, then add melodrama and overly processed sentimentality. The last half of the movie seemed better than the first, or it could be that my expectations dropped or I became immune to the nostalgic dialogue. The villains are predictable. The antagonist has an oddly modern haircut. One extra had distractingly white teeth. However, the real life stories in the credits are interesting."
    },
    {
      "rating": "10",
      "text": "I’m not much of a movie goer but was enticed by family to entertain the thought.  Best movie I’ve seen in years!  It made me laugh, cry and feel all sorts of emotions that movies used to make u feel !  I’m saying the cast was awesome, the storyline superb, and the production and direction made the “feelings” come alive!  I loved it!  Kudos to u ALL!  I do hope it goes far !"
    },
    {
      "rating": "6",
      "text": "Kto lubi dramaty sportowe,temu się spodoba.. osobiście polecam, film godny uwagi i tego aby przed nim zasiąść."
    }
  ],
  "recommendations": [
    "silver_linings_playbook",
    "manchester_by_the_sea",
    "wonder",
    "captain_fantastic",
    "3_idiots",
    "instant_family",
    "fatherhood",
    "midnight_sun",
    "christopher_robin",
    "me_before_you",
    "the_spectacular_now",
    "collateral_beauty",
    "fighting_with_my_family",
    "the_perks_of_being_a_wallflower",
    "the_fault_in_our_stars",
    "the_glass_castle",
    "the_descendants",
    "if_i_stay",
    "the_king_of_staten_island",
    "gifted",
    "good_will_hunting",
    "the_big_sick",
    "the_kid_who_would_be_king",
    "lovelace",
    "the_curious_case_of_benjamin_button"
  ]
}