{"id": 2055, "title": "12 Strong", "starring": ["Chris Hemsworth", "Michael Shannon"], "runtime": 130, "genre": ["War", "Drama", "Action", "History"], "description": "A team of special forces head into Afghanistan in the aftermath of the September 11th attacks in an attempt to dismantle the Taliban.", "releaseYear": "2018", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/j18021qCeRi3yUBtqd2UFj1c0RQ.jpg", "categories": {"plot": 6.5, "acting": 6.52, "ending": 5.0, "soundtrack": 9.5, "cinematography": 7.0, "familyFriendly": 3.0, "funny": 7.6, "action": 6.451612903225806}, "reviews": [{"rating": "7", "text": "I must say I had low expectations about this film, and yes it has a few minor cheese moments, but over all I have to say I liked it. It's was actually very entertaining, how can you not find fighters on horse back calling in air strikes from B-52s, attacking tanks, and rocket launchers kind of cool. Lots of great action scenes and a good story. Well worth the price of admission."}, {"rating": "7", "text": "If you like military historicals, then this is fine. I had two problems to note: the first is that they've got Rob Riggle (better known for comedic roles) playing the serious role of Col. Bowers. If he's trying to break into action/drama, fine, but this wasn't the film to do that, IMHO. Second, a film of 2 hrs doesn't do justice to material like this. This story should be a mini-series at least. There's a LOT going on in the month following 9/11 and squeezing into 2 hrs gives important events short shrift. Outside of those two things, the film was decent enough, full of good ole American bravado which may have been over-dramatized but whatever, it's entertaining and educational enough."}, {"rating": "6", "text": "Overall a fairly good movie about the early days of the US War in Afghanistan. The action is the best part of 12 Strong, and every actor playing a member of the 595 gets a chance to shine. The first half of the movie meanders and doesn't quite know where to go, but at the halfway point, and hour in to the movie, the pieces start to fall into place. Worth a watch if you like feel-good war/action movies."}, {"rating": "7", "text": "The execution is great here. We learn about these people, their personalities, and throughout the movie, see them evolve. The action scenes are done really well. There are many battle scenes and the camerawork puts you right into the action. It's exciting and makes you really respect these soldiers. They rode on horseback against tanks and other high-end weapons, not to mention that they were often outnumbered. My only issues with this movie is that the pacing is a little uneven in areas, dialogue was hard to hear at times due to somewhat subpar sound mixing, and in general this movie doesn't stand out much from other war movies. Mind you though, these are only minor issues. 12 Strong is a mostly good war movie with good acting, fantastic action, and a story that makes you really respect these men."}, {"rating": "7", "text": "With countless movies about the tragedy that left America in shock and anger, 12 Strong follows a different story than most with the first attacking line against Osama Bin Laden. The A list cast consisting of Chris Hemsworth, Michael Shannon, And Michael Pena along with others add a good and familiar face to this gritty war drama. Everyone giving good performances across the board even the minor characters and generic soldiers shown throughout the movie as well. The overall story is clear cut and set up within the first 20 minutes and holds strongly throughout. With some Cliches scattered throughout the film that could be clouded over since it is based off of true events. Some of the scenes did feel discriminating with its depictions of americans and the towns and locations throughout. Shockingly there weren’t that many action/war as shown in the trailers and promotions for the film but the biggest battle is definitely the most intense with it’s feeling of threat and danger most for our cast. But the big battle did have continuity errors throughout with recycled shots of headshots, missile firing and people coming in and out of cover shooting. Overall the movie did well with it’s first time director and seeing Hemsworth get back into the uniform and Pena to be himself with his comical side that gave the audience a breath of fresh air in between tense scenes. The movie did pull of tension a lot better than most war movies especially ones that have come out in the past decade possibly and it’s non-complicated story made it fun and interesting to allow the story to be driven mainly by the characters after the introduction."}, {"rating": "7", "text": "Horsies galloping.  Guns shooting.  Pew-pew-pew!  Bombs falling - kshhh!  Bang!  Barooom!  Grizzled warlords talking, hard-bitten wise talk but we not care at all about that.  Grizzled warriors fighting, bad guys all in black.  That's how we know they bad guys, all black clothes.  More horsies!  Rockets firing off like in Star Wars - ksshh! kshhh!  BAM!  Well anyhow... it was entertaining.  That's all I ask of any film."}, {"rating": "7", "text": "This movie was a glorified american army covert operation which was dramatized due to the Hollywood effect. But despite this it was a good movie with really good acting even in the more tension full scenes and the emotional ones to. The directing style and the way the scenes where shot was decent as well. The only thing that was average was the writing of the whole movie and the character development. All 11 other soldiers where just some faces in the first half of the movie, because there was no immersion creating scene with them, or no screen time what so ever in order for the viewers to connect with the characters. The visuals though where rather good looking and pretty realistic too. There is also a life lesson hidden in there somewhere in the shallow plot of the movie, which is disguised with honor. Overall it is a good movie but barely making it as one."}, {"rating": "7", "text": "Awesome performances from all the cast; Hemsworth had a great chemistry maybe with every actor in the movie, Peña every joke he delivered hit the mark, But it's Navid Negahban as General Dostum who is the scene stealer for me, such a good actor and a very attractive character.There are a lot of very strong moments that really surprised me, but unfortunately not all of them are edited well which shift the tone pf the movie here and there.Good and intense action set pieces and extremely beautiful cinematography.The major issue I have is the dialogue; it's very very very clichéd and corny specially when it comes to the dramatic dialogue that almost ruined the whole first act, but also after that there are many well-worn rude jokes and cheesy soldiers' talk that I couldn't bear.Also, the antagonist lacks depth; a couple of scenes to show that it's a ruthless character aren't enough to make it a compelling and strong one.(7/10)"}, {"rating": "9", "text": "A solid movie presenting historical truth in an actually entertaining manner. Extremely worth watching as the subject matter is more relevant today than it's ever been.I was pleasantly surprised by Chris Hemsworth's performance, I've never been a fan of his until seeing him in this movie, this being said, a few of the secondary characters and most extras give pretty weak performances and while I wouldn't say they had any comically bad scenes, I did feel let down by how some parts were played.If you're watching this because you want a war movie full of explosions and rambo shooting everyone then this one isn't for you, the action scenes are much more grounded than in most action movies and the pressure in them feels more genuine. You won't enjoy this movie much if you're the kind of person who pretends to be an ostrich and sticks his head in the sand pretending the real world doesn't exist, but if you're a realist you'll love this movie."}, {"rating": "10", "text": "A FASCINATING STORY SET UPON THE EVENTS OF THE FIRST MEN OF THE ARMY GREEN BERETS TO FIGHT BACK AFTER THE ATTACKS OF 9/11, WHICH WE NOW KNOW ISRAEL COMMITTED. NONETHELESS, THE STORY OF HEROISM, HONOR, AND TRUTH IS ONE TO REMEMBER. DEALING DEATH TO ENEMIES CONSISTING OF WAHHABI AND SHARIA COMPLIANT TERRORISTS THAT BEAT WOMEN AND RAPE CHILDREN. DON'T LISTEN TO THE LIBTARDS WITH THESE BAD REVIEWS. DO YOURSELF A FAVOR AND WATCH THIS. YOU WONT REGRET THE FILM ABOUT THE HONORABLE SERVICEMEN AND WOMEN THAT SPEARHEADED THE DEFENSE OF OUR NATION AFTER THE LARGEST ATTACK ON U.S. SOIL.THOSE DISLIKING THE FILM ARE HONETLY COMMUNISTS STILL LIVING IN MOMMIES BASEMENT."}, {"rating": "5", "text": "One of the 1st major missions after the 9/11 attack involved a Special Forces team sent to Afghanistan to strike a blow at the Taliban. Chris Hemsworth plays their captain, an inexperienced soldier who not only has to lead this dangerous expedition, but has to do it on horses! Even though this little-known operation makes for a fascinating story, the production is follows pretty standard war movie tropes; There are personal insights into several soldiers, a few sweet moments with locals and insights from a Northern Alliance general. Then there's lots of battle footage, most of it noisy and dusty without much clear focus on the action or creative staging of the stunts. An adequately made film, but without much to make it special."}, {"rating": "5", "text": "Pretty much the only movie where we finally get to see the aftermath of the infamous attacks done in September 2001. Actually based on a true story called Horse Soldiers, which is completely non-fictional by the way, and I hate to say that because, in my sense nowadays, I see it as a common cliché with hardly any twists put to it, 12 Strong remains strong but eventually fails to come up with plan B just in case plan A flops which most likely here it does somewhere around the middle of the film. For history purposes, I see it as a very great film. For other purposes, however, I see it as a disappointment to keep up with moviegoers alike."}, {"rating": "7", "text": "It's clearly not the best war movie ever made, but it's such an incredible true story that you feel pumped up and inspired leaving the theater.  If that's the feeling you're looking for, you'll get it here."}, {"rating": "8", "text": "\"12 Strong\" is a perfectly respectable work of its genre.  It dramatizes and helps Americans to understand the actual conditions under which 21st Century soldiers must operate in the brutal terrain of Afghanistan and the peculiar juxtaposition of the modern and the ancient that pervades every encounter with both combatants and innocent citizens.  It is full of f-bombs.  Apparently military people of all ranks and backgrounds routinely punctuate their sentences with mindless obscenities, even when they are nowhere near the heat of battle.  I suspect critics, who tend to be mincing metrosexuals who would struggle to pass the physical to get into the military, tend to devalue such movies because seeing \"12 Strong\" might actually evoke feelings of patriotism or pride among audience members.  The movie is well worth seeing, if only for its historical value."}, {"rating": "9", "text": "one of the best movies i have ever seen and one of the most heroic acts by the US MILITARY...."}, {"rating": "9", "text": "This was a great war movie. This is not Oscar bait or a politicized hit piece. 12 Strong stays on focus and tells the story as was, not the ones the critics wanted it to be."}, {"rating": "4", "text": "This is a very standard war movie and follows the usually Hollywood formula for American films of this nature. Based on a true story so can't fault them for the subject matter but it was presented in a way that felt quite flat and dry. I understand why Chris Hemsworth was cast in the lead role, to ride on the back of his popularity in the Marvel movies, but unfortunately, he's just not a good enough actor to be able to hold his own here. Particularly alongside some very talented cast members like Michael Shannon and Michael Pena. I'm sure he gave the role his best effort which is commendable, but I don't think he can carry off this kind of character, not currently anyway. He just wasn't believable. The VFX were pretty seamless, there are many action sequences, and I thought it was all very well done. The whole movie is set in a desert location in the middle east so get used to seeing sand and not much else. Overall, it's worth seeing to find out more about the true story behind it, but as a film, I didn't find it particularly entertaining."}, {"rating": "5", "text": "Do we really need more movies about the US Military? Even with the good cast, this film isn't actually telling you something more engaging or thrilling. I mean the poor depth of this one kills it, you can actually go and watch it but you'll forget about it in a couple of hours."}, {"rating": "3", "text": "Pretty over the top, and felt Chris Hemsworth overshadows the entire film. Weak character development as well."}, {"rating": "2", "text": "Not at all the best war film I've seen. For a film based on a true story. . . it felt like the work of pure fiction. Very inauthentic, and felt as though this film doesn't respect the real story. Very Michael Bayish."}, {"rating": "6", "text": "If you want to watch a good, action-filled war movie, 12 Strong is definitely worth your time.  It's not anything that is going to make you think, or win any Oscars but the action/gunfighting was thrilling, and it is a great story of 12 Americans who overcame some pretty tough situations to help us respond to 9/11.  I don't know enough about the actual story to say if this movie stayed true to the real life events but some of it definitely seemed a little unrealistic.  Overall i enjoyed myself watching it though."}, {"rating": "6", "text": "This movie would be great if, it was released in the 1980's....... I couldn't believe what was happening when at the end of the film the Afghani warlord looks at super trooper Chris Hemsworth from across the battlefield places his hand on his heart to show Chris he now fights with his heart only to be replicated by Chris."}, {"rating": "3", "text": "If the movie was based on fictional events and it was not pure American propaganda it could have been a pretty good movie."}, {"rating": "9", "text": "One of those feel-good true-life movies where everyone that goes to war comes home safe and happy just in time for Christmas. Throw a shrimp on the barbie and throw this dvd in of “12 Strong” and enjoy yourself a day of happy endings. “12 Strong” is definitely a good name for the movie, it was definitely not “12 Weak.” In fact there was nothing weak about the movie. The 12 brave soldiers kicked butt! From Special Effects explosions to the setting of the tone of the film with the soundtrack it really delivered an experience of ‘heroism’. I can understand why there is a monument made for these soldiers that stands at the bottom of the World Trade Center to let terrorists know that a man truly can kick a lot of ass, and return home on his horse victorious. Chris Hemsworth did an excellent job."}, {"rating": "10", "text": "Great movie. Saw it 3x. Action packed from beginning to end. This movie should be at least 85 % positive here. Ratings here absolutely not realistic. It was well done. You see how difficult it is to pull things together there. Highly recommend!! If you like hero and action with great music score and so on...then see it.It is a dangerous mission and believable and anyone who states it is over the top in how they treat women then they do not know much. The scene in this movie was more merciful then what they normally would do. There was even more harsh scenes which was not included I am sure. We need  more real men like this not those who sit behind a computer to criticize and state there is too much of this macho stuff. There are not enough men like this and we need more not less. This was our first blow back for the killings of Americans on 9/11 and it was good."}, {"rating": "7", "text": "Soooo, the 12 Strong movie.Did the director add a black guy to the movie not to be racist or to make more revenue?I say this because at the end of the movie they showed a picture of all of them and there was not 1 black guy.This director lost all credibility in future movies."}, {"rating": "9", "text": "An epic story of bravery and courage that changed America forever, 12 Strong will probably go down as a cult-classic war film. The action is intense and awesome, the characters are interesting, and the story has a motivating and touching message of courage and heart. It's a story that must be witnessed after being hidden then revealed all these years."}, {"rating": "1", "text": "12 STRONG ALL WRONGI find it inconceivable that Hollywood pumps out such classic one sided US imperialist cliches after setting such high water marks like Apocalypse Now and Full Metal Jacket.Please, it is propaganda at best, cinematic fantasy at worst, that 12 elite men take on the might of the Northern Taliban Warlords in Afghanistan immediately after 9:11 disaster. ALL RETURN with fleshy scratches. 'Tis akin to Monty Python's 'just a scratch' Knight.Why revert to the John Wayne macho, gunslinger cult hero Capt Hemsworth to create a mythical scenario, albeit historical, which tumbles in a free fall to boring predictable outcomes and rewriting the events with a Stars n Stripes bias of \"here to set the world aright \" with the world's most powerful strategic bombing from 23 kilometres above.Ironically the climax sees Capt Marvel riding as one of the Four Horsemen of the Apocalypse through the jaws of innumerable tanks, mobile machine gunners, rocket launchers etc to take out two Russian Rocket launches.!!It was as anticlimactic as Donald Trump' s presidency... I am asked to believe this happened. PURE HOLLYWOOD AND FAKE HISTORY @realTrump.What is this unquenchable appetite for US rewriting of clear humiliations like Vietnam and Afghanistan into mythical sideshows of unkillable heroes who prefer death before dishonour. The dialogue is over burdened with extreme patriotism and only occasionally emits a ray of light that shows the forgotten Truth \" Afghanistan is a graveyard for would be world conquerors!\". The most moving and truthful part of the movie was the wall with Russian graffiti of the 10 years of wasted lives and futility experienced in the 80's. This made the whole premise of this movie smack of the Unreality of Designated Survivor series which purports to show how Hollywood could lead America back to Greatness. This displaced world leader can only make movies about the past because it has no present glories to celebrate. My problem is that it can't tell the truth anymore so much as romanticised myths. Put it on the pile of forgettable!"}, {"rating": "10", "text": "amazing movie about bravery and courage + action is epic and fire fights are good. Once again do not listen to the so called pro-reviewers... they are mostly lef*ies who have zero respect to soldiers and war heroes... anyway amazing movie"}, {"rating": "0", "text": "A live action, \"Team America.\" I found myself rolling my eyes so hard at all the *America, phuck yeah* cliches, they almost became permanently lodged in the back of my skull.  Two hours of my life I'll never get back.  Time would have been better spent scratching my balls and sniffing my fingers.  You'll find yourself rooting for the terrorists! 0/10"}, {"rating": "0", "text": "Had a nice start. I hoped for a Vietnam style anti-war movie. where they admit how useless this war was from the beginning. But no. Its Rambo 3 Refurbished Edition.Its completely unrealistic and they show pretty much the same battle 4 times in the movie.What really angered me is the fact that they make this operation against Al Qaeda out to be such a heroic task but then forget to mention that the USA today supports Al Qaeda in Syria. All these American deaths were for absolutely nothing. Just like in Vietnam. After Vietnam, as many years later as we are away from the first day in Afghanistan today, America understood what a war they started back then. It pushed out Vietnam movies that were almost all great. They drove tears into peoples eyes, made them swear \"never again\". And now look at us now. Look at the propaganda movies we do, look at the media and Hollywood helping keeping these wars alive. \"Afghanistan was justified! We still need to stay there! You were all heroes! Assad is next!\".Soldiers in Afghanistan and Iraq died for nothing and are still killing themselves at home. Nothing. And now we are funding the people who they fought against, just because they are against Assad and Russia.Unbelievable. This movie is part of the problem."}, {"rating": "5", "text": "Not too bad an action piece for a first time feature film director, 12 Strong largely portrays historical events in a dramatic and unrealistic fashion with boring dialogue and adequate action scenes."}, {"rating": "4", "text": "Although I enjoyed the story, I did not care for this film.  Other than Michael Shannon, the casting was terrible.  Hemsworth was a terrible choice, he just didn't portray a soldier to me. Pena was worse,  he certainly doesn't have the body for an elite soldier and his lines were horrendous. I did like the battle scenes with the horses, but this movie falls way short on my war movie list."}, {"rating": "6", "text": "12 Strong was a January release directed by Nicolai Fuglsig and written by Peter Craig (The Town) and Ted Tally (The Silence of the Lambs). It follows Captain Mitch Nelson (Chris Hemsworth) and his team as they embark on an operation to respond to the 9/11 attacks by taking down Taliban strongholds. 12 Strong is a mediocre film. The action is entertaining and intense, but it is largely contained in the second half of the film which is by far the stronger half. The first half moves a bit too slow and it's pretty obvious that at least 10 minutes of this film could have been cut and the first half would have felt less...bad? I guess. The entire first half is an attempt to make you care about the American soldiers, but it never succeeds and this is probably the film's biggest problem. The characters never fully develop, and I never felt super invested in any of the team's members. The stakes also never felt very high, but I will admit that accomplishing that in a film based on a true story is never easy. Like I said before, the action is the best part of this film, but it still doesn't completely save this film as a lot of the combat is too unrealistic. American special forces are good, absolutely, but they don't kill enemies with every shot they take. Chris Hemsworth's character could probably start shooting while laying on his back with his eyes closed and he'd still hit every enemy he aimed at. And while that's cool and badass, it is unrealistic to a level where it took me out of the film at times. So, yeah, the action is entertaining, but it isn't as good as some other films in this genre (like 13 Hours). I was also somewhat disappointed with the script considering who wrote it. It's not terrible, but with two accomplished writers behind it I definitely expected more. Overall, I think this is a film that may be worth seeing as a matinee if you are bored or just want to see a military movie, but otherwise I'd wait until it hits one of the streaming services."}, {"rating": "3", "text": "Did this movie based on true story ,? I won’t buy it  . I got questions, 1- mountains tactics were wrong ( **** have been fighting for 40 years)2- if you care about kids why you let them fighting with you) 3- Horses fighters always have a back up horse ( this has been over 3000 years tactic when they created the arrows (they say (kill the horse) 3- thousands of bullts didnt kill the horses ? 4- the opponents fighter have their war rules ( no surrender  no give up no escape ) if they didn’t have these things why until  now are fighting ...the .last thing  if you have helicopters.. Why you didn’t use it like Black Hawk or Abatshi ... why you didnt back your 12 men and deploy more men ...."}, {"rating": "5", "text": "Visually extremely impressive but full of cliches and stilted acting. Overlong also."}, {"rating": "7", "text": "A better than expected modern war film..as the commercials made it seem it would be the same kindof dumb patriotic fare that most US war films suffer from. It does have a little of that, but less than I expected, as it actually does show the afghan side of the conflict and spends considerable time developing the afghan leaders character, which was probably the strength of the film.  Pretty solid modern war film, and better than I thought it would be."}, {"rating": "8", "text": "Good movie, based on a true story. It seemed very real and was unexpectedly good."}, {"rating": "7", "text": "12 Strong is a slightly above average action movie made just a little bit better because it is based on a true story.Nothing really stands out, but it is a story that needed to be told"}, {"rating": "6", "text": "\"12 Strong\" was a good movie with a real inspiring story and never told, the characters were good although their interpretations left a lot to be desired, in addition photography is very good."}, {"rating": "6", "text": "This is a strange one. While the movie is action packed it managed to come off as one of the most generic war/combat movies of 2018 and possibly the entire 2010s. That's not a hight I think they were setting their sights on as it is based on the actual clandestine events that started the United State's fight in Afghanistan right after the attack on the towers in New York. As action packed as it is a lot of the time you can't make heads or tails of what is happening in some of the battle sequences. Not too sure who is shooting at who, but Americans are in the mix. You could argue that only adds to the \"realism\" of what it's like to be in war, but here it just ends up messy and leaves the film makers looking a bit amateurish. There are real world counter parts to the characters in the film and I'm just not sure that the movie serves them as well as they did their country, but it's great that they declassified this mission so that we have a visual of what was at stake nearly 20 years ago. I did enjoy it for the most part as there are several comedic actors who's performances were great here. I recommend it."}, {"rating": "1", "text": "This movie is falling straight into some unrealistic rubbish as soon as the first shot falls behind enemy lines. Team-America patriotic garbage that hold no sense at all. How can a team of 12 men (lead by Hemsworth who can't really act for **** backed with a group of arab-allies take out a battalion of Taliban soldiers with tanks, rockets and heavy machine guns on horseback? Pretty unrealistic in a sense that they fire their assault rifles from horseback and hit most baddies they see. Even Rambo was cooler than this. Im lost for words. Much better to watch Black Hawk Down once more.. Now that is some intense stuff.Predictable, over-heroic and bad written trash."}, {"rating": "8", "text": "Really strong war film.  I really like war films and this one had me on the edge of my seat a view times.  Also its just a great story based on true life events."}, {"rating": "9", "text": "Phim rất xúc động, nói về 12 chiến binh người Mỹ âm thầm tiến vào vùng nội chiến của Afghanistan để dẹp loạn để giảm thương vong tối đa. Họ đã hỗ trợ một đội quân để tiến lên ngôi vương của quốc gia, họ là 12 người lính tiên phong và phải đối chọi 2 đội quân rất hùng mạnh, tuy 12 người lính của chúng ta có máy bay thả bom để đối chọi với các đội quân đó cũng như có sự giúp đỡ của một đội quân họ yểm trợ ở trong cuộc nội chiến đó nhưng những mâu thuẫn giữa hai bên cũng như khó khăn về mặt địa lý, về mặt thông tin nên máy bay thả bom không phải lúc nào cũng có mặt. Nhưng cuối cùng bằng niềm tin, lòng quả cảm và bản lĩnh của những người lính họ đã hoàn thành nhiệm vụ mà không mất một ai. Được biết dù lập đại công nhưng họ không được tuyên dương trước người dân nhưng sau này họ được dựng tượng, một bức tượng một người lính cưỡi ngựa cầm súng chiến đấu."}, {"rating": "6", "text": "Needed more to be become real , and also the languages were not clear . But good job , i'm not anyones fan but movie is as enough as director could direct."}, {"rating": "8", "text": "The movie starts off a little slow but definitely picks big at certain parts and I really enjoyed it. The action and visuals look great and the acting is awesome."}, {"rating": "1", "text": "the movies is really violent. and it akes it rather annoying. does not show millitary"}], "recommendations": ["red_tails", "13_hours_the_secret_soldiers_of_benghazi", "lone_survivor", "midway", "greyhound", "black_hawk_down", "the_outpost", "the_hurt_locker", "fury", "lord_of_war", "captain_america_civil_war", "jarhead", "pearl_harbor", "anthropoid", "the_1517_to_paris", "the_kingdom", "battle_los_angeles", "green_zone", "deepwater_horizon", "valkyrie", "equilibrium", "london_has_fallen", "dunkirk", "hostiles", "the_eagle"]}