{
  "id": 2102,
  "title": "13 Going on 30",
  "starring": [
    "Jennifer Garner",
    "Mark Ruffalo"
  ],
  "runtime": 98,
  "genre": [
    "Comedy",
    "Fantasy",
    "Romance"
  ],
  "description": "After total humiliation at her thirteenth birthday party, Jenna Rink wants to just hide until she's thirty. With a little magic, her wish is granted, but it turns out that being thirty isn't as always as awesome as she thought it would be!",
  "releaseYear": "2004",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/iNZdSIfhSCMtRILDNyhLn8UKeSG.jpg",
  "categories": {
    "plot": 6.0,
    "acting": 5.3,
    "ending": 2.0,
    "soundtrack": 2.0,
    "cinematography": 5.0,
    "familyFriendly": 5.333333333333333,
    "funny": 8.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "7",
      "text": "Magic that can, unfortunately, only happen at the movies. Fortunate for 13 Going on 30, it hits all of the high notes. Jennifer Garner and Mark Ruffalo, in an early role, are perfect together."
    },
    {
      "rating": "5",
      "text": "Not bad, I guess. Nothing special. This super annoying exaggeratedly depicted with unbelievable clothing, hair and make up. Just no. Jennifer Garner on the other hand is so beautiful that it's a pleasure to watch her. That's all. Beautiful message, but not for this movie gender I suppose."
    },
    {
      "rating": "8",
      "text": ",,,,,,,,,,,,,,,,,,,,,,........@#$%-\":;!?,.()*&&:_€=/÷×+▪○●□■☆⊙°•¤《》♤♡◇♧¡¿[]{}●□•°▪°●■•●●□■■••"
    },
    {
      "rating": "10",
      "text": "♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤°°°°°°°°°°°°°°°°°°°°°°°°°°°°°:;:;:;:;:;:;:;:;:;:;:;:;:;:"
    },
    {
      "rating": "10",
      "text": "This was one of the first comedies that made me realize comedies were becoming something more than just laugh machines. I think a skewed sense of time is irrelevant when you are in the genre of fantasy, which this is. The morals that it presents but does not shove down your throat are impeccable and everyone would live happier lives if they listened to the message in this movie. It is never too late to be a better person and choose quality over quantity."
    },
    {
      "rating": "8",
      "text": "We all had at least one of those moments during our horridly awkward adolescent years where we wished we could just fast-forward to the part where things finally got good. In our fantasies we had survived puberty, landed our dream job and maybe, just maybe, had that someone special in our lives. It appears that so many of us have had these fantasies that film producers feed off of this notion by producing movies like 1988's \"Big\" or 2003's \"Freaky Friday\". Although it's based on a similar premise 13 Going On 30 depicts this fairly unoriginal concept in a refreshing and highly entertaining manner.\rJenna Rink, played by the ever-charming Jennifer Garner, is fed-up with living the cumbersome life of a teenager. Her only wish for her thirteenth birthday is to be \"thirty, flirty and thriving\". What she fails to realize is that the wishing dust her childhood best friend Matty gave her for her thirteenth-birthday will grant that very wish. Young Jenna is catapulted seventeen years into her future landing in the striking, business executive body of her thirty-year old self. Now that Jenna has the world at her fingertips she realizes she got everything she ever desired popularity, style and boobs. But why on earth is adult Matty no longer speaking to her? It turns out being an adult isn't all it's cracked up to be.\rWhile Jenna struggles to navigate her way through adulthood to find a way to get back to her teen life director Gary Winick lends his expertise to the film's success. He has mastered the art of balancing the sincere scenes between Jenna and Matty with the witty light-hearted moments. One minute the pair will be reminiscing about their high school days when everything went sour and the next they're sharing Razzles on the swing set.\rGranted, there are most definitely some cheesy moments but it wouldn't be a feel-good romantic comedy without them. What makes up for those cheese-worthy moments is the seamless acting of Jennifer Garner and  Mark Ruffalo. Ruffalo fills the Converse shoes of adult Matty effortlessly. He's undaunted by the task of dancing along to \"Thriller\" with his equally as comical co-star Garner as they attempt to liven up a disastrous office party for Jenna's magazine company, despite his flushed cheeks hinting otherwise.  I don't think Matty could have resisted Jenna even if she didn't have such a delightful giggle with the occasional, somehow charming, snort. Garner's charm continues to liven up the film as she replays the heart-pounding details of her kissing endeavor to a group of thirteen year old girls who are eager for mature Jenna's wisdom.\rUnfortunately, being a thirteen year old in her thirty year old body Jenna doesn't exactly have a world of knowledge when it comes to boys; but she makes due with some noteworthy male experiences from her current trip to the future. However, she's slowly learning life lessons, bigger than how to tell if a guy actually likes you, that  the rest of us can only hope to learn by the time we're actually thirty. This is where 13 Going on 30 fully earns a spot on my DVD shelf  as a great movie for one of those nights where you have the urge to laugh and the need be entertained."
    },
    {
      "rating": "10",
      "text": "I actually really thought this movie was cute! I've watched it a few times already..and I'll watch it again someday! I liked it! Jennifer Garner also played her role great! I love how she acted as a 13 year old in it, it's a good family movie. That will also give you a few laughs!"
    },
    {
      "rating": "10",
      "text": "Não tenho ideia de quantas vezes assisti esse filme, por ser tão bom. Toda a história passa de apenas um sonho e não é nada novo, claro, mas o filme é cativante até o final."
    },
    {
      "rating": "7",
      "text": "To be honest, I'm not really a big Jennifer Garner fan. However, I absolutely loved her in this movie. Her character was sweet, goofy, charming, and in some way a little naive. At the same time, she was also driven, determined, and confident and that was what I liked that about her. At times, her character could also be aloof, but that was part of her appeal. The story was kind of cut and paste for me, but nothing major. The main  as well as supporting characters were quite interesting. Finally, the 80s theme was on point and one of the best aspects of the movie for me. This movie had some good moments and some that were okay. Overall, this is a good movie, but not a great movie. Still recommend it for it's themes and how fun the movie can be from time to time. :)"
    },
    {
      "rating": "10",
      "text": "Jen Garner is a great actress. Her performance in movie was really enchanting."
    },
    {
      "rating": "2",
      "text": "I like Tom Hanks better. Stick to Alias girlfriend."
    },
    {
      "rating": "2",
      "text": "13 Going on 30: 3 out of 10: First of all I would like to throw my full weight behind any effort to give Jennifer Garner a special Oscar for best performance in a pretty bad movie. She is delightful and plays the character better than written.\r In addition I would like to absolve any of her co-stars from any possible negative career ramifications due to their appearances in this film. They also did a fine job. And last I would like security to please apprehend the writers and director whom I see sneaking out the fire escape.\r Okay the director gets community service for making some pretty obvious soundtrack mistakes for 1987 (he highlights as the supposed geeky underground song Burning Down the House which was featured in as a jock anthem in Revenge of the Nerds three years earlier and as MTV fodder he highlights Thriller from 1983 which was already in the Halloween ghetto mix by 1987.) The writers get life in prison without parole. First question. Have they ever worked in any office anywhere, let alone a supposed fashion magazine? They get so much wrong I don't know where to begin. Second though Garner's performance is great her character is a mess. She finds older guys icky in one scene and is attracted to them in the next and then back to icky. She handles her cutthroat business environment with more maturity than most thirty year olds let alone thirteen year olds.\r Instead of going into a Being There Chauncey kind of vibe where Garner's character's inane utterances are taken as genius the film actually makes her more proactive than either her shy thirteen year old self would be or her cutthroat thirty year old self was. No working woman cliché is ignored and the less said about the sappy and ridiculous ending the better.\r The whole body swap time travel deal was actually the most believable part of the film. Certainly more believable than a doll house building, fairy dust collecting, fat boy next door growing up to be a thin straight single guy living in Greenwich Village or more than one drunk person remembering any of the dance moves from the Thriller video."
    },
    {
      "rating": "6",
      "text": "I admired this movie for its charm, and Jennifer Garner's sweet and loving lead performance, but ultimately, '13 Going on 30' is a movie filled with some predictability. We follow a young girl's journey as she feels that being older will give her more pleasures and less disappointments in life. When she locks herself in her closet, and makes her wish... she finds herself waking up the next morning as a 30 year old, living with, what we may assume, is her boyfriend, but she has no recollection of anything that may have happened in between the 17 years, and she tries to find answers. She discovers that she is working at a job that she loves, and that she is successful at it, but her former best friend (played by Mark Ruffalo), still resents her after the way she turned him down when they were teenagers. But, she needs him more than ever. This movie is funny and has a lot of charm in it. Garner and Ruffalo share terrific chemistry together as two former friends, who could be something more. The movie, however, is just not as touching as it could have been, I feel that there could have been more emotional weight put into some scenes and maybe one or two more struggles along the journey, but overall, Jennifer Garner is lovely here, leading the movie so effortlessly, and the premise, while far from original, does live up to some expectations."
    },
    {
      "rating": "6",
      "text": "Ningún adolescente en su sano juicio quisiera despertarse una mañana cualquiera y tener 30 años, en la realidad es más bien al revés, sin embargo, es una comedia divertida después de todo."
    },
    {
      "rating": "8",
      "text": "Cool movie, Garner is more than just a (very) pretty face, she has unreal charisma and charm. The movie never drags, and who can't relate to the adolescent angst that she and her would-be boyfriend experience, as well as the feelings we all have as we get older that cause us to wonder if we had just done \"this, or that\" a bit different when we were younger, things might have turned out better? In a sense, the movie is really like a combination of \"Best Friend's Weddiing\", and the theme about the Ghost of Christamas Future from Dickens. Unlike Julia, she gets a second chance, which is cool, because someone as awesome as Garner will ALWAYS get a second chance...I mean, she deserves it, she knows it, and we know it! Totally charming movie, and I think very well cast as well, it is a disservice to simply call it a \"chick flick\" (OK, it is, but there's more to it than that) or something similarly demeaning. This movie has real class, and Jennifer Garner, in my book, is the coolest of the new young actresses."
    },
    {
      "rating": "8",
      "text": "I just like the concept of the movie. Surprisingly funny. We all couldn't wait to get older when we were young. If only we knew how much being an adult sucks, we wouldn't have tried to grow up so fast."
    },
    {
      "rating": "10",
      "text": "I watched this movie today. It brings back the nostalgia. Very cheesy and feels like a Hallmark movie but nothing wrong with it. I like the message just like in This Is Us when we were kids we wanted to see ourselves as adults but when we become adults we wanted to be kids again with this I like that Jenna saw what her future/present was going to be and she wanted to change it. Be close with her friends and especially interacts with other people. She realized what is in front of her and she didn't see it. Sometimes we need to take advantage and not take things for granted. PS Jenna and Matt are couple goals."
    },
    {
      "rating": "8",
      "text": "smdmfmmolnknigihyfugtdrswweukmmbhcssfdsdaszcbjuibhonmlpmohiguguggfyfhvhiugyfgjhjihih"
    },
    {
      "rating": "9",
      "text": "$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$,,,,,,.......,,,,,,,...%%%%==÷÷××++●●■■▪▪●●■■⊙⊙⊙"
    },
    {
      "rating": "8",
      "text": "⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙........................................................"
    },
    {
      "rating": "10",
      "text": "$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.》■》■》■》■》■》■》■》■》■》■》■》■》■》■》■》■"
    },
    {
      "rating": "10",
      "text": "●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●●¡●¡:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;"
    },
    {
      "rating": "7",
      "text": "----------------------------------7.1/10-----------------------------------"
    },
    {
      "rating": "8",
      "text": "Que buena película, por que me gustan los clichés Con esta no chillo jijiji"
    }
  ],
  "recommendations": [
    "big",
    "young_adult",
    "home_again",
    "the_spectacular_now",
    "endless_love",
    "book_club",
    "17_again",
    "midnight_sun",
    "the_intern",
    "last_vegas",
    "you_again",
    "moonrise_kingdom",
    "life_as_we_know_it",
    "we_bought_a_zoo",
    "something_borrowed",
    "the_first_time",
    "nanny_mcphee",
    "the_perks_of_being_a_wallflower",
    "10_things_i_hate_about_you",
    "lady_bird",
    "dora_and_the_lost_city_of_gold",
    "chef",
    "the_holiday",
    "booksmart",
    "the_edge_of_seventeen"
  ]
}