{
  "id": 1038,
  "title": "13 Hours: The Secret Soldiers of Benghazi",
  "starring": [
    "John Krasinski",
    "James Badge Dale"
  ],
  "runtime": 144,
  "genre": [
    "War",
    "Action",
    "History",
    "Drama"
  ],
  "description": "An American Ambassador is killed during an attack at a U.S. compound in Libya as a security team struggles to make sense out of the chaos.",
  "releaseYear": "2016",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/cnT9oRxVX3Ct5HYEPkq7Ppbye0O.jpg",
  "categories": {
    "plot": 7.349206349206349,
    "acting": 7.702702702702703,
    "ending": 7.166666666666667,
    "soundtrack": 5.0,
    "cinematography": 7.75,
    "familyFriendly": 3.0,
    "funny": 8.0,
    "action": 7.0
  },
  "reviews": [
    {
      "rating": "8",
      "text": "I can understand why film critics weren’t wild about this picture, but as a movie fan, and as someone who has admitted sympathies for the men and women serving in the U.S. Military, I really loved this film.  No, it’s not perfect in the way it develops the characterization of each of central figure, but it finally shows us the events of Sept 11, 2012 in Benghazi in a way that none of the endless Capitol Hill hearings have done.  The very clear stand-down orders, which prevented the contractors and CIA operators from getting to ambassador Stevens, were finally brought to light. The film obliterates the notion that some YouTube video was responsible for these attacks – but it does so in a way that’s not political.  It’s simply factual.  What Americans can’t stand is when politicians put servicemen and women in jeopardy and then fabricate what happens to them and why. The survivors of these attacks have credibility, and Michael Bay and his team did an excellent job of memorializing those who passed in this crisis.  Beyond all of this, you’ve got heart-pounding action throughout, and the acting is superb."
    },
    {
      "rating": "10",
      "text": "I was pleased that this was about people and not politics.  There were a lot of gratuitous explosions (M.Bay.. right?) but the substance of the story was the people.  Great film and a true story that begged to be told.  I was also surprised by how well John Krasinski did in this film..  love Jim and The Office, but had a hard time picturing him as an ex-SEAL..  but he clearly knocks it out of the park (and never gave the camera a flat stare)."
    },
    {
      "rating": "8",
      "text": "This is easily one of the best films I have seen to date, even if Michael Bay was the director. Despite a handful of slight factual errors in the film, they're easily forgivable within the scope of the film. The cast really fit in to their roles well, and the heavy emotion strikes at two of the most appropriate (and shocking) times in the film. The set design was spectacular, the action was intense, and the pacing was great for building up to the pivotal moments of September 11th, 2012.\r Not surprisingly, the media has severely downplayed this movie for the dramatized truth it depicted about what really happened in Libya as told by the surviving men of the Global Response Staff. This is evident by the critics' Metascore of only 48.\r I saw it a few weeks ago and again today (at the time of this review) when I took my dad to see it. Screw everything you're looking for in a movie. From what I can tell by some of the other reviews, they were seeing the movie for the movie, and not for the true story it presented. If anyone who watches 13 Hours isn't pissed off at the Executive Branch by the end of the film, you probably should be at the fact that four Americans wound up dead because they were essentially left to rot in the Middle East. Such abandonment is one of the ultimate betrayals a government can commit upon its citizens in dangerous situations.\r In summary I have only four words to say: go see this film!"
    },
    {
      "rating": "10",
      "text": "Everybody should go see this movie. The best movie that I have seen recently. True to the story of what really happened in Benghazi. I studied to the real heroes interviewed of what really happened in Benghazi. They really fought and never gave up. And what really happened to our US Ambassador Christopher Stevens. They sacrificed for our countries. Everybody should see this move, was made by Director Micheal Bay, the guy who made movie \"Transformer\". It's an intense action movie too."
    },
    {
      "rating": "7",
      "text": "The history of movies is almost as controversial as the events that went down in Benghazi, Libya. From scandals to affairs, Hollywood has been controversial since the beginning of time. The movie presents itself just like Hollywood. The exterior structure looks glamorous with a hollow center of both destruction and chaos, with both a surprising good narrative and less Baism then his past films. Bay seemed to have truly wanted to make a good movie, without the need to trump action over characters. This results in a good tale of the soldiers who gave their lives to fight an enemy that shouldn't exist.\r 13 hours tells the true story (depends on what you believe) of the accounts leading up to the attack of a military base in the city of Benghazi, Libya. There has been Civil uprising of the government, which leads to the militant capture of the country. They shunned many world powers, especially United States out of the country. After a press meeting with the an United States Ambassador is leaked to the public, the militants track down his outpost. This leads to the death of the Ambassador that then spirals out of control. This leads to military base being next one the list. The military will now have to defend their stronghold against the onslaught of forces who are headed their way.\r Bay has mostly created lifeless characters, an action driven story, and laughable romance in almost all of his movies. His track record has been less than even bad, with movies like the Rock being the best. Bay has produced a lot of critics because of this. Though he's been able to turn a profit with almost everything he touches. Though his storytelling is pushed aside for cheap tricks and remarkably terrible dialogue. This phenomenon is called \"Baism\". It's when a director simply makes money, no matter the quality of the film. Though this has led to a decline in sales, because audiences just seem to value the movies again. However, this outing is the best he's ever produce. Bay leaves all the trickery at the door, for some good character development.\r The story is as hollow as any bad movie out there. The story train chugs down the straight path and hits all of the same rhythms as every real life war movies before it. Little history lesson with text, small period showing unrest, civilized manor of defusing that unrest, diplomacy fails, climax occurs, and the resolution. This doesn't have anything new or even compelling. It's a predictable ride throughout and no major significance happens in the story.\r Though Bay doesn't want the audience to focus on that portion of the movie. His attention is solely committed to giving the audience the real victims, the soldiers. In most of Bay's former movies, action was pushing the story along. It was the action that turned the attention away from the poorly written script and stiff characters. It a Baism tactic to distract the audience to shift focus off the awfulness of the movie. However, 13 hours kicks off the meat of the movie with action, it's the characters who push the story along. The characters create the action through their actions, and it allows the centers the focus onto the characters involved.\r Though it seems like another distraction tactic, that turns the focus away from the story. However, the characters feel so genuine and real, that it isn't problem to focus solely on them. That's what the title even says. They are secret soldiers in foreign land, which they don't truly understand themselves. Bay truly captures this aspect by getting the audience to get connected with these characters. His goal is for the tension to rise when these characters are in trouble, not begin able to distinguish the enemy from the friendly's. This wouldn't be possible if Bay just throe action in the faces of the audience. He really achieves tension by simply narrowing the focus onto a couple of people. The connection between the characters and audience is captured by giving us only small backgrounds characters other than the main character. Not bogging down the movie with sappy back stories of every single man. Though giving enough insight to care for those that eventually die.\r Overall, Bay does a fine job with creating a movie that's mostly character driven, pulling away from his usual Baisms, to produce a mature movie to honor these men. Though Bay can't help himself at times with some bad dialogue, firework explosions, a weak story, and one or two lifeless characters. However, Bay puts on his directors cap to make a grounded film that tells the story of survival. It gives way to some great scenes of extreme tension. 13 hours might not be up to the 2014 standards of American Sniper, but sets itself up to be its little brother. 8/10"
    },
    {
      "rating": "9",
      "text": "Excellent movie with a group of moderately known guys playing the security contractors who seemed to be perfectly cast for the roles. It helps you understand some of the futility of the US attempting to win allies amongst fanatics. It's also incredibly sobering to see that our state department completely abandoned good people, most likely to avoid admitting Mideast turmoil in an election year."
    },
    {
      "rating": "8",
      "text": "In an unfriendly environment they got 13 long hours to survive and resist the attack.\r It is an action-thriller-war version of the 'Argo'. Based on the true story where the most of the film was the 13 hour long armed battle event took place in Libya, 2012. I remember the middle-east's protest over the western films, this story is set in the same time when the islamic terrorists targeted the American diplomatic compounds in Benghazi, but six brave men stood and fought against the uprising.\r It is an American patriotic film, but because of the hatred over their own countrymen Michael Bay, they're surely missing a nearly a war masterpiece. The rest of the world saw it as a fine film and appreciated that. If you haven't seen it yet, I say just don't ignore it. It was a well made realistic war film, the actors were amazing and the scenes were suspenseful to spectacular. Definitely one of the best in this theme.\r It was simply focused on the armed conflict between the two forces, so it won't reasons out us how and where it all began, because that might take another film to tell the tale. That's really a very clever writing. In this 150 minute long film, the first act was full of characters and story development. Then begins the gun fight that commences from the dust hours till the dawn breaks out. With many twists in the narration during confrontation, surely not a film to be missed.\r 8/10"
    },
    {
      "rating": "10",
      "text": "A really good, gripping war movie that doesn't glorify war. It does point out the many unanswered questions about this preventable tragedy: where was the President; where was the Secretary of State; was there no planning; where was the support force?"
    },
    {
      "rating": "7",
      "text": "13 Hours: The Secret Soldiers of Benghazi won't win any awards or laurels from critics, but honourably portrays the events that happen that night. The film doesn't indulge in politics but instead uses facts to complement the non-stop action (which is director Michael Bay's wheelhouse). The end result is a well-told war film that doesn't break new ground but is riveting nonetheless."
    },
    {
      "rating": "7",
      "text": "I remember the news reports when Benghazi happened, the military saying they were too far away to help, no support from Secretary of State (Hillary) or the Pres.  Kinda reminds me of Vietnam stories, inept leadership.  Boots on the ground are left on their own."
    },
    {
      "rating": "10",
      "text": "Great and emotional re-telling of heroics that took place. Michael Bay does a great job capturing your attention."
    },
    {
      "rating": "10",
      "text": "Not a big Michael Bay fan, but this movie held my attention and was quite suspensful. The action was nonstop. Can't understand the professional reviewers low scores unless it's politically motivated. This was a well done movie. Intense."
    },
    {
      "rating": "10",
      "text": "I saw this movie yesterday in a packed theater.  Let me preface my remarks by stating I am an independent voter as I am neither a Democrat nor a Republican.  With regard to the 13 hours it will have you sitting on the edge of your seat as Michael Bay the Director makes you feel that you are right there with the brave men and women in Benghazi and not just American's.  Benghazi is a war torn hell hole that you would not wish on your worst enemy.  At no time does the movie meander to or even mention politics.  The acting is superb.\r Having said all that I was under the impression that this movie was about 6 brave men, two of which lost their lives trying to save Ambassador Stevens and his small staff.  Now I find out that is not even remotely true.  There were a staff of about 25 civil service CIA American's in the compound whose lives were at stake when the terrorists attacked the American Compound about a mile away from where Ambassador Stevens was killed.  Make no doubt that this was a planned terrorist attack as the Pentagon watched all that was happening.\r Having said that, how did President Obama and Hillary Clinton as Secretary of State even have the nerve to advice the American public that these were protesters reacting to an American made negative Muslim video?  Why were repeated requests for assistance denied?  Why hasn't Congress subpoenaed the clerical civil servants that almost died if not for these 6 brave men who stood guard similar to Davy Crockett at the Alamo because this is what it was.  Finally if our government will lie to us about our Embassy being attacked and cover that up, what other lies are they keeping from us?  This is a must see movie for everyone so you can understand the magnitude of Hillary's lies as she is untrustworthy as she belongs in jail not running for President of the United States.  I'm shocked that Congress has not subpoenaed every last man and woman who was actually in Benghazi as well as our military leaders at the Pentagon who witnessed via satellite the entire attack.  Can anyone really believe that President Obama, Hillary and their staff wasn't awakened with this news?  Who ordered the cover up and why?"
    },
    {
      "rating": "9",
      "text": "This is a great movie, go see it. The reasons: (1) True story that needed to be told. (2) Great direction(-1 for the annoying 'shaky camera' syndrome modern directors use like in Jason Borne movies) gives the viewer an involved look at what these Americans went through (3) Great acting. Yes, for a more action-oriented movie the actors did a fantastic job portraying these complex and gruff individuals. James Badge Dale, John Krazinski, Max Martini, Pablo Schreiber, Dominic Fumusa and David Denman were all extremely compelling and brought you right into Benghazi.  Anyone who said this is a political movie is a liar, they specifically avoided this as much as possible making only one reference to the now debunked 'video tape' story initially told."
    },
    {
      "rating": "8",
      "text": "I'm sure political views are influencing some to lower their ratings of this movie.  The truth is the film depicts the actual heroism of the guys who eventually came to grips to act on their own and do what they could. You can draw your own conclusions on who is right and where errors were made. As for the presentation of a true story I give it 2 thumbs up but I understand it's not going to be liked by all. Being a veteran myself I was touched emotionally."
    },
    {
      "rating": "10",
      "text": "All this nonsense about not developing characters...They only had over 2 hours to depict what happened in 13. Not rocket science folks. Do the math.\rEvery American needs to see this movie."
    },
    {
      "rating": "9",
      "text": "As an action/war movie, 13 hours is a thrill.  But it's more.  It lays out the true exploits of six men who fought pitched battles to protect Americans overseas.  I can't help but think some critics are fearful that this story will have some political impact, so they pick it apart.  As a soldier who did work protective details, the story on screen is believable.  You can tell they had considerable technical support from experts.  Go see it. I would not rely on critics for this one.  Too many seem to be worried that the movie may make our government look bad."
    },
    {
      "rating": "9",
      "text": "When a movie is set to retell a true story, I feel the focus of the movie goer should be on the story! It is very sad to see what happened to OUR people serving OUR country overseas. I thought the film was very well done and I know it was very true to what occurred there in Benghazi. Movies like this have to power to change some of  the STUPID political policies our men and women are forced to comply with, that put their own lives in much greater jeopardy. I thought the acting was great and was very drawn in to the story and how these people must have felt while serving our country."
    },
    {
      "rating": "7",
      "text": "While it may start off very slow and have some Michael Bay-isms in it, 13 Hours is Bay's most serious effort to date, and he does a pretty solid job.  The acting is good, the story is compelling, and Bay is able to pay respect to the true story.  With my expectations so low, this movie was all that I could have wanted it to be, and I have to respect Bay for making a positive move in his career."
    },
    {
      "rating": "9",
      "text": "13 Hours is a wonderful movie that was extremely surprising that brings together a combination of both realistic events that happened and actor's commitment to the roles. I am genuinely surprised by the great job that Michael Bay did as the director. This movie was one of the best realistic movies in the last year."
    },
    {
      "rating": "8",
      "text": "This may just be Michael Bay's best film to date (which I know isn't saying much), but I really was taken aback by how much I ended up enjoying this film! John Krasinski and the rest of the cast does a solid job and the action sequences are taut and tense! Overall, I found this to be a big step up for Bay and it does a great job at making intriguing and solid entertainment out of its true story."
    },
    {
      "rating": "10",
      "text": "Saw this today and I'm not sure why but movies like this I am drawn to. I am 47 and female. I feel the need to go and try and understand how hard it must be in all aspects of this kind of life, country, politics, and so on. It is my duty to try and understand. These and many more give so much for all of us and I am forever grateful to them all. No matter how big or small their role is they are simply amazing people and I thank you!! This movie is great. Most shed a tear in the end. It is real and you feel it. All these actors were amazing and they cast this perfectly. So put down your phones and get off the internet-see something that is real and should make you appreciate how good you've got it!!"
    },
    {
      "rating": "8",
      "text": "Wow.  What a surprise.  Michael Bay has been on my sh*t list for years after delivering a lot of trash in the form of Transformers sequels and TMNT.  13 Hours is a return to credibility.  The cast is spot-on throughout - every character feels genuine but not overpolished or obviously rehearsed.  The action is incredible - the fighting is much more immersive and never felt gratuitous, though I'm sure there were some artistic liberties taken.  It's impressive for Michael Bay who hasn't had to exercise much restraint in the visuals department nor has he focused on the actors themselves.  The story is pretty straight forward, though it's not entirely obvious at first.  13 Hours' early progression is a little jumbled but, after a few scenes, you start to get what's going on and what the big problem is.  I will applaud the studio for keeping a lot of the real-world politics out of this.  Pretty much everyone knows whose fault this event is (it is based on a very true story and is at least mostly accurate) and while there is a lot of shame and blame to be put on those people, this movie focuses on being a good movie and not pointing the finger to anyone specific.  Even though I didn't have high expectations to begin with, because it IS Michael Bay work after all, I still found 13 Hours to be a better-than-average military-like action movie that paints a picture of extreme heroism in during events that had huge odds stacked against those sticking their neck out for the defenseless.  What a story."
    },
    {
      "rating": "7",
      "text": "There are SO many ways this story could have been filmed/portrayed. Michael Bay decided to stay with just the action in the field. Max Martini, who you loved in the tv series \"The Unit\", reprises a similar role here so that was fun. There's no political aspersions cast at all which is obviously Bay's protection of Obama and Hillary, so that entire part of this tragedy is not represented at all. Also, the soldiers' discussions were decidedly politically-correct when you KNOW they used very derogatory language so I don't appreciate that element of realism being nixed by Mr Bay. The film's a bit long at 138-mins so I FF'ed through some of the slower parts. For the most part the pacing was decent, and the action was well done. There are many things you come away with after watching this event play out. One was that our guys were very fortunate that they faced a relatively unsophisticated, unprotected enemy, otherwise it would've been much worse for all. Bay's interpretation and presentation of this important event was decent, but it could've been SOOO much better and far more influential."
    },
    {
      "rating": "10",
      "text": "This is an excellent movie on the subject of Benghazi. It is true that the characters are not well developed but as a previous reviewer said \"All this nonsense about not developing characters...They only had over 2 hours to depict what happened in 13 hours\".  This movie was incredibly suspenseful and revealed some details that I did not know about. In short the second best war movie I've seen (only Black Hawk Down is better)."
    },
    {
      "rating": "10",
      "text": "This was an intense, heart-wrenching movie that should be seen by every American. The performances were real and moving. The action was gripping. The true story of Benghazi is disturbing and any American who sees this movie could not possibly allow the same people who were in charge then continue to be in charge going forward. I am neither Republican or Democrat, but the details of this story defies reason except that there was an election looming. I still cannot believe that our American military and government just stood by and watched (literally). This is an extremely entertaining and eye-opening film...a must see."
    },
    {
      "rating": "10",
      "text": "I love how these men are real people and heroes not comic book characters or video games. I hope young Americans aspire to have this kind of heart. The film was excellent in capturing the intensity of the those hours under attack and the commitment these heroes have to saving others. The facts laid out by their story is eye opening."
    },
    {
      "rating": "10",
      "text": "This movie is something everyone should see. Just the facts, riveting, we are blessed to have such brave men. We should demand more from the ones responsible to back them up."
    },
    {
      "rating": "1",
      "text": "I just created an account on metacritic solely for the purpose of spreading awareness of how bad this movie is. It is now my lifes mission to save other people from the gross feeling of injustice that I felt after realizing I wasted 2.5hrs of my life watching this nightmare of a film. The fact this movie is meant to depict an actual event in which Americans lost their lives is insulting. It is impossible to take to take seriously as the drama and dialogue progressively gets worse as the movie goes on with every line becoming more and more over the top and ridiculous. The whole movie plays like a scene from the Bachelorette with the CIA agents coming off like a bunch of frat boys living in a luxurious villa with a swimming pool equipped with cheesy one liners, shallow backstories and firearms. Scenes are choppy and the timeline is hard to follow as they repeatedly splice in the time of day on the screen yet you are never really sure whether it's supposed to be day or night. At one point they're all facetiming their families at the same time making you think you're watching a commercial for Esurance or something with Krasinski narrating. The parody continues further when, amid gun battles, a facetiming scene takes place with Krasinskis wife having a meltdown in a Macdonalds drive-through that is actually hysterical despite it's intention to evoke serious and somber emotion. The movie does well to dumb down and desensitize viewers to the seriousness of this historic event. Not even worth mentioning in the same class of movies like Zero Dark Thirty, Black Hawk Down etc. Michael Bay should be ashamed of himself."
    },
    {
      "rating": "2",
      "text": "You are an american redneck, who longs for more terrorist action movies with muslim men praying beside their AK-47s? Are you looking for bearded nationalistic and overly idealized heroes (like Chris Kyle in American Sniper)? Do you want them to talk about literally nothing of substance over the entire movie - so your brain doesn't hurt at the slightest attempt to retain an original thought?\r Do you like stock footage of soldiers getting onto airplanes, soldiers talking to their stock photo families over iPads in what could be an advertisement on the TV? Do you like slow pan drone footage of buildings, iron rods, cars and brick walls exploding in unexplainable sparks? Do you like Americans, making derogatory comments about helpful arabs standing right next to them, do you generally like helpful foreigners - such as the translator in the movie - portrayed as cowardly, spineless, birdbrained and fatuitous to help you over your own inferiority complex? Well, then this movie is definitely for you!\r Odds are, you are a right winged nationalist with little educational background and too much time on your hands, whining about those foreigners who keep stealing all the jobs. Well done. You are making your country proud!"
    },
    {
      "rating": "10",
      "text": "Great film that pays tribute to the heroes in Benghazi,  who risked their lives for their fellow Americans and were abandoned by their government.  Thank you Michael Bay for bringing this story to the public"
    },
    {
      "rating": "6",
      "text": "The first third is a bit boring, but when the bullets start flying and bodies start dropping then it gets entertaining. This being a Michael Bay movie that's all I wanted."
    },
    {
      "rating": "7",
      "text": "13 Hours does suffer from the style of its director. The use of slow motion, low angled camera shots and the very glossy camera look does scream MICHAEL BAY. However, Michael Bay directs his best movie in a decade, 13 Hours is a very solid movie. It's a well directed, well acted, intense and at times emotionally moving movie that pays respect to the brave men who fought at Benghazi back in 2012."
    },
    {
      "rating": "10",
      "text": "For all anyone knows, this movie could be absolutely outstanding, it just hasn't had a huge Disney marketing blitz and therefore is not 'good'.\rProfessional movie criticism is dead after the debacle that is Star Wars: The Force Awakens. What is it about this movie that professional studio shills and spruikers don't like? It's not an unadvertised shoddy remake of a movie made decades ago? Professional Film Critics are laughable joke, totally lacking in integrity."
    },
    {
      "rating": "10",
      "text": "Best movie I have seen in my entire life. Heroes are what world is about. Not bystanders but risked their lives for other. I am very proud. Everyone should see this movie. I was on edge of my seat and heart was pounding strong. So much tension and anticipation to what will happen next. At end of movie me and all audience cried. Stood up in honor of heroes and amazing filmmaker who did justice to this story, heroes and lives lost. I will never forget what happened. Please see this movie while still in the theaters. You will never forget it and it will change your life."
    },
    {
      "rating": "4",
      "text": "For me this movie commit the worst crime that a movie can commit: it's boring and the marketing to american conservatives doesn't any favor to this movie."
    },
    {
      "rating": "10",
      "text": "One of the best films in quite a while. Gave me the creeps, as I can feel the desperation and confusion of an American soldier on the ground in chaotic Libya. Soldiers, I salute you! I will give anything to NOT to be in their shoes. Seriously! Its sad that no aid was given to them on time. :("
    },
    {
      "rating": "9",
      "text": "13 Hours is very entertaining to watch. The emotional parts can get a little awkward at times, but watching 6 guys defend a base against swarms of Insurgents is fun nonetheless. It's one of those movies that won't keep you bored. If you enjoy Call of Duty or Badass-Operator action movies, you'll love this one.\r Michael Bay did a solid job this time around. You'll see allot of his common tropes around the movie (explosions, one liners, honoring the flag etc). Some people will hate this, but I love my country so haters can suck it."
    },
    {
      "rating": "4",
      "text": "Too much Hollywood, too little Realism.  Lots of attention to action, frightening terrorist types, battle scenes, and hard body Special Forces dudes.  Perhaps reason to watch.  Little attention, to my disappointment, to being educational and true to this historically important event, and even realistic relative to quality wartime productions like Zero Dark Thirty, Hurt Locker and Blackhawk Down."
    },
    {
      "rating": "1",
      "text": "Not even better than last 3 part of Call of Duty. But main idea the same, 8 peoples kills over 1000 Libyans. Also, Thanks CIA and U.S. gov, but we know truth about Libya, ISIS and how Democracy come to North Africa and made this country warring ruined ISIS stronghold."
    },
    {
      "rating": "10",
      "text": "Outstanding movie..... what  a learning experience, the liberal media have not spoken up on this movie, and I know why they have not after seeing the movie.\rThe truth and nothing but the Truth.......\r This is why we're very fortunate to have a military men and women  like we do.  They are the best...\r Thank you"
    },
    {
      "rating": "4",
      "text": "Over acted, Poorly written, and very hard to take seriously. They overly dramatize every single scene so it's hard to take something serious when something serious actually happens. The action scenes were alright but nothing worth while, Which is odd considering this is coming from Michael Bay. Overall, It's pretty much what you expect from a military action movie. It's not good but it's not terrible either. I think the overly long run time didn't help things either."
    },
    {
      "rating": "7",
      "text": "Let’s be honest here if it wasn’t Michael Bay’s name attached as director this film would be far more appreciated than it is by critics. Personally I think it is his best film to date and even though he employs his customary machine gun style editing to proceedings, it is not out of place in such a chaotic milieu. At times it is a claustrophobically tense and exciting war film that captures all the inherent horrors and atrocities of such a situation. The cinematography is outstandingly good and despite its hefty running time it does not outstay its welcome unlike quite a few other recent releases (The Revenant; Hateful Eight; Creed). Leading man John Krasinski is solid and with a really good scene with which to flex his acting chops at the end. Compared to the recent Danish film ‘A War’, the scenes of domesticity come over as fairly cheesy, but they are still passable and kept to a minimum. The best sequence is a murderous car chase at night that is brilliantly shot and edited for maximum impact. It is just one heart pounding example of why the film deserves better than to be damned with faint praise."
    },
    {
      "rating": "6",
      "text": "This fact-based telling of the attack on 2 U.S. compounds in the titular city gives director Michael Bay a chance to use his big-budget action chops in a “war” picture. Even though the scope is smaller, It’s still bears his high-end Hollywood signature with a grand scale and trademark cinematic flourishes. The story starts by attempting to create personalities for the security team, but even with snappy macho posturing, it takes too long and never establishes much individuality. The Embassy takeover is confusing, which may be intentional, but doesn’t make for good storytelling. The second confrontation carries more weight and provides the film’s most effective firepower. After the dust settles, this 2.5 hour ordeal comes to an end several times. The paranoia and brutality of the clashes are effectively staged, but the overall effect is too unfocused and less powerful than it might have been."
    },
    {
      "rating": "5",
      "text": "Michael Bay in every film he’s done has shown that he bleeds red, white, and blue, so go into this film knowing it’s very patriotic. For those who want a war film that is patriotic, action-packed, and honors its heroes stop reading, because this is the film you want to see. For those looking for a great war film, 13 Hours is an action packed film, that offers little clarity on the complex subject, and is filled with cliches. My opinion is this film came way too early, and if this film had been made in 5 to 10 years, the story would have been more fleshed out.\rMichael Bay is a great director when it comes to framing and shooting action sequences, this film showcases that. The film is loaded with action and uses very effective practical effects, making every explosion feel and look real. For a war film, it has a pretty good sense of humor, which helps lighten up the mood at times, and the performances are spot on. As well the film does a great job honoring the heroes of that day, in essence, it’s a very patriotic film.\rHowever, for those looking for a film that was going to delve into the controversial story of what happened on September 11th, 2012, and give clarity, this film doesn’t do that. In fact, the storytelling in this film is quite weak. The first act of the plot focuses too much on irrelevant subplots that dilute the film, and glosses over crucial moments, like for instance why the fighter jets in Italy didn’t come for assistance. The film ends up being, even more, confusing because the filmmakers were too afraid to offend either political party that is eagerly watching the impact of this film.\rAnother problem the film suffers, independent from the fear of political ramifications is the fact that the film is loaded with cliches. On top of that many of the characters, are either cliched stereotypes or underdeveloped. Even more disappointing is that the terrorist characters are weak, as the film doesn’t go in depth on who they are, or why they attack the consulate in the first place. So the true story of 6 brave heroes, becomes more of a shallow action/war film, and less a true story about these heroes.\rIn the end, for those who want to see this movie because it’s a true story about 6 soldiers who courageously fought to protect American lives, in hostile Libya, this film won’t disappoint. For those who want a film that tells a story that is well-crafted and easy to follow, while delving into the ever complex details, this isn’t that. This film is still very patriotic, and it seems as though that’s the biggest reason to see this movie, not to politicize, but to honor heroes, both fallen and alive. It’s truly a discretionary call on whether or not to see this film."
    },
    {
      "rating": "4",
      "text": "Michael Bay needs to stick to fiction. Perhaps it's the script along with the poor Direction, but the movie comes off as self-serving and a plea for vindication from the men this story is supposed to be about. Great action scenes raise the movie out of the negative column, but the whole effort seems forced."
    },
    {
      "rating": "4",
      "text": "I checked that Michael Bay directed this film. A little predictable too, don't you think? His hidden explosion easter eggs are at it again when it comes to this movie."
    },
    {
      "rating": "8",
      "text": "The fact that it's based on a true story gives it an extra dose of gut punch. It's not so much a war movie as it is a horror film. Michael Bay does a great job of portraying the events simply as he was told. There's no finger pointing or political messages. It's a movie meant to show the sacrifice of the men and women who were involved in these events.\r It manages to do that very well. Bay might not do a really great job of distinguishing these men from another in any meaningful way, but still makes us care for them. Admittedly it is done in some cliché ways. Phone calls back home and long stares at pictures of children are present. However these are how real people feel. It might not be original, but it is human and very effective as a result. The added humorous exchanges between these men, even in their hardest moments, further goes a long way to reminding us that these are real people. Not just cardboard cutouts meant to represent them.\r The cast is phenomenal. It was amazing to see John Krasinksi and David Denman in more emotional and action-oriented performances, given their reputation for staring on the sitcom \"The Office.\" Krasinksi in particular puts it all out there in the starring role.\r It's definitely got the emotion down, but 13 Hours also nails the action. Michael Bay is no stranger to big explosions. It's kind of the thing everyone associates with him and his work. There is plenty of that here. However it's more restrained and professional than what you would see in his Transformer movies. By that I mean it's all totally believable.\r Bay pulls no punches with the brutality. This is no action flick meant to glorify gunfights. It's a mature and horrifying look at the harshness and cruelty of war. The fact that this is all based on true events adds a sense of tension and terror to really pull you into it. It had me more shaken than the majority of horror movies I've watched over the years.\r Michael Bay surprises us with another \"based on a true story\" film. While he still embellishes in his little filmmaking fetishes like big explosions and crude humor here and there, this is by far his most thoughtful and mature work. It portrays the events in a respectable way and does an excellent job of paying respect to those who lost their lives in Benghazi. To top things off, he made it all incredibly great to watch, despite it's flaws.\r 8.4/10"
    },
    {
      "rating": "6",
      "text": "Michael Bay has actually made a fairly decent, coherent film?!?!?! Wow.\rWhile it is way too long and features very bland characters, there are some very intense and compelling action scenes. The story itself is incredibly interesting and Bay is much less abrasive than I expected, by not mentioning Hillary Clinton or any politics involved. The writing and dialogue is awful, as expected, and the performances aren't that good. John Krasinski, James Badge Dale, and Pablo Schreiber are easily the best in the cast and shine in a slew of amateur, weak actors. Of course, there are explosions everywhere and while most of them are the same, basic Bay explosions, he does use some new, inventive tricks (i.e. the mortar tracking shot).\r Congrats Michael Bay on making a decent, forgettable film rather than an excruciating, terrible one."
    },
    {
      "rating": "6",
      "text": "An interesting change of pace for Michael Bay, \"13 Hours\" is a sobering, carefully-made story with an endearing amount of respect for its real-life subjects."
    }
  ]
}