{
  "id": 3260,
  "title": "1408",
  "starring": [
    "John Cusack",
    "Samuel L. Jackson"
  ],
  "runtime": 104,
  "genre": [
    "Horror",
    "Mystery"
  ],
  "description": "A man who specializes in debunking paranormal occurrences checks into the fabled room 1408 in the Dolphin Hotel. Soon after settling in, he confronts genuine terror.",
  "releaseYear": "2007",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/yE9MCW7ZNxSw5SC1TMqm51pMBIV.jpg",
  "categories": {
    "plot": 7.176470588235294,
    "acting": 6.8125,
    "ending": 5.888888888888889,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 6.0,
    "funny": 5.0,
    "action": 5.5
  },
  "reviews": [
    {
      "rating": "8",
      "text": "The film is a great psychological thriller that is very faced and a little scary."
    },
    {
      "rating": "9",
      "text": "Stephen King,Steven King-only a great mind like his could make such a great movie.I've seen this movie 4 times and still love it just as much as when I first saw it."
    },
    {
      "rating": "8",
      "text": "Good movie, not perfect, but very very chilling. Honestly, in a world where horror movies are much better than they are now, I may not like this movie very much, but with all the crap we have to sit through, I actually enjoyed have a film really creep me out. I though the shining was mindnumbingly boring when I first watched it. I read the book and LOVED it, so I assumed the movie would be the classic it was hailed as. Turns out it was just a kid riding a trike for half an hour and some goofy close ups of shelly Duvall and Jack Nicklson. The reason I tried this movie was actually BECAUSE of the PG-13 rating; I figured if the producers felt confident releasing a horror film that wasn't an R than they must have something good. Turns out this movie is one of the best psychological thrillers I have ever seen. It was both intelligent as well relatable, without trying to hard to have a moral theme. The movie just IS scary, playing of your emotions and inner most fears, and not the visceral ones either, your REAL fears, even the ones you may not have realized you had. Of course it's not perfect, and it drags in a few spots, But the plot twists and writing (plus Cusak's performance) make for a GENUINELY scary film. I can understand why some might think the movie was a little haphazard or not fully realized (I never read the short story, so I can't comment on that), but if you don't like it because it's not a gore fest than grow an imagination and step outside your little world of superviolence for something that ACTUALLY has substance."
    },
    {
      "rating": "8",
      "text": "Just to start off, this is not horror, its a thriller. This movie is creepy, and it sticks with you. this movie maked you believe the room is in fact alive. and you feel confined. i loved it, start to finish. The only complaint is that it slows down, and you think its over, which is a smart idea, but it slowed down, then it picked back up but not with the creepiness, the drama. Great Film. Mary McCormick was hot in it. Tony Shaloub was great, that's TWO great TV actors. John Cusack, as usual, is great. Samuel L Jackson, great. Check this out"
    },
    {
      "rating": "8",
      "text": "An excellent film with great performances and musical score! Cusack does well in walking the line of keeping his cool and wigging out. Nothing too terrifiying here, but it is spooky. Check it out!"
    },
    {
      "rating": "8",
      "text": "1408 is an eerie and claustrophobic thriller that has a pervasive sense of eminent fear which makes a highly entertaining horror film that could leave you with nightmares."
    },
    {
      "rating": "8",
      "text": "When I finished watching this film, all that came out of mouth was, \"WOW!\". This film has a very great screenplay and the way it is utilized in the direction is completely terrific. This film did not bore me, not even for a second. I kept wondering all the time what is going to happen next. John Cusack's performance was over the top and really intense as supported by Samuel L. Jackson and this film would be nothing if John was not in it. The unusual scares didn't scare me that well but I admire the different style of psychological horror and mystery the director, Mikael Håfstrom, adopted in making this film."
    },
    {
      "rating": "8",
      "text": "1408 is a great psychological horror flick that does a fantastic job create a creepy atmosphere and maintaining it throughout the film. John Cusack turns in a great performance, as does Samuel L. Jackson in this well-crafted film that really has a lot more going on beneath the surface than you would anticipate from a film of this type. The horror is never cheap and the psychological element really does mess with you and scare you pretty thoroughly at times. However, this film truly rides on atmosphere and its well-adapted script with a seriously spooky air to the film and well made characters. As a whole, 1408 lived up to my expectations and managed to exceed them, but really delivered a thought-provoking look at many different elements that make the film worthy of a closer look."
    },
    {
      "rating": "8",
      "text": "1408 is an eerie and claustrophobic thriller that has a pervasive sense of eminent fear and pays quiet homage to The Shining."
    },
    {
      "rating": "8",
      "text": "I watch horror movies when there's nothing better to watch. So I guess you could say its relatively consistent. But more often than any other genre, I'm disappointed by horror films. 1408 provides something different. it has a very solid lead actor, John Cusack, at the helm, and Stephen King's overall vision. Its a remarkably simple story but with the right tweaks it became its own monster. Like if you had your own personal horrors locked away in your head, room 1408 would slowly and sadistically put you to death with them. Its heavily weighted on one character's personal struggles. Which is gutsy in a lot of ways but it was well done. This wasn't a jittery, jumpy, bloody, or even crazy type of scary, this was a sad hollow and empty type of scary that we hope we will never have to experience. Though a few of those scenes get pretty trippy.  You don't make a movie this well delivered too often. It stands as one of my all-time favorites in the horror category."
    },
    {
      "rating": "8",
      "text": "$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.■》■》■》■》■》■》■》■》■》■》■》■》■》■》■》■》"
    },
    {
      "rating": "8",
      "text": "The best adaption of Stephen King's work. Effective in its delivery from paper to film, 1408 stands out as one of the more fortunate films to be pushed in the midst of the golden age of mediocre horror."
    },
    {
      "rating": "8",
      "text": "⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙●■●■●■●■■●■●$$$$$$$$$$$$$$$$$$$$$$$$$$$$%&%&&%%&%&%%&%&%&%&"
    },
    {
      "rating": "8",
      "text": "A typical PG-13 horror movie consists of a bunch of dumb teenagers aimlessly running around in their film either trying (and failing) to solve some urban myth or being killed off in the least inventive ways possible. Of course you get the rare Insidious or The Ring, but for the most part, you'll end up with a movie like Ouija or One Missed Call. 1408, however, is the former. Based on Stephen King's creepy short story, 1408 is about an author named Mike Enslin (because it's not a King story if there's no author involved) who writes about haunted houses, graveyards, and the likes. He gets a mysterious letter in his mail one day that tells him \"not to go to room 1408 in the Dolphin Hotel\". Viewing this as a challenge, Enslin, who's played flawlessly by John Cusack, finds this hotel and gains access to the forbidden room 1408.\r The horror begins before Enslin even steps into the room. As he's pacing the halls of the 14th floor, he finds himself back at an empty open elevator, as if the hotel is telling Enslin not to go into the room. Slightly confused, he finds 1408 and walks inside. Mike's first five minutes in the room is rather boring. Nothing particularly supernatural happens until his clock all of the sudden starts playing \"We've Only Just Begun\", and a 60 minute timer begins counting down, in response to the hotel manager who says that no one has ever lasted more than an hour in the room. The movie then becomes an increasingly terrifying, non-stop haunted house (or, in this case, haunted hotel room) ride that relentlessly scares the audiences with a growing sense of dread and a very heavy atmosphere. 1408 doesn't scare us with what does pop out; it scares us with what might pop out. If you've ever seen Oculus, this movie is similar to that, only in a hotel room.\r Being based on a very short story, the structure of this movie is extremely simple. 1408 is a one-man show, and John Cusack is the star. For three-quarters of the movie, it's just him in the room witnessing all these bizarre and scary events. This movie isn't cluttered with unnecessary backstories, side-characters, or plot twists. It's a simple and effective horror movie that leaves a lingering sting. 1408 may not be as ground-breaking as Carrie or The Shining, but this movie is definitely one of the best Stephen King adaptations to date."
    },
    {
      "rating": "7",
      "text": "When I first heard about this Ill admit I didnt care to see it at all. But after watching it its not a bad horror/suspense movie at all. If your into horror this is diffidently a MUST watch. If you dont like horror of ghost/haunting movies you wont enjoy this at all. The images/cut scenes are awesome, the effects are legit, great cast, decent plot, you dont get to confused and pretty much figure it out once things start happening and the story seems to play itself out really well, solid horror movie with a good cast."
    },
    {
      "rating": "7",
      "text": "Somewhat effective thriller with a gone-to-seed John Cusack carrying the movie pretty much alone aside from a risible walk-on appearance by Samuel L. Jackson.Unusually successful adaptation of a Stephen King short story."
    },
    {
      "rating": "7",
      "text": "This film is not very scary, but it has atmosphere.  John Cusack is very good in it as the skeptical protagonist who yearns for a real scare and gets it.  I rooted for him throughout the film to escape the evil room that had trapped him."
    },
    {
      "rating": "7",
      "text": "It was ok. It took a while to really get interesting but once it did, It kept you sucked in through out the rest of the film. Solid acting as well. Just a good film overall."
    },
    {
      "rating": "10",
      "text": "Given that King adaptations are typically awful jokes, 1408 merits praise merely for being not abysmal. That said - it's a good little chiller that should have been great. So much is wonderful, including Cusack's droll awareness of playing the same, weary, cynical dude. The settings, the silences, the pacing - all grand, really. What goes wrong? TOO MUCH EXPOSITION, and the misleading kind. Based on the first 30 minutes, 1408 is beyond deadly. It's sadistic, vile, and very, very fast, given the self-mutilations which have occurred within it, and in mere minutes. But Cusack's experience, a few harmless phantoms aside, isn't terrifying; it's all about sadness and his personal despair. I expect more from a room that induces a maid to stab her eyes out in mere seconds.But - hey, it's all right. And the hotel window/ledge scenes are bloody fabulous."
    },
    {
      "rating": "7",
      "text": "I thought this movie was scary. However, for a movie made in 2007 you would think the special effects wouldn't look so 90's. Great performances by Cusack and Jackson."
    },
    {
      "rating": "7",
      "text": "Upon first glimpse, audience may be fooled by its misleadingly common premise, but 1408 boldly goes where no other psychological horror has ever gone. Packaged in 100 claustrophobic minutes in a dingy, creepy though somewhat ordinary-looking hotel room, John Cusack delivers convincingly, and the horror is promising and undeviating."
    },
    {
      "rating": "7",
      "text": "Based on the short story of the same name by Stephen King, 1408 follows a famous author as he goes to the Dolphin hotel to spend a night in the supposedly-haunted room 1408. Notice something about the numbers? If you add them together they equal 13, and there's your fun fact of the day. Despite what you see on the cover, Samuel L. Jackson only plays a minor role in the film, so you won't see him cussing like no tomorrow. Instead, he gives cryptic advice to the main character at the beginning of the movie, warning him not to go into the room. He goes so far to give him money and an expensive bottle of alcohol, which is taken but he still goes to the room. From there on, the movie turns into a twisting hallway with a surprise at every corner. Various frights ensue and soon the main character is struggling to try and get out of the room. By the time he finally does, you'll be on the edge of your seat. And then there's the twist ending, which pulls away to ANOTHER ending, revealing the guy's new partial insanity. If you enjoy horror films or are looking for more frights, 1408 is for you."
    },
    {
      "rating": "7",
      "text": "1408 is one of those movies you're either going to really love or really hate. It's long, and at times, not easy to sit through, but if you're a fan of Stephen King, you should be used to that. This is vintage King and it's done right! When people don't like the movie, right away they go after the writer. They don't realize that a lot of times things are drastically changed to make them more visually appealing. In a horror flick, that's usually means  and/or gore, which are out of place in a King story. 1408 has none of that, it's just a good old fashion horror story about a room that possesses it's residence. The acting isn't going to blow you away, there aren't very many surprises as far as the story goes, but it's a scary story, done the way the master of horror intended and I liked it!"
    },
    {
      "rating": "9",
      "text": "Don't let this adaptation of Stephen King's 1999 short story fool you - this is no ordinary ghost story. For \"1408\" is not just \"scary\" in the normative sense. This is a movie that is terrifying on a very cerebral, existential, and even metaphysical level. To say that the movie \"entertained\" me would be quite the understatement. What's present is such a multi-layered and endlessly fascinating deconstruction of humanity's perception of things that we take for granted (like time, space, place, etc.) and other things like loss, grief, and fear. It's a magnificently staged film with a powerful central set of thematics and a devoted performance from John Cusack. Definitely one of the more notable Stephen King adaptations I've seen."
    },
    {
      "rating": "9",
      "text": "God, this movie was really, really, gripping. Even if it doesn't live up to The Conjuring, 1408 is still another great Stephen King adaptation. Samuel L. Jackson and John Cusack are perfect in this movie."
    },
    {
      "rating": "10",
      "text": "this is such a underrated stephen king's movie john cusack was great in it . i liked most things about it the mystery , suspense and cinematic of it ."
    },
    {
      "rating": "7",
      "text": "Not really a scary movie at all but 1408 is an effective thriller. The movie feels like a bad dream. Really one of the better modern versions of a Stephen King book."
    },
    {
      "rating": "9",
      "text": "This is one of the best horror movies i have ever seen.\rThis movie is amazing, this is not a common horror films, this one have a elements that make this confuse, scary and rare. But the movie starts to become boring.\rAnd still have the jump scares."
    },
    {
      "rating": "7",
      "text": "An unnerving movie that here and there succumbs to fits of effects mania, “1408” actually manages to combine elements of Jean-Paul Sartre’s “No Exit,” “The Poseidon Adventure” and the Carpenters — making them all more terrifying than they already are. More remarkably, perhaps, “1408” refuses to embrace the fashionable elements of torture porn, a la “Hostel: Part II,” that are currently cutting a bloody swath through the horror genre, relying largely on psychological terror to impart the sense of someone possibly going mad, and taking the viewer along.\r In Stephen King’s merrily warped world, the most damning thing a character can do is ignore the supernatural writing on the wall. As seen in novels like “The Shining” or short stories like “The Road Virus Heads North,” a character who displays hubris or cynicism, or simply fails to acknowledge life’s mysteries, usually consigns himself to the author’s pile of victims.\r Mike Enslin (Cusack), therefore, is the perfect foil for King the moral instructor: A successful writer of popular books about haunted houses and possessed graveyards, Mike scoffs at anything remotely paranormal, but, having lost a daughter to illness, he doesn’t quite believe in anything else, either. Cusack’s charmingly iconoclastic persona helps set Mike up for a lesson in metaphysical manners. By the end of “1408,” he will definitely believe in something.\r The Dolphin (which, coincidentally or not, is also the name of a haunted hotel in the Haruki Murakami novel “Dance Dance Dance”) is a luxury establishment on Manhattan’s East Side, a first-rate joint save for one room. Determined to debunk the mystery of room 1408, Mike has to threaten a lawsuit to gain access to the room, where he knows four people have met unlikely ends. What he doesn’t know is that 50-odd people have actually died there, some of apparently natural causes, although the room also once drove a maid to gouge out her eyes. The official diagnosis? It’s an evil room, says Dolphin manager Gerald Olin (Samuel L. Jackson).\r But Mike is undeterred and, once he gets in, finds the room has bizarre shape-shifting properties. While Hafstrom eventually turns 1408 into a frozen tomb that cracks and shifts like an arctic ice shelf, it’s in the smaller details that the creepiness escalates: The closeup of the old-fashioned lock mechanism as Mike inserts the key — the room itself having refused any security improvements — is a little gem of tension-building.\r Cusack, given plenty of room to ruminate about his plight and the state of his accommodations, is funny, tragic and moving — as if things weren’t bad enough, his dead daughter Katie (Jasmine Jessica Anthony) pays him a visit, while his estranged wife Lily (Mary McCormack) tries to help him via a computer screen that’s been taken over by the resident incubus. Make that inn-cubus. “1408” is a creepshow that delivers, although viewers may have second thoughts about ordering room service.\r Production values, spearheaded by Benoit Delhomme’s excellent cinematography, are indispensable in this tale of illusion and delusion."
    },
    {
      "rating": "7",
      "text": "A good thriller that doesn 't make you get bored. Because the film is chamber-like, acting is very important. And John Cusack didn 't handle it fully. Yes, the dynamics themselves are not bad, but the main twist is read in advance, it feels in the phony of the world, after liberation. It 's disappointing more everything, you do expect a double bottom from a movie rather than getting it."
    },
    {
      "rating": "9",
      "text": "John Cusack nailed the role of Mike Enslin in \"1408.\" The only complaint I had of his performance was the overuse of his sarcastic smirk every six minutes. He didn't believe in ghosts...we got it...and within the first five minutes of the motion picture (even before he entered the Dolphin Hotel's doors). Speaking of early in the movie, I'm not sure why the woman, Anna, (in the book store after Enslin's \"Author's Corner\") was even there. Her entire scene consisted of her having Mike autograph one of his early books, \"The Long Road Home,\" that she purchased on eBay, and then asking him a question regarding the authenticity of the \"father/son\" relationship within. While the question was interesting, it was totally out of left field, and in no way pertained to the rest of the movie. I don't know if this \"side road\" of his relationship with his dad ended up on the film editor's floor, or if it was something that only those who read the short-story would understand. Despite Samuel L. Jackson only having a minimal role in the movie, his depiction of Gerald Olin was memorable. He took control as the Dolphin Hotel manager, without trying to take control of the movie. His disappointment in Mike Enslin's refusal to stay in a different room...ANY different room was both believable and sincere. His self-serving, uncaring line, \"Look, I'm not telling you not to stay in that room for your own good or for the profit of the hotel. Frankly, selfishly, I just don't want to clean up the mess,\" was short, sweet, and brutally honest. My favorite quote of the movie was actually from Jackson, in his limited role; it was when he answered Cusack's question of what was wrong with room 1408 by saying: \"It's an evil **** room.\"; it was classic Samuel L. Jackson, and reminiscent of his role in \"Pulp Fiction.\"Overall, I really enjoyed this movie; it was surprisingly scary for a PG-13 production. I read that there were actually four endings; while two of the other three were decidedly darker, the fourth was fluffy, fun, with a fantastic finality...which is something you neither expect nor desire from a Stephen King book/movie. So with that being said, I believe the one that made it into the theater production was the best of the lot. Despite the few negative reviews I've read here, I'm still going to recommend it. I believe some of the negativity comes from the fact that not only did this \"only\" garner a PG-13 rating (which is not of the norm from a Stephen King book-to-movie), but it doesn't \"feel\" like a King flick...neither of which is a bad thing. Despite those two reasons, it's still a better alternative to many non-Steven King, R-rated movies in the horror genre. To put it in another way: Stephen King + John Cusack + a little of Samuel L. Jackson sprinkled in = a pretty good way to spend a little under two hours of your time...STAY SCARED!"
    },
    {
      "rating": "6",
      "text": "\"1408\" is a horror movie that doesn't know what it does, but it still manages to give the good chills and scares."
    },
    {
      "rating": "7",
      "text": "\"1408\" is one of the good Stephen King adaptations, one that maintains its author's satirical view of human nature. However, it's not the script (by Matt Greenberg, Scott Alexander, and Larry Karaszewski) that deserves most of the credit. Director Mikael Hafstrom \"Derailed\" (2005), who fares far better here than his debut, never resorts to the cheap tricks and gruesome visuals, while creating scares through a suffocating sense of claustrophobia and suspense. The movie appeals to an old-fashioned sense of horror that differs from your typical slasher flicks loaded with unrelenting carnage.\r Mike Enslin (John Cusack) is a professional skeptic. He makes his living by visiting supposed haunted houses and writing about the absence of ghosts. For him, room 1408 at New York's Dolphin Hotel is too good a challenge to pass up. In its nearly 100 years of existence, 56 people have died in that room. The hotel's manager (Samuel L. Jackson) advises in the strongest terms that Mike not stay there. \"No one,\" he advises, \"has lasted more than an hour.\" At first, Mike is not impressed by the ordinariness of the accommodations. Then strange things begin happening, and by the time he decides that checking out early might be the wisest decision, that option no longer exists.\r Too often, we see a movie with a good setup ruined with a subpar ending. \"1408\" deftly sidesteps the pitfall, delivering a conclusion that manages not to disappoint, while at the same time leaving things open-ended enough for viewer interpretation. Most of the movie focuses on Cusack, alone in his room, trapped in an escalating environment of paranoia. He uses his good natured disposition to get the audience's acceptance, and once that's accomplished, the film has us. It's riveting to watch his cynicism and disbelief give way to the horror of what is actually happening. Despite Mike's mantra \"We don't rattle, do we?\" The answer is in fact, we do."
    },
    {
      "rating": "7",
      "text": "The idea was original and interesting. John Cusack and Samuel L. Jackson's performances were really good and the general atmosphere that the movie has is unique and frightening."
    },
    {
      "rating": "7",
      "text": "If elements of 1408 seem a little familiar, it shouldn't be a surprise. Here's John Cusack, once again having lodging problems (see also Identity). Here's a supernatural debunker faced with something that refuses to be debunked (see also The Reaping). And here's a movie about a room-for-rent where people go in but don't come out (see also Vacancy). Yet, despite all of these recycled plot elements bobbing around, there's nothing stale about 1408, which is easily the best horror film of 2007. Too often, we see a movie with a great setup like this ruined by a subpar ending. However, 1408 deftly sidesteps that trap, delivering a conclusion that somehow manages not to disappoint while at the same time leaving things open-ended enough that viewer interpretation comes into play.\r To say that movie adaptations of Stephen King stories have a checkered history is to understate the matter. The rule of thumb is that King's non-horror efforts have gotten much better treatment than his bread-and-butter fare. The rule doesn't apply here, though. While 1408 isn't on the same plane as The Shawshank Redemption or Misery, it's easily among the best King-inspired motion pictures to-date. It is by turns bold, scary, and downright creepy. The film doesn't try to do too much and what appears to be a dead give-away of things to come turns out to be nothing more than a delicious piece of misdirection. I love that sort of thing. Instead of the viewer being a step ahead of the filmmakers, it's the other way around.\r Mike Enslin (John Cusack) is a professional skeptic. He makes his living by visiting supposed haunted houses and writing about the absence of ghosts. For him, room 1408 at New York's Dolphin Hotel is too good a challenge to pass up. In its nearly 100 years of existence, 56 people have died in that room. The hotel's manager (Samuel L. Jackson) calls it **** evil\" and advises in the strongest terms that Mike not stay there. \"No one,\" he advises, \"has lasted more than an hour.\" At first, Mike is nonplused by the ordinariness of the accommodations. Then strange things begin happening, and by the time he decides that checking out early might be the wisest decision, that option no longer exists.\r For the most part, this is John Cusack's movie to carry, and he has no problem taking it where it needs to go. His \"co-stars,\" Jackson and Mary McCormack (as Mike's estranged wife, Lily), have minimal screen time. Most of the movie focuses on Cusack, alone in his room, trapped in an escalating environment of paranoia. Cusack uses his sunny, good natured disposition to get the audience to like him and, once that's accomplished, the film has us. Director Mikael Håfström is as adept at setting up \"boo!\" moments as he is at building and sustaining suspense. From the moment Mike enters the room, there's a growing sense of dread, but this is punctuated by instances of stark, sudden terror. This is Håfström's second English language motion picture, and it's a considerable step up from his previous effort, the unsatisfactory Clive Owen/Jennifer Aniston thriller, Derailed.\r 1408 is divided into three clearly delineated acts. The first, which lasts about 30 minutes, is the setup. We meet Mike on the outside, get to know him a little, then follow his single-minded determination to remove all obstacles and get his story. The second act takes place with Mike alone in the room. This is the most eerie, unsettling portion of the movie and will forever change your opinion of a sentimental Carpenters' wedding classic. The third act is the shortest, but offers enough twists and switchbacks to turn what initially seems to be a conventional denouement into anything but that. You can see it coming… or can you? While the final scene won't frustrate anyone the way the ending of The Sopranos did, it's not clear-cut, either. There's room for interpretation, which is a rarity in any horror film.\r 1408 doesn't belong grouped with the likes of Hostel and Saw, because the filmmakers understand that fear gestates in the mind. Gore can as often diminish terror as enhance it. 1408 can be rated PG-13 and still frighten the crap out of viewers because of the way the director balances claustrophobia with suspense. Yet things never become too intense, which can be a danger with a movie like this. That's where John Cusack shines through. Even in the midst of a personal apocalypse, he can utter a one-liner to break the tension.\r The 15 rating might argue that 1408 is for teenagers, but that's a mistake. This is the most mature horror movie of the year - far more adult and sophisticated than the tedious Hostel Part II. If you like to be creeped out by movies, this is one to see. It reminds us what it's like to be scared in a theater rather than overwhelmed by buckets of blood and gore."
    },
    {
      "rating": "2",
      "text": "Ugh ... worst movie in recent memory. I saw it in Hong Kong and the audience actually laughed the the daughter died again. Maybe it was a cultural thing, but I thought the overall effort was laughable."
    },
    {
      "rating": "0",
      "text": "This movie was so awful, I'm baffled at the good reviews. Simply the worst."
    },
    {
      "rating": "2",
      "text": "Worst fright film since The Number 23. While not as bad as that train wreck, this whole thing seems cheap and derivative. Worse, there's only one real scare in the entire movie. I found myself yawning and checking my watch. Don't bother!"
    },
    {
      "rating": "2",
      "text": "Awful movie. Not scary in the least."
    },
    {
      "rating": "2",
      "text": "[***SPOILER***] Uh I guess. He lives. Wow. Stupid. In fact if I remember correctly ( been trying to forget) nobody dies during the on screen course of the story. Oh and Samuel L Jackson is billed as a lead but is in the movie for less than 2 or 3 minutes. Cusack and Jackson are in the penalty box for this garbage."
    },
    {
      "rating": "2",
      "text": "This did not make any sense at all. It wasn't even close to the thrill of \"The Shining\". And the movie left a huge unanswered question. What was this movie about anyway."
    },
    {
      "rating": "3",
      "text": "Was it supposed to be a horror? Thriller? Great concept, but every effort made to rattle the audience was smashed to pieces. The whole grainy/static ghost sequences are just not scary anymore. Wait, were they ever? Not scary, just annoyingly suspenseful."
    },
    {
      "rating": "0",
      "text": "I actually liked how the film started out! Up to the point where he enters room 1408 and then it became a big mess of a movie!!! stay away from this movie!!!!!!!"
    },
    {
      "rating": "0",
      "text": "Cusack has long been one of my favorite NON high profile actors because of his choice of movies in general. But alas he lost me on this one. This movie was simply a recylced FX vehicle and if anyone thinks it was more than that then they looked way too hard and deep. As is many American movies the beginnings have promise and then falter into the writers abyss. By that I mean they run out of any credible imagination, originality and passion. If your not going to make any sense at least attempt to be entertaining, which this movie was not. This movie on the making sense level was close to The Lakehouse and that my friends was baddddd. So.. not in great company I must say. Think I'll go and write a screenplay, never have attempted one but heck sure as hell couldn't be as bad."
    },
    {
      "rating": "5",
      "text": "1408 was a great movie, but not what I would have imagined. John Cussack was great. I came into the movie expecting to be scarred and left a little disappointed. Although the film was creepy I felt it lacked something. The movie was definitely worth a watch and if it can be found at a reasonable price owning."
    },
    {
      "rating": "6",
      "text": "Very generic-kind of movie, it does have some thrilling moments but these are shattered by very bad special effects, loved the mood created throughout the movie, I was hoping for more of Jackson's participation but Cusack did a good job. I can't rate it as horror movie, but I can say that it was a suspense movie fun to watch."
    },
    {
      "rating": "6",
      "text": "I can tell it was wanted to be \"out of the box\", in the end doesn't really scream for that, but the thrills are there, has those moments when you can't blink and John Cusack was okay."
    },
    {
      "rating": "0",
      "text": "This. movie. was. so. horrible. I don't care if im giving spoiler alerts, the movie sucked. Everything about it sucked more then your mom. I don't even give it a score. The whole thing was just horrible. The movie took place in the same god damn room for an hour and a **** half. Mike died in the end anyways. SO WHATS THE POINT. jesus Christ. I watched this online and afterwards threw my computer out the window. I then bought a new computer to order the movie online and then burn it. I have no respect for Stephen king now. I have no respect for anything. I'm angry at the world. And your mom because she missed my calls. AND ESPECIALLY YOU GARRISON. **** YOU FOR PUTTING ME THROUGH THIS HELL."
    },
    {
      "rating": "4",
      "text": "I'm calling it,maybe it's just me that I didn't understand this film but I absolutely didn't like it,in fact I hated it.Nothing seems to add up here,jump scares that only makes u want to watch the movie less and plot lines that don't make any sense.The acting is fine but still in the end I walked out of this movie forgetting it for a very short amount of time because there was nothing truly special to remember.I never got scared of it after I finished the movie and that is a huge negative for the movie itself."
    },
    {
      "rating": "1",
      "text": "I don't see any point, and it can be an allegory to hell or anything, i don't think this is a way to present allegory."
    }
  ]
}