{"id": 2829, "title": "16 Blocks", "starring": ["Bruce Willis", "Yasiin Bey"], "runtime": 102, "genre": ["Action", "Adventure", "Crime", "Thriller"], "description": "An aging cop is assigned the ordinary task of escorting a fast-talking witness from police custody to a courthouse, but they find themselves running the gauntlet as other forces try to prevent them from getting there.", "releaseYear": "2006", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/p3ygfjYH0r0kNRbglwKNUgagiZR.jpg", "categories": {"plot": 6.625, "acting": 6.894736842105263, "ending": 6.0, "soundtrack": 5.0, "cinematography": 6.0, "familyFriendly": 6.0, "funny": 5.5, "action": 6.678571428571429}, "reviews": [{"rating": "6", "text": "\"16 Blocks\" is the usual buddy-cop movie with the decent action sequences. However its Richard Donner's top notch cinematography that saves the movie."}, {"rating": "5", "text": "It hurts me to rate a Bruce Willis movie like this but there's no other fair score, it's a very dull movie I hope that it was made just to get a few bucks and not tough as a serious movie. Big disappointment, very predictable, 99 minutes that felt like 4 hours."}, {"rating": "0", "text": "What a crap movie. No plot, stupid (if any at all) storyline. The whole time I was thinking 'why don't they just grab a cab, duck in the back seat, and get it over with ? And why would he walk around with this guy in broad daylight, in the middle of the street, for everyone to see them both ? Boring, predictable, sleep inducing..."}, {"rating": "7", "text": "A surprisingly good take on the buddy-cop cliche. The storyline is pretty unbelievable but rolls along at a nice pace, with great action sequences and frequent twists. Bruce Willis plays a typical \"last assignment cop\" character but is pretty charismatic. Thankfully Mos Def gives a decent performance and the dialogue between his character and Willis' is often quite funny. Not a hugely remarkable film, but certainly not a bad one. I've watched 16 Blocks several times now and it is still an entertaining movie."}, {"rating": "9", "text": "The bottom line is it's fun. Even if you can predict what'll happen from time to time, it's fun. The 3 major characters are all compelling to watch -- Willis, Def, and especially David Morse as the bad guy. Contrary to some of the reviews, there ARE twists that are difficult to predict, including the biggest one near the end. Yeah, Mos Def talks too much and his affected voice takes a few minutes to get used to. But he also provides the sentimental underside to this well-done movie."}, {"rating": "9", "text": "Bruce Wilis & Mos Def have great chemistry; the action was edge of your seat entertaining; David Morse played a great heavy - such an underrated actor. Got teary-eyed at the end. All in all, a great ride!"}, {"rating": "3", "text": "This movie doesn't lack solid acting or characters. Instead it lacks the most important element for any movie to be enjoyable... PLOT. I'm sorry if I feel that running around like a damn fool in a city filled with traffic and construction while putting a screeching halt all the action is a stupid movie... but I do."}, {"rating": "8", "text": "16 Block was the bomb nothing is going to be better for a while because of these fine points... Bruce Willis Mos Def made the whole thing real and there were great writers and a director involved i think nobody could have made a better plot and the acting was just top notch."}, {"rating": "9", "text": "Remember The Gauntlet? This is a good spinoff with great twists. Mos Def is a bit tiresome since he never shuts up. That's his role..."}, {"rating": "4", "text": "This Movie is so predictable that I felt no suspense or surprise in this movie. The film is very unoriginal and the cops chasing Willis seem to always guess the right place to look and this makes this film absolutely unbelievable. Mos Def is good Willis I expect Better."}, {"rating": "7", "text": "A moderately well-done action picture that does have something of a message."}, {"rating": "7", "text": "This is a movie where the more you think about it, the less believeable it is, still I really liked Willis as a drunk, broken-down, troubled cop, desperatly seeking redemption. I also liked Morse's villain. He obviously isn't a good guy, but he's not simply the one dimensional villain you almost alway see. There's more to him then that, as he comes off almost as the \"reluctant\" villain. Movie also delievers on the action. Having said all this I have to admit that I think they could have had an even better movie if they had made the movie about the Willis/Morse partnership, detailing their history together. This is a movie where filmmakers chose to make a movie about the less intersting aspect of the story, but it is one of those rare examples when filmmakers did that, but did it well enough to make it work."}, {"rating": "8", "text": "Great acting (Mos Def and Bruce Willis are brilliant), enjoyable script, satisfying action sequences and incredible direction help this film rise to the top of it's genre."}, {"rating": "4", "text": "My friends and I rented this to pass the time, and it made 99 minutes seem like an eternity. Mos Def, usually entertaining, was excruciating. That voice? C'mon! The plot was textbook corrupt cop BS and the \"twists\" were no better. Even the car chase seemed like slow motion. If you look at the reviews, the only thing people liked about this movie was that Bruce Willis looked old and unhappy. If you looking at depressed old dudes, this one's for you."}, {"rating": "5", "text": "I really wanted to like this movie -- and it does have some good performances & nice dialogue -- but after 20 minutes of listening to the grating tone of mos def's voice, it became more of an exercise in stamina for me than an enjoyable film. Some of the plot elements are fairly preposterous, and this also detracts from the overall \"watchability\" of the movie... David Morse gives a really good supporting performance and is an overlooked character actor who should get juicier roles."}, {"rating": "6", "text": "Standard action flick...nothing special, save for Mos Def and Willis. Both are pro. David Morse is thrilling as well, but the plot and cinematography fails the film."}, {"rating": "8", "text": "First, accept the fact that last year was a lean year for the movie crop. The main complaint most have of this movie is that it is \"formulatic\". Of course a block buster, cop drama will follow some formulas. This action movie has characters you can get behind, with lots of twist and turns--more than most in the genre. Better than most Bruce Willis movies, easily."}, {"rating": "3", "text": "A film made for no other reason than to make money. A waste of everyone's time and talent."}, {"rating": "8", "text": "A very solid action pic---Bruce Willis & Mos Def are at the top of their game. Worth seeing if this is your kind of movie."}, {"rating": "8", "text": "Very solid action film. Strong performances from Bruce Willis, Mos Def, and David Morse. After crap like Date Movie, and When A Stranger Calls this film seemed like a gem to me. It isn't anything groundbreaking but it is just a fun action film that will keep you on the edge of the seat. Most importantly it is FUN. Good film!"}, {"rating": "9", "text": "The plot seems very thin at times, but its not that detrimental because the character development is superb. It does drift into a few cliches now and then, but it is a very fun movie with a great cast. Bruce Willis and Mos Def have great chemistry, and David Morse shines. 16 blocks never drags along, its a well constructed piece of filmmaking."}, {"rating": "7", "text": "We never did learn what it was the bad cops did - only (if you interpret through MosDef's nasal whine) that it was wrong. The action scenes were well choreagraphed and exciting."}, {"rating": "3", "text": "Cosidering that Bruce Willis is in it, it could have been a lot worse. Predictable and obvious."}, {"rating": "4", "text": "My girlfriend fell asleep after 20 minutes. Bruce Willis should do another die hard or something.... and MosDef was funny but annoying after a while. It's a SOLID 4 outa 10...."}, {"rating": "7", "text": "This is a solid, unassuming action flick that borrows heavily from '70s bad-cop paranoia thrillers, notably Eastwood's \"The Gauntlet\". Willis, Mos Def, and David Morse are all excellent, with only the generic heavies dragging down the acting ship. Not exactly realistic but refreshingly gritty, with no over-the-top stunts or computer-graphics nonsense in sight."}, {"rating": "7", "text": "Bruce Willis looks like hell in this movie. He's virtually unrecognizable in the early scenes--balding, sweaty, sallow and giving every impression in the world that he's going to pull a Janet Leigh on us and croak early on. Thank God for that. Unlike Harrison Ford, who's still at his advanced age trying to convince us that he can fight and screw as efficaciously as he did when he first put on his Indiana Jones hat, Willis isn't afraid to sacrifice looks for characterization, and as he's done in everything from his signature role in Die Hard to last year's underrated thriller Hostage, is completely willing to show weakness, vulnerability, even fear. (No wonder directors as fundamentally different as John McTiernan and M. Night Shyamalan love him!) Willis plays Jack Mosley, a burned-out, alcoholic desk-jockey cop improbably ordered to escort loopy, addled criminal Eddie Bunker (Mos Def) sixteen blocks to court so that Bunker can testify in a crucial case; along the way both are perpetually boobytrapped by individuals whose lives would be far easier if Bunker DIDN'T make it to the courthouse. 16 Blocks follows the predictable Odd-Couple-dodging-bullets path already well-trod by 48 HRS., Midnight Run, director Richard Donner's Lethal Weapon, and (insert YOUR favorite example here), but the performances, a few genuine twists, and a surprising amount of real warmth make this solid meat-and-potatoes entertainment. (And never mind that it tries and fails to be a \"real-time\" movie like High Noon or Nick of Time. A viewing or two of TV's 24, which cheats like crazy, makes this film's logistical improbabilities seem like small potatoes indeed.) Def pulls off the harder-than-it-looks task of making his potentially irritating character truly endearing; it's part of the reason why, during the last minute of this movie, my audience actually and unironically cooed at the screen! And Donner does a couple of nifty pieces of action sleight-of-hand where you're led to expect Result A to transpire, but Result B happens instead with such suddenness you drop your popcorn. That's not all Donner deserves credit for: between the self-satisfied, inside-jokey Maverick, the bloated Sergio Leone-wannabe Assassins, the moribund Timeline (which proved that it really IS possible to turn a Michael Crichton novel into a snoozefest) and the increasingly lazy Lethal Weapon sequels, this is his best movie by far in over 20 years. (Only Find Me Guilty's Sidney Lumet prevents 76-year-old Donner from being the oldest-timer to currently have a commercial movie playing in theaters.) For some reason, great foreign directors like Kurosawa, Fellini, Bergman, Bunuel, Ozu and many others do some of their greatest work in their old age, while most of the all-time best American directors tend to stumble very, very badly. And I'm absolutely NOT in any way comparing Donner (who directed the first Gilligan's Island episode) with any of these guys, but it's interesting to note that if he chooses to retire professionally with this film, he'll have left the business on a far higher note than John Ford, Frank Capra, Billy Wilder or Howard Hawks managed to!"}, {"rating": "7", "text": "This movie is a good movie that took some chances. Some of those chances paid off well and some were borderline tolerant. Mos Def's voice in the film led me to near insanity at times, but his personality in the film had me laughing out loud in others. It had a solid storyline that kept me interested the entire film."}, {"rating": "8", "text": "This was a very enjoyable thriller, despite Mos Def's annoying voice."}, {"rating": "10", "text": "I think that the everyone gave this movie a low rating for ridiculous reasons. I really don't understand why people has to let something as simple as mos def's voice get in their way of enjoying the movie, personally I thought that his voice was kinda funny. I really liked the story and script for this movie, the directing was pretty good and the casting was perfect, no other actors in the whole wide world could have played any of the parts better than any of the actors in this movie. 16 blocks is one of the best action thrillers that my eyes have ever gazed upon. Why can't there be more movies like this in the theaters."}, {"rating": "9", "text": "A very very good movie, and like cannot believe that it has got these bad ratings."}, {"rating": "8", "text": "Not horrible at all. A classic cop-caper that had a fair share of tension, and gun fights, with little blood and guts. Bruce Willis plays a great drunken cop, who keeps you guessing about the justification of his actions. Mos Def surprised me by playing such a stereotypical character so well, and making himself seem so believable compared to the actor he is. The plot was safe if not a bit predictable and far-fetched, but it keeps one interested for the full 99 minutes."}, {"rating": "10", "text": "I don't get how you people give this great movie a score below a 7. I think it was very good and Mos Def and Bruce Willis did a very good job acting in it."}, {"rating": "6", "text": "A good performance by Bruce Willis makes up for a weak supporting cast. Although the plot does stretch the bounds of reality, the film generally moves along well with some entertaining moments."}, {"rating": "8", "text": "A action thriller that does just what is supposed to, gives us action and thrills. Mos Def is amazing and plays his part very well, while willis isn't as good but nonetheless good. A solid movie that does what it is supposed to do. I reccomend it"}, {"rating": "8", "text": "It wasn't a must see but I enjoyed it. Bruce Willis sometimes has a look on his face...an are you stupid or something type look. It's great."}, {"rating": "3", "text": "[***SPOILERS***] Waste of time. I COULD NOT get past the stupidity of it all. Jack had a phone.. couldve called ANYONE - mayor, DA, NBI to let them know he was being hounded by dirty cops attempting to kill his prisoner. Mos was surrounded by 100 officers 94 of whom didnt want to see him dead. No one was gonna shoot... HE should've told ALL of them instead of getting back on the bus... Jack had a phone on the bus.. and once again missed ANOTHER opportunity. I had to walk out, couldn't even finish watching.. has only happened one other time."}, {"rating": "0", "text": "can't stand mos defs voice for more then a minute."}, {"rating": "8", "text": "Very good movie. Bruce and def were great, and def's voice is so entertaining, lol. A lot of suspense and action, and the acting is great. Any Bruce fan, or a fan of good movies will do good to try out 16 blocks out."}, {"rating": "3", "text": "If your into an endless chase movie without any real plot or substance than this movie is for you. The movie runs forever without any fluidity to the storyline. Bruce willies, an over the hill detective, is forced to chose whether his going to line up with his old squad and eliminate a witness that is about to bring a lot of â"}, {"rating": "5", "text": "16 Blocks is a fairly descent suspense flick but not much beyond that. The performances are solid, as is the script. The action scenes are a bit run-of-the-mill but fit in well with the overall tone of the movie. 16 Blocks is not a classic by any stretch of the imagination but it will hold your attention for it's run time."}, {"rating": "8", "text": "Willis plays a burnt out old cop flawlessly. His character develops into a compassionate person who is drawn to do the right thing. A very good film to view."}, {"rating": "8", "text": "This is a good throwback action movie with an old school feel that I found very appealing. The pacing is good, the acting is good, and the plot quickly pulls you in. Definitely under-rated. If you like 80s-style action movies, check it out."}, {"rating": "8", "text": "Great and suspensful film. Bruce Willis acts his part well and the characters are well written. This story's going to take you in and show you the dark side of the police."}, {"rating": "8", "text": "i thought the movie was quite nice, mainly because of the reliable good acting work of bruce willis and that of mos def, who was quite a surprise by being the 'annoying' character and actually being likeable, which hasn't happened to me in a long time."}, {"rating": "4", "text": "Lost opportunities all around on this uninteresting film.\rWhat opens strong with the promise of interesting characters whose personal life will create uncountable chances for complication of a tale that sports an interesting premise, soon dives into the murky depths of mishandled stories.\rEvery decision made on action pieces, character development and sequence of events seems to be the wrong one. Complications are either forgotten, resolved fast and simply or avoided altogether (as are sense and logic for that matter).\rRichard Donner shows at several points that he is a very good director, specially during the wonderful sequence where the first shots are fired, but those moments soon dry out in the sterile ground of the uninspired and clumsy screenplay.\rBruce Willis manages to interpret his run-down cop convincingly, even at the more ridiculous moments, but all the points he gains for the flick are lost every single time his counterpart played by Mos Def opens his mouth. I've seen Mos Def in \"Be Kind Rewind\" and I don't remember having disliked him so violently, but in this film his every rendering of dialog is gut-wrenching turning him into a Jar-Jar-Binks-esque figure.\rOverall a sad experience for which I'd say that the cost of the viewing should be the deciding factor for avoiding or not this film, and only if you reaaaaaally like Bruce Willis movies and need to fill a gap on all you've seen from his filmography."}, {"rating": "2", "text": "All right, seeing as how the amount of blocks to travel is irrelevant to the actual plot, let's use that logic and assume that 16 is an arbitrary figure used to quantify anything on an immeasurable scale. Got it? Okay, let's begin -- this film has a grand total of: 16 lines of awful dialogue, 16 unmemorable characters, 16 boring action sequences, 16 predictable plot twists, 16 uninterestingly shot scenes, 16 terrible songs in the soundtrack, 16 cliches... Hell, if this film had 16 scriptwriters penning 16 script drafts, maybe it wouldn't be so bad! 16/10."}, {"rating": "4", "text": "This movie could have been great except that they cast mosdef or whatever his name is as the guy being escorted.  I can't understand half of what he says and he does nothing but mumble.  Despite Willis' great acting and an overall interesting or at least serviceable plot, I almost quit midway through because of that stupid clown's voice being so irritating."}, {"rating": "5", "text": "Bruce Willis looks particular bad as an unhappy aging cop with a drinking problem(drinking on the job! My My) who gets saddled with escorting witness Mos Def to a courthouse that is like sixteen blocks down the street. You might say, \"That isn't far at all!\", but some bad cops headed by David Morse make the going rough. And boy what do 16 blocks feel far.\r I had to blink for a moment to recognize Bruce for he looked thin and pretty sick with a white pasty face and red eyelids. For a moment he seemed at home as the rundown detective who gets through his day downing liquor and was expecting something of a reprise of his role in Pulp Fiction or Sin City. To commend Bruce, he does give it a try but unfortunately for him it isn't that kind of movie.\r While Bruce plays his role with verve the rest of the movie is something we have seen a gazillion times before. Which isn't bad really, but it would have been better if Bruce had been given something of a script that actually accommodates his role or they had settled for the action movie kind of thing and left that part out. Now it feels like the movie is flip flopping between the plight of a down and out cop and some silly action sequences.\r The movies does have some nice scenes involving Bruce and Mos when Mos learns Bruce that anyone can change for the better, but the Mos' role is maimed by the irritating nasal tone that someone has written into his character. As if someone wanted to undercut the character by making him talk silly.\r David Morse is a decent bad cop, but his role is so hammered shut that not even the greatest of actors could have done anything with it. The key scene is at the end when Bruce confronts Morse. How that works out I can't tell here, but it's isn't a pretty scene and what happens is totally unsurprising. I thought that Deus ex Machima were a no no nowadays.. but we get one in this movie.\r In the end the good cops that aided the bad cops get redeemed. Which is commendable, really. Not all cops are bad. At least: I hope not.\r The lowdown: despite the actors doing a good job, the story is just too much hampered by silly action scenes and some badly drawn characters. A pity really."}, {"rating": "7", "text": "Bruce Willis gives a certain awkward performance as the type of character he plays, and the simple premise of the movie soon gets a little drab. But, the high-anxiety action sequences and adrenaline rush a few good scenes provide makes up for the rest of this movie's flaws."}, {"rating": "6", "text": "16 Blocks was a good movie, the story is good, the perfomances too, but the currency of the story is slow, and it makes boring you, but I enyojed this movie."}], "recommendations": ["contraband", "parker", "jack_reacher", "2_guns", "the_italian_job", "collide", "run_all_night", "mechanic_resurrection", "the_mechanic", "bullet_to_the_head", "iron_man_2", "safe_house", "spenser_confidential", "alex_cross", "angel_has_fallen", "street_kings", "mission_impossible_iii", "a_walk_among_the_tombstones", "red_2", "wrath_of_man", "triple_frontier", "homefront", "knight_and_day", "rocknrolla", "shooter"]}