{"id": 506, "title": "17 Again", "starring": ["Zac Efron", "Leslie Mann"], "runtime": 102, "genre": ["Comedy"], "description": "On the brink of a midlife crisis, 30-something Mike O'Donnell wishes he could have a \"do-over.\" And that's exactly what he gets when he wakes up one morning to find he's 17 years old again. With his adult mind stuck inside the body of a teenager, Mike actually has the chance to reverse some decisions he wishes he'd never made. But maybe they weren't so bad after all.", "releaseYear": "2009", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/wqE9b0bdZsubI82zdX1ykLfPajh.jpg", "categories": {"plot": 6.473684210526316, "acting": 7.277777777777778, "ending": 5.666666666666667, "soundtrack": 7.0, "cinematography": 5.0, "familyFriendly": 6.0, "funny": 7.25, "action": 5.0}, "reviews": [{"rating": "7", "text": "After seeing both HSM and Hairspray, I thought Efron was some pretty boy singer, I came into this movie with low expectations but I was plesently surprised with what I saw. I never knew Efron could do comedy like this.Thomas Lennon steals the show as his rich but nerdy best friend who pretends to be his father. Matthew Perry still shows the same attitude as his character Chandler friends and Leslie Mann is a Darling in this film showing that she is more than someone in a Judd Apatow comedy. while it's not up there with other great comedy films, it's not at the bottom of the barrel Rob Schnider type of comedy either.I'd rent it first before you consider it worthy of your movie collection though."}, {"rating": "6", "text": "Every teen generation needs a good body swap/turn the clock back type of story and 17 again is one of those stories, Mike O'Donnell had it all. He was the star of his high schools basket ball team. He had Scarlet the most beautiful girl in the school as his girlfriend. Right before the game that could make him into a star, Scarlet tells Mike she's pregnant, Mike makes a drastic and life altering decision and runs out of the game to be with her giving up his chances of becoming a basket ball star, now 20 years later Mike's regretting it all and wishes he could do it all over again, and by some miraculous way he does. 17 again is a cool and stylish what if movie, brings to light the question of what if you could change your life, if you could live it all over again.What would you do different? That's the question this movie propose and tells with a grand lush style that resonates with the teen population and even with the adults too, 17 again is not just some teen movie, it's a movie that even adults between the ages of 30-50 would enjoy it, my dad sure did. But this film has it's flaws and some very minor bad dialogue from Zack Efron but nothing that would hamper this films style or production, but in my honest opinion this film was very good, this movie is not oscar worthy but it's definitely worth the price of admission."}, {"rating": "10", "text": "An awesome film about Mike O'Donnell (Zac efron) getting to be 17 again as he has wasted his teenage life, and wanted to re-do this particular part of his life. I absolutely loved this film, and it hilarious in some bits, especially Ned, who is Mike's best mate since they were small. 10/10 :)"}, {"rating": "9", "text": "This film is very entertaining and Zac Efron surprised me with his acting and comedy skills.  I thought he was very likable and I really liked the original story idea.  This film is hilarious and heart warming, and I enjoyed it a lot."}, {"rating": "8", "text": "17 Again is a fun entertaining movie with an interesting premise and lots of memorable moments. Its not brilliant in any way but is just a feel good movie that is easy to watch again and again."}, {"rating": "10", "text": "A Zac Efron movie?! Now you know it's gonna suck!.....THAT's what you think when you hear about this movie, but if you actually see it, it's an absoloute friggin' MASTERPIECE! :D It's actually one of the best movies I've ever seen, and this portrays Zac Efron in a new light and shows us that he can actually act! :) Plus, Judd Apatow's wife Leslie Mann is in this, so that's an extra bonus! :D!"}, {"rating": "2", "text": "Some middle-aged guy gets to be 17 again. Hooray. Watch him reclaim his wasted life. See him make a difference. What a movie."}, {"rating": "2", "text": "The sequel to Juno and Knocked Up in the decidely rightwing slant of Hollywood. underlying message is ANTI-choice, just like creepy Juno was. also, these type of \"I wish I could do it all over again, but hey I am still satisfied with what I got\" movie of the week flics are outstaying their welcome. Also the incest-not-incest kiss or lack thereof??? Jeeeeez, can we ask for a little bravery in film? What am i saying, it's a neo-kkkon movie delivering a neo-kkkon message Palin could be proud of (if she had the brains to understand even this hamburger, junkfood type movie) so, bravery? too much too ask for. 2 points for good supporting roles, although LOTR geeks? that's sooo nineties!"}, {"rating": "8", "text": "Surprisingly great, great acting, likable characters, and a good sense of humor make this movie shine, while it does have some flaws here and there with the conclusion (as you never see how he makes things right between him and his kids) as long as you don't over think it, you'll find this an extremely enjoyable comedy."}, {"rating": "9", "text": "Zac Efron says he doesn't want to be stereotyped as a high school student. But with his performance in this film, he may want to stick with it. The film is a sidesplitting comedy/drama fest. With a funny cast and highly-alive screenplay, everybody who grew up on movies like this will want to be 17 again."}, {"rating": "5", "text": "The Plot Is So Unoriginal! The Script Is A Copy Of A Copy..\rZac Efron And Michelle Trachtenberg Do A Amazing Job Acting That I Why The Movie Is A 5!"}, {"rating": "8", "text": "I really liked this movie. It isn't perfect in its execution and script but the theme, the theme is brilliant. I think it shows how little age means in reality. I think this movie is just a foretaste of the possibilities that will come with the rapidly approaching technological tsunami. People, fasten your seat belts and lead the instruction manual in front on the seat in front of you because we're shifting into high gear. But it's not only about that. It's a movie that manages to cut through the usual cliches and kitschy depictions of reality and show some really good values and ideals. And it is really very funny most of the time. This is after all a teenage and young adult comedy hybrid. I applaud the effort and the result."}, {"rating": "8", "text": "It's surprisingly good light hearted and very funny movie for me.. espeacially the Ned character, Hilarious! hahaha!"}, {"rating": "4", "text": "It was such an obviously poor copy of the themes in Back To The Future and Its A Wonderful Life. There is no way that Zac Efron would grow up to look like Matthew Perry . I didn't like the casting."}, {"rating": "7", "text": "I did kinda enjoy this film but what puzzled me was michael's childrens ages? it was 20 years ago when he found out scarlett was pregnant then how come he hasn't got a child of that age or at least 19? cos i believe his daughter was 17 like him and his son was younger? hmmm... was bugging me throughout the film."}, {"rating": "10", "text": "I thought this movie was truly amazing! It was so funny and zac efron is just wonderful."}, {"rating": "6", "text": "Cute but nothing spectacular. The fact that she acknowledges that Zac Efron looks exactly like her husband when he was a teen and doesn't put 2 and 2 together is a bit off. But, it's quite watchable and it does entertain."}, {"rating": "9", "text": "Loved it ... great characters , great story well constructed. Not one to laugh much at movies but this one had me chuckling at many places. See it!"}, {"rating": "9", "text": "A fun movie with some excellent performances, particularly by Efron."}, {"rating": "6", "text": "This movie has some refreshing wholesome attitudes towards teen sex and responsibility which is commendable. Zac carries this flick on his shoulders and handles his bizness well. You"}, {"rating": "7", "text": "17 Again is meant to be a movie to get a way to, and is filled with an enormous amount of laughs from Thomas Lennon (\"Reno 911!\"), the whole movie."}, {"rating": "8", "text": "I know it wasn't the greatest movie, but I kinda enjoyed. I know it is typical for a teenager to like it, but even my dad, mom, and little brother liked it. The movie was had a few laughs, and gives older viewers a taste of reality (how teenage life is today). I think this movie deserves even more than an 8, because it gives a good message, and has excellent acting. I think what they were trying to say was \"go for your dreams, but don't leave your responsibilities behind.\""}, {"rating": "7", "text": "To tell you the truth i underestimated this movie efron played a solid role and the characters were enjoyable to tell you the truth i like efron's acting when he is not dancing around and singing like a drama king."}, {"rating": "4", "text": "The movies was terrible in the sense of entertaining it, but the story line was so cliche and anyone could have picked out the next scene. It was over done, sappy if your into that."}, {"rating": "8", "text": "This movie is not getting the credit it deserves. It was entertaining and held your attention, but it also had a good message, so it was good for the whole family. Yes, it did have some bad words, but it made the people that were using the bad language look bad, so I liked that my kids saw this."}, {"rating": "0", "text": "I think there has already been a movie like this before and i hated that one too. I cant stand zac efron as well. He is made for musicals not movies."}, {"rating": "0", "text": "I just did not like it. The casting was most of it."}, {"rating": "5", "text": "17 Again is a fun movie to watch and better then I thought it would be. But the problem about the movie is that it has so many cliche moments that its amazing how many it has."}, {"rating": "9", "text": "The story was entertaining, but the real surprise was Zac Efron. He can act! Who could have guessed this Disney teen star had the chops? And the rest of the supporting cast are great as well, especially Thomas Lennon, who is beyond hilarious. Definitely worth seeing."}, {"rating": "7", "text": "Zac Efron is a great actor and has a great screen presence. No movies are going to be like Back to the Future again or It's a Wonderful Life. Movies like that are true classics same as Goonies, Stand By Me, etc. It was the era of the 80's. However, I do believe Zac Efron is going to be the next John Travolta and he is going to create classics for the 21st century and will be remembered by my kids as a classic."}, {"rating": "10", "text": "He's 17... again? WTF how did he do that? What is he like David Blaine or something? I wihs I could do that.. Can somebody tell what the scret to his demoness is?"}, {"rating": "7", "text": "The name of the high school is Hayden. Mike O'Donnell(Zac Efron) went there, circa 1989. That was the year Hayden Panettiere was born. That was also the year Nirvana recorded its debut album \"Bleach\" for Sub Pop. The target audience reads Hayden one way, while an older demographic group, especially those who love music, may read the name of the high school as a morose Neil Young-like Canadian singer-songwriter, who records confessional songs on his own label called Hardwood. Mike was a basketball star, and hardwood just happens to be the playing surface of most indoor basketball courts. Now let's talk about Mike. In David Seltzer's \"Lucas\", Charlie Sheen plays Cappie, the jock who protects the titular bespectacled insect collector from bullies. Similar to Cappie, the point guard had befriended Ned, the waterboy, a nerd, as Lucas was(Mike also befriends his nerd son). The same goes for Hayden, in all likelihood. Incidentally, Ned's last name is Gold(Thomas Lennon). Neil Young's best-loved song just happens to be \"Heart of Gold\". Meanwhile, the closest that Hayden got to mainstream acceptance was the college radio hit \"Girl of my Dreams\"(from his major label debut \"Everything I Long For\"), and in \"17 Again\", the nerd tycoon meets the girl of his dreams to hillarious effect. \"17 Again\", it must be said, is funny: arguably, even more so than the much hipper \"Adventureland\"(the M.C. Hammer dance tops \"Rock me Amadeus\" for time capsule honors, anyday). But it's unchallenging and predictable; \"17 Again\" breaks no new ground with this shopworn premise. For instance, when Mike's daughter gets amorous with the parental fresh-faced oldster, naturally, he rebuffs her advances. Interestingly enough, though, the daughter's name is Maggie(Michelle Trachtenberg), the same as Kerri Green's character from \"Lucas\". She and Cappie were an item. Since Mike is Cappie-like, a humble big man on campus, a referential subtext of lust for his daughter is able to fly under the radar."}, {"rating": "8", "text": "I thought the critics were a bit harsh on 17 Again. In my opinion, there was not one part of the movie where I wasn't entertained. And those kinds of movies are hard to come by nowadays. Two thumbs up! (Also, Zac Efron actually played his role well. I wasn't expecting that from him, after being tramatized by *gulp* High School Musical.)"}, {"rating": "7", "text": "This was the worst advertised film ever. Whenever I saw a trailer for this film all I could think was 'Oh joy, Zac Efron has a vanity project.' But I was very happily suprised. First, he can actually act! That was a massive shock. Also, he didn;t steal the spotlight as much as I expected. Granted he was the lead role but he didn;t overshadow any of the other talent in the film like Perry and Trachtenberg. Basically this film has managed to take something that could have been a shallow indulgence for pre-pubescent little girls and actually made a decent comedy film."}, {"rating": "3", "text": "Waste of time!! the story need a revision and the characters? not good."}, {"rating": "7", "text": "My fiance drug me to the theater to see this one and suprisingly, I was impressed! This is a good comedy with a pretty darn good performance from Efron! Give it a try and if you like it, great! If not, move on! I enjoyed it when I expected otherwise."}, {"rating": "7", "text": "17 Again (B-) - Normally I am pretty harsh on these teen romantic comedies - And no, its not original, but the acting was solid and it was fun and funny enough to make it enjoyable."}, {"rating": "3", "text": "A largely unfunny and unoriginal out-of-body comedy, with an important message to send to Hollywood: You can surround a cast with as many comedy pros as you want, but none of them are going help Zac Efron go down any easier."}, {"rating": "5", "text": "The first minutes of \"17 Again\" are proud to present a shirtless and sweaty Zac Efron. Now observe yourself. Observe yourself, real hard. How did that first sentence made you feel? Did it excite you? Discouraged you? Made you laugh? Anything? I ask you this because that feeling will most likely stay with you for the rest of the film.\r Now girls, calm down. I can explain the negative rating. You see, I'm one of the guys. How would you feel if you watched a movie about Vanessa Hudgens with nothing to be about except to remind you that it's starring Vanessa Hudgens?\r More reviews at: http://localmoviereview.com/"}, {"rating": "7", "text": "I had no expectations when I saw this film but this is a phenomenal film. Maybe I am just at the right age for it (I was 17 when I saw this) but it is hilarious. Zac Efron is surprisingly likable, possibly aided by the fact he is meant to be a lot older. Matthew Perry is funny when he partakes in different scenes but Thomas Lennon steals the show with fantastic expressions and just simple comedic timing."}, {"rating": "4", "text": "This movie seems to embrace how utterly cliche it is. Man has family with wife, daughter, and son. Kids don't love him, wife wants a divorce, blah, blah, blah. We've all seen it a hundred times before so I don't think I need to explain it further. But for literally no reason at all, the main character Mike apparently has some kind of fairy godmother who takes the form of a janitor (this is never really explained... ever). This eventually leads to him falling off of a bridge into a magical whirlpool and then turning...You guessed it... 17 again. Anyone who has ever seen a movie before in their entire life can guess how it ends, so If I gave away the ending, it wouldn't really be a spoiler. There aren't any twists or surprises whatsoever. I knew how it was going to end before I even started watching it."}, {"rating": "5", "text": "Without Matthew Perry, i would've given this movie lower score! But even though the story has flaws, i think its worth a watch... fun but decent! 5/10"}, {"rating": "0", "text": "Otro Troy tengo un primo que no aguanta tener un polvazo con el protagonista que trabajo en peliculas Gays ay dios mio ayudenme que asco de pelicula nada que decir de este pedazo de basura"}, {"rating": "2", "text": "This is not a movie about humans, it's about machines, I can't find it funny nor dramatically. If life would be that easy, no one could ever reflect on a mistake and there will be no regrets to think about, almost everyone will just do the same mistakes or worst again and again for like 17 times, until they just get bored and die."}, {"rating": "7", "text": "It's slight entertainment, something that you wont remember in a long time, but it still has its laughs and heart, which for a teen comedy, isnt it all that matters?"}, {"rating": "7", "text": "I have to admit I am not a big fan of Zac Efron, but I saw 17 Again expecting to hate it but actually it wasn't that bad. Yes, the story is predictable, yes the pacing is uneven and yes the ending is a bit of a letdown.However, there are a lot of redeeming merits. The soundtrack is excellent, and the script is surprisingly decent with just the right amount of quirky humour. The direction is good, while the acting is not bad at all. The characters are a little clichéd admittedly, but the actors do their best to make the most of their characters. Zac Efron gives a great performance in the lead and fits perfectly with the film's tone. Matthew Perry and Leslie Mann are both good too, but it is Efron's film all the way.Overall, not bad actually quite enjoyable. 7/10 Bethany Cox"}, {"rating": "5", "text": "Super predictable story but there was enough funny moments for it not to be a complete waste of time."}, {"rating": "7", "text": "Tiene una historia divertida y entretenida, además, la interpretación de Zac Efron es bastante buena."}, {"rating": "6", "text": "Good comedy. I'm even more excited because I don't like comedies, but I liked this one. I think it's a great idea. Nothing masterful, but in a nutshell I like the idea of the movie, that the main character goes back to his younger years and I still liked the ending in the finale, but I don't want to spoil it. So, for me, it's an above average comedy that I don't think will impress much, but probably won't offend either."}, {"rating": "6", "text": "Every now and then it stumbles, falls victim to clichés (even if it's self aware), and cuts itself too short, but overall, \"17 Again\" is a serviceable and likeable film that relishes in being charming and weird. It is one of the better high school/\"relive my younger self so that I can fix my mistakes\" films."}], "recommendations": ["the_duff", "my_spy", "easy_a", "10_things_i_hate_about_you", "zack_and_miri_make_a_porno", "no_strings_attached", "just_go_with_it", "friends_with_benefits", "alvin_and_the_chipmunks_the_squeakquel", "sisters", "the_break_up", "sandy_wexler", "pitch_perfect_2", "hannah_montana_the_movie", "the_game_plan", "second_act", "mean_girls", "juno", "bedtime_stories", "last_vegas", "we_bought_a_zoo", "night_at_the_museum", "blended", "the_pacifier", "the_babysitter"]}