{"id": 1571, "title": "1917", "starring": ["George MacKay", "Dean-Charles Chapman"], "runtime": 119, "genre": ["War", "Drama", "History"], "description": "At the height of the First World War, two young British soldiers must cross enemy territory and deliver a message that will stop a deadly attack on hundreds of soldiers.", "releaseYear": "2019", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/iZf0KyrE25z1sage4SYFLCCrMi9.jpg", "categories": {"plot": 8.142857142857142, "acting": 8.0, "ending": 6.25, "soundtrack": 10.0, "cinematography": 8.6875, "familyFriendly": 3.0, "funny": 5.0, "action": 7.333333333333333}, "reviews": [{"rating": "5", "text": "MediocreTL;DR Dull and boring but nice cinematography.Fail to make me feel the horros of war.Have a lot of cliche like every river in any movie have a waterfall.They basicaly walk."}, {"rating": "7", "text": "Epic war-opera with some amazing scenes, the screenplay won't win awards but the visuals should."}, {"rating": "7", "text": "While the (almost) one shot technique is clever, this movie sometimes felt like a first person shooter video game. I was never really invested in the characters. The score was also overblown in places taking me out of the scene. For a truly memorable film about WWI, watch \"Gallipoli\" instead."}, {"rating": "8", "text": "A powerful and moving war film showing the folly and futility of war. A few gripes I would have though; the distances and time required to get everywhere seems to have been shorted to move the film along, so from their starting point through the trench through no mans land through a German bunker to the German rear artillery positions takes no more than half an hour. Not quite enough mud and destruction everywhere either, the landscape would have been almost lunar in its desolation. Other than that a gripping and interesting film."}, {"rating": "9", "text": "A deadly drama. Breathtaking war film. I dont know who was the director, but they depicted 1st world war very well. There were 2-3second moments in the film which it can take you to think about it for 3-4hours, there were 2-3 seconds moments in the film that you can dive into it and stay here for 3-4 hours.. Yeah really deserved to take time and watch it !!"}, {"rating": "6", "text": "(Mauro Lanari)\"A strange game. The only winning move is not to play\" (\"Wargames\": Badham, 1983)A (suicide?) mission as an existential journey in the \"no man's land\" between two (enemy?) trenches, a \"zone\" which lies between the ghostly landscape of \"Stalker\" (Tarkovskij, 1979) and the endopsychic one of \"The Dead Zone\" (King, 1979; Cronenberg, 1983), a borderline area between life and death. This is the fascinating fulcrum of \"1917\", not the inevitable technical virtuosity in \"Oscar bait\" function and still less a too often shameless playstation perspective, but the odyssey to deliver the counter-order to cancel an attack, the sense of spatiotemporal suspension, the deliberate following of (almost) empty moments, the persisted stalemates, \"The Wrong Move\" (\"False Bewegung\") of circularity, and that's what differentiates it from the journey of the soldier Bardamu, of Captain Willard, of Commander Bowman, of Captain Miller (Spielberg continues to produce Mendes with DreamWorks). \"I am a poor wayfaring stranger / While traveling thru this world of woe\". A little beyond sufficiency."}, {"rating": "7", "text": "Sam Mendes' 1917 delivers some truly awe-inspiring set pieces with the aid of its one-shot effect, but fails to take advantage of it when trying to bring stress levels back down to Earth for its quieter scenes. Not only does it not take full advantage of it, but at times the one-shot becomes truly distracting and out of place due to wonky camera work. 1917's spikes of gorgeous tension make it a must-see film, just one that does not live up to its potential."}, {"rating": "10", "text": "TikTok TikTok.In the age of the cell phone, TikTok, meme & the quick & dirty convenience of it all, it's no wonder certain directors pine for the big screen.And if there's ever a movie made for that big screen, it's the cinematic masterpiece, 1917.Between the direction of Sam Mendes as well as his writing along w Krysty Wilson-Cairns, the immensely massive cinematography from living legend Roger Deakins, to the tick tock of a ticking clock score by Thomas Newman & the burning heart of British Lance corporal William Schofield played by George MacKay; their collaboration created a singular unique film which slows the heart as it races into the next second & then melts to a chill all the while it's exploding.There are a rare breed of film which fully submerge you into another world that once the closing credits roll & you walk out of the theatre in a daze, you're still there, in that other world.1917 is that film.And it's befitting to be the last great film released just before the pandemic & theatre shutdowns. If you missed it, purchasing the largest television you can afford is apt & necessary. After all, 1917 was made for IMAX, not iPhone. Run don't walk to view this instant classic, tick tock tick tock."}, {"rating": "10", "text": "I haven't been in awe of a movie in a long time.  Everything in this film is top notch from the real life locations to the huge cast of extras, but what really sells it is that the entire movie is essentially one big long take.  Every time I notice this movie on TV I'm enthralled and have to watch it to completion. It's just amazing how from the first minute you are watching every step in the journey of these men and it's fun to rewind in your mind and think back to which steps came before.  A work of art."}, {"rating": "3", "text": "C'est l'un des films de guerre les plus reposants qu'on puisse voir, voire même un peu soporifique... mais un peu seulement ! je ne voudrais pas entendre ou sous-entendre qu'il s'agit d'un film chiant à dormir debout, non pas, que nenni... (malgré tout de même quelques lenteurs inquiétantes) ! mais sa réalisation et son approche font que l'on survole tout cela de plus ou moins haut, détaché, ce qui conduit je présume à l'effet inverse de celui qui était recherché : loin d'être immersif, \"1917\" reste impersonnel et déconnecté des évènements...Comment est-ce possible lorsqu'il s'agit pourtant ici de l'une des guerres les plus sales, dégueulasses, meurtrières du XXème siècle ? eh bien, tout simplement à casue de ce long, très long plan-séquence de presque deux heures ! on a des films qui sont surdécoupés et montés comme des merdes, genre clip MTV kikoolol ou sale publicité pour je ne sais quel sous-produit de mon cul (emballé dans du papier-cadeau, s'il-vous-plaît) et ici, c'est tout l'excès inverse...On suit comme un hydroglisseur ou comme sur un tapis volant ces deux gars qui traversent la dévastation de la guerre totale : caméra souple et fluide, cadrage impeccable, travellings parfaits... mais pendant deux plombes ? on finit par se lasser et pourtant, c'est vraiment reposant... et un peu soporifique... à force. Mais quel beau défi technologique en tout cas, c'est assez sidérant à voir cette fluidité de tous les instants !...Hélas, la forme a fait oublier le fond, le propos et l'écriture elle-même... comme je le disais au début, on en ressort détaché et peu ou pas concerné... sauf peut-être à la toute fin, seul moment du film où l'on se sent connecté à ce monde (horrible !). Par ailleurs, on s'étonne de trouver ici un tel manichéisme, voire carrément une diabolisation, une stigmatisation des Allemands à chaque plan, chaque séquence... c'est réducteur et regrettable. C'est avec cet \"état d'esprit\" que la Seconde a vu le jour...Du coup, ça fait encore un peu plus baisser la note... car après tout, que reste-t-il à ce film à part son reposant plan-séquence exceptionnellement long ? pas grand-chose..."}, {"rating": "10", "text": "One of the Greatest War Films I've ever seen! Best War Film of All-Time since Lone Survivor, Sam Mendes did an awesome job Directing this film, Heavy Praise for the Cast, Action Sequences! Must see film! 10/10!"}, {"rating": "9", "text": "The first 30 mins is one story and one that might turn people off but the movie takes off and becomes a classic. Fans of The Revenant and Apocalypse Now should see this immediately."}, {"rating": "7", "text": "At the end of “1917,” Writer/Director Sam Mendes (“American Beauty,” the James Bond installments “Skyfall” and “Spectre”) dedicates the film to his grandfather, “who told us the stories.”  For a film so presumably personal, “1917” is surprisingly lacking in both passion and perspective.Rather than offering any sort of commentary about WW I or the conditions surrounding it, Mendes settles for a formulaic thriller.  Lance Corporal Blake (Dean-Charles Chapman) is summoned by his commanding general.  The allies have just received intelligence that their forces will be heading into a trap if they mount an offensive against the Germans the following morning.  Blake and Lance Corporal Schofield (George MacKay) must go through enemy lines to deliver the message to the field commander, located nine miles away, to cancel the attack.  If they fail, 1,600 men, including Corporal Blake’s brother, will be slaughtered.  The film follows the two corporals’ peril-filled trek to hand-deliver the order and save the troops.Technically, this film is impeccable.  Long shots have been a Hollywood staple for years.  They’re usually used to establish an environment.  In this case, long shots are used consistently to follow the action, offering a vast visual scope that is sometimes breathtaking.  The filming in “1917” is further complicated because Mendes often chooses to track the actors with a single camera that follows the action for several minutes and several hundred yards of movement without any apparent editing.  Given these challenges, “1917” is in many ways Cinematographer Roger Deakins’ movie.  Deakins has 80 credits as a cinematographer, dating back to 1975.  His diverse body of work ranges from “Blade Runner 2049” to “Skyfall” to “Fargo” to “The Big Lebowski.”  For “1917,” he is favored to win a second Oscar.  His use of light and shadow in this film’s night scene is nothing less than a master class.The acting is also first-rate.  As Schofield, George MacKay’s haunted expressions, stilted gait and thousand-yard stare communicate clearly the costs of war, with no need for exposition to underline the point.  Familiar faces Colin Firth and Benedict Cumberbatch lend their gravitas at key points.But ultimately, Mendes has made a war movie with a surprising air of detachment.  We learn little about the characters along the way, other than their single-minded determination to accomplish their goal.  We come to understand that this “war to end all wars” was intensely personal, with enemies often shot up close, stabbed or even strangled with bare hands.  But commentary about this fact, or any larger points about war or human nature, is absent.  As a result, “1917” is a war film that’s surprisingly bloodless."}, {"rating": "9", "text": "Please not another WW2 drama! But while watching this movie I was glued to my seat. Main characters are interesting, relatable and captivating. Was really a pleasant surprise."}, {"rating": "7", "text": "Spoilers - I enjoyed 1917 and it moderately rather than fully conveyed the horrors of living and fighting in trenches. George Orwell's Homage to Catalonia or Beevors Stalingrad convey it more effectively. Or just watch old footage and photos. Soldiers in trenches always get live, are slee and food deprived. They all looked a little tii clean and healthy. I thought the plot had a few gaping holes Why didn't they just drop the orders off by and? Plus I don't think the German pilot would have stabbed his buddy in reality. However it's a rip roaring adventure with enjoyable cameos from many British actor s at the top of their game. I enjoyed it and best viewed in the cinemaalwayss get"}, {"rating": "7", "text": "It is truly remarkable how both cast and crew pulled this together. It’s a filmmaking experience and achievement that should be recognized.I was able to catch most of where the cuts were hiding, there was one or two were I wasn’t sure how they did it. Very cool to see it all as a “one take”The strongest point of the film was audience identification with the protagonists. You learned and experienced everything with them. In that way the movie reminds me a lot of a campaign video game. There’s interactions and action along the way. It was a very immersive experience.The only part I thought was lacking was the emotional connection. I didn’t feel a great emotional high watching it. If someone is smart and applies this same way of filmmaking to a horror, apocalyptic, zombie survival type of movie then they will make big money. Because I believe this type of shooting shines in that suspenseful edge of your seat ride. Overall loved the movie! Well worth seeing in theaters!"}, {"rating": "10", "text": "To be honest this movie is my favorite movie of all time.I'd only suggest this if you're interested in this movie if you don't enjoy 1917 I can respect that.This movie is 10 times better than my second favorite movie and I'd only suggest good movies and videogames to people when there interested.in my opinion, it was worthed my money watching it a few months after launch and rented this movie once."}, {"rating": "9", "text": "Director Sam Mendes and the great cinematographer Roger Deakins give us an innovative edition to the war genre, with a one-shot style that has the effect of not only providing a captivating point-of-view of the young soldier, but also in making the Great War seem claustrophobic. The two leads McKay and Chapman each have their breakout role here as two soldiers we follow and identify with throughout their journey, and the cameos of veterans such as Colin Firth and Benedict Cumberbatch elevate the talent of acting in '1917'. Mendes and Deakins are one of the better creative teams in our modern filmmaking. To breathe new life into a dulled genre like war movies takes a true marvel but '1917' is just the film. I was engrossed, and I actually felt as if I was with the young soliders through their whole ordeal."}, {"rating": "7", "text": "About as good as Dunkirk, so if you thought that was a technical masterpiece then you’ll love this. If you thought it needed a more complex story then this may not be for you. I think both are perfectly fine, albeit not great, war films. Deakins is still king, though."}, {"rating": "9", "text": "Despite a somewhat slow beginning, this otherwise-gripping World War I tale, filmed ostensibly as one long continuous shot, takes viewers on a first-person journey through battle-ravaged France as two British soldiers try to warn their fellow troops about an impending trap set for them by allegedly retreating Germans. By bringing the war to the front row of the theater, audiences get to experience the terror of the conflict up close, a story capable of genuinely frightening viewers better than any of the best horror flicks on the market. The fine lead performances of George MacKay and Dean-Charles Chapman, combined by the stunning photography of Roger Deakins, the riveting score of Thomas Newman and the expert direction of Sam Mendes, combine to make this truly one of the year's best. The effect may leave you feeling a bit claustrophobic and shell-shocked at times, but then that's a sure sign the filmmakers have done their job."}, {"rating": "7", "text": "It's a good solid movie, but I felt was over-rated. The action is very predictable when it first happens - and too many stupid stops along the way. Ultimately, this is a short story that was made into 2 hrs. Didn't have the emotional depth or courage as say a Private Ryan or other war movies."}, {"rating": "10", "text": "Sometimes, once every two or three years a film comes along that once you have watched it, you cant stop thinking about it long after the credits roll.  A film so special that it tops everything you have seen in the last few years.  1917 is one of those films, it is truly specialThis is the story of two young soldiers who are sent out on a mission to stop a battle that will cost the lives of 1400 men.  I will not talk about anything that happens in the film, as I dont want to spoil it for anyone.It is one of the best paced films I have ever seen, you truly feel as though you are right there with the soldiers on their mission.  It is unrelenting, gritty and you feel the horrors of war.  It never gets boring and there is always something different happening.This film has to win best picture at the Oscar's, as surely no other film from this past year comes close to topping this!"}, {"rating": "9", "text": "A straightforward, but effective war movie about two soldiers who embark on a dangerous mission to save the lives of thousands of British soldiers during the height of World War I.  In a general sense, 1917 is somewhat reminiscent of Saving Private Ryan in that it gives its characters a clear goal with an easily discernible outcome. The film employs a technique that creates the illusion that everything is happening in real time with long takes. While this technique has been used in films with both small (A Boy. A Girl. A Dream) and larger budgets (Birdman), often with mixed results, it is very effective in this film. Even without cuts in the middle of each scene, the camera and action work so well together that the audience is always seeing what they need to see. That along with a very sophisticated use of CGI, makes you feel like you are right in the middle of the action. The result is an emotionally satisfying film with strong performances that doesn't let its use of technology get in the way of telling a good story. At just under two hours 1917 is the perfect length. You won't be bored and perhaps you will have a greater appreciation for the sacrifices made by soldiers in battle. Afterwards, checkout Peter Jackson's powerful documentary about World War I, \"They Shall Not Grow Old.\""}, {"rating": "10", "text": "1917 is a technical and cinematic masterpiece. Mendes masterfully shoots the grueling nature and aftershocks of World War I in an emotionally compelling and artistically moving way. The main leads are very likable and truly drive home the film’s themes about war and death associated with it. The score is great as well and it’s truly hard to find any huge flaws about this film. My favorite film released in 2019 for sure and definitely one of my favorite war movies as well."}, {"rating": "9", "text": "I gave up trying to figure out how the filmed it to look like the entire film was one continuous camera shot. Loved the courage of the 2 main characters, and the contrast of the young man on the mission vs everyone else who was just going along with war as usual. Wow. Quite a movie."}, {"rating": "10", "text": "1917 is about two World War I soldiers (George MacKay and Dean-Charles Chapman) who are given a very important mission: travel across enemy territory and inform the leader of 1,600 of their brothers-in-arms that they're walking into a trap. This is an incredible piece of cinema!!!This movie is really a ride with sort of a dreamlike feel to it as the characters are taken from one unpredictable situation to another unable to know if they'll encounter friend or foe.Director Sam Mendes already showed in Skyfall that he commands an excellent visual style but this is a whole other level. The movie is filmed to give the illusion of one full tracking shot. Every moment the camera looks like it's following the characters. It is quite an achievement. Besides the tracking, the film also does a great job of deciding what elements of the scene to focus on.The scenery in this is a thing of ethereal beauty. The characters travel through a constantly shifting landscape, from trenches to abandoned farms and so forth. Even the worse of environments look good. In my opinion, the war torn town at night scene is one of the best images in film history.The one aspect that didn't always quite work for me was the music. Don't get me wrong. it's not bad. The issue is that the tracking shot gives a very natural, engrossing feel to what's going on. Suddenly, the music will boom loudly and take you out it.Overall, I highly recommend this. This is a truly stunning flick."}, {"rating": "5", "text": "Has some good moments, but overall overrated.It's not really interesting watching two men run all over the battlefield, surviving when they really shouldn't, and portraying the enemy in the typical way they are portrayed in the past 60 years (automatons that can't shoot straight, are evil, and drop dead when the hero shoots at them once). If you're looking for a gritty realistic WW1 film, this isn't it.And it's a bloody shame, because the director obviously was aware of how to create great war cinematography. The large scale assaults are great to look at. If only the film had been more of a classic realistic war film with such scenes, rather than a largely boring film of a single man running through Germans in enemy held territory like James Bond."}, {"rating": "8", "text": "As far as war movies go, \"1917\" was a fantastic watch. The story was well written, it didn't blow my socks off, and while I anticipated some of the reveals (midpoint reversal), they still affected me, and it didn't at all take away from the experience. The dialogue was very well crafted, and there was only maybe one line that I thought was to on the nose. The visuals are from Deakins (a very well known cinematographer) and as always he is tremendous. While maybe not every frame is epic or grandiose, the visuals encompass the tone while also adhering to each scene's needs."}, {"rating": "6", "text": "This move does a lot of things really really well. The continuous shot concept is inventive and at times spectacular. Insanely detailed sets on a huge scale. MacKay and Chapman's performances are excellent. Sam Mendes and Roger Deakins create an intensely suspenseful and shockingly realistic version of World War I. However, it lags in a few crucial areas. Namely overall tone: It drums up a lot of suspense but then it also has a lot of repetitive and boring walking scenes. Production: The continuous shot concept kind of falls apart when it's not a huge action sequence. Especially when there's a lot of conversations happening at once. It's missing natural transitions and breaks in conversations. I get that it's based on a true story but aside from the soon to be famous climax this was a sort of interesting take on a largely uneventful story."}, {"rating": "6", "text": "The simplest storyline against the backdrop of great war it's more an exercise in high concept moving camera bravura filmmaking than a moving great war movie.  Wisely given a mission plot which creates suspense it also tries hard for emotion with the tried and true brothers in arms sentiment, but it seems the main motivation was to make a seemingly seamless one shot feature length motion picture with no editing which has been done before going back to at least Hitchcock but perhaps never to this level of technical achievement traveling through such distance and complex choreographed action.  While very impressive it doesn't make for the most impactful experience which cutting across time and space affords.  (There is one obvious cut and several transitions that certainly were used to disguise cuts, besides ability of VFX to now eliminate such.)  Hands down it should win the Oscar for Best Cinematography, but with big British stars only in cameos and unknowns in the leads the ride is somewhat diminished."}, {"rating": "10", "text": "1917 is possibly one of the best war movies I have seen. The cinematography is awesome, the one shot feel does not feel like a gimmick, it looks great. Flawless performances and a powerful bond between Scofield and Blake. This is a fantastic movie."}, {"rating": "10", "text": "Let's talk about 1917, Sam Mendes' new film is certainly one of the best of the year. Sam Mendes' straight-forward direction is surprising, it's a beautiful job. The plot is intriguing and the soundtrack is perfect. George MacKay and Dean-Charles Chapman are sensational, they are very clever interpretations that unfortunately did not get recognition in the awards season. Another aspect that deserves to be mentioned is the photography of this film, which is wonderful, the scenes are constantly showing the open and wonderful environment. The sound work is very well done. 1917 deserved the 10 Oscar nominations, it is an impeccable work of direction, acting, cinematography, sound, editing and soundtrack. 1917 is a film that deserves to be seen by everyone. Perfect."}, {"rating": "10", "text": "The camera movement brings audience into the movie. The overall acting and scene are amazing. One of the best war film. Must watch"}, {"rating": "6", "text": "Beautiful cinematography, but apart from it, it's only Call of Duty feat. Woody and chubby Leo DiCaprio"}, {"rating": "8", "text": "This movie does everything it's trying to do right but does something's it's not trying to do very wrong. The emotional wait of every scene in this movie is insane. Even though a lot of the movie is spent simply walking it somehow manages to make it incredibly interesting, when the real action starts it is really really good. The main issues I have with this movie are that it is quite slow to get going, it also has a very weird sence of time, they say it will take around 6 hours to make the journey but it is completed in 2. Lastly I absolutely hate how much motion blur is in this film, you cant look at anything except what the camera is focusing on, I actually came out of the cinema with a headache it was so bad (I didnt watch it in 3d) all in all a great movie with just some minor flaws."}, {"rating": "6", "text": "A film demonstrating style and technique over strong story telling. The result is actually quite slow and, dare one say, boring. This is a movie that does not match the sum of its parts. George Mackay is very good in the lead and Sam Mendes direction, whilst to be applauded on an aesthetic level, is lacking in pace. He has to take the blame for this as the one shot gimmick leaves little room to blame it on the editing. Roger Deakins' cinematography is an amazing achievement, and the production design looks like it should for a war zone/ battlefield. Sound is great when dealing with planes and explosions but simple dialogue is sometimes hard to understand. The score, although not hummable, works very well within the film and is very effective in underlying what is going on  screen."}, {"rating": "10", "text": "With all the precision of the takes and timing of weather and never using different locations for each scene is just a achievement itself. This movie did hit me on a personal note, my grant grandfather served for England in WW1 and he saw clips of the movie and now he is hooked and can't wait to watch the movie. He hopes it like the movie Dunkirk in terms of the story line. Lastly he wants to say thank you to the highest to the lowest of the cast and crew who worked on the film."}, {"rating": "9", "text": "The Father, the Son, and the Holy Spirit.  The director, the actor, and the cinematographer.  Sam Mendes, George MacKay, and Roger Deakins.This trinity of artists has achieved something truly special with their World War War I masterpiece ‘1917.’  There are good movies.  There are great movies.  And every so often—perhaps once a year at most, if we the audience may be so spoiled—there are movies that advance the art form beyond its present state, towards a loftier plane of existence.  ‘1917’ is indeed one of these movies.Upon seeing the film, words feel trivial in trying to characterize or describe in any meaningful way the experience that this movie provides.  Give director Sam Mendes a pen and a camera and there isn’t anything he can’t do.  Afford him the privilege of working with lead actor George MacKay and sublimity follows.  Pair them both with legendary cinematographer Roger Deakins and transcendence awaits.The “single take” effect in which the film is presented is not new.  Others have also done it to great acclaim, such as Alejandro G. Inarritu with ‘Birdman’ or Ilya Naishuller with ‘Hardcore Henry.’  But no other film has done it better than ‘1917’ and quite frankly there are few, if any films in recent memory, that have been so thoroughly exceptional in every other facet of the filmmaking process."}, {"rating": "10", "text": "There's movies, and then there's works of art. This is the latter. 1917 is nothing short of a masterpiece that is so real and visceral that you'll feel like you are a soldier in the war, and yet so beautiful that your breath will be taken away by every shot. Watching 1917 will emotionally-drain you, but in the best way possible."}, {"rating": "8", "text": "\"There is no sense of real danger, because the mission has to continue, if only to keep this impressive long shot going...\" I won't be clicking on a The Atlantic or a David Sims link again. SPOILER. One of the two soldiers on the mission die... How can you say there is no sense of danger. The other one nearly dies numerous times. Some critics are as dumb as a box of hammers."}, {"rating": "9", "text": "I don’t know if you’ll find a feature film that more properly captures the carnage left behind by trench warfare. The images are haunting and convey the horror of war more than any movie I can remember. Some complain the story is simple, but it really doesn’t need to be more complicated. The visuals are masterfully achieved, but I’m not sure the camera technique used was necessary or particularly affective."}, {"rating": "5", "text": "Roger Deakins is the most famous cinematographer working today, he gets movies made (finally got an oscar after numerous Coen movies, for BladeRunner 2049).  The big thing here is that it's supposed to be 1 long take, Birdman pulled it off a few years ago to great trophies, Children of Men is the gold standard of long takes.  Sam Mendes is a talented guy, he made the gorgeous Road to Perdition, then a lot of forgettable Bond movies, this is not impressive as a work of direction.  Colin Firth is always brilliant (best movie is A Single Man).  Honestly i got bored about 20 minutes in and just stayed there, the song ending the second act really drove that home. I liked the Rudyard Kipling quote \"He travels fastest who travels alone.\"  A much much better recent WW1 thing was They Shall Not Grow Old, it was amazing by Peter Jackson."}, {"rating": "9", "text": "Wow Great editing.. the feel of one (take) continues filming was different and nice"}, {"rating": "7", "text": "I saw it in an IMAX theater so it was great photography.  However, I saw flaws such: 1) Who milked the cow  - milk was in the pail but where did it come from?  2) All the building/houses were bombed out- didn't just one remain intact  3) When his friend died, the field took the military ID and later gave it to the brother  - but one purpose of the ID is to identify the dead  - ID is put into the mouth in order to identify him later on.  Not Oscar best picture material - only won the Foreign Press Golden Globe Best Picture due to British relevancy."}, {"rating": "9", "text": "1917 has a constant nervous tension that will grip your attention and refuse to let go. I think it must be mentioned among the best World War I films from now on. Aesthetically, the cinematography will remind people of Dunkirk, plus they blended long clips together to make it look continuous. In my opinion, that core concept does not cause pacing issues. The story keeps up at a decent pace and rarely lingers too long. With one main goal in mind, the plot is powerful and easy to follow."}, {"rating": "1", "text": "So WW1 biggest war of history....no action... in the biggest war of history No politics as every army had mutinies in WW1. People were slaughtered by millions for kings and generals. The WW1 ended with russian and german revolution.  This movie has nothing of WW1. Lost 2 hours of my life.They should have used this movie for indiana jones instead of aliens. THis is isn't a war movie ... or a movie . It's a spam"}, {"rating": "10", "text": "The movie was flawless, the one camera technique was EPICNESS, and by the way score of the year too"}, {"rating": "10", "text": "This was truly an amazing movie, and I loved the one shot camera technique too, And by the way George McKay was amazing in the film"}, {"rating": "9", "text": "Visually stunning, moving, frightening, heartbreaking, exciting and breathtaking. Go see for yourself, I did. You will not be disappointed."}, {"rating": "8", "text": "During World War I, two young British soldiers are assigned to cross enemy lines and deliver a message that will keep 1600 of their troops from being ambushed. While the mission seems virtually impossible, it's rendered even more incredible by director Sam Mendes' decision to shoot the film as if it were one continuous shot. Not only does this lend an urgency to the journey, but it boggles the mind to consider how some of the scenes were even staged/captured. The trek itself is full of setbacks that make the mission even more challenging for the soldiers and the viewer (if not a bit strained on credibility). Even though there is a continuous level of stress, the drama never has the poignant power that the story demands. As a result, this is a masterful piece of filmmaking that's impact is more technical than emotional."}], "recommendations": ["das_boot", "dunkirk", "full_metal_jacket", "master_and_commander_the_far_side_of_the_world", "apocalypse_now", "the_deer_hunter", "anthropoid", "deepwater_horizon", "close_encounters_of_the_third_kind", "first_man", "empire_of_the_sun", "hacksaw_ridge", "greyhound", "the_thin_red_line", "13_hours_the_secret_soldiers_of_benghazi", "in_the_heart_of_the_sea", "you_were_never_really_here", "allied", "cold_mountain", "the_lord_of_the_rings_the_two_towers", "the_master", "apollo_13", "the_great_escape", "the_monuments_men", "blade_runner_2049"]}