{
  "id": 72,
  "title": "2001: A Space Odyssey",
  "starring": [
    "Keir Dullea",
    "Gary Lockwood"
  ],
  "runtime": 149,
  "genre": [
    "Science Fiction",
    "Mystery",
    "Adventure"
  ],
  "description": "Humanity finds a mysterious object buried beneath the lunar surface and sets off to find its origins with the help of HAL 9000, the world's most advanced super computer.",
  "releaseYear": "1968",
  "mpaaRating": "G",
  "imageUrl": "https://image.tmdb.org/t/p/w500/ve72VxNqjGM69Uky4WTo2bK6rfq.jpg",
  "categories": {
    "plot": 4.7272727272727275,
    "acting": 5.9,
    "ending": 5.375,
    "soundtrack": 7.0,
    "cinematography": 5.75,
    "familyFriendly": 9.0,
    "funny": 5.0,
    "action": 5.75
  },
  "reviews": [
    {
      "rating": "10",
      "text": "The greatest epiphany? That the monolith represents the film screen itself, with its black rectangular appearance. And that the monolith is also depicted as the catalyst for change only encourages the notion that we actually evolve as we watch ourselves on the screen, and furthermore, BECOME what we see. And that's what 2001 is ultimately about; becoming. Constant becoming. Constant becoming through endless mediation. What will become of you when the credits finally roll? I, for one, became a pretentious film critic."
    },
    {
      "rating": "10",
      "text": "This movie is in a league of it's own. No movie throughout the history of film can come close to this. By far the most intense drama ever. A movie that comments on evolution, technology, time and space. Oh yeah, after 40 years, still as fresh as the day it was released."
    },
    {
      "rating": "9",
      "text": "This movie is probably the only of its kind. It is the kind of movie that combines wacky ideas with serious and realistic scenes. An incredible picture. Nobody could have done this better than Stanley Kubrick. One of the things I liked best was the slowness, and how there were 5-minute scenes just of a space pod departing from the ship. Kubrick is able to realistically portray outer space, and to create a beautiful film."
    },
    {
      "rating": "10",
      "text": "Watched it as a young kid, obviously thought it was just about the most tedious thing I'd ever sat through (ok I only got a third of the way through)......watched it again when I was 24, and haven't looked back since. Simply put it's one of those movies you almost feel obliged to pay homage to once a year. You hunker down in your armchair with a cup of tea, sandwiches, crisps a choco bar or two (it is a long film), dim the lights, lock the door and just devour the imagery. Its a wonderful movie, but I completely understand those who claim it's more like watching a screen saver than a movie, but that's what the cup of tea's for. There are moments when you just feel so completely at ease watching what is essentially artwork, others when you're provoked into thought's like no other movie can provide. It's a journey, sorry to be melodramatic, not a movie watching experience. And one everyone should make, it's not dated, despite it being, what? 40+ years old."
    },
    {
      "rating": "10",
      "text": "This is the greatest film ever made. Kubrick's masterpiece and one of the great works of art of the 20th century. A phenomenal testament to creative genius."
    },
    {
      "rating": "6",
      "text": "This film is... interesting. i personally can not argue with the impact this movie had and its heavy symbolism (most of which i do not understand) but this film was over hyped for me as people called it the best film of all time. And do not even get me started on the acid trip sequence near the end of the film, i got a splitting head ache from watching it. overall its fine but way too over hyped and personally confusing."
    },
    {
      "rating": "4",
      "text": "I must say I don't get the hype of this movie. I could not even see the whole thing in one sitting because i was having trouble staying awake."
    },
    {
      "rating": "10",
      "text": "I think this is the first and last time that cinema escaped the theater and became part of our mythological collective unconscious."
    },
    {
      "rating": "10",
      "text": "Aside from a couple nagging technical things, the tech and atmosphere depicted in the film is among the best in any movie ever. Extremely deep, enjoyable and uplifting. 11/10."
    },
    {
      "rating": "5",
      "text": "I have a really mixed feelings about the movie,on one had the visuals and the shots are simply outstanding very impressive and mind blowing, the carefully planned shots, the way the characters move in the spaceship the composition and mise en scene is just phenomenal.On the other hand the characters are forgetful, the story in the beginning and the ending is nonexistent, nothing makes sense, you can try and interpret it however you want which is something that is both positive and negative I took it the negative way for the simple reason that I laughed at those scenes of how it doesn't make any sense.The worst of all is the pacing oh god the pacing... you could shorten the movie by 1 hour and it still would be the same."
    },
    {
      "rating": "10",
      "text": "A cool film that I very much enjoyed watching. Exeptional directing from Stanley Kubrick and also exellent acting from Kier Dullela. It is very real considering in the scenes in space it is completely silent and the spacesuits are brilliant."
    },
    {
      "rating": "6",
      "text": "Ya film ini dari awal sampai akhir nonjolin satu aspek doang, artisitik. Kenapa jadi lagendari ? Dikeluarin tahun 1968 tapi teknologi nyatanya baru kita temuin di abad 22. Jenius , tapi ya sekali lagi film artistik yang penonton blockbusters 100% bilang \"aneh\". Legend"
    },
    {
      "rating": "5",
      "text": "To be honest, I hate 2001, because I think it tells its relies so heavily on its message that there's almost no story to tell. It keeps repeating its messages, that we have already recognized from the get-go, throughout its running time. Adding insult to injury, it tries to be riveting by showing how wonderful the camera work is,how mesmerizing the cinematography is, how fascinating the production design is, how masterful the editing is, etc. While all these technical points made this movie the most beautiful movie I've ever seen, instead of relying on the technical aspect, I think it should have engaged us with the use of narrative elements, such as a dramatic plot, well-wrought and fleshed-out characters, or in a worst-case scenario, a mysterious event or even character. Also, this movie is the most boring movie I've ever watched.(5.5/10)"
    },
    {
      "rating": "6",
      "text": "The beginning was great, music was fine but really not get getting what the ending is about....."
    },
    {
      "rating": "10",
      "text": "One of the most influential of all sci-fi films -- and one of the most controversial -- Stanley Kubrick's 2001 is a delicate, poetic meditation on the ingenuity -- and folly -- of mankind."
    },
    {
      "rating": "10",
      "text": "One of those masterpieces that you can hardly explain in words. Any word spoke to describe this movie may just be superfluous. This film is light years ahead of its time, still modern today and, in hindsight, frighteningly predictive. One of the greatest films ever shot by one of the greatest directors ever."
    },
    {
      "rating": "0",
      "text": "Probably the worst movie I ever seen. There is absolutely no story to tell just some random dialogue between the tragical performances of the cast. Each scene is 5min just spinning arround.. And some people dare compare this movie  with Nolan's masterpiece Interstellar. Pathetic!"
    },
    {
      "rating": "10",
      "text": "Timeless masterpiece!"
    },
    {
      "rating": "10",
      "text": "This film is surely the greatest accomplishment in the history of cinema both on a technical level and a storytelling level from the hands down the greatest filmmaker that America has ever produced. A film that demands to be seen on the biggest screen possible. Kubrick has practically destroyed the entire science fiction genre."
    },
    {
      "rating": "10",
      "text": "Absolutely a classic of film. The rich story does not give what it is about. It symbolizes that us humans are still evolving and that in order to achieve greater things, we must overcome what we know and keep dreaming. A movie that everyone one should see."
    },
    {
      "rating": "8",
      "text": "Acclaimed director Stanley Kubrick's SF masterpiece \"2001: A Space Odyssey\" is a conservative movie, asking the audience not to be amazed by the extraordinary visuals but the maturity and growth of a universal subject. The climax of the movie speeds up consistently and precisely with the breath taking cinematography of silence,and in the end....the movie itself becomes the universal subject."
    },
    {
      "rating": "6",
      "text": "A spectacular and metaphorically masterpiece. But unfortunately slow and boring.\r The first thing you notice while watching 2001: A Space Odyssey are the incredible visuals, that's so incredible. This movie is from the 60s, and I'm stunned by how awesome they made the film. We see astronauts in zero-gravity, spinning space ships and a lot more that I didn't think was possible in the 1960s. It's a deep and meaningful movie, that gives the audience a lot to think of, that's worth a lot! That, in combination with a mysterious feeling and much metaphorical scenes that means a lot makes this movie really unique. Those are the most important aspects of the film, but there are also many bad things. The worst thing is the second act, where nothing really happens and I was overall very bored. The space scenes in the second act are great but they're just too slow. It's the same with the characters, they are a bit vague and the conversations are boring. Even though the film is in my taste a bit too boring, is every scene important if you want to understand the bigger picture.\r In fact, I do like this movie, but everyone knows that a boring and slow film might not work with every individual. Especially not with me. The opening scene is fantastic, but it's too slow, but interesting. The best parts of the film is actually the beginning and the ending, they are both spectacular and fascinating. They should on the other hand have laid much more focus on the middle of the movie, it's to slow there. Of course, imagine seeing this film in the 60s, a time when most people haven't seen our Earth from above, it must have been something extraordinary! Well; it's a new generation now, and we want more action, but I bet I would have loved this Kubrick-movie it in the 70s! The best aspect of the film I forgot to mention is the soundtrack, so incredible! The sad thing is that it disappeared in the second act.\r 2001: A Space Odyssey is overall a great film, but the boring scenes are just too much for me. I recommend everyone to see this film twice, because there're many fundamental aspects of the film that you don't perceive the first time. The boring scenes does unfortunately lower my rating considerably.\r 6.8/10"
    },
    {
      "rating": "10",
      "text": "A beautiful and mesmerizing film. I'm surprised by the two comments suggesting it's outdated. 40 years after release the special effects and settings hold up better then most newer films and certainly better then any of it's contemporaries. It's biggest failures were not predicting the demise of Ma Bell and Pan Am and believing that landing on the moon actually was just a \"small step\"."
    },
    {
      "rating": "7",
      "text": "This movie was good.. anyone who thinks otherwise does not know a good movie.I think if you watched it at the time it should of gotten a 8 but for the modern generation i will be giving it a 7."
    },
    {
      "rating": "8",
      "text": "A film way ahead of it's time, it's scarcely beleivable it was made in 1968. The pace is slow and there is an excess of kubrickian unease, but for originality and visual impact this is a winner. There is a lot of thought-povoking material here"
    },
    {
      "rating": "6",
      "text": "A well crafted piece of art. Incredibly unusual last act! From \"Open the pod bay doors, HAL\" unleash the thrills and mystery of an influential, mind blowing adventure unlike any other, from prehistoric ape-ancestry into uncharted realms of space. Personally, I loved the middle, HAL was terrifying and unpredictable villain. Not everyones type of movie. The film ends leaving more questions than answers."
    },
    {
      "rating": "10",
      "text": "The first time I've seen this movie, I was boored and disappointed, because I had false expectations, but after awhile I understood the idea behind it: This movie tells a story of the development of mankind and shows the beauty and infinity of space. When you watch it, then you must absorb the atmosphere.\r This movie shows Hollywood, that a really good space movie should have an experience, which makes you speechless, when you think about it!\r Apart from some scenes, which are a bit too long for me, this movie is wonderful. When it came out, this technology revolutionized the filmmaking!"
    },
    {
      "rating": "6",
      "text": "Stanley Kubrick's \"2001: A Space Odyssey\" is often claimed to be the greatest and most influential Sci-Fi classic of all-time. Cases have been made for and against it, mainly whether the film is brilliant or boring. Which is it? Is it a brilliant, sacred jewel of cinema, or is it a dull, lifeless bore? In this case, it's not a matter of OR, but rather, a case of AND. \"2001: A Space Odyssey\" is both brilliant and boing, however not necessarily at the same time.\r Before an examination of both sides, a few points must be made Crystal clear. There are two absolutely essential qualities that must be exhibited to attain enjoyment: A persistent patience, and a clear, conscious open mind. If neither of these two factors are present upon viewing, the film will come off as an instant failure, thus remaining as a frail, distant memory.\r As I conclude this introduction, it must be noted that this movie is not any way, shape, or form a \"bad\" movie. There are spurts and shines of both brilliance and bore; however, it is up to the viewer to decide where and how these victories and faults outweigh the other. Now, onward to the actual review. Let's take a look at the cons first.\r CONS:\r Pace. Pace. Pace. Paint drying on a wall is faster than the pace that is demonstrated in this film. The momentum is excrutionally painful and abysmally slow, which serves as the prime reason for its downgrades.  For those who require a constant, accelerated speed for pace, this would be an ill-suited movie. For those who don't mind a slower progressing, trance inducing plot, this is the quintessential film.\r No emotional connection with any of the characters. At no point throughout the course of the film does the viewer feel any sort of liking, disliking, sympathy, suspicion, or annoyance for any character. They are all bland, with no exceptional quality. Kubrick should've known this, and it's an unfortunate shame that a movie as potentially great as this has this undeniable flaw.\r PROS:\r Excellency of 'Style over Substance': Despite the cons, \"2001: A Space Odyssey\" is a beautifully and wonderfully constructed movie. It is the pinnacle of movies that was able to escape the grasp of the basic fundamental concept of substance over style. Where it lacks in substance, it makes up for - plus more - in style. The effects? To say these effects were way past its time would be an understatement.\r The Famous Match-Cut: This, in my purest opinion, is the strongest suit for this movie's credentials. If unclear on what a Match-Cut is, Wikipedia defines it as \"a cut in film editing between either two different objects, spaces, or compositions in which an object in the two shots graphically match\" (this is often done to link a strong parallel between the two objects). Although the effects are seen by the general public as the film's greatest accolade, this Match-Cut can't be denied as the best in cinema history. The appraisal this sequence could receive should be endless, an even that wouldn't be enough. Starting with the opening of \"The Dawn of Man\" (literally), the segment spirals through the events of a tribe of apes being ruled by another, discovering the use of bones, and overcoming the tribe through the use of those bones. As the leader of the victorious tribe throws the bone in the air, it rotates in a clockwise rotation. Upon its coming down, the scene shifts from the falling bone to a satellite in outer space, 4 million years later. The scene that transpires is one that truly can not be put into words. The segment, along with the music implemented, unquestionably makes this one of the most appraised and memorable segments in all of cinema. Just that 5 minute work of art will make every viewer indulge deeply in thought to realize how far the human race has truly come.\r Cinematography: Time and time again, Stanley Kubrick is able to achieve perfection when it comes to cinematography. Every shot and every angle is executed perfectly without any sort of fault. What else should we expect? There's a reason why he's often labeled as a perfectionist.\r These are the pros and cons of the movie as I saw fit. This movie will not be viewed as awe-inspiring by all, but is definitely a journey that everyone must experience. As stated in the beginning of this review, \"2001: A Space Odyssey\" will be remembered  either as a life-changing endeavor, or a time-wasting, disappointing tease of what could have been. 6.25/10"
    },
    {
      "rating": "10",
      "text": "Absolutely astonishing. Fantastic film, despite being over 40 years old, albeit a tad slow. Very few films can stand at the level of sci-fi greatness that this films achieves."
    },
    {
      "rating": "9",
      "text": "Beautiful, deep and mind-blowing, \"2001: A Space Odyssey\" is definitely a film that needs reconsideration before blind criticism over its plot. The story is not linear and simple, but piled with lots of metaphors and symbols. The use of music is absolutely fantastic. I recommend it to everyone who loves to argue about philosophical topics and to everyone who just really like movies."
    },
    {
      "rating": "10",
      "text": "After watching this movie for the first time, i was mesmerized. It's a very simple movie, yet very in depth, some may say it's boring. From start to finish you will see art at it's finest. In 1991, this film was deemed \"culturally, historically, or aesthetically significant\" by the United States Library of Congress and selected for preservation in the National Film Registry"
    },
    {
      "rating": "0",
      "text": "I just wasted over 2 hours watching this guff.The first 5 minutes was LITERALLY nothing. A black screen with some noises. We're already off to a great start if I'm having to fast forward through the intro.The movie begins with some apes having a fight, finding a big Tetris piece and then freaking out. This part went on for far too long! 20 minutes into the film and we finally get to the space part. VERY slow shots of ships passing and spinning, once again nothing at all happening. And then some characters have a meeting, it's all very boring... Then they go to the moon 45 minutes in and see the Tetris piece from the ape bit before with slightly different context... I say slightly different as there's NO CONTEXT FOR EITHER! It's just Tetris block as ape or Tetris block as human. The humans try to take a photo of it and then it makes an awful racket and suddenly everything that had happened for the last hour did not matter in the slightest!We're at the part even people who know nothing about the movie know. HAL, this part had so much potential but it wasn't related to anything that came before it and it ended before it had the chance to explore it's full potential and make the plot work. Instead of being a big villain, HAL is beaten is about 4 minutes with no real fight or struggle, the entire time the movie is driving me insane with it's poor use of sound effects and strobe lighting. The movie gave me a migraine and that's no exaggeration. The lights on screen flashing, the repetitive noises were over the top and made this movie a nightmare for me.Oh by the way, when we're introduced to HAL and Dave and the other bloke we're completely taken away from the other cast. No one sticks around, it's like having a James Bond film where 45 minutes in James Bond is just not heard from again and we have to follow a bunch of other people instead and they're not having a Martini shaken not stirred and finding the bad guy, they're instead playing table tennis and we're expected to continue watching like everything is fine.Anyway, after this part the film flashed up an INTERMISSION screen for a very long time, I was debating whether or not to get myself a choc-ice at this point... And then we resume and after the HAL stuff happened the main guy gets attacked by more RGB lights than every Instagram post combined and then the film goes so far up it's own arse it becomes pretentious. The film explains nothing, says screw you and just ends with the main guy getting old and dying but becoming some reborn alien baby. WHAT!? I don't even have words for this, it's utter nonsense.The film has some incredible visuals for 1968 but the extremely slow pace, shots that just don't end, interesting plot points that don't get explored enough and pacing I could only describe as Grandma who's memory is degrading explaining something she once experienced, focusing in on every little detail for the points that don't matter and aren't interesting but anything with potential and excitement squandered away.This movie is a disaster, it's not a case of me not getting it and anyone who comes at me saying this cannot accept criticism. This is not a masterpiece, this is just a pretentious wankfest for pompous media students who think they're above everyone else for watching a film that was trying to have \"meaning.\"0/10 - If you've heard about this film being iconic and want to give it a try, DON'T!"
    },
    {
      "rating": "3",
      "text": "Probably out of all the well known mainstream films this is the slowest, it's also very cryptic and the final \"star child\" sequence is excruciatingly boring, torture to sit through. It has one redeeming factor HAL 9000, who is a great villain and if this movie had of had an easier to follow plot (or any plot at all) then maybe it could have utilised him to his full potential, the voice of HAL is just perfect, it has a real smug condescending sense of superiority to it and he has a great look, that red eye.This movie seems to be more appreciated for it's effects than it's plot (if it even has a plot) which is fine if people enjoy it good for them but personally I am after something different, I want a great story in my films not a great sleeping pill. 3 out of 10 for HAL and one scene involving him in particular."
    },
    {
      "rating": "10",
      "text": "An amazing film, a masterpiece, and easily the best science-fiction film of alltime. Kubrick never did any better than this unbelievable film, which does a rare thing; it looks as if it was made yesterday, but it challenges you intellectually like the rarest films from the distant past. This is my personal favorite film of alltime, and I would argue that it might be THE greatest film of alltime."
    },
    {
      "rating": "4",
      "text": "I like to think that I'm pretty open minded when it comes to different film genre's but 2001: A Space Odyssey is one of those critically acclaimed films that has just never connected with me. Yes, I understand that there is hiding depth and meaning behind the (especially at the time) beautifully crafted scenes but the slow pace, and running time of over two and a half hours, made it a chore to sit through. I'm all for cinema that does something different but I watch movies to be entertained and in that regard 2001: A Space Odyssey just doesn't work for me."
    },
    {
      "rating": "2",
      "text": "This movie is very slow, and two hours of ships docking, apes and about 4 minutes of the monoliths that the movie is about. If I hadn't read the book first, I wouldn't know what the hell was happening. Read the book, not the movie."
    },
    {
      "rating": "10",
      "text": "This is movie as art in its fullest and most stunning format. How Kubrick made this look so futuristic in the year of 1968 it beyond me and probably most people on this planet. How much is covered in the short span of this film. It might just be the only film that seems to cover the whole history of the universe in a film. Michelangelo, Shakespeare, Oscar Wilde, KUBRICK."
    },
    {
      "rating": "4",
      "text": "Too abstract to provide anything, Stanley Kubrick's \"masterpiece\" is an overlong, lifeless adventure with one dimensional characters and a terribly disjointed plot (if there is any)."
    },
    {
      "rating": "5",
      "text": "Honestly, I couldn't handle this movie at all. I only watched about 15 minutes of it, and after the second time I couldn't handle it. It just seemed very very boring. All I saw were monkeys going abe sh*t because there's a giant black...I don't know. A Bar? A Box? I don't know and I don't care. If this whole movie is gonna be quiet and weird than I don't think this is the movie for me. I'm just amazed that this was critically the best movie by Stanley Kubrick. I've seen some of his weird movies that I don't get and understand how people would actually like it. Like 'A Clockwork Orange' and 'The Shining'. The only movie I found very decent was Full Metal Jacket. I'm just gonna give this movie half credit for the popularity for the viewers and reviewers."
    },
    {
      "rating": "10",
      "text": "I would just like to comment on the amount of dumbasses out there. I just watched this movie tonight  which was made in 1968 by the way, and I am so blown away by this movie, that I am just really in awe of the amount of people that gave bad reviews. They just dont get it. Its probably not the best movie made in terms of effects but the message,captivation, the perspective , and intrigue of this movie by the best director who has ever lived (in my opinion) is so awesome, that Im still crapping my pants about it. To all of you idiots out there open your freaking eyes! Thanks Stanley.."
    },
    {
      "rating": "7",
      "text": "Stanley Kubrick's epic sci-fi tale involving monkeys, space, monoliths & a Russian Leonard Rossiter.The first two hours of the film are fine, yes it does drag a little here & there, but builds the story up nicely.The parts with HAL & Dave & Frank are, for me, just fantastic.You get a great sense of claustrophobia with the space suit scenes & the breathing being the only soundtrack. There's also something very sinister about HAL singing Daisy Daisy, with his voice getting lower & lower.Then the last half hour. I watched it again just to make sure I hadn't missed anything. Looking at some of the other reviews, it seems I'm not alone in missing the point of it. Total nonsense.Anyway, aside from that, it is still a good film which has stood the test of time 40 years on. Great visuals, brilliant soundtrack & very influential in the way sci-fi films were made afterwards."
    },
    {
      "rating": "9",
      "text": "2001: A Space Odyssey is an amazing science fiction film with astonishing, timeless effects. The movie manages to be quite terrifying without the use of action sequences or monsters (as is the want of modern sci-fi). Fear and wonder of the unknown makes for quite the potent mix. I love the fact that the ending is so inscrutable. It leaves you startled and uneasy with a total lack of understanding. But that's the way the universe is; totally beyond our understanding."
    },
    {
      "rating": "10",
      "text": "Best philosophical sci-fi movie ever ! It's amazing how it isn't outdated yet (except from some cloth-designs and haircuts); the slowness of the film is perfectly justified here (the pace of it reminds me of \"Moon\" ), and not a trick to mask the complete lack of ideas like in \"Monsters\" for instance..I saw it when I was 17, and was blasted away, and I still am."
    },
    {
      "rating": "10",
      "text": "Kubrick is undoubtedly one of the masters who made cinema with this classic film. The professionalism of the special effects note that what was used in 1968 could make something seem amateur even in 2011 (note that is a long 43 years after). Anyone who does not like this movie truly has an attention span so high that it could, alone, make them seem ridiculously immature. It is also worth noting that the film was so scientifically accurate. This is still an amazing film today, one of the best of all time. But it could still be very modern. If someone even had seen portions of this film before they knew the title, he/she would predict its initial release as probably somewhat recent because of how advanced every detail in it is. Genius."
    },
    {
      "rating": "9",
      "text": "The grandaddy of sci-fi, an incomparable experience of sense and of mind. Best to approach the revelationary details of the book afterwards, allowing Kubrick's sense of style and majesty to pervade the inner mind."
    },
    {
      "rating": "10",
      "text": "Kubrics epic masterpiece is one of the Greatest films of all time. It examines humanity's insignificance in the vastness of the universe. If you haven't seen this film, do so immediately. My advise? watch it in a dark room, on a big screen, with the volume up loud."
    },
    {
      "rating": "10",
      "text": "Very much one of the best Sci-Fi movies of the past decades. Amazing film and mind boggling ending. Definitely a must see film for every self-proclaimed film lover."
    },
    {
      "rating": "8",
      "text": "Such a Interesting idea, Jupiter and the infinite, and the mission and all those segments, unfortunately, when this was passed to a movie, it got a little bit boring and without action, I mean don't get me wrong i liked the movie, for that time, this was a very big step into the industry, but it should have been more interesting, like not only showing a lot of images and stuff, but like a little bit more action . I though the dialogues between Bowman & Hal were very well written, the idea of a automatically computer was awesome and very well structured. So once again Stanley Kubrick did a very good job, and this time he did the whole thing, not only the writing and the directing, but also the special effects, like wow."
    },
    {
      "rating": "10",
      "text": "This movie is a real piece of art, every movie director should watch this movie and realize that, make a movie is more than special effects or great actors"
    },
    {
      "rating": "3",
      "text": "Visually stunning but that is about it. There is very little dialogue and you could honestly skip more than half the movie and not miss a beat. 2001 would have been much better as a short film than a feature."
    }
  ]
}