{
  "id": 289,
  "title": "2012",
  "starring": [
    "John Cusack",
    "Chiwetel Ejiofor"
  ],
  "runtime": 158,
  "genre": [
    "Action",
    "Adventure",
    "Science Fiction"
  ],
  "description": "Dr. Adrian Helmsley, part of a worldwide geophysical team investigating the effect on the earth of radiation from unprecedented solar storms, learns that the earth's core is heating up. He warns U.S. President Thomas Wilson that the crust of the earth is becoming unstable and that without proper preparations for saving a fraction of the world's population, the entire race is doomed. Meanwhile, writer Jackson Curtis stumbles on the same information. While the world's leaders race to build \"arks\" to escape the impending cataclysm, Curtis struggles to find a way to save his family. Meanwhile, volcanic eruptions and earthquakes of unprecedented strength wreak havoc around the world.",
  "releaseYear": "2009",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/zaqam2RNscH5ooYFWInV6hjx6y5.jpg",
  "categories": {
    "plot": 3.9130434782608696,
    "acting": 2.869565217391304,
    "ending": 4.545454545454546,
    "soundtrack": 3.0,
    "cinematography": 3.0,
    "familyFriendly": 2.6666666666666665,
    "funny": 2.0,
    "action": 4.0
  },
  "reviews": [
    {
      "rating": "2",
      "text": "I just wasted 2 and a half hours on this rancid film. How Roland Emmerich keeps making bad blockbusters with seemingly no accountability for them is a mystery to me. The main characters are painfully bland. There is no chemistry between any of the actors. Absolutely no character in the movie was developed. All you get is eye candy(CGI) and scenes that will make any physic professor reel in horror."
    },
    {
      "rating": "0",
      "text": "The fact that this movie made it to the big screen proves without a doubt that the human race is in fact doomed. It is truely depressing to see that so many of my intellectually challenged countrymen enjoyed this. All copies of this movie should be destroyed and everyone who had a part in creation of this visual filth should be banished to an island to prevent them from making another movie as terrible as this."
    },
    {
      "rating": "1",
      "text": "Before seeing this movie, I already knew what to expect, a few death defying moments, some \"wow, this is impossible\" survival tactics, and stuff getting messed up, when I actually saw the movie, it left me with a \"been there, done that\" type of feeling. The entire family aspect of the movie was garbage. Everytime they showed that family on the screen made me want to turn it off. It seemed like everything went exactly perfect for them. Every thing feel exactly into place, and they are surviving all of these outragous scenes while the other billions of people in the world are dying. Really? That's bull. The entire movie wasn't horrible, a lot of the speeches between family members (ie. Father-son, father-daughter, grandfather-granddaughter) scenes were extremely good, aside from the main family of course. It just seemed too happy ever after for me. All of the people in the movie that most people would want to kill of end up dying while the main family stays perfectly fine. A load of steaming \"our family can survive anything\" dog crap. Take the main family our of it and its a really great film, but seeing how it was geared towards them, really blows."
    },
    {
      "rating": "0",
      "text": "This movie was a hideous mess and particularly painful because of its length. What went wrong with this movie? Everything."
    },
    {
      "rating": "0",
      "text": "Oh my god so horrible boring, action with this horrible patriotic we will save everyone feeling, sorry but fire loud and boomboom with expensive special effects is not exiting in this setting. today not acceptable anymore."
    },
    {
      "rating": "1",
      "text": "Released a bit late in certain cities in India. But save your money and time at least on this one. I am sure this question must have been answered 1000 times. But why is the American family always portrayed to be dysfunctional? And the kids, why do they pass judgment about everyone? It becomes too predictable. There is nothing left for your imagination and the excitement..YAWN."
    },
    {
      "rating": "0",
      "text": "You can count on a Roland Emmerich disaster film to be a disaster. In the tradition of his '10,000 BC' and 'Godzilla', '2012' stands as another badly acted, incoherent, poor science, awful CGI, and overlong film. Undoubtedly it made a lot of money in its initial release because that is what Emmerich does best and will continue to do. I really tried to like this film. I did not expect 'Citizen Kane'. But this film is awful in it's impossible misuse of every science in the known universe. If you must watch this film, do it as I did: Consider it a comedy. You will laugh yourself silly. I will spoil it for you right from the start: Ask yourself how John Cusak can drive with 2 young kids in a limo from southern California to Yellowstone National Park, back to southern California, and then back again to Yellowstone National Park in 2 days. Destined to be a midnight cult classic of bad filmmaking."
    },
    {
      "rating": "4",
      "text": "Very good premise, expertly ruined by the director who loves to destroy America, but make them look very much the patriot. we have the President who will not leave his lawn, because he is the hero, yet our Queen is on the 'boats' with her beloved corgis. the cast are okey, but we have the typecast people we have all come to know and love in these films, and anyone who stays with the dos lives!! despite the admittedly good effects, this film isn't about humanity and people coming together as one, this is about Cusaks charachter and all the people who have caused him harm, dying in fantastical ways. it's way too long, relies too much on effects and not plot or script, and the ending and final lone are vomit inducing. not a very good film"
    },
    {
      "rating": "5",
      "text": "I love mindless destruction. I really do. I don't like mindless destruction when it's the same 'OH MY GOD IS THE PLANE GOING TO MAKE IT' bullshit every 10 minutes for 3 HOURS. Yeah, there were some cool scenes of destruction, and Woody Harrelson was hilarious. But for the most part it was painful to watch. and yes, while I did say some of the destruction scenes were cool, most of them looked like rubber falling apart. Ugh. fuck this movie."
    },
    {
      "rating": "4",
      "text": "I give this movie a 4. Why because it focuses way to much on the special effects and way to little on the story and character. You barely get to any characters. The only character they really tell you about is Jackson Curtis. Other characters like Charlie and the U.S President made the movie exciting, but the others just made it crappy. Don't go and see this movie. It would be a waste of you time."
    },
    {
      "rating": "4",
      "text": "I thought that this movie was going to be the best movie ever but after sitting in the theater for 2 1/2 hours i was like why the heck did i come here. It was like Transformers all over again. The only reason i gave it a four was because of John Cusacks acting made me want to stay and finish it."
    },
    {
      "rating": "4",
      "text": "The special effects were amazing, but the movie had too many flaws. First, it was very depressing, if you want to see GOOD people die over and over again, then be my guest. Secondly, the characters were boring, so you have to see the boring first half before things get destroyed to really feel how boring the characters are. Finally, the movie is very unoriginal, the whole movie is a modern day Noah's Ark, in almost ALL ASPECTS. I haven't been disappointed in a movie I was looking forward to in awhile."
    },
    {
      "rating": "3",
      "text": "This movie has way to much death. It's also really sad. I say there is to much death because the president , pope, and pretty much all of California dies."
    },
    {
      "rating": "1",
      "text": "my rating is ONLY for the visual graphics as for the story line it just seems so ridiculous that the whole plot is a family running away from the world. It doesn't address any issues or cover any of its flaws like how everything miraculously appears before the protagonists e.g the jet being there just in time. Anyway I just wanted to say I will see you all in 2013, when someone decides to make a real movie."
    },
    {
      "rating": "1",
      "text": "I don't know why the main characters have to dodge death twenty times in the movie. Its a disaster movie so i'd expect one or two times where death is avoided only by a few feet...but wow it felt like every other scene in this movie. i'll give it a score of 1 because the special effects were pretty cool. the writing and acting were terrible though. why is there always some snotty kid who calls his father by his real name? that right there, is the question."
    },
    {
      "rating": "0",
      "text": "Nearly as bad as \"Speed 2\". For example, the family just make it into a plane and just manage to take off, and just avoid falling buidlings / trees / mountains in the plane - 3 times. It was like de ja vu all over again."
    },
    {
      "rating": "0",
      "text": "Two... hundred... million dollars! FOR THIS?! After stopping it twice, I finally watched it through to the end simply through morbid curiosity, and now I'm genuinely infuriated at it! I'm going to the DVD store and asking the shy timid counter boy for my money back at full volume!!! Then I'm going to buy all the copies they have and BURN them in a fire out the front of the shop so that the stupidity doesn't spread any further. Then I'm going to find out where the director, the writer AND the producers live and have them all savaged by starving komodo dragons until only their molars remain.... Every terrible cliche was there... the black president, the doombringer scientist, some idiot saying \"By God.... That's impossible!\", the lowly scientist being sent straight to meet the President, the useless divorced husband winning the wife and kids back.... I am now certifiably down to 50 IQ points with the rest of the people who watched this piffle. They should rename it \"Daddy Runs From Armageddon\" in reference to the six, count them, SIX times Cusack drives a car, a plane, a campervan or whatever.. out of the incoming firestorm/wave/pig stampede. It now tops my list as the worst movie I've ever seen."
    },
    {
      "rating": "2",
      "text": "If my review were based only in special effects, then the movie deserves 10/10. However all the good effects are lost in a lame and unrealistic plot; some humor is also injected in disastrous situations which is totally unnecessary. The main characters never suffer a scratch and they made it to the other part of the world, where everybody else...well...dies. Silly movie. Please skip this one."
    },
    {
      "rating": "3",
      "text": "Continents displace, super volcanoes erupt, cities vanish, tidel waves swallow the Himalayas...every distaster you could possibly imagine is in this movie...except one that shouldn't be....THE SCRIPT!!!!!"
    },
    {
      "rating": "2",
      "text": "Just real bad."
    },
    {
      "rating": "3",
      "text": "Although I enjoyed the great CGI and all the explosions and firey balls of doom, the script was just so cheesey it was unbearable. Any movie with the lines 'it's a suicide mission!' and 'we have to wait for dad!' (right before he pulls him self from the bottom of a crevasse) is just bound to be crap."
    },
    {
      "rating": "1",
      "text": "What a waste of time. Whoever worked in the dialogues and the story of this movie, please don't disappoint us again or please just change career. I give it one point because I had a good laugh at the joke of the Russian guy in the car."
    },
    {
      "rating": "2",
      "text": "Very poorly paced movie. This is not Independence Day, no matter how hard it tries to be. There is absolutely no sense of humor or humility in this film. Save your money and time, and wait for the actual apocalypse... it is sure to be more entertaining."
    },
    {
      "rating": "2",
      "text": "Are you kidding? 2 and a half hours.. 8 dollars... and 3 planes barely taking off as the runway collapses later... im still bored.. This reminded me more of a movie spoof than an original thriller. Special effects weren't bad but it lacked any sort of captivating story or believable scenarios."
    },
    {
      "rating": "3",
      "text": "I would of preferred a more serious/realistic movie. But what I got was a dumb action movie with nothing more then special effects."
    },
    {
      "rating": "1",
      "text": "Just pure cheesy. Nothing is believable as the suspense is lost within 5 minutes into the movie."
    },
    {
      "rating": "2",
      "text": "Good effects, but the humanity speech by the geologist at the end was a predictable bunch of Hollywood do-do. The movie was trying to be a thriller about what could really happen, but instead, just layered cliche upon cliche. What a dud."
    },
    {
      "rating": "5",
      "text": "I have to admit that it was kinda fun to watch **** be destroyed in this movie and all that, but besides that it's nothing more nor nothing less than one big mess of special effects. The story is way to predictable, it overuses close calls way to damn much. But i do have to admit that some parts in this movie actually managed to surprise me. Besides all of this, this movie still delivers what it promises, it's stupid and all, but all in all it's still one hell of a joy ride."
    },
    {
      "rating": "10",
      "text": "I never expected this movie to be realistic and to have a perfect plot and script because it's an end of the word movie guys ... don't be so harsh. It's an action movie with great special effects that can be enjoyed. To all the critics that gave it score 2 ... the movie had just a bad story ... but it has suspense, originality in how would the world die and be reborn, ok actors, great sound, great special effects. Why do you ignore the qualities. This movie deserves minimal 6 score for it's qualities and I give it max score. Since the story and the realism you dislike are exactly what I would have expected."
    },
    {
      "rating": "0",
      "text": "Awful movie with poor acting and story."
    },
    {
      "rating": "2",
      "text": "It was basically the \"Dude Wheres My Car\" of disaster movies, plus it was too long, they could have chopped off 50 minutes and it still would have made sense."
    },
    {
      "rating": "5",
      "text": "\"2012\" is a disastrous movie that you wouldn't want happening to you. Think about it; Decent CGI buildings following down with cliched people running around with limousines and hiding inside **** arks. Hell, I don't want that happening...."
    },
    {
      "rating": "3",
      "text": "The film was nothing more than another Hollywood publicity stunt driven by special effects. And the effects weren't spectacular anyway. The effects looked cheap, rushed, and was the only thing that was keeping this movie alive. The major downfall of this movie is that it was made to begin with. Not even great actors like Danny Glover could save this movie. Spending the entire time in a russian plane trying to escape disaster? Get real."
    },
    {
      "rating": "3",
      "text": "Way too long and actually uninteresting. Predictable and terribly scripted, too with way too little self-aware comedy. No emotion and only one bright spot being Woody Harrelson"
    },
    {
      "rating": "8",
      "text": "I can't say it was an extremely amazing movie, but I can neither say it was a movie I didn't enjoy. The only problem was, of course, the multitude that went to the movies the same showing I did... God, I remember more the hisses they made than the movie characters' names."
    },
    {
      "rating": "1",
      "text": "I give it a one because it has a great premise. That doesn't save it from being the STUPIDEST movie I've ever seen in my life."
    },
    {
      "rating": "3",
      "text": "One of the worst Emmerich movies. Such a waste of money."
    },
    {
      "rating": "2",
      "text": "The neighborhood theater"
    },
    {
      "rating": "7",
      "text": "The effect in this movie is awesome. The storyboard is quite good, if i was a scientist, yes i would say that it can be happen on our world. But the things that disappointed me the most was the \"LUCK\" factor of the main character on this movie, i don't know why, i just feel they all was too lucky to be alive in that condition."
    },
    {
      "rating": "4",
      "text": "Here we have an example of how to make a disaster movie. The formula is simple: add a boring plot that is completely science-fiction; slap on dull, uninteresting characters; and finally, make the story so ridiculously predictable that you can tell what is going to happen at the end during the first 40 minutes. While the special effects are incredible (easily some of the best I've seen in a movie), it suffers from bad characters, a dull story, and it's overly long length."
    },
    {
      "rating": "3",
      "text": "This movie is brain damage on a projector screen. The special effects were clumsily misused so that rather than making something intense and interesting - it's boring and predictable. Cut the special effects from this movie and you are left with very little. But blaming the film makers is simple minded, it's the retarded adult movie goers who are to blame by watching and then letting these film makers get away with this rubbish. We actual could have a better film industry with better movies if people had bigger minds and weren't so easily entertained by this laughable joke. LAME."
    },
    {
      "rating": "3",
      "text": "This movie is exactly what's wrong with most CGI-driven blockbusters. There is no character development, the acting and dialogue stink, there isn't a single original idea in the whole movie and it relied too much on bad science moments. Unimpressed to put it lightly."
    },
    {
      "rating": "1",
      "text": "A movie where you find yourself laughing where you shouldn't have been laughing. It's in the film that you find yourself laughing at parts that are unintentionally hilarious, due to sloppy writing and the usual special effects driven trash. There's almost nothing in this movie to review, it was just a 2 hour coma, occasionally interrupted by a couple of special effects sequences, all of which are ridiculous in nature, and all of which look less and less impressive each time we are shown them. The characters are painfully bland and uninteresting, no depth to them whatsoever. Emerich's previous film in the disaster category; The Day After Tomorrow, should have been a clear indicator that the guy can't write inspired disaster films very well.There is far, far too much emphasis on special effects in this film. One thing that also intensely grated me was when I watched a trailer for this film, with the bold assertion on a title card \"It could really happen\". Sorry, Emerich, but when science and the Mayans themselves attach no special significance to 2012, don't try and think you can market your film as being scientifically supported and expect me to swallow the kind of **** you're selling. You did the same with The Day After Tomorrow, I didn't fall for it then, don't expect me to this time. Try making good films, Emerich, you might learn something."
    },
    {
      "rating": "3",
      "text": "(January 14, 2010)Are you ready for the year 2012? So many venues claim that come 2012 the world as we know it is going to come to an end, so why not make a generic, soul less, explosion happy film about it?When I first heard that a movie was being made based off the happenings of 2012, I had hope that it would be more than a cliche end of the world movie, and actually go in depth on the behind the scenes topics of the year. Sadly clichÃ"
    },
    {
      "rating": "2",
      "text": "Well, people justify a positive review by comparing this film with common movies made in Hollywood, and recently baked ones. Exactly, presently made in Hollywood. Except the universe is not Hollywood neither cinema was born today. If you still believe cinema was created a few years ago and you think the film industry gravitates Hollywood, well, you're wrong and you probably ate too much popcorn. You'll love this one if that's the case. Not in case, you'll only taste a synthetic audience statistics bombastic and orgasmic glutton of a C series packed with good actors. That's all, you'll be hungry few minutes after you've seen this rubbish, and when you get home you'll be pissed for wasting your money, believing in fairy promotional cultural religious tales. But as you said, it's Hollywood!"
    },
    {
      "rating": "3",
      "text": "So, John Cusack, Oliver Platt and Zlatko Buric are total dabblers in acting and Roland Emmerich is completely untalented in terms of writing. But  2012 is no 0-points-movie. There are some nice actors in this box-office-success and when the German director is making whole LA drown, it is impressive. But this movie is just unfavorable. This so damn overlong film is fully packed with buildings crumbling, waves overflooding great areas, earthquakes destroying whole cities and CGI everywhere. Too much of that, Mr. Emmerich! I have to grant him that he managed to put emotion in it with the family stuff surrounding John Cusack's role. This guy totally sucks at acting and his movie kids relegated him when they were playing together, but this one particular scene at the end of the movie touched me. But for all that it's not really hard to make such a scene emotional when you've got a nice soundtrack and a near-death-experience with a family as the story. So, is 2012 worth watching? Not really, because the FX aren't that good to make you enjoy the movie (I just overthought the movie and I get that you can never really enjoy a movie with such a plot!) and the dialogues are plain stupid. However, it's not that bad because of some nice actors and good editing, score and cinematography stuff."
    },
    {
      "rating": "2",
      "text": "You know a disaster movie is bad when disasters become a part of the main story. Here, the false-predictable 2012 had its moments before the disasters start striking. After we see the first disaster striking by the shop, that's where you know you have to quit watching it."
    },
    {
      "rating": "8",
      "text": "Deutsche Review - Kritik\r Story: 18/25 Punkte\rSchauspieler: 24/25 Punkte\rTechnik/ Bildbearbeitung: 23/25 Punkte\rSound: 18/25 Punkte\r Gesamtpunktzahl\r 83/100 Punkte"
    },
    {
      "rating": "10",
      "text": "I don't know why people are giving this movie such a bad rating. I mean u see tidal waves and disaster written all over the psoter, and if you don't like it why did u go c it. I saw this movie and sure I don't believe the world is going to end in 2012, but I just liked the special effects and everything. GREAT MOVIE!!!!"
    },
    {
      "rating": "9",
      "text": "Based on some of the reviews, my expectations were not high. I was very pleasantly surprised! Maybe these harsh reviewers were expecting Shakespeare. This is a fun, entertaining movie that really delivers. Could have used a little editing at the end - a bit too long. Other than that - great!"
    }
  ],
  "recommendations": [
    "geostorm",
    "skyline",
    "knowing",
    "wonder_woman_1984",
    "war_of_the_worlds",
    "the_tomorrow_war",
    "into_the_storm",
    "independence_day_resurgence",
    "the_darkest_hour",
    "shadow_in_the_cloud",
    "sanctum",
    "battleship",
    "volcano",
    "doctor_strange_in_the_multiverse_of_madness",
    "the_host",
    "the_matrix_resurrections",
    "the_devil_inside",
    "the_new_mutants",
    "bird_box",
    "poseidon",
    "the_day_after_tomorrow",
    "jurassic_world_fallen_kingdom",
    "how_it_ends",
    "legion",
    "transformers_the_last_knight"
  ]
}