{
  "id": 2558,
  "title": "2067",
  "starring": [
    "Kodi Smit-McPhee",
    "Ryan Kwanten"
  ],
  "runtime": 114,
  "genre": [
    "Science Fiction",
    "Thriller"
  ],
  "description": "A lowly utility worker is called to the future by a mysterious radio signal, he must leave his dying wife to embark on a journey that will force him to face his deepest fears in an attempt to change the fabric of reality and save humankind from its greatest environmental crisis yet.",
  "releaseYear": "2020",
  "mpaaRating": "NR",
  "imageUrl": "https://image.tmdb.org/t/p/w500/7D430eqZj8y3oVkLFfsWXGRcpEG.jpg",
  "categories": {
    "plot": 7.888888888888889,
    "acting": 6.666666666666667,
    "ending": 8.5,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 4.0,
    "funny": 5.0,
    "action": 9.0
  },
  "reviews": [
    {
      "rating": "5",
      "text": "Kodi Smit-McPhee single-handedly carries on his back a film that seems dead from the start, even with its ambitious premise.He does a fine job as the lead, but even he isn't able to bring life to a story that gets stuck between what it intends and what it ultimately delivers."
    },
    {
      "rating": "9",
      "text": "A fun scifi movie about time travel I really enjoyed. The movie has great acting and good visuals. I didn't hear much about this movie but I'm glad i gave it a chance."
    },
    {
      "rating": "8",
      "text": "Ok first thing for people saying there is no hummer its not a comedy, acting was good. I've seen wors from movies they these so call critics cive high scores in.. the plot and twist were well done. It was slow at times but in all it was good.. DO NOT listen to critics they don't know what is good if it bit them on the back side...97% of the time movies they say are good turn o I t to be garbage and the ones they say are bad are really good.."
    },
    {
      "rating": "10",
      "text": "I'm gonna give a 10 because this movie doesn't deserve to be that underrated and I've known the director- Seth Larney for many years and have seen his other projects. We have to give some credit to him as this is his best work, particularly in a year like this."
    },
    {
      "rating": "10",
      "text": "An interesting sci-fi movie. Despite the negative reviews, I'm gonna give it a 10. The storyline and scenario, while they might be funky, are certainly going to get me interested!"
    },
    {
      "rating": "1",
      "text": "Absolute waste of time. Pfffff, so freakin bad. Seriously: dont bother, go watch something else, take my sacrifice and go.I'm giving it a 1 for \"trying\". Blegh"
    },
    {
      "rating": "5",
      "text": "Not a great film but not the worst either.Kodi Smit-McPhee is hard to look at physically, there is something approaching uncanny valley about his facial structure; perhaps it’s the wide-set eyes and androgynous appearance. Aside, his acting is inconsistently believable, but it’s always nice to see a rock solid Ryan Kwanten even if it’s in a supporting role, and Ryan provides some viewer relief along the ride.The plot, whilst enticing as a concept, feels pedestrian at times, and makes “getting to the end” feel like a chore. There are redeeming qualities; the sets are cool and overall production effort is reassuring, and the ambition is commendable. If you’re fan of science fiction, particularly time travel and dystopias, this is worth a try, but keep your expectations low."
    },
    {
      "rating": "3",
      "text": "(Mauro Lanari)At first I thought it had a good subject mistreated by the screenwriters (holes, inconsistencies, banalities, gaps, voids). Then I realized that also the subject was just the re-proposal of a sacrificial messianic salvation."
    },
    {
      "rating": "10",
      "text": "A story about Love and self sacrifice ... and it is visually pleasing ! #LiveGreenOrDie"
    },
    {
      "rating": "0",
      "text": "It is totally disgusting movie. Acting is silly and makes you cringe most of the time, actors cannot act and stupid characters. Movie plot is also below criticism."
    },
    {
      "rating": "9",
      "text": "Most of today's SciFi is dull beyond belief. This was different. Sure, the time-travel to save the world thing has been done many times before, but this was woven around a fairly compelling personal story, some wild exaggerations of human impact on the planet and a mixture of good and bad acting (along with some terrible science!). All in all it seemed like a very good local stage drama, flaws, drama and all. The ending was a decent one too. Maybe what I enjoyed most of all was an honest attempt to tell a good SciFi story without the preachy PC whining that's embedded a lot of new content by default. A solid 9 for creativity and focus on entertainment."
    },
    {
      "rating": "0",
      "text": "Ethan-Why do you have a gun?Jude-It’s protection.Ethan-From what?You said it yourself, this place is dust and bones.Protection from what, me?Are you going to shoot me brother?...Me- please shoot him and put us out of this misery."
    },
    {
      "rating": "1",
      "text": "Terrible acting, illogical and what even us the plot??? I usually love Deborah Mailman and Ryan Kwanten but even they couldn’t save this disaster of a film"
    },
    {
      "rating": "10",
      "text": "Too big of a budget to say B-movie, cast and plot is also way above that level. Exactly what you would expect if you like 2012 and the day after tomorrow. And of course, the critics will try to suppress anything with a kernel of truth and less focused on pushing political agendas and identity politics. No wonder they call the plot ridiculous because there's actually lots of scientific facts in it although conclusions vary and naturally there has to be artistic freedom, the critics are allergic to certain less known controversial facts naturally, but it makes for an all the more interesting plot."
    }
  ]
}