{
  "id": 4528,
  "title": "20th Century Women",
  "starring": [
    "Annette Bening",
    "Lucas Jade Zumann"
  ],
  "runtime": 119,
  "genre": [
    "Drama"
  ],
  "description": "In 1979 Santa Barbara, California, Dorothea Fields is a determined single mother in her mid-50s who is raising her adolescent son, Jamie, at a moment brimming with cultural change and rebellion. Dorothea enlists the help of two younger women – Abbie, a free-spirited punk artist living as a boarder in the Fields' home and Julie, a savvy and provocative teenage neighbour – to help with Jamie's upbringing.",
  "releaseYear": "2016",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/mso2rEr9i0MilRIOao5HaWFipS9.jpg",
  "categories": {
    "plot": 7.294117647058823,
    "acting": 6.827586206896552,
    "ending": 7.75,
    "soundtrack": 8.5,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 8.0,
    "action": 10.0
  },
  "reviews": [
    {
      "rating": "8",
      "text": "Santa Barbara in 1979 was a perfect little heaven of sunsets, palm trees and homey Americana right before corporatocracy sucked the life out of it, if this film is to be believed. It's a slice of golden nostalgia that's pretty damn irresistible.There's no plot or resolutions in any generic sense. It's a small part of a remembered  section from someone's past, its characters and setting a search for some understanding of where the changes in life began to take shape.If all this seems a bit too rosy, it probably is, but in a way that's earnest and real. It's not so much nostalgia for its own sake as it is an understanding of how the small moments and the people inside them shape a life, if even subtly. In that sense this film is indeed rosy but not unnecessarily so.The menstruation scene around the dinner table with Greta Gerwig is comic gold."
    },
    {
      "rating": "6",
      "text": "“20th Century Women” was written and directed by Mike Mills, It boasts a fine ensemble cast led by Annette Benning with Billy Crudup, Greta Gerwig, Elle Fanning and Lucas Jede Zumann who each give gifted and meaningful performances. Unfortunately, the star value and the once good idea behind the screenplay fail to save this film from being slow and discombobulated as it strives to reach its unattainable goal. This, once again, is the classic case of the writer and director being one in the same  person with no 3rd party filter to help cut, edit and alter the film into something cohesive and easy to watch. Mr. Mills, like most who assume these dual roles, becomes married to his own material, is afraid to alter it and never really allows the audience  to properly see, forgive the pun, the “big picture”.  I give the film a 6.0 because yawning 3 times during the film and checking my watch 4 is testament enough to why it deserves such a low rating."
    },
    {
      "rating": "6",
      "text": "Despite a number of fine performances and a handful of well-written, memorable moments, the overall production meanders in search of the glue it needs to pull everything together. The result is either a finished product that's entirely too \"inside\" to be meaningful to anyone beyond its creator or a gimmicky exercise in contrivance that's a little too intentionally quirky for its own good. The rudiments of a good film are here, but, unfortunately, they never coalesce into a satisfying whole."
    },
    {
      "rating": "6",
      "text": "It is a time period movie, set in 1979 in Santa Barbara where a single mom in her mid 50th is raising her only teenage son.There are good performances in this movie, particularly from Annette Bening playing the mom.The movie is rich with interesting situations and funny remarks.Absence of a plot does not help making the movie stand out. The film is a collection of episodes that makes a whole object if you look at it from a distance, similar to a painting by an impressionist.In short, the film is atmospheric but boring at times. Worth seeing although not remarkable or memorable."
    },
    {
      "rating": "4",
      "text": "The previous film by writer/director Mike Mills was \"Beginners,\" which I called \"a numbingly navel-gazing, somewhat arty examination of life, love and happiness. Too heady to be enjoyable.\" I can use that same critique for this film. It stars Annette Bening as an atypical mother in her 50s, who's concerned about her relationship with her adolescent son (Lucas Jade Zumann). She enlists the help of 2 female boarders (Greta Gerwig & Elle Fanning) to help form his character. Bening, who looks delightfully unglamourous, is complex and compelling every moment she's on screen. It's her first major role in a while and she's wondrous. The rest of the cast is fine, but it's the uninteresting episodic narrative and lackluster direction that make the film more self-indulgent than entertaining."
    },
    {
      "rating": "9",
      "text": "Superb direction, cinematography, screenplay, and music sell this zippy journey through Mike Mills' childhood, which doubles back on itself in the way that the best stories do. But all this is secondary to the fantastic lived-in kind of acting that lights up the screen here. Fanning is some sort of revelation here, as a teenager asked to grow up too quickly. She seems invincible when she cartwheels across the bottom of a dried-out swimming pool but then, coming to a rest, fragile all the same. Gerwig plays Gerwig; Benning gets laughs from just the little ways her eyes squint and move in response to the insanity of the decade. By virtue of narration as a plot device, we are gifted with more details about these people and more time with them than we could ever ask for and yet we are left wanting more at the end. This is a Movie with a capital M – a separate place, with separate lives and separate attitude. The ending arrives all too soon, and perhaps inelegantly, but isn't that always the case."
    },
    {
      "rating": "9",
      "text": "This film leaves so much un-said yet still perfectly conveys the complex and nuanced nature of each character. The mystery that Mills still feels around his mother is very present and we are allowed to understand her only as much as he does. The women portrayed are real and complex, and we see how powerful and consequential they (figuratively) were in Mills' upbringing. The editing is original and refreshing but subtle enough to not be pretentious. The script seems so thoughtful that every other line becomes quotable and a consistent dry wit helps the film to stay above the surface of slightly too sad."
    },
    {
      "rating": "0",
      "text": "DO NOT GO TO THIS MOVIE.  Extraordinarily bad.  Whoever imagined that having Annette Bening scowl at people from the screen for 90 minutes would be entertaining needs to be fired.  Pretentious, boring and extremely dumb.  Can't imagine that the critics actually saw this film.  So bad."
    },
    {
      "rating": "10",
      "text": "Such a marvelous movie. Full of heart, thought-provoking and a wonderful and stellar cast. I just loved it."
    },
    {
      "rating": "3",
      "text": "If you're looking for good acting, and deep emotional angst...this movie might be for you.  Unfortunately, all I felt was frustration throughout the entire viewing.  But then, I watch movies to be entertained, rather than feel deep emotional turmoil, or receive a profound social message or statement.  The Netflix rating is more appropriate."
    },
    {
      "rating": "7",
      "text": "A step back from Mike Mills' terrific 2011 film Beginners, 20th Century Women is another somewhat autobiographical film from the writer/director. Yet, this one feels decidedly less assured. Embracing formalistic indulgences along the way that clash with the realistic and natural tone of the film, the film lacks cohesion at times and feels overly ambitious for its story. Fortunately, there is so much to enjoy about this film. From the style and general aesthetic feeling given by the film, as well as great characters and acting, 20th Century Women is an often moving and funny film about Mills' childhood surrounded by women in Santa Barbara. In many ways, it is a film about how people do not understand one another, in spite of all of our efforts to figure out what makes those around us, and ourselves, tick. In this endeavor, 20th Century Women is incredibly successful and finds a lot of resonance. Unfortunately, unnecessary style distracts from the film and feels more indulgent than anything.These stylistic indulgences include montages of old pictures of historical events, the rainbow streaks following the cars as they drive on the highway, and giving the future of the characters after 1979. Of these, the rainbow streaks seems to be the one that I have the most trouble with. It helps to create the drug induced, dream-like atmosphere of Santa Barbara, yes. Santa Barbara and 1979 are very much characters in this film themselves with the city coming to represent the loose, free thinking nature of the characters, and being just as influenced by drugs as they are. 1979 comes into play with the time, Jimmy Carter's speeches, and how it is a point of change and a turning point in their respective lives for a variety of reasons as shown in the film. Yet, the rainbow streaks feel indulgent. The film's character are supposed to reflect real people and its situations are somewhat real occurrences. Yet, the style hints at Mills indulging too much in artist tendencies. The out of place montages of old pictures that do not have much to do with the plot suffer from the same indulgence. It feels wholly misplaced in a film of this type and is not something I remember Beginners suffering from. If memory serves, that was a very grounded film, set in the real world and rarely diverting from that world. Instead, Mills attempts to create the same psychedelic and 1970s trip created in films such as Inherent Vice or The Nice Guys. The film is stepped with nostalgia and these glory days of 1979, but the film suffers from this style. The trippy atmosphere is interesting, but is ill-fitting for a story of this ilk. In the aforementioned films, it works because the films are clearly going for a certain aesthetic and very formalistic in its story. But, Mills' story here is very real, authentic, and raw. These nostalgic indulgences for a film as real as Manchester by the Sea feel more like something out of La La Land, which leaves it feeling incredibly jumbled in regards to its style and intent.The film also suffers from its dialogue. Once more, it attempts to create great characters and it succeeds. The writing is glorious when it comes to these characters, but the dialogue lacks the punch of realism. It feels written and, again, feels ill-fitted for a story of this nature. Honestly, I may need a rewatch of this, but conversations often fall awkwardly flat. Such as:\"I like the way your hair smells.\"\"I make my own shampoo.\"\"Of course you do.\"This dialogue feels more like Wes Anderson dialogue in a very formalistic setting. Instead, Mills tries to strike a balance between the two styles, but these lines just feel too quirky and purposefully odd to really resonate. Much of this film is like this and some of the dialogue does work quite well comedically, but feels as though it contributes to the tonal awkwardness of the film. Is it a realistic with real worlds, as the premise, characters, and situations would have you believe? It would also be in line with being semi-autobiographical. Or, is it an aesthetic filled joy ride through Santa Barbara's free thinking community with quirky dialogue? It is here where I struggle to rationalize why I still like 20th Century Women, even in spite of this tonal awkwardness.The brilliance of 20th Century Women may reveal itself to me upon rewatches, but for now, it largely lies within its themes. Early in the film, Dorothea (Annette Bening) asks her son Jamie (Lucas Jade Zumann) to be there for Abbie (Greta Gerwig). Abbie rents a room from Dorothea and lives upstairs, but had been diagnosed with cervical cancer in the year prior and was going to see if the surgery had removed the cancer or not. Dorothea, knowing she would not be able to be there, wants Jamie to offer Abbie emotional support, regardless of whether the news is good or bad. In asking, she comments on how \"men always want to fix problems for women\", in order to steer him away from his male tendency to \"fix things\"."
    },
    {
      "rating": "7",
      "text": "A well-made and well-acted film for the most part, Annette Bening certainly makes the most of her starring role, as does the rest of the supporting cast (with the likes of Elle Fanning, Greta Gerwig, Billy Crudup, etc.) However, the film's narrative style and pedestrian-feeling story somewhat hampered it for me. Overall, I really don't have much to say on this one honestly. It really isn't anything too memorable, but if anything, cetainly see it for a shining performance from Bening who I believe deserves at least an Academy Award nomination for her reliable and lighthearted performance."
    },
    {
      "rating": "9",
      "text": "Mills' 70s drama underscores feminism in an artistic way from the perspectives of 5 different women and men. The combination of narrations from characters and scenes of \"enjoying living in the moment\" suggest the confusion the characters all felt living in a period of time where freedom is there but none of them can seem to be enjoying it. From the film, Mills develops his characters through humor and curiosity, unveiling a heartwarming yet compelling story about humans searching for the meaning in life without realizing the fact that living in the moment is the most important part of life."
    },
    {
      "rating": "1",
      "text": "Incredibly boring and meaningless. If you can stay awake through the whole movie you'll hate yourself for it by the end. None of the unrealistic characters provide any reason to like them, cheer for them, or care about them."
    },
    {
      "rating": "3",
      "text": "I usually like Annette Bening, but found her character in this movie incredibly annoying. Half the time she's spouting world-weary wisdom; the other half, she's so inexplicably dopey, you want to dump a bucket of coffee on her and tell her to get a freakin' clue. (Also distracting is the fact that she's supposed to be 55, but looks 70.) The whole idea that this mom is on the one hand such a liberated open-minded feminist, and other the other hand, so clueless about how to raise her kid, just seems ludicrous. There might be some familiar nods and smiles for viewers who recall the 1970s and '80s. Overall, though, this coming-of-age tale is no more interesting than yours or anyone else's."
    },
    {
      "rating": "7",
      "text": "Rather a 20th century tale!You have seen films like this often. This is where a chick film meets art. Art means not the flick full of inspiration, message, awareness. But the presentation was so pleasant. The screenplay carefully picked the right events, and the dialogues were good. The book fanatics would go and look for the original source it was adapted from. But the truth is it was an originally written screenplay, and that's why it got a nomination at the recent Oscars. Another way to say, it inspired by the director's own childhood life, being raised by his mother and sister.This is the story of a single mother, whose teenage son is struggling to blend with the world. Then they have two roommates, one a woman in her 20s and a middle aged man. Beside a girl of her son's age visits regularly and sometimes secretly. So how all these people influence in the boy's life is the story that revealed. His mother being from different generation and not understanding the present world, which was the year 1979, where the film sets in.From the director of 'Beginners', yet another unique film. Thematically there's nothing special, though it was carved with the excellent bunch of actors made the difference. I'm not sure the title was perfect for what the film narrated. Yes, if it was Annette Bening's Dorothea's story, then it justifies. But the story does not have one perspective of narration. All the main characters like Bening, Elle, Greta, Crudup and Zumann, shared screen equally. So, instead I would have preferred the title, '20th Century Tale'.Greta kind of reminded me Kristen Stewart with the hair like that. Two hours long drama with some funs. Really a good film. The topics it brings in for discussion were interesting, especially which is in the current era. Films like this should be watching. It is about the life, people with different characters and ambitions.7/10"
    },
    {
      "rating": "6",
      "text": "Cute, but predictably band-of-quirky-strangers bond together. Nice acting but too much ho-hum dancing together to show how joyful they are. At the end I wondered what the fuss was."
    },
    {
      "rating": "8",
      "text": "Easy 8 for this film which takes place in Santa Barbara in 1979. Marvelous ensemble cast headed by Benning. Funny and serious in unpredictable ways. Written and directed by a guy it's unapologetically feminist. Frankly I'm not often keen on indie films but mostly I loved how this one surprised me. And the music is great."
    },
    {
      "rating": "7",
      "text": "Enjoyed Annette Benning's performance.  It was more the history of the 80's from one family's perspective, rather than a story.  I was not interested in what came next.  Borrowed through Redbox."
    },
    {
      "rating": "10",
      "text": "20th Century Women tells a story that is more complex than what it looks, and it feels real and gives a sense I can't describe at the moment, but it was breathtaking and beautiful. I haven't seen Beginners but after watching this I'm interested in seeing more of Mike Mills."
    },
    {
      "rating": "8",
      "text": "just know, it's not gonna be anything like that..20th Century WomenA peek into different types and at different stages of women through an eerie but mutual perspective so that audience holds on to the protagonist till the end is not only a smart idea but a potential concept. 20th Century Women is filled with fascinating conversations, amusing but practical characters, brilliant premise and a big heart in the middle of it keeping it alive. Mike Mills again gets it right with his amazing writing skills, excellent execution and perfect editing allowing a great reasonable debate and thought provoking tale to wonder about. Annette Bening is as always, brilliant in her course of meal and serves it right till the end with a great supporting cast like Elle and Billy but the real game changer here, is Greta Gerwig; she is fabulous in her role. 20th Century Women is a character driven movie that explores and celebrates the characters with reasoning and gives a perfect arc to the track allowing it to enter the major league."
    },
    {
      "rating": "10",
      "text": "I strongly recommend watching \"20th Century Women\", Mills' script and casting are so 'real' that we sense we know the characters. It takes place in Santa Barbara in 1979. Most part of the movie is narrated by Jamie, a 15-year-old nice feminist guy who tries to show us how special his 55-year-old mother, Dorothea, who \"comes from the Depression\" is, but sometimes the other characters get the chance to narrating, introducing themselves, telling us who they are and where are they going to, tissuing past present and future. The cultural changes are some of the struggles Dorothea must face throughout the movie. Not only does she try to understand this new era of skateboarding and punk music, listening to people beyond the surface but also hanging out with her two tenants: Abbie - the marvelous GRETA GERWIG, and a mechanic who is tolerant and helpful. Abbie is a hardcore feminist photographer recovering from cervical cancer, in some of the funniest and most political scenes in the movie, she gives Jamie some feminist books and lessons, about the importance of **** stimulation\" and not be frightened with women periods. Jamie's best friend from childhood, a depressed girl named Julie, also haver her space in the movie. As she is so unhappy at home, carry on crawling through Jamie's window at night to sleep, without sex. Jamie is in love with her, but as she does not wanna have sex with him, he respects her decision, and tries to be a good guy and just be there for her and his mother and his friend Abbie. It's definitely worth watching!"
    },
    {
      "rating": "7",
      "text": "Great performances and a solid script headline this safe, but overlong dramady. It's engaging enough for a viewing, but nothing beyond the performances are truly memorable."
    }
  ],
  "recommendations": [
    "thoroughbreds",
    "closer",
    "blue_valentine",
    "the_florida_project",
    "legends_of_the_fall",
    "me_before_you",
    "her",
    "manchester_by_the_sea",
    "melancholia",
    "the_good_shepherd",
    "belfast",
    "the_best_exotic_marigold_hotel",
    "lady_bird",
    "personal_shopper",
    "nomadland",
    "call_me_by_your_name",
    "the_book_thief",
    "the_glass_castle",
    "leave_no_trace",
    "phantom_thread",
    "the_age_of_adaline",
    "the_fault_in_our_stars",
    "captain_fantastic",
    "the_intern",
    "21_grams"
  ]
}