{
  "id": 1062,
  "title": "21",
  "starring": [
    "Jim Sturgess",
    "Kevin Spacey"
  ],
  "runtime": 123,
  "genre": [
    "Drama",
    "Crime"
  ],
  "description": "Ben Campbell is a young, highly intelligent, student at M.I.T. who strives to succeed. Wanting a scholarship to transfer to Harvard School of Medicine to become a doctor, Ben learns that he cannot afford the $300,000 tuition as he comes from a poor, working-class background. But one evening, Ben is introduced by his unorthodox math professor to  a small but secretive club.  Students Jill, Choi, Kianna, and Fisher, who are being trained by Professor Rosa in to count cards at blackjack.",
  "releaseYear": "2008",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/efG8Po57alqSlhqHU1lXJ3duG6t.jpg",
  "categories": {
    "plot": 4.472222222222222,
    "acting": 5.214285714285714,
    "ending": 5.9,
    "soundtrack": 5.0,
    "cinematography": 4.0,
    "familyFriendly": 4.5,
    "funny": 8.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "4",
      "text": "If you think the plot of \"21\" sounds as if it was slyly brushed out of screenplay purgatory, just wait until you see how bland the movie actually plays out. For being a group of renegade college students, the characters really aren't very interesting at all and the actors constantly allow Kevin Spacey to steal the scenes, even when he's in the next room getting coffee. Props to Jim Sturgess for giving some especially bad narrating, too. If anything, though, the movie's effective editing does do a good job of capturing the excitement and tension of counting cards as a team."
    },
    {
      "rating": "3",
      "text": "I saw 21 when a friend told me it was awesome and to go see it. I'm questioning whether or not to stay friends with him. This movie was predictable, shallow, glitzy and everything else people hate about these stupid popcorn movies. It took serious willpower to sit through this factually inaccurate, and ethnically stereotypical movie. I'm offended that people say this movie is for 13 year old, because even I, who am thirteen, don't deserve a movie as bad as this."
    },
    {
      "rating": "10",
      "text": "Excellent movie! Kept my attention for sure! Kevin Spacey at his usual evil best! Going in my favs.\r Watch it online for free: https://www.primewire.ag/watch-42-21-online-free"
    },
    {
      "rating": "5",
      "text": "21 is a perfect example of how something that's \"based\" on a true story can nevertheless exist mainly in the realm of fiction. While it's true that the source material for the movie, Ben Mezrich's Bringing Down the House relates events that actually happened, screenwriters Peter Steinfeld and Allan Loeb have fictionalized the entire story, leaving intact only the central idea that a group of MIT students devised a card-counting scheme that allowed them to fleece the Vegas casinos. And, while I'm firm believer in the adage \"Never let the truth get in the way of a good story, \" 21 doesn't spin a good enough yarn to justify all the changes. In fact, when one character indicates to another that he started out smart then got sloppy and stupid, he might have been referring to the script.\r Our \"entry point\" into 21 is Ben Campbell (Jim Sturgess), a graduating MIT senior who has already been admitted to Harvard Med School. There's a problem, though: Ben can't raise the needed $300,000 (never heard of student loans, I guess) and his chances of getting a \"free ride\" scholarship appear slim. Along comes Professor Micky Rosa (Kevin Spacey), who brings with him a too good to be true offer: a space has opened up on his \"team\" and he's offering it to Ben, one of the most gifted mathematical minds he has encountered during his time teaching at MIT. The \"team\" is a group of five students who visit Las Vegas regularly and put into effect a sophisticated card-counting scheme that the casinos have been unable to break. Initially, Ben refuses, but the allure of Harvard Med plus his attraction to Jill Taylor (Kate Bosworth), one of Micky's special students, pulls him in. After a local initiation, it's off to Sin City for Ben's official induction. There, waiting to match wits with him is Cole Williams (Laurence Fishburne), the head of security at Planet Hollywood.\r The idea behind 21 is compelling - tell how a group of college kids beat one of the most sophisticated anti-crime systems in place anywhere around the world. Unfortunately, the problem is with the execution. Perhaps because there's math involved, 21 doesn't do an effective job of providing the bare-bones details of how the crime is pulled off. It hedges and cheats and employs lots of quick edits but we don't get anything close to a coherent description of what the kids' methods are. It doesn't take long before the film relegates the heist elements to the background so it can focus on clichéd interpersonal relationships, including a tepid romance between Ben and Jill. Finally, the movie ends with a series of Hollywood staples, including a chase and a \"twist\" that won't surprise anyone.\r 21 is yet another instance of Hollywood dumbing-down smart people. In order to pull off something as audacious and successful as what the MIT students did, they had to be geniuses. Yet, as portrayed in the movie, they're ineffectual blunderers. Some of the things they do are so stupid that they're insulting. Of course these characters are eventually going to get caught doing these sorts of things. How could they not? Audiences enjoy watching heist movies where the characters are two steps ahead (not two steps behind) and where the narrative provides some surprises. Neither characteristic is evident here. And, in addition, the resolution has an unpleasant \"have your cake and eat it\" quality. The fingerprints of those demanding a Hollywood ending are all over this screenplay.\r Jim Sturgess, who has survived the Beatles debacle Across the Universe relatively unscathed, gives a nice turn as shy Ben, who gradually emerges from his shell as he gains more confidence in his newfound skills. It's a familiar character arc but Sturgess' performance allows us to buy into it. Kevin Spacey provides his customary intensity; he's fun to watch even when he's not in peak form. His Superman Returns co-star, Kate Bosworth, isn't as successful. Her performance is wooden and she and Sturgess don't click as a couple. Laurence Fishburne is wasted in a stereotypical thug role and no one else has enough lines to be worth mentioning. The supporting characters in 21 truly are one-dimensional.\r Another disappointing aspect of 21 is its sluggish pace. The high-energy Vegas setting doesn't increase the wattage of the production. The movie is a little over two hours in length but feels longer. Some of the movie's last-act \"action\" sequences have been inserted primarily as a way to liven things up, but they're so pointless and derivative that all they do is drag out the running length. (Are we really supposed to be thrilled by scenes of Sturgess and Bosworth being chased by bad guys through a series of casino kitchens?) When it comes to the other two heist movies currently playing in theaters, The Bank Job and Flawless, the only advantage one could attribute to 21 is the youth of its cast. When judged on the basis of story, excitement, surprises, and character development, 21 comes in a distant third."
    },
    {
      "rating": "5",
      "text": "21 is a dull and boring mess, and that is to think that Kevin Spacey and Lawrence Fishburne stars in this film, which is baffling for me, because these two actors are put into two-dimensional characters, and didn't really do their acting chops justice. The whole acting thing was a bore. Jim Sturgess (and his monotone narration) is as dull as a coffee table from Ikea. The cinematography was also weird, and tried to be indie at times, yet fails to even grab the attention of the viewer. The editing was also problematic, and the movie does not know where to focus: in the lives of the blackjack players, or the act of playing blackjack itself. The only good thing I noticed in this film is the musical score. It definitely set the mood for a movie that is so lost in its own making."
    },
    {
      "rating": "5",
      "text": "21's got an ok plot which can be quite interesting at times but it can be pretty boring at times. Also, the characters are pretty much the same as the plot throughout this movie, they can be pretty fun and interesting and than they can be pretty uninteresting and not very enjoyable.Overall, it's not amazing but it's not norm of the north bad, it could have been a lot better because the plot was quite interesting at times and I wanted to see more about the gambling side."
    },
    {
      "rating": "5",
      "text": "More or less a teen movie about how cool money is and how cool it is to be really, smart, young, attractive, and then also rich. The ol' switcheroo gets em in the end. Yippee."
    },
    {
      "rating": "6",
      "text": "21 has a few tricks up its sleeves.\rThe movie is smart, interesting, and inventive. The acting is poor, but the script is pretty good. I could have wished for a better ending, but the film is sound."
    },
    {
      "rating": "3",
      "text": "I walked out after an hour. The beginning was ok, but then the story evolved into some rubbish, it was very clear what was going to happen. And Kevin Spacey, who plays \"mr. I-know-everything\" really irritated me all the movie."
    },
    {
      "rating": "3",
      "text": "Utter crap. Supposedly intelligent characters are ruined by the army of hacks that wrote or directed this. Imagine watching a documentary about Einstein, no picture the director making him struggle to open a milk carton. That is how simple the movie makers made this movie."
    },
    {
      "rating": "8",
      "text": "This true story is not only an intelligent movie, it also has a great cast, especially Jim Sturgess, playing the main character. It has a great twist ending, and deserves better critical recognition. It proves that a bunch of nobodies (and Kevin Spacey) can make a great movie. However, it's nothing like the book, which was a little disappointing."
    },
    {
      "rating": "6",
      "text": "A decent and relatively entertaining movie with a good cast but its not as clever as it would like to make out and the ending relies to much on contrivances."
    },
    {
      "rating": "8",
      "text": "this movie was good and interesting.But it does some miss directing.but Jim Sturgess i liked his acting.So,I gave it ten because i liked it very much and i dazzled me"
    },
    {
      "rating": "7",
      "text": "Not the greatest movie I have seen but somewhat enjoyable.  I will never have a career in card counting though."
    },
    {
      "rating": "10",
      "text": "After that you want start to count cards and win. If you are german you can do that here: https://www.blackjack-winner.de/karten-zaehlen-blackjack/"
    },
    {
      "rating": "8",
      "text": "A good movie with a interesting story. I was a little confused when it came to the cards but I still enjoyed it."
    },
    {
      "rating": "4",
      "text": "Not like the book, which was excellent. Fun to watch if you just let your mind go for a while and take what comes. The comments about racism? Give me a break. I lived in Asia for over 9 years, a place where you can see some real racism. The producers can be accused of selecting poor actors, but I do not see racism in Hollywood (After all is that not where the ever so enlightened ones live and work?....and tell us how to live and think?) Anyway it is a fun movie if you are willing to open your mind and use your imagination....and yes I read the book as well"
    },
    {
      "rating": "7",
      "text": "I liked this movie because it wasn't some stupid thing like other movies, it was different, and i truly never expected the ending, it was a curve ball"
    },
    {
      "rating": "7",
      "text": "Strays pretty far from the book, but gives you enough twists to serve it's purpose."
    },
    {
      "rating": "3",
      "text": "A vanilla movie. For starters, the MIT campus looks just like Boston University (since the campus scenes were shot there) and many of the Asian kids from the original MIT crew have been replaced by normal white kids. So much for realism. But the movie just throws too much Vegas \"glitz\" at the viewer as the movie teeters down this predictable path as if it's saying, \"Did you think that scene was predictable? Well, here is a casino with a beautiful blonde woman. And look: money--lots of it. Oooh\" Someone should have aimed higher here. It will be a decent DVD rental some day."
    },
    {
      "rating": "7",
      "text": "This movie is fresh, witty, and has good acting from kevin spacey. it may be a cliche vegas scene, but the fact that it overdoes the glitz is to show the chaos of their situation. not to mention its not predictable. its worth 9 bucks, but is it amazing? no"
    },
    {
      "rating": "9",
      "text": "Good flick, it required a little suspension of disbelief but it was twisted enough to be enjoyable. Kevin Spacey was excellent, but the rest of the cast could have used some improvement."
    },
    {
      "rating": "5",
      "text": "I see all the user reviews giving this movie high ratings--saying things like the movie is steady and the critics are simply wrong. These comments, in fact, are fairly inaccurate. The movie is the absolutely predictable, it can't decide who is good or bad, and there are simple, though ultimately trivial, plot wholes. If you think the movie is great, you need to watch real film. It can have it's moments, but this movie which started out as having cheap thrills, ended with having nothing but the typical, everyone is happy ending."
    },
    {
      "rating": "7",
      "text": "Overall I definitely enjoyed the movie. I have never played blackjack in my life, but I found myself interested in the game while watching the film. Ive head complaints about character development and complaints about how the students are supposed to be smart and not make stupid decision. BUT--this is a game theyve never played before until they got swept up in the money--they may have brians but that doesnt mean they're not gonna be naive--they dont have the life experience. i wasnt concerned about the lack of character deveopment because i thought they set a good enough stage for Ben (sturgess). I thought it was kind of obvious what each character's personality was like--to have to spell it out would have been tedious. Sorry critics! I liked it!"
    },
    {
      "rating": "6",
      "text": "Escapist fun, but not much else. I didn't expect better because the book it's based on didn't impress either. Great story, just poorly executed. Also, many of the original team from MIT were NOT asian, so cool your jets before you play the racism card."
    },
    {
      "rating": "9",
      "text": "A really good movie. There is all the things that I like: -Nice girl -Cool guy -Action -Blackjack -And it's a true story Better than those Jumper or Golden compass creapy things..."
    },
    {
      "rating": "5",
      "text": "Movie is too shallow to be taken for anything more the 2 hours of escapism. It could have been so much more if it didn't get diverted from it's main story. I can't recommend it for more than a rental."
    },
    {
      "rating": "0",
      "text": "Really sad that they felt they had to change the story to make it marketable. And yes, most of the original MIT blackjack team on which these characters were based was indeed Asian American, save for like two people. Leave it to Hollywood to turn that ratio inside-out. It's not playing the race card to say that. It's just fact."
    },
    {
      "rating": "6",
      "text": "Jim Sturgess is terrific, but getting tired of Kevin Spacey in the same cold and heartless character. It's getting old. Good story, not great, but good. It held my interest at least. Well made, good score."
    },
    {
      "rating": "8",
      "text": "A very entertaining movie. The ending was extremely clever and presented in a great way. 21 entertained throughout with its multiple twists and turns, great acting, and interesting plot. Highly recommended!"
    },
    {
      "rating": "9",
      "text": "Despite what the critics say, this film is actually really good, at least imo. It may be somewhat predictable, but it still is interesting to see how the plot twists turn out. It definitely has a great deal of character, and the cast gave remarkable performances, esp. Jim Sturgess, Kate Bosworth, Laurence Fishburne, and the always-engaging, Kevin Spacey. Definitely check this out, you won't be disappointed!"
    },
    {
      "rating": "10",
      "text": "Great movie... Entertaining and captivating the whole way through. The critics are simply wrong."
    },
    {
      "rating": "1",
      "text": "The biggest travesty is people will see this and think they know the story of the MIT blackjack team. Everything after the training was completely fabricated. Imagine the movie without the beating, Lawrence Fishburne character, and surprise ending because none of it ever happened. I think people are responding so well to the movie because they are assuming it is a true story. Had I not read the book I probably would feel the same however I did read the book and remember thinking how amazed I was they could ruin such an amazing story. The casinos fought back but in LEGAL ways. No one got beat up or had their money stolen. Jeffrey Ma made and kept over a million dollars but he gets audited routinely thanks to the casinos. Amazing true story, too bad the producers decided to be more inspired by Oceans 11 than the book Bringing Down The House. Read the book."
    },
    {
      "rating": "0",
      "text": "21 is not exactly racist. The re-working of the details to appeal to a broader audience was NOT racist. These were simlpy business decisios. All else being equal, 21 is probably a decent movie. However, the presuppositions upon which the casting decisions were made were indeed RACIST: These business decisions were based upon the presupposition that box-office success of a film is achieved when you have white leads with Asian supporting characters, rather than Asian leads with white supporting characters. Have you thought for a minute about why that is, and what that means in a broader, social sense? Have you thought about what that could mean for your children? Is that something you're willing to accept? Pause here, and think about that for a minute..."
    },
    {
      "rating": "0",
      "text": "Terrible, terrible film. I saw this at a screening in the UK before it came out, and what a waste of time. If you are an intelligent person who likes to watch films for interesting characters, stimulating logical plots and unforeseen twists then DON'T go see this film. It was basically oceans eleven remade for easy to please teenagers who wouldn't know a good film if they sat through an all night alfred hitchcock festival. Morpheus and Keyzer Soze felt completely out place amongst all the bland young actors, and didn't really seem to give a shit about anything except their check for the movie. And the bland young actors? Well they were bland, especially the lead boy, who was a wimpy little brown noser. Also, the real card counters, who this movie is based on were actually of Asian descent, and the ONLY Asian guy in this film had about 2 lines. It is obvious that the people behind the film didn't think it would sell if they hired Asian actors, and that should tell all you need to know about this film. A manufactured piece of crap, and a fine example of racism in Hollywood. All the people on this forum who gave this movie above 5 are obviously taste-impaired/13 years old. That is all."
    },
    {
      "rating": "7",
      "text": "21, whilst appearing to target the more intellectual and academic amongst us, fails in that respect. However, this a film that differs from your usual mediocre films that have hit the Box Office in recent weeks. 21 is different in the respect that this film is simply fun to watch, and at times enthralling. Spacey, on first impressions, appears to become a decent actor in future productions and despite being effectively cast in a lead role with relative expertise, at times he single-handedly pulls this film to a more bearable level. The acting, in short, is solid enough and the plot twists is effective with well-captured cinematography. The sad thing is, despite the morals that inevitable accompanies any sort of wrong-doing film aimed towards a 12A audience, is that you want to be as good as Maths as our on screen counterparts and take Vegas by storm."
    },
    {
      "rating": "0",
      "text": "This was the first time I've ever walked out of a movie. I'm all for easy-going fun films, but this bludgeoned you with every stupid idea the writers and director had. When I wasn't annoyed at how heavy-handed and obvious they were with things like signaling other members of the team (something that ought to be subtle), I was annoyed with how heavy-handed they were with the rest of the meager plot."
    },
    {
      "rating": "7",
      "text": "Pretty good movie, the end drags on for a bit tho."
    },
    {
      "rating": "9",
      "text": "A very special story combined with great actors make this title a blockbuster nobody did talk about. Absolute secret recommendation!"
    },
    {
      "rating": "10",
      "text": "I loved this movie. it was funny and exciting."
    },
    {
      "rating": "10",
      "text": "Excellent, excellent movie. A good showing from the young cast. Sure, it didn't stay to the book, although I really don't care because I don't sit and endlessly nit pick at stuff no one really cares about. And why am I not surprised that the race card was thrown in? I'm going to assume that there were more high caliber Caucasian actors than Asian actors. You would be a terrible director if you decided to take mediocrity over continuity. People grow up and learn to enjoy films for what they are. And this, was a good flick."
    },
    {
      "rating": "6",
      "text": "It wasn't a complete waste of time or a waste of my red box dollar."
    },
    {
      "rating": "4",
      "text": "This movie certainly had some potential, and I didn't think it was a complete waste of time. But really, there is little substance here, and I cannot shake the anti-gender / race thing going on in terms of being the BIG player. The 'romance' in the film is lukewarm at best. Also, I wish I knew more about counting before going in, since you feel like an outsider desperately trying to figure out how they are doing it during the film."
    },
    {
      "rating": "9",
      "text": "I enjoyed it from beginning to end. Pretty good adaptation from the book. I'm not sure what there is not to like about it. It's enjoyable and steady. It could be a tad bit more humorous and light. Overall, great and refreshing!"
    },
    {
      "rating": "7",
      "text": "Though the acting was far from stellar, the movie moved me along with enough speed to keep me interested. However, I could not help but wonder if viewers unfamiliar with blackjack would have a clue what some of the content meant. A movie should not be for blackjack players only. I asked, \"If I had never played blackjack would I find the movie interesting.\" Since I have played it makes the question a hypothetical. Each viewer would have to answer for themselves. I also found the end very predictable. For those of us who have played in the casinos, you have great need to give us a gripping storyline and please, an unpredictable ending! The storyline was decent, the ending a big yawn. Still, in light of some of other fare theaters have served lately, I'll take it."
    },
    {
      "rating": "5",
      "text": "If Cole Williams(Lawrence Fishburne) is so smart, why doesn't he notice that it's the same petite, Asian woman sitting next to Ben(Jim Sturgess) at the blackjack table? Kianna(Liza Lapira) flags down Ben with a signal conspicuous enough to catch the attention of a commercial airlines pilot. Micky(Kevin Spacey) instructs his charges to never be seen together(especially with him, you would think), but there they are, time and time again, congregated in the same hotel room. The manner in which \"21\" translates the particulars of this card-counting operation, from Ben Mezrich's best-selling book \"Bringing Down the House\", makes you wonder why these M.I.T. students weren't caught sooner. Worst of all, \"21\" seems to forget that these kids are the best and the brightest. They don't sound like M.I.T. students. They don't sound smart. Since the film insists on return trips to Boston, how about establishing the rigors of academia to better illustrate their double lives as card sharks?"
    },
    {
      "rating": "7",
      "text": "In regards to A singles comment...The actual MIT website quotes, \"though most of the actual blackjack team was composed of Asian males, a studio executive involved in the casting process said that most of the film"
    },
    {
      "rating": "3",
      "text": "A bit of a yawnfest . uninteresting, unengaging characters ... dysfunctional editing - arty blackjack table shots that just went on FOREVER ... but some nice cinematography also ."
    },
    {
      "rating": "0",
      "text": "Terrible acting, terrible script, plot hole after plot hole after plot hole: not a good formula for a movie, is it? Kevin Spacey should be ashamed of himself for this one. Can you say \"career killer\". The scene where he is being chased while in his urban cowboy costume is beyond silly. And the producers want us to think these kids are smart? They do NOTHING correctly to keep from getting caught. I am a mathematics instructor and I was particularly offended by Spacey's math \"lectures\". His topics meandered aimlessly with no connections to each other. And the math he was discussing is covered in high school...not in an upper level MIT course. And for supposedly being an MIT professor, he certainly seemed pretty clueless in avoiding being caught, too. Pathetic film."
    },
    {
      "rating": "4",
      "text": "A poor movie. The camera work was...questionable at best. They tried to make something boring exciting, and it ended up giving me a headache. (I loved the Bourne movies camera work because the style suited that genre) The acting was bland, they should have gotten someone better to play Campbell. I think Jake Gyllenhaal would have been great as Ben. Spacey's performance was one of his worst, perhaps because his character was boring. He just felt censored, as if he was holding back. Kate did fine. Overall a movie I'm disappointed I paid money to see. Watch only if you have nothing better to do."
    }
  ],
  "recommendations": [
    "the_loft",
    "lucky_number_slevin",
    "jumper",
    "now_you_see_me",
    "the_accountant",
    "the_gambler",
    "the_old_guard",
    "man_on_a_ledge",
    "logan_lucky",
    "project_power",
    "knives_out",
    "triple_frontier",
    "inferno",
    "hancock",
    "rocknrolla",
    "limitless",
    "the_departed",
    "perfect_stranger",
    "gone_girl",
    "the_guardian",
    "the_many_saints_of_newark",
    "men_in_black_international",
    "captain_marvel",
    "solace",
    "suicide_squad"
  ]
}