{
  "id": 4345,
  "title": "211",
  "starring": [
    "Nicolas Cage",
    "Sophie Skelton"
  ],
  "runtime": 86,
  "genre": [
    "Crime",
    "Action",
    "Drama"
  ],
  "description": "Inspired by one of the longest and bloodiest real-life events in police history, Officer Mike Chandler and a young civilian passenger find themselves under-prepared and outgunned when fate puts them squarely in the crosshairs of a daring bank heist in progress by a fearless team of highly-trained and heavily-armed men.",
  "releaseYear": "2018",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/81RColr4rau6DZ7z9eMsksokcfk.jpg",
  "categories": {
    "plot": 2.6666666666666665,
    "acting": 3.0,
    "ending": 3.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 5.0,
    "action": 3.0
  },
  "reviews": [
    {
      "rating": "3",
      "text": "By now, my regular readers will know that I absolutely love Nicholas Cage, however being a super fan comes with some complications. The fact is that Cage is one of the most active stars in Hollywood, willing to take on any role, and there in lies the problem. His most recent film, 211, may be one of the most pointless and uninteresting action films ever made. Four mercenaries who are looking to get back at their corrupt boss, start robbing banks where he keeps his money. This leads them to the small town of Chesterfield, where a job is interrupted by the police, leading to a stand-off. Cage stars as Mike Chandler, an officer nearing his retirement, saddled with his son-in-law as a partner. What made 211 so bad is that the stand-off and shoot outs take over the majority of the time and Dog Day Afternoon, this film is not. Aside from the occasional expletives, there are long shoot out sequences with no dialogue. When the action cools down and people finally do speak, it's actually worse, because then the lack of experience and talent of the supporting cast is painfully evident. Action movies are supposed to be exciting and get the blood pumping, even if the story isn't all that great, it's something the genre has lived on since the 1970s, but 211 is an action filmed that bored me. When one is watching an action film and nodding off, it is an indicator that something is seriously wrong with that film. I do love Nicholas Cage, but this movie won't be anywhere near the greatest hits boxed set."
    },
    {
      "rating": "3",
      "text": "It is one of those Netflix flicks I saw because I wanted to see Nicholas Cage act.  Weird, I admit, as Cage isn't known for sublime performances. But that is precisely why! Someone pointed out that Cage's acting could be seen as deliberately anti-acting. Like, let's say, the Joker as played by Heath Ledger in the Dark Knight Cage is over the top, but while Ledger pulls it off marvelously, Cages over-acting is often a dud. Perhaps often is an understatement. But with 211 Cage surprises again by putting in a such a run-of-the-mill performance that one can only giggle.. and giggle and giggle some more.Cage is in good company(or is that bad?) as the rest of the cast is as bland as used teabags.  There is kind of attempt to make us care for them as the various non-entities get introduced during the long winded first part of the movie, but it doesn't pay off when it should. It is a half-assed attempt anyway, which is why some of the people have no names at all. Oh yes, the fat bloke is shot in the head. Ah yes, the son-in-law is on the verge of dying after being shot(and boo-hoo he has just heard that he has become a father). It makes me pause to consider what makes us connect to people.To feel the hurt they feel. Or at least sympathize. Using tropes like: man-hears-he-becomes-a-father-just-before-facing-mortal-peril puts me off. Come on! And of course he doesn't die. It isn't even a spoiler to say so.. it is that kind of movie.(It would at least have been inspired if she wasn't pregnant as he turns out to be infertile. Or she ups and leaves. You know, like real life people sometimes do).The movie tries to take the serious angle by declaring to be inspired by real life events, but it is just that: inspired, not based on. If they would have based it on the North Hollywood Shootout(which is the one they mean), they would have altered the movie significantly. For one, there was never a pause. The two dudes(not four) came out and the fight was on: what you would call a running battle. There were also no hostages. But the movie has the robbers sit inside the bank for some time with hostages, so where the heck is the negotiator? And why show the police as having AR-15 as the lack of them was the whole point in the real shootout: that the police did not have the necessary firepower to stop the heavily armed and armored robbers?(It is just infuriating when you watch an interview with a former LAPD Swat team member who explains just that and why it can not happen now and this movie gets exactly this point wrong).Then the Swat team does arrive - which takes ages unlike with the real shootout -, they get time to set up the assault and do so is a very clumsy way. As said: there is no negotiator but there are also no snipers and the teams only use what must be a smoke grenade. And why they heck do they press the assault when the hostages are send out?But possibly the worst part of the movie is the utter unrealistic carelessness for human suffering with the cops. When the backup arrives with their AR-15's, they waist no time to shower the bank with a hail of bullets while it is obvious that they have hostages in there and it is very likely they hit them first. In addition they leave one of the survivors of the coffee cup bombing unattended while it is clear she is in a terrible state. And finally they don't give a rats ass that Cage has an obvious nervous breakdown after being on the receiving end of a barrage of bullets and thinking his son-in-law has died. But the only thing the officer in charge does is telling him to calm down. It is almost like the slap-in-the-face trope, without the slap in the face. But anyway, in this movie it works as Cage then takes charge and goes Rambo.There is an utter lack of seriousness in the whole movie that tries to pawn itself off as being serious. And there lies the issue. There is so much unrealism in this movie(a band of experienced mercenaries robbing a bank for a trifle?) that the whole inspiration becomes silly. If this is inspired by real life events, then Lord of the Rings is inspired by the First World War, Star wars by the American revolution, and Pearl Harbor by Pearl Harbor(and one of these might actually be true). It would have been better if they had not taken this all too serious, but just made a stupid action flick with an over the top bad/good guy. Cage can do that. That is his thing.This is another Netflix dud. Netflix Orginal is becoming a byword for underperforming. Netflix: get a hold of yourself. Merit"
    },
    {
      "rating": "3",
      "text": "Some poignant moments amid all the carnage and violence, but the dialogue and plot elements just get way too cliched and ridiculous. I would say don't waste your time on this one."
    },
    {
      "rating": "10",
      "text": "Easily one of the greatest films of 2018, I know thats not saying much but Nicolas Cage deserves an Oscar for this performance. Lets clarify, its a 2018 oscar so, still doesn't mean much, but this is a great film."
    },
    {
      "rating": "2",
      "text": "**** no action, no feelings, no soldiers, no logicIt's not even ridiculous (funny) it makes me angry because the story (mercenaries/soldiers are undertaking Bank robbery) could be used for a entertaining movie.Its's data-trash."
    }
  ],
  "recommendations": [
    "olympus_has_fallen",
    "colombiana",
    "assault_on_wall_street",
    "unhinged",
    "the_last_stand",
    "machete",
    "machete_kills",
    "siberia",
    "walking_tall",
    "snitch",
    "white_house_down",
    "law_abiding_citizen",
    "no_escape",
    "taken_3",
    "the_rhythm_section",
    "skyfall",
    "london_has_fallen",
    "the_marksman",
    "those_who_wish_me_dead",
    "lord_of_war",
    "jack_reacher_never_go_back",
    "jurassic_world",
    "taken",
    "live_by_night",
    "mile_22"
  ]
}