{
  "id": 3765,
  "title": "21 Bridges",
  "starring": [
    "Chadwick Boseman",
    "Sienna Miller"
  ],
  "runtime": 99,
  "genre": [
    "Crime",
    "Action",
    "Drama"
  ],
  "description": "An embattled NYPD detective, is thrust into a citywide manhunt for a pair of cop killers after uncovering a massive and unexpected conspiracy. As the night unfolds, lines become blurred on who he is pursuing, and who is in pursuit of him.",
  "releaseYear": "2019",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/b40ApfKDPoJYbWepUs7f09Y3fD.jpg",
  "categories": {
    "plot": 5.111111111111111,
    "acting": 6.555555555555555,
    "ending": 5.6,
    "soundtrack": 8.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 5.0,
    "action": 6.238095238095238
  },
  "reviews": [
    {
      "rating": "3",
      "text": "This B-list thriller lacks originality or verve and serves as a weak vehicle for a star struggling to find his way onto the A-list."
    },
    {
      "rating": "10",
      "text": "Хороший фильм. Действие хорошее, актерское тоже, хороший поворот. У него есть некоторые проблемы, и это не идеально, но это действительно хороший фильм."
    },
    {
      "rating": "9",
      "text": "Good movie. The action is good, the acting too, nice twist. It has some problems and it's not perfect but it's a really good movie."
    },
    {
      "rating": "8",
      "text": "This surprised me. Not that it has any true twists or subverts expectations, but just that it manages to have several tense sequences and entertaining shootouts. It’s a fun watch if you let it be just that."
    },
    {
      "rating": "7",
      "text": "75/100 Better title:  \"Look the Devil in the Eye.\" This is said twice in the film.  21 bridges is not a tangible image nor are they used as significant locations. This is the production values of Captain America:  Winter Soldier applied to a 1980s NY cops movie script.  It's watchable and well-paced.  Critics imagining director or scripters were attempting to \"say something\" about 2019 I think are imagining things.  I saw no evidence this was more than 1980s tropes assembled and packaged.  Do corrupt cops still do what is suggested here?  I kind of doubt it.  If you want up-to-date realism in your cop stories, you can't do better than Blue Bloods on CBS."
    },
    {
      "rating": "5",
      "text": "21 Bridges might feel a little like a video game and although generic with a predictable plot it’s entertaining in the moment. You won’t regret watching it but at the same time it’s probably not going to leave a lasting impression either.Detective Andre Davis (Chadwick Boseman) is a no-nonsense revenge seeking kinda cop who grumbles his way through the entire film set over the course of one night. A robbery gone wrong leads to a city wide manhunt where Andre makes the bold decision to close all 21 bridges into Manhattan until the two criminals are caught. With a time limit of 5.00am to catch the bad guys before the bridges are reopened. Racing against the clock Andre teams up with Frankie Burns (Sienna Miller) but begins to get the unsettling feeling that not all is what it seems. Sure the plot basically writes itself yet the result is the kinda movie you can lose yourself in for a little under two hours.An entertaining popcorn flick for all you cinema goers looking for your weekly action movie. Delivers exactly what you expect, nothing more, nothing less and recommended if you’ve nothing better to do."
    },
    {
      "rating": "6",
      "text": "21 Bridges conta com uma dinâmica muito bem definida, subvertendo a trama e entregando boas cenas de ação.Mesmo que previsível em alguns momentos, o diretor sabe muito bem como dosar os acontecimentos. O protagonista segue um arquétipo ok, mas graças ao ator temos algo envolvente. Há demasiado dialogo expositivo, mas isso não veio a atrapalhar minha experiência, visto que eu só queria algo pra me entreter no momento. E o tempo passou tão rápido que posso dizer que estou satisfeito.Chadwick Boseman estava excelente. Não era preciso desenvolver tanto seu personagem, pois sua postura e carisma já era o suficiente pra nos conectar. É uma pena que ele tenha ido tão cedo, e que eu só tenha percebido o quão importante ele era agora.R.I.P. Chadwick Boseman!"
    },
    {
      "rating": "9",
      "text": "Great suspenseful movie. I havent read any reviews. My daughter and I saw this movie on a whim. Best movie I've seen in a long time. It draws you into it with suspense.....Definitely recommend"
    },
    {
      "rating": "9",
      "text": "Good movie. The action is good, the acting too, nice twist. It has some problems and it's not perfect but it's a really good movie."
    },
    {
      "rating": "8",
      "text": "21 Bridges: a review by James H RobyAt a time when a stark divide exists between the police and the African American community, it might be a little risky releasing a motion picture containing those two populations. But when the picture is helmed by producers and an actor of literal super heroic proportions, I’d say it’s an even bet. 21 Bridges starring the hero, Chadwick Boseman (Black Panther), and produced by the Russo Brothers (Avengers: Endgame) is a thrill ride we haven’t seen the likes of in a while. Boseman’s character, Andre Davis, is a second generation NYC policeman with unquestionable ethics but, well, slightly more questionable methods. He’s got eight shootings under his belt in ten years. So when a pair of crooks murder seven cops in a robbery gone wrong, the police puts the cop killer killer on the case. After all, he’s the best man for the job…or is he?There’s a twist of sorts in the movie that’s not terribly deep, still it pushes the plot forward. What should be a simple manhunt quickly devolves into a mystery and Andre won’t let go until he’s found the truth. The movie is fast paced and has the feel of a modern techno-thriller with various elements of the NYPD coming together to track down the killers. There’s also some ‘required’ moments found in every action movie and Boseman delivers perfectly. There’s one scene featured in the trailers where Andre reminds a white FBI agent to have perfect diction when referring to him as a ‘trigger’. That’s about as deep as the movie goes into America’s current Black vs Blue dilemma and really that’s enough. Otherwise, Andre Davis is a cop’s cop – vowing to do anything for his ‘family’ (the police) and threatening to flood Manhattan with ‘blue’ to catch his criminals. Boseman is backed up with a great cast of Sienna Miller as Frankie Burns, Andre’s partner for the manhunt and J. K. Simmons as police Captain Matt McKenna, stepping out of his familiar role of the Farmers Insurance man and Spider-Man’s nemesis, J Jonah Jameson. Add to the list Stephan James as Michael Trujillo and Taylor Kitsch as Ray Jackson, the movie’s villains. The relatively short run time of 110 minutes actually works in the movie’s favor as it keeps the picture tight with few wasted scenes. The only faults I felt was the soundtrack didn’t seem to match the onscreen action and the story’s somewhat simple mystery.Here’s hoping Chadwick Boseman will don Andre Davis’ badge after his next appearance as the Black Panther.4.5 out of 5"
    },
    {
      "rating": "10",
      "text": "This was a great movie!! Definitely not one you can talk during, you have to pay attention the whole time or you’ll be confused! My family and I loved it!"
    },
    {
      "rating": "9",
      "text": "The movie is a awesome crime thriller with great acting, directing, and music. The pacing of the movie is great, it never slows down and the action is great. I really enjoyed it."
    },
    {
      "rating": "4",
      "text": "A drug deal gone bad and dirty cops…nothing original here. And there's not much unique in the storytelling either. Chadwick Boseman stars as the idealistic cop who's charged with solving a cocaine heist that results in 8 murdered cops. To trap the culprits before they can escape Manhattan, he orders all bridges shut down (hence, the title). The plot plays out predictably without any surprises in what should be a twisty tale (any savvy moviegoer will spot the corruption early on). It might be OK if there had been anything original in the direction, but as it is, the action is average and the storytelling is bland."
    },
    {
      "rating": "6",
      "text": "Generic cop movie that bites off a little more than it can chew  If you like action, it's a decent time waster with the requisite shoot outs and chase scenes. However, if you're looking for more than a cheap thrill or two there are better options."
    },
    {
      "rating": "8",
      "text": "I really liked this movie. Even though the twists where a bit predictable, I think the action was good and it felt interesting throughout. Some things could've been a bit better, but I think this movie has too low rating here. Even if some of the twists are foreseeable and I think have seen them before, I still think it is a good movie"
    },
    {
      "rating": "5",
      "text": "This was one of those films were you could see the curves in the plot coming a mile away. Generally I’d say their is nothing wrong with that, but when you couple this with the bad dialogue it starts to wear thin as “entertaining” and becomes more “enduring” trying to get to the end of the film. The action sequences where fine, but nothing new. The plot was fine but nothing new. I’ll even say that the acting was good given the dialogue they had to work with, but there definitely wasn’t any stand out performances. I almost stopped caring about what they where saying when I heard a character ask “who Becky with the good hair” was in relation to someone’s ex. Watch it or skip it you won’t be missing much either way."
    },
    {
      "rating": "5",
      "text": "Very simple and trivial thriller. The plot is somehow broken, there is no suspense like this, although in the plot the whole action is compressed into the framework of one night. The most important twist is so poorly hidden that the viewer guesses him in the middle of the film. Quite mediocre acting of most heroes. Rather inspected by inertia, the ending of the film is so classic in the spirits of the worst police American films, with a minimum of gray morality."
    },
    {
      "rating": "4",
      "text": "The plot relies too much on pure coincidences/luck. It's not meant to have a brilliant plot. Fine. The movie is boring to watch. There's no tension. The cops are way too incompetent. *SPOILERS*Andre, the only \"good\" cop, is always sabotaged by the other cops. It would've been interesting to see him protect the criminal he has been chasing until a minute ago, but never mind. The pacing is pretty good, though. I never felt like the movie was dragging on. And the little action this movie gives you, is pretty good."
    },
    {
      "rating": "5",
      "text": "It was entertaining but it stayed halfway in almost everything else.It doesn't capitalize on the cast and slowly fades away. The impression at the end is non-existent and will become completely forgettable."
    },
    {
      "rating": "7",
      "text": "Good film but not great.  It is fairly predictable.  Still worth checking out.  Chadwick Boseman does a great job."
    },
    {
      "rating": "5",
      "text": "21 Bridges is a standard action-thriller. The most interesting parts is when Davis is piecing together what happened at a crime scene or verbally sparring with Michael, but at just over a 90 minute runtime, the action and story is tight so you’re never bored – even if it’s very likely you’ll see some of the plot twists coming from miles away."
    },
    {
      "rating": "5",
      "text": "(Mauro Lanari)Passable film just for those who know Wakanda and not \"Kill the Messenger\" (Cuesta, 2014) or \"Serpico\" (Lumet, 1973), Friedkin (\"The French Connection\", 1971), Donner (\"16 Blocks\", 2006), Mann (\"Collateral\", 2004), etc."
    },
    {
      "rating": "8",
      "text": "We've got to give Boseman some credit for his acting here. Besides, the movie itself is quite an entertaining watch, regardless of the familiar plot, it'll still keep you curious."
    },
    {
      "rating": "5",
      "text": "The Same Old 21 BridgesThe Stream: Not a shred of original plot or story-line in sightThe Big Screen: The action sequences are quite intenseThe Final Bill: The lack of originality dampens the need to pay for the action.– S2SWe are going to shut down the internet and then fill blog with blue. Wait a minute! That’s not how that line went. Either way, 21 Bridges opened this past weekend and Stream to Big Screen was there for it. 21 Bridges follows Chadwick Boseman as NYPD detective, Andre Davis, while he tracks down a couple of cop killers. During his midnight Manhattan manhunt, and after completely locking down the island, he begins to realize that he is in the middle of what could be a bigger issue than expected. Check out the trailer for yourself.So, let’s talk about the positive things. This movie is very intense and a has some great action scenes. Those of you who enjoy the John Wick style of shooting/killing, you will enjoy these action sequences. For those of you that love the Mission Impossible Tom Cruise endless sprint scenes, you too will enjoy portions of this movie. That’s all I have.Everything else was not bad, but it was very forgettable. First, the plot of the movie is almost exactly the same as every other cop-figure-out-a-crime within a crime movie. The execution of the story IS NOT BAD. Chadwick does a relatively good job of being a realistic, straight-edge and uncompromising detective. The criminals, Stephan James as Michael and Taylor Kitsch as Ray, also do a pretty good job at being realistic and believable duo; however, the characters themselves are exactly the same tropes we get in all of these movies. There is not a moment in doubt for the viewer, which is quite amazing for an intense movie that lacks any type of suspense. This might sound harsh but this movie is beyond predictable and unoriginal, it is soul-less.Unfortunately, 21 Bridges is not worth going to the theater to view because of the predictable nature and unoriginal plot. Yet, 21 Bridges can be something to watch on an Amazon Prime/Netflix, if you’re bored one day. Better yet, who doesn’t like a shoot’em up cop drama that you don’t have to think about on a boring afternoon. This movie gets a handful of popcorn solely for the intense shootouts."
    },
    {
      "rating": "8",
      "text": "A very good action thriller.'21 Bridges' has an excellent showing from Chadwick Boseman, everything else isn't quite up to his level though is all still very good. The support cast, which includes the likes of J. K. Simmons and Taylor Kitsch, pacing and music are my main pluses for this 2019 flick.It's far from perfect of course, but I personally I got what I wanted from it and would happily watch it again."
    },
    {
      "rating": "6",
      "text": "Si no fuera por el plot sería una película más de un domingo en el sofá de tu casa."
    }
  ],
  "recommendations": [
    "den_of_thieves",
    "the_commuter",
    "the_mechanic",
    "wrath_of_man",
    "cellular",
    "the_november_man",
    "premium_rush",
    "a_walk_among_the_tombstones",
    "street_kings",
    "shooter",
    "seeking_justice",
    "unlocked",
    "run_all_night",
    "escape_plan",
    "2_guns",
    "the_call",
    "honest_thief",
    "unstoppable",
    "man_on_a_ledge",
    "the_bank_job",
    "the_equalizer",
    "contraband",
    "the_ice_road",
    "angel_has_fallen",
    "the_bourne_legacy"
  ]
}