{
  "id": 4337,
  "title": "22 July",
  "starring": [
    "Jonas Strand Gravli",
    "Anders Danielsen Lie"
  ],
  "runtime": 143,
  "genre": [
    "History",
    "Drama",
    "Thriller",
    "Crime"
  ],
  "description": "In Norway, on 22 July 2011, neo-Nazi terrorist Anders Behring Breivik murdered 77 young people attending a Labour Party Youth Camp on Utøya Island outside of Oslo. This three-part story will focus on the survivors of the attacks, the political leadership of Norway, and the lawyers involved.",
  "releaseYear": "2018",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/rd940KzuIZwbdOvOUF7XDTzn8te.jpg",
  "categories": {
    "plot": 7.0,
    "acting": 6.0,
    "ending": 5.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 2.3333333333333335,
    "funny": 5.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "7",
      "text": "''He's kinda right though, isn't? The way the country is going. Is not like it used to be''.\"We are here to give meaning and soul to a European dream that the European bureaucrats have emptied, the saviors of Europe are here.\"Matteo Salvini - Current Interior Minister and Vice President of the Italian Government.This was said few days ago by this man along with Marine Le Pen the former candidate for the presidency of France who lost to Emmanuel Macron in the last French presidential election and she said: ''We will see a different Europe emerging''.This terrorist attack occurred in 2011, way before Donald Trump in the United States, Marine Le Pen in France, Matteo Savini in Italy, Viktor Orbán in Hungary and even now Jair Bolsonaro in Brazil. It's happening in Austria, Poland, even in Germany itself. This far-right movement is growing in Europe in a very fasy way and what was once a hate speech and evidently the flag with which this terrorist attacked. Today is an extremely alive political ideology.Ironically these people have power and worse still there are people who put them in power. The enablers, perhaps the worst among all.The message of the far right in Europe is to protect their ''culture'' to avoid immigration and above all to ban everything that has to do with Islam. Their rhetoric is fear and division, that's what they sell and that's what their followers buy.Their rhetoric is racist and although some still try to hide it, we all know it.22 July is a film that in the current political climate of the world puts certain things in perspective. The new cinematographic work of Paul Greengrass uses a very different approach to the recent U – July 22, which deals with the same terrorist attack.U – July 22 was a story of horror and survival centered on the young people who were attacked in the camp. 22 July is about the attacks and the aftermath. The post-traumatic journey of a survivor. The events that occurred with the perpetrator; Anders Behring Breivik after the attack and the struggles of his lawyer to mount his defense and the repercussions he suffered in his private life.It's true that this is a work of fiction based on a real life event but after all this is a recreation, not a documentary. The important thing is not so much the events that occurred but their teaching.I didn't like a certain part of the narrative and its rhythm. I think the duration is excessive and the performance of Anders Danielsen Lie as Behring Breivik feels too much like a cartoon villain who thinks he's smarter than everyone else. I cannot argue that I know in any way how the guy behaved in his interrogations or with his lawyer but at all times he gave me that impression.22 July is another nice surprise from Netflix who in my opinion over the last two weeks released three good films in line for their catalog and considering all the trash they had been producing lately, this is undoubtedly appreciated."
    },
    {
      "rating": "5",
      "text": "It is a docu-drama about the tragic event that shook up not only Norway but the whole world. Yet the way this movie shows the event and it's aftermath does not live up to the scale of the tragedy.There were too many details that prevented me from believing what I was watching. Maybe I am too spoiled but cinematography was the only aspect of the movie that I liked. Directing, casting, script, performances: all *at best* were mediocre. I think what happened on Utøya island deserves a better movie. It is pretty much exploitation of the subject."
    },
    {
      "rating": "10",
      "text": "The Titan of terror docu-drama returns to take on the numbingly awful events of July 22nd, 2011 when a single man went hunting for teenagers. Maintaining a perfectly straight, albeit razor-thin edge between up close and personal and enough distance to stomach the violence, Greengrass delivers a flawless home run with this portrayal which focuses on the humanity of the inhumane violence without pandering to victimhood or glorifying the disgusting villain. Worth your time if you think you can handle it."
    },
    {
      "rating": "7",
      "text": "A well laid out movie about the terrorist attack by a malignant narcissist. The movie focuses more on the aftermath, which is just as well, as the mass execution of children doesn't bear watching for long. Breivik as a character doesn't bear lingering on, craziness rarely does, and it's hard to understand a Justice system that allows a sociopath a forum, then tucks him away in a comfy cubbyhole, hopefully for life. I guess we'll leave it to others to give us a better objective view of the tragedy."
    },
    {
      "rating": "7",
      "text": "Although impactful at every scene, this film should be in Norwegian so that it can be more authentic."
    },
    {
      "rating": "0",
      "text": "I thought I wanted to watch this after the movie \"Utoya\" popped up in the cinemas and reminded me of the subject, but after noticing that \"22 July\" shows the perpetrator in full view, played by an actor who looks like him, I realized this is just the kind of sensationalist material that all sociologists say should be avoided after a public murder or mass murder: any air time given to the murderer, their appearance, their message, their methods, all of that only helps them make their act known to people and stimulates copycats to try to do the same or be even more efficient the next time. And of course it's not surprising this version was made in collaboration with the U.S. - Civilian Mass Murder Nation - where they don't care about what it takes to prevent more mass murders from happening. They just have to show guns, explosions and all of their perpetrators in full glory, always.I recommend you skip this one and rate it a 0 everywhere you find it. This kind of presentation of a mass murderer should not exist."
    },
    {
      "rating": "7",
      "text": "Fairly well-made, well-acted and engrossing retelling of a massacre and its aftermath."
    },
    {
      "rating": "7",
      "text": "\"22 July\" is a harrowing and absorbing retelling of the terror attacks that took place in Norway, and the psychological and political impact it had on the victims and the country respectively."
    },
    {
      "rating": "9",
      "text": "El director Paul Greengrass ya había demostrado su capacidad para poder contar sucesos reales con \"Vuelo 93\" y \"Capitán Philips\", pero con esta película se supera. Narra el violento atentado que cobró 77 vidas el 2011 en Noruega y las consecuencias directas en una familia y en el país. Comienza mostrando una secuencias muy violenta del atentado; con esta se marca el tono de la película.Los colores en la película varían entre grises, las actuaciones son expresivas y todo se mezcla con el ambiente tenso y sombrío que se vivió luego del atentado. No peca de sensacionalista y se mantiene seria, mostrando las consecuencias directas del atentado sobre un joven y su familia, la frustración que va creciendo en el y todas las consecuencias de esta. Además, también seguimos la historia de un abogado que se ve obligado a defender a el responsable del atentado. El conflicto moral que se plantea, los problemas que esto le acarrea, se ve representado de una manera realista y directa. Un magnifico docu-drama con una fuerza abrasiva."
    },
    {
      "rating": "9",
      "text": "Found this movie searching through netflix the other day and it was really good.  The events that take place were horrible and the aftermath for survivors was defiantly not an easy road but a brave one that everyone can stand behind."
    }
  ],
  "recommendations": [
    "munich",
    "hotel_mumbai",
    "letters_from_iwo_jima",
    "the_legend_of_la_llorona",
    "emperor",
    "detroit",
    "cartel_land",
    "free_state_of_jones",
    "the_pianist",
    "a_united_kingdom",
    "the_mauritanian",
    "american_sniper",
    "the_kill_team",
    "13_minutes",
    "the_physician",
    "patriots_day",
    "dark_waters",
    "snowden",
    "the_33",
    "lone_survivor",
    "the_social_dilemma",
    "diego_maradona",
    "before_the_flood",
    "sweat",
    "k_pax"
  ]
}