{
  "id": 577,
  "title": "22 Jump Street",
  "starring": [
    "Jonah Hill",
    "Channing Tatum"
  ],
  "runtime": 112,
  "genre": [
    "Crime",
    "Comedy",
    "Action"
  ],
  "description": "After making their way through high school (twice), big changes are in store for officers Schmidt and Jenko when they go deep undercover at a local college. But when Jenko meets a kindred spirit on the football team, and Schmidt infiltrates the bohemian art major scene, they begin to question their partnership. Now they don't have to just crack the case - they have to figure out if they can have a mature relationship. If these two overgrown adolescents can grow from freshmen into real men, college might be the best thing that ever happened to them.",
  "releaseYear": "2014",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/850chzYHYbT3IISl6Q7dbBuFP2B.jpg",
  "categories": {
    "plot": 7.454545454545454,
    "acting": 7.214285714285714,
    "ending": 7.375,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 7.396825396825397,
    "action": 7.615384615384615
  },
  "reviews": [
    {
      "rating": "9",
      "text": "One of the rare movie franchises, where the sequel is as good as the first one or at least almost as good. Funny, interesting and fun to watch, one of the best comedies in 2010s"
    },
    {
      "rating": "8",
      "text": "Undercover agents Jonah Hill & Channing Tatum have graduated to college for their latest assignment, which unfolds a lot like last time (as they're quick to point out in one of many inside jokes). They also mine lots of comedy from the bromance aspects of their partnership. Tatum is even more hilarious with his thick-headed dumbness. Toss in some enjoyable supporting characters and fun action sequences. It rarely happens, but it seemed like this was better than the original. It's a genuinely funny movie. NOTE: The final bit after the credits is worth staying for."
    },
    {
      "rating": "8",
      "text": "I loved the hell out of this movie. Its fun and self-relevant and everything that made the first film so great. Pretty much all that needs to be said."
    },
    {
      "rating": "8",
      "text": "the story of 2 guys going back to college. this is pretty similar to the first movie which is meant to be done. the comedy is really funny and i would put it in my top  ten movies. the struggle of these two friends is moving with allot of great humour. this was better than the first movie which made me want to hang myself. it's a great improvement. (with credits that are worth watching!!!!!)"
    },
    {
      "rating": "7",
      "text": "Very impressive action the comedy is used just right the story was well written adding elements that made the 1st so great as well as adding new elements to make this one a one of few sequels that steps up to the mark and be better than the original"
    },
    {
      "rating": "8",
      "text": "A must see, Very funny and clever.\rOne of the best comedy of the year.\r It makes us wonder if they are going to make a new one. This one was definitely better than the first one."
    },
    {
      "rating": "8",
      "text": "I thought 21 Jump Street was hilarious, and so I went into this movie with a lot of expectations, and for the part, 22 Jump Street met them.  It was funny in a similar, yet different kind of way than 21 Jump Street was, and didn't suffer from a lot of the repetitiveness or tired jokes that plague other sequels.\rWhile the plot was similar, the movie realizes this and basically makes it into a running joke throughout the whole movie.\rOverall, I'd highly recommend this movie."
    },
    {
      "rating": "10",
      "text": "all i can say about this movie: the most hilarious comedy of the year! i really liked \"21 Jump Street\". it caught me by surprise, cause it was hilarious and awesome! but \"22 Jump Street\" is even better. in this movie, Schmidt and Jenko go undercover in college to stop a new drug ring for happening. like i said, this movie was hilarious, and it's even better cause it addresses it. first of all, Jonah Hill and Channing Tatum. these 2 dudes are the best! they got perfect chemistry with each other. and i really loved what they did to their characters in this movie, like it's kinda like a fork-road situation where they're like \"Are we really what we want?\" also, Ice Cube's in the movie, and he's awesome and hysterical too. there's this one scene where Ice Cube just melts down and i was like \"it would've been even better if this guy could rage and melt down on almost everything\". also, this movie has the best and funniest end credits ever! not only was the whole movie hilarious, but thanks to the end credits, it's comedy gold! the end credits are hysterical! i was laughing so much, i was like crying. and whenever a sequel pulls that off, that's a win. my main gripe with \"22 Jump Street\" is that it felt like it had a lotta plot points that were the same with this first movie. that kinda pulled me outta the movie a little bit, i was like \"What? Really?\" it kinda felt like it was rehashing the first movie a little bit. but all that aside, like i said: \"22 Jump Street\" is the most hysterical buddy-cop comedy we got so far this year. and i'll be damned if this wasn't better than the first movie, cause yea it was better and funnier. (with the most hysterical end credits ever!)"
    },
    {
      "rating": "2",
      "text": "Did we see the same movie?  I love pretty much enjoy anything Jonah Hill is in. Even early highlights from his career like his short appearance in 40 Year Old Virgin or his amazing 13 hours of **** sucking in Grandma's Boy to his Oscar nominated roles in Moneyball and Wolf of Wall Street are impressive. Besides a small handful of jokes that actually work, Hill not funny in 22 Jump Street, nor is Tanning Chatum. What a shame, I was hopeful it would be good. It's really bad. Skip this, for real!"
    },
    {
      "rating": "2",
      "text": "Don't worry about a complicated plot line, good story, something to think about or worry that you might miss a good movie. 22 Jumpstreet is just a formula written scream loud and there is your punchline type of movie. Its a movie where a little kid said this is getting boring they just keep doing the same lame comedy over and over. Oh kid you are so right! To put it simply, 22 Jumpstreet SUCKS!"
    },
    {
      "rating": "0",
      "text": "This movie was horrible! I got up and walked out after about 45 minutes. This is what I call your Hollywood generic movie. No originality about it! I think I've seen the same movie at least 15 times with other actors and different locations but same movie that was not funny! If you want to see a good movie that I cannot believe has not made any money but DAMN GOOD and that would be Edge of Tomorrow with Tom Cruise and Emily Blunt. Now that was a good movie. Original, funny, and awesome!"
    },
    {
      "rating": "3",
      "text": "much crappier version of the first one.   needed to be edited down.  many jokes repeated way too often.  Really a shame, they got great chemistry.  not really sure how this one is rated higher on MC than the first."
    },
    {
      "rating": "8",
      "text": "This movie is funny! 22 jump street is one of those buddy cop movies that just makes you laugh all the way through. This is filled with jokes that sometimes works and the bros are pretty stupid."
    },
    {
      "rating": "9",
      "text": "honestly, I was so surprised with how good it was because i knew it was going to be funny but not as funny as that I have not seen a better comedy like that in..god knows how long. The movie was funny, exciting and the best part was the twists and turns in the movie i mean the movie itself is the same case from 21 jump street so you would think its funny but not as good as the first one. Also many comedies do make a sequel if they are successful such as anchorman, Bruce almighty etc and they aren't as good as the first one but 22 jump street..oh no it was fantastic so far out of seeing the biggest movies this year X men, Godzilla, Spider man etc also being a Die hard marvel fan this movie was the best i've seen this year i haven't laughed this much at a comedy and i have not witnessed a audience laugh as much also. I don't want to explain the plot because you just need to see it seriously this weekend go and see it and you will get what im on about. W_D2014 is my second acc didn't know how to delete a review so i re uploaded it"
    },
    {
      "rating": "9",
      "text": "Honestly, I was so surprised with how good it was because i knew it was going to be funny but not as funny as that I have not seen a better comedy like that in..god knows how long. The movie was funny, exciting and the best part was the twists and turns in the movie i mean the movie itself is the same case from 21 jump street so you would think its funny but not as good as the first one. Also many comedies do make a sequel if they are successful such as anchorman, Bruce almighty etc and they aren't as good as the first one but 22 jump street..oh no it was fantastic so far out of seeing the biggest movies this year X men, Godzilla, Spider man etc also being a Die hard marvel fan this movie was the best i've seen this year i haven't laughed this much at a comedy and i have not witnessed a audience laugh as much also. I don't want to explain the plot because you just need to see it seriously this weekend go and see it and you will get what im on about."
    },
    {
      "rating": "5",
      "text": "It's not terrible in any way but really not that good. It's really subpar and disappointing from the much superior predecessor. The movie plays out the same movie and is really a reply of the first one. It has moments where it's hilarious, but then runs with gags that aren't very funny. When I say runs with them, I mean ten minutes of the same gag that just isn't funny. It reminds me of this is the end. I'm giving it the same score for a reason. The jokes are funny at parts but other gags are just god awful. This is the end has moments where it's ten times funnier than anything in 22 jump street, but the quantity of gags is more in this one. Overall I should have seen HTTYD. 6.5"
    },
    {
      "rating": "5",
      "text": "The first movie is much much funnier. There were a few big laughs that were very solid. I found that the final 20 minutes wasn't funny at all and dragged quite a bit. The constant under the cuff gay humor is hilarious in the first 30 minutes of the movie but when they start recycling the same joke over and over and over again it gets tiring. The big laughs are few and the slight chuckles are plenty. Average movie at best."
    },
    {
      "rating": "8",
      "text": "One of the rare occasions where the sequel is a tad bit better than original with Jonah Hill, Ice Cube and Channing Tatum all returning from the previous entry. Its funny, interesting and great addition to the franchise."
    },
    {
      "rating": "9",
      "text": "I was pleasantly surprised with how funny this movie was. It was even more entertaining than 21 Jump Street (the reboot), which I really enjoyed. A *fantastic* movie to go see with a few friends! Very well directed, acted, and produced. While most Summer Movies usually are CGI garbage (*AHEM* Amazing Spiderman 2, Michael Bay movies...) '22 Jump Street' was a quality summer flick (other new quality movies worth noting are 'X-Men: Days of Future Past' and 'Edge of Tomorrow'). HIGHLY RECOMMENDED."
    },
    {
      "rating": "7",
      "text": "Exactly the same as the first movie.  They even say that in the movie a handful of times.  22 Jump Street is a meta-movie to the most extreme, and if you did not enjoy the first film you probably will not like this one.\rHill and Tatum bring the same goofy chemistry they displayed in the first film.  The movie starts off well, teeters off a bit around the middle, but then picks up again in the last act, ending on a hilarious high note.  Overall this is a funny and entertaining movie that is definitely worth checking out."
    },
    {
      "rating": "9",
      "text": "22 Jump Street is exactly and actually better than the original 21 Jump Street. The characters are great, the story is good and the joke are pretty funny."
    },
    {
      "rating": "0",
      "text": "22 Jump Street is a \"modern\" comedy. Its got its male gay stuff, male oral sex, rambling plot, \"generic\" Black stereo types, \"f\" bombs going off like you are in Afganistan, which would be funnier by the way, brain numbing stupidity, and an annoying sense of \"why did I waste my money on this film.\"\r The sex scene has the girl in her panties. Supposedly the main character was having sex \"all night with her\" and at the end no sweat or panties off. Ahmmm.\r If you are 19 years old, drunk, and have an IQ of Radio, then you will like it, though my girlfriend liked it and she is a genius. That puzzles me. I recommend being high or drunk to watch this, then its funny."
    },
    {
      "rating": "0",
      "text": "I went in with an open mind to this sequel...I was wrong about this movie. It had very few funny moments,  but other than those few \"moments\" is just another movie for the brainless zombies of the max to watch.\r I've noticed that most people that enjoyed the film were usually 12-17 year old's. It's a movie based towards people that don't know what real comedy is."
    },
    {
      "rating": "8",
      "text": "A film that really builds on the characters from the first film. The brotherly bond between Hill and Tatum is enforced greatly with this film, which is made all the better with jokes that kept me laughing (howling, even) throughout every other scene. Some of the end credits gags had me laughing harder than I have in a long time."
    },
    {
      "rating": "0",
      "text": "This movie absolutely sucked.  Poor script, dumb plot, weak acting.  Not funny at all.  I've seen a lot of cop buddy movies and this one stands out as being one of the worst.  Slap stick can be funny but this sure isn't.  Ice Cube carried what little this sorry movie had to offer and his part was far too little.  Whatever team wrote this script should be fired.  The director should be embarrassed to death having his name attached.  Save your money"
    },
    {
      "rating": "10",
      "text": "The only way I can judge a comedy is by how hard it makes me laugh.  And this film made me laugh hard.  And Wyatt Russell was the biggest surprise.  Kurt Russell's kid is hilarious."
    },
    {
      "rating": "7",
      "text": "It pokes fun at how sequels often lose the magic of the original, however that doesn't save it from falling into many of the same pitfalls. Certain gags try too hard and yes the plot is basically the same (the latter isn't really a bad thing). You can tell the film is happily aware of this and embraces it fully. Some of the best, understated jokes come from this knowledge. This meta-comedy does keep things afloat, but it doesn't turn into a laugh riot until the movie starts doing its own thing.\r The closer it gets to the end the more frequent the laughs become. The spring break scenario is hilarious. Everything else before that is funny, but not as funny as the first movie. At least not until Ice Cube appears on-screen. His character has a larger role and the scenes with him had me rolling on the floor thanks to a surprising and well-done subplot.\r While it doesn't hit all the same high-notes as the first I would be lying if I said I didn't laugh throughout. It's still a very funny movie. One that uses inside jokes about sequels in a way rarely seen. An excellent example of meta-comedy done right, and a solid sequel for fans of the first. My total score for the movie is a 7.4/10."
    },
    {
      "rating": "8",
      "text": "It was a really funny movie, but as you may expect not as funny as the first one, buy that didn't stop me to laugh at least of 60% of the jokes, which is very good percentage. Without  spoiling anything, for the the most funny moments of the film is that the movie is really self aware of who they are and how Hollywood likes to milk every single thing that is successful (plus Ice Cube is really hilarious, oh man those texts messages). It is a nice summer movie, the only thing it can stop of enjoying this movie is the other people at the theatre who laugh harder than the dialogue of the movie...anyway...pretty good movie, if you enjoyed the first one, this one is a must, if you didn't like the first one, don't approach this one, the formula hasn't change. BTW wait for the credits for future possible sequels =)"
    },
    {
      "rating": "7",
      "text": "This is a second sequel to \"21 Jump Street\". It is comedy and quite a funny one too.\rI have to admit that I did not see the first one. Maybe I will, because I enjoyed the second one. The amount of humor is very impressive. Some jokes are smart-funny and some not-so-smart but still funny. Some episodes though deserve to be thrown out, they are that bad. So, I was not very happy with the script. The ending was a fountain of humor. It reminded me of \"Superbad\" with an enormous number of hilarious images after the movie has ended. So, do not be in a hurry to leave when it's over."
    },
    {
      "rating": "8",
      "text": "Funny, satirical, and tongue-in-cheek, 22 Jump Street not only delivers consistent laughs, but hilariously parodies its genre with great performances and interesting action sequences, with the funniest credits I've ever seen."
    },
    {
      "rating": "7",
      "text": "Definitely much better than I thought it was going to be, not a hangover 2 situation, but most certainly not as good as the first\r Pros:The chemistry between Hill and Tatum still shines, Ice Cube is even funnier in this one, the second half of the movie is great, the drug trip, the Hill/Ice Cube interactions, self referential, the end credits.\r Cons: Jillian Bell is annoying and not funny, the first half of the movie is kinda boring for a while, the gay jokes get old fast.\r Overall I thought 22 Jump Street was decent and it's worth a watch if you're a fan and want a good laugh."
    },
    {
      "rating": "7",
      "text": "Entertaining sequel to 21 Jump Street knew that it is derivative..so it made fun of it. Still, while it rehashes a lot from the original, it's seeing both leads really going for it that made this franchise a hoot. Some of their jokes don't work but those that do are so good, you'll be laughing until you cry."
    },
    {
      "rating": "8",
      "text": "With wit and self-mockery, 22 Jump Street brings bromance, satirical action scene and a good dose of laughter. It succeeds in avoiding redundancy of a sequel, which the movie itself points out, and brings enjoyable foolhardy yet sufficiently clever humor. Jonah Hill and Channing Tatum is a great couple, half of the jokes are on their expenses. Plenty of romance analogy delivered in staggeringly serious way, while the rest of it is over-the-top comedy. Script is smart, bordering on improvised banter, and it neatly pokes on popular culture.\r Commendably, the movie sneers at some of the clichés, even those that it uses. This opens up many opportunities as it practically makes jokes of, and on, itself. Plot follows Jenko (Tatum) and Schmidt (Hill) into a college for the search of another drug. While some scenes might be a bit inflated, it keeps the humor grounded without resorting to forced slapstick. Hill and Tatum have great chemistry together, with tons of relationship jokes, they boast their acting prowess by keeping straight faces on what must be pretty ungraceful scenes.\r Screenplay feels fast and tight, scenes don't overstay their welcome as it keeps churning jest at consistent pace. Action sequences are watered down and cynical remarks of those used in stereotypical action flicks. While they may be slightly predictable, the movie keeps these anticipated scenes fresh. Some events are unbelievably cartoon-like, down to the use of visible effect, but it's forgivable considering the movie produces humor literally until the end credit.\r 22 Jump Street possesses a rich sense of humor that will appeal to mainstream audience while also maintaining the adequate level of sophistication. Despite what it quips in the spirit of self-awareness, this sequel is as good, or even better than its predecessor."
    },
    {
      "rating": "9",
      "text": "Everything works in 22 Jump Street, the chemistry of the leads, how the humor is presented, the sincere parts and how it doesn't take itself seriously. 22 Jump Street isn't just the best comedy of the year, it's also one of the best films of the year so far."
    },
    {
      "rating": "6",
      "text": "I'm going to probably have to see it again. I didn't really find it that funny and was pretty bored throughout, but I was in a bad mood going in and I think that contributed to it. Update after second viewing coming soon."
    },
    {
      "rating": "8",
      "text": "This was a very funny movie. Tatum and Hill have excellent chemistry again, with some funny performances by supporting characters. This might be the first time I liked a comedy sequel more than the first."
    },
    {
      "rating": "9",
      "text": "If it ain't broke don't fix it or whatever the saying is. This movie is just like the first one but guess what? The first movie was good and since this is basically the same concept it is also just as good if not better. The jokes and humor in this movie is just as good as it was in the first one. The acting and story were great as well as the action scenes. Channing tatum had the best performance especially one part in the movie that had me laughing so hard. So if you liked the first movie joy will enjoy this one. This series hasn't lost its steam it's just getting starting and if the credits are anything to judge by jump street has alot more in store for us in the future 9/10"
    },
    {
      "rating": "10",
      "text": "This is THE MOST hilarious and best comedy I've ever watched. Its much better than the first one although I also enjoyed the first one too. I really hope the sequels comes out as they hinted on the credits. I'm not sure if that's going to be true but if it is, I'll be hoping for it. Seriously super hilarious. Those who don't find it funny might not have a sense of humor."
    },
    {
      "rating": "7",
      "text": "As good as the first one with many great nods to the fact that this is indeed a sequel.  There are many similarities between the first and this one with a few twists that for the most part work.  B+"
    },
    {
      "rating": "7",
      "text": "A squeal that we never needed,  feels more like a paint job to the previous. Its a solid movie that can never really lift the bar. Would i recommend watching? You'r better off waiting to rent this movie. I call average, however there are a collection of laughs to be found."
    },
    {
      "rating": "8",
      "text": "Not as funny as the first one but still well done. Ice Cube has a better and funnier role in this one than the last one and two of the funniest scenes in the movie involve him. Tatum and Hill are both great in this and still have god chemistry together.  Seen this movie twice now and even during the second viewing I still laughed a lot."
    },
    {
      "rating": "8",
      "text": "It's often stated that sequels never live up to the original; that doesn't necessarily apply to this one. In fact, in terms of plot, there is hardly a difference between the two. The plot is simple–the two hilarious undercover cops head back to collage to find and stop a drug ring that has surfaced at the school. One thing that really stood out to me was how self-aware this film was, almost so much so, it becomes annoying. For example, it constantly referenced how sequels never live up to the first one, and how the plot between the two was the same. Something that bothers me in the genre of comedy lately, is the stress factored into a film that is supposed to be relaxing to viewers and hold some good laughs. 22 Jump Street handled this really well, as it had some very funny scenes while some were exaggerated, over-the-top. The movie seemed to reuse jokes and cliché ideas that were not very entertaining. Don’t get me wrong, 22 Jump Street is still hilarious, but expect the same kind of comedy as in the original. The chemistry between the two leads is great and carries the whole movie pretty well. I felt like the run time was a bit long and could have been condensed to make a better movie. The pacing was a little off, almost awkward at times, where dead-time could have been filled with more laughs or simply left on the cutting room floor; this detracted from the overall film. Unrealistic scenarious seemed to overwhelm the comedic aspect quite a bit. I have to say, I laughed my butt off.  Even though it wasn't the most creative comedy, it was simple, didn't require much thinking and let me just sit back and laugh. If you do see this movie stay for the end credits because they’re a knee-slapper."
    },
    {
      "rating": "10",
      "text": "I think many reviewers are blindsided by the fact that this movie is sequel to a pretty good comedy. But 22 Jump Street is not a good movie, it's a great movie. Yes, the underlying plot is the same as 21 Jump Street, but the comedic tone is far more sure-footed, masterfully playing with the idea of a sequel. Not only are Channing Tatum and Jonah Hill at the top of their game, but the supporting cast is brilliant, and each gets an opportunity to shine, especially Jillian Bell whose performance alone is worth the price of admission. Not every gag is a home run, some are just doubles or triples, but there are no strikeouts and a few, like Ice Cube's tantrum, Hill's fist fight and the credits, are World Series worthy. Destined for the comedy hall of fame."
    },
    {
      "rating": "8",
      "text": "The movie was really awesome. I actually am suggesting to see it. Though, from the middle part made me not laugh there. The beginning and end part made me laugh to the floor."
    },
    {
      "rating": "7",
      "text": "It's way too similar to the first movie, which is lazy and therefore its inferior! But nonetheless 22 Jump Street is funny comedy with some hilarious moments! PS - Jonah Hill carried the entire movie (again)"
    },
    {
      "rating": "8",
      "text": "\"22 Jump Street\" 10 Scale Rating: 8.0 (Great) ...\r The Good: Hilarious. Absolutely hilarious. I typically judge a comedy based on how often I laugh out loud, snicker, or even smile. This film caused me to laugh out loud throughout. Tatum and Hill make for an amazing comedic tandem. Their timing is fantastic and the dialogue is well done and witty. Despite having a story that is nearly identical to the previous film, it works. They made the film different enough to still be a great film. It is rare that I say this, but this sequel is every bit as good as the first film.\r The Bad: While it works, it is still the same film over again and that does take away a LITTLE. Should there be a third offering, they are going to need to think of something else. Since it is a continuation of the first, and pretty much the same thing, you won't like the sequel if you didn't enjoy the previous film. A few jokes later in the film got old and ran a little long, especially an odd fist fight between Hill and a female character."
    },
    {
      "rating": "9",
      "text": "ok well i watched this movie in theaters and all i can say is that you must see this movie it's the funniest movie i have seen this year 'screw neighbors ' this is a comedy gem one of the funniest sequels of all time here's a little background the boys are back only this time they must go to college a k a 22 jump street and catch a drug bust within the college it's the fall down funniest comedy of the year u would be a fool to miss i say see it"
    },
    {
      "rating": "7",
      "text": "With solid acting and a quite ludicrous plot, and as so few movies are capable of, 22 Jump Street maintains the exact same comedic quality of the first one. One shouldn't expect anything more than this, though."
    },
    {
      "rating": "7",
      "text": "While it may not be as good as the first one 22 Jump Street is still a good movie. A lot of the humor works and a fair amount of the film feels fresh. With all that said the film isn’t a masterpiece either. The humor feels a bit more eager/desperate to please this time around, the film is more frantic with pacing, and despite all its jokes about unoriginal sequels this film does have a fair amount of rehashing. But the main reason why this film isn’t as good as the first one is it lacks the heart the first one did. All heartfelt moments feel forced and generic and the chemistry between Hill and Tatum isn’t quite as strong as it was in the first film being more mean-spirited this time involving a somewhat generic argument cliché. Despite all those issues though I enjoyed the film. The saving grace of this film is that most of the jokes work really well preventing it from being a letdown and somewhat disguising the fact that this is a cashgrab. Its miles ahead of the Hangover sequels and is not the disappointment I thought it would be. If you are a fan of the first one definitely check it out as you’ll probably enjoy it just don’t expect a great sequel. If you didn’t like the first one this one won’t do anything to change your mind.  For a film that didn’t needed to exist, and was probably ordered by Hollywood, Chris Miller and Phil Lord stepped up to the plate to deliver a film that may not blow you away or have the same lasting appeal as the first one but is still enjoyable and provides a lot of laughs. To the guys who made the Hangover sequels, take notes this is how you do a good comedy sequel."
    },
    {
      "rating": "5",
      "text": "Channing Tatum, and Jonah Hill..such an odd ball pairing in every way shape or form. A buff macho, and dull headedness, mixed with a brainy, textual and lame counterpart. Who would think this pairing could, and most importantly, should work. Their names; Chris Lord and Phil Lord, the creative duo behind the fresh and lively revival of the series that made Johnny Depp famous.\rIn contrast of course I'm speaking in regards to the highly successful 2012 sleeper hit \"21 Jump Street\". A buddy cop action comedy, that knew no boundaries and greatly stumbled where others have gone before, and all the same felt original, unique and it was very, very funny. I can't say the same for it's uptight, overly obsessive sequel. Amply titled \"22 Jump Street\". (In case you're wondering, they moved across the street).\r Sure we have the original team on board for more mischief and mayhem. Doing almost word for word the exact same thing. \"Do what you did the first time...and everyone's happy\". I can say, to an extent that this approach works, and for many moviegoers they will appreciate it. I just missed the improvisation and flamboyance that made it's predecessor memorable. Surprises at every corner. Granted, \"22 Jump Street\" has enough surprises, comedic wit, and action to make it mildly enjoyable for the audience it's strictly geared towards. Fans looking for a decent follow-up, should look no further. Because, there is a lot of the same, and nothing else.\r Schmidt and Jenko are back. Promising on the goodwill from the last one \"you two .. are going to college\" and finally we are made good on this promise. There is, of course, a new synthetic drug at MC State where the two must, evade into the personal lives of their fellow classmates, and neighbors, or \"Infiltrate the dealer...find the supplier\". To describe it blunty.\r Arguably, the best notion about the screenplay, penned by Josh Mccall and Jonah Hill was it's ability to take Schmidt and Jenko's relationship farther than before. It's probably best to pick up a copy of \"21 Jump St\" before seeing it's sequel, as there are many references that you may have forgotten. Rest assured for fans not familiar with the first one, the film opens with a funny recap of the events that took place on \"21 Jump Street\". While some things never change, the fauq identities \"Doug\" and \"Brad\" McQuaid are still in tact. Channing Tatum's Brad gets to experience the popular side of things now, while Jonah Hill's Doug sits on the sidelines, literally. The two sort of branch out, and do their thing. \"Brad\" gets to live his dreams of playing Football, and maybe one day drive that lamborghini. In addition \"Doug\" is playing the opposite of his post \"high school days\" there is no charismatic Dave Franco to lean on this time.\r The action set pieces are actually quite impressive. I was in tuned more with the plot this time around then I was previously, which is a good thing. I guess. Did I really wanna be motivated by an intricate of plot points? not entirely. Will I take em? sure, why not. Never is it more diverse than it needs to be. The jokes kind of up the ante a little bit. There are two or three laugh out loud jokes, instead of having the same consistency and flow the original had. Believe me. when \"22 Jump Street\" is funny, it's pretty comical all the same.\r In addition, the softness that Tatum brings to Jenko is like a teddy bear. You can't be mad or angry ever, because he is just sensitive. There is a good bit about how, Jenko takes a Sexuality class.. and all of sudden becomes an advocate for gay rights. \"I said a lot of gay slurs in high school\" he refers to his partner, to which Hill responds amicably \"yeah most of them directed at me\". These are the scenes that propel the film. That goodwill unfortunately lags after about the first hour. If you can believe it, the best jokes in the film actually belong to Ice Cube, who returns as the loud mouth, and stereotypical police chief. The best joke lies between him and Jonah Hill's character, I won't spoil it for you, however, it's a great joke worth the price of admission alone.\r In the end, of course the budget is obviously bigger, and, as with most, sequels usually tend to overdo it a tad. Phil Lord and Chris Miller take the time with certain advancements, but are given a slew of extras that, was underutilized. Rarely is a sequel good, and it's even more rare to be better than it's predecessor. I can say that \"22 Jump Street\" tries it's best, and never succeeds. Jonah Hill and Tatum are great together. The two have remarkable on screen chemistry. When you have a film as golden as \"21 Jump Street\" it's always going to be tough to top it. While my sheer opinion won't sway anyone from seeing this film. Sadly, \"22 Jump Street\" is another sequel in a long line, that has failed to live up to it's already high standards set before it.\r C+\r By: Nate Adams\r Directed By: Phil Lord, and Chris Miller\rRated: R\rRuntime: 118 mins\rStudio: Sony\rRelease Date: June 13th 2014\r Thanks For Stopping By."
    }
  ]
}