{
  "id": 3891,
  "title": "27 Dresses",
  "starring": [
    "Katherine Heigl",
    "James Marsden"
  ],
  "runtime": 111,
  "genre": [
    "Comedy",
    "Romance"
  ],
  "description": "Altruistic Jane finds herself facing her worst nightmare as her younger sister announces her engagement to the man Jane secretly adores.",
  "releaseYear": "2008",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/l8XkZAkrmFpxHr7oRoFoDutUtsZ.jpg",
  "categories": {
    "plot": 6.2,
    "acting": 5.428571428571429,
    "ending": 5.285714285714286,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 6.0,
    "funny": 5.466666666666667,
    "action": 4.0
  },
  "reviews": [
    {
      "rating": "8",
      "text": "I saw this with my friend, and we enjoyed it quite a lot. Yes, it's predictable because it is a romantic comedy. But let me say this, it was not as cheesy or stupid as it could have been. It felt semi-realistic. And more importantly, it made me laugh. Oh yea, and we were glad she ended up with the much cuter journalist."
    },
    {
      "rating": "4",
      "text": "I watched this back to back with Enchanted on an airplane. Guess what? Enchanted, with the talking cartoons was actually the better movie. Strangely both featured an actor / actress from Grey's Anatomy. Apparently having left the safe confines of Seattle Grace, Katherine Heigl is neither as sweet nor as charming as she is on the show. I felt that her character wasn't innocent enough to warrant the sympathy, nor was she sarcastic enough to be funny. The ending was clever, but the rest of the plot was only middling at best. Watch only if your strapped onto a chair for a intercontinental flight, and all other options are exhausted."
    },
    {
      "rating": "6",
      "text": "My girlfriend decided she wanted to see this movie, and naturally I was brought along expecting to have to endure a couple hours of a trite, predictable movie. My initial impressions of the movie turned out to be correct (mainly the predictability), but I was surprised by the fact that I ended up somewhat enjoying the movie. Though my opinion of the movie is probably augmented due to the fact that the last movie I saw before it was One Missed Call (ugh)."
    },
    {
      "rating": "6",
      "text": "The movie was average, neither good nor bad. I enjoyed Katherine Heigl's acting. I predict that she will soon join other actresses such as Reese Witherspoon as America's Sweethearts. Although both Heigl and co-star James Marden were enjoyable, I felt that this movie was too predictable. Everything happened just as one would have suspected. Loved the stars, not so much the plotline."
    },
    {
      "rating": "4",
      "text": "Cliche and passable at best. It's everything you would expect (or feared). A giggle or two can be found, but outside of that, hardly worth the price of admission."
    },
    {
      "rating": "0",
      "text": "THE WORST movie ever. Katherine Heigl could not save this film. I watched this film without sound in an airplane and I could see how bad and predictable the film was. Not only was Heigl's character annoying, the actor who plays her best friend has played the best friend role so many times, she's literally unwatchable. I would not even recommend this film as a DVD film to watch, not even if it was on TV for free."
    },
    {
      "rating": "2",
      "text": "Challenges \"The Notebook\" for all-time worst movie. The film equivalent of watching Britney Spears manager her life; which is to say, a train wreck. Like a burning accident, however, I watched it till the end."
    },
    {
      "rating": "2",
      "text": "What a waste of time! Implausible plot, ridiculous dialogue, and not a single relationship that rings true. Knocked Up this ain't."
    },
    {
      "rating": "3",
      "text": "My gf is a real romantic comedy buff and she even said it was lame. The movie is just too long for such a predictable plot, weird characters that don't belong, and slow to get to the point. Also, much less funnier than the trailer. Trust me , don't waste you cash, I did."
    },
    {
      "rating": "2",
      "text": "The first 10 minutes are funny, the rest of the two hours are just plain boring. I have never walked out of a movie, however, this one came really close. Save 10 bucks and watch another movie. Your date will be falling asleep before the movie ends."
    },
    {
      "rating": "0",
      "text": "Utterly predictable. Cringingly not funny. Uses every cliché known to lazy scriptwriters. I'm sure I came out more stupid than I went in."
    },
    {
      "rating": "1",
      "text": "Every once and awhile I will give into my wifeâ"
    },
    {
      "rating": "7",
      "text": "Follows a tried and true romantic comedy formula, but has enough realism and decent acting to keep it going. The audience seemed to laugh in all the right places, and everyone walked away with a smile. Can't ask much more than that these days."
    },
    {
      "rating": "8",
      "text": "Me and my wife saw it for valentines. Overall we really enjoyed the movie. Acting was decent and charming. There were some interesting characters. I found Jane's friend, Judy Greer, made the movie for me."
    },
    {
      "rating": "10",
      "text": "This was the perfect date movie for us. Her situation was was but the expressive acting (e.g. stuffing her mouth full of food, his facial expressions) were just what we needed. It was humorous and engaging with plot twists to boot. It also didn't have overflowing sexuality which was refreshing."
    },
    {
      "rating": "10",
      "text": "Funny how all the crappy people gave it a 4 or less and all the real people did 6 and up. Let's you know just how 'hard' our world has become. We need more movies like this. Calm, sweet, comedic and warm. Predictable, yes....a sweet love story usually means someone will fall in love....but then again we all know what's going to happen in a slasher movie or a end of the world saga. Katherine ROCKS!"
    },
    {
      "rating": "10",
      "text": "Of course it was predictable, it's a romantic comedy. It was one of the best written in the genre that I've seen in years."
    },
    {
      "rating": "10",
      "text": "very emotional, cry a lot, and katherine is great. it was predicted as all romantic movies, but it is unique, in dialogue and direction.\rI love it!"
    },
    {
      "rating": "7",
      "text": "\"27 Dresses\", for one tantalizing moment, gets nasty, gets mean; it tampers with the romantic/comedy formula, and gets real. At a bridal shower, the sibling rivalry between both sisters reaches its apex when Jane(Katherine Heigl) humiliates Tess(Malin Akerman) with a vengeance that's cathartic for moviegoers who've sat through too many predictable romantic/comedies such as \"27 Dresses\". If this movie about a perpetual bridesmaid had the conviction to aggravate Jane's festering wound rather than fix it up with a salve, \"27 Dresses\" would've been an unqualified artistic success, a triumph of art over commerce. But alas, Tess behaves contritely towards her big sis after their public implosion that's antithetical to her self-absorbed persona. \"27 Dresses\" bends, but doesn't break genre expectations. It's disappointing. It's dishonest. And the audience won't buy it. \"27 Dresses\" is a prime example of how focus groups can destroy the artistic integrity of a film. They say that a zebra doesn't change its stripes, except...in movies. Isn't liking the protagonist enough. Heigl is wonderful in her first star-vehicle? Do we have to like Tess, too?"
    },
    {
      "rating": "7",
      "text": "I thought this was a lot better than many romantic comedies. The acting was perfectly decent and the plot fair. Way better than the Wedding Crashers which got better reviews."
    },
    {
      "rating": "8",
      "text": "I loved this movie, predictable but a true funny, warm and adorable chick flick."
    },
    {
      "rating": "8",
      "text": "It's a romantic comedy, of course it's supposed to be formula! I went into the cinema fully expecting fluff and froth, and so I wasn't disappointed when I left it. Katherine Heigl was luminous and - although swallowing the idea of someone as beautiful and intelligent as her as a dowdy wallflower is almost impossible - almost believable. James Marsden's charm made his character likable despite everything. Despite the cliches, I still had a good time watching."
    },
    {
      "rating": "9",
      "text": "Ok so I loved this movies so much. i got hooked in the begging and loved it. the sex content was a little bad but did not take away from the movie."
    },
    {
      "rating": "8",
      "text": "I thought it was tremendous fun."
    },
    {
      "rating": "8",
      "text": "Light."
    },
    {
      "rating": "6",
      "text": "Predictable, but surprisingly funny. Used nearly cliche in the book. The end really made me mad though."
    },
    {
      "rating": "8",
      "text": "Went to see it with my girlfriends. I laughed quite a bit. Predictable yes but much funnier than I anticipated. Well worth $8.50 was the general consensus of 6 thirtysomething former bridesmaids."
    },
    {
      "rating": "7",
      "text": "I enjoyed the film tremendously. The performances by Katherine Heigl and Judy Greer are wonderful. Funny, touching and very entertaining. Ok, it is predictable, but it works."
    },
    {
      "rating": "4",
      "text": "Heigl is not believable as the lonely single girl pining away for her oblivious boss--she's way too attractive! Her monstrous sister suddenly turning into the model of common sense at the end completely turned me off and ruined what little ending there was. Can chick flicks not insult our intelligence???"
    },
    {
      "rating": "6",
      "text": "It's a cute enough movie to watch every now and then. It wasn't superb, it wasn't terrific, but it wasn't horrible. All in all, it is generally a movie with mixed emotions, but with cute scenes. It's good, but comedy is also limited."
    },
    {
      "rating": "6",
      "text": "A middle-of-the-road romantic comedy for me, though my wife enjoyed it considerably more. Acting wasn't bad, but the attempts at humor didn't resonate with me. Again, though, my wife (and a female friend) both found this movie quite funny. It was worth the time and money, but it's not near my favorite romantic comedy."
    },
    {
      "rating": "6",
      "text": "Heigl is for me the closest thing to Julia Roberts since Reese Witherspoon ala sweet home Alabama. Heigl makes an honest impression on you but unlike many other actresses shes not forgettable hope to her blossom with grace... Marsden is lone overdue for a leading role a shame his role was sort of bland."
    },
    {
      "rating": "5",
      "text": "With little imagination (think"
    },
    {
      "rating": "7",
      "text": "Despite the cliche and ridiculous. But somehow it works for me. At least entertaining. Good chemistry from Katherine Heigl and James Marsden. It tell us, the world don't suck up, there's still something call love."
    },
    {
      "rating": "1",
      "text": "Katherine Heigl gives a very impressive and funny performance, but sadly it is a romantic comedy and they usually fall for the basic formula and you know everything that is going to happen and it soon becomes boring. I give this movie 15%."
    },
    {
      "rating": "3",
      "text": "This has everything my wife loves - Ed Burns and weddings. That doesn't bother me - but being played all Thanksgiving weekend long - does.  I've lost patience watching the bubblegum chickflix and shows I've experienced in our relationship. Sadly, she doesn't understand how or why I don't want to watch them with her.As annoying as Heigl can be, she is good in this genre and plays the selfless, meek sister who finds her voice 17 minutes before the film ends perfectly.  Malin Ackerman is the consolation for the men dragged to this film - but we all know we'd rather see her as the Silk Spectre."
    },
    {
      "rating": "4",
      "text": "It was OK. I didn't like it much but I can't bring myself to hate it. I will say this: There is nothing new in this movie. Well, except for the fact that this is the first movie I've seen where James Marsden gets the girl in the end. That was it."
    },
    {
      "rating": "5",
      "text": "This is not a bad movie. However, it's not the best either. Chalk full of cliches, old-time metaphors, and the feeling that this sort of movie has been filmed before; it's not all bad. There is laugh to be heard here and there. It was disapointing."
    },
    {
      "rating": "8",
      "text": "Katherine Heigl is great in this movie. It is a total chick flick with a dash of comedy. It's pretty light and fun and always good to watch with your gal pals. It is unique and different to any other chick flick I have seen, (which nowadays seems to be a challenge, they all mimic each other.) Liked it."
    },
    {
      "rating": "6",
      "text": "I'd like to start this review making a point that one would think is obvious.  '27 Dresses' is a rom-com.  It is the most typical rom-com you will find.  Anyone who gave this a bad reviews obviously doesn't like rom-coms.  It is filled to the brim with cliches and I imagine that most people can predict the entire plot of the film within the first twenty minutes.  Despite this, I like romantic comedies.  They are brainless, fun and pass the time.  As they go, this is the perfect rom-com;  it was well written, has an adorable ending and has two or three particularly funny gags.  I'm not saying this film is amazing, because it's not;  there are plenty of moments where there are no good jokes and it could easily be funnier with a better script.  What I'm saying is that if a person likes chick-flicks/ rom-coms, they will almost certainly enjoy this film."
    },
    {
      "rating": "4",
      "text": "It's not easy to be a beauty and a funny girl — a va-va-voom body tends to distract from the jokes. But Katherine Heigl has the knack — look at Knocked Up. Just don't look here. Heigl fights an uphill battle in 27 Dresses, a chick-flick compendium of wedding cliches that will have every guy bolting for the exits. Screenwriter Aline Brosh McKenna also wrote The Devil Wears Prada, but she's dipped her sharp wit in sentimental syrup. It helps to have Judy Greer around as Heigl's acid-tongued BFF. But McKenna and director Anne Fletcher (Step Up) make a fatal error. They want us to believe that the gorgeous Heigl is a plain Jane who saves her bridesmaid dresses — all twenty-seven of them — while stoking her unrequited love for her macho boss (Ed Burns). Not buying it. Even James Marsden, so good in Enchanted and Hairspray, can't put any zip into the role of a cynical wedding columnist who morphs unpersuasively into our girl's Prince Charming. 27 Dresses is so flimsy it gives froth a bad name."
    },
    {
      "rating": "4",
      "text": "A predictable and extremely corny movie but i've watched it several times and still have some favourite moments from it. Just a good girlie movie to watch when you want to watch something romantic."
    },
    {
      "rating": "5",
      "text": "Nothing new here but had some good moments that made it tolerable and not a complete waste of time."
    },
    {
      "rating": "10",
      "text": "A predictable yet cute movie! It’s definitely at rom-com, but it’s sweet, funny, and an overall fun movie."
    },
    {
      "rating": "10",
      "text": "This isn't a cinematic beauty but as far as rom com's go this way a hit in my book! You grow to love the characters and just enjoy watching her try to help any and everyone."
    }
  ],
  "recommendations": [
    "the_proposal",
    "no_strings_attached",
    "friends_with_benefits",
    "trainwreck",
    "the_break_up",
    "that_awkward_moment",
    "what_happens_in_vegas",
    "tammy",
    "50_first_dates",
    "forgetting_sarah_marshall",
    "second_act",
    "just_go_with_it",
    "the_ugly_truth",
    "knocked_up",
    "legally_blonde",
    "rough_night",
    "sex_drive",
    "bridesmaids",
    "this_means_war",
    "the_change_up",
    "hall_pass",
    "a_bad_moms_christmas",
    "leap_year",
    "just_friends",
    "good_luck_chuck"
  ]
}