{"id": 1574, "title": "28 Days Later", "starring": ["Cillian Murphy", "Naomie Harris"], "runtime": 113, "genre": ["Horror", "Thriller", "Science Fiction"], "description": "Twenty-eight days after a killer virus was accidentally unleashed from a British research facility, a small group of London survivors are caught in a desperate struggle to protect themselves from the infected. Carried by animals and humans, the virus turns those it infects into homicidal maniacs -- and it's absolutely impossible to contain.", "releaseYear": "2002", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/sQckQRt17VaWbo39GIu0TMOiszq.jpg", "categories": {"plot": 6.7073170731707314, "acting": 7.357142857142857, "ending": 9.166666666666666, "soundtrack": 7.0, "cinematography": 8.833333333333334, "familyFriendly": 3.0, "funny": 2.0, "action": 8.538461538461538}, "reviews": [{"rating": "10", "text": "To me, what Days has always held over the head of Weeks is simply this...mood. 28 Days Later has an unparalleled mood and style in its execution, in almost everything it does. It doesn't just describe events to you, like some movies do, but it portrays it in such a way that it's genuinely chilling and believable. In comparison to Weeks, Days doesn't hold what it has over you like a bludgeon, it doesn't attempt to beat you with the speed of the zombies, or the gore. But it places it in supreme positions in the film to have the utmost effect, at the climax, at the low-point, etc. And the best part about it, is that it manages to achieve a constant level of edginess, a constant thrill even when there's nothing on the screen, it manages all of this without a guitar-blasting soundtrack (however awesome the Weeks theme is) or cameras explicitly showing that zombies are just running at you, spewing blood as they go. In fact, you are often scared in this movie simply by the fact that you don't really see what's scaring you, which is a true sign of mastery in the genre. On the other end of the spectrum, all performances in this film are excellent, the chemistry between Seline and Jim is believable especially. All characters have an edge of sympathy, and portray to you that not everyone to survive the apocalypse will be beefy, bulky men with chain guns. It defies a lot of things that would be expected of it, and ditches all normal conventions, pulling it off with grace and poise. It's a must see for anyone who can stand the level of intensity. It's a must see for anyone who can stand the."}, {"rating": "9", "text": "I really enjoyed this movie and the zombie origin story in provided. The actors in it do a great job. I was impressed with this one, and liked it equally as well as the second one."}, {"rating": "10", "text": "Fantastic horror film. I daresay there hasn't been a zombie film this good since the original Dawn of the Dead. What really makes it work is the utterly desolate atmosphere, and the convincing desperation of the performers. Scary but not reliant on gore, this is a class act. One of the best horror films in decades."}, {"rating": "8", "text": "Quite different to your American zombie movie as it focus more on survival rather than a zombie apocalypse. Lead by a great cast, in particular Naomie Harris who plays a bad-ass Selena. The zombies aren't even zombies, more-so humans infected with rage, which is a nice little twist on the genre. It is fairly slow-paced at times but tends to get quite exciting towards the end with a few shocks in there. Overall an impressive zombie flick from the Brits that also delivered an impressive sequel!"}, {"rating": "10", "text": "Hands down, the best horror movie ever made since The Shining in 1980. Danny Boyle proves his versatility as a director with this movie, mixing a love story with real, intense scares. The scenery is memorable, as is the phenomenal John Murphy soundtrack. I highly recommend this movie. Also, in response to some of the negative comments on here, the cameras were intentionally rough until the end of the movie. I felt it added confusion and harshness to the most intense parts."}, {"rating": "6", "text": "Sure, Danny Boyle's \"28 Days Later\" is a wonderful, gritty, realistic example of what the world would be if there was a zombie apocalypse (which I highly doubt). But except for the pure horror entertainment and several political satire, it's pretty much another linear zombie film that really isn't any different from Romero's."}, {"rating": "10", "text": "Best zombie film of all time. Great pacing, great story, great zombies, full of suspense, realistic dialog, disturbing, morbid, and violent. What more do you need?"}, {"rating": "0", "text": "One of the worst movies I've ever seen. I'll always remember how bad it was because I was laughing the whole way through."}, {"rating": "10", "text": "I really loved this movie. Finally a movie with ass-kickingly fast zombies. But i see a lot of zero's up here and as I read i got the impression that most of those people didnt understand the movie so im gonna try to help some of the points the complained about. 1) Now the reason there is light in the supermarket is because if you look really closely you will find its not actually a ceiling, ok, its just one big hole. I bet u missed that. 2) They aren't zombies they are pissed off because its not really a \"virus\" its more like people are transferring periods to each other. 3) The reason they dont attack other infected is because once you get bit...well...i uhhhhh...yea...4) The army fellows didn't want to get with the little girl as a cure, but just to rebuild the entire human race with 9 guys ad 2 girls. So you see once you fully understand the movie, you'll love it that much more."}, {"rating": "0", "text": "28 months after I watched this movie and I still think it's the worst movie of the last century. Not only is it boring but it lacks all horror/suspense. Do not watch. Save yourself the time."}, {"rating": "4", "text": "Just another way to do a zombie movie. In this version a virus escapes because of a raid by PETA type activists on a research facility in the UK. Apparently the virus causes those who are infected to fly into a rage and dismember the first person they see. Sound familiar? Somehow, they attack only uninfected humans, not each other. But humankind may be safe after all since not one infected person strays beyond the UK so the world is safe from Perfidious Albion's latest blunder. Nothing really connects. It's just another freak show with a happy ending, i.e., the lovers survive and the bad guys are all gone."}, {"rating": "0", "text": "People who direct music videos shouldn't direct movies."}, {"rating": "5", "text": "Its passable.You're not missing anything horrifying if you don't see this movie.Its nowhere near as great as dawn of the dead which this movie seems to resemble only it has less zombies and a different ending."}, {"rating": "7", "text": "This is a pretty enjoyable film. It is slightly low-budget though, and you notice some moments that just doesn't make sense. The storyline itself is not very spectacular or very intense, but it is an enjoyable watch nontheless. I enjoyed it. It's not  it's not great."}, {"rating": "10", "text": "A truly great film that, in addition to being a horror film is also very dramatic, which makes us reflect on human violence. In fact the contagion occurred because of some monkeys infected with a strong form of anger. This has led to despair and in the movie is an example of the soldiers who have been the ultimate form of civilization and who are so desperate to behave in an inhumane way. Interesting photography that gives us a picture of how both England after infection, and even the good direction."}, {"rating": "3", "text": "There are good zombie films and there are bad ones. There are good movies featuring Cillian Murphy and there are bad ones. 28 Days Later is both a poor representation of exciting zombie-entertainment and Cillian Murphy's talents."}, {"rating": "5", "text": "The camera work is nothing short of genius. Too bad the budget was too low to pay for good quality cameras."}, {"rating": "6", "text": "It's definitively not the best zombies movie out there, they did produced great movie scenarios and fair picture display, the story it's very good but at the same time the movie it's attractive and cliched. Cillian Murphy's acting performance does save some pieces of the movie but it wasn't enough."}, {"rating": "4", "text": "In a previous review I thumbed down this movie for I find that it is not a particular good movie. I decided to redo my review as many people argued that the stupid decisions, which was my biggest annoyance with the movie, can be explained and thus are no arguments at all.\rI do not agree with this and will try to show why this movie isn't any good and why the stupid decisions are at the heart of the problem.\r Because metacritic allows only for a limited amount of text I have to be brief and cut to the chase. But first let me say that it is no good arguing that a movie has be done before. Even if that is the case, this has nothing to do with the movie itself. Many things have been done before. As someone said, if redoing a movie makes it bad, then the universally acclaimed movie the Maltese Falcon by John Huston would fall in that category.\r A movie is a story and a story requires at least these two things: good characters and a good plot. Good characters point to believable people and believable people we can connect with, even if we don't like them. A good plot points to believable events, even if the these events are illogical in themselves.\rNote that with believable I do not mean: because it can really happen in life, but I mean: that it is accepted as being consistent with the internal logic of the story. For instance: if a story accepts that magic exists and can be used, then it stands to reason that someone can be a magic user, even though magic has not been proven to exist in real life.\rThis point makes short work of arguments as: why do the infected not attack each other? They do not because the world works that way and we do not require an explanation.\r Good characters have traits that define them. Examples can especially be found in cartoon characters. Take as example Mickey Mouse(naive and brave), Donald Duck(temperamental, committed) and Goofy(lovable, clumsy, silly, easygoing). These cartoon characters do not only posses these traits, but to a large degree these traits are part of the way they look and even move(goofy being tall, thin and moving in a clumsy manner).\r Let's turn to the central character of the movie. What traits does he display? The only trait he consistently shows throughout the movie is that he is dumb-witted to the point of being a danger to the others around him. He does not have something like the determined kick ass chick attitude of the girl he meets in the story(Selena) nor does he have the dedication and boisterous nature of the father. This then is the central character in the world with whom we have to connect and his only discerning quality is that he is too dumb be alive(for long).\r The logic of a story is grounded in the real world for we have nothing else to go on. So in general we assume that everything of the real world applies unless it is explicitly changed for the story. So we can assume that people do things like eating, drinking and having a dump without seeing them do these mundane activities in the movie. No movie requires to show you this, but we assume it happens and when it is needed for the plot it will be shown.\r Let's have a look at the plot. 28 days later abounds with stupidity. The father exposes everyone to unnecessary danger by driving his taxi through a tunnel with wrecks. They have lunch out in the open exposed. They make noise despite knowing that it attracts infected. The father exposes himself to blood, despite knowing better. Instead of holing up for the night in a room that is defensible, they use the ground floor one with windows that can be jumped through by infected. This is just a random set of the stupidity in the movie.\r Now stupidity in the world of 28 days later should lead to death and hence most of the people involved by rights die or should die. But this can not be the group of people that survive in this dangerous world. It requires qualities that allow you to survive. The characters and the plot are therefore hugely inconsistent with the world of 28 days later..\r The only survivors in the movie stay alive despite a tendency to make stupid decisions, while apparently the rest of the inhabitants of the UK, the more sensible ones presumable, were killed by the infection or something else(wise decisions?). Or perhaps they did not die at all but fled in time? This requires explanation, but we get none. Therefore this movie is bad because it doesn't explain how people survive so long while making a string of stupid mistakes.\r This is a central weakness in the movie which makes it a bad movie, despite being thought provoking(where?), despite having nice visuals(?), despite having good music, despite anything else. A movie ought to be a believable story with believable characters. They both are badly drawn in this movie, hence the movie is bad.\rNo two ways about it"}, {"rating": "8", "text": "28 Days Later is something of a modern cult classic but even so, it’s hard to believe that it only came out fourteen-fifteen years ago. But then again, it’s also hard to believe that it DID come out fourteen-fifteen years ago. 2007 sequel 28 Weeks Later and talk regarding a potential third and fourth series film notwithstanding, the film operates as most cult classics do so well- telling a story that is in many ways a circular journey and neatly wraps many details up while maintaining the intrigue and mystery by leaving some relatively unanswered as well. Although fans/victims of the lore and universe will know that many details and background interests have been added in the years since- comic books, graphic novels, a film sequel and more, the best part about any zombie apocalypse (besides it being horrid to be stuck in) is that anything can happen.The sixties, seventies, eighties, and even nineties all had their famous horror zombie flicks and we’d seen many tall tales come and go- Night of the Living Dead, Dawn of the Dead, and Day of the Dead to name a few. We’ve even seen some surprisingly good films since- I Am Legend, The Crazies, Shaun of the Dead, and Dawn of the Dead (2004). 28 Days Later kicked all of this off however, and not just in the film industry. Prior to the reinvention of the classic zombie thriller-horror romp many considered the genre to be dead and buried like westerns and eighties action flicks. Afterwards however we’ve been treated to a resurgence in films, literature, and even gaming. Left 4 Dead and Dead Rising are two of the bigger franchises out there and they both prominently feature the zombie apocalypse in entirely different ways.Not only is 28 Days Later a good film and a good example of what to do in terms of filming the zombie uprising, but it deserves its status as a cult classic because it is both a harrowing experience against WWZ-like zombies and it is a cinematic experience that should be appreciated to the fullest. The camera work in Danny Boyle’s zombie thriller is spectacular- both in the long pans across the desolate London horizon and the tense emotions elicited throughout every chase sequence and encounter. Although it reestablishes the now commonplace trope that humans are their own worst enemy even in the dead uprising, 28 Days Later focuses both on the visceral feelings and emotions of mankind in reaction to the dead and undead as well.Although we’ve been treated to two feature-length films that tell pretty decent stories within their own version of the zombie apocalypse, I’m really excited for what the future might hold for a series such as 28 ___ Later especially in the wake of the immense success of shows such as The Walking Dead (and the Kirkman comics). I would love nothing more than to see yet another quality zombie game released set in a similarly dark and gritty world to the films and perhaps even set within the same universe and utilizing some of the abundant lore as well. So far we’ve been given Zombi (originally for Wii U) which is probably the closest we’ve yet come to a fully realized and detailed experience in the vein of 28 Days Later, and that game was decent for what it offered in interesting gimmicks and mechanics.I’m doing my best not to really spoil the great narrative even though it’s probably considered a bit cliche nowadays- not at the time, considering it is what so many movies now base themselves off of it seems. Not only is it a fully worthwhile and fundamental stroke of genius in terms of storytelling and cinematography, the acting itself is pretty spot on and the relatively unknown actors (besides Brendan Gleeson and Chris Eccleston) sell their roles perfectly. The 2004 version of Dawn of the Dead may be one of the most recognizable and pretty decent zombie films of the early 2000s, but let’s not forget the fact that 28 Days Later started things off right and paved the way not only for the shambling dead but the night-roaming mutants of I Am Legend as well. All things said and done, Boyle’s film would’ve also been fine without a sequel but expanding the 28 universe hasn’t been the worst idea either."}, {"rating": "10", "text": "A classic zombie movie. One of the best horror pictures ever made. I really liked it and if you haven't seen it yet, you don't know what horror film means. Bravo!!! Shocking!!!"}, {"rating": "4", "text": "This movie was very, very boring. I was not impressed with the storyline or the acting. The movie contains a naked man laying on a hospital bed. Some language."}, {"rating": "7", "text": "28 Days Later packs a solid punch for zombie-movie lovers, and even for the average moviegoer. Boyle's style of filmmaking is not something that I've ever liked, but I have to admit that the movie itself was pretty good. It is a razor sharp attack on the government, AND a terrifying zombie movie. But style aside, Boyle knows how to make movies work, and this one definitely does."}, {"rating": "10", "text": "The film that first used running 'zombies' and kick-started the modern obsession with all things undead, 28 Days Later is a masterpiece. Eloquently shot and put together with an eerie and memorable musical score set this film apart from the average zombie flick. The focus on human drama and the critique on the nature of humanity was also a rather unique take in an overused, over-saturated genre."}, {"rating": "10", "text": "Brillante de pies a cabeza, una aventura cargada de tensión, carisma y acción."}, {"rating": "8", "text": "This is a great zombie flick, its much slower than the second one but that one of the best things about this movie it gives itself time to flesh out the main characters."}, {"rating": "9", "text": "Danny Boyle (Trainspotting) still refuses to call this a horror film and went with eco thriller amongst others. But the rest of us know one when we see one and this film is a big one. Sexy and nude Cillian Murphy (Batman Begins) stars as Jim a young man whom awakes out of a coma after a pandemic and discovers that most of the survivors left are infected with a rage virus which drives them crazy and drives them to attack and infect others. The plot is quite similar to so many. Mostly like every zombie movie ever made. Along the way he meets some survivors which include a truly bad ass Naomie Harris (Pirates of the Carribean 2&3) and they try and find help. A radio broadcast leads them to a group of soldiers with questionable intentions. There's nothing really new here plot wise but the execution is creatively stunning. The grainy, sort if found footage style easily immerses you into the events on screen and it's both terrifying and addictive. The movie is also emotionally effective because the characters and their plight are well developed. Despite the director's intentions the horror community has claimed the film as one of our own and it's undoubtedly worth celebrating.Budget: $5mDomestic Box Office: $45mWorldwide Box Office: $83m4.5/5"}, {"rating": "10", "text": "Danny Boyle at his best. A great story well told with plenty of violence and great movie imagery. One of my favourite films ever with one of the most enticing trailers that I have ever seen. It is essentially a zombie film but there is so much more intelligence compared to your average gore infested zombie flick. This is thoughtful, provoking, clever and overall an amazing film throughout. Only minor criticisms come from the occasionally scrappy looking digital film used and some niggling continuity errors. Very minor things to bring down this horror classic. Easily the most exciting and cleverest zombie film ever."}, {"rating": "10", "text": "[***Potential Spoilers***] 28 Days Later is the best film I've seen yet this summer. The acting, writing, cinematography, music were all top notch. As a horror film this one is a one of a kind. Its real ability to scare its audience has little to do with typical horror movie conventions, although it does manage a moment here and there, such as the church scene (especially the moment when ..... [reference deleted]). However, this film's perspective on human nature is where it achieves the most scares. From the well meaning animal rights group in the beginning of the film to Jim's rampage at its end (which has entered into my all time favorite movie scenes), no one in this film is free of sin, an inherently violent nature or accountability for their actions. The Rage disease is just a medium for human nature to act out it's most primal inclinations, which seems to be aimed at harming other human beings. The third section of the film which takes place at a manor house under the \"protection\" of a small military group only confirms these tendancies. The soldiers actions towards our heroes (especially the women) drives home the idea that humans don't need to necessarily be infected with Rage to canabalize upon each other."}, {"rating": "9", "text": "This movie is more than a zombie horror flick if you ask me. It really revolutionized the apocalyptic thriller in many places. It's much more fast-paced in that the \"zombies\" if you will, don't hobble after you and moan. They sprint and the chances of survival are much less. There's also an eerie feeling a claustrophobia at the beginning of the movie, even though the main character is out in the open with London to himself. It also creates characters that you begin to love, and hate. There's a thing about how people killing people is how it's always been and that they're in a state of normality even with the crazies running around. One of my favorite horror/thrillers I've seen, and I can't wait to see the sequel."}, {"rating": "8", "text": "Very good zombie movie. Scary in parts and has a good social commentary."}, {"rating": "8", "text": "A new take on the zombie genre, and a very successful one. 28 Days Later is a great movie, from its unique storyline, beautiful camera-angles, and well-written characters, the film's greatest strength is the fact that the characters involved are so human, unlike the superhero characters you might have seen in other movies like Resident Evil, these characters behave in ways we would have in situations like these, so it is easy to attach to them. The only flaw in the film is that it loses some of it's strengths in the second half for a while, but that can easily be overlooked considering what a quality product 28 Days Later is. Recommended for any horror movie fan who wants to see something different than the usual shoot-em-up."}, {"rating": "10", "text": "Great!!"}, {"rating": "10", "text": "28 Days Later remains my favorite movie of all time. Not only does it have some of the most amazing camera angles and artistic shots, It's intensity is absolutely unmatched. Cillian Murphy and Naomie Harris are simply superb as well. Many people who see this movie fail to understand that it's not just a stupid zombie flick. 28 days later is far more; it's an intelligent study of the human psyche and how we're mentally affected by danger. The cinematography in 28 days later is equally impressive; the colors and filtering used in the camera work are nothing short of breathtaking. If you have any interest in horror movies, or for that matter movies at all you owe it to yourself to immediately rent or (preferably) buy 28 days later."}, {"rating": "9", "text": "Gripping all the way through. Very dark and interesting movie. Well made for a film on a small budget. Thought the ending was a bit pox as it really did not answer many questions."}, {"rating": "9", "text": "This movie is so much more than just some horror flick. It delves deep into the human mind and shows us what we are really fighting in the world today, human nature. The change from man against beast to man against man was magnificent, and really showed the underlying theme of the movie."}, {"rating": "10", "text": "The greatest zombie movie ever. It is fast paced throughout the whole entire movie that leads up to a very exciting climax."}, {"rating": "8", "text": "This movie had an overall good plot and a good cast, some parts to me were unreal, and other parts were filled with unneeded gore. But overall this movie was very satisfying."}, {"rating": "9", "text": "Shocking realism and some of the genre's most horrifying shots in recent years are captured perfectly by Boyle, who succeeds in creating genuine fear from the base of one of humanity's most elemental anxieties -- that which can tear a city such as London to the bare; the fear of an unknown viral pandemic. Released when it was, Boyle's already horror classic tackled this global nightmare precisely when it was to be most effective; as SARS was striking on high abroad and America was on alert to prevent any cases of its own. '28 Days Later' is unrelenting horror cinema that first stunned England, and then created an epidemic of fear in the States. This film is quite possibly the most intellectually ripe"}, {"rating": "8", "text": "Good movie. Oh my the way for some of you idiots out there who think it's a zombie movie and are compairing it to classics like Romero's stuff, I have some news for ya: THEY ARN'T ZOMBIES FOR GOD'S SAKE! Stop calling them zombies! The director even said, \"This is not a zombie movie....\". He said it himself! Ok I'm done."}, {"rating": "5", "text": "Good storytelling, but some painfully stupid plot lapses. For example, there are electric lights when needed, the infected never attack each other, and the whole episode with the army is completely implausible. Smart money says, stop the DVD after they dinner with the army chaps."}, {"rating": "8", "text": "this movie is a return to the under-produced, anti-special effects crap that Hollywood has become clogged up with. Its a real ,believable & so enthralling look at metaphors,alternate meanings &ultimately survival of the human race. Superb acting,fresh faces & a gripping story line will leave you breathless!"}, {"rating": "10", "text": "Awesomely made. 28 Days Later kicked major ass with a kick ass ending. Greatest infected person movie. Blows away the 2nd."}, {"rating": "10", "text": "The best zombie movie I have ever seen. It was good enough to merit a sequel, 28 weeks later, which is also amazing. Those two and dawn of the dead really are the best zombie movies out there."}, {"rating": "9", "text": "This movie was outstanding  it has a very strong political message and it is very well structure  Love the directing style for this film. David Boyle did an outstanding jib with directing it. The cast is good  but the only problem is it might be boring to some people. Overall this film is one of my favorite zombie films, its different this movie isn't supposed to be action pack, this is the beginning of the zombie apocalypse. I love the multiply cam shots in the streets. You should watch this film if you like good movies."}, {"rating": "10", "text": "This is the best zombie movie I've seen so far, it has great characters, plot, acting, and feel to it, while watching you feel like there is no hope for the characters, which makes them all the more enjoyable, a must see not just for zombie fans, but for fans of amazingly well made movies, every bit deserving of a perfect 10."}, {"rating": "8", "text": "The film explores the human's most basic needs and instincts. Among them are, the fight for one's individual survival at all costs, and the need for a perspective on the future of humankind, even if that would lead to detaining and raping the last few women. Interstingly, one of the characters in the movie claims that people have killed each other since the birth of humankind, and that therafter nothing has changed since the arrival of zombies. This claim is open for interpretation and might imply that our kind's rage against one another will eventually lead to our own apocalypse. Another character suggests that due to the short time men have inhabitated Earth, the world will go back to normalcy after the extinction of the humans. Nevertheless, the movie is by far not nihilistic, but also claims that love for one another is our most important need, and therefore gives life a purpose even in the most dire situations. A great, and at times intense, low budget movie."}, {"rating": "8", "text": "When I first heard about this movie I was pumped. I can NEVER get enough quality zombie/infection type movies if they are well done, and this is WELL done. Acting is solid, the effects/costumes/blood/gore as all very believable, some parts will get you angry tho and thats what I love about movies, some parts you just want to reach through the screen, kept my involved and entertained throughout, same as 28 weeks later, BOTH quality infection/plague flicks that are a must watch for anyone a fan of those things. I wish theyd make more like this...!"}, {"rating": "8", "text": "I really enjoyed this! I liked the characters, and the acting was good. There wasn't quite enough gore for a zombie/apocalypse movie, but it was pretty intense just the same. The music was fantastic, and fit perfectly with what was going on."}, {"rating": "8", "text": "This was a great zombie movie ... I enjoyed the dynamic between the heroes and the twists that caused even more stress between the actors.  One of my favorite zombie movies ever."}], "recommendations": ["the_girl_with_all_the_gifts", "world_war_z", "daybreakers", "the_purge_election_year", "night_of_the_living_dead", "the_crazies", "they_live", "chernobyl_diaries", "annabelle_comes_home", "it_follows", "the_descent", "ouija_origin_of_evil", "the_ritual", "sunshine", "the_conjuring_the_devil_made_me_do_it", "monsters", "event_horizon", "house_of_1000_corpses", "the_strangers_prey_at_night", "pandorum", "the_day_after_tomorrow", "the_last_days_on_mars", "insidious_the_last_key", "us", "battle_los_angeles"]}