{
  "id": 2013,
  "title": "28 Weeks Later",
  "starring": [
    "Robert Carlyle",
    "Rose Byrne"
  ],
  "runtime": 100,
  "genre": [
    "Horror",
    "Thriller",
    "Science Fiction"
  ],
  "description": "The inhabitants of the British Isles have lost their battle against the onslaught of disease, as the deadly rage virus has killed every citizen there. Six months later, a group of Americans dare to set foot on the isles, convinced the danger has come and gone. But it soon becomes all too clear that the scourge continues to live, waiting to pounce on its next victims.",
  "releaseYear": "2007",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/ja8nzgtzhJq0vtX3BJcnbceIxCF.jpg",
  "categories": {
    "plot": 4.8,
    "acting": 5.03125,
    "ending": 4.375,
    "soundtrack": 2.0,
    "cinematography": 4.0,
    "familyFriendly": 3.0,
    "funny": 4.0,
    "action": 5.125
  },
  "reviews": [
    {
      "rating": "5",
      "text": "Newbie director Juan Carlos Fresnadillo sure knows how to give horror and fun using impeccably preposterous, over-the-top methods. However for \"28 Weeks Later\", that's how far the film is capable of bringing itself up to."
    },
    {
      "rating": "5",
      "text": "Compared to the 28 days later, this movie is quite mediocre, and lacks substance. The idea of a re-emergence of the virus was exciting and quite alluring. I couldn't wait to watch it but the movie didn't deliver what it offered. The first 40 minutes of this movie are promising, critical, intense, and gripping; however, soon after the movie loses lustre . The argument could have been better elaborated, because there were good ideas; instead, it becomes redundant and futile. Sadly, the characters were not well developed but shallow. Their reasoning and behaviour were mostly, obtuse, one-sided, and irresponsible. Precisely because of it we never really care about them or feel any connection with them. Personally, I truly disliked 'Scarlett'and Tammy's characters. The ending was quite predictable, and the performances unimpressive.To me, watching this movie once was a 'must' and it was okey but I wouldn't watch it again. Overall: a movie with good intentions, pretentious, but ultimately disappointing."
    },
    {
      "rating": "4",
      "text": "I just watched this for the first time because Left 4 Dead put me in a zombie movie mood.And goddamn, what a **** disappointment. This movie seriously pissed me off. I'm still angry sitting here thinking about it. It had a pretty cool premise, the US army reestablishing a colony on Britain after the infection died off. Unfortunately, the movie is really short, cause we're already at about the halfway mark by the time the infection comes back. That's just not enough, especially since this is a sequel, meaning we're expecting things to be bigger and better. For the most part, this didn't happen. And they had all the ingredients to make a great sequel.First off, we're supposed to buy that these two dumb kids can sneak out of the safe zone. The level of military incompetence in this movie is truly a wonder to behold, it's **** everywhere. And seriously, if these kids were real, they wouldn't **** risk their lives going out to their old house, the area's got damn zombies. I'd be happy to stay in my cozy penthouse or whatever the **** their dad had going. The girl apparently went back to pack her lame ass shoes or something, dumb.Then, when they find the infected mom and bring her in, we're supposed to buy that the dad, Mr. Carlyle, has the handy dandy all access keycard and can sneak around like **** Sam Fisher to get in undetected and see his wife. Again, absolute military idiocy. What kind of military gives a civilian caretaker access to a medical bio hazard quarantine?So he goes and kisses her all sloppily and gets her saliva, which is icky. Then he gets infected and attacks her. This is odd, because this is the only known case of one infected attacking another infected. In every other instance in the movie, the infected are all running together merrily as one big horde, never attacking each other. How strange.Later, the military stupidly sticks the civilians all together in one big warehouse for their own safety. And locks it, with one cheap ass padlock. Ok, whatever. However, their brilliant containment plan is somewhat flawed, because this warehouse apparently has a back door which is not locked, and unluckily gets accessed by the infected Mr. Carlyle. Great, all the innocent civilians are locked in a room where they can all get infected together. What the **** movie? Why do you make yourself so damn stupid and nonsensical?So everything goes to **** and Doyle the Delta sniper comes to rescue them. Cool, this is getting interesting. But then they run into another army sniper who begins sniping at them. Now, this is where they again lost me. Instead of getting on his radio and saying \"Whoa whoa, stop shooting at us, we're not infected!\" Doyle shoots the sniper. Wait, what? Would a US army sniper really shoot another US army sniper in cold blood? This didn't make any sense.Now, there were a few things I liked. One was the helicopter chopping up a bunch of infected with the rotor, that was pretty awesome.Later on, they get stuck in a car to escape a gas attack. Now, I'm not really sure that getting in a car, closing all the vents and breathing through your T-shirt would really protect you from a gas attack, but we'll let that slide. They see that there are gas mask soldiers coming to torch **** with flamethrowers, and the car won't start. So Doyle decides to get out and push. This leads to him getting burned alive. This was really dumb. Nonsensical. Why didn't he just get out and show the guys with flamethrowers that he wasn't infected? Then he wouldn't have been toasted. Or hell, he could've gotten out and shot them all with his rifle, which he happily did before to the sniper. No logic at all. Just a cheap death to shock the audience, after making us like the guy.Now we come to the worst part of the movie for me, the nightvision trek through the subway. This was **** excruciating to watch. Some ppl actually said this was \"artistic\" but I don't see anything artistic about seeing everything in green night vision while being whirled around like in the Blair Witch Project. I go to the movies to be entertained and this was not entertaining in the least.This scene also ended a very problematic element of the movie for me, the dad character as some sort of main villain. Sorry, but this whole thing didn't seem like a good idea. I prefer my zombie hordes to be, well, zombie hordes. Just faceless masses of death. The introduction of a boss zombie like the dad was lame and really took away from the sort of realism that the first film achieved, IMO.So yea, this film was a huge disappointment, since I really liked the first film. While that was dark, this just seemed pointlessly retarded, especially the cheap deaths of some main characters. Left me feeling full of rage, you could say."
    },
    {
      "rating": "4",
      "text": "This is a big step down from 28 Days Later. The storyline is pretty bad and there are A LOT of moments that will make you yell at the screen. Almost every character in the movie seems to be as intelligent as a stack of Pringles. It really, really pisses me off when characters are that dumb; the movie loses all credibility with me. Sure there are some tense moments, but this is mostly shovelfilm. I just can't take the movie seriously when the characters are so  so stupid. And an EOTech optic does NOT have your standard hunting reticle."
    },
    {
      "rating": "4",
      "text": "In 2002, Director, Danny Boyle re-invented the zombie movie with his groundbreaking film 28 Days Later. Many credit Boyle with the current zombie craze we enjoy eleven years later. What made that film so enjoyable was that at the time it was a story we hadn't seen in a long time and it was shot in a way that made it look like a much older film than it was. Five years later the studio wanted a sequel and Boyle wanted no part of it, knowing that it would never live up to the original and indeed it does not. 28 Weeks Later is a continuation of the story, which claims that all the infected had starved to death and that England is free of infection once again. People start moving back in to areas of the country that have been fixed up for them and which are protected by the U.S. Government. We are then introduced to a family which has been reunited. The film starts out with a tremendous action scene that was the only part of the film I enjoyed and the only part that is reminiscent of the first film. The terrific opening is followed by a long, sappy, family reunion and then by a sick person being found. From that point, literally within ten minutes hundreds of people are infected and the army is shooting everything in sight. How could zombies have starved in the first place, but more importantly how can so many people change, just like that, within ten minutes? It didn't make any sense at all, to make things worse, all dialogue and storyline ends at that point and the movie turns into one big gory chase scene without any substance whatsoever. As for the cast of this film, they did nothing to help the story. In the first film, Cillian Murphy was amazing and carried us through the low points, but here it's a cast of newcomers and unsuccessful character actors, who quickly bring the story to a halt. I was looking forward to seeing this film, but not only doesn't it compare to the first film, but it doesn't even live up to the broad genre it is exposing us to. The cast was sloppy, the direction was confusing, and worst of all it just doesn't make any  sense! 28 Days Later was groundbreaking, but it's sequel is nothing more than an over-hyped movie that never should have been made."
    },
    {
      "rating": "2",
      "text": "The only good scene of this film is the first one. Period. After that, everybody (and I mena EVERYBODY) in it becomes stupid to a stunning point. While in the first movie the soldiers, for once in the whole 'zombie'  genre managed to actually mount an effective quarantine, now they have become bumbling idiots for the sake of the plot: They will leave the infectee with the most dangerous virus ever unguarded, so even a civilian may access it undetected, they will be unable to stop 2 kids breaking their perimeter (who was the genius who thought that brining thousands of civilians without even securing AT LEAST the whole city was a good idea, in the first place?), and generally they will be unable to even shoot an infectee who's coming towars them over a 100 meters corridor.\r And don't get me started with the kids. It infuriates me that I will have to wait until the 3rd movie to know that they finally are dead for real. Because that's all they deserve after being the ones (who would have expected, uh?) to discover an infectee, generally being a pain in the ass, and eventually get lost in the dark because aparently they suddenly became unable to hear or just say 'I'm here'.\r This film was a pain to watch, from start (save for the mentioned first scene, which to be honest is sublime) to end, and I only beared it in hopes that at least the kids would get killed fast, or something would suddenly surprise me. Overall, one of the worst horror films I've ever seen."
    },
    {
      "rating": "5",
      "text": "This was another disappointment, should have take under consideration the mistakes of the first movie, very poor direction again, the actors shouldn't have to carry the whole movie on their own. Good job for the actors.."
    },
    {
      "rating": "5",
      "text": "Well produced movie with so many logical flaws in the plot that it was hard to watch, and it was as equally bad as 28 days later for the same reasons.  The characters that should know better show so much stupidity that it leaves a bad taste in my mouth.  It could have been so much better.  What a shame."
    },
    {
      "rating": "3",
      "text": "Huge Plot holes, and too much camera ramping ruin what begins as a promising sequel. A few o.k. set pieces, but logic gaps, uninteresting characters, and a poorly exacuted sermon hurt this film."
    },
    {
      "rating": "1",
      "text": "Entertaining and solid action, but a few gaping plot holes make it hard to believe. First you've got talk about the U.S. Army and tight security protocols. Then, the next moment, there is practically none. People are allowed to wander around quite freely. Two kids escape. Quarantine for a potentially infected person? There is no quarantine. In a real situation none of the plot turning points could have happened. The script writer should have been told 'you can do better than this'."
    },
    {
      "rating": "2",
      "text": "Although I'm usually able to sit through movies like this and stand up at the end thinking my time wouldn't be spend in comatose, this movie was an exception. The characters didn't engage me at all, and above all there was absolutely nothing original about this movie. *SPOILER WARNING* As soon as we discovered the kid was immune, the entire plot was obvious, absolutely linear bloodbath. [***END SPOILER***] Honestly its just fancy gore effects combined with lots of (annoying) flashing lights to scare the hell out of you, no meaning or worth behind this movie. Didn't expect much, got far less."
    },
    {
      "rating": "3",
      "text": "28 Days Later was original, fresh and clever. 28 Weeks Later was an illogical mess. It features a 40-year-old general (psst, that doesn't happen) and a \"Delta\" soldier with a buzzcut and regulation uniform (psst, that also doesn't happen), and a genius plan that involves a) herding all civilians into a contained area and NOT guarding the doors, b) killing everything that moves rather than, for instance, saying \"drop to the ground so we can shoot the infected\", c) killing even people they can tell 100% are NOT infected, such as one of their own soldiers pushing a car, d) firebombing the city but forgetting to seal the exits, so a big team of zombies escapes. It also features a magical zombie who appears wherever any zombie is called for. This movie is pretty dumb. It belongs on SpikeTV or TBS at 3 a.m."
    },
    {
      "rating": "5",
      "text": "It's definitely a good piece of cinematographic work, and a really promising sequel. But the acting and the chemistry between the characters is so artificial and (sometimes) forced, you can't actually feel sympathy for them."
    },
    {
      "rating": "3",
      "text": "I would like to start off this review with a joke. The 28 Weeks Later soundtrack!!! Why is this a joke? Because they decided to use the same song that ended 28 Days Later four different times throughout the movie (possibly more, I lost track). That aside, this movie was fairly enjoyable.The action scenes and story line were entertaining, but the moral dilemmas were fairly predictable, some of the acting sub-par, and a lot of the script cheesy. Also, I was expecting a happy, fulfilling ending to this movie after the first one. This ending left me depressed and mad. This movie, while mildly entertaining, will not be remembered."
    },
    {
      "rating": "2",
      "text": "Extremely poor American follow-up to a classic British horror movie; proving that more is not necessarily better. Horrible performance by Robert Carlyle makes you reevaluate his acting in \"Trainspotting\""
    },
    {
      "rating": "5",
      "text": "Another week, another disappointing summer sequel. So it goes…\r In actuality, the screenplay for 28 Weeks Later isn't all that bad. Sure, it's repetitious and much of it has been regurgitated from 2003's 28 Days Later, but it contains some interesting elements and offers enough gore that horror fans might have been able to enjoy it… if, that is, it wasn't for the stylistic approach employed by director Juan Carlos Fresnadillo. Apparently, Fresnadillo believes that the proper way to film any action scene is to shake the camera violently and pan it wildly back and forth, thereby making it virtually impossible to figure out what's going on (and pushing viewers with motion sickness to the brink of voiding their stomachs). As if that wasn't bad enough, in the editing room, Fresnadillo ensured that no single shot lasted longer than about a second. Also, the climactic struggle takes place in darkness, making it that much more difficult to decode the action. I didn't realize a character had died until, a little later, it was apparent that person was no longer around.\r I wish this problem was restricted to 28 Weeks Later. Unfortunately, it has become increasingly more common. It's a good way to cover mistakes and encourages laziness. What does it matter if a fight is well choreographed if the audience can't get a clear picture? (My complaint for the recently released The Condemned was similar.) In 28 Weeks Later, it's a source of frustration because I was interested in what was happening but the filmmaker's approach robbed me of the ability to appreciate any scene where there was a fight, chase, or other form of action.\r The first and better half of the movie is primarily devoted to setup and character development. This is where we are given a chance to get to know the new protagonists and given insight into the plan to return London to a living, breathing city from the ghost town it has been for the past half-year. As the movie approaches the one-hour mark, however, it turns into an extended chase, with people shooting, screaming, and being torn apart by the infected as they run around in dark corridors and tunnels and the viewer desperately tries to piece together what's going on. Admittedly, there are limitations to what can be done in a zombie movie, but a whiff of originality or coherence would have been appreciated. (I have a sense that the movie might play better on a television than a big screen.)\r Action scenes aside, the look of the film is faithful to that of its predecessor. London appears grimy and washed-out: a dead, decaying city that at times would seem to be a comfortable fit into the world developed by Alfonso Cuaron in The Children of Men. The overhead and long-distance shots of empty streets and abandoned buildings are creepy, but no more so here than in 28 Days Later. This film will not be used by British travel agencies to promote vacations to London.\r 28 Days Later, while not terribly original, was suspenseful and involving. 28 Weeks Later is neither. The characters aren't as sympathetic or interesting. The kids are generic and the script doesn't care much about the adults. Robert Carlyle, Catherine McCormack, and Rose Byrne are criminally underused. Compare them to Cillian Murphy, Naomie Harris, and Brendan Gleeson from the first film, all of whom inhabited better developed and more sympathetic personalities. Tension in horror movies results from viewers caring about what happens to characters. The audience's connection to the protagonists of 28 Days Later made it a compelling experience. The lack of such a connection in 28 Weeks Later reduces this to a number of sequences characterized by shock moments, frenetic (and often chaotic) action, and stylized gore - all without suspense.\r It's too bad, because the fundamental idea of extending the storyline introduced in 28 Days Later is an intriguing one. The problem is that the people entrusted with the responsibility of bringing this to the screen made decisions that resulted in a deeply flawed product. My advice to Fresnadillo: next time you make a movie, allow viewers to see what's happening in real time rather than have to interpolate based on the results. Technique and style are more at fault than any other issue in undermining the effectiveness of this zombie thriller."
    },
    {
      "rating": "5",
      "text": "If you want a surviving the zombie-apocalypse film, re-watch 28 Days Later. If you want a ho-hum preachy drama (at its core) with shoehorned in gore and violence, set in a recovering local apocalypse caused by zombies/infected, watch this film. It does an alright job in that regard. I wouldn't suggest paying more than $5 USD to own this, however.\r Why? This was largely a dull uninspired drama with zombies and violence shoehorned in, merely passable writing, and decent acting. It has its moments, but they are few. The Romero-esque ending was a nice touch, but ultimately couldn't elevate this addition to the \"28 Days Later\" franchise from \"so-so\" to \"good\". This is a pity as there was a lot of very good source material to expand on from the first movie, much of which was left untouched in this one. While watching this movie, I felt as if it was a rehash of long debated topics, in ways that were none-too-original even for its time.  It's not a bad movie to watch, however, it's just not great.  It doesn't live up to the thrills and tension set in the first movie. And as many others have pointed out, among other things, the quarantine protocols were all but non-existent, making for a common-sense based break in immersion/suspension of disbelief, which ultimately proves a disservice to the moral/ethical questions this movie tried to raise."
    },
    {
      "rating": "5",
      "text": "American army thinks they've contained the virus so start bringing British refugees back into London from abroad but they can't even keep a couple of kids in the safe zone."
    },
    {
      "rating": "3",
      "text": "Sure, zombie movies are not about realism, but does every single character have to be so **** stupid?!!!? They leave everything to chance! no wonder they end up dead, it's so full of mistakes: awful security; the soldiers must be thinking this is a joke, there is no other way. They let two STUPID kids go into the infected zone, those kids are also stupid enough to go near and even touch dead infected bodies! The soldiers don't keep each other informed, they don't secure the infected mother (no permanent surveillance, no cameras, no alarm), the husband just so happens to pass EVERY security guards like it was nothing and stupidly kisses her, which makes ONE infected and no **** soldier is smart enough to shoot him: they go alone, they're not careful, THEY D'ONT EVEN DRAW THEIR WEAPONS!!! They can't even secure the civilians in the SECURITY room because the infected can easily get there by just OPENING THE DOORS!! Then when they get ALL infected and the soldiers have to shoot everybody they use snipers! Not explosives or flamethrowers as they later do, but long-range snipers who take down ONE infected at the time! Then they decide to bomb the whole zone through airborne attack and release toxic gas (which makes the bombs pointless + it destroys all the buildings) actually both are pointless because some infected even managed to survive that! The remaining survivors try to escape the gas be locking themselves up in a car, which shouldn't work because cars are in no way gas-proof, they do cover their mouths with clothes though, and it shouldn't work either otherwise the army wouldn't be using this gas if it didn't penetrate very thin clothes! Afterwards, they get chased by a helicopter and drive into a metro station to escape the bullets (it is commonly known that trained US soldier can't shoot a car from a heli in more than 2 min), but instead of going back up and waiting for the heli to leave, they go deeper into the completely dark station with NO LIGHTS except for ONE night vision scope on the dead soldier's gun and guess what? they get separated in the complete darkness with an infected, but of course no one shoots until someone dies, no one screams \"I'm here! HELP!!!\" and they leave the gun behind... -_- It's only at this point of the movie that the two kids realize they're immune and that's why it's so important that they live because it did not cross ANYONE's mind to tell them before, which makes me think that the survivors are as brain damaged as the infected... THE END! This movie surely does not deserve a good rating, except for the good acting and makeup, otherwise SXF was sometimes **** music was nice too. In conclusion, if you want to survive a zombie apocalypse, don't watch this movie, and **** run when you see a zombie. To the writers: next time PLEASE don't do something COMPLETELY predictable or stick with the first 15 min of the film that actually looked like 28 days later!"
    },
    {
      "rating": "6",
      "text": "To the movie's credit, it's built almost entirely on scenes that are wonderfully composed individually, and the opening sequence is a thing of beauty that arguably tops any sequence from the original. The catch is that, when strung together, the scenes don't work nearly as well as they should, because this movie has at least as many gigantic plot holes as it has good scenes. The result is a still-good mess of wasted potential, something like a delicious cake that was dropped two feet onto your plate instead of being gently placed there; while you can still very much enjoy the pieces, you're left with the sense that you're missing out on the glory of what could have been."
    },
    {
      "rating": "3",
      "text": "The first 15 minutes that Danny Boyle directed was like the original, awesome. But the rest was just too predictable, leaving no room for any intensity or frightful moments.Yet another IP ruioned by idiots."
    },
    {
      "rating": "0",
      "text": "This movie was utter crap, the first 15 minutes feels like a meth induced hallucination - and really did we really need to have one of the main character gouge out his wife 's eyes for like 5 minutes. Terrible, felt like amateur video game graphics."
    },
    {
      "rating": "10",
      "text": "No, Conor B., how misleading Metacritic users can be. Are you serious? You're suggesting that a zombie movie is...implausible? Are you kidding me? You're an idiot. Zombie movies aren't supposed to be about realism. They're supposed to be scary and intense, and that's exactly what 28 Weeks Later was. Stick to the more important George Clooney type movies with realistic situations and realistic people. Or, you know, you could just go outside and experience realistic situations yourself, but those aren't that entertaining, are they? And, Harry G., what they hell are you talking about? There were only a few scenes that even used CG.... Most of the people underrating this excellent movie don't even know what the hell they are talking about: they're either enraged that this movie is a sequel (and all sequels MUST suck, it's a traditional POV to take on all sequels) or they're upset over the lack of realism...in a movie about zombies. I'll stick with the critics, thanks."
    },
    {
      "rating": "10",
      "text": "Just to let everyone in on a secret. They are not zombies and that is why the father followed them. They are just real angry. Now actually watch the movie and don't go into it thinking this movie sucks because they didn't explain everything to me."
    },
    {
      "rating": "9",
      "text": "I've already seen this dvd multiple times since its release, and have loved it every time. Great zombie movie that is a complete departure from 28 Days Later (so stop comparing the two you imbeciles, they're hardly similar). The sheer terror and manner in which the virus effects all involved always draws me back."
    },
    {
      "rating": "8",
      "text": "Wow, i wasn't expecting much from this film, but it really delivered. I would say its just as enjoyable as the first film, but it definitely achieves this in different ways. Some things irritated a little bit, such as some fairly large plot holes, and a certain zombie popping up everywhere but you don't tend to notice them because of the pace at which the movie moves. A warning as well, this movie is incredibly violent. It makes the first film look g-rated in my opinion. I had one friend walk out 10 minutes in and another 3/4 of the way through."
    },
    {
      "rating": "9",
      "text": "Somehow manages to not only top the first one, but be a thoroughly original horror movie to boot. Something you don't see in sequels these days."
    },
    {
      "rating": "9",
      "text": "I thought this was fantastic, the effects are amazing and had me sitting on the edge of my sit, the use of children is smart as people will sympathize with them, the best movie I've watched in a long time."
    },
    {
      "rating": "9",
      "text": "Great sequel, but some will say that the original is better. I like the action though, and the atmosphere is still tense throughout."
    },
    {
      "rating": "10",
      "text": "Excellent. I saw it a week ago and I;m still thinking about it. Definitely recommend it for anyone who likes suspense!"
    },
    {
      "rating": "9",
      "text": "Firstly! This is not a zombie movie! They are not zombies, they are infected with a virus! The victims do not die! And as for the person saying that the UK director was trying to say something political, does the name Juan Carlos Fresnadillo sound like an English name?! Secondly, this is a top notch movie!"
    },
    {
      "rating": "8",
      "text": "If you enjoyed the first you should enjoy this, I found the first to be more scary than this."
    },
    {
      "rating": "8",
      "text": "Killing the Dead is Good."
    },
    {
      "rating": "9",
      "text": "I'm not sure what was so fantastic about 28 Days Later. A developed plot? Yeah, RIGHT. It starts out with a monkey that bites someone. The rage virus is let loose, causing everyone to go nuts! Yawn. Sounds a lot like the Umbrella virus from the Resident Evil games"
    },
    {
      "rating": "10",
      "text": "One of the best movies of the year (or was it last year...I don't remember). It's been a long time that I left the theater throughly satisfied with a movie in every aspect. On top of that, for it to be a sequel that I felt this way about is mindblowing. Perhaps the one and only time. I can safetly say in my own mind that I enjoyed it more than the original. It took me awhile to really appreciate the original, tho I liked it. However, 28 Weeks Later has everything that was great about the original and so much more. Better characters, a better story, better action, scarier, more shock value, and a non-happy ending that I luv. When I say \"shock value\" I don't mean in terms of gore (tho it has that), but I mean that some of the main characters die and I didn't expect it what-so-ever. A lot of the time you can see a person's death coming from a mile away, but my favorite character in the movie...whom shall remain nameless to not spoil it...dies so suddenly that I actually felt EMOTION for a fiction character. That rarely happens for me. The only other recent time I can remember feeling something like that was when Leo's character died in the Departed (ya, spoiler...you should of saw it by now). I also love how the Helicopter pilot comes off as kind of a jerkoff but I know I would do the exact same thing he did. I read a lot of people saying that what the characters did at times was illogical, but I believe the character's acted in a very realistic way and they acted like realistic people...not cut in dry...good and bad. I can't wait to buy it tomorrow."
    },
    {
      "rating": "3",
      "text": "I loved the first movie (28 days later), but this one just doesn't make sense. The plot holes are too big, the ambiance is good at the start, but later you will just be watching to events that follow to each other and make little sense. Maybe because of the big expectations I had, but when I finished watching this movie, I was was really unsatisfied."
    },
    {
      "rating": "1",
      "text": "Do you like movies where you don't have to think? Do you enjoy movies with plot holes the size of an Airbus? Do you enjoy movies with magical zombies that can teleport? How about movies with the most stupid, idiotic unengaged characters? Well you will enjoy this film! Now, don't get me wrong, I love gore, suspense, great music score.. which you will find in this movie.. well the first 5 minutes, but after that, you got nothing. Illogical, how does a Janitor have clearance all through-out a military base? How do the kids in the film defy all logic throughout? If you want an engaging horror movie with characters you feel sorry for when they die, with an actual real soul. Avoid this film."
    },
    {
      "rating": "6",
      "text": "Sequel to the hot & cold 28 Days later.Britain has been cleared of the Rage infection/virus so the intention is to re-populate. Americans get involved, probably looking for oil under Canary Wharf.It plods along at an ok pace, few twists & turns here & there but nothing really special.Top marks for the scene in the subway with the sniper night scope sight though."
    },
    {
      "rating": "8",
      "text": "A terrific movie dealing with the moral problem of utilitarianism: sacrifice a few to save many?"
    },
    {
      "rating": "8",
      "text": "When I first heard about this movie I was pumped. I can NEVER get enough quality zombie/infection type movies if they are well done, and this is WELL done. Acting is solid, the effects/costumes/blood/gore as all very believable, some parts will get you angry tho and thats what I love about movies, some parts you just want to reach through the screen, kept my involved and entertained throughout, same as 28 weeks later, BOTH quality infection/plague flicks that are a must watch for anyone a fan of those things. I wish theyd make more like this...!"
    },
    {
      "rating": "8",
      "text": "I'd say 28 weeks later takes what 28 days later did and does it a slight bit better. Again, like it's prequel it's an amazing horror/zombie flick, definitely worth a watch!"
    },
    {
      "rating": "0",
      "text": "This movie was amazing! I don't see how people can dislike it. Jeremy and Robert braught tears to my eyes and i never cry at movies. I say go watch it because this is the best zombie movie i have seen in a long time! I hope they make a sequal."
    },
    {
      "rating": "9",
      "text": "Brilliant film, but does not fill the boots left by its revolutionary predecessor. I wish the film focused more on human drama and futility, as the first film did, as opposed to action. The human drama of the first film was partly what set it apart from the crowd. Despite this, the film is expertly shot and once again integrates a brilliant, eerie soundtrack."
    },
    {
      "rating": "9",
      "text": "Está genial, hay más acción y es más explícita, es lo suficientemente buena para estar a la altura de su predecesora, pero los personajes de aquella me cayeron mejor y en esta secuela el conflicto se desata gracias a la imprudencia de los jóvenes protagonistas."
    },
    {
      "rating": "0",
      "text": "Very successfully pissed on the first movie. In this sequel, love and empathy ruins the world and makes everything worse for humanity. Love no one, kill everyone, what a great message."
    },
    {
      "rating": "6",
      "text": "Was never going to beat 28 days later but it's a respectful attempt at a sequel."
    },
    {
      "rating": "7",
      "text": "Jarring and unpleasant, but still a good movie. The critics were wrong about it surpassing the first one, though, as this one lacks the sense of isolation that made 28 Days Later so effective."
    },
    {
      "rating": "6",
      "text": "I guess I'm a believer in the axiom that \"Less is More.\" Unfortunately, for \"28 Weeks Later\" more is less. The major problems with the movie-apart from the totally ridiculous quarantine standards the US-led NATO army has-is that there is no major character for the audience to follow. The female doctor and sniper are fine characters but their parts aren't big enough. The little boy and older sister aren't strong either. This isn't to say that the movie is a complete loss. The first 15-20 minutes are incredible but that's essentially the first film, \"28 Days Later.\" That being said, this film is still better than \"Saw\", \"Hostel\" or the latest Rob Zombie offering."
    },
    {
      "rating": "6",
      "text": "I was very upset over this movie, 28 days later was great, it portrait realism and and superb acting. 28 weeks later however was pretty good but nowhere near as good as the first. it seems like they took more of a resident evil approach to it, which i did not like"
    },
    {
      "rating": "9",
      "text": "'28 Weeks Later' is visceral and gripping moviemaking of an uncommon order. It manages to reaffirm the terror of it's predecessor while also charting down an unrelenting path of mounting doom and gloom. It explodes at a fevered pitch from it's very first scene, and the pace never wavers for more than a couple seconds. This is simply one of the finest horror films of recent years. A must see!"
    }
  ],
  "recommendations": [
    "paranormal_activity_the_marked_ones",
    "the_purge_anarchy",
    "the_purge",
    "escape_room",
    "paranormal_activity_the_ghost_dimension",
    "frozen",
    "jurassic_world_fallen_kingdom",
    "47_meters_down",
    "how_it_ends",
    "doomsday",
    "final_destination_5",
    "jurassic_world",
    "paranormal_activity_2",
    "final_destination_3",
    "sanctum",
    "the_strangers_prey_at_night",
    "unfriended_dark_web",
    "war_of_the_worlds",
    "crawl",
    "escape_room_tournament_of_champions",
    "transformers_age_of_extinction",
    "olympus_has_fallen",
    "would_you_rather",
    "unfriended",
    "snowpiercer"
  ]
}