{"id": 1357, "title": "2 Guns", "starring": ["Denzel Washington", "Mark Wahlberg"], "runtime": 109, "genre": ["Action", "Comedy", "Crime"], "description": "A DEA agent and an undercover Naval Intelligence officer who have been tasked with investigating one another find they have been set up by the mob -- the very organization the two men believe they have been stealing money from.", "releaseYear": "2013", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/ptURGAFktibhk7DEAbMazlmNqWa.jpg", "categories": {"plot": 5.791666666666667, "acting": 5.857142857142857, "ending": 6.444444444444445, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 3.0, "funny": 7.592592592592593, "action": 6.5}, "reviews": [{"rating": "8", "text": "An action movie with enough humor and shootouts to be worth a watch. Washington and Wahlberg work great together and both play very entertaining characters. The plot itself is also above average for a film of this type. So if you're looking for an action movie to watch that sprinkles in genuine humor in between shootouts, then \"2Guns\" is a great choice."}, {"rating": "6", "text": "Not an academy award movie but I must say very entertaining... interesting story line and good acting with good dialog between the actors... well worth seeing"}, {"rating": "8", "text": "This movie was exactly what you wanted and promised it would be. A fast paced action comedy with well thought out and realistic gun play and tactics used by the two leads. I was well happy and impressed with the on screen chemistry. Paula Patton naked doesn't hurt either."}, {"rating": "7", "text": "\"2 Guns\" 10 Scale Rating: 7.0 (Good) ...\r The Good: Washington and Wahlberg make a great \"odd couple\". While playing similar characters to ones we've seen before, the charismatic actors played off of each other well. The script itself wasn't bad and the action was well choreographed. Relatively simple and straight-forward, \"2 Guns\" is an entertaining film.\r The Bad: It does eventually devolve into a typically shoot em' up buddy film. While it is still highly entertaining, it does have it's cliche and extremely predictable moments that detract somewhat from the movie."}, {"rating": "6", "text": "2Guns\" stars Denzel Washington and Mark Wahlberg and was directed by Baltasar Kormakur (“Contraband”) with a cast including Bill Paxton and Edward James Olmos in this too slick action/ comedy. There is an artificial chemistry that the writers seek to create between Wahlberg and Washington to which the audience is constantly conscious of so that each line they deliver has the implied thought \"boy will the viewers love this\"\rThe plot to this film and the role of the lead characters are confusing and full of turns and twists that will  make your head reel more than the constant overturning of the vehicles in the wild car chases and crashes.\rThere is nothing subtle about this film and it is obvious that the producers are attempting to create a franchise a la \"Lethal Weapon\".\rThe film is a good visual experience with a sound track that matches the fast action scenes and represents  a strong  attempt to attract the teen age and early 20's audience. Although the film will probably  do well for that group, for the viewer looking for more, the film will be a disappointment. I give this film a 6. Simply put, the 2 guns weren’t loaded."}, {"rating": "8", "text": "I thought this one was a lot of fun.  It has a great mix of action and comedy that keeps it from being too serious and too silly.  Washinton and Wahlberg are great together and play off one another terrifically.  Edward James Olmos and Bill Paxton are also really great in the film as well and just give the film a very solid cast.  The only complaint I had was the movie feels a little rushed at the end but it didn't kill my enjoyment factor.  Just a fun (and funny) movie."}, {"rating": "8", "text": "This movie is an excellent movie everybody should go out and watch it as the plot is excellent and doesn't fail to entertain.trust me this movie is worth watching"}, {"rating": "0", "text": "I am relieved that I can give a 0/10 star score at metacritic. This movie was sickeningly cruel; a few scenes in the beginning ruined the entire thing. There was no need for those scenes, and those who have seen the movie will know exactly what I'm talking about. Cruelty to animals, realistic CGI animals or not, is always wrong and having it so graphically portrayed in a movie propagates those actions into society, making what they show more likely to happen in real life.  I will never be able to un-see or un-hear those scenes, and if I had known they were in the movie, I wouldn’t have gone to see it in the first place. Even if the movie didn't have those disgusting scenes, it would have been terrible, with a lackluster plot and various hokey one-liners, which are haphazardly reversed in the end. The makers and actors should be ashamed of themselves for making this movie and putting it into the film industry. Do not see it."}, {"rating": "7", "text": "Fun flick, and that's why I go to the movies. To have fun. Not to listen to a message. Not to view cinematic art. Just to have fun. This movie delivered that."}, {"rating": "10", "text": "Aight, so I saw this movie it had 1 gun in it. That movie was hella dope! but when I heard about 2 guns, man I was excited. I saw this movie opening night, couldnt believe what i was seeing!!! 2guns has everything! twice as many guns as the other movies, they getting cash and the explosions so realistic you can feel the burn.\rthis movies 10/10 favorite movie."}, {"rating": "0", "text": "A painfully appalling attempt at the humorous, buddy/action genre.  This thing falls drastically short of being any way entertaining.  It has no story, poorly-drawn characters, irritatingly weak dialogue and boring action.  Don’t waste your time.  There are plenty of better buddy/action films out there."}, {"rating": "10", "text": "I am simply going to say good fun, good action and nice plot with all the nice twist. Denzel and Mark worked really well together, support cast including Bill Paxon were all on point. See It you will like it."}, {"rating": "5", "text": "The only two things that differentiates “2 Guns” from dozens of other action movies are Denzel Washington and Mark Wahlberg whose bromance reminds one of the banter between Bruce Willis and Cybill Shepherd in “Moonlighting” and here you wait for the two guys to walk off into the sunset, holding hands, into “2 Guns 2”. There are a lot of crotch jokes, certainly double entendres, but done with an ease between the guys that  keeps you continuously smiling,\r At one point I thought I may have walked into “White House Down” or “Lethal Weapon 10” as there are cops, robbers, the CIA, FBI, the Navy, houses being blown up, car races and crashes, windows smashing all over, a drug lord, double crosses, helicopters crashing, lots of gunfire, a fairly high body count and everything else you have seen before in action movies.\r One of the new things in this movie is Washington and Wahlberg wrestling in the desert that is very funny and at the same time sexier than anything you saw in “Brokeback Mountain”. These two actors obviously enjoyed working together and in many scenes share that joyful play with the audience.\r The story is really immaterial but there is one by the screenwriter Blake Masters that at times is blurred but he certainly knows how to write one liners. The director Baltasar Kormakur keeps the action going, interesting and has an excellent cast, In addition to the  two stars there are Edward James Olmas, Bill Paxton, James Marsden, Fred Ward and Paula Patton.\r “2 Guns” is far from a classic but anyone who likes the two leads shouldn’t miss this and the ending of the old Hollywood, “Happily Ever After”!"}, {"rating": "9", "text": "I usually do not like these shoot-em up type movies but went because my husband wanted to see it, and I like the 2 lead starts, Mark and Denzel.I was pleasantly surprised that it had a lot of humor, a good story line, held my interest the whole time and did not have all that much blood and gore. Yes, the ending was mostly predictable though there was a little twist that I guessed early on.  I left the theater with a smile, thinking it had been a night of good entertainment.  See it!"}, {"rating": "5", "text": "Entertaining movie with two leading actors who display great chemistry. There are several plot twists which keep the movie alive and make it a nice watch if you´re not asking for much. But it´s just that. It is the typical action movie made for  male audiences (and straight) where women show their bodies more than males for no reason and a lot of violence happens."}, {"rating": "10", "text": "With Mark Wahlberg and Denzel Washington teaming up for ’2 Guns,’ a lighthearted action movie about a ragtag undercover duo who get themselves into a world of trouble after robbing the wrong bank, we were ready to be entertained. But we had no idea it’d make us laugh so hard! And it doesn’t hurt that the jokes are hilarious. Between Marky Mark telling Edward James Olmos that he looks like a “Mexican Albert Einstein” (which is very true), and Denzel slapping people around with abandon, 2 Guns might be better classified as a comedy. Here’s how funny it was  it actually got me to laugh at a fart joke. That’s historic stuff right there.\rYou can probably already guess how 2 Guns ends, but that isn’t the point. The point is you won’t want it to end, because this thing is just too fun to watch."}, {"rating": "5", "text": "Decent movie with great action! It's just not my type, if you wanna know my favorite movies, check out my profile. Otherwise  i didn't like it but i think that most people WILL. So my score is 5/10"}, {"rating": "6", "text": "Standard action film with good acting and interesting plot. But is doesn't offer anything original. Most of the details are predictable. So, overall it's a decent action movie, with some plot holes."}, {"rating": "6", "text": "Not bad, precisely what you would expect from a light-hearted action buddy movie.\r The character stuff was alright, a little heavy handed with how over the top Wahlberg's character was written at times.  Denzel's character was a little lost frankly, never really materialized as a complete person... but who cares, this is a buddy action movie, right?  If that sentence was palatable to you then you are well equiped to watch this movie :)\r The plot tried to be good, but failed.  The evil characters were all one dimensional cliches and if they ever get someone that ridiculous to run ANYTHING in the CIA I'll eat my hat.\r Best part of the movie is watching Wahlberg basically do what Wahlberg does.  The worst part was trying to swallow a man dropping a helicopter with a 9 millimeter.  Typical stuff."}, {"rating": "6", "text": "'2 Guns' is entertaining at the beginning thanks to the plot surprises, the humor and the charisma of Denzel Washington and Mark Wahlberg. Unfortunately the second half is not as creative as the first and the action is mediocre (except for the chase in the desert). Furthermore the sequence at the navy base is implausible and adds nothing to the plot, there is a dramatic event which doesn't suit the movie's light atmosphere and the climax is unexciting.\rargonautis.eu"}, {"rating": "4", "text": "Can you give me those 109 minutes and 15 seconds back, please? Definitely below average if you remove the excellent performance of the cast. I liked how it began and the way it ended, restaurant dialogues with a wink n punch, but everything in between was unnecessary. thumbs down."}, {"rating": "7", "text": "Mark Wahlberg & Denzel Washington are undercover agents playing each other, until they both get double-crossed and have to work together. While the plot is typical, there are enough variations to keep it interesting. The chases and fights are competent without being exceptional. What makes a film like this work is the chemistry between the leads and these guys got it! The snappy banter helps a lot (this may be Wahlberg's best comic performance). Don't go expecting more than basic summer action fare and you'll be mindlessly entertained."}, {"rating": "5", "text": "Not perfect but also not bad. Fun shoot em up action with 2 good actors in the lead roles. The plot had quite a few holes but nobody should see a movie like 2 Guns for a perfect story but I enjoyed myself. Good action with good humor. Not a movie to rush and see but definitely check it out when it's on rental. Overall a good time. 5/10"}, {"rating": "7", "text": "The name Mark Wahlberg is synonymous with buddy comedies and buddy action films, its just the kind of film he likes making and 2 Guns is no exception, except for the unexpected and refreshing addition of Denzel Washington. When Bobby (Washington) and Stig (Wahlberg) rob a bank filled with forty million dollars they find themselves hunted by multiple parties keen on getting their hands on the exuberant payday. Making matters worse is the fact Bobby and Stig aren't exactly being honest with each other about who they are. A fast paced, unrelenting joy ride through a simple but entertaining story that uses played out action tropes to tell its tale but manages to keep the proceedings thrilling despite some of the generic pratfalls. Washington and Wahlberg share some great chemistry as they sink their teeth into witty dialogue that Washington proves he is more than willing to take advantage of. The film doesn't take advantage of all its assets as Paula Patton is underutilized as Bobby's ex partner despite an interesting introduction filled with some completely unnecessary nudity to boot. Sure the films key demographic is young males but the film seems to be begging somewhat with the addition of dick jokes aplenty and the prerequisite pair of jubblies. That being said, 2 Guns is damn good fun, a breezy crime caper that while not entirely harmless is light on real consequences. Finally its a film worth watching for the shocking fact that Bill Paxton, an actor written off by most (including myself) gives a stellar performance as Bobby's adversary and CIA spook, a cruel sleazy and all around disgusting wretch of a human being  so wonderfully repulsive he bring the film to life whenever he appears and Paxton nails it. Ultimately its a smooth ride worth a watch not only for a taste of Washington as a comedy actor but also for Bill Paxton (Never thought I'd say that.)"}, {"rating": "5", "text": "Starts quite well but can't really sustain that level for the other three quarters."}, {"rating": "7", "text": "Relies heavily on chemistry between its talents and quintessential gunslinger bravado, 2 Guns excels with classic explosion and slow-mo bullet dispenser moments. Mark Whalberg and Denzel Washington are well cast, they seem comfortable in their roles and exhibit the action oriented partnership patented in the late 80s. However, the story might have some inconsistent rhythm and convenient coincidental occurrences that could hamper the experience, considering it tries to put quite a few twists along the way.\r Story revolves around the two main protagonists, Robert Trench (Denzel Washington) and Michael Stigman (Mark Whalberg), who are undercover DEA and undercover Navy officer, respectively and unbeknownst to one another. Each plans to rob a bank for 3 million dollar and pins the deed to the other. They eventually find much more than they expect in the vault and will be hunted for this abundance of cash by drug lord and other shady organizations.\r There are arguably many angles to cover, especially since the perspective shifts quite a lot.\r The movie does a decent job of stringing these events together, but there are some cases which seems overly rushed. Timeline is used in a back and forth manner, locations could be identified more clearly. These sudden changes may perplex some viewers who aren't accustomed to crime action movies.\r For a movie that focuses mostly on the duo, Denzel Washington and Mark Whalberg deliver. They are fun to watch, give life to compelling characters and legitimately look compatible. It's good to note that Whalberg fits more in rugged debonair with quips as he doesn't revert to his confused face too often. Denzel Washington is as charismatic as ever with somewhat threatening air at appropriate times.\r Bill Paxton as the corrupt agent shows capable eerie remorseless performance as a corrupt agent. Paula Patton gives a certain feminine touch, although a little less quixotic. The stars are aligned and script is suitable to the theme. There are some lines that could sound overly childish, but for most the dialogues are aptly written and properly delivered. Expect some violence every now and then, mostly intimidating grunts and point blank shots, common bread and butter of gunslinger movies.\r The movie has certain heist and conspiracy flair, even though they are sadly not utilized too effectively. It's also nice to see some degree of variation so the movie isn't all mindless bullet-fest. Ultimately, it thrives on old school appeal of underdog vagabonds with lots of ammunition, and in this case, isn't necessarily a bad thing."}, {"rating": "8", "text": "...and the surprise winner of the year goes to 2 Guns! The only reason I decided to watch this film is because I am a huge Denzel Washington fan, however my expectations for it were extremely low. It's rare, but occasionally, a preview can harm the reputation of a film, and that's what happened here. The previews make this film out to be nothing for than a big gun fight with the occasional cheesy line, but it's so much more than that. In a unique twist, two undercover agents, from two separate agencies, wind up going after the same man. Looking for a way into his organization, they find each other and assume the other works for the bad guy. Both Washington and Mark Wahlberg create characters and put on a good show for the other, having no idea that they're actually working towards the same goal. What really makes this film work is the chemistry between Wahlberg and Washington. Denzel is plays his usual level headed, super intense character, while Wahlberg's playing a laid back, reckless guy, who actually does have some pretty funny lines, that they weren't about to show in the previews. Together they go through on an amazing adventure, full of good guys and bad guy crossing and double-crossing each other. There are at least a half dozen factions tied to this evil man, in different ways for different reasons, and each representative is more unique than the other, leading to some amazing interactions. 2 Guns is the story of 2 agents caught in the middle of a huge conspiracy, that seemingly involves every one. While that may be confusing to some, I found it refreshing, because the truth is you never knew what would happen next. When one side struck, it could have been anyone, for any reason. The unique story and large supporting cast, paired with the terrific chemistry between the two stars, made for an absolute classic that fell under most peoples radars. If you're looking for a good movie, that will have you on the edge of your seat, then you should check out 2 Guns! I can't recommend it enough."}, {"rating": "5", "text": "This film had a pretty good chemistry between Denzel Washington and Mark Wahlberg for what little time they were actually together. The story didn't really make sense, it just seemed like a plot where a bunch of people from the Navy, CIA, and Mexican Drug Cartels wanted a share of $43 million but the story was going in a million different directions so it was really hard to keep up. The action was very old school in my opinion but it didn't disappoint in that department. I'd consider renting this when it comes out on Redbox instead of seeing it in theaters"}, {"rating": "7", "text": "The movie was a combo action/comedy and overall did a pretty good job. Washington and Wahlberg were amazing as usual. The action was pretty decent and definitely not too over the top like some action movies. What actually surprised was that the story was pretty dang good and intricate to a degree. It wasn't some absolutely ridiculous plot like you see in \"die hard\" movies but had some semblance in reality (though obviously exaggerated to a point). Overall not a bad show. Go and see if you generally like the main actors."}, {"rating": "8", "text": "The movie is cute and has some original scenes. The action and surprises are constant enough to keep you interested, and the one-liners aren't unbearable."}, {"rating": "3", "text": "2 Guns is mostly bad, but does have some redeemable qualities, namely the chemistry between Mark Wahlberg and Denzel Washington. In both action sequences and comedic moments, Wahlberg and Washington really play off of one another very well and the two of them really try their hardest to rise above the bad qualities of this one. In addition, to their chemistry, I did not mind the script. The plot was terrible, but I thought the script was largely pretty well-written and really served as a good foundation for Wahlberg and Denzel. However, in saying that, the plot was indeed terrible. Outlandish and completely unrealistic, it sucked all the fun out of the movie watching this preposterous plot unfold. Baltasar Kormakur is better than this, as are Wahlberg and Washington. Aside from the enjoyable lead performances, this one is pretty much your run-of-the-mill mindless action flick, so if you enjoy those kinds of things, this one is for you. Sadly, I do not enjoy them, hence this film is pretty terrible to me."}, {"rating": "4", "text": "Movie is let down by script.clearly script was writers has no idea about DEA ,CIA or how drug lords operate.Its like someone who never seen sea write a poem about sea.Acting is all right and action scenes also quite good and reliable.Movie had the potential to be a good movie but witters made the mess of it."}, {"rating": "5", "text": "It was a let down. Mark Wahlber plays the same guy he is on every movie, and it was one of Denzels least appealing characters. The movie just has nothing memorable about it. It`s an ok watch, but nothing new."}, {"rating": "5", "text": "Based on the ultra-violent comic-book miniseries by Steven Grant, \"2 Guns\" director Baltasar Kormákur hits all the right notes stylistically, but comes up short on everything else. Don't anticipate a hard-hitting drama or an edge-of-the-seat thriller because the real focus of the movie is on the ever so slightly humorous relationship between its two main characters: Denzel Washington and Mark Wahlberg. Both interact well enough together, but the film falls flat when they're separated, and sometimes it's for long stretches. However, director Baltasar Kormákur shows a great deal of improvement over the last time he worked with Wahlberg in the disappointing, and uninspiring \"Contraband\" (2012).\r \"2 Guns\" is about a pair of undercover agents, neither of whom is aware of his partner's real identity. Bobby Trench (Denzel Washington) is a DEA agent and Stig (Mark Wahlberg) is Navy Intelligence, but both are playing the role of a legitimate crook. Their mutual goal is to take down the cartel headed by Lord Papi Greco (Edward James Olmos). Their plan to do this, which is never really explained in a way that the audience can truly understand, has something to do with robbing a bank where Papi's money is supposedly stashed in safe deposit boxes.\r After the robbery takes place, however, it comes to light that the stolen money belongs to the CIA and their enforcer Earl (Bill Paxton), and he wants it back. The DEA intends to use it in a trial against Papi because getting a search warrant would be too much of a hassle. Naturally, our heroes end up being targets for what they know, having to finally work together to piece together your standard run-of-the-mill double cross extravaganza.\r The real business of \"2 Guns\" is the camaraderie between the two bickering leads, which comes across a lot like flirting. They finish each other's sentences, order each other's breakfast, chat about \"Les Misérables,\" and even have a scene where they stroll into the sunset arm in arm. There are chases, shootouts, and explosions, but there is nothing here you haven't seen before. With the exception of the final shootout sequence, the cinematography rarely impresses. There is limited amount of fun had in watching how Bobby and Stig survive a variety of seemingly inescapable situations, but sadly the predictable plot keeps getting in the way of all the action.\r The elements gel well enough to make \"2 Guns\" an enjoyable summer cinematic experience. However, it is never any doubt how things will play out, and it's nothing likely to resonate after the dust has settled."}, {"rating": "5", "text": "2 Guns is really only okay, just like Contraband. Unlike Contraband, it's really not that interesting. It has good action sequences that would be made even better if tied cohesively together into the plot. It wasn't terrible, Mark Wahlberg and Denzel have great chemistry, but the director can't seem to decide if he wants a gritty thriller, or an action comedy, and the result is a jumbled movie with hard-to-follow plotting. Again, it's not terrible, it just wasn't very entertaining."}, {"rating": "6", "text": "An overal movie. It has surprises but it also has clichés. Denzel Washington and Mark Wahlberg are a good team, not perfect or bad. I give it a 6 stars, like it's supposed to be."}, {"rating": "8", "text": "This Movie is awesome! Great action movie, if you like Washington and Wahlbergs tough guys sense of humor this is a movie for you. Great action scenes, decently humorous, not outrageously graphic but it doesn't pull punches. Plot is decent and Mark and Denzel mesh together really well and have a believable relationship. After this movie I felt pumped it was a good ride. *Edwards James Olmos is a bonus as well always enjoy his roles in movies."}, {"rating": "5", "text": "This film only works because of the chemistry between Washington and Wahlberg.  The script and the overall plot just fall short.  In the long run this just adds up to a mediocre film. C+"}, {"rating": "8", "text": "This is surprisingly a great low lighted action comedy that works in many more ways than \"Contraband\". It's a fun popcorn flick, plus it's fun to watch Denzel Washington and Mark Wahlberg on screen together. Overall, a fun movie to watch on a Saturday night. Be sure to check out YouTube channel  \"TheMovieManLife\" for all things movies."}, {"rating": "7", "text": "In a summer of unusual blandness for major movie releases, one has to get their pleasure from whatever's available, and while \"2 Guns\" isn't exactly Oscar material, it's a good fun style shoot 'em up impossible odds story of a supposedly unlikely pair of undercover agents (Washington and Wahlberg as DEA and Naval Intelligence, specifically) who get abandoned and then, you guessed it, marked for death, in addition to a sadistic CIA man whose millions they just stole, played by Bill Paxton, who does a bit better than his usual wooden appearances, and a drug lord with a veritable army of goons also after the stars' asses.    Yawn.\rBut wait a second.    This movie for once is a borderline comedy and the banter is actually quite humorous at times, taking some of the edge of ridiculousness away.    It's as though the movie writers are making a bit of fun at their own script.    It's because of the sense of awareness you get that yes, the director is totally aware of the cliches, and deals with them a bit differently, because \"2 Guns\" is not a bad movie.    Again, it's not exactly going to replace \"The Godfather\", but given the other movies out this summer, it's not a bad way to spend a little time."}, {"rating": "10", "text": "This movie is absolutely ridiculous, but it's also very very funny. There is one scene during a gunfight where a dead deer randomly appears on the hood of a car-- the whole movie is like this. I'm not sure what most of the people problems are, unless they were expecting a serious bank robbery movie or something. This is definitely one that I will watch it again and laugh at. Denzel Washington and Matt Damon excellent job. I would like to see some of the critics do a better job with the script.\r nobody is going to be cruel to animals just because they saw Mark Wahlberg do it in a movie. It is humor people."}, {"rating": "5", "text": "You know how it's goin to end right off the bat. it was not all it could have been but it was fun few laughs there could have been more but i guess they ran out of time filming."}, {"rating": "7", "text": "Denzel Washington and Mark Wahlberg played well with each other. When ever I think of a movie staring Denzel Washington I look for Training Day, and for me Wahlberg will never out grow the Funky Bunch  but some how this movie finds a great middle ground that we all be ok with."}, {"rating": "3", "text": "Marketed as something quite a bit more serious than it is.  Devolves quickly into a routine, buddy, summer movie with ridiculous plot turns and hidden plot points.  Some of the chemistry between Wahlberg and Washington is surprisingly entertaining and, occasionally feels real, but not nearly enough to save it despite the plethora of explosions.  \"Two Guns\" makes the best case yet for legislative gun control and maybe even outright repeal of the 2nd Amendment if those actions would apply to the banning of this movie from my memory banks."}, {"rating": "8", "text": "Picture a comedic Alonzo from Training Day and a likable Mark Walhberg and you've got \"2 Guns.\"  if you like these actors, then you will like this movie.  if you had an SNL skit with guys playing these two actors, then this is what you would get.  These guys have great chemistry!\r of course the premise is silly and the events unrealistic, but that's not why you go to see this movie.  You get to see two alpha males do badass stuff and make you laugh while they're doing it.  Paula Patton is\r ravishing and it's great to see Bill Paxton, whom I haven't seen in awhile.  he's good, too.  very entertaining.  I'd say, I was into the film better than 90% of the time.  got my money's worth!"}, {"rating": "5", "text": "Was I the only one who felt like the movie was funded by a liberal lobbying group? I'm not trying to post my own political opinion here, but it felt like there were multiple plot points where issues paralleled hot political topics right now. These were then resolved with a liberal standpoint. For example: The ridiculous plot structure of having both a very corrupt and money lusting Navy/ CIA (On top of the cartel). Each of these organizations betrayed their single agents because they stood to reveal their bad nature. In turn, the \"2 guns\" went rogue and committed acts that would be deemed 'terrorist.' Of course, the audience is supposed to root for them, so everything they do is ok. This was just one of the political topics hit out of many I saw, including the debate on welfare (The ridiculously long and unneeded scene where they argue over tipping), and the morality of betrayal in relationships (Denzel and the Latino chick.) I saw others, but they don't come to mind. Maybe I'm just flipping out over a whole lot of nothing, but I still don't see the point in having a plot that tries to carry so many different things in it. It was ridiculously varying and had no need for such complex and unbelievable structure. Aside from what I viewed as a political agenda (probably for an increasingly democratic audience), I would give the movie a 6/10."}, {"rating": "6", "text": "Before I entered the theatre, I had a pretty good idea of what I was about to see. A prototypical shoot-em-up with a couple of high-profile leads that would have to really steal the show to make this one worth a second watch. Although Denzel & Mark delivered above average performances, I don't think this is them at their best. There were some funny moments, some cliches here and there, and a lot of violence. The plot twists can be easily sniffed out early on if you've seen your fair share of action movies, and the over-the-top ending provides for some laughs. If you're lookin for a pretty good action flick to take your girlfriend/boyfriend to, and you're not expecting to see an award-winning show, 2 Guns is worth a watch. However, when it hits the shelves in a few months, I'll be passing on seeing it twice."}, {"rating": "5", "text": "Cuando fui a ver esta película fui sin expectativas, lo cual me ayudó mucho a pasar un mejor tiempo.  2 Guns no es un filme que recordaremos de aquí a un año, pero tampoco es uno que odiaremos al instante.  Pues su historia no es tan compleja, como tampoco es ridícula y esto la convierte en algo fácil de ver.  En cuanto a las actuaciones me parecen que los actores principales disfrutaron su tiempo, porque hicieron un buen trabajo pero definitivamente no estaban buscando un Oscar con ello.  Las escenas de acción no fueron acelerante, y su ritmo se encargaba de que no nos sintiéramos de esta forma.  Buen negocio sin riesgos tomados."}, {"rating": "7", "text": "Great action flick. Denzel doing his usual swagger thing that kinda gets annoying ya know? Mark doing his usual thing of fists and guns. and James olsmos doing his usual thing of being a bad ass."}, {"rating": "5", "text": "There's not much to say about 2 Guns. With such a poor script, Denzel Washington and Mark Wahlberg can't really be blamed for giving mostly charmless performances. The main plot \"twist\" comes out of left field and is absurdly random to the point of just being stupid, which pretty much sums up this movie. It's filled with guns and death but that's about it."}], "recommendations": ["shooter", "angel_has_fallen", "the_mechanic", "the_last_stand", "contraband", "16_blocks", "the_italian_job", "the_equalizer", "safe_house", "gangster_squad", "the_november_man", "sabotage", "the_commuter", "demolition_man", "spenser_confidential", "escape_plan", "wrath_of_man", "21_bridges", "honest_thief", "free_fire", "the_taking_of_pelham_1_2_3", "jack_ryan_shadow_recruit", "3_days_to_kill", "red_notice", "mile_22"]}