{
  "id": 2081,
  "title": "300",
  "starring": [
    "Gerard Butler",
    "Lena Headey"
  ],
  "runtime": 117,
  "genre": [
    "Action",
    "Adventure",
    "War"
  ],
  "description": "Based on Frank Miller's graphic novel, \"300\" is very loosely based the 480 B.C. Battle of Thermopylae, where the King of Sparta led his army against the advancing Persians; the battle is said to have inspired all of Greece to band together against the Persians, and helped usher in the world's first democracy.",
  "releaseYear": "2007",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/9W49fy5G7v9Ed3CXtvMi41YqZtt.jpg",
  "categories": {
    "plot": 7.588235294117647,
    "acting": 7.7368421052631575,
    "ending": 5.666666666666667,
    "soundtrack": 10.0,
    "cinematography": 7.666666666666667,
    "familyFriendly": 3.0,
    "funny": 6.25,
    "action": 7.478260869565218
  },
  "reviews": [
    {
      "rating": "10",
      "text": "Great Movie, from first minute to the last, lacks in historical detail, but everything else is very good!"
    },
    {
      "rating": "10",
      "text": "Watching this movie was wonderful experience - special effects, soundtrack and story, all great. I especially liked slow motion battle scenes. I don't care if it is historically accurate or not (and it really isn't). When I watched it, I wanted to see it again, right there. Masterpiece of movie art."
    },
    {
      "rating": "10",
      "text": "Being Greek all I wanted to see was a movie that is what it should be , nothing , nothing else. The Director manage to capture the Spartan philosophy. This is a Spartan movie. Straight to the point . It capture the heart of this historic battle , something that historic documentaries have failed to do . It does not try to put drama into the scenario, it does try to make Spartan look human. It is not try to outsmart the viewer.It is only show what Spartans were. If you are after seeing a really \"great\" movie, then open your eyes, and open a book. Read what Sparta was all about. And then go to see the movie , then you will understand why . Simply perfect. The end."
    },
    {
      "rating": "5",
      "text": "The critics got it right on this one. The story-telling, and, more specifically, acting and script is laughable in this one. Though the super saturated look is interesting, the repetitive environments and cinematography grows monotonous awefully fast. Call it campy, but the lack of humor, and expectance on the viewer to care about the characters puts this movie in the mediocre area. That said watching this movie is fun, if only for the gratuitous violence and even the corn helps make it a funny video to watch with friends. But, its insistance on taking itself seriously is its downfall, and keeps it from being a \"so bad its good\" movie. See it for brainless entertainment, but don't expect more."
    },
    {
      "rating": "10",
      "text": "This movie is great. Its action sences are pimpin', but some other parts are a little boring. But still the awsome fighting makes up for it."
    },
    {
      "rating": "10",
      "text": "Action throughout 85 percent of the movie..loved it..."
    },
    {
      "rating": "10",
      "text": "300 was an awesome movie, with very few problems. It looks beautiful, and is modeled after the graphic novel in the way the scenes are played out and how everything looks. A very clever thing they did was have the training of a Spartan boy in the beginning of the movie, which actually was quite close to what actually happened back then. To tell the truth, the storyline was good, but could have used a little more work. I thought Gerard Butler was a great choice for Leonidas, though Lena Headey was a bit flat. 300 is a great movie for those who can stand LOTS of blood and guts, and the occasional bare women's chest with nothing censoring it, with a sex scene and a rape scene. You don't see much, nor are they long scenes. And the slow mo scenes were awesome."
    },
    {
      "rating": "10",
      "text": "300 is the absolute best movie ever made. I love it more than words can explain and ofcourse, Gerard Butler made it all the more captivating. His acting was superb along with his fighting. 300 cannot be topped. It is effortlessly Sheer Perfection in all aspects since it encompassed so much different themes: Love, Brutality, Revenge, and even humour along with all the rest. It is a movie that is beyond all others and could not and will not be able to be done any better. It should be more accurately rated as exponential to infinity!"
    },
    {
      "rating": "10",
      "text": "The MetaCritic review system is way wrong. For some movies they show only the good reviews and for some movies they show all the bad ones. \"300\" is the case for the bad ones. They didn't include E!Online or Chicago Sun Times which gave it an A and A- meaning in the 90's. Seattle Post gave it a B+. An 83 isn't a B+. For more comparisons go to:\rhttp://movies.yahoo.com/movie/1809262865/critic\r For the movie history wise, it is very inaccurate. The Persians was the only empire who called their kings, kings of kings, not gods as referred to in this movie. The Persians were also the first to start freedom of speech, religion, and freedom itself.\r THE MOVIE: The movie is very good. The cinematography was amazing. Every scene, every shot was taken with skill. The sound and visuals add even more to the experience. Very well done. The acting was exceptionally done by Gerard Butler and the Spartans, but some other characters were a bit off. The sex and nude scenes though did seem a bit too forced. Also, Xerxes did look a little gay. Xerxes in the movie is portrayed by a Brazilian actor which doesn't make any sense at all. Beside Xerxes had a beard. Overall the movie is very good and I recommend anybody who still hasn't seen it to go and watch it while it's still in theaters."
    },
    {
      "rating": "10",
      "text": "If you don't like this movie, then  you are a fag. Just becauuse it's not historically acurate doesn't mean that it sucks, it means that you suck. It has the word \"fiction\" in the discription, so if you give this a 0 because of history, than you are a stupid fag....p.s. this movie rocks!!!!"
    },
    {
      "rating": "9",
      "text": "This movie was awesome there was nothing gay about it and you do realize that one of the guys who said it was bad was named Fabio I mean seriously you cant listen to him."
    },
    {
      "rating": "9",
      "text": "Ahahaha heh heh he *sigh* I'm sorry but i just read a review that said this movie was \"historically inaccurate\". Where did this say that it was a historical picture. This had good acting (maybe not good writing but still), good special effect and an all around entertaining experience. People please turn you brains off for a few minutes and just enjoy the ride."
    },
    {
      "rating": "10",
      "text": "Amazing picture and top of the line fighting scenes."
    },
    {
      "rating": "8",
      "text": "300 is an action movie that takes heroic action back to the Medieval times. Its about the legendary 300 Spartans who stood against the might Persian army. A lot of people complain that this movie is very inaccurate historically. That is partly true however there were some parts in which the movie was historically accurate. The Spartans really did throw out there kids and they really did give them brutal training they really did grow up in a world of violence. However the the movie was inaccurate in some of the battle scenes. There weren't really trolls the Spartan soldiers did were armor on their torsos and the famous line ''we will fight in the shade'' was not said by after a Spartan sliced off a Persian army however the arrows did block out the sun they got that part right. No doubt about it this movie is hard core except for the end were the king went soft. The battle scenes were very satisfying to watch.The story is enough to keep you interested in what will happen next.however if its the historically inaccurate content that deflects your interest away from the movie than watch a documentary or something. This movie was not intended to be historically accurate.There is some content that they just didn't need to put in there but if you want some graphically realistic movie than you've come to the right place. Over all this movie is worth watching if you a fan of action movies. the acting was good and its a good movie overall."
    },
    {
      "rating": "9",
      "text": "Completely overrated film. All the haters don't understand the point of the film, which is sacrifice for good. I don't see any reason to call it homoerotic or racist. There's nothing gay about it, and it isn't saying that the Persians where cowards. This is from the Spartans perspective, and that is what the filmmakers where trying to portray. No, it isn't perfect, but in the end it is a fun, moving film."
    },
    {
      "rating": "9",
      "text": "Beautiful, unique, ground-breaking, courageous, stirring, one-of-a-kind. I believe that there should be a law that prohibits any critics' reviews until the film has been out a week. \"300\" made nearly half a BILLION DOLLARS, world wide, and won several awards, and that was before it came out in DVD."
    },
    {
      "rating": "10",
      "text": "Great action, some things are exaggerated (ie: the deformed guy), but other than that, I thought it was very entertaining and catches my attention at all times."
    },
    {
      "rating": "7",
      "text": "300 is an action classic and an iconic film by director Zack Snyder. The Spartan references and culture as it is portrayed in this movie have become ingrained in the pop culture history of America, and the film is a lot of fun too! Definitely worth a watch if you have not seen it."
    },
    {
      "rating": "10",
      "text": "300 is a masterpiece. The first thing I have to note is 300 is based on Frank Miller's 300 graphic novel that is simpler to the real life event but with elements inserted in. This movie has a great story about 300 Spartans who have to fight an army of 1 million warriors from all over the world."
    },
    {
      "rating": "0",
      "text": "Terrible, historically inaccurate, it's not even true to the comic book, too much slowmo, and I could predict every bit of the dialogue minutes before they would say it. Not to mention people saying the corniest one liners and that's it, just one line and then nothing for minutes on end. Seems to be more of a propaganda piece to just dehumanize Persians (think Iranians) and make them look like savages. Neither side was innocent, and they're both godless and brutal societies. (The last line about ushering in a new age of \"free thought\" and an end to mysticism is a real kicker, since the Greeks believed in their own made up religion.) Not to mention, they ruined an intriguing historical tale that could of gone places. Soulless, airless, they seriously must just take a giant crap and throw $20 million at it and call it a movie."
    },
    {
      "rating": "8",
      "text": "Enjoyed this flick.  Thought the visuals were great.  Not sure why folks didn't like the acting.  Sure I doubt that the Spartans went to battle naked as they were, but then I also doubt that wolves had glowing eyes back.  It's called 'imagination'.  Use some.\r All in all good movie."
    },
    {
      "rating": "10",
      "text": "I cannot find any fault with this movie..everything is perfect..The music score..The CGI...The actors..The story line...all excellent..Its going to go down as a classic and unfortunately for Gerald Butler..the high point of his acting career.A bone of contention with critics seems to historical accuracy . Why? It follows a graphic novel..The essence of the event is there...not strict adherence to the historical battle..A 9 foot Xerxes is much more exciting than a normal sized one anyway..."
    },
    {
      "rating": "0",
      "text": "If you like long winded speeches, people screaming about \"SPARTA!\", homoerotic undertones, giant lobster men or over-coreographed super slow motion fight scenes you'll love this movie."
    },
    {
      "rating": "5",
      "text": "Without the visuals, 300 would be nothing. The so called values it defends are just made up cliches to go to war. Moreover, some of the values shown here are very negative and is a huge downgrade to the movie, such as racism. I was emotionless during most of the scenes, I just admired the great visuals. All in all, I still think it's worth watching even if it's not a good movie, just for the visuals."
    },
    {
      "rating": "10",
      "text": "Based upon i have seen so far, this movies is nothing short of spectacular action and dramatic scenes that can show us that ancient battles can be more exciting trough the eyes and mind of a great director. Really a must see for everyone that loves a great epic movie."
    },
    {
      "rating": "5",
      "text": "300 is a movie I saw, I appreciated the look of the movie, and a few scenes were pretty memorable, but after I finished it I really had no urge to see it again. Even for just silly escapist entertainment for me there needs to be more depth than there is here. It's just a bunch of macho warriors screaming about war, preparing for war, and making war, and never did I really care about the outcome, never was I the least emotionally involved. Frankly for certain stretches of the movie I was bored."
    },
    {
      "rating": "7",
      "text": "\"300\" is just a massive cliche movie that has so many gaps as well as racism (Persian Asians are show to be fragile while white Spartans are depicted to be strong and muscular). Then why I enjoyed it? No particular reason, but I'm just impressed that Zack Snyder skillfully maneuvered the **** up movie till the end."
    },
    {
      "rating": "0",
      "text": "No plot, no meaning, nothing worth to talk about."
    },
    {
      "rating": "10",
      "text": "I loved this movie. It is more than just blood and gore. I mean if some would be to get hit by a sword there will be blood.... lots of blood. A thought it was a very interesting story. Except that humpback thing was really scary."
    },
    {
      "rating": "2",
      "text": "Some of the scenes are impressive which saves this film from a score of \"0\". Other than that the acting is hilariously bad, the plot is terrible, the characters are all one-dimensional, and the message the film attempts to convey is laughable."
    },
    {
      "rating": "4",
      "text": "300 is great to look at, but incredibly stupid. Let's not kid ourselves. If you want to watch this testosterone filled, sleazy movie for a whopping 177 minutes (half of it is in Zack Snyder's trademark slow motion bull **** be my guest. I saw it once in IMAX and that was more than enough. I felt uncomfortable for all the women in the audience."
    },
    {
      "rating": "2",
      "text": "I saw the movie last night , i think it was very slow movie and it had a lot of historical problems,because i studey history i would like to mention some:\r1-persian kings apprearance is very different then what it is in history,in history all the persian kings had a long bear and wearing special clothes but in this movie persian king is NUDE!!without bear and like homosexuals!!hanging rings from his body its completly and exactly wrong!you can search in internet and see(its persia not maya)\r2-in the movie the armies of persia is consisting of many models but none of them was persian model for soldiers!!there was sth like samurais in japan!and arab soldiers and creatures and.... but none of them were persian soldiers that is in historises imagination!\r3-in museums we have the coins of xeres go and see the diffrence in movie for coins!!(i think the director has confused between persians and maya nation!!!)\r and it was interesting that soldiers of sparta were fighting with luagh is it funny fighting a big army with just 300 soldiers?\rI think people from persia will protest this film just because of it gives very wrong imagination of persia"
    },
    {
      "rating": "1",
      "text": "This has to be the first movie since Hitlers propaganda movies in the 40's to depict an entire civilisation (Persian) as subhuman. Way to go guys... so the \"ragheads\" are demons and goblins now.  Was the shock and awe not effective enough? \rYou know what this movie needed! \r Terror Alert:High"
    },
    {
      "rating": "0",
      "text": "Uh Man!\rI had this really awesome date lined up... and we went to see 300. But then she didnt want me to come inside for coffee, because Im persian... and according to 300 I suck. I'm evil, and souless.... and I probably have a deformed peepee......\r ... I call it Xerxes!"
    },
    {
      "rating": "4",
      "text": "Unless you're thirteen, a bloodthirsty warrior, Quentin Tarantino, or have some sort of delusional idea that Persians are 9-foot-tall transvestites, 300 is boring movie."
    },
    {
      "rating": "1",
      "text": "Incredibly overrated non-movie. NOTHING in the movie is realistic and the whole movie is basically one over-drawn battle with ridiculous special affects and awful storyline. Would recommend avoiding, however it does have a large fan base and so surprisingly you may enjoy it. I thought it was awful."
    },
    {
      "rating": "8",
      "text": "Unabashed entertainment, beautifully rendered and digitally touched up, excellently scoped and choreographed, 300 is at its best when it is throwing bodies around. Much of the side drama feelings like a side drama, leaving the target audience craving even more of its ultraviolent ancient warfare. It is a bloody and lewd picture, absolutely not for the kids, but for people desensitized enough to accept a movie where most of the warriors aren't treated as people, and by the body count alone, life has very little meaning until it is gone, if then. It is funny that its few bare breasts and short erotic sequences receive more protest than the various dismemberments, but be prepared for both, and be prepared to enjoy them, or don't see 300 at all. This is not a profound movie, often stopping short where it might examine greater morality or elevate the plot. Instead, its best dramatic feature is how it makes you believe things will happen when you walked into the movie theatre knowing they couldn't. If you rate this as a high drama, you miss its point - it is a superb action movie and needs to be judged and enjoyed as such. With all its references to Greek and specifically Spartan patriotism, its bold moral values unshared by mainstream America, and a plot driven by Persian aggression on European soil, this movie is absolutely not an allegory for America's conflicts with the Middle East, and only the dimwitted could see this as supporting an American war with Iran. However if that does happen, many marines may use this to psych themselves up."
    },
    {
      "rating": "5",
      "text": "please! if someone is making a movie , it has to be representing the whole true face of that nation. we are not here to restate the histrory as 300 is trying to do. characters are not and not representing anything but a false idea about the persians and their nations, if u read the history you will see what i am saying, a movie has to be based on reality not a personal view of what u think or what u want other ppl to think."
    },
    {
      "rating": "7",
      "text": "A relatively good movie. It's good for the fights and such but the love between the main dude and his queen is kind fake. The emotions other than bloodlust or other similar feelings are all kind of fake. The slow downed fighting is alright. You should give it a try or a rent. Completely fantasy history, just in case you were looking for a good representation of the Battle of Thermopylae."
    },
    {
      "rating": "8",
      "text": "300 is a cinematic piece of artistry, focusing more on cinematography than story. Surprisingly, it works very well. The basic story line serves as the spine of the film; merely there to support the glorified action. It's this visceral beauty that makes it watchable, more so than a film that focuses on the fundamental story. 300 applies to males; those of you who don't appreciate slaughter and gore will not find it appealing. It's a movie that you have to watch without criticising, because you will surely find a fallacy within its simplicity and emphasis on visuals."
    },
    {
      "rating": "10",
      "text": "Some movies are meant to be over-the-top. 300 is a testosterone-dripping masterpiece laden with male-oriented dialogue, action, heroes, villians, action, and gore delivered with stunning scenic backdrops and a rocking score, making this an instant \"guy movie\" classic."
    },
    {
      "rating": "10",
      "text": "Loved every minute of it! Visually stunning! Keep in mind, it is based off of a comic based on real life events, so there are comic-like elements, such as the giants & mutants that come into the picture every now again. If you want a bloody good time, this is the flick for you!!!!!"
    },
    {
      "rating": "8",
      "text": "i feel sorry for these people that when tto see this as a documentry of the 300 spartans, i went to see this as a action flick, this film looks fantastic and im the type of person who found pans labrynth a great film, but im also someone who can enjoy a mindless romp, \r\rIf you enjoyed such films as SinCity, Final Fantasy, Sky Captain, dusk til dawn then you will enjoy 300. \rI enjoyed this movie all the way through and ill get it when it arrives on DVD."
    },
    {
      "rating": "9",
      "text": "Excellent homo-eroticism."
    },
    {
      "rating": "7",
      "text": "I'm Greek and I found this movie quite interesting... *SPOILERS FOLLOW*\rI have read the comments and reviews submitted from the other users and I have to say that most people are quite ignorant either in regards to the movie or to the history of Thermopylae. This movie was not made to offer a historical account of how things happened and as such one can find a lot of inconsistencies. I read a comment about the Spartans being savages and worthless (LOL!) now how can they be worthless and victorious at the same time (although they were all killed this was a HUGE strategic victory) I do not know. I have to say though that there is a tendency in this movie to portray the Persian army as decadent and weak but I think this serves as a method to contrast the two civilizations and their strengths and weaknesses. For example the Spartans were exceptional in hand-to-hand combat while the Persian army relied on archers and cavalry (including chariots).Furthermore, the Spartan soldiers wore heavy armour and carried large round shields in contrast to their opponents who wore expensive jewellery and bright coloured garments -to impress their adversaries with their wealth- and light armour (their shields were made from some kind of bamboo).Both civilizations were equally magnificent (in my book) and the fact that the 'immortals' are portrayed as deformed people is outrageous. Further to that the Persian army had no ogres and goblins (lol) and I do not think they brought any elephants or rhinoceros to fight the Spartans. The side story with the Spartan queen being 'raped' is 100% BS - if there was ONE place in the world at that time where women had power and were respected (sometimes even more than men) that was Sparta...I cannot imagine any woman being raped in Sparta let alone the QUEEN! Since the movie is based on a COMIC BOOK I believe it was wise to use a CG environment and give it a gleam tone so that it will look like a comic. The fight sequences are very impressive and I think this is a very good action movie overall."
    },
    {
      "rating": "9",
      "text": "Love the style, subject matter and acting in this movie. This is totally original filmmaking. Something like I've never seen before. I like how faithful it was to the graphic novel."
    },
    {
      "rating": "10",
      "text": "I cannot believe that the average score 300 has received. Very entertaining and great performances!!Top class!!!"
    },
    {
      "rating": "8",
      "text": "The storyline is simple, but the visual and action is a revolutionary breakthrough. Itâ"
    },
    {
      "rating": "10",
      "text": "This movie is soo bad that is not funny! Since when Persians are black? Did you know where the Caucasus is?  and gay? Don't they remember that the Spartan army is well known because their homosexual practices? I don't see anything negative in homosexuality, but I think is bad when it is used to demonized a group, because then it is given a negative connotation.  Apart from the photography (it was beautiful, because of that I give it 1) the movie was a total failure. The performances were ridiculously bad. Even my 11 years old boy-who is extremely intelligent- noticed that...10 minutes after we turned it off. . What can I say? An embarrasment for the producers! I can't understand how it score. Quite honestly, even if the movie was not meant to be historically accurate (and a few movies are)...it didn't mean to portray almost the opposite either! Sorry, but I will take the risk and will be 'disrespectful\" this movie is crap, and it showed a lack of considerations towards people with Persian roots."
    },
    {
      "rating": "8",
      "text": "This is a Zack Snyder hit. Before \"Man of Steel\" or \"Watchmen\", he made an instant classic. It's a bloody good time and visually dazzling. It is not only well written but extremely quotable. You never seen anything like this. Overall, THIS IS SPARTA!"
    }
  ]
}