{"id": 1283, "title": "300: Rise of an Empire", "starring": ["Sullivan Stapleton", "Eva Green"], "runtime": 102, "genre": ["Action", "Drama", "War"], "description": "Greek general Themistocles attempts to unite all of Greece by leading the charge that will change the course of the war. Themistocles faces the massive invading Persian forces led by mortal-turned-god, Xerxes and Artemesia, the vengeful commander of the Persian navy.", "releaseYear": "2014", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/aOg92xVWjBRmALsHCJsz2lWnmsG.jpg", "categories": {"plot": 5.071428571428571, "acting": 5.633333333333334, "ending": 6.666666666666667, "soundtrack": 10.0, "cinematography": 4.0, "familyFriendly": 3.0, "funny": 7.5, "action": 6.28}, "reviews": [{"rating": "4", "text": "It took them seven years to make a sequel. There isn't much to say about this film. It's disappointing. The storyline isn't really anything interesting because its pretty much the typical revenge **** like in almost every other film thats being released nowadays, the characters are boring, they're the standard characters wanting vengeance, and the CGI is insanely bad. At some points it actually felt like I was looking at video game gameplay...\r As a comparison as this film has large battle sequences, Lord of The Rings budget was $93 Million and the budget for this (ROAE) was $110 Million. A film from 2001 had more believable CGI then a film from 2014, and I'm not even a fan of Lord of The Rings.\r Of course, they're making another sequel for this film when they could had easily just made this film another 30-40 minutes, then it would had been the end of it... Either way, I hope they do a better job next time. Although, what do we expect digging out a sequel to a 7 year old film? It'll probably be another 5 years for the sequel."}, {"rating": "5", "text": "\"300: Rise Of An Empire\" is a carbon copy of its enjoyable predecessor as it drains what made the first movie so great and injects overly-used slow mo sequences, droll before-battle pep talks, and excessive gore to suck out the juice in the brains of the audience."}, {"rating": "5", "text": "This sequel simply cannot stand up to the original.  I'm fine with a little dramatic licence with fight scenes or the historical narrative, but this film drifted far beyond the point of suspended belief."}, {"rating": "0", "text": "An obviously fabricated sequel to Frank Miller's 300 movie, even despite the obvious anti-brown-people message. Eva Green's character is a highly fictionalized third wave feminist; the actual person Artemisia was a Turkish queen who acknowledged that men were physically stronger than women and faced tactics and battle with the earnestness that it required to form a proper (and correct) opinion that the Battle of Salamis was futile - she did not walk around with imaginary lat syndrome fighting trained warriors with her 8-inch arms, making James Bond bad guy faces, she was hardly Greek in the sense that the Athenians were Greek, she wasn't some kind of sex fiend, and she didn't inspire fear in her men, either. The Greek people themselves were hairy and swarthy, not steroided anglo-saxons with shaved and greased up bodies. The story fails to depict that the Persian empire was something more than just a bunch of war mongers and (essentially) Islamic militants despite the battle taking place in the 5th century BC. A farce of a film, with a story that basically amounts to \"let's go kill those guys!\" and featuring misplaced woman power, roided out Scottish extras, extreme anachronism, even greater than Frank Miller would dare, marketed toward 10-25-year-old men who still go out to see things like the Transformers and TMNT movies."}, {"rating": "5", "text": "אם אהבתם את הסרט הראשון מהסיבות הנכונות, אתם לא תאהבו ואפילו תשנאו את הסרט הזה, אבל אם מה שאהבתם בסרט  הראשון זה את האפקטים הדם והקרבות ולא הבנתם את הנקודה בסרט הקודם אתם תאהבו גם את זה ויכול להיות שגם יותר מהקודם. אבל עדיין יש שם כמה דברים טובים כמו זה שהם לפחות לא הרסו את הדמויות הישנות ועדיין מרגישים ב-480 לפנהס"}, {"rating": "7", "text": "Unfortunately, 300 Rise of an Empire does not live up to the original 300.  It can be said that if you liked the first one that you will like the sequel as well, but that's not entirely true.  In my opinion, the first movie succeeded on more levels than just bloody swordplay and spectacular special effects.  At it's heart, Leonidas was fighting for a political ideal that was bigger than himself and he knew it.  He was expendable if it meant protecting the freedom of his family and people for even one more day.\rRise of an Empire fails to connect on that level and is the lesser film for it.  Still, there is a lot to enjoy here with some back story on Xerxes and some follow up with the treacherous hunchback.  And finally Eva Green steals the show in every scene she is in and her performance alone makes the film worth watching.  This 300 ends up being more a companion piece to the original 300, and that is good enough reason to watch.  Just don't expect to be walking out of the theater on a triumphant high like the first one."}, {"rating": "7", "text": "There is a lot of blood in this movie and yes it looks fake as hell but it's better then ninja assassin, the main villain was alright and the main hero of the film was boring to watch I mean the actor was not terrible but the character was boring to watch."}, {"rating": "5", "text": "Classical historians disagree, but it was probably Herodotus who first posed a question that would ring out across the ages, unanswered till now: Wouldn’t Eva Green look awesome kissing the severed head of an insolent captive? “300: Rise of an Empire” puts the issue to rest (the answer: yes, but it’ll never last) and strives to uphold the rah-rah style of visuals and rhetoric established by its popular predecessor, “300.”\r Greece — or its tightly rendered, color-constrained graphic equivalent — is again in danger, but the battles in this contemporary sequel center on the sea. Free city-states are mustering a defense against the Persian invaders and their myriad ships, under ever-darkening prospects (and skies).\r Unlike the death-cult Spartans, led to war in the earlier film by Gerard Butler in a performance that unleashed a thousand meme variations, this motley crew of slightly less chiseled Greeks follows the less inspiring, or, at any rate, less shouty, Themistokles (Sullivan Stapleton of “Gangster Squad” and the TV show “Strike Back”).\r The hacking and impalement of ancient combat still yield gore that defies gravity and invites our delectation in the obligatory money-shot slow-motion. But the bigger mortal threat to manliness lies in the Persians’ vicious naval commander, Artemisia (Ms. Green), impossibly willowy and virtually dripping black, like an Aubrey Beardsley drawing.\r A Greek who suffered horrifically at the hands of warring countrymen, she’s revealed as the éminence grise behind Xerxes (swaggeringly reprised by Rodrigo Santoro), though Ms. Green sometimes suggests cruel hauteur more often than she puts it across. Meanwhile, the Persian emperor’s origin story — his transformation into a bejeweled, manscaped god-king — is revealed, in a process evoking a brisk dip in molten gold.\r The naval collisions and melees play out in panel-like renderings that are bold and satisfying for the first half-hour but lack the momentum and bombastic je ne sais quoi of “300.” Someone was also apparently worried that the film’s depth of field wouldn’t come across, judging from the ubiquitous particles suspended in the air, as if some unseen Greek had just dusted. (The director, Noam Murro, who has primarily specialized in commercials, took over from Zack Snyder this time. Mr. Snyder wrote the screenplay with Kurt Johnstad from Frank Miller’s graphic novel “Xerxes.”)\r Strategically speaking, the Greeks’ underdog maneuvers work, until they don’t, while the Persians are unstoppable, until they aren’t. Themistokles supplies a politician’s skeptical perspective on the Spartans, while a brave father-son duo serve to personalize the notion of self-sacrifice with regular check-ins.\r It might also be added that the film arrives at a somewhat different, less freshly besieged era than “300,” released in 2007. But the political climate might matter less than the over-the-top example of faux period excess provided by several seasons of “Game of Thrones.”\r That show’s bedroom maneuvers might have influenced a pivotal scene in which the long, rivalrous gazes across the sea between Themistokles and Artemisia lead to their finally getting a room. In the telling aftermath, the ruthless Persian commander is more or less recast as a woman scorned, ultimately leaving Greece, and everyone’s machismo, mostly intact."}, {"rating": "1", "text": "Such a horribly written script!  movie cliches one after another mixed with overly done slow mode fight scenes. The color saturation was so badly done that it made the actors look horrible!  The diversion from historical events were also annoying, not that I planned to see an accurate re-telling,  it was laughable how sad."}, {"rating": "0", "text": "This review contains spoilers, click expand to view.  You know that movie you like? And then that sequel that comes out and ruins it? Well, this is that movie! I never loved 300, but it's super macho killing was moderately interesting when watched either drunk or stoned, but rise of an empire basically comes along and takes a huge dump on it. *Spoilers ahead *\r Okay... Get this... According to this movie, you know that Xerxes god character? Well he has this sister right... And she's totally the brains of the operation and 100% manipulated everything that happened in movie 1 because... She's... Ugh... Female I guess... And it's only %10,000 unrealistic for a bunch of arab men to follow a woman into battle in ancient times, but WHATEVER, it's a movie... But... This whole flick is about her failed attempts to look arousing while smirking from ear to ear and it culminates in her telling off Xerxes really big to \"Go sit on your golden throne and enjoy the safety my army provides you.\" If the makers of this film had any sort of respect for the 1st movie, they wouldn't reduce Xerxes to such a pathetic character, I mean, he already basically lost in movie 1, and now we're supposed to believe he can't even run his own army? What's left? Will the 3rd 300 movie feature a distant cousin who totally manipulated Xerxes, his sister and all of humanity into a war while leisurely eating grapes in a distant land? Makes about as much sense as this crap. I enjoyed the movie for a while but little sis running the show and her 13 foot brother being a weakling got old really fast. After she told him off, I didn't even bother watching the final battle. What for? I did jump ahead a little and saw Leonidas' queen charging the enemy, and instantly felt good about my decision to skip the last 25 minutes... It was bad."}, {"rating": "0", "text": "The only thing I find myself thinking when I see a movie like this and then arrive @ metacritic, is what on Earth these people are thinking who give it a positive score. I wish I could be in their head for just an hour, just to see how truly stupid these people are."}, {"rating": "2", "text": "I had to give up on this one somewhere around the halfway point. Maybe something interesting happens after the one hour mark, but I wasn't willing to stick it out.\r To be fair I found the original more than a little underwhelming, so I'm probably not in the target demographic, but I was hoping that the sequel might provide at least a little entertainment value. Unfortunately it seems to be little more than a group of interchangeable bearded men in good shape dancing around a sprinkler system spraying far too much CGI blood. If you like that sort of thing you'll probably eat it up, but I'm sure there are already more than a few 'adult' websites that cater to that fetish.\r P.S. It's probably time to retire the technique of slllooooowwwiiing the action down before speedingitupastheswordstrikes."}, {"rating": "9", "text": "300 rise of an empire ,is masterfully crafted,brilliantly choreographed,interesting war film.It stays true to the original 300 ,it maintains the unique look and feel of the first movie but makes it even bigger, badder and bolder.and while it's short 1 and a half length keeps it from showing its true self and keeps you wishing for more this is still one of the most badass,visually arresting films i've ever seen.\r As a big fan of the first movie,i was really excited to see this movie,especially after hearing this is a prequel-sequel companion of the first one,the events take place before ,during and after the 300,which itself is a unique spin ,that you don't see that often.The performances given by Sullivan Stapleton and Eva Green are terrific especially Eva Green's Artemisia ,she is a scary,crazy,seductive and not-apologetic,you don't want to mess with this bad girl.As for Sullivan's Themistocles he's great and inspirational speeches ,they may not be on par with Gerrard Butler's Leonidas,but he definetely fights a lot better than him.\r The story itself is quite good and intriguining ,sure it's no masterpiece but hey its based off a graphic novel done by Frank Miller,so you can forgive it.The backstory of characters is thankfully given so you can have a lot more reasons to care for them and even Artemisia has a surprisingly heartbreaking past that gets you to understand her nature and why she truly wants revenge on Greece.\r But it's the stylistic action and gore that gets people to watch 300,and from that standpoint the movie is glorious amounts of kick-ass fun.The director Noam Murro maintains Zack Snyder's perfect feel of all-out war ,he adds more slo-mo shots that perfectly captures the fighting skill of Themistocles,within the first 5 minutes you already get a fight scene ,the movie gets this well prepared rythm of telling the story and embracing the action.The blood effects might not be for everyone to like but i certainly got used to it and started to enjoy the hell out of it.The sea battles also dynamically change up to combat and make it a damn fun movie and not repetitious.There is an end fight which is both a dissapointment and satisfaction.it's satisfying because it feels extremely epic with Themistocles riding a horse jumping from ship-to-ship tearing Persians limb from limb and ending the fight with Artemisia,now the problem of it is that it ends very abruptly and makes you wish just a tad bit more but maybe in a sequel.\r And it definetely will have a sequel with box office surpassing the budget and the box office of the first movie,this epic series is going to go on for a long time.300 rise of an empire is a MUST SEE for the fans of the original and fans of action movies,it's a wild ride from start to finish that does not slow down during talks ,but ends with an open note.\r P.S. if you get a chance to see it in 3D absolutely see it like that,it's a real visual treat."}, {"rating": "3", "text": "Saw this movie last night in 2-D. My first issue was that the blood effect look cheesy but perhaps in 3-D may have looked better. Eva Green was awesome but the leading man sucked.  Wasn't buying the story because they had these regular soldiers able to take on the immortals like they were nothing. Absolutely loved the first 300 but this 300 I walked away disappointed and bored."}, {"rating": "0", "text": "This film is aimed at making Americans (analogous to the Greeks, westerners) feel good about themselves. It takes what was a wonderful history (read Herodotus Books 6-9), and uses it to create a cartoon - a caricature of what the producers think will be a more appealing story, but is yet inferior to the real one. I would much rather have seen thousands of Spartan warriors (among the rest of the Greeks) fighting at Plataea than seen Spartans coming to save the day at Salamis IN BOATS! That's insane. Both the Greek naval victory at Salamis (led by the Athenians), and the Greek land victory at Plataea (led by the Spartans) individually make better stories. I feel sick just writing about it. It's an indictment the creators of this film are making of the audience - that we are idiots, and they are correct in that assessment."}, {"rating": "1", "text": "This is an example of a film that should never make it past the drawing board. Its vapid and pointless story drags on from one CGI scene to the other, until it finally ends. Thank goodness, now I can go home and play some video games because the movies today aren't doing it for me anymore."}, {"rating": "3", "text": "I waited the whole movie for a movie to start.  It never did.  The story is nonexistent, unclear, and inconsequential.  The whole thing piggybacks on your remembrance of the first movie.  It's not bad, just sort of empty.  Plays it safe"}, {"rating": "4", "text": "Tries much too hard to reproduce the successes of the original, but falls short in nearly every way. There were a few cool action moments as they fight on the sea, but the plot is totally uninteresting and the characters are too cliche to like. I might have been able to enjoy it as a short action/semi-hero movie with style, but it took itself much too seriously to enjoy it. It seems to drag on and on, trying to produce depth that it just didn't have. It took too long to tell a story, and the story was too cliche and uninteresting to be the focal point. Pass."}, {"rating": "4", "text": "The only reason I'm not giving this a 0 or a 1 is because of the sexy jew actress, the movie is horrible otherwise and not worth watching, she makes the movie barely watchable, otherwise it would have been an even larger fail."}, {"rating": "0", "text": "Totally Forgettable. Too much cliche scenes and very weak story makes this sequel one of the worst I have ever seen.  Amazing how the trailer could be so deceiving. Don't waste your money!"}, {"rating": "5", "text": "This visual and stylistic exercise in blood letting turns out to be not quite as good as the original 300. Some concise narration at the beginning sets the scene, but the story matters little. Basically this is the formula as before, the main difference being that most of the battles here take place on the sea rather than on land. Production Design vies with CGI for attention and continues to blur the line between these two crafts. Likewise, the somewhat bombastic score competes with Dolby sound. The one thing of which the film cannot be accused is to not have used all the technologies at its disposal. Viewed in an IMAX format and in 3D (D Box was also an additional option) the film is certainly a feast for the eye and ear. The speed ramping gimmick is again employed to enhance the dubious enjoyment of torn flesh, severed limbs and lashings of blood flying off the screen. One thing is for sure, subtlety was obviously not discovered in THIS century.\r Acting wise, Eva Green steals the film and she has an erotically charged scene of sexual power play with leading man Sullivan Stapleton (Strike Back) which is also as camp as Christmas. The combination is somewhat disconcerting, not to mention rather funny.\rFor all its faults, though, there can be no denying that this is a visually stunning achievement. A short underwater dream sequence also impresses as, in fact, do all the under water shots. However, like its predecessor, an inevitable repetitiveness allows one to become anaesthetised to events which by turn become ever so slightly monotonous."}, {"rating": "0", "text": "Stupid film. Which nation is the good one?? The one who killed a family and raped the little girl or the one who saved the girl??? The cast is awful except Eva Green..."}, {"rating": "4", "text": "This movie was a huge disappointment, because I fell so much in love with the first one. The actors and actresses in the first one were way more  passionate and believably intense. It was boring the fighting seemed unrealistic and sort of video gamish. The blood looked fake. Just wasn't impressed"}, {"rating": "7", "text": "300: Rise of an Empire was a really good movie but it failed to deliver on the epicness of the first film. But I'll first touch on the positives. The visuals are really, REALLY cool. It seemed like the blood spurts weren't done quite as well as the first one but overall the visuals in this movie were fantastic. Whether it was Artemisia igniting the Greek Navy or Themistokles leading the Greek forces, the special effects and visuals were a definitely strength. The acting was also really good. Was it \"Oscar-worthy\"? No but it's a different kind of movie. I thought the actors delivered their roles well, especially Eva Green, who I thought stole the movie. Her beauty is stunning, sure, but she did an incredible job with Artemisia. The plot also developed well and I thought they connected it to the first film really well. Instead of this being a sequel, though, it's essentially occurring at the same time as the first movie, just at a different location. That being said, that is also one of the elements that hurt the movie, in my humble opinion. The movie builds and builds and builds and then right when you think you're about to get the biggest battle of the film, it ends. That is just a part of what I consider the weakest area of the movie... there just isn't enough combat. The first movie was littered with epic fight sequences while this one focused more on the politics. I think they forgot why so many people loved the first one. It was different from the Troys and the Bravehearts and the Gladiators. It was in your face war and had a charm and joy to it. This movie, while good in its own right, lost a lot of that charm and joy and tried to take a more serious cinematic approach, ultimately missing its mark in the process."}, {"rating": "7", "text": "If you loved the original 300, then this movie brings more of the same testosterone-filled action, stylized fight scenes, awesome costumes, over-the-top CGI effects, overdramatic pre-battle speeches, slow motion, unrealistic blood, shirtless men yelling, shirtless men dying, shirtless men killing one another, etc. etc. Doesn't really add much to this formula, except possibly Eva Green, who brings a great performance and makes a relatable villain. Needless to say, if you didn't like the original then this film won't do anything to change your opinion about the franchise, but if you liked the original, then you should definitely check the sequel out as well."}, {"rating": "5", "text": "Dissapointment\rThis new movie of 300 is a big dissaster, the screenplay is HUGE dissaster in many parts it has no sense. One thing it really surprise me, was the part Artemisia had brown eyes and later her eyes were completely blue. The direction in charge of Noam Murro is a regular performance. The effects of  300 and 300 Rise of an Empire  have no  difference between them. This film is only another movie"}, {"rating": "5", "text": "In order for us, the viewers, to understand the appeal and validity of 300: Rise Of An Empire, it is important to remember its roots. If you bear the original in mind, and then ask yourself what progress has been made in the form of storytelling, visual invention, direction, action and scripting between this and that, then you might start to form an answer as to why this is not as great as some have claimed, all on your own.\r Telling partly the same story as the original film, but changing the perspective is a nice idea, if for no other reason than the possibility of maybe witnessing something previously unseen from Leonidus' adventures the last time around. Unfortunately, there is no new appearance from Gerard Butler here, but many of the previous cast do make welcome returns. Lena Headey's Queen Gorgo, to the now ex-King Leonidus, is just as beautiful, bullish, stubborn and independently oligarchical as ever, but probably features even less than the first outing. David Wenham is back again as Dilios, the one that got away, returning to Sparta to tell the tales of valour, courage and sacrifice that the original three hundred achieved in their battle with the god-king Xerxes (Rodrigo Santoro), who is also back, having flesh added to a character that was sorely lacking a backstory the first time around.\r But the real focus of this new adventure (or new version of an old story with added opinion) concentrates on the leader of the Athenian fleet. Yes, ladies and gentlemen please welcome Sullivan Stapleton, as the difficult to pronounce and even trickier to spell Themistocles. And any new hero really needs a new adversary, so as if fighting the entire Persian Army and a King (who is also a God, don't forget), we are introduced to the testicle-shrivelling Artemisia played by Eva Green. Artemisia, the real power behind Xerxes' throne is rampant, driven, single-minded and extremely dangerous. Femme fatales don't come much more 'fatale' than this here **** from hell.\r But for all of the new faces and mostly welcome old ones, what is it we really have here? The same comic-book stylised battles, ad-infinitum, slow-motion death throes, spattered scarlet aplenty, interspersed with rousing speeches and verbal sparring. Like its parent, Rise Of An Empire is beautful to look at and grand and glorious in scale and intent. But strip from it the eye-candy, which is incase we forget, the real appeal of the original, we are left with a passable script and less enthralling acting than before. Eva Green's performance as Artemisia is probably the most interesting, if not the most rounded. Lena Headey's return as Gorgo is the most fulfilling, but she has the fortunate happenstance of not having to carry the entire film on her shoulders. Aussie Stapleton however, is responsible for the rise or fall of his fleet and the film and honestly, you have to question whether he has the same presence as the formidable Butler as Leonidus. There will be no 'THIS IS SPARTA!!' quotes this time around, I'd wager.\r In summary, an average return that thankfully doesn't undewhelm visually, but fails to really add anything but previously missing plot holes in a story we have already seen before. With some interesting, if not altogether satisfying characters, Rise Of An Empire is a sickly thrill a minute, but like a decent sweet and sour chicken, you'll probably be hungry again in half an hour."}, {"rating": "3", "text": "Ugh! Down right awful!\r (I decided to put as much into this review as the writers and actors, barring Eva Green who's always on point, put into this movie)."}, {"rating": "7", "text": "It lacks the unworldly mythologies of the first title, but its spectacular animation will still be entertaining enough. 300: Rise of an Empire is the prequel, event in between and also sequel of 300, this might be overreaching as it cumbersomely tries to tell wider scale background of the war. There are more characters, each with their own tale and the change into naval battle is a welcomed one, not to mention clever ways to divulge more effects, however they can't replace the charm of mystical charisma from the predecessor.\r Story revolves mainly on Themistocles (Sullivan Stapleton) and his ambivalence struggle against slightly insane Persian general, Artemisia (Eva Green). Stapleton is not exactly inadequate on the leader role. He showcases a decent performance as the weight of war slowly burdens him, but the brash hawkish lead from Gerard Butler is sorely missed. The movie utilizes almost the same merry band of warriors as 300, despite acknowledging the less superhuman original profession. They might be too similar, especially physique-wise, it feels like a shallow reenactment than legitimate replacement, and it's not about the blue cape instead of red.\r Eva Green is absurdly filled with anguish, almost excessively. It's very passionately awkward, but admittedly effective nonetheless as she oozes strength at times. King Xerxes (Rodrigo Santoro) gets an exposition of his metamorphosis past, a \"before\" and \"after\" look as herbal steroid, magic spell and CG alter his appearance to that of a giant. This retains some of the magical vibe from previous title, although only a mere fragment of it.\r He does not possess the same on-screen threat as he did, currently he's not even the same level as his madly obsessive lady general. Queen Gorgo (Lena Headey) serves as narrator, she partakes in only a handful of scenes as the focus shifts away from Sparta. Her voice has weight, although not as poignant as Dilios (David Wenham) in the first movie, who is now relegated into a flimsy support role.\r The trademark fight scenes are splendid, stylishly choreographed with elegant brute force. Maritime warfare presents more effects added into bloody skirmish, be it may water or fire, they are visually delightful. It moves very aggressively, slowing at just the right critical moments. In a sense, it almost resembles a game; I wouldn't be surprise if it has health meter and death count display. This mix of battle macabre and CGI stand tall in the peak of action genre, audience will most likely find no disappointment in this regard.\r Unfortunately, screenplays aren't constructed concisely enough; they don’t continue momentum from plot to action smoothly, making some occasions feel dry. It offers some degree of political and social aspect, but not carrying the depth needed to stimulate the audience. While the spectacle is undeniably impressive, 300: Rise of an Empire is just a glorified war movie."}, {"rating": "8", "text": "You could be forgiven for not realizing that Zach Snyder was NOT the director of this worthy \"300\" dual prequel/sequel. Noam Murro does an admirable job aping Zach's over-the-top style, especially since he's given the responsibility for showing us the man-to-god transformation of Xerxes. This film, like all other other-the-tops, are not meant to be examined too closely or subjected to over thinking. Just enjoy the hyperbolic action when it occurs because that's its strength. And yes, there is a not so subtle message concerning the warring factions: killing literally breeds more killing - grudges cross generations - a lesson 3000 years later we still have yet to fully grasp."}, {"rating": "8", "text": "I have to say i was not looking forward to this film, i watched the trailer a few times and was going to give it a miss but im so glad i watched it, i thought that the story was pretty good, the way it was close to 300 i liked that, the comic book violence was spot on, the blood was a little dodgy in 2D so i wish i had seen it in 3D, the acting was pretty good, Eva Green was really good she really surprised me, and she looked hot :) one thing that was a downer the middle of the film got a bit flat, it started off fast paced then lost it a bit but it soon picked up pace. I left the cinema with a huge smile on my face and i am really looking forward to the next instalment."}, {"rating": "4", "text": "It was okay. I found 300: Rise of an Empire to be somewhat entertaining, but somehow the blood effects are even less realistic than those in the original 300. The cast is also quite pale compared to the original(Gerard Butler, Michael Fassbender, etc.) Eva Green was really over the top but I suppose in a good way. I don't really think it's necessary to see in theaters."}, {"rating": "7", "text": "Beautifully painted art on canvas like visuals, gory action sequences and Eva Green makes this movie a visual feast to watch. The amount of work that's put in doesn't disappoint the viewers."}, {"rating": "7", "text": "Its a good movie..not a great  one nor inspirational\rwatch it in 3D for cinematography,graphics,stunning visual graphics scenery,slo-mo action scenes\r about the story : watch what happens in the side of original 300\rA navy battle\r -ve : lots of graphic blood '; spills on camera\rslow second half followed by comedy\r Rated R : for Curse words &  a nude sex scene\r+ve : not boring"}, {"rating": "6", "text": "Interesting movie. It just shows what 300 is all about in a movie with non-significant mistakes in the development, showing a nice background and a story with some problems at the moment of showing the meanness gore during the majority of the movie with unnecessary slow motion and fake blood effects, but at last its saved by Eva Green's performance, with a deep and complete character that is enjoyable to watch."}, {"rating": "7", "text": "this was what i expected it to be bloody gory action film. i enjoyed it personally the acting was surprisingly good and the action scenes were awesome! overall for what its worth  i thought it was a solid movie and sequel to 300. the lead actor of Themistocles performed really well"}, {"rating": "4", "text": "-Blood effects were \"overdone\"\r-Fighting looked very unreal almost like a videogame and didn't fit the theme of the movie\r-This movie is clear example of why moviemakers should not abuse CGI as it destroys the immersiveness and\rno one takes it seriously for instance how can a skinny female slice through piles of  armoured warrior in one stoke and pour gallons of blood.What a joke of a movie."}, {"rating": "9", "text": "Thus movie definitely isn't for everybody, but I enjoyed watching this a lot. The movie is action packed and full of excellent fighting scenes, with sometimes fake looking gore and blood, which still seemed awesome none the less. I love the actors and I love the scenery, I'd watch this again if given a chance."}, {"rating": "3", "text": "What was I didn't understand what was director and the movie maker was doing there. Movie was complete failure after a great first movie we were expecting something greater but it was disappointing. And cast was not right."}, {"rating": "6", "text": "Having only seen the briefest of trailers for 300: Rise of an Empire I was not too sure what to expect. (Even with the title hints)\r The follow up to 300 turns out to be set at the same time as the first film, only your seeing battles being fought mainly on the open waves. Quality wise, this film is on the same par as the first one, with great CGI and the same stylised scenes.\r However the story has a little less backbone, clutching at straws at certain times. That's not to say the story is terrible, just not as deep. You are introduced to several new characters and some old ones which end up being your main focus of this film.\r You still get the same level of violence as you did in 300, only this time its a little unnecessary. Far too many blood gurgling scenes with unrealistic blood letting, which add nothing to the film or story. The level of swearing has also been ramped up, although i'm undecided if this is a good or a negative thing as far to often in films you find either the swearing missing or too extreme for the actions on screen. Maybe Rise of an Empire got this level just about right?\r Either way this is not a film for little ones or for a quiet night in watching a film with the wife.\r Overall, the film is worth a rent if you have seen the first one. But don't expect the same quality of film here."}, {"rating": "1", "text": "Disjointed mess.  Way too much CG blood.  Reality suspension aside, the effects were terrible.\rJust a poor attempt to play the 'stylish cinematography' while over saturating poorly constructed fight scenes.\r Weak sauce."}, {"rating": "6", "text": "When going into a 300 movie, you don't expect it to me smart as hell and the best movie ever. However, you walk into it thinking at least it will be dumb fun. This was dumb fun during the fight scenes and the other scenes were taken too seriously. It was as if the director wanted it to be smart, but used silly characters and quite silly premise. It also had a creatures that were quite silly and unnecessary as well. Unlike the original, where the creatures were pretty human and didn't seem too far fetched. These seemed useless.\r The special effects were impressive and the comic book feel was rewarding. It was just dogged down by quite lame action scenes with the fighters seeming supper hero. Though this really wasn't a negative, because its a war movie and I should have suspected that. The special effects though of the fighting seemed fake. Almost like a video game or Matrix reloaded when he fought all the Smiths. The fight scenes wasn't too bad, but wasn't as good as the original. I don't want a movie like this to be completely factional correct, but something like the formation of Spartans, the random idea for the Persians to back themselves into a corner, and even the use of slaves wasn't rewarding.\r Overall the movie wasn't too bad and it seemed like it could have been worse. Though scenes like the random sex scene were useless things in the movie. Things that could have been approved and or left out. Overall I wasn't angry at the movie and don't really consider it a score. I would give it a 6.5/10"}, {"rating": "0", "text": "Foul, racist American propaganda painting the great and enlightened Persian empire as a bunch of savages. The \"suicide bomber\" was particularly sickening."}, {"rating": "7", "text": "I've liked Eva Green since Casino Royale and now I have even more reason to be a fan. She gives the movie such a spark when she is on the screen she makes the rest of the cast seem a little boring. While not as good as the first \"300\" it is still an enjoyable experience."}, {"rating": "10", "text": "Absolutely amazing, love it!  Saw it in imax 3D back when it released and what an amazing experience it was, memorable and just so much fun. No doubt, 300 is easily one of my fav films but 300 RoaE continues that excellence and even improves in many ways.  Director Naom Murro and producer Zack Snyder - pair of geniuses, love their artistic style and story telling vision! Also the soundtrack is totally epic and one of the best ever, so inspiring and charged with energy.  This film deserves no less than a perfect score.  Enjoy"}, {"rating": "8", "text": "Great sequel. It's just as gory and stylish as the previous one. The 3D is well implemented, Eva Green is great as the villain and we get to see her Xerxes backstory. The movie takes place both before, during and after the events of 300, and i think that's really awesome. The special effects are great too. There's some memorable lines as always and then there's the sex scene which, while i normally don't like those sorts of scenes is actually not only tasteful but also hilarious considering how it ends. Only downside is that Themistocles, the new protagonist, isn't as memorable as Leonidas. I felt like it was a great sequel. I guess there's just no pleasing some people."}, {"rating": "7", "text": "First of all, Eva Green is beautiful, sexy, bad ass, and really good to look at. That alone is good enough.\r Second, this is not a historical movie. Nor is the first 300 movie. For example, the battle at Thermopylae is not \"Leonidas and his 300\" but Leonidas, 300, and some Greek hoplites/levies. This movie is NOT historical at all. Artemisia is not leading the battle of Salamis, the seamanship of the Persians are better than the Greeks, the Persians use the same type of ships than the Greeks, and the rocks trick is used at the final battle of Salamis, instead in the opening battle.\r Third, Eva Green is a beautiful women.\r Fourth, I am an action junkie so my score will reflect that. There are a lot of gore and blood. The sword battles are not so nice, mostly the action scenes are jumbled of one-on-one battles, or hero vs. tons of enemies battle, while it's better if the action also focuses on the wide carnage of the battle. The CGI is great, but CGI can't help weak action scenes. The Persians, are, as usual, slaughtered by the \"Greek farmers\". This is boring, the Persians should have a chance of an EVEN FIGHT. In fact, the Persian soldiers should have upper hand against \"standard\" Greek levies. The only Persian capable of fighting back is The Immortals, but these also will be slaughtered in large number if they fight the Hero. Seriously, this thing bores me.\r Fifth, there are so many plot holes. For instance, the Spartans refusal to help. Seriously? The Spartans are so badass in the first movie. They are warrior society, yes they have lost their king and the kings bodyguard, but after losing this they think \"no more\"? The other city states farmers and artisans are fighting to death, against greater number with less training and less martial skill, and yet still fight? The Spartans do look like a douche. And in the end, the Spartans still have a large number of soldiers, where are these guys in the first movie?\r Good movie to have in theater, but you don't have to buy it.\rHalf of my score is given to Eva Green and her good \"scene\"."}, {"rating": "9", "text": "Rise of an Empire is a sumptuous feast for the eyes that’s a worthy sequel to the action classic that doesn’t improve on the formula, but does entertain for the majority of its run-time. A sequel that's better than it has any right to be, Rise of an Empire is an adrenaline-fuelled blast of bloody fun."}, {"rating": "9", "text": "The new instalment of 300 is a excellent, exciting, fast paced, action with some of the best visual I have seen to date. The movie is generally pleasing and a fun time to watch with mates. A note worthy script and a well all round cast is everything fans craved for. 300: Rise of an Empire is a must watch sequel to the original classic."}, {"rating": "4", "text": "Meh is how best to describe this sequel.  I saw the Double Feature of the two 300 movies on Thursday evening, and I was left wanting.   Being a big fan of the 1st movie, I went in with little expectations to return this obvious money making opportunity into a worthy sequel.  They did try to capitalize on 2 of the best features of the first movie, which was war strategy with amazing looking graphics.    The first movie was battle on land, and the sequel is on water.  What it fails to bring back was good characters to root for.\r SPOILER:\r There is an odd aggressive sex scene with our hero and the evil warrioress of the sea, and it makes little sense.  Even if she is quite sexy, and I did not balk at seeing more of her, it seemed to be added to appease a portion of the audience who needed a break from the violence and bad character development.  The hero was just not the same after that, and how could you as a movie goer want to root for his success after succumbing to his pent-up prostate?  Sure he has had dating problems, but he decided to marry Greece and as soon as someone flashes a leg, our hero decides to be unfaithful to his motherland? Come on Dude!\r The rest of the movie tried to overcome the messy script with memorable fight scenes,  Unfortunately for me, I just watched the 1st movie back to back, and there was little original in the 2nd movie to allow me to enjoy it fully.  It isn't a bad movie, it just lacks that emotional connection we need with the characters, and that ultimately is the flaw.  Even though the fights were the same, it is the slow-motion sequence of the fights and the over the top speeches  that made you enjoy the first 300 movie.  If you want more of that, then unplug your brain for 2 hours and enjoy."}], "recommendations": ["the_matrix_reloaded", "the_hobbit_the_battle_of_the_five_armies", "pacific_rim", "immortals", "abraham_lincoln_vampire_hunter", "hellboy_ii_the_golden_army", "star_wars_episode_i_the_phantom_menace", "mortal_engines", "reign_of_fire", "the_matrix_revolutions", "the_great_wall", "battle_los_angeles", "pompeii", "king_arthur_legend_of_the_sword", "underworld", "kong_skull_island", "mad_max_fury_road", "the_magnificent_seven", "underworld_blood_wars", "avengers_age_of_ultron", "transformers_the_last_knight", "pearl_harbor", "bumblebee", "beowulf", "maze_runner_the_death_cure"]}