{"id": 3304, "title": "30 Days of Night", "starring": ["Josh Hartnett", "Melissa George"], "runtime": 113, "genre": ["Horror", "Thriller"], "description": "This is the story of an isolated Alaskan town that is plunged into darkness for a month each year when the sun sinks below the horizon. As the last rays of light fade, the town is attacked by a bloodthirsty gang of vampires bent on an uninterrupted orgy of destruction. Only the small town's husband-and-wife Sheriff team stand between the survivors and certain destruction.", "releaseYear": "2007", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/7LwSrvFA0gz1KAlcrGcinoQPene.jpg", "categories": {"plot": 7.125, "acting": 7.411764705882353, "ending": 6.857142857142857, "soundtrack": 8.5, "cinematography": 8.0, "familyFriendly": 3.0, "funny": 1.0, "action": 6.571428571428571}, "reviews": [{"rating": "10", "text": "A superb movie in every way. Very surprised at some of the negative reviews. I really don;t see any flaws with it. The pacing is brilliant, with a great lead up to the arrival of the vampires, the acting is first class, the characters believable, there's blood, action, decapitations, dismemberments, and the cinematography is very expertly done. In my opinion this is one of the greatest horrors ever made. John Carpenter loved it - say no more."}, {"rating": "9", "text": "I think it is an excellent movie in its genre. In the beginning I didn't have many expectations for I thought that the 'vampire' theme was nothing new...and I felt that I perhaps made a mistake renting that film, but as the story developed I got caught! Not a typical vampire movie with sexual undertones...it is more than that. Yeah, there was a lot of gore -and I am not someone who enjoys gore for the sake of it, but somehow in this case, it did work. I believe it was also because the art direction was great. That was not the typical vulgar gore but the opposite. There are, however, things that could have been improved...and at times I thought that the vampire language was ridiculous, but then I just ignored it, for saying that is a bit unfair: since they are vampires, an alien language makes sense! We wouldn't expect seeing these vampires speaking English, Chinese, Spanish, or Finish, yeah? so that type of criticism is ridiculous and somehow naive. Besides, the pleasantness- or unpleasantness- of the vampire language doesn't affect the quality of the drama per se. I have actually enjoyed this film so much, that I want to buy it (and my movie collection is outstanding) An advice: In order to be truly enjoyed, this film should be watched with a very receptive mind, and even if you don't like it, at least you won't complain about the photography, for it works great with the location. A great atmosphere for a horror movie!...and yeah, as someone observed before...it reminded me a bit of The Thing too. If it was 'competing' with different genres of movies I wouldn't give it a 10, but in its genre I believe it could be a 8.5...however, I am giving it a 9, because I think the present overall score is pretty unfair...so it is a way to help! But I have noticed problems with the scoring before, for often, it doesn't add to the positive reviews after I write them (even after days, and I guess that also happens to others)...and yeah, I understand that it produces antagonistic views, but we all have different taste and expectations. With the sequel, don't bother, it is a 0 ....a huge 0! (you see I am harsh)."}, {"rating": "9", "text": "This film offers a lot of thrills and if you love the vampire genre then you will love this.  Danny Huston has to be one of the most scariest vampires of all-time."}, {"rating": "10", "text": "Just logged in to raise the bloody score on this horror diamond. The only reason I can find for not rating this movie an 8+ is NOT to be a horror fan. It has vamps, eternal night, gore, splatter and original story from a terrific comic."}, {"rating": "10", "text": "If you want to see a good vampire horror movie,check out 30 days of night.There is a lot of blood,action and the movie is really scary.The actors are really good and the vampires are really scary."}, {"rating": "10", "text": "Saw it back in the day, didn't really appreciate how well made it is.  The director did a whole bunch of Breaking Bad episodes and the production values are par with that.  Good effects, photography and even acting from Hartnett (his best performance, least hammy) and the interesting Melissa George, who makes more money from inventions than from acting, wow."}, {"rating": "10", "text": ";&;&;&;&;&;&;&;&;&;&;&;&;&;&;&;&;&;&;&;&;&;&;&;&;&;&;&!&,,,,,,,,,,,,,$$$$$$$$$,$,$,$,$,$,$,_,_,_,_,&_&_&_&_&_&.."}, {"rating": "8", "text": "Great setting and idea. Vampires for 30 nights. I loved every minute of it and it was interesting to see how people react when suddenly they are the ones who get hunted."}, {"rating": "10", "text": "----------------------------¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○"}, {"rating": "10", "text": "□□□□□□□□□□□□□□□□□□■■■■■■■■■■■■■■■■¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡"}, {"rating": "9", "text": "Most amazing vampire movie ever. Scarier and sticks in your head. Not perfect but pretty close, interview with a vamp, dracula, twilight, true blood don't close to the perfect vampire."}, {"rating": "8", "text": "Violent movie, good take on the vampires. They’re more zombie than vampire where they don’t speak English and aren’t seductive school students. Ending was terrible though"}, {"rating": "10", "text": "♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥"}, {"rating": "10", "text": "¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¤¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡••¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡°•¡•"}, {"rating": "10", "text": "A+ *************************************************************************"}, {"rating": "7", "text": "Now this is more in line with what vampires should be. The 2000's were largely clogged with movies depicting them as fashion-centric pretty boys and oversexed supermodels. It's something the bloodsuckers have never quite recovered from. Now I believe there should be some sexuality to these creatures of the night. Even the original Dracula story gave the undead Transylvanian some seductive power. But humanizing love stories just aren't what these creatures are about. What should have been the occasional deviation became the norm for vampire flicks, leading most to forget that at the end of the day they are still monsters and should be treated as such. 30 Days of Night didn't forget though.Based off a comic book miniseries, there's a great core concept holding the movie together. An isolated Alaskan town undergoing a lengthy Polar Night proves to be the perfect playground for the creatures of the night. The carnage looks fantastic. The scenes are shot in a way that makes them feel like they were ripped right from the pages of a comic book. The slaughter is even more striking than in other films due to whiteout setting. The liberal use of gore really stands out. I will never underestimate how good blood looks on snow again. There's a solid undercurrent of tension running through the whole thing. The sense of being of being closed off from the world and the characters being forced to band together in small groups to survive almost gives the film a post-apocalyptic vibe most commonly associated with zombie flicks. However, 30 Days of Night manages to avoid stepping too far over into another monster's territory by staying true to what makes vampires unique. Mainly by showing off their intelligence and enhanced physical capabilities. While doing a lot to make vampires menacing again, the overall movie isn't able to avoid all of the flaws that have been slowly driving a stake into the heart of these kinds of films for a while now. While it has two compelling protagonists, the rest of the cast feel like generic survivor types. Josh Hartnett gives a really good performance, but a lot of the other acting is subpar. There's plenty of cheesy dialog and unintentionally goofy behavior from the antagonists the kind of drag down the flick's respectability. It's also got a lot of downtime and it falls into a loop where the characters go out to get supplies, lose someone, and repeat. These kind of things don't ruin the experience. They just keep 30 Days of Night from sitting anywhere near the top of vampire canon.Flaws aside, if you want a vampire movie that treats them like the relentless, bloodthirsty monsters they are then this is the feeding frenzy for you. It was a clever idea to make use of Alaska's extended periods of darkness. Often one of the things that keeps people going in the face of nightmares is the knowledge that morning is around the next corner. 30 Days of Night removes that comfort by having the sun take a lengthy vacation. Allowing it's nocturnal hunters greater freedom to toy with their prey. Watching the characters try to survive in a world with no safe places and salvation being an entire month away makes for a bloody good time.7.2/10"}, {"rating": "8", "text": "This is one fine vampire gore fest! The vampires are truly something new to look at and study.....they are different than ones we've seen before. This is what I envision when I think of what vampires should truly be......not the lovey dovey commercialized teen dream vampires of late. The only thing these vampires are missing is an effective backstory....they don't even give a flavor of their past. The supporting survival team offers the terror and primal fear that we all would experience."}, {"rating": "8", "text": "This is actually a very good vampire movie. It had some sweet effects. The vampires were very creepy (especially the bald one). It had an interesting plot with some VERY smart vampires. I'd recommend seeing this movie whenever you get the chance."}, {"rating": "0", "text": "Slow paced, Uninteresting characters played by a cast who doesn't even seem remotely interested in actually trying to act in this film and a plot that makes no sense. I mean they could have at least explained how the vampires came into existence, Why they chose to attack this town. You know basic storytelling. And it's so boring that even the action scenes can't breathe any excitement into the film."}, {"rating": "7", "text": "Eu li a graphic novel 30 Dias de Noite republicada pela Darkside Books, e achei incrível o conceito. Por isso decidi ver o filme. Achei a obra bem legal, nada muito surpreendente, mas curti como eles conseguiram colocar uma hq não tão longa num filme de 2 hrs. O que eles colocaram não foi nada ruim, embora haja uma mudança aqui ou ali, mas nada que estraga a obra original. Vale a pena conferir!"}, {"rating": "8", "text": "Very nice style except when it got a bit too shaky for my liking. Some of the music was slightly out of place but other than that I liked all the sound. I liked the story and the setting. The acting was strong too. I liked the style of the vampires, they were like real people but not normal! It was awesome. They created some really good tension and fear. Scary, creepy and reminiscent of John Carpenter. It was vampires with a great twist."}, {"rating": "7", "text": "It's a pleasant change of pace to get a vampire movie where the bloodsuckers are allowed to be monsters. You know what I'm talking about - no more of this brooding, tortured soul **** The undead here are hardcore killers, ripping apart their victims' throats then walking around with the blood caked all over their faces. Even Dracula wasn't this cold-blooded. Too often of late, motion pictures have defanged their vampires, turning them into whiney, pseudo-romantic figures. That's not a mistake made by director David Slade. Finally - a modern vampire movie where audiences sympathize with the victims rather than their attackers. If you think these creature are sexy, you need therapy.\r The setting is Barrow, Alaska - the northernmost outpost of the United States - on the eve of the annual month without sunlight. Barrow doesn't have a large population during the summer but, when the sun goes down for the long, cold night, only the hardiest souls - about 150 of them - stick around. By the end of 30 Days of Night, most of them will wish they had followed the birds and flown south. Vampires have come to Barrow this winter with the dual goal of feeding and eliminating witnesses. Their initial attack is swift and brutal. Within a day, most of the town's citizens have become fodder. A small group of survivors, led by the sheriff, Eben (Josh Hartnett), and his estranged wife, Stelle (Melissa George), fight to survive, moving from place-to-place while occasionally dispatching a vampire if it gets too close. In Halloween, Dr. Loomis uttered the refrain that \"death has come to your little town.\" That's an appropriate phrase for Barrow in 30 Days of Night.\r The premise - providing vampires with a month of sun-free opportunity to wreck havoc - is clever and, if it's not fully realized, at least enough is done with it for 30 Days of Night to represent two hours of solid, gory entertainment. This isn't one of those neutered PG-13 horror movies. There's enough blood and viscera coating the screen to earn the R-rating without things tipping the scales into the \"torture porn\" category. In many ways, what Slade has wrought here is reminiscent of an amped-up version of a Hammer vampire movie. In fact, Danny Huston alternates between channeling Christopher Lee and Max Schreck.\r Most vampire movies have their own \"rules,\" and that applies here, where there are variations on a theme. There's no religious iconography and, while a wooden stake driven through the heart might make an impression, it's never tried. The way to eliminate a vampire is to sever the spinal cord or destroy the brain. Hence, the most effective weapon is an axe. Bullets only work if fired directly into the head. Humans killed by vampires will transform if given the chance. However, the undead are jealous of their status and prefer to decapitate their victims before the transformation can occur rather than growing the ranks. Sunlight is fatal but holy water probably isn't. 30 Days of Night also doesn't provide a clue whether garlic does anything more substantive than causing bad breath.\r The movie, which is based on comic book, is set up more as an action thriller than a straightforward horror movie. Slade, whose previous feature, Hard Candy, touched on a horror of a different sort, establishes the framework largely as that of an extended chase. There are some \"boo!\" moments but those are largely beside the point. 30 Days of Night is more interested in getting the adrenaline flowing than in scaring viewers, although Huston's grim goth lord is pretty freaky. (This is arguably the most convincing portrayal Huston has ever given.)\r Viewers have come to expect a lot visually from comic book adaptations, and 30 Days of Night delivers. There's nothing here as radical or groundbreaking as can be found in the likes of Sin City or 300, but Slade crafts a number of scenes that stand out. Perhaps the most indelible of these is an overhead shot of Barrow as the vampires hunt down and dispatch humans. The final scene is also effective in the way it marries beauty and horror.\r One aspect of 30 Days of Night that's refreshing is that it doesn't require the survivors to have undergone frontal lobotomies in order to move the story forward. Yes, characters occasionally do stupid things, but they're not unreasonably stupid and they don't force members of the audience to fight against the suspension of disbelief gag reflex. I'm not going to claim that the screenplay is either airtight or brilliant, but it is smarter than the average genre entry, and that's a big plus. 30 Days of Night works on its own terms, which is more than can be said of most horror films these days. If this is the kind of movie you're looking for, it delivers."}, {"rating": "10", "text": "+++++++++++++++++++++++++++÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■"}, {"rating": "7", "text": "This is another great zombie flick that should be played/mentioned more. It holds my attention well, the way they do the effects/makeup/costumes rocked, thought they did well with the plot, not to complicated and it gets the job done. Good setting for this movie.  NO GOD!"}, {"rating": "2", "text": "I am from Alaska and this was horribly inaccurate of Barrow. I hate to think what Barrow people thought of it. I couldn't enjoy the movie because the IDEA of Barrow was so off in not just the big things but the little ones as well. I know it was just a movie, but some reality or just some investigation on Barrow would have made the movie a little better in my eyes. If it had been about maybe Canada or somewhere else in the North that i wasn't familiar with i may have enjoyed it more. Some research does wonders for the modern movie!"}, {"rating": "4", "text": "I went to this movie thinking it was going to be terrible...it was. But it was better than expected. Would have been ok if not for the terrible design of the vampires and the screaming. It wasn't scary it was just aggravating."}, {"rating": "0", "text": "Worthless movie. Ridiculously inaccurate. Now everyone thinks Barrow has 200 people and is a major oil town. Here's the deal folks- the two oil towns in Alaska are Prudhoe Bay and Valdez. Useless."}, {"rating": "2", "text": "Marginally less stuipid than the comics, but that doesn't take much -- the AND THEN A MAGIC GHOST SOLVES EVERYTHING ending for the comics is somewhat better handled, but... garbage in garbage out, y'know?"}, {"rating": "5", "text": "Vampires come to Alaska taking advantage of \"30 days of night\" in the winter.The big problem for me is that the vampires really aren't scary but unintentionally funny. And the main one looks like Fat Boy Slim.If you said to a 10-year old \"Be a scary vampire\" they'd act like the vampires in this.Ironically the scariest vampire in it is a 10-year old.Bit silly all round really although some nice axe action."}, {"rating": "2", "text": "Pas d'histoire, pas d'originalitÃ©, pas d'ambiance, pas de punch... 30 Jours de Nuit n'a pas grand chose Ã  nous offrir. Du moins, tous ces dÃ©fauts auraient pu Ãªtre compensÃ©s par le reste. Il n'en est rien : les acteurs ne sont pas convaicants, les vampires grotesques, la mise en scÃ¨ne plate... Il reste nÃ©anmoins les effets spÃ©ciaux (scÃ¨nes gores) pour combler les fans de suceurs de sang, et encore! Au final, ces 30 Jours de Nuit vont vous permettre de bien dormir durant un bon moment (pas un mois mais 1h48). Encore un film qui ne mÃ©rite pas toute la publicitÃ© faite autour..."}, {"rating": "6", "text": "The movie has very cliched type of characters, but at the same time it's a different vampire perspective, as well as the location, overall I think that  the whole idea was not properly exploded, you are in Alaska! surprise us with something that it hasn't been seen! you can have a few minutes of fun with this movie."}, {"rating": "6", "text": "Pretty frightening visuals throughout, but the film suffers a great deal from slightly bland storytelling and characters."}, {"rating": "6", "text": "Some very effective scare and gore scenes and some well executed performances can't help the lack of a cohesive narrative. It is an interesting premise though and Danny Huston is quite effective as the leader of the pack of marauding vampires."}, {"rating": "6", "text": "The preview for this movie had my expectations on high alert.  You have evil vampires in a remote location where its dark for a month.  How can you really go wrong?  I can't put my finger on it but something was missing.  I don't feel like everything was executed to its fullest."}, {"rating": "1", "text": "1/10 *   Sehr langweilig und die ganze zeit war es dunkel. Konnte man kaum was erkennen. Direkt ausgemacht."}, {"rating": "5", "text": "The main problem with 30 days of night is that it's a brand new vampire flick trapped in the body of a 30-year old zombie flick. Replace vampires with zombies, add a shopping mall, and you basically have Day of the dead, complete with whiny, predictable characters ( the nervous guy who wants to run for it, the confident leader-type, the nurturing motherly type, the teen with no personality to speak of... the list goes on). Did anyone involved in this movie even bother to read the graphic novel it was based on? We've got the 30 days of night, vampires and that's about where the similarities end. A nice soundtrack, cool vampire language (Romanian perhaps?), nifty camerawork and a not-too horrible Josh Hartnett can't save this movie from the mediocre gore-fest pile. Too bad."}, {"rating": "6", "text": "Clearly, based on reviews from Alaskans, this movie made the Alaskans seem to smart."}, {"rating": "8", "text": "Fun movie with a few flaws. Overall, if you like horror you should see it. I am a huge horror fan and I avoided this one for a while until last night when I Netflix-ed it. The vampires in this film are really creepy and will give you goosebumps. It's very 'Night of the Living Dead' in that they are trapped and have a swarm of evil creatures after them. Give it a watch, it's worth it."}, {"rating": "7", "text": "The dark, cold Alaska winter setting is a huge plus and it makes a very atmospheric film. There are some very chilling scenes. The cast is very good. Fast paced, the great score adds to the tension."}, {"rating": "8", "text": "30 Days of Night is exactly what you expect it to be, at least in terms of it's plot"}, {"rating": "7", "text": "Good concept and creepy title. But then there's more gore than horror and it lacked more suspense than what you would expect from it's title. Still, I think you should watch this movie for it's nice plot and story ."}, {"rating": "9", "text": "I haven't seen a more entertaining vampire movie in a long time. You people who gave it a bad grade, what were you expecting? Sure, it has a lot of gore and blood, but if you don't like that kind of stuff, then it's your fault for not seeing the content descriptions. This movie did a good job of keeping the feeling of the graphic novel, in my opinion. The plot isn't hard to understand, the action is well paced, the acting is pretty good for the horror genre, the script is decent, and of course the vampires are awesome villains. There are some effective camera angles, especially the birds-eye view. The visuals and soundtrack are great. This is one hell of a vampire movie."}, {"rating": "9", "text": "This was without a doubt the best Vampire film since \"The Lost Boys\". It was all round an very well done film, until the ending witch was very cliched. Otherwise, i'm going to have to highly suggest to this film to anyone who enjoys a good horror film.. Without a doubt one of the best horror flicks in years."}, {"rating": "8", "text": "I completely agree with Asian S... The movie was great and entertaining but then the end felt pushed and not really thought out... They definitely could have done something cooler or more clever with how it ends for sure."}, {"rating": "8", "text": "This is a pretty solid updating of the vampire genre carried along mostly on the very clever idea of the bloodsuckers making themselves at home in a small American town that just happens to have 30 days of night every year. The vampires are scary in the kind of jittery, fast-moving undead thingy that's gotten popular since the genre-busting 28 Days Later a few years ago. (Spoiler alert!) There are some holes in the plot that you can drive a truck through. It's hard to imagine that an entire town would disappear off the map for a month and nobody would bother to check it out. But you know, it's a damned (ha!) horror movie. I remember years ago watching the Lovecraftian ReAnimator and a moron in the audience, three-quarters of the way into a completely silly movie filled with undead cats, undead-living sex scenes, and similar over-the-top moments, loudly objecting to the fact that a beheaded bad guy was having a conversation. \"Heads Can't Talk,\" the moron insisted. My point is that horror movies have their own logic and if they're scary, that's what we paid for. And 30 Days of Night is scary."}, {"rating": "7", "text": "Taken from someone who has seen every horror movie ever made, this was a somewhat decent flick that suffered from a few callous drawbacks. I don't know if any other horror fan feels the same way, but I am so sick and tired of seeing CGI blood spatters. They look horrible -- completely unreal -- and almost black in colour. I am sick of frenetic movie cutting back and forth during action scenes (a la Saw II and III -- for this very reason I won't be seeing Saw IV unless I take my ADHD pills). When I go to the movies, I don't want to watch an episode of the Power Rangers. I want to see what is happening on the screen. The gore scenes in 30 Days of Night are like this too: far too choppy. Don't expect to see anything, especially on today's big digital screens. The best part of the movie, by far, was seeing Josh Hartnett in a new, adult role. I've been very biased against this guy in his other movies, thinking the only reason he was ever hired was because he looked like a young Tommy Lee Jones. He has certainly ascended to a new level. In this movie he is completely likeable and sports a new maturity. Kinda like the way Mark Wahlberg went from being \"just another new face\" to a truly seasoned actor in only a few years."}, {"rating": "9", "text": "Excellent well paced movie. THe sense of isolation reminded me of \"The Thing\"."}, {"rating": "7", "text": "Finally, a vampire movie that depicts them in the old legend way: soulless, cunning beings who hunt and kill worse than animals and who are only looking to satisfy their own basic need to feed. Marlow was frightening and convincing."}, {"rating": "10", "text": "Best vampire movie ever."}, {"rating": "1", "text": "Comically bad. seriously. the entire theater started laughing after it was over. I love horror movies and completely understand that they should be taken for what they are. In this case, it's a pile of crap and nothing else."}], "recommendations": ["daybreakers", "terrifier", "house_of_1000_corpses", "the_descent", "the_green_inferno", "the_crazies", "texas_chainsaw_3d", "p2", "devil", "the_strangers_prey_at_night", "underworld", "the_ritual", "the_possession", "priest", "dark_skies", "28_days_later", "chernobyl_diaries", "cabin_fever", "the_texas_chainsaw_massacre_the_beginning", "it_follows", "fright_night", "hell_fest", "dawn_of_the_dead", "mirrors", "the_collector"]}