{
  "id": 3863,
  "title": "3 Days to Kill",
  "starring": [
    "Kevin Costner",
    "Hailee Steinfeld"
  ],
  "runtime": 113,
  "genre": [
    "Action",
    "Drama",
    "Thriller"
  ],
  "description": "A dangerous international spy is determined to give up his high stakes life to finally build a closer relationship with his estranged wife and daughter. But first, he must complete one last mission - even if it means juggling the two toughest assignments yet: hunting down the world's most ruthless terrorist and looking after his teenage daughter for the first time in ten years, while his wife is out of town.",
  "releaseYear": "2014",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/sliYPOgeUuf62qktgXbfMBmYvj1.jpg",
  "categories": {
    "plot": 5.405405405405405,
    "acting": 5.548387096774194,
    "ending": 4.666666666666667,
    "soundtrack": 6.0,
    "cinematography": 4.5,
    "familyFriendly": 5.125,
    "funny": 4.888888888888889,
    "action": 4.487804878048781
  },
  "reviews": [
    {
      "rating": "5",
      "text": "I don't know what's good for Luc Besson, even though Kevin Costner might've saved his comeback for another Oscar run. But it seems to me like he wants to take a page out of Liam Neeson's \"Taken\" scoresheet on becoming the bad ass that he is today. 3 Days to Kill is like Blown Away ripped off by Die Hard as to joining a member of the AARP special agents club. The acting is great, but the story is boring and not enough gas in the tank for McG (you know, the guy 5 years ago killed the Terminator series into oblivion in Salvation) and Besson to copy what's left of \"Taken.\" But on the good side, the action scenes were pretty good. So I'm not so sure about this film, but I'll have to wait for \"Non-Stop\" instead. Rent \"3 Days To Kill.\""
    },
    {
      "rating": "3",
      "text": "3 Days To Kill was promoted in a very misleading way. The previews, the description, even the cover of the DVD make it sound like an exciting thriller. They even manipulated the name of the film, to make it seem like one thing, when it really meant another. The story centers around Ethan Renner, (Kevin Costner) a man who has spent his entire life killing people for the CIA. Renner has found that he only has a short time to live and wants to spend his remaining time with the family he's largely abandoned. His retirement is short lived however, as his old bosses at the CIA promise to help with his medical care if he'll do one last job, a job he doesn't want his family to know about. 3 Days To Kill was made to look like the dying agent had 3 Days To Kill his target, but that's not true at all. The title refers to him spending 3 days with the daughter he hasn't seen in 10 years. Like everyone else, I was fooled by the films promotion and decided to see it, even though Kevin Costner stars. I forgot the fact that Costner hasn't made a decent film in about fifteen years, and assumed that 3 Days To Kill would lead him away from romantic films and be a return to what made him a star, but it wasn't. The action and intensity of a CIA thriller is a back story, to a film about a dying man reconnecting with his family. It wasn't as boring or depressing as a full on drama, following a similar storyline, but it wasn't far off. Much of the hunt for his target was used as comedy to break up the monotony of watching Renner teaching his daughter to dance and ride a bicycle. To be honest, the film really is just a whole mix of things, none of which work. The cast is dreadful, the story is all over the place, and the film is just ridiculous. 3 Days To Kill was a horrible experience, and not only did I hate this film, I feel like I was tricked into watching it, by some clever marketing people, who knew the film was **** You can decide for yourself, but if you could use an extra two hours to do something you've been putting off, I'd skip this movie and get it done."
    },
    {
      "rating": "3",
      "text": "It's time to once again slam director McG. 3 DAYS TO A KILL has a witty script, game cast, and fun locales, all undermined by tepid and incoherent direction. Everything is wrong and it is the director's fault. At least let's cut out 20 minutes. That would make for a mildly satisfying B-movie."
    },
    {
      "rating": "6",
      "text": "I was pleasantly surprised with this flick. I expected complete awfulness, but what I got was satisfying enough for me to give 3 Days to Kill this score. It's extremely far from perfect, but it has elements I loved that I will talk about in the review. When you first see this movie at the RedBox (which is where I got it), you probably will think it's an action movie. That would be wrong. While it does have scenes of action, at the core of the movie, it is a drama that deals with family, getting the job done, and other subjects like that. I'm glad that it was a drama because the action didn't impress me much except for the first scene. The character development in the drama is extremely good, and while the acting isn't extraordinary, I really liked Ethan's (Kevin Costner) daughter as an actress. You will care about the characters, too. There are mainly 2 plot points in the film, one for the action, and one for the drama. The action one has to do with him pretty much just trying to kill or torture these men he has to hunt down. It was generic. The drama one was refreshing for this genre, though. It has to do with him becoming a dad again and regaining the love from his daughter. Everything in this film is nothing groundbreaking or extremely ambitious. For what it was though, I really enjoyed it, and the drama in it is worth a watch indeed."
    },
    {
      "rating": "5",
      "text": "\"3 Days to Kill\" 10 Scale Rating: 4.5 (Mediocre) ...\r The Good: No complaints on the performances in this film as Costner, Steinfeld, and Heard gave it their all and did what they could with a poor script. Some of the action sequences were very well done and a handful of the more humorous scenes garnered a chuckle. Heard looked the part of the femme fatale and seemed to have a lot of fun in the role. Costner was believable as a CIA agent trying to re-connect with his family.\r The Bad: The story is beyond preposterous and even if you suspend belief, it just doesn't work. The action side of things was at least adequate, but the dramatic family side was not well done. They also tried too hard to make it a humorous film and the overwhelming majority of these scenes missed the mark. Also, Costner's character is a sick man who is dying ... but certainly did not fight or shoot like one."
    },
    {
      "rating": "3",
      "text": "Without a doubt, one of the worst films of 2014. The first thing I noticed was the cinematography, which was awful. It had this terrible combination of a sunny day, but with a grey color correction that just made it look muddy. The plot is nonsensical and some moments were just hilariously bad. The actors did a fairly good job, especially Kevin Costner, who was probably the only good thing out of this film. The editing is clunky, with some scenes that just felt illogically put together. I've pretty much given up on MCG. Aside from some well made action sequences and a charming Kevin Costner as the main character, it's terrible. DON'T WATCH IT."
    },
    {
      "rating": "7",
      "text": "3 Days to Kill is the kind of \"Taken\"-like action movie-thriller that is implausible as hell but still manages to capture our attention and at the same time be entertaining."
    },
    {
      "rating": "7",
      "text": "Kevin Costner is making a comeback and he's just as hot as ever. This movie was action filled and fun to watch, that you ignore some of the unrealistic parts. Definitely worth the watch in the theater."
    },
    {
      "rating": "6",
      "text": "3 Days to Kill is by no means a bad movie - I'm surprised it's currently getting a red score from the critics.  It's just a hair bloated for a McG / Besson film.  If you're thinking about seeing the film because you're a huge Amber Heard fan, don't bother.  She's probably in a grand total of 10 minutes of this film.  It's all Costner (who is quite good) and Hailee Steinfeld (who is excellent as the rebellious teenager). It's almost as if they overlayed  this assassin story on a family drama/comedy, though they're selling it as the opposite.  You could see much worse this time of year, believe me."
    },
    {
      "rating": "2",
      "text": "Stealing a discarded page from Liam Neeson’s action hero playbook, which began with 2008’s Taken and continues next week with the airplane thriller Non-Stop, Costner stars as a badass old dude kicking butt in 3 Days to Kill. It wouldn’t be so bad if Costner didn’t take the material so seriously. He scowls and grimaces in many of the scenes he’s in. And I’ll admit there are brief flashes that remind us how good he was once upon a time in The Untouchables, Dances with Wolves, A Perfect World and The Bodyguard."
    },
    {
      "rating": "8",
      "text": "I just saw this movie, taking some care to check it out first.   I have always like Kevin Costner films.  I personally found the movie entertaining.  Anyone who has had challenges in their own family will feel heartwarming connections in the movie.  I gave it an eight, perhaps it is more like a 7.5.  I certainly do not regret sitting for almost two hours.  Hey…what's wrong with happy endings ?"
    },
    {
      "rating": "6",
      "text": "With all the young hero types filling the tights of comic book characters, Hollywood has turned to middle-aged men to handle reality-based action. Kevin Costner plays a \"cleaner\" for the CIA, who retires so he can salvage his relationship with his daughter (Hailee Steinfeld). He's also got cancer with a 3-month death sentence, until an operative (Amber Heard in a succession of over-the-top glamour poses) promises a cure in exchange for one last job. Luc Besson penned the story, so it’s got interesting developments on the personal and action sides. Director McG has managed to balance both angles with warmth and some inventive fights. While it's in not way unique, it's passable entertainment and Costner manages to carry the burden effectively."
    },
    {
      "rating": "4",
      "text": "A boring, and cliched poor man's version of Taken, only with no cool action, a non-sensical plot, and Kevin Costner instead of Liam Nesson, and directed by McG the director of Charlie's Angels, and the man who killed the Terminator franchise with the god-awful Terminator Salvation, with nothing good to offer this should  be avoided."
    },
    {
      "rating": "3",
      "text": "Two things you don’t want in an action/drama/thriller are absurdity and mundanity. Unfortunately, 3 Days to Kill has plenty of both, and both rear their crazy, boring heads during the opening gambit."
    },
    {
      "rating": "7",
      "text": "While it is filled with plenty of secret agent/spy movie cliches, as well as an overly familiar father trying to reconnect with his estranged daughter story, there's enough entertaining action and humor here to make it worth a watch. It manages to stay entertaining throughout, and that's more than I can say about lot of other similar movies. So while Costner won't make you forget about Neeson anytime soon, he manages to keep the movie entertaining enough to make it worth a rental. It might not take the genre to any new heights, or reach a lot of the old ones, but it can be a fun watch."
    },
    {
      "rating": "1",
      "text": "This movie could have easily been called, \"two hours to kill\". Because it was a complete waste of time. Even as a long time Kevin Costner fan the only thing that kept me watching this movie was to see if it could get any worse. Absolutely his worst movie, this is the kind of movie that ends careers. All I can say is I hope he got paid lots of money for this want to be action thriller. If I could given this movie a negative rating I would. If the airline was playing this movie on the plane I'd jump out.\r For anyone who gave this movie a positive rating would be like some boxing matches where the fight is completely one sided, and you have this one judge who calls the fight the 115-114 and everyone is like, \"what fight was he watching???\" The folks who gave this movie a positive rating must have been watching another movie, or if they were lucky they feel asleep after the first ten minutes."
    },
    {
      "rating": "9",
      "text": "Just saw the movie, I loved it. I thought its going to be another Liam Neeson type movie but it wasnt. The plot was flawlessly mixed with family drama, this is great entertainment."
    },
    {
      "rating": "6",
      "text": "This was the latest action-crime movie from the director of 'This Means War'. It was more like a French thriller and should have been a French movie as well, but Hollywood borrowed it from a famous French filmmaker. This cast and crew team was great so expectation will be there like always. In this 2 hour movie everyone did not get fair screen presence except Kevin Costner. It was not long ago I saw the little girl in the movie 'True Grit', now she has all grown up here. Good to see her, hope the future will shape up well for her.\r It was the story of a top US secret agent who comes to know that his life is not going to wait for anyone any longer. He decides to spend his rest of the life with his closest ones. But the past follows him and urges his requirement in the field to eliminate the bad guys. In exchange, they offer something life changer. Now at a time he has to cope with his family as well the duty assigned to him. The rest of the story tells how he manages all the difficulties.\r They have tried too much ingredients and stirred in a one movie. That did not clinch well all together. In fact, multiple plot with each stream of the story had different genres that terribly ruined the movie's standardness. The pace was the issue here, it was not constant. When the action sequences begin it flows at a rapid speed, then it comes back to the normal that did not convince followed by the darkly humorous in parts. This is a time pass movie and expecting from it is like a foolish. You would accomplish watching it, in the end most of you won't be happy for what you had seen and probably decide to put into an average list."
    },
    {
      "rating": "8",
      "text": "I think many critics failed to recognize that this film was intentionally camp.  This was a highly enjoyable film if you do not take it too seriously."
    },
    {
      "rating": "7",
      "text": "It's NOT a master class on anything.  Good, respectable, enjoyable work by Costner, th three female leads, and the villains.  An excellent quarantine movie.  I'm grateful."
    },
    {
      "rating": "10",
      "text": "Directed by McG, written by Luc Besson, lead acting by Kevin Costner...perfect combination!!!  It was a thriller not in the usual Hollywood formula.  The lead character shows weakness and major flaws, but is a full and well rounded person.  Of course the plot line is implausible, but the dialogue and pace of the the movie kept it engaging!  I don't see any steals from the movie \"Taken\".  Instead, there's alot of originality in the movie.  Plus, the soundtrack fits the movie perfectly, especially the song \"Love it or Leave it\".  This movie is full of surprises, that only Luc Besson can do.  The editing is superb."
    },
    {
      "rating": "7",
      "text": "This film has quite an unusual mix of action, violence, comedy and schmaltz. Its not great but I found it entertaining and it held my interest for the entire time. Its a film that doesn't take itself seriously and has some funny moments. Its a different twist on the usual action movies and I liked it for being a bit different to the norm."
    },
    {
      "rating": "4",
      "text": "A slightly different twist on \"a veteran agent goes on a killing spree in Europe\" plot, 3 Days to Kill is incredibly predictable and not without cheesy plot in every turn. Kevin Costner is a retired terminally-ill agent recruited back as a black ops assassin, by a seductive spy lady no less, to kill elusive marks in exchange for a magical drug that might or might not save his life. Here lies the biggest problem, while it may be true he's desperate enough to resort to the extremes, note that a dying man is no way in shape or form qualified to hunt down an international fugitive, because he's dying.\r Assuming that throwing resources as leverage to motivate a retired agent is a good idea, the movie also introduces its heavily glamorized femme fatale, complete with fantasy setting from 80's pulp spy flick. This alpha female, played by Amber Heard, is always shrouded in sensual mystery, equipped with capable aptitude that ultimately begs the question whether she doesn't do the deed herself in the first place. It looks odd as she appears out of nowhere just in the right time like James Bond's fairy godmother only to quip or taunt.\r Aside from its awkward secret operative angle, the movie mostly focuses on family value. Luc Besson's style is clearly present, as in Taken. It's commendable that it tries to involve the characters in modest way, and to some degree it works decently, but it's hampering the sense of desperation its title describes, or misleads. Some of the scenes are pretty much a father, on his last remaining times, attempting to bond with his estranged daughter. It has some good moments and the acting is not bad, but it utilizes many corny scenarios that the relationship doesn't feel fully realized.\r Editing possesses some problems too. In many scenes, the transition is too fast, thus somewhat resulting in fragmented progression. This works better in some instances, especially action sequences, but it needs more finesse to weave through each act smoother. Sound effect is a silly rendition of Inception inspired music or recent movie trailers excessive hum. It plays this throb noise like in dubstep music for everything that happens. It's not just an annoying repetitive echo; it also produces more comical effect in some cases.\r Comedy is hackneyed at most, although it brings chuckle sometimes. The movie resorts to some corny situations in attempt for mild humor or heartwarming scenes, only a couple of them succeed in doing either. Technical aspect of action is presentable. While it doesn't rise to large scale explosion or fluid cinematography, it functions in its intended purpose. Some short bursts of clever camera angle or surprisingly gritty scenes prove to be effective. If only they were translated to the whole movie, it could've been much better.\r Tidbits of good parts can't elevate the entirety of the humdrum movie. It's ironic that the title is an analogy for wasting time, because that's exactly what this movie does."
    },
    {
      "rating": "7",
      "text": "I believe this movie's a bit underrated, so I decided to write a little something in its defense. In 3 Days to Kill, basically, Kevin Costner plays Liam Neeson and the movie sits in the \"Middle-aged guy has to go and kill a bunch of people for that last time\" genre.\rJust like Costner's character, the movie tries to balance ass-kicking with family affairs. And it performs quite admirably, with a decent action scene occurring just in time to dilute the family scenes. What is a definite plus for 3DTK, is that the aforementioned family stuff isn't as irritating as it is in many similar films. Here, it is presented with a good deal of humor, which makes it watchable. Speaking of humor, it, to my surprise, is in abundance here, with some characters being so ridiculous they're even funny. The result is that some scenes and character interactions (like the \"interrogations\") are very unrealistic and akin to some comedy sketches, but entertaining nevertheless.\rObviously, flaws are also present. Firstly, speaking of family, Costner's character's daughter is quite irritating both in her look and actions. Secondly, Amber Heard's character is, while obviously hot, also pretty weird, which leads to the third problem, that is, an overall bland and inconsistent plot. I might also add that for a Taken-style movie, it could have more melee fighting scenes, and ones with better fight choreography.\rTo sum up, 3 Days to Kill is a decent action movie that gets nonsensical at times, but its good pacing, decent action scenes, unexpectedly funny situations and Kevin Costner's charisma make it work, earning it a solid 7 out of 10 by my standards."
    },
    {
      "rating": "0",
      "text": "\"3 Days To Kill\" is Archer without the humor and style - just silly and unbelievable action scenes.  A complete waste of time.  I expected so much more from Luc Besson and McG."
    },
    {
      "rating": "5",
      "text": "There is no question that Kevin Costner is back, but unfortunately McG's still the same.  Costner does his best to make this movie work and if it wasn't for a script and a director that gets in his way he might have just pulled it off.  C"
    },
    {
      "rating": "5",
      "text": "The family drama and action doesn't blend well at all, but 3 Days to Kill soars due to Kevin Conster's fantastic performance and the level of entertainment it provides however implausible it is."
    },
    {
      "rating": "6",
      "text": "while the action scenes are very fun to watch and kevin Costner gives a good performance as a bad ass ..3 days to kill is sure a messy movie that's keeps you entertain throughout the movie even when its far from perfect."
    },
    {
      "rating": "5",
      "text": "Overall, this really is not all that bad a movie.  There are plenty of flaws and I hated the main CIA leader who was largely a joke.  There are many good elements as well.  Basically, this film is worth $1.25 at Redbox or a boring evening watch on cable."
    },
    {
      "rating": "5",
      "text": "In this heart pounding action-thriller, Kevin Costner is a dangerous international spy, who is determined to give up his high stakes life to finally build a closer relationship with his estranged wife and daughter, whom he's previously kept at arm's length to keep out of danger. But first, he must complete one last mission- even if it means juggling the two toughest assignments yet: hunting down the world's most ruthless terrorist and looking after his teenage daughter for the first time in ten years, while his wife is out of town. (c) Relativity"
    },
    {
      "rating": "5",
      "text": "The family drama and action doesn't blend well at all, but 3 Days to Kill soars due to Kevin Costner's fantastic performance and the level of entertainment it provides however implausible it is."
    },
    {
      "rating": "6",
      "text": "To call this a good movie is far from what is it, 3 Days to Kill is one of the just plain dumb movies of the year, it's so stupid but it's so entertaining at times. This is complete garbage and I shouldn't like it, yet at the same time I did end up enjoying it."
    },
    {
      "rating": "5",
      "text": "Even though Kevin Costner gives a great performance and there is some decently entertaining stuff here and there, the movie suffers from not knowing what it wants to be and generally just being a mess."
    },
    {
      "rating": "8",
      "text": "I liked the extended cut of this movie not the theatrical one. The extended is more of an R rated version than the PG-13 one. It has a harder edge to it. With that said the script by Adi Hasak is still terrible but this is the best movie McG has directed. Doesn't hurt that he used Luc Besson's crew. The cinematography by Thierry Arbogast, as always, is very good. The movie is fast paced and uses great locations in Paris. The cast is a mixed bag. Connie Nielson is completely wasted and Kevin Costner is miscast. The best performances are from Amber Heard and Hailee Steinfeld.  Best scene in the movie (extended cut) is courtesy of the hot twins Alizee & Ilyana Delaruelle"
    },
    {
      "rating": "5",
      "text": "Decent movie, a bit disappointed that it isn't the intense thriller the prior promotion was making it out to be. There is good action, but that is definitely balanced out by the monotony that fills the rest. I did enjoy this film, it's just not really something I'd watch again. A very average film."
    },
    {
      "rating": "4",
      "text": "How did 3 Days to Kill, which doesn’t have the worst imaginable premise, turn out this bad? The problem starts with the screenplay, co-credited to Adi Hasak and over-the-top action aficionado Luc Besson. Still, although the more serious aspects of the script, especially the cliché-riddled fractious father/daughter relationship, lack flair, the writing on the whole isn’t terrible. Besson in particular knows how to mix genres and never takes things too seriously. It’s pretty evident he intended 3 Days to Kill to be a comedy thriller. Unfortunately, single-moniker director McG (Charlie’s Angels) didn’t get the memo.\r Sure, there’s some wacky humor to be found in the final cut. The scenes featuring Amber Heard are weird enough to convey a sense of what Besson was likely going for. However, Kevin Costner is so somber and serious that he sucks out any sense of fun. Costner has made his share of comedies but it’s apparent he didn’t see this as one. Worse, the action scenes - which are pedestrian at best - are shunted off to the side to make room for one of the most tedious estranged father-wins-back-daughter’s-affection subplots ever to grace the silver screen. This material is awful. Costner and Hailee Steinfeld play the scenes like they were written by a great dramatist but every phrase they utter is hackneyed, there’s minimal chemistry between them, and nothing they do carries any emotional weight. It’s artificial, annoying, and boring. There’s not a single human moment in this film and any minimal momentum McG generates comes to a dead stop when these two are interacting.\r The storyline transpires in Besson’s alternate universe where cops are incompetent boobs who never do anything more than interfere on the periphery and the laws of physics are suspended when required by the plot. Costner plays Ethan Renner, a CIA lifer who is diagnosed with a form of inoperable brain cancer that causes him black out at inopportune moments (like when he’s about to bring down the bad guy). The doctors give him three months to live, so he quits his job and heads back to his home in Paris to reconnect with his estranged wife, Christine (Connie Nielsen), and daughter, Zoey (Steinfeld). The teenager is resentful of him (evident by her insistence in calling him “Ethan” instead of “Dad”) so, when Mom conveniently has to leave the country for a few days, Ethan offers to play babysitter. This leads to tender moments at an amusement park and an adorable scene in which Ethan teaches his daughter how to ride a bike. Gag.\r The CIA isn’t quite ready to let Ethan go. Top operative Vivi Delay (Amber Heard) needs his help to take out a couple of terrorist-types, The Albino (Tomas Lemarquis) and The Wolf (Richard Sammel). She offers him a deal: if he kills both of them, she’ll give him access to an experimental drug that will extend his life. Unfortunately for Ethan, the period when Vivi requires his cooperation coincides with the time when he’s chaperoning Zoey. Hilarity ensues. Not really.\r It’s easy enough to see the film’s comedic potential and just as easy to identify how badly it botches the opportunity. Just about the only thing McG gets right is the handling of Vivi. She’s a bizarre, off-the-wall character - a living monument to fetishes of all flavors. The PG-13 rating, which McG constantly pushes, is at its most restrictive when she’s around. One gets the sense that, given some latitude, McG might have gone full-R with this character. Heard is deliciously over-the-top and livens things up when she’s on screen. Unfortunately, that’s maybe 10-15 minutes. The rest of time, we’re stuck with a brooding, grizzled, unshaven Costner.\r The thing about 3 Days to Kill isn’t that every other line of dialogue sounds canned and every other action causes the viewer’s eyes to roll. It’s that the movie isn’t fun. And, more than anything else, Luc Besson stands for fun. Stupid fun, perhaps. Silly, violent fun, for sure. But fun. 3 Days to Kill is a slog. A chore. A tiresome 113 minutes in a theater that makes the idea of grouting the bathroom tiles seem preferable. After a number of years in relative obscurity, Costner has decided to re-emerge. Because I like and respect him, I’m glad to know he has several projects in the works. It’s just a shame this is one of them."
    },
    {
      "rating": "3",
      "text": "Luc Besson recruits McG and Kevin Costner for a fatally compromised tale of an American spy in Paris.\r The setup plays as if someone (presumably Besson, who is credited with the story and co-wrote the script with “From Paris With Love” scribe Adi Hasak) decided to graft the central father/daughter relationship from “The Descendants” onto a Eurotrashy action framework. Superstar CIA field agent Ethan Renner (Costner) spends so much time on the job that he’s completely missed watching his daughter, Zooey (Hailee Steinfeld), blossom into a sophisticated teenager. After he’s diagnosed with a fatal illness, Ethan retires and resolves to spend more time with his family in Paris, offering to watch Zooey for a weekend while his estranged wife, Christine (Connie Nielsen), is away. But retirement isn’t so easy for a man of Ethan’s skills, and he’s promptly recruited by the mysterious Vivi (Amber Heard), who needs his help in the hunt for a terrorist mastermind in exchange for experimental drugs that could give Ethan a second lease on life.\r The conflict between the finesse Ethan demonstrates in his professional duties and the complete incompetence with which he approaches parenting is meant to be comedic, although the film doesn’t have the light touch of similar spy-family action-laffers like “Mr. and Mrs. Smith,” “True Lies” or McG’s own “This Means War.” Instead, “3 Days to Kill” proves surprisingly po-faced about trying to build the bond between Ethan and Zooey, even in the midst of moments as goofy as Dad consoling his daughter on a bad hair day, teaching her to dance or buying her a purple bicycle just because that was her favorite color as a kid. The sentimental approach almost works, thanks to the best efforts of Costner and the naturally spunky Steinfeld, who may have made a respectable pair given better material to work with.\r As it is, the lukewarm family dynamics sit awkwardly alongside equally underwhelming action sequences. Recent supporting turns in “Man of Steel” and “Jack Ryan: Shadow Recruit” aside, Costner isn’t generally associated with the action genre — he’s more of a “Waterworld”/”Robin Hood: Prince of Thieves” epic-adventure guy — and the rote heroics he undertakes here won’t do much to change that. On multiple occasions, the audience simply witnesses the aftermath of Ethan’s handiwork as repped by bodies lying motionless on the floor. The notable exceptions arrive in a brief but slickly executed one-on-one skirmish in a grocery store’s deli section (complete with resourceful use of the meat grinder and panini press) and a bracingly staged car chase in the middle of a Parisian neighborhood inspired by Claude Lelouch’s “Rendezvous” and John Frankenheimer’s “Ronin.”\r That chase makes a lovely pairing with McG’s other standout sequence: a montage of Ethan riding the bike he bought for Zooey through the city streets and parking near the Eiffel Tower. It’s a sweet divertissement for the typically boisterous director, who overall reins in the bombastic giddiness of his “Charlie’s Angels” pictures and abandons the soulless spectacle of “Terminator: Salvation” to make an action film that’s downright restrained by his standards. Unfortunately, in this case the restraint reads as overly safe. “3 Days to Kill” is quite literally bloodless — the fight sequences in “Taken” packed a far more potent punch even with the same PG-13 rating — which seems like a missed opportunity. The juxtaposition of Ethan’s violent work and gentler paternal side might have added some desperately needed intrigue to the banal story.\r The filmmakers certainly don’t find any of the intended mystery in Ethan’s fitful encounters with the femme-fatale-ish Vivi, a severely under-realized character who never makes any sense despite Heard’s arduous efforts to vamp it up. Nielsen’s thankless skeptical spouse role is even less significant, while Tomas Lemarquis and Richard Sammel bring nothing beyond menacing visages to their bland terrorist baddies. It’s a running gag that Ethan seeks parenting advice from just about anyone he encounters, which offers decent moments for character actors Eriq Ebouaney as the African paterfamilias in a family squatting in Ethan’s semi-abandoned apartment, and Marc Andreoni as a Middle Eastern limo driver linked to the villains.\r Although the film’s tech package is reliably proficient, one would have hoped for more onscreen fireworks from the union of ultra-American McG and Costner with French mainstay Besson. Alas, this European vacation is a time-killer of the most mundane variety."
    },
    {
      "rating": "5",
      "text": "Costner is good in this but the convenient story telling and predictable plot makes this movie kind of fall apart."
    }
  ],
  "recommendations": [
    "the_commuter",
    "taken",
    "cold_pursuit",
    "the_equalizer",
    "the_mechanic",
    "no_escape",
    "run_all_night",
    "angel_has_fallen",
    "honest_thief",
    "the_ice_road",
    "jolt",
    "cellular",
    "white_house_down",
    "skyscraper",
    "taken_3",
    "the_accountant",
    "escape_plan",
    "2_guns",
    "unhinged",
    "the_november_man",
    "jack_ryan_shadow_recruit",
    "snitch",
    "live_by_night",
    "wild_card",
    "free_fire"
  ]
}