{"id": 3621, "title": "42", "starring": ["Chadwick Boseman", "Harrison Ford"], "runtime": 128, "genre": ["Drama"], "description": "The powerful story of Jackie Robinson, the legendary baseball player who broke Major League Baseball’s color barrier when he joined the roster of the Brooklyn Dodgers. The film follows the innovative Dodgers’ general manager Branch Rickey, the MLB executive who first signed Robinson to the minors and then helped to bring him up to the show.", "releaseYear": "2013", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/npWmmadYcEWKmCHS3prucSVJHjH.jpg", "categories": {"plot": 6.9655172413793105, "acting": 7.104166666666667, "ending": 6.714285714285714, "soundtrack": 5.0, "cinematography": 8.083333333333334, "familyFriendly": 6.0, "funny": 8.5, "action": 8.777777777777779}, "reviews": [{"rating": "7", "text": "It's extremely difficult to put Jackie Robinson's legacy into its proper perspective and for the most part 42 doesn't really try.  Instead it is content to be a glossy, feel good sports story.  If you can accept that, you'll find the film to be a genuinely entertaining and well acted biopic that tells an important story albeit in a less than urgent manner."}, {"rating": "9", "text": "When I was a kid, I liked baseball. Even when I got older and joined band, I still liked to watch to watch a good baseball game. I learned about Jackie Robinson in school once, but all I knw was that he was the first African American to play baseball. This movie tells you the whole story of how Jackie Robinson got to play baseball on the Dodgers. While there are a few flaws, this movie is a movie you want to see. 9/10."}, {"rating": "9", "text": "42 is an amazing movie that highlights not just Jackie Robinson's early uprising but also Robison's struggles against segregation and racism that destroyed America from the inside. The movie has intense baseball scenes (you may struggle to figure out whether it's an obvious scene or not from the scene's stiffness) which is tied with some plot related aspects. Though Chadwick Boseman created a colourful (no pun or poor taste in humour intended) and deep character, Harrison Ford steals the show with his persuasive exertion during some of the more tense scenes. Though the movie's setting doesn't really capture the late 1940's setting outside of the segregation laws and cruelty towards African Americans, 42 is a must see movie that will fulfil not just any MLB fan's desire to see a movie about baseball, segregation, and the upbringing of a talented man, but also for many movie fanatics ...\r(Minor Spoiler Warning)\rUnless you're a resident of Pittsburgh."}, {"rating": "3", "text": "42. The biopic of Jackie Robinson. The story, while inspirational, seems like that was all it was. Now, this isn't necessarily the fault of the Director and Writer or anybody else involved with making this movie, but biopics are always set up to fail, whether it be the greatest biopic ever made, or the worst. They're all set to fail. But only the strong survive. This, however, wasn't strong. Ignoring the fact that throughout the entire duration of this movie, I felt like I was watching a TV movie, the story was a generic fallacy, which only covered a part of the legacy Jackie Robinson left behind. To get with the times, you must remember that back when Jackie Robinson was just starting with the, then Brooklyn Dodgers in 1947, whites hated blacks. And if was a white sport, nobody wanted to do any business with blacks. Well, I get it. Those were the times, but it was the same ole generic response with the white folk is period movies like this, \"I hate blacks!\" or  N****** ruin everything!\" something of that tone. The tone of the movie felt bland and I wasn't emotionally invested into the movie as I should have. It was heavily corny at times, and wasn't as inspirational as the actual movie was. Disappointment was what I felt leaving that theater. Because a great, inspirational man's legacy was made a mockery of with this movie."}, {"rating": "10", "text": "The Bottom Line\rA too self-consciously inspiring rendition of Jackie Robinson's genuinely inspiring accomplishment of breaking baseball's color barrier.\r Chadwick Boseman and Harrison Ford provide engaging performances as Jackie Robinson and Brooklyn Dodgers general manager Branch Rickey in the Legendary/Warner Bros. drama about the man who broke MLB's color line. Pretty when it should be gritty and grandiosely noble instead of just telling it like it was, 42 needlessly trumps up but still can't entirely spoil one of the great American 20th century true-life stories, the breaking of major league baseball's color line by Jackie Robinson. Whether in the deep South or the streets of Brooklyn, life here looks spiffy and well-scrubbed enough to appear in a department store window, while the soaring musical accompaniment seems to be stamping all the protagonists' passports for immediate admission to that great ballpark in the sky. All the same, lead actors Chadwick Boseman and Harrison Ford cut through the artifice with engaging performances as Robinson and Brooklyn Dodgers general manager Branch Rickey, respectively, and audiences who don't know much about the first black man to play professional baseball will be suitably impressed. Hit-starved Warner Bros. should be able to stir moderately good attendance domestically, although foreign prospects, as always with baseball yarns, are slight. The key scene in 42, just as it was in the low-budget 1950 The Jackie Robinson Story, which starred the ballplayer himself, comes when Rickey, warning his prospect about the abuse that inevitably awaits him, demands to know if he's “got enough guts not to fight back” when provoked by other players or fans. Robinson was not the best player in the Negro Leagues, but he was reckoned to be the one who might best withstand the trial by fire posed by teammates who didn't want to play with him and a society that often wouldn't allow him to travel, eat or lodge with the rest of the team. Needing a manageable window through which to dramatize a sports breakthrough fraught with racial, social, political and attitudinal meaning, this pet project of writer-director Brian Helgeland and producer Thomas Tull zeroes in on the years 1945-47, concluding with Robinson's first year in the majors. Although there is quick mention of a sports career at UCLA (which, the film does not note, had the most integrated sports program of any school in the U.S. at the time) and a quick temper that earned him an Army court-martial, the 26-year-old member of the American Negro League Kansas City Monarchs seems like the picture of rectitude, a well-spoken young man with a lovely wife-to-be, Rachel (Nicole Beharie), and none of the wild traits of some of his teammates. As one of the last century's most inspiring and literally game-changing personal sagas, Jackie Robinson's life can hardly help but be stirring and will no doubt impress many younger viewers, some of whom may be completely unfamiliar with his story. It's just too bad that Helgeland can't go for broke and get his uniform as dirty as Jackie Robinson used to do."}, {"rating": "5", "text": "'42' is no 'Remember the Titans', an absolutely fantastic movie. I was hoping this one would be just as moving. But alas this film simply doesn't get it done because the story of Robinson is compelling. There really are only a couple of scenes that provide an insight into what Robinson was feeling. Overall the movie makes it seem as if Robinson is somewhat apathetic or at times even dismissive of his situation/importance and that his family was not affected much by the rampant racism of the time (which for the most part was heavily washed over in this film for some odd reason). I wish they would have focused more on the man and internal struggles of Robinson rather than the sport he played."}, {"rating": "8", "text": "“42”, as mosr of us know, were the numerals on the back of the uniform worn by Jackie Robinson, the first African-American to be signed to play on a major league baseball team. It is also the title of the film starring Chadwick Boseman and Harrison Ford  relating the story of this dynamic ball player from his start with the Kansas City Monarchs through the Montreal Royals until finally, in 1947, signing with the Brooklyn Dodgers and becoming its starting first baseman that season. This is a movie, unlike Django Unchained, which tells the plight, courage and fortitude of one member of a minority and what it took for him to succeed and to become a lone black player amidst major leagues 399 whites. The film, written and directed by Brian Helgeland (“Mystic River”, “Blood Work”, “A Knight’s Tale”) holds the viewer’s interest and attention for all of the 128 minutes of its running time and keeps us involved throughout. For this writer the film was especially meaningful for I lived in the Borough during the time  in which this all took place and, as a young boy, I watched from the Ebbett’s Field bleachers the players on the field as they interacted with this new entry into the ballgame. Jackie Robinson, a four star athlete from UCLA and a commissioned Army officer (court martialed for refusing to move to the back of a bus) was the perfect man to, at 26, enter upon the road to ending the bigotry that was, after all, so much a part of America’s favorite sport at the time. Just as we today cannot imagine women not being able to vote 100 years ago, so difficult is it for us to understand what racism was in the 50’s and how shameful a legacy it left. If there is any difficulty with the film, it is trying to depict its hero.as recognizable but without it being a trite impersonation. Mr. Boseman is not a Robinson look alike yet there are certain times, stances and camera shots that make his portrayal quite believable. Harrison Ford, as Branch Rickey, the managing partner of the group that owned the Dodgers, is a fine addition to the film. Never too overly sentimental, the film does have its “Hollywood moments” but they are few and far between. Suffice it to say that the women and non-baseball fans in the audience seemed to enjoy the film as  much or more than the rest of us. I give this film an 8 and recommend that it be seen by all who have a taste for history and/or a strong liking for baseball. More than anything else it is the story of adversity and how it was met head on by a strong willed and extraordinarily self-controlled individual. The story of this man and who he was can best be summarized by quoting the writer Bob Considine when he wrote “Jackie Robinson was a credit to his race….the human race.”"}, {"rating": "7", "text": "I grew up a Brooklyn Dodger fan. I saw Jackie Robinson play but had no idea about the trials and tribulations being the first black man in baseball. I just loved him as a ballplayer. I guess growing up in NYC, the melting pot of the world, we really didn't know about racism. As time went by I did come to understand the great sacrifices he made and the greatness of the man. He is so deserving of his number being retired. If memory serves me correctly Leo Durocher was suspended for being associated with known gamblers, not women? It was Gene Hermanski, not Pee Wee Reese, whom said all the Dodgers should wear number 42. And as inconceivable as it seems, it was Branch Rickey who said you should trade a ballplayer a year too soon rather than a year too late. He traded Jackie to the hated NY Giants in 1956 8 years after he broke the color barrier in 1948. And Jackie hated the NY Giants so much he retired rather than ever wear any other uniform but for his beloved Brooklyn Dodgers. Jackie then went to work for Chock Full Of Nuts Coffee and became an executive. His widow Rachel is one of the classiest ladies ever! I just wished they had delved more into Jackie & Rachel as people as I so admire both of them."}, {"rating": "9", "text": "No need to be a sport fan to enjoy this remarkable movie.  An excellent movie on many levels.  Good acting, action, story line, and even some comedy. The story was 57 years to finally come to light and right a terrible wrong.  Great family entertainment.  Harrison Ford may receive a Oscar nomination."}, {"rating": "10", "text": "This movie by far is the best movie I have ever seen this year and probably for the past few years. This should be an Oscar winning movie. Great acting all the way to the home plate. This is a must see movie. BTW, I'm a white male and very few movies bring me to tears but this one did more than once."}, {"rating": "8", "text": "Full disclosures: 1) I am not a baseball fan  2) I am not a Harrison Ford fan  3) I am not a ‘Hollywood biography’ fan and 4) because of the latter, I take ‘based on a true story’ with more than a grain of salt. Okay, now that I got that out of the way let me say GO SEE “42”!\r More than a baseball story this is about love between a man and woman, two men with tremendous courage  and how one man can make a difference. This is a story of  Jackie Robinson (Chadwick Boseman, in a breakout role) who became the first major league black baseball player. It is about a man, Branch Rickey (Harrison Ford) who picked Robinson to do just that and backed him all the way just as his wife, Rachel Robinson, (Nicole Beharie) did.\r Thanks to the screenwriter and director, Brian Helgeland, you are taken on a roller coaster ride of sweet moments, comedy and anger while cringing at some of the true language many whites used against blacks and why Robinson was the man Rickey picked because he knew the former had the guts not to fight back. He shows, in only one scene, how it ate at him. Besides the language Robinson was hit by baseballs, had his foot stomped on by an opposing player and wasn’t wanted by most of the other players on his team.\r Harrison Ford shows he is more than just a ‘pretty face’ or action star. He disappears into the role of the Brooklyn Dodgers general manager completely and shouldn’t be forgotten at award time. Boseman and Beharie have great chemistry between them and the former, as the baseball player, shows how he drove the other teams pitchers and catchers crazy as he ‘danced’ in between bases either by stealing them or catching the others so off guard they dropped the ball or threw it wrong. More important Boseman shows the intelligence of the man inside the player and what he faced.\r There is a big supporting cast without a weak link. One of the funniest scenes in a movie in a long time, which could have gone awry, is when pitcher Ralph Branca (Hamish Linklater) wants to know why Robinson won’t shower with the rest of the team and it dawns on him that what he is saying could be taken the wrong way. Christopher Meloni effective, as Leo Durocher, is out of the film too soon. Lucas Black as shortstop Pee Wee Reese as the first player to embrace Robinson on the field touches you just as the language and taunts yelled at Robinson in public by the manager Ben Chapman (Alan Tudyk) of another team will make you gasp and/or cringe. T. R. Knight is strong as Rickey’s assistant as is Andre Holland as Wendell Smith the first black sportswriter to be accepted in the SportswritersAssociation. John C. McGinley is Red Barber who is a legend, even today, as a radio announcer for the Dodgers.\r “42” takes place during 1945 to 1947. I was about 10 years old and don’t really remember all of this though I did root for the Yankees against the Dodgers.  This is a film that should be seen by all generations and especially the kids of today. Whether Jackie Robinson was as completely as ‘good’ a man as writer/director Helgeland makes him to be or the too pretty film isn’t as gritty in appearance as it should be one must realize that this is a ‘Hollywood biography’ but it will get you cheering and some will even applaud as the closing credits show what happened to most of the people pictured.\r THIS IS A MUST SEE FILM!"}, {"rating": "5", "text": "Schmaltzy baseball movie about a player enduring unbearable adversity to be much more than anyone could expect. Add to that the fact that it is true and you have a movie tailor made for me to love. So why didn't I? The easy answer is they white washed the story, and I think they did to a point. However this story was white washed long before it hit the big screen, and there is a valid reason for that. You will not find anyone in his family or that played with him that will not say that Robinson was not only a great ballplayer but a great person. A player who had every reason to fight, to be filled with venom, to give up. Robinson did none of these things even though no one would have blamed him if he did. That character prevails throughout 42 and is not the reason I would condemn this film.\r The problem with 42 is most of it does not feel authentic, although it does have some authentic moments. There are some scenes involving children that are especially problematic and will no doubt be greeted by most viewers with an eye roll. Robinson's teammates and wife are all painted with broad strokes and consequently we never get a realistic impression of their relationships. 42 also fails to give us a realistic look at racism. The racism either seems to be present in a character in its worst form or not there at all. It seems odd to use a word like nuance when talking about racism but I feel that is exactly what is missing from most of the conflict in 42.\r One relationship that 42 does well, and what saves it from being a total disaster  is Robinson and Rickey. Ford is great as Rickey and Boseman is no slouch as Robinson which doesn't hurt. Their relationship is the only one given a true arc and their scenes together are the best in the film by far. Listening to Rickey talk about the abhorrent situations that Robinson endured is a far more emotional experience then anything we get to see in other scenes. As depicted in the film Rickey seemed to understand the difference between having empathy for Robinson and having sympathy, where other characters did not. This made him and Robinson the driving force behind everything that felt authentic in 42.\r I would be remiss if I did not give some credit to John McGinley when talking about 42. He portrays Red Barber, the Dodgers announcer during this period, and is a true stand out in a very limited role. His voice and cadence were perfect and really added to my enjoyment of the baseball sequences.\r 42 is a flawed, but not fatally flawed film. It is a mixed bag that I think many people will really respond to. If your a baseball fan it is worth your time."}, {"rating": "4", "text": "This was a truly awkward movie. Before I get to the negatives, the color design of 42 was incredibly interesting. There was a certain dusty quality to the air that made the deep brooklyn dodger blue, and bright green grass absolutely gorgeous. It felt like it captured both the style of a dirtier, scrappier era of baseball, while also conveying the wonderful larger-than-life quality of Robinson.\r Now for the ugly truth. The script was the heart of the mess of 42. The film feels more like a set of connected events, than a story. It stays surface-level, merely focusing on the plot, as opposed to digging deeper and getting at the real man who faced real, terrible prejudice. While still staying surface-level, characters would openly converse about their deep troubles, which came across as fake. As did the entirety of Mr  Mrs Robinson's relationship, for some reason. Couple scenes that seemed misplaced, with campy dialogue, and you had a movie that felt lost. I mean, at the end of it, do we really feel like we know the story of Jackie Robinson? Who he was, or why he's an American Legend? Kind of...but not really.\r I think 42 is a surface-level retelling of Jackie Robinson's first 2 years in white baseball, that ultimately fails to structure itself in a way that feels fleshed out, and compelling. The lack of direction ultimately leads the film to feel pretty shallow, and easy to forget."}, {"rating": "3", "text": "Hey, you know that trap of cheesiness into which sports films usually fall?  Well 42 isn't in there because it is made out of cheese.  42 never left a lasting impression such as \"Yeah, I would certainly want to see that again\".  Instead, it's basically a high school play with no depth.  Granted, the actual baseball in the movie is done well, even though it constitutes a third of the movie overall.  The rest of it is Jackie and racism.  That's it.  Racism, racism, racism.  Yes, it was an issue at that time frame, but the movie beats the horse to death with another dead horse.  The characters seem to be cardboard cut outs of stereotypical 40s characters, complete with really REALLY cheesy dialogue.  I thought I tasted cheddar in my mouth as the little boy said \"Dear Lord, please let Jackie show what he can do\".  I couldn't get the taste out until I hit the restroom."}, {"rating": "7", "text": "A well put together film that takes a look at the great Jackie Robinson.  Chadwick Boseman gives a great performance and so doesn't Harrison Ford.  The film has a few flaws with character development, but overall the film captures the hate and cruelty along with one man's inspiring influence on the youth at that time."}, {"rating": "8", "text": "I honestly thought that it was going to be some boring biopic, but boy was I wrong. It was really an engaging and heart felt story on racism and being accepted. It also had some great acting, especially from Chadwick Boseman. He really gives an unexpectedly terrific performance. Plus the storytelling is great and keeps you interested. This is a great movie that helps kick off a year of potentially great movies. Overall, this is one great biopic of an American legend."}, {"rating": "10", "text": "A very inspiring film, which had me rooting for Jackie all along the course of the film. The producers made many characters that seemed human and that you could relate to, which I could for some of them. A perfect movie. 10/10"}, {"rating": "10", "text": "The state of foreign  and domestic terrorism we live in today doesn't  compare to what our friend's parents experienced not too long ago. This country was sickening and embarrassing. My heart was full, broken and full again throughout this movie. It will prove to be a lesson for generations to come."}, {"rating": "1", "text": "Everyone thinks this is a good baseball movie, but aside from the lead actor, there is nothing I like about this movie! Granted the story is about a great baseball player, the acting absolutely SUCKS! Not even Indiana Jones can save this horrible atrocity of a movie! Mind you, this is just what I got from the PREVIEWS! Don't even waste your $10 on this DVD! Glad I didn't purchase it, or I'd ask 4 my damn money back!"}, {"rating": "9", "text": "its an interesting drama about how people can the way things are. i really liked it, good actors and good storyline. it is incredible how things have changed in such a short period of time."}, {"rating": "8", "text": "First:  A great story, and told without sugar coating, and with simplicity.  Harrison Ford imitated Branch Rickey perfectly; his makeup crew deserves an Oscar. I’m not sure that a perfect imitation is also fine acting, but it worked.\r My one problem with it was its pace.  It often dragged and dragged, spending too much time and effort on simple matters.  The worst example:  I found the endless final home run rounding-the-bases in superslow motion to be embarrassingly trite, so ponderous that I found myself literally groaning aloud, thinking, \"I got it, I got it already.  When will this end?\"\r I have no idea what could have been included to fill the time.  If there is nothing more to say, just stop."}, {"rating": "6", "text": "A straight-up biopic, but if you like baseball, you'll enjoy it. African-American ballplayers had some harrowing experiences in the early years, and the way Robinson (and others, such as Hank Aaron) coped with the pressure is very moving."}, {"rating": "9", "text": "I've been waiting anxiously to see this film. Very well made and acted. My only complaint,  I would have liked to see a larger emphasis on the amazing baseball exploits of #42. As a latecomer to baseball fandom I recently invested the 1,140 minutes to watch Ken Burns masterpiece \"Baseball\". The theme of which is really the story of America as told through the prism of our national pastime.  Unless you're an aging Baby Boomer you likely don't have any memory of the type of overt racism that tainted our country up through the 1960's. Jackie Robinson and Branch Rickey are largely responsible for changing public attitudes that have brought us out of the dark days of Jim Crow. Maybe this film can usher in a fresh sentiment of tolerance between our increasingly divided country."}, {"rating": "9", "text": "\"42 is a mesmerizing, heartfelt and emotional film that highlights a true legend in his glory days, Its a roaring crowd pleaser. Played flawlessly by Chadwick Bosemen. 42 is one of the best Baseball films i have ever had the pleasure of seeing.\""}, {"rating": "6", "text": "Sure, this is the story of Jackie Robinson's signing with the Brooklyn Dodgers, but it's equal parts about the owner who fought for the deal, played by Harrison Ford. He turns himself into an overstuffed, gravelly character that's one of his best performances, but all of them are solid (Nicole Beharie, as Jackie's wife, is particularly captivating). With the exception an early scene, this film is relentlessly serious. Of course, the subject is serious, but some relief for contrast might have made the dramatic struggle more effective. It's earnest in it's efforts to be inspirational and sometimes succeeds. More often, you can see the wheels turning. The period art direction is attractive. Overall, it tells an important history lesson in a mildly absorbing way."}, {"rating": "7", "text": "There was a time when baseball films where the go-to sports films of Hollywood and there were plenty that were actually very good; Kevin Costner batted a couple in quick succession in the late 80’s with Bull Durham and Field of Dreams which coincided with John Sayles’ excellent historical take on the Chicago White Sox’s match-fixing scandal in Eight Men Out. In the 90’s, we also had the biopics with John Goodman as The Babe (Ruth) and Tommy Lee Jones as (Ty) Cobb. It was only a matter time then before we got the one of the sports biggest success stories in Jackie Robinson. Robinson was the first African-American player to play in the Major League but his journey and struggle was always less than smooth. Baseball, more often than not, transfers well to the screen and Brian Helgeland’s 42 is another that works well due to its impressive production design of the 1940’s and the actors’ commitment. Harrison Ford (taking on the lesser role of executive Branch Rickey) delivers a gleefully histrionic performance that he’s not often known for but it’s the late Chadwick Boseman who takes centre stage and embodies the remarkable Robinson with a strong central performance. Admittedly, it works it’s way through the plethora of sports cliche’s but it’s a film that’s about more than just the game itself. It’s a film about human rights and the triumph of the spirit to overcome such sickeningly racist obstacles that have no place in sport (or anywhere for that matter). Currently, the number 42 is the only number to be retired in the game and what better tribute to such a brave individual"}, {"rating": "8", "text": "Everyone knows that Jackie Robinson was the man who broke Major League Baseball's color barrier in 1947, but few know why he was the one that was chosen. Robinson wasn't the best black player out there, he wasn't even a superstar, what he was, was well educated and understood that people attacked him out of fear and ignorance. He never took it personally and knew fighting back would accomplish nothing, and against all odds, no matter what was thrown at him, Robinson was able to brush it off. In 42, he's portrayed by newcomer Chadwick Boseman, who wasn't just fantastic, but also gracious for the opportunity to portray a true American hero. I am a big Jackie Robinson fan and through everything I've seen, Boseman has given the most clear and accurate portrayal of the man to date. His co-star is Harrison Ford, playing the legendary Branch Ricky. Throughout his life, Ricky was outspoken against segregation and didn't just help in breaking baseball's color barrier, eight years later, he broke the Latino barrier as well. What I love about Harrison Ford is that he's so predictable, you know you will always get a tremendous performance out of him and that he will go to extreme lengths to be as real to the story as possible. This film was outstanding, from top to bottom, but my one knock on 42 is that it didn't go beyond the 1947 season. Robinson played for nine years after that and was a key member of the civil rights movement after baseball. I would have liked to have seen how in 1955, at age 36, he led the Dodgers to their only championship in Brooklyn, with an improbably steal of home against the Yankees. I also would have liked to have seen how he became the first black broadcaster, or how he marched with Dr. King in Washington. 42 is one of the clearest, most accurate depiction of two years in the life of Jackie Robinson, and while it was terrific, I would have like to have seen them take it a step further."}, {"rating": "7", "text": "42, based on the life of Jackie Robinson, still makes for a good story, even if you've heard it before. Although it is a good film, it likely won't be on the list of the year's best because after Harrison Ford, who delivers a great performance, there aren't any other worthy ones here."}, {"rating": "9", "text": "42 is one of the greatest true-life stories ever put onscreen, the story of Jackie Robinson, the African-American baseball player who helped pioneer the entrance of other blacks into participation in major sports. And this film really emphasizes the abuse and the struggle Jackie had to endure, with every  slur almost making you cringe, because here is represented one of the great American heroes. Chadwick Boseman really personifies the legend, and give Harrison Ford an Oscar for turning in one of his best performances in years."}, {"rating": "5", "text": "42 has a rushed beginning, sappy middle and a safe ending. The movie seem to focus too much on the negative impacts of the man, then what he accomplished. 42 takes the amazing story of an amazing man and turns it into a feel good TV movie."}, {"rating": "9", "text": "\"42\" like Spielberg's \"Lincoln,\" is more about a specific moment in a person's life than his entire life. In this case, this movie is about how Jackie Robinson broke the color barrier in professional baseball. The story is about persistence and keeping a cool head through all the torment and backlash of fighting for what you believe in. At the end of the day, it is a movie about overcoming adversity. A type of movie that I tend to favor and for some reason really attracted to and this film is no exception. It is fairly inspiring and a story worth telling.\r The writing in the film is strong and inspiring, but fairly on the surface. The script rarely goes deeper into the issue of racism, but the parts that do transcends the movie to another level. Inspiring speeches are filled in the script and really make you believe in the character and what they fought for. While the script can be a bit \"iffy,\" the direction is spot on. Director Brian Helgeland, who also wrote the script, put a lot of attention to capturing the era and highlighting the importance of what Jackie Robinson did. Baseball games are well shot and really gives a feel of being their and watching the game live. Even though we know how things play out, we are always guessing and hoping for things to come. The film is well shot and it also has a really nice look that really captures the era in which the movie is set.\r Actors do a great job of playing their respective historical character. Everyone one brings their \"A\" game. From the previews, I thought this would have been the movie that would have gotten Harrison Ford his second Oscar nomination, but sadly his performance doesn't reach greatness. However, he is still incredibly good and gives his best performance in years. The true star of this film is Jackie Robinson and just like him his actor is who really shines. Chadwick Boseman gives a great and reserved performance. We see his anger build in his eyes, but he never shows it on his face or body. It takes incredible skill to give such a compelling performance.\r Overall, \"42\" is a really good movie and the best film I've seen all year. The story, while a bit on the surface, is well told and inspiring. Directing, camera work, and look are all top notch and really capture the spirit, both good and bad, of an era. However, the true highlights of the film are the performances by the cast. They portray their characters well, but the star of the film is Chadwick, who owns every scene he is in. I give it 4.5/5, a crowd pleaser that has depth and important story to tell."}, {"rating": "5", "text": "The movie is harmless and never takes any risks or does anything memorable. It is a straightforward biopic that doesn't really dig deep into Jackie Robinson as a person."}, {"rating": "10", "text": "Sometimes a film gets everything right.  This film escapes every pitfall--easy inspirationalism, cheesy comic relief, melodrama.  Harrison Ford has made the transition from hero to codger successfully; Christopher Melloni is a perfect Durocher, and the leads are terrific.  I found it all irresistible."}, {"rating": "7", "text": "This was a good film considering it was a biopic of a sports figure. Not many movies are good in this genre-or even decent. Often contrived and/or the acting is too horrible to watch. This had some of both but not too much to make it unwatchable. Further, I learned things I didn't know about the man. However I think many of the things he probably he had to endure are not a part of this film."}, {"rating": "4", "text": "42 was ok, but nothing more. Chadwick Boseman did great as Jackie Robinson, but other than that, I think the acting left a lot to be desired as did the character development. Of course, Jackie should be the focus, but I didn't even know the names of some of the supporting characters until the end. In addition, the directing was not that great and did not feel like a feature film. However, despite those negatives, I did enjoy 42 and thought it was an interesting look at Robinson's struggles."}, {"rating": "8", "text": "I really enjoyed this movie.   Harrison Ford is wonderful as Richy and all actors do a very credible job.  I also learned a lot about Jackie Robinson and his life in baseball.   It was a very entertaining story.  Enjoy."}, {"rating": "9", "text": "This is a good movie. It teaches you a lot of lessons. For me as a half-African American this mobie taught me that you do not let racism put you do and corrupt your future plans. Also thaf you should not judged by the cor of your skin. I like  Jackie Robinson in the movie becaise I get to see how he struggled in that time frame just because of his race."}, {"rating": "7", "text": "I thought this would go to the top of the sports movies, but I have to say I was wrong. It`s great cause it`s a true story, but it lacked what other great sport movies have.I did like Harrison Ford, and the movie was good overall, but nothing great.I agree with people who say it had a TV movie feeling."}, {"rating": "8", "text": "Earnest, informative, and featuring Harrison Ford's best performance in years, Brian Helgeland's \"42\" succeeds as a noteworthy chronicle of the achievements of one of Baseball's biggest and best names."}, {"rating": "7", "text": "“42” is warm-hearted and a respectable film, but it doesn't enrich or heighten Jackie Robinson's legacy. Jackie Robinson is arguably the single most important sports figure of the 20th century. Robinson's story is historically extraordinary and utterly captivating. In sharing Robinson’s inspirational story, some risks could have been taken in the approach to film making as well. Regrettably, you can’t shake the feeling that writer/director Brian Helgeland is playing it safe, and not swinging for the fences.\r “42” tells the story of how Jackie Robinson broke the Major League color barrier in 1947, becoming the first black player to appear in a Major League baseball game since 1884. In 1946, Jackie Robinson (Chadwick Boseman) is a Negro League baseball player who never takes racism lying down. Branch Rickey (Harrison Ford) is a Major League team executive with a bold idea. Rickey recruits Robinson to break the unspoken color line as the first modern African American Major League baseball player. As both anticipate, this proves a pivotal challenge for Robinson and his family as they endure unrelenting racist hostility on and off the field, from player and fan alike. As Jackie struggles against his nature to endure such abuse without complaint, he finds allies and hope where he least expects it.\r The performances are generally solid and highly believable. For his first major theatrical role, Chadwick Boseman turns in an impressive performance, and quite possibly the highlight of the film. While Robinson's story is worthy of the utmost respect and admiration, Helgeland plainly illustrates that in film making even a great man's life can get a bit bland. “42” effectively tells of Robinson's year in the minors and his first season with the Brooklyn Dodgers, while not doing a very good job of capturing Robinson's personality. He's portrayed more as a historical icon than a fully developed character. “42” feels like an overly sincere history lesson more so than a biography, but it's a history lesson of which we regularly need to be reminded."}, {"rating": "4", "text": "Thanks to some absolutely poor writing by Brian Helgeland, 42 takes the amazing story of an amazing man and turns it into a feel-good made-for-tv movie. I wanted so badly to like this movie, but with Harrison Ford's seemingly forced acting as Branch Rickey as well as disconnected scene after disconnected scene we're left with a movie that feels rushed and doesn't entirely flesh out the incredible journey of Jackie Robinson to become one of the biggest icons in baseball as well as Civil Rights history.\r In fact, the only redeeming quality about this movie is the stellar, and perhaps even award-worthy, performance by Chadwick Boseman who, along with having an awesome name, gives us a compelling portrayal of Jackie and connects with the audience from the minute he first graces the screen.\r While I can't say I hated the movie, I can't recommend it either. The ending (spoiler free) was terrible and brought a sense that the director simply didn't have time to come up with something better which... considering this is based on a true story... is ridiculous.\r Furthermore, Helgeland apparently seems to forget the rules of the game which this movie is centered on when Jackie's home run against Pittsburgh is declared \"A walk-off winner\" for the Dodgers by their radio commentator even though they're the visiting team and would therefore be unable to win a game in walk-off fashion. It's little details like this that further take away from what could have been a truly great movie."}, {"rating": "7", "text": "42 really accurately represents Jackie Robinson's life and what he had to go through.\rWith amazing acting from all of the actors, especially Harrison Ford.  The acting is so amazing it really makes you hate the racist coaches and players and the movie ends up touching your heart.  although the movie can be slow at sometimes, when you're walking out of the theatre, you don't regret going a bit."}, {"rating": "8", "text": "Sports related movies can be terribly predictable  you know the type.    \"Win one for the Gipper\", worst team on the planet suddenly can beat the St. Louis Cardinals, etc. thanks to a star player who goes down right before the big game, ad nauseum.    \"42\" is a true story of triumph and the struggle for human dignity amid the pressures of hate and racism as Jackie Robinson faced as the first ever African American professional baseball player in 1947.    Chadwick Boseman turns in a fine performance as Robinson, but perhaps the most interesting role is that of Harrison Ford as the Brooklyn Dodgers' manager Branch Rickey.    Ford has typically been a wooden figure, showing little dexterity, but on \"42\" he actually manages to break out of that shell into a very likable warm personality.    I didn't think he had it in him.\rUnfortunately as inspiring as this tale is, racism still abounds, albeit a tad more discreetly.    One can only imagine the way black Americans felt in the Jim Crow years.    Even when the racist white people did little more than display their hatred and ignorance throughout that era, those hateful people still pass down their vitriol to younger kids.    \"42\" won't change many minds, but it does a good job of capturing how Robinson may have felt, in scenes like the Dodgers playing the Philadelphia Phillies only to have the Phillies manager hurl every racist name and cliche he can at Robinson whenever he (Robinson) comes up to bat.\rIt shows the true ugliness some whites had toward minorities, but also shows that minds could be changed.    Whether this is Oscar material is debatable, but there is no denying it's a damn good movie with a hopeful spirit throughout."}, {"rating": "8", "text": "Everyone should go see 42, baseball fan or not. Really a great movie and makes you understand how horrible segregation and racism was back then. Jackie Robinson is a true hero for what he did. He not only affected baseball, but probably affected other sports and the civil rights movement also."}, {"rating": "7", "text": "There can be a large gap between the ambition of a project and its execution. through history of art there have been marvelous flops, ideas and projects that were reaching out far beyond their grasp, attempting to achieve things they did not have the talent to achieve. There have been even more movies on the other end though, films that arn't trying to achieve anything that hasn't been done before, taking a well worn film tropes and formulas, and recreating it for success. The film 42 is undoubtedly a member of the latter.\r The story tells one that has been told before, the story of Jackie Robinson, moving from the Negro leagues in baseball, to be the first black to play in the NBL. The story is a predictable one, whether you know the story or not, or can see precisely where the story will go and when. There are no scenes that are at all original, every scene has been done in one sports movie or another, though \"42\" does have the benefit of being closely based on a true story, a story which so happens to follow the classic inspirational formula so close.\r Thebenefit that \"42\" has because it follows the formula so close, is that they have the story told for them. where \"42\" excels though, is that even though the story has been told before, none of the members of the cast or crew seem to be going through the motions. The people that are actually creating the film don't care that its a cliché story, they just want to show the inspirational story of Jackie Robinson. All the main actors are good in their roles, thought Harrison ford gravely voice and attitude go close to the cartoony side, it doesn't seem to matter when he seems so likable. Relative newcomer Chadwick Boseman as the films star, giving depth and layers to Jackie Robinson, showing him to be a character, instead of just a mcguffin, used only to allow African Americans to play in the NBL.\r overall. the movie is one that put more effort into it than it needed to. \"42\" could have been a bland story thats been told hundreds of times before. yet while the story is familiar and old fashioned, it at least puts into it the heart to make it a cut above the less dedicated films of its kind"}, {"rating": "7", "text": "42 tiene como objetivo ser una pelicula que ablande el corazon del publico mediante la interacción de la muestra de una epoca ya pasada (en el beisbol) y se hace ver buena dentro de su genero"}, {"rating": "9", "text": "I enjoyed it.  It stays true to the facts and doesn't try to go above and beyond by making things up to get cheers from \"critics.\"  A fan of baseball history will enjoy this.  Someone looking for a movie thrill may not.  It's not subject matter that needs be fluffed up like Remember the Titans was."}, {"rating": "7", "text": "\"42\" is almost a word by word scripted remake of the 1950 film featuring Jackie Robinson named \"The Jackie Robinson Story\".   This said, I enjoyed this effort as the two main leads give good performances and the film is uplifting and provides some history about the culture of the time that many young people may not be informed on.  As far as coming out knowing more about Jackie the man and his life and his endeavors outside the baseball field well you won't get much if anything of that from this feel good kind of film."}, {"rating": "10", "text": "This movie is amazing I'm British who loves baseball more than football so no doubt I planned to watch this movie and I got to say it is amazing I can't say any more go watch this movie"}, {"rating": "9", "text": "I father, I Brooklyn Dodger them...I Jack/ I Rob/ I sin...Ah man, I'm Jackie Robinson...'cept when I run base, I dodge the pen!\r I think baseball is boring...and I loved 42!"}], "recommendations": ["fighting_with_my_family", "hidden_figures", "raging_bull", "invictus", "race", "judas_and_the_black_messiah", "the_fighter", "moneyball", "green_book", "donnie_brasco", "eddie_the_eagle", "gold", "only_the_brave", "a_bronx_tale", "rush", "straight_outta_compton", "boyz_n_the_hood", "darkest_hour", "news_of_the_world", "wall_street", "the_post", "the_last_samurai", "american_made", "spotlight", "creed"]}