{"id": 2827, "title": "47 Meters Down", "starring": ["Mandy Moore", "Claire Holt"], "runtime": 89, "genre": ["Horror", "Drama", "Thriller", "Adventure"], "description": "Two sisters on Mexican vacation are trapped in a shark observation cage at the bottom of the ocean, with oxygen running low and great whites circling nearby, they have less than an hour of air left to figure out how to get to the surface.", "releaseYear": "2017", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/lMcsEOcd6crzfF0pjsGkO5Pq01t.jpg", "categories": {"plot": 4.833333333333333, "acting": 5.368421052631579, "ending": 6.5625, "soundtrack": 6.0, "cinematography": 5.0, "familyFriendly": 5.9, "funny": 8.0, "action": 6.222222222222222}, "reviews": [{"rating": "3", "text": "Very boring story about diving in a cage. Painful repeating scheme, very few sharks and most important thing - acting is tragic. Hot it is possible to create movie with shark on poster and show this creature for several seconds? In plot there is no logic or drama."}, {"rating": "3", "text": "\"I should have know better\", Is what I kept repeating to myself while leaving the cinema. It seems to me that this was clearly a rushed project from the casting of sub-par actors to the bland repetitive writing. The most bothersome attribute would probably be the protagonists arch. Not specifically because of Mandy Moore, but because of the way her character never overcame her fear. The one scene that showed some minor redemption to this problem turned out to be a finger to the face in the worst kind of way. That was incredibly disappointing.Another problem that I have been noticing more and more throughout a variety of films is the carelessness of death scenes. This film is no exception! Not to say that death isn't quick in real life, but there is no meaning behind the death, there is no sacrifice for the greater good. Its just there, and its just plain awful. This could be traced back to weak characters, but I would like to think that I can even feel bad for poorly written characters if their deaths are handled properly. The last major problem for me was the unrealistic, or greatly exaggerated physics and science of the movie. These story flaws really took away from any emotion that could have been pulled out of the scenes.(Spoiler Warning)One positive thing about the movie was that the sister did in fact die. They didn't try to bring her back in some stupid half baked way, they actually let a character die. So props for that.Also, the sister bond between the two leads seems real enough.To sum up the tsunami sized mess:If you get your hopes high for this movie, be prepared for them to drop down deep."}, {"rating": "5", "text": "Meh. Started off meh. Shark stuff was exciting I guess. Ending was bad. It’s not a bad movie, but it certainly isn’t Jaws. Rating - 56%"}, {"rating": "8", "text": "The only thing that ruined this movie for me was the ending, but other than that fun, scary, and exciting. Great acting and great CGI. The film is the second best shark film I have ever seen, behind the Shallows. They are making a sequel called 48 Meters Down. I am not joking either."}, {"rating": "3", "text": "And the award for stupidest sharks in a motion picture goes to all the sharks that appeared in 47 Meters Down. Congratulations guys I’m sure it wasn’t easy but no one deserves this more than you. Sure I wasn’t expecting much but a little entertainment would have been nice. What’s annoying about this is it was so close to being a decent shark movie, it went for it and failed.Girls go in the cage, cage goes in the water, sharks in the water. The two main characters are so mind numbingly irritating you’re left rooting for them to be eaten. Unlikable characters doing absolutely everything wrong never works. Particularly in a so called horror movie. From the opening scene with girl one (whose name I forget) crying over her boyfriend dumping her for being too boring, to her sister convincing her to go cage diving with sharks so he won’t think she’s so boring this movie never stood a chance. To sum up, it’s paranormal activity underwater. Recommended if you enjoy bad shark movies for everyone else skip it."}, {"rating": "4", "text": "If you are bored at home and it is hot as hell outside, you could do worse than spending the afternoon in a cool movie theater watching two women in a dumb situation in a cage surrounded by sharks (although not enough sharks for my taste). Yes, we all knew they would get stranded and cut themselves so the sharks would smell blood. Still this is a nice enough way to spend a blistering hot afternoon if you shut your brain off. I wasn’t bored, and the water looked so nice and cool."}, {"rating": "7", "text": "Better and more effective than expected, this is a much better idea and more realistic than last year's \"The Shallows\" despite it being a seemingly lower budget production.  It only suffers from the kind of contrivances necessary to pad to feature length for this kind of confined survival thriller."}, {"rating": "9", "text": "This impressed me a lot.  I enjoyed it even more than last year's The Shallows.  It does what it sets out to do extremely well:  place its two protagonists (both sympathetic and convincing) in underwater peril and generate considerable suspense via which-way-is-up disorientation, almost-out-of-time maneuvers in tight spaces, and the circling specter of sharks.  It drew me in in a crisp, straightforward, edge-of-your-seat way, even earning a surprising degree of emotional investment by the end, and the underwater photography is frequently gorgeous.  So glad this was saved from a direct-to-video fate at the hands of Bob and Harvey Weinstein."}, {"rating": "6", "text": "Two sisters (Mandy Moore & Claire Holt) decide to have an underwater adventure on their Mexican vacation. In the safety of a cage, they're submerged to marvel at sharks swimming around them. Of course, everything goes wrong and they spend the rest of the movie trying to stay alive. The plight is presented with workmanlike skill, maintaining interest and quiet apprehension without much real tension. There is one good jump scare, but the attack sequences are often a confusing blur and the twist ending is disappointingly dumb."}, {"rating": "3", "text": "Altbekannter Stoff nochmals aufgelegt. Und dazu noch schlechte Schauspielerinnen. Fertig ist der schlechte Film. ------------------------------------------Well-known material again in the mood. And in addition still bad actresses. The bad film is ready."}, {"rating": "7", "text": "Watching this movie I was screaming, gasping for air, covering my eyes and going through all kinds of anxiety as one who is not comfortable under water.  You probably already know that two sisters vacationing in Mexico are convinced to go down in a shark cage.  One sister, Kate (Claire Holt) goes willingly, but older sister Lisa (Mandy Moore) has to be taken kicking and screaming.  Things go terribly wrong when their shark cage cable breaks and they end up on the ocean floor.  It then becomes a terrible case of Murphy's Law - whatever can go wrong, does!  So many things go wrong!  I really \"enjoyed\" this movie, if that is what you call it when you are screaming and hyperventilating.  However, the movie pulls a fast one on the audience (I won't tell you what it is) and I found myself - and probably others - shouting, \"Are you kidding me!!??\"  Anyway, apart from that, I give it good marks.  You will likely hear people screaming throughout, if you are not screaming yourself!"}, {"rating": "2", "text": "Having grown up in Hawaii if there is a film that takes place below sea-level I'm in. This movie had me scrambling out of the ocean as quickly as I could, but not because of the sharks. If you're the kind of person who enjoys straight-to SY-FY channel flicks then go ahead and make some toast, this will be your jam. The rest of us will stick to peanut butter and attempting to avoid B-movies that try to sneak in the theaters with A-list actresses."}, {"rating": "5", "text": "47 meters down was a very exciting movie. Many parts made me jump, but I still have to rate it a 6. I rate this movie a 6 because I, and many other were not satisfied with the ending. I personally feel that the escape needed more action. After the movie I was disappointed. Besides the ending the movie was great. It is not only thrilling but it teaches a great lesson about trusting strangers."}, {"rating": "10", "text": "Απ'την αρχή μέχρι το τέλος η ταινία με έβαλε σε αγωνία και η κλειστοφοβική ατμόσφαιρα μου δημιούργησε άγχος σε κάποιες στιγμές!Γενικά την απόλαυσα σε πολύ μεγάλο βαθμό και είναι απ'τις πιο αγωνιώδεις ταινίες που είδα τελευταία!"}, {"rating": "0", "text": "полнейший калл никому не советую смотреть, просто просрёте несколько часов жизни"}, {"rating": "2", "text": "I literally get everyone is getting so excited for a film about sharks, but when sharks come to play, that's where I unfortunately take the spotlight. Unfortunately, as a result of rehashing sharks in a shark movie without giving them a new identity, 47 Meters Down fells very passed out and forgettable by other movies released on the same day as this movie."}, {"rating": "7", "text": "Very suspenseful film with the underwater sequences that made for a very eery claustrophobic feel. Characters were pretty unforgettable, but that's not a concern as this film was meant to be a thrill ride to took place in a small environment."}, {"rating": "8", "text": "It's definitely worth going to the movie theatre to watch because it gives you the whole experience like you are actually there underwater as well. I actually felt like I couldn't breathe during some parts of the movie. Great movie from beginning to end, and it has a good title as well because just by the title you know what type of movie you are gonna watch. Definitely an upgrade of the shark movies and one of the best ones yet. I give it an 8 out of 10. And I give the effects and realness of the movie a 9 out of 10. I give the ending an 8 as well."}, {"rating": "6", "text": "Solid premise but could have been executed better. The thing this film does really well, like most shark movies is establish tension and does a good job keeping you invested throughout the film. Where the movie falters is that its story is jumbled and its let down further by plot holes. I feel like this movie could have benefited from stronger direction and a hard \"R\" rating. Shark movies can be tough to make so it was interesting to see this sort of premise but it could have been alot better had it been rated R."}, {"rating": "5", "text": "I love shark movies, but this was a very average movie. I had a sinking feeling when the movie started and I noticed it was just B-list actors and an unknown director. I held a glimmer of hope seeing that the Weinstein brothers were one of the producers. Alas, it was not meant to be. The problem with this movie was that there weren't enough sharks. Not nearly enough shark vs. human action. Last summers The Shallows was so much better than this movie, because well, Blake Lively in a swimsuit vs. a shark. Who wouldn't like that?"}, {"rating": "8", "text": "Watch 47 Meters Down Full Movie - Online Free [ HD ] Streaming http://qn.telemovie.pw/movie/403119/47-meters-down.html47 Meters Down () - Claire Holt Dimension Films Movie HDGenre : Thriller, HorrorStars : Claire Holt, Mandy Moore, Matthew Modine, Santiago Segura, Yani Gellman, Chris J. JohnsonRelease : 2017-06-15Runtime : 89 min.Movie Synopsis :Two sisters on Mexican vacation are trapped in a shark observation cage at the bottom of the ocean, with oxygen running low and great whites circling nearby, they have less than an hour of air left to figure out how to get to the surface."}, {"rating": "7", "text": "I was really excited to watch this movie but now I am disappointed. I thought it was gonna be another great shark movie but... it was....... descent give it a 7/10"}, {"rating": "4", "text": "it had some scary moments so i give it an extra star but to be honest the girls were so annoying saying oh my God every 2 seconds that i wanted the sharks to eat them and get it over with."}, {"rating": "6", "text": "Not a bad movie. The ending though.....And they could have, Spiced up the project much bettter. This is a low budget film. So they probably made quite a lot from it. Just wish the shark scenes could have been more.... Terrifying? Also would have been great to see the survivor tell her ex boyfriend..F You!! (smile)"}, {"rating": "6", "text": "While \"47 Meters Down\" is hampered by its PG-13 rating, the film entertains as well as surprises with an ingenious final twist."}, {"rating": "6", "text": "While the CGI sharks look pretty good and the acting performances are decent, the rest is very average. From the predictability of the plot to the stupid character decisions and the unbelievability of the sharks' behavior, it's a mixed bag. While it is an entertaining movie, don't expect too much out of it."}, {"rating": "8", "text": "47 Meters Down is about Lisa is going through a breakup because she is boring WHAT!!!!!!!! so they go to see Great White Sharks in a cage while the line snaps and they are 47 Meters Down to me this movie is fun to watch for the shark stuff in it but for the characters don't even bother also this movie has a horrible ending the other ending would of work better than having what they did so right around the ending Lisa is hallucinating thinking that kate lived which is better than having when the hallucinating ends she just gets rescued wow so fun not really tho the only reason why I have enjoyed this movie since it came out because was of Claire Holt and Mandy Moore that is it so this movie is uninteresting but is fun to me if u just want to see sharks so I give 47 Meters Down a C-"}, {"rating": "8", "text": "While far from Jaws, 47 Meters Down manages to be one of the more frightening shark films out there thanks to it's tense scenario and uncomfortably murky waters. Unlike a lot of shark films, the majority of the action takes place under the water. The protagonists aren't on a boat (Jaws), floating stranded at surface level (Open Water), or stuck on some rock (The Shallows). They're down deep and with limited visibility. Both concepts are used well, particularly the latter. Kudos to the film for coming up with a reason why these girls can't just book it back to the surface as well. The thing that's going to be the hardest for most people to deal with is the how the characters are handled. The acting from our leads is fine, but the movie falls prey to the old horror trope of barely fleshing them out before hand. It does more than most, but it's still only gives them a little bit of life and backstory before throwing them into the water. We learn that one of them has some boyfriend issues and that's all there is. It's not enough to make viewers truly care about the people at risk. To genuinely give a crap whether or not they make it out alive. Still, it's kind of easy to look past that stuff. Shark movies are about the thrills after all. That's their big appeal. 47 Meters Down has them in spades. The characters race against an ever-dwindling air supply, surprise shark attacks that they literally cannot see coming, and being forced to leave the relative safety of their cage to grab supplies and contact help. It manages to do all of that without ever feeling stupid. Now, I'm sure some suspension of disbelief is going to be required, but unlike so many other films of this nature the people in the most danger actually seem competent given how it is all new territory for them. They're two unprepared people doing the best they can in an entirely unfamiliar scenario. As a result it kept me thoroughly engaged and on the edge of my seat.8.5/10"}, {"rating": "7", "text": "6.8/10  A solid shark thriller with some genuinely well executed suspenseful sequences and a somewhat ambitious ending. The cgi sharks i thought looked very well and were utilized properly. At times Moore and Holt are extremely cliche and annoying but honestly thats the main downfall and this is quite underrated."}, {"rating": "6", "text": "Let the surviving game begin in the deep and the cold ocean floor, surrounded by dangers!Obviously it is this year's 'The Shallows'. So anther shark attack film, but this time it goes down to the Mexico. Two sisters vacationing somewhere on the coast of the Mexico, decides to go cage diving to see sharks with the locals they have met in the pub. It was intentional tale, so it all goes straight to the point without wasting much time. When their turn comes to go below in the sea, something goes wrong and they end up 47 meters down on the ocean floor with the limited oxygen supply. It's a long way up and dangerous to get to the surface without proper gears. Their struggles to get out of from there safely and other adventurous events covered in the remaining film.From the not so famous filmmaker and the actors. But it's good to see Mandy Moore after a some time. I don't know how much realistic it is, though a decent thriller. Yeah, there are better films on this similar theme, but still this is enjoyable, especially if you are not a regular film goer. There are some fine edgy moments, but it did not maintain that till the last. The end twist was not bad. I truly did not expect that. That does not mean it was awesome. It was okay, works decently for such random films. Well made with production quality. Short runtime as well. So I think it is slightly better than what it has been rated. That means not bad for watching it once.6/10"}, {"rating": "8", "text": "Extraordinarily tense, even if the sharks seem a tad overdetermined and the humans more than a mite lucky at times. Fantastic ending though, and an absolute must-see for all fans of giant shark movies."}, {"rating": "6", "text": "47 Meters Down works on the old idea of great white sharks scaring a bunch of people (two sisters, in this case) but there's a bit of novelty (it takes place on an ocean bed) that makes the watch an enjoyable ride. While the dialogues - which seemed like they were just being spoken to help the audience understand the situation of the girls better - seemed inauthentic, everything else is pretty good here. A cool late-night watch with the family. TN."}, {"rating": "3", "text": "Weak CGI. Plot is patchy and unrealistic but credit where it is due, the use of tension is reasonably good."}, {"rating": "3", "text": "Deux jolies greluches (surtout la blondinette, elle est… à croquer !) font du tourisme dans une cage et prennent des selfies avec un requin ; puis, la cage fait glouglou jusqu’au fond 47 mètres plus bas… c’est ballot !Le requin alléché rôde, surtout qu’il a un peu la dalle, un petit peu quand même alors que nos deux morues font des pieds et des mains : l’oxygène va manquer, tôt ou tard ! à partir de ça, le film aurait pu se développer dans plusieurs directions, exploiter quelques filons, quitte à sombrer dans les poncifs mais préfère s’égarer dans de multiples et flagrantes incohérences tout au long de son métrage (heureusement pas trop long).On ne s’ennuie donc pas et l’ambiance reste évidemment oppressante et claustrophobique dans cette partie de cache-cache aux effets spéciaux tout à fait satisfaisants… Mais la réalisation qui passe son temps à zoomer et sur-zoomer sur la moindre action ou sur les visages des deux femmes au bord de la crise de nerfs (c’est vrai qu’elles sont vraiment jolies, ces comédiennes) ça fout bien le film en l’air.La fin ou plutôt la phase finale tombe carrément à l’eau et le grand n’importe quoi et achève de précipiter ce nanar au fond des abysses alors qu’il avait déjà du mal à remonter la pente, le pauvre !"}, {"rating": "6", "text": "Nur um ihren Ex-Boyfriend zu beeindrucken, geht Lisa (Mandy Moore) zusammen mit ihrer Schwester in Mexiko mit zwielichtigen Aufreißern Haikäfigtauchen. Da soviel Blödheit einfach bestraft werden muss, reißt das mickrige Seil binnen Minuten und man sackt genau 47 Meters Down bis auf den Grund. Unten warten neben Panik, Sauerstoffmangel und Tiefenrausch gleich mehrere Große Weiße – die offenbar Riesenappetit auf dumme Touristen haben. Ist die erste halbe Stunde Hohlkopfgelaber erst einmal überstanden, wird 47 Meters Down zwar nicht schlauer, dafür ungleich spannender: Klug kontrastiert Regisseur Johannes Roberts die unendliche Weite des Meeres und die Enge des Käfigs und schafft so ein beklemmendes Setting. Ständig erwartet man eine Attacke aus dem Blau – die nur selten kommt aber umso mehr knallt. Obendrein bleibt die Kamera stets bei den Figuren – ob von oben wirklich Hilfe kommt, ist also so unklar wie die Sicht. So unterhält 47 Meters Down trotz Logikfehlern fast genauso spielend wie der kürzliche The Shallows."}, {"rating": "3", "text": "A predictable, bland, but perfectly watchable summer B- movie.    ."}, {"rating": "6", "text": "Decent to say the least, nothing too extraordinary. Sort of cliche in my opinion."}, {"rating": "10", "text": "C’est l’un des meilleurs films de requins que j’ai vu! Je le trouve super anguoissant et la fin est juste parfaite !"}, {"rating": "8", "text": "Vale definitivamente a pena ver este filme, porque dá-te a verdadeira sensação de estares preso debaixo d'água. Em algumas cenas, senti que não conseguia respirar. Bom filme do início ao fim, se bem que a película não acabou exatamente como eu gostaria que tivesse acabado."}, {"rating": "8", "text": "\"47 Meters Down\" vale definitivamente a pena ver. Bom filme do início ao fim, se bem que não acabou exatamente como eu gostaria.8/10"}, {"rating": "7", "text": "Though this was no Jaws I thought it was a good movie for those who like shark films"}, {"rating": "2", "text": "Characters are literally the dumbest **** pieces of **** They haven't made a single rational decision throughout the entire film. It's honestly painful to watch them with their screeching voice and their neanderthaler brain. I wish they would get eaten by one of these obviously CGI sharks."}, {"rating": "6", "text": "47 Meters Down is a suspenseful thriller about two sisters, Lisa and Kate, who are trapped in a shark cage that has plummeted to the depths of the ocean. The sisters, who are vacationing in Mexico, are confronted with the terrifying reality of being surrounded by large, flesh-eating sharks while their oxygen levels rapidly decline. The movie uses close-ups and the darkness of the ocean to create a sense of claustrophobia and tension. The visuals and music are effectively used to create a sense of dread. The performances by Moore and Holt are solid, but the script is not particularly strong. The relationship between the sisters is cliche and the story has been done before. The movie relies heavily on its visuals, but if the script had been stronger, it would have been more successful. Overall, 47 Meters Down is a thrilling B-movie that effectively uses visuals to create a sense of suspense and danger in the deep sea.____________________47 Meters Down es un thriller de suspenso sobre dos hermanas, Lisa y Kate, que están atrapadas en una jaula de tiburones que ha caído en picado a las profundidades del océano. Las hermanas, que están de vacaciones en México, se enfrentan a la aterradora realidad de estar rodeadas de grandes tiburones carnívoros mientras sus niveles de oxígeno disminuyen rápidamente. La película utiliza primeros planos y la oscuridad del océano para crear una sensación de claustrofobia y tensión. Las imágenes y la música se utilizan de manera efectiva para crear una sensación de pavor. Las actuaciones de Moore y Holt son sólidas, pero el guión no es particularmente fuerte. La relación entre las hermanas es un cliché y la historia se ha hecho antes. La película se basa en gran medida en sus imágenes, pero si el guión hubiera sido más sólido, habría tenido más éxito. En general, 47 Meters Down es una emocionante película de serie B que utiliza imágenes de manera efectiva para crear una sensación de suspenso y peligro en las profundidades del mar."}], "recommendations": ["the_shallows", "crawl", "frozen", "the_meg", "jurassic_world_fallen_kingdom", "doomsday", "would_you_rather", "28_weeks_later", "sanctum", "final_destination_3", "paranormal_activity_2", "escape_room", "into_the_storm", "the_strangers_prey_at_night", "mama", "bird_box", "transformers_age_of_extinction", "unhinged", "war_of_the_worlds", "devil", "chernobyl_diaries", "blood_red_sky", "the_grey", "ghost_rider_spirit_of_vengeance", "mirrors"]}