{"id": 2326, "title": "50 First Dates", "starring": ["Adam Sandler", "Drew Barrymore"], "runtime": 99, "genre": ["Comedy", "Romance"], "description": "Henry is a player skilled at seducing women. But when this veterinarian meets Lucy, a girl with a quirky problem when it comes to total recall, he realizes it's possible to fall in love all over again…and again, and again. That's because the delightful Lucy has no short-term memory, so Henry must woo her day after day until he finally sweeps her off her feet.", "releaseYear": "2004", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/5NxTW4SS6aUKZYnbQzh7UYNivd.jpg", "categories": {"plot": 7.5, "acting": 7.222222222222222, "ending": 5.0, "soundtrack": 7.666666666666667, "cinematography": 7.0, "familyFriendly": 6.0, "funny": 6.916666666666667, "action": 5.0}, "reviews": [{"rating": "4", "text": "\"50 First Dates\" é um filme medíocre. A história não é muito interessante e muitas cenas não foram bem produzidas. Adam Sandler e Drew Barrymor revelaram-se más escolhas para este tipo de filme.4/10"}, {"rating": "8", "text": "A very good Adam Sandler film. Some of the scenes in the resturant are absolutelyy hilarious. Story doesn't make sense but who cares. It comes across as an enjoyable film that is very funny."}, {"rating": "9", "text": "Hilarious and romantic, Adam Sandler at his best, starts off slow but then ramps up to be not only a totally funny movie, but also a sweet and touching one. This makes it into my top 3 favorite Sandler movies of all time. If you haven't watched it I highly recommend that you do."}, {"rating": "0", "text": "Sandler usually makes stupid movies but every now and then hits the bulls-eye with a hilarious movie, unfortunately this is not the case, it's very bad story. Sandler being a Casanova thing!! really? and honestly the best thing that Drew Barrymore has ever done it's to appear in E.T. Far more better things to watch!"}, {"rating": "4", "text": "So this is the second bad movie set in Hawaii to be released in the last couple of weeks. (see \"Big Bounce\") I love Hawaii, but why do all the crappy screenplays have to be set there? Because the writing itself is so godawful, I suppose it needs a little support from the setting. The movie means well, the plot is clever, and and the acting is by and large pretty good (Sean Astin is hilarious - but is this what a hobbit does when he loses the weird-looking feet?), but so many scenes end with an awkward swing-and-miss THUD that you wonder if the writer wasn't beamed back by the Mars lander. Absolutely no sense of comic timing. And although Rob Schneider was great, I have a feeling that Hawaiians aren't going to be too happy with his character. (And people thought that \"Lost and Translation\" was racist!) This sucker pulls out every bad pacific islander stereotype in the book. I felt a little embarrassed for him. The bottom line is that if you like \"Wedding Singer\", you'll still like the chemistry between Sandler and Barrymore. You'll just wish it came in a better movie."}, {"rating": "10", "text": "This movie is the bomb. i love this movie. it is so awesome how he continually tries to win her heart everyday. if a guy did that for me i would definetly give him a shot. i think this movie definetly should be watched by everyone. if you dont like this movie then you have no taste in movies what so ever. peace homedogs"}, {"rating": "10", "text": "By Far Sandler's Best!!!!"}, {"rating": "8", "text": "I love this movie. It is not my favorite but I like it. My favorite movie is Abduction! Having read some of the bad reviews you can just tell that they are just thinking about themselves way to much. If you go to the Abduction page I wrote about how people alway think about them selves and not how it might affend others. I hate that about others. Be possitive you know. Well anyway I do love this movie. It is not a ten but it is a eight. Haha. Lol. Ok. Well I better go."}, {"rating": "6", "text": "Not Adam Sandlers worst movie ever but still below average and easily forgettable. For once Rob Schneider made me laugh (the impossible has been done)! But it was only because of how fat his wife was and how many kids they had. 50 First Dates is a very mediocre movie which most will not enjoy even if the ending is pretty good."}, {"rating": "8", "text": "I liked it ok. It was pretty funny."}, {"rating": "8", "text": "I usually hate these chick flick hollywood films but this one is sweet,funny and well acted.Ok not a classic but enjoyable. I usually hate these chick flick hollywood but... He..He."}, {"rating": "10", "text": "Not a great movie, but a hilarious one with heart too - just what a romantic comedy is supposed to be. The movie engages the viewer and holds on until the end. It keeps the jokes coming consistently throughout and unlike other Sandler movies the plot doesn't suffer from excessive cheesiness. By the way, it's better than Groundhog Day."}, {"rating": "10", "text": "One of my favorite movies. Having read some of the negative reviews, it is clear that the critics responsible for those reviews take themselves way too seriously. Unfortunately, they don't have the intelligence to pull it off. Enjoy the movie."}, {"rating": "10", "text": "Very funny and has a nice love story to it."}, {"rating": "9", "text": "If you want to spot the pretentious snob reviewers (professional and amateur) who take themselves and life too seriously, then look for anyone who rated this movie less than a 60 or 6. Only a limited and narrow mind would dismiss this movie because of its occasionally crude humor. Overall it delivers lots of laughs, an Inventive premise and very little cheese, which is unusual for a PG-13 romantic comedy. One of Sandler's better efforts, right up there with Happy Gilmore and The Wedding Singer."}, {"rating": "8", "text": "Surprisingly it manages to be a cute and funny romantic comedy.I would recommend this movie. Not Adam Sandlers best but still funny. If you're looking for Billy Madison or Happy Gilmore then this is ot even close to them. It is a more mature movie."}, {"rating": "6", "text": "I think this is another movie you either love or hate. Its a feel good movie that makes you wonder what youd do for someone you love. How far would you go? Some parts go extreme but thats what I love about these kind of movies. The cast acts well and the parts they play have me laughing and wanting it to go on and I think its a well acted and good addition to the comedy/romance genre."}, {"rating": "7", "text": "Better than expected, this movie delivers an good premise and some decent acting. The movie most impressed me by not resorting to the expected cliche ending. Which might be why it has some unfavorable reviews."}, {"rating": "8", "text": "I actually enjoyed this movie quite a lot. Adam and Drew have a really good chemistry going and the movie had me laughing on several occassions. Definitely worth a watch."}, {"rating": "7", "text": "I was particularly put off by the beginning - the jokes were more or less unfunny - so I was almost put off from watching the whole film. The jokes began to get funnier and I felt kind of at ease because it was less about slapstick and more about what was going on. Adam Sandler has that unique humour where you either like it or hate it. I think the film was slightly messy in its construction, certain pieces were skipped to and the conclusion was a bit rushed. It lacked depth because of its limited explanation - although it helped to replay events that had previously happened. That doesn't make it a bad film though, because sometimes romantic comedies are just meant to be enjoyed, and this example of a medical condition in a beautiful romantic environment is refreshingly original."}, {"rating": "4", "text": "Eh it was ok at first but it gets rather corny, sappy, and generic. It fits the norm of other Sandler films so if you like his other work then you will like this. It was ok but I wouldnt watch it again."}, {"rating": "6", "text": "Just about Adam Sandler's only film worth your time. 50 First Dates features moments of truly touching sentiment with minimal hints of Sandler's annoying-self."}, {"rating": "8", "text": "This is one of those great relaxing movies that is just full of charm and wit. Very entertaining with a premise that is unique than the majority of romantic comedies."}, {"rating": "8", "text": "Though it may lack originality, 50 First Dates is consistently funny, and at times, heartwarming."}, {"rating": "6", "text": "Although it takes a fairly laughable logline and turns it into a legitimate story, \"50 First Dates\" does suffer from only moderately funny humor in the end."}, {"rating": "8", "text": "A funny and creative film that didn't have as much 'just plain stupid' characteristics as other Adam Sandler films like \"Big Daddy\" or \"Grown Ups\". Drew Barrymore did a great job playing Lucy, as did Sean Astin as her steroid-abusing brother."}, {"rating": "10", "text": "I love this movie- it is hilarious, heart warming, romantic and above all: entertaining.  I just love these Adam Sandler romantic comedies.  And this film is a classic, it has me laughing harder every time I see it."}, {"rating": "8", "text": "This film is heart-warming, even though every time I watch it I cry, it has very sad moments and very happy moments. You know a film is good when it takes you on an emotional journey just like the characters in the film.  Highly recommended"}, {"rating": "3", "text": "50 First Dates goes home alone.\rThe movie begins with an interesting idea that develops at a monotonous pace, with laughs few and far between. A very poor execution by Mr. Sandler."}, {"rating": "8", "text": "See Sandler?  When you show us your warm side, we can laugh at you.  You don't always have to fill the screen with gross-out humor.  I wish you'd make more of these."}, {"rating": "7", "text": "I had high expectations for this movie.Unfortunately,the movie was not has funny has i expected.But the performances were actually pretty good and the movie has his laughs."}, {"rating": "7", "text": "This movie is not the best of Adam Sandler, it needs work. Its a little sad, boring, and stupid. But, it has a nice plot, and some parts are funny    ."}, {"rating": "7", "text": "50 first dates is a good romantic comedy with some very sweet moments between Barrymore and sandler due to their outrageously good chemistry the film is also pretty funny at times my only issue is that despite having an original concept in delves into formula and rob Schneider's character was a dickhead and not funny."}, {"rating": "7", "text": "I will admit right now, I am not an Adam Sandler fan. However, I found this film to be surprisingly enjoyable. It is sweet and cute in places, and while certainly not a masterpiece it is above decent. A vast majority of the jokes work here, and that was great to see, and the direction was surprisingly subtle. The camera work was good making good use of the gorgeous scenery, and the soundtrack was lovely. I had little problem with the performances; Adam Sandler gives of his more likable performances, and Drew Barrymore is the persona of sweetness as his love interest. Out of the supporting performances, Rob Schneider guarantees a number of laughs, and Sean Astin comes close to stealing the film in places. But it is the chemistry of Sandler and Barrymore that shines through despite the flaws that mar it from being more than enjoyable.While Dan Aykroyd has a small appearance, it is sadly one that isn't particularly memorable. The plot isn't exactly original, and certainly isn't the most interesting one ever. And the script does have its ups and downs, and is predictable. Overall though, it is a sweet feel good film. It has its flaws, but it is a brave attempt at a romantic comedy, and mainly because of the chemistry of the two leads it mostly succeeds. 7/10 Bethany Cox"}, {"rating": "4", "text": "Normally Adam Sandler always make bad movies.... there are a few exceptions. This one is hardly one of them. A good Adam Sandler movie is always difficult to find even when you search so hard at the end."}, {"rating": "5", "text": "Using a simple story-telling, common jokes and ordinary interpretations, this film becomes only another terrible and mocking film of the not-successful-at-all Adam Sandler, the second most-Golden-Raspberry-Awards-winner ever, next to Sylvester Stallone."}, {"rating": "5", "text": "So yeah it had a interesting plot line and had some funny parts but man on man what a horrible life."}, {"rating": "8", "text": "Didn't know whether I'd like this at first but I've fell in love with it on the first date. 50 First Dates is a great mix of comedy and romance, which made me laugh and tear up every time. It has such a great story idea, one which is so interesting and unique and it was pulled off really well. There were a lot of hidden morals that the viewer thinks about. Every character was interesting to watch and learn about, I just wish Nick and Sue got more screen time. Even the animals were lovable. Sometimes Sandler was a bit awkward to watch, not sure if this was the intention with his character, if it was he did a good job.The technicalities were pretty good as well. I thought this may have been one of the weaker areas at first glance. However with shooting most of the film in Hawaii you can't really go wrong. The music choice as well was excellent, it's great when the music matches the theme and location. There were some scenes that I wished were much longer though, they went by too fast to build up emotion sometimes. It just seemed to cut too soon in an emotional scene, and then before you know it we're somewhere else."}, {"rating": "7", "text": "Very funny! It would suck to go through life that way though. Especially if you fall in love with someone."}, {"rating": "6", "text": "not Sandlers best work but one of the most memorable. based in Hawaii this Marine Biologist falls in love with a **** whos memory is wiped every night. funny quips and one liners, some of the humor is funnier if you're from the islands and have a good idea how the lingo works and hawaii with its \"pigon\" accent Rob pulls off the typical braddah with his kids drinkin on a friday night. fall in love over and over with this."}, {"rating": "7", "text": "50 First Dates is probably Adam Sandler's best movie.  It is an enjoyable enough romantic comedy with a cool twist.  Some of the jokes are much better than others, there's still some of that \"Adam Sandler awkwardness\" in some of the jokes which for my taste doesn't need to be in the movie and only took away from my enjoyment.  All the actors do a nice job and overall enjoyed myself and the really cute ending."}, {"rating": "6", "text": "Henry Roth is a man afraid of commitment until he meets the beautiful Lucy. They hit it off and Henry think he's finally found the girl of his dreams until discovering she has short-term memory loss and forgets him the next day. (6)"}, {"rating": "8", "text": "50 First Dates an extremely charming romantic date although it has some bad taste adam sandler joke, you could never forget this date"}, {"rating": "7", "text": "It's got a couple highlights but overall, 50 First Dates is a good enough movie I'll watch again."}], "recommendations": ["friends_with_benefits", "the_break_up", "click", "blended", "the_wedding_ringer", "delivery_man", "forgetting_sarah_marshall", "zack_and_miri_make_a_porno", "meet_the_parents", "the_proposal", "sandy_wexler", "just_friends", "pitch_perfect_2", "the_five_year_engagement", "that_awkward_moment", "27_dresses", "the_longest_yard", "just_go_with_it", "hubie_halloween", "second_act", "funny_people", "a_bad_moms_christmas", "this_means_war", "yes_man", "step_brothers"]}