{
  "id": 1305,
  "title": "6 Underground",
  "starring": [
    "Ryan Reynolds",
    "Mélanie Laurent"
  ],
  "runtime": 128,
  "genre": [
    "Action",
    "Comedy",
    "Thriller"
  ],
  "description": "After faking his death, a tech billionaire recruits a team of international operatives for a bold and bloody mission to take down a brutal dictator.",
  "releaseYear": "2019",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/lnWkyG3LLgbbrIEeyl5mK5VRFe4.jpg",
  "categories": {
    "plot": 5.846153846153846,
    "acting": 5.230769230769231,
    "ending": 4.333333333333333,
    "soundtrack": 5.0,
    "cinematography": 7.0,
    "familyFriendly": 3.0,
    "funny": 4.538461538461538,
    "action": 7.111111111111111
  },
  "reviews": [
    {
      "rating": "6",
      "text": "While the trailer seemed really good and full of action and fun, while watching the movie it was a bit too silly and felt like even with all the budget etc like it doesnt take itself seriously enough - plus there were some really noticeable product placement advertisements in it, which made it feel worse. And yeah I didnt know that it is Michael Bay's movie, but when seeing it at the end in credits I am not surprised. Basically action is good, but the plot itself a bit stupid and over the top."
    },
    {
      "rating": "6",
      "text": "It's not as bad as I feared, knowing it's a Michael Bay movie. It would actually be reasonably good were it not for the so obviously dumb Plot. A billionaire hires a bunch of officially dead people to bring down a dictator and replace him with his brother. The action is over the top with lots of explosions but I found it quite amusing."
    },
    {
      "rating": "6",
      "text": "Movie just felt very unfinished. Story had no pulse and just had too much over the top action.  First scene of the movie was probably the best action scene in the whole movie. Ryan Reynolds was funny and had some memorable moments but other then him not many stand outs."
    },
    {
      "rating": "4",
      "text": "The start is very promising.  You get the feeling of the Italian Job combined with a thriller heist like Smokin Aces.  All of the character backstories are nicely built up but not overdone.  Then we get to the main mission and it involves the dictator of a fake country, which I just found totally lame and cartoon-like.  Also, they drag out this final act for far too long.  Any political commentary about the evil holding people down is completely toothless because it doesn't have the guts to go after anything real, despite having style that is so over-the-top."
    },
    {
      "rating": "5",
      "text": "This is the absolute most Michael Bay film that Michael Bay has ever Michael Bayed!"
    },
    {
      "rating": "3",
      "text": "Switched straight from this movie to Judge Judy, and I stayed he there. Was trying the second time and it’s not happening. Big budget, clean shots... but that’s all it is. Story is not going anywhere, had some of the most random sex scenes and ends that are left loose all over. A waste of budget and respect Michael had accumulated over many years"
    },
    {
      "rating": "6",
      "text": "Meet a new kind of action hero, 6 untraceable agents, totally off the grid. They've buried their past so they can change the future. So this is Directed by Michael Bay and after the first ten Minutes, I'm like of course it was. The action is intense the explosions big and the cars are fast. Ryan Reynolds is just playing Deadpool again which seems to be all he can play now. He even does the narrating same as Deadpool. They are trying to replace a Fascist dictator in the Middle East with his brother that is the main plot of this movie."
    },
    {
      "rating": "7",
      "text": "I have seen much worse movies in this past year, 6 Underground was mindless, it's plot & writing eye roll inducing, but the action pieces were top notch, and if you can turn your brain off for 2 hrs, it's fun enough"
    },
    {
      "rating": "6",
      "text": "As Ryan Reynolds himself said this is the most Michael Bay-ist film of Michael Bay's career and I would agree. It has all the explosions, all the close-ups, all the shaky cam and everything related to Bay's work. I have to say though... it's pretty good. I thought it would of been terrible but I ended up having a lot of fun. You just have to let go."
    },
    {
      "rating": "6",
      "text": "not crazy good, but fun. If that's what you want you'll get it by watching this movie. Also lot's of neon green color. haha"
    },
    {
      "rating": "7",
      "text": "O filme é bom e divertido, ele não se preocupa muito com enredo. A história é vazia e até um pouco sem sentido, porem o filme vai na linha da tão consagrada saga Velozes e Furiosos, então assista o filme com o tom de critica baixo e se divirta com os absurdos inacreditáveis que é quase impossível acontecer na vida real. Resumindo esquadrão 6 é um filme que não se preocupa muito com a história e foca mais no impossível para entreter o público"
    },
    {
      "rating": "8",
      "text": "The Netflix movie 6 Underground is about an independent/off-the-radar task force trying to topple a dictator. Though light on substance, this turned out to be a crazily entertaining film.If you've seen Michael Bay's Bad Boys movies, you know the director has no qualms about violence, but here he kicks it up to another level. Everything is up at11 out of 10 in this, and Bay makes the most of the R rating. There are some innovative action ideas in this. The movie also looks great. Overall, this is one of those Bay films where he leans into his best qualities and mostly avoids his worse. It doesn't hurt that this is written by Deadpool and Zombieland writers Rett Rheese and Paul Wernick.Also being a Bay film, the plot isn't as strong as the action. It's pretty hard to believe the characters are able to stay off-the-grid as many of them exercise very little discretion throughout the film. Still, the plot is decent, not to mention the characters and villain. Admittedly the movie does lean into the character of Three (Manuel Garcia-Rulfo) either making too many jokes or stupid decisions. Still, he does have his moments. I went into this without a lot of expectations and was surprised. Recommended."
    },
    {
      "rating": "8",
      "text": "Yes ok this is indeed very much a Michael Bay movie with his personal take on action, however in saying this there is indeed some good story and of course action here. Long story short I thoroughly enjoyed the movie, it's not a 10/10 but it is nowhere near the low scores it is getting. 8/10 hope they indeed make another!"
    },
    {
      "rating": "6",
      "text": "It's a Michael Bay movie, so what are you exactly expecting? It's definitely waaaay better than any Transformers movie, but it is still abundant with all the dumb elements you expect from a Michael Bay movie.The Plot: 6 people form a vigilante group to take out bad guys because they don't believe that the legal process will bring justice. They follow a billionaire who wants to bring down a dictator by replacing him with his liberal brother. What are the odds...They do this by screaming out of place lines during action scenes, making jokes all the time, and shooting people that result in slow-motion shots of bullets piercing faces. The action is over the top, but nonetheless amusing.It's dumb, there's no way around it. The characters are cliche's, the violence is so gruesome that is doesn't look realistic anymore, and there are lots of explosions. And in end, it was actually just okay. I give it a 6/10."
    },
    {
      "rating": "8",
      "text": "Hey Reynolds tells you up front in the trailer - it's a Michael Bay movie! Relax and have fun. Actually the first M.Bay film I really liked. Deadpool meets Inception FX with a little John Wick. Amazing fun. Silly dialogue. Blow your brains out FX. Grab a bowl (popcorn) and settle in for a wild ride. Too bad it didn't go big screen first."
    },
    {
      "rating": "3",
      "text": "Ohhh what a **** *facepalm*6 Underground proves once again that Michael Bay couldn't direct a decent movie to save his life."
    },
    {
      "rating": "7",
      "text": "Michael Bay Unchained and Unfiltered. Ryan Reynolds can do no wrong here in this loud, convoluted, explosion filled mess. But on the flip side, it's an enjoyably loud, explosion filled mess"
    },
    {
      "rating": "7",
      "text": "I enjoyed this movie. It is not by far my favourite or a masterpiece in any way, but I found myself enjoying the story and the characters much more than I anticipated. In shorts, it is pure Michael Bay, larger than life action scenes that are more or less un-ending, and being kind of idiotic, but I still found it more iteresting than most of Bay's other movies."
    },
    {
      "rating": "3",
      "text": "The first 10 minutes are fine if you want to watch some explosions flipping cars. The script / dialogue are pretty bad, the story is all over the place with flashbacks, and the general directing is pretty poor. Every scene is spliced together with 20 or more takes, which becomes all too apparent anytime the characters try to hold a conversation, it's jarring how many cuts a scene of dialogue has. It's quintessential Michael Bay."
    },
    {
      "rating": "1",
      "text": "Super violent in a nasty way with lots of special effects.  Cardboard characters bar Ryan Reynolds who plays as usual Ryan Reynolds. Not really funny or even that good in the bash bang boom stakes. Michael Bay isn't good at being Michael Bay anymore. Couldn't help but root for the irredeemably bad dictator who makes Pol Pot look sympathetic. Team America World Police minus the believability factor. Awful."
    },
    {
      "rating": "1",
      "text": "My god what a stupid pile of commercials. Cars exploding and rolling like crazy by hitting coffeshop-chairs was fun though. Long time since I laughed this hard at \"tough\" actionscenes like the ones in this movie. The 90's CGI did also make me laugh. To think Bay directed The Rock, and now we get movies like this...."
    },
    {
      "rating": "1",
      "text": "Just a B rated clone of the fast and furious, with nonsensical dialogue.Nope!"
    },
    {
      "rating": "0",
      "text": "Turd of a movie. Another incoherent piece of garbage from Michael Bay. I only watched it because of Ryan Reynolds, but even his charm and wit could not save this shipwreck of a movie.If you like flashy visuals and nothing else, then this is the movie for you.Forget about story, pacing, editing, logic. It is barely funny, it isn't satire, it isn't even decent action and it was way too long."
    },
    {
      "rating": "2",
      "text": "Monotonous and generic. Starts out pretty good but it only took about 5min before I lost interest in the first car chase and after another 15 it made a complete nosedive. Ryan Reynolds proves once again his whole repertoire consist of one character that he can \"act\". If you seen any of his past movies you know what I mean. The effects are pretty good but that's the only redeeming quality this movie has going for it. The team the movie revolves around is about as stereotypical as it gets, and I couldn't care less about any of them. I have no idea what happened in the last 40-45min because by then i had already completely lost interest and shifted my focus elsewhere."
    },
    {
      "rating": "6",
      "text": "The two universal truths to this movie: 1) The opening sequence is vintage Bay at his best, and 2) The storyline is it's weak point. The latter would not be a problem, and indeed it doesn't render the Bay-esque 10-angle-action-shots/second opening sequences futile. However, the first Act writes cheques about the expectations of the rest of the movie that the remainder of the movie sadly can't cash. It almost does the job of being the genesis of Bay's answer to the Fast & Furious / Mission:Impossible franchise, albeit the wonderfully ridiculous over-the-top version, under the cover of Reynolds' idiosyncratic humour. Alas, the aforementioned weak plot is not only found wanting, but also wasting the opportunity of what could've been the start of something everlasting, if even a fun and exciting stand alone movie in its own right....this review would be longer but I'm still having to concentrate on the never-ending action scenes that are still somehow not over despite finishing the movie hours ago."
    },
    {
      "rating": "7",
      "text": "Joyful, just easy to watch. So much violence for Netflix movie - nice change"
    },
    {
      "rating": "7",
      "text": "This was a fun tongue in cheek action movie with lots of explosions, I think by now most people know what they're going to get from Micheal Bay and that's exactly what you get.  If that doesn't appeal then perhaps Ryan Reynolds will."
    },
    {
      "rating": "3",
      "text": "He has to be trolling us. He has to be. There is no way Michael Bat continues to make films that get louder, more unfunny and nonsensically written by accident."
    },
    {
      "rating": "2",
      "text": "I had a tuna sandwich whilst watching this film, there wasn’t enough mayonnaise. Same could be said about this film, film had potential however lacked oomph."
    },
    {
      "rating": "0",
      "text": "I can't fathom why people continue to give Michael Bay money to churn out the lumps of crap he calls movies. If you want to see something completely devoid of creativity or any shot lasting longer than 4.5 seconds while you send your brain into a a vegetative state this two hour long cognitive enema is for you. Not even Ryan  Reynolds charm can save this one"
    },
    {
      "rating": "8",
      "text": "Enjoyed it for what it is: action bomb with witty dialog not to be taken too seriously. Wasnt expecting heart from a film with this much adrenaline. Michael Bay hate is real, just watch it and make up your own mind."
    },
    {
      "rating": "8",
      "text": "Achei um ótimo filme, divertido e cheio de ação, melhor filme de ação da Netflix, claro que tens seus defeitos tbm, história corrida, muitos cortes de cena e física praticamente nula, mesmo assim, suas qualidades superam os defeitos, ótimo filme..."
    },
    {
      "rating": "8",
      "text": "When I go watch a (Action) movie i'm not looking to be moved emotionally. I'm looking for non-reality craziness and this movies hit it on the head. ✔"
    },
    {
      "rating": "8",
      "text": "Good movie!! I like the principal castThe effect is good and we need a sequel"
    },
    {
      "rating": "8",
      "text": "Dunno why folks are giving it a negative review. This was a very solid movie for me. One of the best I've seen on Netflix!"
    },
    {
      "rating": "8",
      "text": "I thought it was a great action movie and worth a watch. Is it perfect? Of course not but is it good, I'd say it is."
    },
    {
      "rating": "8",
      "text": "It’s an action movie so high points for car chases, crashes, bullets flying, and kicking ass. It’s not the best plot of an action movie but it is worth the watch on Netflix."
    },
    {
      "rating": "8",
      "text": "If you're a fan of the 2010 action movie \"The Losers\" you're sure to have a reason to watch this. Honestly thought it was written/directed by the same people at first but turns out it's Michael Bay. When he's not involved with Transformers or TMNT he can do some neat things (The Island was pretty good). Starts out way too jumpy for my taste but it quickly comes around. It's a fast paced, highly stylized action movie with lots of irreverant humor. Characters are one-dimensional and the actual plot is rather uninspired but nothing wrong with that from time to time. Refreshing to have a movie that focuses on style and sequence over substance once in a while. The film largely boils down to 3 or 4 lengthy (but exciting the whole time) action scenes and I am ok with that. Great for what it is. Don't watch it expecting Oscar-worthy material unless the Oscars is going to start recognizing stunt doubles and stunt coordinators and things like that."
    },
    {
      "rating": "7",
      "text": "A good fun popcorn Ryan Reynolds movie, a score of 7 is fair score for this movie, don't expect a perfectly written script or realism.  This is a good time, good guy's going after the bad guy's movie, if you're after an action packed movie then this is for you."
    },
    {
      "rating": "8",
      "text": "It's crazy stupid fun... wild action packed ridiculous over the top.  It's an 80s style action movie but with Fast and Furious and John Wick sensibilities, crazy car chases bloody gunfights and violent deaths.  It's not supposed to be an Oscar winning film it's a fun stupid violent good time."
    },
    {
      "rating": "7",
      "text": "Pleeeeaaaase....don’t pretend like you do not want to watch this movie. Sure, it is not an Oscar candidate, but it far exceeds your run ofthe mill expectations for a Netflix featured film. Ryan Reynolds notches a solid performance in a role tailored to his unique niche, peppered with his witty comic relief and excellent action sequences. It feels like the Italian Job meets the fast and the furious! Nothing more but to kick back and enjoy this blockbuster hit with your favorite peeps!"
    },
    {
      "rating": "0",
      "text": "OMG. For a comedy this film is to long. And the name should be 'Amateur Hour: Not Even Deadpool Can Save You'. Sorry Michael Bay, we have awesowe video-games today, we don't need your explosions anymore. Maybe you should reinvent yourself... in theather? Explosions would be a fresh move in theater. PS: But look this way, i'm here wasting time talking about the movie, right? So there is a crazy good side in this... probably? i'ts not, probably not."
    },
    {
      "rating": "7",
      "text": "Just get a popcorn and turn off your brain. No super story arc or something like that. Just plain action and fun camera work with some bad jokes in between. We'll see how this one develops if there comes a part II."
    },
    {
      "rating": "3",
      "text": "Kept rolling my eyes trough this movie at the first half. Kind of knew what i was getting myself into.Subpar $150 mil. Michael Bay production with all his trademark. It is a pretty explosive, violent movie. But damn the humor was pretty low. I laughed maybe once through this movie.The plot is... well pretty mediocre. The start of this movie (that probably burned half the budget alone) tries to establish a background by jumping back and forth to get some sense of character development which turns the movie into a mess. Michael Bay has no clue on establishing back stories. But half way in it lets go and gets on with the story that is not much to get smart about.The acting is OK but that's it. Reynolds is barely holding up this movie to be enjoyable.  But the movie is typical Bay over-the-top production and bad humor lines.And btw, who moors a yatch with an anchor if you are docksided?"
    },
    {
      "rating": "8",
      "text": "A Fun Action Parody With Product Placement Galore - Combine multiple wise cracking performers, some of the best action scenes filmed this decade, blood blood body parts and blood, a preposterous story, unlimited access to film in some of the most beautiful areas of the globe along with an unlimited budget....all orchestrated by action director God Micheal Bay - and you have 6 Underground. The in-your-face and over-the-over-the-top filming and performances can only lead one to believe this film is a parody of the Fast & Furious along with the hundreds of no-way-that-can't-be-real films we have seen over the years. Is this film visually stunning...YES! Funny....YES! A Micheal Bay Masterpiece....DEFINITELY!"
    },
    {
      "rating": "10",
      "text": "Loved it. Fast fun and funny. Just enough humanity to pull you in. Just wasn't enough I needed more."
    },
    {
      "rating": "9",
      "text": "Another Netflix gem lambasted by critics6 Underground is non-stop action-fest full of wise-cracks and fantastic set-pieces.It's not the smartest movie you'll see but it was a hell of a lot of fun."
    },
    {
      "rating": "0",
      "text": "issa masterpiece of a film what can i say, michael bay never fails to live up to the hype, deadpool guy is funny"
    },
    {
      "rating": "3",
      "text": "perfect example that a big budget is no guarantee for success. featherbrained humour, boring story. only the camera-work in the action-scenes are cool."
    },
    {
      "rating": "10",
      "text": "its been a while since i had fun watching an action comedy. the right amount of action with the right amount of comedy not drowning out the story. a maskless deadpool with his own flare. sequel please."
    }
  ],
  "recommendations": [
    "the_expendables",
    "the_marine",
    "furious_7",
    "lockout",
    "the_expendables_2",
    "transporter_2",
    "the_expendables_3",
    "xxx_return_of_xander_cage",
    "bloodshot",
    "crank",
    "transporter_3",
    "the_transporter_refueled",
    "mechanic_resurrection",
    "salt",
    "death_race",
    "mission_impossible_iii",
    "bullet_to_the_head",
    "wanted",
    "escape_plan",
    "the_mechanic",
    "the_fate_of_the_furious",
    "jason_bourne",
    "red_notice",
    "miami_vice",
    "premium_rush"
  ]
}