{
  "id": 3534,
  "title": "7 Days in Entebbe",
  "starring": [
    "Rosamund Pike",
    "Daniel Brühl"
  ],
  "runtime": 107,
  "genre": [
    "Thriller",
    "Drama",
    "Crime"
  ],
  "description": "In 1976, four hijackers take over an Air France airplane en route from Tel Aviv to Paris and force it to land in Entebbe, Uganda. With 248 passengers on board, one of the most daring rescue missions ever is set in motion.",
  "releaseYear": "2018",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/nrC63ikbK4jDp3knvBqxPoWYEMM.jpg",
  "categories": {
    "plot": 4.363636363636363,
    "acting": 4.875,
    "ending": 2.6666666666666665,
    "soundtrack": 7.0,
    "cinematography": 5.0,
    "familyFriendly": 6.0,
    "funny": 5.0,
    "action": 8.5
  },
  "reviews": [
    {
      "rating": "5",
      "text": "This film is based on the 1976 hijacking when 248 passengers of an Air France flight were taken hostage and forced to land in Uganda. The narrative unfolds from both sides: the effort by 2 of the hijackers to maintain control of the hostages and the plans by the Israeli government to handle the situation. There's a lot of doubt and concern on one side and repetitive political discussion on the other. The natural potential for tension is never realized. Even the ultimate showdown, which is intercut with a contemporary dance number, is more frustrating than thrilling. The result is a listless encounter that will only be of interest only as a historical re-staging."
    },
    {
      "rating": "0",
      "text": "Bruhl and Pike were the only decent thing about this film. It's your typical over-dramatization of a real-life event. Every character seems to state repeatedly how serious the situation is (on either side) and then the climax of the film happens in this awful slow motion with a needlessly added dance scene mixed in. There was a lot of bad choices with this movie. Slow paced, Poorly acted (outside of the two leads) and just not that interesting."
    },
    {
      "rating": "1",
      "text": "This is a pathetic attempt to re write history and redo a much number of much better versions of the events surrounding this story.It reminds me of when \"The Sword of Gideon\" was remade by Spielberg and he and the writer added an entire scene to show the Humanity and \"other side\" of the terrorists. Attempting to humanize or justify their behaviour. Pathetic.I did give this a 1 because I do like the actors and they are very good at their respective craft. Otherwise I would have just given it a 0."
    },
    {
      "rating": "7",
      "text": "Decent film, that seems to be getting poor reviews because it is too \"pro-hijackers\" or \"isreal negative\" by some, and by others annoying by the inter cutting of an interpretative dance routine.  I found issue with neither area, but the film did lack the explosive pacing that viewers come to expect from plane hostage films, and it also had some mediocre dialogue at times, and did not really shed much new insight onto the genre, except maybe examining the conflicting reasons some of the hijackers may have had, which was one of the  more interest aspects of the film.The film is really told from the hijackers perspective, and I think it is pretty neutral, doesn't take sides, which keeps it cool, and detached to some degree. It is fairly procedural, which slows down the pace for much of it as well.  Munich was a superior film about a similar subject matter, but this film explores more of the hijackers emotions, and adds a slight element.  The actors were also pretty good, despite a so-so script, and the compelling subject matter, and interpretive dance stuff, while over-handed, worked as well.  Good, but not great, film, especially worth seeing if you are not familiar with the events that occurred.  Just don't expect a riveting action packed hijack film for the duration, nor an Oscar type moral quandry such as Munich.   It is a decent film that balances things from the hijackers perspective mixed with the procedural response by the Isrealis."
    },
    {
      "rating": "1",
      "text": "I love how there was a strong anti-nazi anti-right wing sentiment in the movie where the two Germans were basically 1970's German Antifa communists.  These are naughty Lefties not naughty alt-right."
    },
    {
      "rating": "1",
      "text": "This is an amazing story. It is hard to believe you can write a bad script about it but this movie manages to combine pretty lousy dialogue  with mainly bad acting. This is on top of rewriting the hijackers as sensitive humanitarians. Even the climax is anti climactic.I rate this movie P for pathetic."
    },
    {
      "rating": "7",
      "text": "An interesting film, especially if you didn’t know anything about this hostage situation beforehand. I thought the acting was very good, especially Rosamund Pike, who was able to show much more nuance and emotion than the other actors, although that may have had more to do with the script than anything else. The big mistake in the film was the modern dance number that was repeated over and over again and was irritating and intrusive, except for the final time it was shown when the music (not the dancing) added to the emotions of the moment. Perhaps it was supposed to suggest Greek tragedy, but all it did was distract the audience and break the tension."
    },
    {
      "rating": "0",
      "text": "In general, the film was made not bad, but what was it at the end? Was it necessary to insert this ridiculous dance into the scene of a special forces attack? And I was very surprised by the prime minister's phrase: you can congratulate us. we rescued the hostages!Sorry, but the purpose of the special operation was not the rescue of the hostages, but the unwillingness to release the prisoners. In the case of holding negotiations, the hostages would be in much more safer position."
    },
    {
      "rating": "10",
      "text": "I opted for Entebbe bcs i'm not a teenager to watch Player No 1...and i was nicely surprised! The movie depicted correctly bombing 70's, with crazy Germans, Arabs and \"you-do-not-f-with-us\" Jews...the plot is well known but what really is eye pleasing is the craftsman of the director...this isn't Munich, this is more carefully knitted grandma's tablecloth that covers all - drama, action and psychological profiles of the characters....this movie is a \"go\" !"
    },
    {
      "rating": "4",
      "text": "\"7 Days in Entebbe\" was a film with a good premise, but with very little action, from time to time it brings something different, but the truth is that the story was boring and not very consistent and the performances were lazy and bad."
    },
    {
      "rating": "6",
      "text": "This is a good movie.I didn't know anything about the hijacking.It was well-written plot about Israeli politicians and the president Amin.If you don't know the story, you should watch it."
    },
    {
      "rating": "5",
      "text": "Incroyable détournement d’un avion d’Air France en 1976 par des terroristes allemands d’extrême-gauche en cheville avec d’autres terroristes, des Palestiniens évidemment ! l’avion a finalement atterri en Ouganda, ce pays d’Afrique sous le joug du tristement célèbre Amin Dada, psychopathe dictateur qui espérait tirer les marrons du feu de cette sinistre affaire…L’opération tentée par les Israéliens pour sauver une centaine de leurs ressortissants dépasse de loin toute fiction imaginable ou imaginée… et pourtant ! Relativement réaliste, le film retrace fort bien cette situation inextricable pour les dirigeants israéliens totalement pris au dépourvu… or, fidèles à leur politique, il n’était pas question de négocier avec des terroristes…La préparation de l’opération mais surtout la montée en tension progressive sont bien restituées et le duo Brühl-Pike s’en tire bien dans l’ensemble mais le scénario qui tente d’humaniser les terroristes fanatiques et communistes nous la fait à l’envers ! ce n’était certainement pas des enfants de choeur, non, non… égarés à leur insu dans ce détournement international d’une ampleur inégalée à cette époque ! bref, ils nous prennent un peu pour des cons ici.L’autre gros souci concerne l’assaut lui-même, étonnamment expédié et bâclé, monté en parallèle avec le spectacle de danse contemporaine que l’on voit tout au début en guise d’intro… mais qu’est-ce que ça vient faire là, franchement ? Enfin, le message anachronique plus ou moins sous-jacent et fréquemment repris et répété : négocier avec les Palestiniens, car sinon ce « conflit » ne s’arrêtera jamais… eh bé, ils avaient une boule de cristal en ce temps-là ou quoi ?Cela étant, on ne s’ennuie pas du tout -le contraire eut été étonnant avec un tel sujet- mais on peut regretter que le potentiel d’un tel film n’ait pas été réalisé, hélas. Sans doute parce que le réalisateur est un gauchiste refoulé. Et le producteur aussi."
    },
    {
      "rating": "6",
      "text": "Lacks insight, but is well madeWritten by Gregory Burke and directed by José Padilha, Entebbe [released in North America as 7 Days in Entebbe] has met with near universally bad reviews (22% approval on Rotten Tomatoes at the time of writing), and while it is without doubt flawed, it's not nearly as bad as has been made out. Telling the story of the 1976 AirFrance hijacking by Palestinian and German revolutionaries, and the subsequent Israeli Defence Force rescue mission (Operation Thunderbolt), the film is presented from multiple points of view; Revolutionäre Zellen members Brigitte Kuhlmann (Rosamond Pike) and Wilfried Böse (Daniel Brühl), Israeli Minister for Defence Shimon Peres (Eddie Marsan), Israeli Prime Minister Yitzhak Rabin (an excellent Lior Ashkenazi), IDF Pvt. Zeev Hirsch (Ben Schnetzer), AirFrance 1st Engineer Jacques Le Moine (Denis Ménochet), IDF Lt. Col. Yoni Netanyahu (Angel Bonanni), and Ugandan President Idi Amin (Nonso Anozie).The problem is obvious; the film covers every point of view except the most important one; the Palestinian. Indeed, the only Palestinian given any kind of development is a fictional character played by Omar Berdouni, who talks of Israeli tanks driving over a car in which his family were trapped. And there are other strange omissions; the death of Dora Bloch (Trudy Weiss), murdered on Amin's orders after she was released in Kampala, is never mentioned, and Wadie Haddad is nowhere to be found. Additionally, the film doesn't have much of contemporaneous relevance to say in relation to the Arab-Israeli Conflict, other than alluding melancholically to the self-propagating nature of the violence, and the unlikelihood of peace (the closing legend points out that after he pushed for negotiations in 1995, Rabin was assassinated by a Jewish extremist).However, it's aesthetically very well put together, and the juxtaposition of Thunderbolt with a Jewish dance number works much better than it has any right to. True, it doesn't get to the heart of the matter by any stretch of the imagination, and it could be accused of taking a pro-Israeli stance, but it's enjoyable enough, and worth a look."
    }
  ]
}