{"id": 3252, "title": "7 Guardians of the Tomb", "starring": ["Li Bingbing", "Kellan Lutz"], "runtime": 90, "genre": ["Action", "Adventure", "Horror"], "description": "An innocent discovery of a well-preserved mummified Emperor from 200 BC China unearths a 2000 year old nightmare - a secret that should have remained buried.", "releaseYear": "2018", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/lBW7Aq7RzsFbrnmn9RCkpd6GbXf.jpg", "categories": {"plot": 4.0, "acting": 4.0, "ending": 5.0, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 4.0, "funny": 4.0, "action": 4.0}, "reviews": [{"rating": "4", "text": "A total B-movie. The kind I can see finding life by getting played on Syfy. The premise of a bunch of would-be adventurers running through an underground tomb while being hunted by smarter than average spiders is right up the network's alley. I appreciated how Kimble Rendall made this with a straighter than average face. It's something that makes the experience less aggravating than other films of the like. That being said the movie knows what it is and does have a slight sense of humor about itself.As unfunny as it's comic relief is, the real problem with this Australian-Chinese production is that there's really not much going on. A mildly entertaining opening never manages to flourish into anything more as nothing actually happens for the majority of the film. Rather than indulging in the schlocky thrills of watching people get killed by spiders, Rendall chooses to go through the motions of watching characters flee to empty rooms, screw around for a bit, and then repeat the process. It's as if they only had enough material for a short film and decided to stretch it out to feature length by including a lot of empty conversations. It has so many expendable characters that it's a shame it didn't take the time to kill them off for our amusement.Things are terribly predictable and more than a little dumb. The most disappointing aspect though is that never delivers on the kind of stuff we want to see from movies like this. I would have been more willing to put up with things like the cheap visuals, bad dialog, and amateur performances had the spiders been given more time to feed. Instead we got a lot of padding in the plot department and only a few scenes that capitalize on the premise in any satisfactory ways. Unlike a lot of B-movies this wasn't painful to watch. It was just boring. A curiosity watch that left me wanting so much more."}], "recommendations": ["army_of_the_dead", "wanted", "shadow_in_the_cloud", "vantage_point", "bird_box", "jurassic_world_fallen_kingdom", "wonder_woman_1984", "frozen", "the_tomorrow_war", "geostorm", "gamer", "polar", "wild_card", "transformers_revenge_of_the_fallen", "unfriended", "doctor_strange_in_the_multiverse_of_madness", "jurassic_world_dominion", "unfriended_dark_web", "project_almanac", "old", "crawl", "minions", "the_host", "how_it_ends", "chernobyl_diaries"]}