{
  "id": 1115,
  "title": "9",
  "starring": [
    "Elijah Wood",
    "John C. Reilly"
  ],
  "runtime": 79,
  "genre": [
    "Action",
    "Adventure",
    "Animation",
    "Science Fiction",
    "Thriller"
  ],
  "description": "When 9 first comes to life, he finds himself in a post-apocalyptic world. All humans are gone, and it is only by chance that he discovers a small community of others like him taking refuge from fearsome machines that roam the earth intent on their extinction. Despite being the neophyte of the group, 9 convinces the others that hiding will do them no good.",
  "releaseYear": "2009",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/3uqXGOH4BQ2CLJWkDJZ0PzbUzOn.jpg",
  "categories": {
    "plot": 5.849056603773585,
    "acting": 5.722222222222222,
    "ending": 6.5,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 4.714285714285714,
    "funny": 8.0,
    "action": 7.05
  },
  "reviews": [
    {
      "rating": "10",
      "text": "After a long, disappointing summer, filled with nothing but box-office driven, mindlessly name-brand, soullessly big budget spectacles, \"9\" stands out as painstakingly, hand crafted thing of beauty. The intricate detail, carefully placed in each frame, provides a consistently flawless and gratifying visual experience. It deftly manages mature themes, without resorting to vulgarity, while maintaining an unrelenting barrage of heart-pounding action sequences. The overall flow of the narrative does suffer from rushed storytelling, but it more than makes up for it with an endearing array of unique and believable characters. This film is the perfect example of why I, as an adult, still find value in animated feature films. This film is a perfect example of why it is unnecessary to dumb-down a narrative in order to facilitate a younger demographic, just because it is animated."
    },
    {
      "rating": "6",
      "text": "It was very nice animation, the characters were average nothing special, and a story that came out of nowhere, this last part might be the best part of the movie, an original story but predictable at the same time."
    },
    {
      "rating": "9",
      "text": "A piece of brilliance, both in originality and visuals. Although short, it felt right at 80 minutes. Do we really need the 2-3 hour epics? straight to the point. Harrowing, haunting, yet my 5-year old totally got this movie. I feel the story treats the audience respect, both young and old. A favourite for years to come."
    },
    {
      "rating": "5",
      "text": "Very interesting visuals and music, and 1 or 2 touching moments can't save 9, which unfortunately features a storyline that feels like it was penned in about 5 minutes. The movie becomes a string of action scenes with every line sounding like it was written for the movie poster. The problem is that we can't have *suspense* if we don't care about the characters, and the characters here are so one-note and under-developed that it's impossible to really care much about their journey. At only 79 minutes long, the movie certainly had time to build a more substantial plot or add some layers to its characters, but it all just feels rushed. Not good, not bad, just mediocre."
    },
    {
      "rating": "6",
      "text": "Shane Acker's first experiment is very good in outcome, but it has so many obvious flaws. 9 is visually impressive, probably one of the most visually impressive movies this year. The story of the movie is extremely familiar, and in a bad way. But as I said, the animation is amazing, and it certainly makes up for a lot that the film failed at. 9 is about a scientist who creates 9 small rag-doll creatures called Stitch Punks. And they have to save the world from evil mechanical beasts and ladeedadeeeda.......OK. Where do I start? This plot was pretty bad. It is original, but the theme is incredibly bland, and doesn't quite strike you as good, like District 9 or UP's respective themes. I give the story a 30%. Although it has a bad plot, 9 has some beautiful action scenes. These scenes were intense, hauntingly beautiful, and all around incredible. The only complaint about the action is, why so short? Yes, that is right. These action scenes are like most action scenes in movies. Short. But ever so good. I give the action a 70%. Possibly the brightest spot in 9 is the beautiful animation. And it is gorgeous, the detail is incredible. The characters.....look amazing! Every robot villain, every stitch-punk, and every landscape is just amazing! I think the design earns a rather generous 80%. 9 is produced by Tim Burton, which sure jerked a few heads. I mean, why wouldn't it? Its Tim Burton! But being that, he doesn't really get creative with this movie. The creatures are all Acker's, thank god. And so is the messed up story and characters. Characters. I haven't talked about them yet. Well, to tell you the truth, the story is so short, the characters never develop, and you never really get to know these characters that could be so complex and great. They all die pretty fast, which is another defect. The characters get a 50%. I have followed 9 from the moment the trailer premiered in theaters attached to Coraline. And I thought maybe, I would love it. And I was mostly disappointing of 9, but the animation wowed me. I say, rent 9. Its really not worth seeing in theaters, but a simple rent should do it."
    },
    {
      "rating": "6",
      "text": "A stellar voice cast, and a truly amazing piece of work to look at. 9 portrays and incredibly bleak and desolate world through almost 'little big planet' PS3 game style sack people and their unfolding story.Some truly horrific looking elements appear through the movie, adding the Tim Burton goth like stamp over it (he co-produced it). Sadly the story weakens half way through, but remains a great looking film until the end. The screen we saw this on was not the best and fairly small, and I'd imagine this would be pretty amazing in high definition."
    },
    {
      "rating": "6",
      "text": "The movie shows a post-apocalyptic/post-human place after the last of the humans has died in a war against their own machines. The film criticizes the abuse of science for the development of warfare - in this case especially artificial intelligence and biological warfare. Eventually, after our self-destruction, the forces of nature will wash away all the dirt we left behind. However, now that we are still here it is on us to keep our planet livable and beautiful. \"9\" has an intelligent story, an okay screenplay, and some beautiful moments. It is worth watching but loses some of its magic after the first viewing."
    },
    {
      "rating": "8",
      "text": "9 is not a casual film. This isn't the kind of movie where you invite a bunch of friends over, expecting an \"awesome\" movie. That's not to say it's a bad movie, it's quite good in fact. It's just not a typical film. It's bleak, it's eerie, and even the action, though strong, has a lot of symbolic meaning. I don't often watch films like 9, nor do I want to. 9 offers only a few smiles, and no laughs. Rule #1 for me, it has to have humor. I don't mind serious films, but a little humor can go a long way in helping me remember the film, and enjoy it. 9 manages to entertain without laughs. But 9 has a lot of emotion anyway. Fear certainly comes to mind, as does sadness. The PG-13 rating was not earned from language or sexual content. Part of it comes from the bloodless, yet intense violence. The more protruding part comes from the darkness. Despite it's limited inappropriate content, this is not a film for kids. It's dark themes may even challenge older ones. The story isn't all that sophisticated, to be honest. And there's more than a few cliches. There are plot points we've seen before, and characters that may evoke a sense of deja vu. But that's okay, because the movie is strong. The animation is incredible. The musical score, though a little run of the mill, is appropriately creepy, and it knows when to keep quiet. The voice cast is filled with stars that shine, but don't distract. Of course, you didn't come to see any of that. Depending on who you are, you came for one of two things; an intellectual film, and thought provoking themes, or epic machine vs. rag doll fights. If action is what you came for, you shouldn't be disappointed. There are plenty of, I shouldn't say duels, but fights between the stitch dolls, and the mechanical beasts. This film is not made up of action throughout, so teens coming ONLY for the action will surely be disappointed, but there's enough action to thrill and excite. If you came for intellectual stimulation, you will have to wait for after the film to enjoy that bit. During the movie, you will have to do little thinking. This is the kind of flick that inspires conversation after viewing. As the film runs, you simply have to sit back and enjoy. 9 is a wonderful movie. It's by no means, one for the ages, but it's a thought-provoking, heart pounding little flick, that can surely be enjoyed by any one who wants to try something, a little new."
    },
    {
      "rating": "4",
      "text": "I have to give 9 credit for having me great heart at its core, but I refuse to give it credit for much else. The voice acting, though better than terrible, was not convincing enough to make me truly care about the characters. Worse still, the characters, in particular 9, are of the type that good voice acting is needed in order to bring in sympathy for them. Therefore, the tragic and ultimately bittersweet story was touching only so much as its actual plot. However, this plot, despite its terrible pacing, is the movie's only saving grace, and the only reason I will not say it is not worth watching. Honestly though, if you are a fan of Tim Burton-style animation (Corpse Bride, The Nightmare Before Christmas), the visuals will probably be worth it by themselves, since they are quite impressive."
    },
    {
      "rating": "8",
      "text": "The story just seemed a little incomplete to me, it was one of those movies where when it ended you were like \"what, it's over?\" so that was one of the only complaints I had about it. Otherwise a great movie."
    },
    {
      "rating": "7",
      "text": "I can't give \"9\" a 9, but it still is a rewarding movie that portrays lovely, grim visuals."
    },
    {
      "rating": "5",
      "text": "Seemingly a story created simply to facilitate an elaborate set of action scenes and pleasure the 3D modeler's and special effects guru's working on the film. But what about the spectator? After the film I was left with, \"What was the entire point of the whole movie?\" There really was none...they tried to make a sappy feelgood ending with the final monologue, but I just wasn't feeling it because it didn't make any sense nor were we ever given a reason to care. How did the robots die in the first place? We don't know. How do we know there aren't more? We don't know. From what we saw these potato sacks created their own drama when there was none and then had to destroy it for nothing more than saving the other potato sacks they were responsible for killing in the first place."
    },
    {
      "rating": "9",
      "text": "That movie is totally for me. All Sci-fiyy."
    },
    {
      "rating": "0",
      "text": "My vote is not for the movie itself, but for the review I read on msn.com. Note to critics: when reviewing a movie directed at teens (as noted in your own review) don't use words that they have never seen. This is a MOVIE REVIEW not a literary exercise to display your vast knowledge of the english language. In fact, stop it altogether! I'm sure you lose 90% of your audience after the 1 paragraph. If you actually reivewed the movie instead  of trying to show how much better you are than the people reading your review, it might be worht something. Why do you think that people FLOCK to movies that are beat up by so-called critics? It's because 90% of all movie reviews are worthless piles of pigeon feces flung from the heavens by the literary avians... Come on man, stop writing crap, and write an actual review, stop trying to interpret what you are seeing! Just review what was there, how was the plot? How were the special effects? How long was it? Stop trying to write an essay on how movie X compares to the cinematic greats, and stop pretending like you know where the movie gets it's inspiration from, WE DON'T CARE! Please review the movie instead of trying to convince me that I'm an idiot an idiot because I might want to actually go see it. In fact, just stop altogether."
    },
    {
      "rating": "5",
      "text": "This movie is too scary for kids and too uninteresting for adults. It has great visuals and animation but suffers from what most recent hollywood movies suffer from- bad writing. All the good writers have gone to TV, maybe hollywood should go look there."
    },
    {
      "rating": "3",
      "text": "Only 9? I could have counted 100 cliches in this movie. I would have given this a zero if it weren't for the spectacular fight scenes. Plot, story, dialogue were a mere obstacle, almost a nuisance."
    },
    {
      "rating": "3",
      "text": "Entertaining film but fallidisimo script. An animated film where you have endless adventures carried just fine, with a post-apocalyptic aesthetic that gets you into position quickly but which is sunk to the depths as the plot comes into play. A dash of absurdity aqui te pillo aqui te mato, with a horrible end, where there is no catch it. As I said, entertaining action scenes with a dash painful."
    },
    {
      "rating": "6",
      "text": "Dull story and soulless characters. Decent animation. This is a film that doesn't know if it wants to be a children's movie or a dark, adult mystery, so it chooses to be neither, and that is its biggest failing."
    },
    {
      "rating": "3",
      "text": "Amazing animation and effects, no story whatsoever."
    },
    {
      "rating": "3",
      "text": "This movie, while visually stunning, had a thread-bare plot that has been done so many times that it's hard to find something new to be excited about. If only more time was spent on the script, character development and plot this would have been a rare film. As it stands its a beautiful but retarded child of Terminator and the Matrix. A sad waste of money and talent."
    },
    {
      "rating": "0",
      "text": "Boring on every level. Horribly written and bland."
    },
    {
      "rating": "5",
      "text": "9 is packed with amazing visuals; the character designs and art direction were perfect. The story, however, feels compromised. What's most disappointing is that it's almost there-- it could have been just a little darker, the tone more serious, the ending more somber. But these things were sacrificed to make a more kid-friendly movie with a \"nice\" Hollywood ending, and we are left with only a glimpse of what could have been."
    },
    {
      "rating": "0",
      "text": "I think this is a bad movie becouse Ive seen the picture and I dont like it. It just dosent fit the name. Im going to e-mail the director and teel him that I would like to see more picture of movies that I like, not that I dislike: Period."
    },
    {
      "rating": "3",
      "text": "Disappointing for a movie billed with Tim Burton's name. It's apparent that's all they paid him for. I'd like to say the plot was interesting, but it wasn't. I guess the lesson is: if all humans are dead, who is left to care about a bunch of dolls? Also, this was not a movie for little kids. It's not just the fairly horrific scenes of dead bodies, but also the post apocalyptic theme that is fairly hard to grasp the ramifications of, even for an adult."
    },
    {
      "rating": "2",
      "text": "This movie scrapes out a 2 for its impressive visuals. Otherwise, Tim Burton should be ashamed. The plot twists and dialogue were so utterly predictable and hokey that I couldn't help but blurt snide comments at every possible opportunity (of which there were many). My friends and I laughed all the way home after being subjected to this utter disappointment."
    },
    {
      "rating": "4",
      "text": "I found this movie very dark...could have been a better movie with a bit more hope. I found a few images offensive/bit harsh for by 7 year old. There is a scene where you see dead(cartoon animation) mother holding child."
    },
    {
      "rating": "5",
      "text": "The only reason that i watched this is because it was produced by Tim Burton, and thought it would be at least OK, it to be honest feels like a Disney channel mediocre movie. it at the beginning it was pretty good, because of the dark elements but after that it was pretty much like moldy pie don't buy this unless your a Tim Burton Diehard fan."
    },
    {
      "rating": "10",
      "text": "Maybe this movie has a short run time, But the action would go great for 4th graders 9 years old and up. Even though this movie is rated PG13 its good. I give this movie 10 stars out of 10, cause this movie is really stunning, has great animation, and feels more better for Tweens in 4th grade and up."
    },
    {
      "rating": "3",
      "text": "Great animation, but the plot is an incomprehensible mess. I really wanted to like this movie, but there are too many things about the story that were just . . . well, just dumb and ill thought out."
    },
    {
      "rating": "8",
      "text": "Great movie with outstanding special effects, interesting characters, and plenty of action. But I agree with some of the other reviewers that this movie is not for kids."
    },
    {
      "rating": "8",
      "text": "I enjoyed this quirky movie. Kinda typical in a non-typical way. If you like dark Tim Burton types of movies then you would probably like this movie."
    },
    {
      "rating": "0",
      "text": "I have not personally seen the movie but I would rate any animated movie or movie targeting children as a 0 if it is pg-13 in the first place. This era of animated adult movies is confusing to my children and I do not forsee us seeing this movie because it looks too dark for a child to see. Sorry if this offends but this is after all just my opinion of the movie."
    },
    {
      "rating": "9",
      "text": "Minor spoiler. The main reason I decided to write a review is to respond to the review by Chris S. The sack people were never meant to reproduce. There was no flaw in their creation. If you recall at the end of the movie when 9 releases the others' souls and they float up into the sky, it begins to rain. In the rain are little green blobs. This is life starting anew. So you see, they actually did succeed in their mission to save the future. The only real problem I had with the movie is that it was too short. If the plot had been developed just a little more and the action scenes extended, then this would be getting a full 10 out of 10. It is visually stunning and full of action. This is a must see!"
    },
    {
      "rating": "6",
      "text": "The animation was impressive, but it was a hard sell to make me care about any of the characters in such a done-to-death plot. Ultimately there was no character development, aside from one of the dolls deciding to follow the young, individualist 9 instead of the old, dogmatic 1. (I can't recall if 1 ever really changed his outlook at all, so I'll admit that if he did, I simply didn't catch onto it enough to remember.) After about an hour of grinding through the dark, gloomy story, my group in the theater gave up and resorted to a popcorn fight, so... Take that for what you will about us or about the movie."
    },
    {
      "rating": "3",
      "text": "Boring. Repetitive animation, much of which makes little sense. We are to believe that a rag doll with a small razor can de-capitate a machine?? Pretty much a bore."
    },
    {
      "rating": "10",
      "text": "This is the best movie I have ever seen in my life. I have been counting the days for the sheer perfection of this indescribably brilliant film to swoop down from heaven to DVD and Blue-Ray. Any one age 11 and a third or over can should and hopefully will see this film. I have found that ever since I saw this beautiful piece of art 4 months ago I have not gone a single day without watching the trailer at least once. Life just wont be complete without seeing this film at least once."
    },
    {
      "rating": "0",
      "text": "The only reason I watched this movie in the first place was because of Tim Burton, and I'm being nice by saying it was horrible. One of the worst movies ever."
    },
    {
      "rating": "7",
      "text": "Set in a post apocalyptic world where all life on Earth has been wiped out by machines, or rather one machine in particular. This film focuses on the efforts of a group of inventions, numbered 1 to 9, who try to redeem the scientist who made both them and the machine that destroyed the world. The machine has been dormant for many years, but one of its progeny, a mechanical cat-like creature protects its lair and takes anything that moves into itâ"
    },
    {
      "rating": "6",
      "text": "A huge disappointment the trailers made it look better than it actually was, it turned out to be a boring mess with lame characters, the good things are that it was unique and could have been a good horror movie, but I still can't recommend it."
    },
    {
      "rating": "4",
      "text": "I dont know whats wrong with this movie. At first watch I thought it was cool but the voices just ruin it for me. I love how they make the movies like this but the characters just didnt do it for me, thought the movie was just boring and I love animation type movies but maybe this one just feel off the radar for me."
    },
    {
      "rating": "8",
      "text": "An excellent animated film with a lot more depth than movies like UP or WALL-E, yet because of its adult themes/visuals and apparent older target audience, it subjects itself to greater scrutiny, and comparisons with more complex adult-apocolypse type films."
    },
    {
      "rating": "10",
      "text": "Very well directed. The plot is very unique and \"9\" has great attention to details. The screenplay was simply fantastic. I would recommend this movie to almost all ages."
    },
    {
      "rating": "4",
      "text": "Etrange film d'animation avec ses petites créatures rigolotes plongées dans un monde post-apocalyptique où seuls les restes (ou presque) d'une guerre infernale ont survécu, c'est-à-dire les décombres...Cette histoire à la Skynet qui a mis la zone dans un environnement très steampunk n'est néanmoins pas très originale et les aspects poétiques (surtout vers la fin) voire carrément candides participent à ce bizarre mélange des genres, quelque chose d'aigre-doux à l'écriture un brin bordélique qui ne convainc décidément pas. Un peu trop sombre pour les mioches, trop neuneu pour les adultes en somme.La réalisation est de bonne facture et on ne s'ennuie pas... mais rien à faire, j'aime pas la boustifaille aigre-douce qui bouffe à tous les râteliers."
    },
    {
      "rating": "8",
      "text": "A very inventive movie with stunning visuals."
    },
    {
      "rating": "8",
      "text": "Nice tidy little experience,didn't take any chances,or stray from the main plot,but very good what they stayed with.The ending has to be controversial."
    },
    {
      "rating": "8",
      "text": "Though the story may be a rehash of a familiar theme, it is visually stunning."
    },
    {
      "rating": "5",
      "text": "9 is by far one of the weakest films of this year. The plot of this film involves a scientist who designs a robotic machine which creates multiple robot war machines which kills off humanity. The same scientist puts his soul into nine robots who all come together. With its plot this film has an intresting plot and has the characters. The film's most shocking moment is rather subtle in which the eighth robot sits on a dismembered human hand which is rather scary in its design. However this only briefly helps the film. The film's most difficult problem is it starts at a fast pace and only slows down by the thirty-five minute mark. By around one hour into the film the main enemy robot is killed in a false moment and when it appears the films over the machine awakens in a sequence in which the song \"Somewhere over the Rainbow\" is playing over one of the robots running from the machine. This scene is both effective and ridiculous in it's design. The characters are divided into several types, heroic, greedy, and cowardly, which makes the film somewhat evolve. I"
    },
    {
      "rating": "7",
      "text": "The movie is visually stunning and has a great score but the plot and character development are lacking. This could have been a truly great movie had they taken the time to flesh out the characters, add a little back story, and be more elaborate with the themes of the story. Also, the ending was too ambiguous. Still, it was entertaining so I do recommend it. It was just disappointing because I've been looking forward to it for so long and it didn't quite meet my expectations."
    },
    {
      "rating": "10",
      "text": "Greatest movie ever! Great story line, spectacular action sequences, Tim Burton does it again. One of my favorite movies."
    },
    {
      "rating": "8",
      "text": "I thought it was pretty good not as good as other animated movies, but certainly one a kind i would see it to find out for your self!!!"
    }
  ]
}