{
  "id": 3339,
  "title": "A Bad Moms Christmas",
  "starring": [
    "Mila Kunis",
    "Kristen Bell"
  ],
  "runtime": 104,
  "genre": [
    "Comedy"
  ],
  "description": "Amy, Kiki and Carla – three under-appreciated and over-burdened women – rebel against the challenges and expectations of the Super Bowl for mothers: Christmas. And if creating a more perfect holiday for their families wasn’t hard enough, they have to do all of that while hosting and entertaining their own mothers.",
  "releaseYear": "2017",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/gPNHolu7AGnrB7r5kvJRRTfwMFR.jpg",
  "categories": {
    "plot": 5.8,
    "acting": 5.615384615384615,
    "ending": 6.5,
    "soundtrack": 6.0,
    "cinematography": 7.0,
    "familyFriendly": 3.0,
    "funny": 5.321428571428571,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "1",
      "text": "Women saying curse words, hahahaha, hilarious! Seriously though.. that is the entire joke of the movie."
    },
    {
      "rating": "3",
      "text": "let it go..A Bad Moms ChristmasCarrying the whole movie on a script of a daily soap episode is too much even for 104 minutes runtime since the only thing you rely on are some verbal sequences between Mila, Kirsten and Kathryn which are quite funny"
    },
    {
      "rating": "8",
      "text": "What do you expect when you go see a Bad Moms movie?  You know it’s not going to be nominated for an Oscar.  You go see it because you want to have fun!  And that’s what “Bad Moms Christmas” is.  Lots of fun!  I went with a bunch of ladies and we all enjoyed it and had a great time watchIng it.  Adding the Moms’ moms was inspired!  Cheryl Hines is adorable and so funny as Kiki’s mom.  They are like twins!  So alike!  Christine Baranski is great as Mika Kunis’ character’s mom.  Nothing pleases this woman.  My least favorite was Susan Sarandon just because the character she plays is just so typical Sarandon (in my opinion anyway).  All the moms visit our Bad Moms at Christmas and make the Bad Moms lives extra crazy, even as they decide to “take Christmas back” and relieve some of the stress and pressures of being “the Mom” in the household at Christmas.  All holiday preparations fall on them.  I was worried they would go totally over the top and tip the raunch scale or the stupid scale like “Rough Night” (a truly terrible movie!).  I am happy to say that I didn’t feel like they overdid anything too much.  Not only funny and fun, but truly touching at times.  A great fun watch for a group of ladies to all see together!"
    },
    {
      "rating": "5",
      "text": "My review of the first one pretty much sums up this one (search this site to read it). To add heft to the sequel, each of the original trio has their own moms show up for the holidays. Christine Baranski creates the kind of upscale **** character she does so well. Cheryl Hines is sweet and wacky. Susan Sarandon plays to maverick type. The abilities of this capable trio adds some comic heft. The gags are about the same level of mild humor as the first one..possibly less intentionally outrageous. Nothing especially new or particularly funny here. Typical sequel stuff with more maudlin moments. Best appreciated by moms looking for a few minutes' escape."
    },
    {
      "rating": "7",
      "text": "I went into this movie expecting the worst and truthfully only went to have some popcorn and chill. To my surprise, i actually kinda liked and enjoyed it. there were some funny lines, especially from the woman (from the 'good wife'). It has a christmas subplot so that was nice too... at this time of year. it was a guilty pleasure. to compare -- i saw 'daddy's home 2' and was annoyed the entire movie. i could have walked out of that one."
    },
    {
      "rating": "4",
      "text": "This was pretty rough to sit through. The pacing was quite strange and story structure was just bizarre. Even the acting was almost intolerable. Chirstine Baranski and Kathryn Hahn were fabulous, but that is to be expected."
    },
    {
      "rating": "2",
      "text": "Bad just got worse. This pathetic excuse to get money from your wallet is another way to celebrate the holidays and despite the attention it gets, A Bad Moms Christmas doesn't literally deserve to be watched where it would be both be a waste of time and money."
    },
    {
      "rating": "7",
      "text": "This movie was so much better than I thought it would be. I cried twice! FUNNY, touching and solid performances. Christine Baranski is amazing, as are Susan Sarandon and Cheryl Hines. Surprise appearance by Wanda Sykes! Hilarious and well worth the money. Better than the first one, I thought."
    },
    {
      "rating": "0",
      "text": "Another horrible \"women behaving badly\" movie written and directed by men who see us all as mindless, desperate, vulgar, drunken whores with all the same tired jokes and references. Totally offensive to women on all levels. DO NOT WASTE YOUR TIME OR MONEY."
    },
    {
      "rating": "4",
      "text": "Three overburdened young moms try to meet and then rebel against the challenges of „Super Bowl for moms“ – a perfect Christmas.It’s a sequel to „Bad Moms“ released in 2016 summer which turned out to be quite a breakout hit, earning over 180 million cinema dollars against the 20 mil budget.Ah, the grrl power comedies, the cute but mostly unfunny younger sister of American mainstream comedies which were kickstarted by 2011’s hit „Bridesmaid“, and Hollywood’s eager wish to prove that women can be funny too.Well anybody can funny, of course, but you can’t really create a noteworthy all-female comedy without decent script and performances, and/or actresses’ ability to improvise, and this is where the new grrl power comedies fall short usually.„A Bad Moms Christmas“ is a good example of this. Like many mainstream comedies, it has enough of everything to get the ball rolling, but the result feels so humorless and lacking that you will probably start checking your watch/phone before it reaches midpoint, at latest.One problem is the generic screenplay, the other is the fact that despite all the talent involved, the story centers on three leading ladies, two of which are not good enough performers to carry this movie.Mila Kunis and Kristen Bell are always decent supporters but they lack the acting range and presence to justify carrying a comedy. I am not even sure that they have enough star power to justify lead parts in a budding comedy franchise.So it’s up to third lead Kathryn Hahn to do most of the the heavy lifting, and she’s solid as usual, being able to entertain, display some acting chops and create emotional connection with the audience.All the other players are relegated to the sidelines, and have little screen time or almost nothing interesting to do. But they do it well, so I am gonna name them all:* Christine Baranski, Susan Sarandon, and Cherly Hines as the bad moms of the bad moms visiting for Christmas – all veteran actresses, all giving much better performances than Bell and Kunis;* Jay Hernandez, Peter Gallagher, Justin Hartley, Lyle Brocato – various love interests of bad moms, mostly there for decoration. Hartley is surprisingly memorable as male stripper with golden heart.The introduction of his character, an affectionate conversation during balls and anus waxing, is probably the best part of the whole movie, both warm and funny. I was as surprised as you probably are reading this.* Wanda Sykes, Christina Applegate, Cade Mansfield Cooksey – quick comedy reliefs, little screen time but a great value to the whole movie. If „Bad Moms 2“ will make you laugh at all, then it would probably happen thanks to them.I’ve seen some good modern christmas comedies, such as „Elf“ and „The Bad Santa“, but this is not one of them. „A Bad Moms Christmas“ is just never funny.The first hour is watchable but unremarkable, the remaining 45 minutes are just too cliche-y and frankly boring to care.Also, I was surprised to find that \"Bad Moms 2\" is rated R in the U.S. cinemas – for crude sexual content and language throughout, and some drug use. Because compared to possibly every other modern raunchy comedy I have seen, it sure feels meek and mild. They even manage to make the promising end-credits dance number as unsexy as possible.So... Avoid it, till it reaches Netflix or something, or when you desperately need some comedy you haven’t seen yet.By the way, Jon Lucas and Scott Moore, the writing-directing team behind the franchise, are already planning the spin-off „Bad Dads“.Probably gonna be as hollow and sackless as, say, „Horrible Bosses“. I am surprised if they will not try to bring in Jason Sudeikis or Jason Bateman, the charming crownprinces of sackless modern comedy movies."
    },
    {
      "rating": "3",
      "text": "To tell the truth I did not enjoy the first movie, I understood it's appeal but there was nothing of my interest in it. It wasn't really funny but I was also able to understand why there were people who enjoyed it.Was a sequel necessary? No, damn it, it wasn't, but Hollywood is about money and money in this case was the whole deal.The ironic thing is that I don't understand what the hell the people in the studio were thinking, how the hell they throw a Christmas themed movie with almost two months to go before Christmas and also facing a film like Thor: Ragnarok.But not only that, it's noted that the script was made hastily on the simple pretext of catalyzing the unexpected success of the first film. They try to do bigger stuff by adding the grandmothers but squander them with such a poor story and such a simplistic moral.This is a forgettable film made with sole pretense of making easy money. I hate when things like this happen."
    },
    {
      "rating": "7",
      "text": "I came in with low expectations but it turned out to be pretty good! Christine Baranski and Cheryl Hines were particularly strong. Could've done without Wanda Sykes though."
    },
    {
      "rating": "7",
      "text": "This movie felt like an update to the first movie, but was decently followed up. The actors where good and although I did not have any expectations, because I am always trying to be objective it's was average performance, except for Mila Kunis which felt really genuine. The director's style and the cinematography was average for most part and there where a lot of overused slow motion scenes and a lot of exaggerated actor's expressions in these scenes and in emotional scenes as well. Despite all this the movie created a lot of funny and hilarious scenery so there is credit for the director. The humor was very solid, and had a lot of laugh out loud moment. The plot was simple but there where a couple of warmly welcomed twists that you can not see coming which made the movie overall better. So in conclusion the movie is a good movie, and despite all it's fault the message of it is quite strong and touching as well."
    },
    {
      "rating": "7",
      "text": "While the first act of this movie is mostly a setup involving a lot of low-brow scenes and too-easy jokes between the main characters - albeit with a few laugh-out-loud moments - it settles in to a more consistent story line by the second act and then offers an emotional and satisfying final act.  Despite some lazy writing early on, there are both funny and touching scenes.  Not an Oscar-winner, definitely, but just as good as many other seasonal films that have received better reviews."
    },
    {
      "rating": "0",
      "text": "Yikes, what a POSWe genuinely enjoyed the first one.This one was switched off after 15 minutes.It really is that bad."
    },
    {
      "rating": "6",
      "text": "A Christmas sequel that has many hilarious moments, this is an unecessary but generally entertaining film which is very thin on storyline, relying heavily on humour and performance to carry the increasingly ridiculous plot. The central theme of the complexity of mother-daughter relationships is the only real focus of the film, and there are moments with emotional resonance that captures the spirit of a 'holiday film’ with an endearing honesty which makes up for the sloppy pacing. Not quite a 'family film', though mostly because of language, this is a fun and silly film which had the audience laughing the entire way through. 6.34/10"
    },
    {
      "rating": "4",
      "text": "Nobody really wanted this movie. It’s not horrible but the decent jokes from the first one are nowhere to be found. This movie was obviously just for fun, which it was, but that doesn’t take away from the lack of a good plot."
    },
    {
      "rating": "10",
      "text": "Es buena, no es mejor que la primera, pero es buena, estoy esperando que sigan con la siguiente película."
    },
    {
      "rating": "6",
      "text": "Not as funny and so overly sentimental. A limp sequel.'A Bad Moms Christmas' is basically 'Daddy's Home 2' - which, interestingly, was released less than a week after this. Mila Kunis (Amy) in the lead role isn't as strong, nor are Kristen Bell (Kiki) and Kathryn Hahn (Carla) unfortunately. They have a few bits, but not enough. Christine Baranski, Cheryl Hines and Susan Sarandon are meh newcomers.The ending particularly dragged, with it going full on preach mode and is far too cutesy. It'd be fine if it also wasn't so predictable. I noted the music in 'Bad Moms' as being good, but even that drops a level in this follow-up film.It could've been worse, I guess, but I just didn't find entertainment with this."
    }
  ]
}