{
  "id": 2763,
  "title": "A Beautiful Mind",
  "starring": [
    "Russell Crowe",
    "Jennifer Connelly"
  ],
  "runtime": 135,
  "genre": [
    "Drama",
    "Romance"
  ],
  "description": "John Nash is a brilliant but asocial mathematician fighting schizophrenia. After he accepts secret work in cryptography, his life takes a turn for the nightmarish.",
  "releaseYear": "2001",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/zwzWCmH72OSC9NA0ipoqw5Zjya8.jpg",
  "categories": {
    "plot": 8.391304347826088,
    "acting": 7.466666666666667,
    "ending": 4.5,
    "soundtrack": 7.5,
    "cinematography": 5.0,
    "familyFriendly": 6.0,
    "funny": 9.0,
    "action": 8.5
  },
  "reviews": [
    {
      "rating": "10",
      "text": "A beautiful mind is a truly amazing and beautiful film, and one of the best films that I have ever seen. A beautiful mind tells the story of John Forbes Nash Jr.( portrayed with uncanny brilliance by Russell Crow) A brilliant mathematician and code breaker who's genius is crippled by mental instability and only his devoted wife and friends can help him trough his times of trouble as he looks for the answers in his own life, A beautiful mind is one of the best biography films I've seen yet. It's an amazing portrayal of courage and strength that will show everyone that just because your lost doesn't mean you can't be found. I very highly recommend this amazing film."
    },
    {
      "rating": "8",
      "text": "This conventional yet wonderful biopic is both haunting and heart-warming at the same time. Director Ron Howard conducts the plot with such a compelling sensitivity that will have most people drying up the tears on their faces while watching it. There are surprising plot twists, beautiful imagery and many touching moments. A solid, competent film that deserved every Academy Award it received. Highly recommended for those who enjoy moving, dramatic motion pictures."
    },
    {
      "rating": "10",
      "text": "Whenever Crowe is in a movie... everyone sparkles! What an inspiration. The other actors (Connelly so good) are certainly very good too, but Crowe is beyond ekstraordinary good! Fantastic!!! Love this story also. About ackward people, who are seldom wanted in our 'normal life', but we can't and must not live without them. Who can make them hero's other than prizes and sometimes a beautiful movie."
    },
    {
      "rating": "0",
      "text": "Heartlessly inaccurate, exploitative, and slandering. It takes mental illness along with John Nash's life and unsympathetically lies to you just to earn Oscars. It portrays the mentally ill as violent and the mental health world as an incompetent sham of an institution. It fabricates and overstates virtually every aspect of John Nash's life for the sake of more melodrama. It's not impossible to think that the mentally ill were further stigmatized and slandered by this astronomically overstated portrayal of both schizophrenia and John Nash's own experience with it. It's so mind-bendingly insensitive and callous to its source material that it's an unrestrained travesty that it exists, much less win eight Oscars. It shamelessly deceives solely for that purpose alone. Deserves no praise, since it is all manufactured exclusively for that."
    },
    {
      "rating": "7",
      "text": "A nice film, has all the generic things you'd expect so something for everyone. But perhaps that's the problem as well. I expected it to be much more focused on the theory and academic aspect rather than the more personal side. Overall it's a decent movie but you won't learn anything from it. I think the pacing of the film as well as the journey of the main character is very well presented and the general quality of acting is pretty good. It's engaging and definitely worth watching."
    },
    {
      "rating": "10",
      "text": "i'ts great i dont know why the critic's are bad with this movie."
    },
    {
      "rating": "0",
      "text": "This guy, Nash, going to an ivy league school should have been able to\rresearch possible causes of psychosis/delirium. Could he not suspect\rheavy metals such as lead, with his extensive training? The doctors\rrefuse to detox patients? How hard is it for people to understand lead\rpoisoning and the dangers of heavy metals? The doctors could have used\rheavy metal chelation. They could do it for the navy in the 1960's but\rfor regular people no? Mr Nash should have had proper treatment,\rinstead of them leaving him sick and calling it an awful illness. Then,\rglamorizing it as a Hollywood spectacle. Come on help these poor\rpeople."
    },
    {
      "rating": "5",
      "text": "This is the work of a professional. Ron Howard knows how to manipulate us. Here's the important scene at the start. Here's the big moment, etc. Here it comes the music to help you cry or feel. But in the end, its soulless. Even if Crowe tries, this just wasn't a man. This was an edited life of a real man. Edited enough for you to like him without trying to really understand a troubled man and his problems. Because its \"well done\" it gets a five."
    },
    {
      "rating": "3",
      "text": "Even if you ignore the fact that Nash's homosexuality was completely ignored, what about his first son who was never mentioned? The one he failed to support financially. What about his strained relationship with his wife? What about the ridiculous and non-factual introduction of his imaginary friends, which are used as a Greek chorus by director Ron Howard because he couldn't move the story along any other way. Badly filmed Hollywood whitewash."
    },
    {
      "rating": "8",
      "text": "A Beautiful Mind is about an aspiring math student whose mind seems to deteriorate further and further. The only thing keeping him in the \"real\" world is his girlfriend and later wife, while everybody else around him seems to misunderstand his quirks. A great movie with a great plot-twist, which can't really be addressed in a spoiler-free review. I don't know if it's an accurate depiction of mental illness, but it has impact, and I think that that's all that counts."
    },
    {
      "rating": "3",
      "text": "too conventional and too sweet considering that it's about an unconventional life of a genius mathematician. certainly not the best of 2001 ( a great year for movies)."
    },
    {
      "rating": "8",
      "text": "A very good movie but can be a little to heavy.  Slow paced but worth watching."
    },
    {
      "rating": "10",
      "text": "it's a classic. i love the story. i usually don't like Russell, but in this movie is great. the movie shows the fight with a particular disease. the society is usually rejecting these kind of people."
    },
    {
      "rating": "8",
      "text": "A great cast and a superb script help the story of Nash's troubled mind become an exhilarating and mesmerising experience that will be hard to forget. First class!"
    },
    {
      "rating": "6",
      "text": "Very average film, Crow's performance it's hard to believe, it is definitely a good story but it was a bad selection on the actors, not saying that the ones that appear on the movie are bad actors just think they are not the best for this particular story. Slow in some parts of the movie. If you want to know Nash's biography but you don't want to read you may watch this movie but don't expect too much thrilling moments."
    },
    {
      "rating": "4",
      "text": "The 2nd act is horribly paced. It felt like most boring and linear film I'd ever seen. The ending is a bit of a saver. Strong performance from Russell Crowe and Ron Howard directs well for the most part but at the end of the film, I was most glad that I was able to finish the film without dozing off."
    },
    {
      "rating": "0",
      "text": "ArtificialToxic movies that I hate forever I really believe that films like this harm not only the cinema but also our worldAfter watching this movie, I had nausea with the noble knowledge of mathematics. Russell Crowe and Jennifer Connelly were the worst choices for these roles. This movie can't even make proper use of its very flawed script. A child's game in the world of politics and scientists. Everything in it seems too artificial.There is no positive point in this picture except an incomplete explain of a messy story. The ending of the film is awful and tries to deceive the audience. As the opening of the film is more awful and we don't know what kind of person we are facing. In my opinion, if Russell Crowe did not act in the movie and only read the dialogues, the result would be much, much better. At least we saw a human mathematician.I have seen his American Gangster Phil. It was very good there. Nothing is received from him here. A biographical documentary is even more beautiful."
    },
    {
      "rating": "5",
      "text": "Through \"A Beautiful Mind\", neither director Ron Howard or actor Russell Crowe understand what to actually do in this dull film. The lead and tone is tedious and mediocre, with absolutely 0% of plot twists."
    },
    {
      "rating": "0",
      "text": "tHIS MOVIE SUCKS! dON'T WATCH IT! DUDE IS A SOCIOPATH, AND THE STORYLING IS LAME, WITH A BUNCH OF CUSS WORDS! tHOSE WORDS SHOULD DEFINITELY BE BLEEPED OUT!"
    },
    {
      "rating": "5",
      "text": "Having seen all but one of the Best Picture nominees, I can very safely say, this is one of the last movies out of those that deserved to win. This was pure Hollywood at its most digestible. Whether or not one believes the circulated rumours that the movie left out the nastier details of Nash's life one still has the nagging feeling throught that one is being spoonfed baby food. The film is contrived in every way, as if Ron Howard sat back and said, \"Now what will it take to win the Oscar,\" and then mapped out the film. Look, if we want to be honest, there's nothing -wrong- with a crowd pleaser. And that is what this film, like Gladiator, like Titanic, and numerous other Oscar winners, sets out to do. It's less a piece of art than pop culture, the current in thing to fit the public's current mood. So, though one might be entertained, those of us who believe movies should be more than just entertainment are left with a nagging, empty feeling after watching it, that is hard to explain. After all, a movie that is calculated to please, should please everyone, shouldn't it? I guess not after all. I won't comment on Russel Crowe's performance. I've seen better, I've seen worse. I will comment on Jennifer Connelly's, which I thought was awful. I can't to save my life understand why so many people, including the Oscar voters, were so blown away. She seems best skilled at just standing there and trying to look pretty and confounded, eyes sparkling. Yaaaaawwwn. She's not acting in this movie, she's modeling. The occassional sudden burst of emotion seems contrived. Eyuck."
    },
    {
      "rating": "8",
      "text": "Maths genius, big career ahead of him, goes to work for the government or maybe he doesn't, schizophrenia, Nobel Peace Prize.Ron Howard's brilliant film about John Nash with a great performance by Russell Crowe & also a very good & strong supporting cast.The whole schizophrenia thing is done very well to the point where you really feel for the main character."
    },
    {
      "rating": "9",
      "text": "Great film!!! Crowe is awesome, he plays a genius and mentally sick man with bold and fine brushes. His decent into the dark side is wonderfully subtle and you forget that he's Russell Crowe and an Australian to boot. A true Brando of his generation. This film will not disappoint you, it might leave you a little blue, no heal clicking when you leave, but a true window  into mental heath and the fight to overcome its obstacles."
    },
    {
      "rating": "7",
      "text": "Bravo performance by Crowe.. yet again. Nicely directed and interesting storyline. Much better than average movie and one you will watch again every so often on TV - true test of a good movie imo lol."
    },
    {
      "rating": "10",
      "text": "This was truly a moving movie due to some superb acting.  Crowe is so spot on with his character that at times it is almost frightening.  Jennifer Connelly and Ed Harris are also wonderful (Harris being a blatant Oscar snub).  A great supporting cast and score.  To all the people who hated it because not everything was accurate: IT WAS A MOVIE IT DOESN'T NEED TO BE 100% ACCURATE!!!!!!"
    },
    {
      "rating": "10",
      "text": "A Beautiful Mind is a very touching movie. The way the plot develops,with subtle hints to the twist constantly popping up, is very well constructed and acted. A lot of reviewers say that the acting isn't great, and the plot drivel, but, I honestly believe, aside from the fact it is Hollywood writing all over, it works. It is good. I have never been so moved by a film in my life, and as incorrect some facts may be, if you take it as it is, and ignore some inaccuracy's, it's a great film. I should really have rated 9, but as I said, it's the most moving film I've watched."
    },
    {
      "rating": "9",
      "text": "Directed by Ron Howard A Beautiful Mind is based loosely on the biography of mathematician John Forbes Nash (Crowe). The film follows the eccentric Nash from his time at Princeton, struggling to think of an original idea that will get him noticed, through to his code cracking work at MIT but everything is not quite as it seems.\r A Beautiful Mind leaves out many of the more unsavoury aspects of Nashs life choosing to focus on his battle to save his career and marriage whilst suffering from severe schizophrenia. Russell Crowe is as fantastic as ever in the lead role and Jennifer Connelly deservedly won an Oscar for her portrayal of Nash’s long suffering partner Alicia. Both help to provide a subtle yet compelling look at one mans struggle to have his genius seen above his debilitating mental illness making for a truly moving film."
    },
    {
      "rating": "9",
      "text": "What can you say? Amazing film. For me, however, it doesn't deserve the 10 points because after the first two thirds of the film it kind of lost me. Yet, it's well directed and Crowe shows amazing acting."
    },
    {
      "rating": "10",
      "text": "The Idea of this film was so brilliant, so spectacular, so amazing, i just can't stop qualifying this film in the best ways possible. Russell Crowe (I still think he was better then Denzel Washington, but that's just my opinion) & Jennifer Connelly tear the whole film down, they were fantastic, 2 of the best performances that I ever saw. This is without a doubt Ron Howard masterpiece."
    },
    {
      "rating": "8",
      "text": "Probably Ron Howard's best film, incredible story and excellent performance by Crowe."
    },
    {
      "rating": "10",
      "text": "This film is absolutely stunning. I have been a great fan of Russell Crowe for a long time now, and when I heard what this was about, I had mixed feelings. It wasn't even close to the things I would usually watch. But when I sat down to see it, I was truly amazed. The acting done by all the cast is just great and so believable. And the fact it was based on a true story just blew me away, as I only found that out after I had seen it. Even thinking it was just made up, it left me in tears at the end, and I wouldn't usually get sad with films. I strongly urge all who reads this to watch this film."
    },
    {
      "rating": "8",
      "text": "There are quite a few geniuses floating around this one. John Nash himself, Russell Crowe as John Nash and Ron Howard for conducting this brilliant look at the mind and intelligence."
    },
    {
      "rating": "10",
      "text": "This was by far wonderful movie. Not only did it give the reality of the 'sane' characters, but it gave a reality to a schizophrenic so that you don't even know he is one until half way through the movie. A success in every way. More movies should be this bold."
    },
    {
      "rating": "8",
      "text": "As a whole, A Beautiful Mind is a good film that is overshadowed by the performance of its lead actor. Yes, Jennifer Connelly, Ed Harris, and Paul Bettany, are all great here and in general, but holy cow does Russell Crowe stand tall. Truly a masterful performance from Crowe, his performance makes the film, though the film  itself is certainly interesting. Ron Howard's direction is typically strong here and he does a good job telling the story of famed mathematician John Nash. However, where this film is most strong in terms of story is in its telling of Nash's struggle with schizophrenia. In a way, it really opens your eyes as to how it is to live with schizophrenia and suffering through the delusions associated with it. In a sense, this is one of the better films on mental disease ever made as it paints a very real, distressing, and disturbing portrait, all of which make you appreciate the genius of Nash all the more."
    },
    {
      "rating": "10",
      "text": "I've seen some movies about peoples life. I've never seen any movie which showed how a intelligence feels like. Russell Crowe nails the role of Prof. John Nash. This movie made me to curse myself of not having any interest  in math. Never before the numbers and mathematical genius attracted me. This movie has one of the best emotion filled scene in the movie history."
    },
    {
      "rating": "8",
      "text": "Russell Crowe really shows his real talent making this film. He is one of the best actors I have ever seen. The movie is incredible. Very emotional with a beautiful story, and some really unexpected twists that I simply couldn't believe. The character development here is very deep, and the main story will really get under your skin."
    },
    {
      "rating": "9",
      "text": "A Beautiful Mind is an outstanding cinematic achievement. Great film. Good story."
    },
    {
      "rating": "8",
      "text": "Very good and inspiring.  Shows mental health in a different light than we are used to seeing."
    },
    {
      "rating": "10",
      "text": "A Beautiful Mind is a truly beautiful movie through its emotionally and thematically rich love story driven by the masterful brilliance of Russell Crowe's oscar deserving and Jennifer Connelly's oscar winning performances. This intensely dramatic tearjerker is a deep and meticulous study of mental illness."
    },
    {
      "rating": "10",
      "text": "It's sweet as hell. Russel Crowe is the man."
    },
    {
      "rating": "10",
      "text": "This movie is about the power of love, i think no body really get it, more satisfactory than a beautiful mind is finding a beautilful love."
    },
    {
      "rating": "10",
      "text": "This movie is modern classic - extremely well put together. For metacritic to attract only a 72, alongside slash and beat movies, shows that this place is frequented by the wrong crowds. Something is broken with metacritic to give this a 72, IMO."
    },
    {
      "rating": "10",
      "text": "I personally think that this is one of Ron Howard"
    },
    {
      "rating": "6",
      "text": "Oh, please. People are rating this movie a 10, placing it in the company of the Godfather, Citizen Kane etc? Formulaic but intriguing."
    },
    {
      "rating": "10",
      "text": "This is only a split second of the life of John Nash, and I can only try to imagine how his life has been for him, and for his family. But the movie did its finest work there. It might not tell the hole truth, but it is what you want to tell the viewers, that is important here, a hint about a very special life of a genious."
    },
    {
      "rating": "1",
      "text": "Sugar-coated, inaccurate and manipulative drivel that is only rescued from the depths of utter unwatchability by Connely's stand-out performance."
    },
    {
      "rating": "10",
      "text": "Best film ever. invidual. awsome."
    },
    {
      "rating": "8",
      "text": "The hidden point would be the following. Nesh has mathematically proved that socialism is a better system then capitalism. But I believe Nesh himself was not aware of that. He was a genius, but for mathematics, not for social sciences. Because of this essential prove he made, he came into a strong CIA and FBI focus as a serious threat for American system. It is a terrible shame what they did to him (giving him \"top-secret tasks\", following him to see if he has contacts with USSR, and finally taking him into mental intuition. (would a normal society take its famous scientist into a mad-house during his lectures to a distinguished audience given in a distinguished place?). Nesh has always been a true patriot, but nevertheless CIA/FBI doubted him and made him really suffer. Think about this while watching the film again and again, and try to disprove the point made here."
    },
    {
      "rating": "10",
      "text": "72? Some of these critics honestly don't know shit, this is one of the most powerful, captivating and interesting drama movies you can see, the acting and the story is very involving, the movies soundtrack is just bliss, I could watch this film over and over and over, by the way Ed Harris is great in this film, its true."
    },
    {
      "rating": "9",
      "text": "A Beautiful Mind is an outstanding cinematic achievement. On one hand, that is because of truly Oscar-worthy filmmaking in every possible aspect, but on the other, graver hand, this is due to it introducing a mass audience to mental disorders. As all but an expert on this topic, I'm in no position to assess whether the film is realistic and respectful to actual patients, but bringing people closer to the minds of schizophrenics and other mentally ill by making a star-studded Hollywood film out of their perspective is rating praise already. Ron Howard realized a great mixture of drama, romance, action, and humour with A Beautiful Mind, something many directors attempt to do nowadays, clearly resulting from the award-winning prospect it brings along, but only very few succeed in. Story-wise, the film is immensely entertaining, touching, and just as beautiful as its title suggests. Another major merit of the four-time Oscar winner is its lead actor Russell Crowe, going from heroic action star in Gladiator to socially awkward genius in just two years. Thus, A Beautiful Mind is a more than deserving Best Picture winner at the Oscars and a film worth watching more than once."
    },
    {
      "rating": "5",
      "text": "Slow and steady does not win this race depicting the troubles of John Nash's struggles with schizophrenia while working hard on his scientific work"
    }
  ]
}