{"id": 3553, "title": "A Beautiful Day in the Neighborhood", "starring": ["Matthew Rhys", "Tom Hanks"], "runtime": 109, "genre": ["Drama", "History"], "description": "An award-winning cynical journalist, Lloyd Vogel, begrudgingly accepts an assignment to write an Esquire profile piece on the beloved television icon Fred Rogers. After his encounter with Rogers, Vogel's perspective on life is transformed.", "releaseYear": "2019", "mpaaRating": "PG", "imageUrl": "https://image.tmdb.org/t/p/w500/p9vCAVhDK375XyobVcKqzqzsUHE.jpg", "categories": {"plot": 7.481481481481482, "acting": 7.537037037037037, "ending": 5.0, "soundtrack": 8.5, "cinematography": 5.0, "familyFriendly": 6.904761904761905, "funny": 9.0, "action": 9.0}, "reviews": [{"rating": "8", "text": "Like millions of others, I loved growing up watching 'Mr. Roger's Neighborhood' as a kid. So I was excited to both revisit some of my childhood and also watch what I knew would probably be a touching little film. And sure enough, I was right! Emotionally, it struck all the right chords with me and made me sympathize for just about every character, not unlike how Mr. Rogers felt towards everybody. Speaking of which, this film perfectly showcased how empathetic and just how big of a heart Mr. Rogers had for everybody. And of course, who better to play one of the nicest guys in the world than one of the nicest guys in Hollywood, Tom Hanks himself! He gives an always reliable and tender performance in this, alongside Matthew Rhys, who plays the hardened and bitter journalist assigned to interview him. Aside from a couple of rushed and slightly forced plot elements towards the end, this is definitely one of the best \"feel good\" films of the year, and even manages not to become too sentimental or sappy."}, {"rating": "9", "text": "First of all, the trailers and posters might have you believe this film is mainly about Mr. Rogers but no it isn’t. The movie mainly follows Lloyd and what’s going on in his personal life and I really enjoyed it. Do I wish that the advertisements were more accurate to the actual movie topic sure but I understand their decision on why because of money. But honestly it was an interesting story to watch and I enjoyed it. This is also helped by everybody in this movie giving it their all. I’m too young to have watched the actual show growing up but I have seen clips from it and Tom Hanks just does an incredible job as always and I really hope he at least gets an Oscar nomination for best-supporting actor. I mean he pretty much embodied Mr. Rogers and his mannerisms and it makes for an amazing performance. Matthew Rhys does an amazing job as Llyod. Every time you saw them on screen together it was glorious because you can see how different they are but how they are also helping each other. This movie was well directed, Marielle Heller, and shot. There were so many shots in this movie that I just thought to myself we need more of this in the world. There is one scene that I feel like everybody needs to check out and do at least once in their life. I did enjoy how it was filmed as if it was his show and we were just watching an hour forty-nine-minute long episode. The score by Nate Heller is an excellent one. In the end, A Beautiful Day in the Neighborhood is a movie that we need in this day and age and no matter how old you are I think everybody should check out this movie at least once."}, {"rating": "10", "text": "There's no tongue-in-cheek to be found in this simple gem.  A simple story about anger and redemption could have been maudlin, cloying.  But in the hands of Marielle Heller, director and Micah Fitzerman-Blue and Noah Harpster, writers, it was genuine and heartfelt.  My God, there were moments when the audience (capacity crowd) went totally silent.  You know, pin-drop silence.  The character Mr. Rogers drove straight through to the heart with his simple truisms about personal emotions, directed toward the second main character Lloyd Vogel (Matthew Rhys.)  And it was totally real and believable. It surely affected me!  I myself am dealing with anger, and hearing Mr. Rogers with his simplistic but penetrating truths, rang true for me. Another interesting detail - at one point in the movie, Mr. Rogers said to Lloyd, while seated in a restaurant: \"Let's have one minute of silence.\".  And, atypical of movie productions, which never show events in real time, the minute went on for exactly one minute.  I counted seconds to see if it would be one minute, and it was.  (And this was another point in the movie, where the audience was completely silent for that minute.)  Cool!  I love those moments, when I feel at one with the people in the audience, although I suppose that most people are not aware of it.  But that's why I choose to watch movies in theaters where are many other people, rather than at home.  People I'll never talk to, but whom I don't need to talk to.Tom Hanks as Mr. Rogers -  I guess he would seem a natural for the role, being a pleasant, endearing guy with a positive approach to life.  But in this role, he seemed a little out of his realm, curiously enough.  He seemed slightly awkward in the first half hour of the movie.  But then, he seemed to absorb the role and make it his own in the second half.  That made the movie easy to sink into.The portrayal of the TV show of Mr. Rogers was authentic, complete with piano and bells accompanying Rogers words as he spoke.  It even had the piano improvising, as in the TV show.I say, watching A Beautiful Day in Your Neighborhood would be time well spent."}, {"rating": "10", "text": "What a pleasure it is to (all too rarely of late) not have to warn folks away from a movie with a review.  Kudos to director Marielle Heller for her craftsmanship and subtle conceits throughout.  The framework of the movie itself takes the form of a typically healing episode of the show, a movie within a movie,  beginning with Mr. Rogers' classic entrance, then shifting to predominantly feature the grown child that needs his understanding, wonderfully played by Matthew Rhys.  Like me, he was too old to have been familiar with Mr. Rogers, so he was a revelation to both of us as we discovered the type of benign influence he had on generations of children.  We all learn that everyone of us has an inner child that sometimes needs a kind shoulder and guiding hand.  We're never to old for that."}, {"rating": "10", "text": "The greatest film of the year. A Beautiful Day in the Neighborhood will make you feel every emotion - and leave you longing for Mister Rogers and his radical kindness more than ever before. Marielle Heller is a master of her craft, Matthew Rhys shines in a subtle, yet relatable role, and Tom Hanks...is transformative. He brings the world as close to Fred Rogers as we will ever get again. Don't walk - RUN to see this movie with the people who loved you into being. 10/10."}, {"rating": "8", "text": "Yet another cinematic testament to the disarmingly kind genius that was Fred Rogers, albeit by proxy, as this is a most assuredly lesser version of the Mr. Rogers story (see Morgan Neville's masterful \"Won't You Be My Neighbor\" for the best, most authentic relation of this story that money can buy). Although, \"lesser\" in this case does not equate in any way to the word \"bad,\" as director Marielle Heller has delivered yet another effective, understated, and satisfying parable of a misanthrope learning how to be a better, more complete human being. With Matthew Rhys's underrated and underrepresented central performance, the drama is very real, affecting and emotional, evoking both tears of joy and sadness at numerous moments. And, though Hanks's may not entirely conjure up the exact portrait of Rogers himself, the spirit of the performance is absolutely on point, with the actor even managing to nail a few of the mannerisms from scene to scene as well. All in all, this is a difficult movie to pick apart, as I'm a simple man -- I see anything that has to do with Fred, I like anything that has to do with Fred. This is a film that Fred would most assuredly be proud of, so I am -- in turn -- glad to have seen it."}, {"rating": "10", "text": "Loved this movie (and I wasn't a fan of Mr. Rogers going into it). Emotionally compelling (wiped tears away several times). Creatively and artistically infusing the shows simple scale models with the dramatic scenes outside the show. Moving and believable character archs. And very inspiring depiction of a truly caring man who simultaneously seemed like a child, but not in a weird way. I think he seemed like a child because he allowed himself to exist in that mindset to reach children. Also maybe because he was so unjaded by life. Walked through a store yesterday and saw a magazine cover featuring the real Fred Rogers - I said to my wife, \"hey, there's our friend\" and she agreed. This was a result of what we encountered in the span of the movie the night before."}, {"rating": "7", "text": "Decades ago, we wanted more of Tom. Nothing has changed, the good nature, the sheer brilliance, the gifted talent that he is. We still want, need more of Tom.A Beautiful Day In The NeighbourhoodThe director Marielle Heller has never seen a fall. And the way she is going with, there will never come a day. Only because she has got style. Now, I know that watching this film or reading the logline of it or even thinking of the genre it drills in, \"style\" is not what you would imagine is her way in. And though it is not, she cannot help herself glorify the emotional journey that these characters are going through. Just walk yourself again with Matthew Rhys and how he drinks in the surrounding of his. Whenever the film transcends from one scene to another, the models of buildings in the city and bridges and cars in traffic and whatnot location are displayed resonating a clean if surprising message. It took me a while to fully understand the intentions; not that I still do, of the makers. For there comes a time when these characters do jump outside the four walls, we get to experience the outer world. But also at that time we are told that we are delusional if we think, this is what we are seeing. For Rhys is delusional. The film completely relies upon his body language, his facial expression, his practical perspective. When he first encounters Tom Hanks kneeled down, probably uncomfortable, puppeteering and singing a song or when the background score takes the charge of the film as Rhys rattles the cage hungrily or when he is told to be silent or metaphorically to calm down, we are with him, trembling on our feet. Tom's presence remains just like the role of Fred Rogers in our life. He comes in bits and pieces, episodically and enlightens what is already A Beautiful Day In The Neighbourhood."}, {"rating": "9", "text": "To be honest, I was highly skeptical about this film going in. I greatly enjoyed the Mister Rogers documentary from last year, and I didn't think that this one could hold a candle to the emotions generated by that movie. Boy was I wrong. you really do forget that Tom Hanks is not Mister Rogers within about 5 minutes after the opening titles. And the choice to make the movie about the Esquire writer is really genius. I thought Chris Cooper was inspired casting. The only downside to this movie was that it made me think about my life more than I wanted it to. Which can't be too much of a bad thing."}, {"rating": "10", "text": "This Movie Was Amazing!! I thought this would be a boring movie about everything perfectly fitting into place in a perfect mr. Rogers world. Nope, this movie has ups downs lefts rights, the movie is not just about mr. Rogers and it pulls it off flawlessly. This is my MOVIE OF THE YEAR! I gave this movie a 10 and it truly is a 10. Watch this movie!!"}, {"rating": "8", "text": "Great movie. Great man. Great actors. Great example. It’s rare to see something that is positive and so well done."}, {"rating": "8", "text": "A Beautiful Day in the Neighborhood is a wonderful tribute to Fred Rogers while also telling a good story about forgiveness and kindness. Obviously, Tom Hanks does a fantastic job. It’s one of those few perfect casting decisions. I can see no one else playing Fred Rogers. The rest of the actors do a pretty good job but my issue is with some of the characters. Some of the characters are not memorable but Matthew Rhys’ character was extremely unlikeable. The film tries to portray his character as unlikeable for the first part of the film but they did this a little too much to the point where I started dreading seeing him on screen. It does get better as his characters arc progresses but you don’t want to make your character too unlikeable or the audience won’t be able to sympathize with him. The story of the film is pretty good. I somewhat like seeing this overly pessimistic character being shown forgiveness and kindness from one of the nicest men on the planet. The film knows how to tug on your heartstrings and give a heartfelt story. Every word out of Tom Hanks’ mouth is so impactful and powerful. There is a beautiful scene in the later half of the film where Tom Hanks talks about death. It was incredibly beautiful and powerful to me having had a relative pass away earlier this year. I also really enjoyed the opening 10 minutes. It’s shot and looks like a Mister Rogers’ episode that introduces the main characters and the main themes of the film which I thought was great. There a handful of technical aspects that I really appreciated or liked. When the film transitions to different locations, instead of showing shots of the city, it shows a model of the city created in a way that looks similar to the models on Mister Rogers’ Neighborhood. I thought the music was pretty good although not very memorable, same with the cinematography. If you love Mr. Rogers’, then I think you might like this movie. Overall, A Beautiful Day in the Neighborhood showcases a fantastic performance from Tom Hanks with a beautiful and heartwarming story and themes even if Matthew Rhys’ character is extremely unlikeable for the most part."}, {"rating": "9", "text": "In lesser hands, such moments like the gentle sway of Tom Hanks’ Mr Rogers’ entrance as he delivers the opening of his TV show, or a spontaneous singalong of his theme tune in a New York subway, would be bordering on sickly in their sweetness. It’s in the supreme smarts of director Marielle Heller in pushing Lloyd’s hardships to the forefront of the narrative. Instead of over-indulging in the potential schmaltz of Rogers that allows the film to sidestep these pratfalls, discovering a sincerity and honesty in itself which is deeply affecting. From the outset there’s surreal flourishes to Heller’s direction peppered throughout also, as Rogers positions Lloyd as the key item to discuss on an episode of his show, that only aid the enchanting quality of its central dynamic.Whilst progress has been made in opening up such conversations, depictions of men being completely vulnerable with their feelings and difficulties, whether it be grief or anxiety is still too few and far between, so to witness the emotionally engaging duel between Tom Hanks and Matthew Rhys, as they look to meet on common ground is downright beautiful and will speak to its viewers in a multitude of ways."}, {"rating": "10", "text": "This film provides a phenomenal look into what it truly means to be emotionally vulnerable and empathetic, and how that vulnerability and empathy benefits your life, the lives of those around you, and all of society. These emotional practices do not come easy, though, and this film acknowledges that as well. Many viewers may have expected this to be more of a biopic, when really this movie focuses more on Lloyd Vogel (based on Tom Junod) and how his life was impacted by Fred Rogers. It isn't just a two dimensional look into a story. It will leave you thinking inwardly and about those you care about."}, {"rating": "6", "text": "Let's just lay these bones bare: it's not that 'A Beautiful Day in the Neighborhood' is a particularly bad movie, it's just that it's unnecessary.For those of us who live online-which is most of us, honestly-we all know that people like Fred Rogers and Bob Ross have seen a resurgence in their popularity lately due to their wholesome nature and have subsequently been canonized for sainthood by the online community.Partly as a result, director Morgan Neville began assembling the Fred Rogers documentary ‘Won’t You Be My Neighbor’ well ahead of the film’s 2018 release.  It played at Sundance on January 19th.  On January 29th, it was announced that TriStar Pictures had bought the worldwide distribution rights for the source material that would eventually become 'A Beautiful Day in the Neighborhood.'  See what we’re getting at?So 'A Beautiful Day in the Neighborhood' is essentially redundant and as is the case with any facsimile, the quality just isn’t as sharp.  Our recommendation?  Save your money and stream ‘Won’t You Be My Neighbor’ instead."}, {"rating": "6", "text": "The documentary \"Won't You Be My Neighbor\" was much better.  Like \"A Beautiful Day in the Neighborhood,\" it explored where the line was between Mr. Rogers' character and Mr. Rogers the real person and whether or not that hokey touchy-feely persona could be authentic.  But in the documentary, that exploration felt charming and nostalgic and hopeful.  It also went beyond Rogers as a cartoon character and showed his political activism.  In the fictionalized version, both Mr. Rogers and the movie itself came across as cloying and silly and boring. I love Tom Hanks, who doesn't, but this portrayal was rather comical. The real Mr. Rogers was childlike; Hank's portrayed him as a child. In this film version, we saw how Mr. Rogers touched one person and it felt a little like \"who cares;\" in the doc, we got to see how Rogers inspired so many -- it was just more impactful and moving. Chops, though, to some of the creative and artistic elements in the movie, like the recreated neighborhoods; that aspect actually elevated the experience from dull to watchable."}, {"rating": "8", "text": "“A Beautiful Day in the Neighborhood” stars Tom Hanks, Mathew Rhys (“The Americans”)  and Chris Cooper in this film directed by Marielle Heller (“Can You Forgive Me”). The screenplay was written by Micah Fitzerman Blue and Noah Harpster based on a feature article by Tom Jurod  that appeared in Esquire Magazine.  Instead of simply creating a biodrama based on the life of the respected and beloved Fred Rogers, it tells the story of the special friendship between Mr. Rogers and the writer of the Esquire article and how the journalist/interviewer for the article became more its subject than its interviewee. This is a warm and beautiful film showing the special person Mr.Rogers was, the high standards and values he lived his life by and how he tried to impart and share them with each child in his audience as well as those in his everyday life. When I first saw the trailers and promos for the film, I was somewhat taken aback by the plastic smile that seemed to be painted on Mr. Hanks’ face as he tried so hard to emulate, imitate and capture the essence of the person he was portraying. However, in actually viewing the film, the power of Mr. Hanks performance overcame, for me at least, that small visual obstacle I thought I would be encountering which I guess is something that only great actors can accomplish. Mr. Hanks can be Forrest Gump, Sully or even a gay AIDS victim and still carry it off, no small feat when the image of the star playing the role is such a dominant presence..I give this film an 9 for it not only captures the essence of its main character but allows the audience to gain knowledge and insight into the life of a very special human being."}, {"rating": "4", "text": "First off, I was never a fan of Mister Rogers (we were a Sesame Street household), but I don't think that affected my opinion of this deadly dull film (I gave 4 stars to last year's doc about him). Secondly, this is NOT a biopic, but a singular story about how a dour, cynical writer for Esquire learned to open his heart after his encounters with the famous TV star. Tom Hanks plays Rogers with a bland sweetness that rarely captures the warmth of Rogers. This whole affair feels like a Hallmark special with overcharged emotions and predictable dramatic developments. The pacing echoes the pacing on Rogers' show… glacial. The \"cute\" framing of this true story as a Mister Rogers' Neighborhood episode was an original approach, but it couldn't elevate the plodding treacle of this tribute."}, {"rating": "5", "text": "KNISSEN already hit the 2-3 points I was going to make. \"knissenNov 22, 2019The documentary \"Won't You Be My Neighbor\" was much better. Like \"A Beautiful Day in the Neighborhood,\" it explored where the line was between Mr. Rogers' character and Mr. Rogers the real person and whether or not that hokey touchy-feely persona could be authentic. But in the documentary, that exploration felt charming and nostalgic and hopeful. It also went beyond Rogers as a cartoon character and showed his political activism. In the fictionalized version, both Mr. Rogers and the movie itself came across as cloying and silly and boring. I love Tom Hanks, who doesn't, but this portrayal was rather comical. The real Mr. Rogers was childlike; Hank's portrayed him as a child. In this film version, we saw how Mr. Rogers touched one person and it felt a little like \"who cares;\" in the doc, we got to see how Rogers inspired so many -- it was just more impactful and moving. Chops, though, to some of the creative and artistic elements in the movie, like the recreated neighborhoods; that aspect actually elevated the experience from dull to watchable.\""}, {"rating": "10", "text": "I heard an interview with the director earlier this week and was prepared for the heart-warming feature. This movie is paced S L O W L Y, so be forewarned. Also, the acting is great, but it is a \"Mr. Roger's\" episode for adults. If you are needing a respite from the real world, come along and be my neighbor and relish this story about a man committed to \"radical kindness.\""}, {"rating": "6", "text": "Hanks is subtle and great, even when some of the film’s creative choices are obvious and distracting."}, {"rating": "9", "text": "An excellent tale of redemption and forgiveness wherein children's TV icon Mr. Rogers intervenes to help heal the anguish plaguing a hard-nosed investigative reporter and his estranged father. Tom Hanks delivers an outstanding, exceedingly reverent portrayal of the legendary and unlikely television star, as does Chris Cooper as the long-absent and now-penitent father figure. Director Marielle Heller serves up a heartwarming yarn whose innate predictability is creatively offset by a variety of inventive cinematic techniques and clever storytelling techniques. The picture could have used a stronger male lead than Matthew Rhys, and the back story of the protagonist's conflict could have been fleshed out a little more effectively, but the film otherwise comes through with a soothing quality that the world could use more of these days."}, {"rating": "1", "text": "(Mauro Lanari)A film so manipulative that it is of rare perniciousness. Nothing else to say."}, {"rating": "2", "text": "Very boring slow I fell asleep def will never see again I won't even suggest anyone to ever see it can't believe Tom Hanks took this role"}, {"rating": "0", "text": "So here’s why I didn’t like the Mr. Roger’s movie1) I was under the impression the movie was about Mr Rogers and it really wasn’t 2) I found it emotionless. I was so bored and the triggers that dramas usually create were non-existent 3) It went slow and was predictable 4) the film is almost 100% fictional I didn’t like it all."}, {"rating": "3", "text": "I may be one of the very few who never saw Mister Rogers's show and though I heard of him I didn't know what a nice guy he was and hard he worked to be one.If anyone could play him it had to be Mister Nice Guy Tom Hanks but in spite of the role he is playing, with his name and picture the only ones in the ads, he is more of a supporting player. Yes they show bits and pieces of him interacting with people, doing songs and using hand puppets on his television show but the main character is Matthew Rhys. His role as Lloyd Vogel, a writer for Esquire magazine, brings him in touch with Fred Rogers as he is on an assignment to do a 400 word story of the man as a hero.The main story revolves around Vogel and his father Jerry, played by Chris Cooper, who is an alcoholic and left his wife and children when she was dying. Without giving any spoilers his interview with Rogers turns into Rogers questioning him and learns about Vogel's father when the latter returns upon his daughter's, wedding day. I believe it is the first time the sister and brother have seen their father since he walked out.By this time you know exactly where the story is heading and where it will end and you keep on waiting for something to happen! Like Rogers this film is a nice film about a nice guy and Hanks plays him to perfection. Once you would like to see him explode but the closest he comes to doing that is banging on the lower keys of the piano. I have seen his wife Joanne Rogers, played in a brief role by Maryann Plunkett, on interviews these past 2 weeks and I wanted to ask her how was it living with a constantly nice guy!Matthew Rhys does a fine job as Vogel and it was great seeing Susan Kelechi Watson, from \"This Is Us\", playing his wife. I don't know who's choice it was for him to have that '5 o'clock shadow' but it was a bad choice.I was surprised to see one of my favorite actresses in the role of the Esquire editor Ellen played by Christine Lahti though the role demands nothing from her. Chris Cooper as the father does his usual fine job while Enrico Colantoni role in an abbreviated role as a publicist for the show.\"A Beautiful Day in the Neighborhood\" is a nice film but too low key."}, {"rating": "8", "text": "I watched Mister Rogers as a very young child from age 5 to 9.  My favorite part was the Land of Make Believe.  Tom Hanks really captured the demeanor of Fred Rogers, but keep in mind this is not a movie about Mister Rogers. Rather, it is a film about how Lloyd deals with his relationship with his father and how it has affected his life. Overall, this film was not what I expected it to be.  Fred Rogers was really an amazing person and I wish the film had focused mostly on that aspect and given us more of the history.  Fred Rogers basically saved PBS from dying in the early years because Nixon wanted to cut the funding.Overall, I did enjoy the film and it is well done, but I wanted to know more about the show, how it came to be and the story of Fred Rogers, not Lloyd Vogel.  Hanks should get an Oscar nod for his performance, but its more for supporting actor."}, {"rating": "6", "text": "I feel that I'm missing something here but sincerely I just think that beyond the excellent performance of Tom Hanks this film seemed quite common to me.There's quality on it I don't deny that, it works great as a feel-good film, which it is but in the whole background it never stopped feeling like an ordinary drama.It's undeniable that it's worth the time invested to watch Tom Hanks' work and because as I said the film has quality but I think that many of the good reviews it received from the press were overflowed more by the love and figure of Fred Rogers."}, {"rating": "10", "text": "I loved Mr. Rogers as a kid, and this movie is so much more than a replay of a Mr. Rogers episode. It's an adult perspective on a man whose messages can help people of all ages to better cope with their struggles with family, anger, self-worth, and so much more. It's soul food that we sorely need, and I'm not sure if there's a better way to get it than to look back at the incredible legacy of this man and his career and all the great messages and ideas he left for us. Mr. Rogers is timeless and a part of all of us."}, {"rating": "8", "text": "I was moved by this movie in spite of its obvious flaws. The message about anger management really hit home. The writing, however, was a bit heavy-handed and Tom Hanks's portrayal of Fred Rogers really bothered me.I met Fred when I was at the University of Pittsburgh. He was very comfortable being Mr Rogers and didn't seem to have any other way of being. It wasn't an act, it was himself. Tom Hanks seemed to be working very hard at the role; he didn't have the unselfconscious grace of the real Fred. At the very end, they have a shot of the real Fred singing. There's no comparison."}, {"rating": "9", "text": "A Beautiful Day in the Neighborhood is a joy-filled movie about one of America's greatest celebrities. Led by a great performance from Tom Hanks, this movie will definitely make you happy like no other recent film has."}, {"rating": "3", "text": "This isn’t the Mr. Rogers I remember. He was emotionally intelligent, not some pushy magician who could see into your soul. This was very disturbing."}, {"rating": "1", "text": "Love Mr.Rogers & I like Tom Hanks...…...But hate this movie...……………………..."}, {"rating": "9", "text": "A beautiful and touching film which has less to do with Mr. Rogers and more about a man's journey in forgiveness while having Mr. Rogers in his life. Well acted and finely composed."}, {"rating": "9", "text": "Abditn is a sweet drama with excellent cinematography. The cast deliver memorable performances. The surrealism quality to the 'tv show' sections was particularly well done. Great soundtrack too."}, {"rating": "6", "text": "Not a bad movie but surprised that this movie received so much acclaim.  Tom Hanks is great but this movie is more obvious than a Hallmark movie.  I was surprised to find out this isn't a movie about Mr. Rogers' life.  My mistake although I try to avoid trailers and reading about movies as then the movie is usually spoiled."}, {"rating": "10", "text": "Actually, I was reluctant if shall watch or not. Tom Hanks is compelling and heart warming as Fred Rogers, a man which specialty is to healing crippled people, crippled inside. A true life history about how moral values ever preveals in the worst of times."}, {"rating": "9", "text": "A Beautiful Day in the Neighborhood, inspired by a true story, is about how children's host Mr. Rogers (Tom Hanks) helps jaded journalist Lloyd Vogel (The Americans' Matthew Rhys) deal with his issues. This is just a really well-made film.This may be the feel-good film of the year. Beautiful Day is an extremely sentimental, and possibly tear-jerking, look at self-improvement. Rogers' nuggets of wisdom are really persuasive and a highlight of the film.That having been said, the movie could've been a little shorter. Vogel's negative traits are showcased so much that they get redundant. The scene that introduces the character's issues with his father never feels quite natural.Director Marielle Heller (who also did Can You Ever Forgive Me) has created a tightly edited and shot film. The whole thing looks nice. The moments where Rogers is filming his show really look like the original PBS airings. There are some creative and indie-style visual and presentation choices in this. (The film isn't too indie if that's not your thing and you were worried.) Music is real strong.There is some great acting in this. Now admittedly, Hanks can't fully replicate Rogers. The actor's large rectangular head just doesn't match, and he is unable to nail the voice. Still, it is an excellent performance; one of Hanks's best. Wouldn't be surprised if he got a best supporting actor nomination for this. He has Rogers' mannerisms nailed down. Hanks really encapsulates the man and brings such nuance, tackling both the empathy and wisdom of the man while also the melancholy aspects and the fact that he was odd. Hanks blends these facets so effortlessly. He truly gets lost in the part.Chris Cooper is also pretty versatile himself as Vogel's estranged father. Though she isn't in this much, Maryann Plunkett does a good job as Rogers' wife Joanne. Although Rhys and Susan Kelechi Watson, who plays Vogel's wife, are decent actors, they never quite shine as much as a lot of the rest of the cast.Overall this is just a really well made film and I recommend this."}, {"rating": "9", "text": "I’m sceptical when approaching movies along these lines and if you are also, do yourself (and everyone around you) a favour – just watch it regardless. There are many scenes in this pic that go to places very few movies, especially today’s, would dare to. That doesn’t exactly mean the moviemakers have been honest enough to tell the whole story of Fred Rogers and his remarkable personality but, where they do go --leads us to find out more for ourselves-- so that’s a good thing. The unusual sets are used with great success as stepping stones to other parts of the story - creating a better than might be expected connection to the real-life situations. What was to be expected is that democratically weighted PC Hollywood - shows little interest in exploring where Mr Roger’s sensitively-tuned philosophy was born. Here, he’s mostly presented as a humanitarian who wants to make the world, and our relationships within it better for us all...but there’s more to this complex TV personality than they care to explore.  Apart from this, ‘A Beautiful Day’ is modern movie making at its finest and most meaningful with well-realised performances throughout.  There’s another story about the time this real-life man, who, while being presented with an Emmy, dared to tell Television to ‘shut-up’ (in a nice way) and take ten seconds of silence, to stop screeching on about its own blindness to its own worthlessness - and spare a thought for all the real people, who during their developing years helped it/them become something better.  Of course, Mr Rogers was talking about thoughts and feelings many would now, no longer recognise or understand - especially when you look at the endlessness of its mostly soulless, fake-reality. This is certainly a man finely tuned to understanding our own reality.Should engage most audiences as it puts up a mirror to our own relationships and how we deal with them. One of the year’s best for people who want more than simplistic action flicks, and for those who still know how to extract the very best that movies about intelligent people might have to offer."}, {"rating": "10", "text": "Masterpiece of a film about resentment and redemption.  This one had my eyes watering a bit!  It amazes me how people don't care for slower dramas, when they are filled with great acting and story and characters.  Anyone who is resentful and hates life should definitely watch this, because they might see themselves in this movie.  Glad to be a part of my AA group where we talk about resentment from time to time, and in order to get rid of resentment, it HAS to be talked about or it consumes us."}, {"rating": "8", "text": "Esse é aquele tipico filme que deixa você feliz, acho que poderiam melhor no alivio comico, mas não é cansativo"}, {"rating": "5", "text": "To be fair I have not grown with watching Mr.Roger's so I do not know him as a person or a show host. Unfortunately for me the movie was pretty boring and really really really slow.Won't you be neighbor for me is the more interesting and really well done movie about the Tv Persona and the Real Mr.Rogers that respects its viewers time."}, {"rating": "8", "text": "\"A Beautiful Day in the Neighborhood\" tells the story of a pessimistic and angry magazine writer, Lloyd Vogel, who has a change of heart and perspective. The general story is one we have seen several times before in movies. The big thing that makes Lloyd have a change of heart is being assigned to write a piece on Mr. Rogers, played by Tom Hanks. Every scene with Hanks as Rogers is great. The scenes where Hanks is absent feel a bit empty. Lloyd has issues with his father and is mostly an unpleasant person. He has several interviews with Mr. Rogers and over the course of the interviews is able to forgive his father and become a better family man. The best part of this movie is Hanks' performance. HE brings his typical phenomenal acting chops to the role and brings to life the pathos of the real life Mr. Rogers. The movie is well-directed. It is filmed sometimes like an episode of Mr. Rogers' show, and then shot like a real movie, which adds a bit of charm to it. There are some weird sequences though, like in the middle of the movie Lloyd has a dream sequence where he is a puppet on the show and it is a bit weird. However, the movie as a whole is written very well and will hit you in the feels. It has a very inspiring message that will make you want to be a better person, and the world could use more of that right now. There is a bit of humor, but for the most part it is very melodramatic. It is a PG-rated movie, but this movie may not be entertaining for children since it is slower. I did enjoy it a lot, but I do see how it is not a perfect movie too, but it is a great piece of film. Overall, I give this movie an 8.5/10."}, {"rating": "8", "text": "A nice heart warming movie that will leave you smiling once you leave the theater, and the producers of this made a smart choice by adding some nice story and not just having it be a documentary like movie. Though I personally would've liked more about Mr. Rogers himself because I wasent expecting the main character to be Loyd and his family. But this movie overall is nicely satisfying with ups and downs surely making you walking out of the theater singing the Mr. Rogers theme song in your head."}, {"rating": "10", "text": "Best Movie ever. So inspirational. #letschangetheworld one day In the neighborhood at a time"}, {"rating": "7", "text": "Tom Hanks embodies Mr. Rodgers and it's time for this dry spell to end a nomination is long over due."}, {"rating": "7", "text": "A Beautiful Day in the Neighborhood Is Quite NeighborlyThe Stream: It’s not the Mister Rogers biopic you may be expecting.The Big Screen: A clever and off-beat Tom Hanks performance as Mister Rogers.The Final Bill: Everyone needs a reminder of the limits of humanity and the importance of kindness; and, this movie’s heart is in the right place.-Trip FontaineHello, Neighbors! This weekend we had a nice opportunity to see A Beautiful Day in the Neighborhood, which has been incorrectly deemed the Mister Rogers biopic. There is a healthy dose of Rogers in this movie, but you’re not just getting a cradle-to-grave story. Marielle Heller has directed this clever and sometimes off-beat movie with the essence of Mister Rogers sprinkled throughout. In short, the plot synopsis is that a cynical journalist is given an assignment to profile Fred Rogers as an American hero, and the encounter with Rogers affects the journalist in unexpected ways.The film is told like a Mister Rogers’ Neighborhood episode. The journalist is the central neighbor, who learns a lesson about forgiveness and anger through his assignment. The framing device allows Heller and her cast to boil down the essence of Fred Rogers and his importance to a generation. Matthew Rhys plays the journalist, who is cynically and emotionally closed off from his family. Tom Hanks plays Fred Rogers as genuine, friendly and like a comforting cardigan sweater. The specifics of what the journalist deals with in his family isn’t as important and what he is able to learn from simple conversations from Mister Rogers.Is this your kind of movie? I wasn’t particularly running to the theater to see A Beautiful Day in the Neighborhood, but I am glad I saw it. Either Heller’s direction, which includes fun and sometimes disorienting sequences involving Mister Rogers’ characters, or maybe it’s just a calm and smiling Hanks as Mister Rogers, that lulled me into easy affection for this movie. The production design of the set and the vignettes from scene-to-scene add some whimsy that was a nice departure to some the more serious and adult themes.Ultimately, A Beautiful Day in the Neighborhood is a nice movie with a good moral for all. Like many Mister Rogers’ Neighborhood episode, the viewer is edified and comforted into believing that humanity and emotions are manageable. That makes the film itself worthwhile for at least a matinee bowl of popcorn."}, {"rating": "4", "text": "I was misled to believe this film is biographical but it is almost entirely a fiction that just uses Fred Rogers as a character. The movie is quite dark for the most part, using the Fred Rogers character as the foil to its general theme.   It is not a movie I would ever watch a second time.  On the other hand, Hanks is the greatest actor of his generation and turns in a performance worthy of that reputation.  Without him I would rate it a 2."}, {"rating": "3", "text": "I don't know Mr. Rogers and just recently got to know his old show. I want to mention a strange thing i noticed in the first 20 minutes of the movie: When the director shows the Back stage of Mr. Roger's Neighbor show, we don't see any of the (male)directors of the show there - or anywhere after that - and instead we see \"Maggie\" (Margaret Whitmer) one of the producers and a chick who's the first AD...So now we change contemporary history because of feminism?"}, {"rating": "9", "text": "In 1968 I was a pubescent boy and Mister Rogers was not cool.But now I have 3 grown children and 4 small grandchildren and I see the genius of the show and the man. Tom Hanks is one of the best Actors of all time. See this movie and if you can see Won't you be my neighbor too."}], "recommendations": ["joy", "eddie_the_eagle", "gifted", "blue_jasmine", "marriage_story", "belfast", "the_intern", "the_glass_castle", "blue_valentine", "the_secret_life_of_walter_mitty", "morning_glory", "collateral_beauty", "scent_of_a_woman", "chef", "fences", "christopher_robin", "the_upside", "the_theory_of_everything", "the_terminal", "rain_man", "goodbye_christopher_robin", "moonrise_kingdom", "me_before_you", "cinderella_man", "me_and_earl_and_the_dying_girl"]}