{
  "id": 885,
  "title": "A Christmas Carol",
  "starring": [
    "Jim Carrey",
    "Gary Oldman"
  ],
  "runtime": 94,
  "genre": [
    "Animation",
    "Family",
    "Drama",
    "Fantasy"
  ],
  "description": "Miser Ebenezer Scrooge is awakened on Christmas Eve by spirits who reveal to him his own miserable existence, what opportunities he wasted in his youth, his current cruelties, and the dire fate that awaits him if he does not change his ways. Scrooge is faced with his own story of growing bitterness and meanness, and must decide what his own future will hold: death or redemption.",
  "releaseYear": "2009",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/t41VHjYItCYHBh2hijsTID44cNv.jpg",
  "categories": {
    "plot": 7.32,
    "acting": 6.611111111111111,
    "ending": 7.6,
    "soundtrack": 5.0,
    "cinematography": 10.0,
    "familyFriendly": 7.0,
    "funny": 4.333333333333333,
    "action": 9.0
  },
  "reviews": [
    {
      "rating": "10",
      "text": "I have heard the story of A Christmas Carol numerous times, but this adaption of the story is the greatest by far. It is darker than you would expect."
    },
    {
      "rating": "10",
      "text": "Loved this film, and for that matter loved Polar Express. Both are Christmas classics. The 3D was magical in this film, and time ZIPPED by as fast as the ghosts flew! The director has obvious affection for the original book and follows it very closely - it is my favorite adaptation of this classic. It will hold up even WITHOUT the 3D - that's how good it is. Looking forward to his next film. PS - I'm not a fan of Jim Carrey's comedies, but he is excellent in this movie."
    },
    {
      "rating": "8",
      "text": "\"A Christmas Carol\" is a exhilarating Christmas movie that  joyful remakes the original book into a marvelous interpretation."
    },
    {
      "rating": "4",
      "text": "Disney"
    },
    {
      "rating": "3",
      "text": "Zemeckis 3D movies look creepy. He should make a zombie movie, since all his characters already seem lifeless."
    },
    {
      "rating": "3",
      "text": "Sorry but this movie epicly failed and jim carry was NOT funny i almost wanted to ask for my money back it looks fake dosent have good acting trys to be funny and then later frighting but fails at both sorry but this should have a 3."
    },
    {
      "rating": "0",
      "text": "I would have walked after the film revealed the hoorible ghost of christmas past if my sister had not treated us. It had such a light voice and a lisp that you couldn't hear a word it said. The animation was redundent and with so few actors playing so many different characters, kids where getting confused whether they were the same person in different suits. Jim Carey and Gary Oldman have fun but i'm afraid thats all who will. Robert Zemekis needs to give up on this medium of film making because it's getting a bit old. I only hope that Peter Jackson and Steven Speilberg don't screw up Tin Tin with the same technology."
    },
    {
      "rating": "3",
      "text": "Dickens? Disney? Carrey? Seems like a marriage made in Heaven doesn't it? Well...just a little south of there perhaps. This movie was pretty pointless really. Very little story, very little characterizations (perhaps they think we know all that by now). Mainly an excercise in how to make a big screen, big money 3D (which I didn't see it in) movie! It this is what we are dealing with...spare us! Save yourself some aggravation and watch the 1938 version w/Reginald Owen or if you want a musical the fantastic version known as \"Scrooge\" w/Albert Finney ( a brilliant rendition). This one...\"Bah Humbug\"."
    },
    {
      "rating": "2",
      "text": "Animation was very interesting but the rest, horrible. I should have walked out, a complete waste of money. I could even be bothered to pay attention, I was bored out of my mind. The movie didn't draw you in, didn't keep your attention, a total mess. The kids weren't even interested it was a sad insult to Dickens work. Overall it was an overdone mess!!!"
    },
    {
      "rating": "6",
      "text": "its way too dark and scary for kids, but to be fair, its not a bad movie. Jim Carrey and the other actors were decent and the visuals were good."
    },
    {
      "rating": "5",
      "text": "This movie visually and script-wise is just a little too creepy to be a good adaptation of A Christmas Carol, although it does show some exceptional voice acting from Carey and Oldman."
    },
    {
      "rating": "3",
      "text": "The story is a christmas classic and it sports amazing visuals, but the visuals seem to overwhelm the movie so it can be a bit tiresome and overlong.  2/4 stars."
    },
    {
      "rating": "9",
      "text": "The movie critics reveal their profound ignorance. Dickens' tale was a scathing, satirical allegory that attacked Malthusian theory. To bash the film for remaining true to Dickens' dark vision merely illustrates the critics' lack of literacy."
    },
    {
      "rating": "10",
      "text": "This movie is ahead of it's time! it's brilliant, creative, and heartwarming. Way to go IMD and Disney! If you have not seen it yet, what are you waiting for?"
    },
    {
      "rating": "8",
      "text": "An exhilarating telling of the Dickens classic. Although the film is scary at some points, it still is a must-see for children of all ages."
    },
    {
      "rating": "10",
      "text": "This movie is not for wee ones..We took 2 of our grandchildren last night (4 & 5 yrs ).They were asleep in under 10 minutes..BUT WE WERE SPELLBOUND....Our kids are accustomed to 3-D.. no biggie.. but without dialog comprehension ..all that was left was frightful (though spectacular) cinematic OMG.. Zemeckis' use of pure Dickens"
    },
    {
      "rating": "6",
      "text": "Motion capture captures terror. Everything looks dead on the screen, especially the people, so the sterility of the technology support the scenes where warmth is in absence. (That's why Bob Cratchit and Tiny Tim don't quite come across; they're supposed to be warm bodies with warmth.) The whole sequence leading up to Ebenezer Scrooge's visitation by The Ghost of Christmas Past contains more dread than most live-action films centered around haunted houses. You understand Scrooge's need to keep a fire going in the fireplace. It's not so much the snow, but the depth of his loneliness, communicated by the pot of thick soup he eats with a wooden serving spoon. There's no woman's touch in this house, no domesticity, no need for a plate and utensils. The flames can't lick the unreachable cold that has a deep freeze on his heart. Maybe the haunted house tropes work in \"A Christmas Carol\" because Scrooge's desolation is two-fold. Alone in a mansion, and alone in life, the old man realizes that nobody will mourn him, and this fact scares him more than the moving bells, the rattling chains and the dragging sounds of weights, instigated by his old partner Marley, who looks like hell and probably came from hell, too. The Ghost of Christmas Past is a candle. Perfect. A candle provides illumination on the events that are responsible for Scrooge's tortured incarnation. Why did he let the love of his life go? Unfortunately, there's a scene missing, which would explain how money helped him overcompensate for a lonely childhood, to a point where greed superseded his ability to give and receive love. This flaw is more forgivable than the flaw of gratuitous action, so prevalent in the Ghost of Christmas Future section, and skewers the story in favor of 3D effects over fidelity towards the Charles Dickens novella."
    },
    {
      "rating": "10",
      "text": "Sometimes critics are retarded at doing their job. I loved this movie. I thought it was a brilliant and inspiring film. Go see it in 3D."
    },
    {
      "rating": "8",
      "text": "See it in 3D. Expect it to be scary for the little ones and as long as the weird stop motion method doesn't bother you then prepare to be wowed. I thought the ghosts were a little too easy on Scrooge and he turned \"nice\" too easily, but it was a fun movie thrill ride! I paid $14 for XD 3D and was not disappointed."
    },
    {
      "rating": "9",
      "text": "A CHRISTMAS CAROL provides a new creative era of Disney animation style, experiencing all genres in future projects like comedy, musical, philosophical drama, thriller, epic, intimate ... and different animation techniques: 2D, 3D and Mo-Cap. It's an excellent poem narrated as William Shakespeare with a correct oral expression. The animation and the script is very suggestive ... The Alan Silvestri OST is clearly deserves a nomination for this year's Oscars, with permission from Randy Newman and \"The Princess And The Frog\". It's an excellent opportunity for Disney to resume stories like Snow Queen, Fraidy Cat, Selkies, Lady of the Lake, Swan Lake, Aida, Don Quixote, Musicana, My Peoples, Rumpelstlitskin, Goose Chase and many other examples like Ramayana or Kalevala. But the mind of the American public about the animation is still very closed, because parents are keeping their mind on the entire animation to be familiar. Their complaints have wasted a box office success of A CHRISTMAS CAROL."
    },
    {
      "rating": "10",
      "text": "This is the BEST 3D/animated film that I have ever seen. The animation is amazing because they're doing things in this film that could never be done in a live movie. The long action sequence could have been shortened and it wouldn't have taken anything away from the rest of the film. I was completely spellbound and captivated by what was on the screen. Before half the film was over, I had decided to see it again. Great job!"
    },
    {
      "rating": "8",
      "text": "With a classic like this, the storey is key. The performance capture technique allows Jim Carrey to produce wonderful characters (esp. as Scrooge) that put the tale across in a compelling way. The first 2 spirits while initially jovial and odd, credibly reveal the dark-side of Scrooge in a chilling way. On the downside, I did not feel much empathy for the Tiny Tim character. The finer points and morals of the storey will be lost on kids, e.g. wealth compared to poverty, the children representing Ignorance and Want. I was a little bored in some of the"
    },
    {
      "rating": "10",
      "text": "One of the greatest 3D films I have seen since the new realD 3D technology was introduced. Zemeckis as usual succeeds in every aspect, adding action and 3D fun whilst still holding on to what made the original Dickens novel so special in the first place. Jim Carey was the perfect choice as scroodge and with the mixture of his voice acting and the amazing animation (the animation is incredibly detailed showing everything from blemishes to nose hairs) he keeps the story rapidly flowing at a great pace. See this film and make sure you do it in 3D at the movies!!"
    },
    {
      "rating": "10",
      "text": "Excellent effort by Robert Zemeckis and his team to create this masterful achievement of animation and style with this wonderful enactment of a classic. Soon to be the best \"Carol\" in the last 40 years."
    },
    {
      "rating": "10",
      "text": "I wish critics would review the movie, NOT the motion capture technology used to make the film (like so many critics seem to be doing). If this movie was made with standard CGI, like the Pixar movies, people would be raving. Rather, they keep going back to \"Polar Express\" and complaining about that! This film is very well done and has plenty of heart, soul and depth. Zemeckis has re-imagined this tale with true artistic vision. His use of technology puts him at the forefront of fine film making. Bravo!"
    },
    {
      "rating": "9",
      "text": "Very good movie well its the best 3d movie that I ever saw.The art in the movie is very interesting in this film.And thats pretty much it !"
    },
    {
      "rating": "9",
      "text": "I thought this version of A Christmas Carol, was a very interesting one. Jim Carrey adds a new dynamic to the Scrooger character. The technology used to make the film made this rendition captivating."
    },
    {
      "rating": "6",
      "text": "Plenty of scary scenes, not recommended for children younger than 7 yrs. old. This movie was like a roller coaster ride, some scenes were like watching a masterpiece and then other scenes were just dull. Overall leaving a felling that it could had been better. If it wasn't in 3D it would had been a complete disappointment."
    },
    {
      "rating": "7",
      "text": "A delightful 3-D picture and a faithful rendition of Dickens"
    },
    {
      "rating": "7",
      "text": "This is a well made movie, It has all the elements today's popcorn crunchers love, it has astounding special effects, moments that pull at the tears and a \" happily ever after\". The one problem I had with it though, was how scary it must be for kids. I am 27 and throughout the entire movie I was cringing thinking how kids would handle the all to frequent scary scenes, No jokes, that when I walked into the cinema, it spelt of pee, well we know how one kid dealt with it!! I do warn parents to think twice about taking their toddlers, as it has a very dark feel about it!!! However, for those of you over 12...hey...its great fun!!!!"
    },
    {
      "rating": "10",
      "text": "Absolutely amazing, the most beautiful thing I've seen all year. This was my first 3D movie and I was completely blown away. And as a movie, this has got to be the best adaption of \"A Christmas Carol\"."
    },
    {
      "rating": "9",
      "text": "A Christmas Carol is great movie. When you go to see this movie expect nothing more or less than what the book was. The movie stays true to the book for the most part so don't expect any signifigant changes. As far as presentation is concerned A Christmas Carol does a phenominal job that surpasses that of the Polar Express. The movie is visually appealing and emerses you in the world of 17th century London. There were moments where I forgot that this was an animated movie just given how good the presentation was. The voice overs are good although there were a couple that are amusing. As far as capturing the mood of the book, the film does a phenominal job. There plenty of scary moments to be had that I won't ruin here. Let's just say that if you're like me, you'll see them coming but get freaked out anyone and almost spill your popcorn. It's a wild ride/nightmare that you'll just want to end. As scary as it is though, the Ghost of Christmas Past isn't that scary so don't expect much from him All and all A Christmas Carol is a great movie that anyone will enjoy. My only advice to you is to sit back, relax, and enjoy this excellent retelling of one of Charles Dickens' classic tale A Christmas Carol."
    },
    {
      "rating": "9",
      "text": "Visually stunning, I and my wife thought this was one of the best version's of this story we have seen. It did capture us emotionally and they made it so magical with all the effects. People who have said they could not hear the ghost of Christmas past must of had a bad seat or something. Very well done the best 3-d I have ever seen, would recommend this highly."
    },
    {
      "rating": "10",
      "text": "Excellent Animated retelling of the Dickens classic,The 3D Immerses you into the faithful recreation of Dickens's world,and travels you along at breakneck speed,a modern day Christmas Classic"
    },
    {
      "rating": "7",
      "text": "It was good. The 3D was 10/10 but I was bored at times."
    },
    {
      "rating": "5",
      "text": "Some good animation and fidelity to the book + Carrey is great, but a lot of awkward animation too, particularly the ghost of Christmas past."
    },
    {
      "rating": "7",
      "text": "I can sum this up in one short phrase: \"PG rated horror film.\" Let me make this clear, this is not a film for kids under 10, or really anyone that's easily frightened (or nauseated for that matter). I'm not saying it's a bad film, but this is not a film for small children. This adaption of the Christmas Carol captures and fleshes out the creepy parts of the tale, leaving the warm and fuzzy parts a little under cooked. The creepy take on this classic is unique, and enjoyable. It's the kind of film that can be enjoyed by a wider audience than if this story had been left to the generic fuzzy ending that so many films have adopted. The story sports more style than previous adaptions. More pizazz, more depth, and more scares. I won't lie, there were times when something startled me; this film is full of GOOD scares, not the silly excuse for jolts that are in so many kid's movies these days. Even though this movie is over two years old, and motion capture has gotten significantly better (Tintin, anyone?), the animation looks great. Everything is well detailed, and everything feels real. However, there's still some stiffness in the moving, and there's one dance scene where gravity and physics are defied so many times, there's no doubt that even kids (kids that can take the scares) will point them out. I mentioned earlier that this is like a PG rated horror film. I liked this unique aspect, but I thought you might like to know what's ahead of you: a pretty creepy scene where a talking corpse (in translucent ghost form) has a conversation with Scrooge, for one. The scene is surprisingly scary, and at one point, the corpse' jaw becomes disconnected when he screams. There's no gore, but it's pretty icky anyway. In addition to this, we see another corpse (it's played as a surprise for laughs), an old wrinkled head, a fat man who's skin blows off him like dust, and two vicious goblin creatures who are very reminiscent of Lord of the Rings. The score is appropriately Christmasy, but it's not outstanding. It does a good job of setting the mood of each scene, though, but I've heard much better Christmas scores. Jim Carrey does a hilarious job as Scrooge. He's grumpy and despicable, but because you recognize him as Carrey, you can't take him seriously. This isn't really a bad thing, but it might irritate die-hard Dickens fans. There's also one boring, tedious, and completely unnecessary chase scene, that makes little sense, which was most likely added for the benefit of any kids in the audience (who, as I've made a point of mentioning, are brave enough to take the scares). Also, the ending is incredibly corny (though we get the feeling that Carrey was overdoing it for his own entertainment), and little Timmy barely gets any mentioning. Overall, this is an entertaining flick and even though flawed, is a fun and creepy delight. I recommend this film to anyone who likes Jim Carrey, The Christmas Carol, motion capture, or the creeps."
    },
    {
      "rating": "9",
      "text": "The thing that astounded me about this movie was how faithful it was to the original book. That was something I did not expect. But this is one of the most faithful adaptations yet made, it even keeps the Dickensian dialog intact instead of updating it for modern ears, which is something even highly regarded versions have done. In fact aside from a poorly conceived action sequence near the end of the film, it is almost a word for word recreation of the book. Visually the movie is stunning, Dicken's London has been brought to life in a way never before seen. It is dark, atmospheric and captivating. The characters themselves are works of art, all beautifully brought to life by some brilliant motion capture and voice acting.This is one of my very favorite versions of the story, a beautifully crafted and faithful movie. But parents be warned, Dickens' story was a ghost story, it was intended to scare. This is no Muppets Christmas Carol. It has some surprisingly dark and scary moments. Not a movie for the little ones."
    },
    {
      "rating": "10",
      "text": "In 3D version it looks very truthfully. Ebenezer Scrooge was egotist and after visit of ghost is very nice and friendly man. One of the best remakes of this book."
    },
    {
      "rating": "7",
      "text": "Considering it's probably the most cinematically-adapted story in history, any new treatment of \"A Christmas Carol\" might easily be overlooked due to sheer exhaustion. By now, we've all got our favorite versions, and most of them really are pretty much the same. Still, Robert Zemeckis's high-flying rendition of Dickens' immortal tale is easily one to add to the list of seasonal viewings - it's colorful, it's wild, it's fun, it's heartfelt. There's several small things in this version - such as Scrooge walking in on the simile game at the end - that give it some strong marks in my book, and just the amount of fun Zemeckis has with the animation and story while still staying faithful gives it plenty of its own identity. Carrey's performance as the penny-pinching humbug is actually quite convincing, and is likely my second-favorite treatment of the character to date, and the design of the ghost of Christmas future is really cool and unique. It's just a lot of fun to watch, and a very solid treatment. What else can I say? God bless the Christmas Carols, every one."
    },
    {
      "rating": "8",
      "text": "As much as I felt that 2009 was a great year for movies (mostly because of nostalgia. I was 11 and would always get excited for new movies in 2009), I've been finding that 2009 has been home to some insanely polarizing films, especially towards the end of the year. As I mentioned in my review mere hours ago, \"Where the Wild Things Are\" wowed me with its portrayal of childhood, but some people were either bored or weirded out by it. Fast forward less than a month later, and Disney has graced us with the motion-capture adaptation of the classic Charles Dickens book \"A Christmas Carol,\" yet another wildly polarizing film released in 2009. Some of us loved it for its visual splendor, acting and thrills, while some of us believed it to be a classic case of \"style over substance.\" As for me? Well, I'm in the former camp. I understand the \"style over substance\" argument, but I found that the film was entertaining, visually thrilling, well-acted and exciting to watch. Obviously, the film isn't for everyone, but it's still a great adventure and a worthy retelling of the classic Dickens story."
    },
    {
      "rating": "5",
      "text": "A Christmas Carol is beautifully average.\rThe movie simply adapts the book reluctantly. The main appeal is the beautiful animation that unfortunately feels very wooden. There many times the characters look at random objects instead of each other. If it wasn't based on a famous book it would be completely forgettable."
    },
    {
      "rating": "6",
      "text": "Very nice film. There is a lot of special effects, some humor, some dramatization, and mostly old words in the 1500's. However there is always the same thing, the plot and story goes the same thing. Scrooge asked the present ghost about the little boy about death. The future ghost haunts Scrooge, no words. The past reminds Scrooge about his poor life (etc.). But, overall the film is good and Disney really done it. Great job!"
    },
    {
      "rating": "10",
      "text": "i remember when i watch this movie in theatres the joy on my face was lighting like a Christmas tree, when i saw this  animated movie. Yes we have seen the same versions of the christmas carol remake movies over over over; But this movies stars Jim Carey as Scrooge who would enjoy that? also this movie is directed by Robert Zemeckis the guy who  brought us Back to the future trilogy, Forrest Gump , Polar Express and now this? Epic , This movie has a lot of heart amazing soul directing that zemeckis does when he directs animated feature to Charles Dicken's novel."
    },
    {
      "rating": "10",
      "text": "Not a bad film by any means! One of the best takes on Charles Dickens' story that provides a slightly realistic touch with the amazing special effects. The acting is some of the best the Christmas films have ever seen."
    },
    {
      "rating": "5",
      "text": "Why call 'The Exorcist' the scariest horror ever made when Robert Zemeckis 'A Christmas Carol' exist.Season's greetings from hell!One of the most ugliest and horrifying Christmas movies out there. However, I respect it in some strange way. There's nothing like it. It's weirdly in the same vein as Tom Hooper's horror masterpiece 'Cats', in terms of CGI and having an identity crisis."
    },
    {
      "rating": "6",
      "text": "A Christmas Carol was an amazing story ever told in the world, and when it has the domain of Robert Zemeckis , and its amazing 3D animation , good role of Jim Carrey, and also the movie but a bit boring , it's interesting."
    },
    {
      "rating": "7",
      "text": "I love animation and I love Christmas films. Not to mention that I adore Dickens' story. 2009's A Christmas Carol mayn't quite be a classic for the Yuletide season, but it is a worthy film and one of the more loyal adaptations of the story, maintaining not just the details but the spirit as well.CONS: There are few cons actually here. I did feel the film was too long, I personally think 80 minutes is a perfect length for telling the story, this was nearly 100 minutes. In order to do this, while they were musically and visually stunning, there were two scenes that didn't quite work for me and could have been omitted, one being the extinguishing of Ghost of Christmas Past, the other being the carriage chase. As impressive as they are, they don't enhance the storytelling much and feel odd in their placement too. The film does occasionally drag as well, particularly towards the end.PROS: However, there is much to enjoy here. The story has a classic feel in how it is told, and it has the heart and sentiment of the original story. The dialogue is delightful and almost word-from-word from the original story as well. There are three outstanding things though. One is the vocal cast, Gary Oldman is excellent as is Colin Firth, but it is Jim Carrey's show all the way, while his distinctive acting style is here it is also naturally understated. Two is the score, I like Alan Silvestri a lot, and his score here is beautiful and compliments the spirit and meaning of Christmas wonderfully. Most impressive are the visuals, which in the colours, backgrounds, 3D effects and character designs are outstanding.So all in all, while not a movie to treasure perhaps, it is definitely worth watching. 7/10 Bethany Cox"
    },
    {
      "rating": "9",
      "text": "A classic story, retold. This version is darker and scarier, and I like that. The ghosts are actually awesome looking, and scary. I loved 3D style, it makes it feel magical."
    },
    {
      "rating": "8",
      "text": "\"A Christmas Carol\", by Charles Dickens, has been regularly adapted to film or television, so even those who haven't read the book know the whole story, and its difficult to bring something substantially different from what already exists. This is bad? I don't think so. Literature classics have always been (and will continue to be) available to be adapted for the movies. We can change perspective, tell things differently or simply be faithful to the book. It's all a matter of taste. Personally, I really like a story that is faithful to the book that gives rise to it, I think its meritorious when adaptation manages to put on screen the magic of words. And, to my delight, I can say that this film has captured the magic of Dickens. So I will not waste time telling the script or commenting on it because its famous enough.Being a film with Disney seal, we're expecting some quality standard, especially concerning to the animations and the whole visual and sound part of the film. I think it's technically perfect or very close to it. My only negative criticism is the somewhat gloomy and Gothic atmosphere that I notice sometimes. Some scenes are, in fact, scary, and this will surely scare some children, to whom parents are going to show this movie for being a Disney movie. I believe, therefore, that some scenes may not be advisable to very young or impressionable children. A very nice point of the film is the cast of voice actors. The most noteworthy name is, of course, Jim Carrey, an actor who has always stood out for his extraordinary use of voice. Soundtrack is good and discreet but does not have the usual songs, which Disney movies have used us to."
    }
  ]
}