{"id": 4535, "title": "A Christmas Prince", "starring": ["Rose McIver", "Ben Lamb"], "runtime": 92, "genre": ["Romance", "TV Movie"], "description": "When a reporter goes undercover as a nanny to get the inside scoop on a playboy prince, she gets tangled in some royal intrigue and ends up finding love - but will she be able to keep up her lie?", "releaseYear": "2017", "mpaaRating": "PG", "imageUrl": "https://image.tmdb.org/t/p/w500/x0IGQsMzVbsF7noj5cCfEk1GU7s.jpg", "categories": {"plot": 5.0, "acting": 6.0, "ending": 5.333333333333333, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 8.0, "funny": 5.0, "action": 5.0}, "reviews": [{"rating": "10", "text": "This movie is a must see! It touched my heart, and it has been quite a while since a movie has caught my attention like this one did. And it would be really nice if it had a part 2!"}, {"rating": "4", "text": "Does this movie tug at the Christmas time heart strings? No. But does this movie follow the basics of assembling a minimum to make a movie? Also, no. Even for a very cheesy Christmas movie, even knowing what it is going in, it's not good. The basics are bad, bad direction and jump cuts to end scenes, constant exposition, the moustache twirling villain, the thin plot for love. It's not a good movie."}, {"rating": "6", "text": "First of all, the acting in this film isn’t that bad. You can easily tell that everybody is trying their hardest to portray these characters. Some of them came across as real-life people while others just felt like charctercharacterss in a movie. This could mainly be pointed to the writing in this film. Some of the lines in this film were just hilariously bad and cringy and I would give examples but I already forgot them. But I do have to say the scenery was stunning and the production on this was well done. Each set and costume looked perfect for each scene. The costumes fit each character and showed a bit more into their personality. For example, Richard’s outifts made him look like royalty but at the same time, a normal guy because that’s what he wants to be. This film had lots of pacing issues. From beginning to end it didn’t feel like that was the speed it should be going at. The beginning felt slow while the ending felt to fast. The creators of the film might have thought they had a longer film and then realized they only had a one hour and thirty-two-minute film so they had to quickly resolve the film. The last thing I want to talk about is the relationship in this film. It’s not believable or relatable. I know it shouldn’t be relatable seeing how it is about a journalist falling in love with a prince but the writers still should make it so some people can relate to at least one of them. And it isn’t believable because it seems too rushed. Throughout the entire film, they are hardly around each other and then all of a sudden he just loves her. There is no explanation why just little subtle hints. In the end, A Christmas Prince is perfect for people who like RomComs but for others not so much."}, {"rating": "3", "text": "Se podría esperar un poco mas viendo otras producciones de netflix, es un poco sosa, malas actuaciones, hay unas tomas pésimas, escenas clichés y diálogos pobres.Uno espera ver una comedia simple, entretenida algo como el \"diario de una princesa\" pero parece mas una copia a películas de la categoría sin pena ni gloria."}], "recommendations": ["the_power_of_the_dog", "sanctum", "the_princess_switch", "old", "seven_pounds", "the_vow", "the_mountain_between_us", "awake", "the_hunger_games_mockingjay_part_1", "lost_in_translation", "the_last_song", "next", "eo", "bridge_to_terabithia", "the_grey", "frozen_ii", "there_will_be_blood", "the_maze_runner", "pay_it_forward", "the_twilight_saga_breaking_dawn_part_1", "fifty_shades_freed", "code_8", "gone_girl", "tenet", "how_it_ends"]}