{"id": 4361, "title": "A Cinderella Story", "starring": ["Hilary Duff", "Chad Michael Murray"], "runtime": 95, "genre": ["Comedy", "Family", "Romance"], "description": "Routinely exploited by her wicked stepmother, the downtrodden Samantha Montgomery is excited about the prospect of meeting her Internet beau at the school's Halloween dance.", "releaseYear": "2004", "mpaaRating": "PG", "imageUrl": "https://image.tmdb.org/t/p/w500/3d6Nu5c7BSo5BrH2xE1pnj3yNrc.jpg", "categories": {"plot": 5.166666666666667, "acting": 2.6666666666666665, "ending": 9.0, "soundtrack": 5.0, "cinematography": 4.0, "familyFriendly": 5.0, "funny": 5.25, "action": 5.0}, "reviews": [{"rating": "7", "text": "Great modern version of Cinderella! It's a great experience for all  friends,family and even if you watch it alone. The only thing i didn't get is  how is it possible for him not to recognize her after the Halloween party? I mean her voice, face and attitude?... that's probably the only reason i'm not giving it a bigger score. But as i said it's still great."}, {"rating": "9", "text": "A twist on Cinderella, this Hilary Duff movie is light hearted and fun. Great for girly night's in and sleepovers.Plus I absolutely adore Jennifer Coolidge in this movie, she is so funny!"}, {"rating": "7", "text": "A Cinderella Story represents the animation in modern and funny way with some life lessons. Hilary played her role perfectly. Can't explain the low metascore.."}, {"rating": "10", "text": "I think this movie it's the best of the best..only because hilary duff appears on it. she's the most beatiful person in the world."}, {"rating": "10", "text": "I love this movie! It's the modern day version of the childhood classic and it's a amazing! It's one of those movies you watch and makes you once again believe in love and hope all over again."}, {"rating": "10", "text": "The title of this movie won't give much away, as it isn't completely similar to the original Cinderella. Keeping the love story half and the \"evil stepmother\" half, it creates the similarities. Ultimately, A Cinderella Story takes you through a journey which all girls probably around the age of 12 would enjoy watching."}, {"rating": "3", "text": "I picked a number at random. sorry... never thought hilary duff was that good of an actor."}, {"rating": "5", "text": "A decent, and passable remake of Cinderella. A family friendly movie, but very girly. Well, what did I expect when I saw this on ABC Family??? It's ok."}, {"rating": "0", "text": "All I Can Really Say Is I Hope I Bring Down The User Rating To An Even Lower Score.. Anyway Bad Acting, Bad Plot.. Why Remake A Disney Classic???? So So So Uncreative.. 0!"}, {"rating": "4", "text": "They tried but failed. The actors are terrible, the camera work is terrible, the story is terrible when in comparison to the original. This movie is too implausible to make sense. They tried to put their own little spin from the original but it just did not work for teenagers in today's age. At about the twenty minute you are begging for the two to hook up already but it feels like it takes forever. If you want to take Cinderella from animated to real life there has to be much more care and effort involved."}, {"rating": "10", "text": "It grat there no words to describe it."}, {"rating": "3", "text": "You call this a movie? Honestly Hilary do us all a favor and just stop. Whoever told you that you are good was sadly mistaken. im trying to save u from more imbaresment if thats possible."}, {"rating": "10", "text": "I love the movie it's has my fav people it Chad.M.M and Hilary Duff. The movie is the best thing out there."}, {"rating": "1", "text": "Hilary Duff at her absolute best! Chad Michael Murray at his absolute best! Oh wait... That's still not anywhere near good."}, {"rating": "2", "text": "We know the story. We're familiar with these actors. But yikes! I certainly hope they didn't intend for the film to come out as poorly as it did. I'm also not incredibly surprised."}, {"rating": "10", "text": "Good movie. The film does a great job of being genuinely funny. I can watch it thousand times and it will still make me laugh! I love it. Hilary and Chad"}, {"rating": "2", "text": "I hated this movie. This is in no way funny, or even a way to get young teens of the 21st century into Cinderella. I get that it's \"Cinderella for the digital age\", but it's not funny, not interesting, and downright, unbearable to watch.\r Hilary Duff is fine in the lead role, but there are times where her character just seems unlikable at times, you know it's problematic when the lead character who you're supposed to identify with, is not likable at all. Don't even get me started on Jennifer Coolidge as the evil stepmother, whoever gave this woman a comedy career clearly doesn't know what comedy is, she was never funny...or at least I don't find her funny.\r There is nothing else I can say...this movie is just bad."}, {"rating": "0", "text": "Best movie of all time. I hope more small children can wank it off in style.\r kjklnmk[p;'.ssssssssssssssssssssssssssssssssssssssssssssssssssssssssssssssssss"}, {"rating": "7", "text": "Аллилуйа, обожаю такие глупенькие американские комедии девяностых годов и первой половины двухтысячных. Это были те комедии, которые позволяли реально тупо расслабиться."}, {"rating": "3", "text": "Bizarrely cheap feeling and stilted modernization of the story of Cinderella. Pretty bad but sort of watchable in a ironic, after the fact: 'look how **** and clueless early 2000s teen movies were' kinda way."}, {"rating": "4", "text": "Not the worst I've seen but definitely not the best either.  Hilary Duff wasn't that bad."}, {"rating": "10", "text": "A sweetly romantic update on the classic fairy tale that’s done justice through an inspirational message that includes a funny and wonderfully told love story which the critics once again have cruelly misjudged with their heartless attitude toward this underrated romantic teen film for the ages."}, {"rating": "10", "text": "Iconic movie, a must-watch if you were/are a teen in the 2000s / 2010s. Hilary Duff is amazing in this movie."}], "recommendations": ["the_princess_bride", "the_spongebob_squarepants_movie", "minions_the_rise_of_gru", "17_again", "hannah_montana_the_movie", "bedtime_stories", "freaky_friday", "fred_claus", "50_first_dates", "zack_and_miri_make_a_porno", "stardust", "second_act", "despicable_me_2", "barnyard", "10_things_i_hate_about_you", "coming_2_america", "enchanted", "ghostbusters", "ice_age_the_meltdown", "pitch_perfect_2", "goosebumps", "american_pie_2", "elf", "alvin_and_the_chipmunks", "alvin_and_the_chipmunks_the_squeakquel"]}