{
  "id": 2343,
  "title": "A Clockwork Orange",
  "starring": [
    "Malcolm McDowell",
    "Patrick Magee"
  ],
  "runtime": 137,
  "genre": [
    "Science Fiction",
    "Drama"
  ],
  "description": "In a near-future Britain, young Alexander DeLarge and his pals get their kicks beating and raping anyone they please. When not destroying the lives of others, Alex swoons to the music of Beethoven. The state, eager to crack down on juvenile crime, gives an incarcerated Alex the option to undergo an invasive procedure that'll rob him of all personal agency. In a time when conscience is a commodity, can Alex change his tune?",
  "releaseYear": "1971",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/4sHeTAp65WrSSuc05nRBKddhBxO.jpg",
  "categories": {
    "plot": 3.8666666666666667,
    "acting": 5.818181818181818,
    "ending": 5.25,
    "soundtrack": 10.0,
    "cinematography": 0.0,
    "familyFriendly": 3.0,
    "funny": 7.75,
    "action": 1.0
  },
  "reviews": [
    {
      "rating": "10",
      "text": "Kubrick marvellously questions toward the society about the 'real' definition of virtue and evil. Kubrick successfully followed the original storyline (of course, some of the storylines are deviated from the original) and attracted the audiences to make a different point of view."
    },
    {
      "rating": "10",
      "text": "This is indeed one of Stanley Kubrick best films. Malcom Macdowell was cast perfectly as Alex del Large and I can't believe he didn't get an Acadamy Award nomination for this role. Truly a classic."
    },
    {
      "rating": "9",
      "text": "If you haven't read Burgesses book, the British version that is, you'll not understand that Kubrick was working sans the 21st chapter. Regardless, the film is a sylistic acheivement. As for the moral outrage displayed by at least one reviewer, sorry, you missed the point. Gloopy you are."
    },
    {
      "rating": "10",
      "text": "An almost perfect rendering of the novel by Anthony Burgess. Kubrick's use of classical music somehow insulates the viewer from the true horror of the violence. The set and costume design is a visual feast. Kubrick never ceases to amaze this viewer."
    },
    {
      "rating": "10",
      "text": "To be perfectly honest, i loved the first part (until 41:35)... it was legendary beyond belief. A nice, warm vibratey feeling all through your guttiwuts."
    },
    {
      "rating": "10",
      "text": "Its brilliant and yet brilliantly disturbing which is exactly the point. It was meant to be just a little over the top , most satire is."
    },
    {
      "rating": "10",
      "text": "Futuristic in that even now, we watch movies featuring gratuitous decadence and ultra-violence, and A Clockwork Orange still retains all of its moral and artistic impact. A provocative worldview and reflection of individuals as well. Definitely requires a good amount of maturity from the viewer."
    },
    {
      "rating": "10",
      "text": "A real masterpiece! A must see for anyone who considers a serious moviegoer."
    },
    {
      "rating": "9",
      "text": "Malcolm McDowell gave such a wonderful performance. I believe that his performance was the backbone of the movie."
    },
    {
      "rating": "10",
      "text": "Arguably Kubrick's best; my favorite movie of all time."
    },
    {
      "rating": "10",
      "text": "Kubrick's a genius and you can't help but be entertained by the mischief of McDowell's character."
    },
    {
      "rating": "10",
      "text": "Chicago reader.....why must you bring this briliant movie down? If metacritic knew any better, they would take that shite review down. This movie is genius, as is kubrick."
    },
    {
      "rating": "10",
      "text": "It is disturbing alright, but it is brilliant for what Stanley Kubrick directed for this. It is weird too, but who cares? I love it!"
    },
    {
      "rating": "10",
      "text": "Ebert, you fail once again. This movie is a classic, chilling masterpiece of cinema. However, I did find this line quite amusing: \"Alex has been made into a sadistic rapist not by society, not by his parents, not by the police state, not by centralization and not by creeping fascism -- but by the producer, director and writer of this film, Stanley Kubrick.\""
    },
    {
      "rating": "10",
      "text": "best sureal movie ever one of my favorites as for the negitive comment he chose the first release of the book where the editor cut the part of him growing up. look like YOU should have done your reasearch also the slang is just based of the nadsat."
    },
    {
      "rating": "10",
      "text": "This is one of the greatest movies ever made."
    },
    {
      "rating": "10",
      "text": "It is easy to see as all the other ratings on this movie there is no line here you love this movie or you hate this move I love this movie and all of Kubricks movies including Eyes Wide Shut there will never bee another director like him and I am happy about that he was one of a kind and for all the pepole that dont know look at his ratings on other films in sci-fi, horror and war."
    },
    {
      "rating": "10",
      "text": "One of Kubrick's finest movies."
    },
    {
      "rating": "10",
      "text": "From start to finish, the best movie I've ever seen."
    },
    {
      "rating": "9",
      "text": "Frank B. you are the reason this film doesn't get taken seriously sometimes. The idea of the film is that criminality is wrong, yet is it right to not be criminal if it isn't upon ones own free will? Is criminality a simple act of rebellion or is it something more? Its interesting and philosophical and obviously not appreciated by a fool like you who enjoys the horrific violence."
    },
    {
      "rating": "8",
      "text": "Stanley Kubrick did a good job with this film, i though for the time (1971), this was a huge step in film industry, like the robberies, the drugs, the violence, the nudity, everything, so in that aspect i liked to see a film like that being made in that time. Some scenes were very shocking and weird, but that's part of the movie, it's the way the director wants to show to the public, the intensity of this film. So it's a good 8."
    },
    {
      "rating": "8",
      "text": "Really good adaptation. Taken word by word from the book (which marked me so much). Stanley's direction is fascinating and the acting is on point. I just wish it wasn't based on the American version of the book (which omits the last chapter)."
    },
    {
      "rating": "3",
      "text": "I was really on the wrong side of this film. But I've given A Clockwork Orange more than a fair chance. To me, it just doesn't work - not just narratively, it doesn't even work thematically. It's essentially meant to be this very ambitious and intimate character study that reflects the flaws in the society and the present thinking etc etc. But the problem is, Kubrick never breaks into the psychology of the central character through the course of the film. He did so brilliantly in Eyes Wide Shut but here, I felt like a distant observer. I hated Alex from start to finish and I don't think it was meant to be that way. Even in Raging Bull, a film with the most despicable central character imaginable, eventually drew sympathy. That's because we got to know why LaMotta did what he did and it's done so powerfully. His penchant for self-destruction was just an exaggerated version of what everyone goes through - hurt oneself for causing pain to others. A Clockwork Orange doesn't even aim at the sort of depth.\rBut film does develop some ideas through the first 2 Acts but at the very end, it throws it all out of the window. Ambiguous endings work very beautifully with films like 2001 but here it felt like Kubrick himself couldn't make up his mind about the social norms. So then why make an entire movie about it?"
    },
    {
      "rating": "9",
      "text": "a master work of stanley kubrick. the movie have just a few little fails but in the rest is an excelent movie who all that are reading this must see. but i´m warning that this movie is very hard to see. it´s not for everyone"
    },
    {
      "rating": "10",
      "text": "Stanley Kubrick has made a lot of great, mind bending, and timeless movies, but this one might just be his masterpiece. The twisted, sexually charged, not-so-distant future of England creates a world where evil runs amok. Yet in this dark world, where the protagonist of the movie (Alex) is one of the most vile, reprehensible people imaginable, Stanley Kubrick sets out with the herculean task of daring the audience to feel sorry for Alex. What's even crazier is that he succeeds! In spite of the gruesome murders and horrific rapes that fill the first act, I always find the second to third act of the movie where Alex has been brainwashed and is helpless the most harrowing part of the movie to watch. This film dares to argue that taking away an evil person's free will is more cruel than letting them commit evil freely. Without free will, good and evil are meaningless. This is a difficult and uncomfortable film to watch, but it is a necessary watch, and its one of my favorites."
    },
    {
      "rating": "8",
      "text": "Un film qui fait toujours réfléchir des décennies plus tard et dont l'mpact est toujours à la fois intrigant et énigmatique. L'ironie mordante de Kubrick, son cynisme transparaissent dans chaque plan, chaque dialogue et sonnent comme des interrogations et des questionnements qui résonnent dans le vide d'une société déliquescente, celle du début des années 70, prémisses de notre société actuelle et présente avachie dans l'angélisme forcené dont le caractère délétère fait des ravages.A cet égard, il s'agit d'un film visionnaire sur la problématique de la violence et de la façon d'y faire face ou de se voiler la face. C'est aussi du point de vue moral l'éternelle question de la nature de la violence et de l'origine du comportement des \"gens méchants\", doux euphémisme pour désigner les raclures et autres racailles qui se nourrissent de la société et la mangent comme des parasites dont on ne parvient jamais à se débarrasser.Orange Mécanique, plutôt que de se hasarder dans quelques réponses ou thèses hasardeuses, ne donne et ne donnera aucune réponse, aucune solution : le problème reste entier et le constat amer. Tout comme aujourd'hui.Si son impact reste intact, c'est bien entendu grâce à la réalisation magistrale d'une part, grâce aux acteurs criants de vérité d'autre part, avec en première place l'incroyable Malcolm MacDowell dont la performance maléfique est à marquer d'une pierre blanche.L'atmosphère vulgaire, le décorum kitsch, le mauvais goût étalé poussé à son paroxysme des années 70 sert naturellement le propos à merveille alors que pardoxalement, le film n'en apparaît que plus daté, désuet et caricatural. Le massacre des mouvements de la symphonie de Beethoven à l'orgue Bontempi de Prisunic participe de cette ironie cinglante et vrille les nerfs à souhait tandis que d'autres morceaux connus de musique classique illustrent les évènements ici et là, une manie de Kubrick qui se trouve quelque peu en porte-à-faux ici.Le film en ferait-il trop ? on peut légitimement se le demander. Pourtant le dialecte quasi-incompréhensible de la vermine décrite ici peut aisément se comparer avec le \"verlan\" et les expressions de nos chers jeunes des banlieues, comme autant de signes d'appartenance, autant langagières que vestimentaires, à un \"monde\" à part, reflet d'une société malade ou reflet d'une résistance diabolique à son encontre.Notez à cet égard qu'on peut rapidement partir dans tous les sens, y compris dans le religieux avec tous les dégâts collatéraux de part et d'autre, aussi bien du côté de nos chers rebuts que du côté de nos politiques qui semblent comme de coutume toujours désemparés face à l'ampleur du problème. Car la morale a une origine religieuse, tout comme le \"bien\" et le \"mal\".On pourrait encore tergiverser et palabrer pendant des paragraphes entiers qu'on se retrouverait toujours au même point ; si un dessin vaut mieux qu'un long discours, alors un film tel qu'Orange Mécanique vaut bien une messe. Malgré son outrance et sa désuétude, malgré ses tics, le film a su se hisser hors de son temps : il est devenu à notre grand étonnement un classique intemporel."
    },
    {
      "rating": "9",
      "text": "the first movie what i see of kubrick and was a good approach to this director, is not the best movie of Stanley Kubrick, but is a wonderful movie, the plot show us a lot of things, like the ultraviolence, and the conditioning of the principal character. The ending of the movie i consider it masterly and the direction was really original with scenes like the sex escene of Alex with those girls. And the music, is just wonderful."
    },
    {
      "rating": "3",
      "text": "I don’t understand the appeal of this film. I mean, sure, it has a good look, as all Kubrick films do. He knows how to put together a production and show it off. The acting’s fine, I guess. But... what was this movie? I thought maybe I just didn’t “get it,” but after further research it turns out that I did get it, I just didn’t like it. “Hey, this guy beats people up and rapes them! Ooh, they’re curing him. He’s cured!” And then the movie ends with him doing it again. That’s the whole movie, and I don’t understand why it exists. I don’t know why this film is so well regarded aside from it being a Kubrick film."
    },
    {
      "rating": "10",
      "text": "A Clockwork Orange is honestly a masterpiece and a half. The movie's got a very dark story, brilliant performances, very strong dialogue, great pacing, some very dark moments, amazing cinematography, a brilliant soundtrack and some very dark humour scattered throughout.I'd honestly recommend this movie to anyone who either, enjoys other Stanley Kubrick movies or to someone who really enjoys very dark drama movie's."
    },
    {
      "rating": "0",
      "text": "I never liked this movie. It's based on a book I have not read yet, I've never found it for sale, so I can not judge if it was true to the book. However, most people seem to have a consensual opinion that this movie is brilliant and one of the best ever made. It's a nuisance movie in its very nature, as it tackles too brutal themes. It basically speaks of extreme violence and the possible ways to control it through brainwashing and absolute control over people. It's a world that no one really wants to see. If violence is something we condemn, extreme violence is disgusting. The total conditioning of a person reminds us of the times of slavery and the man as object. These are ideas that our civilization, at great cost, has learned to hate, but we all won with it. These themes would make an excellent movie and this movie would have been great if it did not overdo it all through barbarically graphic and unnecessary scenes! And the film gets worse as it shows to the public plentiful bursting and destruction, accompanied - surprise, or perhaps not - by scenes of nudity and almost explicit sex. Stanley Kubrick filled the vast majority of his films with generous doses of blood and semen. He has always seemed obsessed with all this, and I am sure that Freud would make a rather interesting analysis of that, so why would it be different in his \"magnum opus\"? In the midst of all this monument to madness, we must recognize that the film tackles a complex subject and has an interesting history, although it is so abject that it ends up not worth the effort to watch. Perhaps in the future someone with courage will remake this movie in a more restrained manner, without exaggerate. We also emphasized Malcolm McDowell's excellent performance. The actor, still relatively young, went to the limit, accepting things that I, in his shoes, would not accept, and manage to maintained the interpretive level and shine. For this, he deserves congratulations.From the point of view of detail and technique, its possible that this is one of the best films ever made. But we are too shocked to notice and appreciate. And the truth is that cinema is not only technique. The audience does not fill the theater to admire the way the camera moves, the color and light of cinematography, the quality of characterization. The essence of any movie is the story told and, in this case, it's the story of a nightmare. Does the conception of a cinematographic work of art need, necessarily, to shock or cause erections? In the past, art was beauty and perfection, and I still think of art in that way. Does art now have to be deformed, sexual, pornographic and bloody? Is this art the pale reflection of our barbaric society or is merely the reflection of the apparently distorted mind of its creator?"
    },
    {
      "rating": "0",
      "text": "Movie is over-hyped. Perhaps by 70's standards it's OK, but that's an extremely low bar. When compared to movies before and after it doesn't stand up. Pass on this one."
    },
    {
      "rating": "8",
      "text": "Throughout his 50-year career, and especially in his great films, director Stanley Kubrick had a penchant for taking the novels of others and re-shaping them to fit his own vision. Of the 16 movies Kubrick directed (including his final feature, Eyes Wide Shut), the film maker was credited with script involvement in 12 of them. For that reason, 2001 is not referred to as \"Arthur C. Clarke's 2001\" but as \"Stanley Kubrick's 2001.\" Dr. Strangelove is \"Kubrick's Strangelove\" not Peter George's. The motion picture version of The Shining owes a greater debt to the director than to author Stephen King. Similarly, the driving force behind A Clockwork Orange was more Kubrick than novelist Anthony Burgess.\r One of the first things that will strike anyone watching A Clockwork Orange today is how thoroughly modern it looks. If not for the presence of the youthful face of established thespian Malcolm McDowell, one could be forgiven the assumption that the movie was made far more recently than 1971. Unlike many of its contemporaries, A Clockwork Orange is in no way dated, and the issues it addresses are as urgent today as they were three decades ago. How many other films from the early '70s can make this statement?\r Part of the reason for the movie's contemporary look is Kubrick's forward-thinking philosophy of film making. From Lolita onwards, the director pushed the envelope. (In fact, one could argue that he did it before the 1962 film - overtly homosexual scenes from Spartacus were cut at the studio's insistence.) While human nature may not have changed since 1971, motion picture standards have. There is copious nudity, sex, and violence in A Clockwork Orange. And, while the sex is not pornographic and the violence is not explicit, they were pervasive enough to initially earn the movie an X rating. Today, the saltier elements of A Clockwork Orange fall into the mainstream of the MPAA's R category (and the film has since been re-classified as such).\r A Clockwork Orange is not an easy motion picture to absorb or digest. Oddly, the sex and violence are easier to take than the razor-sharp edge of Kubrick's satire and the corresponding awareness of its pinpoint accuracy when addressing the issue of the dehumanization of people. As I write this in 1999, the extremities of A Clockwork Orange have not come to pass, but society is slowly moving down the slippery slope that the movie cautions against. I have the disturbing feeling that if the solution to crime proposed by the film (brainwashing) was medically and economically feasible, the government would leap onto the bandwagon. When one character speaks of our willingness to \"sell liberty for a quieter life,\" it strikes an ominously familiar chord. Under its current mayor, New York City has yielded numerous freedoms in return for a reduction in the crime rate. And in Russia, the famished citizens would give up all their newly acquired rights for the promise of full bellies.\r Many have watched A Clockwork Orange without understanding what it all means. And for those who take everything presented on screen in a straightforward manner, a certain amount of confusion will result. But, like Terry Gilliam's Brazil, George Orwell's 1984, and other futuristic political satires, A Clockwork Orange is meant to be understood as part allegory, part black comedy, and part drama. The film takes aim at the ineffective and inhumane methods often devised by governments to stem criminal behavior, asking what sacrifices we're willing to make to live in relative security. Then there's the trickier question of whether the removal of free will destroys an individual's essential humanity. Does the State have the right to do this, to \"kill the criminal reflex\"? Would execution be a preferable fate? Finally, Kubrick illustrates the fickle nature of public opinion. Those that laud the government's methods one day revile them the next.\r A Clockwork Orange is not a pretty or comfortable experience. It does not pander to the crowd-pleasing mentality that shapes the structure of many films. (In that scenario, a Rambo-like Alex would have avenged himself upon all of his wrongdoers in the final fifteen minutes.) But it demands thought, compels the attention, and refuses to be dismissed. And, for that reason, A Clockwork Orange must be considered a landmark of modern cinema."
    },
    {
      "rating": "8",
      "text": "Stanley Kubrick asks the audience a difficult question of whenether the sins of mankind should be adjusted or not. His film \"A Clockwork Orange\" doesn't really answer the prompt, but reflects it back to the audience and makes them deeply think about what morale we are exposed to, and if the morale we believe in is just or unjust."
    },
    {
      "rating": "0",
      "text": "No entiendo el por que de la sobrevaloración de esta película, el gran  Stanley Kubrick ha quitado otras joyas mas pulidas que esta película pero son películas infravaloradas en frente a esta película."
    },
    {
      "rating": "2",
      "text": "Compared to the novel by Anthony Burgess, which in my opinion is an absolute masterpiece, this film sucked for lack of a better word. It was disgusting and captured nothing that Burgess intended to portray in his novel. BOO HISS, go read the book if you've only seen the movie because it did it absolutely NO justice."
    },
    {
      "rating": "10",
      "text": "An absolutely brilliant film. Funny, disturbing, visually superb, well-acted. Above all, a film with a timeless message only second in its satirical glory to Dr. Strangelove."
    },
    {
      "rating": "10",
      "text": "An essential classic."
    },
    {
      "rating": "10",
      "text": "One of the greatest films ever created."
    },
    {
      "rating": "8",
      "text": "for me this entire movie is just a bunch of unpleasant events that happen around Alex's life. he obviously has a horrible disorder that just makes him enjoy all of the pain that he causes people. this doesnt mean that the movie is bad, in fact, its very good. but if you are not up to watching two hours of murder, rape, torture, pain, and a lot of violent  retribution, then pass this movie up. but just a warning, even if you can stand those types of actions, dont expect to be able to breeze through the movie. i have a very strong resistance to feeling uncomfortable to movies like this, and it really brought up a bunch of uneasiness and depression. its a movie thats good ,but not enjoyable to watch"
    },
    {
      "rating": "10",
      "text": "As time goes by, I'll always appreciate my Grade 10 English class (1984-85), taught by Mr. Terry. Looking back, it's probably the year that I was introduced to the most great literary works of all my life (especially 'Anthem' by Ayn Rand and 'Nausea' by Jean-Paul Sartre). Included that year in the course's curriculum was Anthony Burgess' dystopian masterwork, 'A Clockwork Orange' (as well as George Orwell's 'Animal Farm'--like Frank Sinatra would have said, 'It was a very good year'). I was mesmerized with it from the instant I noticed the unique approach to language, the 'ultraviolence' and of course, the eternal question of free will, its relationship to good-and-evil, and the can of worms of the myriad of ethical dilemmas that comes to the fore of individual freedom and rights versus that of society at large. The genius of Burgess was being able to put so well and forcibly, yet in such an entertaining way, so many issues that, had most anyone else set forth on the endeavor, would have come up with the type of off-putting, heavy-handed sermon that would never have reached such a literary pinnacle, and been required reading even now, generations later. It hasn't aged or dated a day.\r Most cinematic observers felt the book unfilmable. Director Kubrick's adaptations work so well, particularly this, '2001: A Space Odyssey' and 'The Shining' (even though Stephen King would fervently disagree about the latter) because he, as he did with 'Dr. Strangelove', can so easily both find unforgettable visual metaphors for his ideas and so handily combine humour (an under-recognized trait of his, much more readily associated with say, Sir Alfred Hitchcock) with these heavy and daunting philosophical and intellectual volleys. In the wrong hands (particularly a Stanley Kramer, or his ilk), this could have failed miserably, like typical cinematic treatments of Ayn Rand novels. But this worked triumphantly, and heartily exemplifies one of the greatest directors ever at the apex of his craftsmanship. No self-respecting cinephile can avoid this movie, and I heartily recommend you to read the novel as well, though Kubrick nails it so effectively, reading the novel isn't necessary in the slightest for the film to be enjoyed.\r One of the many 'gamechanger' films of Kubrick's extraordinary career."
    },
    {
      "rating": "10",
      "text": "This movie deserves it's 10 because you have to have a open mind when you watch a movie about rape and violence. This movie is not about making light of these subjects, but it is showing that anyone can choose what and who they want. Even if it means that they choose the bad things. Malcolm McDowell's performance is great showing a handsome schoolboy turned into a villain. At the end of the movie not only do you feel bad for the \"villain\" but you will be rooting for him as well. Don't go into this movie being a saint and criticizing the movie just because you don't like violence. This movie has a deep meaning and you have to understand it before trying to say it is \"Horrible and \" Garbage."
    },
    {
      "rating": "10",
      "text": "I really really really really really really really really really really really like this"
    },
    {
      "rating": "1",
      "text": "This is a film. A film that wants you to sympathize with a murderer and a rapist. A film that tries to justify criminal behavior. A film that tries to make a deep statement about society, but fails on every level.But, or course, people love to pretend that's not the case. They pretend that it has some \"deep meaning.\" That \"meaning\" is constantly thrown in your face every time you dare commit the sin of criticizing it.What is that \"meaning?\"Let's go through the plot and find out.The film opens up showing us Alex DeLarge and his four \"Droogs.\" They're in a bar called the \"Korova,\" which serves milk laced with drugs. They drink the milk and then start a night of debauchery. First, they beat up an old drunk man. Then, they beat up a rival gang in a fight straight out of a WWE match. After that, they drive to a house in the country owned by Frank Alexander, cripples him, and then rapes his wife. Keep in mind, we're supposed to sympathize with this character.After that, They go back to the \"Kodova\" where a woman sings some of Beethoven's 9'th. He strikes one of his droogs for jeering, stirring tension in the group. After that, he decides to call it a night. After Alex gets back to his apartment, he listens to Beethoven and masturbates to the thoughts of death and destruction. Again, we're supposed to sympathize with this guy.The next day, his probation officer comes to his house for a visit. Afterwards, he meets two women at a record shop and has sex with them at his apartment. When night comes, he meets his droogs in the lobby of his apartment building. One of them challenges Alex, but Alex asserts authority by attacking him. He later decides to rob a rich cat-lady. While robbing the house, he encounters her, and ends up killing her. He tries to escape, but his droogs turn on him and smash his face with a milk bottle, and he gets arrested shortly afterwards. Any sane person would be cheering at this point, but again, the film tries to make you feel sorry for the guy.Flash forward two years, and Alex, now in prison, is chosen to be part of an experiment. The experiment consists of being strapped in a chair, having your eyelids forced permanently open, being injected with drugs, and finally being forced to watch things you would normally like. During the experiment, he watches movie after movie of death, destruction, sex, and violence. All of this causes him to feel ill at the thought of sex and violence. To add insult to injury, one of the movies has Beethoven playing in the background, causing him to feel ill every time he hears his music.Afterwards, the effects are demonstrated to a gathering of officials. Remember the \"deep meaning\" i mentioned earlier? This is where it presents itself. It makes the argument that nobody should have their free will taken away, even when they've used it constantly to murder and rape people. I get where it's coming from, but it clearly could've used a better example. Instead, it gives us a guy who needs to have his free will taken from him.After the demonstration, he gets released from prison. He goes back to his parents house, only to find his stuff has been sold and his room is now rented out. He leaves, and encounters the old homeless man from before. He, along with his friends, beat the hell out of him. Two police officers break it up, and it's then revealed that the two police officers are his former droogs Dim and Georgie. They then take him to the countryside, beat the hell out of him and nearly drown him. Again, you should be happy this is happening, but the film WANTS you to feel sorry for him. It's honestly shocking and deplorable how much this film wants you to love a murdering rapist.He is then found by Frank Alexander, the man whom he beat earlier and is now wheelchair bound because of it. He accepts him into his home not knowing who he is. Later he hears him singing \"Singin' in the rain\" the song he sang while he raped his wife. Now knowing who he is, he drugs him and locks him in an upstairs bedroom. He blares Beethoven's 9'th, causing him to jump out of the window in a suicide attempt. He wakes up in a hospital with all his bones broken. He is given a psychological evaluation. Surprise surprise, he now doesn't have any aversions to sex and violence. The minister, who conducted the experiment, offers him a job at his public relations office. He then brings in a stereo system playing Beethoven's 9'th, which doesn't have any affect on him.In summary, this is a film that glorifies violence and tries to cover it up with a \"Deep message.\" It's amazing how defended this movie is when it's little more than a orgy of debauchery. Only positive things i can say about it is that it's well shot, and has a good soundtrack."
    },
    {
      "rating": "0",
      "text": "This movie was needlessly pornographic and violent in a bad way. It was disgusting and a waste of time. It was one of those movies you walk away saying, I hope my younger siblings don't have to watch this...it's just wrong overall."
    },
    {
      "rating": "0",
      "text": "not a fan of rape  and beating, I also thought there was really any story behind this its just a lot of really weird violence, I think the director was really seeing how far he can go making a movie and somehow people allowing it"
    },
    {
      "rating": "2",
      "text": "A movie that has stood the test of time as a monument to the easily impressed."
    },
    {
      "rating": "10",
      "text": "It's so goddamn weird...yet I love it. At first I wasn't sure what to think of it, but after a second viewing it grew on me. It stays fairly loyal to the novel, as well."
    },
    {
      "rating": "3",
      "text": "I don't understand what people see in this movie. I couldn't really follow this movie at all. Just a couple of teenagers trying to take over their town, and they do it by beating up innocent people and raping women. It's also unbelievably wierd. Their are some strange scenes that were so weird, I scratch my head and tried to figure out what's going on. It also gets more weird in the middle, I don't know what I was watching. The end kinda gets a little depressing, I pretty much just pulled the plug and said \"goodbye\" to this movie. I never read the book, but some people told me that the book is better than the movie. I guess I'm not a fan of films like this."
    },
    {
      "rating": "0",
      "text": "This movie deserves to burn in hell. I only watched one short scene to prove that this movie is a terrible piece of garbage. I hope that the characters in this movie get beaten to death. I hope people who actually like this movie change their mind and break the disc. This movie deserves nobody's time."
    },
    {
      "rating": "2",
      "text": "A very poor movie. Incredibly boring in addition to being loathsome. It would be 0 out of 10 if not for Wendy Carlos' soundtrack."
    }
  ]
}