{
  "id": 625,
  "title": "A Classic Horror Story",
  "starring": [
    "Matilda Lutz",
    "Francesco Russo"
  ],
  "runtime": 95,
  "genre": [
    "Horror",
    "Mystery"
  ],
  "description": "Five people travelling by camper crash into a tree. When they recover, the road they were driving on has been replaced by an impenetrable forest and a wooden house.",
  "releaseYear": "2021",
  "mpaaRating": null,
  "imageUrl": "https://image.tmdb.org/t/p/w500/xnxGmUof0HiugUaNbUFiS4GJPx4.jpg",
  "categories": {
    "plot": 5.166666666666667,
    "acting": 2.5,
    "ending": 3.8,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 5.0,
    "funny": 5.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "4",
      "text": "With that title, you can expect references to the great films, including the plot. A group of young travelers ends up with a broken down car in the desolate woods. Their plight is solidified by attacks from the inevitable mysterious cult that inhabits the area and practices its creepy rites. Since this isn’t a satire, the only reason to watch is for the killings. The first big one is pretty horrific, but after that they’re just average and not shot or edited in an especially horrific way. The characters are stereotypes and the narrative has one obvious twist that defies logic. This homage doesn’t add anything new or surprising to the genre and the tension never materializes. (In Italian with subtitles or dubbed in English)"
    },
    {
      "rating": "4",
      "text": "\"Your movie sucks, it's a copy of many others.\"This Italian film is certainly what that quote says, and it tries to be many others things while trying to make up for the lack of horror.It has moments of a gloomy atmosphere, which despite being attractive, doesn't make much use of it.It takes it a little over 30 minutes to find its way, and walks into a terrifying good scene that is completely discarded when the simplistic motives behind the whole thing are revealed."
    },
    {
      "rating": "1",
      "text": "Comienza siendo bastante prometedora, luego se estanca lentamente hasta llegar a un punto donde la película da un giro absurdo que lejos de repuntar la trama, la hunde aún mas, de ahí intenta ser varias cosas, entre ellas parecerse a Midsommar, si hasta los planos de cámara son casi iguales y el tramo final es tan malo y absurdo que da pena ajena."
    },
    {
      "rating": "4",
      "text": "I think Netflix is manipulating AMD ratings. Because the movies are watched in the range of 7.4 to 7.8 in the first days of their release. This is the reason why it is watched by people who are looking for a good movie and get the AMD rating as a criterion, and while the movie reaches high viewing numbers in a short time, it loses altitude at high speed with the ratings of the main viewers. When I first saw this movie, it was 7.4 points. Great score for a horror movie. I watched the movie about 2 weeks later and it's really a pity. Bad movie. His current score is 5.6. I think it's still high. I think it will go down to the 4 point limit.we Italians can't handle the horror movie."
    },
    {
      "rating": "9",
      "text": "Creepy, entertaining, clever and, towards the end, crazy as **** I loved how the plot twist turns a classic horror story into an intelligent satire. Thank you for this pleasant surprise Netflix."
    },
    {
      "rating": "3",
      "text": "An undeniably brutal, but poor spinoff of horror, making it a disgracefully awful modern scare-show"
    },
    {
      "rating": "1",
      "text": "This movie is ugly in the true sense of the word and has nothing to save it. Boring, repetitive and with an ending as stupid as few. The acting is good but otherwise the film does not entertain, it is obvious and bored. Many central elements in the film seem to be randomly placed there with no real logical sense just to carry on the plot which is itself senseless."
    }
  ]
}