{
  "id": 3281,
  "title": "A Cure for Wellness",
  "starring": [
    "Dane DeHaan",
    "Jason Isaacs"
  ],
  "runtime": 146,
  "genre": [
    "Horror",
    "Mystery",
    "Science Fiction",
    "Thriller"
  ],
  "description": "An ambitious young executive is sent to retrieve his company's CEO from an idyllic but mysterious \"wellness center\" at a remote location in the Swiss Alps but soon suspects that the spa's miraculous treatments are not what they seem.",
  "releaseYear": "2017",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/d4fXuJS3zZcAZfz2HYDtnwqtnwn.jpg",
  "categories": {
    "plot": 6.9772727272727275,
    "acting": 7.625,
    "ending": 5.470588235294118,
    "soundtrack": 9.333333333333334,
    "cinematography": 6.833333333333333,
    "familyFriendly": 3.0,
    "funny": 6.5,
    "action": 10.0
  },
  "reviews": [
    {
      "rating": "10",
      "text": "This is a film that is unique in a great way unlike most films. I think why the critics hated the film was because 20th Century Fox didn't get very popular actors. I say as long as the movie is in decent quality, then it doesn't matter what actors you get to do your film."
    },
    {
      "rating": "8",
      "text": "As a movie-lover, one of my rare delights is walking into a movie knowing virtually nothing about it.  Even after seeing the trailer a few times, I had no idea what expect.  I was blown away by this film, particularly by its visuals and its sound. The acting is also brilliant - especially that of Dane DeHaan and Mia Goth. It's clearly a movie that will keep giving on multiple viewings - I definitely plan to see it again soon.  I'd love to hear more about the making of this film."
    },
    {
      "rating": "8",
      "text": "Yeah, I would go ahead and ignore the critics on this one. It's very similar to Shutter Island in how the movie feels and how it's set up, and artistically it's similar to Verbinski's other horror endeavor The Ring. If you liked either of those movies, you'll definitely like this.Even beyond that, I thought it's a very well done mystery film. The characters are interesting and compelling, the story has a plausible plot that still has nice twists and turns, and the payoff at the end is very satisfying. It also has some really interesting motifs that are carried throughout the film, and themes that are subtly built up until the end. Thinking back you can sort of piece together things you maybe didn't realize were connected. It's imperfect, but still a creepy, mysterious, captivating movie. If you're the kind of person that saw the trailer and thought it looked good, you'll like the movie - it delivers on its promises."
    },
    {
      "rating": "8",
      "text": "Well crafted, great music and cinematography.  The story is ok.  Some good **** and bondage.  I watched the whole thing is it was sorta fun."
    },
    {
      "rating": "9",
      "text": "fantastic!    ."
    },
    {
      "rating": "10",
      "text": "Let me just start by saying that this is one of the most underrated movies ever made.the suspense, the thrill, the mind-blowing twists.the cinematography is eye-popping. this movie is equivalent to reading an amazing book.Saying anything else will ruin the twists and an amazing story.just watch it and judge by yourself, one of the movies that either you love very much or you don't."
    },
    {
      "rating": "10",
      "text": "This movie is really different than those superheroes / action movies. I really think that this movie will change the future of movies with FOX and the movies industry in general!"
    },
    {
      "rating": "10",
      "text": "Gore Verbinski has made his masterpiece. I love everything about this movie, especially the music and the incredible performances. I guarantee that this is going to be a cult classic soon."
    },
    {
      "rating": "10",
      "text": "BrilliantIf you are going to see this film you have to WATCH it and not just look at it.The production is pure excellence, with every piece fitting together to bring to the screen a real movie that feels how movies used to be.The visuals are stunning - not the usual 'formula' digitally enhanced kind we see far too much of in movies nowadays, this movie looks like it was crafted by artists in their respective fields - but it is not pretentious in any way, and fits perfectly with the story.All of the performances are first class - with some lesser known but very experienced classical actors supporting the main cast.The story is fascinating, and (if you pay attention) will reveal itself - but not until it is ready to draw you into the world of the writer to reveal it's secrets.For me, this is one of those films that will be forever on one of my lists of favourites"
    },
    {
      "rating": "8",
      "text": "I must say I think this one is getting a bad rap. The movie definitely is inspired by movies like Shutter Island with even the main actor (Dane DeHaan) looking and sounding like DiCaprio.I ultimately think it stands on its own. The movies visual style is fantastic and the acting for the most part is very good. Now where the movie falters is in its story. The story was interesting don't get me wrong and for the most part well told, but is ultimately predictable. With that said i do not regret paying $10 and the 146 minute run time."
    },
    {
      "rating": "10",
      "text": "`°`°`°`°`°`°``°`°`°`°`•`°`°`°`°`°`°`°``°`°`°`°`°`°`°`°`°+@+@+@+@+@+@+@+@+@+@+@+@+@+#@=_=_=_=_=_=_=_=_=_=_=_=_=_="
    },
    {
      "rating": "10",
      "text": "As a big fan of horror/thriller movies, I was very excited when I saw the trailers for the movie and I am happy to say I was not disappointed.  There is a big mystery surrounding what's been happening at the sanitarium where the movie takes place, and unraveling it and piecing it all together is a big part of what makes watching it enjoyable.Not everything that happens in the movie is simply laid out and explained, though the important mystery elements are (if you can keep up with the clues that are given).  The acting is phenomenal and the soundtrack builds perfect atmospheric tension.  The visual effects are also fantastic and make you really connect with the protagonist through the ups and downs of the adventure.Overall this may be a movie with some minor plotholes, but the compelling original story and top-tier production make this movie a must-see for fans of the mystery thriller genre.  Hollywood needs to stop shovelling out sequels and take some notes from Gore Verbinski."
    },
    {
      "rating": "10",
      "text": "A beautiful, well written film with incredible cinematography and relatable characters who you WILL become in awe with! A very intelligent story line within a story line makes you appreciate the artists. Deemed predictable, from ones experience I can a sure it is not and overall an amazing film that will make you think about it for hours."
    },
    {
      "rating": "10",
      "text": "&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&=&=&=&=&=&=&=&=&=&=&=&=&=&=&=&=&=&=&=&=&=&=&=&=&=&=&=&"
    },
    {
      "rating": "10",
      "text": "♡◇¡♡◇¡♡◇¡♡◇¡◇◇¡♡◇¡♡◇¡♡◇¡♡◇¡♡◇¡♡◇¡◇♡¡◇●●●{}{}{}{}{}{}{}{}{}{}{}{}{}{}{}{}》》》》》》》》》》》》》》》"
    },
    {
      "rating": "8",
      "text": "Once again some users tend to try to evaluate movies as a whole instead of dividing them into classes. As a horror classic this film was outstanding. No ghosts or monsters to conjure up but a clear fictional story with real characters. Even my wife enjoyed it and she is by no means easy to get her motivated to see any scary pics. So if you like stories like Frankenstein then this will fit your bill."
    },
    {
      "rating": "8",
      "text": "a cure for wellness is an unbelievably odd film, however it is this oddness that powers it to become an incredibly good film that really has a premise we havent seen before"
    },
    {
      "rating": "8",
      "text": "The cinematography is stunning. Everything looks great and serves a purpose. Some of the imagery is completely disgusting (in a good way.) The film loves to make you feel sick and the need to cringe. Contrasted with some of the fantastical imagery in the rest of the film and absolutely haunting score, the films bears some extremely beautiful and memorable moments. The movie is quite long but after say the first 20 minutes I never felt like it was dragging. I've seen a lot of criticism on the story being 'predictable' and though there are a few plot points I guessed in advance I was very satisfied with the story at the conclusion of the film, although this was marred slightly by some cliche moments mostly towards the beginning of the film. Interesting characters, great actors, effective action, great film overall."
    },
    {
      "rating": "10",
      "text": "As someone who spends most of their time waiting on visually stunning fetish films to roll around into the mainstream media's gaze, this movie is everything for me. Sure, it may face criticism for being \"convoluted\" or \"aimless\" or even just too long. However, in light of an original plot and almost 3 solid hours of pure aesthetic **** goodness, I'm willing to overlook this. I wish they would have taken the darker themes even further. For the average movie-goer, this film may just have them looking for the exit. But for people looking for something a little more grotesquely beautiful, this film is perfect."
    },
    {
      "rating": "8",
      "text": "Yes. Yes. Yes. I have only the utmost respect for this movie and what they did with it. Shutter Island meets Crimson Peak meets American Horror Story:Asylum meets Martyrs. It has a twist at the end that I don’t think someone with perfect vision could see coming. It is wildy perfect and it had me guessing up until the last moments of the movie. There were a lot of things I saw that I wish I could unsee, but at the same time it was so perfect I’m glad I saw them.I can’t even decide where to start first. Do I start with how brilliant the movie was in terms of story? Do I talk about the acting, and how beautifully it was film? Do I talk about Verbanski and how amazing he did? Dane DeHaan, who I think is one of the most underrated actors in the spotlight, stars as Lockhart, a Wall Street stockbroker who’s gotten himself into a little bit of trouble fudging the company’s financial statements. They send him to bring him the company’s CEO, Roland Pembroke, who has seemingly went crazy at a “spa wellness center” in Switzerland, merely to pin all of the company’s wrongs on him. Upon arriving he encounters some of the strange residents of the wellness center, signs in at the front desk as a visitor, and meets the mysterious doctor in charge, Dr. Heinreich Volmer, portrayed by Jason Isaacs(Hello Lucius). Dr. Volmer informed him that visiting hours were over, and that he could come back the next day, so Lockhart leaves to get a room somewhere to stay the night, he notices a young woman walking around on top of one of the buildings but shrugs it off.The next scene was one of the most brilliantly filmed scenes in the entire movie. While driving away from center, a deer runs out in front of the car and there is a major car accident. Seeing the visual effects in this scene were perfect, you get to see the outside of the car plus peeks of the inside and how everything looks while the car is flipping. I can’t tell you how amazing of a visual effect this was. Lockhart wakes up the next day in a room of the wellness center and learns about the accident and that his leg is broken. They instruct him to drink plenty of water and get some rest, as soon as he’s all better he can be on his way with Pembroke. Lockhart decides to explore the center and finally meets Hannah, the mysterious girl from the day prior. She tells him no one ever leaves the wellness center, and the reason she is there at such a young age is because she’s a “special case” and once she’s better her father will come get her. After running some tests on Lockhart, Volmer tells him that he his sick and recommends he stays for a treatment, to which Lockhart agrees. This tests his sanity and his well-being as a whole.There are so many important aspects to this film I couldn’t possibly write them all down without spoiling some important plot. Every character in this film has a purpose, no one stone is left unturned. By far one of the most important characters is Victoria Watkins, a patient who tells Lockhart stories about how the wellness center was once a castle owned by a Baron and his wife. She tells him how the baron wanted a family that was of “pure blood” and the baroness was actually his sister, but she was infertile. He began to do tests on the local townspeople in order to find a cure for her infertility. The townspeople eventually revolted and burned down the castle, and in the process cut the baroness’ baby from her womb, tossing it into the water. Watkins believed the baby actually survived, but everyone else perished.With respect to spoilers, I have to stop the review of the plot here. The cast of this film was stellar. Dane DeHaan, Jason Isaacs, Mia Goth, Celia Imrie, I could go on and on with the cast. Everyone was perfect in the role they played. The acting was excellent and really did justice to the movie.And in my mind, DeHaan is really going places someday. I can’t wait to see what the future holds for him, I think he will do great things with his career, and this movie shows how talented he can be.As far as uncomfortable scenes in the movie, there are scenes to make any claustrophobic squirm in their seats, anyone who is afraid of water will turn their heads, and if you have a problem with anything bad happening to teeth you will cover your eyes and ears. There’s a particular scene in a dentist chair that I still cannot get out of my mind.When asked after how the movie was from a friend, I had to stop and tell them to ask me once I had time to process what I had seen. I am thoroughly impressed with the direction of this film and the guts they had in making it. Most people won’t enjoy this film as much as me, basically because it is different. It is weird. It isn’t your typical mainstream horror/sci-fi film, but that’s half of what makes it perfect. Narrow-minded people might even leave the movie early. Trust me, it is worth it to stay for the entire movie and have an open mind."
    },
    {
      "rating": "9",
      "text": "The movie got me interested with just one beautiful trailer already so I could not wait to watch it. Though you might get a lot of ideas in the middle of the story enough is still held back until the very end, especially the big question of how all of this connects and could be the way it is. Granted, there are no perfectly consistent answers for minor details but that might be for the better to not bring in more confusion and the movie works without those explanations anyway. Overall a very solid and entertaining movie that is definitely worth being watched - if not for the story then at least for the great acting of the main cast as well as the atmosphere and the location. If you are not entertained by the story at all then that might probably be not enough for you but I think it is worth a try."
    },
    {
      "rating": "9",
      "text": "An ambitiously weird ride from Gore Verbinski, A Cure for Wellness is a movie that most people won't see, won't like and won't care about. And that is fine, because movies shouldn't have to cater to audiences. ACFW is a good film that deserves better. The performances are great and production value/cinematography is gorgeous. Probably will be a cult film in a few years."
    },
    {
      "rating": "9",
      "text": "This is absolutely the strangest movie I've ever seen. Think of all the messed up things that you've seen in movies in your life. They will, for the most part, all happen within the long time-frame of this movie. Honestly, from my point of view, this movie's entire foundation and any major acclaim comes from the fact that is is just plain bizarre. I pretty sure I loved it."
    },
    {
      "rating": "6",
      "text": "Promicing beginning, average body, stupid ending. Seriously, compared to such an icon of a movie as Shutter Island this one is not even close. The beginning is really promicing - asylum, old castle, peaceful and beautiful, but you can feel the danger somewhere beneath green grass. Then it comes to dull horror movie full of eels everywhere. Not funny, not scary. And the ending is really absurd - he is alive, along with his daughter, what a surprise! Verdict: avoid this, better see Shutter Island again."
    },
    {
      "rating": "3",
      "text": "The movie started out promising, but halfway through I lost all interest and it turned into a hilariously bad film. It gets a three for being beautifully shot. This movie turned into a ridiculous attempt to one up itself at every turn and honestly I was laughing throughout the last third of the movie. Great fun, for all the wrong reasons though. Pick this one up in a year or two when it ends up in the bargain bin."
    },
    {
      "rating": "10",
      "text": ",,,,,,,,,......,,,,,,,,,+×÷=€£*&^%$#@(),.?!;::\"--▪○○●□■■♡♡♧◇♤{}[]"
    },
    {
      "rating": "2",
      "text": "This movie is such a huge disappointment. The movie had a great potential but they wasted it. The only good thing from this movie is only the production and the mesmerezing cinematography. Instead, they're too focus on making a visually beautiful movie, they forgot they had to write a decent plot for the movie. The writing in this movie are lazy and the plot is the epitome of cliche writing. The movie is 140 minutes long, and I already knew what's going to be the climax in the first hour. The movie is also too long. There are MANY elements that are not relevant to the main plot, but they still show it anyway. And also some of the scenes are actually silly, it's actually laughable. God, I had really high hopes with this movie. I wanted to like it, but it's just too lazy, anti-climatic, and also stupid."
    },
    {
      "rating": "5",
      "text": "While I liked a lot of the creepy scenes, this movie spends way too much time doing nothing. It could've been told in 90 minutes and kept all the major themes/plotting intact."
    },
    {
      "rating": "10",
      "text": "Es mejor de lo que parece, al principio no entiendes absolutamente nada y de pronto ya estás atrapado queriendo saber que prosigue y llegar al fondo de todo, aunque creo que la historia no es tan compleja como para plantearla como algo metafórico y muy profundo, pero me gustó mucho y el concepto de la trama me terminó fascinando."
    },
    {
      "rating": "10",
      "text": "⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$"
    },
    {
      "rating": "8",
      "text": "A Cure for Wellness was a film destined for disaster. A film set in a sanitarium dedicated to providing a \"cure\" to its wealthy patients, the film was immediately pinned as being a similar film to Shutter Island. With its mansion-setting that holds various secrets, a similar production design, and a protagonist running around reassuring everybody that he is not a patient, it is obvious why many critics and filmgoers drew the comparison. Yet, even if the film does try and hint towards this delusion at times, it is always a distraction for Lockhart (Dane DeHaan). It is not the truth. The audience knows it throughout and he knows it throughout. Instead, this is a film straight out of the late 1990s dressed up to be a psychological thriller set in a place with many dark secrets.Using a horror film setup for its execution, the film is set on top of a hill in a small village in Switzerland. Introducing us to Lockhart, an ambitious and smarmy financial services salesman, the film shows him to be dispatched to the sanitarium to find his company's CEO who has disappeared to the sanitarium right before a big merger. Now, with rumors of the merger being in trouble, the stock price is tanking and the CEO needs to come back and sign off on the merger before there is nothing left to merge. Upon arriving, Lockhart quickly determines that this is a place with secrets. Filled to the brim with rich patients who left their lives of seeming luxury to find a cure to become well, the place is run by Dr. Heinreich Volmer (Jason Isaacs). Held there, along with the patients, is a \"special case\" named Hannah (Mia Goth). With classic horror film stories of a Baron who used to live in the mansion and similarly sought a cure for his sister/wife's infertility by running experiments on peasant villagers, only for the whole mansion and his sister/wife to be burned by the villagers, the film is immediately eerie and unsettling. Unrolling this information throughout, it becomes all the more apparent that this is still happening today for a very similar purpose.The film draws comparisons to Shutter Island through this setup about a mysterious old mansion and through a line said by Lockhart's mother early on in the film. Handing him a new ballerina she has sculpted, she tells him that this ballerina is special and different from the others she has made. Compared to the others, this one's eyes are closed and is dreaming. This, as we quickly learn, is Hannah. Both are not just described as special, but both wear blue and are in a world where they are not aware of the fact that they are dreaming and deluded. With scenes of awful treatments and mysteries lying around every corner, director Gore Verbinski cultivates a classic asylum-esque feeling to the film that constantly keeps the audience on edge and uncertain as to what lies around the corner. These terrible experiments and the pain endured by Lockhart and others kept hostage in the sanitarium is unspeakable and why the film has earned a reputation for being entirely messed up. Yet, either it is not nearly as messed up as billed or my tastes in film are more messed up than previously imagined.The film further distracts the audience with more parallels to Shutter Island that attempt to distract the viewer from realizing the truth behind the narrative. These distractions include instances where the doctors track down Lockhart and Hannah in the village and convince the similarly medicated police chief that Lockhart is delusional, scenes of \"hallucinations\" and dreams of eels everywhere, and Lockhart himself coming to believe he is delusional. Yet, the audience constantly knows better. Even when he begins to doubt his own mind, we saw him in the beginning as a regular guy in a financial services company tasked with coming to Switzerland. There should be no delusion here due to this fact, further underscoring how everything at the sanitarium is a massive cover-up, right? Yes and no. The sanitarium is both a terrifying and exploitative scam, but Lockhart is also delusional.This is where the film breaks free and is why it is unfortunate for it to be nothing more than a Shutter Island rehash. Instead, it is far more apt to compare the film to the films of 1999 such as Fight Club, American Beauty, or Office Space. Perhaps, on the surface, this seems an odd comparison, but thematically it is the exact same film. Opening with a scene of a man named Morris working late at night and suffering a heart attack, Verbinski shows us shots of the man's family in a photo on the shelf. With him working late, it is clear that he is largely unable to spend much time with his family. Lockhart's own father, who also worked for the same financial services company that Lockhart now works for, took his own life after being ruined at work. Lockhart, until he goes to Switzerland, is always working. Those who use the sanitarium ran to go get the \"cure\" after feeling unfulfilled in their lives of work."
    },
    {
      "rating": "10",
      "text": "njjjbiniubyhiihyftdesdtguijookokiteqwssxvmokpokkokjfeedsyfguuygyfugugugughiugyfgyuguhihihihih"
    },
    {
      "rating": "10",
      "text": "+++++++++++++++++++++++++++÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■"
    },
    {
      "rating": "6",
      "text": "Gore Verbinski's new psychological thriller is a puzzling movie. On the one hand, there's nothing bad enough in it to prevent me from recommending it, but on the other I still feel that I cannot whole-heartedly. It has promise, but when your film starts to feel like a bunch of cool shots and beautiful scenery strung together by a tenuous plot line, you risk audiences beginning to seek out A Cure for Boredom.From the very first moments, when the film opens with shots of downtown New York buildings bathed in the kind of grimy green light that the worlds of these horror movies are always smothered in (*cough cough* \"Saw\"... *cough cough*) accompanied by an eerie female vocalization (which returns several times in the story with no explanation of its significance), this movie is trying to show you just how creepy it (thinks) it is. And don't get me wrong, it has its moments (I guarantee that you'll never look at an eel the same way again after seeing this), but these have a tendency to come few and far between while the story runs around and around in circles. By the time that Lockhart (Dane DeHaan) begins to see the dark truth behind this seemingly miraculous \"wellness center\", the original plot line of him being sent to retrieve the CEO of his financial company (Harry Groener) and bring him back home has been more or less forgotten. This movie's got things on its mind, you can be sure, but it can't seem to decide what it wants to focus on, and so its visual style and interesting premise become lost in a muddy, mired plot that features the unfortunate combination of being overlong in trying to be epic as well as repetitive and preachy in trying to be thoughtful and intelligent. I would be lying if I said I wasn't somewhat expecting this from a re-teaming of Verbinski and \"The Lone Ranger\" screenwriter Justin Haythe.Perhaps the greatest strengths this film possesses are its visuals, direction, and performances. DeHaan, with his turn as Lockhart, crafts a hero not completely likable (his obsession with survival of the fittest and his obvious dislike of visiting his mother don't exactly make him endearing, which helps us somewhat enjoying, or at least thinking he deserves, the suffering brought upon him) but that navigates the frightening absurdity of his situation with much of the same rage, fear, and disbelief that most of us would. Jason Isaacs, as the German-sounding director of the treatment center, is likely to remind you of a Nazi officer in both his physical appearance and his mannerisms. On the surface he is friendly, seemingly helpful, charming, and by all appearances is intensely concerned not only for his patients but for Lockhart as well. However, he is truthfully a manipulative individual, one who loves playing mind games and constantly seems a step ahead of Lockhart (until the finale because, you know, it'd be no fun if the villain ended up winning for once). Think Annie Wilkes crossed with Ralph Fiennes' Amon Göth character from \"Schindler's List\" and you'd have the idea. Mr. Isaacs is easily the best thing about this movie: he plays his character with such skill that even after we're fairly certain he's evil we begin doubting ourselves yet again. Mia Goth, a relative newcomer, is also skilled as Hannah, a mysterious patient at the facility who is closer to Lockhart's age than most (the others are all octogenarians), and whose relationship with Isaacs' Dr. Vomler character forms the true conflict of the movie. There is something endearing about her performance: she is strange, to be sure, but there is a certain seductiveness about her that she exudes without even really trying to (you all may remember the bathtub scene from the trailers), all while dressed in clothes so old they look like they could have been around about 400 years ago. By the way, did I mention the tragedy that occurred there around that time involving a baron trying to keep his bloodline pure by using the same practice the Ancient Egyptians did?The cinematography is likewise just as skilled. Bojan Bazelli does his best to distract us from how limp and sickly the \"story\" (BWAH HA HA! ...Was that out loud?) of this film really is with beautiful shots of the Swiss Alps, of the facility and with gloomier shots of corporate buildings and the modern world as we know it. The scenes featuring nature and fauna are the ones where sunlight pours in and the light is soft and gentle and puts us at ease. The insides of the facility look like they haven't seen a bit of change since the 1950s and looks a bit like a period piece with some steampunk sensibility. All of this is well and good, but without a decent story to back it up all of the style present is simply for naught.Gore Verbinski is not a bad director. He just, for some reason, continues to work with bad screenwriters. Perhaps another collaboration between him and John Logan is due. The first one, \"Rango\", won a Best Animated Feature Oscar, if you recall. 6/10"
    },
    {
      "rating": "6",
      "text": "The film an art modern fairy tale. The stress curve is renewed several times and does not permit an early conclusion. One feels a bioshock, Shutter Island, Millenium (2009) or even a Krabat remembers. There are sometimes very violent scenes, in whose place I would rather have put the past of the history into the foreground. Sights in spite of the length."
    },
    {
      "rating": "5",
      "text": "\"A Cure for Wellness\" was an intriguing, disturbing, somewhat slow but interesting film, the cinematography was very good, the scenery not so good, the story is good, although somewhat boring, and the actors' performances were good, Gore Verbinski returns to the suspense ring lightly but I enjoyed the movie."
    },
    {
      "rating": "2",
      "text": "I feel like this is me being generous but to be fair I spent most of my time groaning at the story or raging rather than 'in fear and suspense', I just couldn't suspend my disbelief with this! The acting is nice and I DID love the scenery and most of the camera work but the characters, script, and plot? that was just terrible!"
    },
    {
      "rating": "7",
      "text": "This movie is way too long and holds your hand too much as the answers become clearer. However, a solid performance from Dane DeHaan, Verbinski's brilliant framing techniques, and super sound design keep you interested enough to reach the film's solid conclusion. Really weird though."
    },
    {
      "rating": "7",
      "text": "A Cure for Wellness is a flop...but this is the type of flick that will gain more from home video more than anything else. It's a 'psychological' thriller / horror that is clearly inspired by The Shining.  There are some great twist and turns that I will not reveal here, but it's a great commentary of how people choose to believe so many commercial and well marketed stuffs to cure all sort of ailments, even at the detriment of their own health. At 2 1/2 hour, it's a duration that's too much for the cinema, but just right to watch at home."
    },
    {
      "rating": "6",
      "text": "Frankenstein with a different twist. Starts out well and then.....Okokok..could have been much better with the plot. Still, it holds ones interest to a degree. You actually buy into the idea this initial plot is going somewhere big. And then you are let down. Not to bad. I give it 6 and a half stars."
    },
    {
      "rating": "5",
      "text": "A mysterious spa or “wellness centre” set in a remote part of the Swiss Alps. Much like Shutter Island you’re left wondering what’s real and what’s not. Just a shame it’s not as good as Shutter Island. So what are you watching really? Is it a dream? Is it a hallucination? No it’s just a mediocre film that really thinks it’s smarter than it is. As the story unfolds you’re left with nothing shocking or surprising and not only that but you’ll have it figured out soon enough. What is does have is enough disturbingly grotesque scenes to make you squirm in your seat and I can safely say I cannot look at eels or dentists the same again. You’ll spend a good portion of the film internally yelling at Dane DeHaan, no don’t do that, don’t drink that, no stop okay never mind. Jason Isaacs is definitely the stand out performance, although a little over the top in one particular instance he’s still the best thing in this. I was really with this film up until a certain point. Overall it’s an unfocused movie that is simply too long, gradually getting more and more ridiculous. Descending into a horribly messy ending that you eventually become disinterested in. Recommended if you’ve seen all the Oscar movies and looking for something a little off beat."
    },
    {
      "rating": "5",
      "text": "A psychological horror with no real sense of terror rather a nagging creepiness that started off interesting but  the way overlong running time became turned that creepiness to dullness. This film is about 40 minutes too long and the \"twist\" at the end is signposted so obviously that the ending doesn't make it worthwhile slogging through it. Mia Goth puts in a good performance which, for me, just about saves the film."
    },
    {
      "rating": "3",
      "text": "You call this \"A Cure for Wellness?\" Not even a single \"well\" was given whatsoever from me, making this film vulnerable for an easy negative review. This is not wellness and it's not even a cure for it. You blend bad and cure together to get a formula that gives you this. Shame on the people that have wasted their time making this exist."
    },
    {
      "rating": "6",
      "text": "Could have been a great movie, but so many things (little and otherwise) spoiled it. After watching this movie, I'm left questioning how a skinny young man can tear apart a toilet from the pipes and screws holding it down with his bare hands. We fail to see just how he escaped the institution after having his tooth drilled out; we just see him hop into a car. We fail to see how he managed to get into Volmer's office towards the end. The end was a bit ridiculous. The movie got really confusing towards the end with opposing plotlines. 6/10."
    },
    {
      "rating": "7",
      "text": "The well film with a unusual story, wonderful DeHaan's actor game and some beautiful picture. I watched 2 hours in lightly without a boring."
    },
    {
      "rating": "10",
      "text": "$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.■》■》■》■》■》■》■》■》■》■》■》■》■》■》■》■》"
    },
    {
      "rating": "6",
      "text": "A very strange film that has some commendable moments.  I can't say this film hooked me all the way through as it does have times where it drags.  At 2 hrs. and 20 min. the film could have been cut down some which would have led to a tighter story.  I give the film points for originality and for keeping me thinking.  In the end the film got to me enough to give a mild recommendation for it.  Low B"
    },
    {
      "rating": "0",
      "text": "Throughout the film the authors try to say something abstruse, but ... nothing intelligible are said. The thought does not build, plot does not converge. The absence of a semantic concept in the scenario gives rise to a lot of allogisms and empty, meaningless scenes. By the end of the first hour of viewing the movie, it becomes obvious that the director himself does not understand what is actually going on in his film. The film is not consistent not only storyually but also stylistically. In it are clumsily mixed different genres and forms of narration are hinted. Phantasmagoric, realistic thriller, mysticism and horror - all lumped together into one pile. In the end, it should be noted that the film is simply stupid."
    },
    {
      "rating": "7",
      "text": "A cure for wellness is an interesting movie. It has a lot of flawed and It's not for everyone. But I enjoyed it, the acting and cinematography. In it was just amazing"
    },
    {
      "rating": "4",
      "text": "This mish-mash mess of a story takes a young New York exec (Dane DeHaan) to a wellness center in the Alps (a stunning location). He immediately senses something's not right and spends the rest of this almost 2 1/2 hour movie sneaking around the property trying to uncover the truth behind the mysterious experiments. Inexplicably, he seems to have access to the property's most secretive recesses. There's lots of creepy settings and ominous music, but no suspense. The plot, which is riddled with holes, borrows elements from dozens of previous films, including hints of \"Frankenstein\" and \"Phantom of the Opera.\" It's sometimes visually interesting and even occasionally unnerving, but not nearly enuff to support the tedium of the pace. The finale doesn't live up to the promise of a shocking revelation."
    }
  ],
  "recommendations": [
    "enemy",
    "the_invisible_man",
    "us",
    "annihilation",
    "the_autopsy_of_jane_doe",
    "shutter_island",
    "a_quiet_place_part_ii",
    "the_ritual",
    "the_mothman_prophecies",
    "annabelle_comes_home",
    "coherence",
    "under_the_skin",
    "reminiscence",
    "color_out_of_space",
    "bad_times_at_the_el_royale",
    "hugo",
    "midnight_special",
    "predestination",
    "the_lodge",
    "colossal",
    "vivarium",
    "the_conjuring_the_devil_made_me_do_it",
    "inception",
    "donnie_darko",
    "the_green_knight"
  ]
}