{"id": 4317, "title": "A Family Man", "starring": ["Gerard Butler", "Gretchen Mol"], "runtime": 108, "genre": ["Drama"], "description": "Dane Jensen is a driven, Chicago-based headhunter, working at a cut-throat job placement firm. When Dane's boss announces his retirement, he pits Dane against Lynn Vogel, Dane's equally driven but polar-opposite rival at the firm, in a battle for control over the company.", "releaseYear": "2017", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/hCUrI8v523NQDJNKoDxGq2nvbvw.jpg", "categories": {"plot": 6.0, "acting": 6.0, "ending": 5.0, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 3.0, "funny": 5.0, "action": 6.0}, "reviews": [{"rating": "4", "text": "Butler, Dafoe, Molina, Mol and Brie. A great cast. And judging by the premise, this movie should be a real tearjerker. But this is one of those dramas that really tries too hard and obvious to make you eyes water up and by that, it becomes annoying and unemotional instead. Almost every scene aims to pull at your heartstrings with a cheesy unimaginative script, topped off with a really flat directing."}, {"rating": "6", "text": "Ah, the new movie starring Gerard Butler, the poor man’s Clive Owen, always up for some good all-American entertainment that makes you think but also makes you smile.This one’s about a headhunter whose life revolves around closing deals in survival-of-the-fittest boiler room. He battles his top rival for control of the company, but then his oldest child falls seriously ill.Also starring, Gretchen Mol as the loving but ever-suffering wife, Willem Dafoe as the ruthless boss, Alison Brie as the rival and Alfred Molina as the token solid supporting male character.First and foremost, „A Family Man“ is a genre movie, which means it’s produced and put together of cliches in hope of finding a suitable mainstream audience.The approach is pretty solid one, using several drama subgenres in order to appeal to wider circle of cinema-goers, including sick child story, a middle class American success story, finding yourself again story and some „Wall Street“ type high-octane competence porn.The execution is actually pretty solid too. The able cast are doing their darndest best to act through all the material, and there’s a lot of it.108 minute movie may feel quite a bit longer, at least for those who have seen way too many movies to take all these cliches and workmanlike storytelling seriously.On the other hand, those who still watch movies as just a nice way of passing time, or aren’t tired of bland dramas made of middle-class dreams and aspirations, can definitely find some entertainment here.They don’t even have to think how to feel because the movie manipulates you in all the right directions at the right time.I am taking a wild guess that \"A Family Man\" is most suitable for girlish audience, but it will also surely feel in the right place when it’s 2 am and you’re desperately trying to find something new to watch with Butler starring in it.He’s a doing a fine job too, the whole result relies on his manly charm and grunting.All in all, there’s nothing wrong with „A Family Man“. It’s just there’s nothing terribly exciting either, with the creative bar set relatively low and all.I hope I didn’t sound too ironic here or something, I quite liked the movie for what it is."}], "recommendations": ["suburbicon", "the_intern", "the_family", "chef", "silver_linings_playbook", "good_people", "white_boy_rick", "moonrise_kingdom", "the_best_exotic_marigold_hotel", "burnt", "the_dilemma", "instant_family", "i_feel_pretty", "the_town", "enola_holmes_2", "knives_out", "booksmart", "hell_or_high_water", "life_of_the_party", "a_simple_favor", "3_days_to_kill", "don_jon", "fighting_with_my_family", "going_in_style", "the_gentlemen"]}