{
  "id": 3056,
  "title": "A Ghost Story",
  "starring": [
    "Casey Affleck",
    "Rooney Mara"
  ],
  "runtime": 93,
  "genre": [
    "Drama",
    "Fantasy"
  ],
  "description": "Recently deceased, a white-sheeted ghost returns to his suburban home to console his bereft wife, only to find that in his spectral state he has become unstuck in time, forced to watch passively as the life he knew and the woman he loves slowly slip away.",
  "releaseYear": "2017",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/rp5JPIyZi9sMob15l46zNQLe5cO.jpg",
  "categories": {
    "plot": 6.290322580645161,
    "acting": 6.523809523809524,
    "ending": 6.571428571428571,
    "soundtrack": 5.666666666666667,
    "cinematography": 4.875,
    "familyFriendly": 3.0,
    "funny": 0.0,
    "action": 7.833333333333333
  },
  "reviews": [
    {
      "rating": "6",
      "text": "Some people are going to love it, others will hate it, I'm in the middle. Some of its visual storytelling and emotional ambitions work and truly designate, however other times (especially in the first act) things can feel alienating or slow. If you're a fan of indie cinema then this isvyour dream film, but fans of blockbusters may check out early."
    },
    {
      "rating": "6",
      "text": "It's the kind of movie that, if you're well-versed in philosophy and metaphysics, you'll probably love it, but, if not, you'll likely come away with a decidedly puzzled look. While it's certainly laudable that the director has aspired to make a picture that appeals to an intellectual and enlightened audience, the finished product could also be seen as an exercise in preaching to the choir. Its depiction of various philosophical and spiritual themes is deftly handled through an atmospheric production design, minimalist dialogue and an ethereal soundtrack, though there are times when the patience of even the most tolerant fans can get tried (and when a fast forward remote would definitely come in handy). Nice try, but not quite what it could be."
    },
    {
      "rating": "5",
      "text": "No matter how bizarre or polarizing a film from them looks at first glance, A24's name being attached to a film is usually all the incentive I need to check it out, as I've always highly admired their keen eye for unique and/or bizarre premises and stories from the films that they (usually) wisely choose to distribute. That was certainly the case for this film prior to me seeing it, as I was highly intrigued by its simple yet universal premise of life, love, loss, etc. Unfortunately, the best way for me to sum this film up is 'huge potential wasted.' The film felt incredibly disjointed, jumping from so many random points and events in time. In addition, Casey Affleck and Rooney Mara's talents felt rather wasted to me, as they literally don't speak for well over half the film (seriously, I'm pretty sure a little over half the film contained no dialogue, as the entire middle act of the film is borderline silent). To top it all off, the film felt to me as though it really had no clear sense of direction or what it wanted to convey at certain times or how to convey certain things. So many scenes felt as though they were there just for filler purposes. An excellent case in point: We get to watch a depressed and grieving Rooney Mara eat a whole pie in her kitchen for about 5+ minutes. Overall, some of the film's ideas and symbolic purposes pertaining to its subject matter were somewhat interesting, and it had some decent imagery as well, but the rest of this film felt very void-like, much like the film's subject matter, which was certainly what I wasn't hoping for."
    },
    {
      "rating": "4",
      "text": "Probably the most boring movie I've sat through in quite a while. Oh I get why critics love it, because they look for deeper meaning and metaphors and symbolism, but all this is is a pretentious indie movie that did not need Affleck or Mara in it, since Affleck spends 90% of his time acting a sheet, talk about methud acting, and Mara gets 10 minutes. The best performance is by the house. Where was the Ghost therapist when they were needed, or the exorcist? See the ghost, see the ghost turn it's head (nice touch Casey), see the ghost floating around in limbo. Next sequel is ghost driver: a camera follows a Saudi woman driving through Riyhad, endlessly."
    },
    {
      "rating": "10",
      "text": "I don't how to express my feelings after this movie. This is literally the only movie which I would rate 100% Of course if you are looking for an action movie just don't watch because you will be wasting your time. But if you appreciate art and deep thoughts you will fell in love with this movie. People are complaining about that every action on this movie is shown for too long, but I think these moments let you think and go deeper and deeper every second of this movie. For me this is gold"
    },
    {
      "rating": "9",
      "text": "This film is definitely not for everyone. It's a conceptual piece, and anyone looking for a traditional \"ghost story\" will surely be disappointed. This is not horror, it is art. Something simple, yet so powerful it stays with you long after it has ended. The film shows the loneliness of death, not only for those loved ones left behind, but for the one who's gone as well. Our innate inability to let go, to move on, even in death. It's tragically heartbreaking, but there's also beauty in the melancholy of it all."
    },
    {
      "rating": "0",
      "text": "I guess David Lowery decided that the best way to make the point that ghosts' lives are boring and endless is to create a boring, endless movie about them. If he was trying to create a subtle metaphor between the futility of his fictional ghost's life and our own, he threw subtlety out the window he decide to smack us over the head with a freshman-in-college level diatribe about how the universe is all going to wind down one day, so everything we do is ultimately for naught. Maybe I am getting old and jaded, but this was a shallow movie whose only points have already been made so many times and so many better ways (i.e. see Stoppard's Rosencrantz and Guildenstern Are Dead for a funny take on pointlessness or even Lowery's own TV show Rectify for an example on futility) that it really had no reason to be made. If Lowery wanted to explore a story about the endless lives of ghosts, he should have concentrated on the details of their day-to-day existence, and let the audience extrapolate that into hopelessness. Instead, he went straight for the hopelessness leaving nothing for the audience to do except nap or maybe think about how much better their lives would be if they would only get up and walk out of the theater."
    },
    {
      "rating": "10",
      "text": "A cinematic experience unlike any other. Leave your ego at the door and let it take you wherever it needs you to go, and you'll find something beautiful there. This is completely transcendent film making."
    },
    {
      "rating": "3",
      "text": "A Ghost Story is overly convoluted and pretentious; what seemed like it could be a tinder love story with a twist, turns out to be a 92-minutes long supposed lesson about life, filled with 10+ minutes \"one take\" sequences of Rooney Mara wandering around, staring at walls, sniffing while eating pie and then throwing up, and a 6'2 200 pound actor roaming a house with white bed sheets on, also staring at walls and through windows aimlessly. A Ghost Story is just empty, seamlessly purposeless for any mainstream moviegoer, and otherwise."
    },
    {
      "rating": "10",
      "text": "A very good movie.I love the music in it. For those who gave zero without watching it, seriously, this is disrespectful to other staff who were working in this project; btw, if you believe those accusations, read those legal files online filed by both parties, see the evidence yourself, don't just read the news and jump to the conclusion."
    },
    {
      "rating": "0",
      "text": "Are you kidding me?!  Critics, please stop being so pretentious.  This should have been a short film and you know it.  The entire film consists of long, repetitive scenes with sad violin music playing in the background (e.g. a women eats a pie while crying for idk... 10 minutes!) If you piece together all the footage of the motionless ghost and his sad violins, you know what you get?  --half of the movie, at least HALF!Let me put it this way:  Ever been in a modern art museum and wonder why, oh why, is this piece taking space?  You see a large blank canvas that has a rip in the center of it, but the person sitting next to you see's \"the artist's struggle with the world and it bleakness, his frustration with his talent, and the crushing expectations of the world upon his shoulders\"  Well, let's just say this movie is that canvas."
    },
    {
      "rating": "5",
      "text": "If it hadn't been for Casey Affleck and Rooney Mara starring as a married couple, I doubt this film would have gotten made. It's so self-indulgent and somewhat pretentious. His character dies early on and comes back to haunt their home in a flowing white sheet with 2 eye holes. Other hints that this was a hollow exercise in art: the screen format is square with rounded edges and every scene unfolds with a sloooow pace and usually static camera (the worst is watching her eat a pie in wide shots for at least 5 minutes). In case you hadn't figured it out, this is NOT a horror movie. It's not that kind of spectre, but a lonely soul on an existential journey. I'll concede that the plot is original and ultimately \"haunting,\" but the pain leading up to it will only appeal to those who like pensive reflections on life, love and eternity."
    },
    {
      "rating": "8",
      "text": "Heading into A Ghost Story, one cannot be blamed for assuming it is an examination of grief. With a young husband (Casey Affleck) dying early on and wife (Rooney Mara) mourning his loss, eating pie, and trying to move on without him, it is easy to see how the film is about grief. Yet, in equal measure, it is a film about memory, time, purpose, music, stories, and every little detail that makes life so eternal, so essential, and universal. It is a film about grief shown through the lens of an unexpected protagonist - the ghost under a sheet - who traverses time, space, people, and location. Powerful, poignant, and silently accomplished, A Ghost Story is a rousing return to form for director David Lowery after working for Disney last year. In this low-key, gorgeous, and powerful film, Lowery re-establishes himself as the heir apparent to Terrence Malick's cinematic poetry throne.Silently sewing together images, Lowery's camera frequently finds stunning images. From the very beginning, shots of Affleck's ghost walking through open fields to get back home with the sun peaking over the horizon, the ghost lurking in the background with Mara in the foreground, or the shot of light pouring in as the home is destroyed, A Ghost Story is a film with stunning visuals. This was very much the case with Lowery's prior effort Ain't Them Bodies Saints - which also starred Affleck and Mara - and it is nice to see him return to this gorgeous style. However, compared to that film, Lowery is much less reliant on the beauty of the outdoors to create stunning imagery in A Ghost Story. Rather, he now relies upon drab gray and brown interiors, dark shadows, and a largely gloomy home that is fashioned as a prison cell for this ghost for the rest of eternity until he finds what he has been looking for all this time. Dark, ominous, and spooky, this locale is one that would work for a horror film, but rather, Lowery uses it as a place for existential horror. This ghost is doomed to stay here until he can get the note left behind by Mara that he wants to retrieve, yet he is unable to break through the painted wall to reach the note. Trapped, lonely, and solemn, the ghost's existence is one of little joy, pain (especially when Mara tries to move on), and anger at how he has been so easily forgotten.However, what is perhaps most interesting is how the aspect ratio communicates so much. Lowery himself has stated it was to make the film more claustrophobic to show how trapped the ghost is in this home, but that is just scratching the surface. With a squareish frame and rounded edges with drab colors, the film often looks like an old photograph. This is particularly pertinent due to the film's thoughts regarding memories and the little pieces of ourselves that we leave behind. Being remembered, our memories, and our brief time on Earth after which we are forgotten forever, are all constantly on the mind of A Ghost Story throughout. Mara leaving little notes of things she likes in houses she moves from, the quiet mourning of her husband, and a party guest speaking about memory and Beethoven, all exemplify this element of the film. Yet, what is abundantly clear in A Ghost Story is that time does not matter. It will advance, things will be left behind, people die, and people move on to other places. In the end, the only thing that does matter are the little pieces of ourselves we leave in the hearts and souls of those we touch. As Affleck silently lingers in the background with Mara eating a piece of pie, this fact is felt. She does not need to say anything, nor does he. Both miss one another and it is not because they existed, were in that home, or were even because they were married. Rather, it is because they both touched one another's lives and, now, circumstance and a freak accident have taken them apart from one another. Instead of holding one another, they now are left wallow in the solitude and thickness of the air in the home as they try to soothe the hole in their hearts.With a minimal script that often amounts to a character standing stationary for a period of time to the ambitious time traveling finale, A Ghost Story is a film that is nearly impossible to not compare to the work of Malick. Yet, it is not just in the style and ambition that Lowery manages to capture the feeling of Malick's best works, but also in the feelings they emote. The best Malick films, such as The Tree of Life, are ambitious and show life from the very beginning to the present day with a silent, melodic, and poetic flow to the proceedings. A Ghost Story is very much the same way. Instead of being a typical narrative film, A Ghost Story is often best described as visual poetry. Through small suggestions, such as what is on the paper (it is the quote from the book that Affleck knocks off the shelf and Mara reads for sure), or through this gorgeous mosaic of images that, on their own, often communicate every emotion and purpose perfectly, Lowery"
    },
    {
      "rating": "5",
      "text": "If you are a die-hard fan of Casey Affleck or Rooney Mara or David Lowery, you should see this film. For everyone else, it is optional. It is much more of an “art film” than a traditional ghost story, and some scenes went on much too long (I kept thinking Terrence Malick – sometimes interesting, but not always). I don’t want to put in any spoilers, but a few things simply didn’t make sense or were downright annoying (like the pie gluttony or the hateful guy at the party who “knows it all”) – and the beginning of the film was so quiet that it may have been meant to shame anyone eating popcorn or pretzels like me. You could hear a lot of people moving around in their squeaky seats – so the director miscalculated his “silence effect” (or is unaware of the current state of cinema seats). I didn’t love it and didn’t hate it, but was not particularly intrigued by it either."
    },
    {
      "rating": "8",
      "text": "This is a slow moving spectacle that began to captivate me with an intense basically silent sequence. This film will not be for everyone but feel free to be swept away in this thought provoking gem. A-"
    },
    {
      "rating": "7",
      "text": "A Ghost Story is a glacially slow, painful burn, but there is a lot to admire and unpack. There are some really deep, poignant questions raised about loss and how we deal with it. The score is great, the cinematography stunning, and you'll definitely be taken on a ride with A Ghost Story. It is really, really, really slow, but if you can get through the first and second act, you'll definitely be hooked."
    },
    {
      "rating": "7",
      "text": "I'm still turning my head over trying to decipher and understand what I saw. This movie no doubt comes to mess with what an art film represents and what it can mean for people who do not consume or enjoy these types of movies, after all, this movie has been called boring, tedious, pretentious, overrated and yes also a masterpiece and let's be honest, all those things may be fair depending on what each person is looking for in a movie.And yet how can I review this movie? honestly I'm still not sure even while I'm writing this. I have my interpretation and I am pretty sure of it.Primarily A Ghost Story is all about contemplation, a dense contemplation, we have about 15 minutes to meet our protagonists, we know they love each other, they are together and they seem to be happy, but that life disappears when the life of Cassey Affleck's character ends in an accident, what follows now is the contemplation of the loss, the grief and the mourning. We watch Rooney Mara's character continuing with her life while the ghost of Casey's character follows her tirelessly until she finally leaves the house they both shared.The following are other points of reflection but they feed on a singular point which is strongly focused on mortality and our own legacy, our own significance and our own irrelevance, is a strong and solid meditation on love, anguish, memories, loneliness and continuation, what we lived, what we felt, what we loved and what we lost.It is a teaching and perhaps it leaves the message that eventually if there is a life after death and we must go on into that unknown path maybe everything we built throughout our lives will not mean nothing in the end, but they meant something while we live and maybe that's the final message of this movie with that final scene, moving on after recalling what made you live in the first place. Closure for our souls, maybe someday we'll all experience it somehow, who knows?"
    },
    {
      "rating": "0",
      "text": "Lmao. Seriously. Who was drunk when they wrote the script?  Worse yet who thought this would make a great film.  You put a sheet over the guys head to make him a ghost. Lol. One scene maybe where he is making fun of his death with a sheet maybe.  Maybe.  Think movies that have done this better.  Hmmm. Ghost with whoppieach goldberg.  The Sixth Sense.   This movie doesn't deserve to even be made.  Stop giving good ratings to terrible movies.   You encourage others to make terrible movies.  Listen I went to college and I get the whole universe may be connected time thing okay.  Not unique.  But don't cheat the viewers. Lol"
    },
    {
      "rating": "9",
      "text": "You'll think about this film for weeks on end, wonderfully constructed and touching deep on questions of loss, time, immortality and the ultimate end of existence.  Drawn out scenes give the viewer time to immerse themselves in thought and reflection on the scenarios. Passing of time wonderfully managed without losing focus on the premise of the film."
    },
    {
      "rating": "10",
      "text": "Watching this movie was one of the best film experiences I've had in a while. This film is incredible.It's a profound and emotional experience the likes of which I haven't had sice maybe Neon Genesis Evangelion (the infamous pie scene is comparable to Evangelion's elevator scene. You know the one).Such a great, depressing, existensial crisis of a movie. I loved it."
    },
    {
      "rating": "3",
      "text": "A Ghost Story attempts profundity, and there is an A list cast, but I felt that it was ultimately unsuccessful.  Casey Affleck is acting without speaking and with a sheet over his body most of the time, so you can't really get much emotion out of it. Couldn't the ghost be portrayed in a fashion that could still show facial features and emotion? I felt that his relationship with his wife, Rooney Mara, should have been the focus of the movie, but she leaves the movie too soon, and she doesn't have any interaction with the ghost.  Any potentially interesting avenue to explore (like the relationship with the ghost next door) is given short shrift.  No, I didn't expect a horror film with a lot of action, but I still expected more interaction among the characters.  As others have said before, it was boring and uninvolving."
    },
    {
      "rating": "10",
      "text": "Little bit slow in the first but it is worth watching! Fantastic story with some great visuals, deep meaning & wonderful music. I hope the director gets nominated in the oscars."
    },
    {
      "rating": "2",
      "text": "....where the 4 stars comes from is beyond me.5 YAWNER for certain.The most action is when the chick plays like she eating a whole pie in grief,and RACES to the bathroom to hurls,ok theres the poltergeist scene with the flyin dishes..first 10minutes into the movie was a forecast,BORING. Rooney and Casey and the stars and the come on trailer it would be great...90 minutes of a sheet with holes cut out...lifeless movie trust me."
    },
    {
      "rating": "1",
      "text": "Self-indulgent tripe and not even mildly interesting self-indulgent tripe.  Extremely boring (although if you ever wanted to watch someone eat a whole pie in real time, you're in luck) and complete with 4 utterly irrelevant scenes designed to add 'depth'.   Gives crap boring art films a bad name."
    },
    {
      "rating": "10",
      "text": "AMAZING! Casey Affleck and Rooney Mara made me feel for them in the span of five minutes. Movie has incredible dialogue, especially one scene with William Oldham at a party (you'll know it when you see it)."
    },
    {
      "rating": "6",
      "text": "A Ghost Story is probably too precious for its own good. There are many scenes, including the couple much talked about long takes, that feel like they're there to announce what kind of movie this is (a litmus test of arty endurance - I kept expecting people to walk out or start screaming at the screen but neither happened during my viewing), rather than serve a dramatic purpose. But they only feel that way during the time you are first watching them. After finishing the film and reflecting on these same scenes, they take on a new elegance that wasn't there before. This is a film that probably needs a rewatch for full appreciation, not because of plot complexity but instead emotional.I found myself stimulated, bored, confused, glum, and profoundly moved - that a movie can somehow conjure all these feelings during the course of one viewing is a true feat of experimental prowess."
    },
    {
      "rating": "7",
      "text": "The art house may not always be your go-to place for a good time out, particularly amidst the summer blockbuster season, but let me say: it often draws paths to the answers of whatever life questions you may regularly ponder. Although A Ghost Story falls into the category of “love it or hate it,” please know that it came from A24, the remarkable independent studio which brought us life-changing works about the inner human spirit, such as Ex Machina, Room, The Lobster, Swiss Army Man, and Moonlight. Now, they did it again with this almost silent film that exploits its tiny sixty-member cast and crew.The director/editor David Lowery (Pete’s Dragon) has proven his mastery over both of his responsibilities; he follows what more experimental filmmakers do nowadays, and utilizes long uninterrupted shots to its greatest power. The camera seldom moves as it lingers on the small moments for an uncomfortable length of time—the moments he chooses to linger on supposedly communicate nothing, calling us to wait in anticipation.Lowery can truly make each frame tell its own story under its 4:3 aspect ratio, the corners rounded off, as if watching a hopeless widow’s Instagram story. You could literally watch it on your phone for the compatibility of its visual style! He stated before how he “wanted to make something small and tiny and handmade,” (Filmmaker Magazine) and he well and beyond fulfills what he hinted at, as he creates such a cold environment inside the claustrophobic house the weary spirit refuses to leave. Especially in the large-scale moments, such as a walk in the grassy plain, Lowery keeps things as intimate as possible.The ghost’s simple design intrigues the senses: the familiar white bedsheet with holes cut in for the eyes creates some hauntingly surreal imagery. Nobody can see him there under the sheets from his hospital deathbed other than us the spectators, turning the already unsettling vision of a white strolling figure all the more eerie.You can for certain love the accompanying musical score by Daniel Hart, (The Exorcist TV series) whose work echoes against itself as if the purpose of music could never be understood until you croaked. I highly recommend buying the soundtrack.However, like other new directors given a limited $100,000 budget, several issues still blare hot amidst the triumphs. Spoilers out of the way, the third act features time travel elements that receive too little time spent on sensical explanations. Its “open to interpretation” story gets too carried away with itself for public appeal. The ethnical casting decisions also causes distance between reality, as explorations of the limited cultural space are brilliant, yet Whitewashed: an Americanized Mexican family structure comes to mind, as well as a tribe of savage Native Americans. Likewise, two White drop-dead gorgeous celebrity A-listers play the lead roles, and barely any information is communicated about what these two lovers think of one another.Rather, the aftermath of the death triggers the most empathy. If you have ever been in love or felt in love, the silent loneliness each individual faces will deeply resonate. The eerie nature of a widow being watched by her dead husband skyrockets in sorrow; you too want their wants due to actions rather than words.The two leads, both together and apart, allow you to feel as hollow as the spirit on the poster. The husband, played by Casey Affleck (The Assassination of Jesse James by the Coward Robert Ford, Manchester by the Sea) wears the cotton sheet throughout 95% of the runtime, stunningly sad in posture just by staring with his misty nonexistent eyes. As for the wife, played by Rooney Mara, (Carol, The Girl with the Dragon Tattoo) you feel her pain just by her eating a full pie until she pukes. When close up, she has no need to give a dramatic cry-face to express your tears as she listens to her former-husband’s original music.Lowery understands his craft in blocking actors, with strict emphasis on posture, such as when the live husband cuddles his wife in bed or strokes her sobbing body with his cloaked, disembodied hand. He can generate the most out of each performance, even if one of them only exists to spill out philosophies around the theme.Lowery has demonstrated his ultimate strength as a director in constructing this effective, nonpreachy message. It helps you reconsider the importance of letting others know the impact of their legacy before breathing one last time, so they won’t resort to imagining a miserable afterlife most everyone in the world fears."
    },
    {
      "rating": "10",
      "text": "One of the best films in recent years, David Lowery's incredible follow-up to Ain't Them Bodies Saints (another underrated masterpiece) finds a way to surpass its predecessor and join the ranks of films like The Tree of Life and 2001."
    },
    {
      "rating": "0",
      "text": "Defiantly arthouse. Should be called \"A S**tty Ghost Story\". After fast forwarding through long scenes of nothing (there is literately a 5 min pie eating scene), you're left with a 10 min short."
    },
    {
      "rating": "0",
      "text": "What an boring and awful movie! Its slow, and NOT interesting. There's a 10 plus minute take where the camera films a woman eating pie. The movie is filled with these type of camera takes throughout the movie. This is NOT art, or a movie. Just garbage"
    },
    {
      "rating": "0",
      "text": "The most boring movie I have seen in a while. Nothing happens. Literally. I don't get how it got such good ratings and I really really believe that I am not a minority that somehow doesn't like the movie."
    },
    {
      "rating": "1",
      "text": "Once again I wonder why the so called professional movie critics rated something so high when for myself it was terrible.  With only 7 people in the entire auditorium watching we all came out shaking our heads in disbelief.  Not only is the nutty square filming (picture) crazy when you are watching it on a nice wide screen but the story is.....well there is no story that any of us could see."
    },
    {
      "rating": "9",
      "text": "It's a such a unique framing on both the pathos and euphoria of life, love and loss. I'm a bit befuddled on the topic of nothing happening or finding it boring. It wasn't set up to be an action movie. One of the characters has to endure loss through linear time that they can affect, one is trapped and has to observe things without being able to change them. If you're in an open frame of mind, this movie is a beautiful romp through the heart and soul."
    },
    {
      "rating": "3",
      "text": "Drawn out and boring . This is the film that gets made so stupid people that like to think they are smart can say how great it is, because the were special enough to like it. But really they were bored. You would be better off watching paint dry than watching this film."
    },
    {
      "rating": "9",
      "text": "A very surreal and captivating tale that will leave you pondering its story long after the credits have rolled. Perfectly paced at just over 90 minutes, A Ghost Story is a film thats obviously not for everyone but for those who have the attention span to view it, its worth seeing."
    },
    {
      "rating": "8",
      "text": "\"We build our legacy piece by piece and maybe the whole world will remember you or maybe just a couple of people, but you do what you can to make sure you're still around after you're gone\".A Ghost Story is a simple and yet puzzling story upon looking deeper into it's roots. Everything from great acting, directing, cinematography and excellent framing.Can be described as a fascinating piece of art, that if I told you it's the same director of \"Peter's Dragon\", you'll think it's a joke. A little bit too obvious with the main message. The whole thing is still emotional moving though.I can see why some may think this is pretentious, but it did something that's so close to our thoughts and isn't at all shallow. However, the middle part literally explains the meaning of the story by a certain character. But strangely what that character said was pretty thought-provoking. It's the best/worst scene of the film.Oh and the 5 minute pie scene made hungry. Was it chocolate? Because I want some."
    },
    {
      "rating": "9",
      "text": "This is a very sad, complex, and though provoking movie. A love movie with the questions Why do we exist? What is the meaning of life? And the whole time travel part of the film. The performances by Rooney Mara and Casey Affleck are great and really hold the film up"
    },
    {
      "rating": "10",
      "text": "A Ghost Story es una película de carácter minimalista y a su vez muy envolvente, nos pone en dos perspectivas diferentes, la primera de una persona que tiene que lidiar con la reciente y abrupta perdida de su ser amado y el como dicha alma perdida sigue presente en su entorno, por otro lado tenemos a la fallecida alma en pena antes mencionada que una vez se da cuenta de que aquella persona a la que decidió quedarse a cuidar se ve atrapada forzada a quedarse en ese plano espiritual y a su vez físico por el resto de la eternidad y ver a toda la gente que reside en el hogar de la desdichada pareja."
    },
    {
      "rating": "10",
      "text": "An incredibly moving movie. Lowery is such a master of storytelling and I also loved how both Casey Affleck ans Rooney Mara portray these characters. Loved this movie"
    },
    {
      "rating": "4",
      "text": "I was pretty underwhelmed by the movie I have to say. Nothing substantial happens in the first 20 minutes. I felt the movie was trying to creation meaningful connections and emotions and I don't think it was quite successful. I'm a fan of Rooney Mara but in recent movies (the goddamn atrocious Song to Song, for example), she has played non-descript roles that don't make her shine."
    },
    {
      "rating": "8",
      "text": "A Ghost Story is a uniqe movie. Although the movie has a stationary flow generally, it succeeds to set something inside the viewer to action thanks to the successful cinematograpghy techniques and hitting storyline. But I have to say this, it is not a movie to get rid of boredom. In some everlasting scenes, you feel a powerful urge to throw something to the screen. Therefore, I am a little doubtful while recommending this movie."
    },
    {
      "rating": "9",
      "text": "Can totally see how some people wouldn't care for this film, but I think getting lost in the melancholy depth of it -- then talking it out with someone who also was paying close attention -- would make all the difference. Used to have a friend who was the best movie-going buddy ... game for almost anything, hours of discussion later. Wish this person were still around. My own takeaway: Not that you want to \"haunt\" anyone, but to linger in someone's memory ... yes."
    },
    {
      "rating": "8",
      "text": "A beautiful, yet sometimes hard to accept and understand (but isn't life itself ?), story about the meaning of life and how love can be the most powerful motivation that transcends death itself."
    },
    {
      "rating": "4",
      "text": "Having been killed in an accident a man returns to his wife and home as a ghost but, unable to interact directly with anyone, he is largely trapped as a passive observer.I’ll be honest and say up front that I was largely bored by this movie. I admire A Ghost Story for its originality but there are simply too many shots and scenes that linger for too long, especially during the opening half hour, and in the end it all felt like a short film stretched out to feature length running time."
    },
    {
      "rating": "8",
      "text": "Though it's absolutely not for those with innately thin patience, David Lowery's \"A Ghost Story\" has a ton of depth to its quiet, minimalist, yet still somehow lofty narrative. From its musings on life, death and time, to its take on the meanings behind all three, the film is virtually replete with sobering, stark and beautiful ideas, gently goading the audience towards developing their own interpretations after the film concludes. It's a total gem to look at as well, what with its arresting cinematography, terrifically well-thought-out scene transitions and its understandably melancholic approach to costuming and production design. The beginning's a bit of a trudge — with the infamous pie-eating scene marking just one of the many long takes I honestly still find myself questioning the need for — but once you're past that, it's non-stop fascination."
    },
    {
      "rating": "7",
      "text": "A love story from another dimension!I did not think what the title says was literal. I assumed some person with social-shy, wore a white cloth like a mask to confront it. Totally surprised by what I saw. Frankly, I did not like at the first. It was a boring start. I could not overcome that pie eating scene. It was damn too long for nothing. That kinds are the source of boredom. But the actress did good on that. Then what followed were amazing. I truly was not expected that. So at the end, I thought it was an average, then thought a decent and finally realised its something unique and awesome. The lesson is, the more time you give between watching the film and your opinion, the result would only get better.Well the story was so simple. A couple with their average life get affected when one of them dies in a car accident. Soon the ghost resides the house looking for a reason to stay. It is kind of a love story from another dimension. As the time passes on, things change and complicates the quest. But there's always a way to fix it, even for a ghost, so how its been done and what it is was the remaining story.The cast was good, but most of the film it was about the ghost, which could have been anybody inside the sheet. So can't appreciate particularly anyone. As I have heard, Casey did all those parts as he should be. Even though that was not a praisable performance than a simple presence. It's his second collaboration with the director along with Rooney Mara. The one question that everybody who saw it needed to be answered is what was the note says. I googled and got the Q&A with the director that says, nobody knows, not even Mara remembers what she wrote.This is one of the best films. With or without reason the story happened. But that's not the matter, instead, how cleverly, such a concept was developed and made into a film makes the interesting fact. They even did not require a higher end graphics, except in small quantity. It will gain a cult status and as the years go by, it will be considered one of best 1,000 films. So recommend it, but be patient, at least in the initial stage and take a day to give an opinion on it. Maybe reading articles about the plot if you have a doubt is good. Really a creative film!7/10"
    },
    {
      "rating": "5",
      "text": "Can't deny that I wistfully waited for the end of the movie. Interesting concept, but it couldn't keep my attention - at all. Just seemed to last forever."
    },
    {
      "rating": "4",
      "text": "It wasn't that bad but this type of movies which I won't recommend itto anyone . The reasons are obvious the script is like two pages long,a low budget and the plot wasn't something new also I felt bored halfway through the movie and I wasn't surprised about all that high ratingas I have experienced a tons of movies with high rating turned to be acrab and vise versa while some low rating movies was actually good , Ithink the writer and director did a very smart move by marketing forthis film and I personally consider it a fine investment by creating avery low budget that will gain so much money so its basically abusiness plus adding this tragic accident would rise up the audienceemotion so its also a smart move overall I am certain that this won'tend here and the movie will get some awards mark my word for it !!"
    },
    {
      "rating": "3",
      "text": "Its beyond boring. If you want to convey a message or meaning, you have to present it in an at least digestable form. Watching paint dry for minutes is **** They wanted me to feel trapped in time and hopeless I guess, but I just got annoyed and bored..."
    },
    {
      "rating": "9",
      "text": "Here the question ¿what is a ghost? is answered in an original way. The first 30 minutes are like that movie with Demi Moore, but without the marshmallow. The following minutes, although they have a slow pace, are not without an interesting development and with an unpredictable and disconcerting ending: ¿what does says that tiny note?"
    }
  ]
}