{
  "id": 871,
  "title": "A Good Day to Die Hard",
  "starring": [
    "Bruce Willis",
    "Jai Courtney"
  ],
  "runtime": 98,
  "genre": [
    "Action",
    "Thriller"
  ],
  "description": "Iconoclastic, take-no-prisoners cop John McClane, finds himself for the first time on foreign soil after traveling to Moscow to help his wayward son Jack - unaware that Jack is really a highly-trained CIA operative out to stop a nuclear weapons heist. With the Russian underworld in pursuit, and battling a countdown to war, the two McClanes discover that their opposing methods make them unstoppable heroes.",
  "releaseYear": "2013",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/qJ0csDXAVFMsNn0cRcjy6W6PxAK.jpg",
  "categories": {
    "plot": 2.6666666666666665,
    "acting": 2.611111111111111,
    "ending": 3.2,
    "soundtrack": 5.0,
    "cinematography": 4.0,
    "familyFriendly": 3.0,
    "funny": 2.25,
    "action": 3.1956521739130435
  },
  "reviews": [
    {
      "rating": "5",
      "text": "It really pains me to say this, but A Good Day to Die Hard is a muddled, occasionally frustrating affair. As good as Bruce Willis continues to be as John McClane, and as fun as the action sequences are, it clashes with ugly cinematography, an unremarkable premise, and a VERY vanilla performance by Jai Courtney, with Willis often having to be pushed to the back. As it stands it's an okay action film, but it's the weak link in the Die Hard chain."
    },
    {
      "rating": "3",
      "text": "I love the die hard movies. They are usually on the cutting edge of new action movies combined with a classic romanticist age character, but this one fell flat. It did not have a good story that didn't really make sense and people just would die for no reason. It was just... crap."
    },
    {
      "rating": "4",
      "text": "This movie was borderline disappointing. Of course, there was explosions and car chasing like any typical Bruce Willis movie but I felt that this movie did not live up to it's expectations."
    },
    {
      "rating": "0",
      "text": "Honestly, this is the worst film I've seen in years.  It tried way, too, hard.  To be an action film.  It was an action film, but it didn't feel authentic at all.  Just a bunch of fighting.  Made me want to go out and be violent.  I don't want that crap in my brain and I don't want to live in that kind of world.  We need anti-violence in cinema.  This was disgusting and pointless."
    },
    {
      "rating": "2",
      "text": "This shouldn't really be included as a Die Hard film, it should really be re-titled as \"Bruce Willis goes to Russia and blows stuff up\", not John McClane, but Bruce Willis, because this is no longer the John McClane that we knew from yester-year, he is simply a shadow of his former heroic self, and has been replaced by an indestructible action man, he isn't GI Joe just yet, but he certainly plays that part in this.\rSo we kick off with the main man heading to Moscow, as his son, Jack (Jai Courtney) is now a\"007\" type CIA agent who is going to prison after attempting to assassinate corrupt official Chagarin.\rWhy we are suppose to believe that John was only going over to watch his son go down is questionable, but lets roll with it.\rSo of course, explosions soon start when an orchestrated attack on the courthouse leads to John teaming with his son and political prisoner Komarov to escape the corrupt man's henchmen.\rThere are plenty of action packed set-pieces to keep the viewer happy, but not nearly enough of a believable story to back them up, they escape from a massive skyscraper building in one of the worst edited sequences, and end up in a dumpster, they then simply get up, brush off and move on.\rIt simply doesn't stop.\rBruce Willis delivers in his role as usual, but not in the manner of which we seen in the first entry of the franchise all those years ago, his cheesy quips are there, as are his unrelenting tendencies to succeed, but to what end? We still don't know what he is doing here, an average cop going to help son?\rJai Courtney just comes across as a whining child for the better part of the film, constantly blaming his dad for not being there and so on, and emotional depth is carelessly pumped in by a few speeches about children, but it just doesn't work for the pace of this movie, with character development being virtually non-existant and enough plot holes to make you laugh.\rA plot twist in the film was just too little too late, by this point its just unclear who exactly the villain is supposed to be, nobody stands out or is remotely relevant to the plot and I was honestly bored and wanted it to be over at this point.\rGone are the days of the good cop being in the wrong place at the wrong time, and we now have an immortal Jason Bourne wannabe seemingly looking for trouble just to cause a few explosions and say some witty quips.\rBut I still hope they make another, hopefully just to redeem the bumbling mess of this one, to perhaps strip back the superhero part and replace it with the heroic part again. Utterly disappointing."
    },
    {
      "rating": "0",
      "text": "Random and wholly unbelievable action sequences strung together by one-liners and a completely out of place father and son story makes for a babbling and incoherent mess. We should take sharp objects and decision making power away from people who like this movie. I'm not sure how this movie was top of the box office, our theater was nearly empty and in talking to the theater manager the ticket sales were real low. There is a reason this movie was released in February and not the summer. Mainly that it stunk."
    },
    {
      "rating": "2",
      "text": "A Good Day to Die Hard is a  colossal disappointment. Fans of the franchise would surely agree that the fifth entry in this action-packed series pissed all over its four outstanding predecessors out of it's sheer awfulness."
    },
    {
      "rating": "2",
      "text": "Wow this movie stunk compared to the other ones. The acting was awful!!!!!!!!!!!!!!!!! Especially Jai Courtney's acting. Not to mention how corny it is. The stupid storyline was one of the biggest problems though."
    },
    {
      "rating": "1",
      "text": "What an absolute piece of GARBAGE! This is one of the worst movies of the year. It is horribly lazy and bad. The dialogue was horrible, the actors didn't look like they cared, and the director was incapable of using a tripod throughout the entire movie. It was a studio cash-in to make money off of the \"Die Hard\" name. It isn't \"Die Hard\" anymore. It is just a generic dumb action movie with unlikable characters, bad pacing, confusing action sequences and horribly unfunny jokes. \"I'M ON VACATION!\" If you are a fan of \"Die Hard\", don't watch it. If you aren't don't watch it. I could not recommend this film to any human being on the planet."
    },
    {
      "rating": "5",
      "text": "\"While its barley worthy enough to call itself a \"Die Hard\" its still not as horrible as it could of been. It suffers from a middling plot, uninspired chemistry & a not-so intriguing premise overall. But nevertheless it was nice seeing John McClane again.\"  C"
    },
    {
      "rating": "2",
      "text": "A disappointment in every level imaginable. It reminded me of the other  film Willis made with another on screen son 'Cold Light of Day' only worse. A good day to call it a day."
    },
    {
      "rating": "2",
      "text": "I defy anyone to properly explain this plot in any way that makes even a quarter of the things that happen in this film likely. It truly is just 5 or 6 long action scenes, with some weak dialogue and father-son bonding interspersed for bad measure. I expected very little, and was STILL disappointed, although for comedic purposes, it's brilliant."
    },
    {
      "rating": "0",
      "text": "For those of you that hoped for another rollicking good adventure with longtime friend John McClane it might be a good day to cry hard (trust me, that pun is funnier than anything this movie has to offer and that's the problem). The film follows John McClane as he heads to Russia to repair his relationship with his son only to start blowing stuff up moments after arriving and for no good reason whatsoever. The reason behind this short synopsis is because I didn't want to ruin one of worst plot twists of movie history, its so bad its funny. If you hadn't guessed yet, Die Hard 5 is one of the worst films ever made and that's not even hyperbolic, it just is. The worst part is that everything that made McClane a likable every man hero is gone, his lack of care for human life in this film is staggering from his crushing of a car with a woman still inside it to his flipping of an enemy vehicle into a crowded intersection, both of which take place in the same 10 minute chase sequence that just won't end. Die Hard 4 wasn't McClane's finest hour, although it might be Len Wiseman's best film. In fact McClane hasn't been as good as he was in the original in any of the sequels but he was enough of the man we remember for the films to be fun and enjoyable to watch with a hero you genuinely cared for. In comparison 5 has action so badly edited and literally grey (It's Russia so why not make everything look physically repulsive was probably the logic behind this idiotic decision) that its utterly lifeless and uninteresting. I guess you could put the blame solely on director John Moore, the man responsible for other gems such as Max Payne, a film that offended not just a whole generation of gamers but droves of movie goers too. However the film feels lazy, not just in its direction but in its conception as well suggesting a studio with very little interest in making a good movie. Willis tries to bring McClane to a film devoid of his classic humour and ultimately makes the film worse than Hudson Hawk, an incredibly hard feat. Now I know most people will be asking for Bruce to call it a day but I honestly do hope they make another Die Hard because there is absolutely no way it could be worse than this because die hard 5 makes Die Hard 4 look like fine art and that film was directed by the man who made 2 Underworld films, two abominable films I would watch back to back to avoid watching this again."
    },
    {
      "rating": "1",
      "text": "A disastrous movie all round. The action isn't Statham-like unrealistic but it's pretty dumb, the story doesn't seem to exist and it's far too short to have any meaning. The occasional bonding between father and son can be credited but for the most part, it's cheesey action and one-liners all the way, with a context and (attempted) storyline that's older than life itself."
    },
    {
      "rating": "1",
      "text": "Far and away the worst die hard movie.  The plot is nonsensical, the twists are contrived, and the script seems like it was written by a 12-year-old.  This movie is unwatchably bad, even if you're only in it for the action scenes."
    },
    {
      "rating": "0",
      "text": "Waste of money. Poor and cheesy acting, awkward comedy and this worst plot I've witnessed from a film in my life. Do not watch this movie. See Django. It's much better. My cinema didn't have Django available for some reason. It's not a good cinema. That's probably why. We decided to watch this movie because we traveled far to get to the cinema and didn't want to leave without seeing a movie. Poor decision. Thought the movie would be decent after watching the trailer. Not the case. Stupid plot twists that didn't even make sense. See Django. That's a good movie."
    },
    {
      "rating": "3",
      "text": "Save your time, don’t watch this film. I read a review somewhere that this film is a bad version of Die Hard 4 fan fiction, that means it is even worse than the previous instalment. I have no idea why Bruce Willis keeps doing these action roles when especially now, his body doesn’t allow him to do that. Of course, he can do whatever he want but he should, at least, reconsider before committing to roles like these. The film lacks good sense of direction and sufficient characterizaion, the action sequences aren’t so good either. It doesn’t offer that witty writing  plot and great characters which Die Hard 1 did. All these factors make this film a waste of time, to some extent. Final Verdict: Never watch it. NEVER!! If you wanna waste your time, then go ahead, nobody’s stopping you."
    },
    {
      "rating": "3",
      "text": "Unfortunately worse than it's prequel, this iteration of the Die Hard series just serves to show how far the series has fallen. Courtney was a surprise, in not being as bad as expected, but the rest of the movie was nonsensical to the extreme and badly acted. The story was passable at best (save perhaps for a twist round the middle of the movie, which is disappointingly resolved) and the action pieces were over-the-top when they should have been subtle and slow when they should have been over-the-top. All-in-all, I felt like I would have felt better about the franchise not having seen this last entry."
    },
    {
      "rating": "5",
      "text": "I was expecting this movie just like any other die hard series, but unfortunately it's a complete let down and it's incredibly nothing like the others. Fresh idea for die hard series that will make this rubbish a memorable one for me.\r I won't lie that the explosions and the FXs were good, but the storyline was lame and somehow boring!\r I wasted my money to watch this on the big screen without checking the viewer ratings, it's my fault. On the other hand, i took the risk to watch \"The Host\" even though i knew the ratings was bad, but i found it much more enjoyable than die hard 5."
    },
    {
      "rating": "3",
      "text": "Making a good action movie is challenging because it requires continuity between the storyline with the action scenes--appearing balanced, maximizing the level of excitement while providing some credibility to the plot. Despite using the formula that has worked so well time and time again, the end result is truly disappointing--easily the worst installment: loud, mindless, and an utterly uninspiring. The fifth chapter in this on-going franchise is dead on arrival.\r Bruce Willis returns to his iconic role, (and mind you, he will again), and this time around, McClane is in the wrong place at the wrong time--again--after traveling to Moscow to help his estranged son Jack. Bruce has no idea that Jack is really a highly trained CIA operative, whose mission is to stop a nuclear weapons heist. With the Russian underworld in pursuit, and battling a countdown to war, the two McLane's discover that their opposing methods make them the ultimate two-person army.\r Willis is not the reason this fails so miserably. A weak script written by Skip Woods containing numerous problems, and poor directing and direction by John Moore (\"Max Payne\" (2008), \"The Omen\" (2006)). Woods' limited filmography contains nothing surpassing mediocrity, and this display is further proof of just that. To compound the on-going script issues, the very premise in itself doesn't hold a shred of credibility. There are continuous sequences of explosions, carnage, and utter destruction surrounding the Russian capital, and yet there is never any sign of any law enforcement or government involvement what so ever. It's an action film for sheer entertainment purposes--I get it--and people like explosions, but come on.\r The chemistry between the characters and story line lacks development due to the limited time to actually speak, and when they do you wish they weren’t. What really takes the cake is when John's nemesis Alik (Rasha Bukvic), talks about how he used to be a pretty good tap dancer whom no one appreciated. Ironically, what passes as John McClane's wise cracks is anything but humorous. Most of McLane's lines are in the context of his father-son relationship with Jack (Jai Courtney), but are hardly witty or engaging. They are also frustratingly repetitive, consisting of John lamenting how Jack rarely shows him any respect as a father, or John lamenting how he had expected no more than a vacation in Moscow.\r Despite the frenetic pacing in a compact 97 minutes-the abundance of action is staged so unimaginatively that it fails to even interest, let alone excite you. A missed opportunity to possibly lead the franchise into a new direction: John passing the baton to his son, a CIA operative is never considered. Ultimately, just another big budget action movie dumped into middle of February that will score big in the box office, and as a result \"A Good Day To Die Hard\" will have another tomorrow."
    },
    {
      "rating": "3",
      "text": "I was at first angry and outraged and rightly so with the decision to hack the said material to shreds and produce a 12a certificate but even without comparison and heavy scrutiny, a good day to die hard just doesn't even work as a stand alone action film. These executive commercial decisions for financial gain are becoming all too frequent.\rDespite one or two in-jokes, Bruce Willis's everyman tough guy may aswell have been called John Major or any other name, such has the iconic role of John MClane and what he stands for has seemingly slipped away. What remains is a questionably stylish old man with a gun and a few half-hearted one liners.\rSo why two and a half stars you may ask?(the chase sequence gets a star all on its own). In the confines of an action movie there has and will be worse. You just have to look at the bargain bins in your local supermarkets to see all the Seagal and Lundgren films to know that. The action, though sillier and less plausible as it goes on, is well handled and a 15 minute vehicular car chase is brilliantly spectacular and a raid by the woeful bad guys on a safehouse provides an injection of tension and jeapordy but is extremely shortlived. It is what surrounds these brief moments of entertainment that lacks engagement with the audience. The father son bonding is crass, predictable and cringe-worthy and the main bad dude makes Die Hard 4's cyber terrorist look like Hitler. Despite the ood moment of fun this just lacks the principles that made the others, especially the first three, more than just action movies. Better than being caught with your pants down right?...no, not really!"
    },
    {
      "rating": "1",
      "text": "Director John Moore does what no man can do kill John McClane.  The script is horrible, you don't care about one of these characters including McClane, and the CGI action scenes are just a waste of time."
    },
    {
      "rating": "3",
      "text": "The director of Max Panye continues to destroy beloved franchises, but this time he destroyed the \"Die Hard\" series and crushed fan's hopes to like \"A Good Day to Die Hard\". I heard nothing positive for this film, what is there to like about the film? Yes Bruce Willis is back as John McClane, but it sucks that I didn't like him enough that sucks especially in a die hard film you dig John, he's not John McClane, the film lost his like ability. Screenwriter Skip Woods's script  puts  no charisma into John McClane, there is some but not enough like the last four films did . Director John Moore gives us unrealistic special effects, we can tell he loves explosion porn, the editing sucks! It's edited by the editor of \"Max Panye\" Dan Zimmerman's editing is lazy it's feels like a video game. The problem with this movie is it's like a video game, for example: John and Jack fell from a building like super heroes and feel and don't have a scratch or a broken ankle. It's a rip off! The only reason why it's going to make a ton of money at the box office is it's a die hard movie. The poster of the film should of said \"from the director of 'Max Panye'\" if fans saw that poster they won't go see it. The acting is hammy, the dialogue is stupid. Willis did a good job as John McClane, Jai Courtney was awesome go watch them in something else. All the \"Die Hard\" movies have a memorable villain, but in this movie the villain is a mystery and villain number one is tap dancing and eating a carrot that's telling you something! The villains in the film are so poorly written; yes it's rated R, but that does not mean it's good. Willis and Courtney have good chemistry, it's just they tried and somehow they failed because of the script and it's direction. Grade D-"
    },
    {
      "rating": "3",
      "text": "A Good Day to Die Hard boasts huge (though overlong) action sequences but that does not cover up for it's stupid script and forced father son relationship."
    },
    {
      "rating": "2",
      "text": "\"A Good Day to Die Hard\" 10 Scale Rating: 2.5 (Terrible) ...\r The Good: Jai Courtney doesn't do a bad job as John McClane's son, Jack.\r The Bad: Does not feel even remotely like a Die Hard film at all. It is an over-the-top and explosive laden mess. All the charm and wit of the first few films is gone as Willis repeats \"I'm on vacation!\" a good twenty times as he shoots bad guys and escapes impossible scenarios. McClane is supposed to be difficult to kill and resourceful ... this is what makes past movies so good. However, in this film we see him escape two brutal car crashes in a ten minute span without even limping, falling off of a helicopter, smashing through several stories of flooring, and running from a hail of high powered bullets ... all without needing to go to the ER. It becomes too much and belief can only be suspended so much. The story itself is boring and the film lacks any decent villains ... another staple of past Die Hard films. Please let this series die."
    },
    {
      "rating": "3",
      "text": "I loved Live Free or Die Hard and when I heard about this one I was stoked, but when I saw it, I was very disappointed. It was very unoriginal and it lacked truly amazing action. Also, without spoiling anything, there was WAY TOO MANY betrayals and plot holes for the story to be remotely enjoyable."
    },
    {
      "rating": "1",
      "text": "It is pretty much what I expected: nonsensical action with a terrible plot. At least the original two actually made sense, this is nothing more than a cash in. Shame on you Bruce Willis."
    },
    {
      "rating": "0",
      "text": "Yet the question still remains: Why dig up something that has been long dead for a fourth and fifth title? The answer, money. History has proven that in general three is the limit. Willis is tired of this and he screams it in his acting shown here."
    },
    {
      "rating": "2",
      "text": "Very Disappointing. I wasn't a huge fan of Die Hard 4, but I would rank it higher than this one. Sad to see a good franchise be ruined by stupid studio money grabbing decisions, this could have been so much more."
    },
    {
      "rating": "6",
      "text": "Die Hard was once a great series that featured a loveable charachter facing down the improbable, with great action, in a compelling story. But, the improbable has become the impossible in it's fifth installment, with over the top special effects, a weak storyline, and some very dry acting. I am an action junkie and Bruce Willis is one of my favorite actors, but the essence of John McClane died a long time ago. Right from the start I could tell that Willis wasn't all that into this and it shows, as McClan goes from being the ultimate tough guy to a man just going through the motions. The story centers around reuniting with his son in a foreign country, which I though was an interesting twist, but the angle as well as any semblance of a story was barely touched upon. Die Hard 5 was just one over the top action scene after another, with very little substance, emotion, or appeal for audiences. The John McClan we knew and loved, the man who saved the Nakatomi building, is long gone, instead he is replaced by an emotionless man who expects this sort of thing to happen to him wherever he goes. Willis was going through the motions for a big pay day, and while there were some good lines and some great action sequences, there isn't much of a story or cast to write about. Die Hard 5 is about making money through special effects, using characters who have long out lived their usefulness. If this is how the series has evolved than I pray that this will be the end of it. If the producers want to milk more money out of the franchise, maybe they can wait ten years or so and have some British hunk remake it, with Willis making a cameo, until then, I must declare the Die Hard series official dead with A Good Day To Die Hard."
    },
    {
      "rating": "2",
      "text": "Painfully boring and dull, annoying characters, cheese EVERYWHERE. Absolutely terrible plot, and absolute crap villain.  Even the actors look like they don't want to be there, especially Willis.... he just drags on and on with terrible dialogue and awful... awful awful awful one-liners, WHAT THE HELL KIND OF LINE IS \"I'm on f***ing vacation?. Generally boring, and not worth any money, I won't even watch it if it were on T.V"
    },
    {
      "rating": "0",
      "text": "After waiting since last summer to see this movie and then finally seeing it... So very very disappointed. the concept of John McClane fighting bad guys with his son Jack is a great idea Only there was no story to it only explosions and a 20 minute long car chase scene. I believe Die Hard just died hard."
    },
    {
      "rating": "5",
      "text": "A good day to puke hard........ WORST DIE HARD SEQUEL EVER!!!!! IAM sorry to say this mr Moore but your movie sucks like HELLLLL! It starts off and then in 20 min of the film there is no John MacLaine but I gave it time... 40 min...... No John MacLaine and then 50 min in the movie he comes as a cop nobody knows? I mean he's kickass he's not old yet!!!!!!!!? I really hardly think that mr mctirnan was better at this film. So better. I mean like this cop is nothing it's just Bruce Willis!!!! But 5 is for the action that was balanced throughout the film, I mean Jai countery was good with Sebastian Koch, just those two people kicked ass. I punk ed throughout the father and son so called scenes. Only 5 because of Jai and Sebastian and some of the action. Otherwise 1 or 0"
    },
    {
      "rating": "4",
      "text": "It seems like the concept of the father and son relationship could have worked. However, when you have garbage filmmakers (director, screenwriter, composer, editor, etc.) involved, it's bound to be a mess... I'm a Die Hard fan, and it's a shame they let this happen. Still not on the level of crap as Indy 4 or the Star Wars prequels... but definitely a bad movie. Word of advise  if you plan to make another Die Hard film... get a good actor for the villain (i.e. Alan Rickman, Jeremy Irons, Timothy Olyphant) that actually has a clearly defined motive."
    },
    {
      "rating": "2",
      "text": "This film was not necessary. Jai Courtney's character was a let down. I would have liked it more if Courtney's character died in this movie rather than Spartacus. No Plot, No Good Villain, Very muddled action. For those that want to see a good die hard movie go on Netflix and watch the original."
    },
    {
      "rating": "6",
      "text": "It has the one-liners,guns and action, but it does not feel like die hard to me. Russia as background was pretty boring and father-son comedy was just awkward. No need to watch the film unless you are a true fan of the franchise."
    },
    {
      "rating": "0",
      "text": "Unmitigated garbage. This movie begins with a 20-minute chase scene that lacks a reason, then it goes steeply downhill.  I liked the first few Die Hards, which had memorable villains and a McClane whose character hadn't yet become a cliche, but if this one puts the franchise out of its misery it'll be better for us all."
    },
    {
      "rating": "5",
      "text": "I mean: It's still a Die Hard wih mindblowing action and still Bruce Willis, contributing a reasonable performance, but the quality of the film can't satisfy the high expectations of all the fans of the franchise. It is half an hour shorter, much more explosive and senseless than all the other Die Hards. There are no motifs, no emotions or any kind of coolness in there. And the worst thing: it isn't a Bruce-Willis-Show as a Die Hard has to be but a soft Lethal Weapon like collaboration between John and his son Jack, which just makes it feel wrong."
    },
    {
      "rating": "3",
      "text": "If there's one thing I can stand, it's when there are great shots or great lines in the trailer, and when you see the movie, those lines aren't in it or the shots didn't make it.  Let me cut to the chase.  In the trailer, a leathered-up hottie rides her motorcycle into a garage, she unzips her bodysuit, and she she's left with a black bikini-looking thing.  IT\"S NOT in the MOVIE.  That really sucks.  And the line where Willis says, \"My boy and I are gonna lay a whoopin' on you\" isn't in the movie either.  Too bad.  It's by far the worst Die Hard."
    },
    {
      "rating": "0",
      "text": "A Bad Day to Die Hard is what I like to call and as a big fan of Die Hard for so many years, this 5th installment is one of the worst movie of the series. I really don't want a father/son moment, I just want to see more McClane (by himself) saving people and kick the living hell out of those alienated hostages. Once they'll be a 6th movie, that's it. John MCClane is soon going to be retired from his job not only as a detective, but a fantastic run. But for that, Happy Un-Valentine's Day, Motherf**ker!"
    },
    {
      "rating": "4",
      "text": "Let's start off by saying that I am not a huge Die Hard fan but I have always enjoyed the movies and there is something about the character of John Mcclane that is just fun to watch. That was my sole expectation. The only thing I was looking forward to, was action sequences mixed with a great sense of humor. I am an avid movie goer and even found a few things to like about Die Hard 4 but this installment is simply a very very bad movie.\r The first third of the movie is a catastrophe, story-telling wise. The editing is confusing and what was meant to bring out a smile from the audience (dialogue in cab) falls flat big time and left everyone cold.\rThe action scene involving a car chase and lots of (LOOOOTS OF) crashes fail to impress because the cinematography leaves much to be desired.\r The biggest issue with this movie is, that you never ever care about the action on screen. No one is ever in real peril and everyone is having a fun time,jumping down from buildings and killing lots of dudes. There is nothing inherently wrong with a movie like that but this is Die Hard and Die Hard movies used to be about something, some danger that threatens a building, airport, city etc. There was a threat and Mcclane needed to solve it. That was why we were rooting for him. Before heading to the theater, I read all the negative reviews I thought \"doesn't matter, it has action scenes and that is enough for me\". Now I know for sure, it definetely isn't enough. It simply isn't worth seeing it on the big screen. Save the money and watch it in a year or two on Netflix, I promise you will not regret it."
    },
    {
      "rating": "0",
      "text": "Is there a way of describing something this awful? It is of course worse because it pretends to be Die Hard, but its the movie equivalent of Mocolate. Awful, terrible, horrible, boring, wooden, unoriginal. All I can come up with is BAWFURRIBLE. This is Bawfurrible. Never ever watch it,"
    },
    {
      "rating": "2",
      "text": "A Bad Film to Watch is Hard.\rAvoid this one at all costs! Honestly, watch the original, and forget the rest. The reason that this franchise has gone on for this long(other than money) is beyond me."
    },
    {
      "rating": "2",
      "text": "DHINO 2 is an agonizing, painful film to watch.\r I was hoping with the R-rating and all that it would go back to the good old days, but what we get is a terrible action movie script that happens to have John McClane in it. The chemistry between the father and son was okay, but everything else, including the supporting cast, was a dread to listen to, while there were terrible shots and weak effects as well."
    },
    {
      "rating": "7",
      "text": "Far from being the best die hard, yet not a bad action movie. Really liked the movie, worth the 8$ spent on ticket.  If you have nothing to do one night, go out with some of your buddies and see this movie, action packed and fun."
    },
    {
      "rating": "6",
      "text": "You wont waste your money on this one but compared to other Die Hard flicks, it is disappointing. The story is not compelling enough and the villains are not that interesting. So while the action scenes are good, they are a bit pointless."
    },
    {
      "rating": "5",
      "text": "As Die Hard fan, I'm truly disappointed with this installment. I don't care with critics said give this underrated.\rI'm still like Mac Clane with his joke, how his way shooting people and so on. But this movie is too short and the other way the closing scene is too long. Maybe Len Wiseman is not good director, but I'm satisfied with him how he directed DH 4. But John Moore is worst director and fail direct this.\rTo many replay scenes: Mercy from highway (DH3), bad guy fall from building (DH 1),  make this movie not worth to watch.\rAs DH fan I'm very sad with this not good movie and don't know how to score it, because I'm still like Mac Clane.\rNot good Yippee Kai Yay Mother****** anymore."
    },
    {
      "rating": "9",
      "text": "I thought this movie was great and have no idea why it has such a bad rating. I thought it was really funny, it had a lot of action and a decent story which is all a Die Hard movie needs."
    },
    {
      "rating": "0",
      "text": "If you dont want to catch cancer, dont watch this movie. It is like watching 2 girls 1 cup 90 minutes and paying for it. But if you  you want to hear non stop John Macklane moaning that he is on vacation see \"radiation neutralizator\" in action ,roadtrip from Moscow to Pripyat in one evening, unnecessary 30 minutes car chase, evil protagonist and neutral antagonist go ahead and watch it."
    },
    {
      "rating": "10",
      "text": "I don't know why people hate this movie it's enjoyable. It's action packed, what else do you want from a Die Hard movie. I only recommend for Die Hard fans."
    }
  ]
}