{
  "id": 636,
  "title": "A Haunted House 2",
  "starring": [
    "Marlon Wayans",
    "Jaime Pressly"
  ],
  "runtime": 87,
  "genre": [
    "Comedy",
    "Horror"
  ],
  "description": "After exorcising the demons of his ex-, Malcolm starts afresh with his new girlfriend and her two children. After moving into their dream home, Malcolm is once again plagued by bizarre paranormal events.",
  "releaseYear": "2014",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/oV7M00fPXy5P0nbdeMbSUjYv0vx.jpg",
  "categories": {
    "plot": 3.75,
    "acting": 10.0,
    "ending": 0.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 3.962962962962963,
    "action": 0.0
  },
  "reviews": [
    {
      "rating": "4",
      "text": "Completely irreverent and mostly unfunny, A Haunted House 2 is a slight improvement on its predecessor, but is still a complete waste of time that fails to conjure more than a few guilty chuckles."
    },
    {
      "rating": "0",
      "text": "These films are always awful.. albeit not as awful as the those other two unmentionable 'spoof writers' (both words I use loosely) totally unfunny, nasty-edged (out of jealousy) laugh-free cringe-fests.... but YOU the public watch them... SO they make them. The first, like this sequel will, made thirty times its budget. It's mathematics. Smart people should just be thankful these types of comedies exist... in case they are incredibly stoned and stumble across it on tv in four year's time or if you just want to be reminded you are not a total moron.\rOn the reviewers' comments here, I see people complaining about it spoofing 'The Conjuring which was the greatest horror film of all-time\"...!!!! Really!? Like lovers of this film, there is no accounting for taste... and apparently, not being total garbage passes as oozing with class these days. Spare me... spare us all. Next thing you know they'll be making hard-out bible-bashing movies to blatantly indoctrinate equally moronic people and call them something like, \"God's not dead\"... Oh, they already are? Let us usher in the end then. For it is nigh... LMAO."
    },
    {
      "rating": "1",
      "text": "Now I will admit, much to my shame, that..to an extent, I did enjoy (moderately) last year's sleeper hit parody, \"A Haunted House\" from creator Marlon Waynes. For one, I saw the film initially with my two best friends, and believe me when you are with your friends anything can seem hilarious. Upon a second viewing at home, well.. let's just say, I wasn't as fond the second time around.\rNow just a little over a year later, Who..in a million years would think that this crew would see a sequel. I mean we're standing here begging from a sequel to \"The Incredibles\". Nope we get \"A Haunted House 2\" and after seeing this film, I have learned one thing.. they will let anyone make a movie. The original \"Haunted House\" seemed fresh and actually different, a rare parody that only works and connects on certain occasions. Well these filmmakers have lost all their credibility (whatever that was) by plundering over a trash sequel that is loose, boring, and just plain obnoxious. I understand that a film like this is supposed to be goofy, dorky and dumb. \"A Haunted House 2\" just takes the word \"stupid' to a different dimension. While there are just some things you can't unsee.\r The film picks up essentially where the original film left off. Malcolm Johnson (Waynes) lives his possessed girlfriend in the side of a ditch, and one year later begins to start his new life. Where, upon moving into his new home, the strange incidents that occurred before, start happening again. Following a send up of recent cult hits like \"The Conjuring\" \"The Possession\", and \"Sinister\".\r First off, the running gag of sexually molesting a rag doll can honestly go so far. Yeah sure it worked in the first one with some stuffed animals. Other than a mental image you're never going to forget, and some nightmares, nothing is really there. I swear Marlon Wayans was profusely sweating the entire duration of the film, not to mention he was constantly screaming at the camera. All of the lines looked like they were being read off a teleprompter. I felt like I had been enucleated with a drill and hammer after seeing this film, I needed an aspirin upon exiting the theater. Yikes!. The visual effects themselves were hokey at best. The film was produced for a miniscule budget of only $3 million bucks, and the film was left wide open for a third outing....I can only hope that doesn't happen. Aside from a brief laugh here and there, the writers take washed up jokes that we're hung high and dry in the predecessor, and recycle old material, not only does it never work, the audience is left sitting there wondering what an abysmal waste of time the movie is.\r Did we really insist on a sequel to \"A Haunted House\" heavens no, and when movies like \"A Haunted House 2\" are released that's when we know why. I respect the whole Wayne's clan, there are some funny guys. The first two Scary Movies were respectable in their own way, and like I stated above. I enjoyed the first \"Haunted House\". I just don't think a sequel was necessary. Not only that \"Haunted House 2\" is nowhere on the levels of it's predecessor.. In order for a spoof to be funny, it needs to know the limitations of it's own boundaries. \"A Haunted House 2\" may stick to the guns, but I just don't know why Hollywood is punishing us. Movies or sequels like this, make me question what movies are being released. Folks. do me a favor, save your money, and don't watch the overly obsessive, mediocre and one-two punch to the gut film. \"A Haunted House 2\" is a dramatic waste of your time.\r D-\rBy: Nate Adams\r Directed By: Micheal Tiddes\rStudio: Open Road Films\rRelease Date: April 18th 2014\rRun-Time: 87 mins\r Thanks For Stopping Buy."
    },
    {
      "rating": "0",
      "text": "God it sucked. A Haunted House 2 was a piece of atrocious, dimwit, unfunny filmmaking. The first one sucked and so does the second one. Gosh  I thought that this would be funny, if not, just plain fun. But no, poor writing, screenplay, gags, directing, action, action was all poor. Don't go to watch this one."
    },
    {
      "rating": "0",
      "text": "I'm amazed this got a sequel, the first one sucked so bad that I quit midmovie. I didn't even think for a moment for a sequel yet NOW it comes. The irony is that the movie is a haunted house itself. I hope the 3rd movie comes out for our sake."
    },
    {
      "rating": "4",
      "text": "Ya this is not The Conjuring this A Haunted House 2 ! Starring Marlon Waynes and Annabelle the Doll plus bagool from Sinister and a possessed girlfriend? I laughed throughout this movie and I mildly enjoyed it, but still it is a cinematic abomination."
    },
    {
      "rating": "0",
      "text": "This movie is ridiculous, wasted money ! Don't watch it w your kids - stupid sexual content.\rI gave it 30 mins then shut it off.. Waste of time ..not funny"
    },
    {
      "rating": "3",
      "text": "A haunted house 2 parodied Conjuring which is the best horror movie ever so as sinister . this movie bored me to death just like the lego movie. comedy was not good as the first one . this movie sucked major\ri got a few laughs though. Grade C-"
    },
    {
      "rating": "7",
      "text": "Within the first 18 minutes of the film there were 5 sex scenes. 10/10\rSeriously though, this is a great film in my opinion. The humour isn't for everyone, but I liked it. But onto one major flaw: The creepy man you see in the tape on a tree hanging the family who then jumps out at the window is never seen after that. He is seen again on tape, but never in \"reality\"."
    },
    {
      "rating": "10",
      "text": "Funny movie. I watched it, loved it!!!!!!!! The way of acting was so funny. Its more like a mixture of horror and comedy. Despite the very low rating (1.7), this movie isn't that bad at all. Just watch it."
    },
    {
      "rating": "10",
      "text": "This has to be the worst movie I've ever seen. Not only did it lack humor, it was also the most boring **** to sit through. I myself am a huge fan of movies and this is just terrible 10/10"
    },
    {
      "rating": "4",
      "text": "There are certain aspects of it that are an improvement. The sexual humor is still outrageous, but it thankfully never reaches the disgusting and downright disturbing levels the first movie did. The trade off is that the racist humor has been cranked up to 10. It's not a great trade off, but it's the only improvement this sequel makes.\r The plot makes no sense thanks to the number of parodies shoved in. It's just a string of random references to recent possession and haunting movies. However plot is the last reason anyone would watch this so it doesn't really matter. What does matter are the jokes. Unfortunately the movie just isn't funny.\r There shear stupidity of the movie did lead me to a light chuckle every once in a while, mostly out of disbelief, but I couldn't being myself to laugh at any of it. Dumb racial, sex, and physical humor is repeated throughout, often through the means of the same gag. The problem is that gag wasn't funny the first time.\r It's a parody in the vein of the Scary Movie series. However fans of that series, as well as of the first A Haunted House, are probably better of skipping this sequel. It never really brings any laughs and just feels lazy. It's dumb humor that never manages to be dumb fun."
    },
    {
      "rating": "6",
      "text": "I think the main reason I like the Haunted House series so much is because Marlon Wayans knows it's a parody film so why take it seriously? If you enjoyed the Scary Movie series and other films like it then you will like A Haunted House 1 and 2 just as much. It's just mindless fun. Gotta love people who bash it and yet praise these crappy animated films that featured the same recycled plot over and over again. Anyways, Here are my thoughts on it.\r A Haunted House 2 is by far a better movie than the first one (despite critic reviews). It's a lot funnier and will give you many laughs through out. Also, and this is a bit of a plus for it, there are a lot less cameos in this one. Instead focusing mainly on Wayans and his antics through out and rest assure he is a funny guy. So if you have seen and liked the first one then you will definitely like the second one."
    },
    {
      "rating": "8",
      "text": "its seems all people have lost a sense a humor perhaps? this movie was hilarious. i don't care what anyone said. if you would like a good time of laughs and fun with friends then a haunted house 2 is a good one to watch. The Wayans have always been comedic geniuses and Marlyon is freaking hilarious. if you have always been a fan then you will love this movie just like me."
    },
    {
      "rating": "1",
      "text": "It's official, the spoof genre is dead, gone. Can't come back, can't be funny. What a shame.\r Now why did I give this movie a 1 out of ten? Because I laughed once. And I feel ashamed of having done so."
    },
    {
      "rating": "10",
      "text": "This movie is very entertaining and doesn't take itself too seriously.\r The absurdity may be a bit much for people who take themselves too seriously, hence the low ratings."
    },
    {
      "rating": "5",
      "text": "A Haunted House 2, pese a ser mejor que su predecesora, también comete los mismo errores que tuvo la pasada entrega, volviéndose terriblemente estúpida por perderse en su insignificante comedia negra.\r A Haunted House 2 es una película totalmente adiestrada que se burla de largometrajes como \"El Conjuro\", \"Sinister\", \"Paranormal Acitivty 2\", entre otros. Por desgracias, a pesar que esta película resulta un poco más cómica y mejor elaborada que su débil anterior parte, esta también comete el error de liarse de forma imperceptible con su comedia negra que resulta tan negra, que la película puede tenderse a perder gracia. Esta entrega no resulta mala, porque da más risa que la primera y está mejor hecha, pero no arregló los errores que sustancialmente debía arreglar."
    },
    {
      "rating": "3",
      "text": "A Haunted House 2 looked funny, but when I watched it there was nothing funny I hadn't seen before in the trailers for it. It was actually terrible, and Jaime Pressly is terrible in it."
    },
    {
      "rating": "5",
      "text": "With the first \"A Haunted House\" movie not being a masterpiece, I wasn't really expecting anything particularly good. Appart from a few jokes that might make you smile, there's not much to appreciate here. If you're a fan of Marlon Wayans you might enjoy it. If not, you're better off with something else.you're vetter off"
    },
    {
      "rating": "5",
      "text": "A Haunted House 2 is a 2014 American comedy horror film directed by Michael Tiddes and starring Marlon Wayans. The film is the sequel to the 2013 film A Haunted House. Produced by IM Global Octane and distributed by Open Road Films."
    },
    {
      "rating": "1",
      "text": "This movie was **** atrocious. Whoever watched this movie and enjoyed it is a drooling moron. There was nothing funny, nothing creative, it was just awful. Though it was better than Scary Movie 5."
    },
    {
      "rating": "1",
      "text": "What in the name of the world did we humans to deserve this pile of crap. Ok to start things off basically the beginning is the same as A Haunted House. This movie did make me laugh a couple times but I didn't laugh so hard it was just a chuckle. This was the worst film on 2014 next to Earth to Echo. If A Haunted House 3 or Scary Movie 6 comes out I'm done, that may sound extreme but these should stop. Who wants to watch Marlyon Wayons hump an Annabelle doll for 2 minutes. Don't watch this movie even if you are trashed. A Haunted House 2 is a huge mess splattered with utter horse ****"
    },
    {
      "rating": "1",
      "text": "Marlon wayans' attempts at comedy in HH2 might have been acceptable if it was a YouTube video or something, but calling this a movie and expecting people to go spend money on it is an insult to all movie-goers. It had a couple chuckle worthy moments but I found myself too frustrated to laugh because of all the annoying forced \"humor\" that surrounded it."
    },
    {
      "rating": "10",
      "text": "The movie is the best movie . I Love the funny Gags and the Comedy Horror consept."
    }
  ]
}