{
  "id": 4635,
  "title": "A Hidden Life",
  "starring": [
    "August Diehl",
    "Valerie Pachner"
  ],
  "runtime": 174,
  "genre": [
    "Drama",
    "War",
    "History"
  ],
  "description": "Austrian farmer Franz Jägerstätter faces the threat of execution for refusing to fight for the Nazis during World War II.",
  "releaseYear": "2019",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/rdG4jfH0rxkB2FgkYmjj9V4Q31M.jpg",
  "categories": {
    "plot": 6.52,
    "acting": 7.125,
    "ending": 6.333333333333333,
    "soundtrack": 7.0,
    "cinematography": 6.285714285714286,
    "familyFriendly": 6.0,
    "funny": 5.0,
    "action": 9.75
  },
  "reviews": [
    {
      "rating": "10",
      "text": "A beautifully elegiac film by Terence Malick about Franz Jägerstätter, an Austrian peasant farmer who would not fight for the Nazis in World War II, even when he faced execution for his refusal. The pacing is perfect as the film moves from the beautiful countryside where Jägerstätter lived before the Nazis came to conscript him into their army to the narrow prison where he dies because he refuses to fight for them. Malick has created a horrifying and emotionally unforgettable film."
    },
    {
      "rating": "9",
      "text": "Though erring on the side of too long with a runtime of just under three hours, A Hidden Life is one of the most impeccably-crafted films to recently hit cinemas. With breathtaking cinematography/visuals, raw acting/sentiment, and one of the most film-suiting soundtracks I have ever heard, A Hidden Life will transport its viewers on a three-hour emotional whirlwind. However, the three-hour runtime felt a bit excessive, with the content of the film having a gravity so strong it weighs the viewer down after the first ninety minutes."
    },
    {
      "rating": "10",
      "text": "This is a true story about a young Austrian farmer by the name of Franz Jagerstatter, a conscientious objector who refuses to fight for the Nazis or swear allegiance to Hitler during WWII. From strength through the love for his wife Fani and their three young daughters, he finds within himself the courage to stand firmly to his beliwfs, even in the face of prison or possibly even death. Directed by Terrence Malick, who's known for his meditative and thought provoking films on life, relationships, the human condition, etc., like his previous films before this, this is an absolutely beautiful film in every sense of the word! From the stunning cinematography to the subtle yet powerful performances, it's a film that made me think about so many things while watching it: life, death, love, hope, you name it! And quite a few times throughout I found myself becoming quite misty-eyed simply from sheer overwhelmment from the emotion provoked while watching it. And despite its three-hour runtime, I hardly even felt it! I was transfixed from start to finish! Overall, it's Malick's finest film since 'The Tree of Life' (which is a film I already consider one of the best of the decade, if not, all-time), and truly one of the most powerful and beautiful films I've seen all year!"
    },
    {
      "rating": "8",
      "text": "While writer-director Terrence Malick's stream of consciousness style of filmmaking may not be for everyone, he certainly presents his best example of this kind of work in his latest offering, \"A Hidden Life.\" As with nearly all of his pictures (which are known for including beautiful imagery for its own sake and not necessarily as a means for moving the story), this release could definitely use some editing, considering its nearly three-hour runtime. However, given that this fact-based film features a more narrative-driven focus than some of his other works, that change, coupled with his signature style, make for a moving combination, one that's both touching and beautiful to look at simultaneously. August Diehl and Valerie Pachner give quietly impassioned performances as protagonists wrestling with crises of conscience in World War II Austria, set against the beauty of their native countryside and the ugliness of Adolf Hitler's Nazi regime. Admittedly, this picture may try the patience of even the most diehard moviegoer, but it's worth sitting through even the slow passages given the rewards on offer."
    },
    {
      "rating": "7",
      "text": "LIFF33 2019 #3“If God gives us free will, we are responsible for what we do or what we fail to do.”Ambitious, but strangely simple.A true and powerful story told in a very Malick way. Based on letters written in Austria during Hitler’s early reigns; ‘A Hidden Life’ follows a husband and wife objecting the Nazi party - which unfortunately leads to the husbands imprisonment and his wife being persecuted by villagers, all friends and neighbours for decades - all become enemies.The camera work and cinematography were all excellent, of course with it being a Terrance Malick movie. Free flowing camera movement that often drifts around the actors and looms over these people's lives - often getting up close and personal. There are some powerhouse performances from everyone as Malick effectively lets the actors work freely by improvising on the spot and being present in the moment. So we get to experience Franz and his wife Franziska (along with their children) living in the present and how beautifully poetic it can be. So we can briefly live the life of these people before the horrors of war ruin everything. The little moments we take for granted.Apparently whenever an actor gets dry on camera, Malick would gently push them forward and tell them to keep going - in terms of activity and discovering new things while losing a train of thought and reverie in character. I think this is the reason why the actors always give such raw and natural performances. I would imagine it also helps them develop and personally attach themselves to the character in bolder lengths, because they can never do wrong.Although it didn’t need to be three hours long and could have easily been 2 hours. I had issues with how long the movie stayed in one setting, as it dragged the pacing down a bit. I must admit there was a point where I nearly dozed off, not because it was boring, but prior to watching I had a long day that pretty much drained me and the movie at times didn’t help. However there was a point mid way through where the movie woke me up, which is incredibly rare for an art house movie.I’ll give Malick credit, nobody makes movies like he does. Love it or hate it, but no other director has come close to finding the inner heart and soul in nature that’s with human beings. I think it’s easy to look at his work and label them as “pretentious”. His approach to narration is incredibly jumbled, but more truthful than movie dialogue, because we don’t mean what we say most of the time; a rambling mess. I often find the people who dismiss him and think they know about ‘keeping it real’, are the pretentious ones.The unique thing about this movie and his previous work, when the movie is over you start to notice nature and I really do mean notice nature - something you would have never done before. Such as: grass and leaves dancing in the wind, natural light, the warmth of the sun touching your skin, and the smell of nature. It’s incredibly compelling how a movie can activate my senses that I haven’t experience in a very long time, dating back to childhood.“Nostalgia is a powerful feeling; it can drown out anything.”Overall rating: A welcome return to form."
    },
    {
      "rating": "8",
      "text": "An audiovisual beauty like all Malick's films although this is definitely the first one that has a more interesting story to tell since Tree of Life but unfortunately in my opinion its own ambition and pretense of doing something more epic plays against it because A Hidden Life it's a film that greatly extends its stay.Although Malick doesn't change the formula he has been using both narrative and visually, this story manages to feel different perhaps because unlike films like To The Wonder, Knight of Cups and Song to Song, Malick goes back in time and the visual aura of the film has a more distinctive touch.Again Malick doesn't seems to demand a lot from his actors because once again the romantic situations feel repetitive but as I said being a more relevant story, this time the interactions feel deeper.Here the problem as I said is the duration. The film is just a few minutes away from being three hours long and because of the narrative's shape those three hours feels like too much.I cannot deny that A Hidden Life is a beautiful film, it's a really good film but it's a really long one.I mean, I completely enjoy it, I would see it again without a doubt but I could definitely cut an hour from it to make it more agile, although I understand this was Malick's vision and desire for the audiences to experience his film.I repeat, I liked it a lot, it's Malick's most rewarding work since Tree of Life and it's a film that any serious movie lover will enjoy or at least it will give it the chance to be marvel by it."
    },
    {
      "rating": "9",
      "text": "If you liked Malick's previous films, you should enjoy this one too.  The movie is slow (no surprise) but it beautifully tells the story of an ordinary couple trying to figure out what to do when the Nazis come calling.  I often think of the millions of people faced with similar dilemmas during WWII.  Kudos to Malick for bringing this story to life."
    },
    {
      "rating": "10",
      "text": "The last 30 mintues is one of the most moving things malick has depicted yet."
    },
    {
      "rating": "1",
      "text": "This movie is 3hrs long. You get literally 15 minutes of dialog in 3 long hours. For almost the entire time it has excruciatingly slow sweeping views of mountains, waterfalls, clouds, churches, sheering sheep, wheat fields, chores being performed etc.The cinematography is nice and what acting that exists here is quite good. Thing is there is really no movie to speak of. Imagine if you took the first 20 minutes of Quest For Fire and extended it out to 3 hours. That is what A Hidden Life is."
    },
    {
      "rating": "5",
      "text": "1)I saw this movie with my dad, I liked the beginning, it was beautiful and epic, but with the rest of the minutes this movie lasted, it was worse, in my opinion, the beginning was fine but in the development and the end ... well, the last part wasn't bad."
    },
    {
      "rating": "2",
      "text": "\"A Hidden Life\" asks the question of how far you would go in your beliefs even if it means death when you have a chance to live? It is based on the true story of Austrian Franz Jagerstatter who refuses to swear his allegiance to Hitler though he does go when called up by the 3rd Reich for military training. He is a devoted husband and father of three girls who works side by side with his as much devoted wife on their large farm. His refusal to sign a loyalty oath takes him away from his family, farm and small town.Along with the moral questions there is also the beautiful love story between Franz and his wife Franziska plus their love and interaction with their children.The film takes place in St. Radegund, Austria, and,  after the opening shots of Hitler and Nazi Germany, the camera pans over the stunning location of the town and at any minute you expect Julie Andrews to come out and sing \"The Sound of Music\" which is one the things that sabotages the film all the way through.Director/screenwriter Terrence Malick takes 3 hours to tell a story that could have easily been cut by an hour if he eliminated all the repetition of most scenes. He shows the hard work of working a farm from cutting, gathering hay, digging for the vegetables, planting potatoes not only once but each scene is repeated at least 3 times. Yes a river changes constantly and Malick makes sure we see that along with many shots inside the local church's beautiful paintings.He, also, fails to get into Franz's mind and why he believed so strongly to be the only man in the village who feels the way he does to the depths he does. There are bits and pieces spoken from the bible and he was a devout Catholic but how come he was the only one in the village? His love for his wife and children appears to be as strong as his love for his religion but it is never explained.August Diehl as Franz and Franziska by Valerie Pachner are beautifully matched and their love is shown in many big and little ways and she accepts the pain caused by her husband not only to them, their kids but also his mother and Franziska's sister.Is religion harder to explain than love? Is religion harder to show than love?  The fact that we don't know what motivates the man to make his decisions and follow through with them, hurting many including those he loves being ostracized by all around them is the main and a big failure of the director/screenwriter!\"The Hidden Life\" is a good example of more is not necessarily better!"
    },
    {
      "rating": "9",
      "text": "Often the word is used, but rarely is it every earned - this time it is. A Hidden Life is well and truly a masterpiece of cinematic film-making. One of the most stunningly beautiful and tragic films ever made. The story is of course difficult and painful and sad, but the way it is told...it transcends into spiritual poetry, into meditation, into prayer. The prayers of a saint who sacrificed everything to stand for what's right. While the pacing may be frustrating for some in the audience, you have to open yourself to its meditative, prayerful song and allow yourself to be absorbed. Malick is truly one of the finest filmmakers any generation has had, and A Hidden Life may very well be his crowning achievement."
    },
    {
      "rating": "10",
      "text": "Powerful and genuine. A dream-like ethereal journey that raises serious questions about how to live ethically, and the bravery and clarity of those who do. The film is typical Malick with voice-overs, humans occupying the landscape, and dreamy liminal long sequences. All of the scenes and acting feel completely authentic. The combination of Austrian and English with subtitles works extremely well. The subtle sound design is also effective. I think that some scenes and situations are bit longer than required to tell the story and not feel rushed. I also did not care for some aspects of the cinematography; many scenes are too wide-angle in a way that slightly diminishes the presence of the actors; the hand-held shakiness imparts a Go-Pro feel that at times seems too modern and too nervous for such a slow-moving and reflective film; and the all-natural lighting is problematic where great light latitude is required, resulting in many dark interior scenes with the outdoors completely white and too-hot. Nevertheless, this is an accomplished and successful film, the best from Malick since The Thin Red Line."
    },
    {
      "rating": "7",
      "text": "This film is based on the true story of an Austrian farmer who refused to take the oath of loyalty to Hitler and the effect it has on him and his family in their small mountain village. It could have been a powerful drama, but in the hands of auteur Terrence Malick it becomes an artist musing about personal ethics and the human spirit. Because it's Malick, you get lovely visuals (and a spectacular mountain locale), dialogue that's more recited than spoken and a languid pace (3 hours). It's also a bit confusing because most of the characters speak English (with an accent), but others speak in German (with no translation). There's a moving story beneath the beauty and it has a more cohesive narrative than some of his recent work, but it's still more art than drama."
    },
    {
      "rating": "5",
      "text": "Christopher Plummer once famously recounted of his time with Terrence Malick on the set of \"The New World,\" \"the problem with Terry, which I soon found out, is that he needs a writer. Desperately.\" It certainly has been a minute since we've seen Malick go the semi-traditional narrative route. Narratively experimental films like \"The Tree Of Life,\" \"Knight Of Cups\" & \"Song To Song\" have confounded and frustrated both critics and normies alike. With \"A Hidden Life,\" though, Malick seemingly gets back to the basics. One protagonist, one conflict, one point. Is it beautiful to look at? You bet. Is it well performed? Incredibly so. Are there things to cut? The cup runneth over. Oh, sweet God, does the cup runneth over. I'm not one to undermine the thematic potential in flux here. This is a tremendously powerful and admirable story of conviction and doing what feels right, despite what the world tells you. There are fascinating musings on God, duty and the folly of man all throughout. Typical Malick stuff. It's just that there's also so much filler here that could've been left on the cutting room floor. Establishing shots. Scenes of characters farming and performing menial tasks. Even entire arcs featuring ancillary characters could have been left to the wayside. And I get it. This is the Malick way, baby. It's how he's been doing things forever. But when we start talking about hours (literal HOURS) to trim off your runtime? C'mon, man. This is a frustrating watch to be sure, for there's so much that really does work. Yet all I can do is hear those words from Christopher Plummer echoing in my head into infinity."
    },
    {
      "rating": "9",
      "text": "A meditation on morality and faith; a film of unparalleled sublimity; an experience beyond the sensoryA Hidden Life, which may be writer/director Terrence Malick's most ostensibly Christian film yet, is quintessentially Malickian, featuring many of his most identifiable stylistic traits. His films are about the search for transcendence in a compromised and often evil world, and, telling the true story of the Austrian conscientious objector Franz Jägerstätter, A Hidden Life is no different. How good is it? Very, very, very good. Not quite The Thin Red Line/The Tree of Life good, but certainly Badlands/Days of Heaven/The New World good. This is cinema at its most sublimely pious. You don't watch A Hidden Life. You let it enter your soul.Austria, 1938. In the bucolic village of Sankt Radegund, farmer Franz Jägerstätter (August Diehl) lives with his wife Fani (Valerie Pachner) and their family. A devout Christian, he's unenthusiastic about the looming war, despite its widespread popularity in the village. As time goes by, and the war shows no signs of ending, his opposition grows ever more ingrained, to the point where his family are being harassed. Eventually, he's conscripted, but refuses to swear an oath of allegiance to Hitler, and so is arrested and imprisoned.Needless to say, Malick fashions this material into a thematically rich mosaic. To a certain extent, all his films deal with the corruption of Eden, and Hidden Life is as literal as Thin Red Line and New World in this respect. Sankt Radegund is an earthly paradise (the film was originally called Radegund, before adopting the George Eliot quote as its title). However, as the war takes hold, the village comes under attack, not by bombs, but by ideological complicity, and the village at the end is an infinitely different place from that at the start, a tainted place.Franz doesn't resist the Nazis because of politics. His reasons are simpler – he believes that God teaches us to resist evil, and as a great evil, he must therefore resist Nazism. In an important exchange with Judge Lueben (Bruno Ganz), Franz is asked, \"Do you have a right to do this?\", to which he responds, \"Do I have a right not to?\" His resistance is in his very soul. Indeed, watching him head willingly toward his tragic fate, turning the other cheek to the prison guards who humiliate him, he becomes something of a Christ figure, with his time in prison not unlike the Passion.Aesthetically, as one expects from Malick, A Hidden Life is almost overwhelmingly beautiful, particularly in its depiction of nature. Shooting digitally, Malick and his first-time cinematographer Jörg Widmer shot most of the exteriors in a wide-lens anamorphic format that distorts everything outside the dead-centre of the frame. The effect is subtle (we're not talking fisheye lens distortion), but important – pushing the mountains further around the village, bringing the sky closer, elongating the already vast fields. This is a land beyond time, a modern Utopia that kisses the very sky. It's also worth noting that a lot of the VO is epistolary, with large portions taken from the letters Franz and Fani write to one another when he was in prison. For Malick, this is a very conventional style to employ, especially insofar as his VOs have been getting more and more abstract as his films have gone on.As for problems, as a Malick fanatic, I found very few. You know what you're getting with a Malick film, so complaining about the length (it's just shy of three hours) or the pace is kind of pointless. You know if you like how Malick paces his films, and if you found, for example, New World boring beyond belief, so too will you find Hidden Life. One thing I will say, though, there are a few scenes in the last act that are a little repetitive, giving us information we already have or hitting emotional beats we've already hit. It could also be argued that the film abstracts or flat-out ignores the real horrors of World War II, but that's by design. It isn't about those horrors, and Thin Red Line proves Malick has no problem showing man's inhumanity to man. The same is true for politics; much like 1917 (2019), Hidden Life is not about politics, so to accuse it of failing to address politics is to imply it's obliged to address politics. Which it most certainly is not.In the end, A Hidden Life left me profoundly moved, on a level that very, very few films have (Thin Red Line and Tree of Life amongst them). Less a film than a spiritual odyssey, if you're a Malick fan, you should be enraptured. I don't know if I'd necessarily call it a masterpiece, but it's certainly close and is easily the best film of 2019 that I've seen thus far (the fact that it missed out on a single Academy Award nomination is a commentary unto itself)."
    },
    {
      "rating": "5",
      "text": "As with 70% of Mr Malick’s later works, this one runs forever - while telling what amounts to little more than a short story. Deeply felt, spiritual, and at times superb looking, it suffers from his trade-mark extended minimalist style. The editing is often abysmal (in need of a collaborating editor) with jarring continuity jump cuts, possibly revealing the fact many scenes were too long, with little to say, so were cut down to serve their purpose. To some, this may look trendy but for many,  it may be shoddy to look at. On paper, this potent story would have looked impressive - yet the final result on screen will reflect only a small percentage of its power. For a fact-based story, it amazed me that the cruel German prison system allowed any letters to be written, let alone sent. I’d have also assumed any that were forwarded would have been heavily censored – in this situation that appears not to be the case. Characters often come and go with little introduction, so acute concentration is required. Thankfully, the last half is a little more structured than the somewhat messy first – this helps to follow the shockingly harsh struggle this tragic fellow was forced to endure. His wife and children are left battling the elements and unfriendly village neighbours, as they attempt to survive by working their farm without him. Sadly, it seems the local church did little to support his unfairly ostracized family, giving poor acknowledgement of his strong Catholic faith and the family’s church service in years prior. Appears the Catholic Church shamefully colluded with the Nazi war machine too often. This is sad indeed. Germany was determined to take control by force but force devoid of love was bound to fail.Festivals and those who like Terrence Malick’s ‘style’ may last the way over-long distance but others may tune out early on. This is unfortunate, as it’s a story that deserves a better treatment. An effectively compiled music score helps carry it some of the way. Will please devotees or the patient."
    },
    {
      "rating": "9",
      "text": "Realistically confront and present to us a family decision in most difficult time"
    }
  ]
}