{"id": 4628, "title": "A History of Violence", "starring": ["Viggo Mortensen", "Maria Bello"], "runtime": 96, "genre": ["Drama", "Thriller", "Crime"], "description": "An average family is thrust into the spotlight after the father commits a seemingly self-defense murder at his diner.", "releaseYear": "2005", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/y8Onw0tZuEb7zfboLr1MIxqCo6U.jpg", "categories": {"plot": 7.153846153846154, "acting": 6.7631578947368425, "ending": 7.8125, "soundtrack": 5.0, "cinematography": 6.666666666666667, "familyFriendly": 3.0, "funny": 6.8, "action": 4.6}, "reviews": [{"rating": "10", "text": "C'mon people - METAPHOR! The look of the film, the performances and the story play with/twist standardized forms from the inside out. Its supposed to feel awkward and stilted, that's the idea! The film can feel uncomfortable to watch cuz it mirrors our own superficial, hair's breadth distance from a history of the worst kind of violence. From apehood to rape to the miriad abuses of power, the human race is still in its infancy and we're still dealing with all this stuff. This movie sheds a light on a culture which was to a large degree born of violence. Its a difficult film - sometimes difficult films are good - great in this case."}, {"rating": "8", "text": "The Cronenberg trademark gore SFX are here, but so too is a great drama, characters and a story. If it kicks off feeling a little too made-for-TV (a little too saccharine on the domestic bliss angle?) ,  it pays off later in the adrenaline rush of sudden, brutal realistic violence."}, {"rating": "8", "text": "A History of Violence is raw and compelling. This film will make you question everything, absolutely everything. And for good reason. By the end, you'll understand why Viggo Mortensen is much more than Aragorn."}, {"rating": "8", "text": "This one is definitely a slow burner, but the pay off is great and as a film, it is certainly something to marvel at. Firstly, the direction from David Cronenberg is great and as this was the first film of his I have seen, it certainly makes me want to continue going through his filmography. In terms of acting, Viggo Mortensen is great, as are Ed Harris and Maria Bello. The only actor whose performance was iffy was Ashton Holmes as Mortensen's son. He struggles at times, especially when on screen with heavyweights like Mortensen and Harris. In addition, the film is filled with tension. The film may be a slow burner and all, but once it kicks into high gear, things are very interesting thanks to these very well developed characters and their interpersonal relationships. While at the end of the day, this is a movie, everything felt very authentic and you really believed these people were who they said they were thanks to great writing, acting, and direction. The film has a smalltown feel as well, which is awesome. The violence is a tad graphic, but it never feels like it is too much, which is also a big plus for me personally. Overall, A History of Violence is a good film that really highlights what a thriller should be like."}, {"rating": "8", "text": "While exploring richly thematic ideas of harm, family, and the troubled past, David Cronenberg and the case of \"A History Of Violence\" ultimately craft a fantastically thought-provoking and thoroughly intriguing thriller."}, {"rating": "8", "text": "David Cronenberg, the director of such films as Dead Ringers and The Fly, has a reputation for being a little \"out there.\" It may come as a surprise, therefore, to learn that his latest, A History of Violence, is almost mainstream in the way it tells a linear story and curtails freaky images. The movie, which is at its heart a meditation upon the meaning of identity, is not perfect. Although there's little wrong with the first two-thirds, A History of Violence slides onto a tangential path during its final act, and this misstep reduces the production's overall effectiveness. Nevertheless, there's a lot to admire here.\r Tom Stall (Viggo Mortensen) is a model citizen, ideal father, and loving husband. His two children, Jack (Ashton Holmes) and Sarah (Heidi Hayes), trust him, and his wife, Edie (Maria Bello), adores him. The fun hasn't gone out of their marriage, as Edie proves when she dons a cheerleader outfit to seduce Tom. One evening, while Tom is working behind the counter at his diner, two thugs come in with rape and robbery on their minds. After a brief struggle, Tom gets the gun away from one of the robbers and uses it to dispatch both intruders. He is hailed as a hero, and there is blanket news coverage. And it's on TV that Carl Fogaty (Ed Harris) sees a familiar face. Based on the evidence of his eyes, the man who calls himself Tom Stall is actually Joey Cusack, an ex-killer from Philadelphia. So, with henchmen in tow, Carl heads for the town of Millbrook, Indiana.\r Central to the film's success is the uncertainty about Tom's past. When confronted by Carl, he not only denies being Joey, but claims to have never been in Philadelphia. Neither the script nor Viggo Mortensen gives us a clue whether Tom and Joey are the same person, or whether Tom is the victim of an unfortunate coincidence. As the Stalls must deal with the new, dangerous presence in their life, they must grapple with questions of identity. What makes each of us who we are? Is it our face, or something deep within?\r Cronenberg weaves a spell for over an hour, but he proves unable to sustain it for the entire running length. The need for a conventional resolution pulls him off course during the movie's final third. Some of the most interesting characters and relationships are taken off the screen to allow A History of Violence to move in a different direction. Since the screenplay is based on a graphic novel, I suspect that the filmmakers may have had little choice about the trajectory.\r The children have their own mini-stories as well. Sarah is afraid of monsters in her closet, and is comforted by her father (who says there are no monsters) and brother (who asserts that monsters are afraid of the light). Meanwhile, Jack has problems with a school bully. At first, he backs down but, in the wake of his father's \"heroic\" actions at the diner, he decides that confrontation may be the better course of action. Has the wimp become an avenger? Once again, it comes back to a question of identity.\r Mortensen finds the perfect pitch for Tom. In this performance, we see a good, simple man who cares about his family and community. But we also see hints of something else - a darker, more decisive personality. During the film's first hour, I changed my mind several times about whether Tom was Joey, and a lot of that had to do with the way Mortensen plays the role. Opposite him, Maria Bello is a firecracker, the kind of actress who draws the camera's attention. Not since The Cooler has she been given this juicy and demanding a part. And, as the villain, Ed Harris is nothing short of despicable.\r A History of Violence can be seen as a thriller, but in many ways it works best during its quieter moments. As the title indicates, this is not a sedate art film. It contains moments of sharp, vicious mayhem and there is a body count. But the strength of the movie lies in its psychological complexity and depth. And, while I wasn't enthused about where A History of Violence takes the audience during its waning moments, it at least offers a sense of closure, and, in the final scene, hope. Left unresolved, however, is the perhaps unanswerable question about whether the nature and identity of a person are fixed or fluid."}, {"rating": "8", "text": "What's this? The last feature film made by Hollywood to be released on VHS? RIP - VHS'es. No longer relevant after 2006. A History of Violence is seriously one of those violent movies that actually works."}, {"rating": "8", "text": "A History of Violence has had it's aspects when it comes to body horror by David Cronenberg which does not have anything to do with body horror. It's based on the graphic novel. So when I had heard about A History of Violence, I've heard that it's going to be violent and yeah, I was right. It had some violent scenes that are bloody and will keep you on a big impact. Viggo Mortensen plays an diner owner, Tom Stall, who lives with his wife and kids in the small town of Millbrook, Indiana. One night, two robbers attempt to rob the restaurant but Tom saves the day by killing them in self-defense. After this, Tom is at hospital while the news went worldwide making him a hero. Then the next day, Carl Fogarty played by Ed Harris visits Tom in the diner calling him Joey Cusack who Tom says he's never been to Philadelphia so now Fogarty stalks the Stall family and he'll kill him if he doesn't come back to Philadelphia with him. When it comes to David Cronenberg when he is known for making body horror flicks about changing bodies, this one is not about that. Actually, that reminds me. I saw a deleted scene which is known as \"Scene 44\" for some bizarre reason which features a dream sequence in the diner, where Fogarty tells Tom he will kill him and his family which leads him to kill him with a shotgun and then he shoots back. While the director was amused by the idea he then rejects by leaving it out of the movie. I enjoyed this film even if it's not your typical film by David Cronenberg. I like the acting in this which is something that grabbed your attention. Viggo Mortenson and the other cast did good. Viggo's character is a regular guy who used to kill people back in Philadephia and now goes on with his life and doesn't want his wife and kids to know about his past. He's a great character who knows what he's doing and living his normal life. William Hurt is also great in this but he's only in the film for eight minutes considering that he was nominated for an Academy Award. And the ending just leaves you in emotion where it's all silent when Tom returns home. If you haven't heard of this movie or won't understand what it is about then I suggest you check it out and then you will understand it. Give it a try."}, {"rating": "8", "text": "mannerism foliates its space and crowdedness equally..A History Of Violence A History Of Violence is a character driven dramatic thriller about a guy whose hidden past haunts him back to his family after he leaves his street credit behind. The feature is surprisingly fast and utterly exhilarating to the core with its street ruggedness and raw brutality that grounds this stunning craft. The range of its narrative is fascinatingly wide and it excels on each peak moments that it dares to achieve. It is sharply calm with a jagged script behind the screen that is slowly ticking along with it which when hits its allotted frame, it explodes emotionally that leave an everlasting impact on you. The background score is decent, the sound effects are sharp and aptly loud, the art designing may not be in its A game, the cinematography is stunning and so is its fine editing. Despite of resonating tremendously with practicality, it glorifies its malleable mythological characters with such panache that leaves the audience in an awe of it. Mortensen is poised, reserved and profoundly calm in its horrifying portrayal with Harris supporting convincingly as always and Hurt giving some of his career's best work in here. Olsen's adaptation tells a compelling gritty tale whose mannerism foliates its space and crowdedness equally. And armed with a script as such Cronenberg executes the anticipated vision on screen with his finesse and a bit of pepper added in it, that makes it raunchy. The short screenplay enfolding characters and eye popping decisions which is also justifying to the core as much as entertaining it is, along with a stellar performances by a cast of such caliber are the high points of the feature. A History Of Violence has a plethora of emotional distress in here to keep the tense environment alive among the characters and the hook that binds them all."}, {"rating": "8", "text": "Cronenberg presents us a genuinely lovable guy with a very peaceful life; this serves to allows us to sympathize with Dr Jeckyl before we get to meet Mr Hyde.Once Tom's past comes into light we judge him for his actions instead of his intentions. Violence begets violence, and Tom's history of burying his past to reinvent himself in order to break away from this vicious cycle might be the most heroic aspect of this complex character.But violence, regardless of the motive, is violence nonetheless. The real question we should ask ourselves after watching this tale of the American dream is:can violence be forgiven?"}, {"rating": "7", "text": "C'mon people - METAPHOR! The look of the film, the performances and the story play with/twist standardized forms from the inside out. Its supposed to feel awkward and stilted, that's the idea! The film can feel uncomfortable to"}, {"rating": "10", "text": "It is very rare that a film is so compelling that it keeps my eyes absolutely glued to the screen from its opening sequence to its final frame. Surely, A History of Violence is one of the great films of the decade."}, {"rating": "10", "text": "This movie is phenomenal: from the long take, no cutting opening to the incongruity of Ed Harris' car in the small town to Viggo experiencing a rebirth after having killed his brother, to the brilliant and wordless scene that closes the film, this movie is almost virtuoso beyond belief. This film is just about perfect."}, {"rating": "8", "text": "David Cronenberg fascinates me, and his directing style and films are quite unique. Unique in how they really get under one's skin, explore complex and difficult themes not explored an awful lot by other directors without any sugar-coating or excessiveness and how many of them disturb and makes one feel uncomfortable. Films of his have shown some dark wit and have found myself connecting emotionally to others, primary examples being my favourites of his 'The Fly' and 'Dead Ringers'. His films are much more than horror.As is evident with 2005's 'A History of Violence', which is as long away from horror as one can get. Instead a mix of thriller and drama, which for Cronenberg back then was pretty much completely different. As were the themes, those of violence and identity, explored again two years later in 'Eastern Promises' (which there is a marginal preference for). Although the audience reaction is evidently polarising, understandably too, 'A History of Violence' was critically acclaimed at the time and in my mind while it is not perfect rightly so. It is by some way one of Cronenberg's better and more interesting later films and towards the better half of his overall filmography. Do agree with those who say that it is one of his more accessible and mature films.Not a perfect film, again from personal opinion. The first portion or so is on the slow side and doesn't draw one in straight away. Not everything felt necessary either, in particular could have done without the gratuitous staircase \"hate sex\" scene and the high school scenes which had very little tension or surprises and would have been more in place in a teenage comedy drama.Heidi Hayes is very wooden and expressionless as Sarah. Some have slammed Ashton Holmes, personally thought he fared much better as there was more intensity and emotion from him and Jack was an infinitely more interesting character, at least the film actually tried to develop him whereas Sarah was more the stereotypical young daughter that contributes little to the story.On the other hand, 'A History of Violence' as usual for Cronenberg looks great. The locations create a sense of foreboding as does the very atmospheric lighting and tight editing. In this regard though, the star is Cronenberg regular Peter Suschitzky's cinematography, which has the right amount of grimy grit and audaciousness. While there is a preference for more characters-of-their-own scores 'The Fly', 'Dead Ringers' and 'Eastern Promises' of his collaborations with Cronenberg, Howard Shore's score is still suitably dramatic and hauntingly ominous with no questionable placements. Cronenberg provides some of the most ambitious and tightest directing of all his later films, doing a great job pulling no punches and keeping the tension going, keeping it remarkably and uncharacteristically straight.Some have criticised the script, personally found it thought-provoking, taut when needed, darkly satiric in places and subversively witty in others, failing only in the high school scenes. The story on the most part did grip me with its teasing tension and suspense in the atmosphere, loved the tension between Viggo Mortensen and Maria Bello, the unflinching and pretty frightening violence that really doesn't hold back and the unforgettable climax. Mortensen gives one of his best performances in one of his meatier roles and Bello brings a lot of heart to hers. Ed Harris chills the bone and to me he was more deserving of the Best Supporting Actor nomination than the still very good William Hurt who really livens proceedings up in his ruthlessly ripe turn."}, {"rating": "10", "text": "Best movie of the year. Extraordinary. Go now. Do not wait."}, {"rating": "0", "text": "This was the worst movie I have ever seen. The writing was the biggest bunch of hack tripe I have ever heard. I cannot believe even one critic liked this. Don't see this. It will make you angry."}, {"rating": "2", "text": "Quite possibly the worst movie I have ever seen. Unfortunately it contains some of my very favorite actors. Goes to show that even great actors can come across as incredibly bad actors with the right script and direction. A real family wouldn't react the way characters in the film acted once they found out the truth about Tom Stall's past. I mean c'mon, Edie had to throw up in the toilet when she found out. That was not only ridiculous but a bad piece of acting as well. I don't even want to waste anymore words on this extreme disappointment"}, {"rating": "3", "text": "At one point, Ed Harris says something like \"You're trying to hard to be this other guy; it's painful to watch.\" I think that summed up most of the movie. There's a message there, and it's deep, no doubt, but morals don't need to be this horribly communicated. Utter junk - I can't believe the critical response this received."}, {"rating": "10", "text": "For as long as humanity has existed we have always been violent we may have not been created that way  but somewhere down the line  we found out that violence  could save us or destroy us. It all depends on if we choose to use violence as a means of salvation or as a means of destruction in David Cronenberg's blunt yet very insightful film raises thought provoking and shocking questions about the true nature of violence and how it can affect some and change others. how sometimes a single act of violence can make all the difference, how it can change who you are  and turn you into a person you told yourself you would never be. This is the story of one man, the story of one family and the story of \"A History of Violence\".   David Cronenberg's violent, brutal and extremely intelligent look into the nature of violence is nothing short of insightful, moving and at times shocking, shocking because it delivers a story so true and unflinchingly honest that turning away from the screen, turning away from the story would be near impossible. It is such a powerful and thought provoking film that just leaps out at you at every turn it   shocks and amazes with its brutal violence, it's emotional and heartfelt story of family angst and how the past can sometimes catch up with you.  Cronenberg know for his gory horror films and wigged out thrillers has created a stable film of right and wrong, good and evil, life and death. Cronenberg's \"A History of Violence\" is not a film for the squeamish or the faint of heart what it is a powerful   film experiences that leaves you with a haunted and disturbed feeling making you wish you had not seen the film and at the same also making you feel glad you did.   This film calls you to watch a film that needs you to watch it to see the darkness of one manâ"}, {"rating": "10", "text": "Exciting, challenging, brilliant.  A film that starts in on you hard--but slowly--giving you just one long chance (a monumental single shot sequence) to get up to speed and recognize that if you ever think the story is uneven, implausible, it's because YOU aren't getting it.  It's a parable, a morality play, a electrically-fast hand-to-hand combat symphony, but above all, it's about people's wishes to be good and peaceful until they are threatened, when they wish for a savior to step between their lives and the paradox of unsympathetic evil that cannot be dissuaded.  If you have ever been in that situation, you know--but may not accept, or like yourself for it--you know that you would destroy that man that threatens you.  But then, how to live?  Many of us chose to live by avoiding the problem (and who wants to have it?) and therefore letting others destroy for us.  This film reminds us: those others that destroy for us have faced the same choice, and come to a different conclusion: they will not avoid.  Are they worse for helping us live?  Have you watched bullying and done nothing?  Have you not been involved?  Have you risked yourself for me?  If not, don't condemn me for helping you live."}, {"rating": "6", "text": "A History of Violence has it's plus points (a good story, some cool over-the-top murder action and some kinky sex) but they're offset by some ham-fisted scripting, flat direction and too many sub-plots that don't come together. The movie ends up being decent entertainment but still feels somewhat half-baked."}, {"rating": "1", "text": "It really does believe in itself. Really. Which is tragic, because it is a totally unnecessary and ridiculous mess that I am, to this day, ashamed to ever have seen. Most annoyingly of all, however, is how grossly overrated this sack of over-confident, half-hearted nonsense is. If you are into films, please do not listen to what you hear, and AVOID this film. Utterly shameful."}, {"rating": "9", "text": "Fantastic performances all around, Viggo Mortensen is one of the best actors around today. There's no corny one-liners from the bad guys, it's all raw and violent. There's almost something poetic about it."}, {"rating": "9", "text": "This movie is incredible. The sudden bursts of extreme violence, the acting, the raw sex scenes, everything is top notch. The story amazes, and the ending at the dinner table is one of the most tense and thrilling scenes I've ever witnessed."}, {"rating": "6", "text": "The run time is rather short and doesn't offer much dialogue nor real plot progression. We see it visually advance in the plot but we don't really experience it. I think it could have been a much deeper film if that add a bit of dialogue and really explored the characters, Who could have been very compelling. I mean this is a family who is finding out that their father/husband isn't who he says he is and it shatters the mold of the perfect small town family that they built through out their lives.I also think it wastes a very talented cast and doesn't really make much use of it them as well. Harris is always fun to watch and I loved Mortensen as the lead. Maria Bello is solid as well. Yet again they don't really make sure of them. All in all it's not a terrible movie but there's a lot of wasted potential."}, {"rating": "2", "text": "A History of Violence is not bad its disgraceful. The movie is made in such an uninteresting way with its poor dialogue, below average acting, and a pace that will leave you with a headache. The ending is predictable and frankly a joke."}, {"rating": "6", "text": "I wonder how a movie can go from suspenseful and absorbing to seemingly worthless and uneventful. By the end, the storyline was pathetically simplistic. I hated the ending. It was as if everything that kept me entertained disappeared and was replaced by some peculiar straightforward garbage. However, that shouldn't diminish the fact that the majority of the film was very solid."}, {"rating": "6", "text": "Great start to the movie through the first hour and then the last 30 minutes got kind of wacky and the personality of the main character did a 180.  Overall a good movie, but surprised the critics rated it so highly."}, {"rating": "5", "text": "Was this a bad film? Not at all. Was this a great film? Not at all. Was this an ok film? Yes. A History Of Violence is just a so-so film. There are things that I really enjoyed about the film. However, I had a  problems.  I had a unfulfilled feeling in me watching this movie. I kept on expecting  moments of greatness. There were several parts in this film that just lead you on, and the second you think something big is going to happen....... nothing happens. There is all this tension and conflict in the characters, but I feel so unfulfilled by the end of the flick. I really wanted it to expand on several plot points. I felt like I watched the beginning and the middle of the film. It was as if there was something else in store, but it wasn't shown. Now the title does live up to the  film. There is much violence in this film, but the violence is not as interesting as many other great films. Watch this film if you want to. Watch it if you don't. Like I said, its not the worst or the best film. It is just ok."}, {"rating": "9", "text": "This is a top-notch film. It is paced very well and the story is great. I was continuously waiting for the next development to find exactly what was going on. Combine all of this with great acting and you've got something really good."}, {"rating": "10", "text": "Wow."}, {"rating": "5", "text": "A history of violence was the first movie ever that i realized that a one and a half hour movie can be painfully long.\ri was completely shocked by the overall terrible performances, even from Viggo Mortensen and i was shocked again when i knew that William Hurt was nominated for an academy award for his terrible awkward performance, and what made it worst is the directing.\rYes the directing was terrible coming from the director of Eastern promises. from the first 5 minutes i realized that the movie was slow, and i was kinda hoping for it to be like a cool directorial thingy, but it's not, it kept going like this making the movie painful to watch.\ri just seen Eastern promises and i really liked it, Viggo Mortensen character was dark and the story had depth but here, we have a shallow character that just playing awkward to the point that even the connection between family members were awkward and unreal, i mean come on, a teenage boy kiss his mother good morning every day seriously ?\rand i'm not against nudity in films but the wife coming out of the bathroom completely naked was pointless and stupid, it was like \"hey, we can do this and that\" and the sex scene on the stairs was awkward, i genuinely felt that i was watching a movie by M. Night Shyamalan."}, {"rating": "2", "text": "The Scores for this film truly bewilder me as this is possible one of the worst films I’ve seen in a while: and I love Viggo Mortensen!\rThe film has a simple premise but doesn’t seem to really build up to anything from it. Viggo’s character saves a community from criminals in a violent fashion and gets called a hero, but also attracts the Mob’s attention who think they know him. The premise never fully goes anywhere and the direction is all over the place, as in one scene where Cronenberg uses a panning shot that descends onto a boy at a baseball game. WHY USE THAT THERE? There are also far too many cuts in some scenes for instance, when Viggo returns home and it has a shot of everyone in his family in turn over and over and it was just too painful.\rThen there is the “acting”. Viggo does an alright job of speaking quietly and then bursting into violence but nothing really is noteworthy about it. Maria Bello is awful in her role and is difficult to watch and the young teenager goes from doing an alright job to becoming worse as the film goes on. Then the 2 villains in the film hardly get enough screen time to really develop or become interested in or even really enjoy watching.\rThen there are plenty of scenes that are just kind of unnecessary, one scene in particular being a perceived rape scene (which would’ve added controversy yes but really shown more about Viggo’s character) and turns it into a consensual and erotic staircase sex scene that just comes out of the blue and seems completely absurd. The directing of it is pretty shabby also, at one point cutting to a shot or the bottom of the stair case where you can see on leg moving slightly. Hmmm, such a vital shot. Straight after this they then also add in some unneeded nudity just to hopefully gain viewers interest for a few seconds again.\rI really, really, really struggled to even attempt to enjoy this movie. The violent scenes are pretty unexpected and gruesome but they can’t give this film a better rating when the majority of the rest of the film is a trainwreck. Please try miss this for your own sake and money.\r2.5/10"}, {"rating": "7", "text": "David Cronenberg's ''A History of Violence'' starts off slowly, then changes into a brilliant sprinting marathon, but tumbles before the finish line. That's the best i could describe this film. The beginning is slow, the middle is truly incredible, but the third act (after a certain turning point, i wont say which, but anyone who's seen the film knows what i'm talking about) falls falt on it's ass, and it loses all of its momentum which is such a disappointment, if the ending kept the same momentum as the first and second act, it would've totally been a 5/5 star movie.\r As for the writing. I feel like it's a script written by the Coen brothers, but they had to hand it over to a serious director who doesnt like comedy so he deleted all of the light moments from the script to make a serious thriller. That's basically what it is, and it's remarkable. Also for a movie directed by David Cronenberg, this movie is surprisingly easy to watch without crazy disgusting imagery or practical effects, it's a pretty straight forward film which was interesting to see. The movie does have lots of explicit violence and 2 sex scenes, but you need to see something of Cronenberg's style in this film.\r Except for the disappointing third act, David Cronenberg's ''A History of Violence'' truly is a remarkable thriller. (The slow build up is dismissive)"}, {"rating": "8", "text": "Esta película me parece maravillosa. La presentación tanto de todos los personajes como de la trama y como hacen que todo encaje en un mismo punto es genial. Aunque cuando parece que la película se va a estancar y necesita un empujón, lo tiene con un espectacular giro de guión. A partir de ese momento parece que va a caer, pero se mantiene bien hasta el final. Y es que ese es otro de sus puntos fuertes, lo rápido que llega el final. Indicando que está bien escrita y muy BIEN montada, lo que hace que tenga un gran ritmo toda la película.Los personajes están bien construidos y te crees que los protagonistas son una familia. Muy interesante el personaje de Viggo Mortensen e interpretado de manera sensacional. Mención aparte para la valentía de la mujer del protagonista. Ole.Otro de los puntos fuertes de la película reside para mí, en la crudeza de las imágenes en la mayoría de las ocasiones. Una cámara que no rehuye de nada, ni de las consecuencias de la violencia ni se priva de mostrar las escenas de sexo, como si de una serie de la HBO se tratase.En resumen, película fácil y rápido de ver pero no por ello menos buena. Todo lo contrario. Me ha dejado muy satisfecho y con un final muy 'agridulce' que la eleva más si cabe como una propuesta valiente. Genial. Un PEDAZO de 8."}, {"rating": "2", "text": "After reading all of the good reviews for this movie, I can not believe that I watched the same movie as all of these other people writing good reviews. The movie was just flat-out boring. There were maybe 3 events that happened in the entire movie, and the rest was just filler in order to make it a normal length for a film. It didn't help that the acting was terrible, which if had been good would've made the movie a little more bearable. In the beginning, I was willing to give the movie a chance, after reading the summary it seemed like it would be an alright movie. As I kept watching I kept waiting for something exciting to happen, and the only interesting parts of the movie were the fights and the killing. If you're thinking about watching this movie I have one message for you: Don't waste your time."}, {"rating": "5", "text": "I know I'm in the minority for this film but I just didnt think this movie was all that and a bag of chips.  There is no reason why i shouldn't like it with the story being good and the cast was excellent.  For some reason I just didnt like it."}, {"rating": "4", "text": "It's pretty awful, poor camera work, acting quite wooden, the fight scenes are poorly choreographed. Really can't see how some people rated it so highly."}, {"rating": "6", "text": "The bad acting, unbelievable circumstances, strange soundstage work, and predictable story make this just a watered down Cronenberg flick without anything strange to keep it interesting. Cronenberg's flicks often play out like a series of disjointed events, and this one is no different. Too bad that style doesn't play to this type of movie as it does to the excellent (and disturbing) Dead Ringers. I actually winced at the bad acting in \"A History of Violence\"."}, {"rating": "2", "text": "Are you guys kiddding? This was a HORRIBLE movie. The plot was horrible, the pace was horrible, the idea was horrible. It was slow and predictable. When we left the theater EVERYONE was saying how bad it was and atleast 15 people got up and walked out DURING the movie. The ONLY saving grace in this movie is William Hurts 5 minutes on screen.. YES 5 MINUTES!!! Do not see this movie."}, {"rating": "2", "text": "Just a horrible movie. How could the critics be so wrong on this? How could they almost unanimously support such a horrible movie?"}, {"rating": "10", "text": "Superb movie. Acting is excellent. May catch mainstream audiences, who exclusively want entertainment, off guard. They will find themselves not only entertained but also pondering the movie and its questioning of violence and identify for days afterwards. Cronenberg has taken the age-old themes of the classic genres of the Western and revenge bloodfests and imbued it with a provocative point of view. Is violence an ugly but necessary means to an end if your intention is noble, or is it always just ugly and self-defeating? Does the moral cost of violence negate its use in all circumstances? Can one ever escape your past no matter how much you have managed to reinvent yourself? Although he has successfully defeated all threats to his idyllic life, has Tom Stall destroyed ultimately destroyed that life in his attempts to keep it? Is he any longer \"the best man\" his wife has ever known? These are just some of the questions I came away with after viewing the movie, and there aren't too many other films I have seen lately that have done that for me."}, {"rating": "8", "text": "Great movie overall. The only thing I really questioned is the ending.....the plot twists were excellent, they kept you wondering the whole way through. Especially good performance by Mortensen."}, {"rating": "3", "text": "It's funny to see how either people absolutely loved or absolutely hated this movie. I, obviously, did not care for it -- and no, I'm not illiterate or oblivious. Yes, I got all the metaphores -- they were only delivered with a lead pipe. For example, he lived a \"white bread\" life in Millbrook... Millbrook is a brand of white bread. Gee, how clever. Cinematically, I found the lack of background music, while it augmented the slow pace of small town life particularly annoying after awhile. And, can somebody PLEASE explain why, just because some ex-thug knows how to fire a gun he can instantly turn into Bruce Lee when confronted with several well-armed opponents. Think about it... the guy has a teenage son so we can assume he's been flipping burgers in the diner working 14 hour days for at least 10 years. When's the last time you saw Mr. Olympia working at Mel's diner? If they wanted to make the story at least a \"little\" believable he should have been at least a \"little\" overweight and out of shape. Finally, with respect to the sex and violence in the movie -- I'm in no way prudish, but I found that neither did much to further the plot. Was it really necessary to show the blown apart skull of one of the victims while he lay twitching on the ground? All in all, I found the movie a HUGE disappointment and I'd be very suprised if this walked away with any major awards come Oscar-time."}, {"rating": "10", "text": "You don't realize just how much this movie has affected you until it is over, the credits are rolling, Howard Shore's subtly haunting score is playing softly, and you realize that for the first time in a long time, a movie has caused you to feel physically and emotionally uncomfortable. The final scene in this film is heartbreaking, chilling, and incredibly unsettling. I will not tell you exactly what it contains, but I will say that it is no sort of \"twist\" ending and it is almost entirely silent. That one scene is enough to put this movie well onto my \"Best of 2005\" list, but the rest is what really cements its place. Cronenberg plays the audience like a fiddle for an hour and a half, taking our desensitization against violence on film and throwing it in our faces so that we can no longer look away. The experience of watching this in a crowded theater is exhilarating, as it seems the entire audience is sharing something very, very powerful. Great work from Viggo Mortensen, Maria Bello, William Hurt, and Ed Harris. See this if you have wondered where serious mainstream cinema has been hiding."}, {"rating": "5", "text": "I don't get to the theater as much anymore, but when I do I want my precious time, not to mention almost ten bucks a ticket, to be worth it. So I check out what the critics and others are saying and try to give the pros their respect and the benefit of the doubt. But every time I pass up a movie rated poorly for one that is critically acclaimed I wind up sitting there wishing I went to see the movie all the critics panned. This movie was slow, unevenly directed, cinematically washed out, predictable and ultimately not very entertaining. Next time I go to the movies I'm going to skip the due diligence and ignore the critics until after I've seen it. Maybe I'll be pleasantly surprised and get my money's worth."}, {"rating": "4", "text": "Croenenberg's direction is uneven, slow, and prodding....he gets very little out of his actors, especially the five year old girl. William Hurt was miscast as Joey's \"Philly\" brother. D - movie from a B list director."}, {"rating": "5", "text": "Bad. Boring. Repetitve. Bland. Unconvincing. Comic book and dramatic script at wrong times. Emotions were toyed with. Very drawn out, contained not much more than an exact replica of the trailer. Funny, to the point W.Hurt = A."}, {"rating": "9", "text": "one of the best movies i have seen in a long time."}, {"rating": "5", "text": "The story was not very interesting especially once the plot unfolded. Ed Harris, William Hurt, and Mario Bello did a great job acting; the others were below average probably due to the inconsistency of how their characters developed. Final thought: A disappointing film that was loaded with potential."}], "recommendations": ["red_sparrow", "no_country_for_old_men", "the_machinist", "sicario_day_of_the_soldado", "eastern_promises", "the_experiment", "you_were_never_really_here", "dragged_across_concrete", "savages", "end_of_watch", "the_killing_of_a_sacred_deer", "the_invisible_man", "maggie", "the_grey", "brimstone", "cold_pursuit", "good_time", "127_hours", "hanna", "us", "drive", "split", "elle", "gone_girl", "the_equalizer_2"]}