{
  "id": 4809,
  "title": "A Hologram for the King",
  "starring": [
    "Tom Hanks",
    "Sarita Choudhury"
  ],
  "runtime": 97,
  "genre": [
    "Comedy",
    "Drama"
  ],
  "description": "Alan Clay, a struggling American businessman, travels to Saudi Arabia to sell a new technology to the King, only to be challenged by endless Middle Eastern bureaucracy, a perpetually absent monarch, and a suspicious growth on his back.",
  "releaseYear": "2016",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/wmjWGb2tqtOA4XPnK1tpIfzRtSQ.jpg",
  "categories": {
    "plot": 5.882352941176471,
    "acting": 5.846153846153846,
    "ending": 3.8,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 7.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "5",
      "text": "Some nice scenes, a good Tom Hanks and an interesting setting don't always make a good movie, if the screenplay is bad. This is one those cases. Worth a look, but don't waste your money on cinema."
    },
    {
      "rating": "6",
      "text": "This is not a typical Tom Hanks headliner, but a smaller indie film based on the book by Dave Egger. He plays an American businessman who travels to Saudi Arabia to close a big IT deal. Nothing is simple in this country, where he doesn't understand the customs and has to cope with the eccentric bureaucracy. He befriends his driver, flirts with a lovely doctor and has other low-key encounters. Meanwhile, his own personal doubts and family issues add more minor layers. While Hanks plays his typical appealing type, the film rambles from event to event without much momentum. The most interesting aspect is the scenery and architecture, as well as insight into the country's traditions. While it has charm and is never dull (not especially amusing either), the somewhat disjointed storyline meanders too much to provide much satisfaction."
    },
    {
      "rating": "6",
      "text": "Who: Tom Hanks, Q, and Tom Skerritt as an unnecessary addition to the cast\rWhat: 70 minutes of alright movie, 20 minutes of random topless scuba diving\rWhere: Tom Hanks' dream vacation\rWhen (Can I watch again): When it comes on TV and there's NOTHING else to watch\rWhy: It's difficult to find a truly bad movie with Tom Hanks in it, and you won't find it here"
    },
    {
      "rating": "6",
      "text": "A good film by Tom Hanks with a good story but the ending is very anti climatic and not much of a challenge getting there, from all the difficulties that his crew was facing which all suddenly got solved and the ending with him becoming romantic with the Arabian women all seemed to work out just the way he wanted without a hitch."
    },
    {
      "rating": "7",
      "text": "The best thing about A Hologram For The King is Tom Hanks. He does a wonderful performance as a down- on- his- luck businessman who is trying to get his life in order. If the title seems odd, so is the movie. The backstory of our main character is shown in very quick flashbacks throughout the run- time and while there is a plot about trying to sell a hologram machine to the Saudi King, it's not the focus. This is more or less a character study about a man who has lost direction in life. He meets many characters throughout who help him find meaning in his life and the film's conclusion is very abrupt. Unlike the recent film Demolition, this one better shows someone going through depression, while doing it in a lighthearted way. Not to mention that this is also quite hilarious. I laughed a lot throughout and the drama here made me care for this man. However, the story lacks focus as there are many subplots that go unfinished. In addition, there are a few dead- areas where the pacing is too slow. Overall, this unique film with a unique title about depression is funny, heartfelt, and has a great performance from Tom Hanks."
    },
    {
      "rating": "9",
      "text": "Given all the mixed and negative reviews here, I was surprised at how much I liked \"A Hologram for the King.\" It's funny and serious and wonderfully unpredictable. The scariness of Saudi rule mixed with the absurdity of Saudi life. I was laughing out loud at the absurdity of Hanks' businessman's mission, the scary armed Saudi guard at his sentry station cooling his tootsies in a multi-hued kiddie pool. Hanks' character has to deal with officials who promise to show up but never do, and he triumphs over hostile conditions and also triumphs in love with a very evolved and accomplished woman. A lovely, satisfying movie experience for both me and my husband."
    },
    {
      "rating": "2",
      "text": "After seeing “A Hologram for the King” the word that stays in my mind is interesting, not an interesting movie but for some interesting visual scenes.\r Going from a man in possibly a middle age crisis to a story about a fish out of water to a West meets East tale the movie is all over the place. With Tom Hanks, America’s Everyman, that is if Everyman has a Danish female contractor trying to seduce him and an independent Arabian woman doctor becoming involved with him, the role acquires depth even if the scenes with his daughter (Tracey Fairaway) hold the film back as does the brief flashback scenes with (Tom Skerritt) his father.\r The interesting visual scenes go from Alan (Hanks) and the doctor (Sarita Choudhury) in a swimming scene among coral reefs, wide spans of desert, a vision of what parts of that desert may develop by man plus the hologram(s) in the title. Now if only the movie had spent more time about the holograms it would have been interesting in a better way.\r There are more scenes such as a high rise beautiful condo growing in a desert land that is being built by exploited foreign workers who offer a brutal way of life. There is also the introduction of Yousef (Alexander Black) who is more or less a cliché as a driver/guide, who is good but really could be eliminated from the picture without a loss except for about 20 minutes making the already short, 98 minutes, movie shorter.\r “A Hologram for the King” does nothing for Tom Hanks’ career except solidify his likability while Choudhury is very impressive in her role and both in the underwater scenes are a delight as a couple.\r In spite of the interesting visual scenes, and Tom Hanks, there is no way I can recommend this movie."
    },
    {
      "rating": "1",
      "text": "Just one incredibly bad movie. Hanks, for years has been one of my favorite actors but good grief he's bad in this movie. Why? I asked my friends, did he ever agree to make such an amateurish, unprofessional flick? It may be the worst movie of his long and great career."
    },
    {
      "rating": "0",
      "text": "A nonsense movie with no purpose but to insult Arab culture , It's\runexpected movie from Tom Hanks , Big fail as always using media to lie\rnow using movies to deliver a bad lies about Arabs . shame on Hollywood\rmovies industry"
    },
    {
      "rating": "7",
      "text": "Okay, we have your middle aged business man who has hit the wall of obsolescence.  He travels to Saudi Arabia to do business so we have your typical American who knows nothing of the customs of the foreign country he is in.  We have a typical Hollywood ending where he finds himself and a fulfilling personal life.  But I gave it one extra point for Tom Hanks; he's just that good."
    },
    {
      "rating": "4",
      "text": "About a salesman who went to sell his product sold himself.\r I like this director, one of his film was in my all time favourite list. But I'm not sure what happened to him lately, he's not the same as what he was a decade ago. This is his worse to far I've seen. He's better than this, but he chose a wrong book. It was based on the book of the same name that tells the story of an American salesman whose last chance to get back on the track goes to saudiarabia to sell his product to the king. But the king's unexpected last minute reschedules avoids his meeting and so it continues like that for some time. In his those spare time, how he explores the desert country and its culture, including an unexpected feeling for a local lady doctor was told.\r Seems a fine material for the reading, the cinematically it did not have the same appeal. I haven't read the book, but it is short and lacks in detail it deals. The main character remains a mystery for not properly revealing his history, especially for the no flashback, which would have put him is a good position. That's why it looks just a mid story, that begins in a mid way of someone's life. Though Tom Hanks was good, like usual in another unique role.\r The film is about arebia, but it was shot in Morocco and Egypt. There's no big contribution from the supporting characters, except two. Sarita Choudury, especially Alexander Black transformed completely to a real areb and they both put a good show as well. The film was below average. Since it was a Hanks' film I anticipated something strong. It was something, but not the something I was looking for. Watchable film, but skipping it won't make any regret if you're okay with skipping an Hanks film. All the above his fans are very disappointed, so I hope his next film 'The Circle' would make us this one to forget.\r 4/10"
    },
    {
      "rating": "4",
      "text": "Tom Hanks is as charismatic as ever; and so is the rest of the supporting cast. Furthermore, the film’s insights into Saudi Arabia is very interesting. However, the editing is choppy and the film is frustratingly full of filler."
    },
    {
      "rating": "5",
      "text": "The movie was fine, but Tom as usual is great. The movie is interesting but it never takes The movie had some really entertaining moments with some surprisingly funny moments but they are few far and between. The movie ultimately is fine if not anything watch it for Tom Hanks at least."
    },
    {
      "rating": "0",
      "text": "I rented it because Hanks can't fail in a film, can he. Yes he can. Even with his presence and charm, this film is one of the worst I've seen in years. I watched it to the end to learn whether it could redeem itself with some sort of punch at the end ... it didn't. I blame this mostly on the script and director and the failed slapstick that made little sense."
    },
    {
      "rating": "5",
      "text": "We have come to think of Tom Hanks as one of the most talented actors of our generation - being a hijaked captain, American soldier, lawyer during the Cold War or even Andy's favorite toy, seem not to be an easy task. But for the movie \"A Hologram for the King\", we see a business man, who is sent on Saudi Arabia in proposing a way of telecommunication to the king. The question is, will it be worth the watch?Strung by two subplots with no significance to the storyline is the major issue in this film. Seems like in majority, the movie wastes its time involving the comedic and romantic subplots which has nothing to do with the title. But because of Hanks' charm and humor, the impact to its audience is elevated. There are also side performances from Sarita Choudhury and Alexander Black to look out for and their characters are at least likeable. It also features the everyday living of middle eastern people, which is a breath of fresh air in movies.VERDICT: Although the impact of its actors are present, the title \"A Hologram for the King\" seems to be misleading the overview of the film, and therefore should be called \"Business man Tom Hanks together with his Comedic and Romantic Metaphors.\""
    }
  ],
  "recommendations": [
    "the_terminal",
    "news_of_the_world",
    "donnie_brasco",
    "american_made",
    "the_second_best_exotic_marigold_hotel",
    "the_intern",
    "fighting_with_my_family",
    "the_longest_ride",
    "burnt",
    "downsizing",
    "stillwater",
    "child_44",
    "war_dogs",
    "silver_linings_playbook",
    "cast_away",
    "the_accountant",
    "jane_got_a_gun",
    "white_boy_rick",
    "widows",
    "live_by_night",
    "the_place_beyond_the_pines",
    "sully",
    "hereafter",
    "wonder_woman",
    "no_country_for_old_men"
  ]
}