{
  "id": 3355,
  "title": "A Million Ways to Die in the West",
  "starring": [
    "Seth MacFarlane",
    "Charlize Theron"
  ],
  "runtime": 116,
  "genre": [
    "Comedy",
    "Western"
  ],
  "description": "As a cowardly farmer begins to fall for the mysterious new woman in town, he must put his new-found courage to the test when her husband, a notorious gun-slinger, announces his arrival.",
  "releaseYear": "2014",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/n9SicwnoNGWBwE75le27sUhCLMm.jpg",
  "categories": {
    "plot": 4.1923076923076925,
    "acting": 4.0,
    "ending": 3.857142857142857,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 4.5607476635514015,
    "action": 1.0
  },
  "reviews": [
    {
      "rating": "3",
      "text": "Instead of paying 10 - 15 bucks to see the full movie (which is very long and not nearly coherent enough with LONG gaps between anything funny), just watch the trailer a couple of more times.  Then pop in Blazing Saddles which is 100 times funnier on every level.  Even my fave Sarah Silverman is criminally underutilized and under-directed.   Shes looks bored."
    },
    {
      "rating": "6",
      "text": "If you've seen Ted, and want to see more Seth McFarlane, you are better off watching Family Guy. A Million Ways To Die In The West is funny, but not up to the Mark and definitely not better than Ted. Seth is funny, Theron is sexy and Neeson is, not needed. In a comedy with sex jokes and over the top violence, Neeson didn't seem the fit. Sarah Silverman was great and so was Ribsi. But this movie is very lacking the substance that makes a movie good. Ted was funny, and heartwarming. But, this movie is funny but not heart warming, well written of well acted in some parts. I really was hoping for a movie that would top Ted, but it's not here."
    },
    {
      "rating": "5",
      "text": "\"A Million Ways To Die In The West\" is a prime example of when using Seth McFarlane's brilliant Family Guy comedy gets too excessive; it gets boring, shabby, and down-right pathetic like this movie."
    },
    {
      "rating": "5",
      "text": "well i finally saw \"A Million Ways to Die in the West\", Seth MacFarlane's newest movie, and... it was okay but i'm really disappointed. it's hard to tell what this movie's about cause it's a mess. it's not constructed well and the script was poor. Seth MacFarlane was also the main star and one of the writers, and i gotta say: this is probably MacFarlane's weakest and most disappointing script. yea sure, it did make me laugh a few times and the acting was good for most of the part, but i can't deny that \"A Million Ways to Die in the West\" was just not really funny. also, the best and funniest scenes are shown in the trailer... yea, the best scenes of this movie are spoiled by the trailer. that's pretty sad. so even though it was still okay, i did laugh and the acting was good, \"A Million Ways to Die in the West\" is just a disappointing mess and Seth MacFarlane's biggest let down. luckily, he has \"Ted 2\" on the way, but till then we'll be stuck with this let down."
    },
    {
      "rating": "7",
      "text": "I will admit, this is not the perfect comedy. But this is still one of the most underrated movies of 2014. The comedy was pretty good in this movie! Verrrryyy similar to Ted so I don't understand people's problems with the humour. I also enjoyed hidden references to other movies that were popular when spaghetti westerns were popular as well. Maybe that's the issue, westerns are too out of date. I guess my biggest issue with this film is that some of the comedy was pretty forced and some sequences such as the drug trip was just pointless, this being said, critics need to show a little more heart."
    },
    {
      "rating": "7",
      "text": "Frankly, it was better than the reviews led me to believe. It is uneven, and it does run on, but it is genuinely surprising at times, and the mix of ribaldry, violence, and romance is three things more than most Hollywood comedies bring to the table. I gave it a 7 because I'd rather see a movie that tries to be really good and comes up short rather than one that aims to be average."
    },
    {
      "rating": "0",
      "text": "Not funny at all. 16 minutes into it, I was ready to leave. I was on board when I saw Liam Neeson and Charlize Theron were starring in lead roles, but almost decided against when I saw Sarah Silverman- I should have listened to my first instinct yelling for me to RUN from this movie.  I would say wait for Redbox, but not even worth the $1.25 rental."
    },
    {
      "rating": "7",
      "text": "This movie really isn't that bad...it has alot of good humor in it. Is it as funny as Family Guy or Ted...no. But it is still pretty enjoyable. Doesn't deserve the crap it is given."
    },
    {
      "rating": "4",
      "text": "The primary issue with this movie is Seth MacFarlane himself. His character constantly complains about everything and leaves nothing to the imagination. MacFarlane often interrupts funny scenes in the movie only to say something along the lines of, \"See? I told you that would happen.\" Lines like that ruin the humor and flow of the movie. That's not to say the movie is never funny. There are a few scenes that had me cracking up and one in particular that made me cry due to humor overdose. However, these moments of humor are few and far between. Overall it's a very average movie."
    },
    {
      "rating": "2",
      "text": "It should have been called a million jokes die in the West. Surprisingly un-funny. I like Family Guy and maybe I'll still like Family Guy after wasting my money on this flop, maybe."
    },
    {
      "rating": "1",
      "text": "minus 5. lived up to its reviews.  could have worked but it didnt. painful to sit through, which i had to in a tiny theatre with few exit options and none early. will be giving ted a miss..."
    },
    {
      "rating": "3",
      "text": "Could have been good, Mr. MacFarlane took his eye off the ball, spent more time with the gags instead of the story, always a problem. The Western is not dead you just have to write a good story, the gag movie is what's dead. Go watch True Grit or Young Guns or City Slickers or of course Blazing, good stories that's the common denominator.\r This had such potential, it just sucks when you know someone misses the target. Case in point, Sarah Silverman is hilarious but it was obvious someone was trying to write stuff for her, she's funny the stuff she was saying in this movies was just dumb.. So disappointed, I was sure this was going to be a classic and it just fizzled out. There really wasn't any character that you could cheer for or boo against, just a lot gotcha humor. Oh well maybe next time."
    },
    {
      "rating": "5",
      "text": "I was very disappointed with the movie. I like Family Guy. I really adored TED. And I laughed at the trailers for this movie including the red band trailers. But this 2 hour long movie was a bore. I give credit to Seth Macfarlane for trying something new and bold. But it was just not as funny or as entertaining as it should have been. There were some over the top moments but they're not like TED or Family Guy. This movie try to be grounded in reality which really hurts it.\r If you watched any trailer for this movie then you saw most of the funniest jokes for the movie. Also if you watched a trailer with a certain cameo then you're going to be very disappointed because that's the entire scene for the cameo. For a movie called \"A MILLION WAYS TO DIE IN THE WEST\" I think there's only 10-15 deaths and some of them were in the trailers.\r Acting was fine. Everyone did their roles but they're weren't used to their full potential. Seth tried so hard to be an appealing leading man but I wanted to focus on either Neil Patrick Harris or Giovanni Ribisi. They were funnier than Seth especially Ribisi. Charlize Theron was funny and her chemistry with Seth is good..... for 5 minutes. This movie focused too much on the love story and it got boring after 5 minutes. And Liam Neeson is only in it for 10 minutes. It is basically a cameo.\r I would skip this one. Wait until rental because there's probably an unrated director's cut with more scenes added to it."
    },
    {
      "rating": "6",
      "text": "Do I want to watch this movie again? #YES But, it was really a poor-editing movie. I mean, with so great background set and actors/actresses assembles, it's really sad to see the editing of this movie just a mess. That's the whole minus of this movie. From the first time I knew it's MacFarlene movie, I didn't expect it will be a very serious comedy movie, I bet it's not even far from the full of instant jokes from Peter Griffin/ Family Guy. So, some critic reviews which disappointed with the movie, I believe they're not true fans of Family Guy at all. I enjoyed the movie. I laughed from the beginning to the end. Well, so many scenes that awkward and not good, I agree. But, I also love the characters relationship has being build up, my opinion is Seth MacFarlene made it, to deliver the movie he wants to make... I mean, if those editing skills included, then he almost made it. :) I want him make many comedy movies like Anna Faris."
    },
    {
      "rating": "0",
      "text": "If you're a bank robber and you need a place to hide for 2 hours while the cops stop looking for you outside, you still shouldn't see this movie. The movie is a production of Seth MacFarlane in his ongoing pursuit to become a movie star. This movie reflects on the ongoing seasons of Family Guy; incoherent, cheap, laud and full of propaganda that only a few elitists on drugs might share. This movie is not even worth an illegal download. Time spent watching this movie is time wasted."
    },
    {
      "rating": "3",
      "text": "While I don't deny Seth MacFarlane's ability to make jokes, because I saw how good he can be as a director in Ted. However, this movie lacked any comedic charisma and while seth can be comical, he can't really act well. The main thing that killed the film was that all of the funny jokes had been given away in the trailers, making the movie lose much of the comedy it would have had without trailers. Generally, this comedy was not worth seeing, but hopefully Seth can come back with a much better movie than this poor performance."
    },
    {
      "rating": "2",
      "text": "As others have already said, this plays much like an extended episode of Family Guy. Worse, it made me wonder why I ever liked FG in the first place.\r Seth MacFarlane must be  the most overrated and overpaid writer/director at work today."
    },
    {
      "rating": "4",
      "text": "I really wanted to like this movie, Seth is a funny guy and is good on screen but there are just not enough laughs in the movie.  There are a few giggles and a nice one liner here and there but they are few and far between with no scenes that give you big laughs.\r Its only rude and crude if you are older and never venture away from standard mass marketed stuff."
    },
    {
      "rating": "5",
      "text": "So disappointing. Anything touched by Seth MacFarlane is usually gold (or at least close), but this mainly unfunny movie just falls flat. There are more misses than hits, but the good news is the hits aren't just hits - they're home runs. However, the filler makes up a huge proportion of the film and even the surprisingly strong acting from Charlize Theron and Liam Neeson (who is great as a villain - a role he doesn't play often enough, though he clearly can!) can't save it completely."
    },
    {
      "rating": "3",
      "text": "The nicest thing that I can say is that it's not an atrocity like other people have said; it's simply bad. Think a two hour long Family Guy episode, or however long this movie ran; the pacing was such a mess I couldn't tell. I'll admit there were a few decent chuckles to be had, but the humor was largely hit and miss, and they often forget the \"humor\" part of \"crude humor\". Being a parody isn't really an excuse for more \"girl goes for the **** instead of the nice guy\" cliche that's been worked to death. There are references, like that oh so funny Doc Brown bit from the trailer, but it serves no purpose in the movie, it's just another thing you're expected to recognize and laugh at."
    },
    {
      "rating": "0",
      "text": "Death is undoubtedly the strongest motif in Seth MacFarlane’s newest live-action feature film A Million Ways To Die In the West. And like the motif itself, one cannot help but be bored to death with a film, that started off as an inside joke between friends (MacFarlane as well as his co-writers Alec Sulkin and Wellesley Wild), and develops into a perfectly displayed example of what happens when people who have too much money are given the freedom to make any piece of cow dung they want.\r If you are wondering just how and why A Million Ways was made in the first place, take this into consideration; MacFarlane’s first live-action feature, a film set-around a fouled mouth, prostitute loving teddy bear, only cost the studio $50 Million dollars and sought in about $550 Million, excluding profitable marketing and merchandising. A Million Ways has a production budget of about $40 Million, and will surely either recoup its budget completely, or draw in massive crowds for a pleasing profit. Seems like the wild west isn’t the only west with some issues. Western society is getting more and more involved with money making ideas than with any artistic ideas of merit at all, and because of that, our canon of comedy is suffering greatly for it. I can only imagine what our grandchildren and great-grandchildren will say when they see mere minutes of this and compare it to the classic masterful parodies before this like Blazing Saddles.\r To say that MacFarlane’s A Million Ways is bad is giving it a compliment. Watching A Million Ways only once and being able to it endure it for the one time, is like watching the dumbest person you can image hitting a loved one unnecessarily for an extended period of time, and calling it comedy. Mixing in messy slapstick, vulgarity, violence, gore, animation and unrefined sexuality and sexually innuendoed jokes, MacFarlane better snuggle up and be comfortable beside his teddy bear for the sequel of his surprise summer hit Ted, cause A Millions Ways is worse than having monsters coming out from under your bed.\r Like any good parody, the story begins similar to any other cliched generic story of a specific genre, in this instance, a Western centred around a poor sheep farmer Albert Stark (MacFarlane) and his inability to assimilate himself into the life of the frontier. Unable to grasp his hand or head around guns or gunfighting, MacFarlane writes himself as the lead protagonist with much knowledge and immense wit of today’s society, comparing it to the ridiculousness of the wild west. Albert, who avoids confrontation at all costs, backs-out from duels forcing his girlfriend Louise (Amanda Seyfried) to leave him for a wealthier and more macho man in town, Foy (ironically, Neil Patrick Harris). Depressed, lonely and unable to shake the feelings he has with his ex-girlfriend, Albert tries to find sanity and logic from his best friends and couple, devoted Christian Edward (Giovani Ribisi) and his prostituting girlfriend Ruth (the always hysterical Sarah Silverman). Albert, ready to give up, stumbles into the saloon one night and fatefully helps a beautiful Anna (Charlize Theron) escape a dangerous situation. As the two begin to bond over gun totting and a mutual hate of the wild west, Albert’s world is about to get shattered as his newest relationship finds him at the open end of Anna’s husband’s gun, a gun belonging to the notorious and deadly Clinch Leatherwood (Liam Neeson).\r Just a few days ago, I mistakenly found myself watching a video online on the lost art of visual comedy. The video, which highlights the steps and excellent examples of visual comedy using the very small yet extremely talented filmography of Edgar Wright (Hot Fuzz, Shuan of the Dead), reminded me how little visual comedy actually occurs in mega blockbuster comedies today. Jokes, actors, dialogue and sometimes stories are hardly the problem. Usually, the problem with so many of these polished and generic comedies is their dependence on the script and the focus of whats said and not what is happening. We are slowly approaching a point in our comedic pallet where the use of sound and picture is just a forum for actors to deliver jokes; think scenic stand up with props. A Million Ways may easily falls under this category (with the exception of a dangling sheep, or the drinking and riding scenes, which may very well be my favourite parts of the film). Staging is forgotten and thrown out the window (as are countless characters in the film) and what remains is a present mentality and hopeful comedic look at the outrageousness of the wild west. But, like any previous civilizations, there’s always bound to be unexplained and comedic understandings as to why people did what they did then. MacFarlane’s attempt to understand the wild west and make it a gross out, rude, crude and obscene comedy, just might inspire someone one day to make a comedy of people today, and their obsession with heir phones and technology."
    },
    {
      "rating": "2",
      "text": "Charlize Theron, if not THE most beautiful woman in the world, is certainly one of them as she shows in her, what has become a classic, Dior perfume ad. She has proven her ability as a dramatic actress winning an Oscar for her mesmerizing performance in “Monster”. Now, in “A Million Ways To Die In The West” she shows she has the chops for comedy holding her own, and more, against Seth MacFarlane.\r MacFarlene wrote the screenplay, with Alec Sulkin and Wellesley Wild, co-produced “Millions“ , directed the film and stars in the film. It tries to be a better satire/comedy on all the old western films but in no way does it even come close to the brilliance, satire and fun of Mel Brook’s “Blazing Saddles” which starred, was directed by and had the screenplay written by Mr. Brooks!\r One glaring comparison where MacFarlane really fails is a ’farting’ scene which just turns gross in “Million” whereas in Brooks film you never fail to laugh out loud no matter how many times you see it. MacFarlene also has Mr. Brooks to thank for introducing farting on the Hollywood screen.\r MacFarlene is a good looking man with an easy manner but he is taking the easy way out with using the F word and putting it in the mouth of his female stars along with other crude/rude words not too mention jokes based on all and every body fluids you can think of and repeating them.\r Along with MacFarlene, and Theron, Liam Neeson as a gunslinger, Amanda Seyfried as MacFarlene’s girlfriend, Sarah Silverman as a prostitute and Giovanni Ribisi as her virgin boyfriend (don’t ask) also starring is Neil Patrick Harris in what has to be the nadir in his career in the scene that ends the farting scene!\r “A Million Ways To Die In The West” is the latest in a string of man/boy comedies that presents vulgarity as comedy and isn’t funny. The film seems never ending and the way it ends is no surprise as is anything else nor the fact that it will be a hit with boys under 30. The film is rated R.\r Do yourself a favor, even if you have seen it before, watch “Blazing Saddles” instead of going to see ““A Million Ways To Die In The West”, unless like me you will sit through any film to watch Charlize Theron!"
    },
    {
      "rating": "0",
      "text": "By this time in the year, I didn't think a movie would come along that could ever beat Divergent as the worst movie of the year. Also, I didn't think it was possible for movie to be so **** bad that it almost makes this year a failure by the utter **** **** that oozes of its crevices. This movie is so **** bad, that I weep for anyone that laughed at this movie...(though I feel bad just laughing at only three parts that were internationally suppose to be funny). The only person that should laugh at this movie is preteens...if you're older than the age of 13 and you liked this movie, I feel bad for you because you're mom must have dropped you on your head when you were a baby.\r Now if you've read to this point, you know I hate this movie...but that doesn't even tell the whole story. This movie is so **** unfunny and bad, that Jack and Jill might be a better movie...Jack and **** JILL!!!!! I walked out of this movie wanting to insert a device into my head so I could erase the memory of this movie from my head. I wasn't thinking at the moment, but I should have asked for my money bad while I was at it. This appointment, blatantly racist, and not funny movie is the reasons why kids are so **** up...I dead serious about that. Seth has had only a couple things made that are funny. Ted is one of them and the first Family Guy movie wasn't bad. This however might be worst than anything he's ever made...though I haven't see everything he's made. The movie is so **** stupid that Epic Movie is better...and yes...you read that right. I could go on an on about how **** idiotic this movie is, but I quite bored. .5/10"
    },
    {
      "rating": "5",
      "text": "Wasn't a bad movie but could have been a lot better. Not as funny as Ted and the plot was a bit too serious for a comedy filled with poop and fart jokes. MacFarlane, Neeson, and Theron do well as leads and definitely save the movie from being absolute garbage.\r With a near 2 hour run time, The movie definitely gets a bit boring in the last 30-40 mins. I think a shorter run time would have done it some justice and made it a lot more bare-able to some viewers. Overall though, It wasn't that bad but there is a bit of potential wasted here."
    },
    {
      "rating": "3",
      "text": "As a fan of the western genre and also of comedies such as Blazing Saddles and Family Guy i was really looking forward to seeing this movie to switch off and have a few laughs. Unfortunately this film did not deliver on its promise. Most of the jokes in the trailer were the \"funny\" parts of this film, and if you didn't laugh at them, you won't like this film. The funniest character by far was Albert's (Seth MacFarlane) dad, who had the most laughs in our screening, apart from that there was hardly a titter from myself or any of the other audience members. Aside from a few amusing cameos and a great performance by Liam Neeson, this film is hardly worth the stupidly long 2 hour run time. I personally would save my money and re-watch Ted."
    },
    {
      "rating": "8",
      "text": "This movie was just as funny as any other movie that I've seen this year. Not the classic that Ted was but I did find myself laughing out loud several times. Seth McFarlane just can't get away with as much when he isn't hiding behind an animated character. That is what is the only problem with this movie. I don't imagine we'll see a sequel for this one."
    },
    {
      "rating": "0",
      "text": "Do not waste your time and money on this vulgar movie.  The attempt at racist humor toward Blacks and Chinese was beyond politically incorrect.  It's hard to believe any actor would stoop so low just to make a buck.  If you personally have high standards and good values do not see this movie and put that garbage in your mind.  I went with mu husband so I did not get up and leave although I should have so shame on me."
    },
    {
      "rating": "10",
      "text": "This was a great movie i loved it  you will to it was s funny i  laughed, all the way t o the end  it was not a dry eye in the house it will be a  Emmy award   winner"
    },
    {
      "rating": "7",
      "text": "Yes it has more fart and poop humor in it than I can really handle. Yes it's a bit long for a comedy (nearly 2 hours.) And yes it lacks the smart comedic timing and charm that Seth MacFarlane nailed in Ted. Did I still enjoy this film? Yes I did! I had a lot of fun watching it, because I went in not expecting too much from it, just as I did with Ted. MacFarlane definitely has his moments in this. However, there were a few times when watching him that made me miss him as the foulmouthed teddy bear in his previous film. The supporting cast also did well for the most part. Giovanni Ribisi was pretty funny as usual. Charlize Theron also provided some funny moments. Sarah Silverman felt a bit underwhelming, as did Amanda Seyfried. Neil Patrick Harris's stereotypical gentleman character managed to make me laugh (and his crazy mustache.) And lastly, Liam Neeson unfortunately also felt underwhelming as the villain. One thing I also enjoyed was a few unexpected cameos throughout as well as at the very end. Overall, it's a step down from Ted, but it still made me laugh out loud several times, and at the end of the day, that's all I really care about."
    },
    {
      "rating": "7",
      "text": "I read the reviews for this movie before I went, so I knew what I was expecting going in. Ultimately, the funny parts were in the trailers. There was a few new laughs, but they weren't all that funny. I liked the story, and it had its moments. It had a bit of romance in it, which I liked. There was wayy too much poop humor, and I wish there had been less of it. I've never been a fan of that kind of humor. Ted was much, much better, and I look forward to watching this on Netflix or getting this in the $5 bin, because it's not worth more than that."
    },
    {
      "rating": "9",
      "text": "After seeing some of the reviews on here i was not to hopeful about this film but is was brilliant really funny just as good as Ted cannot see the problem the cinema was in stitches well worth going to see and worth a lot better score than is has got at the moment ."
    },
    {
      "rating": "8",
      "text": "I just don't get how Seth macfarlanes work is attached to so much backlash and criticism. This movie is funny and entertaining. It's not going to set the world on fire, but how often do movies do that? Ted was also funny, not fantastic, but it was good. Does every movie need a gimmick to warrant its existence? I don't know why they say casting himself for the lead role was a mistake. I guess because I don't hate seth, I'm able to see the movie for what it was and enjoy it.\r Evidently I'm in the minority. I was pretty much the only one in a theatre of 30 or so who laughed throughout the movie. The others never more than chuckled."
    },
    {
      "rating": "7",
      "text": "A million ways to die in the west is stupid silly  and offensive and that's pretty much the point with lots of dark humour and a simple story a impressive performance from Seth macfarlen him self   The film work it takes the elements that are used to make family guy a strong tv show and puts it to film in just the right way if you are not a family guy fan this is not for you it deserves a better score than it has."
    },
    {
      "rating": "4",
      "text": "This is dumb. If you expecting fun, or even funny this is not the flick for you. I did find myself chuckling a few times at this or that, but between checking my watch and wondering \"is this ever going to end?\" For a comedy film, this is not a good trait. Seth is clearly made to be a writer not an actor. Although this was his movie he should have left himself out of it."
    },
    {
      "rating": "3",
      "text": "This movie was god awful, just plain god awful. It provided very very laughs or anything else even worth mentioning in a review. I don't even understand how Liam Neeson could even agree to a role in a stupid movie like this."
    },
    {
      "rating": "9",
      "text": "this could be the dumbest movie ever but that's why i like it its my favorite comedy of the year so far even though that's going to be over taken by several other movies that are coming out this year its still good fun"
    },
    {
      "rating": "9",
      "text": "I don't understand the many bad reviews.This movie was really funny although there were a lot of disgusting parts....still worth seeing for the Mustache song alone..."
    },
    {
      "rating": "7",
      "text": "No, no, no. 42 is not fair at all. This is a greater comedy then a lot tried lately. I suppose the low result on Metacritic  resides on the expectation left after Ted, a marked beat Seth MacFarlane scored on 2012 (62 on metacritic). For me Seth MacFarlane is the most misunderstood artist after Will Farrel. They are both masters on the art of trying. If you want a more common laugh, ok this is not a movie for you, then again try it, you might like it."
    },
    {
      "rating": "0",
      "text": "Seth MacFarlane's humor may be funny to some but I find that the constant sexual innuendos and direct commentary was far from being funny.  The movie was disgusting and was the first movie that my wife and I ever walked out on."
    },
    {
      "rating": "10",
      "text": "Well, I did hear that it was a bad movie but I honestly think it was an awesome movie. If you are a fan of \"Family Guy\" and/or love the movie \"Ted,\" then you are definitely gonna love \"A Million Ways To Die In The West.\" I loved that one scene where Albert Stark (played by Seth McFarlane) was doing the song \"Tarzan Boy by Baltimora.\" Not only that was funny but I loved the part where 2 Asians flip the bird. That made me laugh my ass off. So my suggestion, go and watch it."
    },
    {
      "rating": "8",
      "text": "I remember seeing this film in theaters the first day it came out and everyone seemed to be laughing/enjoying themselves. After re-watching it at home I still really enjoyed it, That's why i'm surprised so many low reviews are being posted about this movie.\rOverall I really liked \"A Million Ways To Die In The West\" regardless of annoyingly long name. It's comedy was hilarious, all the cameos were great and the story wasn't to bad. The movie does a good job at representing what living in the old west would really be like and how horrible it really was. You can also tell Seth MacFarlane had thought about the subject before. But bits of the humor in this movie is some of the most blunt, dirty and adult things I've heard in a movie this big since a something like Clerks 2. But the movie does drag on a bit, with it's run time almost 2 hours so prepare yourself."
    },
    {
      "rating": "3",
      "text": "okay well i have to say that it was a true disappointment how this turned out not original not funny and sure not good i definitely can't recommend that you see this one of the biggest waist of my time this year couldn't say that I really got any joy at all from this thing"
    },
    {
      "rating": "3",
      "text": "The entire movie is more like... \"A Million Ways to Prove How Bad Your Movie Is!\"... and the majority of that is suddenly the entire cast and directing."
    },
    {
      "rating": "9",
      "text": "Westerns are an essential icon to the Hollywood film industry. What came along with this was an overwhelmingly “toxic masculinity”. There was also a steady stream of racism, inaccurate portrayal of cultures, and popular gender roles were strictly abided by. This was the first Western in history to achieve the comedic goal of entertainment while breaking every commonly held cliche stereotype, and giving an accurate and often crude realization about the horrible place the West really would have been. The opening sequence shows a hanging party, wagon train, a patient suffering from a flesh eating disease, and finally a picture of Miss Myrtle Meriwether who was the real life Miss America in 1880. In just the opening sequence it has polarized everything we have seen of the West; both its beauty and its danger, but in a way that is totally unique to Hollywood films of the past. Albert Stark is nothing like a “cowboy”. He’s the guy who would probably die first. In fact, much of the movie is only possible because the audience expects to employ a sense of suspension of disbelief in order to watch anything Seth MacFarlane writes. This plays to his advantage in my opinion because no one expected him to do anything with this film except entertain. It’s in the middle of this entertainment that one eventually sees how a different kind of cowboy might have been born on the screen with writing of this type. Guys like Albert existed in far greater numbers than John Wayne or Clint Eastwood, but with the movies to glorify men beating each other up, killing Indians, and taking women as they pleased, who would want to be Albert? Our culture and knowledge has changed so much over the years, and where early writers sought to gradize a terrible place in time, MacFarlane dares to challenge that narrative and present both the romantic abilities of the time and the under-acknowledged sad realities. One scene in particular throws all of these aspects into the forefront. In this maybe 3 minute dialogue he explains everything that is absurd about the west from social aggression to hazards of common labor options to simply walking to an outhouse. What most people go to a Seth MacFarlane movie to see is the jokes.  They expect to be entertained and to laugh, and the film provides this throughout with plenty of crude and sarcastic humor alike.  However, unlike some other comedic films, there is also a rich opportunity to learn little gems of truth about the times. There is another scene in which Albert and his new found friend Anna, played by Charlize Theron, go to the county fair. The recurring dialogue is “people die at the fair”, and although it is done in a humorous way, each example is both true of the old west, and sadly still true in America today. The major difference sometimes come down only to hygiene and the cultural change of smiling in every picture (which is also a running joke throughout the film).The last major difference between the Hollywood Western and a Seth MacFarlane Western is the gender and racial normative roles of the characters. They still adhere to a realistic framework of the time, but in many places they highlight the diversity we see now as having probably existed, although on a smaller scale, during that time as well. Anna, the eventual love interest in the film is more of a “cowboy” than Albert. She rides with the most notorious criminal in the West, Clinch Leatherwood, played by Liam Neeson, and shoots better than anyone in town. Ruth, played by Sarah Silverman, is a prostitute in the local saloon, but “after work” has a loving and understanding relationship while also sticking to her Christian values. Cochise, played by Wes Studi, is the Indian chief who captures Albert but gives him the opportunity to speak, and once realizing he isn’t like the other settlers, brings Albert into the tribe and teaches him how to defeat his enemy, highlighting the obvious knowledge that Indian tribes indeed possessed at the time. Then, the last scene of the movie brings a cameo by Jamie Fox creating a parallel to the popular Tarantino movie Django. Fox walks up to one of the games at the fair called “Runaway Slave” in which participants are encouraged to target shoot cartoon depictions of slaves eating watermelon, and subsequently shoots the vendor and restating the line, “People die at the fair”. Earlier in the film Albert states that it seems a little racist, asking why it couldn’t be ducks or rabbits. The culture of the time thought it was perfectly normal sometimes mirroring the way throughout history blatantly racist themes have been widely accepted. This small scene also highlights the often unacknowledged reality that America, even though post Emancipation Proclaimation, were still a nation based widely on slavery and discrimination. I feel like this film was under appreciated at its release, but will be a benchmark for social accuracy in the future."
    },
    {
      "rating": "3",
      "text": "It's just not funny - you'd be better off just watching the trailer, which includes all the good parts (but not the undisciplined, excessive length, the excessive profanity, and the excessive excrement and urine \"jokes\").  If it were edited to, say, 90 minutes, and those excesses removed, it would rise in my estimation to \"just mediocre.\""
    },
    {
      "rating": "4",
      "text": "The film has a few laughs here and there but ultimately the film was disappointing. This comedy commits the ultimate crime of not being hilarious or very funny. There are a few jokes but not enough to the point where I could recommend this movie. This is disappointing because Seth McFarlene was written some great stuff such as Family Guy and Ted. The trailer was so alive and full of energy and outside of maybe one or two scenes I rarely got that. Instead I got a dumb comedy that at times was bad with a generic story that doesn’t lend itself well to satire and paper thin characters that aren’t interesting and don’t lend themselves to many jokes. I’m not going to sit here and tell you not to see it because film is subjective and comedy is really subjective as my Dad liked the film and my younger brother loved it. So if you are pumped for this film go and see it. However, unless you are a die hard McFarlene fan I’d recommend waiting until it comes out on DVD. Go spend/save your money as there are a lot of films out there, which look a lot better than this one like X-Men Days of Future Past and most recently How to Train Your Dragon 2. If you do choose to go see this film in theaters and you aren’t a McFarlene fan I only have one piece of advice, which is to lower your expectations."
    },
    {
      "rating": "3",
      "text": "What is there in this world that Seth MacFarlane doesn’t do? writer, actor, singer, voice of beloved animated characters. Most folks will know MacFarlane from his work on the beloved “Family Guy” television show. However, more folks (like myself), know him for creating the word of mouth sensation, and comedy blockbuster “Ted”. The little film that could, that film easily went on to become the highest grossing original R rated comedy of all time. So there is only one way to go...down.\rMacFarlane is back in the directing chair (and starring front in center) in his new Western Comedy, “A MIllion Ways To Die In The West” a lampoon on the whole western frontier, that severely overstayed it’s welcome. For roughly the first thirty to forty minutes, the film was consistent. Chopped full of witty one-liners and decent charismatic charm from MacFarlane. So much so, the script is ideally the result of its own downfall. Once the premise and characters get introduced, it’s kind of like the crew did not know where to take their film after the first hour. The plot is very thin, and with a cast such as; Liam Neeson, Charlize Theron and Amanda Seyfried, I had never seen more underutilized characters in a film. I wanna suggest the film for it’s fun spin on the old west, and believe me when I say the first forty minutes is pure comedic gold, consistent and funny. After that, nothing special to write home about.\r Albert Stark (MacFarlane) is a weak sheep farmer, forced to live in the backdrop of a harsh 1862 Arizona “wild wild west”, where in fact there are a million ways to die. From huge ice blocks crushing your skull...to your local pastor taking justice into his own hands. Even wolves devouring your local mayor..nobody is safe. After his gold digging girlfriend (Amanda Seyfried) dumps Albert for a local “mustache” salesmen (Neil Patrick Harris). Albert is determined to prove his worth and win his girlfriend back. That is until, a new girl breezes into town, (Charlize Theron) or “the big guns” and teaches Albert a thing or two. Little does he know. She is the wife of the most vicious gun fighter in the territory Clinch (Liam Neeson). Just another way to die in the lonely west.\r Typically, westerns are an unusual sell at the box office. So I uphold MacFarlane for taking a more risky approach to the genre and making it more widespread, and appealing. The film is shot decently and has a great musical score that only MacFarlane can present. The main problem the film suffers from (as many of them are) is the Run-time. The film staggers out at about two hours and ten minutes … I mean what?!. Comedies (such as this one) only need about an hour and thirty to get the message across. MacFarlane tries to jam pack too much “West” down your throat. Like a dying car, the start is so full of gas..and then runs out ..and coasts on goodwill ..from “Ted” and “Family Guy” ..which can only go so far.\r When discussing cast’s, this is one of the better ensembles in recent memory. Giovanni Ribisi, Charlize Theron, Liam Neeson, Sarah Silverman, NPH and Amanda Seyfried. Seth MacFarlane also showcases his one (of many) talents. However, when getting down to the basics, there is just too many of them to keep track off. Not to mention a boring running gag with Neil Patrick Harris character and his overzealousness with having a mustache. There is a few memorable cameos in the film, and some nice jabs at the west as well.\r “A Million Ways To Die In The West” started off with so much potential, the idea, premise and characters. When your watching (or reviewing) a comedy .. the main thing I can stress is, consistency. If the film outpaces itself, it will just eventually fall downhill. This is a hard feature to acquire, most comedies tend to find pacing hard. There are rare exceptions (The World’s End, Hangover and even “Ted”). MacFarlane has a unique vision and entices enough goodwill that should fill seats. The broad and raunchy humor will appeal to younger crowds, but adults may find it repulsive and idiotic. There needs to be a definitive line, and sadly “A Million Ways To Die In The West” never finds one.\r D+\r By: Nate Adams\r Directed By: Seth MacFarlane\rRated: R\rRun-Time: 130 mins\rStudio: Universal Pictures\rRelease Date: May 30th 2014\r Thanks For Stopping By."
    },
    {
      "rating": "4",
      "text": "Seth MacFarlane wrote, directed and stars in this meager attempt at a spoof on Westerns. He plays a wimpy sheep farmer who hates living in the wild country and is frustrated in relationships. More disappointingly, there's too much of his quest for love/courage and not enough pursuit of laffs. Some of the gags are clever, but too many fall flat or never even materialize. On top of that, MacFarlane lacks the gift of a comic actor (refer to the film's funny standout, Neil Patrick Harris to see how it's done). The rest of the supporting cast is not drawn with sufficient hilarity. While MacFarlane is a likable presence and the film has a good-natured tone, the potential for outrageous farce lands a dud. NOTE: Sit thru the credits for one final lame gag."
    },
    {
      "rating": "6",
      "text": "It's pretty good at delivering gags, but when it comes to actual plotting the movie falls short. The romance at the heart of it all is cliche. Whenever it tries to focus on building a relationship between MacFarlane and Theron's characters or on the threat of the villain played by Neeson the movie drags. Basically when it tries to be something more than a vehicle for laughs things get boring.\r The writers try hard to make MacFarlane's character likable and sympathetic. The problem is that those moments are at odds with what a douche he is throughout the majority of the movie. MacFarlane falls short when it comes to writing an actual plot, but he does manage to deliver some funny jokes.\r Outside of the vulgar sex jokes you can expect from an R-rated comedy there's a little bit of everything. It's at times smug self-awareness and dashes of slapstick can bring some laughs. It's at it's best when it's trying to as irreverent as possible. It can deliver some laughs.\r Unfortunately the plot weighs the movie down, acting as an anchor of mediocrity. The film is at it's worse when it's trying to be serious and actually make you care about what's going on. It can be a funny film, but you have to put up with the boring romance and conflict. If you are feeling up to slumming it a bit for some laughs then this is a decent watch. But no one is going to blame you for going with a movie that's more entertaining overall."
    },
    {
      "rating": "9",
      "text": "I **** loved this film, best comedy of 2014 yet and even maybe top 5 film!\rYes, you do have to like toilet humor, but hey, its a Macfarlane movie.\rI laughed than I did at all the other comedies I’ve seen this year, combined.\rAll my friends loved it 2, so disregard the bad critics and go have a Laugh :)"
    }
  ]
}