{
  "id": 2850,
  "title": "A Most Violent Year",
  "starring": [
    "Oscar Isaac",
    "Jessica Chastain"
  ],
  "runtime": 124,
  "genre": [
    "Crime",
    "Drama",
    "Thriller"
  ],
  "description": "A thriller set in New York City during the winter of 1981, statistically one of the most violent years in the city's history, and centered on the lives of an immigrant and his family trying to expand their business and capitalize on opportunities as the rampant violence, decay, and corruption of the day drag them in and threaten to destroy all they have built.",
  "releaseYear": "2014",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/861WY0triAjO0A6VWMhrZ6s7VFG.jpg",
  "categories": {
    "plot": 5.953488372093023,
    "acting": 6.446808510638298,
    "ending": 4.833333333333333,
    "soundtrack": 8.5,
    "cinematography": 6.714285714285714,
    "familyFriendly": 3.0,
    "funny": 6.0,
    "action": 6.583333333333333
  },
  "reviews": [
    {
      "rating": "5",
      "text": "This is a very well-acted film in which most of the (potential) action simmers below the surface. Not much happens, though. Jessica Chastain is stellar as always and Oscar Isaac is riveting ... it's a gritty, grimy set piece about gritty, grimy goings-on in the NYC of a few decades ago, but I would have liked more of a payoff."
    },
    {
      "rating": "0",
      "text": "A Most Violent Year takes place over a period of 33 days.  How does that make any sense?  Based on this bit of information, the rest of the movie really falls apart.  There isn't one single homicide in this movie.  Nobody intentionally hurts anyone else.  The cops and public servants are idiots.  And you end walking out going, wtf just happend...?  How is this movie titled, \"A Most Violent Year\"?!?!?!"
    },
    {
      "rating": "6",
      "text": "Overall, this movie was good although it had a couple of parts that should have made it to the cutting room floor. Am not generally a fan of the look of this movie (yellowish filter) and it didn't add much to it. OK, but could have been better."
    },
    {
      "rating": "7",
      "text": "I really enjoyed this period-piece thriller. Oscar Isaac and Jessica Chastain give a masterclass on acting in this gut-wrenching drama. The color palette and direction are just completely hypnotic. This is a great movie for fans of peerless acting performances!"
    },
    {
      "rating": "6",
      "text": "A Most Violent Year comes in like a lion and goes out like a lamb as oil truckers brave deliveries -like stage coach drivers of ye old wild west -in New York's lawless five boroughs. Solid perfs -  Chastain brings a new 'reality' to mob wives as Isaac simmers as her husband desperate to stay a goodfella against all odds - can't make this good film great which idles and lunges  then sputters  towards a mediocre third act."
    },
    {
      "rating": "4",
      "text": "Oscar Isaac and Jessica Chastain do their best to make for an intense movie and at times they succeed but the story is just too thin to feel the intensity throughout its long 2 hour length."
    },
    {
      "rating": "4",
      "text": "Wow, a major disappointment.  The pacing was simply way too slow and the storyline way too thin (and the characters not particularly sympathetic) for it to receive such glowing reviews.  Well acted and directed, definitely, with a few truly exciting, tension-building scenes.  But overall just not that compelling.  Don't understand why so many give this very good to excellent reviews.  A real snoozer, when all is said and done."
    },
    {
      "rating": "10",
      "text": "After only Margin Call and A Most Violent Year, J.C. Chandor is one of my favorite directors. The way he sets up and executes dramatic conversational moments without overplaying his hand is  remarkable. Isaac, Chastain, and Oyelowo are at the absolute head of the class, and they are each pitch perfect in this film. About halfway through the proceedings, I wanted so badly to have this movie serve as the pilot to a new dramatic series. But by the end I was so happy that it stands alone and does so so powerfully."
    },
    {
      "rating": "6",
      "text": "The titular year is 1981 in New York City. The owner of a fuel oil company and his wife (Oscar Issac and Jessica Chastain) struggle to grow their business, despite violent attacks on their trucks and an impending investigation. His lofty plan is to maintain his principles in the process, a conflict that dominates the dialogue. The movie takes itself very seriously and so do the actors. While their performances are so passionate, the sluggish pace slows the momentum. The dark cinematography is more murky than noir. Then there's the writing, which lays out the plotting in many predictable beats. What looks to be a hard-hitting crime actioner turns out to be an interesting, but not especially compelling character drama."
    },
    {
      "rating": "8",
      "text": "A polished, tense and ultimately satisfying film. The pacing is deliberate and slow, with a constant sense of unease throughout the film. Exceptional performances from the entire cast, with a storyline that is at first obscured, and then gradually unfolds to a sound resolution. The soundtrack is quiet and the cinematography is occasionally well crafted, with a few violent moments to punctuate the otherwise sedate visuals. A solid, thorough film. 7.98/10"
    },
    {
      "rating": "10",
      "text": "In the wake of the superb All is Lost and Margin Call, J.C. Chandor hits even harder this year. A Most Violent Year is a masterpiece in every sense. There are moments in this film you'd never imagine and they'll stay with you for weeks. Oscar Isaac is gradually becoming one of the finest actors of his time. You’ll find yourself missing Jessica Chastain each moment she leaves the screen--she is, without a doubt, brilliant. Bravo!"
    },
    {
      "rating": "8",
      "text": "A suspenseful, thoughtful period piece crime drama with excellent performances by Jessica Chastain and Oscar Isaac. While some of its underlying themes aren't always as fully developed as they could be, this shortfall is compensated for by its intriguing, intertwined plot threads and its avoidance of a simplistic narrative. One of the year's better and more underrated efforts."
    },
    {
      "rating": "4",
      "text": "Plodding at times. It just doesn't hang together. The acting is first rate, the writing is interesting but the pacing just goes along. Watch on DVD so you can fast forward because it is more an character study... a morality play."
    },
    {
      "rating": "4",
      "text": "This film is a visual delight for people who fondly remember the New York-based movies of the 1970's and early 80's -- \"French Connection\" comes to mind.  In the end, though, the story is too weak to make a great film.  The film's protagonist, Abel Morales, runs a heating oil company.  He wants to buy a derelict oil container port on the East River and refurbish it so he can import more oil at a lower price.  This is an eminently sensible, legal, and unexciting business goal.   The writer-director J. C. Chandor wants to make a thriller about corruption and venality in the heating oil business of 1980s NYC, but it's all so vague it's hard to get worked up about people engaged in a fundamentally worthwhile business: warming homes in winter.  In the end Morales' wife saves the day with a deus ex machina: she has been \"skimming\" money off the company's books into a rainy day fund -- money that they can now use to buy the container port.  Abel is horrified at this accounting trickery.  Except, how is it a problem that a company saves money to achieve a legitimate business goal?  Maybe there's some kind of tax issue.  Who knows, the film never follows up on the issue and anyway in the very next scene Abel tells his wife \"You know what, let's use that cash.\"  So much for moral dilemma.\r Great style, limited substance."
    },
    {
      "rating": "6",
      "text": "A misleading title, but overall a good story with some setting we seldom see. Carrying the weight of a potentially heavy movie is Oscar Isaac, who credibly portrays a rising tycoon (although he pretty much makes one facial expression the whole movie).\rIn an editing sense, the movie is made at the same pace it would have been if this were really 1981, convincing only at times and having some scenes drag out a bit more than they should. In a writing sense, it faults somewhere, with Abel's moral dilemma being unrealistically naive and a preposterous number of \"I know\"s in the script. Some other things are pushed as well: the Jewish business, for instance, and the \"nice\" bankers and police. However, the grey and wintry New York background helps establish a feeling of uneasiness and anxiety throughout, probably reflecting Abel's preoccupations.\r Maybe the plot could do with some more covering, because at times it introduces elements and never concludes them (for instance the iffy role of Abel's lawyer). But, as far as the rest goes (cinematography, story, acting, etc.) A Most Violent Year is a good film. Not a must-watch, but still in the 90 percentile of 2014 as far as big releases went."
    },
    {
      "rating": "2",
      "text": "A painfully disappointing movie. Jessica Chastain is the singular virtue of this film. The lead male character, whose moral calculations drive the plot, is neither charismatic, nor convincingly noble. I never rooted for him; I never cared. I kept waiting for the movie to \"start.\" After an hour, I began to figure out that the slow, heavy nothingness of the plot was actually the movie. This is as close as I've ever seen to a movie where nothing happens. Imagine your favorite gangster movie, then take out all the funny and interesting parts. That's \"A Most Violent Year.\" There is simply nothing here to care about.\r I went with a friend who really wanted to see the movie and asked me to go with him. When it was over, he turned to me and said, \"I'm really sorry.\""
    },
    {
      "rating": "1",
      "text": "I hated everything. So boring !!    First time in my life that i feel to say it .  I hope this film did not cost much because it does not worth much.   Better see something else."
    },
    {
      "rating": "0",
      "text": "Beyond boring, so thin you can see through it. Nothing is earned. Lots of false drama. Every problem is headed off at the pass. Often hard to follow, not because it's complex, but because it's so vague that there's nothing TO add up. It's another example of the emperor's clothes:  it's all atmosphere and no substance. And as the Village Voice so aptly said: There's not much violence, but is sure feels like a year."
    },
    {
      "rating": "6",
      "text": "Pros: well-acted, subtle, simmering, never melodramatic.  For a crime story set in 1981 NY, it sure doesn't come off as cliche.\r Con: it's a little slight or shruggable.  This is the type of nuanced story (a guy tries to keep his nose clean in a dirty industry and kinda sorta succeeds) that needs perfect characterization and charm, and it doesn't quite have all that it needs."
    },
    {
      "rating": "10",
      "text": "I've never seen another film that treats with as much directness and subtlety what is \"right\" about not just struggling to survive but also struggling to succeed.  Walking away from the theater I had the distinct feeling of just having been shown how conflicted leadership can be.  The depth of artistry and breadth of moral scope were impossible to shake off.  I have lived with this film since seeing it."
    },
    {
      "rating": "8",
      "text": "Surprisingly effective slow burn of a gangster thriller. Both leads are first class and the results are better than expected. Don't go thinking it'll be Scorsese levels of violence, because \"A Most Violent Year\" is more about the chess game being played out as a small businessman struggles to do what's needed rather than what's right. Highly enjoyable."
    },
    {
      "rating": "9",
      "text": "\"A Most Violent Year\" stars Oscar Isaac (\"Llewelyn Davis\")  and Jessica Chastain (\"Zero Dark Thirty\") in this story of NYC in 1981, statistically one of the most crime ridden years in the City’s history and of a self-made entrepreneur as he attempts to cope with it and the environment in which he works and lives. Skillfully written and ably directed by J.C. Chandor (\"All is Lost\", \"Margin Call\") with extraordinary photography by Bradford Young (\"Selma\"), and aided by the supporting talents of Albert Brooks and David Oyelowo, the film captures the true essence and the very heart of the City. Having been born near and totally familiar with the area where the story takes place, I can attest to how well the film captures the mood and feel of the Metropolis  and the life New Yorkers experienced at that time. It is always exciting to view a film where the writer/director, although one and the same, is able to succeed so well in both capacities. I give the film a 9 rating with special kudos to Mr. Isaac who, reminding the viewer of a younger Al Pacino, gives a most effective performance in this most enjoyable film."
    },
    {
      "rating": "3",
      "text": "Yet another pitifully over-rated little crime drama with no authentic script.  Very thin on story and a tremendous bore.  Like this director's last film, it skillfully masquerades by tone and camera work as something more rich and more important than it is.  There's nothing much here.  The plot is derivative of so many other mob and crime movies but with much lower stakes.  This is a glorified student film made by someone who is stealing from past great films rather than portraying any kind of real experience and it shows all the way.\rThe lead actor does his best Al Pacino and comes up short.  He looks like him, probably how he got his career, and sounds like him when he raises his voice.  What he misses is the original power and authority.  Chastain does an accent and a type a hundred other actresses have tread over before and it's the same old same old.  This film is a prime example of the boredom of watching actors act in a half baked scenario by a director fudging it as some kind of auteur unsuccessfully spinning much out of nothing at all."
    },
    {
      "rating": "7",
      "text": "One expects a lot of blood from a movie with such a name. Well, there is some, but definitely not that much. It is a crime drama with a lot of class but, in my opinion, not enough bang. The protagonist of the movie, Abel Morales , runs heating oil business in NYC in the 80's. It's a very competitive trade with a lot of violence. Abel is a very ambitious person trying to become a man that he could not be in his native country. His wife is a daughter of a mafioso but Abel rejects a violent approach to conducting his business even at extremely challenging times. This movie is about what it takes to stay in a competitive business, it's about pride, corruption, pursuing one's dream but most of all, it's about NYC in the 80's.\r All aspects of movie making are done very professionally. If it were a different genre I would give the film a bit higher rating."
    },
    {
      "rating": "2",
      "text": "A Most Violent Year = a mostly boring movie. The best compliment I can pay to this film is that it is not quite as boring as it rightfully should have been. Mostly this is due to actors making the best of the material and decent cinematography.\r Quite simply, this was not a story worth telling. The film is painfully slow and drawn out (one of the worst things you can say about a film is that it seemed much longer than it actually was) with very little action and, well, violence. That would all be fine if the plot was compelling in other ways, but it just isn't. The stakes are low, the characters are dry and one-dimensional, and there isn't much for the audience to actually care about or root for. Should we really care if some guy closes a deal on a piece of waterfront property to expand his heating oil business in 1981?\r Ultimately, the film mostly consists of Oscar Isaac sulking around, having conversations, and making uncomfortably-long eye contact with various people.\r Don't be fooled by the critical reception. This is apparently one of those films that critics will themselves to like, but which will leave most viewers perplexed by the praise."
    },
    {
      "rating": "10",
      "text": "A finely tuned character study that doesnt conform to genre expectations and instead transcends them.  Slow, brooding tension and character development anchor the film into an unforgettable whole."
    },
    {
      "rating": "9",
      "text": "Much better movie than the Judeo-Christian agenda driven Oscar nominees this year (immitation game, american sniper).\r Originality and a New York business conspiracy movie that left me guessing until the end. Al Brooks, Chastain and Isaac are great. Only complaint is that Isaac attempts to be too Pacino/DeNiro like at certain moments."
    },
    {
      "rating": "0",
      "text": "Hollywood anti gun crap.  We both walked out before it ended.  According to the brain dead perverts who produced this slop, women should be ashamed for being so stupid to want to defend themselves from the mental defectives who prowl the neighborhoods."
    },
    {
      "rating": "7",
      "text": "I'm so glad I didn't pay $10 in the movie theater. Good: Acting is very good (Chastain is the best), Story pretty good, Directing pretty good. Bad: Slow, Title is misleading, Characters not developed, oh... slow. This is weird, but I think this movie would be great for an \"Intro to Business or Leadership' class. Yeah, I know, strange.. but it really shows the nitty gritty of running a business and what it takes to succeed (not what the Director intended, obviously). I liked that the violence was 'petty' and real, I didn't want it to be a bloody \"Godfather meets Death of a Salesman' (lol), blam glam either. I'm glad it was a rental, though."
    },
    {
      "rating": "8",
      "text": "A definite slow burn, A Most Violent Year is an at times thrilling, but always riveting film. From the establishing shot, the first is entirely captivating and truly ropes you in as you become invested in the going's on of the characters. Interestingly, it feels like a gangster film with the way it is shot and the way in which things occur, even though it is not, which I believe to be intentional due to the way the characters toe that line throughout. The film is gorgeously shot, as anticipated. Truly, it has to be one of the most beautiful films I have watched recently and one of the best examples of cinematography this decade. Honestly, it is ravishing. The acting equals the brilliance of the camera work as well, thanks to stellar performances from Oscar Isaac, Jessica Chastain, David Oyelowo, and the rest of the cast. If Isaac does not become recognized as one of the best actors of this generation soon, I may cry. The same goes for director J.C. Chandor who has to be one of the best directors working right now. Following up top-notch films in Margin Call and All Is Lost with this flick is impeccable. I am eagerly anticipating what he puts together next and he certainly is a talent that is demanding to be focused on. One of the top films of 2014, A Most Violent Year flew painfully under-the-radar and demands to be watched."
    },
    {
      "rating": "9",
      "text": "The National Board of Review’s choice as their Film of the year turns out to be an auspicious one indeed, for this is a compelling and hypnotic modern day gangster yarn. Set in 1981 a year, apparently, where more crime was committed in New York City than at any other time, it is an intelligently written drama that is both thrilling and dazzlingly acted. Oscar Isaac is fast becoming the most exciting and versatile actor currently on screen and I’m sure that other people have noticed the similarities he bears to Al Pacino. He would certainly have been a great actor to have had around in the 70’s, still the most exciting decade for films. Likewise Jessica Chastain, still flying under the radar despite 2 Oscar nominations and countless films to her credit, is at her powerful best here. She may not have as much screen time as Isaac, but she makes every second count in her bid to be ‘deadlier than the male’. Bleak cinematography, low key music and unobtrusive, but firm, direction from J C Chandor contribute to a film of deceptively raw power. A welcome throwback and proof that they do make them like this ‘anymore’."
    },
    {
      "rating": "9",
      "text": "This film is the definition of an actors movie.  The performances by Isaac and Chastain are top notch and they make every moment of this film compelling. A"
    },
    {
      "rating": "8",
      "text": "I was really impressed with the slow, deliberate pacing of this movie.  Abel Morales' reluctance to engage in criminal behaviour complicates his position, as he attempts to adapt his own moral code to the looser morals of all those around him, from the DA, to his wife, to his competitors in business. Oscar Isaac's calm and quiet portrayal of this sombre character is compelling, especially when he finds himself arguing with his much more temperamental wife, played beautifully by Jessica Chastain.  The quiet constancy of Isaac's character means that when his temper flares, it's that much more intense to watch.  I loved the character's insistence on his own particular moral system and his attempts to hold himself and others to those standards."
    },
    {
      "rating": "0",
      "text": "This is a waste of time. The acting is not great and its story-line makes you fall sleep. Yes the most violent part is the scene where the guy hits the deer and then his wife executes it which was very stupid! Everything from the beginning to the end of the movie feels fake."
    },
    {
      "rating": "9",
      "text": "I was really impressed with \"A most violent year\". I loved the rhythm of this film, and the direction is excellent. The photography and the costume design are great, too.\rI think Oscar Isaac is becoming one of the best actors of his generation, he is brilliant in A most violent year. Also Jessica Chastain, both are impeccable, there is good chemistry between the two performers.\rI really enjoyed the silent and quite around this hard and complicated story. The chasing truck scene is already one of my favourites of the year.\rIt is slow, yes, but it is excellent. Worth looking at it."
    },
    {
      "rating": "7",
      "text": "If we presumably equates “violent” to “death”, we are destined to be mislead by J.C. Chandor’s third feature, A MOST VIOLENT YEAR, as we follow our poker-faced protagonist Abel Morales (Isaac), who has experienced a tough year with his oil company business in NYC 1981, negotiate his way with unscrupulous business competitors, a stalwart district DA Lawrence (Oyelowo), we assume in any certain moment he would start a killing spree in the Godfather style. This never happens, since the dogma of Abel’s action is that he will never do anything to jeopardise his business, which means he will never act like a gangster, he is not a felon (as he tells Lawrence in the coda), although Chandor manifestly imbues his crime-tale with a solemn layout and vintage colour pattern under the heavy influence of Francis Ford Coppola’s gangster school, not to mention Isaac is obviously channelling Al Pacino’s Michael Corleone but in a no-violence policy.\r keep reading my review on my blog, google: cinema omnivore, thanks"
    },
    {
      "rating": "7",
      "text": "Very well acted film, Isaac shows his huge talent through out and has turned me into an even bigger fan than I was before. Plot wise though, It could have been a bit better with establishing a time-frame of when things go down. Also it can be slow at times and a little tough to sit through.If you can manage to tough it out, I honestly think that you'd end up enjoying it as much as I did. Again, It's a very performance driven film and the cast, mainly just Isaac as he is in the spotlight from start to finish, totally delivers."
    },
    {
      "rating": "5",
      "text": "A mediocre film with a complex plot and polished performances by Oscar Isaac and Jessica Chastain that just wasn’t very interesting or dramatic. Nicely directed, but I am not sure why I should care about this situation or these characters. I can see now why it received so few major nominations."
    },
    {
      "rating": "2",
      "text": "A most unfortunate title for a movie that is actually very tame. The main character is an oil trader who must face some tough competition. The violence boils down to beating and threatening, which may be bad enough in real life, but certainly not what one would expect from such a title. It does not help that the pacing of the story is glacial and the movie seems to last forever."
    },
    {
      "rating": "8",
      "text": "J.C. Chandor (whose previous film, 'All Is Lost', I was also impressed by) takes his sweet time here, but the stylish and well-acted film held my attention in a tight grip throughout."
    },
    {
      "rating": "8",
      "text": "\"A Most Violent Year\" es una película astuta ambientada en el Nueva York de 1981 que,  según las estadísticas, fué el año con más crímenes en la historia de esa ciudad.\r Esta película se enfoca principalmente en como los empresarios tenían que hacerle frente a los problemas y crímenes que ocurrían en ese entonces, y así es como J.C. Chandor deja a un lado la supervincecia en \"All Is Lost\" para entregarnos otra historia interesante e intrigante, y con más diálogos que su anterior película, además de también contar con grandes actuaciones de Jessica Chastain y Oscar Isaac, con un vestuario elegante y una fotografía absolutamente fascinante."
    },
    {
      "rating": "3",
      "text": "This certain cure for insomnia plays as an adaptation of scenes scraped off the cutting room floors of Godfather and Goodfellas, plus one or two from The Wolf of Wall Street. The monotony is occasionally broken up by the film's only saving grace - the chemistry between Isaac and Chastain, who shine in their scenes together. Unfortunately, they are too few and far between, and this insipid drama shows just how little it has to say about any of the themes it touches on but makes no effort to try and explore. The lack of pace, action and plot development in the screenplay make A Most Violent Year, a most exhaustingly boring film."
    },
    {
      "rating": "8",
      "text": "One very down to earth movie. It is a crime, slightly suspenseful film with average pacing. It is also very interesting to watch. Entertaining and engaging - as all the events and interactions feel real and important. Quite well developed script. It has some violence but it is only to make things believable. I highly recommend it."
    },
    {
      "rating": "6",
      "text": "Such a slow-burn that it never makes a single flame but rather just glows like dying coals in a campfire. I love a lot of the cast. But it seems to me that the whole film was one giant McGuffin. This is a film that you merely observe rather than get absorbed by. There's not enough magnetism to keep one intrigued.  I am although glad to see it wasn't trolled too badly by other users, as it's not a bomb. Just something to watch once, take what you can salvage from it and move on quickly. Gonna have to give it a 6."
    },
    {
      "rating": "2",
      "text": "Anything over a 5 rating for this movie is ridiculous. Storyline was boring & predictable. Acting was average at best. Unfortunately I went to see it thanks to the overrating of others"
    },
    {
      "rating": "2",
      "text": "Where to start with steaming pile of dung, a most violent year feels like it takes a decade to watch, literally a long fart would be more entertaining than this movie i kept watching in the hope it may get better something interesting might happen soon but no that would be asking to much of a movie with the title a most violent year. don't expect any actual violence in this movie either by the way a guy gets his truck taken off him in one scene and in another a guy shoots himself thats the only thing close to violence  in it. Save yourself the 2 hours and just watch the last 5 mins thats the only time anything happens. It gets a 2 only because the main actor doesnt do a bad job with the rubbish hes given."
    },
    {
      "rating": "9",
      "text": "This was an excellent film. It was a beautiful portrayal of a not-so-beautiful time. The plot had the potential to become very slow, but the captivating performance of Oscar Isaac really kept the film going. If you were a fan of Oscar Isaac's performance in \"Inside Llewyn Davis\", you will likely enjoy this as well, but if you were not a fan, you will likely get bored."
    },
    {
      "rating": "8",
      "text": "It has the atmospheric quality and incisive dialogue of a Godfather movie, but cleverly avoids falling into that familiar territory by subverting the gangster film genre entirely- this a film in which the protagonist has integrity, and is both incorruptible and determined to see his efforts in the local oil industry come to fruition, all the while intent on being an upstanding citizen. Director J.C. Candor masterfully depicts the struggle between either doing things lawfully, albeit with more difficultly, or succumbing to corruption with ease. The film ultimately suffers from some narrative issues, and director Candor seems ill-suited to deliver the final punch that the movie necessitates after its somewhat lethargic pacing, but overall it is an enthralling, well-acted piece of cinema."
    },
    {
      "rating": "8",
      "text": "It's dark, slow paced, and gorgeously shot. Oscar Isaac does very well in this movie and so does Jessica Chastain. Cinematography was great. The script was great. This movie makes you think about life in, statistically, one of the most violent and crime ridden years in the United States. It's dark, and unforgiving. It's somewhat depressing, and if you're looking for a movie with action, drama, and a thrill ride, look somewhere else. Although, if you are looking for a movie with a story that gives you a thought to ponder on, with great acting, great cinematography, albeit with a relatively slow pace, then this is the movie for you."
    },
    {
      "rating": "8",
      "text": "Led by a typically committed performance from Oscar Isaac, A Most Violent Year is a dark, gritty crime drama, and one of 2014's best films. Isaac continues to establish himself as one of his generation's finest actors, and Jessica Chastain and Albert Brooks shine in their supporting roles. JC Chandor directs the film exceptionally, and while some may find the pacing too slow, it's well-worth watching for those who liked Chandor's previous films and are fans of Isaac and Chastain. Overall, A Most Violent Year is a great film with superb performances, great writing and expert direction. A most remarkable film."
    }
  ],
  "recommendations": [
    "good_time",
    "hell_or_high_water",
    "a_most_wanted_man",
    "beirut",
    "widows",
    "man_on_fire",
    "argo",
    "the_good_shepherd",
    "the_beguiled",
    "the_equalizer_2",
    "the_place_beyond_the_pines",
    "body_of_lies",
    "news_of_the_world",
    "sicario",
    "you_were_never_really_here",
    "blackhat",
    "american_gangster",
    "sicario_day_of_the_soldado",
    "bad_times_at_the_el_royale",
    "the_infiltrator",
    "drive",
    "a_history_of_violence",
    "bone_tomahawk",
    "reminiscence",
    "broken_city"
  ]
}