{
  "id": 2787,
  "title": "A Monster Calls",
  "starring": [
    "Lewis MacDougall",
    "Sigourney Weaver"
  ],
  "runtime": 108,
  "genre": [
    "Drama",
    "Fantasy"
  ],
  "description": "A boy imagines a monster that helps him deal with his difficult life and see the world in a different way.",
  "releaseYear": "2016",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/eNTalDnE6AcFKghdvws2ckguYWC.jpg",
  "categories": {
    "plot": 7.396551724137931,
    "acting": 8.037037037037036,
    "ending": 7.636363636363637,
    "soundtrack": 5.0,
    "cinematography": 7.142857142857143,
    "familyFriendly": 6.0,
    "funny": 3.0,
    "action": 8.0
  },
  "reviews": [
    {
      "rating": "9",
      "text": "A Monster Calls is the rare movie geared toward a younger demographic which refuses to pull an emotional punch. The movie explicitly states that the protagonist, Connor O'Malley, is “too old to be a kid and too young to be a man”. The introductory tagline is the perfect way to relay the film’s tone to the audience. From the brutally honest acting to the gorgeously animated “stories”, A Monster Calls allows raw emotion to emanate from the experience. Magic on the screen happens due to the unique specificity of our hurt hero. The fantastical elements found in a typical family movie organically merge with the painful reality of adulthood. For example, a fight will begin building up in Connor and the anger will call out the monster. The monster is never a simple vicarious outlet for the young adult. Instead, the monster is a well-executed manifestation of perceived guilt towards a deeper truth. Liam Neeson’s monster revels in the humanity of the moment while also holding a magnifying glass up to it. Life continues to get worse for Connor and each appearance leads to a gradual slip of harsh reality. Refreshingly, A Monster Calls never hides that uncovering important personal insight is a painful process. The climax makes up for one of the most touching revelatory moments in modern cinema. The value of the film is revealed in how both children and adults in the audience gain a better understanding of the inherently personal nature of grief. The way we deal with a loss can come across as something else entirely for ourselves. A wide release of the film will hopefully begin to kindle in an audience a desire for introspective cinema. In a sense, specific scenarios are able to paradoxically tap into a universally human truth. Movies like A Monster Calls show a better alternative to the next soulless generic blockbuster movie."
    },
    {
      "rating": "10",
      "text": "This film emotionally ripped my heart out. A Monster Calls was gripping from start to finish with smart story telling and a fantastic cast. Lewis MacDougall should be under awards consideration. This film surprisingly hasn't gotten the award worthy praise it so richly deserves.  My first 10 for a 2016 film comes in 2017, but the wait  was well worth it. A"
    },
    {
      "rating": "8",
      "text": "\"A Monster Calls\" was an exciting, moving, and interesting film, the story was good, the special effects, the very good performances, was a very good collaboration that made Hollywood with Spain."
    },
    {
      "rating": "10",
      "text": "I went into this film not expecting much, a good story and hopefully a good film. What I received was a film that absolutely wrecked me. The acting, the cinematography, the sound design, and the story all come together here for me. By the end, it had become one of my all time favorites. Judging by other reviews it doesn't land emotionally for some. But if it does for you, enjoy one of the best films about loss ever put on screen."
    },
    {
      "rating": "7",
      "text": "A Monster Calls starts slow, even predictable, yet its heartbeat grows assuredly, culminating as an emotionally wrenching and visually dazzling education in childhood grief."
    },
    {
      "rating": "10",
      "text": "I just spent the last hour and 50 minutes watching a child talk to a giant tree voiced by Liam Neeson and it was the most imaginative and heart-breaking movie I've seen all year. A young boy calls upon a monster to help cope with his mother's illness. Starring Sigourney Weaver, Felicity Jones and Lewis MacDougall. Superb performances particularly from Lewis, acting just doesn’t get any better than that. Despite the stunning visuals and stories in this movie it's not exactly suitable for young children and a tough watch at times for everyone else but it's flawless, original and highly recommended."
    },
    {
      "rating": "10",
      "text": "aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaim crying"
    },
    {
      "rating": "9",
      "text": "After this movie was over, I was speechless. The whole theater didn't say a word. I think that explains enough what kind of an experience this movie gives you. This movie grabs you by the throat and doesn't let go. I read the book, and I was hoping that the movie would be a similar experience. It did. The book made me cry my eyes out and the movie as well. It's just a great and compelling coming of age story of a boy who's mother has cancer and doesn't know how to deal with it. The acting performances where all great. The standout, by far, is of course Lewis MacDougall, who plays the character of Conor. This kid can act for sure, he was amazing and gave a chilling performance. Liam Neeson as the monster was a great casting choice. He gave the emotional dept to the character which I felt in the book. The CG of the monster was flawless and looked awesome. I liked the way Juan Antonio Bayona directed this movie. There was attention to every detail. Like the editing, most people don't pay any attention to this, but it was greatly done in this movie. And you see that the director understands the story and what it tries to tell us. But I do have an issue here. It's a minor one. In the book the relationship between Conor and his mother is much more broaden then it is portrayed in the movie. I wanted them to have more screen time. Because then the end would have been more of an impact then. I'm not saying the ending is bad. They also added a scene at the end which wasn't in the book. I think that scene brought the whole movie together as a whole. And to bad they cut out Lily, the friend of Conor in the book. So yeah, this movie was really amazing and I recommend it to everyone."
    },
    {
      "rating": "9",
      "text": "I find that the best kind of films end up being the ones you approach knowing little about, with average-low expectations - that was my initial approach to 'A Monster Calls', and boy was I wrong.A film that plays out as a fantasy-drama, a coming-of-age tale and a family melodrama, 'A Monster Calls' opened as any typical coming-of-age drama does; introductions to the characters were made and we were given a brief glimpse into their daily lives, however as it progresses, we are suddenly faced with a complex and emotionally-stirring plot that piles on layers of heartfelt drama, intriguing character development and gorgeous CGI and cinematography that accompany the tale of a young boy who evades his complicated daily life by escaping to a world of fantasy tales told by the titular monster, voiced by Liam Neeson, in yet another CGI role made perfectly for his booming voice (after success as Aslan).There are many I have known who have seen this film and have afterwards shed a tear, and rightfully so, the story is one of the most moving and encapsulating I've seen in a long time, bringing in elements of dark fantasy to compliment the main plot. The visuals throughout are stunning in all mediums, beautiful cinematography, visually-striking CGI and gorgeous animated watercolour scenes. All-in-all, 'A Monster Calls' might just be the ultimate \"small\" movie of 2016."
    },
    {
      "rating": "4",
      "text": "A 12-year-old boy (Lewis MacDougall) is bullied at school, and to make matters worse, his mother (Felicity Jones) is dying. A giant anthropomorphic tree (voiced by Liam Neeson ) appears to tell the boy fables, which are animated in a lovely water color style. Although I heard a few sniffles in the theater, I found this film excruciatingly cloying. The atmosphere was morose from start to finish with nary a bright moment. While the subject matter is certainly sad, the film's eccentric story, listless pace and relentless gloomy approach result in a lack of any real emotional connection. EASTER EGG: Look for Neeson's foto in a quick pan across a table."
    },
    {
      "rating": "3",
      "text": "I have an umbelievably negetive bias against this movie. The same kind I have for bridge to terabithia. For starters I went in blind into this film with only a trailer. To get the positives out of the way, good image, good acting, good effects. So, 3 for the objective things. Back to the reason I dislike such films. I was expecting to see a more dramatic monster movie. Unfortunately its only the dramatic part thats true. The monster is some sort of an alegory or imaginary friend. To the film's credit it was not bait and switch, like, terabithia was. I had hoped that this movie was going to be a monster movie even partially. It was not. My feeling towards it would be no different if I knew exactly what the film was about."
    },
    {
      "rating": "1",
      "text": "Trite and boring movie. Was a waste of almost 2hrs of my life. The main kid is terrible. Neeson voice as the actor gets annoying after awhile. Terrible story and nothing going on. I gave it a 1 for the CGI effects."
    },
    {
      "rating": "8",
      "text": "Guillermo del Toro's protege, Juan Antonio Bayona, continues to deliver high-quality emotional gut punches with his latest work, A Monster Calls. An unfortunate box office failure earlier this year, the film is a heart wrenching tale of a boy named Conor (Lewis MacDougall) whose mother Lizzie (Felicity Jones) is dying of cancer. With a hard-nosed grandmother Mrs. Chandler (Sigourney Weaver) accompanying them and providing Conor with what will be his new home, a neglectful father who lives in a different country (Toby Kebbell), and bullies at school making his life hell, Conor is visited by a monster (Liam Neeson). Arriving to teach him three lessons in life and to elicit Conor's darkest secret from him, A Monster Calls is a film about a young boy learning to cope with the loss of his mother, his own anger for how he is behaving, and how he desperately tries to grab control of something around him. Unfortunately, with everyone else collapsing all around him, there are practically no alleys to turn down but the one opened by the monster. Moving, heart-wrenching, and an absolute tearjerker, A Monster Calls is yet another score for Bayona's brand of emotional cinema set against fantastical backgrounds (The Orphanage).While the film's depiction of a mother dying from cancer and how it impacts everyone around her is undoubtedly manipulative, Bayona picks at the viewer's heart strings so effectively and with such authentic emotion, that we hardly ever notice his hand. Gracefully put together and nimbly jumping between its hard-hitting themes about loss, grieving, and overcoming the death of a loved one, with its more adventurous and creative look at coping with a fairy tale watercolor backdrop, A Monster Calls is an excellently written and directed film that really finds a way to keep its eye on the prize. No matter what happens in the film, this is a film about a boy facing the toughest thing he has ever faced. His denial that it is happening. His rage about it happening. And finally, his acceptance that it is happening and looking ahead to how to heal and grow from the experience.Visiting with the monster everyday at 12:07 AM, Conor must face the deepest secret he has within him and one that is all too relatable: he wants it to be over. The agony. The waiting. The pain. The anger. The suffering. The anticipation. Yes, for it to be over means that his mother Lizzie must die, but he wants it to be over. In the end, we all know this feeling. It is, honestly, one of the tougher elements of coping with the loss of a loved one, because it is tinged with regret. A Monster Calls demonstrates this perfectly with how this anger and guilt felt by Conor over how he wants this stage of his life to end manifests itself in his everyday life. From hating his grandmother and destroying her house, to rejecting his father out of anger, and to beating up his bully and sending him to the hospital, Conor copes with rage. Yet, though the expression it outwardly, it is focused entirely on himself. He loves his mother. The two have been best friends for as long as he can remember. She cuddles with him watching movies and when he is scared at night. She taught him to paint. The two are inseparable, but she must go now and he cannot accept that he wants her to go just for him to stop feeling the pain of waiting for her to go. It is a conflicting feeling and one that can destroy even the strongest of adults, let alone a teenager.Yet, he must learn to not just overcome the impending death of his mother, but his own anger at himself. Through the stories, he learns that people are not all good or all bad, that believing something can happen is the first step to it actually happening, and that crying out for help is a sign of strength and one that will get him noticed, but to be noticed is not everything; one must be able to recognize their own pain themselves as well before it gets out of hand. It is alright to be mad and to let yourself be heard, but you cannot let it consume your entire being. Even worse, you cannot let that anger be focused inward to the point that you write yourself off as a bad person, as young Conor had done to himself for his own secrets. Each human being has two sides to them and can simultaneously be good and evil. This applies to not just Conor in the film, but also to his grandmother and father. For the former, she is losing her daughter to cancer. She has already lost her husband - with the established fact that Lizzie coped in the exact same way as Conor - and is struggling to find a way to accept that she will lose her daughter too. She takes out her anger in various ways and does boss Conor around, but she loves him and her entirely. His father loves him as well, even if things are not perfect. Yes, he re-married and has a new daughter, but he still loves Lizzie and Conor. It is just that things could not work between them and now his job has him in Los Angeles."
    },
    {
      "rating": "7",
      "text": "Though \"A Monster Calls\" may come up a bit short for me in the pacing department, J.A. Bayona and co. more than make up for it by simply bringing this challenging premise to life in the first place. You have such a complicated story here - one that weaves the structural conventions of a coming-of-age tale together with the more abstract conceptual stylings of a Brothers Grimm tale. Cap that all off with some truly meaningful words on the grieving process and modern familial relationships and you have the makings of a genuinely powerful experience."
    },
    {
      "rating": "6",
      "text": "Can you suffer cliches? If you can, then read on.The movie has two worlds that interconnect.First is reality. Connor O'Maley is a pale pipsqueak single son of twelve. He has a sickly single-parent mother. Did you count the stereotypes? There are some more. He has a dad, living in America who is, of course, mostly unreliable. He has also a nasty grandmom, who seems more concerned with keeping her house in order than supporting her only grandson(as far as we can tell.) And Connor has no friends. And Connor is also the target of a bully. What is the cliché count by now?Second is fantasy. Connor has strange dreams. He calls forth a monster(so it claims).It comes to tell him three stories during three nights and then Connor must tell him the fourth. Of course there are connections between the first and the second world, but unlike the cliché infested real world, the fantasy is far from straight forward and trite. In fact the stories follow unpredictable patterns and the lines are not that easy to follow. The three stories are told through animations and those work well. Eventually it gets all wrapped up at the end which isn't cliché but more realistic than you might expect.All-in-all a movie with a nice well told story supported by good acting but hamstrung by clichés, overdone dramatic music, boring cinematography(overuse of slow cam shots and close-ups) and obvious tweaked scenes(watch the weather turn sour all of a sudden near the end so the impact of the drama is exacerbated by the rain). Some will see past it, others will flee the theater. A mixed bag therefore."
    },
    {
      "rating": "9",
      "text": "First thing's first, this isn't quite the family-geared film the trailers and tv spots would lead you to believe. That being said, if you think that you're prepared to bring any of your children to this film, be prepared for some almost inevitable tearjerking to occur, because this film is as emotional and heavy as they come. Nonetheless, it's also such and extraordinary, beautifully-made film that will tug at the hearts of many as it certainly did mine and my family's. The cast does an exceptional job as well with Lewis MacDougall in the lead giving what I'd consider to be the best child performance of 2016. Felicity Jones, Sigourney Weaver, and of course Liam Neeson as the monster round out the excellent supporting cast. Overall, to reiterate, it's a beautifully-made film, but be prepared to get somewhat emotional, because I honestly can't imagine anyone with a heart not getting at least the slightest bit choked up by this film!"
    },
    {
      "rating": "8",
      "text": "While some plot elements are heavy handed and don't contribute much to the plot, J.A. Bayona's A Monster Calls is a haunting, necessary, and introspective dissection and exploration of grief that uses fantastical elements to illustrate complex emotions. Much of the film is open to interpretation, which is what makes it special."
    },
    {
      "rating": "9",
      "text": "Didn't know much about this movie going in, I was thoroughly impressed nonetheless. Cinematography, acting and overall feel of the story all felt seamless and was incredibly well done."
    },
    {
      "rating": "3",
      "text": "A crazy kid with mummy AND daddy issues invents a monster to deal with his mothers death. This movie is incredibly dull and predicable. Sigourney Weaver's accent was kinda funny though."
    },
    {
      "rating": "6",
      "text": "Related media: The film is based on novel of the same name but I have not read it.>What's it like?: An artistically-talented boy (Louis MacDougall) has to deal with a cancer-stricken mom (Felicity Jones) at home, bullies who beat him up at school and nightmares of losing his mum in a sinkhole at a church/graveyard. At 12:07 am, an old yew tree in the middle of a cemetery turns into a giant (Liam Neeson) and tells the boy that it will tell him one story per night, for three nights, after which it demands that the boy reciprocate with one story of his own. It is a film about growing up but a more central message of the film is a spoiler and would not be mentioned here.>Pros:>1. The film tells a touching story about dealing with family member that is about to die. It would greatly appeal to those who have experienced this in real life.>2. There was generally good acting all around.>Cons:>1. Two major distractions are the casting of Sigourney Weaver as the boy's grandmother and Toby Kebbell as the boy's father. Clearly, the film has an English setting. While MacDougall and Jones acted like the English, Weaver and Kebbell, an American and a Brit in real life, only spoke with neutral accents. It is rather likely that Weaver's and Kebbell's characters should have spoken with English accents in the film, or have explanations of why they did not, in the form of their characters' backgrounds. That they did not, felt strange and it was a major distraction.>2. The premise that a monster would tell you three stories and then demand that you reciprocate with one is somewhat silly. It was not as if the boy needed to cross a bridge and needed to pay with gold or needed to give a password, as in traditional fairy tales, and let's face it, this film is a fairy tale.> 3. Not all three of the stories told by the monster were particularly special. The third story was told too quickly and was not memorable. >4. This film does feel like a cry-bait. It would not work on those who have not lost loved ones before.> How would the different age groups rate it?Children: AverageTeenagers: AverageYoung adults: AverageMedium age adults: GoodOld adults: Good.>My rating: 3/5 (no half scores). Save your money and watch it on TV."
    },
    {
      "rating": "8",
      "text": "A Monster Calls surpasses all of its competition in the all too crowded family film genre, through its imaginative storytelling devices and a devastating emotional punch that resonates long after you leave the theatre."
    },
    {
      "rating": "9",
      "text": "A MONSTER CALLS REVIEWLearning how to deal with your monsters is a part of life.This movie touches on so many themes, however manages to work them through in a fantastic fashion, so none of them seem tacked on or unnecessary. It is a very much of a coming of age movie at it's core, however it is not a classic tale of it. Themes that are worked through here are genuine, and heartfelt, especially with the performances of Felicity Jones, Sigourney Weaver and of course Lewis MacDougall who truly portrays an adult trapped in the kid's body perfectly.To speak of performances we have four key players here. Sigourney Weaver and Felicity Jones play the grandmother and mother of the main character with such grace and different approach to dealing with the situations that occur, that makes the struggle seem most genuine. There's no dramatic overacting in scenes where people would expect there to be, there's no bolsterous claims of grandeur where one could expect lessons for our main protagonist, everything is natural, and very few movies of this nature can say the same. Most of them force on the melodramatic or abuse or other things but not here. Here Weaver and Jones show they are both masters of their craft, and make sure nothing is overdone.Which brings me to Lewis MacDougall, whose this is a first feature film that he needs to carry. And does he carry it... If this kid decides to have a future in acting, he is a star in the making. Lot of kid actors came and went, but the range Lewis brings to this role is incredible, and again in not such temper  tantrum type of acting that some of the kid actors like to bring to their roles, and over act whatever emotion needs to be put on screen. His scenes with Weaver and Jones are heartfelt and genuine, and his scenes with the Monster played by Liam Neeson are  done in such a way that you would think he was in front of green screen his whole life. His entire performance is genuine, and is a huge part why this movie was as successful as it is.And then there is a titular Monster. It is voiced by Liam Neeson, and whose intentions are not completely clear from the very beginning of the movie, but his interactions with Connor (MacDougall) are genuine and Neeson most certainly brings a heartfelt performance to the role.This movie is directed by J.A Bayona, who has previously brought us Orphanage a small spanish horror movie in a wake of movie such as Devil's Backbone from great Guillermo Del Toro, and the Impossible about the 2004 Indian Tsunami, that had everything going to be over sentimental, but never reached that point due to Bayona's directing. He brings both of qualities to this movie, his visual flair, as almost Gothic environment is portrayed so beautifully here, and his mastery of how to weave a web of storytelling, is on a full display here.Another big succesful part of this movie is the music, which brought the life to this story and to these characters in such a fashion that it almost became a character by itself.Overall the movie was a very pleasant surprise, as usual the month of January is not known for producing a great works of art, but if this is a new trend, with showing more independent almost movies such as these, you might see me in the cinemas more often.3.5 out of 4 stars."
    },
    {
      "rating": "5",
      "text": "A mother seems to be dying, a boy is sad. He awakes the monster that wants to tell him three stories and hear one in return. Starring Lewis MacDougall as the boy, Felicity Jones as the mother, Sigourney Weaver as the grandmother and Liam Neeson as the voice of the Monster.There's are no more Tolkien or Potter movies left to show this year but every self-respecting holiday season needs a larger-than-life fantasy epic, so we have been given \"Fantastic Beasts and Where to Find Them\" and \"A Monster Calls\" instead.I have commented on \"Beasts\" already (see my November 16 post) which is probably better of the two. Both are basically visual effects oriented family movies but \"Beasts\" aims lower on intellectual level which allows it to deliver with more ease on spectacle level. \"Monster\" tries to be both a thoughful story – think along the lines of \"Little Prince\" – and effects show. It does give us both, and both kind of work too, but the result feels more artificial than heartfelt, sadly.To the director's credit, J.A. Bayona (\"El orfanato\", \"Lo imposible\") is adept on creating suitably ominous atmosphere and getting a solid performance out of newcomer MacDougall as a boy driven to the edge by hardships in life. All the other characters are more like part of the decorations, so no need to stop on them.But surprisingly for a near two hour movie, storytelling feels rushed almost all of the time, so the characters and events lose most of the impact they could have had. The result has all the emotional heft of a good-looking music video. It's watchable enough but not really going places.\"Monster\" has somewhat unusual approach which may work for its favor; animated sequences are cool, too. But in the end it's not more memorable than any other effects-laden family-oriented adventure."
    },
    {
      "rating": "10",
      "text": "I feel this movie is under rated. the plot seems to be so naive and childish, but deeply it seeks important subjects which have not been mentioned in many movies. I extremely recommend this."
    },
    {
      "rating": "9",
      "text": "Based on Patrick Ness´s brilliant novel, this movie shines in its own. The screenplay, the performances, the directing and the soul make this movie remarkable. It will melt your heart, and I only say this to quite a few movies."
    },
    {
      "rating": "3",
      "text": "Meh!  I thought it would be better with the cast but it wasn't.  Super depressing.  I do believe the last 5 minutues was very well acted."
    },
    {
      "rating": "5",
      "text": "Has some great visuals and an interesting premise but the story is very unsatisfying."
    },
    {
      "rating": "8",
      "text": "A Monster Calls is the new expedition of Juan Antonio Bayona, who has been jumping from one film gender to another; and this time is a kid’s fantasy adventure. The surface of the plot is very cliché, a boy with troubles at home, doesn’t fit in school and bullied by his classmates. But as you descend in the story, all the cliché vanishes. The narration is from a point of view that maintains objectivity and prevents premature sentimentalism with the protagonist. The construction of the story is coherent with the revelation of info, which grows up towards the climax. The significance of the film is unique and visceral, hits hard of viewer’s emotions; you reach a catharsis impressively depressive but reliever, identical to the real world, a complex outcome for a fantasy picture. The dark photography with sad colors and touching music, contribute to the aura of the plot. The performances are very moving by their incredible realism. And the animation of the tales is captivating, with a style and color that match the art direction of the live action movie part. With all these, the plot turns out to be excitingly original. Bayona should definitely stay in this gender, which he has demonstrated to dominate."
    },
    {
      "rating": "7",
      "text": "An alternate way to confront the reality.Based on the British novel, made by a well known Spanish director. This film might remind you the titles like 'Finding Neverland', 'Where the Wild Things Are', 'Neverwas' et cetera, but still it is unique. Particularly for the message it carried out. Many lines were awesome, inspiring for those whose world are crumbling down. Emotional, as well as one of the best recent children's films.The story of a boy whose mother is severely ill. He starts to have weird dreams, following, an appearance of a tree-monster from the nearby cemetery. The monster is to tell a few tales and at the end of it, he has to tell the truth about his nightmares to him. So as the days go by, it becomes more challenging to him to confront the reality. He can't run away from all, but to face it and those are the remaining narration.While being a kid, they believe every fantasy tale have narrated to them. Even a picture of those tales would influence to have an imagination in their daily life activity. This film does not hide anything from the viewers just to bring a breathtaking twist at the finale. So, you would know what's happening, but why, is the puzzle to solve. Even that is not a hard nut to crack. Though the purpose of the film is to reveal how some children cope a tragic event in their life, like perhaps the film 'Before I Wake', with misunderstanding the words said by the grown ups to them. This is really a wonderful film for kids, as well as for adults. I Hope you won't miss it.7/10"
    },
    {
      "rating": "9",
      "text": "A fantastic film! I didn't really have much anticipation for this movie up until about a month ago. I was absolutely blown away on how great it was. An terrific cast and a touching story with a boy tying to cope with his mothers cancer. The movie was lot more touching than I expected it to and I think a lot of people will be able to relate with this film. A movie that should at least be considered for best picture."
    },
    {
      "rating": "9",
      "text": "Absolutely magnificent, this is a superb adaptation of the novel by Patrick Ness that faithfully recreates the visual and thematic complexity on screen. The performances are exceptional, the pacing is carefully constructed, but I give a strong warning to parents that this is a very dark tale. Whilst it is written and created ostensibly for a young audience, like the novel this is a confronting and sophisticated exploration of grief, pain and loss which doesn't coddle the viewer. The stunning cinematography and creature design are beautifully realised, and this is sure to elicit a powerful response from any audience. 9.33/10"
    },
    {
      "rating": "9",
      "text": "This is a beautiful and extremely well-crafted film and it is interesting regardless of age. The only thing people should be aware before heading to the movie theaters is: this movie is reeeaally saddd! People were literally crying in the movie theater! But it is a good movie with a good message, so don't avoid it, just prepare your spirit before watching it."
    },
    {
      "rating": "10",
      "text": "This was an excellent movie. Very moving and very sad, but it had a feel-good ending. I highly recommend it."
    },
    {
      "rating": "10",
      "text": "Without a doubt one of the best films this year. The acting in this picture really great and creates an emotional rollercoaster of real life and fantasy. The psychological effects on a young boy as he struggles with the realization his mother is terminally ill. This film is truly a delight."
    },
    {
      "rating": "9",
      "text": "Heart warming drama mixed with fairy tale fantasy. Outstanding job of Eugenio Caballero, particularly in fantasy sequences. Mighty cast, specially Liam Neeson as the monster."
    },
    {
      "rating": "0",
      "text": "Réalisée par l’Espagnol Bayona, voici une autre daube dont il a le secret et la recette infaillible, surtout depuis que le gars tourne à Hollywood : malgré des moyens, des effets spéciaux et une distribution attrayante, il chie une merde qui n’avance pas et nous fait chier à mort comme pas possible à la manière de son précédent film ou plutôt sa précédente bouse avant celle-là, « The impossible » qui était -déjà- une merde à dormir debout.Alors ici, évidemment, on comate bien avant « minuit » et difficile de ne pas s’endormir, car ce Monsieur Bayona est un spécialiste de la sieste et de la lenteur. Il sait aussi nous abrutir avec son histoire à la mords-moi-le-noeud pour les mômes plus ou moins autistes comme ce gamin qui parle à un arbre… qui parle. Alors que sa pauv’ môman est malade, oh mon dieu mon dieu, c’est affreux… Sigourney qui s’est égarée ici pour la gamelle joue sa grand-mère mais rien à faire, ce môme est trop taré, si vous voulez mon avis !C’est tellement lent, tellement lénifiant avec cette ambiance avariée de conte de fée foireux à la petite semaine et en plus et de surcroît, c’est tellement prétentieux que ça en devient navrant et ridicule ! bref, inutile d’épiloguer, c’est de la daube de chez daube sans aucun intérêt mais de la daube qui pète volontiers plus haut que son cul : on aura tout vu ou plutôt le moins possible de cette stupidité ronflante."
    },
    {
      "rating": "9",
      "text": "I am sure i had to read the book. After watching the movie \"Speechless\" is the word. I have seen it as THE MONSTER HAS RECEIVED A CALL FROM AN OLD FRIEND \"the sick mother\" ASSISTING HER SON TO ACCEPT THE IDEA THAT HIS MOTHER ... WILL NOT BE AROUND ANYMORE. anyone agree? By the way Liam Neeson turned to be and Icon in commentary. Too much previous experience takes him to the top"
    },
    {
      "rating": "10",
      "text": "The intro and credits immediately establishes J.A Bayona as a master of his craft, beautiful cgi, animation and editing.  The production values are super high, like Spielberg caliber.  Just looking at the gorgeous photography and animation is worthwhile.  The animation has a wonderful watercolor look, reminds me of Vanillaware (Odin Sphere) games.  I was a little confused by a kid who didn't want to be ignored by bullies, usually introverted people are adverse to attention, especially abuse."
    },
    {
      "rating": "8",
      "text": "A grandiose and underestimated film, this A monster calls. With the voice of Liam Neeson and an excellent interpretation of a very young Lewis MacDougall, who here plays a very sad and adorable character at the same time, this fantasy is able to strike under any point of view: plot, style of storytelling, acting and a moral really sad, but also very significant and important: if you really love someone you have to learn to let it go.To be seen and reviewed by your children, but not only, even for adults because you never stop learning."
    },
    {
      "rating": "6",
      "text": "Not only all the stories are messy and dark but they are awfully clean as well, this will tuck you right into sleep.A Monster CallsBayona is so focused, so invested in his characters that he might not even consider where they reside in. And frankly, he shouldn't, definitely not if this self-centered vision of his pitches a good assumption land for us to flex our muscles. The writer and director J.A. Bayona is famous for creating his views on the horror genre. Yet, I never felt him scare me. Yes, he does keep the camera up close to the events occuring, no matter how cringe worthy. And on that note what I think he does best is blend the practicality of a situation along with his fictional innuendos, that then pushes to a train of scary thoughts.For neither in this film, nor in Jurassic Park: Fallen Kingdom, could he water me down with his brilliant camera work. But in Lo Imposible, his silent pitches on the screen are impeccable. Hence, all the cliched emotional impact that we are spinning in, actually works more than the monstrous therapy sessions; which by the way is more engaging and fun to go through. And this is where you know Bayona's tricks are working. Just watch Sigourey Weaver take in all the damage done by Lewis MacDougall.Your heart starts skipping as you are unaware of where all this has been or is leading towards. And after that act, the film grows clear. Similar to all the tales narrated and all different tracks going parallel-y this one remains the crux of the theme, and whispers everything in that bubble. More to it, the close up shot works also on amplifying the performance and their ticks to get us completely immersed in this fantasy world. A Monster Calls and you have to answer, that part has always been the subtextual gist of all the horrors, in here it is a loud- like in bold and in capitals- metaphor."
    },
    {
      "rating": "8",
      "text": "Un Monstruo viene a verme es una poderosa mezcla de la más increíble fantasía con la más cruda realidad: la historia de como una familia poco unida se enfrenta a un cáncer que uno de los miembros de esta padece. Para ello Connor, el joven protagonista cuenta con un monstruo que cada noche le visita a la misma hora para darle una importantísima lección de vida. Visualmente imponente con una cámara en constante movimiento, quizás es demasiado frenética por momentos, a lo que sus escasa duración (sobre 1h y 40min) puede resultar arrolladora. Destacar el espectacular reparto y la calidad de todas las interpretaciones así como la increíble labor de doblaje del el Monstruo por Camilo García. Muy recomendada."
    },
    {
      "rating": "9",
      "text": "I found this an engrossing and quite atmospheric watch. Its sombre and potentially upsetting at points, due to the main themes present and I wouldn't recommend it for younger children to watch on that basis as its about grief.There is some pretty impressive CGI featured and good performances from Lewis MacDougall, who plays the main character, Conor (he sounded very convincing in terms of his fear and anger about what was happening) and also Sigourney Weaver who portrays his grandmother (who isn't named) and Felicity Jones, who plays his sick mother. There is a strong element of fantasy present - I suppose there is an allegory or symbolism present in the titular monster representing Conors emotions at times. It is perhaps a somewhat thought provoking watch - its certainly not a bad film and so I'd recommend it on that basis."
    },
    {
      "rating": "7",
      "text": "Beautiful film but not great entertainment.  Very touching and sad story beautifully filmed but I can see why American audiences largely ignored this film.  I think some ppl will have gone in expecting a different kind of movie and then being disappointed.  I was glad to have seen this movie but would not see it again and would not recommend it for most people, though some will see it as a special lovely gem."
    },
    {
      "rating": "10",
      "text": "Mukemmeldi resmen bayildim. Puanim 10/10"
    }
  ],
  "recommendations": [
    "the_road",
    "the_florida_project",
    "alpha",
    "i_kill_giants",
    "bambi",
    "the_impossible",
    "the_age_of_adaline",
    "stand_by_me_doraemon_2",
    "the_boy_who_harnessed_the_wind",
    "the_hunt",
    "20th_century_women",
    "leave_no_trace",
    "the_book_thief",
    "brave",
    "kubo_and_the_two_strings",
    "the_water_horse",
    "her",
    "five_feet_apart",
    "lion",
    "call_me_by_your_name",
    "the_book_of_henry",
    "thoroughbreds",
    "captain_fantastic",
    "midnight_special",
    "me_before_you"
  ]
}