{
  "id": 4786,
  "title": "A Most Wanted Man",
  "starring": [
    "Philip Seymour Hoffman",
    "Willem Dafoe"
  ],
  "runtime": 121,
  "genre": [
    "Thriller"
  ],
  "description": "A Chechen Muslim illegally immigrates to Hamburg and becomes a person of interest for a covert government team which tracks the movements of potential terrorists.",
  "releaseYear": "2014",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/6B76Z5Ct758RfKFoFg37skVRiMp.jpg",
  "categories": {
    "plot": 6.090909090909091,
    "acting": 6.786885245901639,
    "ending": 6.333333333333333,
    "soundtrack": 7.0,
    "cinematography": 7.0,
    "familyFriendly": 3.0,
    "funny": 5.0,
    "action": 6.714285714285714
  },
  "reviews": [
    {
      "rating": "8",
      "text": "\"A Most Wanted Man\" stars Philip Seymour Hoffman, Rachel McAdams, Robin Wright and Willem Dafoe in this intense spy thriller based on the novel by John LeCarre. The screenplay was written by Andrew Bovell, directed by Anton Corbijn and remains true to Mr. LeCarre’s literary work. Knowing that this was Mr. Hoffman’s last film makes the viewing bitter sweet for one watches this great actor perform as only he can and yet with the knowledge that we will never see him in anything new again.\rThe length of the film, over 2 hours, should not be a deterrent for every scene is valuable and necessary as good editing helps the viewer watch and understand this otherwise complicated plot. The film geta and deserves an 8.5"
    },
    {
      "rating": "8",
      "text": "Overall, A Most Wanted Man was satisfying as all hell. Like I said above, we rarely get spy thriller movies like this anymore and this one definitely filled the big empty hole for this type of movie in my life. It was interesting, exciting, intense, and the perfect amount of thrill to make a money spy movie. But going back to it all, Philip Seymour Hoffman delivered as he usually does, almost bringing a tear to your eye as we now know that he leaves us with one his best performances ever."
    },
    {
      "rating": "9",
      "text": "A wonderful, intelligent movie - not the dumb shoot-up, blow-up, kill-all flick of today. Thank God for it. Almost better than the book. Great acting, directing and cutting. A MUST SEE, if you like some food for your brain. The only bothersome point for me was how my old hometown Hamburg was portrayed... dirty, dreary and covered in so much graffiti that one, who doesn't know it any better, has to wonder what kind of \"dump\" this actually most beautiful, greenest, classiest and livable of all German cities is. Yes, graffiti is a problem here... but not to the extent presented in the movie with not an inch of a wall, house entrance and staircase visible without some scribble on it."
    },
    {
      "rating": "9",
      "text": "The work of intelligence case officers is really accurate according to at least 20-30 books I’ve read on it. That alone is worth it, because no other films seem to get that right (John le Carre was in MI6 so maybe that’s why).   But also, Philip Seymore Hoffman was amazing. His character was crazy real, and the worst/best thing about it is you kind of felt like it was really him. As one reviewer said “ And the two of them, actor and character, fit so tightly into that abused and collapsing body up on the screen...”  which is dead on in my opinion.\r But I don’t know why in the hell they cast Rachel McAdams, she’s so terrible and it took me out of the film at times, not just her \"accent\" but acting as well, although it is mainly a casting problem I think. They should have cast Jessica Chastain instead like they were considering."
    },
    {
      "rating": "8",
      "text": "A thinking person's movie. Slow and methodical but I'm guessing the way it really happens. No vampires, aliens, giant robots, just great acting and the reality of the war on terror. Sad the see the last of Hoffman. Will miss his brilliance."
    },
    {
      "rating": "8",
      "text": "This is one of the best spy movies I have ever seen.\rNo crazy conspiracy theories, no incredible coincidences, no shootings. it is not a James Bond kind of a movie. Just routine work of a German intelligence officer with its ups and downs. But even though it seems slow, its grip on audience becomes tighter. Incredible performance of leading actors, notably of late Philip Seymour Hoffman. What a great actor we lost recently!\r The only thing which I found somewhat annoying was that music was over-dramatic where it did not have to be.\r Otherwise, close to a perfect movie."
    },
    {
      "rating": "8",
      "text": "This one is not for everyone due to the pace at which it goes, so if you do not have patience, stay away from \"A Most Wanted Man\". However, if you appreciate great acting and a slow burning, incredibly intense plot, this is the one for you. Philip Seymour Hoffman is stellar and it almost brings a tear to your eye realizing that this is his final role. Robin Wright, Rachel McAdams, and Willem Dafoe, are also all really good here, in addition to the supporting cast. It is a true actor's showcase here. The story is admittedly slow, but never ceases to be entirely engrossing and truly had me from the very beginning. It was a twisty and turny ride, especially the ending, which is fantastic and unexpected. \"A Most Wanted Man\" is a departure from the usual spy thrillers of today that seem to always involve excessive action sequences. Here, it is dialogue driven and on the back of a great script, direction, and acting, is a resounding success. I truly hope this one can get some more buzz so that Hoffman can get another Oscar nomination, because he deserves it for his work here."
    },
    {
      "rating": "7",
      "text": "Totally contemporary, A MOST WANTED MAN feels like a brooding and sad remnant from the cold war. But no. This is today. A MOST WANTED MAN portrays a world in which good/evil and right/wrong are lost. All is pointless, empty, banal but then, why fight so hard to save the world when in fact no one cares. A MOST WANTED MAN is a poignant and sad statement of our time."
    },
    {
      "rating": "9",
      "text": "The polar opposite of Zero Dark Thirty.\r The picture opens on a title over a wall being washed by the tide.  It announces that the planning for 9/11 took place in Germany without interference, and this must never be allowed to happen again.\r So much for the stakes and the motivations.\r There follows a film with virtually no action and only as much dialogue as needed to advance the plot.  There's a little chit chat, some exposition, and then waiting.  Lots and lots of waiting.  We wait silently watching the characters wait silently watching other characters make up their minds.  There is one sequence which may have been 5 minutes long, with 4 of them silent.  There is a sense of things happening in real time.\r However, the longer we wait the more we learn, and the more we learn the more we care.\r Hoffman's character is the polar opposite of the bombastic CIA agent he played in Charlie Wilson's War.  Don't come expecting that, or the ripe bluster of The Master.  Everyone speaks quietly in Hamburg where the film is set, and Hoffman perhaps the most quietly, muttering in a strange Germanic accent, but also very invested, and more and more so as the story winds tighter and tighter.\r We could do worse than have this as the final performance of Philip Seymour Hoffman.  He goes out on a high note, but an understated one as well."
    },
    {
      "rating": "8",
      "text": "A taut, suspenseful thriller with a terrific collection of performances by a top-notch cast, including undeniable proof of why we'll miss Philip Seymour Hoffman."
    },
    {
      "rating": "7",
      "text": "good political spy-terrorist thriller thats not too hard to follow. great performances from hoffman and wright. slow moving film, but intriguing and never boring."
    },
    {
      "rating": "8",
      "text": "Hoffman plays the role of spy agent superbly, as he does in all his films. Without him, the movie is OK, but his presence adds a dimension to the film that is consistent with a LeCarre character. He knows exactly how to play the forlorn agent in all its aspects, from ennui to excitement to extreme disappointment. The other actors are just the players in this film. The ending is so unexpected that you have to quickly think about what has happened. Put it all together and it really is a fine spy story."
    },
    {
      "rating": "8",
      "text": "I was prepared to pronounce A Most Wanted Man boring and confusing for about the first 20 minutes. But soon after, I was hooked, and felt invested in everything that was going on. And there's nary an explosion to be seen in the entire film. What a refreshing thing it is to have another adult movie about spies. The ending is shattering, the characters all too human, and the film highly worth watching."
    },
    {
      "rating": "10",
      "text": "Hits on all cylinders. Acting, directing, cinematography, writing. Dimensional characters, tautly acted, against a great story. You can tell there was craft in the directing and cinematography, but it doesn't call attention to itself, rather choosing to serve storytelling."
    },
    {
      "rating": "9",
      "text": "What held my attention during this film was the utterly compelling and completely believable performance of Phillip Seymour Hoffman – and I generally have fallen asleep in the middle of recent Le Carre adaptations.  Certainly the film simplifies what I am sure was an even more complex story than in the original book, but I thought the direction was stylish and kept things interesting and moving along. I also thought the entire cast gave fine performances. The audience was silent and for once I didn’t have anybody crawling over me to get a popcorn refill, but then the people around me looked like readers (a smallish theater in a megaplex was almost full). For once, a Le Carre adaptation I thoroughly enjoyed."
    },
    {
      "rating": "5",
      "text": "The appearance of an immigrant in Hamburg spikes the interest of a secret anti-terrorist group headed by Philip Seymour Hoffman. Thus begins a tedious, low-key operation to discover the man's true threat. Based on a novel by John le Carré, this is much more about patient procedure than action or chases. Every scene plays out slowly with no tension and lots of looking. Hoffman creates a mildly compelling character, but the ever-present cig and swig is an unoriginal way to signify a flawed character. There's some interesting intrigue, but the pacing is so slow that it tries your patience."
    },
    {
      "rating": "8",
      "text": "A wonderful, understated movie and a great performance by Philip Seymour Hoffman.  I wondered why they would have put him in a role where he was supposed to be German but he carried off well.\r Not a Bond movie full of ridiculous stunts and explosions but a Le Carre movie full of what real spy work looks like presumably.  If you are hoping for a lot of action and sex, this is not the movie for you.\r A fitting final role for one of the best actors in recent memory."
    },
    {
      "rating": "2",
      "text": "It was a snoozefest.  Steer clear of this one.  The acting was fine, but the story put me to sleep.  It is a shame that PSH's last movie was this.  Do not even waste your time when this goes to video.  Just avoid this movie."
    },
    {
      "rating": "2",
      "text": "I am convinced this movie received generally positive reviews for two reasons: Le Carre wrote the novel (and reviewers decades ago decided to love everything he produces regardless of the quality of his books; is he still coasting on The Spy Who Came in from the Cold after all this time?), and it came out shortly after the death of Philip Seymour Hoffman who stars in it. It certainly did not get positive reviews for the quality of the story, which is the single most lead footed, plodding, predictable spy story I have ever seen. I'm all for dialogue and I was glad to sit down for a spy story that would be free of the routine cliches of guns and disguises, poison pens, and so on. But I did not expect the story also to be devoid of complexity, devoid of depth of character (one of the things literary thrillers are supposed to have), devoid of surprise, and mostly devoid of suspense. After the first forty-five minutes or so I realized the movie wasn't going to go anywhere. I gave up on it half a hour before the end, but then watched the last half hour the next morning. Nothing much happened. It has about as much plot and character development in its two plus hours, as you'd expect in the first 20 minutes of any other movie.\r Yes the acting was very good and it was fun to hear a Tom Waits song at the end over the credits. But without a story acting's got nothing to do. And sitting through a whole movie for a two minute song at the end, isn't my idea of a good time."
    },
    {
      "rating": "7",
      "text": "I am a big fan of the books by John le Carre. Having read the book going into this movie it was interesting, knowing a large part of what was going on to watch it all play out. The person I was with had not read the book. They got lost. And its easy to understand why. A lot of films these days spoon feed major plot points and throw in a reminder every 2 minutes anyway. Not this movie. However they could have done a better job adding context to key things. Like why the banker goes out on a limb for Issa. Or why the protagonists boss/competitors choose to burn him at the end. All it would take is a 30 second \"news clip.\" These were things I would not have been able to follow if I hadn't read the book. The cinematography also had a style that is a bit sloppy. Often I found myself looking for something of meaning in the background which the camera spent so much time dwelling on. Mostly there was none to be had.\rPhilip Seymour Hoffman gives an excellent performance. He looks awful. You can tell his real life drug issues are taking their toll. But it completely suits the character.\rWillem Dafoe gives an unusually nice and likable performance.\rAll in all its a good movie that could have been a great movie. I place that clearly on the director. Though they gave it their best shot."
    },
    {
      "rating": "7",
      "text": "A cerebral movie, not for fans of big explosions and special effects. Assumes the viewer knows enough about Islam to understand at least \"Allahu akbar\" and \"Insha'Allah\". The plot development suggests vanity and ego motivated some characters who would in real life would care about nothing but money.\r Philip Seymour Hoffman's performance was suburb, even putting aside respect for the dead. Willem Dafoe was also outstanding. Most of the other performances were above average. I agree with other reviewers here that Rachel McAdams was miscast and outclassed."
    },
    {
      "rating": "0",
      "text": "Perhaps I'm a bit harsh with this rating, but it's to warn away folks from seeing this\r On a scale of up to 4 stars, I'd probably give it 1.5 stars or so due to the good acting and occasionally clever story\r There is virtually no action (except for a foot chase, Philip Seymour Hoffman playing the piano, a document signing, and a fender bender), no character development, very little detail such as to explain the motivations and any backstory for any of the characters.\r I regret seeing this.\r If you liked Tinker Tailor Solider Spy, you probably would like this since both films are completely devoid of substance and excitement (though this movie isn't quite as terrible as Tinker Tailor).\r I don't think I will ever read John le Carré book or see a movie based on one ever again.\r I recommend only those who like John le Carré and also liked Tinker to see this one, otherwise I'd avoid at all costs"
    },
    {
      "rating": "0",
      "text": "Absolutely awful film, the worst I have ever seen.  Almost everyone at the showing left the cinema before the end of the film.  Extremely slow and boring."
    },
    {
      "rating": "7",
      "text": "This is a slow more deliberate film that I give high marks for the performances and an unconventional ending that worked for me.  The pacing did take me away from the film at times, but the film still garners a low 7.  B"
    },
    {
      "rating": "6",
      "text": "A film that kept me going, gave me humanity: drama, some comic relief and subtlety. Philip Seymour Hoffman gives it his all for us, in his final real performance. Then, at the ending, all fell to the deepest level of bulls**t I can imagine. And I would like to note on the performance of Rachel McAdams; FInd an actress with a nice ass who can act, or have a somewhat decent accent. The subtlety ended, so did all the relics of a good spy film. All crashed to f**king pieces. Collapse"
    },
    {
      "rating": "7",
      "text": "Based on a John le Carré espionage novel of the same name, A Most Wanted Man follows a German intelligence officer in Hamburg  as he attempts to prevent terrorists from attacking his city. The plot is woven with many unexpected turns and relies on realism to distinguish itself from its counterparts.  This focus on realism is a refreshing change from the normal thriller template, but it in turn has its own set of drawbacks.\r The foremost of them being pacing. The film drags on at a brutal pace. Although it attempts to create slow burning tension the result accumulates to a very slow two acts. To further enunciate the pacing problem, A Most Wanted Man never feels like if failure does come much would be lost. Various scenes attempt to create feelings of tension but these are mitigated by lack of a consequence for failure. Simply put, very little seems to be on the line.\r A Most Wanted Man also has a slew of redeeming qualities. Take the late Philip Seymour Hoffman’s performance for example. His chain smoking, German accented portrayal of the fictional Günther Bachmann is both engaging and undeniably cold. His performance exemplifies true emotion and is one of the best in his outstanding career. The direction is also very polished and stylistic; and the score greatly complements the somber tone of the film.\r Although Its focus on realism slows down the pace; this gives it time to propel the emotions of its lead characters. A Most Wanted Man excels through its poor pacing to become a worthy entry in the thriller genre."
    },
    {
      "rating": "6",
      "text": "Very slow and the ending is unconvincing.  Ending is really framed on the basis that the Western intelligence services are not only incompetent and lazy (which may well be right), but venal and vicious.  However, Phillip Seymour Hoffman is - as - always a delight."
    },
    {
      "rating": "6",
      "text": "Good but not that good ,\r It's a 90's kind of movies when people have no problem wasting time watching 2 hours movie but these days things are getting pretty fast\rso its better to represent your story in a decent limited time .\r When the story is short it is unlikely to force the movie to be that long stuffed with unnecessary scenes 122 min is way too much I felt board more than once 90 min for that kind of story is more than enough adding some more thrill and\rsoundtracks effects suspense to attract the audience .\r I thing the director could've make more out of it but after I checked\rthe kind of movies he did I'm no longer wondering why ... With all due\rrespect but you'll know what I mean after watching the movie .\r Thanks"
    },
    {
      "rating": "6",
      "text": "PSH is great in his final full performance, but the movie as a whole slows down after about the hour mark.  If you're into the idea of this film, you should just go rent the very interesting one-season drama \"Crossing Lines\", which is a similar \"team\" approach to Euro-crimes and terrorism."
    },
    {
      "rating": "10",
      "text": "This was my favorite film of the year so far. No CGI, no high-octane action, just a great plot that is superbly acted by every single one of the cast.\r The story isn't fast paced, but it develops well and keeps your attention from start to finish. The cinematography is just perfect and really adds to the film, the lead actor has a very commanding screen presence and you really get drawn into his world and the story that develops around his character.\r This film shows a completely different character for a spy compared to Ian Flemings James Bond, but one equally as enjoyable to watch on a big screen. I thoroughly enjoyed this film, and would watch it again on blu-ray."
    },
    {
      "rating": "8",
      "text": "Rather slow paced but intriguing. Nice spy story about a guy at the end of his career still doing what he does best, even after failing (or having been made to fail) so many times. Good movie!"
    },
    {
      "rating": "10",
      "text": "A brilliant espionage thriller with a solid screenplay/adaptation by Andrew Bovell and a great performance by Philip Seymour Hoffman.Anton Corbijn's directing was subtle as well as the cinematography by Benoit Delhomme.Truly a good film, one of the most underrated films of the year"
    },
    {
      "rating": "5",
      "text": "Slow burning spy movie. Reminded me of the Good Shepard mostly.\rKinda felt bad for the guy caught in the middle (refugee/inherence gainer).\rIn summary, if you like spy movies, see it if you can in theaters. Otherwise, wait for it on rental or online."
    },
    {
      "rating": "4",
      "text": "It's a visually pleasing film with a helluva lot to say about the current state of global intelligence and an admirable Philip Seymour Hoffman performance, but there's also this overall sense of mundanity about \"A Most Wanted Man\" that I just can't help but call attention to. True, the business-as-usual tone sure helps establish the characters as being familiar with the world at hand, but without any urgency in almost any character within this film, there's simply nothing for me to latch on to as a viewer. Like some other recent le Carré adaptations, \"A Most Wanted Man\" plays things frustratingly close to the vest, with a slow-burning pot of a plot that never quite boils over into anything memorable. Sprinkle in a couple of spotty German accents here and there and you've all but lost me. Again, director Anton Corbijn may have achieved a noteworthy aesthetic here, but I'm more of a \"colorful narrative and characters\" kind of guy myself. Not necessarily a bad movie per se. Just a film that I desperately wanted to like that ended up not reciprocating in the end."
    },
    {
      "rating": "6",
      "text": "Intriguing film with good performances and an interesting story. Despite the slow pace you will be involved in it enough to enjoy it from start to finish. The final scenes are probably the best in the film, and show you the reality some of the people who work in secret services live."
    },
    {
      "rating": "5",
      "text": "This film starts off with an interesting thriller vibe of \"who really is this man?\", but ends up losinf up half way through. Performances seem fine, with Hoffman beinf \"pretty good\" but in mo way stand outish. The story is basic but good, and is executed pretty well. It does lose steam a bit of the way through and drags a bit, but the final scenes are brilliant. They are extremely tense, just as you want secret service type undercover movies to be. It is also bittersweet and gives you a good assumption of what some goverment intelligence agency actually run like. Pretty decenr movie, worth a watch."
    },
    {
      "rating": "8",
      "text": "For those who find plenty of \"action\" in a creative mind seeking covert ways to protect the innocent from those who would harm.  As virtually always, the movie fails to capture much of what was in the novel, but it also highlights many important themes that are at work today in our intelligence community."
    },
    {
      "rating": "8",
      "text": "Complex but very well acted story of international intrigue. It really makes you miss Phillip Seymour Hoffman and his immense talent (rest his soul). This film is also well shot with fabulous editing with a strong script and solid direction."
    },
    {
      "rating": "8",
      "text": "A Most Wanted Man was better than I thought it would been. It's very sophisticated, which makes the movie good, and with Hoffman starring, it was very good."
    },
    {
      "rating": "6",
      "text": "A Most Wanted Man is based on a novel by John le Carré. I found the movie kind of slow, but yes it was different and some parts of it would keep you intrigued. If you liked Tinker Tailor Soldier  Spy, you would surely like this one. I should warn you that it is not for the people who are expecting some hardcore action or some adrenaline pumping thrill. What you can call it is, a simple spy thriller with a beautiful screenplay. The performances are good. Hoffman as Günther steals the show portraying a spy who is the brain behind everything.  He is intelligent, he is smart and sometimes he surprises you. His character is portrayed as a complex personality. You would find that spies are not always 007-ish as portrayed in the glamorous spy movies. Dobrygin plays the role of illegal immigrant Issa very well.\r The story is quite intriguing only for those who like such movies. The complex geopolitics after the 9/11 attacks has been portrayed very well. The line which will catch your attention is that everything is being done “To make the world a better place to live.” And unfortunately this is also the irony which is being portrayed in the movie. The end is kind of surprising and I bet that you would like it. But yes it would also leave you in a dilemma. So just sit back and enjoy the show that is if you are a fan of a slow spy thriller with some awesome screenplay and direction."
    },
    {
      "rating": "5",
      "text": "I found this movie interesting in that there seemed to be surreal undercurrent almost as though someone was out to prove that seymore Hoffman is in fact a better actor then the woman he talks to throughout. Also the dialogue alone could be about some gender war if your not paying attention which in my opinion is what surrealism is. i mean the camera seems to choose hoffman over the female and its almost as though i can feel that women are wondering why he gets so much camera time.. especially in the bar"
    },
    {
      "rating": "8",
      "text": "Martha Sullivan: \"I don't care who he is ... he is the most wanted man!!!\"\r The story is about a half-Russian man, brutally tortured, shows up in Hamburg's Islamic district and demands his father's fortune - made through nefarious means - both German and U.S. agencies take a close interest.\r A most wanted man is one of those films that a lot of people will be mix with. Some say \"It's a smart thriller, what a thriller should be.\" And some people will say \"It's a dull dull film with not enough action in it\". But for me it's average film with fantastic directing and brilliant performance from Philip Seymour Hoffman and rest of the cast in the film.\r Philip Seymour Hoffman was just spellbinding in this film as always, as he is a fantastic actor that will be sadly missed. The way the movie is shot, it sucks you as a viewer in it's deep, dirty, detective feel to it which I always like in movies like this. The rest of the cast like: Rachel McAdams, Grigoriy Dobrygin and Willem Dafoe all did great job in their roles.\r But my problems with the movie is the writing, at times it can be dull and a bit recycled from other films, but at times it's really good and really new, so am a bit split with the writing in this movie. The movie does slow down at times with it's character's doing uninteresting things or the movie drags out a scene that could have been cut out.The ending to me could have ended better. It's not the worst ending I've seen, because I've seen some god awful endings in the past, but this one isn't all that bad.\r Overall this movie may drag at times, but it's cast and directing saves the movie for me making it sold thriller movie."
    },
    {
      "rating": "6",
      "text": "A Most Wanted Man has some notoriety for being the final film released before Philip Seymour Hoffman's  untimely death, and it is fitting that it is also recognised as one of his stand out performances.\rThe film revolves around a simple enough premise.\rA contemporary set thriller, in Hamburg, Hoffman plays Günther Bachmann, the leader of an underfunded, underappreciated and beleaguered anti-terrorist squad. Things kick off when a young man is spotted on CCTV and recognised as the son of a dead Russian war criminal, who the authorities believe is a Jihadi sympathiser and therefore a direct threat.\rBachmann, however, is a more pragmatic man, believing that it's better to use blackmail etc (techniques he knows the German authorities can never legally condone) to get the people at the 'bottom' of the chain, to help catch and/or blackmail those further up. Bachmann recognises that his approach is disconcerting  the post 9/11 'world', especially if there's the possibility he's wrong, and the Russian is there simply to blow something up, or escape further into the West.\rWhat follows is a well conceived, two hour long, character driven thriller.\r As a film though, it's not brilliant. Based on the John Le Carre novel of the same name, it's strange that a complex novel seems unable to be turned into a coherent screenplay. It's too slow paced, there's no real drama, all the peripheral characters aren't fleshed out and, worst of all, the basic 'message' of the book (that of extraordinary rendition by the American government) is pretty much removed from the narrative. Bachmann only offering the possibility (and not using the term itself) when explaining what could happen to the Russian man if he doesn't co-operate.\r It's not brilliantly directed, the score is instantly forgettable, and the film ends without offering any rationale as to the actions of those responsible for the 'twist' at the very end.\r Disappointing film, but filled with some excellent acting performances."
    },
    {
      "rating": "0",
      "text": "Ce fillm est un brûlot anti-CIA et anti-américain comme on en a rarement vu. Il est déformé par son prisme angéliste permanent visant à nous faire prendre des vessies pour des lanternes : à se demander qui sont les méchants là-dedans si ce n'est la CIA ou les services allemands qui veulent mettre en taule les terroristes... quelle idée franchement que de tenter d'attraper ces crevures en fait ?En tout cas, le méchant, ce n'est pas non plus le gentil Tchétchène, frais migrant tout juste arrivé à Hambourg, car lui est victime des Russes, c'est-à-dire de la mafia russe et des militaires russes corrompus, ce qui revient au même (salauds de Russes, gentils Tchétchènes !). Comme le réalisateur ne pouvait pas nier entièrement les évidences, ni ignorer le terrorisme islamiste entièrement, il donne tout de même le gars Abdallah qui finance via ses ONG des choses pas très catholiques. Mais c'est juste \"histoire de\"...De toute façon, le réalisme est ici grosso merdo très discutable, voire pas vraiment crédible pour un euro. Ce service de renseignements allemand qui retourne le banquier et l'avocate ? une avocate qui ressemble à tout sauf à une avocate : j'aurais plutôt dit une pétasse et blondasse qui ramasse les migrants à la soupe populaire, rien de plus. Le-dit service se fait doubler régulièrement par la Police allemande et la CIA de toute façon : qu'est-ce qu'ils sont méchants ceux-là... c'est insupportable !Bref, c'est du foutage de gueule de A à Z, par ailleurs très lent et qui passe son temps à faire son Caliméro. La fin touche le fond avec les gros 4x4 de la CIA-NSA-FBI en plein Berlin ! bah bien sûr, c'est un complot, on vous dit : le 11 septembre, c'était un coup (fumant) de la CIA.C'est vraiment n'importe quoi et nul à chier, cette merde !"
    },
    {
      "rating": "8",
      "text": "A Most Wanted Man is a real spy film, here is not James Bond or Jason Bourne in favor of the MI6 or the CIA, this is an intelligence drama that challenges you to discover its plot, therefore it is enough to say that you need intelligence to enjoy it, otherwise it will only seem boring and you will only be waiting for the bullets, which I tell you, never come. Better discard that idea because there is nothing like that on this movie."
    },
    {
      "rating": "7",
      "text": "inexpressibly refreshing to encounter a chess game..A Most Wanted Man3 And A Half Out Of 5A Most Wanted Man is a character driven political thriller about a few good-hearted infiltrators whose attempt to pull of an impossible yet utterly glorious task ends up with dilemmas on each step. The stakes aren't higher as one usually gets in such tales, but the inner politics is so well constructed that you cannot not communicate with its designing. The screenplay is so tight and written like a poetry on the sense that it enfolds each time a different perspective, angle, character and a piece of information that somehow sets the clock at zero. And since the feature is build upon the race against time factor, the sense of urgency never fades away even though it ticks for an entire two hours. Corbign's world is busy in all its act (even in its first act, it doesn't spend its time on laying out the plot for the audience) where the viewers has to work hard to catch up with it. It is rich on technical aspects like using its props, amazing camera work, fine editing and sharp sound effects although fails on pitching a palpable background score. Goose fleshing revelations, tricky and convoluted plot and eye-popping cinematography are the high points of the feature that keeps the audience tangled in its world. Bovell's adaptation might be gripping and layered but Corbign's execution surpasses the script and sensibly respects each frame projected on the screen. Hoffman oozes power, vulnerability and emotional aspects of his character unflinchingly with an amazing supporting cast like McAdams, Dafoe Wright, Bruhl and Krieps. A Most Wanted Man is not what we wanted but needed, in an industry where most of the mission were taken over by action and chase scenes, it is inexpressibly refreshing to encounter a chess game."
    },
    {
      "rating": "6",
      "text": "This is your average spy action thriller film, although the story is quite good, it didn't really grip me as such. It made me think of the recent TV series 'The Looming Tower', indeed it does have quite a looming sense to it but it wasn't as engrossing as I'd have perhaps liked. Philip Seymour Hoffman gives a decent enough performance but there is some shaky camerawork and the dark lighting bothered me a bit. I suppose I should expect that, given the plot etc. but I wasn't that intrigued by it, mostly due to the plodding plot pace. This isn't an awful film but its not what I'd think of as especially great, so I'm going for a 3 star rating overall."
    }
  ],
  "recommendations": [
    "man_on_fire",
    "widows",
    "breach",
    "the_accountant",
    "good_time",
    "the_good_shepherd",
    "all_the_money_in_the_world",
    "arbitrage",
    "a_most_violent_year",
    "the_place_beyond_the_pines",
    "the_equalizer_2",
    "body_of_lies",
    "the_infiltrator",
    "broken_city",
    "beirut",
    "changeling",
    "american_gangster",
    "the_devil_all_the_time",
    "unbreakable",
    "prisoners",
    "the_rover",
    "no_sudden_move",
    "donnie_brasco",
    "tinker_tailor_soldier_spy",
    "nocturnal_animals"
  ]
}