{
  "id": 1300,
  "title": "A Nightmare on Elm Street",
  "starring": [
    "John Saxon",
    "Ronee Blakley"
  ],
  "runtime": 91,
  "genre": [
    "Horror"
  ],
  "description": "Teenagers in a small town are dropping like flies, apparently in the grip of mass hysteria causing their suicides. A cop's daughter, Nancy Thompson, traces the cause to child molester Fred Krueger, who was burned alive by angry parents many years before. Krueger has now come back in the dreams of his killers' children, claiming their lives as his revenge. Nancy and her boyfriend, Glen, must devise a plan to lure the monster out of the realm of nightmares and into the real world...",
  "releaseYear": "1984",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/wGTpGGRMZmyFCcrY2YoxVTIBlli.jpg",
  "categories": {
    "plot": 8.074074074074074,
    "acting": 7.410256410256411,
    "ending": 6.125,
    "soundtrack": 2.0,
    "cinematography": 8.0,
    "familyFriendly": 3.0,
    "funny": 7.538461538461538,
    "action": 8.0
  },
  "reviews": [
    {
      "rating": "4",
      "text": "Really a boring movie that doesn't even scare, my wife who scares easy expected a lot from this and didn't even get a jump out of it Very bad teen acting from all the actors and Freddy was a joke instead of a scare... very bad movie. you need to be stoned to enjoy it."
    },
    {
      "rating": "0",
      "text": "I am sick and tired of people saying this movie has any value at all. This movie is a huge pile of crap, just like all the other stupid shallow piles of crap that make up the horror genera. If you like this movie you are a retarded pathetic loser!"
    },
    {
      "rating": "4",
      "text": "A remake horror movie that's worst than \"Friday the 13th\" (Remake version). It sure did give me 'nightmares'."
    },
    {
      "rating": "0",
      "text": "I have to say this movie was by far one of the worst remakes I've ever has the displeasure of seeing. I love how they robbed scenes from the originals (bloody body in a bag in the school hallway, Nancy's name and mother's fate, the blond bombshell/bad boy cuddling then she dies all around the room and him in jail) I thought to was supposed to be a remake, not a 'hijack-and-puke' fest. I love the breaking of the paper cutter just like in the Faculty too! If there is ANYTHING \"good\" about this movie, it gave us plenty of not-fully-related-to-the-plot images at why pedophiles should be burned alive."
    },
    {
      "rating": "3",
      "text": "Despite its bold recreation of the legendary movie monster and the spellbinding dream world created with the aid of modern technology, Nightmare is produced by Michael Bay, that is, it's flat and lifeless."
    },
    {
      "rating": "0",
      "text": "Was it scary?  NO\rWas it entertaining? -NO\rI'll never watch this again, that was very boring ant definitley non exciting.\rWatch the original  it's much better!"
    },
    {
      "rating": "8",
      "text": "What we have here is a rare surprise; a remake that actually provides a solid twist on the original. Obviously it doesn't live up to Wes Craven's horror classic, but there's plenty to enjoy here for any fans of Freddy Krueger. That's because Jackie Earle Haley does a fantastic job as the character.\r Sure, he's no Robert Englund, but Haley gives an excellent performance with this slightly new take on the character. His one-liners are on point and he's just the right amount of creepy. He reminded me why I found the character so fascinating in the first place, and why I fell in love with the original series.\r I also have to give the movie props for at least trying to be a serious horror movie. Yeah there are some self-aware funny moments here and there, but it certainly does try to scare you. Unfortunately it does not succeed. The jump scares are predictable and there's nothing here to instill fright. It thankfully manages to avoid turning Freddy into the comical villain some of the later sequels turned him into, but the movie's overreliance on modern horror movie scare tactics that just don't work prevent it from actually being scary. You don't come into this movie looking for frights. You come for the Krueger character and the twist on his fiction.\r There are plenty of homages to the original here. It follows roughly the same path and there are plenty of new takes on classic scenes. The real change up comes from Freddy's backstory. This time around the movie isn't afraid to shy away from the pedophilic elements that were only hinted at in the original. It's (thankfully) not very graphic with these elements, but it's no secret what's going on.\r Ultimately where the story stumbles is in that none of the characters outside of Freddy are really fleshed out. The parents are just sort of there, and Nancy (Rooney Mara) and Quentin (Kyle Gallner) are the only two teens who get any real screen time. The others are just there to add to the body count. Even with that though we never really get to learn much about them. The characterization falls short.\r Still though as a huge fan of most of the original movies I can't find too much that I dislike here. It may be lacking scares and the non-Freddy characters are flat, but when it comes to a new take on one of my favorite characters in all of cinema the movie delivers. Freddy is what attracted me to the series in the first movie. To see him handled well here makes me happy, even if the rest of the film around him doesn't fare so well. I would love to see Haley take up the role again. It's certainly a lot better than most of the sequels to the original."
    },
    {
      "rating": "9",
      "text": "This was the best remake ever wow it was great what r u people talking about i mean it was great sure its no robert englund performance but jackie did decent the rest of the cast did great"
    },
    {
      "rating": "8",
      "text": "With good scares, this film manages to get a night's sleep for the audience. But it also is not an exception to the rules that will be forever hated remakes. In my opinion this is one of those rare remakes that can be really good. You never know if you're dreaming or not."
    },
    {
      "rating": "7",
      "text": "I liked how Freddy actually had a backstory in this and it explained a lot about his character and why he does the things that he does. I love Jackie Earle Haley as Freddy, even if he isnt England (the original Freddy) he is a good actor and worth of the part. The rest of the actors were good as well. There are also a few original parts in there that actually work rather well and I enjoyed them.\r The bad parts of the film - The kills were exactly like the original film and like the ending of Freddy vs Jason. I hated that, I wanted original kills that were worthy of Freddy's style, Not some poorly done \"reimagining\" of the original film's kills. Also the actresses in this film were terrible and ruin the film quite a bit, Rooney Mara was a terrible lead (and actress imo) who killed this film.\r I am a long time fan of the Nightmare on Elm Street series and in my opinion, This is one of the best films the franchise has come out with. I liked it enough where I would give the sequel a chance but I wont see it unless they cast a new female lead."
    },
    {
      "rating": "8",
      "text": "Personally, I think this movie gets far too much negativity than it deserves. Is it better than the original? No. But how can it be. The original has now been put on such a high pedestal that everyone has forgotten all of its flaws. This movie is cursed with having to fill extremely large shoes that I doubt anyone could fill. Jackie Earle Haley is no where near as good as Robert Englund, but doesn't do a bad job either, Englund did have 7 movies to get it right after all. Overall: I think this is a great film and I really hope they continue with the series, I just hope that they listen to the fans a bit more for the next film."
    },
    {
      "rating": "8",
      "text": "A surprisingly good remake of the original with a refreshing modern taste and pretty good actors. I liked this movie's story more than I did the suspense, but the action and special effects weren't bad at all. The one thing that I didn't like about this movie is that Freddy's makeup/mask didn't look nearly as good as in the original. Overall, I think this movie could have been worse and was a pretty good remake from the original, but focuses more on the story and not just the kills."
    },
    {
      "rating": "8",
      "text": "I personally found the movie entertaining and I think it is a good reboot.The characters are stereotyped teenagers and the acting for them is bad but the gory effects and the deaths were good."
    },
    {
      "rating": "7",
      "text": "It's no way a perfect remake or a perfect stand-alone movie, but it gets its job done pretty well. The acting from most of the cast is solid, especially the actors who played Jesse and Nancy, and I really liked the new Freddy Krueger. He had a lot of great lines throughout the movie. The gore and visual effects are the movie's strongest aspects. It's a beautiful film to look at. The scares themselves are hit-and-miss because this primarily relies on jump scares. There are a couple of scenes with good tension, however."
    },
    {
      "rating": "8",
      "text": "A Nightmare on Elm Street 2010 Reboot is an a-ok solid reboot of the 1984 A Nightmare on Elm Street I think the very Beginning of this movie is really good but then when they kill off Jesse and Tina it feels like a Friday the 13th movie this movie could be so much better in the second and third act if the actors did there part it feels like there are just doing it just to make money does not feel like they care but Freddy I really do like Jackie Earle Haley as Freddy is what I wanted because I feel like he can play freddy over Robert Englund of course Robert Englund is great as freddy my issue after three does not feel like Freddy feels like there are playing for comedy which i do not like this remake for me this Freddy i Like that he is scary the voice is awesome how the filmed it the lighting is amazing perfect but than we got the horrible child **** in this which is terrible to see if that was not in here this movie would of been better and also people would respect this flick but the characters are friday the 13th so you don't really care what happens yeah so this remake i did enjoy wish they did not do the child stuff they did but all round a solid remake that i think is solid for what it was doing so I give A Nightmare on Elm Street an B-"
    },
    {
      "rating": "9",
      "text": "I don't know why this movie gets a lot of negativity. There was nothing wrong with it except that there were a lot of jump scare scenes. The acting was actually good but I prefer the one playing Kris to be Nancy. The humour was better than the original with those epic one liners like Jesse: Oh my God! Freddy: No just me. The visuals were impressive which I expect because Michael Bay is involved in this one. The origin of Freddy was very well explained too. Don't listen to the critics and those who say that this lacks humour or it's way too serious because you know your watching a horror not a comedy right."
    },
    {
      "rating": "4",
      "text": "Meh, disapointment. Atmosphere is great, but the actors SUCK. Nancy is an emo 95% of the time, and she is boring and depressing. Oh, and guess what Freddy lives in now? Nope, not a house. A nursery... I mean!? Why? It's not really spooky and the house was so much better.****SPOILERS****The ending, was an epic fail. They just bring Freddy out of the dream and kill him in less than a minute, it sucked. Then Nancy's mother gets killed at her home whilst he is in the mirror. Then credits roll...Apart from that, I didn't like it that much. I was expecting more."
    },
    {
      "rating": "9",
      "text": "okay all of you critics out there. Ive seen the original Nightmare on Elm Street and this new one. and i critic movies pretty hard, ask anyone i know. This was a good movie. and thoe whole time i was watching it, i was trying to find the flippin difference between this one and the old one. In the new one, there is better graphics, more pop out scenes, and more explanation of Freddy Kruger. In the old one, there is a cool scene where blood shoots out of Johnny Depp's bed, and maybe one more funny line. THEY ARE THE SAME MOVIE. and i know you can never beat the original, but this was a good movie."
    },
    {
      "rating": "8",
      "text": "It may have been sort of stupid with bad acting, but it definitely exceeded my expectations. Very funny, but the movie itself made me want to go to sleep. For my first Nightmare movie, I would give it a 4 out of 10."
    },
    {
      "rating": "3",
      "text": "This movie pales in comparison to the original and why? This remake ruins Freddie Kruger. In the original he was a killer who invaded people dreams to murder them and despite still doing that in this movie it just doesn't have the same effect. Freddie, in the original, had a sick sense of humor and was even able to turn his kills into entertainment via the ability to shape shift and do anything he wanted within his victims dreams but in this villain Freddie is simply a stereotypical slasher. This movie has ruined a once credible character."
    },
    {
      "rating": "9",
      "text": "I am actually very surprised by the mainstream critique of this film. Especially from the critic that also gave it its highest score. His single 3 word statement tells me he didnt watch it, or really wasn't in the mood and shouldnt have watched it.   I grew up during the Jason and Freddie era. I was terrified as a child and amused as a teenager. The first movie I ever went to at night without my parents  and instead with my friends was Friday the 13th part 3 in 3-d.    So I believe I understand the attachment and fondness our generation has for these films very well. With that said I thought that  Jackie Earle Haley brought depth to Freddie that was hair raising. It gave me the shivers and I was scared all over again.  So dont believe the critics just because they gave an opinion.    Take my advice and be confident that you wont be wasting your time with this film. Then form your own opinion. :)"
    },
    {
      "rating": "2",
      "text": "I Have Seen some of the new Horror Remakes and this is one of The Worst i mean Freddy's Makeup is ok but the Kill Scenes Are Generic and The Acting is Horrible the Guy Who Plays Freddy is Aboslutly Horrible and doesnt fit the Role Well at all This is a Remake that Features new Versions Of Classic Scenes but Its Not the Same and its redone Poorly. The Characters are Lame and Boring and And Worst of all Freddy Has no Peronality and all he is is just A Poor Mans Copy of the Original Freddy This is a Remake that You Should Stay Far Away from!"
    },
    {
      "rating": "8",
      "text": "Pretty great entry into the franchise. I'm a long time fan and I don't understand the rabid negativity. Most of the people knocking this thing are acting like the original series was some kind of series of cinematic masterpieces and they were not. This Krueger too is far more sinister. I loved it."
    },
    {
      "rating": "9",
      "text": "Definitely don't listen to the critics on this one. Awesome remake. Far and away better than the remakes of horror movies not to mention way better than the source material. A must see for horror fans."
    },
    {
      "rating": "5",
      "text": "I liked the gore, I liked the dark atmosphere, Jackie Earle Haley was awesome as Freddy. But honestly, It wasnt that enjoyable. the kids acted the best when they died. Its ok, its not great, i didnt hate it, but it wasnt the greatest remake. Its way better than th Friday the 13th remake, but it wasnt anywhere near The Crazies remake."
    },
    {
      "rating": "4",
      "text": "The movie is ok,The thing i hated about the movie Freddy is not like the 1984 Freddy.Robert Englund put jokes while killing his victims and had fun with it,while, Jaikie is just boreing"
    },
    {
      "rating": "2",
      "text": "Dreadful remake of Wes Craven's 1984 horror masterpiece.  No redeeming value at all.  Englund is sorely missing as Krueger, and the rest of the cast are untalented and bland.  Just horrible on every level."
    },
    {
      "rating": "10",
      "text": "90% of the mixed or negative reviews  on this movie are totally biased.This film was much better and way more efficient than any other movies in the franchise.This adaptation is one of my favourite horror movies of all time.It's terrifying and has great effects as well as much better characters and story than in the original.The first ever A nightmare on Elm street was goofy and wasn't serious at all, so it didn't have any impact on me but bad affect from cringe.Another big milestone in this franchise's life was Freddy vs. Jason which was a terrible mess.This is the only Freddy Kruger movie that i enjoy."
    },
    {
      "rating": "8",
      "text": "The Film a Nightmare on Elm Street is in no WAY perfect i kno what your thinking what the hell am i doing giving this movie what people are saying to be a complete waste of time, The Question i dont even no what i am giving this movie a 4.5 maybe because it was a scary FUN time at the movies. But even tho this movie yes has its many flaws which are pretty much made up by the end of the film this movie maybe Confusing and you may get lost at times .. By the very scary witty outright genius performance that Haley gives as the Very Burned and Disturbed Fred Kruger a Gardner from an Old pre-school!. This movie is cliched and yes you know when the jumps are gonna be tumbling at you.. and when i jump like i did thats when you know this movie is allright!.\r The movie starts out with the Twilight Hunk everyone at which is probably going to see this movie Kellan Lutz Who playes Dean i wish i could tell you more about this character but he is killed off within the first 5mins so i cant really tell you anything ... well he is in a Diner the Springwood Diner where he awakes to nothingness and is started to get a little curious he stumbles to the back in the kitchen to find the Clawed Freddy Kruger!.. But i think i will let you see the movie to let you find out how this happens.\r At the funeral long time friend of Dean, Nancy played what is kind of like a young Emily Blunt played pretty good by (Rooney Mara) well after Deans death she is starting to see a strange man in her dreams who is burnt to a crisp basically to say hes name which you all no him buy FREDDY! why he is killing these teens one by one no one knows. But when the unsuspecting teens fall asleep they fall into a world at which they cant control.. and at this point your in Freddy's world! where your pretty much dead as soon as you fall asleep.\r But as the original Freddy always dead Freddy loved to play with his victims minds before he kills him thats when we finally get a glimpse at this Finger-clawed FREDDY played i think as a very well choice Jackie Earl Haley!. You would maybe think he is not the best choice for Freddy Kruger but honestly if i had to pick someone i would Pick Jackie i mean he is so immersed into this burned Psychopath you really cant go wrong. Soon after another teen and another teen are knocked off the chopping Block!.\r Freddy begins getting closer and closer to finding what he wants hes favorite little girl Nancy. But Freddy keeping them up all the time pretty soon you have to get tired am i corrected? Yes sooner or later they all fall asleep... After 70 hrs of non-sleep your body begins to break down and you experience these little things called Micro-Naps where pretty much your whole body is sleeping and you dont even know it thats when Freddy can get you at your most vulnerable point!.\r This movie does have alot of scenes you know where the Music level rises about a third and you get this Huge BLAST! .. of sound waves in the theater well shockingly enough that worked for me i was genuinely surprise at the fact ... you pretty much know when one thing is gonna pop out and well that kind of takes away from the fun of going to a horror film but it WORKS! .. There really is no PLOT twist here except the fact is if you have seen the original you know what to expect.\r Once again i am going to give credit to Jackie Earl Haley at giving one Hell of a performance here i was really immersed into this guy Fred Kruger the Flashback scenes actually when you dont that he is the way he is you kind of fell sad and lonely for this character but than you find out all the horrible stuff he did and you just feel like wow cant believe i felt sorry for this jerk.\r Seeing this movie did bring back some memories of the very first one.. this movie in no way shape or form lives up to the horror classic that is Nightmare on Elm st. But i wish Wes Craven would have had more involvement in this film than he did .. but i guess hes busy planning Scream 4 which i cant wait for. But when all is said and done you are going to be glad you went and Saw a Nightmare on Elm Street! .. 1...2... Freddy's Coming for you! A-\r ReviewdByNate\r RunTime97mins\r RatedR\r Thanks For Stoppin Buy!"
    },
    {
      "rating": "6",
      "text": "A solid remake however its far too much like the original and features little originality to it. I think the actresses sucked rather hard in this film while the actors were good. Jackie Earle Haley was great as the new Freddy yet I dont think the script did his character any justice."
    },
    {
      "rating": "10",
      "text": "Oscar Worthy. The way Samuel Bayer pulls off the tension and brilliant interaction between the characters is astounding. Freddy Kruger belongs in the high elite club of film characters such as Atticus Finch, The Godfather, And General Patton. An absolutely incredible film, that has to be seen by everyone, young and old."
    },
    {
      "rating": "10",
      "text": "This, my friends, is what a remake SHOULD look like! I went into this movie expecting nothing better than Nightmare 3 (LOL), but what I got was a great reboot, that in my opinion, surpassed the original in many ways. Jackie was the perfect Freddy. His voice, humour and everything else was just SPOT ON. Now, I'm not saying Robert wasn't good, he was also perfect. Weird, huh? Well, I think they were both fantastic in their own ways. People say they don't like that this movie get rid of Freddy's humour, but really, the remake made his jokes more realistic... and funnier. Lines like, \"I was only petting him. Hahahah!\" were amazing! Both in delivery and writing. Oh, and guess what? There was only ONE explosion in the entire film! I know, right? Michael Bay was involved, and there was only one explosion! Anyways, go watch this movie as soon as possible! It's worth it."
    },
    {
      "rating": "8",
      "text": "I saw it Friday night, the whole time I was thinking did the critics see the same movie. Was is great no, was it bad no. I thought it was good for what it was. For all u morons who take this movie way to serious and personal, grow up it"
    },
    {
      "rating": "8",
      "text": "Thought this was a good remake. Not the best horror remake I have seen in awhile, but a good one. Weak spots I thought was a less than stellar script and the lead actress. While watching it I thought the actress playing Kris could have played a better nancy. Mara was just too blah for me, not the looks cause she is good looking, but the acting. Haley was the man in this movie. Making Freddy more realistic and less killer clown. Solid remake, not as bad as I have read."
    },
    {
      "rating": "10",
      "text": "I'm a fan of the franchise i have to say this was an excellent addition! Katie Cassidy looked HOT!"
    },
    {
      "rating": "5",
      "text": "This film is yet another moderately entertaining remake, and to be perfectly honest, there was no reason to bring this back."
    },
    {
      "rating": "9",
      "text": "Loved the movie. I have been reading what critics have been saying and I think it is a bit of a joke. I see how one can objectively judge this movie without seeing the original, but wanting it to \"say something\" or \"send a message\" is asinine. It would be a bigger issue if the story got away from the original. For those who right articles and reviews without seeing the original miss that point. I was happy to see an updated version of a great horror flick. I would nudge my wife, which hasn't seen the original as well, at which scenes were derived from the original. I didn't see this as another Jennifer's Body or some other horror film that takes all the 17 years olds"
    },
    {
      "rating": "9",
      "text": "Wow what did most people expect from this. I wen thinking would scree it up and came out surprised. Though it's not as creepy as the orignal the story telling is better. Great reintroduction of a classic."
    },
    {
      "rating": "10",
      "text": "I am getting so sick and tired of everyone giving this movie a 3 or a 2. Especially when people compare it to the original and call out the \"bad acting.\" You gotta be kidding me! The acting in the original was horrible. Depp wasn't even on his A game and the main character Nancy was pretty bad. How could this be rated so low when it was pretty much the same story but with way better effects? I dont miss Robert Englund at all. the only this that should be changed is the face of the new Freddy. Other than that this movies is a stud. Technically i give this movie an 8 but i gotta give it a 10 so that the score gets brought up cause people are being ridiculous with rating this movie. Im seriously annoyed with the critics. Mind you the movie \"Taken\" scored a 42. So dont always believe what the critics say, in fact think the opposite."
    },
    {
      "rating": "0",
      "text": "Waste of money. Bad Character development. Bad script/story. Nothing scary about it. Period."
    },
    {
      "rating": "7",
      "text": "Not bad, for a horror remake. Got REALLY excited for this after Friday the 13th. That being said, here i go. Acting: people were ok. Couple cringe worth lines/ moments of acting. But all in all it was acceptable. NOBODY stands out from the victim side though. JEH SHOULD have stolen the show. The bits you see of him are pretty good. Not amazing, but pretty damn good. If he was given enough screen time to develop maybe he wouldve been considered great. But there wasnt enough of him to judge whether or not he was great or not. Plot: Pretty generic. Teens try to servive supernatural being that the adults refuse to acknowledge despite blatant evidence ( ie one victim gets pretty much ripped apart in a jail cell infront of a fellow prisoner AND a security camera. ) Honestly. I wouldnt say im dissapointed. I got what i came for. But for what it couldve been its not quite up to the level that i think the FT13th remake was. Also. Why did they turn Kruger into Vorhees. What separated Kruger from the other killers is that his kills were VERY over the top with themes and ironic twists. In this one, people get stabbed to death. and from what i can remember, there was only 1 quip. I also find it disapointing how an attempt at referecing two kills from the original NOES movie result in two people dying in the SAME way as the original characters. Very unoriginal. Pretty much, not anywhear enough ties to the original. and where there is, it feels copied, rather than referenced. Id recomend seeing it. But dont expect a classic."
    },
    {
      "rating": "8",
      "text": "I liked the movie. I get a bit scared of horrors though, a lot of jump out your seat moments. I wish it could have went away from most of the horror movie cliches I have become accustomed to in the past."
    },
    {
      "rating": "9",
      "text": "What a remake should look like. It was creepy, the actor's were more than competent, and Jackie Earle Haley was absolutely fantastic. I don't understand the low ratings. The only con to this movie was that it had a bit too many jump scares. Other than that, a great movie."
    },
    {
      "rating": "10",
      "text": "All i can truly say is that i loved this remake! I was suprised by this movie in fact that i would tell people that they should see this. I loved it!"
    },
    {
      "rating": "9",
      "text": "This movie was a blast to see in theaters and even though they changed the whole movie from the original, there was still some famous scenes in the remake. I thought Jackie Earle Haley did a better and more terrifying job as Freddy than Robert Englund and his face looked much more like a real burnt victim. The only thing that I disliked was soem of the kill scenes weren't as creative as previous films, but there were still some that caught my eye. But, Freddy's backstory and origin retelling make up for some of the kill flaws. Highly recommended."
    },
    {
      "rating": "8",
      "text": "I am a big Nightmare fan, and i really thought this one did the old series justice."
    },
    {
      "rating": "4",
      "text": "Saw it on opening night with some friends and we all agreed that it wasn't terrible, but unless you're new to horror films it's extremely predictable. I can't stress that enough really; I've never seen any of the Nightmare movies before and not only could I call key scares before they happened, but I worked out the ending too. It's still a somewhat interesting movie that might be worth a rental, but characters are so cliche and their development is so abysmal that you might end up rooting for the villain by the time the credits roll."
    },
    {
      "rating": "8",
      "text": "It Was Very Nice But The Original Was Better."
    },
    {
      "rating": "10",
      "text": "Great movie. Much, much better than Friday The 13th's remake. Jackie Earl Haley is amazing as Freddy!"
    },
    {
      "rating": "2",
      "text": "I am not a fan of the original  \"A Nightmare on Elm Street\" in fact I did not like it much at all  mostly due to the fact that for a movie with it's reputation it lacked everything a great horror film  needs it just fell flat when I needed it to soar. Sometime in mid to late '09, I started hearing rumors that New Line Cinema was looking to reboot the famed Nightmare on Elm Street franchise but then I had not seen the original so I had no interest in watching the remake. Well after much speculation and some minor hype for this film   I sat down to see the much talked about remake to the popular 1984 slasher film. Little did I know that I was in for a treat and a sour disappointment? Samuel Bayer's (another music video director trying to make it big) \"A Nightmare on Elm Street\"  was not the nightmare  I had hoped for  it lacked depth of character and  enough twist and turns to really  be called  a  true horror film instead it comes off as a two bit  SyFy channel \"horror\" film. That comes complete with hooky dialogue, extremely poor acting,   predictability on a scale so high that you almost want to laugh at this films expense and trust me when I say this, you will! The \"Nightmare on Elm Street\" remake makes the original and other horror remakes (The Ring, The Crazies)   look so good in comparison.   Samuel Bayer's â"
    }
  ],
  "recommendations": [
    "friday_the_13th",
    "jason_goes_to_hell_the_final_friday",
    "fright_night",
    "the_babysitter_killer_queen",
    "halloween_ii",
    "curse_of_chucky",
    "halloween_iii_season_of_the_witch",
    "halloween_resurrection",
    "halloween_h20_20_years_later",
    "the_texas_chainsaw_massacre_the_beginning",
    "cult_of_chucky",
    "jason_x",
    "seed_of_chucky",
    "rings",
    "wish_upon",
    "poltergeist",
    "halloween_4_the_return_of_michael_myers",
    "jigsaw",
    "texas_chainsaw_3d",
    "the_ring_two",
    "dead_silence",
    "the_amityville_horror",
    "scream_4",
    "the_grudge_2",
    "i_still_know_what_you_did_last_summer"
  ]
}