{
  "id": 3349,
  "title": "A Nightmare on Elm Street 4: The Dream Master",
  "starring": [
    "Robert Englund",
    "Lisa Wilcox"
  ],
  "runtime": 94,
  "genre": [
    "Horror",
    "Thriller"
  ],
  "description": "Dream demon Freddy Krueger is resurrected from his apparent demise, and rapidly tracks down and kills the remainder of the Elm Street kids. However, Kristen, who can draw others into her dreams, wills her special ability to her friend Alice. Alice soon realizes that Freddy is taking advantage of that unknown power to pull a new group of children into his foul domain.",
  "releaseYear": "1988",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/boStYG7jKdoIZTduiOOsUVknD13.jpg",
  "categories": {
    "plot": 7.75,
    "acting": 7.571428571428571,
    "ending": 6.5,
    "soundtrack": 6.666666666666667,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 7.333333333333333,
    "action": 7.0
  },
  "reviews": [
    {
      "rating": "10",
      "text": "The characters are very interesting, the deaths are terrifying, the scare factor is upped here!"
    },
    {
      "rating": "9",
      "text": "I really love this movie! Sure, people can say that this is the movie where Freddy turned into more of a Looney Tune character, but I thought it was fairly balanced, and the visuals of this movie are the cherry on top of this amazing movie! But, the story can get a little confusing, but besides that it's a misunderstood movie that is pretty good!"
    },
    {
      "rating": "9",
      "text": "Oh my god. A nightmare on elm street 4 is such an AMAZING film to watch. Terror and violence is perfect in this movie! This is my 3rd favorite nightmare on elm street movie and is in my 10 favorite horror movies."
    },
    {
      "rating": "10",
      "text": "This is definitely the best nightmare of all, great soundtrack, awesome deaths, just everything..."
    },
    {
      "rating": "8",
      "text": "A Nightmare on Elm Street 4 The Dream Master was a surprise I thought I was not going to like it as much as the other installments I really did like this movie I like all the characters in this Freddy is awesome Alice was a good lead to the movie but I feel like when Kristen dies it does not work as what Kristen did but Alice is still good Alice got better after Kristen death tho that is why this movie is still as good the first half of it I like everything else the characters are good entertaining to watch the kills are cool this movie is a lot of hallucinating it looks like the hallucinating was well put because if they were sleeping why would it loop it would be hallucinating only if the main character starts that when the dreaming matters this movie was a surprise I liked everything that was going on and the ending was different from the rest of the franchise so I give A Nightmare on Elm Street 4 The Dream Master a B"
    },
    {
      "rating": "6",
      "text": "It’s AlrightIt’s just your typical horror movie to watch on a boring day I guess."
    },
    {
      "rating": "7",
      "text": "The original 'A Nightmare on Elm Street' is still to me one of the scariest and best horror films there is, as well as a truly great film in its own right and introduced us to one of the genre's most iconic villains in Freddy Krueger. It is always difficult to do a sequel that lives up to a film as good as 'A Nightmare on Elm Street' let alone one to be on the same level.While the best of the sequels from personal opinion is the third, the fourth one is another one of the series' better sequels. Like the third film it is not on the same level as the original, a very difficult feat, but it does have enough of what is a large appeal of the original and why it works so well. Not perfect, but a lot of very good things.'The Dream Master' is not without its flaws. With a couple of exceptions, the acting is largely wooden (while not the worst offender as such, Tuesday Knight is no Patricia Arquette) and the beginning rock song is really cheesy and feels out of place. The story at times gets a little silly.However, Lisa Wilcox is a winning lead and Robert Englund continues to terrify as the iconic character that epitomises \"what nightmares are made of\". 'The Dream Master' is to me the second best directed sequel, courtesy of Renny Harlin, giving a potentially clichéd premise freshness and imagination.Special effects are neatly executed. The humour is darkly comic and very funny and there are some wickedly cracking one-liners. The scares are aplenty and they are legitimately creepy with some cool deaths (the water bed one is a strong example) and amazing dream sequences thrown into the mix. Alice being flung into the on-screen action from the cinema balcony is one of the series' most marvellous highlights.It's a beautifully photographed film, particularly the dream sequences, and is the most unique-looking 'A Nightmare on Elm Street' sequel with its European art-horror visual style. The production design is both dream-like and nightmare while the music is suitably haunting.Overall, good sequel and one of the series' better ones. 7/10 Bethany Cox"
    },
    {
      "rating": "8",
      "text": "Dream Warriors upped the ante of the franchise giving the franchise a more commercial feel but balancing the darkness. Dream Master which is perfectly described by some as \"the MTV Nightmare\" is just that. It's still wild, ambitious and freaky but it's also a pop horror film. It's funny and entertaining and this is where Freddy started to become more of a comedian. Tuesday Knight does a fun but overdramatic job of replacing Patricia Arquette as Kristen and Freddy is reborn by a fog pissing fire in the junkyard. She of course takes him to a new group of friends one of which can carry him to new victims Alice played by a likable Lisa Wilcox. The entry features some of the best death setpieces especially when a girl is transformed into a cockroach. Renny Harlin (Deep Blue Sea) stylishly directs with a killer 80s soundtrack and a whole lot of creativity. Although it's a small step down from 3 it's still overly entertaining.Budget: $7mDomestic Box Office: $49mWorldwide Box Office: $49m4.25/5"
    },
    {
      "rating": "5",
      "text": "A good sequel.The fourth film in the “Nightmare on Elm Street” franchise is a direct continuation of the previous one, and begins with Freddy Krueger's revenge on the group of teenagers who defeated him before. However, things do not end there, and the film presents a very well elaborated script, in which the villain has many opportunities to scare us, although the credibility of what is told can sometimes be too imaginative.The cast does its job satisfactorily. Robert Englund remains impeccable in the role of Krueger, who immortalized with his way of acting and his surrender. Lisa Wilcox is a good protagonist, Rodney Eastman does a positive job and stands out from the crowd and Tuesday Knight seemed satisfactory, but not particularly notable. Even so, I don't think the cast's work was happier than in the previous film.Technically, it is a very well made film and appears to have a lot of money invested. The CGI and the special effects are quite good and worked well and there are several deaths and strong scenes with great visual impact. Englund's make-up also looks realistic and detailed, and that makes it disturbing and impactful. There is room for humor, but the film is genuinely tense and the suspense was built in a coherent and skillful way. Dark cinematography with strong colors helps to accentuate this tension and the soundtrack also plays an honorable role, although sometimes it does not seem to sound very good."
    },
    {
      "rating": "8",
      "text": "The remaining survivors from part 3 are no long in the hospital. Now they have a person that can bring people into there dreams. So they all try to gang up on Freddy as a group in the dream. The dream world is Freddy's world so good luck."
    },
    {
      "rating": "6",
      "text": "Kristen, the girl who can summon others into her dreams, is out of the institution but Freddy kills her and her friends so she passes her powers onto someone else in the hope of defeating him."
    },
    {
      "rating": "4",
      "text": "Definitely felt like a much more standard by the numbers slasher, The bug kill was probably the best of the bunch. Had some awkward but welcome silliness thrown in at random places."
    }
  ],
  "recommendations": [
    "insidious_chapter_3",
    "ouija_origin_of_evil",
    "final_destination",
    "annabelle_comes_home",
    "hellraiser",
    "bride_of_chucky",
    "the_conjuring_2",
    "scream_2",
    "the_conjuring_the_devil_made_me_do_it",
    "candyman",
    "resident_evil_damnation",
    "house_of_wax",
    "hellbound_hellraiser_ii",
    "insidious_the_last_key",
    "goosebumps_2_haunted_halloween",
    "annabelle_creation",
    "hell_fest",
    "halloween_iii_season_of_the_witch",
    "the_strangers_prey_at_night",
    "it_follows",
    "final_destination_2",
    "the_woman_in_black",
    "spider_man_far_from_home",
    "wrong_turn",
    "halloween_ii"
  ]
}