{"id": 4078, "title": "A Perfect Getaway", "starring": ["Steve Zahn", "Milla Jovovich"], "runtime": 98, "genre": ["Thriller", "Mystery", "Adventure"], "description": "For their honeymoon, newlyweds Cliff and Cydney head to the tropical islands of Hawaii. While journeying through the paradisaical countryside the couple encounters Kale and Cleo, two disgruntled hitchhikers and Nick and Gina, two wild but well-meaning spirits who help guide them through the lush jungles. The picturesque waterfalls and scenic mountainsides quickly give way to terror when Cliff and Cydney learn of a grisly murder that occurred nearby and realize that they're being followed by chance acquaintances that suspiciously fit the description of the killers.", "releaseYear": "2009", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/7Rf1vYvUsZlTG3xlDwsktIrKi7K.jpg", "categories": {"plot": 5.6, "acting": 6.095238095238095, "ending": 6.241379310344827, "soundtrack": 1.0, "cinematography": 7.0, "familyFriendly": 3.0, "funny": 3.0, "action": 6.8}, "reviews": [{"rating": "5", "text": "For such a slow movie, 3/4 of the film really got me into this movie. There was alot of talking going on, but there was that suspence if the main characters were with the killers. This actually worked, but the movie fell apart for me. When they had the twist at the end."}, {"rating": "3", "text": "Wow. Metacritic really let me down on this one. I guessed the twist in this movie in the first 5 minutes. The movie gets down right comical at the end. One of the user reviews comparing something to the The Seven Samurai, Akira Kurosawa is turning over in his grave with that comment. Overall, if you're looking for a really stupid, comical, bad movie...Then, I'd jump at this one. Otherwise, Red Box it for a $1."}, {"rating": "3", "text": "Spoiler Alert.... Spoiler Alert.... Spoiler Alert.... Wow, the first 11 user votes have got to be from shills. Add to that Roger Ebert who says the film \"only seems to cheat\". What?!?! Is he an independant critic or a paid advertisement? He is smarter than that... This film is the very example of cheating. Similar to overuse of the \"dream sequence\", where the audience is suckered into believing some incredible plot line only to find out it was all a dream, this movie feeds you hook line and sinker with no possible misreading or \"other explanation\" behind the reveal. By complete trickery we are lead to believe that the actual killers could not POSSIBLY be the actual killers. The only way to justify this trickery is for us as the audience to understand, unequivocally, from the beginning, that the whole movie is a play on itself. In my opinion we are unaware until the tricks are revealed. Which means that the movie completely relies on trickery. We catch a few quirky clues early on like the red snapper joke and some references to screen writing, but that is not enough for us to understand that the whole thing is a farce. This could have been a great movie if presented as farce. IMO the farce isn't completely revealed until the lead realizes his hands are so mangled he can't hold a gun. Now that's funny. Why not clue us in on that early enough that it gets a good laugh instead of a huge sigh? Then we find out that the killers were putting on a great act. That's fine. But we the viewers, from the omniscient point of view we are given, should have known it was an act. Instead we were deliberately tricked. Omniscience and trickery are mutually exclusive. If we see everything then we can't be tricked. But we are. We are deliberately shown some things that are not true. It is OK to mislead the audience by selectively showing or not showing certain elements, but when the omniscient viewer sees something that is patently false in order to trick him/her...this is bad storytelling. This type of trickery is a textbook no-no and for good reason. This is an insult to the reader/viewer and must be done with great care. There is no care here in my opinion, only insult. I give the 3 just for the scenery which is beautiful. The rest is a disaster."}, {"rating": "8", "text": "The best horror movie so far this year."}, {"rating": "8", "text": "Okay, so the twist is predictable, but the movie is still tons of fun."}, {"rating": "2", "text": "I simply CANNOT understand what engaged the people who rated this movie highly. OK -- maybe the scenery is beautiful -- which it is. The storyline is very superficial, though, and the movie ends with a \"twist\" that transpires so artificially that it negates any other interesting things of the movie. Two thumbs down, but it did remind me that my trip to Hawaii is long overdue."}, {"rating": "9", "text": "i feel stupid cause apparently im the only 1 who didn't figure out the twist right away and since gina was my favorite character haha but i had a fun time watching the movie and loved the twist! i loved how i thought of Sydney as a sweet girl then when the twist comes i think of her as a total bad a**! and i love the part where the surfer guys catch cliff in his lie about the drugs... very enjoyable movie!!"}, {"rating": "10", "text": "One of the best movies I've seen in a while. Probably more like an 8. But you all giving it a 1 or 3 need shot. Yes, I considered them to be the killers even before I started watching, but you just don't know for sure. You're guessing thru 2/3 of the movie... you're thinkin well it could be one of 3 couples and any of them really won't be a huge surprise, but that doesnt make it a bad movie. I'm thinking the only reason some on here (mikemike) give this movie a bad rating is because they're thinking it needs more of a twist. For me the big twist was her (Jovovich) turning on her partner at the end. With the overwhelming fill of plot twisting movies out, who's not going to consider the main characters as the killers...duh! That was the intention, so as if to try triple reverse psychology on you. And I feel it works good. There's no way anyone could lock it in as them being the killers until the videocam scene. Unless ofcourse someone gave you a hint before you watched it. And there's no way you could rule out the other couples. If it would've turned out as the other couple as the killers, some of you would still be retorting the same ole cries and IMHO, can't appreciate a good movie."}, {"rating": "7", "text": "Silly and suspenseful"}, {"rating": "8", "text": "I thought it was well acted and the story line was interesting. I do not usually see this type of movie and was pleasantly surprised. I really enjoyed this movie."}, {"rating": "7", "text": "A pleasant surprise. Yes, you can guess most of the plot twists well in advance, and yes, some of the 'twists' defy logic. But it's decently acted, well shot in a beautiful setting, and doesn't take itself TOO seriously. David Twohy is a skilled screenwriter and director. Olyphant does a really good job with his role; all the actors are decent. What can I say? -- This one kind of snuck up on me and was quite enjoyable, when all is said and done."}, {"rating": "6", "text": "[***SPOILER***] Two minutes. That's how long into the film I was when I knew who the killers were. Movies with a \"twist\" need to be a lot smarter than this. It was obvious to me during the scene in the jeep at the beginning that they were getting their stories straight. Add to that the fact that the other two couples are SO obviously being portrayed in a way to make you suspect them. I'm sorry, a few tattoos and wild hair do not a killer make. Any time you'd start to maybe think that you were being misled, there would be some more obvious double-sided dialogue between Cliff and Sydney. That being said, the movie was decent enough to watch. The cast is great and Olyphant really carries the movie. So, decent popcorn fare, but not at all suspenseful. I'd expect much better from the guy who gave us Pitch Black."}, {"rating": "6", "text": "A few good twists in this one keep you guessing. It certainly has some intense moments, great pace and often exciting. The acting is fine, but there are a few too many holes in the plot."}, {"rating": "8", "text": "///Question/// how does it make it a bad movie if we viewers suspect them as the killer??? it doesnt mean they are. it doesn't rule out the others. I think it leaves you guessing thru 99% of it. Heck, I suspected them before it even started. I still think its a Great thriller movie. Dont' let others on here ruin it for ya. Watch it yourself."}, {"rating": "3", "text": "Wow, on this one the critics are seriously disconnected from reality. The setting and the two male lead characters, played by Olyphant and Zhan, were the best parts of this movie. The script was horrible, with the twist coming very cheaply and at the expense of earlier contradicting lines and scenes (don't want to spoil it, but the twist doesn't work at all - it is actually totally laughable). If you want this movie to make sense, fall head first from over 30 feet onto some concrete, and quickly hit the play button. Add to that that the two female leads couldn't act straight - both putting on non-native accents and it showed. Shocked that anyone thought this was an acceptable movie. Avoid."}, {"rating": "9", "text": "Slick, smart, aesthetically pleasing (that later chase sequence...powerfully cut...reminiscent of the famous running scene from _The Seven samurai!). Really, a rarity in horror/suspense films, a film that shoots for something other than gore and shock. Even a compelling deep psychological angle.... I can't say enough about this surprisingly engaging film! I encourage people to get out there and see this film; in the wake of crap like Transformers and G.I. Joe, which make a quatrillion dollars, uncommonly inteligent (and entertaining) films like this need our support!"}, {"rating": "9", "text": "This movie is FUN!!! And yes, it's been done before but rarely with this much glee! The thing that makes it so damn enjoyable is seeing Steve Zahn, Timothy Olyphant & Milla Jovovich sink their teeth into roles that show they can ACT THEIR A**ES OFF. I mean, I got goosebumps in the latter third of the film with all the shifts and shadings their characters go through. And Kiele Sanchez's goat gutting scene is a star making turn in and of itself! It's a great guilty pleasure and beats the hell out that Harry Potter snore-fest thingy in the other theater!"}, {"rating": "8", "text": "Better than expected! Beautiful scenery, engaging characters, danger and suspense. It was fun trying to sort through the false clues and identify the real killers. Although some may find the twist predictable, the ending still offers some surprises. Check it out!"}, {"rating": "1", "text": "I completely agree with Mike Mike, below. What was Roger Ebert thinking when he wrote that review!? Anyone who couldn't see where this was headed from about the 8 minute mark was paying more attention to their popcorn than the movie. As I watched this, I actually pondered the possibility that, as a society, our capacity for analysis and critical thought must have deteriorated to the point where even cliches seem fresh and surprising. There's no need to alert people to spoilers here. The movie is exactly what you think it will be."}, {"rating": "7", "text": "Georgia was the perfect getaway for the men in John Boorman's \"Deliverance\", or so they thought, as the naive suburbanites first set down their canoes on the Chattoga River. Back in the shanty town, the moviegoer sees a class struggle in the making when they first meet the local residents. But it's just a matter of time before Bobby(Ned Beatty), the surly one, is put in his place. The city slicker soon rues the moment he tells a hillbilly, \"I like your hat.\" In \"A Perfect Getaway\", the outsiders seek their deliverance from the Kalalau Trail on the island of Kauai. This time it's newlyweds(played by Steve Zahn and Milla Jonovich), a screenwriter and his blushing bride who go rural, and encounter, not just the islanders, but stateside couples of a lesser pedigree, which creates the same class struggle found in the Boorman film. Seemingly out of their elements, Cliff and Cydney make the classic mistake of befriending the wrong people, a thriller staple, but the filmmaker never goes on automatic pilot; he composes with soft focus photography to give a sense of ambiguity at key moments whenever both couples are within the same frame. Whereas in \"Deliverance\", the person of perceived lower class asserts his dominance by violating Bobby(\"squeal like a pig\") in the woods, therefore transforming class struggle into class warfare: Gina(Kiele Sanchez), a Georgian just like the hicks in the Boorman film, intimidates Cliff and Cydney when the country woman processes a goat into food, where she violates the animal(that Nick, played by Timothy Olyphant, had slain) with her hands for its innards. Like a natural born killer, she shows no remorse. But are Cliff and Cydney really intimidated? Is there a social hierarchy? In \"A Perfect Getaway\", the screenwriter and his wife, unlike the four men in the 1972 film starring Burt Reynolds, get their deliverance not just from the primitive setting, but from each other, as well."}, {"rating": "3", "text": "I don't get the great reviews for this movie. Apparently if you like David Twohy's previous work (which I do), you must feel compelled to look upon this more favorably. What was so special about it, or that you hadn't seen before...multiple times? Almost any episode of Lost has better Hawaiian scenery, as well as better plot twists to boot. Nick's character was the only one that was even remotely memorable, no one else was particularly charismatic, attractive (this has to be the least number of bikinis in a beach movie ever), or really even worth a second thought. The twist was cute, and while it wasn't exactly expected, you obviously knew something was going to happen, and since it wasn't set up well at all, it really wasn't a surprise (nor really made an ounce of sense). The box office numbers got this one a lot more correct than the metacritic scores. This could have been a Sunday night movie of the week on NBC, and it still would have had low ratings."}, {"rating": "8", "text": "A good time at the movies. Glad I saw it at the theater too."}, {"rating": "6", "text": "I was surprised at how much I liked it. It was clever, fun, and I liked all the performers. The twist is not a cheat, but it doesn't undermine the suspense, either. This is definitely worth seeing."}, {"rating": "0", "text": "Worst Movie of 2009. DO NOT SEE EVER. Laughably bad. NO nudity but teased throughout. Not much profanity either. Weak R rating. This is not horror."}, {"rating": "3", "text": "The twists were completely ridiculous. The scenes which made you jump were well done, but that's about it!"}, {"rating": "1", "text": "Yeah, Hawaii is beautiful"}, {"rating": "7", "text": "Ok, so it's not exactly a normal horror film. As a matter of fact it isn't really scary. But this film works well and produces some epic relentless action in the final 30 minutes. It takes a while to get started, but this prologue works because by the time all hell broke loose I actually cared that these characters survived. The twist isn't even as important as one makes it out to be. The film is about two unknown killers; the whole point was to determine who these killers were. That was what happened. The performances by Steve Zahn (especially during the final 30 minutes) and Olyphant are pretty good.Needless to say this was an enjoyable movie."}, {"rating": "7", "text": "This movie was quite the thriller. I'm pretty uncertain if i like the twist or not, but let me tell ya, its very effective. All of the actors/actresses really did quite well. Although this plot was unoriginal, with the twist added and the execution, it came out to be the quality thriller."}, {"rating": "7", "text": "Milla Jovovich."}, {"rating": "8", "text": "This movie is good. I watch this movie so many time and i still love it. I think every one should watch this movie.his movie was surprisingly good. I love thriller movies like this. You think you know but you really don't. I think this is a must see movie. Good movie to have on blu ray and DVD. Good to add to your movie collection. i like that this movie had action thriller and some drama in it. And I like all the twist to the movie. A really good screenplay"}, {"rating": "8", "text": "The first hour of this movie is pretty slow but the second half of this movie is jam packed and very interesting \"you have no idea who will live and who will die\" kind of movie best I've seen in a while."}, {"rating": "5", "text": "Good suspense is the one where everything is shown to the viewer and only in the end he will understand how all these pieces fit together. Already fake suspense like this, cheat, and omits important scenes dialogues plant inaccurate and false. So much so that in its outcome, the director David Twohy had to do just a short cut to explain where the killers came from, and only then, showed cut scenes to circumvent the reasoning of the public. Itâ"}, {"rating": "3", "text": "I recently had a discussion about Milla Jovovich with several other film fanatics and whether or not she has a place in Hollywood after churning out quite a large volume of bad movies. I argued that her roles in films like The Fifth Element, Stone and even her minuscule part in Zoolander made up for all the bad. Many did not agree. However I find myself reaching the precipice. I understand that Jovovich loves cult material, hence her participation in the horrendous Ultraviolet, and B movie throwbacks but by this point she should at least be able to tell the difference between bad cult movies and good ones. A Perfect Getaway acts as a throwback to the B movie horror films of yesteryear but does so in a way void of both reason and logic. The plot is to put it bluntly, stupid. The film relies on pointing out film cliches like 'the red herring' to hide the fact the films red herring (you will know it when you see it) is incredibly simple minded. The dialogue between the characters however is actually quite good, the relationships built in the film feel real which says a lot in a film that is absent a coherent story. The cast is respectable with a few surprisingly good performances (Kiele Sanchez, Timothy Olyphant). However the use of both Chris Hemsworth and Marley Shelton for such small performances seems like a waste of potential. Milla Jovovich has the best character to work with but she never really takes advantage. The weak link is Steve  Zahn who's straight laced screenwriter character grates making him a dreadful lead considering most of the film follows him. The direction (by Pitch Black's David Twohy) is acceptable but never surprising or anything more than what is required. It is a soul crushingly mundane movie that never lives up to the B movies it is trying to emulate."}, {"rating": "6", "text": "This is not a bad movie, however the big twist wasn't such a surprise. It was actually really good and seemed like something different until the the last 45 minutes or so, then it got a bit more clique. Overall, fairly entertaining and worth the time."}, {"rating": "1", "text": "The plot cheats on the viewer. It is very easy to write a thriller with such a tricky and twisted argument. Kind of a movie for people who is not expecting anything but some cheap fights, suspense music and out of the hat plot answers"}, {"rating": "6", "text": "An always entertaining cast (Timothy Olyphant, Mila Jovovich, and Steve Zahn) elevates what could have been a mediocre tropical thriller."}, {"rating": "0", "text": "Storyline very superficial, artificial. Dont make sense.\rThe end? Is a bad joke. The end does not fit with the intermediate dialogues.\r Just a despicable movie."}, {"rating": "7", "text": "The actors were really good and the story about a couple who meets another one who can be killers is original.The twist was predictable but the movie was effective and thats the important."}, {"rating": "8", "text": "Apparently I am that one person who didn't have a clue as to the plot twist and it hit me like a tonne of bricks when it happened. I was genuinely surprised and even got the chills from it.Though throughout the movie, while being thoroughly entertained and oblivious to the upcoming twist, I kept thinking to myself: \"This couple seems really odd\". But I didn't dig deeper into it.Well, I'm glad I didn't. Seems like figuring that out from the get-go kind of makes or breaks the movie for some. So to me it worked really well."}, {"rating": "7", "text": "A Perfect Getaway: 7 out of 10: For a slow moving thriller that cheats… a little, A Perfect Getaway isn't that bad. It has gorgeous cinematography and while it moves slowly, it successfully builds up tension with character development rather than relying on black cats jumping out of closets or severed body parts every ten minutes.\r The tale is about three couples in Hawaii and one couple could be a pair of murders from the big island.\r Our protagonist couple (Steve Zahn and Milla Jovovich) is a bit nerdy and a bit goofy. Jovovich in particular gives a wonderfully awkward performance in body language and facial expressions.\r Trying to get into the Hawaii spirit our protagonist honeymooners attempt to do a favor for a second couple hitchhiking (Marley Shelton and Chris Hemsworth), but Hemsworth gives off such a bad vibe that the Zahn and Jovovich are naturally concerned about running into him on the trail again.\r They take refuge with the \"cool\" couple (Timothy Olyphant and Kiele Sanchez). Olyphant in particular simply cascades charisma onto the screen even when attempting to convince others he has a plate in his head from his Special Forces days. But even the cool couple could just as easily be the killers (after all Olyphant seems to like fondling his Special Forces knife a bit two much and this is a movie.) All this interaction is among well placed news reports that a non-descriptive couple is wanted for questioning for a murder and are suspected in being on the same trail as our plucky honeymooners.\r Director David Twohy isn't back in Pitch Black form but he shows a surer directing hand than he did in Chronicles of Riddick and he gets better performances out of his actors than he did in Below. In fact for a movie with basically six people and very little action the film rests almost exclusively on the actor's shoulders. The actors certainly hold up their end of the bargain across the board.\r The movie does cheat a bit as I stated before but this is a thriller rather than a mystery (after all there are only three couples in the whole film) and the journey is more fun than the reveal. In fact the movie has such a relaxed pace and vibe you can easily forget it is a thriller at all. That's when it gets you."}, {"rating": "7", "text": "So this one is a slow burn and there is a twist and after the twist I think it gets really good.  I'm usually perceptive when it comes to movies and I didnt see the twist coming at all.  Even though the twist is completely predictable."}], "recommendations": ["man_on_a_ledge", "the_loft", "disturbia", "awake", "now_you_see_me", "i_see_you", "red_sparrow", "the_number_23", "the_call", "devil", "house_at_the_end_of_the_street", "vacancy", "shut_in", "gone_girl", "would_you_rather", "next", "shutter_island", "ready_or_not", "the_november_man", "old", "terminal", "bird_box", "dark_skies", "the_good_liar", "till_death"]}