{"id": 3780, "title": "A Prayer Before Dawn", "starring": ["Joe Cole", "Vithaya Pansringarm"], "runtime": 116, "genre": ["Drama", "Action", "Crime"], "description": "The amazing true story of Billy Moore, an English boxer incarcerated in Thailand’s most notorious prison. Thrown into a world of drugs and violence, he finds his best chance to escape is to fight his way out in prison Muay Thai tournaments.", "releaseYear": "2018", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/toYs3tZrHbSKJS1hmiTY1fJnPjm.jpg", "categories": {"plot": 7.0, "acting": 7.75, "ending": 8.0, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 3.0, "funny": 5.0, "action": 5.0}, "reviews": [{"rating": "9", "text": "that was really really brilliant! Very brutal but honest! Joe Cole performance was really really natural and powerfull!"}, {"rating": "8", "text": "My one complaint with the movie is that it's not an entirely accurate depiction of Billy Moore's time in the Thailand prison system. It stays true to the essence of his accounts, but there are events here that are totally fictionalized. I get that this is a common occurrence in film, but given that this is marketed as the \"true story\" I would have preferred if it was actually, well, the true story.This depiction of Moore's journey is still powerful though. We witness a man at his lowest point. Incarcerated in a place where he doesn't even speak the language, scrounging for heroin to feed his addiction, and witnessing horrible acts on a daily basis. The film pulls no punches when it comes to its portrayal of prison life. Every shot feels disgusting and dangerous.It's through the prison's boxing team that Moore begins to find a place among his fellow inmates and chance at redemption. Giving the movie an uplifting quality amongst all the filth. That doesn't mean things ever get soft though. The blows traded onscreen are real. Actor Joe Cole trained extensively for the role to ensure that he could believably hold his own in the ring.The authenticity doesn't end there. Every inmate in the film was a former prisoner at some point. Many of whom can't speak English. The movie does a great job of letting viewers experience the same language barrier troubles as Moore did. Much of the dialog goes untranslated. So when the attacks start happening we get a small taste of the same anxiety and confusion as to why.Joe Cole's raw performance is a sight to behold. He embodies all the rage, guilt, and pain of his subject with such soul. Effectively making this story of finding humanity and hope in the worst of situations and places all the more compelling. It may not be 100% accurate, but Moore's story is made no less incredible because of it."}, {"rating": "9", "text": "Odd and fascinating film. The minimal translation adds to the dislocation of everything happening in story."}, {"rating": "8", "text": "A Prayer Before Dawn is a harrowing yet beautiful fierce tale of addiction. Neither the description nor the trailer do it justice. While the premise is rather simple and almost cliché, its execution is what's truly exceptional. Sauvaire succeeds at creating a personal film with a natural flow, which paired with the extremely authentic production results in one of the most immersive experiences of the year."}, {"rating": "6", "text": "It's a harrowing, crude and visceral prison film. It's not an easy film to watch.I think it's a good film but you need patience to watch it because the narrative rhythm is very, very slow. And it's also a bit underwhelming because it pretty much goes on and on with the harsh situations to extend the dramatic momentum and it becomes a little bit exhausting at one point but still it's a good option, especially for the great performance by Joe Cole, which is definitely the best role of his career so far and that's pretty much it."}, {"rating": "10", "text": "Filme show ,mostrou muita representou como é os presídios na Tailândia e representou o Muay Thai"}], "recommendations": ["just_mercy", "the_last_duel", "the_last_king_of_scotland", "dark_waters", "the_impossible", "the_33", "patriots_day", "the_imitation_game", "the_card_counter", "21_grams", "the_mauritanian", "first_man", "the_way_back", "the_reader", "12_years_a_slave", "the_banker", "the_boy_who_harnessed_the_wind", "the_good_shepherd", "you_were_never_really_here", "swallow", "hostiles", "only_the_brave", "spotlight", "machine_gun_preacher", "hotel_rwanda"]}