{"id": 564, "title": "A Quiet Place", "starring": ["Emily Blunt", "John Krasinski"], "runtime": 91, "genre": ["Horror", "Drama", "Science Fiction"], "description": "A family is forced to live in silence while hiding from creatures that hunt by sound.", "releaseYear": "2018", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/nAU74GmpUk7t5iklEp3bufwDq4n.jpg", "categories": {"plot": 7.069444444444445, "acting": 7.52542372881356, "ending": 5.25, "soundtrack": 0.0, "cinematography": 8.6, "familyFriendly": 4.0, "funny": 1.0, "action": 8.714285714285714}, "reviews": [{"rating": "1", "text": "First movie review ever - but my thoughts on this film are so polar opposite than the critics I feel compelled to write..The premise of this movie is beyond idiotic, and as soon as you begin to ask yourself questions (who planted / harvested  that corn quietly? why don't they set up a homestead near the noisy waterfall? why don't they have bird bangers or other noisemakers set up to go off at random intervals to disguise the noises they make?  How is that baby so incredibly quiet? How is this family of four living on 3 fish a week? How was no one else on Earth able to find the solution to this problem - finding out how to turn their strength into a weakness seems pretty obvious) and on and on... the whole thing becomes so overwhelmingly dumb that it is hard to stay in the theatre. How could these morons be the only people left on Earth? I had not read any reviews before I went and I assumed it would be rated awfully - I could not believe it when I saw all of the positive reviews.  If you want to enjoy this one, you will really need to turn your brain off entirely."}, {"rating": "1", "text": "I can't recommend someone watch this over any other film, horror or not. The acting is solid, the premise of the film is ok. The plot and actions are predictable, and only unpredictable when they make no logical sense. The film pacing is amateur. The cgi alien is ok but derivative. The suspension of disbelief is nonexistent. The whole film culminates in the last family in at least their region, maybe the world, just shooting the alien in the face (with a shotgun), after such an long build up, we get that? There was no reason to have the father in the film at all, kill him off early and the tough mum could have carried it to the end. But the whole end was they shoot it? This film would be difficult to watch in a noisy household, the cinema goers laughing (and eating loudly or farting) was bad enough. I was desperately hoping the alien or the whole family stood on the damn nail one by one. Honestly, I wondered if an hour of movie was edited out, and there was a lot more story and a different ending before the final cut. Look out for that version."}, {"rating": "1", "text": "1. The aliens are blind, possessing extraordinaly sensitive hearing, yet they cannot sense the humans with sonar. Nevertheless, they navigate freely through trees, etc. 2. If humanity wanted to survive, couldn’t they have just sent out protective earmuffs to humanity, some instructions to soundproof their homes, and then ruined the aliens’ hearing with loud noises? Also, apparently a shotgun works. 3. I’m sorry, but after the boy dies in the beginning, there is no way that those parents are having sex in the near future. Yet, they do. Soon, they’re pregnant again. The world seems like a great place to raise a baby, doesn’t it? Stupid/non believable characters abound in this film. 4: The aliens are stupid. I feel sorry for them. The characters could have simply played a game of 'piggy in the middle', throwing sounds back and forth until the aliens ran themselves into a hole and died. 5. The old man in the forest. Just... what? I actually made a metacritic account just to say this movie is terrible. All you people giving this film 10/10... I don’t understand you. I mean, fair enough - we’re all entitled to an opinion, but really? Stop thinking with your wallets and your eyes. This film has no substance or intelligence... suspension of disbelief is impossible (I really wanted to like this film). You people raving about this film being brilliant, please go and watch Ridley Scott's ALIEN or John Carpenter’s THE THING, then see if you stand by your rating. Dan"}, {"rating": "1", "text": "Don't you just hate how noisy your shoes are?This movie is apparently like an IQ test. I'd rather watch the Paris Hilton remake of \"House of Wax\", or \"Jeepers Creepers 2\" 10x than sit through this brain-dead POS 1 more time. It forces you to have quiet contemplative moments to reflect on how absolutely retarded its derivative plot devices, and all of its characters are.Slim Whitman head explosions  anyone? JFC!Where's Vin Diesel when we need him? ...wait, wrong sense. My bad.Sand? Sand!Why use a lantern if you have so many lightbulbs? Gotta start fires somehow I guess. That Monopoly money's not gonna burn itself. Oxygen cannister? Butane lighter! Check.Where'd that peksy baby coffin lid go? Who cares!Why don't monsters sink in corn? I dunno... Dort dort dort!!!25 security cameras, 100 jury-rigged hearing aids, 2,000 red lightbulbs, and not a single wired up airhorn? Sure... Why not.How heavy is sand? How do you harvest corn quietly? If I shout over a HAM radio, and nobody's tuned in, does it make a sound?Shrug.Waterfalls! Of course! WATERFALLS!...and candles! We need MORE candles!!! Kids, follow the sand-trail downtown and GET ME MORE CANDLES!And more farm-to-table family dinners, more Edison lights, and more g-darn electric lightbulb-lit kerosene lanterns sitting on top of hay stacks....and stupid children, we'll need a lot more of those!!!J F F'ing C this is the best-rated absolutely horrible movie I've ever sat through... Blair Witch Project has been de-throned, and I dread the clones to follow.The weed at SXSW must have been pretty damn good ... (Psst... I created an account on here just to post this, because it's that bad. I tried not to include spoilers, but the plot is so mind-numbingly bad I think I maybe crypto-spolied it. Whispering is effective.)"}, {"rating": "2", "text": "Movie Goes NO-Where - but quietly.  Plot is filled with gaps:  where did alien invaders come from and why didn't the army shoot them? why have a baby in this world? why didn't the scientists at Harvard and MIT figure out how to get rid of them - when a 12 year old girl could?  Good if you are a middle school kid, otherwise it's a big disappointment."}, {"rating": "1", "text": "I have never left a review for a movie before but this movie is so bad and for some strange reason has such good reviews that I felt compelled to write one. You have to skip the first 45 minutes if you don't want to fall asleep. After you've wasted 45 minutes of your life your get another 45 minutes of nonsense. A horror movie is supposed to be scary at some point, not this horror classic, maybe there are scary moments but maybe I missed them while yawning. The creatures weakness is sound, and no one in the planet figured that out? I thought of using sound against them 30 seconds into the movie. Having a kid? guess no condoms in post apocalyptic world. People sink in the corno silo but not the monster, guess they have levitation powers. The monster ripped open the silo in seconds but cant tear open the truck, guess he was tired. They drove an old truck down a mountain but those sounds didn't attract the monster, really?????. The sound proof room is suddenly flooded, where is this water coming from? no river or pond close by, guess we have magic water in this movie. And the electricity, the have electric power which we have no idea the source of this power, maybe the have infinity stones o something. These are just a few of the plot holes, too many to list. I tried to enjoy this movie but it was just too too bad."}, {"rating": "0", "text": "A Quiet Place is probably the worst movie i've ever seen. Illogical behavior of the main characters, a lot of plot holes ... everything is so bad that I have no words."}, {"rating": "0", "text": "Made an account just to give this piece of junk a review. Who are these people giving thumbs down to negative reviews here? Why does this movie have such high reviews from rotten tomatoes, Washington post, IMDb, Roger Ebert? Has the world gone mad? The movie is slow. And when i say \"slow,\" I mean very slow. The movie felt like a drag from beginning to end. Being a Michael Bay movie (I didnt know going into it), it lacks entertainment and action, let alone big explosions. The movie is mostly in sign language and the theater was so quiet that I could hear people farting. It might as well have been filmed in black and white. The movie lacked substance, plot, setting and acting was mediocre. Please dont waste your money, you have been WARNED. I would have given it a negative rating if I could. I await the thumbs down with PRIDE!!!"}, {"rating": "10", "text": "Builds the tension to perfection, I absolutely loved A Quiet Place. A family must live out their lives in silence to avoid being killed by mysterious monsters that hunt purely by sound. A gripping and hugely intense experience. I know it’s only April but this might just be the best horror of the year.Starring and directed by John Krasinski, also starring Emily Blunt, Noah Jupe and Millicent Simmonds. A horror/thriller done right, A Quiet Place delivers exactly what you expect and more. It wastes no time getting started, you’re plunged into silence for a good portion of the film so for all you noisy popcorn munchers out there you’ve been warned. A movie that requires everyone to remain quiet, every sound is deafening and the frights have an even greater impact. A tense and thrilling experience build around a simple yet original idea. A Quiet Place achieves what many horrors fail at, it doesn’t fall apart in the third act but more importantly it will scare you. Highly recommended."}, {"rating": "0", "text": "I thought a lot of this movie was plain ridiculous. The corn scene was incredibly ridiculous. Also, why are they even scared of these silly monsters? Like make a device that is indestructible by the aliens that makes a ton of noise and set it right outside of your house, or better yet just put a loud speaker where they cant get to (like high up in the air) and blast music out of it. I disliked this movie because the premise is sooo ridiculous."}, {"rating": "8", "text": "Both overrated and a very good movie. I love the use of sound.  Its suspense is wonderful!  However, the plot is very simple, and the ending was meh - especially compared to what came before it."}, {"rating": "10", "text": "I absolutely love this movie and decided to watch it again considering Part.2 just came out.   The movie is just as fantastic as I remember."}, {"rating": "0", "text": "it's a bad film which contains bad writing and a bad story, It's about a monster which attacks people when they make sounds, and they arrived on earth by a meteor so creative!."}, {"rating": "8", "text": "One of the best horror/thrillers I've seen and apart from the loss of the son this film is very clever."}, {"rating": "9", "text": "Ao mesmo tempo que me surpreendi com a qualidade da trama, vi também um filme que explora muito bem sua incrível premissa, juntando a tensão, drama e a inquietação, nunca pensei que o poder do som poderia ser tão assustador."}, {"rating": "10", "text": "We all know you need to keep silent when there are aliens roaming outside. But, what if you needed to do this all the time to stay alive? That's what makes this movie so great, bear the unbearable..."}, {"rating": "9", "text": "What can I say, I cried, I screamed, it was awesome. Both John and Emily did an amazing job in the movie and at times I was eating my own damn fingers from all the tension."}, {"rating": "10", "text": "\"A Quiet Place\" en Inglés o \"Un Lugar Tranquilo\" titulada en Castellano, una película que te hará estar en tensión de principio a fin.Emily Blunt está increíble en la cinta, con una de sus mejores actuaciones sin duda, por otra parte, cabe destacar también, la gran actuación de su marido, John Krasinski.Un filme diferente a lo visto hasta ahora en el cine, unas criaturas que han llegado a la tierra con un oído super desarrollado, al mínimo ruido, estaremos perdidos.Una película de 10 sobre 10, increíble. Mi Decimo segunda critica u/o review de la sección de Movies."}, {"rating": "0", "text": "MEH movie. Why it does have such high score on meta I really wonder. I start to suspect, production offices hire people to spam ratings here. The story was boring, meaningless and dull. No talking thing was a cool idea but later it felt it's a lazy way to write a script about it. Also ending was the worst. Whole movie's atmosphere ruined at the very last 3 seconds. If there was any proper dialogue in the movie, I would have said it would be a nice background noise movie but it doesn't even have that. So, just pass on this one."}, {"rating": "8", "text": "Take notes, you so-called horror film writers and directors. The primary requirement for a horror movie to be good is to be thrilling and being intense. Not just cheap scares or silence followed by an incomprehensibly loud noise. ..Good : \"A Quiet Place\" directed by John Krasinski is a genuine and tensed horror/thriller. It has a unique premise and backstory. The setup for the story has been done well. The performances by John Krasinski and Emily Blunt, along with the child actors is awesome. The direction of Krasinski is \"awesomer\". The tension and the thrills were genuinely great. That's something I have not seen in a horror/thriller for a long time. Speaking of horror, what we take as \"scary\" is totally subjective. If you're watching this to get some jumpscares or to see a ghost, this ain't your movie. There are many moments that give us the feeling of getting into the jaws of death, unexpectedly. Those were some real thrills. And, the characters know what's gonna kill them and why. So, whenever such things take place, the tension is amplified (no pun intended) and whether or not they are gonna succeed at the particular moment keeps you terrified. For me, anything that keeps you terrified is real horror than some ghosts and jumpscares, so I got my \"horror\" part in this movie, after a long time. It's not that it doesn't have any false scares, just one or two though. Whenever something goes wrong, you can feel the s**t happening. That's some incredible directing. ..Mixed : The final moments were a bit less satisfying for a thrill ride we witnessed for the majority of the movie. There are some notable plot holes regarding some sounds making no significance in the context of the movie's own rules, the way a lot of food, medicines don't get used up after such a long time, the crops being harvested (without any noise?) etc. The movie also shows certain stuff as if it was trying to say \"see this is a plot device, see see SEE!\" and it actually is so. ..Bad : One plotline with Emily Blunt and her \"youngest child\" was something that made no sense to be honest as per the movie's own rules and was obvious to play out in the later part of the movie. The way it was playing out was damn good, but we knew that something was up regarding this. ..Conclusion : I cannot overlook the flaws but man, I had a great time watching the movie. It's flawed but intriguing. It's probably the first Krasinski movie (directorial) I liked so much. ..Rating. ..Score : 8.3/10Grade : A-"}, {"rating": "6", "text": "This was an okay film, but it needed to be thought through a bit more. The universe they've created doesn't follow a set of logical rules and the characters are only half baked. I couldn't believe the family in this movie would survive a week in this apocalyptic world, let alone over a year. The actors did the best with what they could, but you can tell that the direction was lacking. Overall, it was enjoyable enough, but it mostly just felt like the monster chase scene from every horror movie ever stretched to a full movie length. Cool idea, but not the best execution."}, {"rating": "8", "text": "Though not necessarily all that scary, A Quiet Place is a roller coaster of tension. It truly is an original film in an era of reboots and remakes. I praise the acting of John Krasinski and Emily Blunt who have proved to be some of Hollywood’s leading talent."}, {"rating": "9", "text": "An amazing new fresh idea for the horror genre that while uses some horror cliches still manages to grip you and keep you on the edge of your seat"}, {"rating": "8", "text": "I did not expect such a riveting and heart-pounding film from John Krasinski. It is terrifying and touching. The editing and cinematography lends to the extreme degree of tension that the sound design creates. The performances all-round are fantastic and very believable, surprising given the extreme nature of the situation. I was however disappointed in some of the logic and decision making throughout. Also, an important reveal and the pacing of the action at the beginning took away from some of the tension and psychological impact."}, {"rating": "6", "text": "Interesting and clever concept, so-so execution. Krasinski is able to balance both directing and starring in the film rather well, but his ideas towards the story seemed a bit scattershot at times. In addition, I felt as though it became more and more predictable towards the end and the ending was quite a cop out to me. I will say however that the chemistry between Krasinski and his wife/costar Emily Blunt and the two children (Millicent Simmonds and Noah Jupe) was well-done. Overall, it really was an ambitious idea for a story, but it fell rather short of its potential in my opinion."}, {"rating": "6", "text": "The performances and much of the second half of the film makes up for the amount of illogical and pointless things that happen in the name of creating tension that actually don't do that at all. In the end it feels like a Doctor Who episode in as much as we're basically watching a character slowly work out something that has been mercilessly hammered into our skulls as an audience. That's what most of the movie is in the end. Split on rating this a 5 or 6 but I guess I'll be generous."}, {"rating": "0", "text": "The movie is very bad !!! Not scary at ALL!!!! Ridiculus !!!!! The actors is mediocre"}, {"rating": "8", "text": "I liked the movie even though it didn't take the direction the trailer suggested. The first half focuses on setting the environment and characters, which I thought was interesting but not something I'd have watched throughout the complete film. The second half brings in drama and tension which makes the best part of the movie eventually. Overall an interesting concept, cinematic setup and great acting. I'd recommend this movie."}, {"rating": "8", "text": "This film takes place in a present day where earth has been taken over by aliens that can only hunt by sound. The film centres around a family trying to survive in a very unnatural environment, rather than showing the whole world going into chaos, we only see the family and one old man that has been overcome by the silence. This eerie effect that they may be the only humans left on earth along with a constant silence shows that silence in horror can be just as effective as loud jump scares."}, {"rating": "10", "text": "John Krasinski is such a brilliant director!!he makes such unique and original movies!!When I watched this WONDERFUL movie, I noticed that I had to be quiet. It was the most stressful and the hardest thing I have ever done during a movie. For example, when it was a really quiet scary part, (I watched this with my dad) all you can hear is CRUNCH"}, {"rating": "6", "text": "Here's a quiz for you (spoilers? Maybe?): In what movie does (in no particular order) one of the parents die; aliens overrun the world; society can't figure out the blaringly-obvious way to defeat the aliens even though they're also affected by pretty mundane things, as it turns out; both kids have some sort of condition or quirk going on, and one of those quirks or conditions leads to the solution for defeating the aliens?Ding ding ding: That's right- It's SIGNS, by M. Night Shyamalan!Yes, A Quiet Place has some solid acting and solid direction, and cheers to allowing for an actual, hearing-impaired person to play a hearing-impaired person. It's a little scarier, but honestly also a little more dense in the way of the suspension of disbelief (you did NOT seriously just get away with having a baby right next to a sound boogen; no, the deaf girl is NOT going to be aware of all the sound she makes even just breathing, let alone walking through a CORNFIELD). Frankly, however, I prefer the symbolism, humor, character arcs, and storytelling that came with Signs. There was very little to absolutely none of that in A Quiet Place, which honestly made the theater quite a quiet place."}, {"rating": "8", "text": "I did not find the movie scary, as I have grown out of monster-type horror movies. The monster itself wasn't that groundbreaking, as it looked very generic.What the movie excels at is expressing human emotion without speaking a single word. Most of the movie dialog is through sign language and facial expression, and you can tell what the characters in the movie are going through. There are moments when they are able to speak without attracting the monster, but those scenes aren't as powerful as the rest of the movie.Overall, all the actors did an amazing job at making the characters feel real."}, {"rating": "6", "text": "Mysterious my foot. You've seen Alien? They're Aliens. The best thing about this film was the audience; not a peep out of them (bar the occasional gasp,) the entire running time. Good sound design didn't need the intrusively ominous score and if you've seen a film where someone clamps their hand over their mouth while a glistening spiky monster hisses and crackles past behind them, then you've seen this. The scariest thing in the movie is def a nail sticking out of a plank. Not so much a series of set-pieces as one set-piece played out ten times. Another five minutes and I would have become inpatient."}, {"rating": "8", "text": "The story revolves around a family (of 4, after the youngest son died) being 'stuck' in a farm, where its general surrounding (and likely the entire rural country side area) is being roamed by three flesh eating aliens/monsters. These monsters are unique in that they are blind, but highly sensitive to loud sounds/noises, which they rely sorely on for hunting preys. The first early part of the film has slight problem on the pacing. Things start to get tense when the family members in the film got separated, and subjected to traumatic, life threatening attacks by the monsters, after an accidental loud noise in the house attracted them directly to the farm. Other than the horror aspect, the family love/bonding aspect is reflected very strongly, and brought out in an emotional, though sad way.This is an above average horror movie you should consider watching, even if you are not a fan of horror films.By the way, I read some of the negative reviews, which are mostly complaints about illogical parts in the film. Seriously, it is impossible to make a 'good' horror film if the film maker has to to be logical to the dot. Horror and science fiction is about make-believe made into a story. In fact, if every film is subjected to high level scientific scrutiny in the logical aspect, almost all films (especially horror and sci-fic genre) will be **** If the film never mention about any logic aspect of any plots or ideas in the film, it is either meant to be unknown or open-ended. If you want the proper answer, ASK the director or screen writer. If you want logic based video productions, go watch science documentaries. Do not consider watching any horror/sci fic films, since they will all seem illogical to you. And if this movie is a bad horror film, then what is a good horror film? Name any title that qualifies that. lol"}, {"rating": "8", "text": "4/5An incredibly detailed story that focuses on family relations. You may think you have a plot hole in the movie, but read the newspapers and remember the days! They list every reason why your \"plot hole\" is wrong. What may be bad about the movie is the massive amount of unnecessary jump scares, but it adds to the theme of A Quiet Place. Other than fabulous acting by the Millicent Simmonds, the best thing about the movie is sound direction. Each character has their own version of hearing everything and every time the camera moves to them, you will hear what they hear. You know each character's roles and how they feel in every situation. There is a screen which shows a death and a suicide, which may deter you and probably the only confusing part of the movie (anyone may comment on it here if they have a better explanation) - the only value it would add is the importance of family and how losing your loved ones can effect you. The conclusion was very well though-out because it was a random chance, not something scientifically articulated."}, {"rating": "10", "text": "'A Quiet Place' manages to blend horror with emotions and each and every creek propagates the fear to the audience, making them root for the characters. Emily Blunt's career best, award winning performance ( especially the labor scene) powers the movie along with the knack for inducing horror, thanks to John Krasinski."}, {"rating": "8", "text": "Funny Things:A Character Dies because she's deaf.and A Character Lived because she's deaf."}, {"rating": "9", "text": "How to make a horror movie masterpiece, a lesson by John Krasinski: Have the horror movie be a drama first and horror second. It's amazing that Jim Halpert from the Office had a horror movie masterpiece in him. It's something you'd never expect from him. Ever. Needless to say, this movie IS a masterpiece, with a solid premise that really excites anyone who hears it. A Quiet Place will have you gripping your seat from start to end. It's brilliantly acted, directed, and co-written by John Krasinski, proving that he may be a director to reckon with in the near future. Emily Blunt gives a solid performance and so does the kids, who you'd think would be the worst part of a movie like this, but they're really good and super believable. The story (besides the incredible premise) is brief but brings power with every scene that is put on screen. You will quickly care for this family, more so than other on-screen characters in other horror movies. Plus, it is clear that the writers played situations cleverly, using spoken words only when the situation actually calls for it. No one's an idiot (actually one exception but spoiler) and the family is betrayed in a way that makes you believe they're real, which is really hard for the horror genre. With amazing pacing, and use of sound, A Quiet Place manages to build tension in the most brilliant way possible -- and Marco Beltrami's nail biting score only adds to this tension building. The creatures are nothing short of terrifying, and could possibly land a place next to Alien and Predator in terms of design and pay off. The movie uses sound so excellently and only makes for a more intense experience. If there is one downside, it's that some of the scares seem really cheap and I mean REALLY cheap. Plus, there is a few (TINY) parts that could be considered plot holes, but they're easily forgiven -- same with the CHEAP scares, because it is as I said before, the horror takes second and the drama takes priority. At its heart, A Quiet Place is a family drama about humans (a family) having to adapt to a new and dangerous threat, while also teaching a valuable lesson on family and the importance of the sense that is sound. You should watch it, then watch it again, because this movie deserves it, and other horror movies should be taking note, because THIS is how GOOD HORROR is done."}, {"rating": "9", "text": "The best thing about the movie is surely the world building that they did, the role system that the characters had to not make one single sound was great, they literally thought in everything. The characters did placed something that it seemed to be salt, or something, in the paths that they needed to use for then, it doesn't make any sound by the steps. The kids playing a board game, using cotton as their game pieces, throwing dice at the carpet. Using sign language, it's incredible how even the kids knew how to use the system, like the parents probably taugh them since they were little children. The movie also showed how the family were self sufficient, how they get their food, in the river, or with planting and showing a place full of corn, and that they usually go to the city to take some supplies.Delivering problems and bigger situations than the plot itself, like Emily characters is preagnant, throughout the movie you keep asking yourself, how in hell she will get a baby without warning the monsters and the movie delivery it with mastery. One of the kids is deaf and the father try to make a device for her to star listening and foward on the story it does have a bigger purpose, isn't their just for be, everything does have a meaning in the story. And they also did show how they could warn when some monster was close without making one sound, they literally though in everything. The characters cannot make a sound, but the script put them in the most impossible situations to not make a sound as possible, it is sadistic. The atmosphere and the sound of this movie are just amazing, like every minumum sound you can hear and be afraid that if it was to loud, the sound design for this one is fabulous.It is scary and terrifying in some moments, the movie have a prologue that just show us perfectly without one word how the movie will be, it does gave to us that sensation of danger that can be reached with a simple error, making a minimum noise, it does this perfectly, you got tense during the movie, any sound that they do, you got paralyzed and scared of what might happen. Every single sequence with the monsters were phenomenal, they are scary and dangerous, because they can't see it does make it so much more intense, it did reminded me a little bit of The Last of Us and Until Dawn.All the actors did a tremendously good job. Emily Blunt in general did a great job, but are some sequences that i won't mention because it is spoiler, but in some particular moment that she is hurt with her baby and is passing for a big struggle, she can pass the perfect idea of despair and fear, her face and full composition of body delivery it perfectly, she is holding emotions. John Krasinski also did a great job, he have a expression of concern that i completely bought it, he can express the idea of love and that he is trying to do the best for his family, he also is the director, wich did a phenomenal job at it. Millicent Simmonds character is actually deaf, just like the actress, and she did a great job in expressing her rebellion in some situations, her concerning with his brother and a possible blaming herself moment. Noah Jupe wich is the other son of the couple, he is very good, doensn't have much to do as the others, but he does express perfectly his fear and his trust on his father, he is concern and did a very good job.It is somethings in the movie that was bad and didn't make sense at all, there is one sequence with Emily in a situation, a situation that is important and you got curious about what is going to happen, then the scene is cutted for another thing, and when it does come back to Emily the role situation is gone like nothing did happened, that seemed like a continuation failure on the movie. Later on the movie are two situations that i didn't though that was righ, with the boy. The cgi and design of the monsters was great, they are scary and completely pass that dangerous and disturbing sense, every time that they showed you got stunned by them, they are completely ferocious and super violent, you understand how they are and wich are their abbilities, the movie did it in a great way.The cinematography is great, like if you are not hearing much, your vision gets more sharpened, every cam is creative, they put a lot of empty places at the scene, for us to get scary and tense if the monster will show up, the characters are put against light to make us concentrate more in the background, and when the monster is on screen it does change to a more close one for us to not know where is it. There is one color thing that when it is showed the red, the dangerousity sense goes so high that i can't even remember when i got that feeling before.The end of the movie with some new knowledge gained during the film, make the end being the best possible, getting implicit what is going to happen and letting the viewer thinking how did it go."}, {"rating": "6", "text": "This movie has a lot of plot holes and you have to be willing to suspend disbelief. If you can do that this is a story that you can enjoy for the problems it offers you to think about and for the periodic scares it delivers.  Emily Blunt is the lead actor but the two children add to the tension as it develops.  A rating of 6 is generous but Emily is too good looking for anything less."}, {"rating": "5", "text": "First half had promise but it falls apart in the second half. Overbearing score, too much foreshadowing, and the movie's internal logic doesn't seem to be too well thought. I don't think all the rave reviews will do this movie any favors as it has fallen far below expectations. Overall, it's a mediocre movie that squanders it's potential."}, {"rating": "7", "text": "With most of the Worlds population having been killed by creatures, of an unknown origin, that hunt using sound the Abbott family have found refuge on a small farm but must still be wary of making any noise.After a shocking prologue I found the A Quiet Place rather slow going for the first half hour or so. The excellent cast, including the always reliable Emily Blunt, always keep things watchable however and as proceedings ramp up in the second half of the movie the original premise leads to some really tense, dramatic and emotional scenes. One for those who don't mind their horror movies on the slower side."}, {"rating": "7", "text": "Pros: - Nice and unique idea - to live without sound - Emily Blunt is great actress, acting at all, of all actors in this move is good - Daughter-actress is deaf in real life - this was strong and noble act by directorCons: numerous plot holes, NUMEROUS - First of all - who in such place and such time ever so stupid to give birth to children? Worst place imaginable. No condoms or? Beyond stupid - Why in the world they have so many light devices but only one firework to distract creatures out? Seriously, some air horns away from home? No? But more lamps for sure!Well, I understand those terrible plot holes had to be here to make a movie as it is. In other time I would give it 2 or 3 out of 10, but now I give it 7 due to pros. Can I recommend it? I'm not sure, prolly not though."}, {"rating": "9", "text": "A gripping story about how sound can kill (and we humans are a noisy bunch). John Krasinski (who also wrote and directed) and Emily Blunt (they are married IRL) do their best to protect their family but it isnt easy.  Fortunately there is enough character development in \"A Quiet Place\" so we care about this group and root for their survival. You'll be thinking about sound in a new way after the movie ends. Would you be able to survive in such an environment? I'm not sure I could."}, {"rating": "8", "text": "Positive Sides    Negative Sides + fluent    - There is an annoying little girl  + marvelous actors    - There aren't be explained how the creatures came out  + an original subject    - The end of the story by leaves to the audience    + it is very moving second half to film's"}, {"rating": "7", "text": "I'd heard true horror stories about the terrible experience that several viewers had while watching this films with rude audiences so I decided to wait a bit longer to watch it and it was worth it. A room with more than 100 seats and only 4 other people in there with me and most importantly all them in complete silence.Speaking about the film I think the noise and hype that is causing is somewhat excessive but I must give credit to John Krasinski for being his first film as a director because he delivers a solid film of horror and suspense that even though makes some argumentative mistakes like bringing a baby to the world when the world is now a **** up place, its narrative method works very well especially to immerse you inside the story and get people to pay full attention. After all if they don't have words they have the images and that is enough for this film.Quite commendable because thanks to its way of telling its story it reminds the public how a movie should be enjoyed: In complete silence."}, {"rating": "10", "text": "This is my 2nd favorite horror movie and one of my favorite movies of all time. The atmosphere of the movie was cool, creepy, and fantastically scary. I loved how original the concept of the movie was. Emily Blunt and John Krasinski gave performances that were stupendous and Millicent Simmonds also gave a great performance. John Krasinski's direction that he took the movie was spectacular. The visual effects were terrific, the creatures were creepy and awesome. The sound design for the movie was very impressive. I also loved the use of sign language by the cast. An A+ movie."}, {"rating": "9", "text": "I really really enjoyed A Quiet Place. Lots of great visual storytelling, brilliant acting, and (mostly) great characters. Although the parents make a choice that sounds incredibly dangerous and irresponsible."}, {"rating": "9", "text": "Without exaggeration, the setup for the story here is the best in any movie in this decade so far. Just from the opening scene I felt the tension, I became invested in this world that Krasinski's terrific direction has built, I became invested in the characters, and I already started to root for them. I can't believe how cleverly the rules that were established, and how smartly every detail and idea has been utilized to make this world as scary as it realistic!All the performances are superb! Noah Jupe again proves that he has a very bright future, and Millicent Simmonds's performance is equally brilliant. John Krasinski's performance is as compelling as his direction. As for Emily Blunt, I think she gave her best performance in her career. Yes, I believe that her performance in A Quiet Place is superior to her performances in Sicario and Edge of Tomorrow. But to be honest, the situations her character are put in, and the conditions that surrounded her are what made Emily Blunt gave this Oscar-worthy performance. Of course, this due to the movie's intelligent script.Speaking of the screenplay, I think it's the main reason this movie is so special. Krasinski's direction of course helped to create the creepy and special atmosphere therefore helped to set up the movie's story. But it's the original script that established all that, and fleshed out the characters even with almost no dialogue.Despite the film's low budget, the special effects are spectacular. This is the second time I see great special effects in a low-budget film. the first time was in a good indie film called I Kill Giants. Check it out if you haven't seen it, it worth it.The characters aren't just well-written or compelling, but I found myself totally invested in them. I got all the emotions the characters felt. In fact, I felt that I was experiencing what they were feeling in many different situations. I held my breath when the character were in danger, no pun intended. I literally stopped breathing! Also, I cried twice in this movie! So I think that's enough to tell how emotionally connected with the characters I was, and this is a \"Horror Film\"!As for issues, there were 3 or 4 decisions that aren't so subtle, as usual in horror movies. The jump scares were fine and somewhat effective, except maybe one or two.A Quiet Place is my favorite movie of this year, so far! And I asked myself two questions after watching it, the first question is:Have we, as cinephiles, ever needed talkies?The second one is:When will I raise my voice again while talking? Because every one I talked to after watching A Quiet Place struggled to hear a single word from me!(9/10)"}, {"rating": "9", "text": "A Quiet Place is well shot and creative. John Krasimski is great as the father and directed it fantasticly."}], "recommendations": ["a_quiet_place_part_ii", "us", "color_out_of_space", "annabelle_creation", "sanctum", "the_invisible_man", "signs", "sunshine", "chernobyl_diaries", "oculus", "crawl", "the_ritual", "bird_box", "insidious_the_last_key", "it", "old", "scary_stories_to_tell_in_the_dark", "dark_skies", "annabelle_comes_home", "colossal", "the_curse_of_la_llorona", "the_mist", "the_descent", "annihilation", "ouija_origin_of_evil"]}