{
  "id": 65,
  "title": "A Quiet Place Part II",
  "starring": [
    "Emily Blunt",
    "Cillian Murphy"
  ],
  "runtime": 97,
  "genre": [
    "Science Fiction",
    "Thriller",
    "Horror"
  ],
  "description": "Following the events at home, the Abbott family now face the terrors of the outside world. Forced to venture into the unknown, they realize that the creatures that hunt by sound are not the only threats that lurk beyond the sand path.",
  "releaseYear": "2021",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/4q2hz2m8hubgvijz8Ez0T2Os2Yv.jpg",
  "categories": {
    "plot": 7.243243243243243,
    "acting": 8.464285714285714,
    "ending": 5.933333333333334,
    "soundtrack": 5.0,
    "cinematography": 9.0,
    "familyFriendly": 4.0,
    "funny": 9.0,
    "action": 8.571428571428571
  },
  "reviews": [
    {
      "rating": "8",
      "text": "If you liked the first one like me, you will like this movie. This sequel continues the themes, tone and character developments for the family with the addition of Cillian Murphy's character who is also exceptional in this. The movie has tension but not quite on the level of scenes from the first movie. This movie has emotional moments, also not as deep as the first movie. But these scenes of tension and emotion are included and they are done fairly well. By far, Millicent and Cillian are the stand outs in this film. They both carry the emotion of the movie and have the most tense scenes. Overall, just a solid film. And to think a sequel for a horror movie is good comes a long way in film history. Recommend fully."
    },
    {
      "rating": "2",
      "text": "Not as good as original.  Revelations about an aversion to water made absolutely no sense."
    },
    {
      "rating": "7",
      "text": "The original film was my first 5-star rating of 2018 (my review). The sequel, like is often the case, lacks the surprise of the original, while maintaining some of the suspense. It takes up after the first one with what’s left of their family (Emily Blunt, Millicent Simmonds, Noah Jupe) travelling outside their safe area to survive. This leads them to new people and new adventures, while still eluding the extremely lethal, blind aliens. Most of the quick frights come early, then things settle down into more predictable encounters. There’s still plenty of anxiety and the performances are effective, but the overall effect is not as riveting. Still, it’s most involving on the big screen."
    },
    {
      "rating": "7",
      "text": "Following a short epilogue taking us back to the origins of the alien species arrival on Earth, A Quiet Place Part II continues on directly from the original movie with the surviving members of the Abbott family having to leave the farm they’ve called home for the last year.The first movie took an intriguing premise and delivered an effective, if slightly unevenly paced horror movie. This sequel certainly ups the pace, but in the process it tries to fit a little too much into an hour and a half with many ideas being underdeveloped leading to a rather abrupt ending. Despite these issues the formula still makes for a relatively entertaining watch with a number of very effective and tense scenes, and it seems to set things up for a third movie to end the trilogy."
    },
    {
      "rating": "5",
      "text": "I'm not entirely sure why this movie needed to exist. It feels really tacked on and unnecessary. No decent storyline expansion (the 'prequel' is there just to bring in the C.Murphy's character?), no worthy new characters and same mechanics (we're walking slow and using ultrasound). Just a quick money grab there John?"
    },
    {
      "rating": "9",
      "text": "This movie is every bit as fantastic as the first one.  It is fast paced and I love the way the director juxtaposed three of the main characters as they go through their own perils.  Brilliant!  Cillian Murphy is great as the friend who takes them in when the place the family has been staying in burns down.  Fast paced and some fine scary moments.  Great sequwl!"
    },
    {
      "rating": "6",
      "text": "A Quiet Place Part II knows what it can explore, but it also has limitations that expose many of its weaknesses.From the outset, the narrative resource of the first film could not be explored in the same way again, because given that the characters finally have something with which they can defend themselves, the structure of the story changed.However the way in which Krasinski expands the story feels more like an expansion of a video game, rather than a more complete film, if you know what I mean.The tension and emotion still exist, and Krasinski manages to conduct them quite well, but he builds a climax that feels significantly forced, because he seems more interested in the comings and goings of the characters, so they can be in dangerous situations, instead of creating something more interesting or challenging.And unfortunately Krasinski ends the story suddenly again, but here feels a bit shameless because it's remarkably evident that this was made in order to prepare an inevitable third part.It seems that he got more excited about that, than about focusing on making this sequel more rewarding.I can't say I'm disappointed because I was entertained, but certainly this sequel was a watered-down experience compared to its predecessor."
    },
    {
      "rating": "7",
      "text": "Doesn't work that well as an sequel, but It does the job. A Quiet Place Part II starts with a great 10 min flashback, then picks up where we left off. Part II doesn't overstay Its welcome, and I love when movie knows what we came for. Their are some problems with character's decision making, but It builds up the world and Monsters in tiny bits. Overall still juicy. There are people worth saving, but surviving comes first. If you liked A Quiet Place, You will enjoy Part II."
    },
    {
      "rating": "7",
      "text": "First movie I got to watch back in theaters. Not bad, good jumps towards the end. Score was incredible."
    },
    {
      "rating": "8",
      "text": "Así a bote pronto, pese a no ser un gran consumidor del género, es de las mejores películas de terror que he visto, puede entrar fácilmente en mi top 5.Distancia bastante de la primera parte, aunque mantiene su esencia, pero prima mucho más el diálogo, según yo.Las actuaciones son bastante buenas, un gran salto de calidad con Cillian Murphy.Y en cuanto a la trama, está bastante guay, quizás un poco forzada, más de cara al final, pero me gusta en todas sus partes, siendo eso, la conclusión, digamos, algo abrupta.Cosas positivas: La tensión y cómo la miden, va muy al grano y no se va por los laureles, muy buen lenguaje cinematográfico y el reparto.Cosas malas: Quizás hay alguna incoherencia en el guion, y el final es algo disparatado para lo que es el resto de la película.Conclusión: Lo dicho, tendría que comprobarlo, pero quizás entre en mi top de terror, y para mí, ha superado a la primera, mucho más concisa, te cuenta lo que te tiene que contar, y ya. Recomendadísima."
    },
    {
      "rating": "9",
      "text": "Действие фильма происходит как продолжение событий, рассказанных в первой части. Эвелин, Риган и Маркус исследуют заброшенный город и встречают Эммета (Киллиан Мёрфи), который защищает от напавшего на них монстра. Затем все четверо идут в убежище для помощи остальным выжившим. Вскоре они узнают, что кроме монстров есть и другие существа…Сиквел, если что, не имеет смысла смотреть без первого фильма. Но что бы там ни случилось в финале с героями, в «Тихом месте 2» они появляются вновь в изначальном составе. На удивление, вышло довольно таки крепкое продолжение. Динамика действия и повествования создаётся благодаря параллельному монтажу. В начале — между настоящим и прошлым, дальше — путём разделения героев на две пары: мать и сын, дочь и неожиданно появившийся сосед.Красински повторяет маневрирование, которое ему чудно удавалось в оригинале, — достойный скример тут, скример там, нервирующее стрекотание ушастых чудовищ — которым здесь уделили чуть больше внимания и это только в плюс, любимый режиссёром параллельный монтаж и звенящая тишина, стоит Риган достать слуховой аппарат… и мы все с замиранием смотрим на большой экран. Поверьте, общая суматоха и ритмичность нисколько не портят картину, то в задушевных беседах кроется главная беда этого продолжения. Не хватает только гордо развивающегося целого американского флага, честно. Есть незначительные технические ляпы, без них видимо никуда.Финал у второй части «Тихого места», как впрочем и у первого оригинального фильма, открытый. А значит, третья часть не за горами, всё зависит от сборов сиквела. Я наслышан, что у Красински есть множество идей для прямого продолжения, главное чтобы всё вышло интересно и логично. Скрещу пальцы!"
    },
    {
      "rating": "4",
      "text": "I genuinely don't understand what the point of this movie was. Nothing was accomplished or improved for the family. The scariest part here was trying to eat popcorn in a silent theater, as every scare was expected and so obvious it was coming that I couldn't bring it in myself to even react."
    },
    {
      "rating": "2",
      "text": "you gave this movie 90%+ ratings on rotten tomatoes... you re giving here an 8/10...the movie standards have sunk so low, they ve now reached the core of the Earth.Predictable, cliched, unimaginative, un-stylized, flat, non-sensical (oh my god, it was so non-sensical so many times). It was Boring. Even had bad CGI.Utterly average (below-average actually). A boring drag even at 90'.Clearly a forced sequel. Clearly everyone has a soft-spot for Krasinski/Blunt couple, and their romantic movie-making getaways. I have no problem with that. Just do not rate this movie as if a masterpiece because they re cute together.It really is amazing everyone (critics and audience) gave it 90%+. That's what baffles me. Astounding.I recommend watching the movie to witness just how low we ve become with our standards culture-wise. 90%+ is essentially insane. Only children who have never seen any movies would seriously rate this 90%+. Just wow."
    },
    {
      "rating": "10",
      "text": "This movie had me on the edge of my seat. Even once finish all I could think about was the the film. I definitely would recommend if you want to have a suspenseful time."
    },
    {
      "rating": "0",
      "text": "the ending is terrible, the story is a mixture of a origins story on how the creatures invaded i felt the they kids was the most annoying parts of the movie just inviting trouble in there safe place and wandering off just dumb stuff it really took me out of the movie compared to the first movie."
    },
    {
      "rating": "10",
      "text": "Watched it tonight and I already want to watch it again.  This movie in my opinion fixed the few flaws from the first movie by showing how it all started and by having much more dialogue scenes.  It's rare for a sequel to be better than the original but this is one of those exceptions.  Looking forward to part III."
    },
    {
      "rating": "9",
      "text": "As I walked into the theater for this one I wasn't sure what to expect as I really didn't care much for the first one but wow oh wow so much enjoyment here there's scares laughs everything in the perfect summer movie it's so amazing this is truly the thriller of the year if you are like me and have no interest in the devil made me do it conjuring movie then you should definitely check this one out"
    },
    {
      "rating": "6",
      "text": "*shhhhhhhhh* This is a quiet place to enjoy a movie review. *Yelling* But that’s not really our style here at Stream To Big Screen is it?! *Normal tone* Well, this week we were able to watch the long awaited A Quiet Place Part II. Let’s just remind you of our movie review archive page and our review of Part I that occurred on Facebook. A Quiet Place: “…. Wait for tv/netflix… 6.” Simple and straight to the point. Let’s see what Part II has for us.Just a reminder from A Quiet Place, this movie is about a family trying to survive in a world infested with aliens that find people through their extreme eardrums – I mean, their enhanced aural capabilities. Thus, the world has become a quiet place where any sound could get you killed. If you haven’t seen the first part, I’d recommend watching it before checking this flick out. Do you need to? I actually don’t think so and, in fact, that’s probably my biggest knock to Part II. Question… why didn’t they just live by the waterfall again? Oh that makes too much sense? Nevermind and I digress.Let’s fast forward to Part II where the movie starts with how it all began, which is something we didn’t see in the first part. Then, we speed to where the first part left off and it’s like why the heck didn’t we just make the first part a little bit longer of a movie and combine to the two films. The first film lasted about 1 hour and 25 minutes. This movie ran for 1 hour and 28 minutes. WHY IN THE WORLD DID JOHN KRASINSKI NOT JUST COMBINE THESE TWO MOVIES?! Yes, the movie would’ve be about 2 hours and 15 to 27 minutes with edits, but it would’ve been one complete film. That just would have made more sense. Instead, it seems like these production companies went for the easy money grab and split the film into two. “Jim Halpert” was like let me get my wife paid again for this role and I’m not mad at it. After watching Part II, I couldn’t help but say combining this with the first part just makes for a better and more complete movie. I feel Part II is too long for a short movie and that’s no bueno. I’m not even saying it’s bad. It just drags on and could be wrapped up nice and tight like a formulaic “Law and Order: SVU” episode. You know exactly how this movie is going to go from the trailer and that’s the next disappointing part of the movie. Nothing unexpected occurs. Not a single thing. “Jim” literally took the dystopian, zombie world, alien we-need-to-find-an-answer-to-fight-back playbook and put it in here. I knew I shouldn’t have expected much from watching the first flick but finally being able to go back to theaters to watch movies has me hopeful. I shouldn’t have been. Just like the first part, the movie was extremely quiet and anxiety filled. The commercial and trailer make the movie feel way more intense than it really is. As tense as this movie is, the lack of sound actually makes the film also very peaceful to watch. It’s a strange combination for a “horror/drama”. Overall the cast as a whole does a solid job, but there really isn’t much to do being quiet. I feel their pain, especially my guy Noah Jupe, as Marcus Abbott. It’s just not enough.A Quiet Place Part II is just like the first one, a perfect streaming film. I’m surprised this movie didn’t premiere on Paramount+ because it would’ve fit perfectly after streaming the first part right before – and they could get more subscribers. Part II is quiet and full of anxiety but drags on and should’ve just been combined with the first film. Nothing of note really occurs in this movie to wow a viewer or make them flock to the theater. A Quiet Place Part II just like the first is a handful of popcorn, perfect for streaming. If you want to get out and support the movie theaters, like I do, or really enjoyed Part I, check this out in the matinee hours ONLY."
    },
    {
      "rating": "10",
      "text": "Take a deep breath at the beginning because you will find yourself holding it throughout. Make it the one movie you see this year in a theatre-in order to take in its brilliance -plot wise, character wise, special effects wise, sound wise and  the incredible visuals. Please don’t let another pandemic delay Part 3."
    },
    {
      "rating": "10",
      "text": "It was an impossible task to do a sequel to the first that was perfect - and with that acknowledgment in mind, this is truly a perfect sequel. Intimate, fast paced, emotional, eerily timely. There are still many unanswered questions that I hope get answered in future installments. Krasinski & co. nailed it."
    },
    {
      "rating": "9",
      "text": "A fantastic movie that is a must watch.   The sudden horror and jump scares will have you on the edge of your seat.   highly recommend!"
    },
    {
      "rating": "2",
      "text": "After a solid first few minutes felt like it was weird filler where hardly anything happens except set up a third film. Previews and end credits pad a sub 90 minute movie. Looked good to watch but what mechanical items work and don't work in a destroyed world make little sense.  Also everyone looks apocalyptic except Emily Blunt with a mostly clean sundress and makeup.  Would say that Cillian does a ton with what he's given to work with.No spoilers but it's like they watched Children of Men and at least one Cloverfield and knocked out the script in a weekend.  Can't recommend."
    },
    {
      "rating": "0",
      "text": "Waited years for this movie, TOTAL DISAPPOINTMENT. They walk around in constant fear and death and all along they have the secret weapon and don't use it.It's like watching Rambo get beat up and tortured and he has a loaded machine gun in his hands. I found myself thinking through out the whole movie, use it, use it, use the secret weapon. The story is all wrong, they could have gone a different path liberating from town to town and explored the looters and evil survivors angle further. This could have been a great time to bring back the father too, to lead them. Also The hidden message in the radio transmission why hidden? So the aliens don't know what it is? Why don't just broadcast words? We weren't told the aliens understood the language, they seem very primitive and very basic and savage."
    },
    {
      "rating": "0",
      "text": "i dont know how you guys can rate such high with this amount of retard story line going on. i guess the rating is as much illogic as the movie too"
    },
    {
      "rating": "10",
      "text": "Best movie in years ... really good . Must watch in theaters.  Honestly, I had lower expectations since sometime sequels bust but it was really good the scenes made sense and the filming was great. The actors were awesome you just as anxious as they were. Honestly wonderfully done , I can watch over and over."
    },
    {
      "rating": "10",
      "text": "What a great movie. In 4DX it's wonderful, sound design, atmosphere was actually very good, so yeah."
    },
    {
      "rating": "8",
      "text": "Though not as good as its predecessor (in my opinion due to the higher budget) it is overall a tense rollercoaster that will have audiences at the edge of their seat."
    },
    {
      "rating": "7",
      "text": "This sequel picks up immediately after the events of the first film following an opening flashback sequence that reveals when the sound-sensitive aliens first arrived on Earth and wiped out most of humanity. Truth be told, I wasn't all that thrilled with the first film like most others seemed to be, mostly cause I felt as though the concept/idea was a clever one that could've been expanded upon so much better, not to mention the abrupt copout ending (although this is before we all knew a sequel would be made). So once this film was announced, I was skeptical but hopeful that they'd build upon the world and premise of the first film in an effective way, and while there's some interesting moments and truly tense scenes throughout, the ground treaded here still felt a little too pedestrian for my liking. There isn't a whole lot in the way of concept/story development, and I was hoping for a little bit more story/background behind why the aliens came to earth in the first place than what was shown in the film's opening flashback sequence. On the plus side however, the cast does an amazing job here, with John Krazinski once again taking directing and acting duties alongside real-life wife Emily Blunt, who gives another stellar performance just as she did in the first film. Their children (played by Noah Jupe and Millicent Simmonds) also once again stand out with their performances, and newcomer CIllian Murphy damn near steals the show with his excellent performance. And once again, my biggest gripe with these films is their abrupt cliffhanger endings, and that's the case here with this film unfortunately, but overall, the film is slightly more tense than the first, perfectly acted, but doesn't do much to build upon the premise/concept with the exception of a few clever moments. Fans of the first definitely won't be disappointed though"
    },
    {
      "rating": "4",
      "text": "As pointless and meandering as the first movie with obvious set ups. The ending is also very unsatisfying. TBH, I wanted the monsters to eat everyone, that's how bad this film is."
    },
    {
      "rating": "7",
      "text": "A good movie that expands the themes of the first one. Using silence incredibly effectively is the name of the game...sometimes you can hear a pin drop, it's eery and masterfully done. The terror of not being able to make a sound really comes across. I also felt the character behaved like most people would in their situation and gave the movie a feeling of relatability. The ending was powerful and obviously left room for more..."
    },
    {
      "rating": "10",
      "text": "I enjoyed this as much as the first film, I thought it was equally inventive, it didn't do the predictable thing and expanded upon the families plight in new and exciting ways. It excels in Hitchcockian suspense and each of the tense scenes has a satisfactory payoff, especially the ending. The sound mixing is exceptional in Atmos and again really adds to the originality and inventiveness of the film.I would definitely go and see a Part 3, and will be buying the UHD when released to watch again."
    },
    {
      "rating": "8",
      "text": "La película, al igual que su precuela, te mete mucho en ambiente y te genera muchas sensaciones, lo cual considero espectacular. En cuánto a historia está bien, es más bien como una conexión a una tercera parte. Muy buena."
    },
    {
      "rating": "2",
      "text": "Spolierish, but barely or not really. So don't read if you haven't seen the movie, just in case.To me, this gets a 2/10. Most of the jump scares were predictable. And there was no point to this movie. The trailer made it seem like there was one though when Evelyn Abbott said that there are people worth saving. So it seemed like this movie was going to have a mission. Like about them saving people, or trying to, but that never happened. Nothing close to it. Instead, things actually got worse. And you would think after the damage Regan and Emmett caused that they would go back to check on the \"paradise,\" but nope. It just ends after Regan \"becomes a hero.\"And sure, young kids are stupid and will explore places even when they know it might be dangerous, but the son going off on his own, leaving a baby, and walking around when there are freaking super deadly monsters around, was so damn dumb. No kid would be that stupid. And then after it was all done, ﻿﻿﻿﻿Regan never tells his mom what happened and she never asked about it.﻿﻿﻿﻿ So damn dumb too. In the end this is basically the exact same movie as the first. Might as well call it A Quiet Place: Part II The Force Awakens."
    },
    {
      "rating": "2",
      "text": "Just as Boring as the first film and as with the first film lot’s of stupid moments, but it did manage to set up a third film, maybe this film is jus two years too late."
    },
    {
      "rating": "10",
      "text": "A Quiet Place Part II was amazing. The writing was outstanding especially the story and the character development with Regan and Evelyn. The performances from Emily Blunt, Millicent Simmonds, Cillian Murphy, and Noah Jupe were phenomenal they gave such authentically emotionally powerful performances and in scenes where Evelyn is talking about her family and trying to protect her family Emily gave such beautifully raw emotion. The visual effects are superb so creepy and real looking. The makeup and hairstyling was excellent. An A+ sequel."
    },
    {
      "rating": "9",
      "text": "A fantastic sequel to the original. The cinematography was fantastic, and Krasinski really shows a knack for ratcheting up the tension. He doesn't use the typical cheap and easy jump scares every few minutes. There are some, but they are much more effective because of the scarcity.The characters are easy to root for, and Blunt does another fantastic job. Probably a little better than the original. If you liked the first one, put this on your must-see list."
    },
    {
      "rating": "10",
      "text": "John & Emily do it again!!!! It was amazing and I sure hope John is hard at work on the next one! Need it ASAP!"
    },
    {
      "rating": "10",
      "text": "More of the same from 2018, which is a good thing, but this time the scope is broadened with a larger, more complex scenario. A part 3 seems likely, which is another good thing. I hope John Krasinski keeps making great films because Quiet Place is about the only thing I've cared about from Hollywood since Bladerunner 2049, and before that Nolan's films before he went bankrupt."
    },
    {
      "rating": "10",
      "text": "I loved this movie - enough to create an account here just to review it. I am so glad they saved it for the theaters instead of home streaming or selfishly pushing it during COVID. What a completely immersive, beautiful, emotionally and sensationally overwhelming film. It is a perfect continuation from the first film and might even be better (it is definitely at least equal, which is an amazing accomplishment in itself). Certain characters from the first are definitely missed, but Cillian Murphy and Djimon Hounsou are wonderful additions. This is, however, completely Millicent Simmonds film and I can't tell you how amazing it is to see not only positive disability representation, but an empowered, multi-dimensional female lead. Krasinski wrote an incredible character and cast an incredible actor. He didn't cheapen her at all like most big studio scifi/horror movies do by saddling her with a love interest or making her either overly weak/helpless or irrationally suddenly a superhuman killing machine. The final scene is so moving and complete with her character development. I would welcome a Part III or other movie in this universe, but if it ended here, I would be just as happy. Bravo to Krasinski, who proves himself to be a brilliant writer/director (and much more than a paper salesman), the entire fantastic cast, picture and sound editors, and cinematographer. I hope there is some awards love at the end of the year for all of the above, especially Millie, Krasinski, and those who did the sound mixing/editing. And 1000% this is a great Cillian movie!"
    },
    {
      "rating": "8",
      "text": "A bit slow to start, but the second half is fantastic. Not as tension-filled as the first film, more of an action piece and it works. Please don’t run this franchise into the ground..."
    },
    {
      "rating": "10",
      "text": "Well everyone after six long months of lockdowns we’re finally at a point where the cinemas are ready to welcome us back and boy is it good to be back. I remember 15 months ago I was eagerly anticipating the release of the sequel to the highly successful horror movie A Quiet Place written and directed by John Krasinski. Initially it was difficult to see how a sequel would work without just being a repeat of what we’ve seen before. I’ve seen enough horror movies to know that not all franchises benefit from mindless sequels just for the sake of money. After a long 15 months of waiting, lockdowns and more lockdowns I’m was finally able to sit in an actual cinema to see A Quiet Place Part II and I’m delighted to say that it’s a worthy sequel on par with its predecessor.A Quiet Place Part II begins with a flashback sequence and then picks up immediately after the events of the first film, the Abbott family (Emily Blunt, Millicent Simmonds & Noah Jupe) must now continue their fight for survival in a world of silence. Forced to leave their home they must now journey into the unknown with the threat of the creatures that hunt by sound. By now we know the importance of silence in this film and how it’s used to build the tension. From the opening scene to the end credits you’ll be holding your breath, unable to relax as the tension builds. Everything from the score and the use of sound is effective in making you jump out of your skin. The frights just keep on coming and will keep you on the edge of your seat. Make no mistake this is the type of movie that cinemas thrive on. A Quiet Place Part II develops the characters from the first movie and throws in none other than Cillian Murphy to the cast. He gives a terrific performance and was a great choice to join the rest of the cast. It’s clear that A Quiet Place I & II are in the hands of someone who understands what makes a good horror movie. Great characters with a story so intense you’ll barely be able to breathe. The tension builds and builds to a third act that thankfully doesn’t fall apart. I did not expect the sequel to be this good and it’s looking very likely that a third movie is in the works and if there’s a good story and John Krasinski is directing then I’m totally onboard for A Quiet Place trilogy.There’s really nothing like the feeling of watching a film in a cinema. It’s an experience I’ve greatly missed and online streaming sites can only do so much. Certain movies are just meant to be seen on the silver screen and A Quiet Place II is definitely one of them. Home viewing just wouldn’t be the same. So horror fans it’s time to get back to it if you haven’t already, enjoy the magic of cinema with a truly brilliant horror/thriller. Highly recommended."
    },
    {
      "rating": "8",
      "text": "Better than the original! So thrilling and intense from beginning to end! Characters and plot were good. So much intercutting but worth the watch!"
    },
    {
      "rating": "9",
      "text": "This movie is awesome! Better then the first! Great casting, and not as many holes in the plot."
    },
    {
      "rating": "8",
      "text": "Once again, John Krasinski shows audiences the power of silence to create palpable tension. Additionally, Krasinski's way of highlighting key items and dialogue that become significant later on in the film are clear signs that story elements shall not go to waste with him as the director. Without the audience knowing it, certain objects in the environment introduce some traits of Cillian Murphy's character before the family realizes who he is. There are many times throughout A Quiet Place Part II that the immediate motive of a character is unknown, and the only way of finding out is to keep watching. The classic storytelling guideline: \"Show, don't tell\" comes to mind here a lot. However, it reasonable to argue that a few too many questions went unanswered. For example: in the process of running and hiding, why doesn't all that noise attract more attention from others? That aspect seems inconsistent with the sound sensitivity in Part I. Then, at the ending, only the immediate problems had been solved, but the credits roll before the emotional payoff. This series leaves you, again, with your own imagination of what happens next."
    },
    {
      "rating": "8",
      "text": "A Quiet Place Part 2 is on par with the first movie. Taking place right after the first movie, Emily Blunt and the rest of the cast are just amazing. If you liked Part 1, then you will like Part 2. With that said, the worst part is the ending since it is basically Part 1 but on a bigger level."
    },
    {
      "rating": "10",
      "text": "Easily the best film of 2021 so far. I watched this yesterday at the Ritzy and I was blown away and it is a must that i see it again. The first one was incredible and the fact that this was better is just astounding so i highly recommend you go to watch this film as you will definitely not regret it!"
    },
    {
      "rating": "8",
      "text": "I honestly don't have anything bad to say about A Quiet Place Part 2. This film may not hold up as well as the original, and I feel that it is a little bit too short. But it still is a must-watch and has some of the best suspense out of any movie I've watched in a long time."
    },
    {
      "rating": "9",
      "text": "It's a great movie. It might be better than the first one. Good plot, pace, acting, effects. Be prepared for it to tug at your heart strings and to be startled many times. It's a good movie to see at a theater."
    },
    {
      "rating": "8",
      "text": "Very suspenseful and well made movie with classic bad decisions. The silence broken with acts of violence are awesome. Left a lot of room for future sequels.  Very good movie."
    },
    {
      "rating": "9",
      "text": "Even if there is no Cillian Murphy, A Quiet Place Part II is still a better film than the first one, the movie is more alive with more of a conversation, a little bit of drama, great perfomance by Cillian Murphy, a better perfomance by Emily Blunt and the kids, incredible cinematography and yet more intense, A Quiet Place Part II is absolutely a great sequel, i highly recommended."
    }
  ]
}