{
  "id": 89,
  "title": "A Separation",
  "starring": [
    "Michelle Sun",
    "Zhen Yao"
  ],
  "runtime": 15,
  "genre": [
    "Drama"
  ],
  "description": "On a warm autumn day in 1990, Huixian, a young Chinese woman, arrives in Florida to reunite with her PhD husband, after a four-year separation. Filled with blossoming hope and desire, she is introduced to another side of American life.",
  "releaseYear": "2019",
  "mpaaRating": null,
  "imageUrl": "https://image.tmdb.org/t/p/w500/fmngHGvRYC9wT3nEFOcVsXGp9pH.jpg",
  "categories": {
    "plot": 9.838709677419354,
    "acting": 9.764705882352942,
    "ending": 9.0,
    "soundtrack": 5.0,
    "cinematography": 10.0,
    "familyFriendly": 9.0,
    "funny": 10.0,
    "action": 9.666666666666666
  },
  "reviews": [
    {
      "rating": "10",
      "text": "This is the film of the year. Its concerns are universal. The drifting apart of a married couple and their daughter, as tensions build up and small lies spin out of control. Everyone has good reasons for what they do and their own truth which looks like lies and distortions to others. This does not add up to a harmonious life. That it all this place in contemporary Iran with its strictures and deprivations only adds to the drama as social classes and degrees of religious observance collide and clash. The characters are flawlessly acted and their imperfections completely authentic. The camera work is brilliant with frequent closeups of actors who seem completely real. There is no preaching or taking sides, the film is humanistic in its sympathy for all  the characters even when they transgress. This is movie-making at its best, reminiscent of the films that came from central and eastern Europe during the communist era and its immediate aftermath."
    },
    {
      "rating": "10",
      "text": "Have you ever been watching a movie where you could not take your eyes of the screen, not even for one second !! A Separation will show you that feeling, this film is just brilliant !"
    },
    {
      "rating": "9",
      "text": "A tragedy of errors with a very easy to see political analogy:The old father is Iran. A country with Alzheimer forgetting its own people. An incontinent regime pissing on its youth. The unborn child stands for a free democratic Iran, killed before birth. Where? On the same street where the green revolution, the embryonic state of democracy, was killed in 2011.Pregnant Razieh tries to rescue the old man/the country/her income for the sake of the future generation.The two couples stand for the majority in Iran.In spite of good intentions most of the time they lie, fight or escape the country.Too loyal or afraid to see the truth: Rashomon in Iran.Very ironic that the Iranian leaders praise the movie and don't see the obvious, like fish don't notice the sea or the five blind men can't recognize the elephant they feel. Only the children see the reality and offer some hope. The little girl plays with the oxygen levels.The choice of Termeh in the final scene is the choice the youth in Iran stands for:leave the country or stay and revolt, again.Shirin Yazdi"
    },
    {
      "rating": "10",
      "text": "Gripping and thrilling story about, simply, a family struggling to keep it together when the father is accused of a crime in which hardly anyone knows he if really did it. The writing and acting are superb, and I would recommend anyone who respects the art of film making to go see it."
    },
    {
      "rating": "10",
      "text": "Oh my God, what a masterpiece this is. I have to say that Farhadi's direction and specially his amazing writing take this film to the skies and the actors' touching and natural performances are just pitch perfect. In my opinion this films stands among the best of this decade."
    },
    {
      "rating": "9",
      "text": "A Separation is almost flawless. It can compete with any heavyweight drama in this country, or the world for that matter. The fact that there were English subtitles didn't take away from the experience at all (the mark of a good foreign film). I didn't particularly care for the ending, but the rest of the movie surely makes up for it."
    },
    {
      "rating": "8",
      "text": "this film is very brilliant.. I did not pass any time without looking the screen. I get perfect family story, and I understand something which is in my mom's head."
    },
    {
      "rating": "10",
      "text": "One of the best movies, ever. No matter how hard i try, there's absolutely nothing wrong with this movie. Just watch it, to search through some of the hardest decisions of human beings, no one is right or wrong. By far Farhadi's best movie to date and one of the 5 best movies of the century( and that is just easily)"
    },
    {
      "rating": "8",
      "text": "epic..............................................................................................................................................................................................................................................................................................................................................................................................."
    },
    {
      "rating": "10",
      "text": "I Think this Movie Have Brilliant Cast And Directing Also Have Splendid Cinematography And Editor.When You look at this Movie You Don't Think Is Movie Completely It's Like Actors Living In The Characters."
    },
    {
      "rating": "9",
      "text": "This is a phenomenal film. This is probably one of the best films of all time. This is incredible!    ."
    },
    {
      "rating": "10",
      "text": "On the surface it may seem like a simple drama , however I was pleasantly surprised to see a mix of underlying details that ultimately drive this movie to become one of the best I have ever seen. Brilliant acting, amazing directing...incredible story."
    },
    {
      "rating": "9",
      "text": "A truly outstanding movie that ratchets up the tension from jump. The acting is uniformly excellent - it presents such interesting windows into the lives of each character. The glimpse into the Iranian legal system is incredibly interesting. What I initially considered to be organized chaos actually started to make some sense by the end, as I loosed up on my western notions of how these disputes should be resolved.  It puts an incredible amount of power into a single magistrate's hands, but it sure does cut down on the red tape!  Though trusting the suspect in a murder case not to talk to a key witness as he summons her from the hallway of the courtroom seemed a bridge too far.  Then again, the judge seemed to know how to deal with the possibility of corruption in that process.  The notion of honor, as reflected in honesty - from citizen to society, and from father to daughter - transcends the legal process. At least in this case, among this group of peole. I would have liked to have known a bit more about the mother's motivation to leave the country, but it's not something that detracted from the film. This is an easy recommendation."
    },
    {
      "rating": "10",
      "text": "I was constantly attached to the masterful drama that so well executed by the relatable characters and fantastic actors. Even at face value the movie is involving and interesting, providing morally stimulating circumstances that will keep you in a trance of thought."
    },
    {
      "rating": "10",
      "text": "Superb!  I do not recall the last time I watched a film when I fully lost track of time and was absolutely immersed (without an interruption) in the story and what was happening in it.  The perfection of the acting and the perfection of the directing and editing make one feel as if what is being filmed is real life.  Bravo!"
    },
    {
      "rating": "10",
      "text": "It's one of those rare movies that every single act and dialogues are important. You won't found anything useless and if you do, be sure that you've missed something off the story. So you'll need absolutely every bit of concentration to see this.There's no judgment whatsoever during the whole movie and you can sympathize with every character. The story evolves like a piece of puzzle or a domino and the tiniest actions bring severe consequences.But what makes A Separation more than just a movie is how it's also a rummage of Today's Iran transition phase. It's a story about class-difference and how it can affect one's viewpoint toward another... If  you're a fan of Michael Haneke (and specially Cache and The White Ribbon) you'll probably gonna love this movie more than anybody else...nevertheless, It's like a layered wedding cake which everyone can enjoy depending on his/her viewpoint on life or connection with cinema."
    },
    {
      "rating": "10",
      "text": "This is a film of an intimate story of a family torn by love, duty, innocence, religion and law.  It deservedly won an Academy award as best foreign film. If you are reading this review, or considering this film, you understand the difference between a great movie and a great film. If you're looking for the former, then youâ"
    },
    {
      "rating": "10",
      "text": "A separation is a very good movie about separate between son and father ... father and Daughter ... Daughter and grandfather ... grandfather and bride ... is a movie about separate between layers family,peoples Society,peoples culture in Society,financial in people life in society and others ..."
    },
    {
      "rating": "10",
      "text": "this movie is an absolute masterpiece. most important part of Farhadi's film making is screenplay and story. he develops the plot with numerous details and he performs them while shooting. that's why such a very Iranian story and atmosphere fascinated people around the world. I think it's the best movie of the year."
    },
    {
      "rating": "10",
      "text": "A Drama that pull you deep in story. Farhadi's masterpiece which is the 1st chance of Academy Awards this year not just for \"Best Foreign Film Award\" I think its even worthy of \"Best Direction\" and \"Best Performance by an Actress in a Supporting Role\" for Sareh Bayat."
    },
    {
      "rating": "9",
      "text": "Frankly I was completely captivated and stunned by this movie. While the Oscars are rewarding \"The Artist\" a slick but shallow homage to old Hollywood the Iranians are creating a movie about real people behaving like real people with every strength and flaw exposed. The fact that it's set in an Iranian cultural milieu makes it fascinatingly educating. We get to see inside 2 Iranian marriages; the Iranian justice system; the Iranian cultural taboos and strictures.  No judgements are expressed, but we make them anyway, and like all good movies what we see is our own value system looking back at us. This is definitely a finely nuanced film as the characters move in and out of black,, grey, and white. At the end as the credits rolled many in the theatre waited hoping to get a final resolution that the director, appropriately, just wasn't going to give."
    },
    {
      "rating": "10",
      "text": "The title of this Iranian import would imply that it's about a married couple breaking up. While that's the catalyst, much more happens in this intricate sequence of events. There's lots of anguish, loud declaiming and absorbing emotionâ"
    },
    {
      "rating": "10",
      "text": "Wow. They really did saved the very best for last. It just pulls you in all the chaos that's happening ever since the opening scene. It makes feel like one of them that you would try to resolve the problem to stop all the hoopla."
    },
    {
      "rating": "10",
      "text": "The fantastic thing about this film is the compassion it shows for all of its characters. At every stage you understand exactly why everyone acts in the way they do, yet by half way through they've all found themselves in a terrible mess of their own making. As an empathetic viewer you're therefore challenged to ask - where did it all go wrong? How should we conduct ourselves in these situations? Great, adult film making."
    },
    {
      "rating": "9",
      "text": "Iranian movies can often be short on plot, but \"A Separation\" has a taut storyline and interesting characters. In there own mind, each of the characters is moral and has good intentions, but the situation at hand reveals the flaws of each ones ethos. As someone who has spent time in Tehran, I think that this movie, more than any other, accurately shows the contradictions of daily life in Iran.  My wife is a Farsi speaker and she  thought that the translation wasn't especially good, but perhaps that is true of any foreign film with a lot of dialog"
    },
    {
      "rating": "10",
      "text": "A Separation is an unbelievable movie, and probably the best new film I've seen in the last two or three years. It is a film with so much depth that I believe I will likely go back to it again and again over the years and still be surprised by the force of the acting, the beautiful camera work, the quotidian yet profoundly moving story arc, the morally difficult terrain each character must wade through, etc. This is an absolute tour de force."
    },
    {
      "rating": "10",
      "text": "This review contains spoilers, click expand to view. Most heart wrenching and one of the best movie of recent time. It is addressing so many issues without loosing site of any. Highly recommended. Perfect 100 a must see"
    },
    {
      "rating": "10",
      "text": "A riveting drama that feels so real and is so heart wrenching, that you really come to care for the characters, feel as if their decisions affect you equally. A masterpiece."
    },
    {
      "rating": "10",
      "text": "Another story from Iranian master of suspension  Asghar Farhadi  is a gripping moral and social drama set in present-day Iran. The story is not only about men and women, children and parents, justice and religion in today's Iran, but that raises complex and globally relevant questions of responsibility, of the subjectivity and contingency of 'TELLING THE TRUTH', and of how thin the line can be between inflexibility and pride  especially of the male variety  and selfishness and tyranny. Believable performances from the strong cast and crisp photography, hand-held and intimate without ever being jerky, help to seal the package and also make the movie more acceptable. Though the film lasts over two hours,good and fast-moving editing keeps the action tensely involving from start to finish."
    },
    {
      "rating": "10",
      "text": "This is the film of the year.This is the best Drama movie I have ever seen.It shows we can not judge anyone and there is no bad or good guy , (we are all gray with shadows and highlights).I recommend to see this movie , you won't be disappointed."
    },
    {
      "rating": "10",
      "text": "farhadi is a genius ...this is one of the best movies of the year...the story engages you all the way through the film...you feel like you are the judge but don't know how to make your judgement...totally nail biting..if it was nominated among the 10 best movie and best directors, it would get both awards.\rthe movie has won 43 awards so far worldwide and counting...simply brilliant..."
    },
    {
      "rating": "10",
      "text": "This is a film that makes it difficult to tear your eyes away from the screen. The raw, believable drama is interlaced in a culture where religion and pride mean everything. The acting is of the highest standard, especially the lead. The writing is consistently excellent and engaging. The tensions that exist both on the surface and bubbling underneath make for a truly great cinematic experience."
    },
    {
      "rating": "9",
      "text": "\"Wow!\". I'm genuinely surprised by how well this film turned out. I was fooled into believing this would be a dull, family drama, but 'A Separation\" is extremely engaging. Its serious, intelligent and simply a very satisfying viewing experience. The deterioration of a marriage and ripple effects it has on the family and individuals outside the family is wonderfully evoked through assured film making and a string of wonderful performances from the foreign cast. The movie flows and unfolds with good timing and closes with one of the finest conclusions of the year. This is simply a very good movie."
    },
    {
      "rating": "9",
      "text": "Amazing. At the film's core lies the conflict between Nader and Simin, a married couple seeking a separation. Simin wants to leave Iran for a better life abroad, while Nader wants to stay and care for his Alzheimers-ridden father. Caught in the middle of their bickering is their daughter, Termeh. In many ways, the core struggle is symbolic of the struggle many Iranians feel every day. Should they stay and fight to protect the country they love or leave when times get tough? Termeh's decision to live with one parent or another can be interpreted as a judgement on the director's end, regarding which parent is most justified. No such judgement is made. Many other deep moral dilemas are presented to the audience, who are then left to make up their own minds about each character's rightness or wrongness. The movie is beautifully acted, every performance feels organic and real, although that might just be the language and cultural barrier playing tricks on my judgement. At the end of the day, you really could do worse than this movie. It's one of those films that resonates in your brain days after you see it."
    },
    {
      "rating": "10",
      "text": "This is the film of the year. Its concerns are universal. The drifting apart of a married couple and their daughter, as tensions build up and small lies spin out of control. Everyone has good reasons for what they do and their own truth which looks like lies and distortions to others. This does not add up to a harmonious life. That it all this place in contemporary Iran with its strictures and deprivations only adds to the drama as social classes and degrees of religious observance collide and clash. The characters are flawlessly acted and their imperfections completely authentic. The camera work is brilliant with frequent closeups of actors who seem completely real. There is no preaching or taking sides, the film is humanistic in its sympathy for all the characters even when they transgress. This is movie-making at its best, reminiscent of the films that came from central and eastern Europe during the communist era and its immediate aftermath"
    },
    {
      "rating": "10",
      "text": "Wow! Simple plot, yet unique. Good Cast. Well acted characters from brilliantly surprising actors and actresses. Certainly a lock for Best Foreign Language Film for 2011. movienotesbook.blogspot.com"
    },
    {
      "rating": "10",
      "text": "OMG.  What a great movie. I am just blown away.  Great acting, great writing, great direction, it moves along so fluidly and shows such perception about people and their relationships.  Not a happy tale, but the best movie I have seen in a long while."
    },
    {
      "rating": "9",
      "text": "Like ....... ELLY, which won the best director award at the æ"
    },
    {
      "rating": "10",
      "text": "Extremely good. The best written and best acted movie of 2011 for me. There's such a good harmony between the script and the actors, you could doubt that most scenes were improvised, or even real."
    },
    {
      "rating": "10",
      "text": "This film is one of the best films I have ever seen. and deserves the OSCAR. Its dial with the paradox between family values and the thing that you really want as your personal values. This is real life of all of us... the combination between the things that are in reality and the ones we imagine and people think about us. I impressed in the last scene, the girls was not able to decide between her mother (that never tries to fight the problems) and her father (that his authority was not valuable for her anymore)..."
    },
    {
      "rating": "9",
      "text": "This film marks my first time steps into Iranian territory since TURTLES CAN FLY (2004, 8/10), this victory of Academy Awards"
    },
    {
      "rating": "10",
      "text": "I am usually suspective of movies that have great reviews. I've my hopes dashed too many times because my expectacions had been raised to levels that was perhaps unfair to the makers of those films. So going in to watch A Separation i already had high hopes. And, the movie exceeded my expectations. I havent't left the cinema so gobsmacked by a film for years. It's this young decades best, most thoughprovoking film. I am so glad I saw it, and now, I'm going to see it again, and again."
    },
    {
      "rating": "10",
      "text": "The movie is very complex and really breathtaking! You need to watch this a few times and each time you meet a new layer and discover about hidden allusions or facts that you would not have noticed in the previous view. A deep and meaningful screenplay, very well acted and an amazing camera movement. The editor has done a great job as you could almost not find a useless scene in this film."
    },
    {
      "rating": "10",
      "text": "Masterpiece, brilliant, simply i just cried 3 times as I was watching this movie...Simply i can sayIf mainstream cinema leaves you soulless, see this film. If you have a modicum of intelligence, see this film. If you like great acting and directing, see this film. If you like great writing and editing, see this film. If you have an interest in law, see this film.If you are a parent, see this film."
    },
    {
      "rating": "10",
      "text": "It really is an Excellent movie, this was one of the best movies I ever saw. 10/10 great movie from directing and screen-writing point of view, and we should not forget the great job of the actors my favorite character was Peyman Maadi, he did an awesome job in this movie, They also try their best to show the regular difficulty that Iranians have in their daily lives, which makes it more interesting for people around the world."
    },
    {
      "rating": "10",
      "text": "The best film ever which has a very complicated structure full of details.Excellent work. It shows a medium level family dealing with their own problems and face the problems caused by a poor family."
    },
    {
      "rating": "10",
      "text": "I say :  Fantastic of Year is hear !! and when i saw about elly , the past film of farhadi , is SO amazing , that have a real mystery like rebeca of hitchkak !!! I like both of them ( a separation and about elly) , because mystery is fantastic !!"
    },
    {
      "rating": "10",
      "text": "now, this is a great film. some may find it slow, but it is incredibly thrilling and keeps you interested all the time, not to mention that we don't get to see a movie like this every day. stays in memory and gives you something to think about."
    },
    {
      "rating": "9",
      "text": "A great view into human emotions through a foreign lens. The emotions are real and the way of life is different but you will walk away pleased with what you saw. Great movie."
    },
    {
      "rating": "10",
      "text": "Very Good WritingVery good ActressIts Different Movie.Bravoo Asghar FarhadiIt was worthy of an Win OscarI had never seen a long time same a film"
    }
  ]
}