{"id": 3092, "title": "A Shaun the Sheep Movie: Farmageddon", "starring": ["Justin Fletcher", "John Sparkes"], "runtime": 87, "genre": ["Comedy", "Animation", "Family"], "description": "When an alien with amazing powers crash-lands near Mossy Bottom Farm, Shaun the Sheep goes on a mission to shepherd the intergalactic visitor home before a sinister organization can capture her.", "releaseYear": "2019", "mpaaRating": "G", "imageUrl": "https://image.tmdb.org/t/p/w500/p08FoXVFgcRm5QZBaGj0VKa2W2Y.jpg", "categories": {"plot": 4.666666666666667, "acting": 0.0, "ending": 5.0, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 5.0, "funny": 7.25, "action": 5.0}, "reviews": [{"rating": "9", "text": "For all the family to watch. A new movie from Shaun the Sheep that is very funny."}, {"rating": "10", "text": "Shaun, el cordero: Granjagedón (2019)Sinopsis:Unas extrañas luces planean sobre el cielo de Mossingham anunciando la llegada de visitantes de una lejana galaxia, pero en la granja Mossy Bottom la oveja Shaun y el resto del rebaño siguen haciendo de las suyas, muy a pesar de Bitzer, su perro pastor. Tras esta incursión, una adorable extraterrestre de asombrosos poderes se queda en la Tierra, y la oveja Shaun intentará salvarla.Opinión:Anoche estuve viendo la primera película y se ganó mi corazón, hoy vi esta secuela y es igual de maravillosa, ambas se han convertido en mis películas animadas favoritas, me llenan el alma de una manera que no puedo explicar.EXIJO UNA TERCERA PARTE YAA"}, {"rating": "8", "text": "Not quite well inspired as the previous, but the effort for watch is worth via the witty cult references of the fiction genre, including one direct from Pixar studios. The parade of tributes includes a cameo of Wallace & Gromit. For make the day for the animation genre in this quarantine."}, {"rating": "0", "text": "What in the name of GOD is this crap and how in the name of Ala is it getting such good reviews!!?? Like, is everybody on glue or what!? So, I'm just suppose to sit here and watch a cast of totally unwatchable characters make a bunch of random noises for an hour and a half!? Watching wet paint dry is more entertaining than this waste of film! The very existence of this picture is a cinematic SIN!"}, {"rating": "7", "text": "Goooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooo"}, {"rating": "8", "text": "The Aardman folks have been cranking out their distinctive brand of quirky animations for years. This newest installment in the Shaun the Sheep series doesn't disappoint. The idyllic life of the farm creatures is disrupted when an alien lands…and a cute one at that. The fast-paced adventure is loaded with witty gags and wacky characters, including the funniest android/robot comedy bits ever. There are some sweet moments that actually tug at the heart. Overall, it’s a delightful and charming experience for anyone who enjoys engaging animation. NOTE: Sit thru all the credits: 1 gag midway and an extended gag at the very end."}, {"rating": "6", "text": "Aardman Animations' work is charming as ever. The story is as childish and predictable as you would expect, but that doesn't mean it isn't fun. Look for all the sci-fi references!"}, {"rating": "5", "text": "Has some nice humour and Aardman's great animation but the formula is getting pretty stale."}, {"rating": "8", "text": "Fun and quirky, an easy to recommend family friendly claymation with a surprisingly engaging story for a movie without dialogue. Me and my son both chuckled alongside Shaun throughout."}, {"rating": "6", "text": "Ci sta.Personalmente, preferisco Shaun e il resto del cast in contesti più terra-terra, come nel primo film. Ma qui c'è sempre l'impegno e lo sforzo di uno degli studi d'animazione più sottovalutati che abbiamo. Se non ci fossero dei cliché di troppo, sfortunatamente dettati dal genere fantascientifico a cui appartiene, avrei detto che mi ha fatto molto più ridere rispetto al primo capitolo. Rimaniamo in campana e vediamo cosa ci serviranno in futuro i signori della Aardman.Consigliato? Sì, e vi sfido a cogliere ogni citazione di vecchi film sci-fi che il film fa."}, {"rating": "7", "text": "Es una buena aventura con Shaun la oveja; la trama es decente y la animación en stop-motion es excelente; es recomendable si eres fanático de las películas de Aardman."}, {"rating": "5", "text": "As someone who thinks Shaun the Sheep is arguably Aardman's greatest character, I was somewhat disappointed in this effort. It came across as a tad dated and cliched."}, {"rating": "10", "text": "Usually a movie shows and tells a story. In the world of Aardman Studios' stop-motion animation, there is no telling but showing for the first three minutes within the introduction of the protagonist(s) who use their gestures for, just like in \"Chicken Run\" and \"The Curse of the Were-Rabbit\". However in this farm-environmental flick, this no-dialogue implement is not used for the first three minutes of the film, it is used for the entire eighty-five minutes. This artistry reminds of a \"Tom and Jerry\" cartoon where the precocious mouse and the inelegant cat do not use verbal communication on screen, just like Gromit the dog and by all means, in our world of lucidity. I did not put on such a large grin on my face to an Aardman film like this since \"The Curse of the Were-Rabbit\" and I think Aardman studios are well on their way to bringing back their respected faith to the public eye."}], "recommendations": ["flushed_away", "madagascar", "shaun_the_sheep_movie", "hotel_transylvania_3_summer_vacation", "chicken_run", "penguins_of_madagascar", "the_lego_ninjago_movie", "cloudy_with_a_chance_of_meatballs_2", "the_boxtrolls", "the_lego_batman_movie", "america_the_motion_picture", "antz", "looney_tunes_back_in_action", "puss_in_boots_the_last_wish", "storks", "rango", "smurfs_the_lost_village", "who_framed_roger_rabbit", "madagascar_escape_2_africa", "shark_tale", "ratatouille", "ice_age", "monsters_university", "hotel_transylvania", "the_lego_movie"]}