{"id": 2597, "title": "A Simple Favor", "starring": ["Anna Kendrick", "Blake Lively"], "runtime": 117, "genre": ["Crime", "Thriller", "Mystery", "Comedy"], "description": "Stephanie, a dedicated mother and popular vlogger, befriends Emily, a mysterious upper-class woman whose son Nicky attends the same school as Miles, Stephanie's son. When Emily asks her to pick Nicky up from school and then disappears, Stephanie undertakes an investigation that will dive deep into Emily's cloudy past.", "releaseYear": "2018", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/5EJWZQ8dh99hfgXP9zAD5Ak5Hrn.jpg", "categories": {"plot": 6.147540983606557, "acting": 6.155555555555556, "ending": 5.882352941176471, "soundtrack": 6.0, "cinematography": 5.333333333333333, "familyFriendly": 3.0, "funny": 6.7105263157894735, "action": 5.833333333333333}, "reviews": [{"rating": "7", "text": "Stylised, self-aware, and hilarious - a (mostly) enjoyable parodyA semi-comedic look at the lives of two young mothers in an affluent American suburb, coupled with a mystery plot, A Simple Favour has an undeniable identity crisis due to its genre mash-up characteristics. Although director Paul Feig proves adept at handling the parodic side of things, in the latter stages, he seems to be trying to ensure the film can exist (relatively) un-ironically within the suburban noir genre, the very genre it's attempting to lampoon. Despite this schizophrenic quality, however, it's an undeniably film.Adapted by Jessica Sharzer from Darcey Bell's 2017 novel, A Simple Favour tells the story of Stephanie Smothers (Anna Kendrick), a widowed single-mum who runs a life hacks vlog with minimal viewership. Enter Emily Nelson (Blake Lively), a public relations executive for a major fashion label. Soon after meeting, the two bond, with Stephanie in awe of Emily, who seems to have it all; a good-looking novelist/lecturer husband, Sean (Henry Golding), a gorgeous house, a successful career, a great kid, and an acerbic attitude that Stephanie would kill for. Several weeks later, with Emily held up at work, she asks Stephanie to pick up her son, and she'll collect him later. Except she doesn't collect him. As a few days go by, Stephanie and Sean report her missing. However, unsatisfied with the direction the investigation is taking, Stephanie is soon amateur sleuthing her way across the country.A Simple Favour is at its best when working as a parody of \"mommy murder mysteries\", gently (and often not so gently) exposing some of its more unrealistic tropes to ridicule. For example, the three main characters are all generic templates to the point of cliché; the ingénue who feels honour-bound to do everything she can to find the truth; the sardonic and caustic plot catalyst, who always seems to have an ace up her sleeve; and, the brilliant but frustrated spouse who may, or may not, be in on the crime. However, their archetypal characteristics are dialled up to such a degree that they can't help but seem caricatures.Opening with a late Saul Bass-esque title sequence, scored to Jean Paul Keller's \"Ca s'est arrange\" (1967), the film signals its playful tone right from the off. The emphasis on stylisation is perhaps seen most clearly upon Emily's introduction. As Stephanie shelters from the rain, Emily emerges from a car in slow motion, with the camera starting on her feet before slowly moving up to her head as she raises an umbrella. Cutting to a mid-shot, she then begins to walk across the carpark (still in slow motion), as a broken umbrella blows past her, replacing the tumbleweed of a classic western shootout. Apart from being a memorable introduction to the character, the visual design of the scene is predicated on cine-literacy, showing that the filmmakers are more than aware of standard genre tropes, and, more importantly, how to employ them for comedic effect.Indeed, the entire film revels in its own intertextual awareness, with later references to such defining noirs as Gaslight (1944), Spellbound (1945), and Les diaboliques (1955). Large portions of the film feature narration within narration, a technique so beloved of classic noir mysteries.If there was one element of that didn't work, however, it was the mystery plot. I get that it's all a satire of the multi-twist-for-twist's-sake suburban murder mystery, with the preposterousness of such plots played for maximum farcicality. However, Feig is unable to bridge the tone of the frothier comic moments and the darker ones which become increasingly prevalent towards the end. For example, the film features a scene in which someone who has just been ploughed by a car and is trying to crawl away is nonchalantly told if they don't stop, they're going to hurt their knees. That's pretty dark, but it's also pretty funny. However, it comes only moments after a scene in which a drug-addict is held under the water and drowned. Not a huge amount to laugh at there.For all that, however, I found A Simple Favour most enjoyable. The purely-satirical early scenes earn enough goodwill so that the more plot-heavy later scenes don't completely tear the whole thing down. The film as a whole shines a not unwelcome light on the increasingly self-important suburban noir, and for the most part, the parody is very well judged. When the comedy is forced to retreat in the service of more serious material, the tonal balance is definitely knocked off, but despite this, A Simple Favour remains very entertaining. It won't change your life, but it's a rewarding couple of hours."}, {"rating": "8", "text": "Fun movie! Stylishly done; amusing; gorgeous to look at with great-looking clothes, houses and humans; and with more tart twists than a barful of perfectly chilled Martinis, \"A Simple Favor\" is a very entertaining popcorn thriller. Good soundtrack, too. One tiny critique:  For me, towards the end, some of the twists came so quickly that my feeble little brain was spinning. I wished they had spent a little more time on them... Cuz I was a little like \"Wait, what?!?\"  The switcheroos were zooming by like Vroom--Vroom--Vroom! And OK, I will admit: I got home and Googled the synopsis to make sure I hadn't missed anything.  Vanity Fair had an article called \"About that ending...,\" so I don't feel too bad about feeling a little fuzzy-headed. Perhaps the book was a little more elucidating, I dunno. But I loved it!"}, {"rating": "7", "text": "Tonal inconsistencies and glaring \"Gone Girl\" parallels aside, I had a good amount of fun with \"A Simple Favor,\" a comedic thriller from frequent Melissa McCarthy collaborator Paul Feig. Was this the correct project for him to direct? I'm still not so sure, as there are -- as previously mentioned -- a number of elements here that just simply don't work together for me. This is much more of a thriller than a comedy, as the comedic stylings seem almost randomly placed into certain scenes to offset a lot of the dramatic intrigue. And it just doesn't gel together. This should have been a straight-laced thriller. But, even if that were the case, you'd end up running into a bigger version of the other problem with this movie -- this is supremely similar to \"Gone Girl.\" There's even a scene in here that's borderline lifted from that film. Again, this isn't perfect, but it is fun, featuring terrific chemistry between Anna Kendrick and Blake Lively, and a real neat final act."}, {"rating": "5", "text": "This film is a politically correct quagmire of a movie. The story itself is trite and predictable and the movie had a ton of plot holes. Plus, you can tell the producers or the multicultural team wanted to blatantly throw in all kinds of people just to save face. You have the main actor as a yellow dude, who is married to a Caucasian woman, yet their kid (this annoying yellow kid) looks nothing like the Caucasian woman at all which makes no sense. Then on top of that you have the yellow dude bed both Caucasian woman which seems to me like they want to push interracial dating on the masses. The funniest part of the PC agenda in this film are the random brown people thrown in who serve no purpose to the story. There's one woman and her kid who is just sort of there, and the few lines she does say make her sound unsure of herself (but not in a funny way, more of an \"I can't act and I was only put her to represent brown people\" sort of way.) And then there's another random brown girl thrown in who works at the front desk of a company. Again, she doesn't really act, she's just sort of there.    And then of course you have a token gay guy thrown in and a bunch of black actors and the author and screenwriter are both female.   Yeah, if you're not a fan of PC stuff I would say to avoid this movie like the plague as it's not a good movie to begin with. You can't trust critics on sites like Rotten Tomatoes as they're usually liberal types who like this sort of thing or they've been given bonuses to rate certain films favorably."}, {"rating": "9", "text": "Now I have to give props to Blake Lively and Anna Kendrick, who did spectacular jobs in this film. They both could easily play off of one another like yin and yang. Both actresses gave it their all in these roles and you can easily see that. Anna probably had the most captivating one of them all . You see her struggle to try and find her friend and at the same time be a good mom to her kid, and she just did a great job of portraying that struggle . Another thing that this movie did great  were  the costumes. I don’t usually talk about the clothes but they had to be mentioned for this film. All of the outfits were marvelous and deserve a nomination for the costumes. They also were like characters on their own. They also helped in showing character arcs and growth,  mainly for  Anna Kendricks clothes. I also really liked the musical scores. It helped you understand the tension in some scenes. Now some thing that could be fixed is how the  film felt like two different movies to me, and not in a good way. The first half of the film just felt really slow to me, which is understandable due to it introducing the characters, but the other half was way more interesting. The second half was more intense and had me on the edge of my seat. There is a plot twist that is very obvious about what it was going to be. In the end, “A Simple Favour” was a surprisingly enjoyable film — one that I think a lot of people would like."}, {"rating": "7", "text": "A Simple Favor has funny punches which the acting partners deliver well. The cinematography is fine. In \"Style and Medium in the Motion Pictures\" Erwin Panofsky poses, \"…that the screenplay, in contrast to the theater play, has no aesthetic existence independent of its performance, and that its characters have no aesthetic existence outside the actors,\" which I think is an interesting and valid point that I will make sure to more consciously consider with every viewing of a film. Do I completely ignore the female body throughout the film? No, I'm not going to. There are a lot of pretty, beautiful, and gorgeous women in the world, for a variety of their reasons. Yet, attraction needs assistance. I'm a single male. The song \"Man in Me\" by The Persuasions comes to mind whenever I think of Blake Lively playing her role in the film, not because she is doing that for me, but because it'll be amazing to attribute that song to a woman that does (in accompaniment with \"Do It Again\" by The Staple Singers) affect me in such a way (not in the conniving-illegal-murderous sense). A Simple Favor touches on very sensitive topics such as alcoholism, drug abuse, depression, debt, fraud, incest, illegitimate children, and childhood in a touch-and-go comical-drama-full whirlwind. The story is decent though seems to scatter about in a way that still makes sense (because it's like a walk through of a to be mystery with surprises as no surprises bent on surprises…yeah). A Simple Favor is an awkward film that really has a way of crushing vices.I think the film uses hysteria to flirt with its audience members. The film gets messy (which makes sense in accordance with context), and I think another title may be more suitable. Nonetheless, A Simple Favor is entertaining.Overall Grade: C+/B- - K.D.If you're into Poetry and other bits of creativity, check out my Instagram: @Dufreshest."}, {"rating": "5", "text": "A Simple Favor 2018 -What starts out to be fresh and dynamicbegins to fall in upon itself when one ofthe founding layers is taken away.-Superb writing that turns cliche later on-Anna Kendrick keeps playing the sameinnocent, naive turned witty and cunningcharacter in dramas-This should have been a PG-13 tale ora harder R, which would have made iteasier to overlook the disastrous ending.-The first 20 minutes of the Blake Livelycharacter is worth sitting through theremaining 95 minutes"}, {"rating": "7", "text": "Do you like a comedy/mystery or a mystery/comedy? How about a fashion show with Blake Lively wearing more sharp 3 piece suits than any man has ever worn in one movie? Why not a modern home that just yells “MONEY”?  Anything against a cute boy using the F word and getting laughs? How about a ‘better than you will ever be’ fashion designer? How about all these in one movie?In “A Simple Favor” over volunteering single mother Stephanie (Anna Kendrick) is thrilled to be befriended by successful, busy Emily Nelson (Blake Lively) and is more than willing to pick up her son after school which soon becomes a habit. It doesn’t take long for one day Emily does not show up to pick up her son and, after 4 days, Stephanie not only becomes a mother to Emily’s son and become concerned about Emily’s husband Sean (Henry Golding) but also decides to search for her friend.“A Simple Favor” is not only about a murder, husbands, wives, friends, kids but also having fun watching a movie, being confused by what is happening, not being sure what happened and leaving the theatre with a smile on your face, not caring that you really didn’t understand all that went on and fifteen minutes later forgetting all about it.Anna Kendrick, as Stephanie, who does a home vlog every day, has that goofy act down to the point that gets every laugh, even those not written in the script by Jessica Sharzer. Blake Lively as Emily has different looks in the movie aided by costume designer that keeps your eye on her and makes her believable whatever persona she chooses. Henry Golding, in this his second movie, shows he was no fluke in “Crazy Rich Asians” and looks better in jeans than any man has a right to!Joshua Satine as Stephanie’s son and Ian Ho as Emily’s kid with the potty mouth are fun while Andrew Rannells as one of the parents at school aids and abets Anna Kendrick in the comedy department while Bashir Salahuddin as a detective, Rupert Friend, as that snobby fashion designer and Jean Smart in her second blink and you’ll miss her appearance all make this a comedy/mystery and mystery/comedy movie.I recommend “A Simple Favor” if you want to have a laugh with Kendrick, watch Golding’s career rise, maybe have a martini served in a frozen glass and a lemon twist added with Lively or just a movie that asks you do nothing more than sit back, laugh and, maybe, figure out the twists and turns of a murder."}, {"rating": "10", "text": "I really enjoyed every minute of this movie. Well acted, the story is good and it all fit together very nicely. Do yourself a favor and watch this movie before it get's spoiled for you..."}, {"rating": "9", "text": "It's like someone said \"Allison (from Orphan Black) needs her own movie...\" and what we got was Anna Kendrick and Blake Lively killing it.Everyone has chemistry and the movie is Laugh Out Loud funny from beginning to end. I could hear all the surprised people leaving the theater like 'THAT was a good show'It's not super deep, it's a light hearted noir with a touch of Hitchcock suspense."}, {"rating": "6", "text": "It starts as a genuinely compelling mystery with sharp humor but it slowly rolls over the finish line as a disappointing neither-nor: the laughs destroy the suspense and the audience is too busy trying to wrap their minds around the ludicrous story to enjoy the jokes."}, {"rating": "6", "text": "Fun at times and Lively turns in a darkly comedic performance, it’s just the film thinks it’s a little more smart and Gone Girl-esque than it actually is..."}, {"rating": "9", "text": "I thoroughly enjoyed this film. It is fast-paced, witty, and full of surprises. The cast was excellent, especially Anna Kendrick and Blake Lively, both of whom were fun to watch and totally believable in this twisty comedy. Henry Golding gives another elegant comic performance, just as he did in Crazy Rich Asians. A great summer “escape” film to make you forget the awful heat and humidity outside. I look forward to seeing these three accomplished comic actors in another film soon. Or seeing them in this film again on DVD."}, {"rating": "9", "text": "Comedy folks.  And it all works thanks to the superb 2 female leads. The fashion is simply outstanding. If you like seeing stunning fresh lovely dresses on clever movie stars giving unique comedic performances....and you absolutely SHOULD like those things...then see this movie."}, {"rating": "3", "text": "What was meant to be a noir/comedy thriller, is lacking in suspense, humor, and interesting story line. The start off the movie had potential for an twisted rendezvous between two women with odd backgrounds, but ends in an obvious and dull ending. Personally the movie felt uninspiring and just tedious."}, {"rating": "3", "text": "Sure, it’s got lots of pretty clothes that would be the hotspot sale on Black Friday. Sure, it’s got Anna Kendrick, whom many say is a role model because of her outer beauty. But you know what? Neither of those things matter, because they’re relied on to hold up a film high in fructose. The sugar of A Simple Favor may taste sweet, except the rush of its evil intentions churns regret once your health turns detrimental after swallowing its poorly put together eye candy.​At least the candy does look sweet in its display case; the makeup crew demonstrate tremendous effort to bring out Anna Kendrick’s beauty with or without mascara. The costume designer Renee Ehrlich Kalfus (The Cider House Rules, Hidden Figures) also complements the Pitch Perfect star well while keeping it supportive toward the narrative. Kalfus dresses Anna in a big yellow jacket to divert our attention from any covered-up intentions, just one of the many popping colors that complement the film’s desired retro style. The look remains consistent right from the opening credits that flash against zesty Spanish music, carrying on these sharp colors to contrast two sides of our ideal 2018 American woman.On one end, there are Anna Kendrick’s cutesy Pinterest mom DIY projects. On the other, there is Blake Lively’s aesthetics of a woman paid more than a man. Now as for the costar’s character, Blake first appears with high heels pounding on wet cement, a growing image of sophistication that still can’t match the size of her secretive closet. Between these two, they supposedly become close friends after knowing each other for just a couple of days, as represented by a friendship bracelet Anna makes for Blake. No, it doesn’t matter if Blake has a painting of her “pet beaver” in the living room, there’s just something about these two that meshes well.There’s where the problem with this film starts.The two leads’ “close” friendship of what looks like two days is never believable, mainly because of the awful writing void of any believable grief that gives neither actress any depth to work off. Blake Lively’s character is merely overpowered, but even if this had the best writer in the world, it wouldn’t help much. Blake just puts on her own show without any chemistry with anyone in the cast. Odds are, she decided to play a mother who chugs alcohol around little kids by merely acting as if drunk on a typical Saturday night.In fact, there was probably some alcohol hopping all over the sets during the production, as it appears these producers like to annihilate a child’s innocence by making one little boy drop an F-bomb hard. That’s fine if it serves story purpose, except it doesn’t, it just comes off forced and lazy, and nobody seemed to bother giving the child actor any context of what he was screaming.There literally is no other attention to story anywhere else, as one missed opportunity for clever symbolism sticks out: after one police officer mentions following metaphorical bread crumbs to solve a case, the very next scene features Caesar salad with bread crumbs in it. It tries to connect to a Hansel & Gretel scenario where Anna feels like the two children inside Blake the witch’s mega-expensive gingerbread house of a home, unfortunately that piece of symbolism has no payoff. In addition, many unnecessary flashbacks get explained again the same way immediately after thrown into the final edit. As if the storytelling isn’t lazy enough, Anna claims to be a “struggling” single mom—yet can purchase expensive technology for her mommy vlog… and the occasional spy equipment. Can’t make this stuff up, folks!In most every role Anna plays nowadays, she’s either a clueless love interest (like in The Accountant) or “Slutty McSlut-slut,” (like in Mike and Dave Need Wedding Dates) but here, Anna combines the cluelessness with the sex-object in a way that thinks it’s so classy. Part of the problem is that most of the project’s other creative minds have comedic backgrounds, resulting in a collaborated direction that moves too quick, and Anna, unfortunately, being the leading role, gets the last laugh. If these producers wanted to cast her purely for the marketing, they didn’t even do that right! Case in point: the little black dress Anna wears in the poster is never shown in the movie itself—just a longer version of it. Hey, got to show those legs to lure in those box office numbers!There truly is evil lurking everywhere in this wannabee thriller with an ultimate intent on not suspense, but advertising whatever the celebs are wearing. So, do yourself A Simple Favor by avoiding this Macy’s commercial."}, {"rating": "6", "text": "Not bad. But plot holes and inexplicable behavior abound. The performances are all really good and I like the little kid who curses a lot. Anna Kendrick is super cute and funny and one day we will be married but Blake Lively is a bit much and her character hedges too much."}, {"rating": "7", "text": "A unique film that kept me interested from start to finish. Both Kendrick and Lively give great performances especially Blake Lively who's comedic ability shines through here. Big credit to Director Paul Feig as well who is able to mix genre and tones quite nicely here which isn't that easy. Overall this was a good time and a high 7 a B+."}, {"rating": "7", "text": "It's not an amazing film, and somewhere along the line it gets a bit boring with its sluggish pace in the middle part of the movie, but it is enjoyable. Blake Lively gives an amazing performance. Watch it and see for yourselves"}, {"rating": "8", "text": "Paul Feig managed to make his own version of Gone Girl mixing a bit of War of the Roses for good measure. It's nice to get a different kind of film from Feig, that not only has humour but also is tense, deep and has his trademark of strong female protagonists."}, {"rating": "8", "text": "Bravo for such an original screenplay which elevated my grade but at the same time I thought there were too many spit balls thrown at the wall to try to fill in space."}, {"rating": "0", "text": "Un film qui semble appétissant, au moins pour ses deux protagonistes principales, l'adorable petite brune et la grande vampe blonde, une sorte de fantasme sexuel sur pattes (à 4 pattes je veux dire) très lively en effet. L'antinomie de caractère et de fascination réciproque entre les deux copines semble d'ailleurs suggérer une belle amitié lesbienne mais il n'en est rien, hélas...Excusez mon machisme, je vois du cul partout... surtout quand je m'emmerde dans un film à la con qui mélange les genres et se mélange les pinceaux dans un scénario très prétentieux, très lent, alambiqué et foireux qui tente d'imiter ou plutôt de singer les thrillers déjà vus et passés, allant même jusqu'à citer \"les diaboliques\" (sic !).Mais cette grosse merde n'a rien de diabolique, car elle hésite entre la comédie, le drame et le thriller, le suspense... et la sitcom ! Le tout est imbuvable et carrément grotesque... et tellement chiant qu'on ne tient pas jusqu'à la fin, loin de là !"}, {"rating": "3", "text": "The movie isn’t intense, funny, scaring, and it’s predictable. The begging was actually pretty good. The characters are interesting and the story isn’t bad. The acting was fine as well. The middle of the movie had some intense scenes, but other than that it was boring, unfunny, and bland. The ending was pretty predictable as well as hard to believe any of it could happen in real life. The ending wasn’t intense either. I didn’t enjoy it, and don’t recommend people to watch the movie."}, {"rating": "7", "text": "First 1/3 is slow. Middle 1/3 is mildly interesting. Last 1/3 is just comical."}, {"rating": "10", "text": "A Simple Favor was better than I could have ever imagined. The story and plot was so twisty and cool. The whole time I never knew where the movie was going next. It was amazingly unpredictable. Blake Lively and Anna Kendrick's performances were stupendous and Henry Golding gave an fantastic performance. A+."}, {"rating": "6", "text": "to walk that thin line between sinister ideology and sketchy sequences..A Simple FavorA Simple Favor is a plot driven dark comic thriller about two newly befriended eerie mothers through their kids, whose chemistry results into explosion of cheats and tricks and even death. The chemistry is off the hook, it is almost like a dream team waiting to be allotted in a project, Kendrick and Lively are electrifying whenever they are on screen, they are funny and equally scary. This deeply sinister genre fuels on nothing but perspective, with a twisted mind set, it not only sets all the chess pieces accordingly, but draws in the most unexpected cards under its sleeves with justification and of course slick panache that makes you nod, in its self-created web of lies, on beat. Somehow, the combination of music and references to all the recipes goes well, Kendrick has the range to act like a typical overprotecting mom and obviously to rap with a mic-drop attitude that she has been carrying since Pitch Perfect. If actually taken into consideration, she sticks by on each frame of the feature and pulls it off all on her shoulder without even flinching for a split second. She learns fast, she takes time, she argues on petty thing and she cracks lame jokes, Kendrick is in her A game and this time she has got this three dimensional character that she is drunk on. On the other hand, Lively feels shadowed in Kendrick's footsteps, no matter how much power her character must possess, she somehow never feels the one in charge. The conversations are pragmatic, even the murmurings and tiny notions creates an everlasting impression, especially in its initial stages. The narration often surfs through various periods and is almost busy in itself to wait and breathe it all in, and this is where Feig comes in, his finesse on weaving out a nail-biting confrontation or close calls amps up this somewhat scattered script. Fieg has always had the potential to walk that thin line between sinister ideology and sketchy sequences, and this time he is armed with too much content to handle. His actual job in here is to extract all the crispy material and offer it a more personal touch to connect with the viewers, and he has brimmed the entire feature with such husky bits. The songs are up beating, the sound editing is impressive if not the background score, the cinematography is decent along with the editing and has calm and soothing camera work with stunning bright visuals. The narrative is gripping, adaptive and can be inedible at times, but the correct advice would be to nod along since most of the skipped steps are later closed in by accounting it into a circle. The tightly packed screenplay that keeps enfolding newer perspective and revealing and appealing characters as it ages on screen, Kendrick at the heart of it whose range never disappoints us and, Feig's long lasting passion whose euphoric energy never wears off in any frame, are the high points of the feature. A Simple Favor is neither simple nor a favor, it is convoluted to the core and a generous gift by Feig to these genre lovers."}, {"rating": "6", "text": "Anna Kendrick plays a sweet mom who gets embroiled in a murderous mystery, when her new friend (Blake Lively) disappears. Both women create fun characters (and wear some great looks), but the plot's twists aren't really that surprising, at least not the way director Paul Fieg stages them. He's best known for his comedies featuring strong women (\"Bridesmaids,\" \"Ghostbusters,\" and \"Spy\"), but this foray into darker realms is more lighthearted than tense. Even though it's seldom truly funny, it still manages to be entertaining in a fun, frothy style."}, {"rating": "8", "text": "A Simple Favor is not as predictable as most movies. The general direction was pretty obvious, but there are quite a few twists in there to keep you entertained and guessing a least somewhat. It's funny at times and quite engaging. The ending was a bit too much but hey, no movie is perfect. Still, you could do a lot worse than watching this movie. Pretty darn good."}, {"rating": "6", "text": "A lot of regulars here have included many of the observations I'd make, so I'll add this: the film's beginning writes a check that the end bounces. It's a decent setup but falls apart in its execution, especially at the end where the twist-after-twist leaves you shaking your head and mumbling, \"so so stupid, ...\" It had real potential and in the hands of a director who knows what they're doing, would've been an awesome insurance-fraud-gone-wrong tale. Instead, it's a disappointing JV production. (Reasonable ratings for \"A Simple Favor\" are 4-7, anything more are shills or hyperfans of the stars.)"}, {"rating": "5", "text": "Kendrick! Hands down got this film up and going almost the whole entire movie.  But I dont think this movie deserves the rating that its getting simply because it is not intelligent enough to be a mystery nor is it scary enough to be a thriller and definitely not funny enough to be a comedy."}, {"rating": "7", "text": "Good film, Blake Lively is fantastic in this. Tries to take bits from Gone Girl and sticks the landing, most of the time."}, {"rating": "7", "text": "Four star style meets three star story.  Bonus points for making pseudo incest kinda hot."}, {"rating": "7", "text": "Interesting and fun movie, a bit fun and also a bit of a thriller, even though towards the ends some things became a bit too predictable. Good actors and nice to watch."}, {"rating": "7", "text": "It's not Fincher, nor Hitchcock, it's Feig playing at both filmmaking maestros in his newest, twisted psychological chick noir.  \"A Simple Favor\" is, in sum, a stylish, tolerably hyper-twisted psychological crime thriller that places Feig in a gracefully attractive laboratory of genres and tones. Truly great horror-comedy feature films are one of the most hard-to-find cinematographic feats these days; however, narratively and structurally, fusing seriously funny comedy in the narrative tidiness of a whodunit is even more meritorious to praise, a surgically handled work that only an expert on the mechanisms of these genres can achieve; here's a proof.One of the strongest hooks for this domestic noir is the daring style on the divas' attire specifically. Undeniably, the sizzling fineries Lively models with panache during the first two acts and Kendrick, self-indulgent, inherits in the last act pop up on the screen as another à la mode main character. Each of these overwhelmingly fashioned moments comes from costume designer Renée Ehrlich Kalfus, who freezes the viewer up persistently with her original tuxedo designs and their corresponding model. The fashion designer wonderfully personalizes not only the pair of ladies, but the film itself through creations that defy gender standards, which the film runs from several fronts. You are not ready for that navy three-piece suit and six-inch heels, bad weather and umbrella included.Based on Darcey Bell's homonymous novel, the script is penned by Jessica Sharzer— 2016 summer surprise \"Nerve\" screenwriter —with additional Feig touches on it. Joining up the collection of film adaptations based on mystery books featuring women in morally ambiguous situations, with homicides, supposed suicides and dark places driving the plot forward, Sharzer does what she can to remain faithful to the source story, distilling the key points from Bell's novel. But in \"Gone Girl,\" \"The Girl On The Train\" times, her writing falls short delivering solid resolutions, the pyrotechnics and suspicious events of the first hour are drowned by an out-of-control whirlwind of conclusions layering one after the other with less and less credibility. Emily Nelson is unhappy. We know it from the first moment because of her relationship with her only child, her creatively blocked husband, her job and her almost nonexistent social circle. Still, she's a confident, successful, classy, capable and ungovernable woman. But when her \"perfection\" is threatened by a forthcoming bankruptcy, her true self comes up. After the titular simple favor, she goes missing and the \"why-where-how\" kind of stuff unfolds.  Blake Lively, despite not being a high-grossing star, is one of the film's faces towards financial success.  Lively is in good hands portraying a sinister, enthralling femme fatale. Embodying Emily in an overwhelming natural way, her caustic, forceful performance achieves to blur the line between innocence and guilt, and that, in this film, means mission accomplished.Kendrick gives a career-best performance. Lively's already proved herself years ago, Kendrick, even with her Academy nomination, has been involved mostly in humor-related flicks, keeping her distance from powerful, serious character-driven plots. Heroine and villain, Stephanie's the real star here. Widow, helicopter parent, detective and vlogger at once, her evolutionary arc is, besides more plausible than Emily's, wildly enjoyable, veering from mistress to stepmother, from bosom friend to enemy with explosive sympathy. Kendrick's great, so does Lively, but together, they're a bomb of secrets, surprises and seduction; one of the most unique, brilliant female duos in a long time.\"A Simple Favor\" by Paul Feig could be mistaken for a vicious, riotous noir experiment by the director and producer behind \"Bridesmaids,\" however, those who are willing to get a ticket for this fiery cocktail won't feel ripped off up until the third act. Feig gives a half-baked impression of a chic Hitchcock through missing girl genre-worthy storytelling ideas, with fortuitous and gratuitous twists that will delight those who chortled when they shouldn't minutes ago. The cast is unbeatable, its posture is stylish by means of eye-popping outfits, an exquisite and elegant French soundtrack, a production design that is colorfully synthetic and a deficient but focused cinematography. The story falls into an overhasty, depraved spiral of revelations halfway through that, in the end, is a ploy to deliver the best Kendrick's performance to date, showcase underestimated Lively's talents and Feig's skills to surprise in every way. Final oversaturation certainly makes the story an incohesive whole, but the new side of the director, its costume design and the electric chemistry between the stellar ladies are enough incentives to treat the final-act hangover."}, {"rating": "7", "text": "\"A Simple Favor\" was a good movie, but not so much because of the confused and leisurely plot, but the performances of Blake Lively and Anna Kendrick were the ones that stood out most in the film, and also entertains."}, {"rating": "7", "text": "o filme inicia de uma maneira e a sua narrativa muda rapidamente se tornando um suspense e misterio, onde ocorre a transição da personalidade da protagonista, podemos dizer uma certa evolução, bela filmagem, boas atuações, narrativa interessante, trilha sonora boa contudo um filme bom."}, {"rating": "8", "text": "Thriller that involves a mixtures of genres, in way witty. Could been better if not for the overused trick of the evil twin sisters. The final act make you wonder of what genre belongs actually, or shall to watch again."}, {"rating": "8", "text": "I wasn't initially going to see this. I'd been let down by similar neonoir mystery dramas before. (Felt Gone Girl was just okay and Girl on a Train was disappointing.) Then I heard the positive reviews and changed my mind. I'm glad I did.Director Paul Feig took the story from what appears to be a more serious book with very mixed reviews on Amazon.com and added humor and a bit of fun to the proceedings. The dark parts are appropriately lurid, but this isn't a dire slog. Witty dialogue and a game cast alleviate the proceedings.Although Blake Lively does a great job as the mysterious woman who goes missing (and hats off to whoever designed her clothes, they are fantastic), this is Anna Kendricks' film. As the slightly oddball, mommy vlogger Stephanie Smothers, Kendricks has the part nailed down a both physically and verbally as she quirkily deals with people.There are a couple flaws. The switch between drama and humor is a little jarring a in a few spots. The second act drags a little, and a few character decisions in the third act were rushed a bit.Overall, I'd recommend this."}, {"rating": "10", "text": "crizzyview! Campy, funny, devilish. Great fun. Loved it! I think it was under rated by critics and should do very well at the People’s Choice awards."}, {"rating": "4", "text": "Paul Feig makes it clear once again how limited is as a filmmaker and his biggest mistakes here is that he never seems to be sure of what he wanted to do.A Simple Favor combines drama, mystery, crime, comedy and suspense in a plot that revolves all those elements but never manages to follow a straight path to be able to direct itself towards something more cohesive and therefore much more entertaining.Very soon I notice that the plot twists are done more to keep you attentive than because they're really necessary and at all times they feel forced and frankly lacking the dramatic weight and surprising effect they think they have.The main actresses? They're maybe the biggest disappointments. Even if we consider the completely lack of chemistry between both of them. The worst is their personality.Anna Kendrick character is downright foolish and almost the whole film she plays the typical single mother who tries to be friendly and quirky but who also has a dark side and usually takes the reins of the situation when the situation involves sex as shown by the two sequences in which she sleeps with her half brother and her \"friend's\" husband but something else? No, the character is as simplistic as it is predictable.Blake Lively tries to bring more attitude to the scenes but in all the moments in which her character presses and becomes more somber it seems a huge copy of what Rosemund Pike did with Amy Elliott in Gone Girl. Pike did it much better and in a much better film.Honestly for me there was nothing special in this film. Beyond my disappointment, it seemed an incredibly boring experience that was neither funny nor dramatic nor mysterious enough to compensate for the time invested."}, {"rating": "7", "text": "This exceeded my expectations, and managed to be a thriller within a comedy. Blake Lively was incredible!"}, {"rating": "8", "text": "I seriously enjoyed this dark-twisted-comedic thriller. It gives me a strange mixed feeling like Martini and I loved it!  Anna and Blake kill their scenes. ****"}, {"rating": "9", "text": "OMG, I was so expecting an high sixty or low seventy movie, I loved it.  The writing, the acting, was great.  The way the two main women characters played against each other was brilliant.  The movie was much funnier than I expected and a lot less of a thriller.  I walked out of the movie with my friend who dragged me out to see it, and we were both amazed about how we both underestimated the movie, both really enjoyed it.  I hope people give this movie a chance, and then give this movie the reviews it deserves."}, {"rating": "7", "text": "Fun mystery comedy that is a little too predictable and not quite funny or charming enough to be great or a classic. Will simply go down as decent yet forgettable time worth viewing once or twice."}, {"rating": "9", "text": "This movie is extremely versatile. There's tension, thrilling moments, (dark) humour and unexpected plot developments. On top of that, I enjoyed the visuals, the chemistry between the characters and the acting was great too. I only refrain from giving this movie a 10/10 because at some point there was a bit too much dark humour for my taste. Otherwise it's a movie I'd definitely recommend."}, {"rating": "5", "text": "I really didn’t want to see this movie, and I had very low expectations thanks to Paul Feig’s feminist ghost movie. It was better than I expected, I can say that. A few of the jokes made me chuckle, and some things that weren’t jokes made me chuckle. I was really excited that this was going to be really good once the opening started with the song and the appealing and stylized visuals, and then it immediately cuts to Anna Kendrick’s character making a vlog for moms. That’s the thing about this movie, every time it did something I liked, something else either undercut it or just made it worse overall. It has a lot of good ideas that I would love to see done differently and, frankly, better. This movie does have a decent style to it though. I like the scenes that are completely silent flashbacks except for one or two characters telling the story of what’s happening or just talking over it. The plot was really stupid and complicated for no reason. I found myself totally lost multiple times. And just to be clear, a movie can have a complicated plot if it’s explained well, otherwise, it’s just confusing. The dialogue is pretty cringe at times as well. It’s not always awful, but it’s not great overall. Also, the characters are actually not total idiots, which I did like. But the characters do change their minds pretty frequently for no reason except because the script said so. For example, Blake Lively’s character’s husband switches between Lively and Kendrick every ten minutes and it’s really distracting. Also, he fakes being with one or the other, but the actor does a terrible job of conveying this, so you never really know what’s going on with him. Not only is he not great in this movie, but I personally think Kendrick should stick with comedies. She’s not bad here, but definitely not good. I thought Lively was good though. Oh, also, I thought the scene with Lively’s character throwing the wrench up and hitting herself with it was done terribly and I laughed really hard. The wrench was falling way too slow to look even close to right. You should have enough time to put on a necklace as a wrench is falling from that height onto your eye. Also, I don’t know how many people could throw a wrench that high. I couldn’t. And here aim must be amazing to get it exactly where she wants it. And how did know it wasn’t gonna land wrong and just permanently mess her face up really badly? This scene is an example of how, besides the plot and dialogue, it’s just the little things that make this movie worse they it could be. If a different director made this movie, it could’ve been pretty good in every sense of the word."}, {"rating": "8", "text": "I can't remember movie like it where it has a relevant humor and jokes with a wonderful narrative and thriller's side. It was a interesting film with the ambiguous ending that seems as real story"}, {"rating": "8", "text": "I found the movie to be very enjoyable, though it has rough patches with stilted dialog and some difficult-to-swallow moments.Otherwise, Anna Kendrick is quirky and Blake Lively is hot, and that's about all that can be said about the movie without spoiling it."}, {"rating": "5", "text": "I enjoyed this film as a mindless audience member. Each thrill and twist made me animate emotions really well. At the end of the day though, it wasn’t a solid film. That is contradicting but, what I think most audiences and critics can agree on is that the first half or so is brilliant then it starts going off the rails. I can`t put my finger on it but some things just don’t click together. The three main actors do click and do act their collective cute fox socks off but it’s something with the writing and how everything gets ended in the third act. One of my favorite thrillers is Disturbia from 2007, it starred Shia LaBeouf. It was a perfect thriller. Sure, it was a horror thriller while a Simple Favor is I guess a comedy-thriller. Disturbia goes along perfectly on one linear path. Get evidence to convict a serial killer. There are tiny branches of plot that help the movie along or make our heroes path more complicated. In A Simple Favor, there are so many branches that extend from this movie`s main plot. A incest bastard child, child abuse, murder, arson, lesbian romance, affairs, after funeral sexy time. Everything I mentioned is a critical plot point that needs to happen so this film can have its outcome. It`s too much. This film`s ending is too much. Character actions don’t make sense at times. There are a lot of implied situations that could have been useful if someone just said it out loud to help some of the audience."}, {"rating": "6", "text": "IF you don't mind the thriller>comedy bait&switch, ASF is surely entertaining and has its moments of suspense; an easy watch."}], "recommendations": ["terminal", "the_woman_in_the_window", "bad_times_at_the_el_royale", "gone_girl", "thoroughbreds", "lucky_number_slevin", "widows", "good_time", "cold_pursuit", "knives_out", "nerve", "colossal", "the_raven", "the_tourist", "last_night_in_soho", "hanna", "ready_or_not", "the_number_23", "before_i_go_to_sleep", "reminiscence", "the_accountant", "savages", "broken_city", "magic_mikes_last_dance", "the_nice_guys"]}