{
  "id": 4593,
  "title": "A Street Cat Named Bob",
  "starring": [
    "Luke Treadaway",
    "Ruta Gedmintas"
  ],
  "runtime": 103,
  "genre": [
    "Family",
    "Drama"
  ],
  "description": "James Bowen, a homeless busker and recovering drug addict, has his life transformed when he meets a stray ginger cat.",
  "releaseYear": "2016",
  "mpaaRating": "NR",
  "imageUrl": "https://image.tmdb.org/t/p/w500/nBYG0D2FcbL1m926sIj7RN4m0sb.jpg",
  "categories": {
    "plot": 7.777777777777778,
    "acting": 7.6,
    "ending": 10.0,
    "soundtrack": 8.0,
    "cinematography": 8.0,
    "familyFriendly": 4.0,
    "funny": 8.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "8",
      "text": "In the tough time, they have found one another.After taking a week off from the films, now I'm back with this one. It is a British film based on the book of the same name, which is inspired by a real person and his cat. Well, it might be wrong to say 'his cat', because according to this film, I learnt that they have found one another. So nobody belongs to no one, except in human perception its 'his cat' and that's how this story goes.The title reminded me a classic film, but this is nothing like that one. If fact, it is a very suitable title name. How many people do you think gets a chance to represent themselves for the film version, excluding documentaries. Here Bob the cat had got one. He was so perfect. I'm not really a cat person, but when I was small I lived among lots of them and they all are nothing like this Bob. So if I want one, I need exactly like the Bob.The story is about a young man, James, who is a drug addict. Living on the street, singing to get close to enough money to feed. Sometimes frustratingly short to buy a meal, leads back to the needles at the time he tries his best to free from them. Having no friends and family for support, that's how he meets Bob. Bob is a stray cat who snuck into the James house and instantly they had become friends. All Bob wanted was a safe place and an owner to feed him. And for James, to divert attention from his issues.Humans and animals won't talk, but all those great relationships are built with wonderful understanding. I have seen many films based on man and animal bond, and there's nothing new from this, yet very inspiring. This tale was told from James perspective, having Bob alongside, but very nicely revealed how things change when we start to commit to something with a great support.❝You got yourself a lifelong partner there. Better friends than people, they are.❞From the outside, it looks like another 'Inside Llewyn Davis'. A man with no future, having a guitar in one hand and a cat in another, roaming the city. Other than that it is totally a different film. Well cast and made a film. The female lead looked like on cosplay. There's a little romance, but the focus always has been James and Bob. Even there are many scenes from Bob's perspective, like through his eyes how things look. Going after a mouse, travelling on the bus and bicycle, performing on the street, the camera literally on the ground to reveal that angle of the story.In a country like India, all domestic animals including pet animals roam casually everywhere without bothering about any threat. But elsewhere, like as in this film in England, one must get a license to have a pet. What I meant is, people are not used to those animals on the street and when they see one, they go like 'oh, so cute', 'so sweet'. Anyway, Bob and James won the many hearts. When they get on the street, it will be a spotlight. Crowd throng to see them, the rare partnership led them to fame. That was not their intention, but it helped them to overcome poverty.The pet lovers would love this film. Despite the original theme is darker with drugs, the film was fun and friendly for almost all ages. Seems like a holiday film, particularly to watch during Christmas. Well, it came on that season, but I saw it only now and I'm happy I did not give it a miss. This is a good film for families, so recommended it to them. Meanwhile, there's a follow-up book and I'm hoping that they would turn it as well a film. I don't know the book, but after watching this one, I feel it is worth it. So waiting for any official confirmation.8/10"
    },
    {
      "rating": "6",
      "text": "RIP Bob.You took care of James and gave him a reason to get up in the morning while he struggled with addiction. Bob was a good boy."
    },
    {
      "rating": "10",
      "text": "Простая и трогательная история.Отличные актёры, интересные и местами смешные диалоги, понравилась операторская работа.Итог: кино трогает и все аспекты выполнены качественно, а это главное."
    },
    {
      "rating": "10",
      "text": "It made me cry like a baby on my living room. It's the first movie I ever see that doesn't have a super sad part or something that makes me say \"Oh lord here we go with the bad stuff\" but instead focus on how the cat helped this guy to overcome his addiction. Will really recommend it"
    },
    {
      "rating": "7",
      "text": "It's really more like a 6.5, but I rounded it up to 7.  The movie is extremely predictable, and full of ridiculous cliches.  Despite that, it does have heart, and more importantly, the acting from the main character.His acting is the only thing saving this from being a complete mess.  Well, that and the cat, I guess :P"
    },
    {
      "rating": "7",
      "text": "It's not a movie that will change your view on the world, but it's a solid story told in a good way. Maybe I am being too sensitive because this story relates to mine in some way plus I am a cat-lover, but this one got me in tears at the very end. Recommended."
    },
    {
      "rating": "8",
      "text": "The story is both sad and uplifting at the same time and I very much enjoyed the music played by the main character when he was busking. I found this an easy and mostly enjoyable watch. This film isn't suitable for viewing by particularly young kids due inevitably to the drug use theme, hence why it has a 12 rating in the UK. I liked it for the depiction of compassion shown by those who come across Bob. Its a good film to watch if your keen on pet based films I'd say and there are some amusing moments due to how the cat reacts to situations (although I'd say its primarily a drama but it does have some comedy at times), so yes, I'd recommend it."
    },
    {
      "rating": "10",
      "text": "i love the movie it makes me cry.the ending was pretty good i wish BOB long live"
    },
    {
      "rating": "9",
      "text": "Movie is not only about the cat,its about life and second chances. This movie not getting more likes or proper credit is how bad/sinister society has become."
    },
    {
      "rating": "8",
      "text": "A great and hearty - true life - story.I watched 'A Street Cat Named Bob' back when it was released at the cinema (remember them?) and thoroughly enjoyed it; something that hasn't changed just over four years on. It's a very touching story, crafted together very nicely. I also love cats, so I felt all the cuteness that this offers in that area.The cat(s) steals the show, but big credit also to Luke Treadaway who plays lead character James. He is superb in this. Ruta Gedmintas, Serafina herself, and Joanne Froggatt play their part too.Interested to find out what the, I have to say very unexpected, sequel has to offer."
    }
  ]
}