{"id": 4083, "title": "A Streetcar Named Desire", "starring": ["Vivien Leigh", "Marlon Brando"], "runtime": 125, "genre": ["Drama"], "description": "A fading southern belle tries to build a new life with her sister in New Orleans.", "releaseYear": "1951", "mpaaRating": "PG", "imageUrl": "https://image.tmdb.org/t/p/w500/aicdlO5vt7z2ARm279eGzJeYCLQ.jpg", "categories": {"plot": 10.0, "acting": 8.428571428571429, "ending": 5.0, "soundtrack": 10.0, "cinematography": 5.0, "familyFriendly": 8.0, "funny": 10.0, "action": 5.0}, "reviews": [{"rating": "6", "text": "Brando's star making,  ground breaking performance as the brutish Stanley Kowalski,  is what I\"ll remember most from this film.  Vivien Leigh's fragile, damaged Southern belle provides the tragic heartbreak.  Director Elia Kazan has stagy compositions, but it's his work the actors that makes this flick fly."}, {"rating": "10", "text": "What can I say? A Streetcar Named Desire is a superb film, elevated especially by superb writing and performances. The film does look beautiful, the photography is very skillful especially. Alex North's music is nice and authentic, while the story is always gripping and the direction very good. As I have said already, the script and the acting drive A Streetcar Named Desire. Like with Cat on a Hot Tin Roof, the homosexual references are cut/not as prevalent, but I still cannot deny that the script was superb, dark, witty and tense. The acting is excellent too. Karl Malden is indeed great, but Marlon Brando gives one of his finest performances ever as the brutal Stanley, while Vivian Leigh also excels in a difficult role as Blanche and the pair while together sizzle with sexual tension. All in all, brilliant. 10/10 Bethany Cox"}, {"rating": "10", "text": "A perfect combination of great written screenplay, magical acting and totally precise directing. It will touch the bottom of your heart, showing the fragility of human being and the eternal search for beauty."}, {"rating": "7", "text": "I think,this film doesn`t deserve all the admiration of it.Besides Brando`s performance ,there is nothing to look for.It is good film,but very overrated"}, {"rating": "10", "text": "This film noir portrait of corruption and morally-compromised obsessions stars Welles as Hank Quinlan, a crooked police chief who frames a Mexican youth as part of an intricate criminal plot. Charlton Heston plays an honorable Mexican narcotics investigator who clashes with the bigoted Quinlan after probing into his dark past. A memorable"}], "recommendations": ["finding_neverland", "ghost", "my_salinger_year", "anna_karenina", "the_electrical_life_of_louis_wain", "road_to_perdition", "chocolat", "to_kill_a_mockingbird", "chinatown", "the_thomas_crown_affair", "motherless_brooklyn", "the_untouchables", "a_star_is_born", "butch_cassidy_and_the_sundance_kid", "casino", "the_last_of_the_mohicans", "true_romance", "rear_window", "wonder_wheel", "north_by_northwest", "spencer", "the_hunt_for_red_october", "catch_me_if_you_can", "the_aviator", "the_mask_of_zorro"]}