{
  "id": 2047,
  "title": "A Time to Kill",
  "starring": [
    "Matthew McConaughey",
    "Sandra Bullock"
  ],
  "runtime": 149,
  "genre": [
    "Crime",
    "Drama",
    "Thriller"
  ],
  "description": "A young lawyer defends a black man accused of murdering two white men who raped his 10-year-old daughter, sparking a rebirth of the KKK.",
  "releaseYear": "1996",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/apUSR9WE7lMATBGYhzZ8RnPDYsK.jpg",
  "categories": {
    "plot": 6.75,
    "acting": 6.615384615384615,
    "ending": 8.166666666666666,
    "soundtrack": 5.0,
    "cinematography": 6.0,
    "familyFriendly": 2.0,
    "funny": 5.0,
    "action": 5.2
  },
  "reviews": [
    {
      "rating": "10",
      "text": "I have seen almost every one of the movies that have been adapted from John Grishams novels. This is, by a longshot, the best one. Samuel L. Jackson plays Carl Lee, a black man whose daughter is brutally raped by two racist rednecks. As the rapists are being brought to their arraignment, Carl Lee steps in and shoots them both, killing them. Carl Lee is then arrested and charged with murder. He picks Jake Brigance, brilliantly played by Matthew McConaughey, to defend him. When Brigance agrees, he finds himself spending more time on the case, and less time on other things, like his family. This puts a major strain on his marriage. I also liked Sandra Bullock as Ellen Roark, a Boston Law student who badly wants to help. I can't reveal the end of the movie, because then, I'd spoil it for anyone who hasn't seen it. If you havent yet seen this movie I strongly recommend it. Be warned, however, that, because of some violence and graphic descriptions of rape, this movie is NOT for very young children. Personally, I absolutely adored this film."
    },
    {
      "rating": "5",
      "text": "This movie is too stupid to address the issues it's about."
    },
    {
      "rating": "8",
      "text": "A Time to Kill proves to be one of the most riveting courtroom dramas of the 90's: the acting is great and the story is shocking, if not a bit formulaic. However, it's the romanticism and relationship elements in the movie that bring it down a bit. Save it for the Phantom, Schumacher."
    },
    {
      "rating": "8",
      "text": "A Time to Kill may be quite typical in spots, it is also an incredibly well crafted and great film at others. In particular, the writing is spectacular, particularly at the end with Matthew McConaughey's final monologue. Passionate and beautiful, the writing in that scene really sweeps you up and elevates the whole picture. Additionally, the film manages to thrill at all turns as you attempt to figure out what the jury will decide in this landmark and racially divisive case. Can a black man receive a fair trial in Mississippi? Should he be guilty regardless? A morally difficult film about vigiliantism, the film can be quite one sided and not all of the characters are well put together, but the acting and dialogue more than fix these problems. McConaughey is terrific and Samuel L. Jackson is great with a passionate and typically fiery performance as the father who exacted revenge on the men who raped his daughter. A tough watch at times, A Time to Kill showcases how the courtroom drama type of film can be done right and can be incredibly thrilling and thought provoking. Though typical, A Time to Kill has more than enough going for it to overcome those problems."
    },
    {
      "rating": "2",
      "text": "Down south in Mississippi everything is wrong as we can gather from this movie that starts with two white rednecks raping a black child and subsequently attempting to murder her. For your conscience there is no doubt about their guilt, for we witness the details in all its brutality. We are also left in no doubt that such deeds go unpunished in that part of the globe so that the father of the victim hands out his own justice by gunning the suspects down.\r Enter white hero Matthew McConaughey who will fight for the cause of the black father Samuel L. Jackson against the likes of a slimy white prosecutor Kevin Spacey and the condescending white judge Patrick McGoohan and attempt to convince a totally white jury that Jackson was legally insane at the time of the murders.\r Outside the courtroom the Klan resurfaces on instigation of Kiever Sutherland to fight for white supremacy and exact vengeance for the death of Kiever's buddies. Their prime target is McConaughey and associates who never get any proper police protection despite several attacks on their homes and lives. The law enforcement forces down south are rotten to the core as is shown when one of McConaugheys supporters, Sandra Bullock, gets abducted with the aid of a cop.\r Bullock is hugely annoying as she plays a lady who thinks she is brilliant and is cocky enough to say so. Her argument: she is better informed about court cases than McConaughey is, which isn't saying much as he knows jack shyte. Not strange for he prefers to hold office in the local pub. Thus Bullock gets dropped in and also because we need a gal in the movie to chat up the male lead. It takes Bullock some time to convince him though, because he prefers Platt for a drinking buddy. Not because he is gay mind you, but because he is married. Which doesn't stop him from getting drunk with Bullock and sleep in one room with her.\r This sounds like the movie is about some greezy white down-on-his-luck lawyer who finds himself on the black side of the racial divide. But no: this is a young brilliant promising lawyer who feels he has to show the truth against racial prejudice. Keep this in mind: to show the truth.\r As viewers we are in no doubt about what occurred: we did see the rape, we did see the attempted murder and we did see the scumbags gloat about it. But one should not forget that nobody in the jury did.What they ought to know is this: two men accused of rape and attempted murder of a girl are killed by another man. But we know too much and the movie never stresses that the jury does not know what we know. But it will get worse.\r It is also a bad ploy to make the prosecutor and judge out to be dubious characters. Why would they not be as devoted to their work as the defense lawyer is and perhaps as honest too, but just of a different disposition? But they are never given any leeway. They are bad.\r And it is equally wrong to have violent Klan members appear so we can witness their misdeeds in full view.\r The worst however is this: McConaughey wins not because he makes a brilliant case. He wins because he plays on the jury members feelings by using the rape of the child as an argument.. which was already been deemed to be inadmissible in court as it was never established that they had done the rape.\r This movie is so far from To kill a mocking bird. In To kill a mocking bird we don't see the crime, we don't know much more than the jury does, the judge is a decent man and it is the white jury who convicts the black man against all fairness.\r And here lies the real paint point that this movie avoids to address. Racism is embedded deep within society and it is not just something that drives some fringe members of society like the Klan and scumbag cops, lawyers and judges. It is in your neighbors next door and that white person who prays to the same god as the black person, but each in their own church.\r But even worse: it does not in anyway explain why those people feel the way they do. They are just 'evil'.\r All of the above illustrates how deeply flawed the story is.The 'bad' side is so dehumanized evil that we have no other option than to root for the 'good' side, even if you are an ardent Klan member. It does nothing to improve further understanding of racism and paints a wholly distorted picture of everyone involved.\r A waste of a potential acting talent in a deeply flawed movie."
    },
    {
      "rating": "6",
      "text": "I liked this movie for most of the time. The case is very interesting and morally difficult, because everyone has sympathy for the murderer. But:- the movie is very unrealistic, because there is so much terror around the trial and nothing happens. This is weird.- the verdict is so stupid. A clear double murderer gets free, oh sure, what a fairy tale. Another solution would have been more realistic."
    },
    {
      "rating": "5",
      "text": "Based on the good reviews, the strong cast, and the very complex starting situation I expected this to be a great movie, but it later becomes dumbed down and force fed to us, rather then helping the viewer explore the issues it tries to address. I was so disappointed by the cheesy, binarised american-dream ending, that I feel like I wasted 2.5 hours of my life listening to someone talking about racism in the intellectual level of \"Racism is bad, OK?\" The acting is amazing, and it is neatly executed piece of cinema, I just wished they used it tell a more meaningful story."
    },
    {
      "rating": "9",
      "text": "It's always interesting to read reviews of older movies. You can see how often reviewers totally don't get how influential a film will become. You quite often read sterling reviews for films that have totally been forgotten. And then find reviews for a film like this one (judged mediocre by critics when it came out) that still speaks to people. A film that can be seen over and over on TV and still maintain its force and passion.\r Sadly, the issues addressed in A Time to Kill are ever more present with us. The speech \"imagine she is white\" is so timely today.\r Amazing to see such a collection of future Oscar winners and nominees in this: McConaughey, Bullock, Spacey, Fricker, Judd. And how is it possible neither McConaughey nor Samuel L. Jackson were nominated for their superb performances?"
    },
    {
      "rating": "7",
      "text": "You'd think that a movie produced by a lawyer (John Grisham) and based on a novel written by a lawyer (John Grisham) would have courtroom scenes as gripping as a backpack of dynamite strapped onto the shoulders of a 10 year old boy who is diagnosed as hyperactive.Sadly, the courtroom scenes are the weakest part of the film.  The legal points made by the lawyers seem mild as milk and made me yearn for the courtroom back and forth in every episode of the old Perry Mason TV series (1966-71).  And the climax of it all . . . well, don't get me started.  Suffice it to say that there are no stunning legal points to be found and the final scenes are saccharine to a fault.  It's all about what we feel and never mind the law.The good news is that we spend barely 30 minutes in the courtroom, as near as I recall, and this in a film measuring out to two hours and twenty-nine minutes.Most of the film is about the South, the racism in the South, and the racists in the South, specifically Mississippi in the 1980s.  I suppose the film is trying to say that if you kill two men in front of 30+ witnesses, and you're black, and you haven't a hope in Hell of getting a fair trial anywhere in Mississippi, then it's only moral that you should be found not guilty, as long as you were sufficiently wronged by the two men you killed.Well, personally, I feel that two wrongs do not make a right, and if as a society we decide to endorse vigilante killings then we're using the same moral compass as the Ku Klux Klan, and even the mafia, so why bother having laws or police or anything resembling countries?  Just load up your guns and prepare for anarchy.Thanks, but I'll stick with the laws.Frankly, I think the old Humphrey Bogart film \"The Black Legion\" (1937) did a better job illuminating the racist underground and it had the advantage of being a lot shorter, by about 66 minutes, in fact.Now I think I'll go watch Mississippi Burning (1988), which of course is about 1960s Mississippi, where black churches were burned and civil rights workers murdered and virtually everybody white was in on it in one way or another."
    },
    {
      "rating": "7",
      "text": "The excellent detective drama, with even young McConaughey. History is simple, full of racism. Here only the KKK causes only affection here. And the fact that the main defendant will be acquitted too obviously."
    },
    {
      "rating": "3",
      "text": "Si on met de côté le contexte racial, il s'agit d'une question intéressante qui mérite d'être soulevée et débattue, un sujet qui revient souvent en Amérique, la patrie des héros qui se font justice eux-mêmes avec leur fusil qu'ils ont acheté eux-mêmes. Un pays libre en somme. A cette question \"le droit de tuer ?\" Joel Schumacher y apporte une réponse nette et sans détour dans une \"happy end\" qui ne cesse de se gargariser jusqu'au générique. Aucune finesse, aucune remise en question, pourquoi ce point d'interrogation alors ? en anglais ce \"time to kill\" est beaucoup moins ambigu.Quant à l'aspect racial, il est bien entendu clairement mis en avant, une victimisation assez pénible tout au long du film, rabâchée à qui mieux-mieux, qui sert de prétexte et légitime l'assassinat justicier. Pour le reste, c'est plein de stars (des bonnes et des mauvaises), une mise en scène sans reproche mais beaucoup de lenteurs qui nuisent grandement au rythme. Le film s'enferre à n'en plus finir dans la procédure, un sentimentalisme hypocrite et partisan de mauvais aloi."
    },
    {
      "rating": "6",
      "text": "to the well earned actors..A Time To KillA Time To Kill is a plot driven courtroom dramatic thriller about a man who kills two felonies and pleads a verdict for not guilty. Schumacher's world in here believes on the procedure that goes behind the stage which helps a lot to the feature especially in its latter stages. The script is elaborative and not overstretched which helps keeping the audience tangled into its dark political bubble. Despite of having such multiple characters and such big stars going head to head on screen, it never gets crowded and the credit goes to its fine editing. The script may not be as layered as the writers may think, but is undeniably entertaining to the core. The writing is flawed at times and the priority seems to be on the commercial side, which unfortunately takes the heat away from the material.The script debates a lot over ethics and morale conflicts and political opinions but never gets past it or even offers an adequate closure to the viewers. The characters are three-dimensional and doesn't always play fair or evil, the resemblance with practicality keeps this fictitious tale grounded.It is short on technical aspects like background score, cinematography and camera work which is more pathos than script demands; a failed attempt by the makers to keep the crisp alive. McConaughey proves his magnificent skills once again, with Bullock's decent support and on the other hand Spacey oozes power along with Jackson's fine portrayal.Schumacher's execution is chalky around the edges and fails to deliver as anticipated despite of having such a powerful source like Grisham. The intense courtroom drama, argumentative conversations and stellar performances are the high points of the feature.A Time To Kill belongs to the well earned actors and no other, for if there is anything that makes this more than two hours of journey worth, it is that cast standing in front of you."
    },
    {
      "rating": "10",
      "text": "A Time To Kill: Time For Humanity (Review)Cinematography: 10/10 Might some consider this vintage? The slight grittiness of the visuals always makes films seem more cinematic to me. Plus - the flow of the film is amazing and really encapsulates the story in a poetically revealing cinematic sense. The film gets better and better with every scene! Costume Design: 9.797/10 Ever watch a film that doesn't distract you by the attire but makes you feel more engrossed in the film by the attire? Film Editing: 10/10 Solid. Make-up and Hair-styling: 9.797/10 Not distracting and seems to be very telling of the cultural styles in the particular climates.Sound Editing: 9.892/10 A strong element is using the natural flow of sound in a space. I find myself intently listening: the natural amplifications and inflections flowing really makes the vocals stand out. Visual Effects: 10/10 Solid.Story: 10/10 Talk about covering bases. A Time To Kill leaves no stones unturned and adequately implements to create a very very well completed story. Acting: 10/10 Phenomenal. Do you understand the importance of having acting partners capable of handling a lot of dialogue and motion effectively in a film of this caliber? Personal: So, I watch A Time To Kill after someone reprimands me (not aggressively, just in extreme shock) for not watching the film and then recommends me watch the film. We were trying to figure out other movies Matthew McConnaughey is in because I was talking about seeing White Boy Rick. I've come to realize he is in a few films I enjoy: beyond this point, I find A Time To Kill to be a very voluminous film which shows the importance of justice, law, and human existence in proper effect. I contemplate all of the contributing factors that force humans to recognize the importance of humanity. People are constantly learning actively and subconsciously. There is so much contributing to one's developments and growths: ultimately, the sole responsibility of one's developments rests on an individual's being as well as the way one defines their self in the midst of their circumstances. Yet - the assistance one receives in their life may be of greatly considerable factors towards their development.Overall: 9.935/10-K.D.If you're into Poetry and other bits of creativity, check out my Instagram: @Dufreshest."
    },
    {
      "rating": "9",
      "text": "I love John Grisham stories when they are adapted to film.  A Time to Kill is really awesome. It has a great cast and man on man that final jury speech is intense."
    },
    {
      "rating": "5",
      "text": "A rather dull courtroom drama that handles the racial tensions in the south in such a ham fisted, simplistic way at times."
    }
  ],
  "recommendations": [
    "detroit",
    "munich",
    "just_mercy",
    "the_hate_u_give",
    "the_card_counter",
    "elle",
    "the_mauritanian",
    "the_hunt",
    "dark_waters",
    "judas_and_the_black_messiah",
    "blackkklansman",
    "falling_down",
    "law_abiding_citizen",
    "the_reader",
    "the_king",
    "richard_jewell",
    "miss_sloane",
    "machine_gun_preacher",
    "promising_young_woman",
    "zero_dark_thirty",
    "fracture",
    "crash",
    "the_rite",
    "spotlight",
    "shot_caller"
  ]
}