{
  "id": 4540,
  "title": "A United Kingdom",
  "starring": [
    "David Oyelowo",
    "Rosamund Pike"
  ],
  "runtime": 111,
  "genre": [
    "Drama",
    "History"
  ],
  "description": "The inspiring true story of Seretse Khama, the King of Bechuanaland (modern Botswana), and Ruth Williams, the London office worker he married in 1948 in the face of fierce opposition from their families and the British and South African governments. Seretse and Ruth defied family, Apartheid and empire - their love triumphed over every obstacle flung in their path and in so doing they transformed their nation and inspired the world.",
  "releaseYear": "2016",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/xyhoW9qK7ZaDM1V4A6pPL9DWjn8.jpg",
  "categories": {
    "plot": 8.24,
    "acting": 8.23076923076923,
    "ending": 8.4,
    "soundtrack": 5.0,
    "cinematography": 8.0,
    "familyFriendly": 6.0,
    "funny": 5.0,
    "action": 7.625
  },
  "reviews": [
    {
      "rating": "8",
      "text": "Though a safe historical film, director Amma Asante's A United Kingdom never ceases to be anything less than powerful, riveting, and entirely rousing. Telling the real story of Seretse Khama (David Oyelowo), the Prince of now-Botswana, and his love of Englishwoman Ruth Williams (Rosamund Pike), A United Kingdom shows how they were kept apart. Rejected by Seretse's uncle and current regent of the nation, the British government (both the Labor and Conservative parties), and apartheid-in-progress South Africa (a key British ally and neighbor to Botswana), the marriage is in trouble. Exiled from Botswana and unable to return, Seretse must fight to be able to claim the crown that is rightfully is, return to the people that he loves, and to secure Botswana's future with the prospect of diamond mining occurring on the nation's land.A tale of injustice and racism, Seretse and Ruth fall in love in England and wish to head to Botswana, where Seretse is set to become Chief/King of his people. However, the South Africans - in the process of installing apartheid - do not want it and threaten to stop following British rule if they allow the marriage. A pawn in large political matters of colonialism and rule, A United Kingdom shows that people have always been caught in the crosshairs of politics and those politicians have always lied. Though they recognize allowing them to marry is the right choice, the fear of the South Africans is far too much to let either the Labor or Conservative parties act on his injustice. They even go so far as lying to Seretse and his legal team about the contents of a report into the situation in Botswana, claiming it is on the brink of civil war because Seretse's uncle refuses to accept Ruth and pass the crown onto Seretse. Though Seretse's people and sister accept Ruth whole heartedly, their battle is one that must be fought uphill.In crafting its romance, A United Kingdom is often beautiful. It borders on cliff notes at times with how quickly it goes through it, but it works incredibly well all the same. Romantic, nostalgia, and taboo, director Amma Asante's film captures all of the dirty looks, gestures, and actions they get as a result of their love, while also developing their love. The two go hand-in-hand and it shows that the hatred they face only serves to strengthen their bond together. Unwilling to bend to the wills of the families or the government, the two are defiant, strong-willed, and entirely in love with one another. Listening to other people tell them what to do is hardly an option.However, A United Kingdom is a film far more in line with a political drama. Showing shots in parliament of them debating the issue and the bureaucracy that stops them from being able to be together in Botswana, the film plays out like a political film, not a romantic one. The romance is there and you can tell the connection between them only grows due to the great chemistry between Oyelowo and Pike, but the emphasis here is the politics. Asante uses the film to show how governments do what they know is wrong for political reasons. Though perhaps quite obvious to anybody, A United Kingdom, by first establishing the romance, makes it feel personal and intimate. It is as if the government is not letting us be with our spouse, making the injustice really hit home. How can they deny the love these two people have for one another? How can they bend to the will of a deeply racist country looking? How can they be so greedy, anticipating that diamonds will be found in Botswana? All are obvious, but truly are drilled home perfectly in the film and the end result is a greatly dramatic and oddly thrilling film that wraps you up in the politics of the situation and benefits from it throughout.That said, the star here is David Oyelowo. The climactic moment from the trailer when  he declares he loves his people and land, but also loves his wife is just as rousing and powerful in the film. Oyelowo is an incredibly under-recognized actor, in spite of his stirring turn in Selma as Martin Luther King, Jr. Here, as Seretse Khama, he finds much of the same inspiration and power that he had as King, playing a man who used as a political pawn by entities that had no business dictating affairs in his home country. Oyelowo is a brilliant speaker and delivers his lines with resonance and strength, making him an easy sell as the inspirational political figure. As his wife, Pike is far more reserved, but works on an emotional-level. Showing the hurt in her eyes and face from the suffering her family must go through because of prejudice, Pike may not be nearly as good as Oyelowo here, but she is still very good in her own right.A United Kingdom may not appeal to everyone, as it is largely what would be expected. A powerful tale of injustice, romance, and politics, director Amma Asante does this true story incredible justice in retelling it in this film."
    },
    {
      "rating": "8",
      "text": "Like most of the viewers, I really enjoyed this picture.  Alexander McCall Smith's books increased my interest in Botswana, and I wasn't disappointed.  Rosamond Pike and David Oyelowo did an excellent job of portraying the leading couple, and I felt that they did have the necessary chemistry.  I would have liked a more rounded view of Seretse's sister and how she eventually came to care for Ruth.  A more nuanced view of the Brits would also have been good, since only Tony Benn was portrayed as a sympathetic British politician.  Still, this is a great view of the intersection of love and politics and the events leading up to the birth of the country of Botswana."
    },
    {
      "rating": "8",
      "text": "Although a bit formulaic at times, this love story with a political twist capably tells a tale of little-known history while never losing sight of the romance that lit the fuse that ignited the flames behind an intense international controversy. With fine performances by David Oyelowo and Rosamund Pike, a cogently written script, and fine production values, this latest offering from director Amma Assante proves once again that she's one of today's finest up-and-coming filmmakers. An enjoyable, entertaining and informative film that delights, surprises and inspires on multiple levels."
    },
    {
      "rating": "10",
      "text": "\"A United Kingdom\" is based on a true story that took place in the 1940s-1960s in Africa as apartheid was taking hold in that continent. We meet Seretse Khama (David Oyelowo), who is black and future king of Bechuanaland (now called Botswana), where he is studying law in London just after WW2 has ended. At a dance he sees, and meets, Ruth Williams (Rosamund Pike), a white English woman office worker. They start off talking about American jazz and before you know it \"A United Kingdom\" turns into a love story, but not just any love story, one that changed history not only for a small country but affected the politics of England and politicians. The soaring love story, and the acting by Oyelowo and Pike, overtake the politics of race, discrimination and the bureaucrats that undermine the will of the people.There are many shocking scenes in the movie, some you have seen before that have you shaking your head like seeing separate entrances for blacks and white, and some that are new, like finding a beloved figure in history not quite being who you thought he was. There are also many scenes in the movie that will remind you of what is happening outside of the theatre in your real world.The screenplay by Guy Hibbert brings into play the power that love can bring to people's ideals and at the same time shows that true love can give people strength to face anything from rejection by family, threat of exile from one's country to being shunned by people of their own race.This is the second picture I have seen by director Amma Asante who, in 2013, introduced to me the beautiful, talented actress Gugu Mbatha-Raw in the film \"Belle\". She is now one of those rare directors who films I will go see just because their name is attached to it.The acting from Oyelowo and Pike to Tom Felton and Jack Davenport representing the British Empire so nastily, to Vusi Kunene and Terry Pheto, Charlotte Hope, Laura Carmichael, Jack Lowden, Nicholas Lyndhurst, Arnold Oceng, among many other supporting players, are all first rate.\"A United Kingdom\" is being referred to as a political and romantic drama and though it is a political film bringing events, and people, that may have not been known or remembered such as recent films like \"Loving\" and \"Hidden Figures\" to me it is one of the best love stories I have seen in a long time.I am a sucker for a good love story and whether it is the screenplay, the director or David Oyelowo and Rosamund Pikeso believable as the lovers or a combination of all of them, this is a moving love story that had me in tears more than once.At the end of the second month of 2017 this is my pick, so far, as best movie of the year! Go see \"A United Kingdom\"!"
    },
    {
      "rating": "8",
      "text": "From director Amma Asante comes \"A United Kingdom,\" a film that - with each passing minute - made me feel more and more like a jackass for never having heard of the incredible true story that its based on. Because, with stakes so incredibly well-defined and performances so earnestly crafted, it's hard not to get wrapped into the romantic drama at hand here. Asante's sure hand and deft eye for color also come into fantastic use throughout, accentuating the disparate landscapes in play and framing the narrative's righteous leads in an uncompromisingly humble light. It's a movie for any viewer yearning for an affecting love story with the ever so timely themes of all-inclusiveness and equality pushed towards the forefront. It's a movie for any viewer yearning for a deeply intriguing study on the geopolitical landscape of England and Africa during the onset of the Cold War. And, most importantly, it's also a movie for any viewer yearning for just a good movie in general."
    },
    {
      "rating": "6",
      "text": "While the king of Botswana (David Oyelowo) is being educated in England, he falls for a white woman (Rosamund Pike). This is in the 40s, so you can imagine the outrage when they got married. The challenges mount when there are intense objections to his rule. The performances are convincing and the story interesting, but it unfolds with a relatively prosaic script and uninspired direction. It's a fascinating history lesson and their romance is engaging. However, the storytelling lacks that passion or creativity to give it emotional heft."
    },
    {
      "rating": "8",
      "text": "The story of two kingdoms.It got the mixed responses from all the quarters, but I had a little doubt that did I watched the same film! Because it was much better than what I have had heard from them. It's a biographical romance- drama from the director of 'Belle'. And like the inspiring life stories of Gandhi, Mandela, Martin Luther King Jr. et cetera, this one falls in the same line. All of their life events set in different kind of geopolitical scenario, so do this man's. But it was like differences in the family, which led to geopolitics. Anyway, the history book says, all the great struggles began with some game changing incidents like in this story.Seretse Khama, a king to be to a Southern African nation, now known as Botswana. His/this story was not filled with any violence. In fact, there were none, but political tension was at high. More or less, everything depicted in the film was like a chess game. Each opponent had their time with their pawns moved in the right direction to check their opponents. So he had to play accordingly for his nation and its people. I think he handled so well without any violence and that's why this film was merely a simple drama rather than packed with full of twist and turns and stunts.Like any biopic, it is an inspiring film. The implementation of non- violent tool to fight back was at its best in a film I've seen. Though, he was not like the most intelligent man, fighting it on his way, but an average man with a good education and character. The film opened with his final days in London as his law practice is coming to end. Then, unexpectedly, he meets a white woman. After going out with her for a few dates, they find love for each other. The real hurdle comes between them when the Britain government tries to break their relationship because it would affect their interest in his resourceful nation in Africa and peace with their neighbours.❝Let us not allow the ugliness of this world to take our joy away from us.❞As he was banished from returning to his native, separated from his family, how he works hard to bring the peace and stability to the region, especially to come out of the British oppression was the rest of the story to focus on. An amazing film. I liked it because it was not about heroism or working under a spotlight since he comes from the royal family. His simplicity of life and approach to all the problems was uplifting. I never heard that a nation ever got its independence without spilling a drop of blood. This is the one, at least for me. I mean no guns, or any other kind of weapons, except small, small protests impacting big way. But the big sacrifices were made in other ways. That's the major reason for I love it.Based on the book, 'Colour Bar'. The screenplay was slow, but it required to slow down to impact the atmosphere of passing time as the film spans with just important events for 4-5 years. So, assuming the film lacked depth is a misconception. Shot in both England and Botswana. The two different continents and its landscapes tell the story of its own. I mean the long distance between these two nations and distinct between the cultures, their own agenda to fight what's right for them. The initial part was like a pure romance film, and then suddenly the political tension takes the centre stage. Between the romance and politics, the narration keeps its flow without much progression in the middle section. Yet, impressive.As for me, Seretse Khama was a much, much better role than Martin King Luther Jr. that the David Oyelowo has played. But that role was more popular as it was an American. So this film needs a big uplifted, since the film has not reached a wider audience. Felt like I'm seeing Rosamund Pike after a long time. She was excellent as Ruth. The rest of the cast in the small parts were not bad. It was an Oscar product, but no one ever mentioned that. If you are interested in history of Botswana, particularly in the time surrounding its independence, you should try it. But I think it is a must see film, one of the best films based on a king, a freedom fighter and a husband.8/10"
    },
    {
      "rating": "7",
      "text": "This movie will not be successful. This movie will be forgotten.And yet this movie has a significance that few other movies can boast.These are some of the aspects that contribute to its significance:Female directorFirst movie shot in BotswanaTrue story that nobody knows aboutShot on location in historical places that if not for the production of this movie, would have been abandoned and forgottenDavid Oyelowo stands for all good things in Hollywood. He is the guardian of good tradition and the  bringer of a good change to the industry.Love has no limits."
    },
    {
      "rating": "7",
      "text": "Solid, pretty much the whole cast does a very good job but I must say it has certain problems of rhythm that never allow it to take off completely, that does not mean that it is bad is simply that it falls in predictable places that prevent the film to be more memorable, especially because the general work is of very good quality.Definitely worth it, it will not be really memorable but it is not a bad way to spend two hours and with the racial climate in the US is surprisingly timely."
    },
    {
      "rating": "7",
      "text": "This is a sad and sobering watch. Rosamund Pike gives a particularly powerful performance as Ruth Williams (someone clearly very much in love and keen to defend her marriage and speak out when needed) while David Oyelowo does well as her partner, Seretse Khama. Its nice to see that people were fighting against such prejudice back when this film was set, which I believe to be the late 1940s. Apart from the obvious racial issue/theme, it also covers thematic ground including that of power and authority, corruption and deception. I thought this was a good film overall."
    }
  ]
}