{
  "id": 1389,
  "title": "A Walk to Remember",
  "starring": [
    "Mandy Moore",
    "Shane West"
  ],
  "runtime": 101,
  "genre": [
    "Drama",
    "Romance"
  ],
  "description": "When the popular, restless Landon Carter is forced to participate in the school drama production he falls in love with Jamie Sullivan, the daughter of the town's minister. Jamie has a \"to-do\" list for her life and also a very big secret she must keep from Landon.",
  "releaseYear": "2002",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/8lUYMvWdHA0Q0k5F76RQCeCBUkA.jpg",
  "categories": {
    "plot": 6.388888888888889,
    "acting": 5.578947368421052,
    "ending": 5.0,
    "soundtrack": 8.5,
    "cinematography": 5.0,
    "familyFriendly": 8.0,
    "funny": 10.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "9",
      "text": "beautiful and moving. ppl fall in love with the two unfortunate lovers. this movie reminds us of how delicate love can be but also how strong at the same time. the romance in the movie is absolutely moving and i cant find words to describe what a masterpiece this is. watch it and you'll understand"
    },
    {
      "rating": "9",
      "text": "◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇▪▪▪▪▪▪▪▪▪▪▪▪▪▪▪▪▪▪▪▪"
    },
    {
      "rating": "9",
      "text": "I was surprise when I saw the critical reception of this movie. I watched it this morning and it's definitely a walk I will remember. The way they fall in love reminded me quite a bit of 'Naley' from one tree hill and yet it had this whole sentimental feeling to it. It's not the kind of film where the most important thing is to make some good shots with the camera, and I think that's what makes it so memorable. It's completely worth watching and, even though it's a bit too sentimental for me, I suggest everyone who has a chance to not listen to the Cinemato...what ever their called reviewers and watch it - but remember to have a tissue in your hand."
    },
    {
      "rating": "10",
      "text": "It is a story of: faith (in God and its love), reconciliation (between teens and parents) forgiveness (to a father who let down a joung kid), discovery (of others' deep sentiments and aspirations) It is a real journey with an unexpected transformation (of Landon from kid to a man) inspired y a beautiful Many Moore, whose voice and songs is spectacular. Get straith on top of my film collection and is a daily inspiration in my life. It would have deserved some better judgement from cinematografic critics. This is a true masterpiece for those who can understand its deep meaning (far beyond the simple love story)."
    },
    {
      "rating": "10",
      "text": "I absolutely love this movie. A lot of people dislike it but i really do like it. It has its funny times and it also has the time to where you should really feel like you are there with the actors. This movie is great."
    },
    {
      "rating": "10",
      "text": "Superb colours, score and storyline."
    },
    {
      "rating": "10",
      "text": "this is the most touching and influening movies I ever seen."
    },
    {
      "rating": "10",
      "text": "One of my favorite movies of all time, the story, the message the themes, it was just so beautiful and touching. Shane's and Mandy's acting was perfectly done! Their characters were perfectly portrayed, the emotion, their personalities, the love, the sincerity, the sadness...This movie is their best performance of their careers."
    },
    {
      "rating": "10",
      "text": "A Walk To Remember, starring Shane West and Mandy Moore.  They both have very strong chemistry so their acting looks natural and nothing is exaggerated.  Starting from the film, now the film A Walk to Remember players reunite and have a romance in real life.  In this film there is no element of expressing love by having sex only a kiss and for me that is normal for western culture.  This film also provides a lesson that not always someone's bad past will be bad in the end, some people can change for the better when he has found the right person.  This film is worth watching for teenagers and I highly recommend it to you guys........."
    },
    {
      "rating": "9",
      "text": "jbknknhvihinughioutwqryfdsxgjmkbniinibyfrxxtcrxtcbjnkoninugtddrtcubcawruoolmbufyfyyffygghtdrsrsryuhgfswaqdfyjjjh"
    },
    {
      "rating": "10",
      "text": "\"The Best \" movie i have watched till now and nothing beats it ,not even the notebook,especially if your a teenager.the soundtrack was awesome and  the last song \"cry\" was really moving.Not ashamed to say that i cried after watching it."
    },
    {
      "rating": "10",
      "text": "Lol most cliche eh? Don't make me laugh. If its a cliche then your getting too old. This movie is original, and heart touching. Watched it with my gf and she nearly cried her eyes out. Good Movie and Great Book by Nicholas Sparks!"
    },
    {
      "rating": "9",
      "text": "It is a rare movie indeed that inspires like this one. I'm impressed with the quiet virtue of the story and am astounded at the disparity between the \"professional\" critics and us regular folk."
    },
    {
      "rating": "10",
      "text": "Great movie about young people falling in love. There are some mature themes but ultimately its a movie that teaches us that you can fall in love at any age. This movie isn't shy when it comes to tearjerking scenes all of which are central to the plot. This movie also proves that you can go on after losing a loved one."
    },
    {
      "rating": "10",
      "text": "Doesn't deserve the hate it gets! Beautiful. Mandy Moore is a true blessing and deserves more credit for this role."
    },
    {
      "rating": "2",
      "text": "I honestly find it hard to believe that any sensible person would want to subject themselves to this utter tripe. Full of character archetypes, shameless manipulation, trite dialogue, and contrived drama, A Walk to Remember is unmistakably the work of a hack; a hack thinks this is the only way to write a compelling romance. Excuse me, but I like romances where I feel for the couple because I like them as people, not because they're religious and contrived illnesses separate them. That's how you can tell when a movie does not care for its own integrity, and simply chooses to manipulate. There are no characters in this mass, only archetypes and contrivances."
    },
    {
      "rating": "1",
      "text": "Another love story full of cliches, what is the point of watch a movie that tries hard to make you feel bad for someone or something? a movie that doesnt teach you anything? this is too predictible"
    },
    {
      "rating": "0",
      "text": "Kid that falls in with wrong crowd, check.  Shy, theater chic that no one likes, check.  A bad-moral friend that tries to stop the couple, check.  Random black friend thrown in to do aimless rap and crack terrible jokes, check.  A-hole dad with a stick in his butt that pulls it out in the end, check.  Dad that abandoned his son but tries to reconnect, check.  Dying person romance with a list of stuff to do, check.  Girl who can sing and gets a leading role due to this fact only, check. Sappy love scenes where Mandy retains the same facial expression, a wedding, a death, a bad choice, lesson on faith.. Should I go on and on? The two dudes in the movie that fall out as friends show a bit of acting snuff, but the girls are simply terrible. I'm sorry, but a teen with leukemia isn't gonna be dancing around in school plays and singing up a storm. I am a Christian, so I admire the message this movie attempts to convey, but it just isn't enough. I think my favorite part of the movie was the opening 5 minutes. The rest has no plot, jumbled character archetypes, and one cheesy cheesy cheesy moment after the next. Really, is this what the intelligence level of our teen girls has fallen to?"
    },
    {
      "rating": "3",
      "text": "Boring, and totally unoriginal. A girl who gets teased a lot, and then some popular guy spends time to fulfill her top 3 to-do list? What? If you're going to go fantasy/fairytale, make it a cartoon. It isn't horrible, but it falls short and it's dull."
    },
    {
      "rating": "8",
      "text": "The problem with Sparks is that he uses the same formula  and patterns  of cliche's in his movies. In this teen chick flick movie, he does it again! and how am i not surprised? i know it's weird for a guy like me to say that film is emotional. Grade B"
    },
    {
      "rating": "0",
      "text": "Terrible movie that doesn't stand the test of time. Horrible acting, predictable. bible bashing trash."
    },
    {
      "rating": "9",
      "text": "A Walk to Remember was a very touching romantic film that really effected my inner emotions very deeply. It's corny, commonplaced, touchy moments were endurable because it alters your mood from being exhilarated to set your eyes to the screen to being heart-broken and depressed in a good way. This is by far my favorite Nicolas Sparks adaptation; it will always be.\r Rating: 9/10\r A+ = 10\rA = 9\rA- = 8\rB+ = 7\rB = 6\rB- = 5\rC+ = 4\rC = 3\rC- = 2.5\rD+ = 2\rD = 1.5\rD- = 1\rF = 0"
    },
    {
      "rating": "10",
      "text": "While watching this movie, some things were said by the main character Jamie that really made me think about how things happen for a reason. Landon became a huge, yet unexpected, part of Jamie's life at the right time and it brought me joy that she had the happiness she deserved. This movie brought me laughter and it really got to my emotions. If you're someone who doesn't mind crying in movies, then I highly recommend this movie!"
    },
    {
      "rating": "2",
      "text": "This movie looks like a beautiful romance film.But it isn´t.Is junk.I call it A walk to throw up.The actors are in the way,but the screenplay and the director is a junk."
    },
    {
      "rating": "1",
      "text": "Though I'm always up for a chic flick, the acting in this movie makes it just painful to watch.  Some cry at the end of the movie, I cried hoping it would just end."
    },
    {
      "rating": "3",
      "text": "bad screenplay, very bad lead acting and very boring 1h 41 min. Do not have to watch this movie!!!"
    },
    {
      "rating": "5",
      "text": "not a terrible movie, but not that good."
    },
    {
      "rating": "0",
      "text": "I was very disappointed after watching this movie. After reading the book, I automatically fell in love with the characters and could not wait to see them come to life in the movie. The script writer left out almost everything from the book which I for one, was very shocked about. There were so many beautiful scenes in this book and the way Nicholas Sparks writes is like a work of art. In the book, Jamie is portrayed has the girl who always helps the needy. She is always volunteering at the orphanage. I thought it was very strange how they left  such a significant detail out of the movie. My all time favorite part of the book was when Landon went to collect the money jars for the orphans for Jamie. I can honestly go on and on about how poorly this movie was directed. But than again, the books are always better than the movies."
    },
    {
      "rating": "10",
      "text": "A movie too beautiful for the cynical mind to accept. Mandy Moore was sorely lacking in experience though perhaps that leant credibility to her role. Shane West was fantastic! He knew the role and tended to its requirements. He had me bought, hooked, and breaking it off with the Significant Other, and that was before he pleaded with his cardiologist father to cure a cancerous Jamie. I mean honestly, who doesn't want; crave to be loved by Shane's Landon? A lover's movie. Parents, Siblings, Friends, Fresh and Jaded lovers. In written form it drips candy, but allow yourself and you too will empty the kleenex boxes. In short, Everyone wants to be Jamie, but we're all afraid to admit it. Terrified of breaking step with the norm. Perhaps we wait until death knocks on our door."
    },
    {
      "rating": "5",
      "text": "Compared to \"The Fault in Our Stars\" this movie has better plot and actors. ........................................................................................................"
    },
    {
      "rating": "7",
      "text": "Jamie is very religious and unpopular in school, while Landon is 'bad'\rand popular. In the beginning Landon and his friends are teasing Jamie.\rBut when Landon has to do a school play, he asks for Jamie's help. It\rwas really interesting to see how two different personalities\reventually are growing closer and closer to each other. From then, they\rfell in love with each other. Both have a wonderful time together. But\rthen Jamie has sad news, she tells Landon that she has leukemia. So\rthey are going to do everything that she always wanted to do in her\rlife, like get married in the church where her parents got married. I\rfound it a really beautiful and touching end. Actually it was a bit\rpredictable, but the film is so compelling, that you really want to see\rthe end."
    },
    {
      "rating": "7",
      "text": "I love the writing of Nicholas Sparks, I find it very heartfelt and honest. When it comes to the book A Walk to Remember, it was good with a heartfelt ending and characters and the story did touch me, but some of dialogue was occasionally lazy and repetitive for my liking.The movie is a decent one. It does try to stick to the spirit of the book even if one or two of the details aren't as coherent, and it mostly succeeds. The pace can be a little too mannered though, and although most of it is genuinely touching there are other times throughout the movie when the story and subject matter tries a little too hard to evoke emotion. There is the length too, I personally felt it could have been shorter.However, A Walk to Remember is beautifully filmed, with beautiful locations and striking photography. The soundtrack is poignant and beguiling, the script tries hard to excise some of the more lazy and repetitive dialogue of the book and while some of it is still a little too repetitive for my taste it is also very honest and heartfelt. The story was enough to warm and break my heart, and the ending touched me hugely. The direction is eager as are the performances. Shane West is very charming and Mandy Moore is convincing, but Peter Coyote and Daryl Hannah are the ones who really impress.Overall, while it does try too hard sometimes A Walk to Remember is a decent movie. For other movies based on Sparks' work, I recommend The Notebook and Message in a Bottle over this both of which genuinely resonated with me, but as a film A Walk to Remember is much better than the forced and predictable The Last Song. 7/10 Bethany Cox"
    },
    {
      "rating": "6",
      "text": "So the plotline is a little cheesy but it does show some heart.  It's not all sugar plums and fairies."
    },
    {
      "rating": "2",
      "text": "Terrible, overrated, boring, bland, bleak, predictable, cliched, cheesy, unoriginal, sappy, and pathetic film. Bad acting (mostly from Mandy Moore who is a terrible actress) and only cliches. I don’t understand why so many people like this terrible movie. It’s so boring, predictable, cliched, and poorly acted. Even when I was a teenager I hated this movie. A Walk to Remember bored the living daylights out of me."
    },
    {
      "rating": "10",
      "text": "$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.》■》■》■》■》■》■》■》■》■》■》■》■》■》■》■》■"
    },
    {
      "rating": "10",
      "text": "One of the best movies i've ever seen in my life. I love drama films, but not only. Heart touching movie. So beautiful."
    },
    {
      "rating": "10",
      "text": "Beautifull love story:)"
    },
    {
      "rating": "10",
      "text": "It was the best ever movie and it makes me cry everytime i watch it."
    },
    {
      "rating": "9",
      "text": "Great drama movie. It has the laughs, tears, and soft moments a drama movie should have. Good for a date movie or to just pop in and rewatch! One of Mandy's best works."
    },
    {
      "rating": "8",
      "text": "kogoś powaliło że dał temu melodramatowi 35 pkt ... debile z was i tyle... ten portal schodzi na psy"
    },
    {
      "rating": "10",
      "text": "*:*:*:*:*:*:*:*\"*\"*\"*\"*\"*\"*;*;*;*;*;*;*;*;*;*;*;*;*;*;*;☆⊙°••°⊙☆⊙⊙°••°⊙☆⊙⊙°••°⊙☆☆⊙°••°"
    }
  ],
  "recommendations": [
    "the_notebook",
    "if_i_stay",
    "the_vow",
    "the_lake_house",
    "bridge_to_terabithia",
    "the_lucky_one",
    "the_last_song",
    "midnight_sun",
    "the_fault_in_our_stars",
    "flipped",
    "seven_pounds",
    "we_bought_a_zoo",
    "me_before_you",
    "paper_towns",
    "love_hard",
    "meet_joe_black",
    "last_christmas",
    "lost_in_translation",
    "juno",
    "the_bucket_list",
    "the_art_of_racing_in_the_rain",
    "hannah_montana_the_movie",
    "greenberg",
    "the_twilight_saga_breaking_dawn_part_1",
    "the_spectacular_now"
  ]
}