{
  "id": 4517,
  "title": "About a Boy",
  "starring": [
    "Hugh Grant",
    "Nicholas Hoult"
  ],
  "runtime": 101,
  "genre": [
    "Drama",
    "Comedy",
    "Romance"
  ],
  "description": "Will Freeman is a good-looking, smooth-talking bachelor whose primary goal in life is avoiding any kind of responsibility. But when he invents an imaginary son in order to meet attractive single moms, Will gets a hilarious lesson about life from a bright, but hopelessly geeky 12-year-old named Marcus. Now, as Will struggles to teach Marcus the art of being cool, Marcus teaches Will that you're never too old to grow up.",
  "releaseYear": "2002",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/qoZ1bD0q9EFqcNiEYbEigsRcNCt.jpg",
  "categories": {
    "plot": 7.0,
    "acting": 6.818181818181818,
    "ending": 7.5,
    "soundtrack": 8.0,
    "cinematography": 5.0,
    "familyFriendly": 6.0,
    "funny": 7.7,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "8",
      "text": "The original book was witty, ingenious, smart, and cheerful. It had life and power in every page. The characters were humorous and charismatic.  Everything was great. Hey, what about the movie \"About a Boy\"? Fabulous, and even better than the book."
    },
    {
      "rating": "4",
      "text": "Movie had a lot of potential, but just fell apart at the end, as it veered too far away from Hugh Grant's character and started meandering all over the place. It felt more manipulative and cheap than heartfelt, and never really made me believe that Hugh Grant had suddenly turned some sort of magical corner. The problem with the movie is the problem with nearly all of Hornby's books - we're supposed to believe that the characters turn a corner but don't completely come around the bend. This works much better in his novels than in the three movie adaptations there have been of his novels thus far. On the screen the \"he's sort of a good guy, but not quite\" just doesn't leave you feeling complete when you leave the theater."
    },
    {
      "rating": "9",
      "text": "A self-absorbed metrosexual becomes human. A wonderful exploration of masculinity in a post-feminist age."
    },
    {
      "rating": "6",
      "text": "A light, fun \"feel good\" movie and that's the extent of it. Hugh Grant carries the film as he is an interesting likable fellow to watch writhe and simultaneously ham it up on screen. Will appeal to those looking for light not-too-dumb fare with a bit of crowd pleasing charm and humor. But that's the extent of it. It is not bad, nor is it very good."
    },
    {
      "rating": "6",
      "text": "It's nice enough to sit through all the way. I found myself faintly smiling now and then, but it never makes you laugh out loud. Nor does it really hit the heart in any way. Strange, because the story has the potential. The main character who lives all his life superficially, suddenly finding himself having a real, loving connection with some people. Shouldn't that be story enough for a tissue or two?"
    },
    {
      "rating": "6",
      "text": "Good acting, decent plot, somewhat funny, but it could get tedious and slow at times."
    },
    {
      "rating": "7",
      "text": "Hugh Grant at his best as a self absorbed man who gets drawn into the world of a geeky boy where an unusual relationship develops. As the friendship progresses he learns from the kid what life is actually about. While it doesn't have many side splitting moments it does entertain and is definitely worth checking out."
    },
    {
      "rating": "7",
      "text": "Hugh Grant has finally found his calling; playing a literal grown-up who has yet to grow up. He and Nicholas Hoult work together with more charm, humor, and sincerity than Andie MacDowell ever came close to."
    },
    {
      "rating": "8",
      "text": "It's eccentric, often crude, and seamlessly silly, but About A Boy finds its stride at the forefront of most non-commital men, children.\rHugh Grant has left his stammering,stuttering baby-face like persona back home and s extremely confident and funny as the free-wheeling and hedonistic bachelor Will, a man living off his fathers one hit wonder Christmas song, and this film picks up through the central character trying to pick up women at SPAT (Single  Parents Alone Together). Through this, he runs into the weird and wonderfully blank Marcus, (the debut of Nicholas Hoult). What follows is a simply hilarious chain events where Marcus appears to be the only person privy to Wills plans and so begins to visit him everyday after school to just socialise (and watch Countdown) and even discuss girl problems, a 12 year old versus a 38 year old. The story is told through a double narration from both Marcus and Will, attempting to clarify and explain their friendship with each other, from Marcus continuing struggles with his suicidal mother (the excellent Toni Collette) and Will's attempt to start a relationship with Rachel (Rachel Weisz).\rThis film deals with all the typical problems seen in a dysfunctional lifestyle, which in turn shows to be quite a frequent theme in most peoples lives, troublesome children, marriage, sex, single parents, it all appears in a light-hearted attempt to show the trial and error ways of dealing with children, mid-life crisis etc.\rWith a wonderfully ridiculous climax, this film will indeed play on the heartstrings in  mild-mannered fashion that only a British comedy can deliver, it has all the great performances, particularly the two leads, a stepping out of the comfort zone Hugh Grant is especially convincing as the care-free bachelor but it was young Nicholas Hoult, whose career undoubtedly went from strength to strength after this role, stole the show as the young, confused, but not so naive Marcus, who takes no bull from anyone, typically as most children are, but a lot of nerve would have had to go into accepting that role and he embraced it with every fibre. Another excellently delivered British flick that will not fail to amuse a wider variety of audiences, whether its coming-of-age or simple twists on a rom-com, definitely worth watching."
    },
    {
      "rating": "6",
      "text": "I have to admit that when any adaptation manages to stand side by side as an equal with the novel, it surprises me. â"
    },
    {
      "rating": "6",
      "text": "There are smart moments of wit and poignance, but it's Hugh Grant's performance that'll stick with you. Grant's sidekick, the newcomer Nicholas Hoult, clearly was able to learn a thing or two and give a fine performance himself."
    },
    {
      "rating": "9",
      "text": "A feelgood, sometimes serious, and downright hilarious brit comedy. Pure gold in my book and a brilliant performance by both a young Nicholas Hoult and Hugh Grant"
    },
    {
      "rating": "8",
      "text": "hugh grant dan little nicholas hoult memegang kendali penuh di film ini dengat awesome di samping saya juga suka karakter dari toni collette, film yang sangat menghibur dan manis"
    },
    {
      "rating": "6",
      "text": "About a Boy movie was a good translation of the book but lacked some important details. The movie show perfect images given by the book but main points were not reached. The movie also seemed rushed and just speed across the deep situations that needed more explanation and more focus. Even though the movie left out some parts which helped show the change Marcus went through, it was a great example of the novel and was also very heartwarming."
    },
    {
      "rating": "7",
      "text": "Compared to the book, the movie was spot on with the most of the dialogue. The movie did not show how Marcus changed as much as he did in the book. In the end everyone's relationship with each other turned out pleasant in the movie but, they missed a big scene between Elli and Marcus. The ending of the book showed more of the point of \"about a boy\"."
    },
    {
      "rating": "8",
      "text": "I wouldn’t say About a Boy is a masterpiece, but it’s quite a funny and touching story that’s better than the book.  The casting was great; I particularly liked Hugh Grant and Nicholas Holt (who, fun fact, is one of the stars in the X-Men film franchise as young Hank McCoy, aka Beast) as Will and Marcus.  One of the reasons why I thought the movie was better than the book was because the movie’s ending was better than the novel’s ending because it had a lighter side.  The only thing that was my least favorite difference was when Will told Rachel the truth about him and Marcus.  In the novel, she seemed a little confused at first, but then didn’t seem to mind.  In the movie, their relationship ended, but became a couple again after she saw Will helping Marcus out with his music performance at school.  Overall, it’s a very good movie.  The only thing that concerns me, however, is the rating.  Usually, some PG-13 movies have one or more use of the f word.  But in this movie, it’s more than a couple, which should’ve given the movie an R rating"
    },
    {
      "rating": "8",
      "text": "This is a fun, moving and nice comedy. A story of an immature, cynical man, Will, who is taught how to act like a grown-up by a little boy, Marcus. Will is a rich, lonely man who lies about having a son and an ex-girlfriend, to seek out single mothers, where he meets Marcus, a 12 year-old misfit boy, who has depressive mom. Will has a closed-off personality, but then Will realizes that he cares about Marcus. Will and Marcus meet new people, and they learn to share good moments with others."
    },
    {
      "rating": "8",
      "text": "Overall, the movie was very similar to the book. The movie was very moving and a comedy at the same time. The storyline was great and very interesting. Definitely a must-see!"
    },
    {
      "rating": "8",
      "text": "Its about a strange boy name Marcus who meets a womanizer who goes out with single parents name Will played by Hugh Grant. Marcus in need of friends and a father figure turns to Grant who wasn't keen on spending time with anybody but himself. Eventually Marcus and Will become friends helping each other grow throughout the movie whether it was being a normal kid or actually learn how to love and not be alone."
    },
    {
      "rating": "9",
      "text": "Very well crafted dialogue and fantastic soundtrack. The relationship between Hoult and Grant is probably one of Grant's most enduring."
    },
    {
      "rating": "8",
      "text": "This movie is an excellent movie to watch with your whole family, regardless of personal tastes. The movie is well written, the characters are humane and you care and feel everytime for every character. The drama part lasts enough for you to care and is short enough for not becoming on eof the movies \"that makes you laugh and punches you in the face\". Hugh Grant is great, i really enjoyed this piece."
    },
    {
      "rating": "8",
      "text": "Hugh Grant in a role similar to 4 weddings and a funeral. The idea of a man-child dating with single mothers has no waste and works all along the 101 minutes. For watch if want to know with a single mother or how to kill a duck with a loaf of bread."
    },
    {
      "rating": "7",
      "text": "La trama es entretenida y tiene momentos muy divertidos; la recomiendo mucho."
    }
  ],
  "recommendations": [
    "young_adult",
    "the_perks_of_being_a_wallflower",
    "the_glass_castle",
    "the_princess_diaries",
    "wonder",
    "endless_love",
    "the_intern",
    "me_before_you",
    "the_big_sick",
    "christopher_robin",
    "about_time",
    "gifted",
    "big",
    "sleepless_in_seattle",
    "silver_linings_playbook",
    "lady_bird",
    "love_actually",
    "cruel_intentions",
    "life_as_we_know_it",
    "the_descendants",
    "home_again",
    "the_age_of_adaline",
    "fatherhood",
    "instant_family",
    "the_spectacular_now"
  ]
}