{
  "id": 253,
  "title": "Abraham Lincoln: Vampire Hunter",
  "starring": [
    "Benjamin Walker",
    "Dominic Cooper"
  ],
  "runtime": 105,
  "genre": [
    "Action",
    "Fantasy",
    "Horror"
  ],
  "description": "President Lincoln's mother is killed by a supernatural creature, which fuels his passion to crush vampires and their slave-owning helpers.",
  "releaseYear": "2012",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/5dTZylzoBV9qsrub9vYLAZrNkX3.jpg",
  "categories": {
    "plot": 5.875,
    "acting": 5.928571428571429,
    "ending": 8.25,
    "soundtrack": 7.0,
    "cinematography": 5.333333333333333,
    "familyFriendly": 3.0,
    "funny": 6.454545454545454,
    "action": 6.52542372881356
  },
  "reviews": [
    {
      "rating": "4",
      "text": "Jumped around from part to part way too fast and the plot in the movie deviated from the book wayy too much.  Even with these flaws there were parts that I found funny and exciting but i think with a better director and if the plot was more in line with the book it could have been a great movie"
    },
    {
      "rating": "5",
      "text": "This is a very strange film, I'll start by saying I knew nothing about it before I went and was honestly expecting it to be some horror/comedy/action crossover.  It jumps about far too much and doesn't seem to know what type of film it wants to be which makes for a confusing experience. On the plus side the action scenes are unbelievable (I'm not going to spoil anything but the horse chase is something else!), the cinematography looks beautiful and the actors all play their parts very well.  It's certainly not a badly made film, but the plot really needed a bit more focus. I did have a laugh watching this film although whether that's the intention of the creators I'm not sure."
    },
    {
      "rating": "1",
      "text": "Textbook example of a mindless blockbuster which fails to excite, breathe ANY new life in terms of its formulaic plot and avoid clichés. One of the worst films of the year!"
    },
    {
      "rating": "5",
      "text": "Filled with action giving a amazing time in theater, but it has it's weaknesses, There are problems with acting and the myth behind vampires is mast up in it. Al the negative parts can and will be forgotten by the amazing set designed and fight scenes. Overall its an okay movie."
    },
    {
      "rating": "7",
      "text": "I must say I laughed on this one way more than on most comedy movies, if one asked me to describe its genre, it'd be a trash movie, like Robert Rodriguez's Machete. While the story is absurd and quite dull, the movie shines in its action scenes. Seriously, the horses scene is so ridiculous it's even fun. Never thought I'd see a horse being thrown at Abraham Lincoln, after which he just mounts it and continues chasing the vampire with an axe. It's a nice movie, just don't take it too seriously."
    },
    {
      "rating": "6",
      "text": "Abraham Linclon actually had a strong potential at the beginning, but every seconds it weakness shown which makes this movie becomes forgettable. not a memorable movie from this year."
    },
    {
      "rating": "9",
      "text": "This is one of the most underrated movies I have seen in quite a while.  I expected an over-the-top zombie action flick with little substance, plot, or real artistic flourish.  I experienced nearly the opposite.  Early on, the casting felt spot on and the characterizations, while not the epitome of acting, were certainly far better and more nuanced than say, the recent episode of Batman.  From an early scene where we are catapulted into the fright of a zombie attack to a beautifully creative palette of a zombie chase atop a horde of horses I was drawn further into the period.  In scenes reminiscent of the painting of that era and the landscapists of the time, the art direction was simply beautiful.\r The metaphors of vampires, evil, and the civil war were all enjoyable on the screen and fairly well played.  While I have heard that some considered this a fantasy aimed at lessoning the moral burden of the 'white man' in the role of slavery, it certainly didn't feel that way.  Unfortunately, it does, however, portray Lincoln as someone seemingly more concerned with the fate of at least one close African-American who had been born free but chased for years.\r All in all I am looking forward to seeing the movie a second time before it leaves theatres.  Even my wife, who is typically not particularly fond of action movies enjoyed the movie enough to want to see it a second time."
    },
    {
      "rating": "8",
      "text": "A painfully stupid, abysmally ridiculous over the top action packed movie. Exactly what you would expect from a movie named 'Abraham Lincoln: Vampire Hunter'. I am almost sure that the whole idea of the movie was to pack it with as much consecutive action and cheesiness as you can and make you cringe every now and then. Although occasional scenes seem serious and philosophical so you are basically left off wondering \"what the hell? what did they make all those scenes for?\". Also be sure to read and enjoy reviews of people doubting historical accuracy of the movie ^_^"
    },
    {
      "rating": "4",
      "text": "Over the top, ridiculous, and set to a break neck pace that will give even the most amped up movie goer whiplash, its easy to forget the misfire that was Abraham Lincoln: Vampire Hunter. Despite this, whenever I am reminded of this movie, I am glad that I live in a universe where something so outrageous exists. Thats really Abraham Lincoln: Vampire Hunter in a nutshell: the premise is infinitely better than the movie itself."
    },
    {
      "rating": "6",
      "text": "I actually laughed at some of the action in this movie.  Not because it was bad, but because it was so over the top ridiculous I couldn't help but be amused.  By the same director who did the bullet-bending \"Wanted,\" and if you liked that one you'll probably have fun with this.   If not, or if the trailer and concept of a revenge seeking, vampire-killing Abraham Lincoln doesn't put a smile on your face, go ahead and skip.  High art and drama is no where to be found here.  If you love a good bad action movie, you'll love it."
    },
    {
      "rating": "7",
      "text": "I can't believe critics are complaining that this movie conflicts with history. The movie is called 'Abraham Lincoln: Vampire Hunter' what did you expect? Lmao. This is probably the second best new movie I've seen this year but that's not saying much... not much at all."
    },
    {
      "rating": "10",
      "text": "Oh man, this movie... let me tell you my experience. My friends and I like to go see movies that look corny and bad (like Skyline and things of that nature) at non busy theaters in the middle of the day so that we're the only ones in the theater and do laugh-along commentary, sort of like it's MST3K. We went to this movie to do just that. It looked like a corny movie with OK action and a bad story, and reading reviews confirmed this. What did we get when we sat in that empty theater and watched it, though? We got a gripping experience with awesome action, intense excitement, awesome acting and plot. An all around awesome movie that we all left saying that it was one of the best movies we had all seen in a long time. Go see this movie. You will not be disappointed, and you will not be laughing along."
    },
    {
      "rating": "6",
      "text": "Apparently Abe Lincoln and Buffy have more things in common that we thought, a reminder that vampires, much like their mythical relative, zombies, can be shoehorned into pretty much anything. Such a strange concept this was, it's bound to be silly to match a president with blood-sucking half albinos, yet there's an appeal to the axe wielding kills, a true artistic butchery prowess that I have yet to enjoy much on cinema. Yes, the justified axe murdering is the star in this confusing horror sometimes comedy flick.\r The plot depicts Abe's life from his traumatic childhood to his awkward part time job as a vampire hunter. It's rather predictable, with a woman falls madly in love with a young drifter, and the hunter is torn between his double life and his love. There's daunting secrets, conspiracy and such, but they are pretty flat. You're here to see people get slaughtered with axe, and Abe (Benjamin Walker), a tall hulking vengeful man, delivers just so. He has that idealist and innocent look, which works quite well on building a hero more than a president.\r However the movie stands flimsily at the border on heavy subject, slavery, and ridiculousness, narcissistic vampires, who while thankfully do not sparkle, but strangely are resistant to sunlight. There's unnecessary corny over-the-top background for these blood sucking pseudo monsters, they are not as secretive as they should be as an organization whose agenda is creating utopia for their kind. Pretty much every vampire who's confronted will hiss in an exaggerated scary face, I really doubt they can survive that far if they're that flashy.\r The action is definitely good, some of the creative ways to dispatch vampires are joyful to watch. It takes heavily on post-300 slow mo critical shots, which is good since the motion is quite smooth. Its worst flaw is it tries too hard on taking serious issues in lighter tone, thus creating an unbalanced story which is a tad too dark to be humorous and too silly to be thoughtful. If everything else fails, rest assure that between the uninteresting bits, there'll be decapitated vampires. 6/10"
    },
    {
      "rating": "8",
      "text": "When one attends a film about a former United States President slaying unholy creatures of the night, one does not expect a beautifully written, tear-jerking, dramatic masterpiece. One expects awesomeness, which Abraham Lincoln: Vampire Hunter delivers.\r It is, first and foremost, an action film so the quality of the action seems the logical starting place for this review.\rThe fight scenes are glorious testaments to ingenuity, shining with the kind of creative violence normally presented by serial killers. Every single battle is perfectly choreographed so as to be visually impressive and, at the same time, believable and in keeping with Lincoln's go-to fighting style of \"Desperate Brutality\".\rExpect to see Mr. Lincoln kill many vampires with the closest sharp/heavy object or piece of scenery to hand. My personal favourite moment is when a panicked vampire, fleeing through a field, frantically picks up a passing horse and attempts to club Lincoln to death with it.\r Which is not to diminish the non-violent aspects of the film. In a story featuring The Great Emancipator as the lead protagonist, the issue of slavery and the Civil War between the Union (anti-slavery) and the Confederacy (pro-slavery) were bound to rise up out of the setting and into the plot, something that AL:VH takes perfectly in it's stride and uses to bridge the gap from angry, young Lincoln who hates vampires to wise, experienced Lincoln who loves freedom, a progression that fits perfectly into the narrative.\r Which is essentially the plot of the story. Like a video-game character, Lincoln goes from fighting one vampire to fighting a dozen of them to fighting an army (the confederacy being conveniently run by vampires) until, eventually, his crusade against vampires becomes a crusade against evil (specifically the evil of Racial Inequality) culminating, in true Action-Film mentality, with Abraham and his black BFF fighting vampires side by side atop a moving train.\r Lincoln is portrayed by Benjamin Walker, a relative newcomer to the industry, but he excels in the role, performing a youthful and elderly Lincoln with the same degree of believability. He is backed up by his vampire-hunting posse of Dominic Cooper (The Devil's Double), Anthony Mackie (The Hurt Locker) and Jimmi Simpson (Breakout Kings), all of whom perform excellently.\r To conclude, AL:VH has no illusions of grandeur. It's an action film, and a bloody good one."
    },
    {
      "rating": "9",
      "text": "While is does fall from the book on almost everything except characters and idea it was a great action movie. I was hoping that it would be the same as the book, but was still very pleased with this movie. I think people were just turned off by the whole idea of it. As a fan of action movies and alternative history I highly recommend the book and the movie a little less."
    },
    {
      "rating": "2",
      "text": "The director couldn't be bothered setting up his characters' emotional responses.  He decided it was better to convey the characters' emotions by simply bludgeon you over the head with the dialogue.  This movie was just awful."
    },
    {
      "rating": "8",
      "text": "Abraham Lincoln: Vampire Hunter is a wickedly-fun, over-the-top vampire slashfest that requires total suspension of disbelief.  Taken from the novel by author Seth Grahame-Smith (who also wrote the screenplay), Hunter is historical fiction on steroids, requiring total suspension of disbelief and a healthy appetite of the macabre to take it seriously.  But once those barriers are removed, Hunter is a wild ride, almost challenging its audience with such a ridiculous plot that no amount of sane historical inquiry can be applied. After witnessing the murder of his mother by his father's former slave boss Jack Barts (Csokas) when he was nine, the now-adult Abraham Lincoln (Walker) decides to exact revenge by first getting drunk at a bar.  There, he meets the European-stylized Henry (Cooper), who attempts to discourage Lincoln from carrying out such folly.  Soon, Lincoln has Barts dead on the ground, or so he thinks.  Barts is really a vampire, and the human trafficking he conducts represents food for the growing vampire population in the South.  Henry steps in to save Lincoln's life, but only with the promise that he join Henrys campaign to slay the escaped Barts and the other night crawlers.  Soon, the former rail splitter is doing just that, but not before several funny and well-done sequences with Henry 'training' Lincoln with his fists.  An unconventional man, Lincoln won't use standard weapons to kill blood-suckers, instead choosing one of a rail splitter to carry out his task.  Covered in silver, Lincoln's axe becomes the anvil for his war against those who killed his mother.  The work of a vampire hunter is a night job, and Lincoln must maintain a low profile by working as a store clerk for friend Joshua Speed (Johnson).  There, Lincoln meets Mary Todd (Winstead), quite against the wishes of Henry, who demands 'no connection, no children' from his disciple.  Courted by Senator Stephen Douglas (the uncredited Alan Tudyk), Smith interjects a bit of historical irony, as Douglas and Lincoln will eventually debate the issue of slavery throughout Illinois in 1858.  As Lincoln wins Todd's hand and begins to ascend through the ranks of political society, his vampire body count begins to rise.  This merits the attention of head vampire Adam (Sewell), who sends his assistant (supermodel Erin Wasson) to stop Lincoln.  As the Civil War begins and moves quickly to the critical Battle of Gettysburg, Lincoln must decide if he'll continue to fight Adam, protect his family, or try to save the nation from a South littered with vampires and slaveholders.\r Director Timur Bekmambetov (Wanted) bathes Vampire in slow-motion visuals (think vampires meet 300),Matrix-like stunts, and a horse chase that might become an instant classic.  Unlike some green-screen directors whose actors appear stolid, uncomfortable, and perhaps incapable of imagining the action, Bekmambetov's subjects flow through each sequence, carrying out bloody acts of aggression in a way that looks and feels like gruesome ballet.  Walker plays a terrific Lincoln, as does Cooper's playboy Henry.  There's not one miscast here, with the beautiful Winstead offering nice visual breaks from all the carnage.  The 3D transfer (whether it was post-produced or shot in 3D) is easily one of the best of the year, showing off a possible new trend of creating lifelike depth rather than the totally unsatisfying in-your-face style of Clash of the Titans.  Composer Jackman (X-Men: First Class) leads the audience through a soundtrack that's dark, pulsing, and serves the overall feel of the story very well.  There are some bumps and misfires along the way, but the overall effect and look of the picture is highly entertaining.  There's a lot left out from the Vampire novel that would have been interesting to see played out on the big screen, including Lincoln's meeting with none other than Edgar Allan Poe, who also received star treatment this year in the under-appreciated but better The Raven.  However, given the fact that shooting to world premiere took only one year, it's amazing the 105-minute film looks as good as it does: credit Producer Tim Burton with helping to pull that off. Abraham Lincoln: Vampire Hunter is presidential author Doris Kearns-Goodwin's worst nightmare.  World-renowned historians like her might not want to watch the film, based on the way it selectively uses historical facts to advance the story, not to accurately depict significant events as they unfolded.  But baring that small population of history enthusiasts, Vampire will appeal to fans of the book as well as newcomers who should be impressed by how unafraid it is of its own bombast.  It's purely fun to watch, the acting is solid, and the 3D transfer is actually better than Pixar's Brave.  It should more than make up for its paltry $70 million budget and outperform its bloated Battleship and John Carter competitors with a style that's completely over the top and proud of it."
    },
    {
      "rating": "8",
      "text": "Perspective: I have never read the book or Wiki page for that matter\r Expectations: The trailers introduced a wild concept that had enough outlandish action to warrant my attention\r Delivery: This movie doesn't waste much time getting to the point as characters are introduced, the atmosphere is set, as Abe answers the call to adventure and  finishes his training within the first 30mins before jumping directly into the thick of things. It has just enough romance (thankfully, not too much), and some brotherhood-ish moments to add some dramatic balance to the action, a few twists sprinkled in to spice things up a bit. its incredibly rewarding to watch Ole Honest Abe spinning, kicking, and chopping the crap outta the undead If you can except the outlandish concept of Abe Lincoln hunting and fighting vampires, and except the obvious propaganda and subliminal messaging that comes with any account of U.S. history, its a pretty ridiculous action movie that's probably a lot better than it should be."
    },
    {
      "rating": "7",
      "text": "Timur Bekmambetov (Director of \"Wanted\") brings us a side of Abraham Lincoln we never new about. . . . in slow motion, with an axe, who kills vampires. Does the plot sound stupid? Don't let it ruin the experience. As ridiculous as the plot may sound - \"Abraham Lincoln: Vampire Hunter\" is nothin' but a bloody, vampire killing, good time. The slow motion effects may be over used at times, but hey, it's still pretty damn entertaining to see Abraham Lincoln slice up vampires with an axe. I can now say he's my new favorite president."
    },
    {
      "rating": "3",
      "text": "Awful movie."
    },
    {
      "rating": "8",
      "text": "This movie is not nearly as stupid as you'd expect it to be. Its not a comedy film because I think a lot of people thought it was. This film follows a pretty accurate timeline that is essentially the same as the life of Abraham Lincoln, it just fills in all the unknowns with vampires. You really learn some things from this movie. This film may motivate some young people to learn more about Abraham Lincoln. There is no need to be upset about this if you are American."
    },
    {
      "rating": "8",
      "text": "Don't expect too much from this film, it's just what the title suggests, Abe Lincoln killing vampires... with his silver ax. It delivers on that very well, abandoning all inhibitions or historical accuracy. During the film, I really found it better to leave all knowledge of the Civil War or Lincoln himself at the door and simply enjoy the fun, surprisingly well staged action movie that I was presented with. All subjects covered are grossly inaccurate but aren't quite caricatures, which is what I was afraid of. The action is fantastic, owing many shots and sequences to films like the Matrix but are kept fairly original.Benjamin Walker and his co-star Dominic Cooper give adequate to good performances for their admittedly shallow roles. Anthony Mackie, Mary Elizabeth Winstead and Jimmi Simpson all do what supporting actors should do, augment the plot and roles of the main characters, and Rufus Sewell plays a fun villain. Don't see this movie for scares; if you're looking for a dark, serious tale this really isn't it. It's more what Diehard or even The Patriot would have been like with Vampires, good (if slightly trite) action, shallow plot, great sets and atmosphere. I liked it, despite my love of historical accuracy and long shots. If you're looking for some surprisingly different fun at the cinema, you will too. Happy hunting. ^_^"
    },
    {
      "rating": "8",
      "text": "Abraham Lincoln: Vampire Hunter was a fantastic film when I went to the cinema last to see it last night. The plot in my opinion was fine, revenge and kill vampires. What more do you need? Benjamin Walker did a brilliant job of portraying a young and mid-aged Lincoln who is a bad ass. This made me feel Lincoln as a president the best of all time.\rI felt emotional in some scenes which was a good feeling. This film has a good action scenes and nice shock moments, the ones where you don't know when a vampire will show up.\r This movie was a great movie, loved every minute of it including my friend. Forget the critics as we should call them, go see this movie and respect good ol' Lincoln."
    },
    {
      "rating": "7",
      "text": "The movie was pretty decent. Interesting story and cool action scenes combined with a period of history I enjoy learning about. There isn't a lot to complain about. Fun summer movie to watch."
    },
    {
      "rating": "0",
      "text": "This could have been a good movie.  This is all action scenes, it skips over what would have been story accompanied by lots of epic orchestra music.  5 seconds of fighting skips its the future with 5 seconds of fighting and so on trough the entire movie.  The formula stays the same and it gets boring quickly.  What little shreds of story there are get minced into meaninglessness.  This reminds me of captain america, the way it is filmed and it's insincere scene-chopping is much the same.\r Stupid kids should love this, but anyone with taste stay away."
    },
    {
      "rating": "0",
      "text": "Ok to start with I thought this movie might be alright or a least a bit of fun but straight the way vampires in the sun along with Twilight will people never learn to mess with vampire mythology its just stupid . If that was not bad enough the story was poor the acting bad and the action scenes just did not work I would keep well away from this one if your a film or vamp fan my first zero score very bad."
    },
    {
      "rating": "3",
      "text": "A great example of style over substance. The action is slick and edited well and the music is great but everything in between is so banal that I couldn't keep watching it. I thought it sounded like a funny concept and maybe it could have worked..but it was just boring."
    },
    {
      "rating": "10",
      "text": "I figured the critic score for this movie would have bombed, but I wasn't expecting the user scores to be so lukewarm either.\r I found this movie to be a great use of time. It has everything a person could want! Lincoln taking on vampires? What's not to love? I found it to be great. My disappointment is that I'm pretty sure it doesn't show anything about the end of Lincoln's life, which is alright I suppose, but it's just something they could have added and made it more awesome, like Lincoln going to a theater and seeing a sharp toothed Boothe.\r I like how the movie has a \"this could have happened\" feel to it, barring the fact that vampires don't actually exist. I'd recommend watching it."
    },
    {
      "rating": "8",
      "text": "Didn't have high expectations (got dragged to it by a friend) but I really enjoyed the movie. Some gorgeous visuals, occasionally inventive use of 3D, and a fun overall concept. Above all I was not BORED, which is hard to say about most other movies. This is not a bad film, no matter what some people say. And I loathe fanboy crap."
    },
    {
      "rating": "4",
      "text": "Believe me, it's crap. The biggest mistake the film made: playing a 'ridiculous' premise completely straight. What a big disappointment. The premise is interesting but the whole thing lacks energy and believe it or not, has similar 'plot points to another 'vampire themed' film last year, 'Priest' albeit in a much different setting. If you really want to watch an Abraham Lincoln film, wait for Spielberg's effort next year."
    },
    {
      "rating": "0",
      "text": "I had hopes that this was going to be great movie because of Tim Burton producing it but I was very wrong! Almost everything about this film was bad. Do not go see this movie"
    },
    {
      "rating": "6",
      "text": "It's a pretty well made period vampire movie, if you like that sort of thing.  But I kept wondering why Abraham Lincoln needed to be the historical figure main character and I never got an answer.  The action is mostly well done.  The history is difficult to reconcile with reality.  But it was still fun to watch, even though the movie takes itself too seriously.  But that earnestness is also in a way what saves it from being as exploitive as the title suggests."
    },
    {
      "rating": "5",
      "text": "First off the pacing is way too fast, as they jump from scene to scene very quickly, its hard to follow sometimes as a result. The first few vampire fights are shot sloppily as the camera cuts around so much that its hard to enjoy the fight as a result ( I heard audible \"what the f***s\" from other audience members at the showing i was at). For a movie about Abe Lincoln killing vampires, it also took itself way too seriously at parts, which would be fine if it was like that the entire movie, but just as you start to buy into it, there's a ridiculous sequence to take you out of it (horse chase sequence I'm looking at you). However the acting is surprisingly solid for a movie of this title, and everyone does a solid job, (although the old age makeup for Mary Elizabeth Winstead was awful as she still looked 20 years younger than Abe). There are a couple of standout sequences such as the plantation fight, and the train climax, and just seeing fully aged Abe killing vampires with an axe is pretty awesome. All in all, don't go into this movie expecting a masterpiece (why would you anyway?), but it does have its fun moments. Just be sure to check your brain at the door."
    },
    {
      "rating": "5",
      "text": "Now, Timur Bekmambetov is well known for the effects he uses in his movies and this is no exception. There is blood and gore all over the screen as death is meated out in many and varied ways, all in glorious slow motion. The trouble is we’ve already seen that kind of stuff before; there’s nothing new or particularly innovative here. Yes, it’s very well done; the effects guys did an excellent job; but I would have liked to have seen something different. The plot; again disappointing, it just followed well documented events in Lincoln’s life and added a narrative that meant he had to do this or that to thwart the vampire hordes. Not exactly groundbreaking either. The performances were all pretty good although nobody really stood out and nobody looked like they were really stretched either. Over all I found it pretty disappointing; not quite as bad as ‘Jonah Hex’ (2010), but heading that way.\r SteelMonster’s verdict: NOT RECOMMENDED (Unless you’re a die-hard vampire fan…)\r My score: 4.8/10"
    },
    {
      "rating": "6",
      "text": "This history mashup follows the 16th president as he battles bloodsuckers and copes with Civil War (started by the Confederacy to keep slaves alive as food for Southern vampires). The illustrative period style is visually appealing, but the pacing is uneven. There are some dazzling, violent action sequences. I'm a huge fan of director Timur Bekmambetov and even though he manages to contribute many of this signature touches to this film, it's not his strongest effort. Overall, it's an uneven, but entertaining fantasy."
    },
    {
      "rating": "3",
      "text": "lazy, boring, a typical movie to spend almost two hours sitting and killing time, does nothing, is a bit silly and totally lack of everything. next!!!!!"
    },
    {
      "rating": "6",
      "text": "Don't get too seriously silly, don't you read the title? Lincoln seriously as vampire hunter, no kidding. I don't have any serious problem with it although suffer confuse script, uneven pacing and boo moment. Let me get this straight, watch this movie and enjoy America gothic with Russian craziness, Don't forget to google that fake story."
    },
    {
      "rating": "5",
      "text": "I wasn't going to see this film, but a friend really wanted to go, so I obliged him. I had no expectations for this film at all. It is a graphic novel movie adaptation, in every way. I'll start with the plot. It's preposterous, but at least it had one, which is a precious commodity these days. Much the way the Persian Army was demonized in Frank Miller's '300', we have to suspend the disbelief that the C.S.A.-era South has been infiltrated by a vampiric cult. If I was from the South, I might take objection to that characterization. We also have to believe that old honest Abe was some sort of ninja kung fu powerhouse. It's a stretch, but necessary, and shot really well in the Legendary Pictures style. The whole vampiric curse thing is bent all out of shape, where werewolf rules and daywalking are suddenly permissible. All in all, I thought the actors did a great job, considering what they had to work with. The effects were decent, although some of the action scenes are so ridiculously impossible, you can't help but laugh out loud. Ultimately, I found it to be an entertaining piece of fluff. I have no desire to watch it again, or purchase it on DVD, but it's fun once."
    },
    {
      "rating": "8",
      "text": "First of, even though I'm a broken record on low scores, \"this movie is, according to reviewers, worse than the Twilight Saga (write it up there in the corner and see the scores for yourself)\", and that was a must say because both use vampires in their stories and both stories change some details for their vampires as well.\rWith the exception that this movie is actually good: the story is basically a reenactment of Lincoln as a Vampire Hunter, which does kind sound silly and I will admit I went inside wanting to know how it would work out, as I love reenactment of movies in a different way. And this movie did not disappointment at ALL: it's a fun action movie, with an actually interesting character, a nice story well implemented inside the actual history, and a very good resolution at the end that just takes the cake. It was pure fun and, really, my biggest gripes were maybe some weird choices for the vampires: in here, they are weak ALSO to silver (isn't that werewolves?), have no explaining for the lack of weakness to the sun (but at least they don't \"f----ing\" sparkle!), and that they can't apparently kill each other; however you'll won't bother and you'll just want to go on with the action and that few story elements it has (which I personally liked, but it could have been better).\r Very good movie, worth a watch if you love these kind of reenactment movies and just silly-but-fun ideas behind."
    },
    {
      "rating": "9",
      "text": "Fantastic flic of a film. It doesn't always take itself seriously, and the fighting can be over the top, but this is a fun movie, with some very good poetic justice on the vamps, good drama scenes without becoming angsty, and is definitely worth 9 out of 10."
    },
    {
      "rating": "2",
      "text": "It's just stupid. The actors bravely plow through the senseless dialoge. Idiotic action scenes put in for the 3D effect. This could have been a great movie. Sadly it's not."
    },
    {
      "rating": "7",
      "text": "I read the book before going to this, and I was VERY disappointed in how off they could be. Some of the characters that are in the book AREN'T even in the movie! And the most famous quote in the book isn't that sets the twist at the end. But if you went to this blind and not have reading the book then I could see you appreciating the action and the creative story. Some of the acting was pale and emotionless, a somewhat confusing story, but had amazingly choreographed fight scenes. I enjoyed it, but I wouldn't go out of your way to see it."
    },
    {
      "rating": "8",
      "text": "I enjoyed it, if you can get over the crazy idea that Abe Lincoln hunted vampires. There are some standout great scenes in it, the train scene, the horse chase scene. It's full of action, the bad guys have some good dialogue and it's genuinely sad at one point. Abe really makes you root for the good guys. 7.5 outta 10. I say go see it."
    },
    {
      "rating": "2",
      "text": "It's obvious to me that the makers are trying, not very successfully, to cash in on the hype around the Sherlock Holmes franchise. Some well crafted action sequences and watchable moody art direction aside, this is just a desperate attempt to literally make something out of not very much at all. The fictional story behind AL is laughable. And the reference to real life slavery and emancipation in poor taste. When you find your fast forwarding through the last half of the movie you know something's gone horribly wrong."
    },
    {
      "rating": "8",
      "text": "This is a better film than the movie Priest. The action is big and the plot is smart for a movie in a genre like this. Its an impressive summer movie."
    },
    {
      "rating": "9",
      "text": "This movie knew exactly what it was: Abe Lincoln killing vampires. This movie far exceeded my expectations. It was over the top in an extremely funny way and the director knew it. This is not a great master piece of film but not every movie needs to be. I never once had my smile leave my face while I was watching this movie. It was up surd and hilarious."
    },
    {
      "rating": "9",
      "text": "A surprisingly good film. While some people may call it overrated this film really does blend history with fantasy in a clever way. I honestly was surprised at how good the action scenes are, plus it has some great music and special effects. One of my favourite vampire films!"
    },
    {
      "rating": "8",
      "text": "Truly an amazing film in every respect. Meanwhile, I must say it was original and courageous choice to make a Lincoln Slayer. The story follows more or less the true life of the president in the midst of putting his secret life as a vampire hunter. The fun is guaranteed and there are never moments of boredom. The 3D is well done and the music can bring the viewer in action."
    },
    {
      "rating": "1",
      "text": "There is absolutely nothing redeeming about Abraham Lincoln: Vampire Hunter.  The movie was rotten from the start when it became clear that instead of making a fun movie like the title would suggest, the filmmakers tried to sell us a very real and serious picture, something that just isn't possible considering the outlandish themes present in it.  At times the plot of the movie becomes confusing and just down right ridiculous, even for a Vampire movie.  Then, of course, there is the cast that didn't put any emotion into their characters they portrayed and seemed rather stoney for the entire duration of the movie.  All this aside, you would at least expect the visual effects to be amazing, right?  Wrong.  The effects are laughably bad, and the many fight sequences are excessively \"stylized\" with jarring transitions between slow motion and real time.  So, in summary, you shouldn't see this movie."
    },
    {
      "rating": "6",
      "text": "This film is based on a novel (which by the way has a different ending), and shows Abraham Lincoln, in an alternate world where he loses his mother to vampires, and fight against them in his revenge and eventually in a Civil War, where the South uses them as secret weapon. The script is mildly interesting and use historical facts, that were changed or omitted (eg the 4 children of Lincoln does not exist here), admixed with the central plot - the acting is good, but nothing worth of an Oscar. The most prominent and attractive feature is the photography of the movie that uses some cool effects (Matrix style) and color contrasts that are very interesting in several scenes. But there again: any script of other era with vampires would be cool anyway - the way the inspiration in Interview with the Vampire by Anne Rice is more than obvious to me ... uncompromising, is a good fun action movie, but a poor movie overall in other aspects. Another advise: if you will watch it in normal LED / LCD / Plasmas Television the image is very good, but you see int he scenes that it was made to watch in 3D televisions. Rating: 6.5 / 10.0."
    }
  ]
}