{"id": 2752, "title": "Ace Ventura: When Nature Calls", "starring": ["Jim Carrey", "Ian McNeice"], "runtime": 90, "genre": ["Crime", "Comedy", "Adventure"], "description": "Summoned from an ashram in Tibet, Ace finds himself on a perilous journey into the jungles of Africa to find Shikaka, the missing sacred animal of the friendly Wachati tribe. He must accomplish this before the wedding of the Wachati's Princess to the prince of the warrior Wachootoos. If Ace fails, the result will be a vicious tribal war.", "releaseYear": "1995", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/wcinCf1ov2D6M3P7BBZkzQFOiIb.jpg", "categories": {"plot": 7.5, "acting": 7.666666666666667, "ending": 5.0, "soundtrack": 10.0, "cinematography": 10.0, "familyFriendly": 6.0, "funny": 8.3125, "action": 5.0}, "reviews": [{"rating": "7", "text": "I think what's so great about When Nature Calls is that there are so many memorable and quote-able scenes. First saw it in the early 2000s and have seen it about half a dozen times since and I can still recall every scene of the film from start to finish. Stupid? Yes but it's still hilarious to watch."}, {"rating": "10", "text": "My favorite comedy of all time. If you do not die laughing as Ventura struggles gamely to extricate himself from the fake rhino, then you are not alive.\r\"What is it the Wachachis possess that is desired by all men.., except for the princess with the amazing rack?!\""}, {"rating": "10", "text": "Some great parts in this movie, like the monopoly guy scene, The slinkee scene, Rhino giving birth, and parking like a glove. If you like dumb and dumber, in living color and a lot of Carrey's comedy movies (not serious roles)  you will love this."}, {"rating": "8", "text": "Man these critics are STUPID. Do they even know what comedy means? Have they ever laughed in there life? How old are these idiotic critics....how can they rate this movie that low...man you guys are horrible critics...how do you have a f'n job? YIKES!"}, {"rating": "10", "text": "gran pelicula realmente desde el punto de vista humoristico pero desde lo argumental no tanto y Jim jaja es genial!!!!!!! no puedo dejar de verla y reirme"}, {"rating": "3", "text": "Even though Ace Ventura; When Nature Calls excedes it's predecessor, it's hard to get over how annoying Jim Carrey's character is."}, {"rating": "2", "text": "I first saw this movie when i was 7 or 8. Back then i thought this was hilarious. Having seen it recently i cant believe how lame this is. Not funny to me at all,its too ridiculous."}, {"rating": "5", "text": "Very hit and miss, with more misses than hits. The very animated Jim Carrey can be very funny but too often his humor is just stupid. The good budget is a plus."}, {"rating": "10", "text": "The sequel surpassed the original movie. It is full of humor in Jim Carrey style and you see how much fun he had. The humor ranges from parody, jabs at other movies, being respectless, silly (the good kind) up to some things that can be used in cartoons. Like with all of Jim Carrey movies the enjoyment depends on how much you like or enjoy his style. It is the kind that can be a masterpiece for some or awful garbage for others at the same time and I will not disagree with either opinion as I can clearly see why people come to both conclusions. For me this is pure fun entertainment and a movie that takes itself not that serious if it can increase the fun (Picking the “right” car scene would be my best example). After the starting scenes Ace Ventura is in a Tibetan monastery in China. There he is visited by Fullton Greenwall who works in the African country of Nibia (fictional by the way or lets say near Wakanda ;-). He wants to recruit him to find a missing holy animal of the Wachati tribe which is even more important then it seems. Here I stop to avoid spoilers. The story is engaging and a good vehicle to carry the humor through the movie. It plays with tropes and stereotypes in enjoyable ways. In is deeper than it needed to be for a comedy. The main appeal is however the humor. Jim Carrey optimized his style and the humor works so perfect that I did not remember a misstep even after rewatching the movie several times. There are so many good laughs and nothing is sacred even Ace Ventura himself. While for me all jokes work I must repeat that Jim Carrey’s style of humor is not for everyone. Be warned with this. For the cast: Jim Carrey mastered his style and his performance carries the movie. You see the fun he had and recently I discovered that some of the scenes were improvised on the spot by him and so good that these were not cut. Ian McNeice as Fulton Greenwall is the polar opposite. He plays a no nonsense character with the calm and emotionless British mannerism of high society. Maynard Eziashi as Prince Ouda is Ace guide and sidekick in some scenes. An excellent performance and has often side blows to stereotypes. I praise Simon Callow playing Vincent Cadby as he is a such an enjoyable parody and representation of tropes and stereotypes too. Remarkable but with smaller roles are Tommy Davidson and Danny D. Daniels which I wont spoil but also never forget. The whole cast deliver a great comedy performance. I praise writer and director Steve Oeddekerk for the ideas, playing with tropes / stereotypes and for the humor. Visually the movie feels and sounds like you expect from an Ace Ventura movie in Africa. They use the viewers expectations and play with tropes here too. The soundtrack has a lot of familiar names and delivers (Not the top of the top but still some well recognized artists). Overall this movie was a hilarious attack on our risible muscles. It is pure fun if you like this kind of humor and one of my favorite Jim Carry performances. Rewatched it quite some times and still enjoy it."}, {"rating": "8", "text": "I liked this movie very much! Given enough laughs watching. I remember more of that film, overall, than the first. Jim Carrey myth! I'm your fan, Jim. hahahaha"}, {"rating": "6", "text": "N    o    t    W    r    t    i    n    g    A   b   o   u    t    T    h    i    s    !    !    !    !    !    !    !    !    !    !    !"}, {"rating": "7", "text": "Seriously this movie was great.  So many great scenes that you can think back on and just laugh."}, {"rating": "7", "text": "Jim Carrey steps up to do comedy much more polished than the first Pet Detective movie. Less offensive, more funny."}, {"rating": "10", "text": "Even funnier than the 1st. Not for ppl who can't loosen their underwear once in awhile. More of a fun outgoing saturday night movie with friends (not your cats) thing. Funny movie. A classic!"}, {"rating": "10", "text": "Jim Carrey is hilarious and even though the storyline is immensly stupid it still does not fail at entertaining! There is only one thing I think about when I hear this film's name being said: \"Like a Glove!\""}, {"rating": "10", "text": "Amazing film if people do t luagh at this they have a problem."}, {"rating": "9", "text": "This movie is laugh out loud funny! It may not be Carrey's best, but it is by far not his worst, I am completely annoyed by the criticism this movie got, and it didn't even get much so you can tell I like this."}, {"rating": "9", "text": "A cult classic comedy that is hilariously funny from start to finish. The acting was good and it was a lot better then the previous film. Jim Carrey was priceless in this film."}, {"rating": "8", "text": "Funny and ugly. Ace Ventura played by none other than Jim Carrey is well written and is really, really ridiculous. The film will provide laughter and fun moments!"}, {"rating": "6", "text": "Not as good as original but still pretty funny and Carrey has some brilliant moments."}, {"rating": "6", "text": "This one definitely has its laughs but all around not as good as the first. The story in the first just makes for a better movie. \"And you must be the monopoly guy!\" Love it."}, {"rating": "6", "text": "This is by far one of the dumbest movies I've ever seen. In fact, It might crack the top 20 in that regard. From every plot point, to every joke, to every dopey, hammy, and overcooked expression that wisps across Jim Carrey's face; it's just all dumb. But, I just so happen to have grown up during the generation when this kind of stuff was cool, so I found it quite endearing. What else can I say? There's no doubting the utter adherence to a third grader's style of humor, or the poorly thrown together narrative, or the cheap effects and props. But, again -- I simply appreciate it for the time capsule of comedy that it represents. I won't go so far to say that it's good, or even equivalent to its predecessor in quality. But I did enjoy it."}, {"rating": "9", "text": "This is the best movie I've seen yet! In my opinion, it's a lot better than the first, which was also very good. It's very hilarious and it focused a little more on the animals than the first. There's not really much to hate about it, other than just jokes that aren't as funny as other jokes. Again, best movie I've seen so far, and I've seen a lot."}, {"rating": "10", "text": "Funniest movie ever! Few people realize this is a remake of \"Call Me Bwana\", an old Bob Hope movie. Check it out."}, {"rating": "5", "text": "no sign..Ace Ventura: When Nature CallsThis is a Jim Carrey Show and it was almost as if even the writers knew that it would work and it does for the most of the time but besides Jim, it barely has a script of an episode."}, {"rating": "4", "text": "Another chance for Jim Carrey to coast throughout the film. From his work emerge some emblematic moments, and unfortunately many others disappointing. He didn't neglect any gag on here. He clearly gives all he can on every single scene.Carrey's performance still remains the one and only rollercoaster of the movie: when he is out of the screen you will fall asleep faster than ever. When he appears you know he won't leave you indifferent. For the best and the worse. He manages to prove he is always able to dig deeper and deeper into vulgarity, childish humour (can't even say we can call this humour) and autistic facial expressions.His talent isn't able to erase the emptiness of the scenario, the ridiculousness of the other protagonists and the worse than bad pace of the feature. Stunts are quite impressive though. Thank you very much Steve Oedekerk to only showcase black people as rudimentary savages and white men as noble ones. And don't forget that asian men remain in their temple on top of the mountain. This fact precipitates my conclusion that this movie benefits from almost no reflection in its genesis and production."}, {"rating": "9", "text": "It's Jim Carrey, what else do I need to say? It's hilarious, though there are a few cringe parts."}], "recommendations": ["ace_ventura_pet_detective", "johnny_english", "dumb_and_dumber", "get_smart", "the_pink_panther", "bean", "dodgeball_a_true_underdog_story", "scary_movie_3", "the_wedding_ringer", "the_dictator", "the_three_stooges", "step_brothers", "the_longest_yard", "austin_powers_international_man_of_mystery", "johnny_english_reborn", "tropic_thunder", "yes_man", "masterminds", "zack_and_miri_make_a_porno", "hot_fuzz", "superhero_movie", "forgetting_sarah_marshall", "dumb_and_dumber_to", "ted", "nacho_libre"]}