{
  "id": 3031,
  "title": "Acts of Vengeance",
  "starring": [
    "Antonio Banderas",
    "Karl Urban"
  ],
  "runtime": 87,
  "genre": [
    "Thriller",
    "Action",
    "Drama"
  ],
  "description": "A fast-talking lawyer transforms his body and takes a vow of silence, not to be broken until he finds out who killed his wife and daughter and has his revenge.",
  "releaseYear": "2017",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/r5o6vWPYOQs6bv91gQ8kQs2zQYl.jpg",
  "categories": {
    "plot": 7.0,
    "acting": 7.0,
    "ending": 5.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 5.0,
    "action": 7.0
  },
  "reviews": [
    {
      "rating": "3",
      "text": "Encore une histoire de \"justicier dans la ville\", en l'occurrence un ténor du barreau improvisé tout-à-coup vengeur obstiné et volontaire qui a pour philosophie le stoïcisme...! voilà qui n'est pas courant en terme de \"justice sauvage\" mais Seagal est à la retraite, alors c'est (bientôt) le pré-retraité Banderas qui s'y colle.En vérité, il y a là quelques originalités mais aussi nombre de clichés pas mal usés dans ce scénario qui aurait mérité plus d'attention pour se sortir du lot, le lot très commun des films de vengeance bien ringards et téléphonés...En définitive, on finit donc assez déçu par la tournure des évènements de ce petit film qui ressemble ici et là à un téléfilm mais dont la réalisation est suffisamment soignée pour ne pas sombrer dans le navet total... à notre grand étonnement d'ailleurs !Hélas, encore un peu trop mollasson malgré sa durée très standard, ce polar revanchard reste décidément fort médiocre dans l'ensemble."
    },
    {
      "rating": "7",
      "text": "The acting is descent, action scenes are awesome, it's a tipical revenge storyline but i think it works well on this film. This has to be one of Isaac Florentines best films in my opinion."
    }
  ]
}