{
  "id": 4252,
  "title": "Acts of Violence",
  "starring": [
    "Bruce Willis",
    "Cole Hauser"
  ],
  "runtime": 86,
  "genre": [
    "Action",
    "Crime",
    "Thriller"
  ],
  "description": "When his fiancee is kidnapped by human traffickers, Roman and his ex-military brothers set out to track her down and save her before it is too late. Along the way, Roman teams up with Avery, a cop investigating human trafficking and fighting the corrupt bureaucracy that has harmful intentions.",
  "releaseYear": "2018",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/pK9CugRd3DIP0THBH8WlGrvk5vy.jpg",
  "categories": {
    "plot": 4.5,
    "acting": 5.333333333333333,
    "ending": 5.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 5.0,
    "action": 2.0
  },
  "reviews": [
    {
      "rating": "7",
      "text": "I loved the movie. The story was very interesting and I am a big fan of Bruce Willis and Cole Hauser. It does a good job of shining some light on one of humanity's darkest areas. The acting was good and overall a very enjoyable experience. We could've done without the strip club scene but thats what a fast forward button is for."
    },
    {
      "rating": "7",
      "text": "Not a solid Action Thriller but entertaining enough. Hauser performs well, in other movies he did not convince me that much, Ashmore beyond handsomeness and very emotive sequences. 6'5/10"
    },
    {
      "rating": "8",
      "text": "With a polished production quaity, I’m not sure the message would have been as good.The messsge was very strong, and this movie is about regular folks.  I wish most of us, in America would stand up to what is wrong, in several ways.This movie is a odern version of “Saving Private Ryan.”It reminds me of the best Christian film."
    },
    {
      "rating": "2",
      "text": "Another **** action film starring Bruce Willis. It’s getting hard to differentiate them."
    },
    {
      "rating": "2",
      "text": "If you're in the mood for a good laugh, give this slopfest a try. My favorite character is Max...see if you agree."
    }
  ]
}