{
  "id": 865,
  "title": "Addams Family Values",
  "starring": [
    "Anjelica Huston",
    "Raúl Juliá"
  ],
  "runtime": 94,
  "genre": [
    "Comedy",
    "Family",
    "Fantasy"
  ],
  "description": "Siblings Wednesday and Pugsley Addams will stop at nothing to get rid of Pubert, the new baby boy adored by parents Gomez and Morticia. Things go from bad to worse when the new \"black widow\" nanny, Debbie Jellinsky, launches her plan to add Fester to her collection of dead husbands.",
  "releaseYear": "1993",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/8znyj20O3EYLD2EzWnZQMnkE4zH.jpg",
  "categories": {
    "plot": 7.5,
    "acting": 9.666666666666666,
    "ending": 5.0,
    "soundtrack": 10.0,
    "cinematography": 5.0,
    "familyFriendly": 6.0,
    "funny": 9.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "5",
      "text": "I liked this film more than the original but only slightly.  The plot was a little more interesting that the original."
    },
    {
      "rating": "7",
      "text": "While not as great as the original, Addams Family Values has iconic moments and a fun plot to keep others to enjoy the ride."
    },
    {
      "rating": "9",
      "text": "I absolutely loved the first movie. I bought this two days ago, and I was really impressed, because this is a really funny movie. it is possibly better than the first but only just. If there are any flaws, they are minor, but why is the rating for this movie so low? 6.2? It is much better than that! I can name other great movies that have fallen victim to low ratings. The humour was wonderful. Black humour suits the Addams Family perfectly. As for the acting, it was superb. Christina Ricci tops them all as Wednesday, but that doesn't mean that the others weren't good either. Raul Julia and Angelica Huston are note perfect as Gomez and Morticia. To be honest, I think that Gomez is Julia's best role. Christopher Lloyd was born to play Fester, just as entertaining as he was in Back To The Future and Who Framed Roger Rabbit? Jimmy Workman was also really good, and the underrated actress Joan Cusack took me completely by surprise as Debbie. That baby was cute too. If there was one minor flaw, it would be that you don't see much of Cousin It and Margaret. As I'm probably not able to write a review for the first film, what I've said for this film, applies pretty much also for that too. I give this a 9/10, same with the first, but avoid the New Addams Family and unless you're a Tim Curry fan, avoid Addams Family Reunion also. 9/10. Bethany Cox"
    },
    {
      "rating": "10",
      "text": "After the success that was the first film, a sequel was expected, and it actually appeared two years later. \"Addams Family Values\", moreover, kept the cast and crew of the first film and manages to match perfectly with its predecessor, proving my theory that the sequels are generally good if they keep the cast, the director and the screenwriter of the initial film .The central core of the cast is the same as the first film and manages to keep up with expectations. Raul Julia and Angelica Huston maintained the roles of Gomez and Mortícia Addams, and I think that with these two films, the two actors reach the top of their artistic career and their notoriety. Christina Ricci also maintained the role of Wednesday and, as expected, saw the relevance of her character increased in this film, corresponding with a brilliant performance. Christopher Lloyd is also in great shape here, and plays brilliantly with the villain, Joan Cusack, in one of the most remarkable works of her career.Good production values also deserve a brief comment. The Addams' house is wonderful in its unique way, the sets and costumes are excellent and totally go against what we could expect and the soundtrack is effective and competent."
    },
    {
      "rating": "5",
      "text": "A very weak film, with a lot of editing cuts, which gives the impression that you are watching a TV series"
    },
    {
      "rating": "7",
      "text": "A good sequel. I highly recommend if you enjoyed the original film.    ."
    },
    {
      "rating": "8",
      "text": "Almost just as good as the original. I love the storyline of Wednesday and Pugsley at a summer camp, and even though I'm not the biggest Joan Cusack fan, she was great in this."
    },
    {
      "rating": "8",
      "text": "Wednesday enjoys torture, murder, and all things pain, but draws the line at racism, I love it.I like how these movies make it clear that for the Addams family, it's a hobby and their version of fun and it's not a matter of being deranged or hating people or something, it's just like any other interest. They are good people with good hearts who enjoy horrible things for wholesome reasons.A lot less predictable than the first which was good, and it was a lot funnier. Love when a sequel tops the original."
    }
  ]
}