{
  "id": 4876,
  "title": "Adore",
  "starring": [
    "Naomi Watts",
    "Robin Wright"
  ],
  "runtime": 100,
  "genre": [
    "Drama"
  ],
  "description": "Lil and Roz are two lifelong friends, having grown up together as neighbors in an idyllic beach town. As adults, their sons have developed a friendship as strong as that which binds their mothers. One summer, all four are confronted by simmering emotions that have been mounting between them, and each find unexpected happiness in relationships that cross the bounds of convention.",
  "releaseYear": "2013",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/hIQqIeG7Ude0QRUFntdLtsAUEBB.jpg",
  "categories": {
    "plot": 3.857142857142857,
    "acting": 5.6,
    "ending": 1.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 9.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "9",
      "text": "hot, hot, hot. Beautiful place, beautiful people. It was a sit back, relax and enjoy kind of movie. No violence. Sure it's a fantasy, but Isn't it a fantasy we are looking for movies?"
    },
    {
      "rating": "2",
      "text": "Some years back Michael Caine and Joseph Bologna got together with their teenage daughters on the beaches of Rio and threw their ambitions to the wind.  Nothing much to remember from Blame it on Rio other than it was Demi Moore's first major role.  It seems even Demi has enough sense now to shy away from a script like this, but not Robin Wright and Naomi Watts who make one for the moms, lusting over each other's hunky sons, and ultimately finding themselves in the same predicament as Michael and Joseph 30 years before.\r Unlike its predecessor, the creators of Adore chose to take their subject seriously, kind of like another ill-fated Demi Moore movie, Indecent Proposal.  What might have been campy fun turns into painful drama as the two mothers simply can't let go of each other's sons even when they become grandmothers, which was apparently the original idea of this story by Doris Lessing.  However, Robin and Naomi just come across as GMILFs.\r I wouldn't have even bothered with this movie had it not turned up on late night television.  What is worrisome is that these are two actresses at the peak of their careers.  Wright had just started House of Cards and Watts has the luxury to throw away roles given her copious filmography.  There isn't much you can draw out of roles like these, at least from a dramatic point of view, but they struggled valiantly to do so. Fortunately, they both moved on quickly, putting this nonsense behind them."
    },
    {
      "rating": "0",
      "text": "Esse é, possivelmente, o maior fracasso dramático que assisti.Antes de tudo, o filme não é apenas pontos negativos. A produção, de forma geral, é boa. A fotografia é bem feita e as cores, principalmente nos momentos onde a praia é o centro das atenções, é inteiramente agradável. Porém, acredito que os elogios parem por aqui. na verdade, o roteiro/trama é tão mal feita que eu fiquei com raiva.Primeiro: o desenvolvimento dos personagens é NULO. Não sabemos quase nada sobre eles e o romance entre o \"primeiro casal\" é tão superficial que isso é chega a ser um desrespeito a inteligencia do público. Sabemos que eles se conhecem desde sempre - afinal, ela é a melhor amiga da mãe desde criança -, e o único esforço que o filme faz pra desenvolver algo entre eles é mostrar uma cena dos mesmos no mar, onde tudo que o personagem do Xavier Samuel sabe fazer é cara de flerte. A progressão tá longe de ser orgânica e tudo piora depois dali.Depois da ideia mais criativa dos roteiristas serem a vingança nível quinta serie [Tu \"comeu\" minha mãe, agora vou \"comer\" a sua também hur dur], temos a conversa entre as duas amigas, na qual se resume a \"cruzamos a linha\". Logo depois, o moleque demonstra nunca ter feito sexo na vida ao dizer a tia que a ama - meu deus, parece fanfic. A surpresa dela ao saber que o muleque que tinha ficado com ela por vingança tinha a traído, a mesma dizendo que nunca foi tão feliz - a veia só transou -, o pai adivinhando que o filho tava \"namorando\" só de olhar pra ele. Sem contar no show de interpretações péssimas no ato final. Velho, é tanta cisa pra falar que posso ficar escrevendo aqui a noite toda.Por fim, fica muito claro que o filme não tem NADA A DIZER, e a \"obra\" faz questão de jogar isso na nossa cara após um final ilógico, incongruente e forçado. O filme tem o objetivo de agradar um publico algo, e visto a bilheteria, talvez tenha conseguido, mas nada oclui o fato de ser o fracasso que foi."
    },
    {
      "rating": "4",
      "text": "Adore manages to be many things like creepy, ludicrous, swallow but nothing can describe it better as a humorless boring melodrama in an isolated setting with nothing that inspires or intrigues. Nothing to see here besides the beautiful scenery."
    },
    {
      "rating": "6",
      "text": "A movie about terrible narcissistic people living in a fantasy world of privileged isolation is actually not all that scandalous. The acting by the leading ladies is good and the photography and score are impressive. It is intriguing, but at the same time quite frivolous."
    },
    {
      "rating": "2",
      "text": "The first thing the movie “Adore” makes you want to do is book a flight to Seals Rock, New South Wales, Australia, to see the blue drenched waters, green mountains and hills, sun baked beaches and homes to die for, a Paradise on earth and the film does a good job of advertising the place and the surroundings.\r Lil (Naomi Watts) and Roz (Robin Wright) have been best friends from childhood and still are after each has been married, with Lil now a  widow and Roz’s husband, Harold (Ben Mendelsohn) taking a job in Sidney expecting the family to join him. Lil has a son Ian (Xavier Samuel) and Roz a son, Tom (James Frecheville) both at the end of their teens ready to take their place in the world. In the sensual surroundings they live in, it is not long before each mother is having an affair with the other’s son.\r Based on a short story by Doris Lessing, and a screenplay written by Christopher Hampton, the latter doesn’t know quite how to get into the story and the director, Anne Fontaine, seems afraid to tell a 2013 story, instead making it a film that Todd Haynes would have told in the 1990s or Douglas Sirk in the 1950s, both who would have gone deeper into the ramifications. While there is no darkness in the film neither is there a light touch that could have made it more meaningful. We have come a long way from “The Graduate” and Mrs. Robinson but “Adore” is stuck in that era.\r The supporting players, such as Mendelson, a potential suitor her own age for Lil, Gary Sweet, and girlfriends for both boys played by Jessica Tovey, and Sophie Lowe, work hard but the writer and director don’t seem to take the circumstances seriously and the shock value is almost nil. It is stuck between the possibility of farce and how lives would be affected by the adults decisions.\r Watts, Wright, Samuel and Frecheville offer a lot of eye candy for both sexes and do the best they can with the material they are given.\r The film moves too slowly at points and should have been cut by 10-15 minutes but the work of the cinematographer Christophe Beaucarne is worth the price of admission. The city of Seal Rocks should give him surfing rights for his lifetime."
    },
    {
      "rating": "8",
      "text": "I never thought I would like this movie but I  was wrong. The story is not as strange as one would think once you see the relationship of the mothers. The movie was sexy and the location gorgeous. Loved watching Naomi Watts and Robin Wright."
    },
    {
      "rating": "9",
      "text": "I have to say that I adored adore. It is a guilty pleasure that I'm sure would have made a good tv mini-series as it doesn't exhaust its own possibilities within the movie. Based on a short story by writer Doris Lessing it is easy to see why cynical highbrow critics would dismiss it as soap, and indeed many have panned it. I am at a loss to know why as it is intelligently adapted and written by Christopher Hampton and Anne Fontaine, who is also the film's director. In fact the writing is generally superb presenting some improbable situations in a natural and believable fashion. Some unintentional humour does creep in from time to time, but overall I was compelled to follow the story's arc. The performances are superb with Robin Wright the standout. Looking more and more like Jessica Lange, she is particularly moving. In scene after scene, many of which are filmed in extreme close up, every nuance of emotion is there to behold on her face. She is stunning here and I am tempted to say that it is the best I have ever seen this under rated actress. With its attractive cast and beautiful locations the film also looks great."
    },
    {
      "rating": "10",
      "text": "What woman , who is honest, would not want to be in this situation?? Sexy, passionate and intense. It makes you think about the different personalities of people Of how some are so much more emotionally involved and others are in much more control. The purpose of life is to love and be loved.   This movie is indeed a guilty pleasure in more ways than one."
    },
    {
      "rating": "9",
      "text": "An excellent movie.  It's full of temptation, passion, guilt, innocence, confusion and love.  I don't know what the big fuss is about age differences.  Everyone in it was of legal age.  I adored this movie."
    },
    {
      "rating": "0",
      "text": "Voici deux milfs qui ont perdu leur mari en même temps semble-t-il... et qui ont chacune un fils. Elle sont amies depuis longtemps et décident de... non, elles ne se mettent pas à tondre la pelouse soudainement ! non, elles se tapent juste le fiston de la copine et réciproquement ! parce que nos milfs, elles aiment la chair fraîche ! Remarquez, non que je sois contre, même si ça sent l'inceste par procuration... Parce qu'après tout nos milfs ont encore des besoins mais faudrait tout de même pas nous prendre pour des cons non plus...  parce qu'à ce tarif-là, la marmotte, elle emballe vraiment le chocolat dans le papier alu et elle le livre chez toi ! en personne. Je précise au cas où que milf est un acronyme qui signifie \"mother I'd like to **** et qu'il est particulièrement de circonstance ici.Nos deux vieilles sont en effet tout-à-fait \"****ables\" et par ailleurs deux actrices très estimables... lorsqu'elles ne tournent pas dans cette espèce de co-production australo-française mise en scène par Anne Fontaine, l'endormie qui brasse du vide et surtout de la merde psycho-intello à deuyx balles (et encore).Car cette connerie en plus d'être mal jouée, mal dirigée et mal foutue se révèle d'un ennui abyssal. Perfect daube !"
    },
    {
      "rating": "10",
      "text": "I enjoyed this move. However, Roz's son Tom was a blank canvas. Which made it hard to believe the relationship with Lil would last for years. Robin Wright and Xavier Samuel characters- very sexy and passionate. Xavier Samuel is beautiful!"
    },
    {
      "rating": "5",
      "text": "Sort of anti-climatic. Of all the movies there are made...I feel it's easy to pick this one out as a waste and rather could have stayed a book, but it is unique at least. The subject matter was handled in a way that expanded past the major issue and explored a \"what if?\" situation in a hopeful light about lasting friendship, though strange."
    }
  ],
  "recommendations": [
    "the_bridges_of_madison_county",
    "the_glass_castle",
    "joy",
    "gifted",
    "a_beautiful_day_in_the_neighborhood",
    "blue_jasmine",
    "carol",
    "pretty_woman",
    "spencer",
    "the_longest_ride",
    "the_princess_diaries",
    "sleepless_in_seattle",
    "endless_love",
    "the_devil_wears_prada",
    "eat_pray_love",
    "still_alice",
    "don_jon",
    "my_cousin_rachel",
    "love_actually",
    "sabrina",
    "blue_valentine",
    "the_intern",
    "american_beauty",
    "young_adult",
    "the_age_of_adaline"
  ]
}