{
  "id": 4029,
  "title": "Adventures in Babysitting",
  "starring": [
    "Elisabeth Shue",
    "Maia Brewton"
  ],
  "runtime": 102,
  "genre": [
    "Comedy"
  ],
  "description": "When plans with her boyfriend fall through, high school senior Chris Parker ends up babysitting the Anderson kids, Brad and Sara. What should be a quiet night in, however, turns into a series of ridiculous exploits, starting when they leave the house to pick up Chris' friend Brenda. Soon, Brad's buddy Daryl is involved, and the group must contend with car thieves, blues musicians and much more.",
  "releaseYear": "1987",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/8QiAj0Xw2UMeZMIIfZKeNoIsszs.jpg",
  "categories": {
    "plot": 5.0,
    "acting": 5.0,
    "ending": 5.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 6.0,
    "funny": 6.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "8",
      "text": "Is it just me or were comedies funnier in the 80s? Adventures In Babysitting was by no means raunchy, it doesn't even compare to the films of today in that respect, but in someways there just seem to be a lot more laughs in these classic 80s comedies. For those who don't know the story, Chris (Elizabeth Shue) passes up a night with her boyfriend to babysit for two kids. It was the right choice, but when her best friend is left stranded and in trouble, Chris is forced to take the kids into Chicago to go and rescue her. What awaits her there is an adventure she never saw coming, with everything from gangsters to car trouble and perhaps even a new romantic interest? This film was supposed to be the one that made Karate Kid alum, Elizabeth Shue, a big star, but despite the films success and eventual cult status, it never happened. It's hard to understand why that is. I think it has a lot to do with her virtually disappearing for three years after this film, only to re-appear for a bit part in Back To The Future. Had she ridden the wave of success from this performance, she would have been one of the late 80s biggest names. Shue was fantastic, tough when she needed to be, caring when she wanted to be, and of course she always had the right line on the tip of her tongue. Add to the mix two obnoxious young teens and a tough as nails young tomboy and you have a mixture for success. Lest we forget this was a Christopher Columbus film, so we also have all those oddballs and crazy dumb criminals we know and love thrown in there too. Adventures In Babysitting was almost like a trial run for Home Alone, three years later. While the film certainly had it's share of flaws, and would not be rated PG-13 by today's standards, it was a largely enjoyable family film and in many ways a distant cousin to Home Alone. I loved this film when I was a kid and I appreciate it even more now, Adventures In Babysitting is highly recommended fun for the whole family!"
    },
    {
      "rating": "8",
      "text": "What a good film. It has a loot full of funny scenes and I heard that RyanGoodwin TheMovieEntertainment has the 1988/1997 VHS of this. So yeah I must agree with him."
    },
    {
      "rating": "4",
      "text": "Not nearly as funny/clever as I hoped it would be, but Elizabeth Shue is still eminently watchable. It's one of those flicks that you watch on TBS on a Saturday afternoon when there's nothing else going on - and you don't regret it."
    },
    {
      "rating": "6",
      "text": "Adventures in Babysitting seemed littered with unrealized possibilities. The movie has good raw material, but it never really was pulled together into something I could care about much."
    },
    {
      "rating": "6",
      "text": "Adventures in Babysitting seemed littered with unrealized possibilities. The movie has good raw material, but it never really was pulled together into something I could care about much."
    },
    {
      "rating": "4",
      "text": "Not nearly as funny or clever as PAMA hoped it would be, but Elizabeth Shue is still eminently watchable. It's one of those flicks that you watch on TBS on a Saturday afternoon when there's nothing else going on - and my townspeople do not regret it."
    },
    {
      "rating": "4",
      "text": "Not nearly as funny or clever as PAMA hoped it would be, but Elizabeth Shue is still eminently watchable. It's one of those flicks that you watch on TBS on a Saturday afternoon when there's nothing else going on - and my townspeople do not regret it."
    },
    {
      "rating": "6",
      "text": "Adventures in Babysitting seemed littered with unrealized possibilities. The movie has good raw material, but it never really was pulled together into something I could care about much."
    },
    {
      "rating": "6",
      "text": "Adventures in Babysitting seemed littered with unrealized possibilities. The movie has good raw material, but it never really was pulled together into something I could care about much."
    },
    {
      "rating": "6",
      "text": "Adventures in Babysitting seemed littered with unrealized possibilities. The movie has good raw material, but it never really was pulled together into something I could care about much."
    },
    {
      "rating": "5",
      "text": "Okay film.  Nothing special.  Definalty wouldn't want her babysitting any child."
    }
  ],
  "recommendations": [
    "the_night_before",
    "night_at_the_museum",
    "elf",
    "friday",
    "american_pie_2",
    "blended",
    "my_spy",
    "night_at_the_museum_secret_of_the_tomb",
    "the_game_plan",
    "17_again",
    "meet_the_fockers",
    "21_jump_street",
    "neighbors",
    "alvin_and_the_chipmunks_the_road_chip",
    "sisters",
    "herbie_fully_loaded",
    "yes_man",
    "bad_santa",
    "ice_age_dawn_of_the_dinosaurs",
    "night_at_the_museum_battle_of_the_smithsonian",
    "bedtime_stories",
    "christmas_with_the_kranks",
    "just_go_with_it",
    "neighbors_2_sorority_rising",
    "a_million_ways_to_die_in_the_west"
  ]
}