{
  "id": 1051,
  "title": "After Earth",
  "starring": [
    "Jaden Smith",
    "Will Smith"
  ],
  "runtime": 100,
  "genre": [
    "Science Fiction",
    "Action",
    "Adventure"
  ],
  "description": "One thousand years after cataclysmic events forced humanity's escape from Earth, Nova Prime has become mankind's new home. Legendary General Cypher Raige returns from an extended tour of duty to his estranged family, ready to be a father to his 13-year-old son, Kitai. When an asteroid storm damages Cypher and Kitai's craft, they crash-land on a now unfamiliar and dangerous Earth. As his father lies dying in the cockpit, Kitai must trek across the hostile terrain to recover their rescue beacon. His whole life, Kitai has wanted nothing more than to be a soldier like his father. Today, he gets his chance.",
  "releaseYear": "2013",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/iXMvYIlzzJBs352CfeiQcBvovZt.jpg",
  "categories": {
    "plot": 3.5277777777777777,
    "acting": 3.1136363636363638,
    "ending": 4.5,
    "soundtrack": 5.0,
    "cinematography": 4.0,
    "familyFriendly": 4.0,
    "funny": 0.5,
    "action": 3.142857142857143
  },
  "reviews": [
    {
      "rating": "1",
      "text": "more and more it seems as if sixth sense was an anomaly\rand jaden smith couldn't act his way out of a paper bag\rthis was disappointing but not unexpected"
    },
    {
      "rating": "0",
      "text": "M Night is a very ambitious director, he only had one ambition, that is to become the worst director of all time. So he started from top to bottom, From Sixth sense to Last airbender, From good to worst. He has improved a lot for the past 10 years, he has mastered how to make a worse movie! So this is another  which emphasizes that  he is the worst director of 21st century!"
    },
    {
      "rating": "0",
      "text": "Cannot believe I was sincerely looking forward to seeing this movie. I have never written nor read a review on a movie so I guess I am losing my review virginity. And without sounding cringe worthy it feels so right. As this movie has compelled me to, which is clearly saying it all now.\rAfter Earth was a waste of money, time and effort, and I love Will Smith so a waste of his raw talent! I felt as though they lost the plot of the movie completely and the wasn't any genuine emotion in it. Poor acting, poor directing, and poor story line. It made me jump in some scenes but jumping isn't quite enough to say WOW I want to see that again or what good quality material for peanuts. More like what a waste of money and time!\rI shall not slate Will or Jaden as I do think they are good entertainers more so Will as Jaden is only young. But this movie really has not served them any justice.\rAnd due to this rubbish film I am no longer allowed to chose movies.  sad times indeed.\r So end conclusion do not watch it as if you are a fan like me of Big Willy he shall most definitely disappoint. No pleasure with this Sci fi."
    },
    {
      "rating": "2",
      "text": "M. Night Shyamalan left his brain back at the film Signs. After Earth is an unpleasant movie with poor writing and acting, stuff that will make your eyes roll. Will Smith's character isn't inspirational, like he tries to be, and he comes off as monotone and mean. It's basically a failed motivational seminar.\r F"
    },
    {
      "rating": "0",
      "text": "Just started watching this film and what's going on with the narrator? It sounds like an English guy doing an incredibly bad American accent, which wouldn't be quite as bad if his acting wasn't so terrible. Reminds me of the dumb kid who gets forced to read out to the class. Given up already."
    },
    {
      "rating": "1",
      "text": "The only thing raising this turkey above zero is the fact that, as far as I could tell, there weren`t any microphones poking into any shots or any sets collapsing in the background. The movie is so bad I just stopped watching and went to bed about 2/3 of the way in, which is rare.\rI never really liked Smith. He has goofy and some weird tough guy act which makes him look as if he`s being zapped with a cattle prod, and if you don`t like those he`s out. But his son is worse. Ranging between whining about his father and crying to tantrums, his most regular appearance is of a dull boy who has just been shot in the ass with a tranquilizer gun. Fortunately he is so bad that in a lame attempt to hide this fact he doesn`t have any lines in a lot of scenes, but just stands there nodding or repeating the other actor`s lines, like some slow kid who has been brought up in front of the class to be mocked and ridiculed. It would be funny if it wasn`t so unbearably sanctimonious.\rI suppose we could admire Smith JR for trying to lead a movie right in the middle of his awkward phase, sporting his freshly shaved 14 hair mustache look; but personally I`m not sure I`d have hired him to play a cow in a primary school nativity play. He constantly has this weird, annoying grimace on, which I didn`t realize was supposed to convey fear until I read reviews online after suffering through the movie, And this leads us the the \"message\" in this awful turkey, which is that fear is bad and that you can`t kill space bugs when you`re afraid.\rDetailing all the weird plot holes in After Earth is an entire study in itself, and due to my profound lack of interest in the movie I probably missed a few, but here goes anyway: First of all humans in the movie are able to build inter stellar space craft but apparently not guns of any kind, which is presumably why they are being hunted by blind bugs. In the movie`s only promising moment Will Smith gets sucked out of a crashing space ship far above the canopy of the forest, and for a second you are tricked into believing that the director has just killed off his overpaid, overrated Hollywood degenerate 15 minutes into the movie, leaving his untalented son to lead the movie by himself, as a sort of girlish, black Tom Hanks Castaway in space. But then he miraculously reappears on the ground almost immediately; unconscious and with two broken legs, but exactly as robotic and dull as before. Then the most comical parts of the movie occur when the incapable son is sent to retrieve a transmitter from the tail of the vehicle, which crashed where Will Smith`s corpse should probably have landed. According to the lifeless Will Smith night time brings intense cold which ravages the land so that any humans caught outdoors will instantly freeze to death, even though every single stinking scene in the movie is set in lush forest surroundings. So the question is: if the cold will kill Will`s brain damaged son instantly, how come all the trees still have leaves on and baboons can live there because it`s so nice and warm?\rNever mind this nonsense though because the solution to this weird problem is \"hot zones\" at regular intervals between the ship from which the immobilized Will Smith is directing his comatose progeny and the tail to which said son must travel. As long as he reaches a \"hot zone\" every evening before the harmless cold kills him he`ll be all fine and dandy. How convenient! How a grown man could have written such awful trash is a mystery, as is how he might then have been able to convince another grown man to direct it for him, dragging their names and the names of all associated with them into the mud.\rEvery aspect of this movie, short of some of the special effects and I guess pretty shots of forest (the one not having been killed by the intense cold I mentioned), is absolutely horrible. I would rather download old episodes of Lost in Space from the mid 60s than watch After Earth again, special effects be damned! By far and away the worst movie of 2013 that I`m aware of. And Smith JR should go back to school at once."
    },
    {
      "rating": "4",
      "text": "Based on a weekly turnover, in China it is pretty frustrating to find an ideal film to watch in cinema to meet everyone’s taste, this week, the best offer (for me) is AFTER EARTH, a North American flop stars Smith Family, directed by the ever-downgrading wunderkind Mr. Shyamalan (this time descends to the hack hired by Will Smith personally). With zero expectation, the film is a slim action adventure exploits Will Smith’s star power to bolster his son Jaden Smith, but the paper-thin script and a sub-par visual SFX bewilders its viewers where its reported budget goes ($130,000,000)?, call me a sceptic, is the whole hubbub an internal money-laundry chicanery?\r A pseudo-epic start briefly justifies why mankind abandons the earth, and relocates at a new planet with the new arch enemy, a fear-sensing brute. After a reckless asteroids attack, an aircraft crash-lands on earth and miraculously all the crew are dead except for Jaden and Will, the latter is the commander of the team and is injured and immobilized by broken legs for rest of the film, up till then, the film plunges into a young boy’s journey of seeking courage  by facing a menagerie of mutant wild animals on his quest to track down a beacon apparatus which he could use to call for the rescue team, and now is in the rear part of the craft and lies amid the formidable wilderness, it is also a boy’s rite-of-passage to overcome a past trauma and save himself and his father, who treats him with military disciplines, but a role-model for the whole race because of his “ghosting” skill, which is facilely interpreted as a fearless warrior who is able to be invisible to the brutes, everything is well-foreseen by viewers’s imagination and the film fails to ignite audiences’ passion at all.\r A glum Jaden Smith and ultra-wooden Will Smith can barely hold together the film (one wonders what has happened to the pair in THE PURSUIT OF HAPPYNESS 2006, 7/10), already it is character-scarce, Sophie Okonedo is shamefully underused in the Will Smith’s Wife Club, and a dazzling Zoe Kravitz glints only in flashbacks and illusory parts, then all the CGI creatures take the stage by turns, and the final showdown turns out to be a major letdown, again I am very curious about how they spent the gargantuan budget? It looks too cheap compared with other summer tentpoles.\r It is inevitable a stain in Mr. Smith’s filmography, the mass is repellent and jealous of nepotism especially when he or she is a superstar, the Smith family may be too keen in showcasing their ambition to establish their dynasty in Hollywood showbiz, this setback should alert them, the market is not ready yet for a blatant mega-family contrivance. Anyhow, what’s more disheartening for me is the career orbit of M. Shyamalan, to witness the fall of a young talent is never easy, although we could assume one must reach rock-bottom to bounce back, in that case, I do hope AFTER EARTH is his fortunate nadir."
    },
    {
      "rating": "4",
      "text": "Poorly executed  lack of character, way to short they could have done much better with an extra of 20 minutes   visually good and the Smiths family fit in nicely"
    },
    {
      "rating": "4",
      "text": "This is an okay movie.The father-son duo isn't as good as everyone thought.The world is pretty cool,some of the scenes were random and the end was pretty fast."
    },
    {
      "rating": "0",
      "text": "This is terrible movie making at its finest. Confusing introduction, lack of character development and an incredibly bland storyline. They have the insane technology of colour-changing suits when danger is real around them... you'd think with such advanced technology, they would have at least a GPS system on them rather than having Kitai go on an unnecessary journey through the surprisingly bright wilderness. Just because humans are out of Earth's equation, does not mean animals and plants would just flourish like that  especially since they implied humans literally  up\" the planet. The concept was unique... but like most cases, it was poorly executed."
    },
    {
      "rating": "5",
      "text": "Was expecting this film to be total crap, wasn't half as bad as I expected! Decent storyline etc. but some of the acting seemed pretty bland. Not great but surprisingly entertaining and watchable"
    },
    {
      "rating": "5",
      "text": "I was expecting this to be a complete failure. I didn't go see it at the theater because the previews just did absolutely nothing for me.  Well after watching the movie I have to say I'm actually pleased. I rather enjoyed the movie even if so many of the graphics looked utterly fake."
    },
    {
      "rating": "0",
      "text": "Simply one of the worst movies of all time, After Earth is full of bland, dull, and simply boring acting, even with Will Smith one of the most charismatic actors in Hollywood, who is reduced into a dull, and shallow character, that you don't care about, and his son Jaden Smith, who has no talents at all, and his character is dumb, and annoying, and a lot of plot holes, that makes me lose all faith that M Night Shyamalan, the director behind the Sixth Sense, and Unbreakable will ever find his way once again."
    },
    {
      "rating": "6",
      "text": "It has more flaws (uninteresting characters, slow pacing, small storyline, predictability) than strengths but After Earth is focused on its plot and offers enough visual thrills to qualify as a passable movie."
    },
    {
      "rating": "3",
      "text": "\"After Earth\" 10 Scale Rating: 3.0 (Awful) ...\r The Good: The premise is a good one. This could have been a pretty good film based on the idea.\r The Bad: Not quite as horrible as people claimed, but still pretty damn bad. Super slow and not overly interesting, you find yourself wanting it to hurry up and end. The creatures that populate the film look like cartoons that were rejected from the latest Ice Age film. Worst of all, the acting was horrid, especially Jaden Smith. It is clear to me that the kid simply can't carry a film on his own and lacks his father's charisma and skill."
    },
    {
      "rating": "1",
      "text": "After Earth is directed by M. Night Shyamalan and stars Will Smith and his son, Jaden Smith. This movie is one of the dullest, slowest, boring, mind-numbingly stupid movies I have ever seen in my whole life, and I have seen a lot of crappy movies. The plot involves Kitai Raige (Jaden Smith) and Cypher Raige (Will Smith) who go to the remnants of Earth and are stranded there by their ship crashing, and by some god damn coincidence they are the only people on the ship that survived. Throughout the movie Kitai embarks on a journey through Earth while Cypher watches him, but stays behind due to a leg injury *cheers*. After Earth is one of the worst science-fiction films ever made, period. 1/10"
    },
    {
      "rating": "2",
      "text": "This is a very cheesy movie, I understand that Will was trying to be with his son, but it doesn't mean that he has to make this huge movie, just to be with him."
    },
    {
      "rating": "10",
      "text": "Well after watching the movie I have to say its a really good film. Love this kind of sci-fi."
    },
    {
      "rating": "0",
      "text": "This film was so obvious in its attempt to throw Jaden Smith in our faces that by the time the credits rolled I actually felt bad for Will for having to put up with him.  The acting of this spoiled teen, who has obviously never taken an acting class, will leave you emotionally weary and confused.  Jaden however does not deserve all of the blame for the colossal failure of this film.  A poorly written script, an incredulous story, a plot with so many holes that it's more air than substance, laughable CGI in an era of Avatars and The Lord of the Rings, and directing that was haphazard at best and  wholly unimaginative at worst.  I'm sparing a heated critique of Will's bland acting in this film because he was the one element of it all that was actually mediocre and not horribly unwatchable.\r Probably the most frustrating aspect of this film was its lack of ambition to create something new.  In the hands of a more gifted screenwriter, a more competent director, or starring an actor with any gravitas whatsoever this film may have achieved its potential.\r All of this and Moby \"Dick\" jokes makes After Earth one of the worst films I have ever had the pleasure to hate."
    },
    {
      "rating": "0",
      "text": "This is how you throw 130 million American dollars out of the window. There was no reason Jaden Smith was in this movie, other than his fathers influence. I admit they were good together in Pursuit of happiness, but his son was basically a little kid playing himself back then. Also nature evolved to kill US blah-blah-blah I do not know why M. Night Shyamalan has this fixation (remember The Happening), but it is dump, and killing animals (even CGI) makes me disappointed in humanity. Overall a badly done adventure movie, that is set agains the background of the green screen. This alone (CGI, visuals) never made a movie. In movies like Blade Runner etc...  visuals had significant role, but with a good story, characters, thought provoking concepts. This movie was missing these key elements."
    },
    {
      "rating": "1",
      "text": "After Earth is not only boring and uninteresting even for sci-fi fans. It alsa has a lame story and surprisingly bad acting by 2xSmith. I expect that Harald Zwart got the best out of Jaden in Karate Kid, but Shyamalan has no clue how to instruct this boy into anything other than a spoiled and irritating brat.\rIt's a bad idea, the cgi is bad compared to most other I've seen, and what's worst is that it's impossible to care about the guys in the film."
    },
    {
      "rating": "2",
      "text": "Although this movie is not offensive in any way; it is simply bad.  From the stage decoration to the costumes to the plot and the characters  there's not a lot to recommend it.  I know folks are trying to be gentle on Will Smith and his young son  they seem like nice people.  However, the son was not ready to hold this movie.  He is really pretty terrible in this.  I wish him all the luck in future endeavors.  Do not waste your money or time."
    },
    {
      "rating": "1",
      "text": "Nobody knew he was directing it in the first place, M. Night is back ruining lovable stars making us feel bad that this has to go against Jaden and Will Smith like this. It has \"decent production\" but the terible direction and horrible screenplay make everything just flunk for this film."
    },
    {
      "rating": "1",
      "text": "After Earth was not a wow movie. It was a dull Shyamalan film, although he knows he can do better. Cypher Raige and his son Kitai Raige's  bonding  documentary of fear and danger is a rancid potato. Will smith has totally outdated his limits into making bad films. The bonding between the father and son is rancid. It's cool from the trailer and it looks good but After Earth is a mind boggling bonding sci fi that totally doesn't work. Shyamalan's crafty and carefully shot beautiful camera angles may surprise, but its needed more."
    },
    {
      "rating": "3",
      "text": "The combination of Hollywood nepotism and a quickly fading directorial star provides the backbone for the futuristic sci-fi lack-of-adventure yarn \"After Earth.\"In just his second picture since 2008, Will Smith teams with fellow Philadelphian M. Night Shyamalan, who is working from a story written by Smith, and a script by Gary Whitta \"The Book of Eli\" (2010). The once-revered auteur has long since fallen from grace, to the extent that his name was notably absent from any of the film's advertising. However, \"After Earth\" has problems that go far deeper than Shyamalan's bland tone and lethargic pacing. The movie is rarely fascinating, incredibly pedestrian, and curiously unimaginative.\r Shyamalan wastes no time commencing his narrative gimmick by announcing the rules of the story. It has been a thousand years since Earth self-destructed, ravaged by natural disasters and a deteriorating environmental infrastructure. The surviving humans evacuated the planet, settling on a new home known as Nova Prime. For 13-year-old Kitai (Jaden Smith), who is training to become a ranger like his often absent father, General Cypher Raige (Will Smith), he worries that he will let his dad down if he doesn't follow in his footsteps.\r The elder Raige decides to bring him along on his last mission before he intends to retire. En route, a meteor shower damages the spacecraft, causing it to crash-land on the now-uninhabitable Earth. With the rest of the crew dead and Cypher badly injured, it is up to Kitai to travel 100 kilometers across the harsh and wild landscape to find the tail of the ship and retrieve the beacon that will send help their way. If he doesn't succeed, father and son will perish.\r The special effects are adequate, but are noticeably fake compared to other effects-driven films like \"Star Trek into Darkness\" (2013) or \"Oblivion\" (2013). The film tries to tackle, on the most superficial level, the rites of passage. But with such a bland story and weak performances, the underlying meaning in the film only leads to indifference.\r Jaden Smith, who was decent in \"The Karate Kid\" (2012), completely falls flat in his performance for this role. The complete lack of emotional range stifles any of the hopelessly unimaginative screenplay's contrived father/son drama. The elder Smith may have a story credit here, but \"After Earth\" is not only an obvious attempt to keep his son relevant, but it is also a by-the-numbers survival story that never manages to surprise or excite despite an endless array of possibilities.\r \"After Earth\" feature's excessive CGI effects that rarely impresses, an A-list actor sitting on the sidelines, symbolism as obvious as the narrative is predictable, and is relentlessly uneventful. On a positive note for Mr. Smith, it's not nearly as bad as the completely forgettable \"Wild Wild West\" (1999)."
    },
    {
      "rating": "3",
      "text": "The danger is real, but fear is a choice, a choice I think everybody will embrace when seeing this movie. It is scary how bad this movie ended up being. Call me whatever, but I liked Signs, and I didn´t thought The Happening was as bad as many do believe it is, but this, this is horrible. M.Night Shymalan took an interesting concept with tons of potential, and made it incredibly monotone and boring. This is supposed to be a fun movie full of chases and adrenaline, but instead, despite the movie´s recall to \"everything in this planet has evolved to kill humans\" we barely see any real danger, and when it finally comes it is resolved with such simplicity that it ever really reaches true excitement. From a character and story standpoint the movie also flatters and in a big time. Will Smith is one the most charismatic actors in the industry, but his character in After Earth is as bland as possible and barely makes appearances. So in the end its all about the boy, who unfortunately lacks the talent o his father. His not bad to an unbearable point, but his not good enough either  to carry such a movie on his shoulders. So at the end, we are left with a bland story driven by bland characters in a bland planet as a whole which doesn´t look all that good either, because yes, the CGI is also kind of bad."
    },
    {
      "rating": "2",
      "text": "This get one thing very straight before I continue. Okay, this was a Will Smith movie. Not an M. Night Shyamalan movie. Will Smith is doing all the press with his son, the marketing strategy  was clear from the opening trailers: Make sure to exclude M. Night from everything except his name in the credits of the trailer. When I say this was a Will Smith movie, I mean everything had to be Will's way or else he wasn't going to do this movie. Which is why Will Smith didn't do Django Unchained. He can make all the excuses he wants, but fact of the matter is, he's so, so egotistical and won't do movies unless they're his way and not the director's or writers way. Because he's the almighty Will Smith. Coming into this movie, I had mostly bad expectations, but I remained positive. Maybe, just maybe there's hope this would be good. Good gracious, was I ever wrong. The story, while somewhat fresh, felt like a recycled story. The acting was lame and the CGI was kind of lame. It didn't make for a good movie whatsoever. Wasn't even a good Sci-Fi which is the genre it exists under. Just a horrible movie and Will Smith should look at this as a warning of what his career is becoming. His son is a horrible actor who tries to hard, but besides that Will Smith needs to learn that his way is the worst way. I can't even remember the last Will Smith movie I enjoyed.  maybe? Yeah. Will Smith needs to get it together. He's quickly becoming a shell of himself."
    },
    {
      "rating": "1",
      "text": "When i saw the trailer for this i was all like \"holy s**t will smith looking as cool as ever\" however after seeing the movie itself i have come to the conclusion that it is a waste of f**king time. the trailer makes it out to be this epic will smith movie full of awesomeness, it delivers no awesomeness whatsoever, will smith is in the movie for about half an hour and the 'action' (if it can be called that) is all done by jaden, not very well i may add. and as for the planet supposably being inhabited by animals evolved solely to kill humans, i didn't see many of these 'animals'. there were some monkeys that were the size of normal monkeys and a massive bird thing thats about it. most of the movie is spent watching jaden wandering round.\rIF SANE AND NOT BEREFED OF ALL THOUGHT AND OPINION AVOID AT ALL COSTS.\rIF MENTALLY CHALLENGED THEN BY ALL MEANS WATCH AWAY YOU MAY ENJOY ALL THE PRETTY COLOURS...."
    },
    {
      "rating": "3",
      "text": "This move is a huge waste of money and time. Its dull and boring in 95% of its length. The movie tries you to bond with the characters but you just can't (there are 2 main characters that are basically the only 2 characters in the whole movie because there is total of 13 roles in this movie!!!). You can't bond with Cypher Raige (Will Smith) because he is emotionless so basically there is nothing to bond with, and you can't bond with Kitai Raige (Jaden Smith) because he is another movie kid that we need to be babysit and you have to listen to his life problems (although his role matures into something likable later in the plot). I have bonded more with an eagle-ish bird in the middle of the movie that any of the 2 main characters. The whole climate change on Earth is unrealistic and illogical, unsuitable for human life, but still suitable for everyone else, even the alien who survived the crash. And yes, I was about to give the movie rating 4, but because of the stupid popular idea that movies have to have 100 planets on the night sky on any alien planet, this movie gets a 3."
    },
    {
      "rating": "2",
      "text": "The movie had it's moments, the now-too-used \"Nature evolved to kill us\" is decent enough... for a D&D campaign....\rBut, for the luv of gawd!\rThe movie looked and felt like a glorified auto-biografy of the Smiths, the kid WAS Ok in Karate Kid and In pursuit of happiness, but because he didn't acted that much, now, it clearly shows he has no talent, lost his charisma and pushes waaaaay to hard his dad acting skills, like learning Karate from a Book."
    },
    {
      "rating": "0",
      "text": "The film's potential is derailed by some truly atrocious acting, especially from Jaden Smith. What undoes the film is its rather rancid parent-child sentimentality (a Shyamalan staple, admittedly) and a charisma-free performance from the younger Smith that suggests the apple has fallen very far from the tree, indeed."
    },
    {
      "rating": "0",
      "text": "Will, you really need to \"take a knee\" on this one.\r The entire movie is based on the premise that we have enough technology to wormhole ourselves to another star system, but have somehow lost the ability to create a shotgun, which is all it would take to kill the \"bad guys\".  Seriously, we don't have guns for some reason."
    },
    {
      "rating": "6",
      "text": "A very straightforward movie but i enjoyed it much compared to oblivion.\r The way it was phrased by Will Smith, \"Everything has evolved to kill human\", i was hoping for more in the way of obstacles.\r Definitely a rise for M Night from his previous movie."
    },
    {
      "rating": "2",
      "text": "The dangers of nepotism are all to evident when watching this tedious flick. I am often left wondering why Will Smith's son constantly looks like he is smelling his own farts and is confused by them. His default facial expression is either contrived pretension or a mild case of idiocy."
    },
    {
      "rating": "3",
      "text": "I would have given this a 2, but it deserves a 3 or a 4 for just how hilariously bad it is.  A almost complete amateur with a director who does everything but direct? Gold. Every time the kid opens his mouth it's hilarious. Whenever he is just walking, or thinking, or fighting he is actually pretty good, but then he says one of his awful lines without any real emotion and you're either groaning or laughing.\r This movie will either leave you board, or laughing. If you enjoy films with bad acting, and absurd logic, you'll like this. If not, they're are plenty of other movies to waste time with."
    },
    {
      "rating": "5",
      "text": "\"Aside from the films tacky ending, After Earth is not going to wow you with its visuals or make your jaw-drop, but if you can get past some of the performances you may enjoy this sci-fi adventure, this is M. Night's first good movie in about a decade.\"  C"
    },
    {
      "rating": "7",
      "text": "Finally an M. Night Shyamalan movie that doesn't suck, but then again the story was evidently written by Will Smith. While this film was far from perfect, After Earth does have a lot of good things going for it. First of all, and most obvious, is the cinematography and the special effects. This movie looks beautiful and Shyamalan does a masterful job of creating a really special environment and the re-imagining of Earth was pretty interesting. The acting of Jaden Smith and Will Smith was also really good. All of the characters spoke with an interesting accent for the film and, while it was strange at first, it gave the setting more of an authentic vibe. Speaking of the setting, that's one of the only real weak points, in my opinion. I really wish they would've developed the setting more. All we're told is that the Earth suffered some cataclysmic event that forced humanity to evacuate and settle elsewhere. We're also told that aliens attacked our new settlement with some strange creature called the Ursa. This is all essentially skimmed over and it leaves a certain emptiness to what seems to be an interesting story. Maybe they're leaving it open for a prequel, I don't know, but it should've been covered more and it kind of feels a bit lazy. I honestly don't understand the harsh criticism of this film, nonetheless, I enjoyed it. There were some elements of the plot and setting that forced you to suspend reasoning a bit too much but it was entertaining and interesting and even wise in certain areas."
    },
    {
      "rating": "6",
      "text": "I liked it, maybe when I saw it my suspension of disbelief was at a high point, so I ignored all the things that made this movie terrible for everyone else, I don't know, but I was entertained."
    },
    {
      "rating": "4",
      "text": "SOME CRITICS REVIEWS ARE BS. It's a solid 6/10 movie, it delivers when it supposed to  immersive survival action, nice visuals, original and interesting setting! It has problems, but overall it a alright average action!"
    },
    {
      "rating": "3",
      "text": "I've never seen an actor pat himself on the back this much since Nicolas Cage was trying to remove bees for the Wicker Man, which is still a better movie than After Earth. Will Smith still did a better job at acting than Jaden Smith but then again so can anyone. Do not go to see this in a theater, just pirate it when it comes out, burn it onto a CD and then set the CD on fire."
    },
    {
      "rating": "8",
      "text": "Once again I find my opinions are at odds with those of the world's most acclaimed movie critics. Perhaps young Smith couldn't carry this entire movie but that is far from the point.\r This is a unique and refreshing take on the bond between father and son. The plot is simple and the movie concludes in a somewhat predictable ending but the journey there is the real difference in After Earth. Those expecting a Sixth Sense esq twist look away. This really is a feel good movie with interesting ideas, great visuals and a huge focus on the strengths and weaknesses of a boy trying to live up to his fathers expectations.\r Excellent acting by Will Smith and a memorable performance by Jaden, on the start of what will certainly be a successful career. Those expecting to see a 15 year old able to replace his father should modify their expectations to reality. No Jaden isn't Will but he his a talented young actor with plenty of promise able to deliver in a big role."
    },
    {
      "rating": "8",
      "text": "I wonder why this movie was so unfavourably viewed. So what if Will Smith is trying to promote his son? What does that have to do with how good the movie is? Seriously, people! My full review is here: http://bit.ly/128SBeU"
    },
    {
      "rating": "0",
      "text": "Watched this with a mate of mine and we both thought it was truly terrible. Only surprise I had on checking meta critic was that the average was as high as it is.. Not even worth pirating."
    },
    {
      "rating": "0",
      "text": "LOL horrible. If Will Smith wouldnt have forced Jaden down our throats and had a different director I would have given this a 2. Jaden smith is the worst actor I have ever seen. Let this be a lesson to you just because you are Will Smith's son doesnt mean you have his wit, charm, charisma, or even the ability to formulate emotion on screen. Terrible in every way. The Razzy has to go to Jaden."
    },
    {
      "rating": "9",
      "text": "I like when sci-fi movies transport me in a credible future and this one did it. I don't get why peoples are so negative. For me it's 10 times better than the last \"sanitized style\" Star Trek where everything is polished and shiny. This one is more \"raw\" and credible even if there is \"creatures\". The kid acted nicely and Will too. For those who complain that he was \"empty\", it was his character so he did a good job. Great movie."
    },
    {
      "rating": "0",
      "text": "Much worse than typical rich star's vanity piece. Total waste of time and money. How did Smith forget how to act? And the shame is such a big piece was wasted on this total lack of talent.  His son might have some redeeming attributes but act is not one of them.  Will- you're a has been and your son's a boring loser."
    },
    {
      "rating": "0",
      "text": "The worst movie since a long time. This is not for Will Smith but for the most part on the director and the bad acting of Smith's pupil.\rSomething should not be allowed in the cinema. I wonder who controls the quality of the films."
    },
    {
      "rating": "9",
      "text": "All the new space movies lack depth however compared to oblivion this one is a lot more engaging and easy to follow ...I think jayden smith acting for a kid was awesomeness ...he is pretty much main and only character ....but can't give the highest score because film lacks depth and details .but great acting"
    },
    {
      "rating": "10",
      "text": "If theres one thing I learned from my father is: if the critics hated it, watch it! You're probably gonna live it! And guess what? I really liked this movie. It presented nice futuristics possibilities, and a good father son story. The philosophy of the movie is also very good. I couldnt understand why critics hated it so much, but anyway, what do critics know? The movie was a very good piece of work. Nice jobs guys!"
    },
    {
      "rating": "9",
      "text": "I watched this movie last night and wasn't expecting much out of it cause all the crappy reviews it had. Well I think those reviews are a lot more harsh than needed to be. Sure there were flaws in this movie but overall it was a pretty solid movie. It was entertaining, suspenseful, and overall a story of some father son relationships can be. I liked the story even though it could use more detail but I've seen a lot worse movies than this. I recommend, this movie to anyone interested in a good movie."
    }
  ],
  "recommendations": [
    "sanctum",
    "seventh_son",
    "pompeii",
    "elysium",
    "terminator_salvation",
    "captain_marvel",
    "the_tomorrow_war",
    "jumper",
    "infinite",
    "x_men_apocalypse",
    "independence_day_resurgence",
    "code_8",
    "war_of_the_worlds",
    "transformers_the_last_knight",
    "a_wrinkle_in_time",
    "stowaway",
    "men_in_black_international",
    "the_new_mutants",
    "suicide_squad",
    "geostorm",
    "shadow_in_the_cloud",
    "chaos_walking",
    "in_time",
    "skyline",
    "battleship"
  ]
}