{
  "id": 4256,
  "title": "Afternoon Delight",
  "starring": [
    "Kathryn Hahn",
    "Juno Temple"
  ],
  "runtime": 95,
  "genre": [
    "Comedy",
    "Drama"
  ],
  "description": "Rachel is a quick-witted and lovable stay-at-home mom. Frustrated with the realities of preschool auctions, a lacklustre sex life and career that's gone kaput, she visits a strip club to spice up her marriage and meets McKenna, a stripper she adopts as her live-in nanny.",
  "releaseYear": "2013",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/qlgPBk5xZzHHPfrimBFV46QuktX.jpg",
  "categories": {
    "plot": 5.428571428571429,
    "acting": 5.444444444444445,
    "ending": 8.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 8.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "5",
      "text": "Go on, you can tell me. Have you ever jumped into the back seat of your car as it trundles slowly through the car wash, just because you can, free for a moment of the responsibility of control, just for a different of view things?\r No? Well, me neither. Already, I feel inadequate, quirk-wise, and the opening credits haven't even finished.\r Afternoon Delight may be the perfect film for someone, just not for me. I have way too much testosterone coarsing through my innards to really get down with the ladies here. The story of (now, when you've watched it, you can tell me which) a disillusioned/selfish/vacant/bored wife and mother with a flagging sex-life, a challenged libido and a distinct lack of direction is not as voracious as it may be, but is written well, with enough reality at its core to be recognisable to many of a certain age.\r Kathryn Hahn leads this ensemble of considered female examples. To call them stereotypical is probably unfair, but they are more obvious when you're old enough to have met most of them already. None are particularly striking or surprising, with characters that are mostly old enough to know better, but are still barren of satisfaction, and not just in the bedroom. Emotionally needy and only slightly psychologically challenged, this collection of women, though seemingly empowered, still seem at odds with a world of opportunity and their apparent inability to grasp it firmly by its very hairy bollocks. If this is a mans world, then you just might have these ladies to thank for it, wasting their time with not even beginning to understand what they want, instead of knowing their own minds and just **** well taking it.\r \"You want to blog with her? Name one good thing that's come from blogging..\"\r Well I can think of one. This review, for example. Cited for best direction at Sundance, you can easily spend the first half of the films' running time just wishing that these women would stop suffering under a cloud of whatever it is these soccer moms are ailed by. The arrival of stripper McKenna (Juno Temple) into the lives of these frustrating, frustrated women is a breath of fresh air for the audience and you would expect this to be true also for Rachel (Hahn) when she invites her to stay at her house, conveniently forgetting to check with her husband or son beforehand.\r And this is where we have a problem. The story is at odds with itself. You can ask why she even needs to ask permission to invite a friend to stay, for as long as she wants? But she really should. This is about respect, after all. This is something she clearly needs from others, yet seems unable to provide it herself. If the intention was to make Rachel unbalanced and slightly avoidable, then this seems like a triumph. Personally, I get the feeling that we are, regardless of our gender, supposed to be engaged by her (we are to an extent), to understand her (we do, she is quite transparent) and to empathise (oh no, you can forget that, missy). Throughout the majority of the running time, Rachel becomes progessively more unlikeable and self-absorbed, pining for for a youth that's long gone and quietly regretting the life she's had since, for a number of reasons.\r Hahn's portrayal of Rachel is excellent and the acting performances are enviable throughout, with Juno Temple continuing to impress and deliver a range of performances only touched on here, but Afternoon Delight has trouble with what it wants to say, or come to that, even if it has something to say. As a contemporary temperature gauge for how women of a certain age feel today, then it's all well and good, but you have to ask what the audience can take away from this, aside from a nodding appreciation if the audience also happens to be female and middle-aged. And if that is even the case, is there anything here besides recognition worth sitting through this navel-gazing story that is ultimately quite unpleasant, if we're brutally honest.\r Seemingly trapped in two stories, one of a lonely stripper, one of a lonely housewife, the two could rightfully be expected to meet somewhere in the middle with either one or both of these women learning from the other, making two worlds collide for some kind of purpose, but this never really happens. Or at least, I never saw it happen. Both of the two main characters are reluctant to change, yet neither is satisfied with their life as it is. Perhaps, despite being confident and assured, they try to learn to understand that their world does not stop immediately outside their bubble.\r Well acted and scripted, the story is naive and beneath the audience it is trying to impress. The performances are easily the best thing about the film and the same cast with something more to chew on would have made a more satisfying project come to life with their abundant flair. This plods and lollops from one selfish, tired complaint to the next, rarely getting up enough steam to generate actual enthusiasm from an audience that were clearly"
    },
    {
      "rating": "8",
      "text": "Kathryn Hahn is a force of nature  she's the comedic and dramatic backbone of this movie, and she's truly incredible in it.  On the other hand, the producers dropped the ball by casting Josh Radnor as her husband. He doesn't have the chops to share the screen with her. I was pleasantly surprised by Juno Temple, though the writers did give her a bit of the short shrift toward the end of the film. The rest of the female supporting cast is decent (with the exception of the always excellent\rMichaela Watkins)  but again, it ultimately comes down to Hahn.  She's simply a pleasure to watch in this film."
    },
    {
      "rating": "4",
      "text": "I randomly watched this, and can say it`s the only way you should watch it. Afternoon delight has a few interesting moments, but nothing great about it."
    },
    {
      "rating": "7",
      "text": "Subtle yet dark at moments. Exploring a specific agenda of a married life. Superb acting with good general plot. But it goes flat without much of an emotional roller coaster ride."
    },
    {
      "rating": "4",
      "text": "Saw June 2020. Jill Soloway director/writer....same characters, city, issues, socio economic group and therapy. So predictable,  not original recycled. What we thought was fresh and revealing in \"Transparent\" not really. Ditto for Kathryn Hahn, same character, city....."
    },
    {
      "rating": "6",
      "text": "Everybody can't be a Captain Save-a-Ho!Sometimes small films are good enough to highlight the good and bads of society. But the thing is they won't to everybody. This is not a message film, but about doing good. Self is important, but still you can care for other than yourself. It was about an average modern day couple. They come across a young woman working in a strip club and try to support her to give up it to live a normal life like them. They know the risk of letting her in, so what comes later is a trouble that affects the family and friendship.You won't believe that it was one of the Tarantino's top ten films of the year 2013. I find it not bad as well. But surely it should have been better. Feature film directional debut for the writer and producer. From the woman filmmaker, women oriented film drama. Fun to watch, yet a very serious thematic. From the cast side, both, Kathryn Hahn and Juno Temple were good. Surely a delightful film if you are not anticipating a big from it.6/10"
    }
  ],
  "recommendations": [
    "the_age_of_adaline",
    "up_in_the_air",
    "the_florida_project",
    "into_the_wild",
    "the_intern",
    "the_hunt",
    "young_adult",
    "blue_valentine",
    "captain_fantastic",
    "ingrid_goes_west",
    "the_descendants",
    "me_before_you",
    "promising_young_woman",
    "about_time",
    "the_glass_castle",
    "home_again",
    "secretary",
    "elle",
    "leave_no_trace",
    "collateral_beauty",
    "closer",
    "five_feet_apart",
    "disobedience",
    "unforgettable",
    "20th_century_women"
  ]
}