{"id": 2512, "title": "Air Force One", "starring": ["Harrison Ford", "Gary Oldman"], "runtime": 124, "genre": ["Action", "Thriller"], "description": "Russian terrorists conspire to hijack the aircraft with the president and his family on board. The commander in chief finds himself facing an impossible predicament: give in to the terrorists and sacrifice his family, or risk everything to uphold his principles - and the integrity of the nation.", "releaseYear": "1997", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/juRFEbyx5JlNuYrZM50vcZmtN78.jpg", "categories": {"plot": 6.333333333333333, "acting": 5.894736842105263, "ending": 4.714285714285714, "soundtrack": 7.5, "cinematography": 5.0, "familyFriendly": 3.0, "funny": 2.0, "action": 5.791666666666667}, "reviews": [{"rating": "9", "text": "I think that this movie was amazing in every way. The music was fantastic and even moving at one point, the special effects were good and the way that they built a huge set that looked realistic and like the real Air Force One was also great!!\rThe acting in this film was phenomenal also. Harrison Ford portrayed a heroic President and father brilliantly and the punchline \"Get off my plane\" was executed well also. Gary Oldman showed his character's malice perfectly also and his accent was awesome.\rOverall Air Force One was a fantastic film which was thrilling, action-packed and moving at times and it also opened up some secrets of Air Force One, even if it was not entirely acurrate. A great film nonetheless."}, {"rating": "5", "text": "\"Air Force One\" is a good summer blockbuster to watch, especially for the America-obsessed patriots who love watching good Mr. American President kicking bad, grumpy terrorist asses. Guess I'm not one of them..."}, {"rating": "4", "text": "Mediocre. Something Harrison Ford has been associating himself with as of late. Talk about backsliding."}, {"rating": "9", "text": "Air Force One is a successful thriller on a plane. Harrison Ford plays the president with such conviction that the movie soars (no pun intended). Oldman makes a hell of an antagonist as well. This film will keep you thoroughly entertained."}, {"rating": "10", "text": "Its the perfect action with the right amount of danger! However, its Rated R for Violence even though it should have been rated PG-13 for intense action violence and brief strong language."}, {"rating": "7", "text": "Thrilling. Still, it's kinda funny, making Harrison Ford president."}, {"rating": "5", "text": "One thing I've noticed that Air Force One really hammered home for me is that Wolfgang Petersen really doesn't do subtle. From the over-the-top action, to the cheesy dialogue that is delivered by actors with a completely straight face and the lengthy set-pieces, everything is designed with no-nonsense thrills in mind. There's no real agenda behind the film as far as I can tell, it was made too late and loaded with too many archaic and fantastical views to say anything about even the Cold War, let alone the modern world. Jerry Goldsmith's score is also instantly noticeable, not for its quality as such, but because it's invasive, bordering on jarring. The central plot of the film could be quite terrifying, especially to a modern audience, but the story takes you to such ludicrous extremes that it threatens to become parody. The cast's performances are largely unremarkable, particularly (and rather disappointingly) Ford's action-hero president. The only actors that really stand out are Gary Oldman (who looks like he was having so much fun with the role) and Glenn Close, who valiantly appears to be attempting to bring the film back to some form of reality. Despite its problems, if you watch it in the right frame of mind (preferably with a beer in hand and with the company of a few friends) you can have a lot of fun watching Air Force One. It's pure, unashamed escapism."}, {"rating": "8", "text": "While entirely unbelievable and full to the brim of plot holes, Air Force One still flies high thanks to its ability to create tension so high people with pacemakers probably shouldn't watch it.The first 30 minutes of the film are the most thrilling with a engrossing opening to the extremely manic hijacking everything is done to build tension and the film doesn't miss a beat with it seamlessly cutting from  the plane, to the ground and to the White House. The characters are introduced quickly to avoid losing momentum but writer Andrew Marlowe gives enough for viewers to relate and empathise with them. The film understandably lags after the initial action but this is beneficial as it allows for Gary Oldman to do what he does best, be menacing. The casting of the film is one of the main draws with Harrison Ford providing his usual gritty performance and Oldman rivaling Alan Rickman's Hans Gruber but it would be nice to see other fine actors such as William H Macy, Paul Guilfoyle and Xander Berkeley given more to do. The main flaw of Air Force One is that its ending, which should be the climax of all the tension comes too early with the real ending being not nearly as tense. In summary if you like the idea of Harrison Ford and Gary Oldman playing cat and mouse in an enclosed space 40,000 feet  in the air than this film is for you. Lovingly put together by Wolfgang Petersen, a real crowd pleaser."}, {"rating": "9", "text": "I've seen many movies but Air Force One is still one of my favorite suspense movies. Harrison Ford is a great Playing the President of the US. Gary Oldman is no Heath Ledger but he does a great job as a merciless villain who loves killing citizens and wants more than anything to get back to his homeland, Russia."}, {"rating": "10", "text": "Um Suspense de ação de tirar o folego,Harrison Ford está perfeito no papel do Presidente dos United States Of America,Gary Oldman é extraordinário e perfeito na pele do terrorista russo. Wolfgang Petersen dirige esse brilhante suspense de ação."}, {"rating": "6", "text": "Air Force One is a decent Die Hard-lite summer blockbuster that is entertaining and fun to watch in all of its explosive and action packed glory led by Harrison Ford."}, {"rating": "0", "text": "Merde quand même... c'est Petersen le réalisateur du Bateau qui a pondu cette grosse machinerie à bouffons ? vraiment ?... oué bah y a même son vieux pote et compatriote Jürgen dans le rôle du vilain méchant dictateur, un tout petit rôle pour la gamelle.Mais par où commencer pour décrire tout ce fatras improbable (le mot est faible...) aberrant, grotesque et grand guignol ? par la musique pompeuse ultra premier degré de Jerry Goldsmith ? ou bien par la prestation ultra caricaturale de Gary Oldman, éminent acteur qui s'est commis dans ce salmigondis hollymerdien ?Ou bien peut-être par le commencement, le super Harrison Ford super président Jedi qui botte le cul des méchants terroristes (russes) ? ou mentionnerons-nous les F15 qui virevoltent comme des X-Wings ? la fusillade dans le maousse jumbo jet ultra blindé qui évite les missiles comme une danseuse de ballet ? ou alors l'évacuation sur une corde à linge ?Les Die Hard ont donc l'air bien ballots en comparaison... et le pire dans tout ça, c'est que... ce n'est même pas drôle ni au 3ème degré ni après un pack de 6. Mon dieu, mon dieu..."}, {"rating": "6", "text": "Quite entertaining and solid acting  but not very clever. Pretty good action film."}, {"rating": "6", "text": "In 2013 we had Die Hard in the White House in 1997 we had Die Hard on a plane. President Marshall played well but straightforwardly by Harrison Ford is on Air Force One flying from Russia to America when Gary Oldman and his gun wielding friends take the plane hostage demanding that a war criminal is released from prison. Oldman is undoubtedly the best thing about the movie, he gives the only above average performance in 2 hours of scenes best described as \"decent\". Much like the only good Michael Bay movie ever The Rock, you will enjoy Air Force One as long as you are prepared for how dumb it is. The CGI is terrible, the story is thin, every time someone is killed there is a cheesy one liner, the soundtrack is typically reminiscent of the American National Anthem and so inspirational it's cliched. But Air Force One is an enjoyable and fun action movie, perfect to watch with friends and lots of popcorn. Not really worth a watch unless you're an action junkie (which I'm not) but dumb fun if you do give it a try."}, {"rating": "7", "text": "Violent without windings, a good action movie Die Hard-style, but in the Presidential Range, some people will think it illogical nonsense and bad, but apart from the fact that the president be Indiana Jones, the movie is acceptable"}, {"rating": "2", "text": "What a ridiculous US propaganda full of political correct dialogues. Oh yes, the US president can even kick some terrorist asses, haha. Sometimes I was even laughing and in the 2nd half I could not endure it anymore. The visual effects are outdated also."}, {"rating": "2", "text": "I should think the leads in this film must have watched it and slid under their seats.\rIt is awful and how it was nominated for any awards is beyond me.\rCould go on but would get writers cramp.\rFunniest part is when the hostages are released in parachutes, watch the coloured women laughing as she is hanging 15,000 feet in the air.\rYou couldn't make it up."}, {"rating": "2", "text": "This movie is just a \"US always wins no matter what\" type of movie. Otherwise i can't think of a reason why 6 enemy jets failed to blow up a single plane in the last part of the movie. And the most disturbing part was US fight jets fired 3 missiles and destroyed 3 enemy jets as if enemy jets were just junks. They should make movies which sound more realistic."}, {"rating": "10", "text": "A    Great    One    Flick    Of    Action\rGary Oldman está perfeito e Harrison Ford incrível"}, {"rating": "9", "text": "Excellent FilmAir Force One is suspenseful, thrilling, well-acted, and very unique."}, {"rating": "4", "text": "he's a very good negotiator..Air Force OneThere are few tricks and turns installed in screenplay that holds the audience in its overlong runtime of more than 2 hours but prior to that, their barely resides a piece of craft to explore in it. Wolfgang Peterson; a critically acclaimed director, fails on all levels here and addition to that, dims the somewhat appreciable script written by Andrew W. Marlowe. Harrison Ford might be suitable to portray such character but he needed to work hard on it like his supporting actor Gary Oldman that completely overpowers him on screen. Air Force One is a mere action feature whose attempt to reach for something more and beyond its potential eventually turns itself being intangible to the set tone."}, {"rating": "4", "text": "This action film focuses on the figure of the US president and his private airplane, Air Force One, which is abducted by politically motivated air pirates, willing to kill everything and everyone to liberate a dictator from Eastern Europe. Of course the film is a copious rain of US imperialist propaganda, with the US being the \"world police\" and champion of democracy. Despite all this, it is a good action movie, although there are already so many action movies on planes that ends up bringing nothing new other than the propaganda. The scenes in the presidential crisis cabinet are much more interesting than the scenes on the plane, with the several hesitations and fears of the presidential staff jumping into the public's eyes. These scenes greatly help the audience to get into the mood and get carried away by what they see. The end of the film lacks credibility and ends up implausible. Harrison Ford did a good job but reminds us a bit of other action movies where he shined, so it's not surprising. Gary Oldman did very well, almost stealing the scene from Harrison Ford. The worst of his interpretation is a fake Russian accent that makes the character a bit ridiculous. Glenn Close also does a good job, in a secondary character that ends up having some centrality in the plot. All the rest, unfortunately, is US self-praise."}, {"rating": "1", "text": "well choreographed crap...Liam..hang your head in shame. Exhilirating ?...yes...like watching graphic version of Dick Dastardly..getting beaten down with Muttley..but..with expensive special effects....and,,confused ?...like baddy Ultra Nationalists singing...what?...The Internationale ?..workers of the world unite ?    ?.really ?..hmmm..Dretor Peterson also gave s Das Boot..of which the original author commented \" Uttering concerns about the end result, Buchheim felt that unlike his clearly anti-war novel the adaptation was \"another re-glorification and re-mystification\"[11] of the German World War II U-boat war, German heroism and nationalism. He called the film a cross between a \"cheap, shallow American action flick\"[11] and a \"contemporary German propaganda newsreel from World War II\".[11]exactly...chauvinistic crap"}, {"rating": "10", "text": "Seeing the president battling hijackers is really surprising but still the movie is a blast and Harrison ford is one of the best fictional presidents of all time"}, {"rating": "8", "text": "Great film.  Nice action and great characters.  Harrison Ford is the really strong."}, {"rating": "7", "text": "The acting is, shall I say, a little over the top (thats an understatement) but otherwise its quite an engrossing and gripping watch, once the plot has properly been established. Its certainly fairly cheesy but also very much entertaining and somewhat amusing as well. I thought Glenn Close gave a particularly good performance as the Vice President Kathryn Bennett. I would recommend this film if you like cheesy action films, otherwise perhaps not."}, {"rating": "6", "text": "Air Force One starts with a promise but with time it doesn't keep the promise. It is simply an action movie made to entertain. Movie hits the mark, despite some minor flaws it still delivers tension, drama and action in abundance.The cast is strong and full of believable characters but the screenplay felt weak. The pacing was also bad. Even after so much action and thrill, you may feel tired after some time. Harrison Ford and Gary Oldman both put in solid performances and they are well supported with other cast members.Overall, Air Force One is an entertaining movie which is neither good nor bad."}, {"rating": "6", "text": "This movie is nothing more than  a \"too hard to die in the most secure airplane\" as Diehard movie is called in Greece well entertaining even with many goofs and errors"}], "recommendations": ["the_rock", "greyhound", "armageddon", "mission_impossible_ghost_protocol", "hunter_killer", "shooter", "mission_impossible_rogue_nation", "lethal_weapon_2", "12_strong", "tomorrow_never_dies", "jack_ryan_shadow_recruit", "the_last_stand", "broken_arrow", "captain_america_the_winter_soldier", "behind_enemy_lines", "angel_has_fallen", "patriot_games", "demolition_man", "mission_impossible", "the_sum_of_all_fears", "die_hard", "heat", "lethal_weapon_3", "the_equalizer", "the_peacemaker"]}