{"id": 3121, "title": "Alexander", "starring": ["Colin Farrell", "Angelina Jolie"], "runtime": 175, "genre": ["War", "History", "Action", "Adventure", "Drama", "Romance"], "description": "Alexander, the King of Macedonia, leads his legions against the giant Persian Empire. After defeating the Persians, he leads his army across the then known world, venturing farther than any westerner had ever gone, all the way to India.", "releaseYear": "2004", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/jrwQu72sGwGqwE8Ijne89PSIvhp.jpg", "categories": {"plot": 4.826086956521739, "acting": 6.076923076923077, "ending": 2.0, "soundtrack": 9.5, "cinematography": 2.0, "familyFriendly": 3.0, "funny": 10.0, "action": 6.875}, "reviews": [{"rating": "9", "text": "I have to disagree with everyone who claims this film is bad. It's not perfect for sure, but still very enjoyable. I love Alexander the Great and I have studied and read about him a lot and it's wrong to say that this film is historically inaccurate. They mixed a bit of legend into the story. Like his mother being a kind of witch and him being Zeus's son... but obviously we all know this kind of stuff is just the legend to make his character more grand. But the facts are true, the film is historically accurate enough. I especially liked that they didn't create a theory about his death. We do not know the cause of his death, so the movie doesn't make it clear either and just leaves the viewer guessing, just as historians are guessing. My only problem is that they portrayed him more emotional than he probably was. The battle scenes are great, violent yet beautiful and realistic as well. The music is composed by Vangelis,so yeah...epic, probably there is no need to say more. The scenery is beautiful as well. The kid who portrayed young Alexander provided a surprisingly good performance that I usually don't expect from kids. Not to mention that he actually resembles Colin Farrell. Probably it's due to the make-up and hair, but my point is it's actually believable that the kid is his younger self and that's quite rare in movies. In many other films I hate flashbacks, because it usually kills the illusion that the kid is so obviously not the same person. Not in this film,though. I could keep on complementing certain parts of this film, but what's essential is that it has enough good to keep you entertained despite the bad parts.( I am aware that the editing is kinda ****"}, {"rating": "3", "text": "Bad movie, boring, flat."}, {"rating": "9", "text": "I found this movie to have great costume and action. I enjoyed watching the battle scene's the most. Very entertaining. I didn't like Colin Farrell in this movie and Angelina is just a terrible actress but I still liked the movie overall."}, {"rating": "10", "text": "This is an amazing video. Colin F makes a great job at portraying Alexander. This is how a historical movie should be made. Accuracy neatly balanced with entertainment value.Also an answer to the reviewer called \"Christo\": For someone who supposedly studied Alexander for 2 years, you have very little knowledge of Alexander and the times he lived in. This is a laugh: \"You must understand that during those times, a person who loved men and women was respected greatly because he/she loved each and every single one of God's children.\". God's children? Since neither Christianity or Islam had been even founded, I suppose you are either claiming that all Greeks including Alexander were, what...? Jewish? Polytheism ruled back then. There would be no \"God's children\". You are either very ignorant to the times of Alexander or simply trying to apply your beliefs on a time and place where that belief didn't even exist."}, {"rating": "10", "text": "I just cannot understand why people are saying that Alexander is a terrible movie! I have studied Alexander The Great for about 2 years now, and i have written numerous essays about him. This movie depicts the EXACT history of his wonderful and great life. I think that people were expecting to see a bloodfest. If you want to see a stupid gory movie, go and rent freddy vs. jason. Alexander is an historical epic about the greatest warrior to ever live. I think that people were taken aback by Alexanders bisexuality. You must understand that during those times, a person who loved men and women was respected greatly because he/she loved each and every single one of God's children. You cant think of it as modern times. The mentality back then was VERY different. So when you watch this movie, judge Alexander as a loving, yet strong person. I would like to say that the acting in this movie was riveting. No one overacted. Anglina Jolie betrayed Olmypia perfectly, passionate yet overpowering over her son. She had a perfect Greek accent, and i would know this since i am greek and lived there for sometime! So everyone who say's their accents are stupid are wrong! You have no fricken idea about how they are suppose to sound! Colin Farrel is a wonderful actor, he captured Alexander's passion and his pain. Also, i wanted to add that Anthony Hopkins was not given the props he should be given. He narrated the movie with such fatigue and (here it is again, lol) passion. So please, disregard all of the stupid and idiotic bad comments made by some of these people! Go and watch Alexander with an open mind and expect an epic with just enough battle, history, and love to make it a spectacular film. (please email me if this article made any difference to you @ ctaoushiani656@comcast.net)"}, {"rating": "0", "text": "I haven't even seen this movie and i hate it already! jeepers it sucks! that's how bad it is; now ol oli stone can be a pretty big gangster, but not when he's making bad movies! thug life!"}, {"rating": "0", "text": "I dont understand how anyone could even BEGIN to give this anything resembling a high rating. We all know that Alexander \"batted for both teams\", so to speak... and frankly nobody cares. Oliver Stone obviously felt like using this aspect would be more compelling to audiences than the greatness that Alexander was revered for. I suppose the only aspect of this movie that is worth mentioning, is the effort put into the photography and scenery... it was beautifully shot in some instances, but that is about all it had going for it. It was a pain to sit through, to be perfectly honest. I have never been to a movie theatre, where a movie was actually BOOed at the end. I just think it was so terrible to take a story as great as that of Alexanders conquest, and turn it into some sort of 'suprise' tactic using his bisexuality as the main pull for the movie. Rediculous - poor acting, poor storyline - it was so annoying to even want to pay attention to the plot, that you just want to get up and leave. A huge waste of time, dont even bother renting it - the special on Alexander the Great featured on the Discovery channel was 10X as entertaining, and I am not just saying that... There is so much to say about how bad it was, I am now at a loss of words."}, {"rating": "10", "text": "A brilliant film. Epic and well made."}, {"rating": "0", "text": "A small baby could have played Alexanders just as good as Colin Farrel. Angelina Jolie's looks is the only positive thing about this movie."}, {"rating": "3", "text": "This is 1 of only 2 movies that I have started and refused to finish.  The plot is dull, boring, and it drags, and by the time I hit 80% of the way through I realized that the only reason the Alexander character in this movie survived at all is because everybody else dies for him, including his horse.  Alexander the Great my ass.  More like Alexander the Mediocre."}, {"rating": "10", "text": "Wonderful movie that describes perfectly the different faces of Alexander's personality. No important fact is left aside, but still you have the time to think and elaborate your own interpretation about what happens. I think this is the best solution for a hystorical movie, because hystorically speaking there are lots of different traditions and you can't choose one over the other that easily."}, {"rating": "0", "text": "Stone obviously didn't spend any time on this sh*t as Alexander goes down in history as the Alexander the Never Will Be Great Film. One of the worsts of the worsts."}, {"rating": "3", "text": "Intriguing cast! However it's interesting to see how much can go wrong with an interesting part of history if the storytelling doesn't work. Sadly IMO this is one of Oliver Stones weakest movies. Really boring and it takes ages to get to a point."}, {"rating": "10", "text": "Alexander is perplexingly a Love-it or Hate-it movie, perhaps depending on whether you have an interest in the period or not !? Much of the visual imagery of the film is breathtaking, such as the stunning battles of Gaugamela and Hydaspes, but also the beautifully filmed crowded cityscapes of ancient Babylon, and the dramatic scenery along the route of Alexanders conquests. Some reviewers have complained about the flashback structure, and use of Irish & British accents to differentiate the Macedonian and Greek characters. Neither device bothered me once I realised their function ... I dont think I'd have been able to tell a Macedonian accent from a Greek one otherwise ! But these are minor digressions. The strength of the film is its epic portrayal of the experiences of Alexander and his men. The Battle of Gaugamela in particular is possibly the best reconstruction of an ancient battle committed to film, seamlessly guiding the viewer from an ingenious strategic battlefield overview, down to the tactical manouvers of the opposing forces, and the brutal reality of the bloody hand to hand combat. I was shaking with adrenalin from reliving this brilliantly choreographed confrontation. More poetic and still relevant is the clash of cultures illustrated by Alexander on his beloved horse Bucephalus and the terrifying War Elephants of the Punjabi King Porus. Alexanders dream of uniting the diverse peoples of the world under one unified culture is one we're still wrestling with, and is reflected in microcosm in his own relationships with his parents and lovers ! Its such an epic story that perhaps there was an inevitable tightrope to be walked by the films central characters as they try to carry sufficient gravitas for the themes involved, whilst keeping them real, which has led to accusations of hammy acting. I didnt share this feeling though, these real titans of human history are surely entitled to some Shakespearian hyperbole ... and it was probably a genuine requirement for charismatic leaders inspiring their followers ! I WAS inspired !"}, {"rating": "0", "text": "Worst ever. I haven't seen any demonstration of Alexander's \"greatness\"!! Talking about conquering Tyre and Egypt? Did I miss Part I of the movie or am I supposed to take it for granted that he's great by acting like a foolish drunk 99% of the time!"}, {"rating": "0", "text": "It's absolutely dredful. Actors, dialogues, sets, this film is a shame. Oliver Stone is no Riddle Scott."}, {"rating": "0", "text": "Glorification of nationalism and genocide. It sickened me, and I squirmed in my chair the entire time, wishing it would just end."}, {"rating": "0", "text": "Very disappointing film. Tried to be an epic but was confusing. Poor acting, the battle scenes were awful. The narration was poor and confused. The 8 year flash back scene was in the wrong place.The camera shots while in a battle scene were too close to actors and you lost all perspective. The story lingered too long on the homosexual side of his life. The fighters were not plausible as they were generally slim boys with makeup and would not have stood up in a battle. See Gladiator if you wish to see how battle scenes should be shot. Don't waste your money by going to see would be my advice."}, {"rating": "0", "text": "Don't gimme any of this \"you have to pay attention\" or \"you have to enjoy history\" garbage. I love history, but even if I overdosed on adderall, I could not offer my attention to this movie. This marked the first time I could not finish a movie. I tried on two separate occasions and both times it took less than an hour before I realized there are so many better things I could be doing and shut it off."}, {"rating": "9", "text": "I loved it. To fully appreciate this, you need to enjoy history, have an open mind, and actually be able to *pay* *attention* to what the 'characters' are saying. Alexander did a *lot,* and Stone is trying to include as much as he can, coherently, to give us the best picture all around of who Alexander really was. And I think that for the most part he did a really good job of acheiving this. I don't care how they marketed the film. I do, however, think that they should have gotten linguistic coaches for their actors in major roles - you cannot have what sounds like a Scottish Crateros, an Irish Alexander, etc. - it takes the viewers out of the movie enough for them to have to tell themselves to ignore that element (and can annoy many people throughout). I really enjoyed this; but I also happen to be the kind of person that loves long movies, enjoys history, has an open mind, and pays attention to what's being said and not said by the characters."}, {"rating": "4", "text": "Though not nearly as bad as had been anticipated, the film is not nearly as good as it might have been. Its major asset is an awesome production design, with cinematography (when it's not pretentious) costumes and scoring right behind. The acting is, for the most part, over the top, with Farrell, Jolie and Kilmer seeming to be in another film, but Hopkins and Plummer are fine. Alexander's worst flaw is that it is one of the worst edited major films to come down the pike in a long time; some sequences have no apparent connection to what precedes or follows them."}, {"rating": "1", "text": "Unmitigated dreck. Audience, what was left after the first 2 hours, had to be put on suicide watch."}, {"rating": "5", "text": "It wasnt a bad film but it was just so confusing where they were trying to go with this that it ruins the film completely. The script was pretty bad but the acting was great and the action was good as well."}, {"rating": "2", "text": "A few things stopped this from a zero ...  Anthony hopkins voice, special effects, and a few character actors.Colin Farrel is horrible, Angelina Jolie was horrible and miscast, and the directing/dialog was horribleOne more saving grace... the budget was big enough to stop this from being worse.... watching that is but it might give Ishtar a run for most ridiculous $ spent for such a poor end product I want those hours back I wasted!!!!!!!!!"}, {"rating": "10", "text": "The most underrated movie I know... Val Kilmer´s performance nominated for Razzie **** as worst supporting actor? Are you **** kidding me? His talks with young Alexander, especially in the cave were some of the best father talks of heritage and legacy in cinema. The movie is for the most part historically accurate, the battles are epic, the visuals are great, Vangelis soundtrack is transcendental work of art... Boohoo Farrel had an accent, who gives a **** If you call his performance \"bad acting\", you are delusional. He got the essence and legend of Alexander right. Alexander was more than a man, his ambition made him distant a alone, even among his men and Farrel captured that beautifully. His speech to his men to march to India, pleading for one more month, seeing the difference of mindsets between mortals and a man with endless ambition... Anthony Hopkins as old Ptolemy, Christopher Plummer as Aristotle giving lecture to young Alexander and his future generals and friends who would change the course of the world forever... This movie has some of the most epic and impactful scenes in cinematography... Honestly all I can say is **** the critics and **** the sheep that cant think for themselves, I don´t believe a man with three digit iq and healthy levels of testosterone can watch this masterpiece and not be left with awe and respect for both the man Alexander was and the movie that portrayed his story so beautifully."}, {"rating": "6", "text": "The film had a pretty decent start. It was somewhat intriging, the relationship between Alexander and his father was interesting and being a huge history fanatic myself I learnt some new things. The battle of Guagamela was also really nice to look at but no where as epic as other battles like Troy, Lord of the Rings etc. After the first hour it really started to drag on but I did watch the whole and I don't think I'll ever watch it again the second time due to its long running time.\rI think the reason why the film was so boring was because there was not much memorable moments that refreshed the experience and I found the character of Alexander's mother difficult to understand. So I guess you could say the characters aren't really defined so its boring to watch after the 1st hour but I thought it was a solid film when I first and only watched it. Slightly above average."}, {"rating": "2", "text": "Oliver Stone is the king of all controversial directors, but Alexander is by far the weakest in his career. I don't know if the re-cut of the film is any good, but boy how wrong is Hollywood. Updating an ancient historical figure just make me watch another 3 minutes of Hamlet. Everything in this piece of crap is horrible. Choosing a whiney bastard Colin Farrell, Marlon Brando, Hannibal Lector, and Angelina Jolie was a 'Meh,' the story is confusing, overblown action battle scenes, and Stone just lost his balance on why Alexander should've been a great movie to begin with. But I've have just seen enough of Colin Farrell and his offensive Greek accent. Some may think this is a big misunderstanding, but PLEASE do not watch this movie. Either on Netflix or Starz, Hell No. It's just too painful to watch as much as The Last Airbender. If it ain't broke, don't fix it even if Stone tried to be at his very best."}, {"rating": "3", "text": "Alexander, which fails in almost every way possible, bores its viewers to death and attempts to educate them through nullified narrative more than it does to entertain them."}, {"rating": "3", "text": "I wish I could say I was able to overlook the film's many flaws and say that it's a half decent film, but that would be a lie. Is this film really that bad? Sadly, and unfortunately, yes. This is a bad film; the pacing is horrible, the editing is atrocious, the performances are overly dramatic, the battle sequences are mostly mindless, it's unnecessarily gory, the story itself is unengaging, the direction is confused, and as far as historical biopics go this isn't one that all that accurate. All of these things combined with ambition could not save this film which is very sad and disappointing. The reason this film was so disappointing is because I believe this ensemble could have created THE biopic of Alexander the Great, instead we are left with this mess that makes us question the minds of those involved."}, {"rating": "10", "text": "One of the greatest movies i have ever seen! I can't udnerstand why some many people disliked this film. It was masterpiece! I think people just don't understand the full meaning of this film. They just care about the action ****"}, {"rating": "10", "text": "Probably the only history movie I've taken seriously for the last 15+ years.\r Other movies like 300 or it's sequel are just action blockbusters with zero realism. A Disneyland for adolescents.\r This movie looks as if it was made for history class teachers. That's why on my list it gets clean 10. Very well executed, no superhero **** no cheep humor in fight scenes. It's a serious movie, factual and realistic. Certainly not for an average Joe.\r 10/10"}, {"rating": "5", "text": "There was a lot of raw material to make a film from, after all Alexander was one of history's stand out individuals. The film starts out in sometime B.C. and for 3 hours it switches between 10 years earlier, 3 months later, 15 years earlier etc, etc. All very confusing and all very unnecessary, after all he is an historical figure.I thought the mother's role was over done. Let's face it, if a son moves overseas for the best part of a decade it's a good bet he's not to closely tied/reliant on his mother. The whole thing with snakes and the mother was just crass.Alexander's motive for world domination is passable addressed but the multiple other aspects of his life are largely ignored and though facts are scarce as this happened such a long time ago some risk could have been taken via poetic licence for the reasons he did what he did."}, {"rating": "9", "text": "This is hands down one of the best historical epics ever made. It could have done some things better but I thoroughly enjoyed it."}, {"rating": "3", "text": "Un sujet difficile que celui de cette légende antique, un sujet casse-gueule et pourtant, ça ne devrait pas forcément l'être... la preuve en est avec ce vieux briscard de Petersen qui a réussi avec Troie, ce vieux mythe usé (sorti la même année je crois) à en sortir quelque chose de probant, puissant, satisfaisant. Simple.Pourquoi avec Alexandre, cela ne serait-il pas aussi simple, efficace et grandiose ? peut-être parce qu'on a oublié \"grand\" dans le titre ? peut-être parce que la musique de Vangelis est bien pâlotte et pauvrette, aphone... minable. Presque méconnaissable.Peut-être parce qu'Oliver Stone a mal choisi sa distribution :  Farrell pédale (sans jeu de mots, je vous prie...) dans la choucroute du début à la fin et même Angelina a l'air bonne en face de lui. Elle reste bonne tout de même (pour son âge) mais ce n'est pas la question. Et que dire de Val Kilmer en Philippe de Macédoine ? serait-ce une mauvaise blague ? (très mauvaise en effet).Et que penser de Rosario Dawson la métis porto-ricaine, elle qui est censée incarner une petite princesse asiatique, égérie fugace et involontaire du conquérant insatiable...? non, rien en effet.Cela étant, ces 3 heures ne sont pas toujours désagréables avec une mise en scène maîtrisée la plupart du temps et quelques belles scènes... sauf vers la fin où ça dérape dans le \"grand\" n'importe quoi : la dernière bataille n'est en vérité pas regardable, car surdécoupée, tremblotante, épileptique et affublée de filtres roses et violets (?!... allons, allons, pas de remarques déplacées je vous prie).Si l'ensemble de la distribution n'était pas soit foncièrement à la masse, soit engluée dans l'emphase grotesque, le film serait presque intéressant, car on ne s'y ennuie presque pas. Mais on ne voit pas trop ce que Stone a essayé de montrer d'Alexandre : un névrosé oedipien ? un homosexuel ? un illuminé ? est-ce que tout cela suffit à monter ou démonter le mythe ?Que de questions... Oui, Monsieur Stone, il aurait fallu faire simple, plutôt que cette longue psychanalyse plus ou moins historique qui n'ennuie pas, non, mais qui ne fait pas rêver et qui divertit encore moins..."}, {"rating": "4", "text": "As a historian, I believe that Alexander III of Macedonia (whom we know as Alexander the Great) was so essential for the course of human history that he achieved, by his own merit, a permanent place in the list of ten or fifteen most decisive personalities always. A very exclusive list of personalities who, for good or bad reasons, have forever changed our world's history. Personalities like Jesus Christ, Julius Caesar, Gengis Khan, Albert Einstein, Adolf Hitler, Cleopatra, Shakespeare, Christopher Columbus, Vasco da Gama, Galileo Galilei, Darwin, Napoleon, George Washington or Picasso... heroes or villains in an always subjective list, but it's impossible to think what the world would look like without them, isn't it? So it is with Alexander. But I'm not here to talk about this historical personality, just the movie. An intense epic that seeks to be faithful to the known facts of the life of this conquering, narcissistic, megalomaniac, homosexual and deeply complex king. This story begins at the Battle of Gaugamela (331 BC) and follows, recounting childhood, youth and ascension to the throne through flashbacks.Overall, I found the film interesting and enjoyable, even though it wasn't good. The script is historically accurate, at least in general. Of course there are exaggerated or buzzing scenes for dramatic purposes. The problem is that, even so, its a vague script and doesn't justify three and a half hours lenght. It would have been better if the post-production and editing work had cut about forty-five minutes. Another problem I felt was excessive grandeur. I know it's an epic movie, but it's possible to be epic without being presumptuous and this movie was a show of self-importance. This can be seen in the actors' theatrical and affected manners, a bunch of peacocks displaying their feathers all the time. This heroic spirit impregnated also Vangelis soundtrack, probably one of the worst he already made. I still felt difficulties with all those flashbacks. A narrative so loaded with advances and retreats seems more like a tango. They are useful, no one doubts, but sometimes it took a long time for me to realize that I was watching a flashback, and it makes everything more tiresome and confusing.The film is loaded with great actors but none of them shone for lack of a competent script and director. Colin Farrell was boringly heroic and should have kept his hair dark because the real Alexander would NEVER have been blonde. The way this actor behaved was erratic and dialogues were theatrical and full of pompous sentences. Angelina Jolie is a casting error, she was too young for the character and seemed constantly younger than her own son. Val Kilmer was OK as Phillip, with a generous dose of make-up for making him older and scarred. Anthony Hopkins and Christopher Plummer were both well, but there wasn't much for them here. Jared Leto was terribly bad, and his effeminate character was already boring enough. Rosario Dawson, Jonathan Rhys Meyers, John Kavanagh and other actors were OK as supporting but had no individual brilliance.On a technical level, the film is flawless. CGI is excellent and gives us some truly beautiful scenes, such Babylon or several battle scenes. Battles are spectacular and full of action, steroids, adrenaline and epic spirit. Cinematography is loaded with warm, intense yellow and red colors, and this sometimes tires our eyes a little, but it's beautiful. Costumes are very detailed and well made. Oliver Stone worked hard on these points and succeeded, but it was the bad script, the actors wooden performances, the erratic narrative and an unpleasant presumption that defeated this film."}, {"rating": "1", "text": "This movie sucked.  With the cast and director its should've been at least somewhat good."}, {"rating": "0", "text": "All around bad movie. An embarrassing portrayal. I wish I hadn’t wasted my time."}, {"rating": "4", "text": "At 3 hours this talk-a-thon is one tedious slog.Oliver Stone's ambitious movie stumbles in it's dialogue, pacing and casting."}], "recommendations": ["there_will_be_blood", "hereafter", "samson", "blood_diamond", "the_1517_to_paris", "valkyrie", "perfume_the_story_of_a_murderer", "revolutionary_road", "the_last_duel", "ben_hur", "the_good_shepherd", "the_social_network", "troy", "master_and_commander_the_far_side_of_the_world", "hugo", "the_godfather_part_iii", "all_eyez_on_me", "the_power_of_the_dog", "unbroken", "risen", "invictus", "eastern_promises", "blade_of_the_47_ronin", "the_monuments_men", "black_panther_wakanda_forever"]}