{
  "id": 1350,
  "title": "Alice Through the Looking Glass",
  "starring": [
    "Anne Hathaway",
    "Mia Wasikowska"
  ],
  "runtime": 113,
  "genre": [
    "Adventure",
    "Family",
    "Fantasy"
  ],
  "description": "Alice Kingsleigh returns to Underland and faces a new adventure in saving the Mad Hatter.",
  "releaseYear": "2016",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/4g043PWVXkjHkxEEsEfwuAxlM8i.jpg",
  "categories": {
    "plot": 6.189655172413793,
    "acting": 5.741935483870968,
    "ending": 8.6,
    "soundtrack": 5.0,
    "cinematography": 7.5,
    "familyFriendly": 4.0,
    "funny": 5.666666666666667,
    "action": 6.666666666666667
  },
  "reviews": [
    {
      "rating": "6",
      "text": "Alice Through the Looking Glass is a relatively solid kids movie with brilliant visual effects and a message about family and time even though the characters, humour and dialogue falls rather flat."
    },
    {
      "rating": "9",
      "text": "...................................Very underrated.... okey the plot is simple, and the story is for kids, but is funnier and you have a good time, a great time Sasha, Mia, Johnny & Helena all are great in the movie.\r And in the end a beautiful tribute to the Great Alan Rickman!!!"
    },
    {
      "rating": "9",
      "text": "Alice Through the Looking Glass is explicitly superior to its predecessor in several requisites. The film's screenplay is great, the cast is more committed, and the visual effects are more alive and less monotonous. The film is an inspiring work, however, for a released six years later sequence, there are many details that may go unnoticed if you do not remember Alice in Wonderland.\r The farewell Alice was fast and made me want more. I managed to hold on to the story even if not a fan, just hope it's not a failure at the box office."
    },
    {
      "rating": "10",
      "text": "Отличный фильм, с хорошим сюжетом, который понравиться как детям, так и родителям! Превосходная игра актеров и харизматичные персонаже, в купе с отличным и красивым миром - делают этот фильм незабываемым. К просмотру рекомендую!"
    },
    {
      "rating": "8",
      "text": "I was expecting less of this movie since it got horrible reviews - but it was amazing. The special effects were amazing, the plot was interesting, and we know more about the stories of many characters. Critics don't like fantasy films."
    },
    {
      "rating": "10",
      "text": "I personally enjoyed the movie and would watch it again! It does not deserve the negativity it's getting, I think people just enjoy writing nasty comments and that's disgusting"
    },
    {
      "rating": "10",
      "text": "So much better than the first. The plot sucked you in since the beginning, the colors were more vibrant in this one. It showed young girls and boys that they have their own individual rights."
    },
    {
      "rating": "10",
      "text": "One of the biggest injustices I ever saw on the critic history. Alice Through the Looking Glass deliveries a rich story, which may look silly at first, but it represents the impossible, which is a great subject of the film. The characters are richer than in the original and the visuals are different, but still equally appealing. The story is a symbolism for a lot of things, which is one of the greatest things of the movie. It talks indirectly about sexism, depression and most important: it has a message, it makes you think and it makes you believe, just like every fairytale should be. Incredible, you should definitely watch and think deeply of the meaning this movie has. Also great messages about family and dreams. Different from the first one, but still gorgeous."
    },
    {
      "rating": "8",
      "text": "I think this movie has received a lot of bad reviews however I still believe this was an awesome movie, it may not be my absolute favourite movie of all time but it was definitely an interesting movie with amazing costumes and special effects. The story itself was decent and it had a morale behind the story about Time and how it is not an enemy, which I really loved. Perhaps the characters could have explored their roles more to make it interesting and different. I am mostly impressed with Alice in this movie, Mia Wasikowska has greatly improved in her acting. Overall this is a movie to watch, it should get more credit than critics are giving it, I would judge this movie for yourself rather than listen to what others are saying. Thumbs up!"
    },
    {
      "rating": "7",
      "text": "I have no idea why people have such a big problem with this movie. maybe huge expectations expectations?\r yes, it is bit boring at times, but other than that? I liked the acting, I liked characters, visuals... Wasikowska was wonderful, this was one of best roles of borat, carter was great, and depp little annoying.\rI LIKED IT\r 2.9 or 34 is rating for serious horrible piece of poo. that is not what this movie is.\rseriously people, if you think and seriously rate this movie as worse than sharknados, you are mo*on and should not rate movies..."
    },
    {
      "rating": "10",
      "text": "I personally don't get what the negativity is all about. Sequels-they are never quite as good as the original. Is this an exception? Yes. Granted, both are very different and don't focus on remotely the same plot, but this is a movie that will sure give you the feels, focusing on family bondage and what is truly inseparable in life."
    },
    {
      "rating": "5",
      "text": "A fun family film ruined by poor writing and ugly CGI. Still mostly enjoyable, but nothing you will remember after a few days. If you're looking for a masterpiece, keep looking."
    },
    {
      "rating": "0",
      "text": "This film has nothing special to give to the audience,it's bland in every way.The characters are much annoying than before and doesn't have any character development,the story is not just boring or bland but also confusing and the only good thing I say to this film is that it's visuals are kind a good but not compelling.Again Nothing really special,it's just another sequel that exist cause the predecessor did well in the box office but the audiences and even the critics said that the film is bad,which makes this sequel unnecessary and this is much worst than the original."
    },
    {
      "rating": "3",
      "text": "Nothing special at all.The plot is confusing and the same time stupid if you think about it.Th first movie wasn' bad for me but I might say the this sequel is boring.The fun or excitement aspect is non-existent,characters and plot are  a bore and the visual effects are unconvincing.This movie is just insincere,the only heartfelt is the dedication of Alan Rickman."
    },
    {
      "rating": "2",
      "text": "Alice Through The Looking Glass is the film equivalent of fast food, nothing but empty calories with no substance and just come across as bland mess. Alice still has no personality and the other character once again don't fare much better and the plot is way too insignificant and forced and even creates plot holes at time. (seriously did everyone in the movie forget that calendar that predicts everything, i know it was stupid in the first movie but i thought someone would have brought it up) the special effects and costumes are good but there completely wasted when the plot is not worthy of it. this has all the problems of the first film but it feels slightly exacerbated by the fact this one seems so padded,pointless and lazy and only exists cause people went to see the first one."
    },
    {
      "rating": "10",
      "text": "I loved the first movie and I loved this one. This is such a fun and exciting film. The costumes, makeup, and hair were stunning. The scenery and colors were gorgeous."
    },
    {
      "rating": "2",
      "text": "I was not entertained! It was like being in a bad acid trip, but with lasting depression! Still admire Johhny Depp regardless of his personal life. Just not one of his better movies!"
    },
    {
      "rating": "10",
      "text": "Alice Through the Looking Glass is a best film I've seen this year! All the characters are revealed , the story of the first film of the scion to the logical continuation and completion.\rThe film is an incredibly beautiful and bright , jokes brought to hysterics , and not allow themselves to forget the story is very good and the family . This is the first film in many years that I 'm going to look for the second time"
    },
    {
      "rating": "9",
      "text": "This was a great film. All the bad reviews should be ashamed or were they payoffs? I tell you whats not in this film..murder, rape, and the harm of any innocence.  What really nattered in this film is the moral that time is precious, even one second could save the world  Family is important. So is forgiveness and to ask for forgiveness.  Yes I can see why all the haters hated this film...Hats off to the good works, great acting and fun visuals."
    },
    {
      "rating": "10",
      "text": "I was hoping there would be a sequel so we were very happy to go see this. Amazing special effects, keep you on the edge of your seat story and wonderful performances by the 3 main actors. Time is a GREAT character and the actor did an amazing job. The art direction, costumes, sets - it's all just a wonder to look at and there is a great message in the movie as well if you're not to stiff to listen to it. :) Wonderful film, so happy they made a second one! Better than the first Alice!"
    },
    {
      "rating": "2",
      "text": "who asked for a sequel to first film? whilst some elements of alice in wonderland II are better than the first honestly this is the worst movie of 2016 for me personally."
    },
    {
      "rating": "5",
      "text": "While at times endearing and charming, Alice Through the Looking Glass could've been shortened to a thirty minute Disney Channel special, and that's exactly what it feels like. Some incredible acting takes place in this movie, all except for Johnny Depp's portrayal of the Mad Hatter, which is absolutely ear wrenching and makes every second of this movie worse. Director James Bobin essentially takes his formula he used on The Muppets: Most Wanted and rehashes it into an absolute snore fest from beginning to end."
    },
    {
      "rating": "8",
      "text": "This movie really surprised me, especially because I didn't really like the first one. Visually this movie is a real treat. I enjoyed the lighthearted performances, especially Mia Wasikowska as the plucky Alice, and of course I fell hard for the visual effects, Dan Hennah's production design, and Colleen Atwood's costume designs. Sadly, all the world-building that was set up in the first film took forever to manifest into a sequel, and so when we get answers to certain questions posed by the first film as well as the Caroll lore, they don't feel revelatory so much as just \"oh, so that's why such-and-such\".\r Still, I think the wait was worth it. This time around, it actually feels like there's a heart beating at the center of all the eye candy. Last time, the story was so straightforward and predictable the visuals were the only thing holding the film together. Now, the themes are more clearly presented and Alice's adventure in Underland is more of an inner journey. Underneath all the shiny gloss, this movie actually has strong personal growth messages and deals with difficult topics such as loss and acceptance. As someone who has lost someone precious recently, at the end of the film I came out feeling inspired.\r The filmmakers tap into both the darkness and the lightheartedness of Carroll's world in broad strokes, even if they don't really get or even attempt to do justice to the deeper social allegories. Linda Woolverton's script is more blunt and brute force than it is subversive, but the film's feminist touches are thankfully not as ham-fisted as they were in the first film. Wasikowska is wonderful, Depp is... well, Depp, Hathaway is pleasingly fairy-like and subdued, and Carter continues to chew scenery. But the real MVP here is Sasha Baron Cohen, whose portrayal of Time is an obvious highlight.\r Little bits and pieces of Carrollian lore are much appreciated. Humpty Dumpty as well as the large talking chess pieces make a brief appearance, and the fish and frog people are more prominent. Some of Carroll's trademark words and phrases appear especially early on, but the world-building doesn't get too in-depth beyond that. We see the origin of the rivalry between the White Queen and the Red Queen, as well as the reason why it's always one minute to teatime at the Mad Hatter's table when Alice first arrives in Underland.\r I can see why this film might not cast its spell on everyone because it's so fast-paced and often feels like a movie for kids rather than for those well-versed in this universe. But if you're on the fence, you may end up liking or even loving it! There's more to the story and themes than what's just on the surface. I wasn't at all disappointed and will watch this again in the future."
    },
    {
      "rating": "8",
      "text": "Another beautiful story of female strength, blended with the worth of family, friendship, and whimsy. Perhaps why male reviewers want to dis poor Alice? My 11 year old son, who didn't want to go, ended up enjoying it and giving it a thumbs up. Admitedly, after reviews, I wasn't expecting much, but throughly enjoyed it. My only criticism would be the 3D effects. Not so great. So save your $ and go for 2D. But the wonderful colors deserve big screen treatment."
    },
    {
      "rating": "10",
      "text": "Muy buena , Alicia a través del espejo enseña a la vida sobre la pérdida, algo que hoy mucho  se ve y se sufre y no necesariamente debe ser como la \"Alicia\" de Lewis Carrol. Apuesto a que a el le hubiera gustado, de eso trata las secuelas, no de tener lo mismo de la otra."
    },
    {
      "rating": "1",
      "text": "Easily one of the worst theatrical releases I've seen all year. The script was laughable, and at times it seemed like a comedy making fun of too much bad CGI in films, but sadly, this was not the case. I do give it a \"1\" because of how much I enjoyed myself laughing at it in the theater."
    },
    {
      "rating": "9",
      "text": "Alice through the looking glass had excitement and great action/adventure.  It was a great movie.  It was cute.  I would highly recommend it for kids.  Although, I would not say it is a family movie because, if you have little kids they will freak out.  It has great adventure, action, and plot.  It is one of my favorite movies!"
    },
    {
      "rating": "6",
      "text": "Johnny Depp as Hatter provided us a performance that is so weak compares to the character's heavy make-up. Mia Wasikowska also declared to the audiences that she is acting towards layers of green screen all the time. Other than that, the movie is acceptable with its color and whimsical tone, but it is by no means a good Disney classic."
    },
    {
      "rating": "0",
      "text": "Boring story and lack of any type of interesting plot that can be identified with. Nice special effects but nothing compelling about the characters or their development. I didn't laugh once and was seriously thinking of walking out because it was tedious and uninteresting, and I had paid over $20 to see it in an iMax theater. Someone needs to tell the folks that made this movie that no matter how many millions of dollars you spend on special effects, if the story isn't a good one, then it's still a bad movie.\r Moreover, I'm so tired of women in lead roles in mainstream movies. They ruined the latest Star Wars that way by making a girl the lead and every ethnic minority besides Asian as the rest of the cast."
    },
    {
      "rating": "0",
      "text": "Alice is back and brings no fun,enjoyment and even excitement with a very boring and uninteresting story that will confuse you.Jokes are present but all of it felt flat,characters are annoying as hell with no character development and again uninteresting and the performances are cringe worthy.People are too nice to call the special effects good,no,it's ugly unlike The Jungle Book which was much better.Alice 2 is a mess and is just boring."
    },
    {
      "rating": "3",
      "text": "Alice's new adventure lacks any excitement, but here's where the worst part comes to play. Alice in Wonderland was just... average, but did we really need this? Other than an Alan Rickman memorial, this is just plain bad. Worse than its original. Majority of people are going to see it for Alan Rickman anyways. That's pretty much a bad time to introduce the Red Queen to a movie, right? Yeah, I know, but that makeup though. Still, don't fall for it, but the kids might anyways."
    },
    {
      "rating": "10",
      "text": "Alice's new adventure in wonderland is filled with excitement, each frame hand me gripping the edge of my seat. The film itself was simply perfect in terms of expectation, we've needed this sequel for a long while. It served as a good reminder that Alan Rickman will forever be in our hearts, simply beautiful and knocks the original off of the podium as the better of the two. I think the majority of people saw the film to once more gaze upon Professor Snape, which is fine by me. The Red Queen couldn't have been introduced at a better time, the writers know what they were doing. The makeup artists should be proud of their handy work, never have I seen suck attention to detail, the kids wouldn't fall for it though."
    },
    {
      "rating": "7",
      "text": "\"Alice Through the Looking Glass\" Is Shamelessly Worse Than Its Predecessor\r \"Alice in Wonderland\" directed by Tim Burton was a flawless success at the box office in 2010, and with just reasons, the colorful and gothic style of the team managed to give them two Academy Awards (for Art Direction and Costume Design) . Lewis Carroll's classics have been adapted to the big screen eleven times, and apparently it is feasible creation of other few. The scarcity of the sequel is Burton, his absence is irrefutable and although works as executive producer, his imagination and taste cries out for the reins of the film. This time, James Bobin (The Muppets) is director, his vision is broad and great-looking, but comparisons with Burton make presence on each frame evidenced. It seems that Disney forgets that it is better win a victory that a failure because of the ambition.\r From a screenplay written by Linda Woolverton, adapted to the books of Lewis Carroll, \"Alice Through the Looking Glass\" presents to an Alice (Mia Wasikowska) a little more older - really - returning of offshore after three years, preserving the illusion of return to sea. But her hopes are frustrated when her former aspiring boyfriend, Hamish (obnoxious and pretentious played by Leo Bill) takes over the boat her father and her house, inciting her to sell the important boat, stay with the house and with a humiliating and discriminatory work. Alice's problems do not stop there, the blue caterpillar (Alan Rickman, deceased and respected actor) visits her to seduce her to resolve certain matters of her interest in the Wonderland.\rAfter an characteristic entrance of the Carroll books, Alice faces a terrible - and stupid, excuse the expression - news, her friend, the Mad Hatter (Johnny Depp) is slowly dying. The only solution to restore the vitality of the eccentric young is go back in time and help to recover his family apparently dead, experiencing millions of adventures and eccentricities, accompanied by spectacular landscapes and performances for nothing unpleasant. A small sub-plot is seen to involved in the story of Alice, the truth behind the White Queen (Anne Hathaway) and her sister, the Red Queen (Helena Bonham Carter), an interesting addition to the footage.\r The story is one of the fundamental obstacles, lack of a strong and wide idea, makes that the 113 minutes of duration becomes tedious, stressful and the worst soporific, making viewers to cover their mouths, but not of amazement, of boredom. It seemed as if Disney had chosen to adapt the drafts of the wastepaper basket of Carroll, yeah, they wanted that Hatter had importance in the plot, but the magic disappeared. A work of such magnitude should be edited precisely, but this time, they exaggerated.\r Fantasy and adventure sequences are indeed impressive, accompanied by an exaggerated, but required use of visual effects, minor or equivalent to the of its predecessor. However, the lush visual effects aren't the sufficiently skilled to hide a slow pace, an inconsistent script and a pale and slight story.\r Characters are distorted and dispel - some - of its strict behavior in books, however, Alice, Mad Hatter and the Red Queen steal all eyes. I'm in total disagreement that the role played by Mia Wasikowska is uniform, awkward and boring, not alluding to books and hampering adaptation, I believe that she is the precise woman for the role and if at some point has failed is the fault of the scriptwriters. Our  blue caterpillar performed by professional and king of the acting ,Alan Rickman, was spectacular, serene and substantial, worthy of a so complete and amazing career of a man and an actor who will always be in the heart of the world, rest in peace, Alan.\r This is the first time that Disney surprises, and not in the way that everyone thinks. With a clear influence of female discrimination in Hollywood and the capacity to decide, Bobin and Woolverton had to leave their idea, just like that, an idea. Slow, lacking of the energy, palpitating continuity and charisma of its predecessor, \"Alice Through the Looking Glass\" offers a visually majestic spectacle, however, they confused the audience with babies, we are not stupid, so many colors and singularities lack narrative imagination, I think that the 'Wonder' disappeared."
    },
    {
      "rating": "10",
      "text": "We loved the movie!  Action packed non stop entertainment. Many funny parts throughout the movie. Great story line with meaningful message. I don't know what people are talking about the movie not having an a story line. They obviously don't what a story line is because it definitely had one. The scenery was amazing and costumes were stunning. The movie IS, worth seeing. Don't go by the negative reviews, they don't know what they are talking about. I couldn't stop saying \"that was such a good movie\"."
    },
    {
      "rating": "5",
      "text": "Part 1 I do not know personally. Therefore, I can make comparisons to.\rVisually, the film is great and they have done an incredible job. The actors are convincing and play their roles well.\rWhat me is sadly the story. Before Alice returns to Wonderland has built good characters. These are known cliché characters but no matter.\rThe Wonderful World of film bobs in front of him and it runs everything like gum. There is no action in the film. Later there is then also great action scenes but in between is just nothing."
    },
    {
      "rating": "10",
      "text": "Really interesting story and a rich experience in the plot that i felt so comfortable with. They could of done better with the special effects but the characters and their development were spot on. I laughed quite alot through the film and had no intention of wanting it to end because it was so interesting and comical, i paid £6 to see if in a high class cinema. Someone needs to applaud the people that made this movie as im sure they need to know, the story was amazing.\r The lead role was definitely a strong one and im really pleased with the diversity they are trying to achieve recently in new and upcoming films, it would almost be bigoted to think otherwise. Especially Star Wars :)"
    },
    {
      "rating": "4",
      "text": "An ill-conceived attempt at creating a story that preserves the magic of the first film while cramming in a host of platitudes and insights, with a result that feels like a strung-together amalgamation of oh so many mismatched beads on a chain. The special effects are indeed dazzling, and there are fine performances once again from Mia Wasikowska and Helena Bonham Carter. But these scant attributes can't overcome the film's many inherent weaknesses."
    },
    {
      "rating": "10",
      "text": "Bobin's take on Alice, gives us a surprisingly enjoyable, fun, and colorful movie with a decent plot. Definitely better than the first one. Baron Cohen's terrific performance shines, Bonham Carter is good, Depp and Wasikowska give their all."
    },
    {
      "rating": "8",
      "text": "I dont see what the problem is after reading reviews on this site i was expecting a really bad film but i thought it was great i still prefer the first film but this was a good follow up the story was easy to follow and added a little more to the story sort of like Wicked i like the darker side to the Alice In Wonderland story well worth a watch."
    },
    {
      "rating": "3",
      "text": "A family movie with a plot involving the Mad Hatter trying to find his family. Gee, I wonder if he'll find them. The suspense! Seriously though, this is the best you can do, Disney?"
    },
    {
      "rating": "8",
      "text": "-Alice Through the Looking Glass is a 2016 American fantasy adventure film, directed by James Bobin, written by Linda Woolverton, and produced by Tim Burton. It is loosely based on Through the Looking-Glass by Lewis Carroll, and is the sequel to the 2010 film Alice in Wonderland. The film stars Johnny Depp, Anne Hathaway, Mia Wasikowska, Rhys Ifans, Helena Bonham Carter and Sacha Baron Cohen, and features the voices of Alan Rickman, Stephen Fry, Michael Sheen and Timothy Spall.\r -The films tells the story about Alice spending her past few years following her father's footsteps and sailing the high seas, she comes across a magical looking glass that takes her to the fantastical realm of Wonderland and finds that Tarrant Hightopp who is acting madder than usual and wants to discover the truth about his family's survival of the attack of the Jabberwocky. Alice borrows a \"Chronosphere\", a metallic object inside the chamber of the Grand Clock which powers all time. Returning to the past, she comes across friend and enemies at different point of their lives and embarks on a race to save the Hatter before time runs out.\r -The film was released by Walt Disney Pictures on May 27, 2016 and is Rickman's final film role, following his death in January 2016. Upon the release, the film received generally negative reviews from critics.\r --Production:\r -Principal photography began on August 4, 2014, at Shepperton Studios. In August 2014, filming took place in Gloucester Docks which included the use of at least four historic ships: Kathleen and May, Irene, Excelsior and the Earl of Pembroke, the last of which was renamed The Wonder for the filming. Principal photography ended on October 31, 2014.\r --Critical response:\r -Alice Through the Looking Glass has received negative reviews from critics. On Rotten Tomatoes the film has a rating of 29%, based on 148 reviews, with an average rating of 4.5/10. The site's critical consensus reads, \"Alice Through the Looking Glass is just as visually impressive as its predecessor, but that isn't enough to cover for an underwhelming story that fails to live up to its classic characters.\" On Metacritic the film has a score of 34 out of 100, based on 42 critics, indicating \"generally unfavorable reviews\". On CinemaScore, audiences gave the film an average grade of \"A–\" on an A+ to F scale, the same grade earned by its predecessor."
    },
    {
      "rating": "4",
      "text": "After the failings of Burton's rendition of Wonderland I was going into this film expecting to hate it. However I was surprised that it wasn't as bad as I thought it would be. There are some notable improvements over the original film for example Wonderland is actually bright and colorful as opposed to the previous film with a dull color palate. The lead actress actually tries to stay invested this time and gives an attempt to give an emotional performance. Sacha Baron Coen pays as Time and he is fun to watch since he is aware that he is in a mediocre film and decides to just do whatever he wanted with his performance. The same can be applied to Helen Bahm Carter as well. Unfortunately the main problem with the first film is still present in this one. Said problem is that the script tries to add logic to a source material that is supposed to be the absence of logic. When they try to add logic to it, the problems with the film start to show. The time travel was easy to follow but it costed the characterization of the Red Queen since it was reveled that she became a mad tyrant after loosing the crown to her sister. This misses the point of the original source material since the appeal of the character is that she is really a child an adult's body and as a critique on the monarchy of Britain, In this case though the film tries to give her a tragic backstory but it falls flat since it was also revlead that she was responsible for kidnapping the Mad Matter's family and burned his village down. It is considered difficult to sympathize with her since she is responsible for so much death just because of a simple sibling rivalry. The Chesire Cat lost his charm even more when it shows that he is a child hood friend of the Mad Hatter because he was always the trickster character. by giving him an allegiance to his friends it ruins the mystery of the original character. There is a noticeable emphasis on the Mad Hatter due to the fact that he is played by Johnny Depp and is the loner which is present in a lot of Burton's films. Burton may not have directed this film but it does have his blue prints around it. It tries to be dark but it doesn't go far enough like it's predecessor. There is a scene with Alice being in an Asylum which doesn't really go anywhere after Alice escapes making the whole subplot pointless. To the film's credit it tries to have a moral and an admirable one at that which is that time does take away but it also gives and people should value what it gives. The fact that Alice wanted to give up her ship to help her mother get out of dept would have signified her finally letting go of her past but the lesson wasn't ;earned though because her mother rips the contract anyway. In conclusion this film would have been better if was an original family film if it didn't have the likeness of the Lewis Carrol novels."
    },
    {
      "rating": "5",
      "text": "....\rIt was good...it wasn't great or dark or anything that connects with the original book\rIt should be called \"Alice Through the Time\", not \"Alice Through the Looking Glass \"\rAnyway, good visual, good acting, decent writing (a bit confusing), etc\rIf you loved the first one because it was dark, this is more childish, but still it has a good moral"
    },
    {
      "rating": "10",
      "text": "One of the most inspiring movies ! Divine acting, great script iridescent colors, and deserves praise odtdelnoy Sacha Baron Cohen and Joni DEP . Cartoons also tinned praise. Film - Ocean positive . I hope to continue ."
    },
    {
      "rating": "8",
      "text": "What is not to like?  All of my 3 kids who are 8,8, and 9 and my hub and I enjoyed the whole time of the movie.  Whimsical and entertaining.  Not a single boring moment.  It should be if it is aimed at kids and family."
    },
    {
      "rating": "10",
      "text": "Great movie 10/10 gggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggg"
    },
    {
      "rating": "6",
      "text": "Is it perfect. Heck no. Is it okay. Yeah. I mean, the CGI is great, The girl who plays Alice is good, and Sacha Bohen Caron is fantastic! Plus, i like Wonderlands Backstory. But, it has cringe-worthy time puns that make no sense, annnoying side characters, a hateable villan ( Red Queen) and more. It isnt bad, but its not good either. I give Alice Through The looking Glass a 6/10"
    },
    {
      "rating": "4",
      "text": "This was a well put together film but it did not come close to its title material. While I know that movies never follow the book exactly, this movie seemed to be created by sombody who did not even read the book. While the movie was o.k. I belive that they should have given it a title that better fits the movie."
    },
    {
      "rating": "3",
      "text": "This whimsical sequel is rather boring and the plot is full of holes. It is rather bland but if you loved the first one you will like this one.  Johnny Depp reprises his role as The Mad Hatter except this time it is stupider and he isn't really ever happy.  He isn't happy because he found a piece of his hat that was ruined and he decided that  because of finding a small piece of his hat that he wanted his family back.  Alice somehow does not agree and then when the Hatter becomes upset she agrees.  In order to get his family back Alice must defeat Time played by Sacha Baron Cohen.  Time is the best part of the movie and he is still pretty annoying.  Alan Rickman reprises his role so since he's dead this may make you want to see the movie.\rOverall, a bland/boring film not directed by Tim Burton."
    },
    {
      "rating": "3",
      "text": "This movie was pretty looking. Sometimes. On every other aspect, the movie was very bad. This universe has the potential of developing something special but instead aims at the lowest common denominator.\r Bland characters, bland story, go read a book."
    }
  ]
}