{
  "id": 1376,
  "title": "Alice in Wonderland",
  "starring": [
    "Mia Wasikowska",
    "Johnny Depp"
  ],
  "runtime": 108,
  "genre": [
    "Family",
    "Fantasy",
    "Adventure"
  ],
  "description": "Alice, now 19 years old, returns to the whimsical world she first entered as a child and embarks on a journey to discover her true destiny.",
  "releaseYear": "2010",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/o0kre9wRCZz3jjSjaru7QU0UtFz.jpg",
  "categories": {
    "plot": 4.096774193548387,
    "acting": 5.222222222222222,
    "ending": 5.4,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 4.444444444444445,
    "funny": 6.5,
    "action": 6.0
  },
  "reviews": [
    {
      "rating": "3",
      "text": "Wow...extremely disappointed...and the 3D seemed a little off but i dont consider that part of the movie....watch it anyway though. worth watching i guess."
    },
    {
      "rating": "1",
      "text": "Wow, getting really creative now aren't we Mr. Burton? Every movie you make is 90% finished before you even start, because you basically use the same people, same music, same sets, same everything, then pour 10% of the actual story in. Everything he touches turns to shit. Poor Alice, poor Mr. Carroll, and poor anyone who sees this steaming pile."
    },
    {
      "rating": "7",
      "text": "Although this movie comes across in the end as commercial and highly predictable, there is a consistent intrigue about the development of the neo-Wonderland that is more then refreshing. Those who find its characters forward and lacking zest to a new audience are forgetting that the last handful of generations grew up knowing every aspect of the main performers. Essentially Wonderland has become antiquated, and the fact that Burton and company could make them jovial and truly real in a way previous movies could not; resolves as a testament to their workmanship and vision. However, less make up Johnny."
    },
    {
      "rating": "3",
      "text": "If it hadn't been an adaptation I might have enjoyed it but instead we have Lewis Carrol's brilliant nonsense literature turned into just another Narnia rip off. It does have some good Burton moments and Johnny Depp is amazing in it."
    },
    {
      "rating": "6",
      "text": "It's anarchy on Victorian literature; anarchy in the 19th century U.K. This latest version of \"Alice in Wonderland\" wants to make a feminist hero out of the Lewis Carroll heroine. According to the oraculum, she's Alice the Jabberwocky Slayer. This time around, Prophecy Girl is not here just to have tea. This special effects-driven film shares with Steven Spielberg's \"Hook\" the not altogether unappealing gimmick of an adult who returns to the fantastical realm that he/she haunted as a child. Alice was at the scene of the crime; the day that the Red Queen(Helena Bonham Carter) bombed the White Queen's court, in which the Hatter(Johnny Depp) went mad as he walked among the burning ruins. (The PG rating precludes the presence of royal court casualties.) As a young child, Alice suffered from nightmares and would ask her father about the state of her mental health. Too bad the calibration is all off on Alice's character; too bad she wasn't truly mad, somebody who would wake up screaming all throughout her life. This childhood trauma(that the film never addresses) has no effect on her as an adult. She seems fine in the carriage with her mother, en route to a garden party. It's him, not her, when Alice runs away from a formal marriage proposal at the gazebo, conducted in front of their friends and family. It should be the other way around. For commercial purposes, Alice is given no character arc. She enters, then emerges from Wonderland without any discernible changes. Her \"Lord of the Rings\" adventure could have been more rousing if she arrived in the shire, I mean Wonderland, as the Mad Debutante who ditched an Edward Ferrars-like bridegroom, and not the prig that Alice detests. Even Jane Austen's women got married. Set in the Victorian period, \"Alice in Wonderland\" should end with a wedding, not with the actions of a suffragette. This film has no sense and sensibility for its time and place."
    },
    {
      "rating": "7",
      "text": "I submit reviews and ratings on 12 different sites, and for some reason this site is always way low on it's ratings. I don't get it! Another site that has an average of critic ratings quite similar to Metacritic must have happier critics in their database. Alice in Wonderland has never been one of my favorite stories, and although Tim Burton doesn"
    },
    {
      "rating": "6",
      "text": "It is a perfectly acceptable film, but I couldn't escape the feeling that so much more could have been done with such potent material. This is, after all, Tim Burton doing Alice in Wonderland! Why wasn't I blown away?"
    },
    {
      "rating": "7",
      "text": "Decent AdaptationThough it has it's flaws, Tim Burton’s Alice In Wonderland still is visually beautiful, has great performances (Especially Depp, Carter, Fry, and the late Alan Rickman) and a great score by Danny Elfman."
    },
    {
      "rating": "9",
      "text": "I really thought I was going to dislike this movie. However, I was surprised by how much I liked it. Johnny Depp was excellent as the Mad Hatter. Although, my only complaint was that Christopher Lee was really underused. I wish I could hear him speak more lines as the Jabberwocky."
    },
    {
      "rating": "6",
      "text": "If you expected a controversial movie form Burton, \"Alice in Wonderland\" is not what you expect. However, the eerie creativity and fantastic visuals might delight you for the moment."
    },
    {
      "rating": "9",
      "text": "Going into the film with very little expectations, I was very pleasantly surprised! The acting was really good, especially by the lead actress and Helena Bonham Carter... Anne Hathaway was somewhat annoying, but that's just because of the nature of her character - all bubbly and ... annoying. Ha.Anyway, visually, though, the film is just breath-taking and it definitely projects the magic that should be present in an adaptation of \"Alice in Wonderland.\" It definitely feels like a magical world and it is a very entertaining film!One of Burton's better efforts, for sure!"
    },
    {
      "rating": "3",
      "text": "All style very little substance.  Tim Burton has a tendency to do this, the visuals look amazing, but unfortunately the story lacks entertainment.  Plus as good as Johnny Depp is he's just kind of annoying here."
    },
    {
      "rating": "8",
      "text": "This is a brilliant take on the classic \"Alice\" story, with good acting, good characters, and the only real flaw being the over-the-top \"Lord of the Rings\" style climax. Well done, Tim Burton, and can't wait for the sequel!"
    },
    {
      "rating": "7",
      "text": "While it was light on plot and character development, Alice in Wonderland was a visual delight-perhaps the best ever created by Tim Burton.  It's not amazing.  But for those who haven't seen it, I recommend you give it a chance, and tumble down the rabbit hole with Alice.  A 7.5/10."
    },
    {
      "rating": "9",
      "text": "Tim Burton directs a ton of  heart and adventure into this adaptation which makes it great, but he also skillfully  directs one of the most important details of the story into the movie the wackiness. He also has impressive performances especially Johnny Depp and newcomer Mia Wasikowska. Some cool action and just amazing visual effects. I give this film 92%."
    },
    {
      "rating": "2",
      "text": "Terrible! Awful! Hideous! Johnny Depp ruined his career for starring as the Mad Hatter! The plot from the 1951 animated version (the one we all know and love) was massacred! And Alice wasn't even listed as the main character! For some reason, the Mad Hatter was. It's ALICE'S adventure in Wonderland! Not his! This is truly a disgrace to the \"Wonderland series\"."
    },
    {
      "rating": "4",
      "text": "The positive of this film is how visually appealing it is, however because it came out roughly around the time of Avatar, it becomes a second rate fantasy flick. Combining this and the messiness of the screenplay creates rather a disappointing film."
    },
    {
      "rating": "0",
      "text": "Would someone tell Tim Burton this story is based on a book! I do not expect a movie to be 100% loyal to the book, but he just threw it out the window! What a waste of a great actor."
    },
    {
      "rating": "3",
      "text": "Another classic story that Tim Burton messes up by making it dark, don't get me wrong I've always wanted to see the story of Alice in Wonderland in a more mature setting about her sanity slipping, but it doesn't do that it just tries to make it an action movie with a darker tone, but fails because it doesn't make any sense, the reason I didn't enjoy it is because they have the setting, but they don't have the all characters as they should, I only like one character and that was not enough to save the movie from failure."
    },
    {
      "rating": "0",
      "text": "Stop ruining Disney classics already and stop using Depp in everything. What is the obsession with the guy? Sure he was great in Pirates of the Caribbean but Mad Hatter? Give us a break. Should never have been made into a live action movie. Actually, Terry Gilliam should have been the one to have done it. Tim Burton just doesn't have it anymore in my opinion."
    },
    {
      "rating": "2",
      "text": "A wreck that both Disney and Burton should be ashamed of. To take a literary classic and attempt to create an unnecessary new eerier world out of Wonderland is abysmal."
    },
    {
      "rating": "3",
      "text": "this movie was just so boring!!! the story, the characters , a total waste of my money!!! the \"3D\" is just added there to make more money because people expect it to be amazing but it was not!!!! i really regret seeing this!!"
    },
    {
      "rating": "9",
      "text": "A fantastic movie for all ages. Full of funs, fantasies, mysteries and all. It has the element to attract people. I'm very proud to Mia Wasikowska, she does a great act for this. The Red Queen is very funny. I don't get the character of the Mad Hatter who is played by Johnny Depp so i will minus the perfect points for this movie."
    },
    {
      "rating": "1",
      "text": "Just one word: Boring. It is just so boring and it isn't good in any sense, not the characters not the story, nothing. Apparently Burton was just given a bunch of money and decided not to focus on the story or the characters or giving an inventive view on the wonderful book this movie is based on, and just spent it  on the special effects which are just ok. Terrible movie can't believe it's nominated for a golden globe."
    },
    {
      "rating": "3",
      "text": "This really doesn't deserve to be called Alice in Wonderland."
    },
    {
      "rating": "0",
      "text": "The WORST movie of 2010. Its a horrible sequel to a so-so movie. CGI is bad, 3D was atrocious, i was bored and I was just sitting there waiting for it to end."
    },
    {
      "rating": "10",
      "text": "The point of an adaptation is to create your OWN vision, while sticking true to the important elements, of the original story. Tim Burton has done just that, and beautifully. Not my FAVORITE adaptation of \"Alice's Adventures in Wonderland\", but it's up there, and is certainly a memorable experience. In IMAX 3-D, it truly blows you away (especially the rabbit hole scene; GENIUS!)"
    },
    {
      "rating": "5",
      "text": "5 out of 10. Just average. Actually average movies suck because they are not worth my time. Avoid this one."
    },
    {
      "rating": "10",
      "text": "the way Avril Lavigne did the song Alice was the only reason why this movie was such a big hit from Tim Burton. take my advice: go and see it."
    },
    {
      "rating": "8",
      "text": "Visually stunning and an epic story. Maybe a little too epic as the film seems to spend to little time on too many characters. But Burton and company bring them to life and make every bit of Wonderland as real as can be. Must see in IMAX 3D."
    },
    {
      "rating": "10",
      "text": "This movie was amazing. Everything about it draws you in and keeps you there. You dont want it to end."
    },
    {
      "rating": "7",
      "text": "I loved this movie and I don't care what people think! This was a great movie, the style, and atmosphere created was dark and at the same time pretty. I specially loved the queen. This movie is simple fun with a very pretty art style."
    },
    {
      "rating": "4",
      "text": "A very odd and unique film. I'm almost disappointed that I didn't see this in 3D. Which is the only reason why anyone should watch this. This film was very, very, very fast paced. It will also go on my list of Tim Burton's worst. A word of advice to Tim, stick to stop motion. Although, the best aspect of the film is the costume design. Especially Alice's red dress. It's a no drainer that this won for Best Achievement in Costume Design at Oscars. The next great thing about this film is the effects. Loved the part when Alice falls down the rabbit hole. With a stunning performance by Johnny Depp and the rest of the cast the acting was decent. There was a nice feel to the acting. There personalities where spot on, especially the Red Queen.To break it down, I recommend this movie to people that get board with good movies and love fashion."
    },
    {
      "rating": "3",
      "text": "Here's what's wrong with Alice in Wonderland: it doesn't want to be Alice in Wonderland. It wants to be Narnia. The Dormouse's overhaul into a feisty fencer alone is clue enough, as if everything else weren't already screaming it at you through a megaphone. The problem is that it isn't Narnia, shouldn't be Narnia, and isn't nearly as good at being Narnia as Narnia. Johnny Depp is more annoying in this film than he has ever been before, creating a Mad Hatter who is just confusing instead of remotely endearing, and every other character is roughly him in miniature in this respect. It's not even the good, bewildering kind of confusing that you would expect from the source material: it's just the bad, boring kind of confusing that suggests the filmmakers didn't do their homework, didn't try to create a character with a meaningful identity, and didn't try to make sure their characters had actual purpose and plot relevance. The March Hare is reduced to a one-note side joke. The Dormouse has been marginally elevated...into a slightly DIFFERENT one-note side joke from the one in the book, with slightly more screen time (this time, the joke is that the Dormouse is a Reepicheep clone! HOW WONDERFUL!). The Mad Hatter is the only character from the tea party that seems to matter, but he's just annoying. The Tweedle twins are simply dull and underused instead of funny in any way. The White Rabbit is instantly forgettable, and you'll forget him every time you see him. Anne Hathaway, as the White Queen, hints at interesting character elements...that you will never ever see. Helena Bonham Carter is forced into a heartbreakingly shallow role as the Red Queen that everyone knows she is far too good for.\r The only actors with roles that seemed to fit well were Crispin Glover as the Red Knave (and a chilling one at that; Glover, for all the notoriety he gained on Letterman, gets into his characters with an astonishing intensity, even in flops like this), Stephen Fry as the Cheshire Cat (because he seems to be perfect at everything he does), Alan Rickman as Absolem the Caterpillar (stupid though the name may be, Rickman's voice work is better than anyone could have ever expected, and he brings exactly the right note of condescending mystery that the caterpillar needs to have), and Christopher Lee as the Jabberwock (only two lines, but spoken SO WELL).\r None of this is enough to save the movie from the fact that it doesn't want to be what it claims to be. It can never, ever escape this. The Alice trappings are just sort of \"there\", dangling around it, because it's clear to anyone with eyes that this movie began development after Disney bailed on the Chronicles of Narnia films so it wouldn't have to split the take with Walden Media, as an alternative to Voyage of the Dawn Treader.\r Lewis Carroll would probably be disgusted."
    },
    {
      "rating": "4",
      "text": "This re boot of alice in wonderland is so unnecessary turning a fun story into a boring war filled political thriller with no soul and no sense of enjoyment."
    },
    {
      "rating": "3",
      "text": "This movie was just awful! I went in with high expectations and expecting a similar story to the book but they tried to do something different and it didn't work. Only thing good about the movie was the 3D."
    },
    {
      "rating": "10",
      "text": "A brilliant masterpiece, what you have to realise is that this was nit meant as a follow up, but a re-envisioning of wonderland."
    },
    {
      "rating": "7",
      "text": "The current version of Alice in Wonderland exhibited a notable effort however the film fell short of in comparison an anticipation of the original psychological version that engaged the abstract of society."
    },
    {
      "rating": "2",
      "text": "Few moments and nice visuals, but slow and not all the great for me. The movie lost the charm of the non-sensical nature of the book."
    },
    {
      "rating": "10",
      "text": "A wonderful film. The humor was excellent and was was a visual delight. Johnny Depp as the Mad Hatter was perfect and the crazy hare was intensley insaaaaaaaaane! Whatever the name of the dance the Mad Hatter did was fantastical.....our recommendation is \"Don't be late!\"."
    },
    {
      "rating": "4",
      "text": "I was generally fascinated by the animation, but the movie seemed to be incredibly predictable which led me to lose interest."
    },
    {
      "rating": "9",
      "text": "It is a fun, exciting, visually spectacular film!! I will see it at least once more while in theaters, as well as buy the DVD when released. One small curiosity, is it me or is the sound quality poor?"
    },
    {
      "rating": "9",
      "text": "I really enjoyed this movie, and I'm born a crtic so I don't say that often. It was the exciting action/adventure that I had been waiting for. It was fun to watch and, excluding Ann Hathaway, the actors did an amazing job conveying the history behind the characters without the use of cheesy flashbacks. Ann Hathaway's performance was terrible and she was one of the few setbacks to this movie. My only other complaint is that the ending was a little rushed and underexplained. However, this was an awesome movie and I recommend everyone to see it."
    },
    {
      "rating": "10",
      "text": "When Burton misses - he misses, but when he hits... he hits it out of the park! I watched this film (non-3D version) with my jaw dropped open... I knew I was watching a true work of art. The more it unfolded, the more it became obvious it is a masterpiece. Fantasy fiction at its ABSOLUTE best! I was so lost in the land he created - the story was icing on this visual dessert - it didn't matter. And as for Johnny Depp - Has won me back..! He is a true master of the art of acting. Now I can't imagine the Mad Hatter any other way. Johnny & Tim forever."
    },
    {
      "rating": "5",
      "text": "Visually inventive, but emotionally uninvolving. Ends up a kind of \"Alice of Arc\". Bleah."
    },
    {
      "rating": "3",
      "text": "No disrespect to Tim Burton or Johnny Depp coz I love them but honestly... if you watch the movie up to the part where they first show you that scroll/calendar thing (in the first 20 minutes of the movie) then you will now know the rest of the movie. The ending was dissapointing. As one of the critics said and he was completely correct, \"The biggest suprise about Alice in Wonderland was the lack of suprise\"."
    },
    {
      "rating": "7",
      "text": "Was it better than I expected? No. However, it was pretty good, and it had great 3D effects."
    },
    {
      "rating": "2",
      "text": "Ugh. I ended up taking a phone call halfway through and used the film as a visual backdrop for my phone conversation with the volume down because I could not care less what the end result ended up being. What a snooze fest. Don't Tim, Helena and Johnny ever get sick of one another because I'm sick of watching them play out the same characters over and over in film after film."
    },
    {
      "rating": "6",
      "text": "A wonderful start...but just a ridiculous ending. From the time Alice puts on her armor till the credits roll there's not a minute's worth of the madness and charm that made the rest of the film work. In Burton's filmography this picture falls somewhere between Mars Attacks and Sleepy Hollow. Still waiting for another Ed Wood."
    },
    {
      "rating": "8",
      "text": "I thought this was a really entertaining, quirky and colourful movie. Don't understand the low scores here."
    }
  ]
}