{"id": 2100, "title": "Alien Resurrection", "starring": ["Sigourney Weaver", "Winona Ryder"], "runtime": 109, "genre": ["Science Fiction", "Horror", "Action"], "description": "Two hundred years after Lt. Ripley died, a group of scientists clone her, hoping to breed the ultimate weapon. But the new Ripley is full of surprises … as are the new aliens. Ripley must team with a band of smugglers to keep the creatures from reaching Earth.", "releaseYear": "1997", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/9aRDMlU5Zwpysilm0WCWzU2PCFv.jpg", "categories": {"plot": 5.27906976744186, "acting": 4.714285714285714, "ending": 4.944444444444445, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 3.0, "funny": 4.375, "action": 6.0588235294117645}, "reviews": [{"rating": "3", "text": "This movie is hugely over rated. A huge disappointment to fans like me. A just can't really think of many redeeming features about this film! Most of the characters are all stereotypes and this movie has one of the most distasteful attempts at humor ever in it: \"I say we ditch the cripple\" If you haven't guessed by that then most of the dialogue is pretty awful. At least the acting was decent."}, {"rating": "3", "text": "Ever since Alien 3, I was hoping for an Alien film that would be better than 3. Instead, I got an Alien film that betrays the entire franchise. I prefer watching Alien 3 over this garbage!"}, {"rating": "6", "text": "To be fair, Alien 3 was too bad to end the franchise on, and out of what looks like an improvised storyline as a way to make up for Fincher's calamity, this is not bad at all, a LOT better than Alien 3. The story was here and there, not the best but not the worst and it was certainly believable. The characters weren't brilliant I was disappointed with Ryders' character and Ripley was somewhat interesting apart from that OK. The directing was a hell of a lot better than Fincher's, although that's not a difficulty. Special effects were brilliant compared to Alien 3, somehow not as good as the first two a saw a few iffy shots and aliens from a distance looked like tigers with paint on them but up-close: intimidating. Overall, compared to Alien 3 this was a good way to finish the story (unless another film is made after the prequels) and the only thing stopping me from scoring 7 was the human/alien's death and Ripley's pure weirdness. -----By no means overly gross and not AMAZING but better than a lot of films I can think of."}, {"rating": "4", "text": "All the fears we learnt from the first films have been completely wiped with this abysmal attempt at an Alien movie. If only there was some narrative significance, some fear to terrorise the screen or some philosophy relating to sexuality. Instead we are watching a visual representation of a theme park ride. Fortunately theme park rides are over very quickly. This isn't...and being forced to watch would be almost torturous. 43/100"}, {"rating": "3", "text": "Alien Resurrection is abysmal. The 3rd Alien film ended with Ripley making the greatest sacrifice to ensure that the Xenomorph's could no longer be of threat to the human race. Now a good 200 or so years later a Ripley clone has been created by the Weyland corporation from skin tissue found at the scene of her death. They breed a queen Xeno inside her and all hell breaks loose. This film was not needed and the CGI isn't very good, the acting is comical and poor even by Weaver in the lead role and is a film that should be avoided, even by Alien fans."}, {"rating": "1", "text": "If you are a fan of the first 3 movies then you will most likely want to avoid this pile of trash. Even as a popcorn movie it fails to impress as it is a uninteresting gore fest which insults its predecessors."}, {"rating": "3", "text": "This movie is a mistake, it has completely lost the the same goals and feel of the first 3. It's no longer the gripping Sci-Fi Horror that the previous movies were, it's now a joke and a bit of a gimmick, it honestly should've stopped at the 3rd or this should've have been better written. I'm mainly giving it such a low score simply because it completely killed the legendary series it once was."}, {"rating": "0", "text": "An abomination of a movie, for me it's on a par with the AvP drivel that followed it. I watched it when it first came out and as a 13 years old who had grown up with Alien and Aliens especially, I instantly recognized how terrible this movie is in every single aspect in regards to the franchise as a whole, it captured nothing of the atmosphere from it's predecessors, some poor casting selections, some really shoddy acting even from Sigouney. The most infuriating part for me was the captain with the hairy shoulders getting smashed in the back of the head by the aliens retractable jaw, then with a constipated look on his face proceeds to pull out a piece of his brain, stare at it for a moment before crumple to the ground, it was totally ridiculous. Granted it had some tidy special effect work going for it but not even that can redeem it in any way in my eyes, I saw it as the biggest betrayal to the franchise, bland and uninspiring, it missed the point that made it's predecessors good in my eyes and when I say predecessors I also count Alien 3 the DC edition because that was actually a great watch. I own the quadrilogy on blu ray and this is the one disc that has no signs of use, because it hasn't been used and never will, I find it offensive and would never waste my time watching it again, I prefer to pretend it doesn't exist from now on."}, {"rating": "3", "text": "Ripley cloned, Aliens being bred, hired mercenaries get involved, Aliens break loose, you know the rest....The final part of the Alien Quadrilogy & it is a bit of a damp squib. Appalling dialogue, especially from Ripley with some truly dreadful acting by Sigourney Weaver to match.The Aliens have evolved into a cross breed of a bull and a Velociraptor but, as in the 3rd film, just don't seem as scary. Much more graphic than the other films too but less on the suspense.It's a shame they ended the franchise (although a prequel to Alien is being discussed) with this awful film after all the good work from the other three."}, {"rating": "4", "text": "\"Aliens: Resurrection\" is a terrible movie filled with nothing but pessimism. Its a film that will make you grim and moody in a happy sunny day."}, {"rating": "7", "text": "After seeing Alien 3, I thought that the Alien franchise was running out of new ideas and Alien Resurrection seems to recycle the same plotline from previous Alien movies but I still enjoyed watching it. The Aliens are back in this movie (don't know why this movie is called Alien Resurrection since there's more than one Alien again. Should be called Aliens Resurrection) and they seem to have the same motive as before: breed, prey on humans and make everyone's lives a little bit more uncomfortable. Having Aliens in the movie rather than one Alien does make the movie a little bit more exciting but doesn't really produce any scares, due to the fact I've seen these monsters in 3 movies although they still look gruesome. The movie takes place straight after Alien 3 where scientists attempt to clone Ripley and extract the Alien Queen inside her. This movie has got to be the most disturbing in the series and seeing the sleeping naked Ripley clone inside a glass tube was creepy if a little bit sexy. Just looking at the scene where Ripley and the mercenaries discover the failed attempts to clone Ripley in glass chambers and one clone lying on the table, with a deformed body saying \"kill me\" in a desperate voice. I cringed a little bit but thank god the other not so grotesque main Ripley clone torches the room with a flamethrower. The Alien queen makes a return and just serves the same purpose as in Aliens: She produces eggs which then spit out facehuggers and, you know the story. This movie's plot is a bit predictable: the human gets hugged by a facehugger and then an Alien hatches and kills everyone in sight thing, has been done 3 times. I thought the story was fine and it was enjoyable to see the Aliens again attacking in large numbers and the mercenaries fighting them off rather than another plot like the 1st and the 3rd Alien movies. The movie really gets going straight away, as soon as the Alien queen was extracted from Ripley; you don't really have to wait long until the whole terror of the Alien swarm start to engulf the screen and start attacking our heroes. The effects in the underwater scene where the Alien swims underwater and tries to catch up with his prey were quite good. Where Alien Resurrection is set is natural for an Alien film but it's a bit repetitive. It even recycles a bit of the plotline from the first movie where Call (another android like Bishop from Aliens and Alien 3) sets the spaceship on a collision course to Earth, much like the spaceship in Alien that was set to blow up to stop the Alien from escaping. I thought the acting was good - I enjoyed seeing Ron Perlman playing a bad tempered mercenary, having seen him first in Hellboy. Ripley played once again by Sigourney Weaver was a little bit less of a heroine in this one than in Aliens since she has a link with the Aliens. She now has enhanced strength, acidic blood and can smell an Alien from a mile away and can even tell if a human has an Alien inside him or her. She seems to accept that she now has a link with the Aliens produced and theoretically, she is their mother because she gave birth to their queen: She even says to an Alien host, Pervis, \"I'm the monsters mother\" while slightly grinning. This movie does inject some originality into its Alien character design with the introduction of the Alien/Human hybrid which is what you get if you give an Alien queen a female humans womb, then let it give birth. This Alien/Human hybrid looks like a white ape and doesn't kill anyone except for its mother, due to the fact that Ripley is the \"proper\" mother of the Aliens. This movie just like the previous movies is gory; the scene where the Alien/Hybrid gets sucked out of the ship through a tiny hole in the ship is especially gory. He has very little screen time so I didn't really see why they put him in it. This is not a suspenseful, horror movie like Alien and Alien 3. I have to compare this movie to Aliens due to the fact that there is more than one Alien again unlike Alien and Alien 3 but there is nowhere near as much action in this movie than there was in Aliens but at least there is some action with the mercenaries and the Aliens. I still prefer Aliens because it had a better plot but I really have to confess this: I think this is the 2nd best movie in the franchise, beating Alien by a fraction. I just thought it was a little bit more exciting and a lot more was happening to keep me entertained rather than just waiting for something to happen in Alien but do not think for one second that I don't like Alien because I do. Alien Resurrection's ending wasn't that good: Ripley has a standoff with the Alien/Human hybrid and then the Alien/Human hybrid gets sucked out of the spaceship through a tiny hole and then Ripley and Call land on Earth. The ending isn't as good as the previous Alien movies. Alien Resurrection was a satisfying movie to watch and tied up the Alien storyline nicely."}, {"rating": "7", "text": "was this sequel was unnecessary? yes. unenjoyable? no. if your like me you thought Alien 3 had the perfect ending to the series, and left little room to debate that it's at least Ripley's last chapter in the story, but they found away to not just  continue the series, but bring Ripley back into the action, it's just a shame that it's not the same Ripley we all remember, the Alien series was never scary but always had a creepy atmosphere this movie completely ditches that atmosphere for a more action movie feel, I was surprised at how much I actually like this movie however, it's still satisfying to see a Xenomorph impale a person, and it really shows how smar the Xenomorphs actually are, if you can forgive the new Ripley's personality, and one or two lame characters (Call is the worst character in any Alien movie to date), and some plot holes, you still have a pretty good movie, but it's by far the weakest entry in the series."}, {"rating": "1", "text": "Stupid and gross. Not worth the time."}, {"rating": "3", "text": "Alien & Aliens were outright classics. Alien 3 was pretty average. This is just plain bad... Which is a shame, because the first half hour is ace, as is the films highlight scene of the aliens underwater / ladder battle."}, {"rating": "7", "text": "Alien 3 was so bad that they had to resurrect Ripley and the alien to give the series a worthy ending, and this definetely accomplishes that - although it lacks the phenomenal final battle that the first 2 had."}, {"rating": "9", "text": "I dont understand why people are giving this negative reviews. It made have had a cliche storyline but it had more action than Alien 3. I found this movie very entertaining. Ripelys personality isn't much since she's been cloned, and since she was dead already which makes sense. I also like some of the creativity the creativity of Ripelys blood."}, {"rating": "4", "text": "Better than Alien 3, yes, but still an ill-contrived movie and a really weird and bizarre movie, at that. It feels like it's trying to hone back to \"Aliens\", but all it's doing is being a trashy space movie with no signs of visiblity that has a $70 million budget, compared to Aliens, which had ten times the brilliance this movie has, in a mere $18 million budget. The later Alien films do feel like dirty secrets to well-crafted filmmakers, particularly directed to David Fincher (who directed Alien 3) and Joss Whedon (who wrote the screenplay to this \"movie\")."}, {"rating": "8", "text": "I liked this fourth installment in the alien franchise. It wasn't scarier than the other alien films, but then again none of them is really scary, they are just great si/fi action films. I don't get why some people don't like this film, yes it is similar to the other alien films, but would you like it if it wasn't?"}, {"rating": "8", "text": "Resurrection the final chapter of Alien somewhat redeems itself, with a solid conclusion to the series. The still many unanswered questions left for self interpretation and story line plot holes however have not improved. Sigourney Weaver easily takes the best performance with her excellent lines and down right perfect acting. Resurrection saves the series from the down hill alien 3 and satisfies fans. Alien is still your go to Si-Fi Blockbuster!"}, {"rating": "6", "text": "Critics have ruined it!!!! Resurrection rocks!!!! Not as good as Alien but it still make sense and it's watchable and entertaining!!! Watch it!!!!!!!!"}, {"rating": "0", "text": "Over all really boring movie only watched ot because its part of alien series. I think 3rd one was bad so I didnt expect anything from this. Movie has some major holes in plot and I just didnt get like half of it. Why did they have to dive in the water. Im sure there would be other ways its huge ship. Secondly why didnt they kill that one guy they knew he was going to die when he had alien inside him. Only good part of movie was the end because  it ended. They could have made resurrection much better if they would have spent more time with it. Also that human/alien fusion think was horrible and ugly."}, {"rating": "2", "text": "How does this waste of celluloid have a better rating than Alien 3?  While it may have more action to it than its predecessor, Alien: Resurrection does to the franchise what the '90's Godzilla did to that one.  Performances are comedically hollow, starting with Wynona Rider whose entrance into the film series seems to be an attempt to pass the lead role of Sigourney Weaver to her.  Instead, Weaver's passable performance only serves to further juxtapose how utterly dreadful all the rest are.  While the Alien looks good, probably better than it ever has, the script and performances give this whole movie a Sci-Fi Channel original film.  I only hope for a new Alien film to wash the ugly aftertaste of this one away."}, {"rating": "5", "text": "Alien Resurrection is a purely production project, the franchise clearly did not need it. Already 3 part was average in quality, and 4 part has already moved to the B-segment. The plot here is even more terrible than in 3 part, the strangers themselves look generally helpless. The main characters of the team do not evolve in any way as the plot develops. The ending is delusional. And only Sigourney Weaver again played a great role."}, {"rating": "3", "text": "So there's the critics who love this film, and then there's people like Dalek all like \"I don't understand why people are giving this negative reviews.\" STFU idiot.Here's why I think this film sucks. Joss Whedon's annoying one liners are thrown into the film and they ruin the tone. Hell, Ripley says a bunch of these one liners and the realistic side of her is gone. There's goofy characters who are so f**king irritating, the CGI is not that good, the new group of characters are boring, besides Call, and there's a lot of weird moments where characters are face touching each other.So I guess critics don't care about the tone in films, and I guess Dalek is an ignorant dumba**."}, {"rating": "0", "text": "Não tive condições de terminar o filme...Eu já tinha expectativas baixas, por conta do terceiro filme, mas eu juro que ainda havia alguma esperança. O premissa d filme já levou tudo aguá a baixo. Eu sei que o único objetivo aqui é dinheiro - pobre seja essa franquia que foi sugada até o fim -, mas reviver Ripley? E ainda com a Alien mãe dentro? Serio???A unica coisa que tinha permanecido foi um pouco da personalidade da Ripley, que dessa vez se perdeu por completa já no primeiro ato, com a desculpa de que os genes haviam sofrido uma mutação e agora era seria, basicamente, metade alien. Sem ofensas, mas uma criança pensaria numa ideia dessas. As suas expressões faciais e atitudes são dignas de piada, fazendo até crepúsculo soar serio.Os personagens não são carismáticos, e já que o desenvolvimento não funciona, temos um show de tédio a nossa frente. A fotografia se dá uma liberdade muito grande para o gênero, com planos fechados e rápidos. A cena do Alien congelando com guarda com a \"segunda boca\" é hilaria, e se não se tratasse de um filme de terror/ação, seria até engraçada de verdade."}, {"rating": "8", "text": "Alien: Resurrection has caught quite a bit of what I see, and I think undeservedly. Personally, I liked the film and unfortunately yes, it is not better than Alien or even Aliens, but for me it even surpasses Alien 3 and overall it is an amazing film for me, which I can recommend."}, {"rating": "6", "text": "A one-off goofy, campy, B-movie comic book throw-away Alien universe film. One last ride but knowing full well the Ripley saga was truly wrapped up in the last one. Again though, as is the case with this franchise, this film has its own personality, look, feel and genre to call its own.Ripley is a superhero now, and she's explained as emotionally autistic so as to not question why she's so benign the whole film (it's clear Whedon knew not to have her slinging quips the whole film, but he didn't know what else to do with her so he turned her into a superhero, surprise). Whedon apparently complained about the delivery of his lines in this film but I don't know. I think most of the actors are game and his dialogue is just OK.The bigger problems are the lazy plotting (really, 200 years in the future the company still wants an Alien and they still weren't prepared for acid blood? or had a contingency plan in place...) and the lack of characterization of Ripley. There's nowhere else to take her. The only interesting thread involves Ripley kind of becoming an Alien queen at the end (there's mention of cross hybrid DNA) but this an end game play and it's interesting, it's just too bad it doesn't take up more room in the overall film.Jeunet is not suspense generator, nightmare-maker, or an action stager. He has some pretty sets, and does well with the beautiful Alien special effects (not the CGI though, shudder). The only indelible image in the whole thing is the final shot of the new white Alien thing getting sucked out of a tiny hole. That looks painful, and it's harrowing to watch - notice that Ripley is almost crying seeing it. It's almost like the film made Ripley a mom again only to have her rip it away from herself, but I'm not entirely sure the film understood that, or knew what to do with it."}, {"rating": "6", "text": "Alien: Resurrection has some great memorable scenes (underwater aliens! chestbuster meets head!) and is ultimately quite an entertaining monster movie. That said, however, it's \"let's walk from A to B and escape\" style plot does nothing for the franchise as a whole, and there are more than enough misfiring moments to drag the whole package down to 'inconsequential'. Alien: Resurrection is not a bad film but it's nowhere near great either."}, {"rating": "4", "text": "The only real praise I can give the fourth instalment in the Alien series is that after re-watching it, it's not quite as bad as I remembered it. It's not quite a bad film, but is incredibly mediocre, with lazy plotting, a sub-par script (from the usually immaculate Joss Whedon) and paper-thin characters. The aliens look better than they ever have, however, and Dominique Pinon and Ron Perlman give good performances, along with some first-class hamming from Brad Dourif. Director Jean-Pierre Jeunet's usual post-apocalyptic steampunk aesthetic style should be well-suited to the Alien universe, but though it's striking, it sometimes comes across as a poor imitation of the work of Terry Gilliam or series mastermind Ridley Scott. Tragically, for the first time in the series, Sigourney Weaver looks bored, the passion for the role as Ripley having completely left her eyes, likely due to the ridiculousness of the character's resurrection in this film. Winona Ryder is also pretty awful, woodenly delivering her dialogue and unable to convey any kind of emotion, and the predictable twist involving her character does not make up for this lacklustre performance. Resurrection commits its worst atrocities in the final ten minutes, which are truly moronic, and succeeds only in completely castrating the alien threat and removing all menace and jeopardy. While a couple of scenes work (the sequence where multiple aliens hunt down survivors underwater is thrilling, and Ripley's shocking discovery in an abandoned science lab is an effective moment of pathos), a criminal amount of the film's runtime feels like it has been copied from earlier Alien instalments, or pasted from other unfinished projects - a telltale sign of Resurrection's troubled production. With such talent behind a project like this, the final film should be much better, but at least it provided Whedon with inspiration for a far more satisfying future project - the uninspiring rag-tag crew of space pirates we follow in this film were developed into the wonderful cast of characters in Firefly, and that is something to be truly thankful for."}, {"rating": "3", "text": "Alien: Resurrection looks like something Joel Schumacher would make with all the style and and no soul. The more Alien movies they make, the worse they get."}, {"rating": "2", "text": "About every bad horror movie trope is on display here, and while there are 11 million reasons why Sigourney Weaver did this movie, there isn't a single good reason beyond that. Joss Whedon gets some blame too, as this plot is literally no better than if any random fan of the franchise were given 30 minutes to come up with a plot. Alien-kill porn nearly begat ACTUAL Alien porn, and we are all the worse for it. This movie is riddled we people who have never existed, in situations that would never happen, saying things no one would ever say. Maybe movie reviewers expected this dreck in the 90's, because I see no reason whatsoever anyone with even the least critical eye could consider this movie good."}, {"rating": "7", "text": "It's easy to understand why so numerous fans are hangry to Jean-Pierre Jeunet. Make a bad Alien movie is sad, but making an Alien comedy-movie is blasphemy. But when you accept the fact it's a kind of comedy (not only, of course), you must admit Jeunet is pretty good in what he does. Good ideas, interresting way to film. The fascinating character of Ellen Ripley continues her captivating psychologic development, and Sigourney Weaver still one of the most finest actress in the world."}, {"rating": "5", "text": "Fairly entertaining, especially Perlman, but essentially stupid story and dumb plotting."}, {"rating": "2", "text": "It's certainly more tolerable than Alien 3 but equally as bad. I feel like the cast is slightly better this time around but the story is far freaking worst."}, {"rating": "3", "text": "Alien: Resurrection pales in comparison to its three predecessors. Albeit, I missed the first thirty minutes of the film, but the rest was basically what came out of me during those thirty minutes. The writer tried to reinvent the alien breeding system that was perfectly laid out. Instead, he made it convoluted and weird. Ripley's cloned self wasn't as good as the original Ripley, and perhaps the only good things about this movie were Ron Perlman, the scene with failed Ripley clones, and the fact that serious scenes were able to make me laugh with just how stupid they were. I don't consider this movie to be cannon, and I'm not even a hardcore fan of the Alien universe."}, {"rating": "3", "text": "As I open this review I realize the unintended pun in regards to the title. Resurrection. This picture idea needed to remain dead. Don't get me wrong, I had a good laugh watching it and I was even entertained.  But it's a clear example of what already began to take place in Alien 3 and takes place with many Hollywood franchises all the time. The product makes money, so you turn to the accountant types to 'package' the next version of cool aid, hence removing the originality from the product that made the big bucks to begin with. Or, we could call it a resurrection.\rDirector Jean-Pierre Jeunet is brilliant, I like all his other movies. Truly imaginative and creative like no other films. The cinematographer, Darius Khondji, is a genius. Simply turn off the volume and watch any images from this film on their own merit. The guy's work should be hanging from a museum. The digital effects and production design were superb. The ships are believable and the environment convincing. You feel like you are in there. And finally, we get to the script. Joss Whedon's script... Ok. So, Alien 3 might have aimed a couple notches too far towards the dramatic aspect of what was always intended as a fun thriller with good action in it. And I am definitely a fan of Whedon's work. All that being said. Alien is not Firefly. Campy works for the space pirates, not with the legacy of Ridley Scott, James Cameron, and David Fincher.\rLooking back at all this highly talented pieces of the puzzle, it's easy to see why they don't fit at all. Clearly, the studio guys knew nothing of this folk's work. They were probably \"packaging\" this thing via their assistants. I mean, have you seen any of Jean-Pierre Jeunet's movies? I'm talking about Delicatessen and Amelie here. Go have a look. Tell me where you see an alien and a space ship in there?\rAnd Whedon's character's structure? The space pirate types? They board a military grade ship in a renegade top mission? Seriously, that was the best idea all that studio money could come up with?\rLook, I do own the Firefly DVD collection, I love it. But make your own judgment on this. Go watch a random episode of Firefly and then have a view of Ridley Scott's Alien. Tell me how exactly do you thread any of these elements together?\rWe all wanna make movies and want to be part of big studio projects, but, give me a break, there comes a time to also say \"I'll pass on this one. It's not for me.\""}, {"rating": "3", "text": "One of my big, big disappointments in the cinema... After a ridiculous beginning to open the alien saga again, it's slime, more slime, and so on. And did I mention how stupid everybody behaves here, especially the military?? Takes the aliens a couple of hours or so to escape, and the masterplan is to evacuate and autopilot the ship back to earth... Come on!!"}, {"rating": "5", "text": "A really desperate attempt to follow the same formula that made Aliens such a success, only, it failed. At best I can say this movie is average. It does toy with some really interesting ideas, but they just don't get realized they way they could have been. Ripley is very different in this movie, and I know this met with ALLOT of criticism from fans. But I get why she is this way, technically she is not Ripley, merely a clone that looks like here and with her memories, but she's OK with that and has embraced her new self. It might not have been a bad idea if they would have shown this transition of acceptance, to allow the audience to accept her they same way. The \"new\" alien idea was just daft and ugly, I'm sure H.R. Giger read the script and just design it with same effort as the writers. Winona Ryder  and Ron Perlman are perhaps the only characters that are interesting adding a bit of fun and class to an otherwise bland cast. Overall: This movie was more of a disappointment to me than it was bad. In hindsight I actually thought that it was rather enjoyable, it just had some really stupid moments that kind of spoiled it."}, {"rating": "5", "text": "This is a pretty weird movie and the term \"a cast of thousands\" springs to my mind because of the bloated cast. The only other two Alien movies I even saw where the first two, both of them with a rather small cast, which allowed for more screen-time for each death, I suppose. But now, with so many people dying, it was just another death among the many. Perhaps I should stop watching movies like these before I get too numb to care.\rThe story hovers somewhere between the funny and the scary, a sentiment that is strengthened by the fact that I watched it on commercial television, which meant that every fifteen minutes the pacing was broken by the same beer commercial: I am still pondering if the advertisement detracted from the fun or not.\rThe cast does a decent job really, with Weaver acting out her weird human/alien breed attitude, Perlman being sufficient gruff and rude, and the small Ryder being nasty and vulnerable at the same time. The rest of them are just meat for the grinder. Dourif acts the mad scientist, a role he later reprises as Wormtongue in the Lord of the Rings. His comical over the top role is probably one of the reasons this movie isn't as scary as it could be, which is especially important when he comments on a key scene in the movie: the birth of the new alien/human hybrid, which is witnessed by Weaver at the same time and turns the whole event into a comical farce.\rThe biggest problem with the movie is the abysmal script coupled with the bad directing. The script is run-of-the-mill: evil organization wants to breed homicidal aliens on a space station, the aliens escape and go on a killing spree, while a group of survivors makes a break for the spaceship that is located at the other end of the spacestation before the spacestation crashes onto earth while being thinned by the ravenous aliens.\rThe director, who made a debut with excellent movie Delicatessen, isn't fit to direct movies like this: a big budget action horror movie. It is just not his cup of tea. The camera shots are just boring, the music is dull and the art is a weak redo of the Giger art, lacking his touch of brilliance. Which is especially noticeable when the new breed of Aliens pops up, despite Giger's praises for it: it just looks bad.\rThe movie might have done better with a smaller cast and less aliens, especially in full view of the camera. Weaver's mixed human/alien features should have allowed for more duplicity and infights in the group, just as Ryder's secret should have. Can they be trusted? Will they turn against the group?\rIt is here where the movie noticeably fails and could have shined by spending more time to develop a tension that leads to disaster. But nothing comes of it.\rThe movie ought to be watched with pretzels and beer. Perhaps the beer advertisement wasn't so far of the mark.\r (Note: I do not like a scoring mechanism that runs from 0 to 10 and therefore I devised my own value system, which works as follows: 1 for bad, 5 for mwah, 9 for good. 10 for superb.)"}, {"rating": "8", "text": "Rewatched it recently on BD. After the sort of ok 3rd movie they went back to action packed 2nd movie as a basis and produced a pretty good action packed sequel. Some good actors, great atmosphere and a nice story."}, {"rating": "7", "text": "It wasn't as bad as I remembered when I first watched this, but it is still better than having a poorly  computer generated dog alien like in Alien 3 (Which sucked balls). Score: 3/5."}, {"rating": "4", "text": "Even Joss Whedon, who wrote this instalment, calls it a dud.  The biggest problem in this film is the casting, as everyone is over-the-top to the point of being comical."}, {"rating": "5", "text": "What can i say? this movie is a mediocre action film with a sub-par plot but highly entertaining action. I would recommend to only die-hard alien fans."}, {"rating": "5", "text": "So ALOT of people hate this film, I've noticed. Ive seen alot of people on YouTube completely annihilate this movie in some overly hilarious reviews. Its campy, over-the-top and almost a complete separation in terms of style from the first 2 entries.Much like Alien 3, all the characters are body bags to be killed so they're not memorable. The gore is over-the-top and some of the performances are comically bad (Brad Dourif). Sigourney Weaver is fantastic as always but this film's biggest issue seems to be an apparent clash of styles between Joss Whedon's script and the direction.Of course, Whedon says it wasn't his fault but has anyone noticed whenever something goes bad and Whedon is involved he blames everyone but himself? Basically Alien Resurrection isn't a great film. Its not as bad as people make it out to be but its not that great either or even good enough to be \"okay.\" Its just kind of there."}, {"rating": "2", "text": "The 2 last movies just dont have the same climate as the 2 first ones.\rIf you hate long texts here is the short version: The movie errors, things left unexplained, weak aliens and the super-soldier rippley mad this movie a waste of time IMO.\rHere is the long and detailed version of my critic:\rSo, first of all...we have a cloned ripley with an alien queen being removed from her chest....that was my first problem with this movie. She suicided to end forever the alien threat, but they simply made a BACKUP. Yes, a backup, not a clone. The cloning part..? ok, but how the f*ck did they create her with the queen inside? shoudn't it have been only rippley?  And talking about this, rippley became a super soldier (she had entreme agilty, super-strenght, super smelling ability, acidic blood, I dont understand why they dont added x-ray vision too. Althought there is an \"explanation\" to this, it was boring, she losed her sense of things around her (what I mean is: things that she would NEVER talk, like when she smiling and saying \"Im her mother\", being proud of it. It just wasnt her style). At the part where the crew were underwater, that was just too unrealistic, several minutes underwater, like it was nothing.  The android gets shot, fall on the water static but appears out of nowhere to open the door on the other side (and that's because it was supposed to be the only way..).  She encouters her clones, and her blob sister tell rippley to kill her. No, just a bullet on the head wont do, she NEED to burn her.  Now we talk about the aliens. They're smart, cute, scary, angry, intelligent and now, fragile like paper. Of course they escaped, caused trouble and died. The queen got smashed by that gross thing that she generated. In comparison tho the Alien's queen and aliens, they were pretty weak and less scarier. About the gruesome newborn alien...i really dont have words to express my feeling. It was distasteful, gross and I was really dissapointed. It just smashed the queen's head like you smash a mosquito. Then it develop feelings for rippley, crush the scientist's head and meanwhile I wonder: how the f*ck in this world did it was created? Yes, there is a queen with a womb and it would be an interesting explanation, but...the queen had a womb, humans have womb too, but to create a baby (human or not) you need a thing that its called sperm. Did the scientist had sex with the alien queen? Was it a god miracle? I think I dont want to know if he really had sex with her. Anyways. I aways heard people talking good about this movie, but as a huge alien fan, I was dissapointed, very, very dissapointed."}, {"rating": "8", "text": "I haven't seen it since it came to the theatres, and I remember being mildly disappointed, but still enjoying it. I'd certainly revisit it soon, with my son, since both of us enjoyed Alien and Aliens so much."}, {"rating": "5", "text": "Meh  !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!"}, {"rating": "5", "text": "I was glad that Ripley gets \"resurrected\" so when i watched this movie i thought could ripley be her self again? Nope......cause some company clones her. Now she's on the bad side? Yep but then she realizes human feelings and has a good heart and that's one thing that the script got right, the action sequences are  good. The thing i hate in this movie is Ripley tries to be funny at times BOO! she's okay in this movie. Alien 3 SUCKS!!!!!!! The original writers of Alien kill Ripley! who thought that was a good idea? Grade C-"}, {"rating": "6", "text": "Honestly, I don't think this movie is that bad. Sure it has tons of problems with it's plot but it has a decent set design, some pretty cool effects, and I also really like the fact that they make the Xenomorphs look a lot more realistic in this. It's definitely not a great movie, but it's at least a lot better than Alien 3."}, {"rating": "2", "text": "Es simplemente mala. Esta película arruino la franquicia, en comparación Alien3 es una obra maestra. Alien3 a la mitad le gusto a la otra mitad no, pero esta cosa es simplemente horrible. Lo principal es que no hay mención de nada, no se sabe que paso con los marines ni con la compañía, absolutamente nada. Una de las peores cosas es el clon de Ellen Ripley, antes ella era un humano y no me refiero por lo del ADN, ahora parece una maquina asesina sin emociones, antes ella podía sentir miedo, tristeza, amor, emociones, ahora no tiene nada de eso. La única vez que se siente que es humana es cuando ve a sus clones defectuosos pero después de eso no lo menciona, como si nunca hubiera pasado. La historia tiene poco sentido, como clonaron a Riple y a la reina Alien a la vez? no podían solo con uno? acaso la sangre humana se mezclo con la del Alien? como? Esta película es tonta, no tiene mucho sentido, y el final es malo, la mejor parte de Alien3 fue el final, inconcluso pero mil veces mejor que el de esta \"película\". Le doy un 02/10 por ser una \"secuela\" de Alien y Aliens. Y si tu eres uno de los que les gusto la película pues mira las películas life action de Resident Evil por que son una historia y trama similar. Una chica al inicio aparece desnuda, de hay se encuentra con una súper amenaza Aliens/Zombies y tiene que escapar y exterminarlos. Si te gusto míralas, seguro que te parecerán obras maestras mientras que en el mundo real seguirán siendo malas."}], "recommendations": ["the_predator", "alien_covenant", "predators", "prometheus", "war_of_the_worlds", "the_darkest_hour", "skyline", "jurassic_world_fallen_kingdom", "jurassic_world_dominion", "species", "terminator_salvation", "transformers_age_of_extinction", "the_last_days_on_mars", "hellbound_hellraiser_ii", "aliens", "star_trek_v_the_final_frontier", "jurassic_world", "district_9", "monsters", "transformers_the_last_knight", "the_tomorrow_war", "monster_hunter", "daybreakers", "riddick", "the_cloverfield_paradox"]}