{
  "id": 2832,
  "title": "Alien Outpost",
  "starring": [
    "Joe Reegan",
    "Matthew Holmes"
  ],
  "runtime": 93,
  "genre": [
    "Thriller",
    "Action",
    "Science Fiction"
  ],
  "description": "A documentary crew follows an elite unit of soldiers in the wake of an alien invasion.",
  "releaseYear": "2014",
  "mpaaRating": "NC-17",
  "imageUrl": "https://image.tmdb.org/t/p/w500/dXe0HXP66DyTv6mw5pxbGq89knr.jpg",
  "categories": {
    "plot": 5.0,
    "acting": 5.0,
    "ending": 5.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 9.0,
    "funny": 5.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "5",
      "text": "I have above average tolerance for shaky cam which comes in handy watching found footage movies, but I've just met my match in Alien Outpost. It's quite a shame since it has good prospect that could've been much more. By telling a story of alien invasion from the soldier's perspective and having more than ordinary skirmish, it starts decently until about halfway where it fails to keep the pace flowing or the camera steady.\r This is the story of Outpost 37, the most dangerous outpost a soldier could be stationed in. An alien race called Heavies launched an invasion many years before, soon afterwards nations gathered and fended them off. Outposts are made to defend against their last remaining troops. The script is surprisingly very detailed, there are many aspects that other similar movies neglect to mention. Its use of military personalities, though somewhat overused, is fitting to set the tone.\r The movie falls apart when it needs to excel. One of the main things about alien invasion movie is you at some point need the alien to appear. You might go for unassuming but effective design like District 9 or full blown larger than life entity. Sadly for this movie the alien is subpar, it’s done with inferior CG of last decade. The design looks terrible, as though it's a reject from Mass Effect games or unused extra of Falling Skies. It has neither the technology nor make-up to convincingly deliver extraterrestrial threat.\r Camera work is unfortunately just as bad. It takes a real finesse to capture warfare with precision, and it'd be much harder to create action scenes by first person view alone. The film is incredibly disastrous when action hits. It flings out of focus, screens literally lag and generally hard to follow what is actually happening.  Mayhem of war should be conveyed better, not into mayhem in your screen.\r Alien Outpost has the correct idea of highlighting the human aspect, but it simply doesn't have the technical production to create the intended effect."
    },
    {
      "rating": "1",
      "text": "Alien Outpost looks fantastic, but the horrible costumes, screenplay and direction, make for a spoiled opportunity. One that could have been the next Starship Troopers."
    },
    {
      "rating": "0",
      "text": "Was this a joke ?\r One of the most bad movies ever.\r Dont waste time or your life on this movie.\r I guess they had a few $  that had to be spend,\r next time save the money untill u can afford to produce  a decent \"B\" movie instead."
    },
    {
      "rating": "9",
      "text": "If you liked Battle Los Angeles you certainly are going to like this one. Some other reviews critic the special effects. I've seen the movie in 1080p and I didn't even notice bad special effects and/or costumes. Concerning the characters, I thought they were well performed and there were a couple nice personality evolutions. Fast paced action/battle sequences were nice to see too, you feel almost like you are one of the soldiers themselves. Highly entertaining movie"
    },
    {
      "rating": "0",
      "text": "worst thing i have ever watched in the history of films and i have an extensive collection. slow, boring, and to be honest the biggest pile of garbage to ever cross my television screen"
    },
    {
      "rating": "4",
      "text": "Overall Alien Outpost is a fairly cliched base-under-siege movie, it's no \"The Siege of Firebase Gloria\" but it's a respectable enough effort that succeeds in keeping up suspense and I enjoyed the pace of the action. Characters are your typical soldier archetypes but they're played sincerely enough and the interactions felt genuine and reasonably well written. The budgetary limitations do show through in the effects but not so bad  as to detract from the overall story. Yes, the baddies look like their models were lifted straight out of a Halo game but that's not the point. It's a war movie based on a sci-fantasy world and it's an enjoyable enough watch on Netflix."
    }
  ]
}