{"id": 518, "title": "Alien: Covenant", "starring": ["Michael Fassbender", "Katherine Waterston"], "runtime": 122, "genre": ["Science Fiction", "Horror", "Mystery"], "description": "Bound for a remote planet on the far side of the galaxy, the crew of the colony ship 'Covenant' discovers what is thought to be an uncharted paradise, but is actually a dark, dangerous world—which has a sole inhabitant: the 'synthetic', David, survivor of the doomed Prometheus expedition.", "releaseYear": "2017", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/zecMELPbU5YMQpC81Z8ImaaXuf9.jpg", "categories": {"plot": 7.172413793103448, "acting": 6.84375, "ending": 6.75, "soundtrack": 9.0, "cinematography": 7.0, "familyFriendly": 3.0, "funny": 8.0, "action": 8.875}, "reviews": [{"rating": "3", "text": "Profound disappointment... does not live up to the Alien franchise.  Terrible casting and script, Kenny Powers as a pilot???  To sum this movie up in two words: hot garbage."}, {"rating": "2", "text": "Just awful. I really do not understand the overall favorable reviews from critics. In \"Alien\" and \"Aliens\" you could sink your teeth (ahem) into some very well-drawn and well-acted characters, and invest in them, well before the acid-for-blood hits the fan. And when it did, it was compelling, dreadful, terrifying and chaotic. Here, nothing. Empty shells staged for some poorly paced bloodletting. Worse yet, this movie is less about the Alien and more about \"The Fassbender Show\" with seemingly endless heavy-handed dialog on android aspirations... We've been here before, and much more succinctly. The rules of Alien biology clearly established in the first two films are wildly violated here (it is supposed to take days for full alien incubation - but we don't have time for that in this script, so let's just take 5 minutes this go-round), yet one would think Ridley would be loyal to his own invention. Worse yet, in one unbelievable jump-the-shark moment, Ridley doesn't seem to even be aware that he's channeling \"Spaceballs\" - at which point I totally checked out. Oh God, and then there's the moment Fassbender's android PLAYS THE THEME FROM PROMETHEUS on a recorder/flute thingie. Are you serious. And FYI to FX teams, a mix of CGI and a well-crafted on-set in-camera creature would still be superior to the nearly 100% CGI creature FX here. And lastly, zero continuity is set forth between this and the events approximately 15 years later in the original Alien. OK, ok, the space FX, spaceships & indoor/outdoor settings are all beautifully done, I'll give them that, but on no level do they redeem the pic. Ridley otherwise has an astounding body of work and he could rest on those laurels... Wish he would."}, {"rating": "7", "text": "Alien: Covenant may not be horrifying or at least stand within the original two, but this installment deserves a round of how the franchise should go back to its original roots despite Covenant not being a sequel to the main four in its franchise. If you have ever heard of Prometheus or have even seen it, you know this is the direct sequel to it. Otherwise, you'll have to see that first before going on ahead."}, {"rating": "8", "text": "I really enjoyed this one, but I can really feel the gap between Prometheus and Covenant.  All I can hope for is that the interquel will go into the meat and potatoes of the prequel trilogy.  Don't stop making Alien films Ridley!"}, {"rating": "7", "text": "Director Ridley Scott has cranked out another one that pretty much follows the formula. A group of space explorers land on a remote planet where lives \"guess who?\" There are some electric encounters that seem more intense and extended that in the past, but there are also plenty of concentrated dialogue passages (and more emotion). Since the scenario's a given, it's up to the filmmakers to offer something new. They didn't. But this film still plays out with grand visuals and a sprinkling of violent, tense alien encounters."}, {"rating": "9", "text": "4.6/5 A fantastically bloody and grim action packed spectacle that has probably the most disturbing scenes/aliens out of the entire franchise. While I enjoyed Prometheus in all of its cryptic and philosophical glory, I still desired more time visually spent on the alien creatures themselves, and let me tell you when they are sparingly shown in Covenant they are truly stunning and absolutely vicious to the point of extreme gore and utter chaos. This aspect however seemed to detract Ridley Scott's original Engineer/creator/Shaw plot line into oblivion as it was extremely glossed over rather quickly and unexplained which was a huge let down for me. If this would've added about 45 min of backstory and extra footage surrounding those gaping questions it could've been a masterpiece though it was still excellent. I especially was left a bit underwhelmed with Shaw's mysterious fate. Apparently their stories aren't finished according to Scott. Either way the plotting of Covenant still rolled on fine with David the android becoming even more insane and villainous with his experimentation and intentions. Michael Fassbender's brilliant double roles as David/Walter steal the show as he did in Prometheus with utter captivation and enthralling characterization. The thing that strikes me the most about Covenant was its magnificent visuals throughout with the scenery, set pieces, and aliens. Some of the best cgi I've ever seen in film as well which these days can be hit or miss. Overall this is another amazing entry into the Alien franchise that i believe has been truly reborn with Prometheus and now Covenant and will hopefully continue soon."}, {"rating": "7", "text": "This is an overall great movie. I don't understand people that just can't chill out and enjoy the movie. It's true, not every character desition it's a logical one, but we know that as spectators, not \"feeling\" the tension that a person would have in the movie's horrible situations.The acting was great, the horrors were truly horrific, the overall story it's on point and the whole atmosphere of the planet it's truly obscure. It's really Alien gone gothic. It's simply a better and more balanced movie than Prometheus. All the ideas here fit well and have enough time. The universe they have created can produce so much fun for us now!If there is one thing that I objectively think could have done better it's the ending. It's obvious, but it's intentionally obvious. The direction could have been made in a way the plot twist was more unexpected. Nonetheless, the overall idea of it is truly masterful and it's a good ending, it just could be better executed.Fassbender shines here acting as two robots, how paradojical is that?I would recommend it any day, just watch it without children."}, {"rating": "7", "text": "Acting upon the backlash Prometheus received, Scott took his newfound movie formula that he implemented in Prometheus and threw in that of the classic Alien. The main concern is the continued convolution of the mythology, but it is fairly balanced with heart-stopping, horrific tension and gut-wrenching gore. These two movies establish a definite, if not slightly-unstable, basis for the (allegedly) two new prequel movies that will bridge the gap between the polarizing Prometheus and highly-praised Alien. Although the stunning cinematography does not waver throughout the movie, the special effects are slightly questionable in aspects of the movie less renowned (chest-burster especially). In summation, Covenant takes the raw story of Prometheus and enhances it for the delight of die-hard fans of the original in a way that will please only the attentive and educated. Its exploration of morality and hierarchy of creation is interesting, thought-provoking, and adds a deeper meaning to the movie underneath its preliminary horror-thriller-action combo, although some would argue its execution is shaky and a major contributing factor to the confusion."}, {"rating": "8", "text": "I really enjoyed alien covenant but then again I loved Prometheus. I love the fact they are making an origins story and the casting, filmography and script are well executed.My only problem is the weird protocols/behavior the covenant crew has when exploring an unknown world. But yeah it was a bit the same with Prometheus... \"Oh look at that adorable space cobra\"."}, {"rating": "3", "text": "Can somebody please tell Ridley Scott to stop making any more Alien movies, congratulations you got it spectacularly right once and now it’s gone. Get over it. Move on and stop with these unnecessary prequels. Alien Covenant has been described as the third best Alien movie, believe me that is not a compliment. If you thought Prometheus was enough to ruin the franchise well then, Alien Covenant only makes it worse. Much worse. And by its creator of all people. How ironic. Alien marked a turning point for horror movies and raised the standard so it’s disheartening to see Alien Covenant fall so far below the standard we expect.Set ten years after Prometheus we get even more backstory to the Alien, complete with yet another expendable crew, another robot and yes, another lazy story. It’s nothing you haven’t seen already. Taking all the bad from the previous Alien movies along with all the bad from other horror movies you’ve seen before, mixes them together throws in a couple of gory scenes for dramatic effect and you’re left with a movie that falls into the exact same trap as Prometheus. No character development so when it’s time to start killing off the crew one by one nobody really cares. I’m officially done with the Alien franchise, I refuse to contribute any more to what can only be described as a cash grab. What a bitterly disappointing end to an iconic movie. Under no circumstance would I recommend Alien Covenant to anyone, so you’ve been warned."}, {"rating": "8", "text": "I'm gonna say it. Covenant is the third best film in the franchise and maybe, just maybe the second best upon repeat viewings. This is worthy of carrying the Alien franchise tag and if you're a fan of the franchise you will leave the theater feeling energized and excited for the next installment. If you're a sci-fi fan go, if you're a horror fan go and if you just like good film making definitely go."}, {"rating": "9", "text": "Like Alien and Prometheus, this film focuses on the tragic outcome of a space expedition.  In many ways, views should know precisely what to expect from this film: it's a hybrid of Prometheus and Alien.  It includes some thoughtful questions about life and finding meaning as well as alien monsters and action.  Although every Alien film has included horror aspects, this film seemed to emphasize the horror atmosphere and tone more than previous movies.  I felt that it balances and continues the themes of Prometheus and Alien well, while also having a unique identity.Characters: Strong acting and writing.  This is a story about a group of people instead of a story about one person.  Think about the difference between Alien and Aliens - the first was about a group and the second was about one character who had interactions with a group.  People who tried to focus on a single protagonist in this film seem to be disappointed.Story: Many elements of the story will be familiar to viewers.  There are some new twists, but for the most part you'll know what to expect if you're aware of this genre.  Still, the story is satisfying and contributes to the larger Alien universe while also include a few shocking moments.Sound/Visual effects: The more you're aware of the music of Prometheus and Alien, the more you'll enjoy this soundtrack.  The music is largely derived from those previous films and is appropriately evocative.  The visual design and effects were breathtaking, I saw no problems.Final thoughts: I highly recommend this movie if you like sci-fi, horror, or both.  Particularly if you are a fan or Prometheus or Alien, this is a must-see.  In my opinion, the Alien movies typically struggle in two places: the opening, which can go on far too long without action, and the ending, which can seem too final and lack a feeling of potential continuation.  For the first time, I thought that an Alien movie had a strong beginning, middle, and ending.  This movie expertly expands on the idea of what an Alien is and what can be done in the franchise.9/10"}, {"rating": "10", "text": "La pelicula me parecio muy buena, no concuerdo con muchas de sus críticas, es entretenida, visualmente una pasada y incluso la historia me pareció estupenda, soy fanatico de la saga alien y tenía miedo de que lo estropearon y salí muy contento después de verla, esperando a que hagan otra"}, {"rating": "7", "text": "A decent entry into the Alien franchise; this film is on par with the standards set by Prometheus, but you can't help to feel as though the plot is somewhat rushed and many questions left unanswered like it's predecessor before it."}, {"rating": "9", "text": "Ob es einem passt oder nicht, Alien Covernant lüftet das Geheimnis über den eigentlichen Ursprung der Aliens. Auch wenn die Angst vor dem Unbekannten am größten ist und man gern in furchteinflössenden Gedankenspielen rund um die Herkunft des Xenomorphs schwelgt, sollte es dennoch einen Ursprung in irgendeiner Form geben. Selbst Aliens von David Cameron hat versucht mit der Königin eine Antwort auf diese Frage zu liefern. Während Teil 3 und 4 lediglich fortführen, versuchen Covenant und Prometheus die Geschichte um neue Facetten zu bereichern. Covenant lässt dabei in erzählerischer Hinsicht Prometheus ganz klar hinter sich, ohne diesen zu ignorieren. Von der Aufmachung erinnert der 6. Teil eher an eine Mischung aus der Optik von Alien 1, der Action aus Aliens und den Prometheus typischen philosophischen Ansätzen. Trotz der guten Zutaten wird einigen Zuschauern das fertige Gericht nicht schmecken. Ohne groß zu spoilern , die Entstehungsgeschichte kommt eher aus einer unerwarteten Richtung. Mir persönlich sagt der Ursprung sehr zu, da die Aliens nicht durch den Zufall oder die Evolution entstanden sind, auch ist keine ausserirdische Macht verantwortlich oder gar der menschliche Geist. Nein die Antwort ist sehr erfrischend und gespenstisch zugleich, für mich hat Covenant die Antipathie personifiziert. Abgesehen von ein paar inszenatorischen Schwächen, ist der Film sehr bild gewaltig und lässt mich im Gegensatz zu Prometheus befriedigt das Kino verlassen. Zudem dürfte die hoffentlich kommende Fortsetzung, wenn diese der Story folgt, um einiges opulenter ausfallen als die beiden Vorgänger Prequels. Man darf gespannt sein."}, {"rating": "8", "text": "Thoroughly enjoyable and a HUGE improvement over Prometheus.  However, I have to say, the bit where David lures Billy Crudup to the egg is one of the stupidist scenes I've ever seen in a film that takes itself this seriously."}, {"rating": "10", "text": "This is simply a superior production both visually and story wise. i am glad Ridley Scott took the reins once more time. needless to say i am a huge fan of the series, however i never had doubts to criticize previous weaker offerings. This movie will answer a lot of your unanswered questions from \"Prometheus\", and the director understood that he could offer a bit more information on the universe he created 38 years ago. Picture is magnificent (CGI is overdone in couple of scenes but overall well used). In this movie you will for the first time in 3 decades have a clean, bold view of the creatures. Story is very well developed in my opinion and resumes in a great ending, with a lot more questions of course, specifically about the engineers. If you like the series you will surely enjoy this entry."}, {"rating": "8", "text": "Alien Covenant is a good movie. Don't compare this movie to Alien and Aliens. It's a good movie in its own right. Many tend to forget that these are prequels. It's telling the origin story of the Xenomorphs. It's satisfying how it is connecting the dots of the Alien story line."}, {"rating": "10", "text": "I loved this movie!! Didn't think Ridley Scott would deliver a masterpiece like this but couldn't be happier to be wrong. A gripping film. Great dialogue and perfect cast. Graphics are next level s/o to the design team. Can't wait for the next installment!"}, {"rating": "7", "text": "Covenant did what Prometheus wanted to, in that it created a new idea within the Alien film World, that was interesting, scary and felt complete in itself. The weakness lay in the tone of the script, that went from deep metaphors to horror cliches. Overall the film is enjoyable and probably the third best in the series, but could have been even more if the filmmakers had just been slightly more subtle in their approach."}, {"rating": "8", "text": "Let me start off by saying I liked both Prometheus and the first two films in the Alien series. I thought Ridley Scott to take what worked in each of those films to create a perfect blend of new and old concepts.Scott is known for his gorgeously shot movies that sometimes lack the content to back up the rest of the film.  I did not think this was the case for Alien Covenant and felt it was one of his more complete films.  The movie did have some familiar horror movie tropes but for the most part nothing felt forced.  The highlight for me was the performance by Michael Fassbender.  The movie contained some of the best scenes I have by him as he had the perfect opportunities to show his range.  One of the best Sci Fi Horror movies I have seen in a while, I recommend to all fans of genre or Prometheus and  the original Alien movies."}, {"rating": "7", "text": "This movie is fine. Not great, but not bad either. Not as good as Alien 1, Alien 2, or Prometheus but better than the vs Predator movies wrt plotline and vastly better than the almost unwathcable Alien 3. Plot is OK, action sequence, etc. are what you'd expect. It's biggest flaw is there are no surprises - everything that happens is utterly predictable and unfolds exactly as you know it's going to. So you can expect to just sit back and watch it unfold and have a pleasant enough time viewing the spectacle."}, {"rating": "9", "text": "Alien:Covenant is about the mythicizing of creators, and the contradictory nature of being human. David, the android is a creation of humankind. Humans are fallable, but we have brilliance. We create synthetic beings(androids). We make them to look and act just like us in the realest ways. We make them to be perfect, but we imbue androids with experiences that are examples of our worst traits. A creation will wish to mimic its creator. David, like humans in history, razes an entire society of people, then seeks to make himself god-like by trying to make something more indestructible than him. But David is flawed. Humans on the ship Covenant are basically missionaries posed as colonists. They bring all these things from their human lives to set upon a world they are not sure is inhabited already. What they know is that it is in the \"habitable zone\" and might be a new home for humans. We mythicize creation with pretension only because we so strongly dislike aspects of ourselves as humans that we forever wish to change. Redo. We wish to go back to \"the Garden\" and rewrite things. Alien:Covenant is a great film. It packs in quite a bit into 2hrs. Watch the film \"Prometheus\" again, and perhaps you will understand that Alien:Covenant is about the destruction wrought after humans perhaps finding out that we were not the prodigious result of evolution, all the while trying to extend our chaotic rule of peace, violence, simplicity, and complexity. The reasons why we are imperfect. Ridley Scott picked out great actors in Katherine Waterston, Michael Fassbender, Amy Seimeitz, and Dennis McBride. A well-written script and well-placed terror on film."}, {"rating": "7", "text": "Ridley Scott created a reasonable spin-off from the originals. Sci-fi is harder to rate than other genres. Perhaps my fear factor was lessened knowing the stories & plots of the others. The creatures were improved but something lacked for me. I place it in the OK file."}, {"rating": "8", "text": "I'm amazed by the mediocre reception this film is receiving. I went into the theater expecting expecting a dud like every entry into this franchise since 1986 but walked away pleasantly surprised. The acting was superb. Michael Fassbender, Danny McBride and Katherine Waterston all delivered excellent performances. Waterston recaptured some of Sigourney Weaver's magic as a strong but believable female lead. As expected with Scott, the visuals were stunning. The atmosphere was tense. The pacing felt just right.It wasn't a groundbreaking film. It didn't add anything particularly new. Either did Star Wars: The Force Awakens but it was enjoyable enough. Like Episode VII, the scenes that are most familiar felt more like an homage to the past than a franchise struggling to find new things to do.If you're a long time Alien fan and stuck with the franchise through Alien 3, Alien: Resurrection, the two AVP films and Prometheus I doubt you'll be missing this film despite the mixed reception. If you're unsure I suggest you go. It's worth the price of admission, in my opinion at least."}, {"rating": "9", "text": "Wow! What a great film. I've been waiting for this since Prometheus and boy does it deliver. I was excited to see that Ridley Scott came back to direct it. The entire cast does a fantastic job, but no one can compare to Michael Fassbender. He steals every scene as David and Walter. The action as well was fantastic and the scenery and CGI was superb, but that is expected in a Scott movie."}, {"rating": "8", "text": "It was good.  Not as high in caliber as the first two films but, much better than Alien 3 and \"4\".  It has gore, amazing effects and some surprising acting with certain people I did not expect to see perform as entertainingly as Fassbender.  I liked it and hope that Ridley makes more of these films."}, {"rating": "8", "text": "Michael Fassbender - 10/10. Human characters (maybe except Daniels) - 5/10. And it's not the actors' fault. Prometheus was definitely better - the humans were so self-centered, oblivious, and taking the android's obedience for granted that you could actually feel the android's anger (or disgust). And yet, for example, Idris Elba's character was memorable.But in Alien: Covenant, humans are meat. Their decisions are as stupid as if they starred in a horror movie (well they kind of do). They split up and so on. Sometimes they show they are a bit more than stock characters, but rarely. Although you can feel their desperation, and you feel sorry for them. If you want a movie that leaves you happy or satisfied, well, pick another movie.You can see quite a range of the Alien variants. One, which appears just for a short time, seemed as scary as the original creature. But others just dilute the Alien \"brand\".And when the original creature appears, it's long after Aliens-style firefights, and there is not much suspense. There is more gore than fear. Don't let advertising fool you into thinking the Alien is the star of the movie. It's much less scary than you'd expect. The series is not about aliens anymore; it's about androids.What can I say: it's dark, it's unsettling, there is no real (human) hero, characters act illogically... and I watched it twice. And it was worth it."}, {"rating": "6", "text": "I couldn't have hated Prometheus more. This however, was really inspired. The tone, editing, score, script, scares and, most importantly acting (particularly from Fassbender) were all flawless. I guess Ridley Scott still has it. Who knew?Of all of Fassbender's incredible performances so far, this might be the best yet."}, {"rating": "8", "text": "This movie is the sequel to Prometheus. Prometheus, to me, was a good movie, but I think that Alien:Covenant is the better one by a small margin. The movie sets a great atmosphere, characters are great, although I do wonder why James Franco and Danny McBride are in the movie. They seem off; maybe because I'm not used to seeing them in non-comedic roles. I do like to add, however, that Danny McBride caught me off guard here. He did well, in my opinion. The atmosphere and the overall \"vibe\" of the movie was good; the soundtrack is a little off at times. Visuals were amazing, and the CGI was top notch. There were parts that were dragging, but not so much that it took away from the entire experience of the movie. The ending ruined the movie for me. It was so unoriginal, and predictable. But, you be the judge. I gave this movie an 8/10 because I really did enjoy the movie, with little hiccups here and there but nothing detrimental to the movie itself. Bravo!"}, {"rating": "9", "text": "While there may be stupid characters and the history of the Alien franchise may have been altered, I got to say I really liked this film.  From the atmosphere to intriguing avenues that Ridley Scott decides to go down I was riveted. Then comes Michael Fassbender as Walter and David, what great performances. Also David may be one of my favorite characters so far this year.  A"}, {"rating": "10", "text": "Perfect organism. Perfect film. Tension, story, cast, and atmosphere are all, imho, pretty well flawless (certainly to this Alien fan). Ridley Scott has weaved an absolutely brilliant narrative web - one that now more directly links to the original film, while also posing more questions following the threads of Prometheus, which I maintain is also an absolutely brilliant film.I am indescribably excited to see where he takes things from here.I know this review may sound one-sided, but I'm just being honest. Mr. Scott, as a lifelong fan, you continue to blow me away. - Julian"}, {"rating": "3", "text": "When I first saw Prometheus, I immediately liked the idea behind it.Classic mankind questions were brought into the movie and created a whole new horizon in the Aliens franchise world. Questions like \"WHO ARE WE?\", \"WHERE DO WE COME FROM?\" or \"WHY DID OUR ENGINEERS TRIED TO KILL US?\" made Prometheus a great movie in a variant way and made us anxiously wait for a sequel. A sequel that supposedly would answer all these questions; a sequel that promised to explain us all the origins and humanity and the aliens...I WAS SO WRONG! Alien Covenant turned to be a fake promise and did not answer any questions raised in its predecessor Prometheus.Even being a great fan of the Aliens (apart from Alien 4 and Alien vs Predator movies), I can't agree with the mess Mr. Ridley Scott did with Alien Covenant.Let's go to the facts:(CHARACTERS)Characters in Prometheus were not the best. They lacked a bit of personality, attitude and empathy with the audience, even if acting was GOOD, especially Michael Fassbender. In Alien Covenant, as far as anyone can see, characters are even worse! They simply exist to die, nothing more. No intelligence, no meaning, no use, nothing! Acting was equally BAD, apart from Michael Fassbender again!(REALISM)In Prometheus we have seen one main stupid scene that in real life would NEVER happen: a fascinated scientist that got in direct touch with alien life with no apparent reason or care. In Alien Covenant, Mr. Ridley Scott kept thinking we all LIKED that a lot and populated the entire movie with unrealistic scenes! NO, Mr. Scott! We didn't like or approve your decisions on adding nonsense to the movie!1) As much as an alien planet would look like Earth, no one would ever land on it and explore it without a suit and EXTREME care and attention! THAT WOULDN'T HAPPEN IN REAL LIFE!2) No intelligent person would ever stayed inside the same room of an ill person that seemed to be infected. Much less would a normal person touch the other one with evident signs of \"mutation\" and bleeding. NO, Mr. SCOTT! THIS ISN'T VERY REAL!3) What kind of crew was in the ship, after all? They were supposed to be the BEST among the BEST. They carry 2000 human embryos to be taken to a planet that was long surveyed and studied. THEY should be a RESPONSIBLE crew. They are NOT! From an instant to another, the captain simply decides to investigate another Earth-like planet that seems to be sending \"strange\" signal messages, discarding the long studied planet just because the crew of the ship doesn't want to spend 7 years in their sleep capsules that recently had a failure. THIS ISN'T ALSO REAL, MR. SCOTT! A Captain should be a WELL TRAINED person, prepared to make the best choices in the most aggressive and stressing moments.4) Who in its normal state would make love in a shower knowing that a new life form was roaming free inside the ship? What the heck is that, Mr. Scott? There's an alien in the ship and you tell your movie characters to make love in a shower like if the life form was just a simple fly? THIS IS NOT REALISM!!!I could simply go on and tell you Alien fans more and more inconsistencies, but I'd just make myself BORING! All that matters about Alien Covenant is that it has no realism; everything seems so stupid to the point we wanna give up seeing the movie!!(SPECIAL FX)Special effects on Alien Covenant are fairly decent, but not so great as in Prometheus. Some sequences, however, are a bit confusing to the eye and does not help fans to like them a lot.(STORY)Alien Covenant has no story. Period. What? Yes! I'm serious! NO story at all. It's a bad mix of Prometheus with Alien and Aliens. The result is a miscellaneous SOUP of grotesque TASTE, awful SMELL and POISONOUS consequences! Ridley Scott could have the opportunity to make Prometheus even bigger than what it was, even more marvelous than what it became. But no. He did something much worse than giving no story to Alien Covenant. He KILLED the original Alien story and the entire franchise!(LACK OF OPPORTUNITY) Ridley Scott had the opportunity of his life. Do his best to make a GRAND Alien movie for the generations to come. Being the father of Alien, he could have done so much for Alien Covenant. He could have made it a reference (for the difference) in the Alien franchise. He didn't. He shot his own son and spitted on his fans!!In summary, Alien Covenant is the WORST of the Aliens. It didn't ruin itself alone; it ruined all Aliens (the good ones and the bad ones).Even with a great photography, Alien Covenant is a movie without a soul, empty in all senses, doesn't answer any questions made in Prometheus and dares to destroy the whole Alien concept. It's sad, my dear reader. Sad but true. I'm disappointed. And I'm gonna forget that Alien Covenant ever exists. To me, Prometheus deserved a SERIOUS and REALISTIC sequel, but only got a twisted shadow of what an Alien movie should be!3/10!"}, {"rating": "4", "text": "Alien: Covenant is neither as tense nor as terrifying as the first two Alien films, and even feels inferior to 'Life', a similar film released earlier this year. Furthermore, the plot structure, which follows 'Alien' and 'Prometheus' (go to alien planet, find alien ship, do something stupid to wake alien up, and alien v human gorefest) feels disappointing. However, Michael Fassbender's magnetic dual performance, as well as effective sporadic scares, notches it some points."}, {"rating": "9", "text": "It stays with you. Fassbender reminded me of Anthony Perkins in psycho. Soundtrack wasn't as good as prometheus,but, was more closer to the original first alien film. A few questions left unanswered, but didn't disappoint. Loved it!"}, {"rating": "8", "text": "Have you ever just wanted to scream like a little German girl at the sound of thrash cans falling down in an alley way in the cold streets of December in front of your date and question two male robots kiss? Then Alien covenant is going to get you %85 there. Get ready to experience confusing feelings about the beginning of humanities extinction, like the time you drank non alcoholic beer for the first time and you realized you never like the taste but just drank to bury your non existing self confidence down. Feel like you broke your jaw with a jaw breaker from the amazing cg effects has to offer and leave the theater with a speech impediment that'll leave you single for the rest of your life only to be reminded of your depressing life every time you watch this movie. Never will you doubt agent Fox (x-files) for screaming aliens in the sky instead leave your family and friends to build a bunker at your parents house cuz your girlfriend kicked you out for having ptsd from this movie. This plot will have you feeling like your term for hope really went out the window. (specially if your name is \"hope\") With twists and turns and some few plot holes that make you feel your driving down your parents dirt rode while getting head. (asking yourself, why am I not driving on a solid rode for this and I cant stop now cuz it feels amazing.) With a great cast that falls into the stereotypical cast of horror that we all love. Emerge yourself in a planet that looks like earth and abandon because production spend a ton a money on advertising this movies hype so now you look at the exact almost look a like planet from the movie \"Prometheus\" and begin to wonder \"wow... every planet looks the **** same\" Alien: Covenant will make you feel like you've watched \"nightmare on elm street 5\" all over again, but know that media has you hooked cuz you cant watch anything else but the same movie but this time before everything has happened."}, {"rating": "3", "text": "Thank you Ridley Scott for making the worst Alien movie yet. You have singlehandedly ruined the entire franchise in 1 movie. Well done sir. I thought anyone would have forced you to read the negative reviews of Prometheus and not retreaded the same mistakes that movie made. But nah, you compounded those problems and made it much much worse. Do yourself a favour and don't see this movie. Has amazing cinematography, brilliant audio, awesome visuals, great art direction for both the spacey-sci fi scenes and the on-planet stuff. But none of that removes the fact this movie has a bunch of stupid scientists making continually stupid decisions and then stomps all over the alien lore. Arguably also has the weakest writing of all of them. Even worse than Resurrection."}, {"rating": "10", "text": "Hell of a mix of Prometheus themes about creation and Aliens bloody, brutal and violent sci-fi cosmic slasher. Not so scary as first two instalments of this franshise of course, but still atmospheric, dark and gritty.Great Fassbender, much good from androids and grotesque elements. Sometimes plot is too obvious and predictable and to much repetitive in comparison to great Prometheus. Better than Alien 3 or 4 thou"}, {"rating": "10", "text": "Alien Covenant is definitely a good movie. Ridley scott and the writers are really trying to extend the Alien univers by taking it at its root. We have here a movie that explore the meaning of being god. Having the right of life and death upon the others. Having such a character as David was pretty unexpected but it feels so obvious now. I'v seen it twice in theater so I was able to really get a bit more objectif about it. The acting is good, nothing pull you out of the story at any moment. The score does perfeclty the job of taking the old songs of jerry goldsmith and reniew it. The general atmosphere of this movie is great. For what's might feel wrong I'd say the visual effect aren't always look the best. They tried to make the alien faster and ferocious by moving at an inhuman speed. The result might make us feel like it's a very ferocious creature but not very believable as we could see in the first Alien movie. It's definitely feel like cg as it is most of the time on screen ( except during the first neomorph attack). I would give it a 7/10 if not so many people would have rated it poorly for wrong reasons."}, {"rating": "9", "text": "In 1979, Alien was the unintended problem of being peace that was because of no problem; in 2017, Alien Covenant is about the dynamic of peace that's because no problem. Naturally, peace is the goal of the universe, but peace being at the expense of the idea that its anti was possible seems to be the underlying meaning of Alien Covenant, an effective allegory about the paradox of the anti destroying itself so that the self is protected. At a deeper level, the sequel to Prometheus tells a very well-designed story about the beauty of an original replication. David manages to create the xenomorphs, in the process reflecting himself onto his creation, but the process is also just a replication of an ancient process that was started by the Engineers; ergo the effort of being an original replication.Playing Daniels, an obvious allusion to Ripley, Katherine Waterston's true role is to just be a device for David, both metaphorically and literally as the film ends: in the first act, the contrived tension between Daniels and Oram is a metaphor for needless opposition as a reaction to hierarchy (and the film's theme is to attack hierarchy), and yet the irony of this is that the example of needless opposition on display is meant to be attacked, but the source of the paradox is hierarchy.Alien Covenant is the very sharp, very keen self-awareness of understanding the true nature of paradox.Original freedom was the mistake of self-awareness. Self-awareness means division, and thus destruction. The next stage being to separate freedom from anti by duplicating absence is also a mistake, because it betrays the meaning of absence. The solution, and the \"probable\" allegory of Alien  Covenant is that the absence of discrepancy means to replicate freedom being separated from anti. Anti is need, and freedom not being need is the same as freedom anti being anti. Anti being anti is anti, because just being anti is the possibility of no anti, therefore it seems that to actually defeat hostility, an proactive sense of hostility is needed, which makes sense relative to the storytelling of Alien Covenant.Many characters in the film have a theme, including Upworth and Ricks: in light of the movie's philosophy that the universe needs hostility, what's remarkable about the duo of Upworth and Ricks is that though they spend the vast majority of the film being sources of reason, their deaths at the very end of the story are extremely clichéd and trope-like. The sources of reason become sources of amusement and traditionalism, and yet the parallel is meant to be revolutionary!When it comes to Elizabeth Shaw, and her final fate, Alien Covenant is simply being an exploitative user of Prometheus while not giving anything back in return: but this is okay, because David's story about revolution and attacking hierarchy is a worthwhile substitute for Elizabeth Shaw's story post-Prometheus. Better yet, the death and type of death of Elizabeth Shaw represents the intelligence of self-awareness being a false bias.All in all, Alien Covenant is an impressive sequel considering its generic make-up and story concept"}, {"rating": "9", "text": "This film has a brilliant ending and leaves me wanting more. After seeing the anodyne Guardians of the Galaxy 2 last night, this was a welcome return to humans being vulnerable and not falling 1000 feet and surviving. Its a bit Prometheus and a bit Psycho. But was very glad they address Prometheus and tried hard to attach a coherent back-story."}, {"rating": "10", "text": "i see myself as a huge fan of the alien series and personally i loved this film i enjoyed it so much I've already seen it twice, Prometheus left us with a lot of questions and covenant answered a lot, yet also left us with even more questions that i only imagine will be answered in the next addition to the franchise."}, {"rating": "8", "text": "Alien: Covenant made right, all the wrongs of Prometheus. In fact, if you haven't seen Prometheus, skip that film, and go straight to this one. Great mixture of horror and science fiction. Doesn't rely on \"jumpscares\". Many chilling/terrifying scenes. I do wish there was a little more depth to the characters."}, {"rating": "8", "text": "If you enjoy the tone and feeling of Aliens movies, you will like this movie.  If you have issue with what the plot..should or should not be...that is a separate issue and I am fine with the direction Ridley has taken his creation in.  The film is in some ways very much like other aliens films in terms of characters getting picked off 1 by 1 etc., but the tone and feeling is just like any other aliens film, and entertains as such, mixed in with a good enough amount of story to keep you wondering.  This is a movie, made by writers....they do not have the answers to the universe...no idea what some people are expecting out of an aliens movie.  It entertains and also presents some questions, and balances that tension throughout.  I would say it was about as good as Prometheus, not as good as the two originals, and overall another solid sequel/prequel."}, {"rating": "8", "text": "It was surprisingly good. The movie was well shot, suspenseful, frightening and entertaining. The acting and the CGI effects were also pretty good. Even if it was predictable at times and I could've done without the CGI aliens, it's still the best movie of the series after the first two."}, {"rating": "10", "text": "Una película para público que tenga la mente abierta, dicen por ahí que cuando una película incomoda a cierto público y que no es para toda la audiencia en general, es que va por buen camino. Covenant desafía lo que Prometeos hizo, un riesgo que vale la pena lo que hizo Scott."}, {"rating": "10", "text": "I thought this was a great movie. It did a great job of advancing the story in Prometheus, while also adding many intense & gory thrills to keep us on edge and excited. The acting is good, and it does a good job of answering several of the questions we wanted answers to in Prometheus, so I left with a good feeling."}, {"rating": "10", "text": "A movie full of amazing sets, amazing acting, amazing effects, amazing visuals but like others have said not overly convincing decisions made by the characters. Having said that they weren't all brilliant scientists like some are making out and \"mother\" did say the new planet was a better match that where they were originally going but they could have added that its their duty to investigate a signal in space as it might well be a distress call. This alone would help solve the biggest problem with the decisions in the movie. Promethius got a lot of bad press for being to heavy on the philosophical creation stuff and light on Aliens action this is somewhere in the middle. Unfortunately that will upset those who loved the mind bending Promethius and others who want an outright Aliens horror. I hope everyone can appreciate that its somewhere in the middle and in that respect it is truly an exceptional movie."}, {"rating": "10", "text": "If the movie Prometheus engaged you and haunted you but you were left with more questions than answers, you will love Covenant! Just do yourself a favor and do some research on the movie Prometheus, web and youtube, before you watch covenant. It will guarantee the latest installment in the alien series leaves you breathless at times and stunned at how well this movie is crafted and acted. Bravo Ridley Scott, crafting a sci-fi/alien movie that is true to the genre and brings to light very real issues facing humanity, AI, our potential destruction of our habitat, where did we come from and what god(God) do we hope for. You can go as deep into these two films as you like, the mythology here is deep, the acting is on point, the music is well crafted, the visuals are amazing and the quotes are perfect."}, {"rating": "0", "text": "Somewhere in the middle of the movie, one of the hard to tell apart characters says \"I don't get it\". And he/she is totally right - neither do I. The spore plot that was dropped years back for Alien 3 is back. Along with a script that seems to have lost its structure, with lots of unnecessary gore, an attempt to explain the Alien's origin (don't we all love to know what gives the Jedi their powers?) and characters that do their best to act against all thinkable logic. Hey - we've just stumbled upon a planet that's closer than the one we spent 10 years analyzing for colonization. Let's land right away without finding out what it might hold. And sure, let's take almost the entire crew along - just to destroy the entire mission (which includes 2000 people) in case we lose the ground crew. And let's leave people unable to think straight aboard the mother ship. That's the only way to be sure. And have one of them oppose the idiot (who's of course in charge) constantly, only to corroborate his clearly suicidal command only minutes later. And the not-really-ripley character joins this idiocy at the very end of the movie. It's like the presence of the Engineer planet (I didn't notice the planet was this one, oops) caused all humans drop half of their brains for a reason. And I thought Alien 3 was the worst part of the franchise..."}], "recommendations": ["prometheus", "sunshine", "aliens", "annihilation", "alien_resurrection", "star_trek_v_the_final_frontier", "captive_state", "the_girl_with_all_the_gifts", "event_horizon", "reign_of_fire", "arrival", "the_last_days_on_mars", "interstellar", "monsters", "star_trek_into_darkness", "star_trek_insurrection", "constantine", "independence_day", "avatar", "star_trek_first_contact", "mission_to_mars", "the_matrix_revolutions", "predators", "the_cloverfield_paradox", "terminator_salvation"]}