{"id": 4546, "title": "Alien Abduction", "starring": ["Katherine Sigismund", "Corey Eid"], "runtime": 85, "genre": ["Horror", "Science Fiction", "Thriller"], "description": "A vacationing family encounters an alien threat in this pulse-pounding thriller based on the real-life Brown Mountain Lights phenomenon in North Carolina.", "releaseYear": "2014", "mpaaRating": "NR", "imageUrl": "https://image.tmdb.org/t/p/w500/pe9mSStpQC2doKtYY3VDJdBEBHr.jpg", "categories": {"plot": 5.75, "acting": 5.5, "ending": 5.0, "soundtrack": 6.0, "cinematography": 6.5, "familyFriendly": 2.0, "funny": 5.0, "action": 6.0}, "reviews": [{"rating": "3", "text": "Another first-person film with more shots of people's fingers or darkness than anything else. On top of being able to see nothing, we get to hear dull mumbles and linear dialogue for most the film.  The aliens seem to be systematically picking the group off, but it's not intentional, they're just too stupid to find them in even the most obvious hiding spots. Apparently hiding behind car doors, or in a basement cellar is extremely effective in thwarting super-intelligent beings."}, {"rating": "7", "text": "This film is scary. It is actually way better than recent found-footage horror films such as \"The Marked Ones\" and \"Devil's Due\". It touches the subject of alien abductions realistically, with the use of few CGI and special effects in general. It is precious how the film is executed, with a breathtaking setting which happens that it actually exists and has the reputation of the paranormal. There are some well made shots in this film with the use of massive special effects, what makes it look so interesting and real is the statics that cover the special effects and makes it more realistic, it is the shot from the earth to the alien spaceship and from the alien spaceship to earth, when you see it you'll know it. The acting in this film is really good, I bought every single scene, well done! The film interviews people at the beginning (The Blair Witch Project) which makes it a high cliche. The alien lights in this specific mountain yes do appear in real life, but I doubt that the tapes are anything near real. The little boy masters cinematography and never misses a shot? I don't think so. The audio is not interrupted when the camera switches shots, so it would've been better off without the found-footage style. I would love to see a horror found footage film, that when paranormal things starts to happen, the film character drops the camera and the film continues as a cinematically shot film, it would've been interesting. Overall, I highly recommend \"Alien Abduction\" it is really well made, better than recent horror found footage films, although, I have the feeling that V/H/S segments are turning into feature films, first \"The Den\" (Skype segment from V/H/S) and now \"Alien Abduction\" (From V/H/S/2). Either ways, \"Alien Abduction\" is a better film than \"The Den\" and V/H/S movies are really good!"}, {"rating": "7", "text": "Alien Abduction starts off like \"The Blair Witch Project\" , with documentary style clips of interviews with local people recounting their tales of the strange lights seen in the area and mysterious disappearances on the woods.\r The rest of the  film follows a family of campers as they venture up into the hills. The filming is done by the youngest boy (who is autistic), there are also 2 girls and 1 more boy. The family soon become lost and run out of gas. Stranded in a tunnel, they find many abandoned cars... then the aliens arrive.\r The CGI and sound effects during the abduction scenes are chilling and scary, and the whole quick, flickering filming style all adds to the unsettling atmosphere.The film is perfectly paced, maintaining the tension throughout, and a mixture of great lighting effects and editing make the film genuinely scary, cover-your-eyes viewing.\r The first genuinely well-made found-footage horror since \"REC\" . I highly recommend \"Alien Abduction\""}, {"rating": "7", "text": "Abducción (2014)Sinopsis:Un niño de 11 años graba el encuentro que su familia tiene con unos extraterrestres malévolos durante unas vacaciones en el campo en Carolina del Norte.Opinión:No es LA PELICULA, pero la encontré muy entretenida, de hecho siempre me han encantado este tipo de películas y que pese a los fallos que tienen, me mantienen siempre atento pese a que la mayoría son lo mismo.Valoración:3.5 ⭐ de 5 ⭐"}, {"rating": "6", "text": "Nauseating found footage camera work pulls it down from the bar of most modern horror flicks, but still Alien Abduction is effectively horrific thanks to the atmosphere and execution."}, {"rating": "5", "text": "The movie had a great overall atmosphere and some of the action scenes were well made but the compliments stop there. The movie is cliché, boring at times and the horrible acting performances make the movie even less realistic.Thumbs up for the mom for being one of the most annoying characters I have ever seen and thumbs up for the actress for delivering the worst performance of the movie.Watch it if found footage alien abduction movies interest you but if not, just don't watch it."}, {"rating": "3", "text": "It doesn't start out with much promise, introducing us to the most obnoxious, fake and unlikeable characters that make the entire film feel phony. I mean, it's 2014, have some people still not learned how to make a decent horror film? For example, one of the most overused clichés in horror is the moment when one or more of the characters, usually kids or youths of some description, see that scary thing, tell the grown-ups whose response is always \"You kids are crazy, there's nothing out there\" . Enhance the drama, have them believe the kids. But in the end, that's the least of the film's problems. Scares are few and far between, it's hardly chilling with only a few interesting moments. Don't bother."}, {"rating": "2", "text": "Alien Abduction might had improved from recent found footage films but since when were they any good. Filmed by an autistic 11 year old child does not give a right to deliver poor direction, or repulsive special effects an utter tragedy."}, {"rating": "6", "text": "This film is pretty intense with a standard start that seems to kick off most found footage film. The drama and suspense comes from the fact that all you see is what the camera shows you. The audience perspective is through the eyes of the youngest family member who is practically attached to his cam in the movie. Not knowing the full surrounding, or greater understanding of the environment, actually creates suspense and intensity in \"Alien Abduction\". That is a cool trick when it works, a lot of films fail to capture this element fully, \"Alien Abduction\" creates a tense atmosphere filled with melodrama. The middle of the film sort of drags and the added character trying to help the family actually takes away from the momentum a bit. That is just the middle though. The last act kicks in with the expected benchmarks that service found footage films well.\r The effects and soundtrack in \"Alien Abduction\" is hit and miss. The standard gimmicks apply in this film as in most films in this genre. Sometimes it works perfectly and creates some chilling moments. Most of that is due to the heightened drama from the characters and the fact that camera view is limited in found footage. However the action scenes are hit and miss as to being affective. The aliens tend to show a bit 'fake' when they are clearly on screen but the times they are only flashed or shadowy creatures in the distance actually gave me chills.\r \"Alien Abduction\" has limited sound effects in order to keep the 'realness' of the intent cohesive but the sounds that the camera picks up offer some sudden shock moments that made me jump. To be honest, all alien movies that show this particular alien species creeps me out, as if they are the boogeyman that is really scary. \"Alien Abduction\" is an entertaining film but it is average compared to most films in the found footage subgenre. The visuals, direction and gimmicks are expected but they work well and this film does what it intends to do- entertain and thrill."}, {"rating": "6", "text": "i think, its normal film to watch, but the thing i can say that developers of the film worked hard on this film."}], "recommendations": ["always_watching_a_marble_hornets_story", "event_horizon", "monsters", "antlers", "the_ritual", "the_descent", "the_medium", "the_pyramid", "annabelle_creation", "ghost_ship", "scary_stories_to_tell_in_the_dark", "it_follows", "mission_to_mars", "mirrors", "the_blair_witch_project", "the_mothman_prophecies", "the_fourth_kind", "alien_outpost", "a_quiet_place", "pitch_black", "color_out_of_space", "the_howling", "europa_report", "area_51", "the_witch"]}