{
  "id": 876,
  "title": "Alita: Battle Angel",
  "starring": [
    "Rosa Salazar",
    "Christoph Waltz"
  ],
  "runtime": 122,
  "genre": [
    "Action",
    "Science Fiction",
    "Adventure"
  ],
  "description": "When Alita awakens with no memory of who she is in a future world she does not recognize, she is taken in by Ido, a compassionate doctor who realizes that somewhere in this abandoned cyborg shell is the heart and soul of a young woman with an extraordinary past.",
  "releaseYear": "2019",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/xRWht48C2V8XNfzvPehyClOvDni.jpg",
  "categories": {
    "plot": 9.555555555555555,
    "acting": 9.678571428571429,
    "ending": 9.333333333333334,
    "soundtrack": 5.0,
    "cinematography": 9.0,
    "familyFriendly": 6.0,
    "funny": 5.0,
    "action": 9.464285714285714
  },
  "reviews": [
    {
      "rating": "10",
      "text": "This is just amazing movie! I am really love every damn second of this. Great story, great action, great score. You definetely need to see this, waiting for part two..."
    },
    {
      "rating": "9",
      "text": "Once again, Cameron and Rodriguez visually immerse you in an incredible world - it's thrilling - and a little chilling - just to be in it. A solid story, great acting, and great action sequences follow, and overall a very satisfying experience that made me want more."
    },
    {
      "rating": "10",
      "text": "If you are fan of the original comics(gunnm), then you have to watch this movie, and if you are not the fan of original comics, you have to watch this moive too^^, this movie is 'that good'."
    },
    {
      "rating": "10",
      "text": "Ta shila la pelicula muy buenos efectos y emocionante, no es para personas que se enfocan en un argumento coherente pues el proposito de la pelicula es ser espectacular y tener accion pura y dura"
    },
    {
      "rating": "8",
      "text": "Overall good adaptation. They were able fo capture the spirit of the Mangas insane battles. These are some of the best visual effects ever, and the CGI is almost perfect in areas were its so seamless and you actually forget what your looking at. Some parts of the story have been Hollywoodized but that was to be expected."
    },
    {
      "rating": "10",
      "text": "I have had very high expectations for Alita: Battle Angel ever since this colab between Cameron and Rodriguez were first announced. Since Last Jedi I have decided not to watch any reviews before seeing the movie myself. I watched an early screening yesterday and I were not disappointed. Reading up on some of the reviews after I were very surprised to find that especially the very first reviews from the press screenings were actually rather negative. For me this is one of the best Action Adventure Sci-Fi movies in a very long time. For me it is an easy 10."
    },
    {
      "rating": "10",
      "text": "+Exceptional anime to live action adaptation+Great cast+Excellent surround / OST+Incredible visuals-Having to wait for the next film!I came into the cinema unsure of quite what to expect... I was pleasantly blown away by what is easily Rodriguez's best film since sin city. The production cost is there on the screenn with a level of artistic spectacle unseen since the star wars prequels. Much of Iron city is there to draw the eye to and for me this is the first anime to live action film that doesn't completely butcher the source material. It feels about 70% accurate from the manga original with a bit of reshuffling and artistic license here and there. Above all the story just works and the cast are believable in their roles. If your'e a fan of the sci-fi action genre or even just James Cameron epics then this is for you! Glad to have seen this on the big screen but I cannot wait to see this in UHD 4k HDR when it releases in may for, god willing, an extended cut!!"
    },
    {
      "rating": "10",
      "text": "This is the BEST live action adaptation of a manga imo :). It follows the original source material amazingling, and even if you don't know the original source material it still is an amazing film! James Cameron did a fantastic job writing and directing this, it flows incredibly well."
    },
    {
      "rating": "10",
      "text": "Alita was amazing! The interesting storyline kept up the pace but still managed to give deep inflections and detail to the unique and heartfelt characters. Action and heart find a great compromise in Alita. The CGI is fantastic in Alita herself of course but also in the bodies and the environments. Rosa Salazar’s Alita was engaging and had a perfect blend of naivete and aggression. Waltz and Connelly's performances both were unique and nuanced, unforgettable! Just a fantastic movie, that leaves you wanting more."
    },
    {
      "rating": "10",
      "text": "Nice work on CGI, specially modeling Alita and motorball scene. Motorball scene was really great, I couldn't lose focus on moive."
    },
    {
      "rating": "10",
      "text": "Holy cow what a ride! We watched it at the 3D IMAX and were blown away. The 3D is the best I've seen since Avatar,  I'd dare say it's even better since the tech has matured. Can't wait for the sequel. Don't believe the critics this is a must watch film!"
    },
    {
      "rating": "10",
      "text": "I lose faith more and more in critical reviews. This movie was amazing in every aspect. I dont think you could delete a single scene, everything was perfect! Best movie i have seen in a long time. Would recommend to anyone and everyone."
    },
    {
      "rating": "10",
      "text": "I was a bit skeptical about this movie. I was worried that it can end up as another 'college drama' with sci-fi background, typical product from Hollywood. But it's not! My impression was that this movie was divided between day time scenes made by Cameron and night time scenes made by Rodriguez which together gives a nice mixture of two goods. I was surprised that they put so much in such short time and it does not make me feel like I don't know what's going on. I know Manga which helps a bit but there's a lot of small changes that have impact on the story and I'm pretty sure that even people who don't know source material will follow the story without any problem. Despite that there's a lot of small changes in the story it was done pretty well. Usually changes from original material are weak and sometimes even so radical that movie is an insult to original source. But here I enjoyed all of them because all changes were made with a taste and with a respect to the original manga. So I'm pretty sure that all or most fans of GUNNM will be satisfied as this is one of rare movie interpretations done well and are not an insult to a fan. For those scared about 13 (12A) rating: there's nothing to fear. Like Rodriguez said, you just have to change 'human' to 'cyborg' and you are free to do a lot more in the movie than current rating allows to. Of course it's not a slasher or horror with blood everywhere but it's not what this movie or manga is about in the first place. Visually movie is stunning but it's not a something that I care that much so beside that it satisfied my eyes I leave written review about it to others who may have more to say. I would love to see a sequel or even more movies from Cameron/Rodriguez duo in GUNNM universe. I'm giving 10/10 but I don't belong to people who focus on finding every single trivial issue to complain about. Life is too short to do that. I walked satisfied from the cinema, I was entertained and it's what is the most important for me to give a score to the movie."
    },
    {
      "rating": "10",
      "text": "Amazing movie! I'm looking forward to the sequel. Do not listen to any critics who know nothing about the Asian source materials and who don't appreciate creating beautiful fantasy world and living in it"
    },
    {
      "rating": "9",
      "text": "Stylish, fast paced action, very watchable. Best enjoyed on the big screen."
    },
    {
      "rating": "10",
      "text": "Went to see Alita for the second time last night we got to go to the pre-screening originally and loved it so much both times! Great interesting story, some awesome action sequences, and lots of heart. The CGI was fantastic, and the 3D was probably the best 3d that I have ever seen, I'm normally not a fan of 3d but it was done correctly and it just made the experience even better."
    },
    {
      "rating": "9",
      "text": "I knew nothing about Yukito Kishiro’s manga walking into my screening of Alita: Battle Angel, but I found the film to be gripping throughout. Perhaps only the ending left me slightly unsatisfied (for obvious and necessary reasons when you see it).  Sure, there are some implausibility issues that critics are citing (and the film borrows story element from a number of other sci-fi sagas we’ve seen), but the characters of Alita and her love interest Hugo are entirely believable and compelling. And Christophe Waltz is fantastic. Ali and Connelly have smaller parts, but they’re terrific. I was concerned, after seeing the trailer, that the bulk of the “good vs. evil” action would be confined to the MotorBall arena, but it’s not the case. There are some amazing set pieces in this movie.  The film’s action sequences and its visuals are absolutely fantastic. It doesn’t have a heavy “artificial” CGI feel to it at all. And at least in my theater, the 3D experience was better-than-perfect (I typically loathe 3D) – the screen didn’t look “grey” or “dim” like it does with most 3D movies. It was entirely bright and all the colors popped.  I can’t imagine this film not doing extremely well with a younger audience, and I absolutely want more of this story."
    },
    {
      "rating": "10",
      "text": "First, some context: I loved the manga growing up. Much the same as I loved the manga of Ghost in the Shell, Blade of the Immortal and others that have received the movie treatment. I was an avowed comic book fan and loved Spawn, the Marvel Universe, Sin City, et all. Here's the thing though - I thought most of the Marvel Movies are just okay, Ghost in the Shell was outright bad, Sin City was at best mediocre, so forth. Outside of Nolan's Batman trilogy, Logan and a couple of the Marvel movies (Thor, namely) I've never thought a comic book movie truly did justice to the source material. I tell you this so you have context for where this review is coming from, I'm a comic book fan and nerd who has not liked almost any of the movies based on comic books.Obviously you can tell based on my rating that I loved Alita. I thought they really nailed it and it disappoints me to see it dumped in February under the expectation of it being a flop. It further disappoints me to see the critical reception which I think is unjust. Hence why I'm going to the pains of taking the time to actually write a review (something I've only done a handful of times to date). Anyhow, here goes:The Good (in roughly this order)1. World Building: This feels like the most well realized fantasy world since Lord of the Rings or Blade Runner. The attention to detail, from inhabitants, to cars, to buildings all just feels really thorough. It makes the rest of what happens work so much better because you're willing to believe in the world they've created. 2. Set Pieces: Holy moly, there are just some jaw dropping set pieces. My friend and I were chuckling, whooping and in general just having a blast. They are some of the best action set pieces put on screen in a long, long time. 3. Acting / Characters: I expected pretty good acting given the pedigree of much of the cast (3 oscar winners?!). But Rosa Salazar crushes it. She humanizes a character, at times feeling petulant, foolish, brash but, nearly always, believably so. The characters don't get as much development as they deserve since there is just so much plotting, but it feels like there is a character who has a lot more about them that we don't know, which is a credit to the actors playing them. 4. Villains: The \"big bad\" feels appropriately intimidating. I love a good antagonist and he is appropriately mysterious and powerful as to make you feel he is an appropriate counterweight to the heroine and also makes you excited to learn more about him. 5. Effects: I am not a big effects person. In general I feel SFX fights lack weight and thus are forgettable. This is, unequivocally, not the case here. This movie probably as the best effects in general (from environment, to characters, etc) I have ever seen. It feels like another major step forward in that department. The Bad1. Trying to do too much: They pack A LOT of story in here. There are more subplots than I can count. It's certainly never dull, but it also doesn't give the characters room the breathe. Which is a shame, since the characters are acted well and have interesting motivations/backstory (per the manga) which don't get their due as a result of how much they are trying to pack in. I would have gladly taken a trade off of a bit more character development for a bit less forward propulsion of the overarching story. 2. Plot contrivance: There are a few moments of \"wait, how the hell did that person get there?\" that really do require suspension of disbelief. They don't do enough to earn it and it feels forced for the sake of moving the breakneck pace of the story forward. They could have made it feel more natural with another 30-60 seconds of context. My strong suspicion is that was there but in an effort to keep the running time down after early testing they cut some of the set-up which left it feeling absolutely manically fast paced."
    },
    {
      "rating": "10",
      "text": "The ratings will already tell you this: but it's a movie you'll either love or hate. When you watch it, it's clear that the source material is not western. They don't shy away from violence by the protagonist and don't feel the need to put in annoying comic relief characters.Not every character is black and white, and that's what makes this movie awesome."
    },
    {
      "rating": "10",
      "text": "Don't let yourself be turned down by the press reviews, and enjoy one of the best cyborg movies of the moment, far better than the Ghost in the Shell movie (for the ones who don't know the books, it's somewhere between Dark Angel and Elysium). Of course, if you are more into cheesy love stories or historically accurate biopics, this one is not for you...The adaptation is really good, with some nice workarounds allowing the story to be coherent and fast paced. Ido (Christopher Waltz) and Vektor (Mahershala Ali) are the perfect cast, the lesser known actors do a very good job along with Jennifer Connelly. The choice of a full CGI Alita is coherent, her expressions are well rendered.For the manga lovers, you'll find the most iconic scenes of the first books, and a faithful Gally/Alita character. Some shortcuts have been taken to allow the narration to go fast enough, with subtle modifications, that the fans will notice, but that won't change the core of the universe of GunnmI would love to see the story continued, so please, please, make it a success :) remember that the best best parts of the lore are yet to come !"
    },
    {
      "rating": "8",
      "text": "Will keep it short. Overall I think they did a good job adapting a Manga/Anime. What I didn't like was the lower City being too clean and people living there, like it was an ok life. The contrast between the Scrapyard and Tiphares wasn't clear enough. A lot of the dialogue felt cheesy, cringey or bland. The presence of real danger, the charisma of some of the enemies, was for the most part of the movie missing. It wish the movie would have been a bit darker atmosphere wise."
    },
    {
      "rating": "10",
      "text": "Absolutely lovely work of art. Best 3D CGI integration and motion performance as of now. This is state of the art tech and done so very well. Must see for entertainment!"
    },
    {
      "rating": "10",
      "text": "This movie was amazing.Sad that Last Jedi gets critical acclaim with its moronic plotline and this movie gets a collective 'meh' from critics."
    },
    {
      "rating": "10",
      "text": "I love the way the director delevoped the character. He's been successfully made not only the character fearless, but also considerate. The action sequences are also the essential elements of this movie and they executed them perfectly. I wish the script could be better knowing that it is almost impossible to build a 2-hour movie script based on a multi-volume manga to explain the whole story. But overall, this movie is marvelous."
    },
    {
      "rating": "10",
      "text": "Alita Battle Angel is what happens when Hollywood finally get an Anime film right, ive gotta say James Cameron and Robert Rodriguez should work more together because this film is incredible.This film had heart and soul poured into its story and you could tell that 1000 of hours of work have gone into making this film. They've pulled one of the best films this year with incredible visual effects and CGI work that give this film a beautiful setting and background.The visual effect of Alita (voiced by Rosa Salazar) we're incredibly done giving detail in her eyes which made her character on screen look more like an actual human actress. Her character and acting is what made this film, they give her a human soul and a purpose with the writing which is so well done, it gives the audience an emotional journey of a young woman trying to discover who she is.The love interest side of the film is so done right it doesn't feel forced as well which along with its action sequences as well as it supporting cast was nothing short of perfect. The story does a great job of not revealing too much to earlier as slowly building up characters so you understand the story and draws you into every moment, this is matched by the awesome fight scenes and great formidable villains of the film adding to incredible film.This is one of those films that deserves a sequel and to be a successful film as of what they've realized here is one of the best live action anime films, with a damn near perfect if it was for slight pacing issue that doesn't really affect the film but is noticeable.Does it live up to the hype? HELL YES this film live up to the hype this is a must to watch on the big screen hopefully were see a sequel come from it because it so needs it."
    },
    {
      "rating": "8",
      "text": "Just saw the movie. Came out on the 5th at my place. I dare say it's one of the best anime-adapted movie ever made. The most successful for the US in my opinion. Especially how successful her iconic anime-eyes are brought to life. Heart warming father/daughter relationship between Alita & Ido. Very amazed & thankful by how much effort they put into the production to nail it as much as possible with some changes here and there. I wont be too nit picky...i dream for a Alita movie back when i fell in love with the manga, and so now here it is--dream come true! I wont say it's the best movie of 2019 though (i could be wrong), but it's most definitely not trash either. it's a good, fun, virtually explosive film painted by talented individuals! I was on the edge of my sit throughout the movie. Rosa Salazar and Cristoph Waltz's father/daughter relationship was very heartwarming.My only regret was the moment i had to rush to the washroom when she got her new body.As a fan of the original manga, i truly enjoyed it; although it's not perfect. And i look forward for the sequels!!"
    },
    {
      "rating": "10",
      "text": "The movie was well crafted and entertained throughout. I felt invested in Alita and her success. Definitely appreciated the cyber-punk feel and the attention to explanations that were unobtrusive and didn't overly complicate or overwhelm the viewer."
    },
    {
      "rating": "9",
      "text": "I don't know if the Critics just have tall poppy syndrome and want this to fail but this movie is VERY good. No not perfect but its got everything you want from a action adventure love story. A lot of the reviews said there was too much packed into one movie and yes there was but in no way was it a mess, if a critic cant follow this story then they are just simple themselves and how do they have their jobs. I was expecting the roller ball bits too be too long and to make  the movie drag but they are kept short and fit the story perfectly. A simple sum up of Alita.... AMAZING VISUAL and 3D, an action story with enough meat to it that you had to think a little (not War and Piece but not Mighty Morphing Power Rangers either), acting was good all around, good villains and characters. The only downside I really saw was the ended for me felt like a \"hey lets end it here and hope we get to do a 2nd one\" and had no real closure or finality. Don't listen to the critics do yourself a favour and go see this movie."
    },
    {
      "rating": "9",
      "text": "I am baffled to see this classic movie get such mediocre scores?I believe this will go down in cinema history as a classic film. The 3D is the best I've ever seen and the CGI just breathtaking. Sure, the story isn't exactly unique but the visuals are so stunning the film never tires and I'm looking forward to watching it again next week.This is one you MUST see on the big screen in 3D."
    },
    {
      "rating": "10",
      "text": "Awesome movie. Went 2 times. Alita is beautiful. Nice world building, awesome 3d, loved the music. The most moving part of the movie is Alita itself. Must see."
    },
    {
      "rating": "10",
      "text": "Amazing movie.  Hands down one of the best action movies I've ever seen. Don't believe the critics, go watch it and form your own opinion. Hopefully it will do well enough to warrant a sequel because there is so much more story to tell and Alita is a great character."
    },
    {
      "rating": "10",
      "text": "I was expecting way less than it was. Even tho there was a few cliches, I totally loved the plot! 10/10 is well deserved"
    },
    {
      "rating": "10",
      "text": "I went and saw this movie last night with my fiance at AMC Riverpark Square in IMAX 3D. I had high hopes for this film ever since it was announced and knew James Cameron was tied to the production. I was NOT disappointed! For the best experience, I highly suggest seeing it in IMAX 3D as it'll better immerse you into the world and characters.I think they did a great job at setting up the story. Beginning with Alita's mysterious past and then throughout the movie unlocking her character and history. I enjoyed the father daughter relationship between Alita and Christoph Waltz character, Dr. Ido. And the love interest between Alita and Hugo seemed natural, and not forced. Rosa Salazar, the actress behind Alita (along with digital artists at WETA Digital) did an amazing job at bringing the CGI character to life. I never got an \"uncanny valley\" feeling from Alita (despite her manga inspired facial aesthetic). It's probably some of the best special effects in film thus far.Speaking of special effects...from crafting the world, to the cyborg side characters, to the action/battle sequences, everything was spectacular. Again, seeing it in IMAX 3D really let's these things shine.Overall, I highly recommend this movie to any fans of Sci-Fi / Fantasy. Definitely worth seeing on the big screen. I hope it does well at the box office too, as they perfectly set everything up for sequels. Such a rich world, characters, etc...would love to see more of it."
    },
    {
      "rating": "9",
      "text": "Alita: Battle Angel is a visually stunning action-packed cyberpunk thriller, story has an emotional theme and its flawless CGI which makes it even more breathtaking. Each actions and fight move from the movie pumps adrenaline. It's one of the best manga adaptation movie in the history. Thumbs up to the producers James Cameron, Robert Rodriguez and Jon Landau for making Alita character more interesting !!"
    },
    {
      "rating": "9",
      "text": "Critics....are blind.   Not sure what they were watching but this was a great flick that was very well produced, acted and choreographed.  I'd see it again in a second.Looking forward to A2!"
    },
    {
      "rating": "10",
      "text": "Amazing CGI, detailed world, amazing play.Attractive, without any boring moments at all.Totally it is worth to see if you like this kind of settings.p.s. On which basis all critics score nowadays is based on?Good think that you can blacklist it them."
    },
    {
      "rating": "10",
      "text": "story is just above average, but what makes this movie so nice is the action scene, specially if you watch on Imax 3d or 4dx. I highly recommend this movie to the one who saw Avatar fun.(oh and Alita look really really pretty...movie tried to follow original comics \"gunnm\" a lot)"
    },
    {
      "rating": "8",
      "text": "The world is highly original, the CGI is gorgeous, and the story is interesting. Alita herself is a fantastic character that makes me care about everyone she interacts with. Props to Robert Rodriguez and WETA Digital for making such an outlandish premise grounded and fun."
    },
    {
      "rating": "8",
      "text": "This one you have to judge for yourself. It's not Shakespeare but it's very entertaining. Some of the best CGI I've ever seen. It is a solid and sound work of science fiction."
    },
    {
      "rating": "9",
      "text": "The best anime live action movie ever Made.Seriously after many failed attemps finally we have an adaptation that can translate well the essence of the original material. Rosa Salazar is gorgeous and really brings Alita to life. The action scenes are really well Made and the plot leaves you wanting More. I hope it gets a sequel."
    },
    {
      "rating": "9",
      "text": "Excellent movie. Effects are fantastic and loved the story. Direction is really well paced and its an easy one to get engrossed in. Grab some popcorn and enjoy."
    },
    {
      "rating": "10",
      "text": "CGI was perfect, sometimes you forget most of the movie is made out of CGI. The action scenes were on point. Story build up is fast but acceptable. Very nice concept even if its from Manga adaption. I'd say one of the best Manga Live Action movies I've seen. AWESOME Movie. Can't wait for the Sequel!"
    },
    {
      "rating": "10",
      "text": "This is the biggest cinematic event since Avatar came out. There is nothing more to say."
    },
    {
      "rating": "10",
      "text": "I saw this on valentines day with my wife and we loved every second of it. Not only was it a great action film but the movie also had a lot of emotional weight to it that i wasn't expecting.   People at the theater were literally cheering for Alita!   I'm not sure what the deal is with the critics giving it low scores, go watch it at the 3D Imax if possible, it'll blow you away."
    },
    {
      "rating": "10",
      "text": "Wow, just Wow.  Saw this at the imax with my friends, we where blown away by the effects and the set pieces."
    },
    {
      "rating": "10",
      "text": "I'm not sure what the coolade the critics where drinking becuase this is one of the best movies i've seen in a long time.  My only complaint is that it left me wanting for more."
    },
    {
      "rating": "8",
      "text": "This movie has a solid, but somewhat simple, narrative and good performances overall. The action and visuals are great, especially in 3D. It's not a perfect movie but I'd definitely recommend it to any science-fiction or action fans. I hope that it gets a sequel and they take things to the next level!"
    },
    {
      "rating": "10",
      "text": "What an unexpected surprise. Lots of cyberpunk; lots of high-tech; lots of martial arts all wrapped around a fairly descent story 300 years into the future. What could go wrong? :-)"
    },
    {
      "rating": "9",
      "text": "What a surprisingly great movie! Great action scenes and an interesting story. Some actors/actresses were better than others but overall a great performance. Alita’s character was phenomenal."
    },
    {
      "rating": "9",
      "text": "Good movie. Maybe not particularly intellectually demanding, but I enjoyed the effects, fight scenes, aesthetics and even story surprised me here and there. Not sure, why \"critics\" rated it so low."
    }
  ],
  "recommendations": [
    "the_adventures_of_tintin",
    "oblivion",
    "eternals",
    "dredd",
    "the_hunger_games_catching_fire",
    "tron_legacy",
    "avengers_age_of_ultron",
    "john_carter",
    "fantastic_beasts_the_crimes_of_grindelwald",
    "top_gun_maverick",
    "blade_of_the_47_ronin",
    "inception",
    "moon",
    "jupiter_ascending",
    "the_bfg",
    "9",
    "edge_of_tomorrow",
    "tomorrowland",
    "the_hobbit_an_unexpected_journey",
    "oz_the_great_and_powerful",
    "rise_of_the_planet_of_the_apes",
    "the_13th_warrior",
    "ben_hur",
    "valerian_and_the_city_of_a_thousand_planets",
    "serenity"
  ]
}