{"id": 4807, "title": "All I See Is You", "starring": ["Blake Lively", "Jason Clarke"], "runtime": 110, "genre": ["Mystery", "Thriller", "Drama"], "description": "A blind woman's relationship with her husband changes when she regains her sight and discovers disturbing details about themselves.", "releaseYear": "2017", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/wc9MgFWuBl3VS72w6VtiZXTgN79.jpg", "categories": {"plot": 3.888888888888889, "acting": 3.2, "ending": 4.0, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 3.0, "funny": 5.0, "action": 4.0}, "reviews": [{"rating": "4", "text": "Frankly it seems that the only person committed is Blake Lively, because the rest of everything that involves this movie, never manages to attract you, the script is too weak, the story is too weak"}, {"rating": "2", "text": "Who would invest $30Million on a movie project with such an under developed plot – that it left ¾ of the viewing audience up in arms?  Someone did, and lost it all! Sex obsessed German Born writer, producer, director Marc Foster is no stranger to making movies that lose massive amounts of money (Stay’05 - Machinegun Preacher’11). Here, he seems more interested in padding out time by creating a myriad of overlong, experimental ways to illustrate what a sight-impaired person may (or may not) see. His leading characters are an unlikeable married couple (she’s blind, he’s the ‘carer’) who seem only interested in taunting each other in demeaning ways. Along the way they spend some time with other sexually weird family members - this ends up inducing further ways to seriously unhinge each other. As this rather nasty obscene mess progresses - it becomes increasingly difficult to find many redeeming qualities, situations, or someone to humanely identify with (the husband, even with his character defects comes across as the more balanced!) Without offering the audience many logical explanations to ponder – the majority of viewers simply give up and long for an end to the torture (see the many international reviews).  Only the over emotional or those who like to make excuses for bad writing would get much satisfaction from this tosh. A waste of near two Hrs and a lot of money - with pretty pictures not atoning for a weak script.  Yet another example of Foxtel classifiers getting it wrong – an American R (deservedly so) played as an Aussie M. Who trains these (possibly desensitized staff?)  Viewers require supplied information they can trust - to effectively evaluate content."}, {"rating": "4", "text": "A solid idea with good direction and good performances by Lively and Clark but beyond that, the story is weak, it feels like it doesn't know what it wants to be. It's a cheap thriller, could have been more if the story had been more fleshed out."}, {"rating": "5", "text": "I was expecting a Mystery as I saw it in IMDb but nothing to do with that. More a Suspense/Thriller, Psychological Drama. Watchable. The plot is totally wrong."}, {"rating": "5", "text": "Her husband replaces her after surgery anti-rejection eye drops with a placebo so she will go blind again. That's how much he prefers her dependent on him. She finds out when she starts seeing blurry and the dr. tells her they aren't the same drops. She takes replacement drops unbeknownst to her hubbie. She pretends to go blind again because that's how much she loves him and that's apparently what he wants.  BUT when she finds out he is responsible for her dog going missing THAT'S when she cracks.  I think I'm getting a headache."}, {"rating": "5", "text": "ชอบองค์แรกของเรื่องมาก ที่ภาพจริงมันตัดสลับกับภาพที่นางเอกจินตนาการไว้ในช่วงที่ตาบอด มันสวยและน่ากลัวในเวลาเดียวกันมันทำไรคนดูเข้าใจความรู้สึกของคนตาบอดเลย ถือว่าการแสดงของนางเอกและงานภาพผ่าน แต่เนื้อเรื่องและปมต่างๆกลับทำได้ไม่ดีนัก บทมันไม่ส่งอารมณ์ให้คนดูเลย เดินเรื่องเนือยๆจนน่าเบื่อและองค์ท้ายมันเหมือนรีบจบไปหน่อย แทนที่จะเข้าใจง่ายกลับงง ว่าตกลงหนังจะสื่อถึงอะไรกันแน่"}, {"rating": "4", "text": "\"All I See Is You\" is a cheap thriller with little to no actual content; it's hopelessly boring, not in the slightest exciting and mostly just annoyingly art-house."}, {"rating": "6", "text": "I mean there were certain problem with the movie like it does not define genre convention it's trying to be too many things at once thriller, romance , drama too much at once , and it can be quite messy at times but it doesn't mean that I didn't enjoy it there were many things that I liked like the ending the casting the story was quite good and engaging again Blake lively and Jason Clarke were amazing together their chemistry really work together ending was also quite satisfying and the score was good too"}], "recommendations": ["the_voyeurs", "the_rental", "contagion", "children_of_men", "gothika", "nerve", "brimstone", "the_king", "the_loft", "before_i_go_to_sleep", "the_counselor", "the_unforgivable", "colossal", "gone_girl", "knock_at_the_cabin", "the_machinist", "unforgettable", "the_purge_anarchy", "eo", "the_purge", "anna", "sas_red_notice", "stillwater", "elle", "the_good_liar"]}