{
  "id": 4276,
  "title": "All My Life",
  "starring": [
    "Jessica Rothe",
    "Harry Shum Jr."
  ],
  "runtime": 93,
  "genre": [
    "Romance",
    "Drama"
  ],
  "description": "It was a chance meeting started by one of Sol’s friends trying to chat up Jennifer. However, in the end, it was those two who hit it off. Sol enjoyed Jen’s smile, her effort, and how silly she could be. Jen enjoyed Sol’s cooking, his athleticism, and that he would join her in fun moments. As you can imagine, love bloomed, and things got serious. Jen’s investment in Sol led to her pushing him to follow his dreams and even move in to save money. Sol’s investment in Jen well, it led to him proposing. But what started as a liver tumor grew into full-on cancer, so with a diagnosis of 6 months to live, Sol and Jennifer try to make the best of it.",
  "releaseYear": "2020",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/xoKZ4ZkVApcTaTYlGoZ3J8xcIzG.jpg",
  "categories": {
    "plot": 8.0,
    "acting": 9.0,
    "ending": 7.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 5.0,
    "funny": 7.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "7",
      "text": "2020 has brought us many things film wise. It hasn't been the greatest year and there's really no need to rush out to the theaters for this. But the film is a reminder of a simpler time when entertaining three hankie romantic dramas such as this would crowd multiplexes. Conceptually it's pretty generic and all the cliches are in place but the attractive and talented stars make it worth the watch. Jessica Rothe of Happy Death Day and Harry Shum Jr. Of Glee have awesome chemistry. The film tells the true story of a couple who are about to get married when they discover one of them has cancer. The movie is funny, moving and sad and as an added bonus at the end we meet the real couple. Sure I wished for just a bit more originality but was happy with this endearing little gem.***.5/5"
    },
    {
      "rating": "9",
      "text": "This movie was so heartbreaking yet heartwarming at the same time! It had me ugly crying throughout the movie. The acting was great and the fact that it was based on a true story was incredible. I loved the fresh representation in a movie like this and Harry Shum was a great pick for this. They had amazing chemistry. It’s not often you see sexy male Asian American leads and we’re starving for more flicks like this! Highly recommend!!"
    },
    {
      "rating": "4",
      "text": "They’re great and the movie itself is fine, it’s just pretty bland and overtly simplistic"
    },
    {
      "rating": "3",
      "text": "There is very good chemistry between the leads, but that's basically it.Its sentimentality is as cheap as its budget."
    },
    {
      "rating": "2",
      "text": "(Mauro Lanari)Cancer movie with the Oasis' \"Don't Look Back in Anger\". I'd have chosen \"Wonderwall\"."
    }
  ],
  "recommendations": [
    "leap_year",
    "stardust",
    "the_vow",
    "friends_with_benefits",
    "10_things_i_hate_about_you",
    "the_notebook",
    "pretty_woman",
    "the_holiday",
    "the_lake_house",
    "no_reservations",
    "sleeping_with_other_people",
    "midnight_sun",
    "how_to_be_single",
    "the_parent_trap",
    "50_first_dates",
    "the_break_up",
    "eddie_the_eagle",
    "love_actually",
    "the_lucky_one",
    "the_spectacular_now",
    "the_princess_bride",
    "17_again",
    "passengers",
    "the_edge_of_seventeen",
    "a_cinderella_story"
  ]
}