{
  "id": 3306,
  "title": "All the Money in the World",
  "starring": [
    "Michelle Williams",
    "Christopher Plummer"
  ],
  "runtime": 132,
  "genre": [
    "Thriller",
    "Drama",
    "Crime",
    "History"
  ],
  "description": "The story of the kidnapping of 16-year-old John Paul Getty III and the desperate attempt by his devoted mother to convince his billionaire grandfather Jean Paul Getty to pay the ransom.",
  "releaseYear": "2017",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/q6nE9Hf0ezszjI4DbCxwzQ73MMy.jpg",
  "categories": {
    "plot": 6.323076923076923,
    "acting": 6.660714285714286,
    "ending": 6.5,
    "soundtrack": 7.0,
    "cinematography": 7.0,
    "familyFriendly": 3.0,
    "funny": 6.833333333333333,
    "action": 7.1
  },
  "reviews": [
    {
      "rating": "2",
      "text": "I took one for the team.   Purchased this on AmazonPrime Monday on double double discount.   Avoid this film.   If you'd like the whole story of the Getty Kidnapping, well acted and beautifully photographed, watch Trust on FX.   This film is poorly written and directed."
    },
    {
      "rating": "4",
      "text": "I'm not sure how they managed to pull it off, but they turned what should have been a highly charged kidnapping caper into a big snooze. It might be because the only likeable character (the kidnapped teen) doesn't do much in the film."
    },
    {
      "rating": "3",
      "text": "After 35 minutes I turned this movie off because it was boring and not the thriller I thought it would be."
    },
    {
      "rating": "1",
      "text": "Feels like a Made-for-TV movie....I kept waiting for the Pillsbury Doughboy to show up and remind me to maybe go to the kitchen and check out the fridge....Why make this movie at all ? Why tell this story in 2017 ?....It all feels too pat and pre-digested....Also eerily dated- nothing much to offer that is new and insightful and will hold our interest....it's more of a \"and then kidnappers said.... yadda, yadda, yadda\" and Getty said \"well in that case.... yadda, yadda, yadda\"....All in all sort of by-the-numbers Movie-of-the-Week stuff circa 1970s or 80s.....OK I'm being nasty and will probably pay for it somehow some day (a safe will fall on my head as I'm walking down the street sort of thing)but I hate being bored and- sad but true- this movie really did bore me."
    },
    {
      "rating": "4",
      "text": "The only reason to watch this movie is for the performances of Michelle Williams and the last-minute replacement of Christopher Plummer. However...there was so much more that this story could have been about. The plot line is simple. Miserly grandfather won't pay the ransom until his grandson gets an ear cut off. The movie dragged for most of the 2+ hours, but thank goodness, the two performances maintained my interest as they tried to keep the boy alive."
    },
    {
      "rating": "6",
      "text": "Mark Wahlberg seemed miscast in this but Christopher Plummer and the rest of the cast seemed to be just fine.  In many scenes, it did seem like they digitally edited in Christopher Plummer and you could tell by watching the film.  In all fairness, I couldn't see Kevin Spacey doing this roll as well as he did but that type of effect detracted from what was otherwise a decent movie.  Still, after seeing this film, it made more sense why the Getty gas stations around here have equipment that hasn't been upgraded in about 25 years....  But it also reminded me of my father who when he was younger would make a lot of money but yet would never really spend it except to give it in taxes to the government.  This was on another level but that kind of logic always escaped me and as his daughter in law stated in the movie, \"what's the point of having all this money if you're not going to spend it?\"  All that she had to go through because he would rather buy paintings and houses worth millions instead of saving his grandson."
    },
    {
      "rating": "9",
      "text": "Well, if anyone needed proof as to whether or not Ridley Scott still had \"it\" as a director then here it is. This movie was an absolute triumph from beginning to end. He took a sombre subject and wove it into a story that effortlessly flowed from scene to scene, skilfully guiding the audience through the emotional turmoil endured by a terrified mother trying to rescue her kidnapped son. The main characters were well portrayed and had plenty of screen time. The cast is superb, I think this is the best role I've ever seen Mark Wahlberg in. Michelle Williams, as you would expect, delivers a robust and heartfelt performance, really getting under the skin of this misfortunate and desperate woman. The real star, however, has to be Christopher Plummer who delivers an astounding turn as the billionaire John Paul Getty. At 88, his work here is nothing short of inspiring. The essence of the character he puts forth imbues simultaneous feelings of both hatred and pity. We get a real sense of a strong, intelligent man confined to an ageing, frail body still striving to understand much of life's frustrating minutiae. Overall, this film is one of Scott's best in many years, it's excellently delivered and definitely deserves all the praise it's currently getting. Highly recommended."
    },
    {
      "rating": "8",
      "text": "Sixteen year old, John Paul Getty III (Charlie Plummer) gets kidnapped and his mother (Michelle Williams) desperately tries to get his billionaire grandfather, John Paul Getty (Christopher Plummer) to pay the ransom. If there was ever a director who can create either a masterpiece or a flop it's Ridley Scott. So with a real life story just waiting to be told you really can't go wrong, unless of course the studio decides instead of casting someone more appropriate for the role, such as Christopher Plummer they decided no, we need a selling point. We need a bigger name, Kevin Spacey, yes he'll be perfect. Throw on some makeup so he looks older, I'm sure this decision won't come back to haunt us at any point. I'm not saying the studio could have foreseen this but there was no real reason for Kevin Spacey to have been cast as eighty year old John Paul Getty in the first place. If the decision wasn't made to recast and reshoot as quickly as possible then there's a strong possibility that this movie may never have been released in cinemas and we wouldn't be seeing it now.December was dominated by Star Wars so it's nice to get back to normality and if you find yourself needing a good movie to escape into then look no further, All The Money In The World is worthy of your time and you will not be disappointed. Christopher Plummer is absolutely brilliant. His cold and heartless performance stands out above the rest and it's hard to see anyone else play that part as well as he did. Michelle Williams is giving another impressive and believable performance. A tense and emotional movie that doesn't drift, it keeps the atmosphere and keeps you engaged. A thoroughly impressive thriller, paced to perfection with some surprising moments of humour imbedded in this dark story. It's gripping and if like me you don't know how this story ends then you're in for some intense cinema viewing. Highly recommended."
    },
    {
      "rating": "8",
      "text": "This film stands a testament to Ridley Scott's masterwork as a filmmaker. When I heard of Spacey being replaced, and only doing a nine day re-shoot I had assumed that Spacey was there just in a scene or two. Though, my gosh I was wrong. Plummer was there 40% of the running time. Not only that, Plummer chewed the scenery to the extent I understood why Scott wanted Plummer for the role of Getty in the first place. All three co-leads gave impressive performances. People should go and watch it just for that, especially aspiring filmmakers who might find themselves in a dire situation with a project and see what can be done when someone is proactive and wanting to save their picture."
    },
    {
      "rating": "5",
      "text": "While the plot is interesting and the characters are well drawn, \"All the Money in the World\" wastes them in a draggy thriller."
    },
    {
      "rating": "6",
      "text": "Decent, solid filmmaking as always from Ridley Scott and surprising how substantial the role Christopher Plummer came in eleventh hour to replace Kevin Spacey is, and he may deserve an Oscar here even more than what he previously won for.  What's not so surprising is the true story and its been seen countless times scenario, though it does offer some poetic insights into the human condition regarding family, legacy, and money."
    },
    {
      "rating": "1",
      "text": "Unbelievable how they messed this one up, I was lucky enough to have seen the series “ Trust” which breaks down the story of the kidnpaping and All the characters to the T, and very close to how the actual events happened in real life. I figured the movie maybe exciting...it was nothing than a bore! I thought Michelle Williams was horrible and over acted, Mark Wallburg did very little acting,  the kidnapped kid, did nothing....the whole movie is sooo boring I fell asleep but was angry that the eviews here were so high that made me watch the movie. I hope to save minutes in your life by warning you about how bad this was. I gave it a one cuz I like Christophe Plummer."
    },
    {
      "rating": "6",
      "text": "Ridley Scott’s “All the Money in the World” is a lifeless thriller; acceptable but not admirable. 6/10The kidnapping of John Paul Getty’s grandson, J. Paul Getty lll is a rousing story, but it’s stifled by the bland, oppressively bleak, and muted cinematography of Dariusz Wolski. Getty’s estate is drenched in muddled and grainy blacks, much like his frugal soul. But the adherence to such a palette begins to wear on the viewer far before the meandering story concludes. With three time-jumps in the first twenty minutes, this is a story fixated on the journey of a Getty. From childhood, to confused and naïve middle years, to the final confident posture and astuteness of a tried a true Getty. It’s this intention, to span the mental and physical lifetime of a Getty, that ultimately drags the film into mediocrity. While the technicalities fall short, the acting is superb. It is impossible not to praise Christopher Plummer (J. Paul Getty) and Michelle Williams (Gail Harris) performances. With both displaying confidence, deep-seeded spite, and authority in every scene. Mark Walberg (Fletcher Chase) trails just behind, spending the film attempting to convince the audience he’s disappeared into his character only to break the illusion in the end with an unmistakably Walberg, verbal tirade. Romain Druis as Cinquanta also delivers in spades, masterfully pulling off the clichéd parental kidnapper with realism. Ultimately, this is a film that demands focus on the actors. If you look anywhere else, hear anything else but the dialogue, you’ll be sorely disappointed. With a tighter pace, some color saturation, and some desperately needed restraint from the score of the film, “All the Money in the World” could have been a rousing feature. Instead it drifts by, with the one memorable scene already claimed by Van Gogh."
    },
    {
      "rating": "6",
      "text": "joke.. All The Money In The WorldCutting off an ear, pointing out mistakes in each other and overlapping in an argument are some off the intense moments in All The Money In The World by Ridley who is a master in depicting these things with conviction but here the script is the bad guy as it takes too much time to sink in and probably wanders off its first hour in prepping the audience for what's about to come. Mark Wahlberg and Christopher Plummer oozes power on screen as they counter attack their opposite characters and wins over the audience like a charm. All The Money In The World definitely stands alone considering its genre but audience seeks more."
    },
    {
      "rating": "6",
      "text": "great story. kidnapping of the grandson of j.paul getty. the acting could have definitely used ousted kevin spacey.  both williams and wahlberg are VERY average.  movie got long and slow about 2/3 through, which made it just AVERAGE.  6 out of 10."
    },
    {
      "rating": "7",
      "text": "Think this story could've been told in a better, more interesting way, but what we get was solid enough and get's three really good performances out of Michelle Williams, Mark Wahlberg, and Christopher Plummer."
    },
    {
      "rating": "10",
      "text": "Kevin Spacey fans spamming and giving this negative reviews. Its a good movie."
    },
    {
      "rating": "9",
      "text": "An excellent film from Ridley Scott, although not one as inspired as films like Blade Runner and Alien. Michelle Williams gives a wonderful and completely convincing performance as Abigail Getty (Paul’s mother) and Christopher Plummer was excellent – especially considering the extra pressure he was under when he replaced Kevin Spacey. I did see a coming attraction with Spacey, and it looked like an exciting and Academy Award nomination-level performance to me – even though he was buried under prosthetics and heavy makeup. Plummer may have been lucky that there was no time to bury his looks since he and Spacey are equally talented and experienced actors, but Plummer “looks the part” more naturally. Charlie Plummer was also completely believable as the kidnap victim. I only found Mark Wallberg bland and forgettable. Even though I knew how things turned out, Scott managed to keep interest and tension high with excellent pacing, a first-rate supporting cast, and terrific locations."
    },
    {
      "rating": "7",
      "text": "Despite Christopher Plummer's remarkable performance in a last-minute retooling, this would-be thriller is surprisingly flat, with an inflated midsection and general lack of urgency. Perhaps that's because the film seems focused on the wrong elements -- namely, the behind-the-scenes negotiations associated with the primary story line and not enough emphasis on the personalities of the characters driving the narrative. This, coupled with a surprisingly uneven performance by Michelle Williams in a miscast role, causes the film to come up short of what could have been a first-class drama and character study. Wait for the DVD."
    },
    {
      "rating": "6",
      "text": "Of course, the big story here isn't the plot: Teenage grandson of John Paul Getty is kidnapped, while his mother (Michelle Williams) strives to save him. The real story is the re-casting of the patriarch role from Kevin Spacey to Christopher Plummer. He creates a billionaire that's so mean and stingy, there's no option for sympathy. Even Williams' performance, while convincing, never generates any real emotion. Meanwhile, a bland Mark Wahlberg is thrown in the mix as the security advisor to help find the kid. While the story is compelling and Ridley Scott's direction is stimulating, the whole thing is more an interesting history lesson than a moving emotional thriller or a forceful examination of wealth."
    },
    {
      "rating": "8",
      "text": "Based on true events, this is a solid thriller that is both compelling and engaging, with excellent performances and some chilling moments. Williams is superb, and she carries the film, with Plummer and Wahlberg both providing polished support. The pacing needed to be quicker, and it feels sluggish at times, through the tension in the third act ramps up sufficiently to maintain the tension, and the cinematography has moments of brilliance. The plot make use of some well executed misdirection, making for an enjoyable film overall. 7.96/10"
    },
    {
      "rating": "6",
      "text": "Even Michelle Williams couldn't save 'All the Money in the World.'  Based on the true story of the 1973 kidnapping of John Paul Getty III, the script was promising enough to attract the likes of Ms. Williams, Kevin Spacey, Mark Wahlberg, and several other notable character actors.  However, the framework ultimately proved to be overambitious, as evidenced by the non-linear structure that was abandoned halfway through the film and the unnecessarily long runtime.Director Ridley Scott was put in a difficult situation as a result of Kevin Spacey's avalanche of sexual assault accusations, and handled it admirably by cutting the actor's scenes from the film.  The role was then re-cast and re-shot with Christopher Plummer as J. Paul Getty, who was recently nominated for a Golden Globe for his performance.   My biggest problem with the movie was the cinematography.  Most of the film was shot with a blue filter, and while this in itself isn't an issue, certain accommodations on set--such as specific lighting--need to be made.  This obviously didn't happen with 'All the Money in the World,' and as a result, countless scenes were drearily flat, if not entirely washed out."
    },
    {
      "rating": "8",
      "text": "Ridley Scott delivers a for-the-most-part solid and often times tense thriller that does also suffer from some pacing issues throughout. Like I said however, the film's not without its tense or engaging moments, and the acting from Mark Wahlberg, Michelle Williams, and of course Christopher Plummer (famously replacing Kevin Spacey) all deliver solid reliable work. Overall, like I said, the film did feel a bit scattershot in its approach and pacing at times, but Scott's direction (which also deserves bonus points for directing a stellar performance out of Christopher Plummer at the last minute), along with Wahlberg and Williams' performances, and the engaging and worthwhile moments it offers make it worth checking out, and it's definitely breath of fresh air from Scott's 'Alien: Covenant' earlier this year in my opinion."
    },
    {
      "rating": "8",
      "text": "I'll admit it: Part of the fascination of this film is knowing the backstory and being amazed at the way Christopher Plummer's performance was added in at the last minute. But along with all that is a fascinating story, well-acted, especially by Plummer and Michelle Williams. The tension is palpable and the slice of life of the super rich is eye-opening as well."
    },
    {
      "rating": "8",
      "text": "The wild true story behind Ridley Scott's \"All The Money In The World\" - which is interestingly also the inspiration behind his brother Tony's 2004 flick \"Man On Fire\" - is what propels this movie to such incredibly entertaining heights. Not even withstanding the fact that a significant portion of this film was reshot over a period of time that measures out to barely a week, it's the script and narrative that are captivating enough. But factoring in all the logistical/ethical/practical dilemmas that must've played out in order for the powers-that-be to even get the chance to bring this film to the cinemagoing public, I definitely feel very lucky indeed. \"All The Money In The World\" is a taut, morally thought-provoking thriller with engaging characters, loads of cinematic moments, and a litany of impressive performances."
    },
    {
      "rating": "7",
      "text": "All the Money in the World is an average thriller at best. I have no idea why Mark Wahlberg was cast - he is always bland and unremarkable. Michelle Williams is too icy, so you don't empathize with her. Christopher Plummer is the movie's only strength - he is always good. Perhaps the movie's main problem is that it is too bloated, scattered, and unfocused across its long running time. Ridley Scott should have whittled it down to an hour-and-a-half."
    },
    {
      "rating": "10",
      "text": "True master of his craft like Mr. Scott is, turned Mark Wahlberg into an ACTOR ! Thought i would have never seen that but it happened last night. Disregard lukewarm reviews - this is a powerful film with great acting and money in the lead role. Do not miss !"
    },
    {
      "rating": "5",
      "text": "A tiresome kidnapping story that offers no real meaning behind it. Throughout the whole film, we watch Getty the old man with money continuously loving his money until his change of heart last minute while all the people around him even the kidnappers started acting out as humans with hearts. With solid performance by Christopher Plummer, melodramatic performance by Michelle Williams, endless cut-scenes that look like bad editing and of course a meaningless story about money, All the Money in the world is completely overrated in every way. Bottom line: we don't really care if the boy makes home alive or not because we are really tired."
    },
    {
      "rating": "8",
      "text": "All the Money in the World is a surprisingly successful film. This tense and strangely humorous thriller is another perfect example of how Ridley Scott is possibly the most reliable filmmaker working today. Michelle Williams is impeccable as the terrified mother of kidnapped teenager; Christopher Plummer is fabulous as the cold, stoic, and greedy J. Paul Getty; and Mark Wahlberg is completely serviceable. My only problem? This should have been filmed in black-and-white. The movie shows brief flashbacks in black-and-white, and they're far more aesthetically pleasing the color palette used. Other than that, this is a perfectly enjoyable historical thriller, with two great performances."
    },
    {
      "rating": "6",
      "text": "The scenes featuring Christopher Plummer as J. Paul Getty are compelling -- he is easily the best thing about this film. The scenes without him are a crashing bore."
    },
    {
      "rating": "7",
      "text": "No matter how much critical praise and award nominations Ridley Scott’s latest crime thriller may receive, it’s become increasingly likely that the film will forever be remembered as “the movie that replaced Kevin Spacey very quickly”.Which is a shame but completely understandable.Unless you have been hiding out in the Italian country side for the past three months, it’s likely you’ve heard that House of Card’s Kevin Spacey originally played J. Paul Getty (he even appeared in the first trailer) but due to being hit with multiple sexual harassment and assault allegations, TriStar Pictures and Scott decided back in November to completely reshoot all of JP Getty’s scenes with Captain von Trap himself, Christopher Plummer, in Spacey’s stead.Now let’s take this into context for a second, with only a month left until release, Ridley had to completely reshoot almost half a movie and not only did he still complete it all in time for it’s December release (Plummer’s scenes were all shot over the course of an 8 day period), not an ounce of wear and tear is present in the final cut.Sure there is some slightly obvious green screen going on in a flashback sequence depicting the Plummer Getty meeting with the Saudis in the desert, but it all turned out so impressively seamless. This certainly not a Justice League situation where that film was littered with awkward editing with the new scenes sticking out like a sore thumb.Say what you will about how hit (Alien, Blade Runner) or miss (Alien Covenant, A Good Year) Ridley Scott can be, I got to admire his versatility as a director.In a way, his latest crime thriller falls into that category of Ridley flicks like Body of Lies and American Gangster where they feel like more art-house versions of the type of movies his brother (Tony Scott) used to make.As far as the story is concerned, it’s a pretty straightforward but intense kidnapping tale that somewhat has an over-arching theme regarding how “money can’t buy happiness” but nothing too profound as far as Scott is concerned. Scott is very much pulled back this time around with nothing too flashy but what really elevates the proceedings is the incredible ensemble cast and some really sharp dialogue.The obvious main attraction is Christopher Plummer playing the notoriously frugal JP Getty. It’s not exactly a stretch for Plummer since he played a similarly greedy character in Spike Lee’s Inside Man but despite the quick shooting schedule, he delivers a pleasantly nuanced performance. You will be continuously shocked by how greedy Getty can be but at the same time, but Plummer instills enough of a warm human side to the rich billionaire that you end up pitying him at times.In a way, Getty Senior is a prime example that getting rich tends to reveal precisely who your true friends are.However our two main leads are Michelle Williams, playing the worried mother to Getty III, and Mark Wahlberg as Getty’s advisor and former CIA operative. Williams is great as a worrying mother and I can’t help but be impressed by how un-Mark Wahlberg Mark Wahlberg is in this movie. Despite being a former CIA agent, Wahlberg very much plays a mild-mannered business type and never turns into an action hero stereotype. Heck, he even manages to successfully hold back his signature Boston accent for the most part.However, I think the real show-stealing performance was provided by French actor Romain Duris who plays Cinquanta, one of Getty III’s abductors. Despite being a kidnapper, Cinquanta sincerely wants to see Getty III survive through his ordeal. Duris and Charlie Plummer (Getty III) share a great fascinating poignant chemistry with each other and despite Cinquanta being a kidnaper, Duris instills so much charisma into the role that you can’t help but like him.There are certainly flaws that prevent this from being a great film. Outside of his scenes with Duris, Charlie Plummer is unfortunately given the shaft when it comes to screen time. He does have one awesome scene, but for the most part we never really get to know Getty III too much outside of being the McGuffin. The movie also left a particularly bad taste in my mouth by having possibly one of the most cliche death scenes ever.It’s far from one of Scott’s best films and one could argue the production history is probably more interesting than the film itself, but ATMITW remains a solid, classy, and exciting thriller that will make for great rainy afternoon viewing.Although one day I would like to see the Kevin Spacey cut of the film just to compare the two performances."
    },
    {
      "rating": "7",
      "text": "I’ll be honest: I only really know Ridley Scott because of his work on the Alien franchise. And of those films, I’ve only actually watched the first one. Before starting this blog, I rarely followed Directors, though that’s an error I’m seeking to change.Much like Three Billboards, I’ve seen this film getting quite a few nominations this awards season. As I’d made it an unofficial New Years’ resolution to see more ‘real films’, I decided to give this one a whirl, despite knowing very little about both the cast, crew and subject matter.By the end, I found myself rather pleased, for quite a few reasons. The film is rather pretty to look at, despite it’s oftentimes bleak colour palette. One particular shot, one of Christopher Plummer’s last in the film, was especially gorgeous. The dark room was lit by a fire, and it was honestly beautiful.It’s worth noting that the pacing may not be for everyone. Based on the trailers, I’d assumed this would be a sleek kidnapping film with a fun soundtrack, potentially with a big shootout at the end featuring Mark Wahlberg’s character. Instead, it was a far slower paced, more mature film than I’d anticipated. There was barely a handful of action scenes, though those which were present were handled very well. Despite this, much of the film feels tense, especially thanks to Michelle Williams’s performance as Mrs. Getty.The characters are tough to judge as they are based on real people; It’s hard to tell what is inaccurate, or what is a poor choice from the director. Regardless, most of what I saw was perfectly enjoyable; Christopher Plummer’s Jean Paul Getty was quite wonderful, and I didn’t actually notice any of the re-shoots. They blended in seamlessly. I still do wonder what Kevin Spacey’s portrayal would have looked like, and part of me hopes that version is released one day, if only to sate my morbid curiosity. As mentioned previously, Michelle Williams was fantastic, regardless of how few emotions the plot allowed her to convey (it typically went from Sobbing, to elated hope, back to sobbing and so on). I must say, I’ve never been a fan of Mark Wahlberg. I don’t think I’ve seen him in a good movie, though that fault almost certainly remains with me. Still, Marky Mark (sans the funky bunch) gave a fair performance, even if I feel it was somewhat against his ‘type’. I see him as more of an ‘every-man’, rather than a highly trained, ex-government investigator. Lastly, I wish to briefly give credit to Romain Duris. He plays one of the kidnappers, but honestly, I found him to be the most likeable character in the film. All of the Gettys are annoying in their own way, but Romain manages to keep the most human character..Regarding the plot briefly, I’m rather confused. I always struggle with films like these; I don’t know how much credit can go to the writers, and how much actually happened. I will give respect to this film, however, for the end slate. It explains that, while the film is based on true events, some of it was dramatised for the film. Many ‘based on a true story’ films I’ve seen aren’t honest enough to admit they’ve deviated from the plot somewhat. *Cough, Cough, The Greatest Showman*.The music was something I struggled to pick out at times. Much of it blended into the scene, though many may argue that’s a good thing. Personally, however, I prefer iconic soundtracks. I will concede, however, that by the end, there was a particularly powerful song accompanying the Christopher Plummer shot I mentioned earlier. At one point, I also believe I noticed a foreign cover of James Brown’s ‘Man’s World’. It surprised me in the moment, and pulled me from the film while I tried to work out where I recognised it from.Overall, this film was a success for the most-part. At the halfway point, I probably would’ve given the film a 5/10. Very little had happened that earned my interest, but the second half managed to pull me back in. In total, I’ll give the film a 7/10.This doesn’t affect my scoring at all, but I feel I should briefly mention it. If you have epilepsy, I would advise you to steer clear. While many films claim to have ‘bright, flashing lights’, there was a short scene where I began to feel sick watching it, and I don’t even have an illness relating to such a thing."
    },
    {
      "rating": "7",
      "text": "This is a pretty impressive film from Scott with good acting, writing and it looks great."
    },
    {
      "rating": "7",
      "text": "A testament to what Ridley Scott can do as a filmmaker and while it's far from perfect, All the Money in the World is a fine movie about greed and betrayal."
    },
    {
      "rating": "5",
      "text": "ATMITW should be a thrilling suspense filled story with an array of interesting characters shot to the highest production value. Instead I found there are terrible pacing issues and the sense of threat from the films premise is simply not conveyed well at any level. I felt little to no connection with the characters! No doubt the now infamous and tumultuous production woes didn't help but when it comes to depth in its storytelling there is only a shallow puddle."
    },
    {
      "rating": "6",
      "text": "THe acting was great and in general it is a nice movie, but nothing great. I mean I read what happened in reality and I think this is depicted too mildly, like it couldve been much more of a thriller while here it mostly shows how greed can make people act dumb."
    },
    {
      "rating": "7",
      "text": "All the Money in the World is directed by Ridley Scott and stars Michelle Williams, Mark Wahlberg, and Christopher Plummer. The movie is about the 1973 kidnapping of J. Paul Getty III, grandson of Paul Getty, one of the richest men in the world. When his grandson is captured, Getty refuses to pay the ransom money, partly because he feels his other grandsons would get captured if he paid up, but also because Getty was in love with money. Despite having so much money, he hated to spend it and felt insecure. When he bought paintings, he thought of it as an investment and he even had a payphone for guests to use in his England residence. Anyway, Getty has his adviser, ex-CIA agent Fletcher Chase, played by Wahlberg, assist the kidnapped boy's mother in finding him and rescuing him from the kidnappers.The best part about this movie is Christopher Plummer. Plummer, who's 88 years old now and made his big debut in 1965's The Sound of Music, is wonderful playing Getty. He acts both cold and witty in his portrayal of Getty. It's more amazing because Kevin Spacey originally played Getty. When the horrific allegations against Spacey came out, director Ridley Scott cut Spacey out of the movie entirely and replaced him with Plummer. In the space of 2 weeks, Plummer was able to do all his shots and the movie was finished in time for it's Christmas release. As for the other actors, Willaims does a good job playing Paul's mother while Wahlberg did an only decent job in his role. Ridley Scott, who's directed movies for 40 years now does a decently good job here. The cinematography and music is well done, while the execution of the story (which does make some changes from the real-life story) is only done in an ok manner.As a character drama, the story works. We see Getty's state of mind and Paul's mother pleading for the elder Getty to pay the ransom. However, this movie also tries to be a thriller, and it's there that it does not work. Despite Scott's efforts, there's simply not enough tension to make this story thrilling. The somewhat slow pacing also hurts this. But in the end, All the Money in the World is movie with some great acting and story that works in some areas and does not as much in other areas."
    },
    {
      "rating": "6",
      "text": "It's engaging?Yes.It's well made?YesIt's has an interesting real life story?YesIt's well acted?YesIt's well directed?Yes, it's Ridley Scott for christ sakeThen why only 6?Because I found it incredibly underwhelming.It's even boring in some parts, I guess I was looking for something more absorbing, more attractive and entertaining. During the whole duration I felt like something was missing, a crucial turning point. I felt it like a tamed film, where everything is on point but nothing is memorable. Not a setback for Ridley Scott at all but he definitively can do a lot better. Also I cannot say if Kevin Spacey would've make a difference but Christopher Plummer did a pretty good job."
    },
    {
      "rating": "6",
      "text": "This the worst Ridley Scott movie I have ever seen. To be fair, I have seen some of his amazing work in Blade Runner, Gladiator and The Martian. While I know there are other work too, in popular consensus, I have never gotten around anything else that interested me.As much I dislike what Kevin Spacey did and knowing he was rightly replaced by Christopher Plummer, it is a very obvious observation that He was the best fit to play J Paul Getty ( Remember that shoulder-turn and glasses off makeup look in the trailer?). He was the perfect smokescreen to the story which is bland and almost as miserly as the Senior Getty. Luckily, Michelle William's Abigail Grace Getty is the pinnacle of the movie and she is the single reason why you should watch the movie ( and Mark Wahlberg's subtle machismo as Fletcher Chase is not too bad at all). I would have liked to have asked Mr. Scott and his financial supporters the logic behind paying Williams that much less money in the reshoot than Walhberg. If anything, that kind of additional fund should only be paid to Mr. Plummer who despite the somewhat bland material, does so much for the character, especially in that penultimate conversation in the movie. The guy is beyond legendary status and yet he is every bit as unbelievable as he ever was. Plus, he brought along his grandson, Charlie, whose opening bit and concurrent monologue is what hooks on you for the intended stretch of disappointment that is All The Money In The World.Let's be honest, when we Ridley Scott make a movie and with a cast that seems that good, we will always come back. A Gladiator and A Blade Runner movie is enough achievement to keep us interested for his entire lifetime. But this movie is a mediocre pesticide to hunt down Spacey's rapey legacy and that is all it will be. Kudos to the Plummers and Williams for doing their best."
    },
    {
      "rating": "5",
      "text": "This does deliver on all of it's genre tags, however it is really poorly executed and the general audience was very bored and they let their voices be heard. It was very un-entertaining and it wasn't fun at all. On top of all this it was really lazy and had a HUGE pacing issue and the plot did not take off even after 20 minutes in the movie. It was very simple, and the anti climactic ending just added to all the flaws this movie already had. The writing was lazy too, the acting was average at best (I love Mark Wahlberg's movies but I don't know how did he get involved with this) and the directing style wasn't creative either. It was 'Lazy' if it where to describe it with one word. I do not consider this movie to hold really amazing art value. I did expect more.Overall it's an average movie with a decent message at the end but up until that point it was really awful."
    },
    {
      "rating": "5",
      "text": "OK, we all know that a movie based on ‘true’ events is going to feature some Hollywood style exaggerations but, for a story that so many details are known about - being produced and directed by a ‘big’ name - shouldn’t we expect much more controlled believability?  Here, we have the kidnapped victim’s mother being involved in close-proximity (and highly deadly) search situations - which we all know is simply outlandish, and unworthy of any work claiming to be a major ‘based on fact’ motion picture (this we expect from a ‘B’ grader but a big $50 million movie?)  I had read nothing about the sacking of Spacey in the somewhat repugnant J.Paul Getty role, so the addition of re-shot scenes featuring Plummer offered no problem whatsoever (seems some people overreact to what they read about)   The excellent opening line attributed to young Getty, promises more than the overall delivers.  With that said...it’s still a good-looking, interesting, suspenseful story, and watch, but is also another reason to question the ability of Ridley Scott to be regarded as a respected mainstream director. It takes more than crowd-pleasing and control of the technical aspects of production - to qualify for the label of ‘great’ director. Michelle Williams as the distraught mother is the best thing about this one – she steals each scene she’s in - bringing a higher calibre to an otherwise ‘could have been better’ feature."
    },
    {
      "rating": "5",
      "text": "I agree with several other critics here, an interesting subject matter turned into a less-than-thrilling film yet Michelle Williams and Christopher Plummer are both captivating - pun intended. However, despite the two great performances, I spent the whole runtime struggling to feel for any of the main characters. Mark Wahlberg's CIA agent Chase is fine, yet you never get a sense his role is evolving until of all a sudden, he grows a sudden conscience and stands up to his employer, namely Mr. Getty. Plummer plays the billionaire miser with steel-cold callous and he exists in a fine mantle of the rich-man-obssessed-with-wealth yet you never real come to the tragic while Williams' Abigail is either no-nonsense, determined or wearied by her ex-father-in-law. Still, they are commanding but the movie is missing something with them. In contrast, I found I felt more for Paulo (Charlie Faulkner Plummer), the kidnapped grandson and his main kidnapper, Cinquanta (Romain Duris). The opening scene where the young Paolo is walking the streets of Rome... the way the actor carries himself, I was drawn to his portrayal and he brought to the screen a genuine pathos. Romain Duris also brought humanitas to his criminal. Their relationship would have been a more interesting tale. Otherwise, I finished the film with the same ho-hum attitude you get from reading a dry Wikipedia article. Interesting, I sat through the movie but I never felt I got to truly know any of the main three characters. Dramatic fast food... somewhat tasty that leaves you feeling hungry and ... meh."
    },
    {
      "rating": "7",
      "text": "This is a somewhat tense drama film, with a decent enough cast. The plot is a bit slow moving at times but the dialogue is reasonably good. I suppose you could say its a bit more of a slow burning psychological drama than am action based thriller. The characters are fairly intriguing, which is what kept me watching. I thought Michelle Williams gave a particularly good performance as the anxious mother, Gail Harris, while Christopher Plummer portrays the billionaire J. Paul Getty. He does certainly come across as quite a no-nonsense, somewhat chilling character but as a whole the film didn't grab me in the way that a particularly good one does. Its certainly watchable and entertaining, quite so in parts but as a whole its no more than reasonably good.Also, for those wondering, I do remember there was a US TV series about this very same story which aired the other year - the film isn't too bad by way of comparison, from what I remember. I suppose knowing roughly what happened maybe lessened the tension a bit for me. I wouldn't say this is more than a generally good watch and if it weren't for the performances by Williams and Plummer, I'd have given this a lower rate. I wouldn't recommend it as an amazing film as such, no but there are certainly worse films out there too."
    },
    {
      "rating": "7",
      "text": "Interesting story but lacks character development. I would have liked to see more dialogues from Paolo where he would talk about being neglected by his grandfather"
    },
    {
      "rating": "8",
      "text": "A good movie that has been remembered unfairly for it's behind the scenes dramas. Worth seeing"
    }
  ]
}