{
  "id": 3574,
  "title": "All Eyez on Me",
  "starring": [
    "Demetrius Shipp Jr.",
    "Danai Gurira"
  ],
  "runtime": 139,
  "genre": [
    "Drama",
    "Music"
  ],
  "description": "All Eyez on Me chronicles the life and legacy of Tupac Shakur, including his rise to superstardom as a hip-hop artist, actor, poet and activist, as well as his imprisonment and prolific, controversial time at Death Row Records. Against insurmountable odds, Tupac rose to become a cultural icon whose career and persona both continue to grow long after his passing.",
  "releaseYear": "2017",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/zmgsaKFWbmZ1Grz4SO0PLNxilv3.jpg",
  "categories": {
    "plot": 3.0833333333333335,
    "acting": 3.473684210526316,
    "ending": 2.5,
    "soundtrack": 2.857142857142857,
    "cinematography": 1.5,
    "familyFriendly": 2.8,
    "funny": 5.0,
    "action": 6.0
  },
  "reviews": [
    {
      "rating": "3",
      "text": "Once I saw the \"All Eyez On Me\" movie, it was all filler but no substance. And that's why this movie bores me to death. The acting was great, though both Jamal Woolard and newcomer Demetrius Shipp, Jr. stole the show and deliver solid performances of two of the most decorated and storytelling iconic rappers ever, 2Pac and The Notorious B.I.G. I just didn't like the Jada Pinkett one in the movie because trust me, she didn't act like the star who I know and loved today. It's just the characters that is totally messed up big time (not Biggie and 2Pac). The story... What story? It's like every 2Pac fan knows that he influences on what can happen if people doesn't change for a better life when it comes to violence, gangbangers, etc. and showcasing that 2Pac is not your ordinary auteur of rap, but he is a definitive hero in all of us and after his career cut way too short during the controversial battle between East Coast and West Coast rappers started to turn heads and all led to one of the worst tragedies in the Hip-Hop landscape and still remains unsolved to this very day. And that's why I lost touch with a forgettable script only if you could master the art of rap biopics if used properly in the vein of \"Straight Outta Compton\" (one of the most talked-about biopics of all time) remembering the good times and the bad times N.W.A has been going through from humble beginnings, contract issues, The LA Riots of 92, Ice Cube and Dr. Dre went seperate ways and done solo careers altogether, until \"Eazy-E\" Wright succumb to AIDS and that's how you make a biopic that is very edgy, raw, and exquisite. As for \"All Eyez On Me,\" this didn't quite fit the picture. I'm also pissed off at the end of the movie where they didn't mention about 2Pac's mom and widow, Afeni Shakur, who passed away last year due to cardiac arrest at 69. For a movie that somehow trying to reminisce the late rapper's rise to superstardom and his ability to make peace not war is very insulting. Releasing the movie to theaters just came after 2Pac's posthumous 46th Birthday and now a member of the Rock & Roll Hall of Fame Class of 2017 is that nobody doesn't want to pay a ticket to see this movie, always listen to his music and spread the message to everyone why they still listen to 2Pac every time his messages will inspire a generation. \"All Eyez On Me\" is the worst movie of 2017 (so far)."
    },
    {
      "rating": "4",
      "text": "The celebrated, contradictory, fast-paced, and short life of a hip-hop firebrand is sadly turned here into a pedestrian, unadventurous biopic.  Among similar fare, it falls incredibly short of not just Straight Outta Compton, a close-to-perfect and highly crowd-pleasing blend of cinematic flair and social commentary, but even the modestly entertaining and largely respectful Notorious.  It is not a film of grievous sins so much as it is simply a boring one.  Excepting a trite prison-interview framing device, it starts at the beginning of its subject's life and moves in a dutiful way from event to event to event, the cinematic equivalent of a Wikipedia article.  Characters often converse in platitudes or as if they are aware they are in a biopic of an iconic figure.  \"I'm going to be a revolutionary!\" chirps child 2Pac.  He is shown hesitating multiple times before leaving the hotel the night of his murder in Las Vegas in one of those artificial moments meant to evoke calls of, \"No!  Turn around!  Stop!\" among the audience.  Extensive lip service is paid to police brutality, poverty, and whether 2Pac can be a positive influence even while frequently embracing a hyper-masculine outlaw archetype, but the film's portrayal of urban life in the 1980s and '90s is unconvincing; it feels cheaply produced on a sound-stage and out-of-touch with reality in any visceral or tactile sense of the word.  And I am honestly not sure how well it serves its subject in regard to either flattery or constructive criticism and reflection; Demetrius Shipp Jr. resembles 2Pac, but he does not deliver a particularly charismatic or dynamic performance.  And the film is curiously disinterested in his actual music (songwriting, life on the road, designing cover art and music videos); it favors the fame created by the art to the art itself and almost plays as the story of a well-known young man who spent money, fought, had sex, went to prison, had more sex, fought again, and died abruptly...and every now and then dropped into a studio to rapidly, effortlessly record a verse, no big deal.  There are a few other, rather predictable sour spots, too:  the female characters can be sorted into the Matriarch, the Angelic Love Interest, and bit**** to be ogled by the camera (this is particularly uncomfortable during the film's hyper-sympathetic dramatization of a rape case).  Oh, and there is a fair bit of bad lip-syncing."
    },
    {
      "rating": "6",
      "text": "Not sure what's with the smear campaign on here among users but this film isn't awful. It is sloppy and ham-fisted and overlong, sure, but it's not awful. It is basically the TV movie version of STRAIGHT OUTTA COMPTON, with all the concert scenes being the highlights. Sure an icon like Tupac deserved a great vehicle to tell his story, but this one ain't half bad."
    },
    {
      "rating": "5",
      "text": "Tupac ist eine Legende. Seine weltweite Bekanntheit ist der Grund warum der Film überhaupt in die Kinos kommt. Aber warum reicht nicht einfach ein Fernsehfilm? Tupacs Geschichte ist auch irgendwann zu langweilig. Die Darsteller bemühen sich alle. Aber es bleibt ein besserer Fernsehfilm.-----------------------------------------------------------Tupac is a legend. His worldwide fame is the reason why the film generally in the cinemas comes. But why does not reach simply a TV film? Tupacs history is also too dull sometime. The actors take care everybody. But there remains a better TV film."
    },
    {
      "rating": "1",
      "text": "The music's good, but this movie can take a long walk off a short d*ck.This film gets it immediately wrong. It starts with Tupac being interviewed in jail and it's done in a documentary kind of way with flashbacks and all, and it doesn't work. It feels so unnatural. The film basically jumps to different times constantly, and I had no idea when was when and what was happening. The first 90 minutes almost feel like going between four to five different scenes over and over again. It lacks creativity and every scene feels exactly the same with characters just delivering terrible expository dialogue. It's boring, annoying, all the dialogue sounds the exact same and the random jumping between different times and characters literally gives me no chance to even try to care about anyone else than Tupac. Sure, it's a film about Tupac but this back and forth running between random terribly acted characters gives me a f*cking migraine.The film feels cheaply and negligently made. The colors are ugly, the directing is bland, the editing is ass and so many scenes are just done in the exact same spot that it feels like they just couldn't afford or bother to shoot somewhere else. So many times I was watching a scene and just thinking if anyone seriously even bothered with this wank. Tupac's audition scene to Digital Underground was probably the most slapdash made \"scene\" of the whole film. Also Snoop Dogg's portrayal was very forced in. He had little to no screen time which all of was very pointless, and his dubbing was so unnecessary and low effort. I think the guy can talk himself too.But the weirdest thing about the film is that in a movie about a musician there are barely any music scenes. Seriously, this bollocks has only like two or three of those. The ones that are there are ok. The music is of course good and the scenes have some nice camera movement between stage and the crowd and Demetrius Shipp Jr. is very believable, but why on earth are there so few of them? Was the movie so goddamn busy to get back to the terrible exposition tosh? In this 2 hour and 20 minute movie. I do not f*cking know but this is bollocks.The film does succeed though in making Tupac seem like someone who simply wanted his message out to the world in his music and it's respectable. That's all!"
    },
    {
      "rating": "0",
      "text": "Director Benny Boom's biopic of Tupac Shakur is one of the worst films I have ever seen. It's long (2 hours and 21 minutes of pure despair), plodding, surprisingly lacking in music, and completely devoid of focus or meaning. The performances are wooden at best and laughably bad at worst. Some scenes are so bad it is hilarious. The directing and cinematography are completely lazy and make the thrilling life of Tupac feel like a rip-off Hallmark channel movie. Events just kind of happen without reason, we spend too much time on plot elements that go nowhere at all, and WORSE, a lot of elements, (such as the backstage argument with Jada Plinkett) Are completely fictional! Mr. Benny Boom's vision of Tupac is a slap in the face to all real pac fans, and a quick cash grab. Mr. Benny Boom is an inept filmmaker at best and a greedy hustler cashing in on the greatest of all time at worst. Tupac deserved better."
    },
    {
      "rating": "0",
      "text": "Tupac deserved a storyteller as good as himself. It's a shame he didn't get one, unfortunately.Don't waste your time going to see this, wait until it's on tv was very disappointed."
    },
    {
      "rating": "0",
      "text": "I dont see real tupac in this movie. OMFGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGG"
    },
    {
      "rating": "8",
      "text": "I honestly don't know how accurate this is on Tupac's life, because I didn't catch his albums. But as far as the movie goes, it is pretty satisfying, entertaining and fun to watch, which I think it is the most important. I like the directing style, which is almost non linear until to the climax, which is nice. The actor has an amazing resemblance to Tupac, and plays it amazingly so prompts there. What I really didn't like that much, was the fact that it was somewhat rushed, and not enough time spent with some key characters influencing Tupac's life. Overall it's a good movie, and great depiction of 2pac's lifestyle."
    },
    {
      "rating": "0",
      "text": "The greatest of all time, Tupac Shakur, deserved better than this horrible treatment from the inept huckster Benny Boom. It looks like Mr. Benny Boom hasn't done any other movies, so humanity has that going for it, at least."
    },
    {
      "rating": "3",
      "text": "It may seem as if the crew behind this film knew what they were doing. All Eyez on Me has one job to accomplish... guess what that was. You know, if they would probably work more into the effort, probably this might as well be enjoyable, but also forgettable compared to the other movies released this year. Instead, what they just give us is just a poor man's excuse to get money by doing absolutely nothing."
    },
    {
      "rating": "2",
      "text": "If you're a fan of Tupac or any other 90s hip-hop/rap artists like N.W.A, The D.O.C, Warren G and Nate Dogg, and Snoop Dogg, don't get your hopes up- because this movie is a bloated mess.. When you watch this movie for the first time, expect for this movie to be very different on how other biopic movies are setup. First of all, Demetrius Shipp Jr. or the actor that plays and resembles as Tupac Shakur truly shines in this movie. He delivered everything in his power to give a good performance on portraying the king of 90s hip-hop in his first ever acting debut on the big screen. Everything else on the otherhand, is a no-no. This movie has severe issues on pacing, direction, production, and especially screenwriting. The pacing of this movie is atrocious that you are watching a dramatic TV movie. First of all, why did the director focus more on Tupac's downfall than his achievements? This is not how a motion picture biopic sets up with. All biopics needs to be historically accurate, not inaccurate or fiction based on a movie, well-known figure, or real life event. Second, what made the director to lose more focus on Tupac's background instead of the whole story falling apart. Did he really know Tupac before making his movies? Lastly, why did he direct this movie??! Was it because of money or what?! I had high hopes for this film to be masterfully well executed as F. Gary Gray's Straight Outta Compton, but no - it did not. However, when I looked at the production of this movie, the whole movie entirely felt like a movie that is meant to be made for TV rather than for a movie. Why did the director and the producers go that route? They had almost an outrageous amount of a $60 million dollar budget to make this film happen. The budget is more expensive than Straight Outta Compton and Notorious. When I saw the trailer, I anticipated that the movie will turn out to be good, but it ended so melodramatic that it made me not to watch this movie ever again. Lastly, the screenwriting of this movie has been written by three people, and the whole script itself affected the whole entire movie. Have they not know how bad the writing of this movie was? The script made this movie feels entirely unfinished and so choppy that the director continues on filming rushed content than polishing up scenes that needed a reshoot to make it better for the final product of this film. Overall, this movie was a piece of s#!t. I am deeply dissapointed how this movie has turned out to be. As a huge fan of 90s hip-hop and a rising film critic, I am completely disgusted of how the direction and writing of this movie has turned out to be and it is considered as one of the worst biopics I have ever seen in my life. Good job Benny Boom, producers, and screenwriters, y'all earned yourselves massive criticism by real 90s hip-hop fans and critics alike."
    },
    {
      "rating": "0",
      "text": "After a confusing and harsh Winter the Summer saves us with a familiar perspective: Summer \"blockbusters\" are typically terrible. I think Nick Allen said it perfectly, it's a mess for casuals and an absolute disappointment for everyone else. Any real 2pac fan will cringe from this."
    },
    {
      "rating": "7",
      "text": "Many people dislike this movie because it rushed everything - while I agree with that, I think it still was a good movie. And if you're 2pac fan you should still see this."
    },
    {
      "rating": "0",
      "text": "The decline of the USA.  All this movie does is glorify a thug.  For whatever reason we have an unfortunate obsession with this guy.  It just goes to show where we are heading as a country.  This movie sucked."
    },
    {
      "rating": "10",
      "text": "This is a cultural document. +5 literacy. EyezEyezEyezEyezEyezEyezEyezEyezEyezEyezEyezEyezEyezEyezEyezEyezEyezEyezEyezEyezEyezEyezEyezEyezEyezEyezEyezEyezEyezEyezEyezEyezEyezEyezEyezEyezEyezEyezEyezEyezEyezEyezEyezEyezEyezEyezEyezEyezEyezEyezEyezEyezEyezEyezEyezEyezEyezEyezEyezEyezEyezEyezEyezEyezEyezEyezEyezEyezEyezEyezEyezEyez"
    },
    {
      "rating": "10",
      "text": "All eyes on me is a great movie that’s is based on a true story. It is about a man named Tupac who was a rapper making it big in America. He was the face of hip hop, and had a lot of supporters. But he did run into a lot of trouble with the police and made quite a few enemies. Tupac had rough life as police would stop a lot of black people back in those days for no reason at all, and would treat them different to others. But society was harsh like this. But I believe this movie gives people a reality checks as there is a lot of deaths and makes people realise life is to short. This movie does have an age rating which means kids are not allowed to watch it as there is a lot of violence and explicit scenes, which means it is only for adults. Paying to watch this movie is worth the money as it is an interesting and action filled movie. I definitely recommend this movie to others and to people that love watching action and violent movies, this movie is definitely the one to watch. In my opinion I would also definitely give this movie a high rating on the quality, story line, actors and the setting of the movie. Overall this movie is the best so far that I have watched and I think that everyone else will enjoy it for sure."
    },
    {
      "rating": "5",
      "text": "Clearly attempting to capitalize off the success of Straight Outta Compton, All Eyez on Me is a decent biopic that glosses over and ignores what made Tupac a legend. Focusing mostly on his rap career, his rise to fame, his conflicts with Biggie and Bad Boy Records and his untimely and still unsolved murder, it glosses over his activism, his poetry and his captivating artistry. Tupac was an incredible human being who died too young and this film doesnt do enough justice to his legend"
    },
    {
      "rating": "6",
      "text": "The general audience views of this movie is shaped by which Tupac you loved in his music. If you liked the more aggressive thug life personification he portrayed then this movie isn't for you. If you appreciated Pac as more of the artsy and modern revolutionary then you'll like it. Now what's wrong with this film it's choppy and rushed at many points, especially when it came to the music video performances. Once you start grooving and embracing the moment...BAM its a hard cut to something else. This was true about many none musical scenes as well. I guess it was due to the amount of things that happened in his life but LT Huton and Benny Boom needed to do a better job. This film simply failed to connect to audience fully with any of the characters. Now even with all that said, it was still a good film but not the classic some hoped it be. I understood why it wasn't and that's because Tupac was simply a great artist, actor and thinker not Scarface. He had an interesting life and at the very least that was conveyed in this film."
    },
    {
      "rating": "10",
      "text": "This is the best film I ever seen! Thank you, Benny Boom!2Pac - is the real icon"
    }
  ],
  "recommendations": [
    "there_will_be_blood",
    "blackhat",
    "the_power_of_the_dog",
    "the_hateful_eight",
    "the_1517_to_paris",
    "black_panther_wakanda_forever",
    "the_american",
    "king_arthur_legend_of_the_sword",
    "gamer",
    "t2_trainspotting",
    "v_for_vendetta",
    "straight_outta_compton",
    "hugo",
    "roma",
    "blade_of_the_47_ronin",
    "the_twilight_saga_breaking_dawn_part_1",
    "public_enemies",
    "ben_hur",
    "antebellum",
    "the_gambler",
    "inception",
    "the_last_airbender",
    "the_social_network",
    "the_green_knight",
    "inherent_vice"
  ]
}