{"id": 4043, "title": "Allied", "starring": ["Brad Pitt", "Marion Cotillard"], "runtime": 124, "genre": ["Action", "Drama", "War", "Romance", "Thriller"], "description": "In 1942, an intelligence officer in North Africa encounters a female French Resistance fighter on a deadly mission behind enemy lines. When they reunite in London, their relationship is tested by the pressures of war.", "releaseYear": "2016", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/5JlOrfXqKuaLuoTnmIPdQF1Nci2.jpg", "categories": {"plot": 7.280701754385965, "acting": 7.527777777777778, "ending": 5.636363636363637, "soundtrack": 5.0, "cinematography": 7.875, "familyFriendly": 3.0, "funny": 8.666666666666666, "action": 7.181818181818182}, "reviews": [{"rating": "8", "text": "An old school style romantic thriller, Allied feels both modern and cut right out of the 1940s. Gorgeously captured, designed, and staged, Allied is an - at times - lyrical and entirely compelling look at World War II espionage through the eyes of two lovers. Director Robert Zemeckis cannot help but constantly reference Casablanca with his two lovers meeting in a bar in Casablanca, but though the film is deeply indebted to the Golden Age of Hollywood, it is somewhat similar to Steven Soderbergh's The Good German. Another film that I love (sue me), that film attempts to take the style of film noir - going as far as shooting in black-and-white with German expressionist lighting - and tell a story that could have been told in the 1940s. Many found it to be a mess and, admittedly, Tobey Maguire is entirely out of place there. Allied suffered much the same fate as it tried to capture the same appeal of a romance not-really-melodrama-but-sort-of-melodramatic war film akin to the aforementioned Casablanca or another Humphrey Bogart film, To Have and Have Not.That said, Zemeckis does not go the full nine yards like Soderbergh. Instead, he often channels films such as The English Patient or, believe it or not, Children of Men. Both far more recent, the two feel like a clear influence on some of the style of Allied, whereas the story and romance feels ripped out of 1940s cinema. For the former, the comparison is clear: war-set romance tale that partially occurs in the desert. It is clear from the trailer alone that Zemeckis had seen Anthony Minghella's stunning beauty of a film, with its style of desert shots clearly bearing influence as Zemeckis sets up stunning shots of the desert as one of the highlights of the film's cinematography. However, a sex scene in a car in the desert between Max Vatan (Brad Pitt) and Marianne Beausejour (Marion Cotillard) appears to also channel Minghella's film with the couple engaging in an extended sex scene as a sandstorm blows all around them. A similar scene also occurs in The English Patient, though without the sex. Instead, Ralph Fiennes and Kristin Scott Thomas simply chat and grow closer due to their small confines. One could argue that the raw passion between the two spies is their own way of sharing war stories like those shared by Fiennes.Yet, Allied's action scenes seem akin to Children of Men. Perhaps not a direct influence, I admit, but a stylistic one nonetheless. Upon viewing Children of Men years ago, I was immediately struck by its action scenes as Clive Owen and company try to shoot their way out of various destroyed buildings. Of every film I have seen, this film still stands as the one that best simulated the action scenes of a video game. It put you in intimate contact with the action and made it feel as though you were doing it yourself. It is is a hard style to describe and it is not due to the POV. Instead, it simply feels like a video game. Allied's action scenes have the same feeling with Brad Pitt and Marion Cotillard shooting their way out of the ambassador's ball with bodies flying. The shooting and reactions of the men who are shot feels like a cut scene from a first person shooter as the story progresses before you regain control of the main character. However, the film also feels akin to Alfonso Cuaron's 2006 film in its camera work. Though not a continuous shot or anything, the camera in Allied feels free flowing. It floats around the characters and the locale, hiding behind storefronts or rushing ahead of the characters and awaiting their arrival in the frame or just waiting on the curb after they drove off in the distance. Capturing the beautiful production and costume design, the camera in Allied feels like an entity in and of itself with it trying ambitious shots that were unlikely to be seen in 1940s cinema.Story-wise, the film shows the romance between Max and Marianne and, as the trailer shows, throws a wrench in their marriage with Marianne being accused of being a German spy. Deliberate, tense, and unpredictable, the film ditches the happy ending demanded by 1940s audiences and instead sees it to its logical conclusion: a torn relationship as a result of this accusation. No matter whether it is true or not, what was between them has been snuffed out due to suspicion and uncertainty. Brilliantly portrayed by Brad Pitt and Marion Cotillard, the two entirely sell both the rise and fall of the relationship. Captured in small subtleties, such as Pitt's Max lurking over Marianne in his uniform as he must go to work on his day off, the slow demise of the relationship due to her possible work as a spy is haunting and heart wrenching. From the excitement of a day off (the beginning) to the slow and sad realization that the one you love must leave (the fall), Allied captures the gorgeous nuances of this relationship in great detail. Though occurring during WWII and various bombings, the center of this film is always its two lovers."}, {"rating": "9", "text": "Marriage made in the field never work!This is definitely among the top five films of the year. But the sad part is the Oscars snub. Nominated for Costume Design, but I expected the Best Actor, Actress, and particularly Original Screenplay and Motion Picture. This amazing spy thriller-drama was directed by Robert Zemeckis of many popular flicks. The best casting in the recent films and visually so good of those 40s atmosphere, like it be the war or the society.This is the story of two spies from different nation who meet in Casablanca for a mission. Pretending to be a newly wed couple, soon they enter the real wedlock. The rest of the tale follows a couple of years later when a big question arises, in that they have to prove their innocence. Failing it could lead them to a serious consequence. So the narration filled with suspense and thriller takes over with a greater pace till the end.Obviously the film was long, but I did not mind or I could say I did not know how the two hours went on so quickly. Engaging plot kept me my focus on the screen. As we know, all these years the Oscars turned down the best performance recognitions, including this one for Brad.Before going to watch this film, I thought it was another World War II film which might be inspired by the real. But it was not. Takes place in the background of the same war, but this is a spy film. And their personal life and profession, how one another influences is what revealed. Now I don't know when such kind of a great spy thriller I'm going to watch next. I think it is massively underrated, especially stupid film critics and their takes on it was unbelievably wrong. I surely, highly recommend it.9/10"}, {"rating": "4", "text": "A long list of discrepancies and plot holes in this misguided film by Zemeckis, who seems to have gone downhill since 'Forrest Gump.' The cinematography.Brad Pitt is still Brad Pitt (so he didn't exceed or fail any of my expectations concerning his acting). Even Marion Cotillard couldn't find chemistry between her and Pitt. The plot has a few moments of suspense, but it's hopeless, from beginning and especially to end."}, {"rating": "2", "text": "Not bad start but bad end. It seems that at the end of writing the script the writer have lost his imagination and logic. Not convincing, clumsy and implausible reasons prompted the heroine to betrayal. Implausible and unconvincing the reaction of her husband. The ending of the film - a failure."}, {"rating": "10", "text": "Good movie and directing with great acting by both Brad and Marion. Not the adrenaline type (those who love actions only then this movie is not for you) and a bit slow but the suspense remains throughout though the end is lame.Romance - 8Action - 5Suspense - 7Drama - 8"}, {"rating": "7", "text": "Entertaining film. Everyone does a good job and there are some twist and turns in the film. This isn't gonna be remembered as one of the better spy movies but it's worth a watch."}, {"rating": "2", "text": "What’s it about?A Canadian airman working for the British forces in World War 2 meets a beautiful hero from the French resistance. The pair go deep undercover to assassinate a German target but end up storming the beaches of each other’s hearts.What did I think?A lot has been made of Brad Pitt’s separation from his wife, and rumors have abounded that Pitt had a secret dalliance with his on-screen partner, Marion Cotillard. Put those rumors to bed by watching just how little chemistry these characters have together. Every escalation in their relationship seems forced and unnatural. Some would say that we’re still feeling the tragic effects of World War 2. This film makes me agree."}, {"rating": "8", "text": "A superb movie, because it has a great ending and a great beginning. The best stories are those that confront ideology, and Allied is a good example of this. The story's central value, is that no one should be a tool for anyone else, no one should be a function, and the logical conclusion of this means no culture whatsoever. Further analysis of the film suggests an awareness of the idea that possessing no reason in the form of possession not being real as a means to logic isn't good enough. To break this concept down, the value of Allied is that logic has to mean that no type of possession is ever justified, even when the purpose of the possession is to condemn the idea of possession. The inability of a type of purpose in the face of the inevitability of type isn't an excuse for the basic notion of purpose being logical. Just because purpose is void of type doesn't mean that intelligence should ignore the problem of purpose. Obviously, all of this deems Allied a very pertinent and provocative movie. However, it isn't an equal to the Tom Ford drama Nocturnal Animals, which is just the paradox of the latter movie. And Alien Covenant is also an example of a stronger story. From another perspective, Allied comes across as the dichotomy of a pseudo-state of a pseudo-state; to be clear, Allied is not a capitalist story, designed to perpetuate nationalist ideology, but is instead designed to conjure ideas about the mystical, and the ability of history. Characters are repeatedly shown using settings in a way as to provoke thoughts about how history is possible. Again and again, Allied makes use of environments so as to make the viewer think about how identities are possible, and how the concept of the public is possible. How are functions possible? How are espionage agencies possible? How are armies possible? How are nations and businesses possible? About the first act: the suspense is well-balanced against the emotional behaviours, telling a reasonable story of espionage against the need to establish theme and future acts of the story. Indeed, the point needs to be reiterated about just how preoccupied the story of Allied is with the metaphysical, going from the desert, to the apartment of Marianne Beausejour, to the cafes and parties of Casablanca. People are shown in ways that co-exist with the surface plot, but yet allow a rational process of promoting awareness of the metaphysical.In terms of the latter acts, the middle of the movie has superfluous details, however, by the third act the movie is back to its feet again: the last 20 minutes of the story are very poignant, and very tense and extremely thoughtful in presentation. the exact manner in which Marianne Beausejour meets her end is iconic, and dramatic storytelling at its best. Marion Cotillard is a truly elite actress, and Brad Pitt has a very sensible role in this film.Allied is a true story of substance"}, {"rating": "8", "text": "This was so beautiful that I was willing to go all in for the ride. And I'm not hugely into Brad Pitt, but how captivating is Marion Cotillard?!  Not great but good, enjoyable, suspenseful. Love the '40s look, music, commitment to the cause."}, {"rating": "10", "text": "Allied is a fine period romance thriller with top notch production values, gorgeous cinematography, action, and intensity. This is probably among Robert Zemeckis' best films. Marion Cotillard gives her most outstanding performance in an American film here. Brad gives a solid and understated performance as well. They sizzle on screen together. I don't want to give away spoilers but the film is worth your money and time. Be wary of the smear campaign and corrupt bias against this film. This film is Oscar worthy and not worthy of contempt but there is an unethical faction of the press using Allied as a platform to malign Brad and sabotage his success. Be wary of certain trolls who are on a mission to sink a good film over an agenda. The film is right up the Academy's alley hence the negative spin and bizarrely scathing reviews because they are trying to prevent Allied from being an Oscar contender for Best Picture as well as prevent the film from being a hit. I hope Allied can pull through because it honestly doesn't deserve this backlash."}, {"rating": "0", "text": "Allied is good until the final act which \"breaks\" the movie. My dad trained pilots for WWII. I grew up in an environment where my parents' memories of WWII were like a backdrop. So I can say with confidence that this movie was utterly unrealistic. In London, a city being bombed day and night by Germans, a city literally being torn apart, people dying left and right, women and children being splattered to bits everywhere - a city so traumatized by the experience that to this very day they deliberately leave some of the scorched and burned parts of buildings as they were during the War to make sure no one ever forgets what was done to them, in London during WWII no one in Brad Pitt's position would have allowed the woman to escape and definitely would not have tried to run away with her. He would have shot her through the head. And any movie audience in the 1940s or 1950s would have walked out at the moment she confesses and he, instead of turning against her, tries to help her get away. It was absurd and completely unrealistic. There was a much better way to take the story that was very realistic and even more suspenseful and dramatic, but the writers apparently didn't see it. Let me put it to you this way, if Brad Pitt had not discovered his wife was a German spy but had instead discovered that she was sleeping with three different men, do you think he would have proclaimed his love and sought to help her? No, of course not. He would have kicked her out of the house. So how then can we believe that when she does something incalculably worse than that, something that contributes directly to the deaths of thousands and assists Hitler in his efforts to take over the world, that Brad Pitt would simply forgive her at the drop of a hat? It's beyond ridiculous."}, {"rating": "7", "text": "A fun adventure where every scene plays extremely well and yet something still winds up missing. I think Marion Cotillard's Marianne gets the short end of the stick here. The whole movie plays off the premise of \"is she or isn't she\" and yet when we find out, we don't really get an idea of why besides the basic expository one.Everything has been done when it comes to storytelling (or so they say), but it's doubly so when you don't give your characters enough life to stand out, to feel different than what's come before. And that's mostly what happens here. She's a type and not flesh and blood. It's hard to feel her pain."}, {"rating": "7", "text": "Despite a sluggish start, slow pacing and a long running time, Robert Zemeckis' war romance film succeeds due to magnetic performances from its two leads, beautiful cinematography, great attention to detail regarding the setting, and an interesting premise."}, {"rating": "10", "text": "Wonderful script and fulfilled by great actors! I hope it wins many awards. Marion did a wonderful job, as did Bra. I went to see this movie twice! So powerful."}, {"rating": "10", "text": "AlliedWhen I saw the trailer for Allied for the first time I knew I had to watch the movie. The story sounded intriguing and lets face it - its no hardship to watch Brad Pitt on the screen, big, small or otherwise. The man certainly is ageing well.As I sat down to watch the movie I thought that I knew what was going to happen. I was wrong. I did not know. It is a beautifully scripted and executed story with multiple layers that are interwoven to complete the picture in an unexpected way.The storySet in a time of great peril Allied tells the story of Max Vatan (Brad Pitt) and Marianne Beausejour, played by Marion Cotillard. They are thrown together on a secret mission to assassinate the German Ambassador in Casablanca, Morocco in the midst of World War 2. Their cover story has them pose as husband and wife.While they prepare for their mission they grow close and fall in love. Once the Ambassador is out of the way Max asks her to come to London with him to be his real wife. He serves in the army head quarter as a wing commander with the Canadian Air Force. Their daughter is born during an air raid, with debris flying all around them. They settle into a blissfully happy life. Nothing seems to stand in the way of their happiness.Until the day when Max gets called into the office and is informed that Marianne is suspected to be a German double agent. He is tasked to run a ‘blue dye’ on her or face to be executed for treason himself. He is to feed her false information and entrap the woman he loves so desperately.The two characters met on a secret spy mission. It is ironic that their happiness is threatened by the accusation of her being a double agent for the enemy.Final thoughtsBrad Pitt gives an outstanding performance in his portrayal of a man who is about to loose everything he holds dear. At first disbelieving he battles his arising doubts and distrust as he sets out to prove Marianne’s innocence.Marion Cotillard is wonderful in her role of the beautiful and brave resistance fighter who wants nothing more than to settle down with her husband and their child. It is the first movie I have seen with her in, as far as I am aware of, and I am really impressed by her performance I have to say. I am looking forward to seeing her next in January, when she has a role in Assassin’s Creed together with Michael Fassbender.Allied is about the age old saying that love conquers all. It is a story about a time full of violence and war. In a time when enemies are fierce and stakes are high, we see the story unfold in front of a haunting background. It reminds me a bit of the iconic movie Casablanca, in more ways than one. They don't make movies like that anymore very often.Luckily Paramount made Allied. It is a timeless story that will become a classic one day. I’m sure of it. It certainly deserves it."}, {"rating": "3", "text": "“They don’t make movies like they use to,” is a cry you hear from older/old folks and “Allied” shows them to be right. Director Robert Zemeckis and writer Steven Knight seem to be doing homage to a certain spy thriller genre that was standard in Hollywood during the 1940s and production values from clothes, cars, sets, etc., are there but it is excruciating slow paced not having the speed, editing, that this type of movie should have. There is Casablanca, a much more glamorous Rick’s Bar, a prettier Rick here called Max while IIsa is now a French spy but no one even close to Renault/Claude Raines, Ferrari/Sidney Greenstreet, a Nazi Major Strassi/Conrad Veidt, Peter Lorre/Ugarte nor a Sam/Dooley Wilson to play an equivalent to “As Time Goes By”.If you have seen the trailer you know that the movie is about two spies who fall in love when they meet for an assignment in Casablanca, marry, have a child, live in London and one has to prove the other isn’t a counter-spy. Finding out the truth takes about an hour and gives, maybe, 5 minutes of suspense and you won’t find/hear “I think this is the beginning of a beautiful friendship”.The film revolves around Max (Brad Pitt) and Marianne (Marion Cotillard) but, sadly, there is no chemistry between them and other characters, including Lizzy Caplan (from “The Masters of Sex” HBO series), who plays Max’s Lesbian sister, don’t add anything to the movie. Okay Knight wanted to make the movie more 2016 friendly but adding a Lesbian and a lot of the “F” word doesn’t help and neither does the very phony London blitz that looks like a fireworks show.The only emotionally moving scene is a brief one between Max and a pilot going on his first mission behind enemy lines. The ending not only has a Hollywood ending but, is way too long and softens the impact of what takes place just before.“Allied” runs 124 minutes, about 20 minutes too long, and seems to have its heart in the right place but shows they “don’t make them like they use to” though the director and writer tried with the production aspects achieving the goal."}, {"rating": "6", "text": "Mostly any Brad Pitt film has a perpetual potential to be a good.... even great movie.  dont count Killing em Softly...so.. this movie also had great potential.  Turns it it wasnt bad.  Great acting.. good plot... and even better ending.  Not a waste of your time.. go see it"}, {"rating": "2", "text": "Slow, unexciting, bare bones of a story, crappy ending.  I found this to be a pretty boring movie   Even Brad Pitt can't save it.  The very last half hour was not bad, but by then, who really cares?  Not worth anyone's time or money."}, {"rating": "6", "text": "Even considering its extremely slow pacing, Allied chalks up to be a decent romantic World War II thriller with decent performances and fantastic production design."}, {"rating": "8", "text": "Thrilling plot, good acting, and decent directing. This isn't a movie that I would write home about, but it was entertaining for what it is. At the end of the day, this movie will be forgotten in the mix of Brad's WWII movies."}, {"rating": "8", "text": "Robert Zemeckis' war time romance flick which opens in Casablanca, french morocco and proceeds to London,  definitely has its moments. First of all, Allied is beautifully directed with its refined characters, classy costume design, fine cinematography and editing, evocative score and a straight forward narration. The love making in the car amidst the sandstorm was arguably the most beautiful scene of the movie, along with some other engrossing moments. The lead pair of Brad Pitt and Marion Cotillard did justice to their characters, so as the rest of the Cast. This may not go down as the all time classic war drama or the best movie of the year for that matter, but definitely worth a watch."}, {"rating": "10", "text": "Great movie I think meta critic should band these trolls on this site. I mean people clapped at the end of the movie  well everyone is entitled to their opinion but this movie is great and acting is spot on. Good job Brad"}, {"rating": "6", "text": "It had a great trailer almost up there with the Revenant's and at the level of American Pastoral's but the movie adds up to just a pretty good one. But it still has some great parts;all the action scenes and the confrontations at the end. It probably didn't get the best reviews because the action wasn't elaborate,the in between scenes can seem dull and we don't know why BP falls for her. I might have prefered a darker ending but it still had some good emotion. Unfortunately I might have to wait till Rogue Uno for the next movie."}, {"rating": "4", "text": "As is so often the case, but particularly outrageous here, the trailer gives this film away!  It's one thing that the idiots who created and oversaw the trailer have no regard for a major twist coming a full halfway through the feature running time and chose to divulge that in favor of a marketing hook (the stars and scope were all that was needed geniuses, or alluding to it without spelling it out in the actual dialogue), but for Zemeckis to pull this s---- yet again is just beyond freaking belief!  Despite their faulty reasoning for doing such, I can point to exactly how that trailer ruined the movie instantly.  There are a couple shots very early in the feature, which had I not seen the stupid trailer these shots would not raise much suspicion, however having seen the trailer, these pertinent shots in the feature instantly give the ending of the movie away.  To go into more detail would mean spoilers which I don't ever do on here.  So holding back on divulging certain plot twists in trailers matters a great deal dummies!The \"What Lies Beneath\", \"Castaway\" and \"Flight\" trailers from Zemeckis and company all gave the entire movies away (in particular key twists or resolutions) which was a minor scandal in the media way back at the time of the former two, but those were all good movies warranting viewing even with the spoilers.  This is not.  You're better off compressing the experience in two minutes than wasting two hours on a stale, uninspired bore that is so derivative and contrived it plays like it was made by people who have been making movies all their lives, not having lived life.  The contemporized sex, violence and language don't help.  Particularly the language no doubt is unrealistic for the period.Zemeckis is a giant in Hollywood and deserves all his great success for quite a track record.  He's obviously brilliant, so for him to skip out at the very last stage by blowing the trailers is simply inexcusable."}, {"rating": "8", "text": "The current opus of Zemeckis has the spirit of classics but lacks of \"something\" to be stronger. However, chemistry Pitt- Cottilard is charming, and the score of Alan Silvestri works as well."}, {"rating": "7", "text": "I don't quite want to give it an 7, but it's more than a 6, so I've decided to give it a 7. Not sure how that helps, but I did enjoy the movie.  The characters are believable, you want to get behind them and you feel like the struggle they're facing is genuine. Beautifully done and I feel like it brought out some interesting subtleties of that war time that perhaps were no as well revealed or discussed in past."}, {"rating": "7", "text": "The entire movie is in the trailer. If it was not ruined by that fact, its a good movie. The slow pacing serves it good, with the few high points and plot twist well dispersed. It give value to the characters emotions. But since its a tin plot stretched for emetional effect, the trailer ruind it."}, {"rating": "9", "text": "Beautifully shot, with an expertly crafted storyline and smouldering performances, this is a polished and engaging film. The tension is managed via careful pacing throughout, and the portrayal of WWII era London was particularly novel and unique. A gripping film well worth your time. 9.04/10"}, {"rating": "10", "text": "A true movie after a long time. I have been tired of poking holes in plots and making fun of softends. This one is much better a real delight which kept me at the edge, since I was worried that it might be a softend again. We can subtract certain crappy things like the security at the RAF base being lax to the point that a family could walk  in with one pass at the height of the war. But the movie kept true to theme of being a love story in the war with a hard ending ."}, {"rating": "8", "text": "Enjoyable fare. Bit of a mashup of the old and the new: \"Casablanca\", \"The English Patient\", \"Mr. and Mrs. Smith\". After a fairly electrifying opening act as Pitt and Cotillard's characters meet cute for a Nazi assassination attempt in Vichy French Morocco, they return to England to settle in to life as a married couple. Pitt resumes his job as an Canadian Air Force intelligence officer aiding the war effort as the tide begins to turn for the Allies. Cotillard, after delivering a daughter, is the doting housewife and mother who seems happy to be married and in love during the Blitz of London. However, all the hints are there that maybe her spycraft didn't get left behind in Casablanca.Brad Pitt has that Hollywood-of-Yesteryear sheen to him that makes him \"look\" the part of a dashing WWII spy and hero, but is frankly flat for most of the picture including some scenes that demand some real emotional range. However, Marion Cotillard is another animal altogether. To say that she is the perfect modern actress to play a WWII French spy would be, ahem, quite the understatement. The film camera and lighting drink up her beautiful features, pretty much the case in any film she is in. A pro's pro at such a young age, she bilingually acts with an uncanny effortlessness.Robert Zemeckis is an incredibly underrated and versatile director. \"Who Framed Roger Rabbit\" and \"Polar Express\" anyone? But he also doesn't appear to have a cynical bone in his body based on films like \"Contact\" and \"Castaway\", so the last act here also is not as gripping as it should have been either. The middle of the film's intrigue is, well..., kind of shapeless and perhaps speaks to a sentimental blindspot in the director's narrative approach. Pitt and Cotillard have some serious sizzle in their early love scenes, including the ultimate car makeout cloaked in the privacy of a desert sandstorm. That might not do much to quell some of the rumors tied to the Brangelina breakup. Also, speaking of romance, Medicine Hat Alberta gets some serious love here too."}, {"rating": "7", "text": "Good movie and great acting, but I as I like the actual spy stuff more than the romance and all that, I felt that the first part and the action should have been longer to make it more interesting to me. Of course the ending and the unpredictability of what actually will happen was interesting too."}, {"rating": "5", "text": "If the German Nazis want to kill their own man who resists the Nazi regime, why they would choose a Canadian army person to kill their own man and taking so much troubles and risks to mislead the Canadian assassinator ?? Does not make any sense.  Was the Nazi regime afraid of their own CNN or what ??  Or maybe so much afraid of their Human Rights organizations so they required such disguise ??  Just ridiculous !!!!  The Nazis who murdered openly so many of their own men, suddenly turn so sensitive about killing 1 man of their own ??All the great intelligence agencies of the Allies don't have any clue about the above German plot.  They don't notice the Nazi spyess is a fake Marianne Beauséjour and that she is misleading their own man in Casablanca.  The Allies intelligence don't suspect how a known French resistant against Nazis befools the Germans so easily and becomes so trusted by the Germans.  The Allies never heard the real Marianne Beauséjour is dead.  The Allies don't have a clue the German ambassador is against the Nazi regime.  The British intelligence screws up in checking the spyess background before approving her entrance to England.  So, is this a new game of naivety & innocence or what ??   And then what justification they had to blame Max Vatan for marrying a German spyess ??  How could he know what his whole employing agency could not ??  For so many screw ups in such a short time, all the head intelligence officers should have been sacked immediately. The so brave German spyess who has balls to risk her own life in hostile places, suddenly loses them in a friendly place.  She could easily desert and let the British intelligence know the names of the German spys in England who jeopardize her.  She would be pardoned and safeguarded.   First the brave & tough Max Vatan rejects the spyess trials to seduce him.  First he tells her to close the lousy buttons of her shirt when she tries to seduce him and explains her why it's not good to have such relationship being in duty.  Later he makes a wild sex with her in the car.  And finally he asks to marry her.  So what the heck happened in between that caused such dedicated, rational and tough agent to flip flop with his personal feelings ??  Did just few smiles of her and her shooting abilities made this whole flip flopping difference ??  What did he see in her which we the audience could not ??  Do the movie makers conceal some top confidential secret about their spying couple ??  Please enlighten us.  The war is over, Hitler is dead, the Allies won.  So it's time to loosen up.  The setting is usually very good, except in the opening when he parachutes in the desert, which looks like the parachuter and the setting is taken from a computer game."}, {"rating": "7", "text": "Fairly moving war-thriller with good performances and very good visuals and music."}, {"rating": "6", "text": "Loved the costumes and the story.  Loved Marion as the femme fatale.  Couldn't believe Brad's character and his acting is so wooden.  Lot's of unrealistic things in the movie.  but it was entertaining."}, {"rating": "4", "text": "Great story and great acting. The movie is just simply boring and moves at a slow crawl!They want to every little minor detail to be featured in the film when you already know the outcome."}, {"rating": "5", "text": "Generally the critics were too polite. There are at least two critical plot holes you could drive a 747 through, and there was no chemistry between the two lead actors who have done great work elsewhere. Brad Pitt was especially wooden, but Cotillard was not much better. This movie’s idea of a surprise was a minor character suddenly moving from a British accent to a German one. Talk about cheap tricks! The scenes of the desert looked dirty and were oddly and dully colored. But the movie did wake up in the last half hour with some suspense and even some emotion, and if you can slog through the first 90 minutes, you get a reward of sorts in the last half hour where the pace picks up a bit."}, {"rating": "4", "text": "By the time the climax arrives, you don't actually care about the characters.  The build up is telegraphed, if you have seen the trailer you have seen the movie.  Is she a spy?  By the end you couldn't give a hoot.  Such a flat story that never gets off the ground.  Filled with a lot of forced scenes.  There is zero chemistry between the 2 main characters.  It is trying to be a love story, but they forgot the love, it is just a story about 2 people with nothing interesting going on for nearly 2 hours."}, {"rating": "6", "text": "The acting of the main characters is what elevates the film to a passable rating. Story line was unique but had pauses weaved into the plot. Worth seeing but won't be an academy winner"}, {"rating": "9", "text": "It really surprised me.Great movie i am surprised haven't watched yet only now that is streaming on Netflix.Script is solid ,acting and directing is what you expect from such established artists.Seriusly underated film."}, {"rating": "6", "text": "It's not a great film. The acting is a bit underwhelming and phoned in, the plot is not that well thought-out and there is no tangible drama or tension throughout the film with a quite predictable conclusion. The actors have no chemistry and Allied feels a bit more like a love letter to Casablanca and films of that era, than an original solid movie. Now that the objective criticism is out of the way, I had a very pleasant time watching this film in the cinemas. Robert Zemeckis still knows how to make a gorgeous and beautiful looking film. I found it entertaining enough in the theatre, but probably would only recommend it for a rental."}, {"rating": "7", "text": "This film is quite tense once the main plot gets going (the pace is a little slow at first) but the main appeal, to me, was the cinematography, with some decent swooping camera angles and the like. The main theme of spying or secrecy kept me intrigued for most of the film, although the two main characters did feel to me a little flat after a while but there are some good action scenes and it was certainly an entertaining watch regardless.I should mention that it is quite raunchy at times, with some nudity shown, so its not suitable for kids but then thats why it has a 15 rating in the UK, which seemed fair to me, not only for the sexual scenes but also in terms of the mass war related violence, with multiple gunshot scenes and the like.If I had to pick the better performance between the two main actors, I'd say that Marion Cotillard gives the better one.This is worth a watch but it isnt perfect either - its a decent enough war film with romance being one of the main sub-genres. Somewhere between satisfactory and good, so I'll go for a 3.5 star rating."}, {"rating": "7", "text": "While far from perfect, it's effective enough in telling it's story and will have you guessing till the end."}, {"rating": "6", "text": "Allied is an at times gripping WWII thriller, quite beautifully shot and ably acted even despite the faults in the script and plot. It is therefore a good agent movie, but not a very good one."}], "recommendations": ["the_beguiled", "beirut", "the_last_duel", "no_country_for_old_men", "the_aftermath", "sicario_day_of_the_soldado", "anthropoid", "hostiles", "wind_river", "valkyrie", "13_hours_the_secret_soldiers_of_benghazi", "child_44", "the_good_shepherd", "the_eagle", "widows", "prisoners", "a_most_violent_year", "everest", "flight", "hereafter", "patriots_day", "the_rover", "the_experiment", "jane_got_a_gun", "news_of_the_world"]}