{"id": 4761, "title": "Almost Famous", "starring": ["Patrick Fugit", "Billy Crudup"], "runtime": 122, "genre": ["Drama", "Music"], "description": "In 1973, 15-year-old William Miller's unabashed love of music and aspiration to become a rock journalist lands him an assignment from Rolling Stone magazine to interview and tour with the up-and-coming band, Stillwater.", "releaseYear": "2000", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/3rrkyLYbgLj84AYvjhdcJot4JPx.jpg", "categories": {"plot": 8.5625, "acting": 8.714285714285714, "ending": 8.0, "soundtrack": 9.25, "cinematography": 5.0, "familyFriendly": 3.0, "funny": 8.285714285714286, "action": 8.0}, "reviews": [{"rating": "10", "text": "Hands down, my favorite film of the 21st Century (so far)."}, {"rating": "10", "text": "Pure genious!There is not one flaw in this film and as a movie it is perfect and honestly ahead of it's time.If you have been there done that,then it's pure mind blowing.I'm not over hyping this movie,I'm just speaking the truth.I've seen this movie easily 75 + times and every time I watch it,I feel good all over again and that's the mark of a true gem of a movie."}, {"rating": "4", "text": "While it does contain some great moments, there aren't enough to make the three hours this film takes to finish seem less like three hours. Overrated."}, {"rating": "1", "text": "gihugugjguigihhkiyiguyyiyiihihihihhiuguggigjigugugugugugugugugyfugyftftdfyughiihihiguguggiigighiihigiihigiggiigi"}, {"rating": "10", "text": "I love the story,  the acting and the music. These elements create a lot of raw emotion. Great blend of comedy and drama. This is a masterpiece that should stand the test of time."}, {"rating": "5", "text": "Snore... this movie is really overrated. It's always interesting to see all the professional critics jump on the bandwagon & make so much noise about a movie that is at best average. This sort of reminds of the thing they all did with \"Crouching Tiger, Hidden Drag-queen\"."}, {"rating": "3", "text": "I don't care what anyone says about this critics' darling. This movie sucks big time. It's boring, I hate Kate Hudson, every character is either whiny or a wanker, and it just generally irritates me."}, {"rating": "2", "text": "Am I missing something? Evidently so, because everyone seems to love this flick. I didn't. I thought it was clumsy and annoying. Although there were three stellar performances: Frances McDormand, Phillip Seymour Hoffman, and Kate Hudson."}, {"rating": "5", "text": "One of the most disappointing films I have ever seen in my life. I love movies, I love classic rock, I, like the protagonist, discovered rock at a young age. However, the film is one word: BLAND. And bland is most certainly not a word you would associate with coming of age and the power of rock and roll. It's based on Crowe's own experiences, but it makes you wonder: Did he water it down or was it all really this uneventful? The performances by Patrick Fugit, Billy Crudup, and Jason Lee are very solid, while the usually great Frances McDormand was handed an underwritten character. Kate Hudson, meanwhile, plays \"band aid\" Penny Lane in a lifeless, generic fashion that makes it unlikely anyone would fall for her, and that she would have an interest in anything, let alone rock and roll. The film lopes along and never gains momentum, and leaves you with a flat feeling. If you want the real spirit of rock music, watch A Hard Day's Night, School of Rock, American Graffiti, and Dazed and Confused, and forget Almost Famous."}, {"rating": "9", "text": "Almost famous isn't just another film about music,  it could quite easily be considered one of the finest films about music ever made. It has so much to say about the music industry, being in a band, fandom, and the cynicism of journalism. It's also full of great actors playing characters that you actually care about, that you can truly invest in. As the most entertaining films always manage to do, it finds the perfect balance between comedy and tragedy. It's also got a killer soundtrack and some great 70s period details. It's fun in every sense of the word, and a thoroughly rewarding viewing experience."}, {"rating": "10", "text": "What Almost Famous has on its side is something that is seldom seen in Hollywood pictures. It is sincerity. There is something so endearing about every character and every scene in Almost Famous, and the genuine that Crowe has and gives to characters reflects onto the audience."}, {"rating": "10", "text": "Cameron Crowe, who was a teenage rock critic, drew upon his personal experiences to write and direct this film. It follows a teenage music critic as he joins a fictitious band, Stillwater, on their cross-country tour. It is funny, heartbreaking, historical, musically stimulating, and incredibly satisfying. A great film for anyone who is seeking to get lost in the decade of the seventies. This film is brimming over with nostalgia-inducing imagery and music."}, {"rating": "10", "text": "best 60's movie !!! Kate Hudson gave us her best performance of her all career in Almost Famous. The music is fantastic.  Make you want to back in time and live when the Rock and roll was pure and enthralling."}, {"rating": "10", "text": "A lovely film, Almost Famous is incredibly enjoyable and surprisingly heartwarming."}, {"rating": "8", "text": "yehh, it's a master piece, an intense story line, the real world behind the walls of music, the drugs, the sex, thew love,the life and everything. Just i was hoping the ending to be a little more intense but it's cool. Very nice story.\rIt's a must watch for everyone who want to feel something real, artistic and beautiful."}, {"rating": "8", "text": "The roots of it, Cameron Crowe's background, helps make this film seem real and oddly enough, human. The acting is terrific, why Kate Hudson ruined her career I will never understand. It's witty, funny, and sad at the same time. My only reason for it being an eight is the running time. Other than perhaps ten to twenty minutes, I enjoyed this film."}, {"rating": "10", "text": "\"The only true currency in this bankrupt world is what you share with someone else when you're uncool.\" - Lester Bangs (Philip Seymour Hoffman)\r Almost Famous is THE MOVIE that I want to watch again for the very first time. Of course there are a few movies I feel this way about but this is THE one that I would watch again with fresh eyes if i could.\r I remember very vividly the first time I watched Almost Famous. I was caught in it's glow and I didn't want it to end, ever.\r On watching it for what must be the fifth time, I still adore it and still didn't want it to end... but it did, so someday soon I will watch it a sixth time, a seventh time and so on.\r I'll tell you how I feel about this film but I can't use my own words because Roger Ebert has already perfectly articulated my thoughts on it: \"Oh, what a lovely film. I was almost hugging myself while I watched it.\""}, {"rating": "10", "text": "Almost perfect. Original theatrical version is a 9. \"Untitled\" version is a 10. The music, the acting, the pacing, the cinematography, the story. It's all top notch. I don't say this lightly, but it is my favorite film of all time."}, {"rating": "10", "text": "A movie you should go out of your way to get to watch, not on cable, but the full version. It's simply astonishing and amazing. You feel like you are there with a boy more or less coming of age and learning how hard the real world is. Two thumbs up."}, {"rating": "9", "text": "This is by far one of my favorite music-based films ever. With this film, Cameron Crowe offers a compelling, yet strangely funny film. I found the story completely engaging (granted that many events in this film are somewhat based on Crowe's real life experiences as a teen journalist in the 70s), the movie well-acted, and the film completely entertaining. This movie is a true work of art."}, {"rating": "9", "text": "An almost perfect ode to music, friendship and true feelings. A new all-time favourite, for sure!(9.5/10)"}, {"rating": "10", "text": "This movie is my all time favorite movie. I first saw this movie on tv when i was 14 and it changed my whole view on music. I thought pop music was good, haha not anymore!. i wish i was penny lane, kate plays her perfectly; she should of won the oscar.The band was so real. i love every scene, and the music in them is perfect. Crow did an amazing job and I wish i had grown up in this era so i could of excperence it instead of wishing."}, {"rating": "9", "text": "Very cute, fun, and rewarding movie."}, {"rating": "10", "text": "Great movie!! great soundtrack!! a perfect 10 !!"}, {"rating": "9", "text": "The music in this film opens up the seventies to those of us who were unfortunate enough to be born a long time after, in a very accessible and muted way. Take the tour bus scene where Russell enters the bus with just a pair of orange/pink swim shorts on. I'd never heard the song 'Tiny Dancer' before but instantly fell in love with it. You wish you were there to join in. YES we all know it's partly-if not mostly-fiction but it does make you crave just a small part of the fantastic experiance it must have been. Downright inspirational. This is the kind of film that makes you wish you were someone else-if only for one day in time. Tough question is who? For me it would be the critic. To be given the chance to step into their world within having too much irrepairable damage inflicted must have been amazing-if Cameron Crowe really did experiance this, he must regret the passing of time. If this film is a snap shot of the rock and roll period when it was already ending, i can only imagine what it would have been like seeing it at its peak. If you don't love this film, you're missing something!"}, {"rating": "10", "text": "One of the few movies that can satisfy all tastes. All of the supporting actors and actresses make the movie. Frances McDormand's turn as Elaine is a landmark in film as far as \"over-bearing\" mother roles are concerned. Zooey Deschanel makes for the perfect foil character of the film. Of course, Kate Hudson's turn as \"Penny Lane\" is an unforgettable performance, and is surely the best of her career. I also thorougly enjoyed Phillip Seymour Hoffman's portrayal of Lester Bangs. This movie is perfect for all audiences. There is something in it for everyone. It is one of those movies that can be watched over and over again. Not to mention the soundtrack will bring anyone who is not already a Led Zeppelin, Elton John, or Joni Mitchell fan to go out and purchase some albums..."}, {"rating": "10", "text": "Camerpn Crowe, a marvelous soundtrack and a story set at the nadir of great rock music. What more do you want?"}, {"rating": "10", "text": "Pete Travers got it right - I have sold my soul to rock and roll. And I would sell it again for a chance to live one day in the reality of this movie."}, {"rating": "10", "text": "This movie made me want to pick up a guitar, and never let it go. Its a movie that once you watch you never forget. I sat in front of the TV for hours after it ended marveling the eloquence and beauty that it showed. This movie made Tiny Dancer my favorite song. It made me wish I was Kate Hudson, and I was a hippie, it made me wish I could live life like her. The soundtrack is amazing, and over a year after I saw it, I still have a guitar in my hand."}, {"rating": "10", "text": "Amazing movie. I love Crudup, his indecision, not really sure where he's going. The stupid drama between the band that was so real. The coming of age for Young William. The passion of the fans and the love of rock and roll. Most importantly, the character of Penny Lane is amazing, as well as her relationships with William and Russel. Kate Hudson has never been better."}, {"rating": "10", "text": "Kate Hudson is the heart of this movie; Billy Crudup is its soul. Between them they carry this already astonishing piece of cinema-almost-verite into the stratosphere. Fugit is a wonderful debutante, and his honesty completes the godhead."}, {"rating": "6", "text": "Seems like a cheap knockoff of Rodney Bingenheimer's life. That's funny because Mr. Crow used to visit Rodney's club every chance he got. I just saying."}, {"rating": "10", "text": "I loved this movie. Funny, heartfelt, and great acting. One of my favorites."}, {"rating": "9", "text": "This movie was amazing. I've watched this movie more than any other movie. It really captures the spirit of rock n' roll. Kate Hudson's character was AMAZING. The Tiny Dancer bus scene is obviously one of, if not the best scene in the whole movie as well. Fantastic film."}, {"rating": "10", "text": "I would pay $50 to see this movie."}, {"rating": "10", "text": "The best film of the year."}, {"rating": "10", "text": "this movie made me think and so many things. Its wierd how can a person or act change your mind. im pretty sure everybody wants to be like peny lane. she so radicall and many ways. this is movie is one favorites. everybody should watched."}, {"rating": "10", "text": "You can't say you dislike rock and roll after this movie, you feel like you were the one on tour with them."}, {"rating": "8", "text": "A simple plot, but it gets very attractive inside the context of the rock and roll world, besides the soundtrack that is great, it's a essential movie to anyone fan of good music."}, {"rating": "8", "text": "Aspiring music William Miller lands the assignment of his dreams when given the chance to go on the road with rock-band Stillwater. Initially full of enthusiasm the reality will change his life forever.\r Based on director Cameron Crowe's real life experience as a teenage music writer the movie doesn't get wrapped up in trying to have a message and just concentrates on giving an insight into a world that most of us never see. Throughout the movie there are a number of genuinely funny and memorable scenes which alongside a great soundtrack makes for a convincing and entertaining movie."}, {"rating": "10", "text": "With its superb cast, powerful script and delightful soundtrack, \"Almost Famous\" certainly found the right tone to make me experience the sensations of both real music and true cinema."}, {"rating": "10", "text": "Itâ"}, {"rating": "9", "text": "Drawn from experiences early in his career, Cameron Crowe offers a delightful look at music, love and the 1970s. Almost Famous will have you grinning from ear to ear and humming along the way. It's magic!"}, {"rating": "8", "text": "A movie for anyone who likes rock n' roll, an original script full of lively characters, and looking to a have an entertaining time. A great American film that stands out amongst crap."}, {"rating": "7", "text": "Quite a fun movie that doesn't disappoint on many levels. Well written and acted with many both funny and heart warming moments. I would say that the one weak link in this movie is Patrick Fugit which proves to be problematic at times because he is in most every scene. There a couple scenes in particular with Hudson where Fugit fails to hold his own against her or the dialogue, and this took me out of the movie for a moment or two. These moments are few and far between however and most of this movie is entertaining. Hoffman in particular is extraordinary as usual. While this movie did nothing to hook me emotionally, it also did nothing to disappoint. An entertaining film worth a few viewings."}, {"rating": "8", "text": "Almost Famous is absolutely a very good film that I really enjoyed thoroughly. First off, the acting is great. Patrick Fugit, Billy Crudup, Kate Hudson, Jason Lee, and Philip Seymour Hoffman, are all stupendous. All of their characters are endearing in their own way and really steal the spotlight individually at times. The directing from Cameron Crowe is great and the story is told wonderfully. It really does not glamorize rock and roll of the time, but it certainly makes you fall in love with these flawed human beings as we interact with them through the eyes of a young 15 year old writer. We truly fall in love with these people as he does and struggle through the same struggles he does as a writer on this trip that changes his life forever. Ultimately, Almost Famous is a resounding success and a film that provides laughs, drama, and just enough of romance, to keep you interested. A truly great film."}, {"rating": "9", "text": "A great movie on a subject that doesn't personally engage me all that much, but did so in this film. the movies tone is a bit strange, going from comedy to series drama, but that is part of what makes it so good. Not quite special enough for a 10, but a great movie none the less"}, {"rating": "8", "text": "Crowe should get rewarded for Almost Famous, as it has wit, charm and feel-good overtones. The message and themes shine bright, and every character is there for a reason. Some scenes drag a little bit too long and are overplayed a little bit, which is the sole reason for my 8 and not 10 rating. But, still overall a great film and I definitely recommend it. I especially liked Eric Stonestreet as Sheldon the desk clerk, after seeing him in ModFam."}, {"rating": "9", "text": "Cameron Crowe gives us tremendous entertainment about his own experiences when he was a Rolling Stone writer during his teenage days. This 122 minute movie is very smart and gives us great performances from Kate Hudson, Patrick Fugit, Billy Crudup and the great talented supporting cast"}, {"rating": "7", "text": "With great acting performances, an impressive cast, an original and interesting story and a good soundtrack, Almost Famous is a genuinely good movie. While it would've been better had it been shorter and the movie was boring at times, it's still a fairly entertaining movie."}], "recommendations": ["the_greatest_showman", "yesterday", "hairspray", "begin_again", "bohemian_rhapsody", "la_la_land", "mamma_mia_here_we_go_again", "rocketman", "walk_the_line", "burlesque", "casablanca", "eddie_the_eagle", "moulin_rouge", "eternal_sunshine_of_the_spotless_mind", "sing_street", "forrest_gump", "cats", "sweeney_todd_the_demon_barber_of_fleet_street", "cinderella_man", "the_sound_of_music", "the_secret_life_of_walter_mitty", "into_the_woods", "we_are_your_friends", "jingle_jangle_a_christmas_journey", "in_the_heights"]}