{
  "id": 3857,
  "title": "Along Came a Spider",
  "starring": [
    "Morgan Freeman",
    "Monica Potter"
  ],
  "runtime": 104,
  "genre": [
    "Crime",
    "Mystery",
    "Thriller",
    "Action"
  ],
  "description": "After the harrowing death of his partner, detective and best-selling author Alex Cross has retreated to the peace of retirement. But when a brilliant criminal kidnaps a senator's young daughter, Alex is lured back into action. Teamed with the Secret Service agent assigned to protect the missing girl, Alex follows a serpentine trail of clues that leads him to a stunning discovery - the kidnapper wants more than just ransom.",
  "releaseYear": "2001",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/1YtsND7vSNymylnOSzgg3DdVFMB.jpg",
  "categories": {
    "plot": 5.866666666666666,
    "acting": 7.0,
    "ending": 7.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 5.0,
    "action": 7.333333333333333
  },
  "reviews": [
    {
      "rating": "10",
      "text": "Holy **** I never saw it coming. This movie is spectacular and has you on the edge of your seat till the last scene. The acting was just remarkable. 10/10"
    },
    {
      "rating": "10",
      "text": "This film is AMAZING! **** who say it is not have some sort of problem! It is funny, exciting and very interesting! The acting is amazing and the storyline is fantastic! Morgan Freeman is a true gem, along with the excellent Monica Potter, Michael Wincott and Mika Boorem! Go watch this movie in the cinema and then buy it on DVD because this is one that you will want to watch over and over!"
    },
    {
      "rating": "10",
      "text": "A fantastic movie, brilliant acting, excellent plot, this is one of those rare films that you can watch again and again! A lot of twists and turns with amazing direction! This movie will keep you on the edge of your seat! A thriller that will not creep you out with anything gory but will keep you on the edge of your seat! STRAP YOURSELF IN! AMAZING!"
    },
    {
      "rating": "10",
      "text": "A fine, fine film! This film does not let the book down, but is not as creepy or gory, an amazing watch and very addictive. Awesome acting and an truly brilliant plot, yes, we know films and we know for a fact that this is one that you have to see.."
    },
    {
      "rating": "2",
      "text": "people would be better off reading the book instead of watching this lamo movie."
    },
    {
      "rating": "10",
      "text": "This is definitely one of the best films ever made! I cannot get enough of this one! WOOP WOOP! I went to this one in the cinema with a group of friends in 2001 and we are still buzzing! Each of us have it on DVD and I still take it out as for it is an amazing watch! This really is an amazing watch! Monica Potter is FANTASTIC! Michael Wincott is SUPERB! Moorgan Freeman is AMAZING! Little Mika Boorem is truly GREAT! If you do not like this movie, go die in a hole because this is so BRILLIANT! Loved it and am sure you will too! ALONG CAME A SPIDER! :D"
    },
    {
      "rating": "10",
      "text": "This is such a brilliant film! Everything about this film is such quality and this is an amazing watch! How would someone not watch this film! They must have no life! This is so amazing! :D"
    },
    {
      "rating": "7",
      "text": "Great movie! Although it kind of seems like a stereotypical kidnappiing movie. Morgan Freeman does a great job bein a badass haha. Great plot twists as well. Definetly should watch"
    },
    {
      "rating": "5",
      "text": "Despite fair acting, Along Came a Spider is a web of imperfections.\rWith likable characters portrayed by Freeman and Potter, Along Came a Spider begins well, but slowly looses its suspense factor do to the faultiness of the script."
    },
    {
      "rating": "0",
      "text": "Le vieux barbon Freeman lorsqu'il n'incarne pas un président, reprend son rôle de temps à autre de flic rusé à la science infuse en hommage au rôle qui a précisément lancé sa carrière, à savoir le flic \"vieux de la vieille\" du médiocre Seven.Ainsi, le voilà en butte à un vilain psychopathe kidnappeur d'enfant mais ici au lieu de Brad Pitre comme coéquipier, il se retrouve en compagnie d'une oie blanche et bien pâle blondasse pour remonter le jeu de piste concoté par le vilain pas beau.Le film est un festival de clichés en tout genre, loin de l'ambiance sinistre de Seven évidemment (c'était David Fincher tout de même...) et Lee Tamahori ne délivre ici qu'une espèce de gros épisode de série générique américaine superficielle et téléphonée. A ce sujet, les invraisemblances se succèdent sans sourciller le long d'un scénario rocambolesque qui prêterait presque à rire s'il n'était aussi navrant.On s'emmerde donc énormément dans ce thriller bidon qui n'a décidément rien pour lui, y compris Freeman coincé en mode \"minimum syndical\". Las de lever les yeux au plafond, on éteint bien avant la fin !"
    },
    {
      "rating": "10",
      "text": "This is a fine, fine film with a fine, fine cast and when you look back from it, Along Came a Spider is one for the ages with a mix of comedy, action and that feeling when you just do not know who to trust!"
    },
    {
      "rating": "6",
      "text": "Long before Tyler Perry turned Alex Cross into an action star, the all-star detective was portrayed correctly by the legendary Morgan Freeman. While the first film, Kiss The Girls, was a huge success, it's sequel, Along Came A Spider was a bust, once again due to the fact that the strengths of the character were not utilized properly. The character of Alex Cross was created by Author, James Patterson, and has been responsible for over 20 best selling novels, because he's unlike any other cop in any other mystery series. Cross is a psychologist first, who gets inside the heads of killers. Once he knows what they're thinking and why they're acting the way they are, Cross is usually able to capture them. These stories make for terrific novels, but when transferred to the screen, producers felt that they lack the action movie goers crave. Despite a successful first appearance on screen, the producers felt that with more action and bullets, the sequel would do even better, they were wrong. When a Senator's daughter is abducted from an upscale private school, detectives are at a loss, but call Cross in when evidence and a ransom demand turn up at his house. Cross believes the criminal is using his admiration to cover up the real motives for this crime, and he needs to play into that role, in order to determine what those motives are. This was a terrific novel, but wasn't right for the screen, so much of the story was cut and replaced by the manhunt and police chases. These elements make for a more intense film, but don't do justice to the story. Alex Cross and his abilities are the story and are what make the series unique. Morgan Freeman returned hesitantly to do the sequel and he was right when he said he shouldn't have done it, mainly because it takes away from the brilliance of the first film. The producers of this movie even managed to screw up a terrific surprise ending and that really says it all. Along Came A Spider is not a bad film, it certainly has it's movements and a legendary star, but if you're a fan of the Alex Cross novels, expect to be disappointed."
    },
    {
      "rating": "4",
      "text": "Not very good. It is extremely implausible, the suspense falls flat, and the story is not that interesting. Luckily, they managed to snag Morgan Freeman for this one, which makes it alright, since he did a great job. Left a lot to be desired."
    },
    {
      "rating": "5",
      "text": "Along Came a Spider is a very average entry in the Alex Cross series. While Freeman provides a little wit and poise for the movie, it is hard to overlook the plot holes, non-sensical writing, and overall silliness of even the most basic plot points."
    },
    {
      "rating": "8",
      "text": "Along Come a Spider perfectly retains suspense for a thriller, then the dynamics of the plot sags. Typical scenario of kidnapping a small child of an important person. It may seem that there is nothing in the film, then for some time the plot twist worked out and I was surprised as a viewer, unfortunately this is less and less in modern thrillers."
    },
    {
      "rating": "3",
      "text": "A groggy thriller based on the classic novel; lacks real emotion, suspense and thrill. Wooden acting even from Freeman himself. The plot is ridden with illogicalities and plot holes. The score is too loud and annoying. At least they made Soneji properly creepy."
    },
    {
      "rating": "9",
      "text": "An Excellent movie one of my favorites by Morgan Freeman. well worth watching."
    }
  ]
}