{"id": 3605, "title": "Along Came Polly", "starring": ["Ben Stiller", "Jennifer Aniston"], "runtime": 90, "genre": ["Comedy", "Romance"], "description": "Reuben Feffer is a guy who's spent his entire life playing it safe. Polly Prince is irresistible as a free-spirit who lives for the thrill of the moment. When these two comically mismatched souls collide, Reuben's world is turned upside down, as he makes an uproarious attempt to change his life from middle-of-the-road to totally-out-there.", "releaseYear": "2004", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/ieTSn8YTsHoPK8GNf2J9eIkP5wo.jpg", "categories": {"plot": 3.6, "acting": 3.857142857142857, "ending": 4.0, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 4.0, "funny": 4.357142857142857, "action": 5.0}, "reviews": [{"rating": "8", "text": "Along Came Polly has various slapstick gags that are very amusing. Ben and Jen have perfect chemistry through the whole movie. This movie should have been a bigger hit, this is one of Ben's funniest movies."}, {"rating": "8", "text": "Overall great movie. However, there are some weird scenes. This movie shows us that you can fall in love again after a bad relationship and that you can fall in love with a person that's not necessarily \"your type\". It also shows us that the fast-paced lives we live nowadays sometimes prevent us from seeing the big picture. It also shows us how finding \"Mr./Mrs. Right\" can change your life. The central message of the film is there is love for everyone no matter how \"crazy\" you think you are."}, {"rating": "8", "text": "●°●°●°●°●°●°●°●°●°●°●°●°●°●°●°●°●°●°●°●°●°●+_+_+_+_+_+_+_+_+_+_+_+_+_+_+_+_++_+_+_+_+_+_+_+_+_+_+_+"}, {"rating": "7", "text": "It's just funny! It has really stand out moments. In my case, several inside jokes with my circle of friends. Critic was way too harsh."}, {"rating": "8", "text": "♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤:;:;:;:;:;:;:;:;:;:;:;:;:;:;◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇"}, {"rating": "7", "text": "I never understood why no one believed in Jen Aniston and Ben Stiller. I loved it, every step of the way. And I keep going back for seconds, thirds, etc."}, {"rating": "10", "text": "¤¡¤¡¤¡¤¡¤¡¤¡¤¡¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡•¡¤¡¤¡•¡¡¤¡•¤¡¤¡¤¡¤•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡"}, {"rating": "7", "text": "Give this one some credit. It's a funny, light-hearted rom-com that manages not make us angry about its cliches. We just sit in and let it fly by, and we're content when it ends. Why? Because we weren't expecting much to begin with."}, {"rating": "10", "text": "Noininguftdraersghniononinugrwqssdhjmljookinnigufysrrdguinniihguugugughuhiinihtyyfyf"}, {"rating": "6", "text": "Enjoyable enough for what you except it to be. Jennifer Aniston's presence is always easy to watch while Ben Stiller can be obnoxious. Predictable as any romantic comedy can be."}, {"rating": "6", "text": "Reuben Feffer (Stiller) is a risk assessment manager who has played everything safe his entire life. When he catches his fiance in a compromising position with her scuba diving instructor he returns home heartbroken and unsure how to get his life back in order. Taking advice from his boss and friend he soon runs into the risk-taking, and slightly crazy, Polly (Aniston).\r Anyone that has seen this type of movie before (particularly the superior 'Theres Something About Mary') will know exactly what to expect, namely all manner of crazy scenarios in which Ben Stiller is able to do what Ben Stiller does, and that includes the now mandatory silly dance. There are a number of funny moments throughout this movie, many provided by the excellent Philip Seymour Hoffman as a washed up 80's movie star, and for any men in the audience Aniston is as gorgeous as ever. It is however hard not to feel that you have seen it all before."}, {"rating": "5", "text": "ALONG CAME POLLY is a sometimes-funny, average Ben Stiller film.  Keep in mind he was also working on MEET THE FOCKERS and DODGEBALL in 2004, so you can't expect much."}, {"rating": "1", "text": "Without its major silliness it would've had heart and some good performances. But sadly it is too raunchy to be taken seriously at all. I give this movie 16%. Yeah don't see this."}, {"rating": "3", "text": "Not the worst movie ever made, but Stiller and Aniston play predictable and overdone characters in a setting that proves to be too familiar. Minus the laughs and the two big stars flounder in a romantic comedy that fails to intrigue or move those who watch it. You'd expect a lot from this pairing but Stiller just plays a safer and more boring version of 'Gaylord Focker' whilst Aniston feels very much like her 'friends' character without the antics (although she promotes herself as a risk taker) Both actors have excellent movies in their collections, simply erase this one from memory and switch to some of their golden material."}, {"rating": "6", "text": "The movie has it's laugh,and the actors are not that bad but Ben Stiller can do better than this.The movie is too predictable,even Philip Seymour Hoffman can't save the movie."}, {"rating": "4", "text": "don't do that..Along Came PollyBen and Jennifer both seems distracted here along with the creator who jumps on both the sides; the comic and intensity, and fails on landing the either of it."}, {"rating": "5", "text": "Has a few funny moments but predictable as most romantic comedies.  Ben and Jen for the win."}, {"rating": "4", "text": "Along Came Polly: 4 out of 10: Welcome to Dharma and Greg the movie. Some stupendously unoriginal ideas meet Ben Stiller going to the Farrelly Brothers' well once to often.\r For example blind sweater wearing ferrets are not funny or cute for that matter and what ganja toking screenwriter would think so. (John Hamburg actually who penned the much funnier Zoolander as well as Meet the Parents)\r The bathroom humor is not funny and kills the romantic plot. Stiller uses a decorative bath towel instead of toilet paper on a first date with Jennifer Aniston. The fact that they have a second date pushes this movie into the realm of science fiction. I've known woman to end a ten-year marriage for less.\r Some ideas were funny on their own (Philip Seymour Hoffman's child actor character for example) but not nearly enough are done with them and we are quickly back to Dharma and Greg um excuse me Stiller and Aniston. Actually if it wasn't for Hoffman as well as Alec Baldwin's Jewish boss character and Bryan Brown's Australian eccentric there wouldn't have been much of a laugh during the entire film.\r It's pretty sad when you are wishing the leads would leave the screen so we can get back to the funny stuff. (Though Anniston does look hot in her PG-13 sex scene.\r The director (John Hamburg again) cut Debra Messing's rap song as not in tone with the film (seen in deleted scenes). He was right it wasn't in tone with the rest of the film. It was freaking hilarious. More outrageously funny scenes and less of the usual Stiller stick and romantic plot would have been welcome."}, {"rating": "3", "text": "I movie that wants to be some sort of gross out rom-com but falls well short on both accounts, with it's recycled humour and lack of imagination."}], "recommendations": ["wedding_crashers", "tammy", "the_boss", "forgetting_sarah_marshall", "anger_management", "wanderlust", "dodgeball_a_true_underdog_story", "due_date", "like_a_boss", "dirty_grandpa", "date_night", "trainwreck", "get_hard", "friends_with_benefits", "sisters", "just_friends", "the_wedding_ringer", "central_intelligence", "the_proposal", "tower_heist", "masterminds", "zoolander", "that_awkward_moment", "the_dilemma", "the_heat"]}