{"id": 608, "title": "Alone", "starring": ["Jules Willcox", "Marc Menchaca"], "runtime": 98, "genre": ["Thriller", "Horror"], "description": "A recently widowed traveler is kidnapped by a cold blooded killer, only to escape into the wilderness where she is forced to battle against the elements as her pursuer closes in on her.", "releaseYear": "2020", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/n9OzZmPMnVrV0cMQ7amX0DtBkQH.jpg", "categories": {"plot": 4.3076923076923075, "acting": 4.785714285714286, "ending": 4.5, "soundtrack": 5.0, "cinematography": 6.0, "familyFriendly": 3.0, "funny": 1.5, "action": 6.5}, "reviews": [{"rating": "9", "text": "I can't believe some of the negative reviews posted here. Did they see the same movie as me?! While some suspension of disbelief is necessary it doesn't detract from what is a great, edge- of-your-seat thriller. Go see."}, {"rating": "8", "text": "Nice {nasty!} little thriller that doesn't overstay it's welcome. Divided in to 'chapters' such as 'The Road', 'The Clearing' etc. Alone makes the most of it's brisk running time and the result is a movie that's really good and feels more substantial than it probably deserves to."}, {"rating": "9", "text": "While Alone doesn't 'reinvent the wheel' as thrillers go, it's great, nerve shredding entertainment. In the Covid era this modest film should do really well at the cinema {where it's being screened} if there's any justice. Recommended."}, {"rating": "8", "text": "While Alone doesn't score highly for originality {it has a similar tone to The Hitcher} and may not linger long in the mind after it's finished it's a gripping, taut 'survival' thriller well worth 90 minutes of your time."}, {"rating": "9", "text": "No offence to UltimateRich but ignore his review as he's confused this movie with another of the same name. As others have already said, Alone is a really good survival thriller."}, {"rating": "10", "text": "Suspenseful! Deliverance-oogy feeling and heart racing. Just loved this! No nudity and doesn't go too far... one of best suspense films this year."}, {"rating": "7", "text": "به عنوان یک تریلر با برخی لحظات ترسناک، میشود این فیلم را جدی گرفت. از نظر شخصیتپردازی اما امتیازی ویژه ندارد. مدت زمان فیلم کمی طولانی است. عملکرد دو بازیگر اصلی خوب است و موسیقی فیلم هم قابل قبول.از این اثر انتظار یک کار روانشناختی یا فلسفی عمیق نداشته باشید."}, {"rating": "8", "text": "I rather enjoyed this. I thought the writers and director did a pretty good job with taking an otherwise subpar plot and finding a way to keep the audience engaged throughout - at least I was. With the exception of a couple of scenes that lingered a bit longer than they should have, this film was otherwise, well done."}, {"rating": "7", "text": "Originally a festival fave in 2018, this film became a sizable success during the pandemic benefitting from great reviews ( 94% RT) and a solid audience score. The film is an intense, sometimes frustrating, simplistic theater that focuses on a young woman moving cross country who comes up against as serial killer. It's a survival thriller that takes a bit to find it's stride but when it does is quite impressive. Filmed beautifully with a solid lead performance this stylish horror flick is slick, escapist entertainment. I expect great things from the director and actress moving forward.***.5/5"}, {"rating": "9", "text": "Alone is a great little movie! If taut, breathless,'çat and mouse' survival thrillers are your thing this is highly recommended."}, {"rating": "4", "text": "Massively overrated. It's poorly written and poorly executed.The serial killer is a cartoon that basically reviews the vast majority of cliches that involve these characters and his dialogues hurt because they're so stupid.It certainly has its positive points, more than anything that its main character is not a lady in distress, so she's not a simplistic victim, however the story offers little to make you feel really interested or concerned about her well-being.So it goes without saying that it never becomes a more intense or more engaging experience.It's hard for me to understand how it has received so many positive critics."}, {"rating": "2", "text": "This movie was terrible. It was a paint by numbers cat and mouse story, with the main character making stupid decision after stupid decision. Completely unbelievable behaviours that served only to lead to the next struggle scene. The world didn’t need this stupid movie to be made. Don’t waste your time or money."}, {"rating": "3", "text": "Who locks someone up and leaves the key in the keyhole? That did it for me. That’s just one of the many ridiculous things in this movie."}, {"rating": "0", "text": "Alone?Warning: SpoilersWithout addressing the unlikely way the lead character decides to handle a potential stalker in the first part of the movie, this movie is just a frustrating unlikely comedy of errors. Every character always makes the worst possible thoughtless choice, which completely takes away any true challenging and compelling entertainment value; leaving you feeling annoyed and irritated. The hunter doesn't fully grasp the concept of a rifle, and that it doesn't work well at close range? The main protagonist is trying survive though out, yet has no kind of survival instinct? Always choosing to be as close as possible to the killer with no real attempt to defend yourself or escape? knife in hand with your attempted killer giving you his back while driving, and an opportunity to stab to kill you take a jab at the wrist? And in the final scene, at last with a working cellphone on hand in the woods you decide it best to stand in the only open treeless area to call the killer's wife instead of the police in an attempt to convince the wife that a stranger who she's never met on the other side of the call is about get murdered by the man she loves?"}, {"rating": "3", "text": "(Mauro Lanari)Spielberg was lucky enough to be able to make his debut in '71 with \"Duel\": free to choose a man as the protagonist and to give the film a metaphysical value. In short: still far from these mandatory times of neofeminist empowerment."}, {"rating": "1", "text": "Some of the most annoying characters I've ever seen. I would have given this 0/10, but I give it one point for Bailey Coppola, who both looks and over acts just like his uncle Nicolas Cage."}, {"rating": "0", "text": "What a waste of money. Why make a movie were the characters make choices no one would in real life. Makes it very annoying and unwatchable."}, {"rating": "3", "text": "This was the least plausible movie I have ever seen. The choices made by the people in the movie were so unrealistic. For example, if you're running away from someone in a thick forest, just lay down. You will never get caught."}, {"rating": "3", "text": "Okay the movie all together was not all bad but it was not good either. It was not realistic as in she is in the woods all night and in the morning his car passes right next to her. What are the odds? She also makes alot of bad decisions during the movie that to me are not realistic at all. The man has some kind of a 6th sense sensing her at some point when she is bidding in the car which made me disconnect from the characters. The movie did not give me anything to get attached to the woman or make me care if she lives or die."}, {"rating": "6", "text": "Ok this is a pretty entertaining movie with some nice cinematography and good suspense but as with a lot of films it falls down due to the characters making unrealistic choices. They are as follows:-She chooses to call the police much later than you would do in reality. He blatantly stalks her for ages but she doesn't do the logical thing until its too late. Makes even less sense as he looks like a textbook serial killer-If you were a serial killer you wouldn't risk exposing yourself so early on and being reported or avoided. You would just go straight to slashing her tires like he finally does.-She doesn't ask for the help of the people around her at some of the truck stops when she's freaking out, as he's pulling up-when she realised her tires are slashed and sees a car coming she doesn't just bolt into the woods and avoid him. She waits in her car to be abducted-He locks her up and gives her a chance to escape whereas in reality a real psycho would just rape and kill you ASAP. -she doesn't keep using the current of the river to gain more distance from him. She gets out of the water too early-The guy who helps her would have just shot the psycho a lot sooner and not be drawn in by it. -She would not have climbed in his car without knowing if the keys were in there or not-She wouldn't have hid in the back of his car and attempted to kill him. -She wouldn't have entered a clearing of burnt out forest and exposed herself.-when he's being attacked by her he continues to drive instead of stop and free up his hands. It's also unbelievable that he kept managing to find her in the forest, also that the helicopter would have spotted them all covered in mud near the end. Aside from all this, I liked it. It had a cool retro feel about it."}, {"rating": "9", "text": "By the end of the independent film directed by John Hyams, Alone I was out of breath, my palms sweaty, my knuckles white. As the credits rolled I realised ninety minutes had gone by in what felt like an instant. It isn't often a piece of media can conjure such intense emotions as Alone does so effortlessly. Alone follows Jessica Swanson a woman moving house to a new neighbourhood in her car however she is pursued by an ever-present stalker and it all evolves from there into a symphony of thrills. The plot is beautifully simple, almost self aware in its primitiveness. It attempts to deliver a taut, tense cinematic experience which it succeeds at in flying colours. The character of this elusive stalker frightened me to my core. He is so grounded in reality which makes him all the more disturbing. Like a wolf in sheep's clothing he dwells among us and strikes unsuspecting women through cunning manipulation and extreme persistence. Really terrifying stuff. I usually don't comment on acting since to me it doesn't make a large difference in the quality of a film but Marc Menchaca plays this character very well. Until the second act of the film he technically doesn't do anything wrong though he definitely seems off. If not done properly he could come across as quite a likeable guy but Marc gives him just the right amount of creepiness to terrify me from start to finish as his savage and abhorrent tendencies are slowly revealed.One thing that struck me when watching the film was the masterful cinematography. Federico Verardi is able to show so much with so little. Every clear, concise frame is interesting on some level keeping the viewer glued to the screen. At first I felt the widescreen aspect ratio didn't suit the claustrophobic mood but it soon grew on me giving the vast, stunning yet unforgiving American wilderness a sense of grandeur as if the forest itself is spectating this brutal cat and mouse scenario.All in all, I really enjoyed Alone. It is pure, honest, visceral, reviving cinema. It doesn't reinvent the wheel but the wheel it uses is polished to a glistening shine. I usually don't enjoy thrillers (I am a bit of touchy with horror films) but this had me enthralled. Go and watch as long as you don't pass out from stress halfway through the film I think you'd enjoy it. Hope this review helped!"}], "recommendations": ["the_invisible_man", "the_rental", "identity", "revenge", "the_call", "the_voyeurs", "the_howling", "cold_pursuit", "the_grey", "the_machinist", "the_autopsy_of_jane_doe", "a_cure_for_wellness", "a_history_of_violence", "eden_lake", "the_killing_of_a_sacred_deer", "enemy", "brimstone", "vivarium", "red_sparrow", "no_escape", "no_country_for_old_men", "colossal", "crawl", "split", "dragged_across_concrete"]}