{"id": 1563, "title": "Alpha", "starring": ["Kodi Smit-McPhee", "Jóhannes Haukur Jóhannesson"], "runtime": 97, "genre": ["Adventure", "Drama"], "description": "In the prehistoric past, Keda, a young and inexperienced hunter, struggles to return home after being separated from his tribe when bison hunting goes awry. On his way back he will find an unexpected ally.", "releaseYear": "2018", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/afdZAIcAQscziqVtsEoh2PwsYTW.jpg", "categories": {"plot": 6.260869565217392, "acting": 6.380952380952381, "ending": 4.3, "soundtrack": 5.0, "cinematography": 6.833333333333333, "familyFriendly": 5.375, "funny": 8.0, "action": 6.833333333333333}, "reviews": [{"rating": "9", "text": "Alpha takes place 20,000 years ago during the last ice age. It tells a really touching story about the relationship between a young man and a wolf who must rely on each other in order to survive. It has some really good performances from the actors, beautiful scenery and cinematography, and a lot of heart and emotion through the relationship between the man and the wolf. I'd recommend it to anyone who enjoys movies with heartfelt stories."}, {"rating": "10", "text": "Alpha is a beautiful movie that depicts a hypothetical story about how the bond between humans & dogs evolved ( with a narrative about a prehistoric boy named Keda and a wolf). It is a must see for animal lovers. The film deserves to make back its production budget and should be viewed on the big screen to truly appreciate it. Chuck, who plays Alpha, did a great job. The cinematography is gorgeous and deserves an Oscar nomination.  The scenes with Alpha will warm your heart. There is some heart-pounding action, suspense, tragedy, but ultimately has a happy ending. It is an excellent survival story that illustrates the power, courage, and strength of people as well as animals to overcome adversity to live. I definitely loved this movie far more than The Revenant."}, {"rating": "6", "text": "There have been many films that visualized the dawn of man, and yet somehow the story of how man domesticated wolf seemed to have slipped past filmmakers – until today.An epic adventure set in the last Ice Age, ALPHA tells a visually stunning story that shines a light on the origins of man’s best friend.What could have been a memorable hear-warming tale, however, becomes a film that solely relies on its visual elements – namely its mise-en-scene and cinematography – instead of first ensuring that it has a powerful narrative.The story follows young Keda, played beautifully by Kodi-Smit McPhee, as he tries to find his way back home after an accident occurs during a hunt that causes his tribe to mistakenly believe that he is dead.At his most vulnerable, Keda is attacked by a pack of wolves. In his defense, he seriously wounds the Alpha wolf, which the distraught pack abandons, however, instead of killing it, Keda carries the wolf to a cave where they take shelter. He cautiously heals the wolf’s wound, and in his isolation comes to depend on the creature’s risky, unpredictable companionship.The narrative’s biggest weakness strangely enough lies with the heavy dialogue which is spoken in a Cro-Magnon type language.Most films utilize dialogue between characters to push the story forward, in ALPHA’s case, however, the writers should have taken the dialogue out all together and relied on their body language and behaviors in order to build on the narrative.Young Austrian cinematographer, Martin Gschlacht, is able to make nature a third character in the movie and broadened his cinematographic palette farther.The film definitely has some of the most breathtaking shots for a film of its kind and both the director and cinematographer take full advantage of the landscape before them.Although most of the film is practically filmed, there are many VFX (visual effects) shots used from weather to color grading and even some CGI animals.The animals are very noticeable which is only due to the fact that the frail narrative allows the audience to focus on those minimal details.Looking past the CGI, ALPHA does have some great practical details like the tribal costumes, tents, and all things relating to the era the narrative is set in is beyond grounded in reality.The natural elements within the film, from the skies to the changing seasons, all symbolic in their own right, do more than just tell the story, they also layer the film with themes of the unity between man and nature.ALPHA at its core is an escapist film, like the old campfire stories. The great storytellers told stories around a campfire, and it was a communal experience. That’s why people go to the movies: to laugh together, and cry together, and experience the same thing with strangers in the same room.To conclude, the film stays real to what could have happened, and at the end there’s this incredible bond between the two characters, man and wolf, which leads to the creation of this relationship we now value more than life itself. If anything, ALPHA is a great tribute to that story and how it may have happened."}, {"rating": "7", "text": "Alpha goes back in time to bring the story of our intricate connection with canines. Dogs are the unsung heroes of the history of human development, and I'm glad to see a movie celebrating this. Alpha plays like a YA version of \"The Revenant\", visually stunning and at points poetic."}, {"rating": "9", "text": "Where should I begin? This movie was awesome. It's a very touching story between a boy and a dog trying to get home to the boy's tribe. They learn to accept each other throughout the journey. The visuals were so stunning that they were just pure jaw dropping! There is definitely a lot of talent involved in the movie. There is definitely a bit of action in it and for the most part it is very exciting. Alpha is a very gripping and touching movie. Although, I do wish the movie was about 30 minutes longer, it would have added on to the story and would have made it more complete. Other than that, it was a great movie! 9/10 or A-"}, {"rating": "6", "text": "This is the original story of a boy and his dog. It's set 20,000 years ago, when members of a tribe set off to hunt for food. Thru an unfortunate but spectacular accident, the chief's son finds himself alone…until he helps a wounded wolf and they bond on the perilous trek thru the unrelenting wilds. While there are giant leaps in logic and time (such quick healing!), there's an affecting charm to the story. It's made more effective by Albert Hughes' striking directorial touches and the impressive scenery. Unlike the event itself, this isn't a breakthru movie, but it tells the origin story of dog/man companionship with affection and epic beauty."}, {"rating": "9", "text": "Cinematography: 8.921/10 Have you ever seen Samsara? Alpha is not as peaceful as Samsara though flows very well though has stuttering moments which make me question purposes of particular camera angles at times in the film. Alpha has so many scenes which look good and does evoke an emotional response from the audience though it is not tear-jerking. Costume Design: 9.234/10 Decent! Initially, I think the people will be a lot bigger and eventually I start thinking the people might have been hairier too. Otherwise, a lot of the attire in Alpha seems to check out as Paleolithic.Film Editing: 9.432/10 The majority of the film looks good though I find a few random scenes to look like really awkward breaks from all of the really good scenes concerning visuals, not acting.Make-up and Hair-styling: 8.799/10 Decent. Simple. Not too complex (not indicative of the effort that it might have taken).Sound Editing: 8.982/10 Good. If they add a descriptive-narrating voice explaining the background of the era, that'd be it - icing on the cake (slick way to get someone to watch a documentary). Solid for the content.Visual Effects: 8.794/10 Decent. Still - was that a crystalline saber-toothed tiger? The majority of everything else checks out. Maybe 4K will make a huge difference in a film like this. Story: 9.219/10 I like the overall message of the film in connection with the tribe and the wolf pack. Were kindred relationships so in the Paleolithic era? I don't know - but, I like the story. It's definitely heartfelt especially for anyone that might have had a good relationship with a pet. Acting: 9.111/10 The addition of the language makes the acting more effective. It really feels like these actors got into their roles. I didn't feel like I was watching people in existence any longer (except that I knew was). Personal: Alpha makes me question owning a pet in the future. I've been hearing a new mantra as of recent: 'I don't have kids, I have dogs,' and I don't really have a reaction to it. I feel as though there is a clear difference in loving an animal and loving a human being. Is an animal a cheat way for a different kind of love? Maybe for some people. There's strong emphasis on the importance of life within both realms of animals and humans in Alpha. Yes, I know humans are animals. There are stark differences though. I don't know. I guess it all depends on what someone is looking for. I really like Alpha and I think it's a decent film.Overall: 9.061/10-K.D.If you're into Poetry and other bits of creativity, check out my Instagram: @Dufreshest."}, {"rating": "8", "text": "Alpha was visually stunning to look at on the big-screen. Each shot is breathtaking. My mouth was open for the entire 90 minutes. It felt like a mix between Planet Earth, The Revenant, & The Last Guardian. The relationship between the boy and the wolf felt genuine and I was eagerly anticipating them having a successful journey together. However, the movie is heavily focused on themes of hunting & starvation to the point that it felt somewhat repetitive. And, an unnecessary flash forward sequence at the beginning of the film strips away tension from the following twenty minutes or so. Nevertheless, I'd recommend one see it, whether it be in the theater or at home in a viewing quarter worthy of this beautiful piece of film."}, {"rating": "6", "text": "Being an animal lover helped me elevate the rating to score a higher mark for some emotional scenes but overall the story was very lackluster and drawn out. Recommend waiting for a release & watch on DVD."}, {"rating": "6", "text": "It is a bit strange to see a film with this kind of structure and cinematographic quality considering that in the end it's simply a story about domesticated wolves and therefore what would eventually become the domesticated dog. It seems like too much trouble for such a thin storyline.Kodi Smit-McPhee delivers a solid interpretation but as I said the story is not the strong element of this film because in the end it's just a story of survival spliced with the bond between a young man and an animal. The interesting thing is in the time in which the story takes place.The cinematography is excellent although there are times when you notice the CGI and it's bad but most of its running time it looks pretty good.I can say that I do recommend it, although I must emphasize that you should not expect something remarkable."}, {"rating": "10", "text": "Alpha is probably one of the best movies ever made. This movie is a heartwarming about a relationship between a man and a wolf who depend each other to survive. The movie has many beautiful scenes and shots. It's sad this movie was overlooked in 2018 as it's a beautiful movie."}, {"rating": "2", "text": "Not a good film.  So many things are jarringly inaccurate that I simply couldn’t finish the film.  From the clothes to the decisions that are made by the protagonist.  To put it simply, he would have eaten the wolf, not made it a pet."}, {"rating": "10", "text": "A beautiful story where the protagonist isn't an alpha male. This is a beautiful, heartwarming story, filled with suspense. I kept wondering what's going to happen next and I loved how the hero is trying to survive WITHOUT being an \"alpha male\". It also shows that an alpha male isn't really the greatest of species like everyone makes them out to be."}, {"rating": "9", "text": "La historia puede que no sea algo innovador, pero es agradable de ver, muy buena en lo visual y técnico, efectos de CGI aceptables considerando el presupuesto, me encantó la relación del lobo con el protagonista y como enfrentan la cruel naturaleza para sobrevivir."}, {"rating": "3", "text": "This movie is boring. The acting is bad. The visuals are all noticeably bad, but the backgrounds looked decent for the most part. The domestication was stupidly simplified to a few interactions. I almost laughed when the one guy ate the ants off of his hand because of how stupid it was. The movie started to pick up a bit about an hour and twenty minutes in, but then it ended. The ending was bad. The twist of the wolf being a female and pregnant was the worst way to do a twist. A good twist in a movie is one where the movie hints at it subtly, without you connecting the dots at first, but once you know the twist, the connect the dots for a cleverly hidden yet satisfying ‘ah-ha’ moment. This movie just kind of realized that there was a plot hole (how do you start the domestication of dogs with just a single wolf that just happened to be hurt and a cave boy that just happened to be kind and stupid?) and said ‘this works, I guess’. Also, if this were realistic, the wolf would’ve been eaten by the cave boy. And the part where the cave boy finds a frozen cave man, he takes his bow and just one arrow. Why only one arrow? You’re telling me that this cave man only had one arrow on him? Also, the cave boy was starving to death at this point, so why didn’t he eat the dead cave man? No one would’ve found out. And cannibalism doesn’t seem like an issue in this situation anyway. Overall, this was boring and I almost fell asleep."}, {"rating": "6", "text": "Esta entretenida, rapida, las imágenes digitalizadas de los paisajes son muy buenos, pero la historia es media fumada."}, {"rating": "5", "text": "This world's first pet story has some strong visuals but is short on brains and believability."}, {"rating": "10", "text": "Mankind and Man's Best Friend team up together to fight the real enemy - cats!"}, {"rating": "6", "text": "\"Alpha\" was a movie I avoided almost entirely in an effort to escape the bad taste that Roland Emmerich's \"10,000 B.C.\" left in my mouth all the way back in 2008. Preconceived notions about the relative period aside, this really did work for the most part. It's a generally effective survival narrative that's a bit slow on the draw, focusing too much on the father-son relationship early on and nowhere near enough (you can never have enough) upon the man-dog/wolf connection that the marketing went so hard in the paint with. Once we're thrust into that portion of the narrative, though, it's decent entertainment. I also really appreciated the commitment to having this entire movie spoken in a pre-historic language. This really helped bolster a sense of historical authenticity that the visuals seemed to waver in and out of."}, {"rating": "4", "text": "Albert Hughes' conventional enemy-become-ally survival tale is one of the most disappointing movies of 2018. Sold as the origin of the relationship that changed humanity forever, Sony Pictures' and Studio 8's pic is an atypical drama hybrid that never takes off or defines itself because of some downy editing techniques, the overly light, straightforward underpinning and a monumental deception on the making of iconic pictures that blame blatant artificiality jam-packed with ostensible visual effects.More in the vein of Lasse Hallström's tearjerker \"Hachi: A Dog's Tale\" and the most common American adventure/survival films, this pic uses up its striking possibilities in no time, by opting to insert inorganically moments of dramatic construction in the midst of the protagonist's ceaseless nightmarish experiences. Daniele Sebastian Wiedenhaupt's script is uneven and whimsical, laying bare its only hook: its arty will that uses Ice Age ferocities to shine.  It inaccurately depicts hostility and dangerousness from nomadism only through visual devices, forgetting the key role a good introductory storytelling plays, which, by the way, is abrupt and synthetic kicking off right in a pivotal moment. What's next is a snappish, out-of-place, hurtful timeline switch to end in the starting point once again, which it solves with a fragmented sequence in a disturbing and shameful way that trashes the small narrative construction. From then on, Keda, the main character, will trace his way for survival; and the rest is history.Even so, the father-son relationship is the heartbeat of the first act, the empathy thread that involves the viewer in the journey, which helps to appreciate a good character design and a couple of great performances. It's hard to imagine the transition from ferocious predator to friendly ally in the context the film navigates, therefore the wolf-human relationship must be a slow, naturally layered progression, no catalysts breaking that process. Although the script tries its best, loses focus when it clumsily inserts either some action sequences or unfunny moment. At the end of the day, one would expect such a relationship to be stronger, more real and much more credible to do justice to the kind of ancestral tale and demographics it's dealing with, sadly, the only thing the film's cliche close achieves is to become a huge missed opportunity.Why isn't it a silent film? A bit of a let-down it feels to hear the very first quote, as one would imagine the film is about to attack with all its originality. \"A Quiet Place\" has revived somewhat silent film in its own way, then, why not? You're right, Krasinski's thriller is a heart-stopping, clever monster movie, whereas Hughes' pic is a manipulative drama, which certainly makes harder its purpose; even so, idealizing this offering, balancing the modern and the traditional, we would be in front of a unique work.You're in a fine mess, firstly, if you put the best of all your movie into a two-minute-plus trailer with better edition than the whole film, and, secondly, if your distribution company delays release date nearly six months in search of a more appropriate, strategic opening weekend. The first time I saw its official trailer was just before seeing a Sony Pictures film, and oh man, that was a great ride, being fully absorbed by the magnificence and grandeur of Martin Gschlacht's images. Some seconds after, I was wowed and excited about what, at least visually, the film would be. Don't expect more than some specific stunning landscapes and one or two gorgeously designed frames, the \"guaranteed\" top-notch visuals are severely affected by digital effects you see with half an eye, it's outrageous to know the only real thing on screen is the actor. Many of the pictures with chances for memorability were degraded by an incisive, painful artificiality. Atmosphere, in this kind of film, is a key feature, even if C.G.I. is constantly all over the place, for this reason, the feeling of defenselessness and latent danger in the first half of the film is sensitive regardless of veracity, immersing the viewer in the experience thanks to beautiful lighting and some tremendous computer-generated imagery. Its action set pieces aren't particularly unforgettable or originally powerful, with the exception of a couple of arresting, sincerely symbolic sequences at the start and end of the film.\"Alpha\" by Albert Hughes — his solo feature directorial debut— got moviegoers' hopes up with the flood of marketing pledges, after seeing it, it's no more than a futile epic survival ride that relies heavily on a committed direction and a great performance by Kodi Smit-McPhee, a few visual shocks and the hook any film with a snout in its poster gets for free. A film that gradually gets stuck with fast-and-hollow entertainment, one that fails to break the spell flying over dog-centric drama films, one with no pedigree."}, {"rating": "7", "text": "\"Alpha\" was an entertaining film, where its history, special effects and performances were good, but photography is amazing and great, a film where the first relationship between man and animal has connected with the public and shows us a story of friendship and survival."}, {"rating": "0", "text": "ça commence avec une chasse au bison... une chasse dont la méthode laisse perplexe : on se demande en effet si on se fout de nous et si oui, pourquoi aussi ouvertement ? puis ça continue et ça remet le couvert si j'ose dire... à croire que le fim entier est un dîner dont tous les spectateurs éventuels sont les invités ! mais d'ailleurs, le film n'est-il pas sorti un mercredi ?Donc, le jeune con, fils du chef de la tribu, le jeune benêt qui n'ose pas égorger un cochon (pardon, un sanglier) -peut-être parce qu'il est végan ce petit con ?- le jeune devient un Rambo improvisé et futur gagnant de Koh Lanta, dans le même esprit que l'autre film qui nous prenait pour des jambons, The Revenant...  je ne vais pas détailler tout ce qu'il fait, Superman, mais... non il ne vole pas ! Mais c'est tout juste parce que c'était trop \"voyant\", ils ont dit. Quand même.Bref, malgré les beaux paysages (numériques) et les bestiaux souvent... agressifs (bah ouais quand même, y a 20 000 ans...) et numériques eux aussi mais à budget plus limité hélas, malgré son côté carte postale, Alpha prend un peu trop les gens pour des cons (quasiment tout le temps en fait) et ça, c'est rédhibitoire. On veut bien faire \"meuh\" ou \"bêêh\" mais avec un minimum de respect."}, {"rating": "8", "text": "This is a fun tale about bow-wow doggie and his pal Neanderthal doggie boy and their long walk home.  This is the stone age just like I remember it, when you hadda know how to chip a stone spearhead just to make the grade for the hunting party.  Yeah, those were the good ol' days..."}, {"rating": "5", "text": "A Walk In A Park.AlphaHughes is utterly confident in his fantasy, he personifies nature in a character that has much more to say than our protagonist. There is a lot of Lee's Life Of Pie in it, but he makes sure he says beyond something than a brief encounter to the nature. He may not explore it thoroughly or dive deep into it, but he surely animates them to a larger scale. But no matter how sharp his vision grow or how skillful the method is, it is still a typical textbook of the genre. Familiar in its version and a theme with elements that we have all encountered before, there is a slow rhythm to it that makes you groove on your feet. The dance and romance between the nature and nurture aspect of those characters oozes and appeals power to us.Visually, the film is beautifully, bright lit sky at night and single coloured theme on each frame attracts the viewer to these live locations despite of being short handed on visual effects. The rich cultural traditions and rituals along with smart tactics proves the amount of detailing that went through in this process. The screenplay may not be mature but also never loses its cannon of speech, there barely resides any verbal sparring, and it is that amiability of physical sequences that communicates with us the most.The performance is admirable if not completely outstanding, the lead cast survives progressively and expressively for us and we can filter out the effort easily. The initial tough equation between our protagonist and the wolf is the best of all, afraid of each others skills and behavior, they find a mutual admiration that binds them forever. Alpha is not the lead of this group, it certainly is vital to it, an expected, promised and delivered product."}, {"rating": "8", "text": "Imagine if 10,000 B.C. (the movie) wasn't full of Hollywood garbage and actually allowed you to imagine life back in the stone age.  This movie does that to wonderful effect.  It drags a bit, but overall - i thoroughly enjoyed it."}, {"rating": "8", "text": "\"Alpha\" shows us a spectacular scenery session, with convincing performances that not only dogs can be man's best friend. His screenplay is limited, short and imprisoned, since it becomes noticeable his lack of ambition in some points of the film, such as the lack of exciting moments and pilot twists. But even in his great limitation, he manages to have a good conclusion, realizing that even small, deserves to be respected. 8.0/10"}, {"rating": "4", "text": "Good concept about Wolfe becoming human's friend but the film lack of strong reason to believe. It has the very poor story line.- How the Wolfe join back the man's journey to home ? Why ? Even he was already with a pack.- They killed the black panther. They had full of foods to survive but why they fall at the end ? Film should add this information.- Wolfe have babies ? What the... It's really hard to be pregnant with that condition ( starving etc..) .Life of Pie movie is the good example of how human and animal relationship are developed."}, {"rating": "6", "text": "7 months agoIf you like watching a timid semi heartthrob teenage boy learning to be a man in the wilderness, watch 2015's excellent \"Slow West\". In the 2018 film Alpha, the story is similar. But it is far less authentic and moving. KODI SMIT-MCPHEE plays Keda, a prehistoric Hunter going for his first kill with his tribesmen. He gets lost and must learn to survive on his own. He meets an injured wolf and they hit it off and begin to help each other on the long grueling journey home. The best scenes are in the middle of the movie between the boy and the Wolf. It's the usual, you know, wolf is afraid of boy and vice versa, they slowly begin to trust each other, boy tries to chase the wolf away so that he can go back to his pack, Wolf refuses to leave, and follows at an adorable distance. Nothing new here, but entertaining and heartwarming. And teenage girls may enjoy looking at McPhee with his puppy dog appeal. Unfortunately, director Hughes doesn't get much in the way of acting from McPhee. Also, the CG backdrops and wolf expressions don't look very good. The rocks and cliffs look like they were formed out of concrete and painted. Somewhat enjoyable for adults, more so for tweens."}, {"rating": "8", "text": "Seeing the relationship between the boy and the wolf was great as the film knows how to show the change between them without being too slow-paced or feel unnatural. While I don't believe everyone will be amazed by this, it was honestly a pretty good film that I believe young adults and up can enjoy. Mostly basing that off the fact that me and my elderly dad actually agreed that this film was good, which is a miracle in of itself. Wish I could find a dvd or blu-ray of this movie so I could show my friends."}, {"rating": "8", "text": "A well-crafted film that depicts the probable origin of the friendship between two animal species. Dog (Wolf) and Man. The plot is interesting, the characters well written and the acting well cast. I enjoyed the film. I rate it 8/10"}, {"rating": "3", "text": "The dog was cute, the rest of the movie felt like what you would get if Joe Rogan wrote the story about how man domesticated dogs."}], "recommendations": ["kubo_and_the_two_strings", "a_monster_calls", "you_were_never_really_here", "first_man", "okja", "in_the_heart_of_the_sea", "the_road", "how_to_train_your_dragon_the_hidden_world", "the_water_horse", "the_rover", "the_ballad_of_buster_scruggs", "the_good_dinosaur", "ex_machina", "the_iron_giant", "your_name", "the_light_between_oceans", "smallfoot", "a_ghost_story", "under_the_skin", "isle_of_dogs", "the_killing_of_a_sacred_deer", "midnight_special", "dawn_of_the_planet_of_the_apes", "the_boy_who_harnessed_the_wind", "hugo"]}