{
  "id": 1151,
  "title": "Alvin and the Chipmunks",
  "starring": [
    "Jason Lee",
    "David Cross"
  ],
  "runtime": 92,
  "genre": [
    "Comedy",
    "Family",
    "Fantasy",
    "Animation"
  ],
  "description": "A struggling songwriter named Dave Seville finds success when he comes across a trio of singing chipmunks: mischievous leader Alvin, brainy Simon, and chubby, impressionable Theodore.",
  "releaseYear": "2007",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/vRiB9uvcD0WYp7k2pAeWz9ukpuN.jpg",
  "categories": {
    "plot": 5.733333333333333,
    "acting": 6.0,
    "ending": 3.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 7.4,
    "funny": 6.363636363636363,
    "action": 2.0
  },
  "reviews": [
    {
      "rating": "10",
      "text": "Amazing...Do you know how epic this movie was? It was so epic...Ok, a part i could throw out the window, otherwise this movie was epic. Best film of 2007 up until 2009. Why is the average critic review score 39? It could have been better, thats only my opinion..."
    },
    {
      "rating": "8",
      "text": "If you're looking for a movie like the old Chipmunks movies, you'll probably find yourself entertained. Don't expect ground-breaking work, because this certainly isn't it, but it's a well meaning attempt to pay tribute to Alvin and the Chipmunks series, and succeeds in being just that. The plot is predictable and there's no serious depth, but if you go in with the right state of mind it makes for a heart-warming piece of escapism."
    },
    {
      "rating": "7",
      "text": "I didn't think I was going to like it as much as I did, but it was predictable! Alvin and the Chipmunks is cute, funny, and a fun family flick. It's not very original, but who cares, it's a harmless kids film that nobody should have a problem with, because it is just trying to be exactly what it is."
    },
    {
      "rating": "8",
      "text": "Now I don't want to defend the awful 'talking cgi animal' genre, but I'd be lying if I said I didn't enjoy this movie. Be sure to watch if you enjoy Chipmunk songs like I do!"
    },
    {
      "rating": "6",
      "text": "This movie was very funny and cute. I can't really imagine myself ever giving it a three or a two. Definitely not worthy of reviews its been getting. Also, they cover good songs, not cookie-cutter-pop-stuff."
    },
    {
      "rating": "7",
      "text": "a perfect adaptation of our favorite singing chipmunks."
    },
    {
      "rating": "8",
      "text": "It can actually be fun for both kids and adults. Alvin and the Chipmunks has immature moments, but the jokes are funny and the characters are funny."
    },
    {
      "rating": "6",
      "text": "You know what, this film wasn't THAT BAD. Sure, it sticks to the same kid-friendly formula as many similar films, and it might annoy a few people, but it's got some occasionally funny moments, some pretty great music and some good animation in regards to the characters. Obviously, this is one of those films that kids will enjoy more than parents, and I don't think it's worth repeat viewings, but all in all, \"Alvin and the Chipmunks\" isn't an awful film at all. Just keep your expectations in check, and make sure to watch it with the kids, if you want to get the full enjoyment out of this one."
    },
    {
      "rating": "10",
      "text": "After 49 (almost 50) years Alvin still has it! This film is a faithful and delightful adaptation of a beloved children's family and musical cartoon. It successfully replicates and in some ways improves the sole charms of the characters with the kiddish mischief sure to entertain kids. This is also a very good animation effort!\rThere is sweetness here. The scene in which Dave and the boys decorate the tree is charming, and the Chipmunks' excited presentation of gifts to their human dad is actually sort of touching. And dang it, the little animated rodents are cute."
    },
    {
      "rating": "7",
      "text": "A good Alvin and the Chipmunks movie. The characters match the old ones, and look cool. The story was fun and had a good Christmas feel. The best in the series."
    },
    {
      "rating": "6",
      "text": "A good kids movie that adults can tolerate.  I laughed many times throughout the movie."
    },
    {
      "rating": "10",
      "text": "I am 7 years old and my daddy is writing this for me. I thought the movie was totally awesome. I loved Theodore, he is so cute. I think that if you are a kid you should go see this move. Hello, folks. This is Emily's Dad. I think you should drop the kids off in the theatre and go see No Country for Old Men. This movie is boring."
    },
    {
      "rating": "9",
      "text": "Awesome movie! It is one of the best movies of 2007. There were lots of funny parts. The storyline was great. The chipmunks look great CGI animated. The songs were awesome. Alvin and the Chipmunks is a great film and it is definitely worth watching. And the critics are bird brains."
    },
    {
      "rating": "3",
      "text": "It's annoying garbage that has a weak plot. When I call something weak, I don't mean that it's bad neccesarily. Sadly, the execution and humor f*cking ruin the movie."
    },
    {
      "rating": "4",
      "text": "\"Alvin and the Chipmunks\" is a movie that has a SOOOO-familar-plot-and-script-that-is-obvious-and-basic-as-hell, I don't even want to talk about it...."
    },
    {
      "rating": "2",
      "text": "Alvin and the Chipmunks starts out alright, but then, everything goes down the toilet. Chipmunks as pop stars? Obnoxious protagonists? If you're looking for a kiddy film, then look no further... unless you're looking for something that's good quality!"
    },
    {
      "rating": "5",
      "text": "It's not great. Good for little kids but not exactly for teens and adults. Though it's not the worst movie I ever seen."
    },
    {
      "rating": "4",
      "text": "The Movie Is So Basic & Bland That It's More Boring Than Fun.. We All Know Alvin & The Chipmunks... They Died... 10 Years Ago....."
    },
    {
      "rating": "2",
      "text": "It is the 2nd best movie of the whole Chipmunk series. The plot of the movie is too boring and too predictable. The chipmunks are very annoying. I gave a 2 because of the overall impact of the movie, it's good. But it is still absolutely a really bad film.........."
    },
    {
      "rating": "4",
      "text": "Childish, predictable and meaningless at the best you can think of, \"Alvin and the Chipmunks\"serves only as a showcase for impressively designed creatures, because entertainment it is not."
    },
    {
      "rating": "10",
      "text": "I gave this film 10 out of 10 because of the following reasons:\r 1.   Great film.\r2.   Lots of funny moments.\r3.   I would watch it 1 million times if i could (which i can because i have it on dvd - thank you amazon...)\r4.   Great quality images.\r5.   Good storyline.\r6.   One of the best films that were released in 2007.\r7.   Great acting.\r8.   Humorous scenes.\r9.   Heartwarming moments.\r10. Great sequels.\r I recommend this film to anyone who has a young relative (baby, little brother/sister, little nephew/niece or grandson/granddaughter etc...) or anyone who enjoys a good cartoon because it is a great cartoon which you can buy from any dvd store (Blockbuster) or online store (Amazon, eBay or Play.com).\r So why are you still reading this you should be on a different website or on your way to a dvd store now. Go on GO!!!!!\r By ImogenDulieu987"
    },
    {
      "rating": "6",
      "text": "Overall is good, but it is very slow and makes you boring. Recommended for people who have nothing to do one day."
    },
    {
      "rating": "5",
      "text": "Hours Of Nutty Fun"
    },
    {
      "rating": "5",
      "text": "It was framed the \"Movie of the year\" and it became a hit, though I don't know why it spawned some sequels. Sure, it's cute and odd, but it just gives out an equal thumb."
    },
    {
      "rating": "4",
      "text": "tiene buenos contenidos para un niño y una buena idea que no sobresale de entre otras peliculas basicas tal vez unas ardillas habladoras no lograron el verdadero extito"
    },
    {
      "rating": "4",
      "text": "\"Alvin and the Chipmunks\" is somewhat enjoyable, as it feels quirky in a good way and new, but the script and plot has a familiar kid-genre, leaving nothing truly special to adults. The storyline is basic, nothing fascinating or interesting or, plus the singing aspect to the film does feel bland. Besides this, the film will succeed to entertain, but not with many things that are special."
    },
    {
      "rating": "5",
      "text": "Alright, I guess... I don't get the title though \"Alvin and the Chipmunks\" Alvin is a chipmunk? The movie is for kids, I think most of them will like it."
    },
    {
      "rating": "3",
      "text": "The ending of the film had me resting my eyes, if you'll pardon a metaphor. The animation is nothing to point out, the story is beyond unfathomable and stupid, and the voices are just annoying."
    },
    {
      "rating": "3",
      "text": "The trio of chipmunks are cute, but any remaining fondness of them will be diminished by the end of this movie. Sadly, this movie, well, sucked. The acting was horrible --even more than the atrocious script-- and eventually the chipmunks got annoying to put up with anymore. I have to admit that the movie started out pretty good though, and that's the reason for the 3 instead of 0 stars. Also, I can't get the sound of Jason Lee screaming \"ALVIN!\" out of my head, because that's about the only line from the movie that you will remember."
    },
    {
      "rating": "3",
      "text": "Yep, this was pretty bad. Though the chipmunks themselves are simply adorable, this movie is disastrously hampered by a god-awful attempt at a successful sense of humor and underwritten characters. Strictly for the kiddies."
    },
    {
      "rating": "4",
      "text": "Without being there I think this film is for children and it was interesting while it lasted , it's totally boring , who can not do something inconcedible but better than Garfield."
    },
    {
      "rating": "5",
      "text": "After a decent start, Alvin and the Chipmunks soon becomes a tired, predictable and often grating film with little merit beyond its cute animation. The three main characters are devoid of personality, and while they may win over the kiddies, they will most likely annoy adults. Jason Lee meanwhile, looks depressed to even be in the movie, and it's not hard to see why. The only funny part of the movie is David Cross, who brings much more energy to the picture than it deserves. So why did I give it a five and not a two, I hear you ask? Because the beginning does have its moments. That, and I'm feeling generous. Overall, it may please young children, but Alvin and the Chipmunks will do little for their parents, and fans of the original cartoon looking for nostalgia will probably feel cheated."
    },
    {
      "rating": "2",
      "text": "Alvin e os Esquilos é péssimo. Só algumas partes que se salvam. História tosca, humor tosco. Sem mais. Acho que os produtores e diretores deviam ter mais criatividade se querem criar um filme desse tipo."
    },
    {
      "rating": "4",
      "text": "Alvin and the Chipmunks is as decent-looking as ever, but unfortunately placed a few problems in the entire movie itself including how you can't have an Alvin and the Chipmunks movie without the annoying chipmunks singing throughout the entire movie."
    },
    {
      "rating": "3",
      "text": "I think we all know what to expected this movie to be. It was to be a movie for the kids to watch before they will realize that this movie is stupid, kidish and dumb."
    },
    {
      "rating": "4",
      "text": "A doody and somehow cliched picture that simply can only be enjoyed by gross viewers and children. Anyway, it's cool soundtrack and the good performances take an important part of this."
    },
    {
      "rating": "1",
      "text": "Não sei como eu já gostei desse filme. Horrível ao extremo! Minha nossa, a história é tão tosca que chega a um nível que fica insuportável ver o filme até o fim. Salvo apenas... sei lá, acho que nada."
    },
    {
      "rating": "0",
      "text": "It's just trying to be a movie for kids huh? And because kids can watch it, we shouldn't complain huh? Ok, let's say I made a movie that was just 90 minutes of footage looking at a wall. It might be terrible, but you can't complain because it was meant to be about a wall. The logic of these users baffles me. Now where was I? Ah yes, this movie is awful."
    },
    {
      "rating": "2",
      "text": "Probably the most irritating film created aimed at children that's ever been created. Until the next one that is. I guess there's some insane live action performances to keep you from commiting suicide and freaking out your kids while watching this."
    },
    {
      "rating": "3",
      "text": "David Cross is the only thing keeping this bad movie from eternal damnation."
    },
    {
      "rating": "0",
      "text": "Why????!!!!!!"
    },
    {
      "rating": "5",
      "text": "Well this movie wasn't as god-awful as I expected it to be. The characters were two-demensional, the man playing dave (whom I can't recall the name) made me wince whenever he yelled \"ALVIN\". Oh, and the chipmunks' voices while inevitably charming were sometime a little difficult to understand, but were bearable. The storyline was predictable. Really this isn't the kind of movie you would watch if you were say 13+ but if you did anyway, it probably didn't wow you. But in praise to this movie, kids will like it, it's a good family movie and it's a passable alternative to other pieces of garbage. But if you are looking for a spectacular, worldly-acclaimed children's movie that also reaches to a broader audience, try Ratatouille."
    },
    {
      "rating": "9",
      "text": "Totally enjoyable....watched with my two grandchildren and we were totally entertained. Sweet story of becoming a family and the importance of someone caring for you. Highly recommended."
    },
    {
      "rating": "10",
      "text": "I loved Alvin and the Chipmunks. Theodore was my favorite he was so cute. I especially liked the singing and the squeaky voices of the chipmunks. It is a awesome movie for kids."
    },
    {
      "rating": "10",
      "text": "A fantastic kids movie, lots of manic singing, slapstick and mess-making from the chipmunks to keep the kiddies amused, plus some great humour for the parents. David Cross is especially funny. What impressed me most though was the refreshing sight of normal-sized women in the Chipmunk's band (no size zeros here), and the movie also features actors *shock horror* with less than ridiculously perfect teeth, all of which can only send out positive messages to the children. The film also held my three year old's undivided attention for an hour an a half (no mean feat). And most importantly, her verdict is,and I quote: \"It was great!\""
    },
    {
      "rating": "7",
      "text": "Very underrated family flick."
    },
    {
      "rating": "8",
      "text": "I loved this movie i thought it was great!!!! most critics don't like it but i liked it and thought it was pretty funny!"
    },
    {
      "rating": "10",
      "text": "This movie is awesome."
    },
    {
      "rating": "0",
      "text": "Ended up giving smiles to people's faces but relies on a very weak and predictable plot. Here you may find yourself not just foreseeing the plot but ALSO finishing the characters' dialogs."
    },
    {
      "rating": "8",
      "text": "This movie was cheap,lazily written, terrible graphics were tossed in and I gave it a 2 -a 2 for pity-if i was mean i would give it -46 but i can not rate it that bAd. SO DO NOT GET THE DVD"
    }
  ]
}