{"id": 1614, "title": "Alvin and the Chipmunks: The Road Chip", "starring": ["Jason Lee", "Justin Long"], "runtime": 92, "genre": ["Adventure", "Animation", "Comedy", "Family"], "description": "Through a series of misunderstandings, Alvin, Simon and Theodore come to believe that Dave is going to propose to his new girlfriend in New York City - and dump them. They have three days to get to him and stop the proposal.", "releaseYear": "2015", "mpaaRating": "PG", "imageUrl": "https://image.tmdb.org/t/p/w500/aQhFoqby8UYq4uGQXOtV7P8JLBl.jpg", "categories": {"plot": 5.863636363636363, "acting": 6.083333333333333, "ending": 6.8, "soundtrack": 9.0, "cinematography": 9.0, "familyFriendly": 4.5, "funny": 5.16, "action": 3.0}, "reviews": [{"rating": "0", "text": "This movie is only for the littlest of kids to enjoy, but thats about it. It you are going to make this a movie, at least make it entertaining for the parents so that they dont have to complain when they take their children to see this film. The road chip, more like the road kill."}, {"rating": "3", "text": "The lack of Chipette's made the movie dry. I would much have saw more the Chipette's and less people .The Chipmunk ' s and the Chipette's together are what made these movies fun to watch .I could see them not living in Dave's house but they move all the they to L.A. and are living alone .Kind of sucked the fun out of it from the start .I know people want the love interest between Alvin and Brittany but I remember watching the old cartoon and they would fight more like brother and sister .I wondered how they could ever be man and wife.\r The character of the teen boy is again kind of dry and not very entertaining .I like the idea of Dave having a girlfriend maybe possible a marriage if there is another movie .The teen boy character was kind of out of place and didn't really go along with the other characters and seem kind of dorky .The Chipmunks are great with there normal jokes.They said they  matured but they seem the same age as before . Wait until it comes out on video or the dollar theater it's not really worth paying a ton to watch but if have seen the other 3 you want to just because ."}, {"rating": "1", "text": "A whole bunch of crap. A whole bunch of crap. A whole bunch of crap. A whole bunch of crap.\r The film is boring, the plot is super boring, and the voices is irritating."}, {"rating": "4", "text": "Uninspired song and dance routines try desperately, and unsuccessfully, to paper over the cracks in the flimsiest of story lines. This is paint by numbers film making that promotes not one iota of originality through its entire running time. One even has to question if young children will enjoy the dubious pleasures it offers. It feels like it has been churned out as a C grade release filler, and even though excessive mawkishness is largely resisted, the blatant amateurishness of the production drags it down."}, {"rating": "4", "text": "To start of this movie the sweet talking teenage  Chipettes are sent off to go party alone in LA or as they are calling it judge American idol .Probably living in  a cardboard box or in a  tree while partying inbetween takes .It's Dave birthday so we start it off with the  blow up of the yelling of Alvinnn to start the movie . Dave leaves with his new girlfriend leaving the boys with a babysitter cutting down their ability to perform  .Yet,the girls who are the same age are partying alone with no adult supervision down  in LA .The girls must have proven their mature level is twice as high as The boys .\r   Dave's  new girlfriends  son is picking on the boys until he gets to know them better which is why the boys want to get rid of him and his mother so they take off after Dave thinking he is going to marry his mother after finding a ring in his bag .The main point of this movie to show what a great dad Dave is  .So they fill it with potty jokes and chase Dave ending it with a special song just for him.Wait isn't this the same dad who sent 3 teenage  girl's alone to LA to party without  adult supervision  .So now is when you have to remember the girls don't belong to Dave and he was  just being the nice guy giving them a place to crash for awhile. Now that they are mature enough to live in a tree in LA they can move on .And we get to see the different reactions between them and the chipmunks  boy and girl when they show up to help with the song .Its a kids movie so if  your an adult who remembers this show as a kid and thought  it would be funny to watch your old favorites you may be a little disappointed as its geared toward the kids ."}, {"rating": "2", "text": "Alvin and the chipmunks: The Road Chip doesn't work in no sense with the other three originals. It is also not-funny-enough and just children would be in love with this unremarkable plot which of course made this film the winner of the 2015 Golden-Raspberry-Award, they it really deserves, for his stupi story-telling and terrible interpretations. This is, of course, one of the worst films ever, and the worst of the year. \"Enjoy\" it."}, {"rating": "0", "text": "It just isn't worth your time compared to the other three films from this franchise. Don't expect to see another one from Alvin and the Chipmunks for a long while."}, {"rating": "0", "text": "I can't believe they still make these movies. Fox decided that their genius move would be to release this on the same day as the new Star Wars, which of course means it's doomed to fail, along with Jem earlier this year.\r I guess on the bright side with these 2 failures, Hollywood will probably finally stop making horrible adaptations of classic cartoons as a lazy way to entertain kids and jingle their parents' Nostalgia bells."}, {"rating": "3", "text": "The Chipette's were adorable every screen they were in was super cute unfortunately they weren't in enough of the movie for it to matter .The plot is the same old thing a family feels threaten that a single parent will marry so they try and stop it so  they don't get a new sibling they hate .I thought a good remake for a movie would have been the Chipmunk's Adventure where they went on that trip around the world racing against the Chipette's. This  kind of gives you the yawn factor .They had a teenage boy who is as boring as that strange female Zoe in the chip wrecked movie which they could had less of .At least in that one the 6 chipmunks some up covered her up kind of  .In this one there is only 3 Chipmunks trying to cover it up so it is harder to do .\r The jokes were your normal Chipmunk jokes Alvin not as funny as in the past movies .They could have toned him up a little .One thing that always stuck at me is in the cartoon the kids were in grade school maybe middle school in this they are in high school someone didn't pay attention to the original when they put that detail in .I  think the new Nick cartoon with some of the original voice actors was  a better go then creating the 4 chipmunk movie or going back to the cartoon like they are doing with Smurfs 3 maybe it would  have been a choice all around .Dave was pretty good .They could have done without making this one or made the Chipette neighbors instead of  tossing them out of most of the movie or living in the treehouse so they be more involved in the movie maybe then it would have been better ."}, {"rating": "3", "text": "What can I say except for this movie was awful! Did you guys seriously expect me to say that this was a good movie. It's not even so bad it's good it's just so bad it's cringey. That's one word to use while describing this movie “Cringey”. Some of the jokes were so bad/painful that I would get frustrated. Most notably the Baby Got Back cover. If you couldn't tell, this is a road trip movie where to have to get to point A to point B in a certain amount of time and the chipmunks are doing this to stop Dave from marrying his new girlfriend and prevent getting an annoying step brother Miles. So, they are supposed to gain a meaningful relationship along the way, right? Well, not exactly. There relationship doesn't grow overtime. It just goes from I hate you to I love, just like that... I'm not even exaggerating that. That is literally how it happens. The acting was god awful. Except for Jason Lee, he was decent. But, everyone else, especially Bella Thorne couldn't act for anything! I don't think even the cheap cameos (Redfoo, probably got him on for like 10 cents) could save this movie. In the end, listen to my good friend and go see Star Wars: The Force Awakens instead. I'm seeing it tomorrow so I don't know if it's good or not yet but he's a cool guy so take his word for it! I'm giving this one a 3/10."}, {"rating": "1", "text": "I can't see why people even like this. This was so bad it failed at the box office only because it came out on the wrong day. Don't expect another sequel like this ever again.\r The Road Chip? More like, \"The Road Kill.\""}, {"rating": "1", "text": "The film isn't as bad as the second and third one, but the 4th Alvin and The Chipmunks isn't very good either. Filled with the least amount of humor, the studio needs to understand that the chipmunks are done, and no next movie will save the losing streak the series has."}, {"rating": "5", "text": "Overall it's a kid friendly movie for the kids to enjoy so of course bring the kids and there are few laughs for the adults added in .It made sense why the Chipettes were missing for most of the movie it goes back to the basic plot of Dave and The chipmunks original theme but I did kind of wonder you just let 3 kids move out on there own with no adult to watch out for them .Ok they lived alone before Dave but then he  hires the boys a babysitter who are suppose to be the same age .The Chipettes were not his children and this a cartoon not real life so you make the story line any way you want but odd how they the Chipmunks are so dependent on having a parent while the girls just take care of themselves .(hint if you make another movie maybe some  parents other then Miss Miller not a fan of Miss Miller sorry)\r Dave finally adopts the boys which maybe some of us have been waiting on for awhile .He has always been the parent he just has to do it to prove it to them .It's a good movie for the kids ."}, {"rating": "2", "text": "Just a few funny jokes and strange humane character's  invading the movie made it less interesting .Hardly no Chipettes .I think they needed to stop after the second one four was to many .The no fly joke was funny and a few other slap stick jokes .The Chipette's was totally cute but because they are trying to use them as sexy symbols for the Chipmunks rather then character's they are shut out and sent packing alone to some American Idol thing .The Chipmunks are making rude comments to women on the beach so if your trying to teach your son to respect women or daughter not think she is  a sex symbol this movie might be a miss ."}, {"rating": "0", "text": "esta pelicula apesta a caca de perro vomitada, es puro mendigo estiercol que no sirve ni de relleno, es la peor de todas y eso que todas las demas apestan tambien a caca"}, {"rating": "10", "text": "The greatest movie ever made. Destroys Star Wars: The Force Awakens.\rThe greatest movie ever made. Destroys Star Wars: The Force Awakens.\r 11/4 I love it"}, {"rating": "8", "text": "People have been really harsh on this film but I think kids will enjoy it. While this might be too childish for adults, and the plot is very standard. Don't expect too much from the film because it's just the same as before. It's better than the third alvin and the chipmunks movie but the film didn't have much singing and was just bad guy vs. chipmunks, which wasn't too bad."}, {"rating": "10", "text": "Great movie! The Classic chipmunks you know and love are back for a new adventure! This movie is hilarious and one of the best comedies of all time! This movie is much better than Star Wars 7 and I love it! Perfect movie! 10/10"}, {"rating": "9", "text": "This was a great movie for kids and the kids at heart. People, are so picky these days. The movie was funny had a nice storyline and plot. It's a kids movie not a competitor for the oscars. Alvin n the chipmunks is a modern classic and this is a great fun stress free watch. Put on a smile and an open mind and go enjoy this! My only negative comment is that I wish they had included the original chipmunks song! Alvin Simon Theodore!!"}, {"rating": "7", "text": "The Road Chip doesn't redefine children's entertainment. It's a fairly standard setup with a very familiar plot and moral themes of family. It may be rather generic, but at least it doesn't spend a lot of time shoving a lot of pop culture down the kid's throats.\r The musical numbers are still there accompanied by a lot of dancing. However there aren't as many as the previous movies had, so in that area the movie is mercifully toned down. The focus just really is on the laughs and story.\r Yes, the humor is juvenile as all get out. However outside of some questionable Mardi Gras antics, it's all completely harmless. The type of movie you can sit the kids in front of and not have to worry about what they're hearing or seeing. Depending on your tolerance for humor aimed at young children, you may even be able to watch it with them.\r If you and/or your children didn't enjoy any of the previous Chipmunk movies, then don't expect this one to change that. It does tone down on a lot of the more obnoxious or annoying elements found in some of the previous films, but for the most part it's still very much a Chipmunks movie. It's rather disposable children's entertainment. Perfect for a rental or something to keep the kids busy for a bit. It's cute, sweet, and fairly energetic. A decent movie for the young children in your house. Not all parents may like it, but it's not really for them anyway. It sets out to entertain kids and I believe it will do just that.\r 7.2/10"}, {"rating": "9", "text": "I've seen Alvin and the Chipmunks: The Road Chip, and I swear, it's one of the most underrated movies of all time; boasting a fast and energetic pace that will keep its audiences hooked until the very end more so than the previous Alvin movies, this is definitely worth watching! There are a handful of touchy and thoughtful moments, with the ending making me tear up quite a bit. The Chipmunks and the Chipettes also look significantly better, with brighter colors working in their favor. As for the laughs, they are both numerous and harmless, so there's no reason to hate the chipmunks in the first place. The songs are catchy, and some of them stand out a lot! All in all, I feel that the Alvin movies greatly benefit from having a fast pace, so the creators should keep up with what they excel at. However, one small problem I have with this movie is that the Chipettes aren't shown all that much, which is understandable, but I do hope they are more involved with the Chipmunks in the future films. They've been around since The Squeakquel, so they should also be popping up on the theatrical release posters. I suppose it's a little bit of a nit-pick, but I would like to see some more sweet-talk between them because it's SO cute. Other than that, I absolutely loved this movie, and I recommend it to anyone and everyone. To top this review off, I'm already very excited for the next movie; maybe the Chipmunks and the Chipettes should plan to go on a world tour together for the fifth film, similar to what the Chipmunks did in the first one?"}, {"rating": "3", "text": "For the fourth time \" Alvin and the Chipmunks \" trashed childhood , since the beginning , was good, but the rest of the film has failed , or keep up with the proposal , much less beat \"Star Wars : The Force Awakens \"and the end is very ruined, did not find the meaning of descenlace of \" the Road Chip \" ."}, {"rating": "7", "text": "Honestly this movie confuses me. It was so on track to be a step up from the last three and but just when it starts getting really genuinely good they throw in a cheap fart gag. That said it is far from the terrible movie it is being painted out to be. If you have kids or grew up with the chipmunks yourself you shouldn't be too disappointed with this. The original material was far from art in itself so set the bar low and go enjoy a solid family movie with pretty shocking and wholeheartedly funny moments (the Mardi Gras and bar scenes especially).\rTo summarise. Not the best of the live action/cg chipmunks movies but not as bad as its made out."}, {"rating": "9", "text": "WTF is everyone complaining about. It is funny and also entertaining.Also the changing of characters over time was great.Also I really think it is better then the squekwul and star wars the force awakens."}, {"rating": "7", "text": "I was bored but my 10 year old and 7 year old were both laughing out loud and dancing and singing along. Sometimes the movie is just for the kids and this one was that. My daughter was also excited to see actresses from Family Channel shows doing cameos during this movie."}, {"rating": "10", "text": "When I went to see the star wars movie i saw the Road chip movie there and i thought That must be perfect i waited the next 2 hours for next screening, worth it, i had the best time."}, {"rating": "10", "text": "An amaaaaaazing movie, even better movie than black ops 3 blah blah blah filling in the characters lolololol derpaklerpaperpamerpahlerpa i really love to slurpa"}, {"rating": "10", "text": "10/10 IGN Game of the Year like legit best movie ever I'm not even joking like totally because who doesn't love a good Alvin and the Chipmunks movie because the other movies were great right like yeah I see nothing wrong with this I hate how I have to write at least 150 characters so yeah I'm just gonna go now so have a nice day and whatnot so yeah bye yeah so thank you for reading this so bye so yeah. Yeah."}, {"rating": "4", "text": "2015, AKA the year where everything was either great or overly corny/cringeworthy. This is the latter.This one has slightly better writing than the first 2 films, but it's also tired by this point. And I feel like the 2015 release only signified that.In short, 2015 was weird."}, {"rating": "6", "text": "The Road Chip isn't exactly what I'd call a good film and has almost nothing going on in the visual department, but for those saddled with kids for an afternoon, you could do a lot worse."}, {"rating": "1", "text": "This was a terrible movie no doubt about it. It has crappy animation and an overload of jokes that involve farting, peeing and pooping that only little kids find funny. I find other things like South Park funny, because there is plenty of profanity. This movie is stupid, stick with Star Wars."}, {"rating": "6", "text": "The Road Chip isn't exactly what I'd call a good film and has almost nothing going on in the visual department, but for those saddled with kids for an afternoon, you could do a lot worse."}, {"rating": "6", "text": "The Road Chip isn't exactly what I'd call a good film and has almost nothing going on in the visual department, but for those saddled with kids for an afternoon, you could do a lot worse."}, {"rating": "6", "text": "The Road Chip isn't exactly what I'd call a good film and has almost nothing going on in the visual department, but for those saddled with kids for an afternoon, you could do a lot worse."}, {"rating": "6", "text": "The Road Chip isn't exactly what I'd call a good film and has almost nothing going on in the visual department, but for those saddled with kids for an afternoon, you could do a lot worse."}, {"rating": "6", "text": "The Road Chip isn't exactly what I'd call a good film and has almost nothing going on in the visual department, but for those saddled with kids for an afternoon, you could do a lot worse."}, {"rating": "2", "text": "The worst movie I have ever watched, at least for now. The series was actually good in my opinion, and then this came along. The teenage boy is annoying, and Alvin gets more attention than the rest of the Chipmunks. Dave getting a girlfriend was a nice thing, but the rest of the story was boring and the songs were not great. Not worth a watch unless you like the series a lot."}, {"rating": "0", "text": "Alvin and the Chipmunks: The Road Chip has a talented cast, but the cast isn't enough to save the movie from poop jokes and terrible CGI, making it a dead end."}, {"rating": "10", "text": "Really enjoyed this film because of the family message in not only this film but all of these films. I hate the haters because they don't give a crud about family bonding or messages in these films at all. all the haters and critics give a crud about is the so called \"Terrible CGI\" and the \"ruining of childhood\". if it was that bad to you, why ask for it, then hate on it? People should really stop complaining and hating and just look at the good parts of the film, especially the family bond. It breaks my heart to know that people ignore these heartwarming family moments, and only watch it to make the people who made this feel like idiots. to be honest, I don't think the CGI was perfect! it still kept that cute, furry chipmunk look. also, the ruining of childhood thing is a lie, because it's still the chipmunks, they just changed the looks, voices, and made up not one, but 4 amazing story lines that all line up with the family bond. Guys, you should really lighten up and pay more attention to the good parts of the film instead of bashing out on it when you asked for this to be made. for those creators of these 4 films, I give you my support, and continue to love the chipmunks, no matter how old I am and no matter how much people judge. make a 5th film, and I'll be the first one in the theaters. I heart the chipmunks and the chipettes, and I kill the haters."}, {"rating": "3", "text": "Some funny parts but the series has been going downhill since the first one."}, {"rating": "5", "text": "My first film of 2021 and on Metacritic - I know, I know... hold back your jealousy.I've watched the preceding three films and, genuinely, enjoyed the first two, the third isn't good but isn't bad either. 'Alvin and the Chipmunks: The Road Chip' is easily the weakest entry, but I still find it impossible to dislike these films. They're stupid but they kinda work, at least in terms of what their intended purpose is.The casting is quite something. Jason Lee, somewhat surprisingly, returns, with new addition Bella Thorne - who appears in, like, four scenes. You also have Christina Applegate, Anna Faris and Kaley Cuoco in voice roles, alongside appearances from \"Crazy Eyes\", \"Stifler's Mom\", \"savior Jared\" and \"Crabman\". Iykyk.I didn't care for any of it, the story is clichéd, nonsensical and woefully written - and there's barely even a road trip. I do, though, like the chipmunk animation, I chuckled a few times due to how they are animated.Rubbish no doubt, yet I can't say I hate it to be honest."}, {"rating": "9", "text": "at the beginning long after it is like a rise and fall, at the end it rises a little.(WELL: the music feels. The comedy is very good and varied.(DETAILS: The characters are well formed physically and facially, although I know that the girls are missing too many breasts, you can see a little of the bust and they look more realistic and yes, they look a little more mature, (Miles) I thought it was a boring character. Later I thought there was a cat locked up here because when he walked with the protagonists he walked a little slow with a little sadness on his face, I don't know if he acts well without realizing it. girls don't appear much in the movie but if they didn't notice it during the movie it gives us that almost profound loneliness of being without them when we get to them it's like being home again but when Brittany looks and touches her shoulder ah alvin, now that I realize they traveled not because of Dave, but because of the girls that Alvin traveled for Brittany, that's why Brit looked at him that loving way.(BAD: James Suggs is the worst villain and cannot pass ah lan Hawke, he will always be the best and most beloved of all.(Ideas: I would like the following sequel to directly address the love between the 6 characters, in addition to the fact that they sing and dance. Another would be a world tour that would be more extravagant with Russian and Latin American actors. Another is first not for Kids, it would be for a younger group set on Halloween. The main character is Brittany. The middle school is Jeanette Brit. He meets a student.I mean, overall, Brittany is bitten by a wolf who turns out to be the same girl Brit knew. That's what I mean.it's like (alvin and the chipmunks meet the werewolf) but instead of theodore brittany. and obviously Britain will become a wolf but in a somewhat explicit way."}, {"rating": "10", "text": "alvin and the chipmunks: the road chip is a cinematic masterpiece, rivaling the likes of ratatouille with its witty humor and great storytelling"}, {"rating": "3", "text": "This movie should not exist. I did have a bit of fun watching it. The first one is by far the best."}], "recommendations": ["the_croods_a_new_age", "the_game_plan", "the_smurfs", "chicken_little", "cloudy_with_a_chance_of_meatballs", "beverly_hills_chihuahua", "diary_of_a_wimpy_kid_the_long_haul", "hannah_montana_the_movie", "alvin_and_the_chipmunks_chipwrecked", "the_boss_baby_family_business", "spy_kids_all_the_time_in_the_world", "marmaduke", "my_little_pony_equestria_girls_forgotten_friendship", "zookeeper", "alvin_and_the_chipmunks_the_squeakquel", "ice_age_continental_drift", "ice_age_dawn_of_the_dinosaurs", "alvin_and_the_chipmunks", "the_angry_birds_movie", "playmobil_the_movie", "happy_feet", "herbie_fully_loaded", "ice_age_the_meltdown", "diary_of_a_wimpy_kid_dog_days", "project_x"]}