{"id": 4294, "title": "Always Watching: A Marble Hornets Story", "starring": ["Chris Marquette", "Alexandra Breckenridge"], "runtime": 91, "genre": ["Horror"], "description": "A small town news team discovers a box of video tapes where a faceless figure dressed in a dark suit, haunts and torments a family...slowly driving them insane. Soon after, they realize that the \"Operator\" has begun to stalk them as well.", "releaseYear": "2015", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/6PORF8ervLTX0XKeLa4sVKyjQA4.jpg", "categories": {"plot": 5.0, "acting": 5.0, "ending": 10.0, "soundtrack": 5.0, "cinematography": 10.0, "familyFriendly": 3.0, "funny": 5.0, "action": 5.0}, "reviews": [{"rating": "5", "text": "Average found footage, with all its antics and flaws. This movie may resonate more to those who are familiar with Slenderman or Marble Hornets web series, practically anyone who has interest in internet creepypastas. The transition for cinema uses hit-and-miss medium of found footage, but at least it justifies them to constantly carry cameras. It's nothing much from usual found footage cliché and for what it's worth, it may be mildly amusing when it runs its course.\r A group of journalists investigates abandoned houses to document foreclosure process. They find a collection of tapes in one of the houses, which display a sort of haunting entity. Soon this lanky ghostly man starts to haunt them as well. Underneath the suit and modern gimmicks, the movie is pretty much mediocre haunting, only extensively recorded.\r It presents the usual tension with dark corners and lingering object that may or may not be present. There's an effort to bring more tech stuff as parts of tension, yet it's no more than Grave Encounters and the likes have done. In some scenes it can get pretty immersive and intense, although these instances are too brief and certainly not that many.\r Flaws that have plagued this subgenre are unfortunately here and they are clearer than the flickering apparition. It's all too common when the situation escalates, characters would scream at the same time to emulate real life debacle. Filmmakers should know by now that it's very overwhelming and unappealing to have first person perspective of bickering, and this movie does it in excess.\r Cumbersome shots, particularly slow motion and a couple of jittery scenes are expected although not exactly welcomed. It may work as popcorn flick, but the stale use of the subgenre doesn't invoke much fascination."}, {"rating": "5", "text": "This movie is just kind of a run-of-the-mill found footage movie that hits every cloche horror note and executes the notes quite well. However, it never thinks outside the box and can be quite boring, especially if you like found footage movies and have seen a lot of them. A lot of the characters are really unlikable, and you stop caring about them halfway through the movie. A lot of the scares are lazy and uninspired, and it ties into Marble Hornets as an after thought. The beginning is never referenced again and only serves to lazily set up Slender Man as a villain. The first act is actually the strongest part of the movie. Learning the settings and the characters and the discovery of the Operator symbol is actually done quite well. The characters become really unlikable and static in the second act when the supernatural things start happening. The third act is almost so boring that you will be cheering when the characters finally bite the dust.All in all, it is a pretty average scary movie. Nothing original or unique is brought to the table here. While it is LEAGUES ahead of Sony's 2018 Slender Man, it really lacks the ball busting terror of Marble Hornets on YouTube. If you have never seen the original Marble Hornets, check it out! A few film students with no budget make something that is way more memorable and scary than Always Watching."}, {"rating": "10", "text": "It's based of the Marble Hornets series based of the popular Slender Man. Found Footage movies are kinda old nowadays but this movie held up well. The ending was nice stopping at the camera just recording dead bodies until someone gets it and then they're next. It came to a twist that Slender turns his victims into proxies who kill others. I give it a 10/10"}, {"rating": "1", "text": "Marble Hornets was fun, engaging, surprisingly scary and incredibly effective in general, not just for a low-budget YouTube series. This... ugh."}, {"rating": "0", "text": "Ну вы значит блять такие сидите и думаете:-Ура! Фильм про слендера но,идите нахуй этот фильм позорит слово слендер,этот фильм как полёт человека на луну в плане бездарности,это просто ебаный блять пиздец убейте нахуй того дауна кто это снял!"}], "recommendations": ["alien_abduction", "paranormal_activity_the_ghost_dimension", "the_ritual", "the_strangers_prey_at_night", "mirrors", "the_pyramid", "annabelle_creation", "crawl", "the_medium", "the_crazies", "the_invisible_man", "the_howling", "monsters", "event_horizon", "scary_stories_to_tell_in_the_dark", "chernobyl_diaries", "the_shallows", "house_of_1000_corpses", "blair_witch", "paranormal_activity_2", "annabelle_comes_home", "winchester", "the_fourth_kind", "the_descent", "28_days_later"]}