{
  "id": 398,
  "title": "America: The Motion Picture",
  "starring": [
    "Channing Tatum",
    "Jason Mantzoukas"
  ],
  "runtime": 98,
  "genre": [
    "Animation",
    "Action",
    "Comedy"
  ],
  "description": "A chainsaw-wielding George Washington teams with beer-loving bro Sam Adams to take down the Brits in a tongue-in-cheek riff on the American Revolution.",
  "releaseYear": "2021",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/1JRRvx5RotvWM1maeq9r82ktdHi.jpg",
  "categories": {
    "plot": 3.0,
    "acting": 5.0,
    "ending": 3.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 7.3,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "0",
      "text": "What a piece of crap. Offensive and not funny. Done on the cheap. Possibly financed by haters of America."
    },
    {
      "rating": "3",
      "text": "So much wasted potential here.  With a talented voice cast and great animation one would think this would be an easy win however, watching this from beginning to end was just exhausting.  Many of the \"jokes\" either just don't land or end up being overused to the point they're just not funny by the end of the movie.  While the point of the story is to be stupid fun the writing and execution are just astoundingly bad here.  Truth be told, if this had been broken and made into a mini-series I think it could have been good, but as is I would not recommend."
    },
    {
      "rating": "3",
      "text": "Very unfunny and annoying to sit through. There are better animated movies and comedies this year, so, skip this one. It's worthless."
    },
    {
      "rating": "3",
      "text": "bad[ bad ]adjective, worse, worst;(Slang) bad·der, bad·dest for 36.not good in any manner or degree."
    },
    {
      "rating": "9",
      "text": "For some reasons I see very bad reviews of the movie . I think the movie is fantastic . It is very funny and the animation is beautiful"
    },
    {
      "rating": "10",
      "text": "America The Motion Picture was surprisingly awesome, not only in terms of the animation, but the story, the comedic, the music, and the voice acting, all works very well, America The Motion Picture is not gonna waste your time, America The Motion Picture is a much watch film and probably one of my favorite films of the year."
    },
    {
      "rating": "8",
      "text": "While the movie itself did seem to overstay it's welcome about 10-15 minutes too long, they still kept up with fun, self-aware, and poignant jokes that you just couldn't help but laugh at. I thoroughly enjoyed just turning my brain off and being entirely entertained for an hour+. Well worth the watch - especially if you have someone else who finds stupid funny to match their sense of humor."
    },
    {
      "rating": "9",
      "text": "I liked it.It narrate the birth of America independence in an exagerated way; using steampunk spoof versions of some historical and fictional notorious figures . Humorous cartoon for adults that deliver what you expect from the trailer:Plenty of action, un-censored dark humor, Pop-culture references, blood, comedy self-deprecation, easter eggs and some clever moking of stereotypes.Hope in a sequel of some sort"
    },
    {
      "rating": "4",
      "text": "I have no problem watching something so absurd and consciously stupid that also embraces it as its biggest strength.But doing it for 90 minutes and still believing it's funny?No. Not all."
    },
    {
      "rating": "7",
      "text": "A glorious, deranged anthem to the overthrow of King James and his Redcoats, AMERICA: THE MOTION PICTURE is a raucous, gory good time. I laughed almost from start to finish with this, and while it's most certainly not for everyone, it finds it's own charm with being so consistently over the top. Featuring a fantastic cast of voices and a joyfully bizarre plot, AMERICA: THE MOTION PICTURE is yet another hilarious animated film of 2021. A perfect 4th of July watch."
    },
    {
      "rating": "0",
      "text": "They really lost it when they called a rifle a machine gun"
    },
    {
      "rating": "1",
      "text": "It's......too American. The jokes fall flat, there are like 2 good jokes, that's all."
    },
    {
      "rating": "6",
      "text": "Dużo inside joke'ów dla amerykanów, które można łatwo przeoczyć, sprośny humor, głupia fabuła, karykaturalne postacie oraz nawet ładny styl graficzny. Nic specjalnego niestety"
    },
    {
      "rating": "10",
      "text": "I was forced to create an account just to try and balance the user score of this movie. I really liked it, I mean, I get it's not for everyone but I find it really round, I was laughing my ass off all the time. People criticize it's contant absurd humor but that it's what I find so appealing about it, this movie it's nothing without it and that's fine, it really does it's job well."
    }
  ]
}