{
  "id": 4578,
  "title": "American Heist",
  "starring": [
    "Hayden Christensen",
    "Adrien Brody"
  ],
  "runtime": 94,
  "genre": [
    "Action"
  ],
  "description": "Two brothers, both with troubled paths, find themselves in the middle of one last bank job.",
  "releaseYear": "2014",
  "mpaaRating": "NR",
  "imageUrl": "https://image.tmdb.org/t/p/w500/526uxanwv4mMK0YTxjVrsmMXXo2.jpg",
  "categories": {
    "plot": 5.2,
    "acting": 6.4,
    "ending": 5.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 4.0,
    "funny": 5.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "5",
      "text": "I could see the whole thing but a little tricky because I was expecting a heist movie and for the first part—an hour—is more like a Drama Thriller."
    },
    {
      "rating": "1",
      "text": "Funny how this film went straight to Netflix. I would write a review about American's sh*ttiest heist but I rather not, since I don' review movies that I consider the worst thing that ever happened to America."
    },
    {
      "rating": "4",
      "text": "Turned this movie on Netflix just for the background noise to try to make me fall asleep a few nights ago, I'm not really sure where this movie was trying to go plot wise, it tries to make itself out to be like \"The Town\" but ultimately stumbles and falls flat. Adrian Brody is greatly miscast, I'm not even sure why he continues to waste his once promising career away on such crappy movies and Hayden Christensen shows he has the chops to make movies and does the best with what he has as does Jordana Brewster. All in all, this movie is bad. Very bad, its plot is almost a blatant ripoff of The Town, Outside the maincast the acting is spotty at best, and the screenplay is just awful,"
    },
    {
      "rating": "6",
      "text": "It isn't fair and it isn't right, but in the minds of many moviegoers, certain performers will always be associated with their most memorable roles. For me, Hayden Christensen will always be Anakin Skywalker, and it's strange to see him in anything but a Science Fiction film, but that doesn't mean he's not capable of playing anything else, as he shows in American Heist. Christensen plays James Kelly, an man who became an ex-con, for simply looking up to and trying to help his older brother, Frankie (Adrien Brody). As James is getting his life on track, Frankie is being released from prison and is of course looking for one big score. Now, James has to decide what's more important, keeping his new life on track or saving his older brother. Hayden Christensen gives an admirable performance, once you get passed the initial shock of Anakin cursing and covered in tattoos, but it's Adrien Brody who steals the show. Brody isn't an Academy Award winner for nothing, as his character pulls at the heart strings and has you running the gambit of emotions. Everyone knows someone like Frankie and wonders which way they'll turn out. In this case, there is also the added incentive of finding out if he'll drag his brother along with him, either way. American Heist isn't the best film out there, the story has been done, and at times, it's a little dull. This film is more about the characters and their values more than anything else. There's a fair share of language and guns, but unlike many other thrillers, that's not really the focus here, which in the end, is appreciated."
    },
    {
      "rating": "8",
      "text": "A well deserve acting from both the protagonist. It is unfortunate that there is not much movie goers who saw the true acting on this film."
    }
  ],
  "recommendations": [
    "the_town",
    "snitch",
    "gone_baby_gone",
    "live_by_night",
    "the_next_three_days",
    "the_little_things",
    "changeling",
    "the_gambler",
    "public_enemies",
    "safe_house",
    "knives_out",
    "man_on_a_ledge",
    "inside_man",
    "the_godfather_part_iii",
    "lucky_number_slevin",
    "21",
    "reasonable_doubt",
    "four_brothers",
    "the_accountant",
    "when_the_bough_breaks",
    "peppermint",
    "good_people",
    "contraband",
    "taken",
    "savages"
  ]
}