{"id": 2882, "title": "American Gangster", "starring": ["Russell Crowe", "Denzel Washington"], "runtime": 157, "genre": ["Drama", "Crime"], "description": "Following the death of his employer and mentor, Bumpy Johnson, Frank Lucas establishes himself as the number one importer of heroin in the Harlem district of Manhattan. He does so by buying heroin directly from the source in South East Asia and he comes up with a unique way of importing the drugs into the United States. Partly based on a true story.", "releaseYear": "2007", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/sX9idXDqRUxE5ffww3n3RV5gL55.jpg", "categories": {"plot": 7.53125, "acting": 6.103448275862069, "ending": 6.75, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 3.0, "funny": 5.0, "action": 7.833333333333333}, "reviews": [{"rating": "10", "text": "\"American Gangster!\" Who wouldn't enjoy a film directed by Ridley Scott, the director of Gladiator and Kingdom of Heaven, and Oscar winning starts, Denzel Washington and Russell Crowe. These actors have finally collided into an electrifying performance. I saw the poster of this film in a run down theatre and it looked pretty exciting because at the time, I was into Scorsese Mob films, and the title said: American Gangster Starring Denzel Washington and Russell Crowe. What I film. After watching the trailer, I couldn't wait a damn moment until it came out. All these sweat and awesome commercials viewing it, my god, I wanted to watch it so badly. But apparently, I saw it in a special screening a week before it came out. There were lots of folks there from all walks of life and all ages - the movie seemed to go over very well with everyone in the room. Washington and Crowe work well together as the troubled stars in this film and basically the main attraction for people to go see it was their appearance. It was also a little too long and more dramatic than expected, but it still had good dialogue to make it entertaining. Also, I've seen some real stinkers at the movies recently (I won't bother you with the list because it's too long) so it was refreshing to see that movies can still be well made with characters you can care about and root for. Since the movie wasn't finished at the time I got to see it, I look forward to enjoying the movie again at local movie theatre. A pure modern-gangster classic."}, {"rating": "7", "text": "Good. But in connecting the dots you find there are some dots missing. The end feels like an uneasy compromise for the film's length and had enough morla and character content to have filled another movie. The relationship and respect between Russel Crowe and Denzel was a refreshing idea, and could have floated a boat in itself. The relationship at the beginning with his boss gets your attention and feels important and intrigues you, but those elements are left to just taper off. Perhaps a prequel and a sequel were aces up the sleeve of the film from the very beginning. A taunting idea, yet doubtful. Still, even with a tease of a start and a rush of an end, the middle should not be ignored. Solid and very respectable. A must-see for sure."}, {"rating": "9", "text": "This American classic crime film was very well executed. From scene to scene I was in the edge of my seat. The violence involved in the plot of the story took me by surprise, other than that the violence portrayed in the film was up to par. To my understanding, most of the scenes in the movie were based on true events. In my opinion, any film that is based on a true story makes the movie experience more entertaining. As always, Denzel Washington played the role of an American gangster to perfection. Even though, he plays similar roles in other movies he did a superb job."}, {"rating": "10", "text": "The movie is brilliant. Daniel was tremendous. Crowe was spectacular.The support characters were equally impressive. I love the movie. I won't mind watching it again."}, {"rating": "5", "text": "Nothing all that special. Great actors in an ok film."}, {"rating": "4", "text": "Movie itself was good.. the story sucks. He should have been shot for getting his entire family killed or arrested, and being a snitch, Good acting, poor story."}, {"rating": "0", "text": "I mean really, Scott is THE most overrated director working. Gladiator was such a horrible mess that we might have to go back and rethink Alien and Blade Runner. The two leads are of course spectacular, but what waste, what kitsch, what crap!"}, {"rating": "2", "text": "In Philadelphia we believed Denzel Washington's transformation. In Glory we believed his hatred and pride. There is no question that he is one of our finest actors. But this is not one of his finest moments. Nothing in this movie makes us care about any of it's actors. The performances seem wooden. Because I know that we're dealing with fine actors and one of the best directors of all time, I have to blame the script-- It gives none of its actors a platform to create a character or a sentiment that we care about. It's all facts. But even if it was a documentary, it still wouldn't be a good one. Information you don't need is all over and information you want is lacking. Plot points are explained in 30 second sequences and then left. There is not one single moment in this movie where I felt the least bit connected to these characters. And I'm pretty much a master of SoD. Where are the Emperor's cloths? He has none. This movie sucks."}, {"rating": "2", "text": "Very boring."}, {"rating": "10", "text": "Great mafia and drug-dealer movie."}, {"rating": "3", "text": "The movie was too long! It truly was not worth it. I felt as if I had seen this Denzel performance 1,000 times. Great build up to a complete let down. Definitely does not rival any of the Godfather sagas. It's more like New Jack City meets the Departed meets the Goodfellas. Yet, it pales in comarison to all. I love you Denzel and Russell but this was a complete let down."}, {"rating": "9", "text": "a black man's scarface. a rise in the ranks that is not shown on film but also a bit of a modest guy that embodies family and culture. denzel at his best."}, {"rating": "0", "text": "A bore, carries on in a stupid script, the actors do not magnify, they suck. The direction is poor, and the whole production is just over the top crap."}, {"rating": "2", "text": "Keep your money in your pocket. Wait for it to come out on HBO or something. Trust me!"}, {"rating": "3", "text": "Derivative and formulaic. I mean how many lame movies do we have topless women packaging drugs for \"security\" purposed. The lame white cop is just cliche \"good guy\" against the world. The gangster love interest is an impossible bore. You may be sucked in in the first half hour... the film looks good cinema-wise (how did they make NY look decrepit again?). But you are soon sucked right back out by the over-all low bar the film weakly hops over."}, {"rating": "2", "text": "Overrated crap like every other Drug dealing & gangster movie out there. Goodfella's, The Godfather and this..they're all the same. Take a tough guy who uses the same phrases in every other movie in the genre with the same references and plots and you get American Gangster. Nothing but a completely overrated movie that is reliant on gun's, drugs, sex, violence and 'backstabbing' Anyone who thinks this film is amazing or a masterpiece are bandwagon jumpers and extremely deluded. Don't feel pressured to falsely praise a film you deep down don't rate so much..be honest with yourself and don't follow the crowd."}, {"rating": "2", "text": "This is a boring, plodding mess. Denzel should stop playing villains, and Russell should stop playing good guys. Both are powerful actors, used to being surrounded by hapless sycophants, but this is a waste of time."}, {"rating": "9", "text": "I thought gave a very good insight on life during the time period it took place in. The acting was absolutely amazing and the story in general was fascinating."}, {"rating": "0", "text": "Watching this movie felt like doing chores. Plot didn't make me interested at all. Didn't see anything special from performances by Denzel Washington and Russel Crowe (who is one of my favorite actors, so seeing him in this piece of turd was very disappointing). Overall, an overrated movie."}, {"rating": "4", "text": "Empty Threats. Empty Guns.American GangsterScott's reign over the mean streets often comes out as a fatal attempt of conjuring Scorsese's richness on uncouth mannerism, either way it's a big old sunken ship from the beginning. Ironically, despite of ticking for more than two hours, it barely offers us the content of half an hour, give or take. The major disappointment is the build up of each sequences, which are perpetually on mark, but unfortunately the high pitched dramatic scene itself falls on mediocrity. Against all odds, the film is cornered by its semantics, since the biggest bombshell would be Zaillian; the writer, who has managed to write the weakest script of his career.As far as Scott- behind the camera- is concerned, he does utilize the caliber of the cast to the last drop, but there isn't enough concrete material to walk on. Washington, in the bad boy coat, is a threat to watch out for, his rage empowers not only on the characters but on the viewers too. And to balance the tone on the other side is, Crowe as the complex yet better person to root on, frankly his personal life has much more to offer than his professional, no matter how much limited it is.Spicing up their relationship, lies Brolin's challenging performance that is explored the least among all. Despite of having such an electrifying performances, the conversation aren't zazzy enough to spark up the screen as it was anticipated and the apt example would be when Brolin and Washington goes head to head; the trash talk is just not working. And the rest of the time is spent upon creating the stereotypical montages like the loss of consciousness, the rudimentary investigation process and an imperial party gone wrong. American Gangster neither is Americana nor gangster-ous enough to define it cinematically."}, {"rating": "10", "text": "here we go again, People are giving one of the greatest movie this year a bad rating, but are support stupid movies such as Dragon wars, Transformers, and the Saw 4, omg, people study film first, dont just watch it without looking into the storyline, this has one of the best story line, I mean, sure, there has been a lot of gangster movies where it shows the cop and the gangster's side of the story but this was based on a true story. I thought it was one of the best this year. And also, it has two of the world's most talented actors; Denzel Washington and Russel Crowe. Now who ever is saying that this movie sucks, take film studies, and also to those who supports cheesy movies such as Dragon wars,Transformers and Rush Hour 3, you should stop reviewing movies, cause you have no idea, what youre talking about, thank you."}, {"rating": "10", "text": "Somewhere between The French Connection and The Godfather.. an amazing film that took me back in time, GO SEE THIS MOVIE !"}, {"rating": "8", "text": "If \"American Gangster\" began with Frank Lucas' formative years as \"Good Fellas\" did with Henry Hill, the filmmaker would be accused of slavish imitation. But \"American Gangster\" needs to know what makes Frank Lucas (Denzel Washington) tick. Despite the long running time, the story feels rushed. Not enough time is spent between Frank and his mentor. We're denied \"the making of a criminal\" portion of the film. When Frank assumes the leadership role in Harlem, we feel no palpable excitement. We don't know him. \"American Gangster\" gets off to a slow start, but hang in there, things improve considerably when we finally learn where Frank's roots are planted. The film also concurs the long-held belief by conspiracy theorists that drugs could be prevented from entering the country if law officials wanted this to be the case. But the drug business employs too much people. Frank Lucas is despicable. But he doesn't beat his wife, or rather, did Denzel Washington not want to put his screen image at further risk by hurting a woman?"}, {"rating": "6", "text": "This is a thoroughly overrated film certainly undeserving of the rave reviews it got. I wasn"}, {"rating": "10", "text": "Excellent!!! Screenplay, writing, production!!!! Kudos to all !!!"}, {"rating": "10", "text": "Fantastic cinematography, acting, and producing."}, {"rating": "10", "text": "Brilliant acting... A terrific movie all around."}, {"rating": "9", "text": "Not the best gangster movie ever, but pretty close. Great story, great acting, overall a great movie."}, {"rating": "9", "text": "Convincing acting. Well directed. Suspenseful score. I highly recommend it."}, {"rating": "9", "text": "Denzel Washington's performance was stunningly superb, perhaps his finest yet. The sheer ability to mold and delve into his character shows that he has reached the highest echelons of acting. Crowe, on the other hand, was slightly disappointing. The character seemed to large for the actor. There were several moments where he seemed quite \"cheesy\" and unconvincing, definitely not the Gladiator material we have seen before. Washington's dramatic display clearly overshadows that of Crowe. Ridley Scott's direction was sublime, as he flawlessly portrayed Harlem during the time period -- a period of darkness for New York City in the 1970's. The ending was somewhat unsatisfying, as the recently released Frank Lucas stands on the sidewalk, pondering his fate, and his next move."}, {"rating": "10", "text": "mesmerizing! Awesome performance by Denzel Washington. The next American crime film classic."}, {"rating": "8", "text": "Great film by a great director! Denzel continues to amaze."}, {"rating": "10", "text": "I can think of nothing they could have done to make this film better.Based on true charactors and set in the 70's ,the story , acting and props were all first rate. This may not be the best movie ever , but it's as good as it ever could be,and the best thing I've seen in 2007. I knew it was 2.5 hours long going in , but it didn't seem like it. There's not a weak or unnecessary frame in the entire film. Bill C."}, {"rating": "6", "text": "I thought the action was slow and lame, the focus seemed to be in all the bad places and some important details we're misplaced. Even thought, Denzel kept us entertained with his amazing acting."}, {"rating": "8", "text": "Well crafted crime movie that is a cut above the average dross. Don't go in expecting the next \"Godfather\" or \"Goodfellas\" and you wont be dissapointed. About as good as The Departed (which as everybody knows was not as good as the original HK flick)"}, {"rating": "5", "text": "There was much to look at, but little to really appreciate. In terms of story, there is nothing new to this film in the least. There are visual and thematic reminders of many other, and many better, crime films. In the end, this film strangely glorifies a truly dangerous and despicable man -- someone who has contributed mightily to the detriment of black and inner city people in America. The film seems to be mostly indifferent to that fact. The acting is fine (Denzel is getting to mannered, though -- whats with the \"My man\" phrase in every performance now?) and the look is accomplished, but the movie is generally a bore."}, {"rating": "8", "text": "Great film, could of done with a bit more between frank (Washington) and his mentor, but other than that its a good story which does make you think. Also in response to Ben B (Who did make me laugh) The film is based on a true story!"}, {"rating": "0", "text": "I hate you this movie."}, {"rating": "6", "text": "Great acting, Shakespearian plot, where all characters get their just desserts in the end, but the story moves along too inevitably and predictably for the viewer to feel it is true-to-life."}, {"rating": "9", "text": "Really great movie. From what I can, a accurate protrail of New York in the 70's. Great mix of action and detective. Crowe and Washington do great. Not too gory either."}, {"rating": "5", "text": "This film is completely watchable, and not boring. But given that you had a formerly great director (Ridley Scott) working with a truly great actor (Denzel Washington) on a story with real potential for depth, it was amazingly flat. No real development of Denzel's character, despite some interesting possibilities (he'd just gotten back from Vietnam in 1968! And he came back to Harlem in the middle of one of its most vibrant and, yes, messed up periods!) You never even get a feeling you're IN Harlem here. Really a surprising failure of a movie."}, {"rating": "4", "text": "Denzel is a snore (though that might just be his signature method), Crowe is so-so, the movie is a chaotic mess and soooooo pointlessly long and I love the scene towards the end where this psycho who has destroyed more live than your average serial killer is portrayed as a deep down inside nice guy."}, {"rating": "9", "text": "This is perhaps one of Denzel"}, {"rating": "8", "text": "Amazing. it's a typical Ridley Scott movie. Specially and most of all the intense drill down in the personalitties of Mr Washington and Mr Crowe as the Gangster and the Policeman."}, {"rating": "9", "text": "This American classic crime film was very well executed. From scene to scene I was in the edge of my seat. The violence involved in the plot of the story took me by surprise, other than that the violence portrayed in the film was up to par. To my understanding, most of the scenes in the movie were based on true events. In my opinion, any film that is based on a true story makes the movie experience more entertaining. As always, Denzel Washington played the role of an American gangster to perfection. Even though, he plays similar roles in other movies he did a superb job."}, {"rating": "10", "text": "Really solid film."}, {"rating": "8", "text": "Ridley Scott comes back with a great movie. Denzel brings back his bad side from Training Day. A must see in theaters if you are a fan of movies."}, {"rating": "8", "text": "Very good, but not great. Certainly not in the league of Godfather I and II or Goodfellas, as some have suggested. There is some bravura filmmaking to be sure, and the quiet menace in Washington's portrayal is often chilling. The scene in which he confronts Cuba Gooding's character (could this be Gooding's return from a ten year celluloid purgatory?) is actually better than the climactic scene between the two leads. But as always, Scott is more concerned with filling the screen than he is with convincing portrayals of characters or of social context. You're never bored, but you leave the theatre no clearer about the characters' motivations than when you went in."}, {"rating": "7", "text": "This film is one I can see being great to watch on a rainy Sunday afternoon in the future, but is not particularly thrilling. It is a tad long, and the ending is a bit like \"oh, was that it??\" BUT, the story is still very interesting once the two characters become intertwined and Crowe and Washington both offer solid performances."}, {"rating": "8", "text": "Great acting, great story, and truly compelling motion picture. It's biggest flaw make come from the lack of time spent with the Frank Lucas character. Important events seem to get glossed over quickly, but Washington keeps things interesting. I found, however, myself more vested in the Russell Crowe storyline. I found myself rooting for Crowe's success as opposed to Washington's downfall. The direction was top notch, and when everything came together, it worked as a sublime bit of entertainment. It's just those minor flaws that keep it from being the next great crime movie in the vein of The Departed."}], "recommendations": ["body_of_lies", "changeling", "donnie_brasco", "inside_man", "the_departed", "argo", "public_enemies", "a_most_wanted_man", "man_on_fire", "breach", "the_godfather_part_iii", "the_accountant", "true_grit", "the_equalizer_2", "widows", "a_most_violent_year", "rush", "american_hustle", "mystic_river", "hell_or_high_water", "black_mass", "the_infiltrator", "the_1517_to_paris", "the_irishman", "broken_city"]}