{"id": 1021, "title": "American Pie 2", "starring": ["Jason Biggs", "Thomas Ian Nicholas"], "runtime": 108, "genre": ["Comedy", "Romance"], "description": "After a year apart - attending different schools, meeting different people - the guys rent a beach house and vow to make this the best summer ever. As it turns out, whether that will happen or not has a lot to do with the girls. Between the wild parties, outrageous revelations and yes, a trip to band camp, they discover that times change and people change, but in the end, it's all about sticking together.", "releaseYear": "2001", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/854ZZxXdeabAs90mrV72NqShJqR.jpg", "categories": {"plot": 8.461538461538462, "acting": 8.88888888888889, "ending": 9.0, "soundtrack": 8.0, "cinematography": 5.0, "familyFriendly": 3.0, "funny": 6.705882352941177, "action": 6.0}, "reviews": [{"rating": "6", "text": "Same crew. Same sense of humor. Same ridiculous situations. I love it but it's not quite the classic that the first one is. Eugene Levy is so freakin hilarious"}, {"rating": "7", "text": "It was nice to see the American Pie boys reunited for a sequel. I think this film has aged pretty well over thirteen years. Still being a fairly young person myself it hard not to relate to these character and get laughs from them. American Pie 2 is just as solid as the first film in my opinion and I can watch either film any time its on."}, {"rating": "6", "text": "American Pie 2 is still funny, yes, but the storyline that made the original so fresh and exciting is washed over here. But, thanks to the smart screenwriters, the third movie, American Wedding, felt new again, so we can forgive them for this one only being average."}, {"rating": "7", "text": "American Pie 2 is just as good as the original, if not better. The characters continue to be developed in the right direction, the producers take a step up in the soundtrack department, and the plot line is a pleasant change of pace from the original. It is rare for the \"college age\" genre to produce quality sequels, but American Pie 2 is the perfect example. It produces honest gut wrenching laughs and deserves to be watched for anyone that enjoys a good comedy."}, {"rating": "0", "text": "This could be the worst movie of all times. If you laugh when you see a poo on the street, you will love and this would be your new god."}, {"rating": "7", "text": "Не знаю, как для других людей, но персонажи данной ленты немного напоминают меня и моих друзей. Такие же пошляки не разлей вода. Сам фильм хоть и имеет очень туалетные шутки, но выезжает за счёт интересных ситуаций, а сцена с лесбиянками дорогого стоит.Судя по рейтингу - фильм нравится не всем, но вдруг именно вам зайдёт."}, {"rating": "7", "text": "Not as funny as the original, but still has alot of heart and still a good film."}, {"rating": "10", "text": "If you watch American Pie 2 after watching American Pie 1, you will laugh so hard on this film. I laugh really hard on this AMAZING  FILM. THIS movie was one of the FUNNIEST film I ever seen"}, {"rating": "6", "text": "**** **** **** **** How you doin' boys?American Pie 1.1 and not as good as the first one."}, {"rating": "7", "text": "It may not have the soul the first movie did, but its still funny as hell."}, {"rating": "7", "text": "Like the first American Pie film, it has the same wacky humor that it had, but sometimes this sequel drags out when trying to give a more cohesive approach in terms of plot development and humor."}, {"rating": "10", "text": "Are favorite relate able merriment characters are back in this zany, charming grown up franchise! This sequel hasn't change at all it's fresh not to mention the four leads can pull of to make these characters  still the same. After their first year at college, the guys reunite for another summer of fun. Jim (Jason Biggs) unexpectedly gets a call from Nadia (Shannon Elizabeth) who's going to visit him, he doesn't want to screw it up like he did last time trying to get with her, so he lets his prom date Michele (Alyson Hannigan) help him be better at sex. Kevin (Thomas Ian Nicholas) and Vicky (Tara Reid)  find themselves in a weird situation after they broken up for a year will they be friends or get back together? Oz (Chris Klein) is surviving this long distance relationship with Heather (Mena Suvari). Meanwhile, Stifler (Sean William Scott) hates Finch for (Eddie Kaye Thomas) banging his mom. Is better than the first one? Does it really matter? It is an original sequel that Adam Herz does a fine job keeping the soul of the film not to mention that he keeps the characters and makes it fresh again. Grade A"}, {"rating": "10", "text": "This movie was non-stop laughs. Although the movie story was mainly based on Jason Biggs, every three minutes you were laughing. This movie was raunchy yet hilarious. I thought that all the charecters had their moments (some more than others). I went to see this movie with my friend's 48-year-old mom and even she was on the floor laughing. I think that Jason Biggs has large marbles for some of those scenes. Seann William Scott, although incrediably rude, was the best comedic wise. All of the charecters were back in the movie and it was ten times better than the first. AM2 is a must see. Hey marc.  (Ed:  Hey Sean!)"}, {"rating": "10", "text": "American Pie 2 is as fun as its predecessor, if not even better, bigger and more amusing! I enjoyed every second of it till the credits. American Pie 2 is a must!"}, {"rating": "2", "text": "I haven't even seen this. But i have seen some trailers which will help with writing the review. So, this masterpiece is comedy. No, **** suppose. It's the comedy, of course. I could even laugh watching this. It's comedy, but silly one."}, {"rating": "10", "text": "Excellent, funny, youth film :) And such low rating it have only by oldmens xD"}, {"rating": "9", "text": "Literally one of rare feel good movie it felt nostalgic,relatable,fun,hilarious and entertaining,the music was amazing,the story was much of same like 1st one with slight changes although the feel of this movie is un-describable it was awesome as hell,the acting and the characters were once again great as hell,the situations were like improved version of 1st one it was 2x fun this time,the starting intro in room,the pissing in head at party,the lesbian's talk and the whole Finch thing it was literally the most funniest things,the movie was relatable AF the making memories and the feeling of plans getting little low afterwards it was amazing,the phone talks of heather and Oz was gross but funny,the Jim's dad was like brief moments in it but he was awesome and cool,the glue incident was surprisingly hilarious and mind-blowingly awesome.the same obsession of getting laid with same person and there desperate thing was again brilliant the other character with the Vicky she was awesome. Stifler's brother and her mom at last was hilarious and fun to watch,the Stifler was literally amazing character throughout the movie he was fantastically hilarious and awesome.the build-up of relation between Jim and Michelle was amazing they both were great,the ending with everyone settling with there partners and the cut with the Stifler's mom it was hell of a Fun and entertaining ride,seriously the movie's feel is literally another level amazing it was predictable but it was rarest feel good movie its a classic amazing sequel!"}, {"rating": "5", "text": "Yes, the comedy still has that quality typical, but the sequel begins to lose the joke goes as releasing new films, the audience gets used to a kind of comedy, and then when seen for the second time no longer has the strength it had in first impact."}, {"rating": "8", "text": "The scene in the house where the 2 girls are commanding the boys and vica versa is legendary. The movie is not as great as the first one but still funny."}, {"rating": "4", "text": "Yes, the comedy still has that quality typical, but the sequel begins to lose the joke goes as releasing new films, the audience gets used to a kind of comedy, and then when seen for the second time no longer has the strength it had in first impact..."}, {"rating": "5", "text": "I think this an alright follow up to the first one but it's just not as funny or good."}, {"rating": "8", "text": "It is funny, it is entertaining, and it continues the fun we had in part 1. I'd say this movie is excellent and perfect for a lazy sunday. It gets an 8/10 from me."}, {"rating": "10", "text": "Simply the best film I have ever seen. Far far away in front of Star Wars, Jurassic Park, Lord of the rings or others Harry Potter. It have all what I want from a movie"}], "recommendations": ["american_wedding", "ted", "american_reunion", "22_jump_street", "the_three_stooges", "zack_and_miri_make_a_porno", "american_pie", "blended", "ted_2", "the_spongebob_squarepants_movie", "neighbors", "just_friends", "step_brothers", "hot_tub_time_machine", "night_at_the_museum", "yes_man", "21_jump_street", "dumb_and_dumber_to", "little_fockers", "jackass_presents_bad_grandpa", "dinner_for_schmucks", "johnny_english_reborn", "pitch_perfect_2", "bad_santa", "the_other_guys"]}