{
  "id": 2506,
  "title": "American Psycho",
  "starring": [
    "Christian Bale",
    "Willem Dafoe"
  ],
  "runtime": 102,
  "genre": [
    "Thriller",
    "Drama",
    "Crime"
  ],
  "description": "A wealthy New York investment banking executive hides his alternate psychopathic ego from his co-workers and friends as he escalates deeper into his illogical, gratuitous fantasies.",
  "releaseYear": "2000",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/9uGHEgsiUXjCNq8wdq4r49YL8A1.jpg",
  "categories": {
    "plot": 9.708333333333334,
    "acting": 9.736842105263158,
    "ending": 9.666666666666666,
    "soundtrack": 9.666666666666666,
    "cinematography": 10.0,
    "familyFriendly": 3.0,
    "funny": 9.736842105263158,
    "action": 9.5
  },
  "reviews": [
    {
      "rating": "10",
      "text": "This is a very intriguing movie. We get to watch as Patrick Bateman's sanity slowly slips away to his uncontrollable nightly blood lust. However, we find out that he may be delusional, and not necessarily dangerous. I still can't decide whether he is crazy or a serial killer."
    },
    {
      "rating": "10",
      "text": "One of the best and most underrated movies of all time IMHO. Its smart , funny and gory with deep dark undertones about the paradoxical times we live in"
    },
    {
      "rating": "10",
      "text": "Wow just wow amazing movie hilarious and quotable i never get tired of it and Bales performance is mind blowing and this happens to be my favorite movie ever"
    },
    {
      "rating": "10",
      "text": "Published in 1991, Bret Easton Ellis' third novel was greeted by howls of hatred more appropriate to a small war in the Third World or another Golan-Globus Lemon Popsicle sequel. A first person report from inside the mind of Patrick Bateman, who epitomises the ills of the 1980s by combining the professions of Wall Street broker (\"mergers and acquisitions\") and serial killer (\"murders and executions\"), the book was widely misinterpreted as a hideously misogynist tract that used explicit violence to draw attention to a thinly-plotted pretend thriller with dollops of surface-level satire.\r There has always been the threat of a film, with such scary names as Oliver Stone, Brian De Palma and David Cronenberg in the ring - but the project has fallen to Mary Harron, the ex-BBC documentarian who made an underrated debut with I Shot Andy Warhol, who has cannily brought aboard the apparently unlikely Guinevere Turner (the lesbian icon from Go Fish) to co-write and play the funniest victim. The result is the best imaginable film of very difficult material; it doesn't say much more than, \"The 80s were **** but manages exactly to catch the all-surfaces, dazzlingly obsessive tone of the novel, making its points by treating all subjects - nouvelle cuisine, MOR rock music, fitness kicks, clothes, personal grooming - with exactly the same pornographic attention to detail as the sex and violence.\r Like the book, the film makes a point of not having a real plot: a smooth PI (Dafoe) seems set to nail the killer for the murder of a rival trader (Leto), but fades into the wallpaper along with the crime itself. Bateman, played with dead-inside charm and mounting hysteria by an astonishing Christian Bale, invites us into his world of reservations at exclusive restaurants and competitions over the quality of business cards. His detours into murder - prefaced by detailed speeches about now-embarrassing musical enthusiasms (\"You actually own a Whitney Houston CD?\" gasps Turner through contemptuous laughter. \"More than one?\") - are hardly more bizarre and tasteless as everything else in his life. In the end, the scariest thing about Bateman is not that he's a Lecter-like freak - his crack-up in the last act brings him horribly closer to humanity - but that he is no worse than everyone else in his world, except humane-but-dim office minion Sevigny, whose role is to make the film bearable.\r As for the horror: Harron is mostly very discreet, but delivers one terrific apartment-of-grue sequence as Bateman's life falls to pieces along with many victims, featuring a truly nerve-shredding chainsaw sound effect.\r Often laugh-out-loud funny, conveying the cruelty of its world through persistent mistakings of identity among the well-scrubbed young men and details like the all-sharp-edges interior decor and elaborate but tiny meals, it's cool in the sense of remote rather than hip. And you wouldn't want to be seen dead with the soundtrack album."
    },
    {
      "rating": "10",
      "text": "A New York stock broker spends his evenings killing people, or does he?\r Like the book, the film makes a point of not having a real plot: a smooth PI (Dafoe) seems set to nail the killer for the murder of a rival trader (Leto), but fades into the wallpaper along with the crime itself. Bateman, played with dead-inside charm and mounting hysteria by an astonishing Christian Bale, invites us into his world of reservations at exclusive restaurants and competitions over the quality of business cards. His detours into murder - prefaced by detailed speeches about now-embarrassing musical enthusiasms (\"You actually own a Whitney Houston CD?\" gasps Turner through contemptuous laughter. \"More than one?\") - are hardly more bizarre and tasteless as everything else in his life. In the end, the scariest thing about Bateman is not that he's a Lecter-like freak - his crack-up in the last act brings him horribly closer to humanity - but that he is no worse than everyone else in his world, except humane-but-dim office minion Sevigny, whose role is to make the film bearable.\r Often laugh-out-loud funny, conveying the cruelty of its world through persistent mistakings of identity among the well-scrubbed young men and details like the all-sharp-edges interior decor and elaborate but tiny meals, it's cool in the sense of remote rather than hip. Also a brilliant soundtrack album. One of the best films ever!"
    },
    {
      "rating": "10",
      "text": "A New York stock broker spends his evenings killing people, or does he?\r Watching \"American Psycho\" is like witnessing a bravura sleight-of-hand feat. In adapting Bret Easton Ellis's turgid, gory 1991 novel to the screen, the director Mary Harron has boiled a bloated stew of brand names and butchery into a lean and mean horror comedy classic. The transformation is so surprising that when the movie's over, it feels as if you've just seen a magician pull a dancing rabbit out of a top hat.\r At the heart of the film is a star-making performance by the handsome Welsh actor Christian Bale (adopting an impeccably snooty pseudo-preppie American accent) that softens the novel's portrait of a serial-killing Wall Street hotshot just enough to force us to identify with this ultimate narcissist. Mr. Bale's portrayal of 27-year-old Patrick Bateman, a budding master of the universe by day (he works in mergers and acquisitions, which he facetiously refers to as \"murders and executions\") and homicidal maniac by night, is alternately funny, blood-curdling and pathetic.\r From the opening credits, in which drops of blood are confused with red berry sauce drizzled on an exquisitely arranged plate of nouvelle cuisine, the movie establishes its insidious balance of humor and aestheticized gore. That sly confusion between the beautiful and the gruesome extends to the language of the screenplay by Ms. Harron and Guinevere Turner.\r As brilliantly as the movie's visual style evokes a world spat out by a Vanity Fair art director, \"American Psycho\" remains a one-joke satire of materialism and soullessness. It's a joke we would like to think we've got. Having arrived safely in the year 2000, it would be easy to shrug off \"American Psycho\" as the last cinematic word on an embarrassingly gluttonous cultural moment that has gone the way of Patrick's favorite murderous background anthem, \"Hip to Be Square.\" But has it?\r A very twisted and dark comedy. One of my personal favorites. Flawless!"
    },
    {
      "rating": "10",
      "text": "A New York stock broker spends his evenings killing people, or does he?\r Watching \"American Psycho\" is like witnessing a bravura sleight-of-hand feat. In adapting Bret Easton Ellis's turgid, gory 1991 novel to the screen, the director Mary Harron has boiled a bloated stew of brand names and butchery into a lean and mean horror comedy classic. The transformation is so surprising that when the movie's over, it feels as if you've just seen a magician pull a dancing rabbit out of a top hat.\r At the heart of the film is a star-making performance by the handsome Welsh actor Christian Bale (adopting an impeccably snooty pseudo-preppie American accent) that softens the novel's portrait of a serial-killing Wall Street hotshot just enough to force us to identify with this ultimate narcissist. Mr. Bale's portrayal of 27-year-old Patrick Bateman, a budding master of the universe by day (he works in mergers and acquisitions, which he facetiously refers to as \"murders and executions\") and homicidal maniac by night, is alternately funny, blood-curdling and pathetic.\r From the opening credits, in which drops of blood are confused with red berry sauce drizzled on an exquisitely arranged plate of nouvelle cuisine, the movie establishes its insidious balance of humor and aestheticized gore. That sly confusion between the beautiful and the gruesome extends to the language of the screenplay by Ms. Harron and Guinevere Turner.\r As brilliantly as the movie's visual style evokes a world spat out by a Vanity Fair art director, \"American Psycho\" remains a one-joke satire of materialism and soullessness. It's a joke we would like to think we've got. Having arrived safely in the year 2000, it would be easy to shrug off \"American Psycho\" as the last cinematic word on an embarrassingly gluttonous cultural moment that has gone the way of Patrick's favorite murderous background anthem, \"Hip to Be Square.\" But has it?\r A very twisted and dark comedy. One of my personal favorites. Flawless!"
    },
    {
      "rating": "10",
      "text": "'American Psycho': Murderer! Fiend! Cad! (But Well-Dressed)\r Watching \"American Psycho\" is like witnessing a bravura sleight-of-hand feat. In adapting Bret Easton Ellis's turgid, gory 1991 novel to the screen, the director Mary Harron has boiled a bloated stew of brand names and butchery into a lean and mean horror comedy classic. The transformation is so surprising that when the movie's over, it feels as if you've just seen a magician pull a dancing rabbit out of a top hat.\r Four years ago Ms. Harron's film \"I Shot Andy Warhol\" performed similar magic by creating credible facsimiles of Warhol and his motley entourage. \"American Psycho,\" a more ambitious, far more confident film, salvages a novel widely loathed for its putative misogyny and gruesome torture scenes by removing its excess fat in a kind of cinematic liposuction. Except for a few wittily chosen lists, the book's numbing catalog of high-end consumer items has been drastically edited. Its murder rate has also plunged. The trimming demonstrates once again that less is often more. What remains of the story is a sleek, satirical, yuppie-era \"Jekyll and Hyde\" that blithely tap dances along the fault lines separating movie genres.\r At the heart of the film is a star-making performance by the handsome Welsh actor Christian Bale (adopting an impeccably snooty pseudo-preppie American accent) that softens the novel's portrait of a serial-killing Wall Street hotshot just enough to force us to identify with this ultimate narcissist. Mr. Bale's portrayal of 27-year-old Patrick Bateman, a budding master of the universe by day (he works in mergers and acquisitions, which he facetiously refers to as \"murders and executions\") and homicidal maniac by night, is alternately funny, blood-curdling and pathetic.\r As this character metamorphoses from preening, wolfish yuppie to chain-saw wielding maniac to whimpering crybaby, Mr. Bale makes us feel the underlying connections between these multiple personalities. One minute Mr. Bale's Patrick is a cowering corporate geek and self-described empty shell, the next an arrogant, name-dropping smoothie, the next a hysterical wimp unable to distinguish reality from fantasy.\r He's also a serial killer, or at least he is in his imagination. The movie plays adroitly with the notion that his violent spasms are merely the revenge fantasies of a repressed corporate toady. The fluidity with which Mr. Bale moves from one state of mind to the other makes for the kind of tour-de-force performance you'd expect from Sean Penn, another master of throwing tear-stained tantrums.\r From the opening credits, in which drops of blood are confused with red berry sauce drizzled on an exquisitely arranged plate of nouvelle cuisine, the movie establishes its insidious balance of humor and aestheticized gore. That sly confusion between the beautiful and the gruesome extends to the language of the screenplay by Ms. Harron and Guinevere Turner.\r Dinner specials are described by waiters in the tones of unctuous coroners announcing the results of autopsies.\r Some of the funniest speeches are Patrick's pompous lectures -- each a prelude to homicide -- on the 80's pop stalwarts Phil Collins, Whitney Houston, and Huey Lewis and the News.\r While the movie's interiors conform to late-80's styles of design and architecture, they, too, are eerily exaggerated. The severe black-and-white minimalism of Patrick's gadget-filled apartment has the feel of a high-rise morgue.\r The movie's sexual ethos is a bifurcated world of male monsters and their often shallow but still recognizably human girlfriends. Patrick and his Wall Street cronies are interchangeable reptilian pod people, soulless under their designer-label shells and supercilious smirks. (One running joke finds Patrick being continually confused with others, despite his wealth, status and miraculous instant entree to New York's priciest restaurants.)\r In one hilarious early scene, he and his colleagues compare their business cards (the texture of the paper and the quality of embossing) in a competitive game of show and tell that has a murderous undertone. Those colleagues, wittily embodied by Jared Leto, Justin Theroux, Matt Ross and Bill Sage, are the ne plus ultra in cocky, carnivorous sang-froid.\r Compared with these robotic cobras, the women are almost poignantly human. Reese Witherspoon,\r At the very least, \"American Psycho\" is a dazzling period satire. It's still too early to know what, if anything, it might foretell."
    },
    {
      "rating": "10",
      "text": "Leonardo DiCaprio was asking $21 million to play the lead, forcing the film's budget up to $40 million. When he quit, and Christian Bale resumed the role, the budget went back down to a more reasonable $7 million. With a box office take in excess of $34 million, the film proved successful."
    },
    {
      "rating": "9",
      "text": "American Psycho is one of the most deranged yet enjoyable stories ever committed to film. A satire of the \"yuppie\" lifestyle of the 1980s, and a warning against the corrupting power of money, it's expertly told, well-scripted, somewhat disturbingly funny, and grusomely thrilling. The entire film pretty much hinges on one performance, that of Christian Bale's increasingly disturbed Wall Street trader-by-day and serial killer-by-night Patrick Bateman. Bale doesn't disappoint, delivering the performance of his career, and in the process creating a horror villain to rival Norman Bates, and an anti-hero and chillingly disturbing narrator to rival Alex DeLarge. Comparissons to such films as Psycho and A Clockwork Orange are inevitable, and American Psycho could be seen as an affectionate tribute to both, but with its own ideas to add to the bubbling cauldron of depravity. All these films use madness as a metaphor for something wrong with society - in Psycho it's misogyny, in A Clockwork Orange it's the corruption of government, and in American Psycho it's the evils of capitalism. The films are similar in many ways, amd vastly different in others, but all three communicate a powerful message to their audience extremely effectively. American Psycho certainly deserves equal recognition as a film - the performances are just as good, the story just as engaging, the underlying themes just as dark and compelling. Even director Mary Harron shows great flair in her art, though sadly as a cult film director she is unlikely to be classed in the same league as so-called \"masters\" as **** and Kubrick. If you enjoy the film, cult icon as it is, then feel free to be smug in the fact that you and a select group of others appreciate a truly fine, though criminally underrated film."
    },
    {
      "rating": "9",
      "text": "Satiric and socially relevant. A film not for the faint of heart. Filled with violence but with a purpose. Christian Bale creates an interesting performance. A must see, well stylized dark comedy with a lot to say. Soon to be a modern classic, and certainly deserving of its cult following."
    },
    {
      "rating": "10",
      "text": "In the novel, Patrick Bateman is a way more misogynistic, racist, sexist, homophobic, and xenophobic character. These characteristics were overall heavily toned down in the film in order to make his character more tolerable, even though some of those characteristics were still subtly present."
    },
    {
      "rating": "9",
      "text": "Featuring some of Christian Bale's greatest work, and some priceless juxtapositions of horror and humor, \"American Psycho\" remains a hysterically written piece of satire."
    },
    {
      "rating": "10",
      "text": "Based on the book of the same name, American Psycho is a journey through the mind of a mentally deranged yuppie. While that makes it seem like a very serious movie it's actually very funny in a dark sense. Christian Bale is delightful as the main character Patrick Bateman."
    },
    {
      "rating": "10",
      "text": "11/10 would watch again.\rIt's funny, I seriously just love watching people die. It legitimately turns me on, at least a bit. Good, good, good movie..."
    },
    {
      "rating": "10",
      "text": "American Psycho has a terrific plot, acting and is a satire of the lifestyle of those who lived in the 1980's.\rThe movie is absorbing and intricate which is great to see. The movie also has great comedy provided\rby Christian Bale. Bale put so many facets into his character that it would take a while to list them\rall, one of my favourite thrillers, A+."
    },
    {
      "rating": "10",
      "text": "American Psycho is brilliant social satire cleverly dressed up as a slasher film. I love it! A masterwork."
    },
    {
      "rating": "10",
      "text": "To be honest I never thought Christian Bale was that incredible as an actor... until I saw this movie, and I was blown away. What a an amazing performance, being able to create a character so deep but completely shallow at the same time. It's like Dexter, but 10 times more insane, satirical and absolutely terrifying."
    },
    {
      "rating": "9",
      "text": "Without a shadow of a doubt one of the most underrated movies I have ever had the privilege of watching. Christian Bale plays the role so well and the story is full of clever plot points and surprises throughout. Why this film got such mixed reviews upon release is beyond me, it's so well made. Thankfully with age this film has seen it's fan base and popularity grow and rightly so, this film is so worth watching!"
    },
    {
      "rating": "9",
      "text": "This is one of my favorite films of all time. It's extremely well-acted, and I love the 80's vibe of the film. It's quite an interesting take on the slasher film with our main character, portrayed quite darkly by Christian Bale. \"American Psycho\" is a very interesting (and even sometimes funny) look into the mind of a serial killer, and it's a very intense and enjoyable film. I give it my highest recommendation."
    },
    {
      "rating": "9",
      "text": "Amazing performance from Christian Bale and one of the best mindf**k movies I have seen. It makes you think, it is unpredictable, a bit weird but in a good way and interesting throughout. Didn't give it a 10 just because I give 10 only to my favorite movies and this is close, but no cigar."
    },
    {
      "rating": "9",
      "text": "Christian Bale is all around the film all the way through and this is why his character is age 27 and well educated and that is why he's born in 1974. I absolutely love Christian Bale's performance. He really does give his performance a lot of humor and horror which I don't think this movie is scary to be honest. There are some 80's songs which I absolutely love. They completely fit to the film in the late 1980's. I'm surprised that the filmmakers didn't put any 90's songs in it. Maybe it's because the novel seems written in the 80's.The 80's songs are:New Order - True Faith.You're a f&$%!^g ugly b£$%h. I want to stab you to death, and then play around with your blood.Katrina and the Waves - Walking on Sunshine.Robert Palmer - Simply Irresistible.I'm trying to listen to the new Robert Palmer tape, but Evelyn, my supposed fiancee, keeps buzzing in my ear.Huey Lewis and the News - Hip To Be Square.Do you like Huey Lewis and the News? They're OK. Their early work was a little too new wave for my tastes, but when Sports came out in '83, I think they really came into their own, commercially and artistically. The whole album has a clear, crisp sound, and a new sheen of consummate professionalism that really gives the songs a big boost. He's been compared to Elvis Costello, but I think Huey has a far more bitter, cynical sense of humour. Hey Halberstram. Yes, Allen? Why are there copies of the style section all over the place, d-do you have a dog? A little chow or something? No, Allen? Is that a rain coat? Yes it is! In '87, Huey released this, Fore, their most accomplished album. I think their undisputed masterpiece is ''Hip To Be Square'', a song so catchy' most people probably don't listen to the lyrics. But they should, because it's not just about the pleasures of conformity, and the importance of trends, it's also a personal statement about the band itself. Hey Paul! (Screams) TRY GETTING A RESERVATION AT DORSIA NOW, YOU F&^%ING STUPID B£$%^&D! (Screams) YOU F&^%ING B£$%^&D!Chris de Burgh - Lady in Red.Simply Red - If You Don't Know Me By Now.Genesis - In Too Deep.Do you like Phil Collins? I've been a big Genesis fan ever since the release of their 1980 album, Duke. Before that, I really didn't understand any of their work. Too artsy, too intellectual. it was on Duke where Phil Collins' presence became more apparent. I think Invisible Touch was the group's undisputed masterpiece. It's an epic meditation and on intangibility. At the same time, it deepens an enriches the meaning of the preceding three albums. Christy, take off the robe. Listen to the brilliant ensemble playing of Banks, Collins and Rutherford. You can practically hear every nuance of every instrument. Sabrina, remove you dress. In terms of lyrical craftsmanship, the sheer songwriting, this album hits a new peak of professionalism. Sabrina, why don't you, uh, dance a little. Take the lyrics to Land of Confusion. In this song, Phil Collins addresses the problems of abusive political authority. In To Deep is the most moving pop song in the 1980s, about monogamy and commitment. The song is extremely uplifting. Their lyrics are as positive and affirmative as anything I've heard in rock. Christy, get down on your knees so Sabrina can see your a$$hole. Phil Collins' solo career seems to be more commercial and therefore satisfying, in a narrower way. Especially songs like In The Air Tonight and Against All Odds. Sabrina, don't just stare at it, eat it. But I also think Phil Collins works best within the confines of the group, than as a solo artist, and I stress the word artist.Phil Collins - Sussudio.This is Sussudio, a great, great song, a personal favourite.Curiosity Killed The Cat - Red Lights.Whitney Houston - Greatest Love Of All. Do you know that Whitney Houston's debut LP, called simply Whitney Houston had 4 number one singles on it? Did you know that, Christy? You actually listen to Whitney Houston? You've own a Whitney Houston CD? More than one?' It's hard to choose a favourite among so many great tracks, but ''The Greatest Love Of All'' is one of the best, most powerful songs ever written about self-preservation, dignity. It's universal message crosses all boundaries and installs one with the hope that it's not late to better ourselves. Since, Elizabeth, it's impossible in this world we live in to empathize with others, we can always empathize with ourselves. It's an important message, crucial really. And it's beautifully stated on the album.(Whooh!) That's a lot of thought that I've been working on! There's just so many speeches that I have to put in what Christian Bale's character says. Well, that's the way it goes, folks. Brilliantly directed and acted by Christian Bale. Nothing can go wrong with the movie."
    },
    {
      "rating": "9",
      "text": "This movie proves why Christian Bale is one of the best actors. He is totally funny and creepy and brings so much charisma to patrick bateman. A movie that is both creepy and funny and knows how to balance the two tones."
    },
    {
      "rating": "9",
      "text": "So many good and memorable moments, like when he talks to his victims about the music he likes, how passionate he is about his business card, or how much he prepares his face in the morning. Christian Bale did a perfect job, of representing the best serial killer in movie history."
    },
    {
      "rating": "9",
      "text": "American Psycho is an enthralling satire on the world of Wall Street and how we could all be a little less narcissistic In our actions. The film takes an exaggerated but somewhat needed take on how we all want to be noticed and feel important, and Christian bales performance personifies that. 87/100"
    },
    {
      "rating": "9",
      "text": "Crazy, messed up movie. I also loved its comedic elements. Incredible performance by Bale."
    },
    {
      "rating": "10",
      "text": "During the shooting of the film, Christian Bale spoke in an American accent off-set at all times. At the wrap party, when he began to speak in his native English accent, many of the crew thought he was speaking that way as an accent for another film. They had thought he was American throughout the entire shoot."
    },
    {
      "rating": "10",
      "text": "One of the great films of the 2000s!Look at that subtle and polished script. The tasteful cinematography and direction of it. Oh my God, it even has Christian Bale's finest performance.American Psycho is a captivating study of a madman who simultaneously obsesses and criticizes the shallow culture he's a part of and attempts to hide his chaotic personal life through excessive vanity and beautification. Harron's direction is very impressive as she manages to take the story through the narrow route that blurs the line between fiction and reality with great finesse. American Psycho is a fascinating vignette of lunacy and obsession as it intriguingly blends its elements of horror and dark comedy into an exquisitely paced, masterfully directed and magnificently written story that delves into the mind and psyche of its incredibly deranged individual with plenty of success, and remains one of the finest achievements of its genre(s) and of the greatest movies of the 2000s."
    },
    {
      "rating": "10",
      "text": "Great movie with many funny scenes in the beginning about the artificial snobs from the Wall Street. Later the movie gets very bloody and in the end there are a lot of questions. Christian Bale is top"
    },
    {
      "rating": "10",
      "text": "Great soundtrack, good cameraman's work, Bale as always at his best, interesting plot with the deep meaning (no)."
    },
    {
      "rating": "10",
      "text": "Amazing movie, probably my favorite movie of all time. The end was slightly changed compared to the book, which I believe to be the better of the two, but really nothing major changed and it's almost as good. For anyone that thinks it's just a bunch of pointless killing, you should really watch an in-depth breakdown. That is something that certainly helped me enjoy the movie much, much more."
    },
    {
      "rating": "10",
      "text": "The best performance in Christian's career plus a brilliant supporting cast."
    },
    {
      "rating": "10",
      "text": "American Psycho is a brutal, vicious, nihilistic film that more-than-effectively portrays the hollowness of American life by painting Wall Street as a blank, white dystopia in which one's actions, intentions, and confessions mean absolutely nothing and are never noticed. There's tons of great visual cues, which one might call gimmicky, but are nevertheless a hell of a lot of fun to point out and look out for upon rewatching. This is a film meant to resonate powerfully with the viewer and will keep them thinking for a long time to come. You couldn't ask for more from a horror film."
    },
    {
      "rating": "10",
      "text": "a tremendous film and an incredible film in the fact that it does justice to what it is undoubtedly one of the greatest books ever written"
    },
    {
      "rating": "10",
      "text": "The single biggest cost on the film was purchasing the rights to the various songs used throughout."
    },
    {
      "rating": "10",
      "text": "At the beginning of the film Christian Bale's character takes offense to anti-Semitic remarks made by a collegue. In Shaft (2000), released just two months after this film, Christian Bale plays a character who makes racists remarks. Both incidents take place in a restaurant."
    },
    {
      "rating": "10",
      "text": "The film had various problems with designer labels during production. Cerruti agreed to allow Christian Bale to wear their clothes, but not when the character was killing anyone. Rolex agreed that anyone in the film could wear their watches except Bateman (hence the famous line from the book \"Don't touch the Rolex\" had to be changed to \"Don't touch the watch\"). Perry Ellis provided underwear at the last minute after Calvin Klein pulled out of the project. Comme des Garçons refused to allow one of their overnight bags to be used to carry a corpse, so Jean Paul Gaultier was used instead."
    },
    {
      "rating": "10",
      "text": "The \"whoosh\" sounds during the famous business card scene was created by slowing down the sound of a sword being drawn from its sheath.In the DVD commentary, co-writer and director Mary Harron says that during the first shower scene with Patrick Bateman, all of the women on-set gathered around to watch Christian Bale wash himself."
    },
    {
      "rating": "10",
      "text": "American Psycho is a strangely satisfying film.One of the weirdest movies I've seen. Saw on video tape when it came out then recently watched it again 18 years later. Forgot how fun it is to watch. The absurdity of Bale's character Patrick Bateman's shallowness and preoccupation with superficial things like how upset he gets over a colleague having a better business card than him makes this movie comedic while he's slicing up victims. Still not sure about whether or not all of the things happening were all in his head. I guess that's up for anyone's interpretation of the story. Very well done and one of Bale's best performances as if he's ever performed badly."
    },
    {
      "rating": "10",
      "text": "Several of the CDs seen in in the film appear to be silver, blank \"burned\" CDs. CD burning software was not available to the public until the late 1990s."
    },
    {
      "rating": "10",
      "text": "Christian Bale underwent extensive dental work in order to play the character of Patrick Bateman. It is unclear whether or not this was a personal choice or whether he was instructed to do so by the director."
    },
    {
      "rating": "10",
      "text": "Looking for a way to create the character of Patrick Bateman, Christian Bale stumbled onto a Tom Cruise appearance on the Late Show with David Letterman (1993). According to co-writer and director Mary Harron, Bale saw in Cruise \"this very intense friendliness with nothing behind the eyes,\" and Bale subsequently based the character of Bateman on that. Interestingly, Tom Cruise is actually featured in the novel. He lives in the same apartment complex as Bateman, who meets him in an elevator and gets the name of Cocktail (1988) wrong, calling it \"Bartender.\""
    },
    {
      "rating": "10",
      "text": "Although Patrick Bateman is extremely wealthy, we never actually see him do any work. In fact, none of his colleagues are seen doing any work."
    },
    {
      "rating": "10",
      "text": "hiuggugughiihhiiugfytdrsfyfugug................\":;!?,.()*&^%$#@+×÷=_€£¥₩●○▪□■☆⊙°•●●♤♡◇♧《》•¤°°°°{}[]°°"
    },
    {
      "rating": "9",
      "text": "Brilliantly Insane! This movie was just so fun and bat **** crazy to watch, the acting was superb and I enjoyed the **** outta the times when he casually started explaining different albums and songs and their meanings before doing the deed. The ending was very good for its time, I won't go into details about the philosophical aspects of the movie and what its trying to say about society for example since it was already explained and analyzed to dead. There were a bit of slow parts and some awkward acting but overall its a must see movie if you haven't already."
    },
    {
      "rating": "10",
      "text": "Bale delivers one of the most interesting and brilliant characters I've ever seen on screen."
    },
    {
      "rating": "9",
      "text": "There is not a lot that this movie does wrong. Some people might not understand it. Some might not like it even if they do understand. This is easily one of my favorite cult films, right up there with Donnie Darko. It will also make you think twice next time you see a stray cat while at an ATM."
    },
    {
      "rating": "10",
      "text": "Character Error Bateman could not have killed Jean with the nail gun because that model of nail gun must be plugged into an air compressor for the nails to be fired. If he had pulled the trigger the way he was holding it [without it plugged into anything], nothing would have happened."
    },
    {
      "rating": "10",
      "text": "The telephone next to Patrick Bateman's bed is a Bang & Olufsen model not available in the 1980s"
    },
    {
      "rating": "10",
      "text": "Patrick Bateman: [voiceover] When I get to Paul Allen's place, I use the keys I took from his pocket. There is a moment of sheer panic when I realize that Paul's apartment overlooks the park and is obviously more expensive than mine. I calm myself and move into the bedroom, where I find his suitcase and start to pack."
    }
  ],
  "recommendations": [
    "the_favourite",
    "a_clockwork_orange",
    "trainspotting",
    "django_unchained",
    "blackkklansman",
    "the_crow",
    "constantine",
    "straight_outta_compton",
    "green_book",
    "black_swan",
    "eyes_wide_shut",
    "in_fabric",
    "fear_and_loathing_in_las_vegas",
    "us",
    "watchmen",
    "total_recall",
    "jojo_rabbit",
    "pride_and_prejudice_and_zombies",
    "the_gentlemen",
    "stoker",
    "the_cell",
    "last_night_in_soho",
    "the_raven",
    "nightcrawler",
    "titane"
  ]
}