{"id": 541, "title": "American Sniper", "starring": ["Bradley Cooper", "Sienna Miller"], "runtime": 133, "genre": ["War", "Action"], "description": "U.S. Navy SEAL Chris Kyle takes his sole mission—protect his comrades—to heart and becomes one of the most lethal snipers in American history. His pinpoint accuracy not only saves countless lives but also makes him a prime target of insurgents. Despite grave danger and his struggle to be a good husband and father to his family back in the States, Kyle serves four tours of duty in Iraq. However, when he finally returns home, he finds that he cannot leave the war behind.", "releaseYear": "2014", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/i1U46OwMc6vlm7OoSUKfqUH615e.jpg", "categories": {"plot": 3.3684210526315788, "acting": 4.3125, "ending": 5.181818181818182, "soundtrack": 6.0, "cinematography": 7.0, "familyFriendly": 3.0, "funny": 0.0, "action": 5.875}, "reviews": [{"rating": "0", "text": "A sick, repulsive piece of propaganda that not only ignores the moral quandaries associated with America's involvement in the Middle East, but portray's American soldiers as paragons of virtue and camaraderie, and their foes as savage dogs, with not a shade of grey in sight."}, {"rating": "3", "text": "Decent acting, embarrassingly bad effects, forgettable score, cheesy script, and most importantly, subpar direction. A biography of a stereotypical US soldier (sailor in this case) doing and saying stereotypical US soldier things. Clint Eastwood submits his interpretation of a life story written by someone who actually fought hard in a war rather than skipping around in booty shorts at the pool while everyone else's feet got frostbitten and the result is predictable - six Oscar nominations and a painfully overrated movie. January has come."}, {"rating": "4", "text": "Telling the true story of American sniper Chris Kyle, AMERICAN SNIPER plods along through four very long tours of duty with no real point. War is not hell here. The opposing forces and people are \"savages.\" The American soldiers brave and powerful. And yet, despite all this director Clint Eastwood seems to be making a flag waving patriotic American celebration. Or is he? And that's the problem. The film lacks all conviction and becomes just a long bore. If you've seen the absolutely brilliant trailer, you will totally miss the moral dilemma inherent in that 60 seconds. The film which runs over two hours never hits that level. Ultimately, AMERICAN SNIPER feels like a tepid remake of THE HURT LOCKER."}, {"rating": "0", "text": "Eastwood’s movie begins by exploiting a historically inaccurate delusion and, then, sustains itself for two hours on the mission to protect US soldiers against the insurgency that arose in opposition to the US invasion and occupation based on the initial delusion.\rIt is amazing how easy it is to lead the 'Merican sheep by their nose. The media and the government have an easy job."}, {"rating": "5", "text": "\"I like war\" and \"I love killing bad guys\" are 2 Chris Kyle quotes I will remember. The movie provides a decent insight into the guy but fails to provide any ethical reasons for killing hundreds of people during war. Kyle gets major credit for doing his job well and gets zero credit for asking whether the job needed to be done."}, {"rating": "0", "text": "This is Eastwood's jingoistic pander to Republicans. Nothing more nothing less. It has little value beyond a propaganda piece and as an American I am throughly embarrassed to see it released. It should be shunned."}, {"rating": "3", "text": "Nothing new here. Same old American war film cliches. Bradley Cooper does his best with poor lines, a slow story and Eastwood's Republican attempted justification for an unjustifiable war. \"The Green Berets\" for the twenty-first century."}, {"rating": "0", "text": "This film have no point and serves no purpose. The action scenes are awesome but the main story is a drag. Its just a schizophrenic 's wet dream or maybe another delirium of greatness of mr. Eastwood?"}, {"rating": "4", "text": "Bad guys are bad guys and killing bad guys is not a bad thing...if only truth is that simple.Solidly directed by occasionally brilliant Clint Eastwood and well acted biopic but also piece of work that cowardly  avoids to adress any of its own burning ethical questions ending like being not much more then narrow minded war propaganda."}, {"rating": "1", "text": "This movie does no service to the men & women in uniform.  Trying to combine entertainment to a war film while barely touching on real character development, I personally felt cheated.  Add in \"bullet time\" effects and an obviously fake baby scene (seriously?), I wondered if this was the trolling of the year.  War is not supposed to be amusing and that's what this movie tries to do."}, {"rating": "1", "text": "Eastwood tackles the subject matter in quintessential \"America Good, everyone else Bad\" mindset. It's about time people start understanding the moral complexities that arise in these battles."}, {"rating": "0", "text": "I watched this in amazement, was he supposed to be a hero ? No a deranged maniac would be a more accurate assessment. If I have to have life's purpose is to die a hero cultural propaganda please at least make if mildly entertaining. The pregnant wife melodrama, the constant militaristic bull. They are evil less than human, savages so that allows us to kill them, whatever lets you sleep at night, literally. Utter reheated garbage."}, {"rating": "10", "text": "One of the major tenets of Clint Eastwood's ebullient career is his commitment to surprising us. He continually pursued unexpected projects - from female boxing to the Japanese wartime point of view. If you were to guess who was going to direct The Bridges of Madison County (1995) or Jersey Boys (2014), Eastwood would be near the bottom of the list.\r In 2014 he accomplished one of his best surprises. After years in which he seemed to have lost his touch and even his spirit, Eastwood came roaring back.\r American Sniper is essential Eastwood. The film - based on actual sniper Chris Kyle (Bradley Cooper) who served four tours in Iraq - has intriguing levels and potency. Ennio Morricone's music at the end brings Eastwood's phenomenal career echoing back.\r Eastwood can make films that appeal both to conservatives and liberals. That's a rare ability. American Sniper is one of those films."}, {"rating": "0", "text": "\"American Sniper\" é um filme raso, presunçoso, que enaltece a imagem de um homem e, ao tentar desenvolvê-lo, acaba deixando claro quão unidimensional o patriota americano pode ser, aos olhos do roteirista alienado.Clint Eastwood tenta, de todas as formas possíveis, pintar nossa percepção de quem Chris Kyle era. Com um patriotismo exacerbado, um senso de heroísmo que só existe na cabeça de patriotas cegos, uma visão distante da \"lenda\" que ele foi, uma abordagem do \"bem e do mal\" - como se isso justificasse alguma coisa; o filme torna-se artificial, e ao tentar aprofundar os traumas que o protagonista passou, tudo se torna deveras contraditório, pois os temas não são abordados de maneira imparcial ou distante. Fica extremamente claro que a direção quer nois vender uma imagem do protagonista, e ao tentar desenvolver qualquer coisa além desses conceitos, ela falha, tornando-o unidimensional.Há demasiados diálogos expositivos, e eu sei que aqui o proposito era fazer um filme pra todos, mas a obra chegou a um ponto de chamar o publico de burro nos explicando tudo. O senso antagônico criado pelo Sniper adversário é cringe e não funciona, assim como a passagem de tempo existente no filme. Ele passou anos e anos no Iraque, mas a sensação é que ele tá lá há uma semana. O roteiro falha em tentar cobrir toda a vida do atirador de elite, pois nada tem seu tempo de tela desenvolvido, e as coisas acabam se tornando uma bagunça.Ao invés de trazer uma leitura de personagem rica, aqui os produtores decidem trazer uma visão própria de quem foi o Chris Kyle, forçando conceitos a todo momento, falhando em desenvolvê-lo de maneira funcional, alienando os espectadores e enaltecendo uma imagem que os EUA insiste em passar pro mundo. Nota 0.Audio: English, with portuguese subtitles - Q60T 50' TV Speakers [5.1]Quality: 1080p SDR [Netflix]"}, {"rating": "8", "text": "Clint Eastwood's American Sniper is probably the best movie featuring the War on Terror that has been made. In it, our hero, Chris Kyle played by Bradley Cooper is presented as a young man growing up in Texas and we see that his girlfriend is cheating on him. Later, he meets his beautiful wife played by Sienna Miller in a bar. We see Chris Kyle react to the September 11th attacks and he enlists in the military to fight terrorists in the middle east. Kyle is deployed in Iraq and we see his escapades as the most deadly sniper in the U.S. military. Iraq had been listed as a State sponsor of terrorism by the U.S. since 1990, when Saddam Hussein invaded Kuwait. Iraq had also been on the list from 1979 to 1982; it was removed so that the U.S. could provide material support to Iraq in its war with Iran. Hussein's regime had proven to be a problem for the UN and Iraq's neighbors due to its use of chemical weapons against Iranians and Kurds in the 1980s. The Iraq War began in March 2003 with an air campaign, which was immediately followed by a U.S.-led ground invasion. The Bush administration cited UNSC Resolution 1441, which warned of \"serious consequences\" for violations such as Iraq possessing weapons of mass destruction. The Bush administration also stated the Iraq war was part of the War on Terror, as Saddam Hussein was a radical Sunni muslim, leader of the Baathist party who may have had ties to Al-Queda. The movie is gripping, and you're pulling for Kyle who is tough and gallant. One criticism I have of the movie is it doesn't show many airstrikes, it only features one in the entire movie, when I know we bombed the hell out of Iraq. But it wants to focus on the sniping on the ground so its acceptable. The movie can get pretty exciting and intense. There are some cool action sequences with American marines going up against terrorists. The movie does a good job depicting PTSD caused by the trauma of war, as Kyle has to deal with these problems after his exploits in the middle east. There is a well-directed scene at a barbeque where Kyle freaks out with a dog and it disturbs his wife. The movie ends tragically, as we are told Chris Kyle is killed by a mentally disturbed veteran he was trying to help. Overall, a good tribute to an American although controversial, was virtuous and a hero."}, {"rating": "1", "text": "This is not it guys. I'm sorry but I have to be very negative. I realize some can't stand any negativity, so I ask you to read this at your own discretion.\r Let's begin with the movie. No spoilers. Just let me say it wasn't much better than the usual straight-to-TV movie. The budget was somewhat higher, but this is where the good stuff pretty much ends. Don't expect awesome sniper-stuff or anything like that. In fact, the little bit you saw was utter nonsense. I served myself and I can tell you, not even regular troops were like that; very unrealistic and unprofessional. You get to look through the scope, so let me tell you it's a made up nonsensical thing they came up with.\r This movie is a drama first and foremost. It's about the inner person of Chris Kyle, his partner, his life. As mentioned before, none of it was done right, convincingly nor was I moved to care.\r The movie is based on a book of a soldier who's known to 'shoot first, ask questions later'. This is what his comrades said. This makes the 200 kills suspicious from the get-go. Needless to say that his colleagues put this carefully in the media and anonymous. And needless to say that the main stream media didn't pursue this angle.\r Chris Kyle is the same person who needed to ridicule Jesse Ventura in his book. He supposedly floored Ventura. Ventura sued the Kyle estate and won the case. What's interesting is that no SEAL witness could produce a consistent story even though they were there. This angered the Jury, as they explained in the media, and hence allowed Ventura to win the case.\r They (the anti-Ventura SEALS) subsequently complained in the media that 'what happens inside should stay inside'. It supposedly is a unwritten SEAL code (cliché cliché). But none of them was consistent enough to mention that Kyle ignored that very same rule! In fact, he ridiculed an ex-colleague in a commercial and publicly available book. How is that for double standards? Even though Ventura won the case, he is practically out of job since then.\r American Sniper is the same guy who bragged about shooting looters after Katrina. I'm sorry but bragging about it is not right.\r I'm aware of the popularity of the SEALs around the globe. But because of their policy to be visible in the media (they made that choice few years ago), their ugly side shines through as well. Too often they communicate and behave like stereotypes who use too much anabolics.\r Thank you and see you next time!"}, {"rating": "6", "text": "It just feels to me that the movie should of been better. A lot of the times it was so slow and it was kinda long. But the best part was at the end I liked what they did there."}, {"rating": "8", "text": "Who: Bradley Cooper, Tons of CSI B Actors, and Sienna Miller as Every Southern Boy's Dream Girl\rWhat: A well made film that can't help but shove America down everyone's throat\rWhere: 'Murica\rWhen (Can I watch again): When you need to research topics of conversation for your morally questionable southern relatives\rWhy: If you've just watched a ton of Michael Moore documentaries and need to watch something ironically, or you need to be reminded why America is so badass, American Sniper has something for everyone"}, {"rating": "8", "text": "Pretty good movie I love how this movie gets you to like the charters and care about. I now that a lot of people hate this movie ( that is fine) but just because it takes place in the Iraq war does mean this movie is propaganda. I think that Iraq war was a horrible awful idea but I still love this movie for it's story and charters not because I JUST LOVE MURICA  AND IT COMPLTELY AMAZING that's ****"}, {"rating": "4", "text": "I tried my very best to review this movie without putting in my political opinions. But I have to say something about this movie.\r This movie is a war propaganda movie. If you think showing dead bodies with blood and having one character against war itself is considered enough an anti-war movie, then I am afraid you’re wrong. I believe that the director of the movie Clint Eastwood is an anti-war person despite being a Republican and he tries to deliver his anti-war message to the audience. But when the message is lost in the audience and instead encourages more war and Islamphobia, then I am afraid his so-called anti-war message is not delivered clearly.\r Speaking of Clint Eastwood, his direction in this movie is okay. I have seen far better directing on war movies.\r The characters in the movie are utterly unlikable and uninteresting. The main character Chris Kyle is really hard to sympathize and relate to especially that the Chris Kyle in real life turns out to be a huge dick. Despite that, Bradley Cooper delivers a really good performance that it’s almost uncanny to the real Chris Kyle.\r Not all movies based on a real person has to be accurate but when this movie made Chris Kyle a hero with little to no flaws when he is a huge dick in real life like I said earlier, that kind of inaccuracy is unfair and biased.\r The only parts I liked about this movie was how Chris Kyle dealt with his PTSD and it felt realistic without being over the top. However I feel like these scenes were underdeveloped and I needed more of him struggling with his PTSD.\r Lastly, I don’t think this movie is worthy a Best Picture nomination for this year’s Oscars. It’s just another war movie that brings up nothing new to the table. It’s just overrated in Oscar terms for me.\r American Sniper is not a movie for everyone and in my opinion it’s very overrated. I am not stopping you from watching this movie but keep in mind while watching is that this movie has a one-sided depiction of war and the real-life version of Chris Kyle is not a nice human being."}, {"rating": "6", "text": "So this movie is well overrated due to it's subject and story. Nothing here stands out as interesting or original as a film and while everything here is good, it's certainly not great and nowhere near Eastwood's best.\r Oscar nominations? Please, we all know what that's about."}, {"rating": "2", "text": "I expected a war movie, but this is, sadly, just a boring, dull millitainment production. Bradly Cooper is always good, and he did a decent job here, but the movie has just one positive note - It's still better than Twilight or Fifty Shades of Grey."}, {"rating": "1", "text": "A delusional movie made by a delusional old has-been, based on a twisted book written by a delusional sociopath. staring a fake baby. and an okay(?) Bradley cooper.\rpropaganda at best.\rdisgusting Razzie nominee at worst."}, {"rating": "4", "text": "I feel sad that this movie is doing well. Not because its a bad movie. I can live with crap making money. What  I CAN'T deal with is the crazy patriotism \"movement\" this movie is somehow bringing up. The movie is both objectively bad and kind of mean-spirited. Because of it's blandness and lack of punch, it seems that most people interpret it as some kind of reassurance. Painting us as the good guys and anyone with a turban on their heads as terrorists. It pains me to think people genuinely believe this movie is about patriotism and righteousness, when it clearly isn't.\r To be clear: I don't hate this movie because I'm anti-american. I don't hate it because its an objectively bad film. I don't even hate it because of its lack of patriotism or clear message. I hate it because it allowed people to spill out their blind, hate filled rage at others and still manage to make them seem and feel in the right."}, {"rating": "3", "text": "Eastwood's worst directed movie ever, and Bradley Cooper is so bad in this that he has redefined what the word \"acting\" means in a bad way.\r It's just a ludicrously plotted, terribly paced borefest of a movie that probably looked better on the drawing board than it did in execution. It is also blatant propaganda for the USA - this wouldn't have looked out of place in Nazi Germany or North Korea, yet bizarrely it doesn't even do that right as the whole think makes the protagonist look like a complete maniac. Perhaps that's what Eastwood was going for - the maniac who was green lighted due to patriotic fervor or something - but the movie doesn't communicate that point well at all. Everything is so ambiguous,\r Anyway, you're not missing anything by not watching this. Watch The Hurt Locker again if you want something like this, but done competently."}, {"rating": "7", "text": "I'm a liberal and I actually enjoyed this movie. I know that seems like a glowing contradiction because liberals aren't supposed to like things like this but I like to think I consider myself impartial when it comes to movies. The movie is masterfully directed by Clint Eastwood and Bradley Cooper does an amazing job as Chris Kyle but with that being said, American Sniper was as close as you can get to being right-wing propaganda. The first thing it does as portray the Iraqis as the bad guys who are responsible for 9/11 despite them having nothing to do with 9/11. The 2nd thing this movie does wrong is paint Chris Kyle as a conflicted soldier, where if you read his book he actually was not very remorseful about the people he killed. I mean lets be real here, Chris Kyle was an absolutely terrible person. I'll go even as far to say he was a psychopath, he said it himself that he loved killing and that he would kill anyone with a kuron which is what basically everyone wears over there. Kyle was no hero, he was a monster, a repulsive and sick man who was a pathological liar that forged his military accomplishments and kill count to sell books. He was also, however like many soldiers in the middle east were taken advantage of by Bush/Cheney's quest for \"WMD\"s aka oil."}, {"rating": "8", "text": "I didn't expect much, but I knew that the movie was about war. Then I also don't know the actual events (as described in the book). Nevertheless, the movie has a very good feel of reality to it. It is far from boring, and you are well interested in what will happen almost at all times. The main actors are convincing and it is hard not to relate. Bottom line: one quality movie based on real events which does not disappoint."}, {"rating": "7", "text": "A good, though over-hyped, film. The performances are excellent, both Cooper and Miller are dynamic and believable in their roles. The cinematography was generally solid for this kind of film, and the score was typical of an American war story. The pacing was very well considered and the final sequence was masterfully executed. The moral subtext is where criticism is warranted as this is a film which posits the hero as a representative of the entire conflict in Iraq and, as such, any commentary on the nature of war or that particular conflict is decidedly one-dimensional. This may be expected from an Eastwood film, however, it's clear that not only is the moral quandry not central to the plot, it is also treated with disdain in the dialogue, which may play well for an American audience, but smacks of the 'MURICA mentality rather than good storytelling. A solid bo-yah film with little depth. 6.86/10"}, {"rating": "1", "text": "The worst case of war propaganda since WW2,so full of lies that is almost unbearable to digest for any sane human being.It portraits notorious mass murderer and psychopath like some kind of national hero also trying to justify one of US imperialistic wars like fighting against terrorism which is completely false.With this movie Clint Eastwood-once significant director which makes this  whole affair even more sad- place himself in the company of likes Joseph Goebbels and Leni Riefenstahl."}, {"rating": "2", "text": "Found this latest \" Kill For Peace\" movie second rate.\rUnlike \" The Hurt Locker\" or \"Full Metal Jacket\" or \"Apocalypse Now\"\rthere is very little drama, and no tension.\rSecond, the sound is so bad they should have used subtitles. And the plot ? A young , coming from a\rsimplistic, brutal background ,graduates from killing deer to  to killing other people from far away. He likes it, and goes back for four tours of duty.\rI couldn't connect with, identify or like the hero. Not quite a walk out\rbut close.\r Would have been better off seeing \" Paddington\"."}, {"rating": "3", "text": "I gave this movie a low rating for Hollywood technical FAILS ! Just watched the 2 trailers for this movie. In the first 45 seconds I picked out 7 things wrong that a trained sniper , or an Expert Navy SEAL Sniper would never,ever do. 1. Not have his scope covered sometimes in the movie, 2. Not having his mat in front of his weapon to prevent air from the shot disturbing the dust in front of him and revealing his position, 3. Not covering his G-shock watch to prevent sun reflections, 4. Not covering his compass on his shoulder to prevent sun reflections, 5. his spotter/soldier next to him wearing highly reflective goggles, 6. not covering his ammo to prevent sun reflections, 7. A sniper would most definitely not being clearing rooms and teaching regular troops how to do it.\r I've read several accounts of how things in Chris's book have been changed to be very different than the movie. Not sure why Clint did not keep it accurate to the books as the accuracy of facts  would not have detracted from the movie. Other specs ops in the SEAL family have also made similar comments.\r This is not Saving Private Ryan where there, the battle scenes were extremly realistic and quite accurate to the real D-Day event, most of the inconsistencies lie within the names of people in the movie as well as names of battles and cities. Not in the actual portrayal of the soldiers and the events on D-Day.\r Chris was definitely a hero with skills, no doubt or argument there. He was no better and no worse than the other thousands of troops that lay their life on the line everyday or the ones who have fought and died for this country in any war. Everyone who enlists in the military is a hero."}, {"rating": "1", "text": "As everyone knows, Clint Eastwood’s AMERICAN SNIPER (2015) is, as of this writing (January 24, 2015), a surprise smash hit in the United States. Various postulates as to its success have been formulated: its belated offering of Iraq War cartharsis or even justification; its tight filtering of historical events through a single, largely sympathetic protagonist (memorably played by Bradley Cooper); or simply a highly effective publicity campaign. My own suspicion is that the film is fundamentally about war-themed video games – or rather, is a successful attempt to capitalize on those games’ colossal popularity.\rThat the film’s iconography, sensibility and rhythm are at one with such games is too obvious to require comment: even I’ve played enough to know that. But I think that part of what the film does is convince its audience that playing those games is actually a form of civic participation, requiring concentration, commitment and self-sacrifice.\rClint lets the cat out of the bag near the end of the film, when Chris Kyle’s kids are playing some game or other (“Level 4, daddy!”), but I think it’s best to read the atavistic scenes of “hunting” in the film as figures for the perceptual (and political) pedagogy offered by war-video games. In other words, what the film does is construct one of those good ol’ four-level allegories familiar from medieval times, enabling the private wargames-player (the “moral” level) to insert him/herself into the “legend” of Chris Kyle (the “typological” level), and thereby connect to the larger destiny of the imperial nation as such (the “anagogical” level). The “literal” level, the history of the Iraq conflict, serves as nothing more than material for these figurations, to be arranged and rearranged like the body parts in the torture chamber.\rThe point of doing this, of course, is to siphon off some of the enormous libidinal/capital investment in such games - the film is doing huge business! - by providing a gratifying political emplotment of that investment (as a form of civic commitment). After all, you can even jeopardize your precious family life if you spend too much time trying to defeat the (computerized or “savage”) enemy: yet despite these existential risks, the vindication will come, draped in the flag, somewhere down the road…."}, {"rating": "5", "text": "An appalling attempt at movie-making. Bradley Cooper is NOT acting in this film - not sure what he doing, but it is not acting, and, he look ridiculous. The story was OK, but it's delivery bordered on the jingoistic.\r Worth a watch, but really not that good."}, {"rating": "6", "text": "It's difficult to judge what the overall goal was - on one hand, you feel like Chris Kyle is a true hero; the other, it's sad what he went through to get there.\rVery well-made with a flash-forward action sequence in the beginning, then a few flash-backs, then back to the \"present-day\" as it continues along. Very well presented.\rI'd say if this movie was released over Christmas time in the large formats, it would have been a slam-dunk for a movie instead of the bland re-hashes out there.\rIn summary, if you want to examine the physique of a sniper, this movie delves in part to it. The other half however, does not present itself well - is the unexamined life worth living/dyeing?"}, {"rating": "2", "text": "What a deftly made propaganda film! Not Leni Riefenstahl, but a 2015 update version by the died in the wool right winger, Clint Eastwood.  Like that propaganda film that justifies illegal torture, “Zero Dark Thirty”, it is excellent filmmaking. It is superbly paced and the photography is top notch. The soundtrack is riveting. The acting is excellent. And we sympathize with the protagonist who is a folksy hero. The bad guys are indeed bad. These “savages” (as “we’ call them time and again) drill holes in children’s’ heads for their parents betrayals and brutally attack our hero and his buddies.  There are moments of decent that almost redeem it such as Kyle’s Brother’s shell-shocked rant on the war. However there is no mention of the 600,000 plus war related deaths (according to the Lancet) or that the drilling torturer was in fact modelled on a Sunni ally, or the US torture at Abu Ghraib, nor of course is there any mention of the innocents killed by snipers (as revealed by Wikileaks). We hear nothing of Fallujah’s American atrocities against real people with real families.  We hear nothing of being led into this war under at misinformation and often outright lies (such as the Niger uranium, the chemical sites shown at the UN by Powell or the Al Qaeda training in Iraq… of none which is known to have existed.)"}, {"rating": "0", "text": "Probably the worst movie of the last 10 years, it cements Eastwoods status as a senile Talker-to-Empty-Chairs, a sad end to a pretty good career! If he off sets this one with a movie from the PoV of the Iraqis, I'll reconsider.\rThe most hilarious part about this movie is that ALL of mr. Killers kills are so totally justified! Sure, he kills a ten year old and his mom, but hey, they were trying to kill AMEh'cans, the self-declared elitists of the world\rThat's .... like. BLASPHEMY, yo!\r This piece of crap only serves as an American chest thumping device. Yes, indeed the main message of the movie is: Americans good, brown people baaaaaaaaaaaaad. American exceptionalism indeed.\rsub message: the murderous SoB promises us to feel really bad about ambushing 150 \"enemies\"\rSure dude, if America was invaded, Americans would NOT do what the Iraqis did?\rHell, Americans already PRETEND the country is invaded!!\r The Melancholic Alcoholic"}, {"rating": "4", "text": "AMERICA. AMERICA. AMERICA SAVED US ALL. This film is just total progaganda: Americans are heroes and true warriors whilst the rest are savages and bad guys and none of them can be trusted. It doesn't even fully cover the post traumatic stress soldiers can end up having, that's just something that's there. Also, Bradley coopers face doesn't look right as a cowboy, completely miscast. However, he still acts fine in the film really! There wasn't any real stand out scenes in this movie either really, and i found the whole back and forth war to home transitions a little forced. Also, the villains they make in the film feel unnecessary  and kinda stupid. I'm pretty sure they weren't in the book either and apparently the film just takes a big dump on the source material. The film is still decent enough to watch, but it is so propaganda orientated and a bit dull. I wanted to really see how Chris Kyle evolved. The ending was pretty meh also. I wish they could have honoured the soldier a little better than this film does!"}, {"rating": "5", "text": "A complex character in a complex setting deserves a better vehicle for telling his story than what this overrated, underwhelming and at times simplistic effort has to offer. Despite a solid performance by Bradley Cooper, the picture comes up short by focusing on protracted battlefield sequences at the expense of truly meaningful character development. The film misses the mark by giving only cursory attention to the real story here -- a character's struggle to deal with his beliefs in the face of a reality where those ideals are routinely put to the test, as well as the aftermath and recovery from that experience, A major disappointment, especially in light of its six mostly ill-deserved Oscar nominations."}, {"rating": "6", "text": "The movie succeeds on a technical level, although I can't say I was overly impressed on the whole. While Bradley Cooper nails the role, the mostly boring war sequences consumes too much of the movie."}, {"rating": "8", "text": "While not for the faint hearted, the often harrowing \"American Sniper\" is a solid if not spectacular war epic by Clint Eastwood. It is well acted by its leads and delivers a tense tribute to the late American sniper, Chris Kyle."}, {"rating": "5", "text": "American Sniper has its moments (for me, it was the sandstorm scene), but the film didn't quite take off. Maybe it was the constant back and forth from home to warzone, or the overused \"soldier and his wife\" drama, or the lack of empathy for the protagonist, I don't know. I don't think Bradley Cooper had the right face for his character, even though he acts just fine throughout.\r A major lack of detail lets itself known, also: where's the score, where's the cinematography?"}, {"rating": "9", "text": "This is a movie with a lot of idiots saying this and that about it. Simply it's intense, inspiring, and sad. Throughout Chris's life he had tragedies. From his friends to himself. There has been speculation that Kyle was more of a **** than the movie shows. This might be true but he still shrived to help his fellow marines and fellow people out. He said that he loved killing the enemy. I don't mind this because....they were the enemy. Like he said, he will stand proud and answer to every shot he took to his creator. The ending is where it left our theater silent. You could hear a pin drop because people didn't expect something like that.\rThe best part is Cooper's performance. From Hangover to this, Bradley has completely revamped his career. Another great part of this was story, it just kept you engaged and the dialgogue was on point. The amazing part of this is...it's all real. These men went through this as they tried to fight for out freedoms. Give them respect that they deserved. For all the evil, it was done by people who told them to do it. He had unstoppable power to get the job done and protect those he loved the most. Overall it's the best or one of the best movies to this early 2015. 9.3."}, {"rating": "5", "text": "The lack of historical accuracy wore down my enjoyment of this film after a couple of days. Eastwood has The right to present any view of the war he wants to. However to imply that Iraq attacked us, do not tell that IRAQ is Sunni, Shia, and other, to imply to al-Qaeda in Iraq was there from the beginning, to act as if we won the war, the military had few doubts, etc is a disservice to our troops and to our the viewing audience in the long run.I applaud him for show the damage that a bullet to the head will do but to paint the war so simplistically is a major flaw. Did Dick Cheney write the script? No one will remember this revisionist nonsense in a few years."}, {"rating": "4", "text": "A movie with very little character development or point of view. Forget the moral ambiguity of this stupid war, nobody really changes in this movie. Fake baby, whining 'wife', and war 'buddies' who talk about their personal lives right before they get shot.  Cooper, acts through chewing tobacco (and does quite well with what little he has to work with).  Oh yeah, and dark haired 'bad guys'. I'd play Call of Duty before spending money on this movie."}, {"rating": "0", "text": "Normally I really like Eastwood's films and normally I really like war movies, but this one is really stupid.  Sadly you get the feeling the sole purpose is propaganda for the US war machine. There is no real dealing with the problems Kyle encounters back home."}, {"rating": "10", "text": "absolutely the best movie of the year, the depth that Eastwood and Cooper nail the looks and feel of being deployed.  The feeling of not being over there and helping, with people you will grow closer to than even those in your family, is really captured in Coopers face while sitting at the VA.  It became really hard to hold back the tears during the credits as they showed the love and support that Chief Kyle received after his passing.  Best movie winner, hands down."}, {"rating": "0", "text": "It's not enough merely to observe that this is a right-wing propaganda movie. It's also a bad movie. It IS possible to make propaganda movies that work as movies even for viewers who don't agree with the viewpoint. Case in point: The original \"Red Dawn.\" The makers of Red Dawn really did believe that America was vulnerable to being invaded and conquered by Soviet Russia. Even though the premise of Red Dawn was and is laughable, the Wolverines were people you could root for and the movie worked.\r As to American Sniper, for me the picture was one-dimensional, the plot simple and wholly predictable."}, {"rating": "4", "text": "Bradley Cooper made this film somewhat acceptable, however it boils down to another American propaganda piece.\r It's a pity there wasn't much point to the film in the end and all the subtext was the usual \"America, greatest country in the world\" crap."}, {"rating": "0", "text": "There were a few moments that were spectacular, but those moments couldn't save the rest of the movie. The undercurrent of glorifying war also left a pretty bad after taste. A movie should never be used as a propaganda tool, and even if it wasn't done with that in mind, this movie definitely comes across that way. If you simply must watch this movie, I'd recommend watching Blackhawk down instead"}, {"rating": "3", "text": "American Sniper is a standard \"meh\" movie with an over hyped buzz because its director,  cast and subject, as its main target audience is like \"I love me a gun\" and the over ego feeling of \"I love me a supposedly American hero who kills them all\".\r\"American Sniper\" valorizes,  guns, father teaching a son to use the gun and kill,  muslim's xenophobia and arrogance not Altruism as heroism.\rIn a time where children are killing children in schools; in name of God terrorists are killing innocents around the world and a huge part of the humanity is being named terrorist just because its religion and the religious xenophobia around the world is  gaining more space in society and it is so wrong.. This movie timing is awful.\rArt for the masses has not to be historically accurate but \"American Sniper\" is so lame & socially irresponsible, domestically & worldwide for all reasons above.\rSorry.... But in my POV. You can't say that the art from a genius filmmaker Leni Riefenstahl, who did institutional movies for the German nazista govern, was historical wrong and the meh movie from Clint Eastwood is not. Guarded the proportion, it is the same...\rArt is art,  but the industry has to have the responsibility of the time that a piece of art is out there. World is in the middle of a social  mess (the last months and weeks have dozens of examples) and this movie just brings a bad image for Americans around the world. The American people doesn't deserves it. They are suffering with it."}], "recommendations": ["the_hurt_locker", "lone_survivor", "munich", "fury", "letters_from_iwo_jima", "green_zone", "lord_of_war", "12_strong", "13_hours_the_secret_soldiers_of_benghazi", "free_state_of_jones", "zero_dark_thirty", "machine_gun_preacher", "jarhead", "valkyrie", "apocalypse_now", "cartel_land", "apocalypto", "exodus_gods_and_kings", "red_tails", "detroit", "united_93", "the_1517_to_paris", "hostiles", "blackkklansman", "the_kingdom"]}