{"id": 2034, "title": "American Made", "starring": ["Tom Cruise", "Sarah Wright"], "runtime": 115, "genre": ["Action", "Comedy", "Crime", "Drama", "Thriller"], "description": "The true story of pilot Barry Seal, who transported contraband for the CIA and the Medellin cartel in the 1980s.", "releaseYear": "2017", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/23ILgoPSO5ShKcTZOuiTVfqFAUB.jpg", "categories": {"plot": 6.869565217391305, "acting": 7.266666666666667, "ending": 8.0, "soundtrack": 8.0, "cinematography": 8.333333333333334, "familyFriendly": 3.0, "funny": 7.142857142857143, "action": 7.0}, "reviews": [{"rating": "9", "text": "Many people have seen Blow with Johnny Depp, Carlito's Way with Al Pacino, The Mule with Clint Eastwood, Goodfellas. In all of these films the character's are providing drugs to random people for cash. They don't enjoy breaking the law, they are doing it out of necessity. Al is straight in Carlito but he's a former drug procurer and seller. Clint drops the drugs for survival and to aid his estranged family. The best ending out of all these movies is Goodfellas, the movies end on a positive note. The rest of the films have negative, disjointed endings that are lacking. This movie was brilliantly made by Doug Liman. Liman & Cruise should continue to make movies together. They are a phenomenal team."}, {"rating": "7", "text": "Relatively lighthearted treatment of an element of the CIA's exploits in 80's Central America. Tom Cruise gets to fly the fastest twin-engine of the time in a foreshadowing of the 2019 reprisal of his signature role in \"Top Gun\". One of the more humorous moments of the film doubles as its best Lessons Learned for criminal exploits: Know When to Stop/Retire. His character, Barry Seal, had so much cash he could no longer hide it anywhere, it was spilling out from closets! But his hubris and \"Schafer\" pushed him into continuing exploits until it all caught up to him, too bad, good story though."}, {"rating": "8", "text": "Best Tom Cruise movie i've seen in a while. This is a savvy and entertaining film, Tom Cruise is awesome here and he's clearly having fun with the role by watching the film. Obviously because it's based on a true story, it takes some liberties with the truth and what really happened but at the end of the day, it's still a really good movie and something I'd definitely recommend"}, {"rating": "6", "text": "Got to go along with the majority here. This is no blockbuster by any means but it was a fun movie to sit through.  Tom Cruise was his usual portrayed lovable rebel which elevated the scoring for most I'm sure. I hesitated to put it in the positive green though due to a so-so screenplay"}, {"rating": "7", "text": "This is a film that worked in many moments as Tom Cruise continues to be electric on screen. Cruise makes up for some small screenplay issues and still delivers a solid film. B+"}, {"rating": "5", "text": "Mick LaSalle of the SF Chronicle hit the nail on the head with his review. He gave it a 50; I gave it a 5. In a Tom Cruise movie, the plot takes a back seat to Tom Cruise. So be it. This movie took 10 years of the amazing life on Barry Seal. The movie took great liberties but there was a lot to pack in a two hour film. Its moderately fun, the action scenes are well choreographed and Tom is ...well, he is just Tom ! Handsome , great smile , everything will be o.k. Tom. If 50% of this story is true , shame on the U.S. government for such foolish thinking. I liked it o.k...."}, {"rating": "9", "text": "Great movie. Delivers exactly what I expected. The pacing is really good. Interesting scene after scene after scene. Funny and a true story. Cruise is perfectly cast."}, {"rating": "10", "text": "An amazing original movie which gives us a brief history lesson and shows us the corruption in the government in the 70's and a great return to form for Tom Cruise with arguably his best performance in the last 10 years."}, {"rating": "10", "text": "A return to form for Tom Cruise breaking out from his usual tenpoles. The film is full of humour, lively characters and most importantly shows one's love for a family. It should not be left unmentioned that Doug Liman became a reliable talent in the industry. Loved the cinematography and christophe becks soudtrack. It could be said that they (Liman, Cruise and Beck) has continued deliverying ther goods after they started their collaboration on Edge of Tomorrow or should i say Live: Die: Repeat. Highly Recommended."}, {"rating": "8", "text": "this movie was entertaining. cruise is good, as always. the story has some holes but it's based on a true story and was interesting to watch. it's a solid 7.5 movie."}, {"rating": "8", "text": "Tom Cruise plays Barry Seal, a real pilot who was recruited by the CIA during the escalation of the drug trade and the Contra uprising in Central America. Cruise's biggest character attribute is his million dollar smile (literally), but he has fun gliding thru this adventure. There's not much character depth, but the film is well-paced and jaunty. Ultimately, the story is so incredible that it manages to be a fascinating experience."}, {"rating": "5", "text": "It was interesting and fun. But it felt more like a series of individually interesting scenes than a movie that somehow ties together all those scenes together into something larger."}, {"rating": "5", "text": "American Made proves that if an actor sticks to what they’re good at then they can get away with anything. So Tom we’ll try to forgive you for The Mummy. It won’t be easy but this is a good start.You’ve got money laundering, drug smuggling and Pablo Escobar. It ticks all the boxes. Based on the true life events of Barry Seal. However you very quickly forget you’re watching a biopic. This is TOM CRUISE in American Made. TOM CRUISE is doing TOM CRUISE as only TOM CRUISE does best. See TOM CRUISE fly all over the world in a whirlwind of guns, money and charisma. A very fast paced and entertaining story, wasting absolutely no time from the get go. So if you find yourself stuck for this week’s movie fix well look no further. No it’s not the type of movie you’d re-watch but a definite recommendation."}, {"rating": "7", "text": "Tom Cruise puts the nail in his latest film called American Made. While that isn't saying much, the movie takes in a completely different experience one would not expect to see in a while."}, {"rating": "8", "text": "Cruise's charming energy, as well as the film and story's high charisma kept this film thoroughly enjoyable for me from start to finish. Yes, it may contain many tropes previously explored in other films of this nature, but it still had enough wit, humor, and energy about it that kept it all pretty worthwhile for me. Overall, it stands out as one of the smarter and wittier films of Cruise's in a while, which is definitely a fresh relief from his horrible misfire that was 'The Mummy' reboot this past Summer."}, {"rating": "5", "text": "Tom Cruise is good but the true story is predictable and nothing particularly fresh with distracting photography and overly stylistic editing to make it fresh in an all too common attempt to be hip and energetic that along with the over use of profanity only wind up hampering the somewhat compelling subject."}, {"rating": "7", "text": "One of the best Tom Cruise movies in years and it passed incredibly unnoticed. It has style and an excellent rhythm, it gets lost in moments but it's a minor problem that is fixed by Cruise's work and with the ease with which he prints that cocky attitude to his character.The interesting thing is that it touches an issue already known of the US government and repeats the formula in which the CIA missions to destabilize governments in real life is always denied and some twenty or thirty years later end up being stories worthy of movies."}, {"rating": "8", "text": "The whole movie was so vibrant, it was smelling of that awesome 80's style. The actors did an amazing performance, Tom Cruise did dominate the hole movie, with his charismatic personality, because he basically was in his element, and you can see that he delivered. Directing methods where pretty basic, and the director knew exactly when he had to use 3rd person and shaky cam. The script was perfect, didn't drag at all, and the humor was great and the seriousness as well. Visual effects where great because they did everything practical, 2 pilots even given they lives to this movie, because they just wanted it to look amazingly realistic. Sound effects where just on point as well. There where no pacing issue the whole movie was very eventful. The plot was pretty messed up, but that is what made it interesting and entertaining. Because it was based on real story it could play with the details, to make it look more fun for the big screen, and I think they did a great job at that.Overall this movie is a very good movie, in short a very entertaining and fun movie about a pilot's life who was very clever."}, {"rating": "6", "text": "In recent years, there seems to be a run of somewhat comical biopics with a frat bro edge to them in the aftermath of The Wolf of Wall Street. Films such as this one, The Big Short, and War Dogs, certainly seem to check similar boxes in showing their protagonists do horrible things. Yet, in finding comedy in the absurdity of what their protagonists did, the underlying cover-ups and corruption at hand, and the sheer insanity of the coke-fueled antics ongoing in the film, it is hard to define these as anything less than greatly entertaining. In fitting squarely into this sub-genre, American Made certainly limits itself to some degree. Consistently coming back to pointing out how crazy everything that goes on is with director Doug Liman winking and nudging the viewer every few seconds and saying, \"Look at this **** Ain't this just wild?\", the film does become rather tiresome. In saying that, American Made is a film that features one of Tom Cruise's very best performances and is greatly entertaining cinema, even if that bit is incredibly fleeting.Set in the late-1970s and early-1980s, American Made details the exploits of pilot Barry Seal (Tom Cruise) and his work for the CIA and the White House. Initially just taking photos of communists in Central America before graduating to being a bag man in Panama, arming the Contras in Nicaragua, and later delivering cocaine for the Medellin Cartel in Colombia, Seal's journey is one that goes right up to the top under the direction of Ronald Reagan. While Liman may not necessarily do the material justice and even with many embellishments along the way, it is hard to say that the story is not the film's greatest asset. At all times, this absurd and comical true story is one so crazy that it has to be true. In detailing the government's involvement in Central America, the lack of organization with the Contras, and the rise of the Medellin Cartel, American Made may not be revelatory or original, but it works all the same. The reason why the film winds up being so entertaining, thrilling, endearing, and engaging, is because of how compelling its story is with a great political kick and cover-up angle to add solid intrigue to the film.In telling this story, Liman does a great job in doing two major things: creating the right look and feel for his throwback 1980s notalgia appeals and making the documentary-style work. For the former, the grainy footage, music, cocaine, and old school photos, all combine to giving the film the right free-wheeling and drug-induced atmosphere to really sell itself. In telling a story littered with horrific human beings, it is imperative that American Made nonetheless make itself entertaining and show the short-sighted appeal of their lifestyles. With the frenetic fun and lavishly extravagant lifestyle led by Barry Seal, it is hard to not get swept up in the chaos and fall in love with the way the film tells its story through this misguided guise of nostalgia.For the latter, the film's documentary style is one that plays perfectly into the style that Liman once displayed in the first Bourne film. Heavy on close-ups, handheld camera, and even some shaky cam, this blend of found footage and docu-style gives the film a greatly frenetic feeling that makes every shot kinetic. Everything seems to be colliding and rushing forward in this film with every shot adding fuel to the fire. Matching the manic nature of Seal's lifestyle, his rapid rise to the top, and quick fall to rock bottom, the film's style is one of its greatest appeals. With Tom Cruise bringing great energy and earnestness to the picture in the lead role, the film's frantic and deeply charismatic display of the life of this man making runs for the CIA and White House turns into a film that seems to have pushed the gas pedal through the floor. There is hardly time to breathe with American Made acting as a whirlwind of pepped up energy.With Cruise dominating in the lead role, it is no surprise that American Made is incredibly watchable as Cruise often makes his films just that when he is on his game. He certainly is here alongside a solid performance from Sarah Wright as his wife Lucy, a strong and unexpected appearance from Jesse Plemons as the Sheriff in Mena, and Caleb Landry Jones as Lucy's dimwitted brother JB. All three give the film great spark in supporting roles, especially Jones' deeply stupid and redneck character that acts as a parasite in the Seal household. However, where the film does slack in the acting department is Domhnall Gleeson. As I will later touch on, American Made's greatest issue is its tone and this is a problem that Gleeson never really helps. Always awkwardly being introduced, seeming uncertain of how serious or comedic his lines should be, and playing like a character cut from an entirely different film, Gleeson gives a performance that is far below his usual standards. Unlike Cruise, he never elevates the material. Instead, he plays right"}, {"rating": "1", "text": "Not to burst any bubbles, but most of this film is fictionalized. Which is a pity, as the real life story is far more interesting. Unfortunate. Not certain why that didn't interest Hollywood."}, {"rating": "7", "text": "It's rather surprising that 'American Made' isn't a particularly good movie given the combination of its subject matter, star, and director.The story is based on the life of Barry Seal, TWA pilot turned drug and gun runner for the CIA in what would eventually be known as the Iran-Contra Affair.  Tom Cruise has both the right kind of moxie and manic energy to step into Barry's shoes, but these days it's getting harder and harder to distinguish where Cruise's own personality ends and that of his myriad action characters begin.  Most surprisingly of all is director Doug Liman's inability to turn this film into a hit.  After all, he certainly has the directing chops, most notably helming 2014's Edge of Tomorrow--also starring Cruise--in what many consider to be one of the best movies of that year and one of the most overlooked films in recent memory.Instead, 'American Made' features numerous shots of actors faces out of frame, an over-reliance on the shaky camera effect, and too much exposition.  Though the movie could have certainly turned into a complete disaster if left in less experienced hands, in the end it simply feels like a lower quality facsimile of the movie 'Blow.'"}, {"rating": "8", "text": "“American Made” shows that even at 55 Tom Cruise, in spite of a few lines under the eyes, still has that contagious smile, only equaled by Julia Roberts, the firm buns that he flashes a couple of times and the infectiousness of his enjoying what he does.“American Made” is a ‘based on a true story’ film about a pilot Barry Seal, who I had never heard of, that seems to have been quite the wheeler-dealer not only with the CIA and the DEA but the drug lords of Latin and South America plus delivering guns to the Contras among others.The movie is an easy going, thoroughly enjoyable caper story written by Gary Spinelli and directed at a fast pace by Doug Liman. The cast is first rate including his CIA ‘boss’ played by Domhnall Gleeson, Sarah Wright Olsen as his wife among others.This is a star turn by a STAR who sells the movie and himself to the audience, including the latter in the fun he seems to be having.10 minutes of a few of the repetitive scenes could have easily been cut but the pace is fast enough and constantly changing that you won’t get bored."}, {"rating": "8", "text": "Tom Cruise and Doug Liman reunite for \"American Made,\" an intense, eminently entertaining, frequently jaw-dropping drama, harboring vastly fascinating truths about the United States' influence over the creation of the Medellin drug cartel and - of course - an incredibly charismatic performance from Tom Cruise. It may feel like the film's focus may waver here and there, but with the slam-bang energy and tone at the center of everything, coupled with stylish directorial efforts from Doug Liman, you're left with more than just an entertaining movie, but a damn good one as well."}, {"rating": "7", "text": "Tom Cruise must have been delighted when this script arrived. It’s funny and sassy and delivers the kind of character Cruise excels at creating. I thoroughly enjoyed the film – the minor characters were very well cast (and fun) – and the plot had enough twists and turns (and “truth”) to make the film even more fun. If you appreciate Tom Cruise at this best in “light” comedy, don’t miss this one."}, {"rating": "8", "text": "A trippy, insightful movie about the dark, corrupts underbelly of the Reagan 1980s, how the S. American drug running by the CIA turned into Iron-Contra.  Compared with Oliver Stone based-on-fact movies, Doug's vision is more grounded because it skips the snarky attitude; it seems fresher for this.  Doug's father was part of the Iran-Contra investigating team.  The skull duggery was CIA sponsored and led but apparently by a rogue faction within CIA, linked with Oliver North."}, {"rating": "8", "text": "Fun movie. Tom Cruise gives his best performance in years. Also Domhnall Gleason gives a great performance too. The movie is high octane and incredibly fast pace. I love the way the story was told and it has a great charm to it. The Doug Limen and Tom Cruise collaboration works again and hopefully many more to come."}, {"rating": "10", "text": "Super entertaining, great set up. I don't care if it was not 100 true to facts, Hollywood has to add a twist and what eve they added on this one..it worked for me. Story line is exciting and to know any of this was close to being true , made it even more enjoyable. A must see, very entertaining."}, {"rating": "8", "text": "BARRY SEAL : AMERICAN TRAFFICCe film est divertissant, je le conseille au Fan de la série \"NARCOS\" actuellement en tête de liste..Il révèle une parti de l'ascension au sommet de Pablo Escobar en mettant en avant Barry Seal un Capitaine qui a roulé dans l'argent plus que beaucoup de monde.Un film Biopic, Thriller et Policier. Hors des sentiers battus par rapport à ce que l'on a pu voir avec les films sur Steve Jobs le patron Apple.Le film Barry Seals s'en sort bien. Nous pouvons être au plus près de l'ascension du trafic de Narcotrafiquant tout en menant de loin les affaires de la CIA une agence gouvernementale[spoiler]    aux stratégies particulières qui nous font ressortir la tristesse du monde dans lequel on vit    [/spoiler]    . [spoiler]    L'agence n'est certainement pas la seule, mais elle est glissée dans le film comme le grain de sable.    [/spoiler]    En tout cas il est amusant de voir la vie d'un homme qu'on ne connaît pas pour une entreprise qui existe encore aujourd'hui, mais comme appartenant à une des plus grandes associations de \"bandit\".Une histoire plein de retournement où je ne me suis pas ennuyé, mais c'est une histoire que les jeunes enfants n'en comprendront surement pas le sent direct.Un petit  1 pour la musique, j'ai apprécié le choc des décennies Si vous Aimé les histoires d'homme je pense que le risque d'être en dans une salle sombre quelque heure peux se transformé en bon moment..À tous les fans de la série NARCOS FONCER!"}, {"rating": "8", "text": "The movie follows a pilot as he pretty much builds a drug smuggling scheme from the ground up. You watch as he gets deeper into work with the cartel, U.S. government, and how he gains massive amounts of wealth while living in a small U.S. town. There is little repercussion for any of his actions until the end of the movie, so in that sense, interest in the plot comes in how the character is able to continually find success while being involved in so many sketchy activities. Nothing about the movie is over the top, but it really does keep you engaged and theres always humor in the mix so you're left liking the movie when it's done."}, {"rating": "6", "text": "The story is very interesting, but this movie is made in such a way that you never really have time to care for any of the characters. 65/100"}, {"rating": "8", "text": "Great movie, enjoyed watching it. Cruise does great acting as always, and there are funny scenes to spice things up. This movie is definitely worth watching."}, {"rating": "8", "text": "American Made got more entertaining now it's 8 and used to be 6 by me, great job Tom Cruise, and American Made Got very better at this time. This movie is entertaining."}, {"rating": "2", "text": "Liberal revisionist history hidden in an entertaining and well acted plot. Too bad it was another example of fake news that a new generation will not learn the truth."}, {"rating": "7", "text": "Very interesting movie, with Tom Cruise! A pilot who is unexpectedly recruited by the CIA to run one of the biggest cover operations in history. A great movie of end of summer, and I enjoyed watching it!"}, {"rating": "9", "text": "Tőlem megérdemelte a film az 5 csillagot. Tom Cruiset nem tartom nagyra, de ebben a filmben nagyon jót alakított és illett hozzá a szerep. Nem számítottam arra, hogy nagy produkció lesz, de szerencsére tévedtem. Ami folyamatosan lekötött a filmben, az az, hogy ezt a sok útvonalat, üzletet, cserét hogyan tudta fejben tartani és megtervezni úgy, hogy lényegében mindenkinek dolgozott Escobartól kezdve, a CIA-n át a Fehér Házig. Érdemes megnézni, szórakoztató film."}, {"rating": "8", "text": "Great pacing throughout the entire movie with a fascinating story.  Details of the original story were compressed or condensed into a single character, but this only helps you focus on the main character & his incredible talent for getting things delivered."}, {"rating": "0", "text": "Absolute trash!  Never been so bored watching a film.  It’s a film about Tom Cruise playing Tom Cruise."}, {"rating": "7", "text": "Well paced and entertaining movie. Probably a bit too much liberal license taken in the telling of this true story though."}, {"rating": "6", "text": "Fairly enjoyable with good acting and story but middling screenplay. Worth watching."}, {"rating": "4", "text": "Cruise does his best as always but I felt the movie really failed him. It felt more like you were watching a highlight reel of the main character's life rather than a consistent story of his journey from simple airline pilot to cartel drug runner. That's what stops this movie from being good and that's why I wouldn't recommend it. I mean it's interesting because it's based on true, real-life events but by making it so cheesy and so quick paced, They don't truly explore these events. We just skipped around to the highlights and then rushed to a quick finish."}, {"rating": "8", "text": "A fun and interesting film, loosely based on the CIA's involvement in Contra drug smuggling in the 1980s. Tom Cruise is actually quite good, though at times there is a bit too much exposition."}, {"rating": "7", "text": "Expansive in its scope but never deep, Doug Liman's \"American Made\" triumphs on the strengths of its true story plot and Tom Cruise's performance."}, {"rating": "8", "text": "Thoughtfully stylised cinematography serve to boost what would otherwise be the somewhat simplified and familiar premise of a drug smuggling plot to entertaining heights. A well chosen cast deliver great performances within the entertaining script. Cruise excels in american made especially in the flying sequences. This film has a superb soundtrack and in 4k the hdr really pops. Overall this movie impressed me a lot more than other reviews had led me to believe!"}, {"rating": "8", "text": "The movie was quite interesting and the story was really well told. What I didn't like though, was that the lead was played by Tom Cruise, who is of course an action star etc and looks good and so on, while the actual guy in real life, by what I have seen by his pictures, looked completely different, but I guess that's Hollywood for you. Still a good movie"}, {"rating": "7", "text": "Amercican Made é um filme diferente do que estava á esperamas que num todo torna- se um bom filme.Tom Cruise como bom actor que é torna sempre os filmes melhores, e apesar de não achar o elenco top o filme acaba por ter os seus bons momentos."}, {"rating": "3", "text": "Un sujet en or sur le scandale \"Contra-Iran\" des années Reagan mais qui se focalise ici sur la partie des \"Contras\" en cheville avec Medellin, Escobar, Noriega, la Colombie et le Nicaragua... tout un programme orchestré par la CIA et ses affaires foireuses dont elle a l'habitude... et qu'on suit via le fameux pilote-livreur Barry Seal.Bien raconté et très intéressant comme sujet mais malheureusement, le traitement est décidément trop \"cool\" avec la \"cool attitude\" trop cool de Tom Cruise qui se croit encore en agent trop cool sa mère de Mission Pas Possible. Tout ça reste donc très superficiel et bien trop cool et branché pour qu'on y croit vraiment : ce Barry Seal par Cruise est toujours soit hilare soit très souriant et rarement inquiété ou rarement inquiet.Ils ont sans doute tenté de faire un truc à la Scorsese, décontracté et plein d'ironie mais ça ne marche pas trop en fait. On dirait plutôt Oui-Oui qui se balade avec son petit avion et qui va tapiner dans toute l'Amérique centrale, chauffeur-livreur pour Uber-AK47 et Uber-Cocaïne.Cela dit, le rythme est très soutenu et on ne s'ennuie pas un instant... ce qui n'empêche pas de choper la migraine via la réalisation de cet empaffé de Doug Liman qui zoome sans arrêt et qui fait tout son film avec la caméra à l'épaule : on se croirait sur un bateau ivre. Et c'est à chier.Très regrettable, car le sujet en lui-même est complètement dingue (la réalité dépasse la fiction...) mais massacré et foutu en l'air par le metteur en scène, l'acteur imbécile et l'approche... trop cool ! alors que franchement, il n'y a vraiment pas de quoi être hilare, n'est-ce-pas Barry ?"}, {"rating": "6", "text": "Сюжет напоминает волка с уолл стрит, но во время холодной войны. Концовка в принципе ожидаемая. Снято в формате повествования от главного героя. Неплохой фильм. Посмотреть 1 раз можно"}, {"rating": "10", "text": "Following the success of Edge of Tomorrow, Tom Cruise is at his best! Loved his performance in this film, what a big comeback for Tom Cruise! This is a must see film! Better than The Mummy, Best Tom Cruise film since Edge of Tomorrow and Collateral! Cruise and Liman are perfect duo! Loved the casting, plot"}, {"rating": "6", "text": "It's a good movie, not wow. In the beginning, it was a bit chaotic with all the characters they needed to introduce. In 5 minutes of film, they introduced 10 people, which was very much to take in. Some characters got introduced, but later in the story they weren't important at all. Then you ask yourself if it was even necessary to introduce those characters. It manages to establish a bond with Tom Cruises character. The story was smart, but i tell you, very chaotic. I think halfway through the movie, the screenplay writers lost their focus and lost the whole point of the story.I know it's based on real events, so it's crazy that all of that happened."}, {"rating": "8", "text": "If you want to watch a movie and is fun watch then you'd do a lot worse than watching this. It's got some snappy scripting, and the characters are generally likable. (Casting on the red neck brother in law is spot on! haha).  I'll be the first to admit, I fine it hard to sometimes watch Tom Cruise knowing about his **** crazy Scientology beliefs... but in this movie he does a great job. Def. a fun watch."}], "recommendations": ["the_terminal", "catch_me_if_you_can", "news_of_the_world", "hell_or_high_water", "ford_v_ferrari", "sully", "apollo_13", "rush", "casino", "donnie_brasco", "lawless", "war_dogs", "a_hologram_for_the_king", "widows", "creed_ii", "gangster_squad", "true_grit", "american_gangster", "captain_america_the_winter_soldier", "burnt", "suburbicon", "the_accountant", "inside_man", "unstoppable", "mission_impossible_rogue_nation"]}