{"id": 2862, "title": "American Ultra", "starring": ["Jesse Eisenberg", "Kristen Stewart"], "runtime": 96, "genre": ["Comedy", "Action"], "description": "Mike is an unmotivated stoner whose small-town life with his live-in girlfriend, Phoebe, is suddenly turned upside down.  Unbeknownst to him, Mike is actually a highly trained, lethal sleeper agent. In the blink of an eye, as his secret past comes back to haunt him, Mike is thrust into the middle of a deadly government operation and is forced to summon his inner action-hero in order to survive.", "releaseYear": "2015", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/bi2MCDYvrZQPf1uXyvfVYPE57Mz.jpg", "categories": {"plot": 5.928571428571429, "acting": 6.3428571428571425, "ending": 5.9375, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 3.0, "funny": 5.6923076923076925, "action": 6.104166666666667}, "reviews": [{"rating": "8", "text": "While maybe a little over-hyped, this was still an enjoyable movie. Jesse Eisenburg is in top form as always and Kristen Stewart did not make me want to punch a puppy for once.The supporting cast does a great job of holding the movie together as well.  The action sequences are top notch, and the humor mostly delivers. Some plot points were a bit cliched and honestly a bit lame, but they are minor compared to the rest of the movie."}, {"rating": "8", "text": "Sweetest Movie, and most violently beautiful movie of 2015. It has its funny moments granted, but the romance between Mike and Phoebe is really quite superb and unique to cinema. It's got that charming =  aggression to it which creates good bonds between characters, it's got a slow start, but it builds into a colourful explosion of blood, weed and love. Amazing!"}, {"rating": "6", "text": "I’d like to tease you with a potentially awesome movie review. I’ve come up with a bunch of great ideas but I just didn’t take the little extra time needed to plan out a cohesive written piece. I’ve devised some uniquely interesting thoughts but my execution will be clunky and I’ll beat you over the head with obvious metaphors. This paragraph has been a metaphor for American Ultra.\r Most of my enjoyment came Jesse Eisenberg’s portrayal of Mike and his dealings with his girlfriend Phoebe (played by the surprisingly awesome Kristen Stewart) and the criminally underutilized, criminal Rose (played by John Leguizamo).\r The rest of the cast however… well they run the spectrum from whatever to yeeeeesh. I’m looking at you Topher Grace.\r American Ultra is ultra okay. There is a lot of solid action and a lot of solid comedic moments. Jesse Eisenberg works great with Kristen Stewart and John Leguizamo but the rest of the cast is a bit blah. Could have been a great movie, just needed more time and polish."}, {"rating": "7", "text": "This is an odd movie.  The acting is good.  It is not boring, though it is neither deep nor terribly meaningful,  It feels a little too much like the movie version of a graphic novel that it is.  A little too simplistic, a little too obvious.  But I liked it."}, {"rating": "5", "text": "This is pretty much a Borne Identity/Last Kiss Good Night ripoff.\r Terrible setup, character introductions were handled very poorly. stoner element severely downplayed, and scenario established very messily.  Pretty much the whole first half hour is a waste of time.  Dialog is pretty bad, and the characters are paper thin. For the rest of the film: Unpolished action and choreography. The final action set piece was decent but not quite Borne level. The villains are b-movie level cheesy.\rThe last hour was watchable, wouldn't recommend it though."}, {"rating": "10", "text": "Bourne Identitiy meets stoner romance. Terrific, surprisingly touching. Loved it.\r Not sure why this post has to be 150 characters....said what I have to say..."}, {"rating": "7", "text": "American Ultra oozes fun. The jokes are funny, the action is exciting, the romance is believable. Jesse Eisenberg and Kristen Stewart shine in the lead roles and have incredible chemistry. The movie is full of style and directed well. The writing is kind of a let down at certain parts but completely works in other parts. Topher Grace is WAY over-the-top and aggravating, same goes for John Leguizamo. Connie Britton adds a nice performance and Tony Hale pops up for a little bit and is really good. All around, American Ultra is a small, fun, movie that is far from perfect but its a nice, easy, quick watch that I recommend."}, {"rating": "10", "text": "OH BOY. American Ultra is a damn good movie. Not just because it's stupid, stoner movie fun. But because it's much more than Pineapple Express meets Bourne. There is a solid love element attached to this film, believe it or not, and the film switches between action and comedy to romance very quickly. Jesse Eisneberg is an actor that continues to impress me, film after film, he is funny and energetic in a over the top, insane film. Kristen Stewart is the real star, believe it or not, she managed to be less annoying and more dramatic and she fit the role very well. Guess she is trying very hard to forget the Twilight Saga. There is a lot in this movie that moviegoers can enjoy, Action, Comedy, Romance, Drama, and Thrills. When I mean thrills, I mean THRILLS, not the cheap thrills you get from an Asylum movie. John Leguizamo was very funny as well. Ultra is the most entertaining piece of cinema I have seen this week. And that includes Straight Outta Compton (which was damn brilliant by the way) and that awful Hitman movie. GO WATCH IT!"}, {"rating": "7", "text": "An uneven film that in the long run I had a fun time with.  The connection of the two lead characters keeps the story going through some absurdities and Topher Grace's over the top performance.  Overall the film was going for a feel that some other films have done better, but it's still a solid.  B"}, {"rating": "5", "text": "Take a bit of a James Bond movie, another part from Cheech & Chong, and mix it up with elements of the recent film 'Spy' and out comes the new movie 'American Ultra.'\r 'American Ultra' is a spy action thriller movie masquerading as a stoner film (have a look at the film poster and you'll see) with lots and lots of comedy. And once it's over you think the person who wrote the film (Max Landis) must've been high on something when he wrote it. Mike (Jesse Eisenberg - The Social Network) and Phoebe (Kristen Stewart) are, basically, potheads, living in what seems like a very empty town in West Virginia. They've been together for several years, with Mike never getting the courage to ask her to marry him. He's booked a trip to take her to Hawaii to propose but he's afraid of flying so they never actually get on the plane. But Mike's content with his job as a cashier at the local Cash & Carry, where there never seems to be any customers. But he's not the person you think he is. He's actually a sleeper agent, a machine, created by the CIA, and they want him terminated - NOW. So one day in his store walks in CIA agent Victoria Lasseter (Connie Britton). She's come to town to rescue him - Mike was an experiment she created - a machine with superpowers - so she feels the need to play mother and protect her offspring. Mike has no idea who she is - but she's able to activate him - turning on his superpowers so that he can protect himself. But CIA supervisor Adrian Yates (Topher Grace) wants him destroyed - at all costs. Even if it means killing Agent Lasseter in the process. So he sets up a command post in Mike's town to look for him and to have him killed, bringing in tow with him soldiers who used to be mental patients. So in between all this we get explosions, lots of gunfire, and a visit to the home of Mike and Kirsten's pot dealer (John Leguizamo) where they go to hide. It all leads up to an extremely bloody conclusion in the town's discount superstore (a la Walmart).\r As mentioned earlier, 'American Ultra's' script is so far out there that one wonders where Landis (son of director John Landis) got his idea for the film. And Director Nima Nourizadeh (whose only other directing credit is 2012's 'Project X' where three high school seniors host a party that spirals out of control) keeps the action flowing, which takes place over the course of one night, but he can't help but let the silliness of the plot take over. Mike and Kirsten seem to be the most sensible people in the film, whereby the CIA agents are badly drawn as buffoon carton characters who can't pull off their mission. 'American Ultra' reminds me a bit of 'This is the End' - Seth Rogen and James Franco's 2013 comedy about the end of the world - where it just keeps on getting funnier and more surrealistic. 'American Ultra,' even though it looks slick, seems to be missing the ingredients that made 'This is the End' memorable. And while it's a good ride that may make you high from just watching it, it's also very silly to be taken as a true comedy. 'American Ultra' is not as good as a Bond film, but, in it's favor, it's not as bad as 'Spy.'\r 'American Ultra' is now out in theatres."}, {"rating": "7", "text": "This movie isn't as bad as people make it seem. I went in just knowing that its about a stoner who's really a spy (of sorts) and that's all. The disappointment from viewers has largely been because of an expectation on which the movie didn't deliver. To me that is not a problem in the film, that is a problem in the management of expectations. Maybe it was because of the trailer (which I hadn't seen), but that's mostly a problem of the marketing department of the production studio. Either ways not a fault with the movie. The issue was that there was nothing exceptionally original about the movie, but unoriginal doesn't mean not entertainment. 7/10"}, {"rating": "5", "text": "We were promised a different movie here than the one that we got. The film is not nearly as action packed or funny as it looked in the trailer. Kristen Stewart is great in this movie but her role is a little overused and you will understand why when a certain twist is unleashed midway through the film. You expect Stewart to just play the straight man to the anxious Eisenberg, but this movie is more of a romance than anything. Rather than focus on the action that everyone wants the story is relying on a fine romance but is really unnecessary in this type or film.\r Another disappointment I had with this film was the lack of fun. It does not have the tone that you expect and it really doesn’t have the flare that attracts your eye and makes you want to watch the film. The action that are waiting for finally comes in the final act but its not quite fulfilling after waiting so long for it to arrive. I also believe that most people are going taren’t going to be able to make connections with this movie. It seems like you have to be a stoner in order to find the humour in this movie. I will say that the only character I found the slightest bit funny was the villain played by Topher Grace. Grace was kind of funny but he still wasn’t a good villain, his motives are a little unclear as well. You would think he’d never be on the evil side again after Spider-man 3 but I was wrong. Sadly American Ultra was one of the biggest disappointments I have had this year."}, {"rating": "7", "text": "American Ultra isn't really able to live up to the potential of its principal conceit and whilst it hasn't found much favour at the Box Office we suspect it'll develop into a bit of a cult favourite.\r Watch this movie online http://www.watchfree.to/watch-2a3c28-American-Ultra-movie-online-free-putlocker.html"}, {"rating": "8", "text": "A film that very much feels like a homage to 1970's exploitation films, American Ultra is a bizarre and fun movie. It nails that \"Last House on the Left\" or \"The Crazies\" mismatch in tone and pacing, and while that may be offputting to conventionally-minded viewers, I really enjoyed it. A pretty somber mood and story is hilariously peppered by bursts of violence, gore, and jokes. The last 25 minutes is just badass awesomeness. It might not be for everyone, but it was certainly for me."}, {"rating": "7", "text": "The first half of AMERICAN ULTRA made me feel the way I felt when I first saw THE TERMINATOR--ballsy, modern, fresh, mean, violent, and outrageously fun! AMERICAN ULTRA is just as good at first with a lovely depth of feeling emanating from Kristen Stewart who once again steels the show. But then there's a character shift that undermines the pleasure and the film eventually becomes just too chaotic with fight scene after fight scene. AMERICAN ULTRA is on to something but it misses the mark unfortunately. Still a terrific time and again, Stewart proves she is a presence to be reckoned with."}, {"rating": "8", "text": "American Ultra somehow manages to be the most romantic film of the year. Tons of fun. Its kind of like if True Romance, Pineapple Express and one of the Bourne films got into a fight at the grocery store."}, {"rating": "5", "text": "Literally every funny part in the movie was in the trailer. I hyped everyone up for this movie after finding out that Max Landis wrote this. I dragged 3 people to the theater for this and I think there was maybe one chuckle out of the group. I felt embarrassed for hyping this up to my friends and family."}, {"rating": "8", "text": "American Ultra is not a stoner comedy.\r I know that's how it is being marketed but it's not. It's its own thing.\r It is a wholly original take on the whole \"sleeper agent who doesn't know he's a sleeper agent\" thing with a healthy dose of romance, bloody gore and a few \"stoner comedy\" laughs.\r This is also an independent film. It has explosions and big stars but also doesn't stick to conventional wisdom and never goes for the cheap and easy laugh.\r I'm making this sound more complicated than it is. American Ultra is a fun movie that is also smart. I had a great time watching and will likely see it again in theaters which is something I hardly ever do."}, {"rating": "9", "text": "\"American Ultra\" is hugely enjoyable in unexpected ways. It reminded me of \"The Interview\" - both films have ideas, but refuse to take them too seriously and communicate them better as a result. Accordingly, in between its fast and fun moments of well-staged action and stoner pastiche, \"American Ultra\" manages to work in genuinely touching moments, largely thanks to the chemistry between Kristen Stewart and Jesse Eisenberg who are tender and convincing as a couple in love and backed up by a strong supporting cast of indie acting greats. This is one of the few films I've seen this year that I would love to see a sequel to."}, {"rating": "9", "text": "I really enjoyed American Ultra!  It's a gory thrill ride with a gooey center.  The cast is great and the chemistry between Kristen Stewart and Jesse Eisenberg is amazing!!"}, {"rating": "3", "text": "One of the worst movies I've seen this year, and that's saying a lot.  The cast is solid, but they did absolutely nothing with them. The writing is terrible.  It's just a joyless experience.  Maybe you truly do have to stoned to appreciate it.  Maybe they were stoned when they hit the writers' room. Who knows?"}, {"rating": "10", "text": "American Ultra is less stoner and more love story than you would expect from the trailer, it manages to blend multiple ideas into an interesting and cohesive story. The movie maintains plenty of action and drama while still throwing in some laughs. Jesse Eisenberg and Kristen Stewart have a beautiful rapport that really shines through out the entire film and really helps you connect with the characters. Action sequences manage to be brutal, entertaining and somewhat unconventional. The movie shines when you stop viewing it as Bourne with stoners and see it as a reluctant action hero love story with stoners."}, {"rating": "5", "text": "Not funny enough to be a comedy. Not enough action to be a thriller. It's as if the movie doesn't know what it wants to be so it never fully reaches in any direction. What you end up with is a mildly amusing, highly predictable rom-ish-com-ish. Seems the marketing team couldn't quite figure it out either, based on the ads that really misrepresent the film. If you think you're going to see a funny, stoner action-comedy you're going to be sorely disappointed."}, {"rating": "5", "text": "Vaguely interesting, kind of like an extra-violent Scott Pilgrim with a twist of Jason Bourne.  If I was in my 20s, I probably would have enjoyed this much more.  Unfortunately, I'm an old fart and have seen everything this movie has to offer.  However, it is entertaining enough for weekend escapism.\r The good: very well-acted all around (except for Walton Goggins, unusually enough), good pacing, and a number of humorous doperisms.\r The bad: lack of originality.  It starts out as Pineapple Express, veers into Jason Bourne territory, and ends like True Lies (and Red 2...and every other spy-love movie imaginable).\r The verdict: all execution and no strategy.  Thus 5 stars."}, {"rating": "8", "text": "An R-rated spin-off of the TV series Chuck.  It has many great actors giving decent performances, some inventive action, and ends up being oddly charming throughout.  Anyone looking for Natural Born Killers should move on, quickly.  The biggest surprise in the film is Kristin Stewart giving a performance that sails way past competent."}, {"rating": "8", "text": "This movie had a wonderful premise that was not used as well as it could have been. It was too serious and bloody towards the end where everyone was getting beat up. If they remake, or make a sequel to this movie and focus on the premise of the guy who isn't aware of his abilities, and his loving and supportive girlfriend, take out the seriousness and make it more cartoonish, that would be a very entertaining movie. As it was, while the movie was very entertaining, just before the end needed to be lightened up."}, {"rating": "0", "text": "A poorly written film, poorly cast and suffered from too much hype. If this was food, the recipe reads amazing but all the ingredients did not fit. Sad."}, {"rating": "6", "text": "This is one of those flix where the trailer makes it look like a comedy with action. Truth: it's a few fights with almost no laffs. Jesse Eisenberg plays a stoner who lives in a small town with his girl (Kristen Stewart). Turns out he's a sleeper agent, who's highly lethal skills are awakened when the CIA agent mounts a campaign to eliminate him (why was never clear). The plot is basically simple, but the details convoluted. It's really about watching Eisenberg go the action hero route, which he does with his typical confused, wimpy personality. The fights have an ultra-violent edge, but in a quick cartoon style that minimizes the impact. Unfortunately, the talky scenes are slow and lack any interest. It's not a total disappointment, but not especially cool, funny or edgy either."}, {"rating": "2", "text": "American Ultra has some extremely funny parts, but the rest of the film is boring and dull. I felt as if the film tried too hard. I was extremely disappointed."}, {"rating": "6", "text": "the movie was watchable more for the 18 to 25 group but these actors are mediocre to begin with, Hollywood just doesn't seem to be getting real actors anymore with real talent its relying to much on special effect to put out a movie these days, and these kind of actors for filler with no real acting abilities, if you have ever seen the twilight series i rest my case"}, {"rating": "10", "text": "It's a movie that feels like an exciting adaption of limited series comic book. Heck, it feels more like a comic book movie than most actual comic book movies. Marvel and DC could learn a lot from \"American Ultra\" as far as capturing the feeling of a comic panel onscreen. The best part? It's all a completely original idea!\r Director Nima Nourizadeh is able to nail every aspect necessary to bring his and writer Max Landis' vision to life. The humor, the heart, the action, and the plot are simply amazing. It's not really what you would expect going into it. It's deep, sweet, violent, and weirdly emotional. The twists and turns are gripping, the characters are lovable, and the romance is real. It nails every aspect required to keep you invested and entertained.\r Speaking of the characters, the cast is phenomenal. Eisenberg plays an oddball character unlike anything he's done before. It can easily stand out as one of his best portrayals/characters. However the real star here is a real shocker. It's Kirsten Stewart! Who knew she could act this well? Her chemistry with Eisenberg add the needed emotion and weight to the romance which ends up being so integral to the whole thing. The rest of the cast is just as amazing, also giving some of their best performances. Topher Grace even makes for an excellent villain.\r It's just an all around masterpiece. One where all of the ideas click and everything comes together to create some even more incredible than the sum of it's parts. It's a goofy, violent, funny mess with a surprising heart and romance to it. It really is like a comic book brought to life, all vibrant and exciting. Truly like reading panels, only those panels are moving and fully voiced.Turns out that one of the best comic book movies I've ever seen isn't even an actual comic book movie. American Ultra is a masterpiece and I can't recommend it enough. Truly some of the most enjoyable entertainment I have ever partaken in."}, {"rating": "2", "text": "I watched it with 5 people (family) and nobody liked it, we felt like we lost 2 hours : too much violence and it failed at being funny most of the time"}, {"rating": "1", "text": "American Ultra is one of the worst movies of the year. An epic failure on story, acting, and anything else that it takes to make a movie. Nothing works, nothing makes sense and best of all, I never want to see this piece of trash ever again"}, {"rating": "9", "text": "Such great acting, such great plotting and character, such good comic timing, such great action direction. What I love most is how Jesse Eisenberg never makes those tough guy faces. He's just an expert, like a stoner chessmaster, and killing is his talent. Insecurity and indecision in any other actor is annoying, but it's so cute on Jesse. So many great, surprising laughs! I loved it!"}, {"rating": "6", "text": "A very familiar theme, as well as a small quantity entertainer.\r The second movie for the director. His first, 'Project X' was an unexpected full treat. I simply loved that one, just for the entertainment's sake. I anticipated, 'Project XX' or 'Project Y', followed by 'XXX' or 'Z', but that never happened. I thought the director was setting up his own style of filmmaking, but this film did not clinch well. There's no story, just based on one evening event that stretches as far as another day by adding brief oral flashbacks to match with the rest of the storyline. But the fact is it was a comedy version of 'Hitman'.\r The red band trailer I saw revealed many stuffs, but the movie still offered lots of variety from the different angles of the same stuffs. Jesse Eisenberg, I never expected him to play a character like this, he was good. But it was only a partial display, if there is a sequel, I expect that would be an uncompromised when it comes to the stunts and heroic adventure. Although I enjoyed the end credit animation.\r Kristen Stewart was just hanging around, though her character had potential to be a game changer, so let's hope the sequel strengthens that part. Yeah, I'm kind of certain about the follow-up after seeing this film's ending, if they don't consider to make one, that would be theirs great loss. Anyway, the movie is a good entertainer, but not your unusual story as you expect it to be.\r 6/10"}, {"rating": "3", "text": "Of what does this film fail because?\rFirst Kristen Stewart is no good actress and since her big time her stars fall.\rNow Jesse Eisenburg is not the big action actor and should avoid such roles.\rAnd the action here with comedy in a film is connected could go off only to the back."}, {"rating": "2", "text": "The only positive thing about this movie is that it is just over an hour long (but that hour drags). Not great action, cheesy graphics, bad gore (even if they were going for over-the-top), and stupid characters. The movie falls apart."}, {"rating": "3", "text": "Same old same old formulaic boring low grade action setups paced like clockwork to get through the same kind of worn out plot seen a thousand times with the slight marketing twist of stoner meets secret agent flick.  Well it doesn't cut it, though there are a few funny lines.  A few funny lines in the trailer are a better way to spend your time."}, {"rating": "4", "text": "Jesse Eisenberg is reunited with his ‘Adventureland’ co-star Kristen Stewart as a pair of dysfunctional star-crossed lovers in a genre mash-up film that flirts with being a parody of a super-agent action/thriller, but ‘American Ultra’ isn’t consistently funny enough to be a parody, or a comedy for that matter.\r In only his second film director Nima Nourizadeh tries to bring together several disparate elements into a bizarre comedic stoner love story mixed with a graphically violent spy action thriller, clearly inspired by much of Matthew Vaughan’s recent work and 2008’s ‘Pineapple Express’, but the result is an uncompelling mess.\r The basic storyline is lifted directly from the ‘Bourne’ trilogy and infused with an absurd love story that cringingly attempts to be sincere and touching while a ludicrous amount of ultra-violence occurs around it, aside from a couple of moments ‘American Ultra’ is devoid of any real humour despite being a comedy and the absurd nature of the narrative gets old quickly.\r The pace of the film is all over the place with action scenes broken up by misguided attempts at romance and tenderness, and when all else fails the action comes to the rescue right? Wrong, aside from a few creative ways of murdering people and the odd explosion, we can’t figure out how a $30 million budget for an independent film can deliver so little.\r Jesse Eisenberg does his level best at essentially playing a young Woody Allen starring in a comedy remake of the ‘Bourne Identity’, Kristen Stewart does her best to stay out of the way but ultimately ‘American Ultra’ is less than the sum of its parts. A half-baked (pardon the pun) idea that only ever threatens to break out into a coherent and entertaining film.\r The Bottom Line…\r‘American Ultra’ is an ineffective mix of genre films which fails to capture the balance of elements that make them enjoyable, a derivative mess that’s marginally entertaining, occasionally funny and just barely watchable."}, {"rating": "4", "text": "Way-too overrated. I hated this movie so much. I guess it might be because I was expecting too much, but seriously this movie sucked. The action was weird and insane, and the characters weren't even likable. The villain was weak and the film was torn apart by the weak script. Extremely disappointed. (43/100)"}, {"rating": "6", "text": "American Ultra is a fun sober movie that is probably a blast while high. While the characters and story are average at best the sense of fun created by anything and everything being a weapon makes the film worthwhile. Whenever the action kicks in it is so dumb, goofy, and cartoony like something out of the 80s. From the blood squirts to the bizarre kills the quirk nature of the film makes it worthwhile. I wouldn’t be surprise if this film develops a fan base or cult following as a great stoner film but the been there done that story could also hold it back for some."}, {"rating": "3", "text": "It started off pretty interesting and then it started to unravel. By the time I reached an hour into the hour and a half runtime, I realized how quickly this movie utter fell apart. The story is filled with so many needless plot twists, uninteresting side-characters who's only use is to be killed off within minutes of meeting them and a pace that seems to come to a cripple halt halfway through. By the time the climax came around, I couldn't wait to be done with it."}, {"rating": "8", "text": "Not laugh out loud hilarious, but always clever, charming, and entertaining. And, surprisingly, the romance between the 2 leads carries the film very well and is one of the more believable and better chemistry I've seen on the big screen in quite awhile.."}, {"rating": "6", "text": "The cinematic version of a laggy internet connection, American Ultra is filmed through a cloud of smoke and that is all too appropriate for this stoner action comedy. Similar to Pineapple Express, the film derives its comedy from placing slow (both in speech and brains) stoners in improbable situations with guns. In fairness, this is a terrific formula for an action comedy. Starring Jesse Eisenberg and Kristen Stewart, American Ultra is the definition of easy watching. It is solidly funny, solidly action-packed, and great for watching on demand. If you pay to watch this film, the joke is really on you.Comedy-wise, American Ultra largely relies upon the hilarious nature of its premise, as well as its protagonists. Thanks to the good acting from Jesse Eisenberg and Kristen Stewart, this largely works out quite well as the deliver the lines with the right speed and level of curiosity to really drive home the subtly comedy. In many ways, the film mirrors the experience of being around a friend while they are stoned. Initially, it may be thoroughly hysterical. After a while, it does grow grating. Fortunately, American Ultra recognizes this and is mercifully only 90 minutes, which largely prevents it from overstaying its welcome. That said, it does not provoke that many laughs. For a film about a stoner sleeper agent, the film really is quite reserved and does not go for the gold too often. Instead, it is fine with producing decent chuckles along the way, instead of fully committing to the sheer lunacy of its premise.Where the comedy slacks, the chemistry between Eisenberg and Stewart really shines. First demonstrated in Adventureland, this odd couple duo really work well with one another. American Ultra is no exception as the film is quickly able to develop their romance and relationship with incredible believability. While everything else in the film is ludicrous and over-the-top, the film really manages to craft a solid romance along the way in which their devotion to one another becomes incredibly evident.In terms of its action, American Ultra certainly delivers the good. With stylish action akin to a Tarantino flick, but with the sped up action moments that, for whatever reason, reminded me of Zombieland due to its casual, yet stylish nature, the film is entertaining. Heavy on blood effects and inventive kills (a man is killed by a spoon...), American Ultra has a ton of fun with its characters and situation. The end result is a largely infectious feeling, instilled by these action sequences. Even better, it never takes itself too seriously and solely seeks to entertain. While the world is crumbling around them, Eisenberg's Mike Howell and Stewart's Phoebe Larson freak out alongside it, but match it with killer instincts when it comes time to fight for their lives. Thus, while quite bloody, the action scenes are intense and worthwhile.All of this said, American Ultra is never a good film. It is the very definition of a Redbox rental. It is a film you grab because you are too lazy to really try and find something else to watch. However, it is also not a bad film. With solid comedy and good action sequences, as well as typically good performances, there is more going on in American Ultra than meets the eye. Plus, who does not appreciate John Leguizamo hamming it up as a West Virginia gangster? While not the most challenging film ever made, this one is a solidly put together action comedy that under-utilizes its talented cast, but is fun while it lasts."}, {"rating": "4", "text": "After I first saw the trailer for American Ultra I became very excited for the film. It seemed like the kind of fun and crazy movie that I would enjoy. Then the mediocre critic reviews came but I still had my hopes that this movie could be good. Sadly I'm now amongst the people holding my thumbs down.\r Sure, there were some cool action scenes. But by the time that we got to them I had witnessed so much dullness and boring nonsense that frankly I no longer cared about this film at all. The plot was your typical Hollywood clichés that only sucked the life out of the movie.\r I'm actually feeling sad for this film because I really liked the characters of Mike and Phoebe and I think both actors did a great job with them. I just wish they had a better story for them.\r The villain was simply laughable. It would be okay if he was only a minor villain, lackey to the more formidable opponent but that was not the case. The rest of the characters were forgettable.\r Overall I think I had more fun watching the trailer than the actual movie."}, {"rating": "8", "text": "Imagine if Rambo or Bourne or any of the uber-killer ego-stroking fantasy roles had been performed by someone with the stage presence of a Woody Allen and you'll be close to understanding the off-beat appeal of American Ultra.The plot is basically a conspiracy theory come true.  If you believe that kind of stuff then there's a lot of deep dark secrets revealed by this film.  If you know crazy when you see it then this film is a whole bunch of fun.  Of course, if you harbor secret fantasies about being someone like Wick et al then there's nothing much left to say.  But if you can appreciate a tale about a geeky stoner sort of dude thrust into the extraordinary without even recognizing his own surreal abilities, then this is the film for you.It’s quirky, funny at times, full of action sequences that sometimes boggle the mind, and in the end it gives you a mild surprise that we all should have seen coming.If you don’t like American Ultra then you have no sense of humor and you take yourself far too seriously."}, {"rating": "4", "text": "Really boring movie in my opinion. Had a really good premise, was really excited after seeing the trailer, but the actual movie was quite cliche basically and nothing impressive happened. The beginning was really boring (first 10 minutes), but then, when the main character got ''activated'' it seemed like the action will start to happen - while it kinda did, it was so predictable and boring. As I rate movies by their plots it really did felt like waste of time, even though acting was ok (even for Kristen Stewart) and I consider it not that good of a movie if you can shortly retell it in a few sentences."}, {"rating": "9", "text": "It was at the very least a fun movie! It felt over the top in parts with just enough ridiculousness for me. It was rather predictable in parts, but i still managed to enjoy the \"twists\""}, {"rating": "4", "text": "This movie has so many surprisingly good elements that I don't want to give it a bad review. The acting's charming, and the romantic parts are generally sweet and believable. But if you're looking for a fun action movie, don't bother- most of the action is in the trailer, and it's not always well paced in the movie itself (the same goes for at least half the humor, IMO). The people who made this movie also don't seem to be sure whether they're making a Bourne Ultimatum-style \"having a bunch of  brainwashed assassins is totally crazy and wrong\" statement, or if they're in more of a \"let's kill bad guys in fun and splashy ways\" mindset, which is also pretty annoying considering the ending."}, {"rating": "10", "text": "A good movie . Un poco de humor, cargado de adrenalina. Esto es realmente fantastico. Las actuaciones de sus protagonistas, magistrales. Muy bien por la productora y el director."}], "recommendations": ["the_losers", "keeping_up_with_the_joneses", "rocknrolla", "hancock", "snatch", "thor_the_dark_world", "ant_man_and_the_wasp_quantumania", "kingsman_the_golden_circle", "kingsman_the_secret_service", "copshop", "hercules", "the_a_team", "the_bank_job", "deadpool", "the_family", "lucky_number_slevin", "logan_lucky", "nobody", "deadpool_2", "seven_psychopaths", "the_nice_guys", "the_wolf_of_snow_hollow", "ready_or_not", "boss_level", "shazam_fury_of_the_gods"]}