{
  "id": 2376,
  "title": "American Assassin",
  "starring": [
    "Dylan O'Brien",
    "Michael Keaton"
  ],
  "runtime": 112,
  "genre": [
    "Action",
    "Thriller"
  ],
  "description": "Following the murder of his fiancée, Mitch Rapp trains under the instruction of Cold War veteran Stan Hurley. The pair then is enlisted to investigate a wave of apparently random attacks on military and civilian targets.",
  "releaseYear": "2017",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/w6vjeHx3UEaBXIyc8VFqyZYKznD.jpg",
  "categories": {
    "plot": 4.1923076923076925,
    "acting": 4.470588235294118,
    "ending": 5.6,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 5.0,
    "action": 6.04
  },
  "reviews": [
    {
      "rating": "3",
      "text": "If you’ve never read the original Mitch Rapp novels you might think this movie is ok. But the original source material is so strong that to anyone who has read the books this movie is a travesty. The casting is dubious, but it would have been ok if the script and direction were even halfway decent. As it is, the characters are severely one-dimensional, and the script reads like “my first dialogue”. In short, a long-awaited movie franchise disappoints."
    },
    {
      "rating": "5",
      "text": "O'Brien is decent and the film is mildly entertaining, but also dumb and ridiculous."
    },
    {
      "rating": "5",
      "text": "Another mediocre Hollywood rehash of a thriller we've seen hundreds of times before.You've seen it done better, you've seen it done worse.Pretty ho-hum casting, both the protagonist and antagonist are D or C grade actors at best.Keaton has a bit of fun as the grizzled ex-SEAL CIA trainer, but nothing could detract from the extreme averageness of the movie."
    },
    {
      "rating": "4",
      "text": "'American Assassin' is extremely uneven, especially tackling it's \"gritty\" approach to politics. So lifeless in fact, even Michael Keaton knows there's better roles out there and saves his talents for something better.However, it dose have some interesting action sequences and decent looking shots. So the technical side of things stops this from being flat out bad.Dylan O'Brien, on the other side, is at least trying his best from what he's given. Slowly building himself to be a action star or a strong leading man, if he continues this path."
    },
    {
      "rating": "3",
      "text": "The actor playing Rapp isn't physically imposing enough to be credible in the role.  Seems like a kid, no threat, doesn't seem appropriate at all.  No voltage.  The idea that he somehow works out for 6 months and then starts infiltrating terrorist cells in Libya, knows the Koran and speaks Arabic, etc. -- just doesn't fly at all, right off the bat.  It's the kind of thing an inexperienced screenwriter writes, and it seems OK to read it in the script, but it doesn't actually play well to the audience.  The intuition to detect this kind of problem and avoid it is a prime distinguishing characteristic of better screenwriters and directors.  The whole movie somehow fails to create the suspense and credibility that Bond, Bourne, etc. do so well. It's like an imitation spy movie.  I actually fast-forwarded through several parts of the DVD, just couldn't sustain interest -- and many scenes are hard to figure, stuff happens but it's not very clear exactly what.  Lots of foreign dialogue with tiny subtitles hard to see on the TV also detract from the storytelling.  Weird fail, doesn't make the grade despite a lot of effort that obviously went into it. The lousy special effects at the end - blue-tone CGI stuff - puts the nail in it. It's that blue-tone 1997-style video-game CGI that more than anything, brands a bad movie these days.﻿"
    },
    {
      "rating": "7",
      "text": "I whole heartedly agree with movie watcher ,RPD, and Vand001. Why the bad reviews? The movie was fast paced and kept your interest up.It had action and pace.I would recommend seeing it  to anyone ! Go and enjoy."
    },
    {
      "rating": "3",
      "text": "Predictable thriller with a familiar storyline. Many of similar films had better cast and better scripted. The film should be held tense or even try to do it, and this production can not even get into the situation of heroes. Unfortunately it's a flap."
    },
    {
      "rating": "3",
      "text": "**** spoiler alert ****I like the idea of the film but screenplay and direction are way below average. The characters are thrown into the scenes without a proper construction. The last quarter of the film simply threats the audience as if we still believe in Santa. It begins with the main character using a car that was far from the tunnel entrance to invade the place his boss was being captive, then the villan sets the bomb to 20 minutes although the real target was at least one hour away and last but not least it seems that the explosion of a nuclear device wouldn't destroy miles and miles of italian coast with a tsunami. Twelve year old kids will like it.  Don't you dare compare it with Jason Bourne and James Bond films!"
    },
    {
      "rating": "1",
      "text": "One star is too generous for this movie. Bad script, horrible acting. you don't know who is worse Michael Keaton who plays a former Navy Seal or the main character who is skinny uninteresting kid with no appeal. Its a bad version of Bourne identity, typical bad guys in various locations in Europe running around, car chasing, killing and fight scenes."
    },
    {
      "rating": "4",
      "text": "American Assassin fails to set an actual target on what it wants to be. In fact, the film itself doesn't even know what it's doing to impress moviegoers like me alike. I say, confusing films always end up being mediocre to an extent, but I sure hope that I see an exception to the list one day or another."
    },
    {
      "rating": "3",
      "text": "Hollywood never tires of these impossible odds tales of international \"intrigue\", with spying, ultra violence, poetic justice, yadda yadda yadda.    And because this genre is so gentrified and cliched, it takes special writing and casting, not to mention direction to rise above the rest.    \"American Assassin\" does not.    Vince Flynn is the author of the mass market paperback series that features Mitch Rapp, a seemingly indestructable intelligent agent in the vein of other fictional tough guys like Brad Thor's Scot Harvath, or Tom Clancy's Jack Ryan.    Had I recognized this as a Flynn book I probably would have chosen not to see this movie because unlike at least Brad Thor, who writes more interesting stories, I thought the one Flynn book I read was as cliched and hackneyed as James Patterson or a dozen other authors who churn out the same formulaic tripe book after book after book.    So we have Dylan O'Brien acting the Rapp character, and right away the movie starts to fail under its own premise.    For my money, O'Brien is, for all intent and purposes, another Keanu Reeves style actor, all muscle, violence and the personality of a bar of soap.    Mitch Rapp is supposed to be the ultimate charismatic badass, striking fear into the foe and in theory at least somewhat emotional.    Sorry.    He just plain does not convey the personality his character is supposed to be.    The only saving grace is Michael Keaton, but he can't save this clunker, either.    Even the premise of an inevitable nuclear explosion failed to pique my interest.    It's political thriller done by a paint-by-numbers kit, and for all its supposed gun violence and the usual stereotypical terrorist behavior, one of the year's yawners."
    },
    {
      "rating": "9",
      "text": "There had to be some kind of political agenda tied to these negative reviews because I really enjoyed this movie. It was a Jason Bourne type movie with a story line about fighting terrorists."
    },
    {
      "rating": "0",
      "text": "This movie is not just badly executed, it's also stupid, and the way they've represented the Iranian people and Iran's foreign policies is just \"f****d up\"! i got no other words to explain this. and Michael Keaton going from working with Alejandro on Birdman, and films like spotlight to this \"American assassin\" is just such a downgrade. I give 0 out of 10 to this film. and i'm type of a person, who believes that there's no such thing as a bad film, but this film is bad, beyond explanation.\u2028i know that it's based on a poor novel, which aimed for something else, but not every novel should deserve the chance to become a film."
    },
    {
      "rating": "8",
      "text": "This is the latest CIA scramble to save the world from nuclear disaster. Dylan O'Brien plays a new recruit who continually goes rogue, nothing new here. Even the strict leadership of his hardened trainer (Michael Keaton) doesn't stop his fearless determination to destroy terrorists. While the story isn't original and there are moments that strain credibility, the film is well paced, the action scenes are full of hard-hitting hand-to-hand combat and the final showdown packs a wallop. Mindless, but entertaining."
    },
    {
      "rating": "8",
      "text": "American Assassin was a very entertaining rogue-agent action film starring relative unknown Dylan O'Brien, but with celebrity support like trim/toned Michael Keaton, an unexpectedly chunky Sanaa Lathan (\"Donna Tubbs\" from \"The Cleveland Show\"), and a still-looks-like-his-role-on-Battleship Taylor Kitsch. Yes, there were a few \"oh please\" moments but the plausibility in general was satisfying. And any action movie that features a nuclear explosion has got to have something going for it. On an own/rent/skip scale, it's a fine rent."
    },
    {
      "rating": "10",
      "text": "I'm not sure what these negative reviews are about. This movie is EASILY better than the last two Bond's, the last two Bourne's, and also kicks ass all on its own. I plan to see it a couple more times before it leaves theartes."
    },
    {
      "rating": "7",
      "text": "Very typical action fighter type of movie with a little bit of a twist. Easy to follow, fun to watch and Dylan O'Brien was really good. I wouldn't necessarily say pass if you like these types of movies, but I've seen better."
    },
    {
      "rating": "7",
      "text": "As an action movie it was quite good, even though with many plot holes and didn't add anything much else to it. In my opinion plot wasn't that interesting, but if you want some good action it is still good."
    },
    {
      "rating": "6",
      "text": "The critiques are disproportionate to the quality of the film. Its better than most of the negative reviews. Its not Citizen Kane or The Godfather. Its a James Bond-Jason Borne type thing and its entertaining. Some of it is stupid but some of it is very good. Good casting, nice pace , reasonable semblance of a plot. What do you want for $8.00 ? Good middle of the week movie"
    },
    {
      "rating": "8",
      "text": "I really liked this actually! It's like a teenage John Wick coming of age"
    },
    {
      "rating": "9",
      "text": "These negative reviews must be part of some shadow campaign to dog on Vince Flynn (RIP)...  This movie was pretty great.  Not exactly like the book, but good in all kinds of ways."
    },
    {
      "rating": "8",
      "text": "This was a really good movie and I don't understand the critics at all.  My new policy is, if the critics love a movie, I'll avoid it.  If they dislike a movie, I'll go see it.  Again, this was a very good movie and should've gotten better reviews by the critics."
    },
    {
      "rating": "9",
      "text": "American Assassin is a typical example of why you shouldn't listen to the critics.It's far better than many spy movies out there, it's fast paced, has great action and more than decent acting, especially from the main actors who played Mitch and Hurley. The opening sequence was quite shocking and realistic, I would have loved to see more of the training; the movie could have easily been half an hour longer. The ending was quite cool. All in all, I would definitely recommend it. Great movie that will live a long life."
    },
    {
      "rating": "9",
      "text": "We decided to give this a go despite all of the \"critical\" reviews by the so called experts.  Our experience has been that they do not always get it right.  We were very glad we did, the film caught our attention from the get go and we thought it maintained it throughout, I might even purchase a copy when it becomes available for my personal collection.  There were six of us at this film and when we left we all agreed that we thoroughly enjoyed our time there and that NO ONE had even once looked at their watch which is usually a good indication that they are bored with the film"
    },
    {
      "rating": "10",
      "text": "Es muy buena, me gusta mucho el trama y el contenido, DYLAN es uno de mis mejores actores que conozco"
    },
    {
      "rating": "10",
      "text": "\"American Assassin\" is an action film, a spy thriller, a meditation on revenge....  Fantastic acting from Dylan O  'Brien and very good action movie to see!!!"
    },
    {
      "rating": "4",
      "text": "The movie was ok.  The casting of Mitch was good and true to the character. The story was not true to the book and was changed to the point of frustration.  I love the books and the writing of Vince Flynn.  I want to see more movie adaptations, but please stick to the stories."
    },
    {
      "rating": "5",
      "text": "Any garden-variety Bourne, Bond, or Bauer connoisseur will see right through the tricks and twists on display in this uninspired spy thriller. Try as Michael Keaton and Dylan O'Brien might, there's no glory to be had in trying to sell some of these dopey character moves and hackneyed plot points. Seriously - the \"unhinged/loose cannon C.I.A. operative rallying against his superiors orders so he can stop the rogue operative from detonating a nuclear device\" narrative has been so done to death that it's a miracle this movie was even remotely watchable. But, indeed, \"American Assassin\" does remain at least that; watchable. If the overused plot threads provide anything, it's a sense of familiarity that the audience can at least navigate through. And the occasionally decent fight scene or set piece doesn't hurt either. Needless to say, I was never bored. But, alas, I was also never really that impressed either."
    },
    {
      "rating": "4",
      "text": "Overall a OK movie. The first scene in my opinion was a little to graphic. It is great to setup a characters motivation, but it could have been done in a less extreme way. Other than that it is a standard thriller with a predictable plot."
    },
    {
      "rating": "5",
      "text": "Despite a flimsy plot and generic action dialogue and characters, \"American Assassin is entertaining and action packed."
    },
    {
      "rating": "7",
      "text": "In complete agreement with the users who stated this film is unfairly judged by some. More of a Mark Wahlberg role played by an unknown but Michael Keaton added a good supporting role. Are some of the scenes somewhat far-fetched ... yes ...but overall the action was thrilling enough to pass my litmus test"
    },
    {
      "rating": "7",
      "text": "Não sendo um filme fantástico, é um bom filme para quem gosta de acção. O elenco por vezes não ajuda e o actor principal deixa muito a desejar.Posto isso filme bom para quem gosta de um filme de acção. Para quem não gosta é dá para passar o tempo."
    },
    {
      "rating": "6",
      "text": "American Assassin is an entertaining movie with well-done action and good pacing, as well as a committed performance from Dylan O’Brien. However, it is also generic with nothing to make this stand out from countless other action-thriller movies."
    },
    {
      "rating": "7",
      "text": "Combat scenes stood out as very entertaining. Over the top plotline that can feel just right if you don't think about it too much until after the movie - but if you're looking for realistic intelligence and military scenarios, this ain't it."
    },
    {
      "rating": "4",
      "text": "Remember a movie a few years back that was trying to make Taylor Lautner an action heroe?This film is basically the same thing with its obvious differences of plot and narrative.Very simple and although it has some nice doses of entertainment at the end is quite an irrelevant film."
    },
    {
      "rating": "3",
      "text": "I liked the casting decisions, but hated the plot. I am a die hard Vince Flynn fan, and I left the movie disappointed."
    },
    {
      "rating": "6",
      "text": "It was kind of paint by numbers action film.  It had a little bit of this and a little bit of that.  I will say that the beach terrorist scene was great."
    },
    {
      "rating": "4",
      "text": "American Assassin is what happens when American writers can't claim USA prowess after the US has waged a failed war for the wrong reasons in the Middle East for nearly two decades. Foreign terrorists are portrayed as religious nutcases rather than the intelligent and connected extremists that they are. It's easy to call someone your enemy if you only demonize them for the reasons that you find disturbing.So, overly emotional and needy boyfriend asks hot girlfriend with nice boobs to marry him. Seconds later half the beach, including the girlfriend, gets shot to pieces by some dudes who apparently were \"Terrorists\". They looked more like layed-off tattoo artists to me but fine.Boyfriend gets angry and trains himself to be a douchebag to kill terrorists. Douchebag gets added to a special unit. Douchebag is arrogant and oblivious to the teachings of his surroundings. US government still thinks they can go abroad, cause death and not expect there to be repercussions from their actions. In this case the bad guy is actually an American defector. And thus the vicious cycle continues.Lets talk about the movie as an entertainment property though. The movie does keep you interested, but the story is rather unrealistic and too unbelievable to be taken seriously. The main character is unlikable, and is a walking contradiction in regards to what he considers \"The Enemy\". Had the story been believable, that wouldn't have mattered. But that's not the case here unfortunately. The Americans in this movie get a lot of innocent civilians killed, all because the Irakians want to make a nuclear bomb to blow up Israel... Yeah that will totally not have disastrous consequences for Irak... So dumb, only an American could have written this and not realize the hypocrisy of it all. It is a bad movie. I give it a 4/10."
    },
    {
      "rating": "7",
      "text": "This movie has been sitting on my unwatched shelf for quite a while and yesterday I finally got around to watch it.I actually found this movie to be not too bad actually. It is far from a cinematic masterpiece but it is a pretty solid action/revenge movie. Dylan O’Brien is, unfortunately, pretty meh as the main character. Michael Keaton on the other hand is quite good in his character.It is a reasonably action filled movie and I really like that they didn’t try to turn it into some PG-13 crap. It is sometimes fairly brutal. The story is okay. It works. It is not overly complex and some people are probably moaning about it not being original enough. Well, I say, so what? It is a good concept so why screw with it? I do like revenge movies and although this one is far from the best, it is not at all shabby.I wonder why some people seems to be claiming that this movie is just crap, one star out of ten and so on and so forth? Is it maybe because it dares bring up the subject of Islamist fanatics killing innocents? Or maybe because it doesn’t try to sugarcoat things and explain these “poor misunderstood” psychopaths but lays the blame straight on said lowlife as well as on Iran? Or maybe because it doesn’t try to blame certain of today’s political retards’ preferred boogieman Russia?I have not read the book so I guess, if it doesn’t do the book justice, I can somewhat understand not liking it. However, to me, this was a decent, not spectacular but decent, two hours of entertainment. Decent action, decent speed and (with the exception of O’Brien) decent acting."
    },
    {
      "rating": "6",
      "text": "A movie that is mediocre in just about everything. Enjoyable enough within the moment, but utterly forgettable afterwards."
    },
    {
      "rating": "3",
      "text": "Wooden characters a disjointed plot that at times can't get from one plot line to another"
    },
    {
      "rating": "0",
      "text": "this movie is horrible! I was excited to watch it at first. When they started to speak Arabic it was gibberish. I understand English, Arabic and French and couldn't understand one word. Dylan O'Brien didn't say one word properly in Arabic. The only word he got correct was Salam (hi). the Arabic language is so beautiful why did you have to do it like that. the 2nd problem is why do they always make arabs as terrorists when America was in the lead in 2017 (when the movie was made) overall it doesn't have a good plot and this movie makes Americans look dumb. as a Canadian I am disappointed."
    },
    {
      "rating": "0",
      "text": "Basic formulaic unrealistic plot you've seen 100 times before.Dreadful casting, with the high-pitched lead looking like he's just came from a failed boyband audition. He's about as believable as an action hero as a poodle trying to be a pitbull. The fact you can spot his stuntman in several action scenes doesn't help."
    }
  ],
  "recommendations": [
    "london_has_fallen",
    "the_equalizer",
    "jack_ryan_shadow_recruit",
    "surrogates",
    "the_kingdom",
    "the_old_guard",
    "shooter",
    "the_november_man",
    "triple_frontier",
    "infinite",
    "the_equalizer_2",
    "elysium",
    "taken",
    "mile_22",
    "sabotage",
    "the_purge_election_year",
    "the_book_of_eli",
    "wrath_of_man",
    "bloodshot",
    "the_ice_road",
    "jonah_hex",
    "hitman_agent_47",
    "the_accountant",
    "the_mechanic",
    "the_gunman"
  ]
}