{
  "id": 1558,
  "title": "American Wedding",
  "starring": [
    "Jason Biggs",
    "Alyson Hannigan"
  ],
  "runtime": 103,
  "genre": [
    "Comedy",
    "Romance"
  ],
  "description": "With high school a distant memory, Jim and Michelle are getting married — and in a hurry, since Jim's grandmother is sick and wants to see him walk down the aisle — prompting Stifler to throw the ultimate bachelor party. And Jim's dad is reliable as ever, doling out advice no one wants to hear.",
  "releaseYear": "2003",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/pCO3lJv2PzPkJty29APxCVSjyoE.jpg",
  "categories": {
    "plot": 8.0,
    "acting": 7.75,
    "ending": 7.666666666666667,
    "soundtrack": 8.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 8.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "9",
      "text": "This movie had me laughing so hard that I could barely breath at times.Stiffler is the man in this movie! Hilarious!!"
    },
    {
      "rating": "8",
      "text": "American Wedding is definitely a worthy addition to the American Pie series. One of those movies you can watch several times and still laugh."
    },
    {
      "rating": "7",
      "text": "About as good as American Pie 2, the dialogue and banter between Finch and Stifler make this movie as funny and charming as it is. It's a good, funny film and a welcome addition to the series"
    },
    {
      "rating": "7",
      "text": "$,$,$,$,$,$,$,$,$,$,$,$,$,$,$.$.$.$.$.$.$.$.$.$.$.$.$.$.●》●》●》●》●》●》●》●》●》●》●》●》●》●》●》●》"
    },
    {
      "rating": "7",
      "text": "●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_"
    },
    {
      "rating": "8",
      "text": "Laugh out loud hilarious from start to finish. Sean William Scott plays Stifler so perfectly, even one of the highest standards won't be able to contain their laughter."
    },
    {
      "rating": "8",
      "text": "Another Fun and entertaining entry to the most amazing series!it was not as great as prequels but good movie!the music and soundtracks were phenomenal and great,the acting was amazing love the new characters Cadence,the Gay guy and the whole family,the story was usual decent.the situations right from the start was multiplied than prequels it felt little overdone but it was awesome,right from the start the propose scene,the dog's intro the start was hilarious AF,the Stifler was literally the legendary character ever the guy's laugh and the jokes were amazing as hell he was great entertainer,the whole side story of Stifler's caring about wedding and the ignorance of Jim and the efforts till last he was literally great throughout the movie the Gay bar dance,the cake scene it was disgustingly awesome,the bachelor party and the whole faking character thing with Cadence with at the end the flower's scene it was the awesome thing,the shave thing and the grandma's thing was disgustingly hilarious the ending was literally amazing with again Stifler's mom entry and Finch's move with the 2 dudes watching it was awesome as hell,Overall it was little disappointing as per the wedding of Jim's and the 1 member in group was missing and it was't even mentioned anywhere and all other characters were have to be there Nadia,Sherminator and all the other one's couple's but no mentions of them,apart from that it was weakest in franchise but it was damn hilarious and fun and entertaining movie!"
    },
    {
      "rating": "7",
      "text": "American Wedding keeps the franchise balanced. The whole American Pie series just continues to produce consistently solid comedy films. There is really nothing out there like the American Pie films. I like that they took more time to focus on Stifler in this movie it was like he was the main character after being in the backseat in previous movies. American Wedding is full of all the crude, gross but creative humour you can stand and in the end you'll never feel as if you've wasted your time."
    },
    {
      "rating": "7",
      "text": "Almost as good as the original, Wedding decides to have Jim and Michelle marry in this one, and what happens at the wedding is purely hilarious and comical genius. Of course, the movie is raunchy and crude as usual, but to be honest, we're all used to it by now."
    },
    {
      "rating": "10",
      "text": "THIS MOVIE WAS SOSOSOSO FUNNY! In the beginning, you might think that this movie is going to really suck, but it won't. In the middle, it gets really funny."
    },
    {
      "rating": "6",
      "text": "The third installment may be to true American Pie fans, but it may easily disappoint of how sloppy and incoherent that this sequel turned out to be compared to others."
    },
    {
      "rating": "9",
      "text": "For me this is one of the best comedy films I have seen. I really like the American pie films and this one is the best in my opinion. There are so many funny moments, especially scenes involving stiffler. The dance scene in the night club is absolutely hilarious. If you want to watch a film that has a feel good vibe and will keep you laughing I would highly recommend watching."
    },
    {
      "rating": "4",
      "text": "With the participation of Shannon Elizabeth, \"American Wedding\" would've had a better monkey wrench than dead flowers to thwart the wedding. Herz suggests what a Nadia-fueled \"American Wedding\" would look like during a pre-wedding jitters rap session between Jim and his dad. Sean William Scott owns this movie. Giving Jim dance lessons was a nice touch. When Stifler eats dog poop, it's funnier than it has any right to be because he's a well-developed character."
    },
    {
      "rating": "5",
      "text": "Clearly worse than the 2 movies before, especially because Stifler is so childish and overacted and this character has a major role in this part. The humour is not so great also anymore."
    },
    {
      "rating": "10",
      "text": "I laughed, I laughed some more, I almost threw up, and laughed some more.I gave this movie a 10 out of 10 because for a comedy it made me laugh continuously. Not a minute was wasted. Even if the situation was totally absurd, as many were, the conviction of the actors in their roles was enough to keep it going. Stiffler and Finch's rivalry reached new highs and lows in this one as they compete for the affections of Michelles virgin little sister Cadence. Fred Willards addition in this third movie was welcome, even if his role was subtle.I can't think of anything bad to say about this movie. The plots were simple but believable.. How complex can a wedding story be anyways. It made sense, it was funny, it was definately funnier than the second american pie movie.. im not going to say it was funnier than the first but I definately laughed longer and harder in this one. Well done. Plus Alyson Hannigan is somehow getting hotter as the movies progress.."
    },
    {
      "rating": "6",
      "text": "I thought this was better than the 2nd but still doesnt touch the 1st one.  It's interesting to see the people still get into stupid situations."
    },
    {
      "rating": "8",
      "text": "+÷+÷+÷+÷+÷+÷+÷+÷+÷+÷+÷+÷+÷÷+:;:;:;;::;;:;:;:;:;:;:;:;:;:○¡○¡○¡○¡○¡○¡¡○○¡○¡○¡○¡○¡○¡○¡○¡○¡○¡○¡○¡○¡○¡○"
    }
  ]
}