{"id": 3541, "title": "American Pastoral", "starring": ["Ewan McGregor", "Jennifer Connelly"], "runtime": 108, "genre": ["Crime", "Drama"], "description": "Set in postwar America, a man watches his seemingly perfect life fall apart as his daughter's new political affiliation threatens to destroy their family.", "releaseYear": "2016", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/5RSZR8clQh6170hRODWH5yS9nHS.jpg", "categories": {"plot": 7.8, "acting": 8.4, "ending": 5.0, "soundtrack": 5.0, "cinematography": 6.0, "familyFriendly": 3.0, "funny": 4.0, "action": 5.0}, "reviews": [{"rating": "5", "text": "Ewan McGregor's ambitious adaptation of one of the best novels of the 20th century is admirable and nearly makes the grade, but simply feels neutered. Adapting Philip Roth's American Pastoral and doing it justice would be a challenge for any director. For McGregor to decide to take it on as his directorial debut is admirable and shows courage, something desperately needed for directors. Unfortunately, for future follow-ups, adapting an easier and less complex novel may be advised, for fear of McGregor's directorial career turning into James Franco's. A beautifully written novel, Roth's American Pastoral could be turned into a film, but this is not the film. It lacks the nuance, the grace, and poetry of Roth's prose and replaces it with nothing substantial. In spite of the reviews, it is a crushing disappointment to see the film turn out to be largely quite plain.Using Roth's famous Nathan Zuckerman (David Strathairn) to introduce us to this tale of despair and the loss of the American dream experienced by Seymour \"Swede\" Levov. The quintessential American boy, the Swede was a star athlete in high school. Nathan, best friend of the Swede's young brother Jerry (Rupert Evans), reminisces about the now deceased Swede with Jerry at their 45th high school reunion. With the Swede having married Miss New Jersey Dawn Dwyer (Jennifer Connelly) and having a beautiful girl named Meredith \"Merry\" Levov (Dakota Fanning), to go along with the leather glove factory left to him by his father to run, the Swede had it all. He had the perfect love. Beautiful life. Great daughter. Terrific job that let him interact with all of the people he grew up with in a career he had a great passion for. Yet, things for the Swede when his beautiful, but stuttering daughter grows into a leftist radical in the 1960s during the Vietnam War. Painting a mosaic of life and these defining images of the era, Roth created a gorgeous vignette of a novel that showed the quintessential American man have the beautiful facade of his life blown away. In the same breath, he paints a brilliant conceived allegory of America through the Swede. With his infrastructure blown away in the 1960s with his child revolting against the world he had built, his world continues to crumble when nostalgia kicks in for his wife and she wishes to be young once more. An entrepreneurial son of an immigrant, Swede Levov is America and America is him, in all of its gritty and dark details.McGregor does a tremendous job capturing this and exploring those themes introduced by Roth. But, the film feels far too rushed and, again, neutered. It explains these themes, but spells them out to you. The connections and themes are explained through narration at the end by Nathan Zuckerman that largely forces him the points of the novel and the film about how we can never truly understand somebody, no matter how perfect their life seems from the outside. Life is not nearly that neat and all is not what it seems. Rather, the facade of American life was broken in the 1960s and the white picket fence found in the wreckage of the wasteland created by the Vietnam War and ensuing riots. The film simply lacks the nuance of Roth's novel and does not paint this cohesive painting of horror and beauty that permeates the novel. It a film that simply feels cut-off and runs like a highlight of the best scenes from the novel with no connecting thread. This lack of nuance comes from McGregor's inexperience most likely with scenes ending too soon or new ones being added to the novel that serve the sole purpose of explaining what happened.That said, there is still some brilliance on display here is translated from Roth's novel. Again, McGregor does a good job keeping Levov as an allegory for America as a whole. Setting it against these wars and riots is what makes this novel so crucially important and what got it the Pulitzer Prize. Yet, crucial to the tale is Merry. Brought to life by Dakota Fanning, Merry is a very Freudian little girl. In love with her father sexually, she wants him to kiss her life he kisses Mommy. When he refuses, she does two things. One, she deepens her hatred of Dawn for having the Swede's sexual attention. Two, she begins to hate her father for rejecting her advances. What ensues is her spiraling out of control and taking things too far. She acts out through joining anti-war subgroups, violently cursing out Lyndon B. Johnson, and soon becoming an anti-war terrorist bomber that has killed three people. She is a girl that argues everything is political, but for her, everything is sexual. This is all derived of her perceived rejection and prior lust for her father and anger to her mother. As they define America and quintessential products of the American dream with youthful good looks, she seeks to destroy them. How do you destroy a nation? Revolution, bombs, and shattering their innocent image of you. She does this to perfection as she bombs the post office and runs off."}, {"rating": "4", "text": "Ewan McGregor directed and takes the lead as the happy husband (to Jennifer Connelly). He finds his life upended when his daughter (Dakota Fanning) becomes radicalized by her opposition to the Vietnam War and possibly commits a deadly crime. I haven't read the Philip Roth novel, but it it's anything like the film, it's a bleak downer. While the performances are earnest (and that's not necessarily a positive), the leaden pace and extended misfortune just drags it into agony…and not the good kind. McGregor takes himself and the film seriously, but the flatness and extended length of the film never elevates it to any sort of compelling drama."}, {"rating": "8", "text": "Ewan McGregor, Jennifer Connolly, dakota fanning? You know your in for some great acting! Great story in the foreground amidst a historical background. Definitely worth a watch if your in the mood for a great movie."}, {"rating": "6", "text": "About a father who never gave up on his daughter!The book was from the 90s and the story is about the 60s. Narrated from the father's perspective, that's what I think did not work in this film. This is where a film and the book does not synch. Because books are always very detail when it describes a person. In the films, they are just a simple visual where viewers have to focus on those details to have a perfect impression like the book. So I totally point out to the writer who did not quite transformed the point of the storytelling.It is not the parents to decide what their kids want to be. The film opened with a couple ready to get married, arguing with their elders about something. Soon it forwards to a few years where their relationship with their daughter seems not good. Further, they become more distant and completely lose her for the unrest in the society and the nation. But father never gives up. His love and care for her leads the way and what comes later is even more disturbing before it all ends.It was Ewan McGregor's directional debut. I don't think he would try it again, not any time soon. But I would appreciate his quality of filmmaking. He only needs a better writer and the screenplay. I also think, he should not direct himself. I never considered him a best actor. I yet to see his performance. The film was not strong enough, if you are from outside the United States. Because what they call this 60s revolution was more a misunderstood by the young people. Particularly that religious thing, they were misled and spoiled their lives. So, instead of focusing that, the film centred on a father-daughter relationship. That is why it was a decent film. Otherwise I would have rated even wrose.5.5/10"}, {"rating": "3", "text": "Having not read the source material, I can't speak to how faithful this film is to the original story. However, with that said, it's easy to spot an adaptation where something has obviously been lost in translation, and that's clearly the case in this muddled, poorly written, overacted mess of a movie. And, as for Ewan McGregor's directorial debut, let's just say that he'd be better off doing his work in front of the camera instead of behind it if this is any indication of his capabilities."}, {"rating": "10", "text": "Partiendo de la base que todos tenemos nuestro propio mundo en la cabeza, American pastoral nos transmite las consecuencias que pueden llegar a tener la falta de enseñanza política hacia nuestros hijos. Ya que si nosotros no nos hacemos cargo del delicado poder de nuestra comprensión de la vida y se lo transmitimos sanamente, otros pueden aprovecharse de su inocencia haciéndoles hacer cosas que pueden dañar para siempre a esa persona y todas las que la rodean. Hay que tener especial precaución a la hora de ver semejante film, ya que es necesariamente explicita acerca del mensaje que quiere brindar al espectador. No esperen una película ordinaria porque esta definitivamente no lo es. La humanidad necesita de mas películas con esta clase de mensajes."}, {"rating": "9", "text": "American Dream that has gone wrong. Picture perfect couple (Ewan McGregor, Jennifer Connelly) has a troubled child. At first the girl has a stuttering problem but growing up and reaching puberty, there is no denying that she wants to be nothing like them. And then it gets much worse...Don't worry, it's not a horror movie or thriller although the summary may hint at that. To put it really shortly, it's a family drama.Also starring Dakota Fanning (the daughter as adult), Molly Parker (as her psychotherapist), Uzo Aduba (Crazy Eyes from \"Orange Is the New Black\"!), Valorie Curry, Peter Riegert, David Strathairn. There are a lot of good actors movie although McGregor's character is firmly in the center of it all.This is gonna be the kindest review of \"American Pastoral\" you will probably read. Critics seem to hate it and viewers will likely stay indifferent, or not praise it highly. But me – I'm loving it! To really understand what Ewan McGregor's directorial debut* is all about, you must be interested in watching and deciphering it as a parable, or simple story which includes a hidden moral or spiritual lesson.On more superficial level, \"American Pastoral\" can be watched just as a family drama set in 1950-60's USA. This way, it's a functional if uneasy viewing which makes you fathom something bigger lurking somewhere around the corner but not quite appreciate it fully.On deeper level it's about how difficult it really is to be flexible to the world and life around us. It's very human to long for freedom and try to place everything in boxes at the same time.The deeper meaning here can unfold by relying on several different frameworks – psychoanalytical, just intellectual or spiritual / symbolic. The viewer's personal approach will, of course, be highly dependent on one's general world view, be it esoteric or rational (all things are ultimately explainable by science and reason), or somewhere in between. I say \"American Pastoral\" is most enjoyable from spiritual viewpoint. Actions and the behaviour of the characters make the most sense and seems most understandable and human, if one concentrates on WHY we do things we do. If one only view causal relationships – he/she did it because of the past event x or y – the whole story loses a lot of its colours and shades.The real magic here is how Ewan McGregor, with the help of all his cast and crew, has managed to make the movie work on every level you choose to see it. One may not particularly enjoy approaching \"American Pastoral\" just rationally as many critics have done. But the movie still has a strong sure sense of style, both in visuals and storytelling. This also works on two levels. Some see the movie as comical and theatrical, and characters as caricatures. At the same time, all this can convey so much emotion and sharp little observations about everyday life and relationships, that one can't help but be delighted during at least some moments. Just like reading a good spiritual book. I liked all the actors and Ewan McGregor is my long-time favorite. But especially powerful are Dakota Fanning and Valorie Curry, both evil and innocent at the same time.It's not often that movie manages to talk to me so directly and arouse emotions so strong as \"American Pastoral\" did. This is one of my big favorites from 2016 so far. It may surprise that McGregor has such a sure hand as a first-time director of a complex movie. But he has always been versatile and has starred in similarly dark and complex movie already, 2003's forgotten little gem \"Young Adam\".What DOES surprise is the fact that McGregor was not the original director and the man behind all this. As a director, he stepped in at the last minute after Philip Noyce left the production!I have planned on reading the works of Philip Roth for over ten years or so. Still haven't done it somehow. After seeing \"Pastoral\", I want to do it even more.* I know, McGregor has also co-directed 1999's \"Tube Tales\" but he only had a segment in anthology movie. \"American Pastoral\" can be still called his real debut as a movie director."}, {"rating": "8", "text": "Incredibly sad movie about parents losing their child to political ideology in the US in the 1960s and their inability to find her and bring her home. Unlike a lot of critics I found the movie very moving. I hadn't read the book so I wasn't being critical or judgemental about whether the film had captured the essence of the book. Which is probably a good thing. And as a father of two daughters myself I could empathise with how difficult it must have been to have lost the love of a daughter and can understand that you would never give up hope of finding her and rescuing her from whatever predicament she was in. I thought the acting was pretty commendable as well. Brave stuff by Ewan McGregor in his directorial debut. It is difficult to watch at times but worthwhile."}, {"rating": "6", "text": "Tiene una trama simple pero que resulta ser profunda, y tiene buenos actores."}], "recommendations": ["the_white_tiger", "leave_no_trace", "disobedience", "dead_poets_society", "legends_of_the_fall", "the_reader", "nomadland", "a_united_kingdom", "first_they_killed_my_father", "the_glass_castle", "minari", "the_imitation_game", "american_beauty", "the_book_thief", "call_me_by_your_name", "the_boy_who_harnessed_the_wind", "the_lost_city_of_z", "the_young_messiah", "20th_century_women", "the_other_boleyn_girl", "green_book", "nine_days", "silence", "personal_shopper", "just_mercy"]}