{
  "id": 2103,
  "title": "American Traitor: The Trial of Axis Sally",
  "starring": [
    "Meadow Williams",
    "Al Pacino"
  ],
  "runtime": 107,
  "genre": [
    "History",
    "Drama"
  ],
  "description": "The life of American woman Mildred Gillars and her lawyer, who struggles to redeem her reputation. Dubbed “Axis Sally” for broadcasting Nazi propaganda to American troops during World War II, Mildred’s story exposes the dark underbelly of the Third Reich's hate-filled propaganda machine, her eventual capture in Berlin, and subsequent trial for treason against the United States after the war.",
  "releaseYear": "2021",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/eB6IprCYs6EQE9I6EBScsa7Bmad.jpg",
  "categories": {
    "plot": 4.0,
    "acting": 4.0,
    "ending": 4.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 5.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "5",
      "text": "Axis Sally was the name of the character who broadcast entertainment and Nazi propaganda to Americans at home and in the military during World War II. This film follows the woman (Meadow Williams) who was brought back to the States to be tried for treason. Williams’ portrayal is flat, lacking any real charisma as Sally or much emotion as the real person. However, it’s Al Pacino as her lawyer, who gets to soak up all the attention with his now-typical crusty eccentric portrayal. The narrative jumps regularly between the Berlin events and the US trial (and how did she maintain access to all that makeup and those many dresses while in prison?), but never creates much dramatic momentum. It’s interesting as a historical curiosity, but rather lackluster as a movie."
    },
    {
      "rating": "4",
      "text": "A less overly sympathetic portrayal would have made for a more compelling film. The film biggest mistake is that it fails to truly unpack the main character's motivation for the treasonous act.Also, the casting of the lead could have been better. There's a story worth telling here. Unfortunately it was poorly told. In the end it was like watching a rushed film adaptation of a Danielle Steel novel."
    },
    {
      "rating": "3",
      "text": "American Traitor: The Trial of Axis Sally is a new drama film directed by Michael Polish. It is a 2021 movie and we are so excited about this war movie. And one of our main reason is Al Pacino who is one of the main characters of this film.the cast is one of the main reasons for watching American Traitor. Al Pacino as James Laughlin, Meadow Williams as Mildred Gillars, Swen Temmel as Billy Owen, Thomas Kretschmann as Joseph Goebbels, Mitch Pileggi as John Kelly, Lala Kent as Elva, Carsten Norgaard as Max Otto Koischwitz are Drew Taylor as Randy the main characters of the movie. American Traitor 2021 distributed by Vertical Entertainment and Redbox Entertainment and It release on May 28, 2021.so we can watch this movie right now from the digital platforms."
    }
  ],
  "recommendations": [
    "denial",
    "richard_jewell",
    "the_hurricane",
    "mary_queen_of_scots",
    "wall_street",
    "42",
    "all_the_money_in_the_world",
    "arbitrage",
    "jackie",
    "darkest_hour",
    "black_mass",
    "motherless_brooklyn",
    "the_godfather_part_ii",
    "the_hunt_for_red_october",
    "platoon",
    "the_patriot",
    "judas_and_the_black_messiah",
    "the_theory_of_everything",
    "lincoln",
    "the_post",
    "the_last_king_of_scotland",
    "the_judge",
    "conspiracy_theory",
    "my_salinger_year",
    "the_imitation_game"
  ]
}