{
  "id": 3058,
  "title": "American Hustle",
  "starring": [
    "Christian Bale",
    "Bradley Cooper"
  ],
  "runtime": 138,
  "genre": [
    "Drama",
    "Crime"
  ],
  "description": "A conman and his seductive partner are forced to work for a wild FBI agent, who pushes them into a world of Jersey power-brokers and the Mafia.",
  "releaseYear": "2013",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/z6O1KDhfWDTm5ZBr6Ovr0eg8LqO.jpg",
  "categories": {
    "plot": 6.543859649122807,
    "acting": 7.283333333333333,
    "ending": 5.75,
    "soundtrack": 6.8,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 7.642857142857143,
    "action": 10.0
  },
  "reviews": [
    {
      "rating": "10",
      "text": "David O. Russel proves once again how good of a director he is. The acting is also hugely strong, most notably from Jennifer Lawrence and Christian Bale. This is a sure bet for the Oscar race and as a whole its just a fantastic film, beautifully acted, vibrantly filmed and if you're a fan of Silver Linings Playbook or other O. Russel pics you'll love this film."
    },
    {
      "rating": "9",
      "text": "If you're a lover the Silver Linings Playbook cast, they're pretty much all back in this film. I'd heard a ton about the ABSCAM scandal through out my youth, so I'm happy that Russell decided to bring the story to life in such a hilarious fasion.  Cooper isn't as amazing as you'd like him to be here (he needed to tone down the mania just a bit), but Christian Bale, Jennifer Lawrence, and, especially, Amy Adams carry the weight of this film. And yes, lest I forget, Renner is brilliant. I'd also like to specifically call out the music as dead-on perfect.  The film feels a touch long, but you really can't go wrong with this movie."
    },
    {
      "rating": "2",
      "text": "You are kidding me. This movie is one of the best? Odds-on favorite for best picture? Who are these professional reviewers? Ahh, yes, they are of that postmodernist breed who like nonsense disguised as cinematic art. Sorry, but this was a mess. To start you had three character narration tracks, Irving, Richie, and Sydney all had their turns--a director's shot at cutting-edge experimentation that was just stupid. Then there was the uneven smattering of Pulp Fiction-like time exploitation which just made it disjointed. The main blight was this now typical fixation with showcasing people doing stunningly insipid things then forcing us to gaze at others trying to cope in wildly emotional ways. This drives me crazy. The attempt at some penetrating authenticity with mere random and painfully distended melodrama was so contrived I just want to puke at the screen. You saw the same thing with Silver Linings Playbook and I hated that movie for the same reason. Yet I keep reading how David O. Russell is so wonderful, so I thought I'd give him another chance and see if this would be different. It wasn't. It gets a \"2\" rating because it did get tepidly interesting with the mob involvement there for a bit, as well as some of the con artist twists. Other than that, boorishly silly to the hilt"
    },
    {
      "rating": "0",
      "text": "The critics that ruined my Christmas.  It would have been hard to live up the all the reviews, but this movie was boring.  It's not a 1, but certainly not a 10.  There was no buzz leaving the theaters, and the discussion in the car was how silly the plot was.  The characters would have been better served in a Saturday Night Live skit.  They were all kind of over the top and silly."
    },
    {
      "rating": "9",
      "text": "Another incredible ensemble from David O. Russell. He's once again taken a dark theme and somehow made it comedic. I applaud David O. Russell and his wonderful cast of bandits. Amy Adams and Jennifer Lawrence once again prove their worthiness."
    },
    {
      "rating": "10",
      "text": "I'm just scratching my head looking at these comments complaining how silly and over the top everything was.\rUm, you people are aware this is a comedy, right? In the words of the Joker: \"Why so serious?\""
    },
    {
      "rating": "8",
      "text": "What makes this movie unique is the concentration on the characters which reveals to us their complexity by providing general but deep qualities on each character that allows us to go deeper and conclude more characteristics on these tremendous characters which makes them even more real. Everyone stuck in his own bubble which is holding him/her from moving on and enjoying life. Both main characters in search for something that will help them get over they're problems which is love. One enjoying what he does, meeting another who's running away from his past and saving her life only to get into more trouble. Throughout this movie, various stories are taking place at once, with various characters who are dying to make a change in their life. American Hustle is mainly about the characters (and that's why the four actors are nominated for the Oscars) also showing us various layers of that society at that time...One of the best movies this year."
    },
    {
      "rating": "6",
      "text": "A film with good acting, and nice cinematography. For me at least, the script and story don't completely come together, and we are all kind of left with a \"So what?\" feeling at the story's conclusion. As a side note, while Jennifer Lawrence puts on a great performance, I felt she was completely miscast in this role. Overall, American Hustle is a fun Saturday night thriller as opposed to a cinematic gem."
    },
    {
      "rating": "10",
      "text": "Anyone who's seen \"Silver linings playbook\" will know it's a David O. Russel movie right away. Everything about this movie was super-great!! The amazing ensemble cast (except for Bradley Cooper) was the best I've seen in my life! I wish Russel would've made more movies."
    },
    {
      "rating": "4",
      "text": "This film got nothing new for the ones who commonly watch movies at all. Big Hollywood cliché. Slow-motion desnecessarily, characters with no sympathy and not \"deep\" enough, script with no originality... The only thing I can say is positive about this is the envolvement with the main (Bale, Amy Adams, Cooper and J. Lawrence characters) just it. And probably this piece of s**t will win some Academy Award. Shameful..."
    },
    {
      "rating": "1",
      "text": "One of the worst films I've seen in theaters. The characters were completely unlikeable, I wasn't sure if I should root for the cop or the crooks, the story was boring and I didn't see a point to Louie CK and Jennifer Lawrence even being there. It seemed like they were there just because they were big names and not because they fit the role.\r If it wasn't for Bale and Amy Adams the movie would have been a complete wash. I almost left the theater twice during the movie and I only stayed to find out how it ended for Bale and Adams."
    },
    {
      "rating": "10",
      "text": "I'm a big fan of Silver Linings Playbook, and I wanted to watch this movie when I knew that the same director, David O. Russel, directed this one, the movie is really amazing, the cast it's incredible, mainly for Jennifer Lawrence, I really expect that the win the Oscar again... American Hustle it's one of 2013 best movies."
    },
    {
      "rating": "8",
      "text": "Great cast.  Great acting.  Good story.  The only knock I have is the movie is a bit slow and methodical in its pace.  Not very often the entire ensemble cast of one movie could be nominated for an Oscar since all the performances were strong across the board.  Good movie."
    },
    {
      "rating": "9",
      "text": "American Hustle is energetic, funny and perfectly cast. It features smart twists & turns from a very smart script and is directed stylishly by David O. Russell."
    },
    {
      "rating": "0",
      "text": "Trying to rip off Karen from Goodfellas.....badly! I can't for the life of me understand how this film got such good reviews. Bad. Just BAD.\r The plot of this film started as one thing and ended in another but tried to make out a kind of Usual Suspects twist at the end. Rubbish pure rubbish."
    },
    {
      "rating": "6",
      "text": "I thought that the acting in the movie was great, and there were a lot of great parts to it, but overall I feel like the movie doesn't come together completely. The ending, for me at least, left me asking \"so what?\". I just felt a lack of satisfaction coming out of the theater, and while it delivers in most regards, it failed to capture me and win me over."
    },
    {
      "rating": "9",
      "text": "“American Hustle” stars Bradley Cooper, Jennifer Lawrence, Amy Adams and Christian Bale in this 2  hour film directed by David O. Russel who co-wrote it with Eric Singer. This is a fast moving and intelligently writtten story of con men (and women) seeking to outsmart each other. This film is a viewer’s delight  as we watch the intricacies of the plot unfold. Although Mr. Cooper, Ms. Adams and Ms. Lawrence give stellar performances, the kudos really must go to Mr. Bale who plays his part with credibility and passion. Acknowledgments must also got to Director Russell who, despite the obvious length of the film keeps it well paced and easy to watch. I give the film a 9 rating  with more of the film sure to be talked about at Oscar time in February 2014"
    },
    {
      "rating": "10",
      "text": "“American Hustle” may have an awkward start, especially as it takes a moment to get used to Russell’s style and tone, but once “Hustle” finds its footing it really takes off and is one of the most intelligent and enjoyable films of the year."
    },
    {
      "rating": "10",
      "text": "You will love this film. David O. Russell is one of our greatest directors and he did it once again. An amazing cast with an amazing screenplay; you wont be disappointed."
    },
    {
      "rating": "9",
      "text": "It's the late 70s: every man in this movie has ridiculous hair, while the women are glamorous and hot. A con man (Christian Bale) teams with his soul mate (Amy Adams) and they end up forced into a scam with a hothead FBI agent (Bradley Cooper). The transactions are complicated by a mouthy wife (Jennifer Lawrence) and an earnest politician (Jeremy Renner). Despite how complicated it sounds, this film is really about the characters and the brilliant actors who made the bold choices. Every actor has created memorable, enjoyable individuals and their performances are potent (Lawrence is once again a revelation). Co-writer/director David O. Russell has crafted a richly observed, compellingly complex and sometimes funny vehicle for them to hustle."
    },
    {
      "rating": "10",
      "text": "Fantastic cast, especially Christian Bale and Amy Adams.  David O. Russell is one of the best filmmakers working today.  Jennifer Lawrence gives a very memorable supporting performance that deserves every bit of praise she's received."
    },
    {
      "rating": "9",
      "text": "There are so many funny movies this year that are getting so much praise this award season, and \"American Hustle\" is one of them. It's a fun, funny and entertaining good time. It's filled with crap loads of great performances (which you come to expect from a David O. Russell film), an interesting enough story and great humor. While at times it may feel like its way more ridiculous than it already feels, it's still a great time and one that shouldn't be missed. I give it an A-!"
    },
    {
      "rating": "3",
      "text": "The very messy plot should be about a convoluted scam played by a couple of swindlers, “forced” to work for the FBI. The swindlers happen to be Irving (Bale) and Sydney (Adams), also involved in a torrid extramarital affair.  Irving is married to Rosalyn (Lawrence) a single mum, whose son he adopted. Like most married men, he stalling divorce because the “child would suffer”.\r Irving and Sydney get busted by Richie (Cooper) an ambitious FBI agent who forces them to get bigger fish into the agency net. Or, at least this should be the plot, because it gets derailed in all directions, none of which even remotely interesting.\r It feels like the whole movie is a scam played on the audience, starting with Lawrence. I understand that she is the present ”Hollywood-IT-hot” girl, but her part is bloated out of proportion, when her character was at best a marginal one.\r She is constantly on screen, shouting all her lines and going on endlessly about her relationship with Irving. Who cares? I wanted to see a movie about a hustle, not a dysfunctional couple in action, especially when their dysfunctions are not the core of the plot. We also get plenty of the Sydney-Richie relationship (and again, who cares?)\r Everybody is exceedingly verbose, and situations that would require at most 30 seconds of screen time drag on for several minutes.  Even considered as a “character study”, the movie still does not work.\r Besides, the “moral” of the story is a murky one and an additional joke played on the audience: whoever makes more money (regardless of their methods) is smarter than anybody holding an honest job.\rCorrupted politicians are portrayed as minor offenders, dealing dirty deeds for the good of the community. Richie is played as a fool, while mediocre Irving and Sydney are glorified as first-class tricksters. Even dumb and insufferable Rosalyn gets a happy ending of her own\r The best thing about American Hustle is the 70’s atmosphere, with some amazingly tacky clothes and a good soundtrack, but it is definitely not enough to save the movie. Unbelievable to think this mess got 10 Oscars nominations…."
    },
    {
      "rating": "9",
      "text": "Overall, a fun film, but it's really all about the outrageous performances! The music and costumes are great, and completely sell the time period. Adams and Lawrence are spicy, Bale is incredible, but Coopers performance is overrated and felt very improvised. Renner is the secret MVP, and plays the best against type. I would see it again on DVD."
    },
    {
      "rating": "10",
      "text": "Ahhhh… Time spent on character development? Sweet!  A plot that never stops engaging the viewer to feel as if they too are in on this thrilling and con?  THANK YOU!  Christian and Jennifer's characters are written to jump off the page…. and they do -from page to screen and right into your heart.. You love them, are shocked by them. have compassion for their pathetic attempts at feeling loved and rooting for everyone as loyalties switch--or do they?  Ms. Adams is outshone by the writing of the other's characters yet she still manages to keep your eyes fixated on her as she delivers an enormous need for approval. Those necklines helped enormously!  Was fashion in the 70's have such revealing clothing? YES! They did!  Poor Bradley Cooper. He really has a lukewarm talent at best. He has technique but no depth, no inner life, no layers to feed his performance. Russell wisely uses that lack of depth to service the character's influence on the story line just as he did in \"Playbook\".  Whenever Cooper's on screen the film loses it's pathos but Adams, Lawrence and  Bale have such an intense incandescent light, nothing survives but the memory of their brilliance. Lucky for Cooper."
    },
    {
      "rating": "5",
      "text": "As a big David O. Russel fan, I had high expectations, particularly after seeing some of the film reviews for 'American Hustle'.  I was highly disappointed with the film.  Although it was very well acted, with an authentically 70's set, there was nothing particularly captivating about the storyline.  The movie never drew me into the film as Russel has in previous past 2 efforts.  It had a couple of funny moments in it, but overall I wouldn't describe it as a comedy.  If you want to see a decent movie, it's worthwhile, but don't expect another 'The Fighter' and certainly not 'Silver Linings Playbook'."
    },
    {
      "rating": "1",
      "text": "Thought this film was utter rubbish, yes acting was good but with little plot to go with.  Took ages to get going and sadly never did. If this wins any awards I am at a loss as to what people find entertaining"
    },
    {
      "rating": "3",
      "text": "A movie perhaps for the bored cinefiles of the world, American Hustle is a convoluted mess with little direction and so much plot that it makes your head spin.  It is different, in that David O'Russell way that might have worked for Silver Linings Playbook but fails when it aims for too much.  It has some great actors, who give it their all but that doesn't really matter when the audience has no idea of what they're doing or why they're doing it.  To give you an idea of what this movie is, I'll say the best part is when Robert De Niro briefly shows up for three minutes and reminds us all of how great Goodfellas and Casino were.  For the rest of the movie I sat asking myself a few questions like: What is going on?  Shouldn't this be considered entrapment?  Man, Amy Adams nipples have been dangerously close to a wardrobe malfunction for like two hours, why does she only wear that one type of v-neck? Seriously, did they just glue her clothes to her nips or something? When will it ever end?'\rThe only redeeming factor to this movie is that it's not the typical, it goes its own way and does its own thing and I'll give it props for that.  I just don't think American Hustle is an enjoyable movie."
    },
    {
      "rating": "5",
      "text": "Based on the trailers I saw I was expecting a 70's version of Oceans 11. What I got was a slow paced film with enough dialog and close-ups for three films. I spent the whole film waiting for something interesting to happen and it never really did. The acting is all good but the story just wasn't that interesting. Also, you'd think that with a 2 hour plus film there would be time to get deeper into the characters but instead the time was used on over extended dialogs that were left in for the academy to get a good look at how awesome the cast is."
    },
    {
      "rating": "10",
      "text": "One of the best films of the year. It's very funny, sexy. The cast is amazing. Christian Bale, Amy Adams, Bradley Cooper, Jeremy renner and Jennifer Lawrence are all great and stunning. They give us a very interesting change. Their hair and their costumes in film are beautiful, sexy and very fashionable."
    },
    {
      "rating": "9",
      "text": "Favorite fun movie of the year  amazing direction, acting, writing\r Christian Bale was especially impressive though the rest of the actors were excellent as well"
    },
    {
      "rating": "7",
      "text": "American Hustle is a film that is extremely over-hyped. Every big-name review site has given this film incredibly generous scores. I saw this and was a tad disappointed, because I didn't feel it lived up to it's hype. However, I enjoyed the film nonetheless. American Hustle centers around two con artists named Irving Rosenfeld (Christian Bale) and Sydney Prosser (Amy Adams). During their long run of scamming people and stealing their money, they are eventually caught by FBI agent Richie DiMaso (Bradley Cooper). Instead of arresting them, Richie devises a plan to use the con artists to bust corrupt politicians. In order to do so, they need to become allies with the mafia, the universally loved mayor of New Jersey (Jeremy Renner), and a man of false importance entitled \"The Sheik\". Along with this, there is a huge subplot involving love among the characters. Sydney fakes love with Richie in order to get closer to him and make him trust her, and Irving cannot decide who to ultimately be with; his crazy and gossipy wife Rosalyn (Jennifer Lawrence) or Sydney. He has a hard time leaving his wife because he loves his stepson Danny. This here lies the first problem with this film. At times there were so many sexually charged scenes I couldn't remember if I was watching a crime drama or a porno. Along with the over-abundance of provocative moments, each character is interesting, there is too much going on in order to become invested in these people. In terms of acting, I had an issue with the actors dropping accents they had. Christian Bale was pretty consistent, but Amy Adams and Jennifer Lawrence dropped their accent frequently. Amy Adams' character also has a fake identity as a British woman with bank connections, however her accent isn't convincing in the slightest and it's hard to see how she conned so many people with such a soft and easily fake accent. Other than accent issues, each actor was very good. Even though the actors were really good, the cast list enhanced the hype factor a lot more, thus bringing the movie down for me more. When I saw Christian Bale, Jennifer Lawrence, Bradley Cooper, and Louis CK (Who had one of my favorite characters) on the cast list, I got really pumped. But that just hurt more when the movie didn't meet my expectations. The movie's writing was enjoyable, however the banter felt very forced, along with trying to replicate what \"The Big Lebowski\" did with explicit banter. Some consider this film a comedy, but it wasn't a laugh-fest the whole way through. Regardless, the moments that were funny hit their mark very well. The soundtrack and cinematography were both stellar, aside from occasionally annoying close ups. Even though I don't believe this film lives up to it's hype or properly utilizes it's two hour run time, American Hustle is a movie with the occasional funny moment, some great use of music, and plot twists up the wazoo that will probably entertain any fan of the crime drama genre."
    },
    {
      "rating": "9",
      "text": "Not perfect, like many critics have been claiming it to be. However, it is most certainly yet another great addition to director David O. Russell's line of films. The story and pacing felt a little stuck at times. But really, it's the acting and the intriguing cast that makes this movie great! Christian Bale puts on a few pounds as the unpredictable con man, Irving. Bradley Cooper's performance as a crooked FBI agent served as one of the more memorable male performances in the film. Amy Adams is daring as Bale's love interest. Jeremy Renner gives a worthwhile goody two-shoes performance as the mayor. And last, but absolutely not least, Jennifer Lawrence gives it her all in what may well be her fiercest performance yet. The plot was also intelligent and well done for the most part, but like I said, it's really the characters that make this movie. David O. Russell even said it himself that he likes to focus on and prioritize characters more than plot. In this film's case, it fortunately worked. So overall, if you're a fan of David O. Russell's previous films (or films with interesting characters,) there's no reason you shouldn't enjoy this, because this may be one of his best films yet."
    },
    {
      "rating": "10",
      "text": "Officially, American Hustle is now my favourite movie of all times. It is hilarious and has everything what a movie needs. The best cast of the year, a great director and an amazing screenplay; this is the best picture of the year."
    },
    {
      "rating": "8",
      "text": "An acting masterclass delivered by talented cast-amazing direction-High-energy comedy  crime film that will catch our heart  there is no moment u will not feel dull-it keep u engaged,superb cast-acting-direction-script that made this HUSTLE Ranks with the year's best movies, CHRISTIAN BALE IS VERY DEDICATED ACTOR-I LOVE IT- THIS YEAR HUSTLE WILL ROCK AT OSCAR 2013"
    },
    {
      "rating": "6",
      "text": "I'm still not sold on this movie. I feel that something is missing. Acting was great, stellar cast, but I expected something a little more. I can't quite put it into words, but I think there was too much tried to put into this movie, needed a bit more suspense leading up to the final twist. Similarly the movie took a bit too long to get moving."
    },
    {
      "rating": "6",
      "text": "Make no mistake, this movie belongs to Amy Adams.  She gives the movie its momentum in nearly every scene and looks gorgeous doing it.  The movie itself lacks real energy; Christian Bale mumbles through most of his screen time and Bradley Coopers character is fired up but his events with his boss come across as unlikely and a little corny.  This looks like a movie that moves and grows to some dramatic climax but just sort of ends with a little clever con.  Interesting choices of soundtrack music, many from the early 70's although this is set in the Disco era of the late 70's.  Overall an entertaining movie which just felt overlong with a small payoff."
    },
    {
      "rating": "0",
      "text": "David. O Russell thinks he is a better director than he really is, and this movie is the biggest evidence of this. The only notable is Amy Adam's performance, but American Hustle is in my opinion a boring, superficial and totally overrated film."
    },
    {
      "rating": "9",
      "text": "From a directing and acting standpoint, American Hustle is a tour de force. This is O'Russell's best film to date (which is no small feat). Like his past work, the character's are dense, intricate, believable, and even relatable. Though all of the actors and actresses are game, Lawrence, Bale, and Renner seemed stand out the most, giving some very exceptional performances. The production design here is truly a feast for the eyes, and it captures the essence of the late 70's impeccably.  The only weakness here is that the story (while good) does not have that real \"grab-and-pull\" quality that so many great stories have. But this is only a minor quibble, when considering all of the greatness that is on display here."
    },
    {
      "rating": "8",
      "text": "A solid cast sort of makes a solid movie! Bale and Adams are wonderful, Lawrence is ridiculous in all the right ways, and Cooper holds his own but is almost just a more manic version of his Silver Linings character. The 4 leads really keep each other on the top of their game, equally complex in character but delivered with varying intensity! However, despite the noise, it's really Renner who ends up being the heart of the film; he is unbelievably fantastic in what is likely one of the best subtle performances of the year that is bound to be severely underrated until the chaos of the other 4 settles. His Carmine is tragically perfect, quiet, and is probably at his best when interacting with Irving (Bale). Even with the pizazz and big performances, Carmine was the only character I ended up really caring about. At the end of the day, this is a good movie with great actors in ridiculous attire and the perfect showcase for their talents, but other than that, it's just an entertaining movie."
    },
    {
      "rating": "10",
      "text": "This is great charter based film that goes from hilarious (Jennifer Lawrence and Chistian Bale) to dramatic (Jeremy Renner and Bradley Copper) in less time than it take Christian Bale to comb his hair."
    },
    {
      "rating": "3",
      "text": "My comment is also in the red zone. I thought AH was a very bad rip off of Goodfellas-but with  no humor, no likable characters, no attractiveness in any of the characters (not actual actors) save a few scenes with Jennifer Lawrence who wasn't given much in the way of dialogue to work with. I was hoping there would be a great soundtrack to at least jump us from scene to scene, but that wasn't even included as promised. It was just too cold outside and too late at night to motivate my daughter or myself to get up and face the freezing walk to the car, so we stayed \"hoping for a moment that just don't come\" I didn't believe the plot, the dialogue, the characters..it just seemed like the most contrived attempt at art I've seen in a long time.  I would have been better off watching the alleged porn in the next theater aka Wolf of Wall Street. Bummer!"
    },
    {
      "rating": "2",
      "text": "Did not live up to the hype. If you liked Silver Linings Playbook (I'm sorry for you if you did), and are a Jennifer Lawrence fan you'll probably like this movie. If, like myself, you do not find yourself in that camp, American Hustle is not worth your time. Unmemorable plot and characters, passably acted at best, and slow (oh god is it slow). Upsides are Christian Bale's performance (funny, nuanced, highly-committed) and the soundtrack."
    },
    {
      "rating": "8",
      "text": "Witty and hilarious, but for some reason, I felt like I was wanting more, mainly in the story.  Cast was great, the two that surprised me the most were Jennifer Lawrence and Bradley Cooper.  Hilarious."
    },
    {
      "rating": "3",
      "text": "The vast majority of critics and (thus?) moviegoers reacted differently, but I actually consider American Hustle to be an effective argument against improvisation in films. Because, whereas I’m a great fan of it when it’s executed amusingly by talented stand-up comedians, unscripted babble can thoroughly blacken a film’s quality – and that’s exactly what happened with this one. Granted, it does have good-looking costumes and set design as well as fine cinematography and editing, and if you find joy in the over the top of over the top portrayal of characters– well, go ahead, watch it. I just think that most of the people claiming to like the film are being overtly pretentious and following critics’ opinions, since American Hustle is a surprisingly boring, annoyingly ridiculous, and not anywhere close to funny film."
    },
    {
      "rating": "10",
      "text": "American Hustle is one of the best films of the year. There's a palpable energy that's undeniable- the love quadrangle between the four main characters is exciting and visceral. It's an emotional roller coaster that's sure to sweep you off your feet."
    },
    {
      "rating": "9",
      "text": "Per il film con cui confermare il suo buon momento creativo, David O. Russell raccoglie gli attori delle due precedenti pellicole e li immerge in una storia di imbrogli e contro-imbrogli (da cui il sottotitolo italiano ‘L’apparenza inganna’) ispirata a fatti realmente accaduti agli inizi degli anni Settanta. Il tutto riporta certo alla mente film come ‘La stangata’, ma lo svolgimento  personale e la mano assai felice così che non si avvertono le oltre due ore di durata malgrado la trama sia tutto meno che lineare. Irving (Bale) e Sydney (Adams) sono due imbroglioni dalla notevole intesa ‘lavorativa’ e sessuale  malgrado la panza e il riportone di lui, Bale  ingrassato di una ventina di chili per il ruolo  che però cercano di non fare il passo più lungo della gamba. Questo non basta ad evitar loro il venire incastrati dall’agente federale Richie DiMaso (Cooper) che, osteggiato dal proprio capo, pensa di sfruttarli per far carriera scoprendo i maneggi di alcuni politici locali implicati nella ricostruzione di Atlantic City. Due sono i fattori che mandano in crisi l’operazione, l’interessamento della mafia alla gestione delle case da gioco  nella persone dal killer Victor Tellegio, un Robert De Niro che, senza comparire nei titoli, fa un’autocitazione dei tempi di ‘Quei bravi ragazzi’ e ‘Casinò’ che  anche un omaggio a Scorsese  e Rosalyn (Lawrence), quasi ex moglie di Irving che  molto meno scricoccata di quanto il suo comportamento faccia pensare, ma  comunque una componente non controllabile. Per cavarsela, Irving e socia danno fondo al loro mestiere e in qualche modo riescono a girarsene fuori, mentre nella rete restano solo alcuni pesci piccoli e il sindaco Carmine Polito (Renner), uno che bene o male ha sempre agito per la comunità e, col passare del tempo, di Irving  diventato amico. Alla fine, sono i delinquenti di professione a risultare più ‘onesti’  morale discutibile e non certo nuova, una delle poche perplessità che il film fa nascere  mentre Richie sparisce dalla scena, scaricato anche da chi pensava di sfruttarne gli eventuali successi. Contrappasso doloroso per un narciso come lui  memorabile la scena con i bigodini in testa per farsi i ricci  tanto remissivo in casa quanto aggressivo fuori in una ricerca di giustizia sbilanciata dall’ambizione. Nei suoi panni, Cooper offre un’ottima interpretazione, forse solo qua e là un po’ forzata, di un altro personaggio con molte più ombre che luci dopo Avery in ‘Come un tuono’:  però tutto il cast che funziona alla perfezione, regalando un insieme di interpretazioni di altissimo livello, tanto che appare davvero difficile citare uno e non l’altro. Va però sottolineato che  a fianco della bravura di Bale, Adams e Renner  si fa notare Lawrence che sembra un’altra rispetto a quella di ‘Hunger games’ e sa sfruttare con notevole efficacia il minor spazio concessole facendo di Rosalyn una figura fondamentale. Questa insistenza sugli attori  voluta dal regista che si  sempre detto molto più interessato ai personaggi che all’intreccio: i caratteri sono infatti disegnati a tutto tondo con psicologie definite anche con l’aiuto degli interpreti che sovente sono stati lasciati liberi di improvvisare sullo spartito di una sceneggiatura di Eric Singer (rivista da Russell) che risale a qualche anno fa. Altrettanta importanza  data alle dinamiche psicologiche fra le varie figure, con la cinepresa che le segue spesso da distanza ravvicinata alternandosi tra di loro per coglierne le differenti sfumature in special modo nei frequenti faccia a faccia: si tratti di scontri a muso duro o momenti di forte tensione sensuale, ogni situazione  svolta in modo da cercare di trasmettere allo spettatore il massimo delle sensazioni. Ne esce un film di gran ritmo che guarda con notevole cinismo, umorismo acido e una punta di amarezza alla società in cui tali personaggi hanno potuto svilupparsi. Al confronto, meno definito  il contesto: la fotografia di Linus Sandgren  bella, colorata come da momento storico e mai banale, ma gli anni Settanta restano sullo sfondo (con più di un anacronismo, vedi ‘I feel love’ nella versione dei Bronski Beat) e, a parte qualche elemento decorativo  i pesanti telefoni, le camicie aperte sul petto gli occhiali a goccia e, soprattutto, i vestiti vedono-non-vedo di Amy Irving  si ha l’impressione che la vicenda sarebbe potuta essere ambientata in qualsiasi altro periodo senza perdere nulla della sua efficacia. Efficacia che ha fatto incetta di candidature ai Golden Globe e minaccia di ripetersi agli Oscar."
    },
    {
      "rating": "3",
      "text": "This movie was a mess. It tried to set up a plot that never ended up happening. The pacing was very slow which would be fine if there was any reward for the two hours of pointlessness required to endure.It wasn't even particularly stylish. On top of that Jennifer Lawrence's accent was absolutely brutal and most of the time non-existent. Metacritic is usually fairly accurate with their scores but this one is miles off."
    },
    {
      "rating": "9",
      "text": "American Hustle continues the rich vain of form that the movie industry has produced over the last couple of years. David O. Russell once again weaves his magic as director in this big cast crime/comedy. Carrying on his fine form from Silver Linings Playbook. It's also a movie that proves big cast names can produce screen chemistry for the ages. The Bale/Cooper character interaction is on par with Newman/Redford or De Niro/Pacino. Amy Adams gave a performance that will no doubt bring a host of accolades and Jennifer Lawrence continues her high standards that like Adams will have accolades coming her way.\r The movie itself hooks you from the off and takes you the audience straight into participation of what is going on. Who is conning who leaves you engrossed. The Sting meets Donnie Brasco springs to mind without going into the movie plot too much and spoiling a very pleasurable movie that needs to be seen without too much talking. All in all American Hustle sets a very high standard for forthcoming movies of 2014 to live up too."
    },
    {
      "rating": "3",
      "text": "American Hustle is a somewhat uneven movie with disappointing and entertaining parts. The movie sagged in the middle with a tangled plot. Performances were generally good, although some seemed like a rehash from last year's Silver Linings Playbook. Overall, American Hustle is not a particularly memorable movie."
    }
  ]
}