{
  "id": 1036,
  "title": "American Pie",
  "starring": [
    "Jason Biggs",
    "Chris Klein"
  ],
  "runtime": 95,
  "genre": [
    "Comedy",
    "Romance"
  ],
  "description": "At a high-school party, four friends find that losing their collective virginity isn't as easy as they had thought. But they still believe that they need to do so before college. To motivate themselves, they enter a pact to all \"score\" by their senior prom.",
  "releaseYear": "1999",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/5P68by2Thn8wHAziyWGEw2O7hco.jpg",
  "categories": {
    "plot": 7.461538461538462,
    "acting": 7.6923076923076925,
    "ending": 4.5,
    "soundtrack": 9.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 6.491803278688525,
    "action": 10.0
  },
  "reviews": [
    {
      "rating": "0",
      "text": "I'm giving this sorry excuse for a comedy half a star because it is the worst in the series. However Jim's dance was funny, Eugene Levy is hilarious as always and the part where Jim ran across the streets to get to his house was funny. It was funny when he jumped and landed in the bush on his lawn. Besides all of that this movie belongs in the trash bin."
    },
    {
      "rating": "0",
      "text": "This film tells the story of four teenagers seeking to lose their virginity before the end of high school. Directed by Paul and Chris Weitz, has a script by Adam Herz and has the participation of Jason Biggs, Chris Klein, Thomas Ian Nicholas and other actors.Sex has long ceased to be a taboo but it's not easy for a parent to discuss this topic with a son or daughter. It's part of life and it happens sooner in our times but there are clear boundaries between a healthy sexuality and a dissolute life. This has always been my personal opinion and I am sure that sex is good since it's lived with awareness, responsibility and maturity. And unfortunately, this message of maturity is totally absent of this film, that seeks to do comedy with immaturity and obsession with sex. For the guys in this movie, fu...ng is what matters, even if with an apple pie! It's the clash between a generation that didn't talk about sex and a generation that only talks and thinks about it, overcoming the barriers of shamelessness and making sexuality an animal obsession and an objective in itself. What saddens me most is to see that our adolescents (both boys and girls) are increasingly look like the characters in this film. Make it a comedy is not funny and doesn't help us to show the error that is to have this mentality. We are creating sexual perverts, and movies like this only contribute and profit from it.This film is the paradigm of teen film, one of the most stupid and insipid film genres created for the seventh art. Decidedly, the movie industry is able to reward us with masterpieces in the same way that we can throw up on the popcorn. Who have children, keep this film (and all it's sequels and spin-offs) prudently away from their eyes for the sake of their proper sex education. And who does not have... see this film only if you are completely brainless and like jokes involving human excreta and body fluids."
    },
    {
      "rating": "4",
      "text": "There are some scenes in American Pie that are amusing. One scene that I found funny was the scene where Jim is dancing for Nadia. He doesn't realize they're being watched on the internet by others. He has a webcam and everyone is watching them through a link. Jim sends the link to everyone so they then have access to his webcam. He's only supposed to send the link to his friend's but he addresses the email wrong. Jim blows his shot with Nadia, then at school the next day everyone knows about his failure. He doesn't catch on to the fact that many people were watching them instantly but he does. Some acting in the movie was well done like Alyson Hannigan as the band geek and Eugene Levy's role as Jim's father. Overall though American Pie fails to be a hilarious, smart comedy. It is mildly amusing but mostly lame due to the crudeness of the sexual content and the gross out gags that misfire."
    },
    {
      "rating": "9",
      "text": "American Pie is one of those teen movies – well… sex comedies that maybe considered to be wacky at so many levels, but the chemistry between the guys and its 90s nostalgia humor really clicks it!"
    },
    {
      "rating": "7",
      "text": "I don't care what anyone says.  I really like this movie.  Yeah it's raunchy but it's funny."
    },
    {
      "rating": "1",
      "text": "this is a porn not a movie basically every 5 seconds someone is having sex or there are boobs this movie is not funny at all im a teenager and i would never want to be do%&he bags like the people in this movie and not to mention most of the jokes are disgusting because people are like puking everywhere and making people drink horse sperm its horrible but ill give it a 1 for the boobs lol"
    },
    {
      "rating": "2",
      "text": "Really america? This is what qualifies as hysterical comedy? An endless stream of sight gags and sex jokes. If you don't want to have to think here is your movie. If you like the same jokes you liked when you were 12 this is your movie. I also recommend you pick up Captain Underpants books, you'll LOVE them! Grow up and get yourself some George Carlin DVD's."
    },
    {
      "rating": "5",
      "text": "Não sou muito fã desses tipos de comédia porém até que chega a ser um filme divertido em certas partes mais não passa disso sendo um besteirol puro e chato."
    },
    {
      "rating": "2",
      "text": "Тупое говно тупого говна. Стереотипные персонажи, тупые клише, несмотрибельная, абсолютно скучная хуйня, которая возможно брала в своё время за счёт shock-value, но как с любым подобным творчеством - это трэш, и в плохом смысле этого слова, ибо не несёт никакой смысловой нагрузки. Собственно, почему зрителю должно быть интересно как какие-то серые личности пытаются поебаться - мне абсолютно неясно."
    },
    {
      "rating": "1",
      "text": "If this is what we call comedy, then this is literally the worst type of comedy I've ever seen. There's no absolute reason to combine a bunch of too many gross things to a film which American Pie fails to make me laugh, instead making me get disgusted because of the clichés that keeps on blowing back and forth. An idiotic movie made by a pair of idiots who had dirty minds at the time for idiots that can keep up a chuckle or two."
    },
    {
      "rating": "9",
      "text": "American Pie is no teen movie we haven't seen before, but its strong performances, huge amounts of heart, lovable characters, and plenty of laughs ;American Pie is a solid and memorable comedy. I give this movie 86%."
    },
    {
      "rating": "3",
      "text": "There is nothing good in this movie expect for Eugene Levy in fact he's the only good thing in this series and if I get any laughs from these movies it's from him, personally I do like the 90's feel of some of the scenes but there is an absence of actual jokes and the style of humour really doesn't qualify as humour at all it's simply trash and there is no plot, it's a waste of time ultimately and has very little entertainment value. 3 stars for Eugene Levy though and the 90's atmosphere that's in some parts."
    },
    {
      "rating": "4",
      "text": "It had it's moments, but even they were crude and irritating in some way. I'm not sure it deserves it's 58 metascore."
    },
    {
      "rating": "10",
      "text": "Thanks to this movie,i have one thing more to remember my young days :DSUCK ME,BEAUTIFUL!"
    },
    {
      "rating": "8",
      "text": "Not funny as American Pie 2 and 3 but the first American Pie tells a introduction. After watching the first American Pie, people will laugh in the American Pie 2 and 3"
    },
    {
      "rating": "10",
      "text": "This is a classic teenage comedy and a personal favourite for me. The cast work together well on a plot with comedy in every scene. Sean William Scott deserves an Oscar."
    },
    {
      "rating": "7",
      "text": "Pure comedy, there is no proper story to follow (only in the sequel), is simply following a story based on the facts of the day to day and laugh with some epic events."
    },
    {
      "rating": "7",
      "text": "I don't care what anyone says. The first American Pie movie is a genuinely good film. It's gross out humor has a very sweet, very thought provoking core that keeps you hooked for the entire movie!"
    },
    {
      "rating": "10",
      "text": "If you hadn't seen this movie yet you should see it right now. Of course im not insisting you guys to watch it if you don't like teen movies but its classic of this kind of comedy.I mean it! This might look little bit stupid because its like a \"stupid comedy\" Thats how i like to call movies like this.Actually they aren't stupid at all it's very hard to create jokes like this and make a movie like this.But I could hardly recommend this movie if you are looking for different kind of comedy something opposite from teens movie like good rated movie with good well known actor and a good storyline or a family comedy because it would be pretty weird watching movies with your children or with your parent (depends who you are). This movie is way different is about teenagers life, andtheir jokes. I could say this was one of the best of this kind ofcomedy i have ever seen! if someone asks for a comedy about teens firstmovie i say is \"American pie\". This movie would be best if you'relooking for something really easy and very hilarious to watch as Isaid already. Thanks for reading"
    },
    {
      "rating": "10",
      "text": "Movie bliss."
    },
    {
      "rating": "10",
      "text": "Pie tells the tale of high school seniors searching for sex, love, and acceptance in the world. Yes, the film is raunchy and crude, but it is also hilarious from start to finish, and has a warm spirit and well developed characters."
    },
    {
      "rating": "7",
      "text": "American Pie came onto the scene shortly before the new millennium, and with the new millennium came a plethora of \"college age\" films. It was not the first of its kind, but it did help shape the way films of the like would be made for years to come. It may be crude and uncalled for from beginning to end, but it has delightful characters, a decent plot-line, and a stellar soundtrack. It is far from a cinematic masterpiece, but it is an easy-going watch for anyone that enjoys a good comedy."
    },
    {
      "rating": "7",
      "text": "People say if you think that this movies jokes are funny that you must have the sense of humor of a 10 year old I disagree. That's exactly how raunchy comedy is."
    },
    {
      "rating": "7",
      "text": "The original American Pie is certainly a classic comedy on the must see list, but it's not the best of the seven American Pie inspired films. Personally, I preferred the second one too the first, as everyone was much more relaxed and knew each other, making the movie flow better. Don't get me wrong, this one certainly had it's funny moments, but in my estimation it wasn't as good as the second one. Jason Biggs  Alyson Hannigan are hilarious, but for all they bring to the table, bad actors like Eddie Kay Thomas and Chris Klein take away, making the good performances moot. American Pie is a classic teen comedy about sex and it ushered in a new era in comedy that's still relevant today. It has the raunchy, crazy, good looking youth we see in today's comedy, but unfortunately also has some really lame jokes and bad acting, that thankful went out with the nineties."
    },
    {
      "rating": "10",
      "text": "i honestly dont understand this score. i rewatched this a few days ago and was howling of laughter. its definitely one of the funniest movies of my generation, and it inspired many movies with similar humour (example: 40 year old virgin, superbad, etc)."
    },
    {
      "rating": "7",
      "text": "A god damned classic that every teenage boy is bound to love. Screw the critics when it comes to movies like American Pie, of course older people will **** all over it because they are just mad they aren't young anymore."
    },
    {
      "rating": "7",
      "text": "This movie shouldn't be taken just as crude etc.: it mainly shows the teens' silly fun. Many teens are \"searching\" for sex, and this movie shows it with funny moments and these moments which you call \"crude\"."
    },
    {
      "rating": "10",
      "text": "One of the best teen comedy movie of all time and a classic now. There are lot of great and embarrassing jokes, the classic one is the warm apple pie."
    },
    {
      "rating": "7",
      "text": "American Pie is one of those movies a bachelor has on his movie shelf, watching occasionally to his pleasure. But, once the missus moves in, that movie is going with the comics, porn, and dirty movies he has.\r Nevertheless, the movie deals with issues concerning teens growing up and finding ways to crave their sexual desires, which we all go through eventually. Also, it is fun and kooky, springing up some very awkward scenes. The message: don't watch this movie with your parents!"
    },
    {
      "rating": "10",
      "text": "I watched this movie two days ago for the first time and I enjoyed every bit of it. It is crude, it is raunchy and it is what started everything we love about comedies. I must watch!"
    },
    {
      "rating": "10",
      "text": "An original raunchy, cheerful teen comedy that has comical, funny and interesting  characters gives you belly laughs and a bit of charm, even though it's cliche'd but the film is self aware of it. The performances by Jason Biggs, Chris Klein, Sean William Scott and Thomas Ian Nicholas are scintillating and comedic gold under the direction of Paul Weitz  (About A Boy). Weitz has perfect comedic timing which elevates the screenplay by Adam Herz. The film's a winner and makes you forget about those other teen genre films, which this film is my favorite high school film and makes you want to be in high school again. Grade A"
    },
    {
      "rating": "8",
      "text": "American Pie is a bag of laughs, it's hilarious, well acted and interesting. It's the story of the typical adolescent teenagers lusting for some sexual experiences."
    },
    {
      "rating": "6",
      "text": "Ortalama bir gençlik filmi, başlarda aşırı derecede sıkılmıştım fakat sonlara doğru kendini çok iyi açtı ve güldürdü. Kendi türü açısından, devrimsel bir film olduğunu düşünüyorum."
    },
    {
      "rating": "7",
      "text": "American pie is a good comedy movie, it's got some jokes which can be hit and miss but the cast are pretty good for what they're given. Also, this movie has some good fun scenes with the gang and the film even passes the vibe check."
    },
    {
      "rating": "4",
      "text": "Has two memorable jokes (the pie & band camp) and that's it. The problem is the rest of the movie is so boring."
    },
    {
      "rating": "10",
      "text": "Simply the best film saga I have ever seen. Far far away in front of Star Wars, Jurassic Park, Lord of the rings or others Harry Potter. It have all what I want from a movie"
    },
    {
      "rating": "10",
      "text": "One of the best comedy flicks of the 90's, if not, all time. It's a timeless classic."
    },
    {
      "rating": "9",
      "text": "a 58 metascore is a travesty. This is one of most realistic comedies of all time, and hilarious."
    },
    {
      "rating": "9",
      "text": "Crude and raunchy, yes but American Pie is/was/and still is one of the funniest teen sex comedies of all time. The cast and the direction make the movie a true gem."
    },
    {
      "rating": "6",
      "text": "American Pie came onto the scene shortly before the new millennium, and with the new millennium came a plethora of \"college age\" films. It was not the first of its kind, but it did help shape the way films of the like would be made for years to come. It may be crude and uncalled for from beginning to end, but it has delightful characters, a decent plot-line, and a stellar soundtrack. It is far from a cinematic masterpiece, but it is an easy-going watch for anyone that enjoys a good comedy."
    },
    {
      "rating": "7",
      "text": "When I first decided to view this film, I didn't expect much. I'd heard it had a big impact on the 'coming of age' genre and the 90's, but I didn't think it would appeal to me the same way it did to others, boy was I wrong. American Pie is a hilarious comedy with a great cast of characters, each with their own over the top personality. Watching these teenagers land themselves in some of the most awkward situations is where a lot of the humour builds in; its defiantly one of my favourite comedy movies of the 90's."
    },
    {
      "rating": "10",
      "text": "Hilarious! BWHAHAHAHAHAHAHA!This movie is lots of fun. It has some offensive jokes in it... VERY OFFENSIVE, but it makes up for it with some romantic scenes as well.The movie is wild and over top with lots of original moments. The best thing about this movie that it's repecting the characters and lets them develop to good and decent people.A very nice feel-good movie. Better watch it with friends."
    },
    {
      "rating": "9",
      "text": "A Classic!it will never get old the one of its kind cult movie!the music was amazing,the story was decent,the acting and the characters were great as hell.the 4 guys and there girls,the Stifler and his mom,the wet pants and the Jim's dad they were awesome as hell.the situations were hilariously awkward and awesome as hell,the starting scene was awesome and gross the signal problem excuse and the pillow hide,the high school setting and the VHS type picture quality backgrounds is like feeling nostalgic!the starting party drinking scene was literally one of the hilarious scene of all time it was funny AF,the whole party and the guys they were awesome as hell.the wet pants teasing everyone to be man the later reveal at Prom was legendary,the relation build-up in music play was amazing they were great together.the Finch technique and bashing of Stifler and the result in toilet was hilarious,the pie scene and other scenes including Jim's DAD was awkwardly fun and great scenes,the tape getting viral and stripping scene was cheesy and amazing,whole movie was filled with such legendary scenes,the OZ left game for music and her it was sweet and the whole build-up until Prom and whole climax with Stifler's mom and the reveal of Michelle's naughty side it was outta nowhere surprising and funny,after that finally everyone accomplishing there Pact it was amazing and breathtaking,Overall it was the legendary,awesome,hilarious,fun and entertaining movie A Cult classic!"
    },
    {
      "rating": "7",
      "text": "i dont see why people hate this movie so much, its a pretty good movie and had some funny moments"
    },
    {
      "rating": "10",
      "text": "One of the best comedies in the world! I've watched it more than 8 times and it's still a masterpiece."
    },
    {
      "rating": "8",
      "text": "There are only a few complaints mainly some of the main actors give a dull and lifeless performance Jason Biggs and Seann William Scott are the main highlight. Its a very very funny movie not only is it a comedy but you can connect with the characters even though they were most likely 30 years old playing high school kids, you do kinda feel like they are in high school. I say any like teenager can watch this and have a great time with it"
    }
  ]
}