{
  "id": 2252,
  "title": "American History X",
  "starring": [
    "Edward Norton",
    "Edward Furlong"
  ],
  "runtime": 119,
  "genre": [
    "Drama"
  ],
  "description": "Derek Vineyard is paroled after serving 3 years in prison for killing two African-American men. Through his brother, Danny Vineyard's narration, we learn that before going to prison, Derek was a skinhead and the leader of a violent white supremacist gang that committed acts of racial crime throughout L.A. and his actions greatly influenced Danny. Reformed and fresh out of prison, Derek severs contact with the gang and becomes determined to keep Danny from going down the same violent path as he did.",
  "releaseYear": "1998",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/c2gsmSQ2Cqv8zosqKOCwRS0GFBS.jpg",
  "categories": {
    "plot": 9.136363636363637,
    "acting": 9.28125,
    "ending": 8.818181818181818,
    "soundtrack": 5.0,
    "cinematography": 9.333333333333334,
    "familyFriendly": 3.0,
    "funny": 9.0,
    "action": 9.5
  },
  "reviews": [
    {
      "rating": "10",
      "text": "One of the greatest movies I've ever seen, with an amazing, captivating performance by Edward Norton. This film sheds light on issues that many people in society are afraid to discuss or take seriously. A beautifully composed film, a must see."
    },
    {
      "rating": "9",
      "text": "If I had to describe this movie with a word limit this is what I would say:\"A must watch classic\".Unexpected turn of events more than once & Edward Norton makes it even better as he shows his true talent from the beginning.Mixed feelings and a variety of thoughts are brought up by the performances.Definitely 9/10."
    },
    {
      "rating": "10",
      "text": "I think that this movie MUST take 10/10, because of it's thoughts about racism and Nazism. The end is curt, but still amazing... If you haven't seen it, you should. It's changed my feelings about Nazism positively and that's wonderful. Finally don't see it half. You'll dislike it."
    },
    {
      "rating": "9",
      "text": "Now this is a great film. Yes, it is dark, violent, and quite disturbing at times, but it is also powerful, moving, and important. Edward Norton is absolutely phenomenal. He takes this deeply troubled character who comes to realize what is truly going on his life and he knocks it out of the park. He was terrific and put the film on his shoulders and absolutely killed it. The director, Tony Kaye, while he wishes to distance himself from the final product, he did a great job as well. There was some beautiful imagery here and while it may not be the version he intended as the final cut, his vision absolutely is here and the messages it provokes is still powerful. Really, after watching this film, I felt like I had been hit by a ton of bricks. The entire film is so moving and affecting that it really leaves you in a trance once it ends and the credits start rolling. On top of that, there are many powerful scenes, but none as powerful as the final one. It really leaves you on the brink of tears as you try to deal with what you just watched.\r A truly mesmerizing character study with a heart and soul, American History X should absolutely be considered a \"must watch\" for all."
    },
    {
      "rating": "10",
      "text": "I've lost track of how many times I've seen this, but it still makes me tear up in the end, Norton really proves himself to be a powerhouse actor, his passion and raw emotion could scare anyone. One of better movies of 98"
    },
    {
      "rating": "9",
      "text": "Very rough and intense but fantastically acted and written! Music is also awesome and so is the whole movie. Absolutely great with a tragical story but so is life. A masterpiece!"
    },
    {
      "rating": "10",
      "text": "Great movie that brings a lot of reflection over racism and prejudice. Give it a shot, it's totally worth it. Hope you enjoy it as much as I did. I can't see how it got a overall score under 8."
    },
    {
      "rating": "9",
      "text": "This movie is a rough gritty film that deals with modern day Nazi's and how it affects people. It is a very real movie that shows truth and is powerful. It is no the best ever but a very good movie."
    },
    {
      "rating": "9",
      "text": "This movie is a must watch! Yes it's tough,rude and brutal at momments (no spoilers), but i can't deny this movie's amazing story and message to all people!"
    },
    {
      "rating": "9",
      "text": "American History X is one of the most shocking, brutal, disturbing and evil spirited films I've ever seen. Edward Norton gives an absolute masterclass and the two performances he gives either side of his characters transition are both incredibly captivating. There's no doubting how manipulative and pretentious this film can be. And at times the propaganda can even feel persuasively targeted at the audience. But to the films credit that's what makes it so compelling. And ultimately you cannot believe such evil, destructive & irrational people like this actually exist. Tony Kaye's overall direction is impressive and the black and white sequences in particular look stunning. American History X is certainly a tough film to enjoy but personally I think it's essential viewing and an incredibly bold piece of filmmaking."
    },
    {
      "rating": "10",
      "text": "One of the greatest movies of all time. This film is able to look true, real-life evil in the face and humanize it. There are people that actually live their lives like the neo-nazis in this film, and American History X absolutely does not sugarcoat it. It shows the true colors of some of those people in our world, yet it doesn't bash them. It shows their intentions, shows us why they do what they do, and while we don't agree at all with it, we understand. Edward Norton gives the performance of a lifetime in what is a film that everyone should watch before they die."
    },
    {
      "rating": "10",
      "text": "I love this movie. This has to be one of the best films created to date. Edward Norton does an excellent job playing his role as a white supremacist, when placed in prison, learns how all races truly are. It is an eye opening film, that keeps the watcher entertained the whole way through. I enjoyed how it transitioned from color to black and white, to show the difference between past and present.  Highly recommended film for anyone."
    },
    {
      "rating": "9",
      "text": "A fantastic movie. This movie is tough to get through in the sense that there were many brutal violent or rape scenes that were really disturbing, but they were really well shot. The acting by Norton was phenomenal and the best performance of his career. I didn't think I was going to like this movie as much as I did but it was great. I love the style of the movie on how it was shot with some scenes being black and white and the rest in colour a great job."
    },
    {
      "rating": "9",
      "text": "American History X is so ground breaking and ahead of its time. This film is considered controversial because of its content and its language but I feel that it is one of the most important films ever. Edward Norton may have but his best performance ever in this film and Edward Furlong manages to shine yet again at such a young age. I love every aspect in which the story is told, which is in a very unorthodox timeline but is very appropriate for the movie and the film splits between colour and black and white."
    },
    {
      "rating": "10",
      "text": "Just a masterpiece! A new point of view to racism with a worldwide message.Great acting by Norton.Fabulous ending. Really an underrated movie.With a worldwide message.A must see."
    },
    {
      "rating": "10",
      "text": "One of the greatest movies I have seen in a while. Edward Norton played his controversial role so well he could have been arrested for being so racist. The actor who played his brother (John Connor in Terminator 2) was very good as well. The plot was great -- well everything about it was fantastic really."
    },
    {
      "rating": "10",
      "text": "I love this movie so much that even after years of saying that it is impossible to like a movie more than the shawshank redemption I had to admit that American history x is better, the acting is better, the story is better, the narration is better, and most importantly the ending is better. Also, even though the shawshank redemption has some intense, disturbing, and even gritty scenes American history x beats all of them just with the, \"bite the curb,\" scene. Also, I can guarantee you that if you watch the shawshank redemption and then watch American history x not only will you say American history x is better and not only will you be suggesting it to everyone you know, ( Spoilers ahead) but you will also be crying when Danny Vinyard gets killed in the bathroom at the end of American history x."
    },
    {
      "rating": "10",
      "text": "American History X handles racism in such an incredible way. I'm watching in 2018, 20 years later, and, sadly, I feel like this movie could have been released these days. The cast is amazing, Edward Norton went incredibly well on his role, everything seems genuine, from the start to the end. This is, without any doubts, one of the best, and most important, movies I've ever seen."
    },
    {
      "rating": "10",
      "text": "A shocking portrayal of the effects of hate and racism, this film is an absolute must-see.  Not only is it a monolith of its genre, the message it conveys should be heard by all.  Edward Norton never ceases to amaze when it come to sheer talent."
    },
    {
      "rating": "10",
      "text": "62??? really???? This is one of the greatest movies ever made. Edward Norton hit a home run on this film, his acting was amazing. The story was great also. I am still trying to figure out who the heck these 'experts' are."
    },
    {
      "rating": "9",
      "text": "Why did I watch it?\rRecorded this one a while ago while it was on as it's always been one of those films I've wanted to watch, purely based on its controversy, but somehow never got around to.\r What's it all about?\r Norton beefed up for the role A story of two LA neo-nazi brothers, American History X stars Edward Norton and Edward Furlong as Derek and Danny Vinyard. Angry with perceived injustices against the white population of Venice Beach and the nation as a whole on top of the murder of their father by a black drug dealer, the pair embrace the teachings of a local supremeist. The film alternates between the present day and flashbacks chronicling the relationship of the pair as the older brother, Derek (Norton), gets drawn into trouble with the gang and later tries to prevent his younger brother from making the same mistakes as him.\r Should you watch it?\rViolent, powerful and controversial, American History X is a hard-hitting drama dealing with a difficult but realistic subject and at times can be hard to watch. Obviously bearing in mind the subject matter, the script is unpleasant at times but the decision to give both characters a high degree of intelligence was a smart one as it at least allows them to put forward their argument in a reasonably articulate manner.\rEdward Norton is absolutely excellent as the older brother before and after his run in with the law and totally deserved his Oscar nomination. Furlong also deserves credit for his performance and it's disappointing that he didn't go on to better things from this. The black and white older footage, when Norton is at his angriest, adds to the powerful nature of the film and was a masterstroke. Norton's angry, shaven-headed, white and Nazi-tattoo clad torso in black and white is, from a cinematic perspective, a pretty powerful and controversial image."
    },
    {
      "rating": "10",
      "text": "Amazing movie. Someone please tell me that the critics are playing one big joke on the audience by not universally acclaiming this movie. But then again, who cares what they think, anyone who watched this knows it's a classic."
    },
    {
      "rating": "9",
      "text": "One of the most powerful films I've ever seen. Extremely dark,disturbing,sad and enlightening. Edward Norton gives one of the most underrated screen performances ever, as he plays a Neo-Nazi who tries to stop his younger brother from heading down the same awful path he chose. Very visceral movie.Highly recommended."
    },
    {
      "rating": "10",
      "text": "I really enjoyed this film. I loved the acting and powerfull message this movie had. I think this movie kinda helped me with some stuff I was going through as well."
    },
    {
      "rating": "9",
      "text": "\"American History X\" is immensely relevant to modern audiences, perhaps now more than ever. A gritty and provocative drama that puts in graphic terms the dangers of racism and hatred, propelled to greatness by Edward Norton's mesmerising and powerful performance and his interplay with Edward Furlong is one of the most affecting pairings in film. And the ending is shattering no matter how many times it's watched."
    },
    {
      "rating": "9",
      "text": "A truly powerful film, with a message that will stay with you long after the screen goes off, American History X is a force to be reckoned with.  Edward Norton's performance stands out.  It is a very believable and gripping performance.  I love any movie that touches on 'touchy' subjects.  In this case, it's racism.  The thing with this topics in films is that they are very easy to mess up, or become cliche.  Luckily, this movie wonderfully, and shockingly tells the story of a man that escapes the life of a Skinhead, and further tries to prevent his younger brother from falling down the same path.  A classic film, and a must-see for any movie-buff.  9/10"
    },
    {
      "rating": "9",
      "text": "I think one of the most powerful movies i've ever seen. There isn't one dull moment and it draws you in from the first minute. It's insane how buff Edword Norton got for this."
    },
    {
      "rating": "9",
      "text": "A dramatic movie which give us a look in the american skinhead scene but doesn't forget the humans behind their story."
    },
    {
      "rating": "9",
      "text": "American History x of beginning already cemeça with one of the best scenes already seen in black and white (spectacular), for me the whole movie would be like that, it was spectacular in this way, the soundtrack, although not remarkable, does an exceptional job, Delivery what is being proposed in the environment, fear and tension are examples; The script is able to deliver a great story, as the name already says: American History, in the simplest form is a film of American society, but in the way that some do not accept diversity, equality. Edward Norton is in one of the best jobs of his career (if not the best); The film at the beginning proposes an idea, but from a certain point it shows that it is there for something else, a beautiful work of a script well written, I have to praise the script and much; What a story, I swear that in the end it surprised me; Because although I already expected that I did not expect it that way, although there are colorful scenes that stand out even in black and white, I have already praised it once and I will continue to praise the way the black and white scenes became sensational, if The whole movie was in this way would only improve this great work that deserves to be recognized. At the end of it all that guy who people did not believe that would change changed and everything because he saw the other side of the coin, saw that all are equal and despite everything some day we can depend on that person we do not like, we hate and among them we One can see the trust and other things that we do not see in those we treat equally just because they are of the same color; American History x is a work of art and undoubtedly one of the best movies I have ever seen!"
    },
    {
      "rating": "10",
      "text": "Insanely GreatAmerican History X is powerfully directed, Shows the horrors of Neo-Nazis, Amazing performances from Norton and Furlong, and a terrific script."
    },
    {
      "rating": "10",
      "text": "Seriously one of the best movies ever made.  It's a different kind of movie.  It's not one you want to watch over and over.  It's horrible in its depiction of hate but the redemption story is something to behold."
    },
    {
      "rating": "9",
      "text": "I was indulged into the movie from start to finish and I could feel the emotions, from fear, disgust, to anger. And the killing scene literally made me wet with sweat as I could really feel what Danny was feeling. This movie was an experience that I will not forget anytime soon."
    },
    {
      "rating": "10",
      "text": "If one fine morning we discovered that from now on all people are one nation, one faith and one race, then even before dinner we would have invented new prejudices.George AikenIf you haven't thought about serious things for a long time, watch this movie. There will be many thoughts at once"
    },
    {
      "rating": "9",
      "text": "This is one of the best movies, I have ever watched. It was such a nice and different experience. Edward Norton's acting was masterful such that you can understand every little pain he felt and caused. His smile and manner switching before and after was so distinguishing. Movie's cinematography was also amazing; both black and white phase were amazing. The film ran smoothly and hands off to the director for making this movie such a gem along with shocking and unexpected ending. At last, I can say that you can watch this movie anytime."
    },
    {
      "rating": "9",
      "text": "Edward Norton is the best part of this movie, his character grows so much throughout the film as he abandons his racist past to help his younger brother. This is truly a must-watch and a masterpiece."
    },
    {
      "rating": "10",
      "text": "igfygiigguguugugihigfeqwethioplkmnvczvmmkhgfashjiihhiihhiihinihihihihufyfugihihihihihihininjgjbininnkinjgugufyfu"
    },
    {
      "rating": "9",
      "text": "This movie was way ahead of its time when it was released, as it discusses topics such as the neo-nazi movement and racism in the United States, which is still prevalent today. Tony Kaye does a great job in telling this story and discussing these topics, although it may not have turned out the way he intended to. Edward Norton arguably delivers the best performance in his entire career and it's such a shame that he didn't win an Oscar for it, and Edward Furlong also does a great job in his role. I also love how the film tells its story in a non-linear sequence, as it utilizes the black and white cinematography to showcase the flashbacks and cuts between the past and the present. There are some gruesome violent and sex scenes that I found it a bit hard to watch, but it doesn't take away from the experience. A must see classic that still remains relevant today and will go on to become one of the greatest films ever made."
    },
    {
      "rating": "9",
      "text": "●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●:;:;:;:;:;:;:;:;:;:;:;:;:;::;:;:;:;:;:;:;:;:;:;:;:;:;:;:"
    },
    {
      "rating": "10",
      "text": "One of the most powerful films anyone should  and must watch. Edward Norton excels all boundaries of acting  In American History X. For a moment it just feels too real and you forget he's acting.  He lands a remarkable, touching, and true character, struggling to fight for the errors committed in the past."
    },
    {
      "rating": "9",
      "text": "I was introduced to this film in a philosophy class. Undoubtedly one of the best films I've seen in moral issues. I recommend this movie to anyone who has not already seen, in fact, I recommend this movie to human and personal instruction. The film is already being shown in schools, which I think is a fantastic instructional level, but even an adult who still have not seen it have something to learn. In my class there were some tough guys, and even after seeing the film they reflected on the evil they had done until that day."
    },
    {
      "rating": "10",
      "text": "One of the greatest films I've ever seen. Edward Norton is such a fantastic actor and Edward Furlong is such a underrated actor. It's a definite must watch."
    },
    {
      "rating": "10",
      "text": "Breathtaking."
    },
    {
      "rating": "9",
      "text": "American History X is purely brilliant. It dispels and breaks down racism and prejudice without bashing it. Finally, a film that can convey a willingness to open oneself to new ideas, without writing off certain beliefs as taboo or evil. I can't say it doesn't take any side, but it certainly doesn't force any side on the viewer, and instead forces us to assert the situation as a whole. It's just an excellently directed and acted film in every way, and I think everyone should get the chance to witness what it has to offer."
    },
    {
      "rating": "10",
      "text": "Truly great movie, really does depict racial tensions in america to this day (despite being made in 90s)\rGreat acting,setting is great and it is also a really entertaining movie. One of the best"
    },
    {
      "rating": "10",
      "text": "Шедевр! Фильм задевает несколько очень важных тем. Диалоги очень интересно слушать, местами было чуточку затянуто, но наплевать, ведь смотреть на Нортона - это сплошное удовольствие! Прекрасный актёр прекрасно сыграл, браво. Концовка тронула, слёзки наворачивались, но хорошо, что это не зелёная миля :)Замечательный шедевр, рекомендую!"
    },
    {
      "rating": "9",
      "text": "American History X is just as everyone's been wanting since its release to theaters. Now in its way to home media, it's something unmissable for you and only you."
    },
    {
      "rating": "9",
      "text": "Finally got to write a review for this great great movie. It's definitely emotional, touching, sad, but it was a great experience watching it. Amazing performances. The movie says, that a man can change, but actually there need to be a big factor for that to happen  (like getting into prison, kidding). And there are always two sides of the story (the end). Of course, there where some unnecessary things. I promised to my boyfriend to mention it.. That little penis there in the bad room was totally unnecessary, like I laugh a lot to this 5cm hairy thing. :D"
    },
    {
      "rating": "8",
      "text": "With an impressively good performance by Edward Norton, a good and interesting script, interesting characters and an unpredictable and sad ending, American History X is a masterpiece of modern cinema."
    },
    {
      "rating": "8",
      "text": "Its an amazing film. Solid acting by the cast and Edward Norton is amazing in it. The only downside of the film is that its rather graphic and can be off putting a bit."
    },
    {
      "rating": "4",
      "text": "A mess of a film that attempts some kind of message but fails dismally. Just like \"The Green Mile\" and \"Once Were Warriors\" before it, the film tries so hard to get a reaction from the audience that it ends up feeling forced and exhausting."
    }
  ],
  "recommendations": [
    "hotel_rwanda",
    "joker",
    "my_name_is_khan",
    "12_years_a_slave",
    "blood_diamond",
    "brokeback_mountain",
    "12_angry_men",
    "braveheart",
    "revolutionary_road",
    "a_beautiful_mind",
    "the_help",
    "hereafter",
    "manchester_by_the_sea",
    "hacksaw_ridge",
    "empire_of_the_sun",
    "perfume_the_story_of_a_murderer",
    "the_social_network",
    "jojo_rabbit",
    "spotlight",
    "roma",
    "the_last_king_of_scotland",
    "black_swan",
    "raging_bull",
    "fight_club",
    "the_shawshank_redemption"
  ]
}