{
  "id": 4384,
  "title": "Ammonite",
  "starring": [
    "Kate Winslet",
    "Saoirse Ronan"
  ],
  "runtime": 118,
  "genre": [
    "Romance",
    "Drama"
  ],
  "description": "In 1840s England, palaeontologist Mary Anning and a young woman sent by her husband to convalesce by the sea develop an intense relationship. Despite the chasm between their social spheres and personalities, Mary and Charlotte discover they can each offer what the other has been searching for: the realisation that they are not alone. It is the beginning of a passionate and all-consuming love affair that will defy all social bounds and alter the course of both lives irrevocably.",
  "releaseYear": "2020",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/5lx4pUHWZoOKJWsVsvurRRNW9FK.jpg",
  "categories": {
    "plot": 7.428571428571429,
    "acting": 7.0,
    "ending": 6.0,
    "soundtrack": 10.0,
    "cinematography": 6.0,
    "familyFriendly": 3.0,
    "funny": 5.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "2",
      "text": "Tried to be Portrait of a Lady on Fire, Failed even to become Ammonite.The great chemistry makes the best seconds of this film between Kate Winslet and Saoirse Ronan. But those seconds are lost in a bad script that doesn't know how to make a believable relationship."
    },
    {
      "rating": "5",
      "text": "Kate Winslet plays a sullen fossil hunter on the cloudy coast of 1840s Lyme, England. Saoirse Ronan is the young woman who comes to the sea for convalescence. After a halting start, their relationship becomes intense and somewhat explicit for an art film. Winslet maintains a dour demeanor throughout (hardened like the rocks she studies), while Ronan manages to evolve her character. Pensive shots of shells and bugs are peppered throughout the deliberately-paced drama. While there’s potential for period beauty and passion, there would have been more opportunity for emotional effect if the pacing wasn’t so introspective."
    },
    {
      "rating": "4",
      "text": "For a romance story, this was very emotionless, and the way in which it forces that same romance can't avoid to show the thinness of the narrative.Certainly both actresses try to do the best they can with the script that was provided to them and they're the primary reason why people should give this film a shot, but even the way their romance ''blooms'' feels as a consequence of their own boredom, and if they reach that point as a repercussion of their situation, as a viewer it will be very hard to be interested in their emotions. It's inevitable, but undeserved, to compare it to Portrait of a Lady on Fire, but if you want a better film about a romance between two women, or a romance in general, you better watch that one if you haven't already."
    },
    {
      "rating": "8",
      "text": "\"Ammonite\" é um filme que, assim como o extinto molusco que originou seu título, exige tempo. É sensível e pede sua imersão. As atuações não poderiam ser melhores. Kate convence qualquer um com seu jeito 'carrancudo' e, claro, destaque para Saoirse Ronan, que precisou mudar a personalidade da personagem ao decorrer e fez isso sem brutalidade.  Ah, vale destacar, também, o excelente trabalho de som. É espetacular ver cenas das atrizes em um cômodo fechado e o som do mar suavemente ao fundo. Apesar dos pontos positivos, acredito que há um limite de quão aberto pode ser um final, e esse abusou. Além das inegáveis semelhanças no roteiro com \"God's Own Country\", filme anterior do diretor. Mas, vale cada segundo."
    },
    {
      "rating": "1",
      "text": "Just no. Boring, complete lack of chemistry, depressing and degenerate. Winslet tries to save the film but it's not possible. I was thoroughly disgusted several times and especially at the sex scenes."
    },
    {
      "rating": "6",
      "text": "In this 1800s period piece, Kate Winslet stars as a fossil merchant who strikes up an unlikely and passionate romance with a married young woman (Saoirse Ronan). It's pretty straightforward and seems to borrow heavily from other lesbian-themed films, so there's nothing really new here or much to remark on in terms of story. Most of it just felt very underwhelming to me, and the ending felt rushed and a little too sentimental. Aside from some occasional beautiful cinematography, the biggest praise I can pay this film is the onscreen chemistry between Winslet and Ronan. Them and their performances are stellar and felt very genuine and heartfelt. Otherwise, this film is overall pretty by-the-numbers in terms of period and forbidden romance films."
    },
    {
      "rating": "10",
      "text": "Wow! Just gives another Oscar for Kate Winslet. She’s incredible. Her best performance yet. The movie is a beautiful slow burn with amazing cinematography, music and performances. If you love period drama with complex characters, this movie will charm you."
    },
    {
      "rating": "10",
      "text": "A story that come from love ; i think its the best movie i've seen this year Such a great performance by kate winslet its time to give her second academy award"
    },
    {
      "rating": "9",
      "text": "A perfect achievement by director Frances Lee, who digs out the inner beauty of the movie's protagonist with the same perseverance she digs out precious fossils from apparently dull stones. The best performance from Kate Winslet so far."
    },
    {
      "rating": "6",
      "text": "Well, there's quite a bit of fossils, English weather, depressed-looking characters, people treating one another truly miserably, some more fossils, a couple of muff diving scenes and some more fossils. If you enjoy all of the above, this is a movie for you."
    },
    {
      "rating": "6",
      "text": "This is a somewhat slow, plodding type period drama film, or a period bio film perhaps as I'm not sure it'd be fair to call it an outright drama film. I liked the landscape cinematography (at least it shows the seaside setting in all its often dark and windswept glory) and it certainly gives the viewer something of an insight into Mary's life. I'd have liked to have seen more of her on her fossil hunts and perhaps even hearing a bit more of the science behind that side of things but I realise the focus or emphasis is almost entirely on the relationship between Mary and Charlotte. To be fair, the two main actresses (or should I/we refer to them as actors nowadays?), i.e. Kate Winslet and Saoirse Ronan, do gives fairly solid performances, I wouldn't downplay that but I suppose there was a slightly awkward sense (or I felt so anyway) in how understated it was, with a distinct lack of dialogue in some scenes. I suppose there is a sense of atmosphere present, so that's certainly something.Its an interesting film but not an especially memorable or thought provoking film. Its worth seeing if you know the story and are interested in how it's depicted but I'm not certain I can say you wouldn't be, if partially, disappointed, as I did feel it didn't quite entirely work, hence I wouldn't expressly recommend it, no...but I'd say its worth seeing for the cinematography and acting regardless."
    },
    {
      "rating": "7",
      "text": "This film is slow and quiet.There is not much sound in it except for the sound of the dialogs and background noises, what make the film feel very real and makes you pay more attention to the dialogs.The acting in this film is very good, and the characters really feel like real persons!The story was interesting, and I did want to know what will happen next, but with that said it was slow from time to time...Overall the film was good, you will need patient to see it and I don't think It's for everybody but if you like a historic, romantic dramas that takes their time I will recommend you giving this film a shot!"
    },
    {
      "rating": "10",
      "text": "It is a slow movie. If you think to 1840, both women could be killed.. so that explains the slow moving romance. The film is interesting and there are parts you don’t expect."
    },
    {
      "rating": "0",
      "text": "I live in Lyme regis and this film the worst ever and hasn’t our town any favours at all. What a waste of money"
    }
  ],
  "recommendations": [
    "the_world_to_come",
    "youth",
    "thoroughbreds",
    "phantom_thread",
    "the_beguiled",
    "21_grams",
    "the_place_beyond_the_pines",
    "the_rover",
    "blue_valentine",
    "20th_century_women",
    "the_favourite",
    "nocturnal_animals",
    "barry_lyndon",
    "magnolia",
    "annette",
    "the_light_between_oceans",
    "black_swan",
    "hugo",
    "a_most_violent_year",
    "roma",
    "the_devil_all_the_time",
    "melancholia",
    "closer",
    "the_best_exotic_marigold_hotel",
    "the_great_gatsby"
  ]
}