{
  "id": 3079,
  "title": "Amulet",
  "starring": [
    "Carla Juri",
    "Alec Secăreanu"
  ],
  "runtime": 99,
  "genre": [
    "Horror"
  ],
  "description": "Tomaz, an ex-soldier now homeless in London, is offered a place to stay at a decaying house, inhabited by a young woman and her dying mother. As he starts to fall for Magda, Tomaz cannot ignore his suspicion that something insidious might also be living alongside them.",
  "releaseYear": "2020",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/kEVyAkEkpwpfyx4oZMg22A8ivDI.jpg",
  "categories": {
    "plot": 8.25,
    "acting": 9.0,
    "ending": 9.0,
    "soundtrack": 9.0,
    "cinematography": 9.0,
    "familyFriendly": 3.0,
    "funny": 5.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "9",
      "text": "The less said about the film going in, the better. In fact I didn’t really want to even write anything, but then I saw the expected uneducated trash and incels bombing the movie on IMDb, and so I figured I should briefly make a note for any actual people who may be unsure if “Amulet” is worth your time. Long story short, it definitely is. Just keep in mind that this is a low budget, directorial debut from another country being done in, what is for them, non-native English. Setting all that aside, this is a wonderfully tense, tightly scripted, well-oiled mind**** that resonates with a very modern message but not done, thankfully, in a way that beats you over the head with it like many films “with a mesage” nowadays. One minor thing, it is such a tightly plotted story that even with its 90-something minute runtime, there was probably 5-10 minutes that could have been cut, but that’s just a small quibble. The other positive review on here does a good, albeit overly wordy, job of hinting at what is actually going on. In this day and age, there is a ridiculous push for people to forgive themselves when they may not truly deserve that forgiveness and/or may have repented but need to seek forgiveness from the victim, not themselves. “Amulet” puts together a delicious, moody, decidedly confident giant middle finger to this entire concept of undeserving, tainted repentance and self-forgiveness. Anyway, enough talk, go grab a friend, turn off  the lights, draw the shades, and watch it!"
    },
    {
      "rating": "9",
      "text": "9.2 actuallyi marked the review below as “spoiler” because i feel that this film is best with little/NO KNOWLEDGE.  that being said, join me here after you view it (and you should TOTALLY watch it) for generalized commentthis film is an arthouse, psychological horror that COULD HAVE BEEN pretentious and outrageous. however, the artists behind AMULET are overwhelmingly successful in delicately crafting a thought provoking, conversation-inducing work of art on screen. and it’s creepy as hell too. AMULET is well cast and all the actors consistently demonstrate a mastery of this clever script. what the audience gets is a handful of fully realized characters who show some pretty interesting and surprising development. it is worth mentioning here that the tightly wound dialog compliments AMULET’s specific style of storytelling by underpinning it’s mysteries with a strong, sharp, minimalistic voice. together these elements comprise the STURDY pillars upon which this fascinating, gory and mysterious tale of horror stands. it quietly burns the story across its dank, moldy universe—a dilapidated, sludge-drenched flat into which the film slowly drowns it’s audience. more often than not it tells its tale by unraveling cliche tropes only to reweave them into a refreshingly original proverb. All at once AMULET stirs believable, well developed characters with the heavy-iron, blood-wine and rich mahogany of catholic overtone; it tosses in a dash of its very own, uniquely curated mythological system; and it finishes with a splash of exceptional detail, indulgent texture and profoundly engaging atmosphere. Moreover all this is brought forward with such confidence that the audience most definitely catches whiffs of ancient decay w/hints of mold while the heat of a rich stew-the first hot meal after days without—works it's way down their throats into empty, aching stomachs. in short the director has a clear vision and she doesn’t just show it to you, she haunts your every sense with it.it is impossible not to mention the style and tone of this film. no one cannot deny the overwhelming success the director and her team have achieved in setting, tone, costumes, music, sound editing etc. From the haunting vocal arrangements that periodically seduce the audience to accompany a character through a mold infested hole in the wall and into the terrifying unknown—to the near-black lighting of an attic, where deep shadows hide dark secrets among piles of rags in a forgotten corner, this gifted team presents the audience a setting that is not simply appropriate and believable, but engaging and sumptuous.  this is unquestionably an ARTHOUSE level production and it is here within this classification that the potential for criticism exists. i assume that for those who do not fall under this movie’s spell—or perhaps curse, style over story will be the reason. an argument could be made that substance here is lost to a very heavy-handed tonality. in fact, as the movie began i grew a bit concerned that the film’s breathtaking, all-encompassing artistry would result in yet another pretentious and forgettable “pretty picture”. to my delight this was a terror that AMULET failed to inspire and to the credit if it’s creators, this fear went unrealized.in terms of themes, concepts and philosophy this crumbling house of locked doors and barred windows reveals a treasure trove of subtext, references and commentary. unfortunately, i cannot expose any of these without spoiling this film for you. i can however share this: the director is female and this is a female dominated narrative. and it’s glorious. the fact that this is a woman’s voice actually matters a great deal regarding meaning and message here. you willhave to watch it to know why.by the final credits it is clear that AMULET has lessons to teach and they are soaked in blood. it wants you to smell its rot while you scarf down it’s delicious stew. it wants your stomach to turn while you do these things because ultimately, it enjoys the fact that you can never entirely trust it. behind the fantastically realized squalor and underneath the creepy non-traditional soundtrack lies some deep thinking about a multitude of contemporary socio-political issues. in short you’ll be thinking about this movie after you devour it and your brain won’t be left craving more-there’s so much in here for it to chew.AMULET is not a traditional jump-scare film nor is it a slasher; it will not give you all the answers but the audience is left with enough puzzle pieces to satisfy. it is creepy over scary, though parts are pretty tense. expertly crafted and well paced, toned and performed, it is an intellectually rich/sound film with a very unique take on some pressing issues of the day. AMULET is not gonna spoon feed it to you...but it might smash your face in it.   M.R.  24 july 2020"
    },
    {
      "rating": "3",
      "text": "Some creepy moments and stop counting.That's how bad it actually is. So disappointing."
    },
    {
      "rating": "3",
      "text": "The movie was pretty odd...I would like for a more clear story. If you were watching this for halloween it's ok but this is kinda strange story and doesn't any sense for my opinion. Thats my review! Thanks."
    }
  ],
  "recommendations": [
    "high_life",
    "the_killing_of_a_sacred_deer",
    "the_green_knight",
    "in_fabric",
    "us",
    "antichrist",
    "titane",
    "annihilation",
    "the_guilty",
    "eyes_wide_shut",
    "you_were_never_really_here",
    "under_the_skin",
    "trance",
    "mandy",
    "flashback",
    "ex_machina",
    "coherence",
    "anon",
    "donnie_darko",
    "the_lodge",
    "a_ghost_story",
    "the_howling",
    "dark_city",
    "color_out_of_space",
    "a_cure_for_wellness"
  ]
}