{
  "id": 862,
  "title": "An Interview with God",
  "starring": [
    "Brenton Thwaites",
    "David Strathairn"
  ],
  "runtime": 97,
  "genre": [
    "Drama",
    "Mystery"
  ],
  "description": "An up-and-coming journalist finds his world and faith increasingly challenged when he's granted the interview of a lifetime – with someone who claims to be God.",
  "releaseYear": "2018",
  "mpaaRating": "NR",
  "imageUrl": "https://image.tmdb.org/t/p/w500/d9TeB8VLCgwSph2OSYK3lcHGf1f.jpg",
  "categories": {
    "plot": 7.5,
    "acting": 10.0,
    "ending": 5.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 4.0,
    "funny": 5.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "10",
      "text": "I highly recommend this movie, even to those who do  not consider themselves highly Christian. The movie maintains excellent standards in every way: the script, acting and casting, the filming, etc. I have found myself embarrassed for the makers of so many  Christian themed movies. Not in the slightest this one. It was quite enjoyable with very good plot pacing."
    },
    {
      "rating": "4",
      "text": "This film will definitely appeal only to believers. I'm sorry, but it's like that. A person like me who renounced religion more than 16 years ago, no matter how hard you try to judge and criticize objectively, you cannot avoid analyzing the story and its semantics with cynicism, especially when you have to confront your own beliefs.Frankly I didn't get any connection but I appreciated the work of David Strathairn. That was perhaps the most enjoyable part of this film."
    },
    {
      "rating": "10",
      "text": "Awesome movie, well done, not a top budget film, but it didnt need to be. Script and acting were spot on. Love the movie, hope it comes out on DVD!!!"
    },
    {
      "rating": "8",
      "text": "The starting of the movie is bland. Like literally you will be confused what is going on. Then, within a couple minutes, we have our first interview with GOD. I think that the plot was good but not developing. In the end, you will still be confused about what happened to Matt(A friend of Paul) and how the story just ended. It is worth a watch though, for anyone who is not a follower of God, I would recommend watching this title once(it is very short, around 90 minutes). It deals with humanity, why bad things happens to good people, etc. I will not be boring you through the details, just see it for yourself and it will be worth your time."
    }
  ],
  "recommendations": [
    "seven_pounds",
    "the_darkest_minds",
    "v_for_vendetta",
    "the_craft_legacy",
    "the_happening",
    "2067",
    "songbird",
    "the_butterfly_effect",
    "the_book_of_eli",
    "passengers",
    "tomorrowland",
    "demon_slayer_kimetsu_no_yaiba_to_the_swordsmith_village_",
    "there_will_be_blood",
    "now_you_see_me",
    "the_twilight_saga_breaking_dawn_part_1",
    "bright",
    "the_mist",
    "what_happened_to_monday",
    "terminator_genisys",
    "dreamcatcher",
    "the_loft",
    "code_8",
    "eo",
    "shutter_island",
    "tenet"
  ]
}