{
  "id": 2611,
  "title": "Anaconda",
  "starring": [
    "Jennifer Lopez",
    "Ice Cube"
  ],
  "runtime": 89,
  "genre": [
    "Adventure",
    "Horror",
    "Thriller"
  ],
  "description": "A \"National Geographic\" film crew is taken hostage by an insane hunter, who takes them along on his quest to capture the world's largest - and deadliest - snake.",
  "releaseYear": "1997",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/33NysOnLpLZY0ewHTcfpalzAsRG.jpg",
  "categories": {
    "plot": 3.375,
    "acting": 3.923076923076923,
    "ending": 4.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 5.8,
    "funny": 9.5,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "4",
      "text": "Anaconda is one of those movies you watch again late at night and think what's the big deal? It's not awful or merely good, it's just a bad 90's action movie."
    },
    {
      "rating": "3",
      "text": "That the best actor in Anaconda is Jennifer Lopez should tell you all you need to know about this flick. Jon Voigt is so over the top it’s unintentionally hilarious. Ice Cube is dire. Why was Eric Stolz in it? TAll would be forgivable if the snake was any good. But it’s not. The animatronics are terrible."
    },
    {
      "rating": "9",
      "text": "Is it perfect? No is it a cinematic masterpiece? No, but I love this film because it's self aware of it's absurdity and screenwriters Hans Bauer, Jim Cash and Jack Epps Jr. and director Luis Llosa point that out very nicely. What I also love about the film is Ice Cube's over the top performance but it's stirring and SPOILER ALERT! Your gonna enjoy this film more when your about to see Cube killing a snake , Jennifer Lopez's   performance was okay, this film isn't well made yes it is mediocre but the snake effects are laughable but Llosa does a bland job but good at the same time making this film cheesy but enjoyable at the same time. Jon Voight (who looks like Christopher Walken) does a creepy but good job as the snake expert/villain. Jennifer Lopez plays Terri Flores a documentary filmmaker her and crew go deep into the Amazon Jungle to shoot this documentary about the People of The Mist-- a legendary lost Amazon tribe. Terri is directing the documentary. Ice Cube plays Danny, her cinematographer. Eric Holtz is Dr. Steven Cale a scientist.  The members include Johnathan Hyde as the British narrator, Owen Wilson plays the sound man, Vincent Castellanos as the sinister pilot, and Kari Wuhrer as the production assistant. They pick a guy called Paul Sarone (John Voight) from a sinking boat. He offers to help in Terri and her crew to search for the Amazon tribe Paul, but he's actually a snake hunter looking for the big legendary anaconda snake that's a fortune. Since \"Anaconda\" is a action-adventure film, you can find some hilarious moments at this film, but overall cheesy fun B-movie. 4.5 out of 5 stars"
    },
    {
      "rating": "7",
      "text": "Es entretenida a nivel promedio, pero el cgi de la anaconda es verdaderamente espantoso."
    },
    {
      "rating": "10",
      "text": "La mejor de la saga, por no decir la única. El reparto es muy bueno. Muy buena."
    },
    {
      "rating": "7",
      "text": "This is a mind-numbing but entertaining monster snake movie. It is a quite exciting adventure but the depth is non-existent and there is no humour. It's all totally ridiculous. It isn't especially violent and there is no nudity but Jennifer is looking mighty fine so it is all good. I quite enjoyed it as there is no thought power required. One of the best giant snake movies and with that title comes pure cheesiness."
    },
    {
      "rating": "4",
      "text": "The film is horrible but it does not belong to the worst. The plot is ordinary and boring, the scenes are very predictable, the characters are very confusing and the overall presentation of the movie is below par. But there are good events that makes the movie worthy of 4 points."
    },
    {
      "rating": "7",
      "text": "Hey it wasnt that bad.I like how the deaths are,I admit that it goe a bit saintish at points but it is good fun to watch. Go ahead and watch it. It is snot and needto be picked."
    },
    {
      "rating": "4",
      "text": "Felt like it tried to be Jaws with a giant man-eating snake instead of a Giant man-eating shark except it lacks the tension or at the very least the thrills that Jaws had."
    },
    {
      "rating": "10",
      "text": "I dont know why critics dogged this movie so bad. i didnt see anything wrong with it. it was fast paced funny and thrilling. everything u could ask for."
    },
    {
      "rating": "6",
      "text": "It's a fun film. Is it super fantastic, kick-ass, best film of all time, classic? No, not really. The best part is watching Jon Voight trying to capture the snake, then running away, then getting swalloed whole by it. Yeah, that was cool. Not many scenes that are as memorable, though, but for those that are looking for a good creature feature after crap like Python and Some gator and croc flicks, see this. Better than the sequel, which, these days, after excellent films like Batman, but its even more kick-ass sequel, begins, and Spider-Man 2, you can't really say alot."
    },
    {
      "rating": "0",
      "text": "Horrible plot, bad editing, cheesy effects, and even bad acting by A-list stars. One of the worst movies I've seen in a long time."
    },
    {
      "rating": "4",
      "text": "The special effects were terrible, well for 90% of the film. I started off OK and until half way through it was a decent watch, but the film caved in on its own complications. They went too far and over the top towards the end to the point where you were almost certain the snake/jon voight was going to somehow survive the attacks that would certainly have killed them had the film been sem-realistic. Jon Voight was regurgitated and a snake survived being blown up. I'll give this a 4 down to some good performances from Lopez and Voight and a good start.- Had it not been for the deterioration near the end this would get a 7."
    },
    {
      "rating": "6",
      "text": "A documentary crew heads into the Amazon rainforest in search of a lost tribe of Native Americans, but they soon find themselves fighting to survive against a 40 foot snake.Anaconda delivers pretty much what you’d expect from one of these 90’s action/horror movies. The special effects don’t particularly hold up, but with J-Lo and Ice Cube doing their thing and Jon Voight putting in an entertaining turn, it makes for an hour and a half of dumb fun."
    },
    {
      "rating": "0",
      "text": "A completely idiotic movie where the only thing I can understand that there is a giant snake that eats all the characters of the film. Are many unanswered questions."
    },
    {
      "rating": "2",
      "text": "It may be a classic, but the effects are terrible, the acting is terrible, the story is extremely weak, there can never be considered a horror movie or suspense, adventure perhaps, perhaps."
    },
    {
      "rating": "7",
      "text": "Anaconda is a typical thriller movie except with some big snakes eating people. The reason why i enjoyed the film was because the movie got rid of their stupid characters by a big snake squeezing them to death which i felt amusing."
    },
    {
      "rating": "6",
      "text": "Can't really complain about the movie. It was about as good as it could have been. Story was pretty simple and banal, but still exciting. Lopez could have been worse."
    },
    {
      "rating": "4",
      "text": "\"Anaconda\". It's big, it's scary    it's underwhelming. Yeah, I was surprised, but this movie really felt kinda empty and boring. The anaconda wasn't very threatening, the action and suspense wasn't very gripping, and the only redeeming qualities were some decent acting and a few moments of fun special effects  almost all of which they seemed to save for the last act. I was interrupted about halfway through it, and nearly didn't bother finishing it  not a good sign for a movie. Overall, it's not terrible, but it's sure not terribly memorable either. More of a snakeskin than a real snake."
    },
    {
      "rating": "3",
      "text": "I didn't like this movie for four reasons. It was corny, some of the acting was bad, it was so fake, and at times it was kind of boring. Ice Cube was the main problem with the acting. You didn't believe a word of what he said or did."
    },
    {
      "rating": "3",
      "text": "That said, Anaconda is not bad enough to be one of the worst movies ever made. The tropical scenery is splendid, the snakes are impressive and the premise while daft was at least interesting. However, if I were to coin the phrase \"absolute poppycock\" I would give it to Anaconda. The story was interesting in its concept but it is very predictable with some unbearably silly scenes. Anaconda is also quite poorly paced, sometimes it drags, sometimes it feels rushed. The script is very cheesy and clumsy, and the characters are shallow. The direction is rather murky, and the acting is pretty dire. Jennifer Lopez is very bland in her role here, while Jon Voight is annoying and just awful with a very poorly written character, complete with a horrendous accent(not quite Superbabies:Baby Geniuses 2 horrendous, but still it was dreadful). So overall, it is not good. 3/10 Bethany Cox"
    },
    {
      "rating": "3",
      "text": "I wanted to like this because come on a movie about a giant killer snake, but I just didnt have any fun."
    }
  ],
  "recommendations": [
    "van_helsing",
    "ghost_rider",
    "ghost_rider_spirit_of_vengeance",
    "transporter_2",
    "jason_x",
    "deep_blue_sea",
    "jaws_2",
    "mechanic_resurrection",
    "the_legend_of_hercules",
    "underworld",
    "the_meg",
    "the_expendables_3",
    "lockout",
    "6_underground",
    "the_mummy_tomb_of_the_dragon_emperor",
    "transformers_revenge_of_the_fallen",
    "teenage_mutant_ninja_turtles",
    "underworld_evolution",
    "bloodshot",
    "mission_impossible_iii",
    "legion",
    "blade_trinity",
    "the_expendables",
    "clash_of_the_titans",
    "immortals"
  ]
}