{
  "id": 1135,
  "title": "Anastasia",
  "starring": [
    "Meg Ryan",
    "John Cusack"
  ],
  "runtime": 94,
  "genre": [
    "Animation",
    "Family",
    "Fantasy",
    "Adventure"
  ],
  "description": "This animated adventure spins a more optimistic twist on the long-mythicized story of the \"lost daughter\" of Russia's last czar. A wicked sorcerer places a curse on the Romanov family, and Anastasia is separated from them during their attempts to escape from a rowdy revolt seizing their palace. Years later, after growing up with amnesia in an orphanage, \"Anya\" encounters two Russian men seeking a reward offered by the Dowager Empress Marie, for the return of her missing granddaughter. They decide to travel together to visit the Empress in Paris. Will Anya finally be reunited with her remaining family and find a loving home at last?",
  "releaseYear": "1997",
  "mpaaRating": "G",
  "imageUrl": "https://image.tmdb.org/t/p/w500/lQwTsdtJwxanuJPdS4Ltx5ngUBJ.jpg",
  "categories": {
    "plot": 8.35,
    "acting": 8.636363636363637,
    "ending": 7.333333333333333,
    "soundtrack": 9.0,
    "cinematography": 5.0,
    "familyFriendly": 9.0,
    "funny": 8.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "10",
      "text": "Marvelous! Easily the  movie! I am from Russia and I know a lot abour Anasrasia.... May be it si not true , but I think It is the greatest animation movie has ever been !"
    },
    {
      "rating": "10",
      "text": "Easily the best non-disney princess movie by far. And it's a lot better than the average modern cartoon."
    },
    {
      "rating": "10",
      "text": "It looks like a Disney knockoff, but not very similiar to Disney. It has great animation, solid voice acting, and very catchy songs. Don Bluth did a very good job at making this non-disney masterpiece."
    },
    {
      "rating": "9",
      "text": "THIS IS THE BEST FOX ANIMATED MOVIE EVER!!!! LET'S GRADE THE MOVIE!!!!! Animation: A Characters: B Story: A+ For Kids: Oh my God, Yeah!!! Music: A Voice Acting: B Overall: A-!!!!! FINAL GRADE = A-! MY SECOND BEST IS ICE AGE!!!! MY THIRD BEST IS ROBOTS!!!! AND IT EVEN WAS A BOX OFFICE SUCCESS!!! I'M SO GLAD!!!! WE ARE LOVING THIS ANIMATED MOVIE!!!!! WHOOOOOOOOOOOOOOOO!!!!! THERE IS NEVER ANYTHING WRONG ABOUT THE MOVIE!!!!!! THAT'S GOOD!!!!!! THAT'S WHY I LOVE IT!!!!!!!!!!!!!!!!!!!!!!!!!"
    },
    {
      "rating": "10",
      "text": "This has to be the best Disney movie I've seen, with a good plot, great characters, and catchy songs, who can't love it?"
    },
    {
      "rating": "10",
      "text": "My favorite non-disney 2-d animated movie of all time, and one of my favorite animated movies in general."
    },
    {
      "rating": "10",
      "text": "One of the best animated family movies. Truly underrated! Loved as a child and I still love it now."
    },
    {
      "rating": "8",
      "text": "Anastasia is an excellent film with a great story and probably the most general audience appeal of traditionally animated film outside of Disney. The underlying themes of the plot are very familiar to Disney fans, being a self discovery journey of a spunky princess, but it's well executed and has good interactions between characters. The voice acting is surprisingly good for most characters, with most actors getting into character very well and voicing their character in a manner which makes them unrecognizable. Hank Azaria does an amazing job with the comic bat, giving the character the perfect voice and delivery, probably being the unexpected standout. Christopher Loyd surprised me by doing a good job changing his voice to be that of Rasputin, with his signature yelling being the only thing giving him away, though it's not disrupting. Meg Ryan, on the other hand, plays Anastasia in the classic Meg Ryan way, making no changes in how she speaks for the character. This makes her performance a bit disrupting, though fans of Meg Ryan will likely disagree, but all of the animation fits the voices, including Ryan's, perfectly. Animation in the film is crisp, fluid, and beautiful with wonderfully illustrated backgrounds. The one flaw of the film is it's use of computer generated (CG) images which, like in most traditionally animated films, stick out. It's not to say that the CG doesn't look good but merely that it doesn't seamlessly mesh with the traditional animation. The movement in the film feels wonderfully natural, with more quirky minor movements made by characters than seems to be in most films. It's musicals are generally good, with a few greats and some misses. \"Once Upon a December\" really stands out as the height of the movies musical scenes and scores while \"A Rumor in St. Petersburg\", the first musical scene in the film, was mediocre. The \"In the Dark of the Night\" scene causes me to laugh every time I watch the film because of how out of place the music seems, despite how the good music was. All in all, this is arguably Don Bluth's best animated film with \"The Secret of NIMH\" being the competition. The film brushes or even matches the lower edge of the Disney renaissance, being more enjoyable than \"The Little Mermaid\" for me, despite having more technical problems. If you're looking for a fun and enjoyable animated film for the whole family, I'd fully recommend this film."
    },
    {
      "rating": "8",
      "text": "It's scarry for kids. The bad guy head comes off. He falls a part. What's that all abot?"
    },
    {
      "rating": "10",
      "text": "It is brilliant. Not at all scarring for kids, in your face Thomas D."
    },
    {
      "rating": "10",
      "text": "The music takes me to magical mind trips, it creates dreams,and makes me appreciate the moment."
    },
    {
      "rating": "10",
      "text": "Fantastic film. Breath taking for any ages. The music is catchy with brilliant lyrics. It has character and is interesting."
    },
    {
      "rating": "6",
      "text": "Anastasia is Twentieth Century Fox's response to many of Disney's historically inaccurate, though intellectual animated musicals in the past twenty years."
    },
    {
      "rating": "8",
      "text": "â"
    },
    {
      "rating": "8",
      "text": "Films inspired off of factual history are always difficult to produce  but this here is a perfect example. Steady story, catchy tunes, good subtle morals, and with no interaction with Disney animation studios. It is a shame this did not get as much recognition as it deserves."
    },
    {
      "rating": "10",
      "text": "One of my favorites, this best non-Disney musical film eve. It could have been it's own thing, but as Disney knockoff, it works, and it works as fairy tale."
    },
    {
      "rating": "10",
      "text": "This is one of the greatest non-Disney animated movies there is! Anastasia is one of those rare non-Disney heroines who is thoroughly modern and enchanting. She's not the only thing I love about the movie, the musical numbers, the animation, the characters, everything! My only gripe, and it's a small quibble, is that Rasputin is a little bit leaning towards Dick Dastardly than a Disney-like villain. The two supporting characters, Dimitri and Marie, are the some of the most human I've seen in an animated movie. There's plenty of bad rap towards Bartok, but in my opinion he's likable and deserves more respect. Anya is the representative of the perfect non-Disney heroine as she can stand on her own ground with the Mouse House's beauties like Ariel and Belle. I definitely love this move as I watched it respectively on video and TV and recommend this to every animation fan and fan of Don Bluth. Spectacular!"
    },
    {
      "rating": "9",
      "text": "One of my favorite non-Disney/Pixar animated movies. Superb animation. Great voice acting. Catchy and memorable music. While it does take some HUGE liberties with history, it is just a story after all. What really got my attention was that this was really the first GOOD non-Disney movie of its time. This level of production for hand drawn animation was almost unheard of and really shook the chains of quality superiority that Disney once held. Overall: A charming and fun animated movie that won't be for everyone, but it has a place in my heart."
    },
    {
      "rating": "10",
      "text": "Why this only has a 59 for its main score will always be a mystery. This is easily one of the best traditionally animated movies not made by Disney of all time. The characters are likable and well developed, and their voice cast is perfect. The songs are amazing and can rival Frozen's famous soundtrack. The animation is beautiful, and the story is cleverly written with some good turns and changes. This is an absolute MUST WATCH. It's amazing as a movie, not just animated, but in general."
    },
    {
      "rating": "6",
      "text": "Anastasia is Twentieth Century Fox's response to many of Disney's historically inaccurate, though intellectual animated musicals in the past twenty years."
    },
    {
      "rating": "6",
      "text": "Anastasia is Twentieth Century Fox's response to many of Disney's historically inaccurate, though intellectual animated musicals in the past twenty years."
    },
    {
      "rating": "6",
      "text": "Anastasia is Twentieth Century Fox's response to many of Disney's historically inaccurate, though intellectual animated musicals in the past twenty years."
    },
    {
      "rating": "6",
      "text": "Anastasia is Twentieth Century Fox's response to many of Disney's historically inaccurate, though intellectual animated musicals in the past twenty years."
    },
    {
      "rating": "6",
      "text": "Anastasia is Twentieth Century Fox's response to many of Disney's historically inaccurate, though intellectual animated musicals in the past twenty years."
    },
    {
      "rating": "6",
      "text": "Anastasia is Twentieth Century Fox's response to many of Disney's historically inaccurate, though intellectual animated musicals in the past twenty years."
    },
    {
      "rating": "7",
      "text": "Anastasia has got one of the best songs ever created for a cartoon. The cartoon itself though, giving me chills and having me cry at some point, is not that unique. The villain does not stand out, and some typical Disney like elements are present which is not necessarily a bad thing.    I'm giving this a 7 simply because I enjoyed it as a 7 rated movie. Nothing about it is special (except for Once Upon a December) and the romance is well done, just like most of the cartoons involving princesses and errand boys who end up living happily ever after.   *** Spoilers ahead!I have to say it though... a mistake like Dimitry's, has been made a lot-- even I have done such a thing but in its own uniqueness. This cartoon is going to remind me for some time that cartoons are not what the real life represents. If you miss an opportunity, you may never get another, and no one will drag you all the way from where you're going only to take you to the exact place where your significant other is and there's no magic to make things right. I'm a cynical :p"
    },
    {
      "rating": "9",
      "text": "Anastasia. Find yourself. A stunning fairy tale for children and adults. Very soulful and beautiful songs and interesting characters. Each with its own purpose and its own principles."
    },
    {
      "rating": "10",
      "text": "While I know the movie is not historically accurate, I don't care! The movie is fiction after all- based on a true story (of Anastasia's rumored escape and women who claimed to be her), loosely, mind you- but perhaps it is not as unlikely as it seems: when the remains of the Romanovs were discovered back in 1991, Alexei (her brother,the Czarvitch) and one of the Grand Duchesses were missing. And with age analysis of the bones, scientists believe that the missing daughter is in fact Anastasia, and not one of her sisters, Olga, Tatiana, or Maria. But who really knows what happened?My opinion of the movie is that it is wonderful. It draws you into the world of the lost Russian Princess, to a time that is \"far away, long ago\", that doesn't exist anymore.The music and animation are stunning, and the photo research of St. Petersburg is amazing! Take the Catherine Palace and the magnificent gate you see, as well as the city itself. The 3-D animation is amazing; you look like you could reach out and touch it! The music is truly magical; \"Once Upon a December\" (especially Deana Carter's version)is haunting yet beautiful. I own the soundtrack- I listen to it frequentlyto help me relax.But what I love best about the movie is the romance that occurs between Anya(Anastasia) and Dimitri. It starts out as a con, a trick for money, and turns into a love story. I think it shows that people really do have good in them, and that true love really exists. It's also heartwarming to think that a young boy who saved the girl he liked (princess or not) later helps her restore her identity and find a true place (in this case, happily together with him).\"Anastasia\" is really my favourite movie of all time, even though now I'm almost 23. I'd recommend it to anyone, and advise historical literialists to look beyond the fiction and let yourself be taken on a \"Journey to the Past\" with the romance, comedy, and magic of this story."
    },
    {
      "rating": "9",
      "text": "One of the best animated films directed by Don Bluth. The film features captivating characters, great dubbing and a very beautiful soundtrack, plus a nice storyline. However, this same plot ends up functioning more as an isolated history than as a historical approach. In truth, the film is not faithful to the real events that occurred in Russia at that time. But promotes a very good entertainment for those who wanna find an escapism."
    },
    {
      "rating": "5",
      "text": "Pretty solid movie with a good plot.  The whole time I just felt that Disney could do this better."
    },
    {
      "rating": "10",
      "text": "This is a truly underappreciated gem, for many reasons. But the big one is that it copies Disney's princess formula and makes it WORK. Not only that, but it works well. The story is well told and engaging, the animation is gorgeous, and the characters are memorable. As one review for this movie said: \"Easily the best non-Disney animated movie in recent memory, and it's good enough to rival titles like \"The Lion King\" and \"Aladdin\". I can't say it any better myself."
    },
    {
      "rating": "9",
      "text": "Enchanting and beautiful both in visuals and storytelling. Anastasia brings its extra dimensional character to life in spectacular style."
    },
    {
      "rating": "10",
      "text": "Todo un clásico de Disney! Amo el video de la película interpretada por Thalía! ❤️"
    },
    {
      "rating": "6",
      "text": "Anastasia, arguably one of the most iconic animated films from the ‘90s, follows the story of a young girl on her path to discovering who she really is, facing many challenges along the way. Although this movie was created by Fox Animation Studios, it could easily be mistaken as a Disney movie, as it has a similar animation style to many Disney classics, such as Hercules and Sleeping Beauty. This is likely because Fox had intended for the movie to act as a challenger to Disney.  Many today continue to mistake it for a Disney movie, some even going as far as to think of Anya as a Disney princess.  With the recent merger between Disney and Fox, this is technically true, but not when originally produced.The story of Anastasia follows an 18-year old amnesiac orphan girl, Anya, who sides with two con men attempting to use her to trick the Grand Duchess into believing she’s the lost princess for a monetary reward. Their plan quickly falls through, as one of the con men, Dimitri, who had also been a former worker at the palace, realizes Anya is the lost princess and their “fake” story had been real all along. This is a loose adaptation of the legend of Grand Duchess Anastasia Nikolaevna of Russia, though the story was altered so that she escaped the execution of her family.Although this is a very well-known film, both me and my friend who I watched it with had never seen it beforehand. We both ended the film with a very neutral opinion on it, neither loving it nor hating it. There’s many good aspects of the movie, but I believe the reason it may be loved by so many is nostalgia. Remembering or rewatching a film you had loved in your childhood often encourages a more positive outlook, but because my friend and I hadn’t seen it before, this wasn’t the case for us. That being said, like most animated films intended for younger audiences, I believe this is a great movie for children, though not as much for older audiences.One of the movie’s strongest aspects is the unique storyline, but this is also the case for many movies of its genre. The soundtrack is also amazing, and this was the only part of the movie I was familiar with before watching. Apart from these two things, there hadn’t been anything I noticed that made Anastasia stand out in comparison to other animated films, most parts of it being very average; there were, however, a few parts I didn’t enjoy. There were parts of the animation which were strange to me, whether because it lacked connection to what was happening or there were just small details that didn’t fit with the rest of the scene. This didn’t completely ruin the movie for me, but it did throw me off on occasion or distract me from what had been happening. Unlike the majority of the story, the relationship between Anya and Dimitri felt a bit rushed. This wasn’t very surprising to me because there was more of a focus on Anya being reunited with her family than on her relationship with Dimitri, but it made it feel like the positive resolution of their relationship wasn’t needed. I did like the fact that they ended up together, I just wish they had put a bit more effort in building up to the finale, as it was very anticlimactic. There were also many points where Anya had been a “damsel in distress” type character, which was disappointing because she had the potential to be a strong female lead. Despite the points where it falls a bit short, I do believe Anastasia is a solid animated movie. Though I recommend it more for children, it’s a short and sweet watch for older audiences, as well. That being said, if you’re looking for a movie you’ll genuinely enjoy the entire way through, I recommend watching something else instead."
    },
    {
      "rating": "10",
      "text": "it’s an amazing movie i definitely recommend. I’m constantly singing to the music and just thinking about it overall, it reminds me of beauty and the beast or princess and the frog!!"
    }
  ],
  "recommendations": [
    "the_lion_king",
    "wolfwalkers",
    "the_princess_and_the_frog",
    "the_prince_of_egypt",
    "atlantis_the_lost_empire",
    "treasure_planet",
    "moana",
    "tangled",
    "klaus",
    "the_book_of_life",
    "over_the_moon",
    "the_little_prince",
    "luca",
    "spirit_stallion_of_the_cimarron",
    "cinderella",
    "song_of_the_sea",
    "winnie_the_pooh_blood_and_honey",
    "strange_magic",
    "zootopia",
    "fantasia",
    "your_name",
    "the_sword_in_the_stone",
    "rio",
    "how_to_train_your_dragon",
    "the_incredibles"
  ]
}