{
  "id": 3795,
  "title": "Anchorman 2: The Legend Continues",
  "starring": [
    "Will Ferrell",
    "Steve Carell"
  ],
  "runtime": 119,
  "genre": [
    "Comedy"
  ],
  "description": "With the 70s behind him, San Diego's top rated newsman, Ron Burgundy, returns to take New York's first 24-hour news channel by storm.",
  "releaseYear": "2013",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/55volAzeebtFzyrx7DJkegvw8Ta.jpg",
  "categories": {
    "plot": 5.285714285714286,
    "acting": 4.625,
    "ending": 3.6,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 6.0,
    "funny": 4.2555555555555555,
    "action": 6.5
  },
  "reviews": [
    {
      "rating": "9",
      "text": "By choosing not to top the one-liners and instead try to expand on the story, Anchorman 2: The Legend Continues not only tops the first film, but it also defies the mold of the comedy sequel."
    },
    {
      "rating": "8",
      "text": "Funny movie. One of Will Ferrell's best in my opinion. I think it is under rated as not to many people enjoyed it as much as I did. The first 3 quarters of the movie were great and the last quarter was a bit sloppy but still ended up being a good time."
    },
    {
      "rating": "4",
      "text": "Truly one of the biggest, if not the biggest, disappointments in film making! This movie had everything going for it! A complete returning cast, a good premise and what looked like more of the same hilarious over the top comedy that we knew and loved! Sadly this movie is a disgrace to the legacy that the first one has built! The majority is not funny and even the few bits that are can't save this from being a movie that I pray you will not waste your money on!"
    },
    {
      "rating": "1",
      "text": "I was not impress with the first movie but this one is a real stinker.  There are a number of scenes that are set up with some promise but just fall short; usually ending with someone, or multiple actors screaming instead of delivering any dialogue.  The realization of just how unfunny these characters are comes in the final battle scene when Jim Carrey appears in a cameo and delivers just 3 or 4 lines that are funnier than anything previously viewed.  The idea of Ron accidentally creating the modern day news format was rather cleaver but was more interesting than funny."
    },
    {
      "rating": "7",
      "text": "It's not as good as the first one, but when it comes to sequels it's really funny.  The story goes all over the place with a few jokes that fall flat in the long run though with the hilarious cameos and Ron and the news team at their best Anchorman 2 is a strong sequel.  B+"
    },
    {
      "rating": "8",
      "text": "Anchorman 2 review\rW\r Ron Burgundy and his team of two perverts and a retarded weather forecaster are back in this much expected sequel from which people expect the same smartly done dumb humor from the previous one. So we all wondered going into this film: is it gonna rise over its predecessor like a flaming eagle or is it gonna plummet into a forgotten pit?\rThe answer is... this movie is a sweet random treat for those who enjoy this kind of humor and are in the mood for it. Warning! For those grumpy artsy humans looking for a quirkier and more mature humor go sit somewhere else or you will go blind from all the eye rolling. But for those which enjoyed the last one and just wanna have a fun laugh, go right in.\rThe movie continues the travels of Ron Burgundy and as expected goes to the most random and silly situations imaginable.\rI will start with the cons to get them of so here they are: Though being bigger than the last one this one drags on a little bit at the end of the second act and an estimated 10% of the jokes don't hit that laughing spot. The movie is quite long compared to the first one and I think for this kind of humor the length of the film needs to be shorter.\rNow to the pros: As I said previously this movie is BIG! It involves from Ron Burgundy raising a shark to the news team fighting a minotaur. The Channel 4 News team has a lot of screen time specially Brick! There are a lot of scenes involving Brick and since they are so many there are some that don't get you where it tickles but there are undoubtedly some that make you roll into a fetus position and cry of laughter. I will say a beloved occurrence from the last one makes a comeback 10 times bigger and involves some creative cameos that made me smile.\rIn conclusion this movie has some flaws but they are overshadowed by an amazing fan service and loyalty to the first one. It hasn't got that many quotable lines as number one but it sure makes for a \"laugh out loud\" awesome time!"
    },
    {
      "rating": "10",
      "text": "Anchorman 2 not only reaches the pedestal of Anchorman, but destroys it. It will get more quotable as the years go by. Anchorman 2 is a hilarious film and with a surprisingly great plot. The most anticipated comedy sequel ever meets expectations...and then some."
    },
    {
      "rating": "0",
      "text": "'Anchorman 2' is stunningly, breathtakingly bad. Not only entirely unoriginal and humorless, this heaving, gasping attempt at a sequel manages to reach transcendent levels of racism and bigotry. In a sense, you could say that Will Ferrell's comedy has disappeared into a nether-world in which his jokes are so lame and his apparent idea of what's funny so reactionary that you feel that he must be doing it on purpose: there must be some second-level joke going on, a sort of ironically bad comedy.\r Unfortunately, it just is what it looks like: bad, lazy, offensive comedy. 'Anchorman 2''s joke overwhelmingly are not jokes; they're just exaggerated portrayals of stereotypes. The movie is overflowing with saucy Black women with Afros and angry libidos, there's an extended bit toward the end which basically boils down to \"Ha ha, it's hard to be blind,\" and Stever Carell is back with what no one else seems to notice is a *retard routine.* The most painful moment of the film is probably when Ferrell has dinner with the \"Black family\" of his \"Black girlfriend\" (his repeated phrasing), where viewers are treated to something like five minutes of Will Ferrell doing paintless Blackface, saying \"My man\" and \"Big mama\" and trying to get high fives. But, you know, it's *ironic*, so it's not racist. Totally.\r Let's be clear: I am not just whining that a movie violated my moral tastes. It is possible to write racist comedy which is, at least on a technical level, funny. 'Anchorman 2' is not bad only because it reduces systemic oppression to a punchline. It's also just a lazy, empty movie. The gags are just variations on the gags used in the original 'Anchorman': because the first film has a special cologne scene, the sequel gets a special condom scene; because the original had a random, surreal battle the sequel also got one (but with a bunch of pointless celebrity cameos). As others have noted, a great deal of the films ostensible humor centers on Carrell and Ferrel screaming. Just screaming. 'Cause it's funny, evidently.\r Rarely have I been so disappointed by a film. I went in expecting something not quite as good as the original but still passably funny. What I got was self-imitating garbage that manages to be casually bigoted and deeply boring at the same time. Save your money, your time, and your dignity. Just say no to 'Anchorman 2.'"
    },
    {
      "rating": "2",
      "text": "Too random.\rPoor acting is an understatement.\rScenes so pointless they were unbearable, some due to longevity, and trying too damn hard to be funny.\rThe underlying story had more substance than the humor.\rWorst use of great cameos of all-time.....*face palm*"
    },
    {
      "rating": "1",
      "text": "The humour in this film felt flat and stale. There was poor buildup to funny situations, and the plot line was incoherent to say the least (even by comedy standards). There were few bits of good humour, but most of the time the film leaves you wondering how strange, awkward and 'spoofy' it is going to get before it finally draws to a close.\r The film attempts to explore themes of family and friendship, and at times it does so in a touching way. However, this is overshadowed by an excess of flat humour. The writer seems to value jokes in quantity over quality.\r There was one notable positive though. The film satirizes how modern TV networks attempt to draw audience, as well as many stereotypes about Fox News.\r Overall, however, this film was disappointing to watch and not worth the money for the ticket. If you don't like humour arising from awkward situations, don't bother watching it."
    },
    {
      "rating": "8",
      "text": "If you loved the first one, you'll love this one.  Ron Burgundy and the Channel 4 News Team are in fine form throughout.  Combining fresh jokes with call backs to the first film, The Legend Continues indeed.  At several points, the film just goes so bonkers it leaves you wondering where the ideas come from (I'm looking at you, Dobi)."
    },
    {
      "rating": "0",
      "text": "I'm in shock that this movie is getting such good reviews.  I was a fan of the first one, and I love all the actors involved.  This movie really wasn't that funny.  So many of the scenes fall flat and so many of the jokes are stale.  I was surprised by how boring this movie actually was.  There are sections of the movie that drag on for so long, I couldn't wait to get the hell out of the theater.  I think our standards for comedies have absolutely plummeted in the past 3-4 years.  The jokes have no substance, they're cheap and stupid.  What's actually funny about the movie is that it really has a strong message regarding the history of media in our country and how things have changed.  Unfortunately, it seemed pretty clear to me that the message of the movie was going way over the heads of many of the morons in the theater I saw it in.  I chucked once or twice, which is just unacceptable, this movie sucked."
    },
    {
      "rating": "1",
      "text": "Please do not waste your money on this movie...many scenes are unfunny, unimaginative, dry and flat. It really surprises me that its getting anything above a 4/10 because although it's got many star cameo appearances.. the writing just isn't funny."
    },
    {
      "rating": "1",
      "text": "Worst movie i have ever seen in the past couple of years. I can't believe the type of positive reviews it has been getting. So many scenes are stupid and not funny. Waste of money."
    },
    {
      "rating": "7",
      "text": "This is a good movie worth seeing.  I don't agree with either of the extremes, particularly the review that there was never a dull moment.  There are scenes that fall flat, there are great laughs.  Overall it's a good movie.  If you have super high original movie expectations you should tone those down a bit, it's a sequel.  But overall I found it funny, and towards the end I was cracking up."
    },
    {
      "rating": "3",
      "text": "I really wanted this movie to be funny but it really is the case that the best moments were in the trailers. As a film its a feel good romp with some clever pokes at the news industry but as a comedy it just lacks laughs. Seriously, a slight chuckle was as good as it got.\r Really for all the billing that went along with this movie some decent writers wouldn't have gone astray. Not even close to the original."
    },
    {
      "rating": "7",
      "text": "Anchorman 2 swings for the fences,misses, but still bags a solid triple. More outrageous than than the first film and almost as funny. Sure there are parts of the film were you might be thinking to your self  come on, really?\" Yet, that's only when your not laughing your ass off to the many pop culture references and timely gags. This is as good as comedy sequels get and that is a tribute to the writers of this film. The actors were also very interesting and memorable. While its not the best performance from any of them; they made the film worth a trip to the movies."
    },
    {
      "rating": "1",
      "text": "Loved the first one... But Anchorman 2:   45 minutes too long. Tries way too hard to be funny. Over crude to compensate for lack of originality.  Couldn't wait for it to end..."
    },
    {
      "rating": "8",
      "text": "It may not be as good as its predecessor. But Anchorman 2 delivers all the comedy that we have come to expect. The point is, it got the job done and I walked out satisfied."
    },
    {
      "rating": "1",
      "text": "To be honest this was not a good movie. I never expected wanting a movie to end that had will Ferrell, Paul Rudd, and steve carrel. The jokes had no substance, the theater I was in was silent for most of the movie, not something I am used to, even at a terrible movie. The only positive was the satire on what the news industry has become. However, the fact that people are giving this a positive review, I'm guessing it eluded most. This was one of the worst comedies I have seen. I was very disappointed, especially since I am a huge Paul Rudd and steve carrel fan."
    },
    {
      "rating": "1",
      "text": "This was a very lazy sequel. They took every character and every gag from the first movie and just pushed it further outside of reality, and further outside of comedy. Without any semblance of reality grounding this film, the jokes float in a kind of vacuum of absurdity.There was almost nothing that can be described as clever about the writing of this film. There were too many incessant half-hearted jokes that mostly fell flat."
    },
    {
      "rating": "3",
      "text": "Watching this film was like watching a mom and dad trying to be funny. It was the typical American dumb-ass humor with no original story. The film might as well have been equipped with a laugh-track because I sure didn't know when to laugh."
    },
    {
      "rating": "5",
      "text": "I have loved Mckay's and Ferrell's last projects. The Other Guys, Step Brothers, Anchorman, The Campaign Etc. This movie was extremely poorly put together. The movie feels like two half thought films poorly edited into one single steaming mess. The film does not carry well, have a coherent story, and there is so much stupid there is no normality for contrast.\r It's not all bad, there were some scenes that I found laugh out loud hilarious, but they were largely drowned out by the constant stupidity. When every single character in the movie acts retarded it gets old fast and takes away from the characters that actually can pull it off well.\r Over all this feels like one of Ferrell's weird off brand projects that should have gone straight to DVD. Like a brain dead creation that should only grace the midnight slot of adult swim's drug induced comedic junk."
    },
    {
      "rating": "3",
      "text": "Disappointing. Hardly evoked a single laugh. The plot was okay but it got a bit too ridiculous at some points. E.g. the werewolf. The funniest joke was Dick Phuc. Enough said."
    },
    {
      "rating": "0",
      "text": "I really can't believe that there are ANY positive reviews for this movie. This movie was TERRIBLE. I barely laughed at all watching this movie. I did have high hopes going into the movie but also knew not to expect it to be as good as the first movie. But I couldn't believe how incredibly bad it was."
    },
    {
      "rating": "0",
      "text": "Obnoxious and profane does not equal funny to me. This movie also suffers from poor writing and acting. Did a 12 year old write this thing? Did an 8 year old direct it? I couldn't watch it to the end and turned it off an hour into it. Glad I only spent a dollar on it at red box. This movie is in the same class as Beverly Hills Ninja; wanted and expected it to be good but was a huge turkey"
    },
    {
      "rating": "2",
      "text": "The new definition of a 'bad movie'. The characters were parodies of themselves from the first film (which was great), and it's one of the only films I've actually had to walk out of due to the cringe-inducing 'jokes'."
    },
    {
      "rating": "2",
      "text": "Arguably less funny than Hannibal, this might be the least funny movie ever produced by Judd Apatow.\r I really had my hopes up because the first movie was quite funny and is always a good re-watch and the cast consists of some very funny people. I don't know what happened to the writing team, but it appears that they were convinced that the low-hanging fruit of obvious racial stereotype jokes would achieve some laughter (surprisingly it did work on some people around me).\r Not that jokes that go after stereotypes can't be funny, these were just executed so poorly it played like a film directed by a 12 year old Call of Duty player.\r The new characters in this film were incredibly one-dimensional and added nothing to the story or the humor. Ron's child was so annoying that I strongly debated leaving the theater the very moment he was introduced. The rival anchorman Jack Lime was so bad at acting that his humor felt forced to work with this writing style.. I just don't really know what to say. It was all so bad. I am an easy laugh, too.\r This is the first movie I have ever seen where I would have left had I gone alone. No question."
    },
    {
      "rating": "10",
      "text": "My only gripe with this film is that no comedy I'll ever see will live up to this fantastic standard.\rEvery joke was laugh out loud funny. Nothing fell flat, and the theater seemed like a happy family laughing together. I've never experienced a movie this gut-wrenchingly funny.\rThe plot is as hilarious as it is clever. The entire satire on how news works was great albeit predictable.\rThe characters are what you'd expect with some stellar additions.\rThe user score makes me question what film these other people saw because not one person I saw it with was anything below blown away..."
    },
    {
      "rating": "8",
      "text": "Close to the perfect comedy movie!  Every character you loved from the first one is back and better than ever!  Better than the original.  This movie will have you laughing so hard it hurts! So many cameos from such great actors during the fight scene.  Never a silent moment in the theatre!  Don't wait for the DVD/Blu-Ray.  See it as soon as possible,  you will not regret it."
    },
    {
      "rating": "3",
      "text": "I am a HUGE fan of the first movie and all the incredible new comedic ideas it brought to the table. I feel that the movie was very dry and choppy plus a lot of the jokes were dragged out. There were funny parts but they weren't anything new it could have been better."
    },
    {
      "rating": "3",
      "text": "Do not waste your time or money on this movie.  At the very least it does not need to be seen on the big screen.  The comedy is thin and infrequent.   The cameo appearances were fun, but the writing was unimaginative and cliche.  Although we were the most mature people in the theater, we laughed far more frequently than the younger people."
    },
    {
      "rating": "8",
      "text": "A sequel that absolutely delivers.  There were people in my advance screening who were falling out of their chairs, into the aisles. Typically in a sequel like this, the plot is a ridiculous contrivance, but Anchorman 2 is an exception  it's a pitch-perfect story, a logical extension of the first film. Other than one 10 minute soft spot toward the middle, the creative team keeps adding gas to the fire into the latter half of the film and it concludes with a flourish."
    },
    {
      "rating": "0",
      "text": "I love Anchorman, and I've seen it a million times... I've even memorized most of it. For those who don't know they actually killed the first Anchorman movie and redid it completely (Wikipedia). I tried watching the old version of the first film, it's horrible... hard to believe the next script for what is now part 1, is an epic comedy. I would argue that Anchorman 1 is one of the top 5 comedies of all time. Part 2, I can't really tell you, I walked out about 15 minutes in... it was bad. It has been edited from a rated R movie into a PG13 movie, and you can hear voice dubs over swear words, and the comedy is bad, I mean really bad. Nobody laughed at all, and jokes were flying by and crickets were heard. Ron B. has the best random lines and the improv in part 1 is liquid gold. Part 2 felt cheap and Ron B. felt like a different version of himself."
    },
    {
      "rating": "9",
      "text": "Anchorman 2 is an achingly funny, overlong comedy that takes the anarchic flavour of the first film and amplifies it. While it would have been nice to have seen a little more attention paid to the rest of the central cast, Ferrell does a fine job carrying most of the film’s considerable weight on his manly shoulders. Let’s hope we don’t have to wait another nine years for the next one."
    },
    {
      "rating": "2",
      "text": "Laughed my ass off at the original.  This one missed the mark, the majority of jokes fell on their face.  There were a few that made my wife and I laugh.  We were both thinking of leaving the theater but kept waiting/hoping for it to get better.   Not worth the money or time.  We were so very dissappointed."
    },
    {
      "rating": "3",
      "text": "It was so stupid. It didn't live up to my expectations after receiving solid reviews such as the ones displayed here. I smiled a few times, laughed a little maybe once or twice, but it's a very far cry from the original."
    },
    {
      "rating": "5",
      "text": "Don't get me wrong, I did laugh quite a bit during the first half.  Once  *spoilers* Ron became blind, the movie fell hard.  The end fight threw in a \"what the hell did I just watch\" feeling."
    },
    {
      "rating": "1",
      "text": "Created an account solely to express my disappointment at this movie. Apatow should be embarrassed. I wanted to walk out of this horrible waste of time. I saw it on New Years Eve and it skyrocketed to the worst movie of the year! In fact I think it may be the worst of 2014 also since this dreadful movie was on my mind past midnight. I'm sure the stars who made cameos will never do another Apatow cameo without seeing the rest of the movie first. I know Ferrell and his branded Anchorman but this was the most poorly written movie I've ever seen...and the clearly ad-libbed lines thrown in by the actors missed their marks as well. Carell surely didn't have to prepare for the nonsense he delivered. This was supposed to be a movie about the absurdity of 24/7 news...it quickly became a movie about how promotion and hype can sucker people into the theater to watch something in which the director puts as little creative thinking as possible into making."
    },
    {
      "rating": "0",
      "text": "This movie was extremely disappointing and I can't believe the positive reviews it's getting. It's easily the worst comedy I've ever seen and I found myself praying for it to end."
    },
    {
      "rating": "1",
      "text": "Anchorman 2 is a poor film in comparison to its predecessor. Most of the jokes involving Ron are over thought and try to hard. The story itself is far too jumpy and doesn't flow at all. Some key area plot lines in the opening hour aren't followed through and we jump to some ridiculous conclusions. I have given this one star for the initial performance of Steve Carrell as Brick he is funny but his jokes again go too far.\r Overall a good concept is ruined by poor jokes and trying to be funny it's just not natural."
    },
    {
      "rating": "0",
      "text": "A solid contender for Worst Movie of 2013. My wife dragged me to it, accompanied by another couple who, like her, are rabid Will Ferrell fans who loved the first Anchorman. At one point or another, each of us fell asleep, and when the film was over, my wife and her friends admitted they'd hated it.  There are long stretches where nothing funny happens, there are no belly laughs, and only a few half-decent gags.  Will Ferrell will bounce back with something worth seeing, I'm sure, but this clunker will contribute nothing to his reputation as a funny man."
    },
    {
      "rating": "0",
      "text": "Utter tripe. Stale jokes, recycled characters, boring plot.\rSometimes bad comedies still have a couple of redeeming features. This has none. The movie coasts along on the premise that it'll be saved by the big names on the cast list. Well, they phoned this one in, and it shows."
    },
    {
      "rating": "0",
      "text": "Ashamed.   The producers and cast of this movie created neither entertainment or a mild diversion of this this type of movie usually services.   It was an embarrassment for all associated.  In fact, I should have been paid to sit and watch this movie travesty  not the other way around at $44 for a family of four.   Not funny.  Hard to understand the garbled, gibberish lines uttered.  Poor jokes and some of the worst humor (if that what is was imaginable).  It was that bad.\r Don't go!"
    },
    {
      "rating": "3",
      "text": "Largely unfunny and such a waste of $1.25 from Redbox.  The jokes are just stupid and not original.  I did not even get to the end.  I fell asleep.  Boring and sad.  I am finding it really hard to get to beyond 150 characters."
    },
    {
      "rating": "9",
      "text": "As a massive fan of the original film, I approached this film with some anxiety. I was skeptical that this film could possibly live up to its predecessor. Thankfully, I was wrong, and Anchorman 2 is very good indeed, it's funny, charming and memorable.\r The storyline doesn't feel like a rehash, and the new 80's setting opens up a world of jokes for Ferrell and the gang to explore. Whether it's Ron's Ridiculous ego or Brick's crazed antics, the laughs keep coming.\r In many ways, Brick steals the show, he probably has the best lines in the movie, and this could be seen as an issue because a lot of people would expect Ron to be a central character. What's particularly noticeable is how Brick is a lot more funny than Champ and Brian in this one, rather than the comedy being more balanced. Don't get me wrong, they still have good moments but they needed a bit more.\r But is it better than the original? Equal, I would say. This is an achievement considering it's a sequel (and not only that, a comedy sequel) and they should be proud of what they have achieved.\r Loved the cameos too, but I won't spoil those!"
    },
    {
      "rating": "0",
      "text": "OMG this film is TERRIBLE. I loved anchorman and it's absurd humor but this doesn't even seem like it's written by the same person. Adam Mckay has really gone down hill recently. Every film after Stepbrothers has been awful. It's like the goblins stole his sense of humor while he slept.  They should make a fantasy adventure about him trying to get it back or something. I just wanted to cringe through most of it and I don't see how the blatantly racist humor could be viewed by anyone (other than racists) as funny. RIP Ron Burgundy in Olympus next to mighty Zeus himself."
    },
    {
      "rating": "10",
      "text": "I rarely find myself actually laughing out loud but my god the slap stick humour of this had me doing it non stop. I absolutely wouldn't recommend this for everyone, but say if you enjoyed the first Anchorman or the Earlier Adam Sandler movies this will probably have you hooked from the get go. Just.... maybe check your brain in at the ticket desk when you go to see it and pick it up again on the way out, ye'll both enjoy it far more that way haha."
    },
    {
      "rating": "8",
      "text": "The news team is back, and it's kind of a big deal! The highly anticipated sequel to the cult phenomenon, Anchorman, is finally here after a nine year hiatus and see's Will Ferrell reprise his most memorable role as eccentric newscaster, Ron Burgundy. And yes, with salon quality hair!\r The film is everything you'd expect from the comedy pairing of Adam McKay and Will Ferrell, and although not as good as the first film, it certainly has its moments with a fresh new storyline and an abundance of hilarious jokes. The film is just as silly as you'd hope, with Steve Carell saying 'There's little rhyme or reason to this world and that's what makes it so funny.'. With perms, a werewolf, ice skating jazz flute, a pet shark and Harrison Ford the film truly is, in the words of Carell and Paul Rudd, 'absurd', 'ridiculous' and 'inexplicable', that won't leave fans disappointed as one of the best comedies of the year.\r We pick up the story years on from the first film where, after hitting rock bottom and with the seventies over, the legendary news team reunite to take on New York City and the worlds first twenty four hour news network.\r Despite the film dragging in parts, the thing that really makes this movie is of course, what can only be described as, a truly flawless cast and the extraordinary characters they portray. The actors all expressed their deep admiration and love of working with one another, which comes through in their performances, and is a real joy to watch.\r The highlight of the film; however, is the climax which is quite simply mind blowing in its arsenal of heavyweight Hollywood actors, featuring cameo appearances from Harrison Ford, Sacha Baron Cohen, Will Smith and even Kanye West to name just a few from the explosion of talent. The only people they couldn't get were Oprah and president Obama!\r Ferrell's performance as Burgundy is bigger and better than ever with as much ignorance and narcissism as we've all come to love and admire. The other stand out performance of the film is Steve Carell as brainless weatherman Brick Tamland that is effortlessly delivered and simply hysterical. In one of the more touching moments of the film Brick finds love with an identically unintelligent character played by Kristen Wiig, leaving the nice message that there's someone out there for everyone. This storyline isn't without humor featuring a date at a vending machine, but that's definitely not for everyone!\r Harrison Ford's appearance in the film takes the concept of a deadpan performance to a whole new level of supremacy, which is sure to make you laugh, and adds to the weight of the already marvelous cast. Ferrell laughed 'He (Ford) hasn't seen the first Anchorman and I don't think he has any intention of seeing this one either!'. Carell stated his disappointment for not getting the chance to meet the Indiana Jones star with Adam McKay joking they 'banned him from the set.' and producer Judd Apatow adding 'Yeah, f**k that Steve Carell!'. All joking of course!\r Ferrell also discussed how the filmmaking process involves a large amount of improvisation. Carell commented how 'An environment was created in which we could venture off into the land of improv.'. Christina Applegate, who plays ambitious news anchor Veronica Corningstone, recalls the first cut being 'over three hours long' and the films director, Adam McKay, has expressed his intention of releasing a second cut of Anchorman 2, featuring 'the same plot and storyline but with entirely different jokes.'.\r When asked if another Anchorman film was in the pipeline Ferrell concluded that following The Lord of the Rings and Harry Potter there'd be 'at least fourteen' Anchorman films! The producers even hinted at the possibility of a Step Brothers sequel, reuniting Ferrell with John C. Reilly, something that McKay says will 'definitely' happen again. So with that, another cut of Anchorman 2 and twelve more sequels there's much to look forward to from these comedy titans.\r Anchorman 2: The Legend Continues hits UK cinemas December 18th and is the comedy to watch this Christmas."
    },
    {
      "rating": "5",
      "text": "Truly disappointing. Sure, there are some laughs---even a few really big laughs. But not nearly as many as the original film. The bits run on too long (including a fight scene near the end that should've been about 10% as long as it was), the characters' motivations are sometimes a mystery, and the plot is convoluted and shallow. I think McKay, et al, had far too many years to think about this movie---and so they tried to cram into it everything they could. The result is a sometimes funny, usually unfunny, bloated mess. I suspect it'll grow more charm upon a second or third viewing, but even then it won't come close to matching the original's genius."
    }
  ]
}