{"id": 4028, "title": "Anger Management", "starring": ["Adam Sandler", "Jack Nicholson"], "runtime": 106, "genre": ["Comedy"], "description": "After a small misunderstanding aboard an airplane escalates out of control, timid businessman Dave Buznik is ordered by the court to undergo anger management therapy at the hands of specialist Dr. Buddy Rydell. But when Buddy steps up his aggressive treatment by moving in, Dave goes from mild to wild as the unorthodox treatment wreaks havoc with his life.", "releaseYear": "2003", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/ezitJY9RTk3ReXc1nWhXjmU9cz0.jpg", "categories": {"plot": 6.176470588235294, "acting": 6.1, "ending": 6.363636363636363, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 6.0, "funny": 6.384615384615385, "action": 7.0}, "reviews": [{"rating": "10", "text": "I see no reason why a film like this shouldn't receive such brilliant reviews. When I watched it, I thought it was hilarious - I could never imagine Adam Sandler and Jack Nicholson as such a pairing. The antics that both of them get up to could knock me off my feet any time. I wouldn't say that this movie was peppered with just jokes about private parts, because it wasn't. This film had a deeper meaning than that, especially as it was one man's unexpected journey to find himself. Although that sounds a bit weird, it's true, but the fact it psychologically meaningful and still manages to pull off the most hilarious jokes, it's one of the best films of its kind."}, {"rating": "9", "text": "I loved this film. Adam Sandler is awesome (I am from NH so might be bias) but I will admit some of his films lagged a little. This movie though, unlike some others (ex. funny people, click) continued a strong, funny, good story all the way till the end. Nice little twist, good acting, and good story."}, {"rating": "9", "text": "A fantastic comedy with heart, all the characters acting are great, and it's just hilarious all the way through, if you a fan of Adam Sandler's other movies or just enjoy comedies then this is a must watch."}, {"rating": "10", "text": "Ibbininkigfytdrseatdvhbjknnkomkpommlmkouuyhvnbvcseqeyjggufyguinnomkkhfsxcnmuggihig"}, {"rating": "8", "text": "Nicholson and Sandler make for a good team in this hilarious comedy.  However it's Nicholson who steals the show.  Sander's just... well Adam Sandler."}, {"rating": "10", "text": "⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$"}, {"rating": "10", "text": "$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,》●》●》●》●》●》●》●》●》●》●》●》●》●》●》●》●"}, {"rating": "10", "text": "$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.》■》■》■》■》■》■》■》■》■》■》■》■》■》■》■》■"}, {"rating": "10", "text": "●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●:;;;:;:;:;:;;;;:::;;;;:::;;;;:::;:;:;:;:;;;;:::;:;:;:;;;"}, {"rating": "10", "text": "ohihyfhiugugguyfdgjgufigyrewryioolkmnhnbczfgdgjgdawetmbkhknojjooninjbingjghfhftdfyughiigdwr,,,,,,,,,,..........."}, {"rating": "10", "text": "♤♡♤♡♤♡♤♡♡♡♤♡♤♡♤♡♤♡♤♡♡♡♡♡♤♡♤♡♤♤♤♤♤♤♡¿¡¿¡》¿¡¿¡》¿¡¿¡》¿¡¿¡》¿¡¿¡》¿¡¿¡》¿¡¿¡》¿¡¿¡》¿¡¿¡》¿¡¿¡》"}, {"rating": "10", "text": "》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》¡********************************************************"}, {"rating": "10", "text": "----------------------------●●●●●●●●●●●●●●●●●●+×÷=+×÷=+×÷=+×÷=+×÷=+×÷=+×÷=+×÷÷♤♤♤♤♤♤♤♤♤♤♤♤♤♤♤"}, {"rating": "8", "text": "It has been a very, very long time since Adam Sandler was funny, if he ever was, but this is one of the first Adam Sandler comedies to realize this and understand how to use that fact to its advantage. By casting him as the clueless mild-mannered straight man and filling the rest of the movie out with genuine comedic talent in strong comedic roles  spearheaded by Jack Nicholson  we get to see something hilarious: Adam Sandler suffering at the hands of far more talented actors. The greatest Adam Sandler comedy ever is a Jack Nicholson comedy. Who knew? A solid addition to any comedic library."}, {"rating": "7", "text": "It was a funny film. It did fade quite a bit in the last 1/3 of the film but the parts before that were funny and made the film well worth watching. I enjoyed it."}, {"rating": "7", "text": "The acting was okay and some events were funny but most of the film, the characters the jokes and  the events are pretty cringe worthy and unnecessary.Overall a okay film."}, {"rating": "8", "text": "It's a hilarious comedy. My family and I watched it quite a few times and we laughed from start to finish. It's simply an enjoyable comedy, Not much more I can say about it."}, {"rating": "7", "text": "A nice built story. Great team Adam Sandler and Jack Nicholson. The jokes were funny enough. The theme 'i feel pretty' and the line 'goos-fra-ba' give a specific mark to this movie."}, {"rating": "8", "text": "I give this movie an 8 because it is a great movie that manages to make you laugh a lot. It is very funny and enjoyable, to say the least. Just when you think something will happen, something else happens. The monk part was very funny, and so was the jealous/dating scene. Nicholson made a great Anger Management supervisor, and the end was VERY surprising. You should see this movie, even if it has a 6."}, {"rating": "0", "text": "The worst movie I have seen.  And Adam Sandler is still out there somewhere with yet another  idea in his head that's ready to spit on the faces of moviegoers."}, {"rating": "6", "text": "Man gets into a \"situation\", wrongly accused of assault, goes on Anger Management course with wacky Doctor.Average comedy with Adam Sandler & Jack Nicholson on autopilot through most of the film. Lots of good cameos though & probably the funniest cat ever on film."}, {"rating": "6", "text": "Adam Sandler has had funnier movies, but this one does have some good moments. It doesn't draw a line at the ridiculousness, but that is what helps it be a mediocre comedy."}, {"rating": "0", "text": "Heard a lot about the film when it came out. The thing is much of the script is great, the acting is great, the general plot is great... This movie was ruined by the slapstick comedy, since it was so serious at some points, I would of just rather had a more serious movie. I genuinely felt sad for the main character. I'm sure a lot of homophobes are scared of trans women, but really, the old \"oh hey, I'm a girl... NOT\" thing isn't funny, if anything it's disturbing and downright tasteless. A few scenes were incredibly rushed and its glaringly obvious."}, {"rating": "5", "text": "A richly funny premise that suffers what every other Adam Sandler movie does: Adam Sandler. Jack Nicholson and his antics are hilarious and great fun."}, {"rating": "5", "text": "It has its moments, but the script doesn't go as far as it should."}, {"rating": "6", "text": "It's pretty funny throughout, but some of the film's unnecessary twists and turns seem to bog down the value of everything you're watching."}, {"rating": "7", "text": "Finally we may watch a decent movie starring Adam Sandler. The strong dynamic between him and Jack Nicholson successfully makes up for the film's largely dull plot and lack of ideas to move on, but again, as i just said, this is a DECENT movie that you may enjoy from Adam Sandler's collection of Razzle-Winning flicks."}, {"rating": "6", "text": "Anger Management: 6/10: Having a bad ending has torpedoed more than one film experience. The Village's twist was a groaner and the last scene of the Last Samurai knocked it down a rung or two. But in a comedy?\r Comedy is about laughter during the journey not the stories conclusion. None of our best comedies are known for their finales. Meet the Parents left with a comparative whimper, There's Something about Mary's ending is at best forgettable, and the bombastic over the top noise of say The Blues Brothers or Caddyshack certainly wasn't for everyone. (The exception to this rule is the wonderful Stay Puff marshmallow man payoff from Ghostbusters)\r Unlike thrillers or drama, comedy rarely invests enough in the plot to begin with for the ending to matter all that much. And an Adam Sandler comedy, lets face it, has less plot than most. (Or at the very least the same plot and characters over and over again. Sandler after all is the Jim Varney of Long Island nerds.) So to create a disaster this momentous you first need a good hour and change of comedy (rare enough esp. with Mr. Sandler on board) then you need an ending so stupendously bad it erases the laughter.\r Welcome to Anger Management. First the good news. This movie has some quite funny bits. The bad news well lets start with the last 15 minutes or so absolutely feel good romantic awfulness with enough celebrity cameos that could sink the Titanic, wipe out any goodwill one feels towards former Mayor Giulliani of New York and embarrass one to be a Yankee fan. Add on a plot device at the end that wouldn't be out of place in a Deanna Durbin film and let the jaw dropping awfulness commence.\r The last 15 minutes aside this movie has some really funny bits. Even stupid stuff like sweaters for overweight cats worked for me. Now that's rare. The set-up is pure gold and the cast is great.\r If anything Sandler is easily theweakest of the bunch. (Luis Guzman and John Turturro's characters needed their own movie and it was great seeing Jack be Jack again after that slog that was About Schmidt. Sandler knows how to do cruel. Anger Management was such a good concept and had such funny execution that it demanded a dark cruel outburst of energy at the end not this indescribably painful schmaltz."}, {"rating": "7", "text": "I am not a fan of Adam Sandler, I find he is good in the more dramatic films(Punch Drunk Love and Reign Over Me are his best performances to me) and save a few exceptions(Spanglish, The Wedding Singer and Happy Gilmore) I find him irritating in comedy. However, Anger Management is one of the exceptions, Sandler is quite good here but Jack Nicholson outshines him. The script is funny likewise with most of the gags(the describing-who-he-is scene), the story intriguing, the pace snappy in the first two thirds and the characters fairly likable. What lets Anger Management though are one or two scenes that don't quite work such as the basketball scene and a final third that is not only a little draggy compared to the first two-thirds but rather clichéd and cheesy too. Overall, entertaining and a better film than I anticipated. 7/10 Bethany Cox"}, {"rating": "7", "text": "I really enjoyed this one.  Adam and Jack were great together and it was hilarious.  I only knock it down a little because the ending or reveal is just stupid."}, {"rating": "2", "text": "Watching this was was such a chore and the only reason why I went through with it was because I was in awe of how comically bad this was."}, {"rating": "2", "text": "Anger Management is a comedy starring Adam Sandler and Jack Nicholson. Some parts of the movie are funny but Jack Nicholson and Adam Sandler don't really go well together as a film ingredient. It's like chalk and cheese and for the most part even though funny I think Anger Management fails as a movie even if the comedy elements work well."}, {"rating": "3", "text": ";-(..The film ran out of gas 1/4 the way through... Great cast as Jack Nicholson can be stunning as an oddball character, but Sandler just let him down, to held back, and the 'anger-allies' went nowhere ? Not enuff interaction with Marissa Tomei, and the Court Judge was unrealistic, also some jokes were actually sad, like the 'Olivier Newton-john bit, are the referring to the singer, very inappropriate! Also, on the plane, the \"this country is going through troubled times', really weird, to say that in 2003?? too serious also, sandler was a wimp. Overall, not many laughs and the far fetched...each character were a little much, and sandler was shy, TOO shy! Marissa Tomei was as always cute, but she"}, {"rating": "0", "text": "Absolute drivel. Not often i actually get angry watching a 'comedy', but this was insulting. Unbelievably bad. Jack comes across a sad parody of himself whil Sandler is exactly the same as in all his other films. I.E. the funny bit is where he loses his temper. Yaaawwwwn!"}, {"rating": "7", "text": "This is funny at points but i hate critics. Happy gilmore gets a terrible review but this gets an ok review Happy Gilmore is a Classic and this is just funny."}, {"rating": "7", "text": "Pretty good movie. I was angry, mad, surprised, and laughed a lot. Whos's that pretty girl in that window there....What window where! Lol!"}, {"rating": "10", "text": "☆¿☆¿☆¿☆¿☆¿☆¿☆¿☆¿☆¿☆¿☆¿☆¿☆¿☆¿☆¿☆¿☆¿☆¿☆¿☆¿☆¿☆+++++++++++++++++++++++++++++*:*:*:*:*:*:*:*:*:*:*:*:*:*"}, {"rating": "8", "text": "Even if people dislike this Adam Sandler movie, you can't love but see Jack Nicolson and Sandler together in this film."}], "recommendations": ["the_wedding_ringer", "wedding_crashers", "date_night", "identity_thief", "central_intelligence", "dodgeball_a_true_underdog_story", "forgetting_sarah_marshall", "the_longest_yard", "masterminds", "meet_the_parents", "horrible_bosses_2", "50_first_dates", "tower_heist", "horrible_bosses", "zoolander", "get_smart", "the_break_up", "tammy", "ride_along", "little_fockers", "role_models", "step_brothers", "neighbors", "30_minutes_or_less", "the_other_guys"]}