{
  "id": 1317,
  "title": "Angel Has Fallen",
  "starring": [
    "Gerard Butler",
    "Morgan Freeman"
  ],
  "runtime": 122,
  "genre": [
    "Action",
    "Thriller"
  ],
  "description": "After a treacherous attack, Secret Service agent Mike Banning is charged with attempting to assassinate President Trumbull. Chased by his own colleagues and the FBI, Banning begins a race against the clock to clear his name.",
  "releaseYear": "2019",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/fapXd3v9qTcNBTm39ZC4KUVQDNf.jpg",
  "categories": {
    "plot": 6.052631578947368,
    "acting": 6.75,
    "ending": 7.0,
    "soundtrack": 7.0,
    "cinematography": 6.333333333333333,
    "familyFriendly": 3.0,
    "funny": 5.666666666666667,
    "action": 7.295454545454546
  },
  "reviews": [
    {
      "rating": "7",
      "text": "This is a fast-moving summer popcorn movie with a personable cast that you can spend an enjoyable afternoon or evening with and get out of the heat and humidity – and political reality. Everyone in the cast was fun to watch (including Gerard Butler, Morgan Freeman, Danny Huston, and Nick Nolte), but don’t expect anything more than a lot of roller-coaster action and the comforting feeling that movie politics has its villains but they don’t win in the end."
    },
    {
      "rating": "8",
      "text": "Similar to the fugitive just not that great but has some good actions sequences and Morgan Freeman is one of the highlights of the movie"
    },
    {
      "rating": "10",
      "text": "I loved the movie. The action scenes, and i loved when nick nolte bombed them all. He was funny!"
    },
    {
      "rating": "5",
      "text": "In 2003 Gerard Butler starred in \"Timeline\" and the next year \"The Phantom of the Opera\" and was on his way to being a top star. It seemed after the mixed reviews for Phantom something went wrong though he has made a good living overall making a total of 42 movies of which the last dozen have mainly been in the action genre which \"Angel Has Fallen\" definitely fits. All in all it probably has one of the highest body counts, countless violent scenes and surprise, surprise a few, very few, quiet scenes first with his wife and baby and then with his father, the latter played by Nick Nolte, who I have been a fan of since 1974 on television in \"Rich Man, Poor Man\"."
    },
    {
      "rating": "7",
      "text": "The Fallen franchise deviates from the previous installments by taking a page from The Fugitive and having Secret Service member Mike Banning (Gerard Butler) framed for treason and having to go on the run to find who set him up. This is a generally entertaining film, but I found that there was a strangely interesting balance of several good and bad aspects.This was a lot more tonally balanced than the previous two films. Olympus has Fallen was weirdly cynical for a save-the-hostages film. London has Fallen unsuccessfully tried to involve both moral greyness and jingoism not to mention that there were a couple moments where Banning seemed to take a little TOO much pleasure in punishing the enemy. Here, I could mostly just sit back and enjoy myself without questioning anything.However, the basic story is CONSPIRACY ACTION MOVIE 101; nothing particularly new. I did like the script's attempts, albeit merely for entertainment reasons, of looking at the war machine and interference vs. non-interference.Butler's still got it as Banning. Nick Nolte is a fun new addition as Banning's reclusive survivalist, anti-government father. The villains if not outstanding are smart and provide a reasonable threat with some neat tricks up their sleeves.The action is quite good, especially the opening attack and the final confrontation. Thought the lighting is pretty grey, especially considering the first film, but it suits the tone here. Director Ric Roman Waugh (who helmed The Snitch with The Rock) has a good eye for visuals and settings.The camera work is distracting. There is way too much shaky cam not to mention a couple misplace quick pans. This even happens when people are just having everyday conversations. Also, there's a car chase with way too many interior shots of inside the cars than the action you actually want to see.I definitely think this is better than London has Fallen. Though not the greatest action movie ever made, this is a good time-waster."
    },
    {
      "rating": "3",
      "text": "What did you expect?I mean, seriously, when is Hollywood gonna understand that this kind of movies only damage their reputation?It's a film filled with a formulaic script, loud and badly filmed action and uninteresting characters. You could say that Morgan Freeman and Gerard Butler deliver fine performances, but... for Christ's sake, does that even matter? When a movie so unoriginal as this one wastes 2 hours of your precious life, do you even care whether the actors were good?This is the sort of nonsense that should not have been greenlighted.Garbage.3/10."
    },
    {
      "rating": "10",
      "text": "This was the best of the series. I LOVED this from start to finish! The chemistry with the actors, the real feel of everything going on and edge of your seat action from the beginning. I would see it in theaters again, and I NEVER say that."
    },
    {
      "rating": "8",
      "text": "Ric Roman Waugh's \"Angel Has Fallen\" is a ridiculously entertaining, often hilarious, and thrilling action flick that embraces its absurdity, while also developing its characters. An absolutely surprising summer delight."
    },
    {
      "rating": "3",
      "text": "Loud action sequel to the first 2 'Fallen' films is instantly forgettable but will at least keep you awake.   Poor dialogue will have you shaking your head or laughing despite the almost compelling plot hidden by fast, loud, and violent action sequences. And who can resist Manning finding his father Clay, played by Nick Nolte, who is given too little screen time."
    },
    {
      "rating": "7",
      "text": "Some really neat special effects but the story line is getting a bit stale.  Nic Nolte was a nice addition to help spice it up.  Overall good action but writers need to come up with a new theme."
    },
    {
      "rating": "7",
      "text": "\"Angel Has Fallen\" is an all-out action film and it doesn't try to be anything else, I feel that's a part of its charm, everything nowadays is politicized even dramas, why can't we have an old fashion solo gun-wielding hero that always comes up on top, This film is reminiscing of that and that's exactly why it just works.All of that combined with a strong cast led by two great actors spells out good entertainment from the discovering the leads build-up to the flawless action sequences. A solid thriller packed with action, that pretty much sums up the whole thing."
    },
    {
      "rating": "5",
      "text": "Waugh fares better with the action scenes trading London's desire to punch a pyrotechnic explosion surplus in the ' 80s fashion. (Not a poor thing.) But while Angel provides a few possibly memorable set pieces — a chase involving police vehicles and a stolen semi, an assault on Clay's cabin led the ancient coot to launch an inferno of booby traps, and lastly a multi-story all-white company lobby directly from a Michael Mann film. They all fall victim to excessive repetitive editing and inadequate kinetic energy, a problem that no quantity of firepower on-screen, twisted wreckage, or off-beat camera angles can solve. However, a sequel that is just a pedestrian is a drastic improvement considering the awfulness of its predecessor, which was the pick of this publication for the worst movie in 2016."
    },
    {
      "rating": "10",
      "text": "Great movie! Gerard Butler is fantastic. The absence of previous key characters is noticeable but the addition of Mike's father is a big bonus"
    },
    {
      "rating": "7",
      "text": "A pretty entertaining movie but not the most original story. The acting from Nick Nolte was phenomenal. Jada Pinkett Smith, Gerard Butler, Morgan Freeman, and Piper Perabo also gave terrific performances. The action sequences and visual effects were awesome. The music was great. This is one of my favorite action movies of 2019."
    },
    {
      "rating": "1",
      "text": "Completely terrible thriller that somehow manages to be even less entertaining than the previous two. Awful acting, boring action and an eye-rolling plot."
    },
    {
      "rating": "2",
      "text": "Film prevedibile, pieno di clichè e con una regia ai limiti dell'orrido. Tra scavalcamenti di campo e scene d'azione confusionarie e incomprensibili Angel Has fallen è uno dei peggiori (se non il peggiore) film dell'anno."
    },
    {
      "rating": "8",
      "text": "So much better than the critics gave it credit for. The action is fantastic, the sound design is incredible (think gunshots from HEAT, and explosions from... can't think of a better series of explosion sounds), and Butler is fantastic.  I absolutely recommend this.  I had expected utter crap - was just looking forward to my theater food.  I scored - the  soft pretzel was amazing, the vanilla shake was on point, and the movie got a BIG round of applause from my theater.  Go see it!"
    },
    {
      "rating": "7",
      "text": "Not a bad movie at all. Action scenes are good. The movie is a little different compared to previous two but still watchable, it's almost like Taken 3 storyline but with more actions."
    },
    {
      "rating": "4",
      "text": "The action was decent, but the screenwriter made everyone sound the same by having them all indescriminately use the f-bomb (even main character's otherwise classy wife). EVERYONE used the f-bomb, but in real life, most people don't. I'm guessing it's a favorite word of the writer."
    },
    {
      "rating": "5",
      "text": "Considered to be the best of the “Has Fallen” trilogy though that’s not exactly high praiseIf you are at all surprised by anything that happens in Angel Has Fallen then you really haven’t been paying attention. Secret Service Agent Mike Banning (Gerard Butler) is framed for an attempted assassination of President Trumbull (yes you read that right) played by Morgan Freeman. Banning must now try to prove his innocence while trying to uncover the real threat. Gerard is back doing what he does best, growling and punching his way through yet another generic action movie that starts to feel like a video game on more than one occasion.Butler and Freeman are clearly just here for the paycheck, in fact Morgan Freeman downright admitted that so I can’t be mad really. Though action movies in recent years have raised the bar, (looking at you Mission Impossible Fallout) if they keep churning out these mindless action movies will anyone bother anymore? Honestly the only reason anyone is bothering with Angel Has Fallen in the first place is it’s the third film (yeah I know how did that happen?) in a franchise starring everyone’s favourite knuckle head Gerard Butler. What it lacks, it almost makes up for in entertainment even if it is twenty minutes too long. The action sequences are well done and frequent enough to keep you interested and the addition of Nick Nolte was strangely hilarious. Perhaps Angel Has Fallen wasn’t supposed to be this funny but it’s enough to move it into the “so bad it’s good” category. Now I’m sure some of you are wondering whether you can see Angel Has Fallen without seeing the previous two movies in the franchise and the answer to that is yes you can. Recommended for the Gerard Butler fans or anyone needing your weekly cinema fix."
    },
    {
      "rating": "9",
      "text": "A very solid action flick with believable story line and no gimmicks. Thoroughly enjoyed it even more than the previous installments"
    },
    {
      "rating": "4",
      "text": "I've been disappointed. A good story, but effects not up to par. Politics and economics this war this physically finished as finely as a movie of the 90sJ'ai été déçu. Une bonne histoire, mais des effets pas à la hauteur. Politique et économique cette guerre ce fini physiquement aussi finement qu'un film des années 90"
    },
    {
      "rating": "4",
      "text": "It's remarkable that this has become a trilogy but on the other hand it's more of the same.If you have already seen the first two and liked them, it's obvious that you will also like this one, but if somehow you expected something different, the error of your expectations lies only with you."
    },
    {
      "rating": "9",
      "text": "Underrated film. Well constructed with top action scenes. Never a boring moment and flows well. Top cast!"
    },
    {
      "rating": "10",
      "text": "You saved the BEST for last Gerard?If you want ACTION, and a lot it - this is the movie for you!!It's the movie to see, and you won't be disappointed!Damn the critics!"
    },
    {
      "rating": "9",
      "text": "Great story. Nice to see him as a family man. Much humor always good. Great movie"
    },
    {
      "rating": "10",
      "text": "When we think of iconic action heroes, the names that come to mind are John McLain, Rambo, or Jack Bauer, but what about Mike Banning? For a third time, Mike Banning (Gerard Butler) has proven himself to be the only thing standing between the U.S. President and assassination, only this time, he's also a target. In the third installment of the fallen series, Mike Banning saves the president from a drone attack, only to wake up in the hospital to find himself under arrest, accused of planning the whole thing. Now Banning must escape and find out who set him up, before they get to him and finish the job they tried to pin on him. Unlike most trilogies, every single one of these films is terrific, and despite different writers and directors, it has never lost it's edge. In choosing a favorite however, I picked this one, because it was so much different than the rest. Not only is Banning on the other side and in the position of trying to save himself as well as the President, but they bring his family into the story. We finally meet his estranged father, played masterfully by Nick Nolte. A paranoid former veteran living in the woods, the elder Banning is an absolute riot and brings much needed levity to a series that already given us so much. People will look at this and say it's just another action movie, just another attempt by Hollywood to continue to cash in on a successful movie, and normally I'd agree, but not this time. Angel Has Fallen not only features the new face of action films, but it also offers edge of your seat action, a compelling and dramatic story, as well as a little bit of humor, all things that you're normally hard pressed to find in just another action film. That's why we're labeling this one a must see movie!"
    },
    {
      "rating": "5",
      "text": "I enjoyed the first two “Fallen” films but this one is only ok. For being rated R and costing $80 million, it sure has little blood and looks *awful* (a GameCube cutscene has better SFX)."
    },
    {
      "rating": "3",
      "text": "Nick Nolte plays a grumpy old guy who blows up a score of bad dudes in a confrontation on a mountaintop that is a somewhat reminiscent of the first Rambo movie. That is the only fun part of the movie and, alas, very short. It is why I gave it a three, instead of a two.There is also another guy in this movie, played by Butler. He is an ailing secret service guy past his prime. Despite that he kicks the butts of men half his age, and outwits everyone. Not because he is smart, but because he has plot armor and plot brains and everyone else is shockingly dumb or incompetent. This is how you write a story when you are unable to make a smart guy do smart things. He basically just runs to some place and survives everything with nary a scratch. At one moment he actually runs into a room where a bad guy has the drop on him. But the bad guy waits for Butler to shoot him.There are so few surprises that it actually surprised me. It takes half a braincell to figure out who the evil guy is behind it all, how the story would develop and how it would end. It was so unsurprising that I actually braced for a twist of some kind, but once the bad guy's voice was being warped when talking to the second main bad guy, I knew it was as bad as I thought it would be. This was just done for the audience.The biggest surprise for me is that three people wrote the script. It is amazing that you need three writers to write a by the numbers story with characters that have no depth or arch and a story that is as shallow as politician's promise.A terrible movie."
    },
    {
      "rating": "7",
      "text": "With Angel Has Fallen, I expected far less than what was actually delivered. This film has a lot of heart and sports the feel of a good 'ol 80's-90's era action thriller. While there is never anything truly outstanding in the screenplay or the choreography, it knows the beats and when to hit them. The A star hollywood cast were OK overall with Nolte delivering the best performance on screen."
    },
    {
      "rating": "9",
      "text": "When you see a movie that doesnt makes you miss the first one, it deserves a good rating. Eventhough i preferred the other president."
    },
    {
      "rating": "8",
      "text": "I enjoyed it. I like its action and this is an action movie so based on that it was good. Had fun scenes, maybe plot towards end got a bit weird but for action movie I think not that bad."
    },
    {
      "rating": "2",
      "text": "Formulaic, Hollywood pap tied up in a formulaic, Hollywood bow. The people you think are the bad guys, are... the people you think will be redeemed, will be... all in the most predictable, mind-numbing, contrived, explosion-filled way possible. If you like all that, then this movie is for you, but I can't stand it. I gave it a 2 instead of 1 because of production values and a couple of brief moments that didn't feel like the actors were just completely phoning it in. Honestly, just a waste of time."
    },
    {
      "rating": "4",
      "text": "Totalmente predecible, sin imaginación, guionistas sacan ideas de call of duty y otras películas... Soy condescendiente con las películas de acción pero está da pena ajena"
    },
    {
      "rating": "7",
      "text": "Left F&F:H&S for Angel. I havent seen any of the others and I dont know if they are connected ( Olympus or whatever tha eff). As opposed to F&F, Angel is a classic action film. There were a lot of surprises for me. Jada Pinkett Smith as a sour face FBI Head is perfect. Nick Nolte as the dad of the Gerard Butler  character was cool,( mainly because I thiught Nick Nolte was dead). He had the best lines and delivered.  Plus he still gave a great performance with a voice thay sounds like he chews glass for fun. It was shot reallu cool like a surveillance op, with a nod to current news coverage styles. I would watch it again."
    },
    {
      "rating": "7",
      "text": "Esse novo filme é no mesmo nivel dos outros dois, nada revolucionario, mais a ação boa e a cena no inicio dos credito é engraçada"
    },
    {
      "rating": "4",
      "text": "Obvious Villain tries to kill President. Villain has non-existing super weapons and kills everyone except hero and president. Hero survives and saves the day. And Gerard Butler looks more unhealthy by the minute. Dumb."
    },
    {
      "rating": "6",
      "text": "(Mauro Lanari)Old school action movie for nostalgics? Yes, and I am proud of it, while it was the second chapter that betrayed the tradition."
    },
    {
      "rating": "10",
      "text": "Doesn't matter what critics say it was highly intense thrilling and awesome movie filled with great action,music and great acting by everyone!starting was literally boring and slow but after sometime the pace will be edge of the seat felt literally nail biting amazing to watch he's father bought some laughs!they can make it more intense if they went on keep the vice president reveled after some time or ending would have been more intense to see but overall great movie!"
    },
    {
      "rating": "10",
      "text": "This was a great action packed, beautiful story line with even a great acting baby. I urge all to go see it."
    },
    {
      "rating": "8",
      "text": "Great action and cast. This movie is stuffed with cool scenes and way better than the other parts of this series mainly because the main character gets more background.Besides this, the movie had a couple plot twists I did not expect. Go see it!"
    },
    {
      "rating": "7",
      "text": "Entertaining movie, It’s not great but it’s pretty good. For what it is, they did a good job."
    },
    {
      "rating": "10",
      "text": "Angel Has Fallen One Of the best action MoviesOf Course With Olympus Has Fallen & London Has Fallen"
    },
    {
      "rating": "6",
      "text": "A Movie from America for America ;). Lot of Action, Conspiracy, corrupt Government and.. of course.. Morgan Freeman as President."
    },
    {
      "rating": "7",
      "text": "Angel Has Fallen's take on the classic 80s individual heroes cliché isn't as horrible as one might imagine, given the similarities and qualities of the prequel and debut, but perhaps what we can all agree on is that Mike Banning's trip on the big screen is growing rougher and tougher."
    },
    {
      "rating": "10",
      "text": "Nice to see that a film in this series has been treated fairly by the public for once. It's a shame the same can't be said for the critics. No supprised there. Great, not as good as the last, but still a joyride. Or rather, a bombride."
    }
  ],
  "recommendations": [
    "the_mechanic",
    "skyscraper",
    "the_equalizer",
    "mission_impossible_iii",
    "the_ice_road",
    "shooter",
    "the_commuter",
    "2_guns",
    "run_all_night",
    "mechanic_resurrection",
    "escape_plan",
    "kingsman_the_golden_circle",
    "the_expendables_3",
    "nobody",
    "salt",
    "iron_man_2",
    "xxx_return_of_xander_cage",
    "the_fate_of_the_furious",
    "from_paris_with_love",
    "infinite",
    "bloodshot",
    "lockout",
    "the_last_stand",
    "jack_reacher_never_go_back",
    "the_taking_of_pelham_1_2_3"
  ]
}