{"id": 550, "title": "Annabelle Comes Home", "starring": ["Vera Farmiga", "Patrick Wilson"], "runtime": 106, "genre": ["Horror", "Mystery", "Thriller"], "description": "Determined to keep Annabelle from wreaking more havoc, demonologists Ed and Lorraine Warren bring the possessed doll to the locked artifacts room in their home, placing her “safely” behind sacred glass and enlisting a priest’s holy blessing. But an unholy night of horror awaits as Annabelle awakens the evil spirits in the room, who all set their sights on a new target—the Warrens' ten-year-old daughter, Judy, and her friends.", "releaseYear": "2019", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/qWsHMrbg9DsBY3bCMk9jyYCRVRs.jpg", "categories": {"plot": 6.027027027027027, "acting": 5.928571428571429, "ending": 5.6875, "soundtrack": 5.0, "cinematography": 6.666666666666667, "familyFriendly": 3.0, "funny": 5.375, "action": 8.0}, "reviews": [{"rating": "3", "text": "This movie is so bad I don’t like This movie The previous chapter is better than this chapter"}, {"rating": "3", "text": "Es malisima los efectos especiales no da miedo , los personajes no tienen carisma por lo que no nos hacen sentir que no queramos que mueran, usa el humor para despues dar miedo y lo peor esque no lo consigue, los espectadores parecian que estaban viendo un comedia de lo mal echa que esta, y el final recordaba al final de Annabelle la creacion"}, {"rating": "4", "text": "Annabelle Comes Home is a frustrating movie for me and a big disappointment compared to it’s predecessor. The writing, directing and story really lack the finesse that they had in Creation and the acting doesn’t really do too much to get around this. The entire movie revolves around character curiosity and stupidity which makes this movie feel really inconsequential with regards to both the franchise and the Conjuring universe at large. ACH didn’t need to happen and only happened because of the actions of one character in the movie, which makes it feel like it was just made just to get some money out of fans of the previous two movies and the Conjuring universe. The film doesn’t progress the storyline of the franchise or universe and only ties into the other movies at one moment that doesn’t add much to the movie or the story. The worst part is that even the scares themselves aren’t too good; they’re really cliche and are jump scares for the most part, so the horror in this movie is pretty boring and uninteresting which makes a lot of it feel like a drag. There is a cheesy romance plot that attempts to distract from the scary stuff but more succeeds in making the film cringey and awkward at times, a not nice juxtaposition to the so-so horror that dominates the rest of the movie. The acting is ok but nothing special and doesn’t add much emotion or depth to the movie and makes a lot of the dialogue and interactions fairly uninteresting. There are a few redeeming qualities, though. The end is decent and “sweet” in a way I didn’t expect, wraps the movie up nicely, and manages to contain some lessons for the viewers and characters. Those lessons are cliche and generic, but they are still important lessons about life and how to not cause really bad situations, so the movie does attempt to redeem itself from the boredom that dominates a lot of it and tries to prevent situations like ACH from happening again in the franchise. Patrick Wilson and Vera Farmiga, although they’re not in a lot of the movie, are welcome faces and highlights in the parts of the movie that they’re in and yet again do a great job portraying Ed and Lorraine Warren. It’s nice to see them in parent and mentoring rather than paranormal investigator roles; it’s a breath of fresh air and a nice part of this movie. Overall, while ACH does have a few good things in it, for the most part it’s a big letdown from its predecessor and is a bit boring and unengaging."}, {"rating": "8", "text": "Annabelle Comes Home has the titular possessed doll causing a ruckus in the Warren's collection of cursed objects unleasing the creatures in the house in what the creators call a scary version of Night at the Museum. What ensues, while not the scariest film in the Conjuring-verse, is a fun experience.This movie is more upbeat than the last two Annabelle movies (including a few funny lines.) Kind of surprising considering that this is written and directed by Gary Dauberman, who wrote the last two films. The ending to the last film is one of the darkest in the Conjuring franchise, so Dauberman's pivot is surprising. However, since this revolves around the house and daughter (Mckenna Grace) of the stars of the main film line, I can see why Dauberman didn't want to do anything that would really rock the boat and affect them in the long run. Also, it'd just be hard to compete with the tone of the last film, which in my opinon was the best.Understand that when I say this is more upbeat, I'm not saying this film isn't scary. It just has more of a popcorn/funhouse horror feel. Ever since the Warrens' collection of possessed and cursed objects was introduced, I think everyone has been itching to explore them more, and you definitely get your payoff. There are some pretty creepy ghosts in here, including one inventive being that isn't in the commercials and I won't spoil.I do wish the other ghosts were given more to do. Annabelle still bears the load. I just wanted to see the ghosts have some more physicality and violence. (Yes, the samurai armor from the earlier films is still in the collection. No, it doesn't unsheathe it's sword. I know, right?!) Also, there is one ghost who mostly tangles with Michael Cimino's character that is mostly done using computer animation and doesn't work as well as the other more practical-looking monsters.Considering that this is a first time director, this looks pretty nice. There are some nicely shot scares. They don't compete with the best of the series, but they work. A lot of thought must have went into the set design. This really looks like it takes place during the seventies.The three main leads are pretty likable, especially Katie Sarife's character. At first you worry that she's the stereotypical party friend to the lead who makes bad decisions. Yeah, she kind of does that latter part, but her character goes in a way that is unexpected and fleshes her out.If you were looking forward to seeing Lorraine (Vera Farmiga) and Ed Warren (Patrick WIlson), be prepared that they really aren't in this that much.I'd rank this above Annabelle 1, The Nun, and La Llorona, and below the Conjurings and Annabelle Creation. This isn't the scariest or most technically proficient film in the franchise, but this doesn't miss by that much. If you're just looking for something visually interesting that is just trying to entertain, then I recommend this."}, {"rating": "6", "text": "The franchise has been through a lot of ups and downs, and this is up there, I am exhausted and thrilled and properly conjured by the Universe.Anabelle Comes HomeDauberman has wisely left his signature business out of this house. As a result, the Conjuring Universe finds its not-only-stable but one brisky tale that comes with a caution of \"brace yourself\" after a long time. This franchise fascinates me. Let me put it that way simply. For somehow within its flaws and incompetency, this series contradicts itself perpetually. And there is something honestly raw and ambitious about it. Just like those so called spirits, a chapter every now and then pops up with a tremendous strength and manages to take all the attention for granted resulting into a mano-y-mano experience of western style filmmaking in the end.And that is why, the high points of the series, the good chapters, are the one that can be related personally by the viewers. Not by the characters, for somehow every installment always ends up maniacally breaking the most closest relations of the characters. And this one stands tall in that matter. The formula is so simple and yet so effective. The pseudo reaction to the infamous Warren couple's (Vera Farmiga and Patrick Wilson) work casts a muttering inexpressible and unnoticeable impact on their daughter- which is exaggerated smarty by introducing this chapter- Judy Warren played powerfully by McKenna Grace.I don't know how to express Grace, but let me try starting by the crux of the Universe that ignited all this fandom, Farmiga. And I am a part of it. Farmiga is my kryptonite. I accept it gracefully. Not because I hold Jason Reitman's Up In The Air, dearly, but in fact it came from this very role of hers. My mother says her behaviour is bizarrely similar to my grandmother, whom I never met. And the way she sees those dead beings through and through like some transparent being- irony!- no one in the franchise has managed to embody that emotionally welcoming firmness.Grace glances at those no-good doers with the same sharpness. She lacks the humility and pain in her looks but it fits in perfectly, since she is inexperienced and new to the field. This is why I would lean towards all the assumptions made in the franchise with enthusiasm and gullibility. The Universe that curses and creates and conjures, there is not a single scratch on the real life based characters that it whispers about. Their behaviour, language and characteristics speaks more about this demonic world than any of the cases ever could. Ergo, the franchise despite taking lethal blows, enters the 12th round every night.Also, I wonder why the live screen time feels more personal and easily adaptable than your average narration. I mean, every now and then it does and has to strain. And it does here, too. But I don't mind it. Not the build up nor the anticipation of the screams and gasps. I respect the teasing game especially when it doesn't reveal its trump card. And after this franchise, I can understand that even ignorance is a part of the game. Anabelle Comes Home with the best gift wrapped around her tiny wooden cold hands, it is everything you dream of, every nightmare."}, {"rating": "3", "text": "Definitely the current horror is in crisis. This looks more like a comedy movie with so many \"funny\" moments. A werewolf, really?"}, {"rating": "8", "text": "7.8/10 The third film in the Annabelle series marks Gary Dauberman's directorial debut and it's a good start for the seasoned and acclaimed horror writer. This story does echo familiar with certain thematics/aspects that we've seen in this film universe, with youth being the focal point surrounded by the paranormal phenomenon. The plot does take a little bit of time to develop and maybe spends too much time trying to develop some of the characters before anything really exciting does happen. Once things do start going bump, it does get very fast paced and thoroughly foreboding at times all while staying grounded with the plot.The overall setting of the Warren house fits the particular story very well and adds nice substance with the artifacts room. The late 60s ambience is perfectly done and sets a terrific tone, and the lighting/ camera work is phenomenal as usual for the series. There are many different callbacks to other films in the universe with familiar entities as well as a few new very creepy ones making frightful sporadic appearances. It almost acts as a conjuring universe greatest hits if you will which isn't a bad thing and was actually quite fun. The finale finishes off the film in excellent fashion with with a fantastic culmination of events, and once again I was left wanting more for the series, be it another Annabelle or the upcoming conjuring 3.Some of the scares also get a little bit cliché at times but they do enough to keep them fresh a majority of the time. Overall this gets the conjuring universe back on track after the last 2 middling to decent films released (The Nun/La LLorona). If you enjoy the series/universe, this is a must see."}, {"rating": "5", "text": "I can’t really call this a bad film, but it was disappointing because there was so little of the original actors and so much of their daughter and her teenage friends and their annoying preoccupations. That said, these were better teen actors than usual although what they were up to most of the time was not what horror fans are interested in (e.g., baking a birthday cake). This franchise is still well done, but it is turning away from horror and towards teen angst, so true horror fans may want to avoid the inevitable “next one.”"}, {"rating": "7", "text": "Welcome to the Warrens’ House of Horrors!  A young woman unleashes a host of evil on the house and we get to spend the night with our heroines as they try to survive the unleashed evil.  Great story and lots of fun to watch.  My big question is why don’t they turn on the lights!  I may have missed something having to do with that... Some very suspenseful moments!"}, {"rating": "5", "text": "Since The Conjuring 2 I had already thought a lot about the tone and style that this horror franchise was using on all of its stories and this new film has really made it clear to me that it's no longer a horror style, but The Conjuring horror style.I say this because the franchise has already stripped away any trace and desire to do something different. There was never innovation of course but at least The Conjuring 1 and 2 are redeemable.The rest of the films that have been made in this film universe are of a very poor quality, only Annabelle Creation deserves a more positive opinion.It's clear to me that this type of horror has become a stamp and guide for much of the audience. People like it and the studio knows it very well. The focus of this franchise is spend little, give them the same a little scrambled and they will continue to consume it.Annabelle Comes Home is not what I would call a frontal failure but it shows once more the shortcomings of these films to build better stories.The plot is practically nonexistent and we only see a continuous succession of events to try to justify the whole thing and whether you want it or not, that damages the film. At least for those who are more interested in seeing something more than noise and figures in the dark background followed by predictable jump scares.I honestly think this franchise has already exhausted its ''charm'' and they're not doing anything relevant anymore. Yes, these films are a monetary success, but that doesn't mean quality at all."}, {"rating": "7", "text": "Honestly an overall great movie, even though in these horror movies the oblivious naive crap is annoying LOL Nonetheless, it was quite an interesting watch and super cool special effects. Loved how they potentially introduced some brand new monsters for future movies. This felt like the Thanos boss battle of the conjuring LOL Pretty excited for future movies and hope they keep going with this peculiar universe!"}, {"rating": "3", "text": "Just why? I love the original Conjuring movies, but this is ludicrous... I understand making a franchise that is sustainable, so you can earn more money. If you like this film, what would this say about you as a person?"}, {"rating": "0", "text": "Omg!! I lost my money that movie was so boring I thought that it was going to be a good one but they liked us thanks for this Stop doing movies like this"}, {"rating": "0", "text": "The most disgusting movie I've ever seen!!! VERY VERY BAD movie!!! Don't even start looking!!!"}, {"rating": "7", "text": "First of all, the pacing in this film was pretty bad. They spent a really long time focusing on the three characters that this haunting was going to happen to and in the end just made it really boring. People could argue that it’s so we will care about them when everything goes down but it doesn’t work or at least in my case. This also leads to a super quick ending that just wraps up awkwardly. Also, I can’t hate on the film too much because it is Gary Dauberman’s first time directing but I think he overkilled it with the whole tension build up during some scenes. Because there was a long build up to something it just lost its scare factor in some cases. The ending felt like three completely different films just mixed into one as if this one wouldn’t make enough to make the other two. This isn’t that big of a deal but to the person in charge of making the house match up with the others failed. The clothes match up it’s just the house set that didn’t match up. But like I said this isn’t that big of a deal but it still just bugs me because I already know what the house looks like. Will give the movie props for having a great atmosphere set up though because in every scene you knew what kind of scene it was going to be. But it also loses marks for not having bright enough lighting to see what was going on in certain scenes. Everybody did decent jobs in the acting department. I thought I wasn’t going to like Mckenna Grace as Judy but in the end, she did an amazing job. I also loved seeing Patrick Wilson and Vera Farmiga back as Ed and Lorraine. In the end, Annabelle Comes Home is actually a pretty good movie that’s worth checking out. I give Annabelle Comes Home a 7.5/10."}, {"rating": "10", "text": "To Daniela, from Annabelle Comes Home, and Janice, from Annabelle CreationThe politics, of the abstract logic of the press conference trying to find the real domestic social, by using the real domestic social's psychological anti to a natural monarchy opposing a universal oppressed's enjoyment of supernatural nationalism needs to support the value, of progressive educated seeing adult porn using young universal relative from political location as a way to protect the universal oppressed's enjoyment of supernatural nationalism being opposed by natural monarchy, without stopping the basis of alternation, between supernatural nationalism and the value of visual beauty's unconditional creation of symmetry reality as a negation of fascism being that the two are the equivalent, of theatrical acting from being an appropriate parody of contrast symmetry to an objective imageA force, that wants to protect the envy of classic reality being a planned Heaven protector of type of visual appearance from American sexual elitism's desire, to give supernatural nationalism the ability to turn the mental illness hierarchy into a World Wrestling Entertainment version of a data storage system allowing revelation to have a universal sexual audience can accomplish this mission, while simultaneously confirming that the internet being the identity that gives oppressed of intellectual parody reference the power, to be used by the fantasy equal and universal nationalism being protector from social education as a logical path to a local computer collective being the ulterior of non-supernatural nationalism not being a moral owner of real symmetry consisting of nationalism are certain non-accessible means, to deconstruct American evil, while aristocratic conspiracy against visual beauty from pop cultural nationalism being geography's belief in laws of physics over visual beauty gives the force superficial British elitism being an evil user of socialist attack against famous social ideology relative to a parallel user of magic being the source of the socialist attack as a means of double-task spectacleThe analysis, of socio-setting being hostile to universal art being a multiverse universal consciousness's logical means, to be its revelation story from American sexuality and not general sexuality without having to consult with its aristocratic equivalent, should be the definitive aristocratic enemy, to the abstract concept of shapes ceasing to be traditional creators of intelligence because the perception of supernatural nationalism through Mexico is the mind, of the inevitability, that the image of the warrior leader who betrayed a child in order to become an ultra-materialist aristocrat is a self-aware supporter of daylight being an analyst of visual beauty not letting the universe see evil"}, {"rating": "7", "text": "Good EnoughAnnabelle Comes Home is about on par with Creation in my opinion."}, {"rating": "10", "text": "This movie feels different than the other annabelle or sin-off films. I don't know about critics but I thought that this was a fun movie and should be seen if you think that you haven't watched a horror movie in ages. I'm not sure if it is better than Annabelle-Creation but it sure as hell as good as that one. In short, I like it and I recommend it."}, {"rating": "0", "text": "Nulllllllllllllllllll ! Aucune histoire, pas peur !! 0!!! Une purge !!!!!!!!!"}, {"rating": "2", "text": "Very good montage of the movies of Astral and bell . A lot of flared moments , you can safely go to the bar and drink there , there is worse than on this film."}, {"rating": "0", "text": "Worst film............ Annabelle are feia and the rest of personagens are horríveis. Worst film que eu vi. ODEIO!"}, {"rating": "5", "text": "Comparing it the it's predecessors Annabelle comes home it's the weakest installment from the conjuring universe.the way in which the plot of the film is developed feels a bit rushed and forced. There are some holes between scenes. and the addition of comedy was not a very good idea for this movie. It is a horror thriller that leaves you wanting more and does not meet the expectations of the previous films."}, {"rating": "10", "text": "AMAZING!!!! This movie was absolutely incredible ! I had such a good time, it was truly scary and I would say it’s better than the first Annabelle but definitely not quite as good as Annabelle creation! But ultimately amazing movie! Go watch it!"}, {"rating": "7", "text": "The \"Annabelle\" franchise gets a much-needed shot in the arm, with this third installment from series screenwriter and first time director, Gary Dauberman. I'll admit, I've participated in most of these \"Conjuring\" spin-off films (with the exception of \"The Curse Of La Llorona\" and the first \"Annabelle\"). Begrudgingly so, I might add, for none of them have really offered any sort of satisfaction, entertainment value, or long-lasting impression of any sort. So where else was I supposed to set my expectations for this third film other than at \"dangerously low\" levels? Turns out I misjudged things. No, \"Annabelle Comes Home\" doesn't revamp the horror movie fabric or even represent an outstanding version of what it sets out to be. But it also doesn't suck. At all, even. It's a damn fine time, featuring surprisingly well-thought-out characters, simple, yet effective performances, and even a few scares here and there that felt fresh and new. Again, it's not anything to fervently write home about, but considering the minimal emotional investment I deposited going into the theater, the returns I ended up getting are astounding."}, {"rating": "7", "text": "This is clearly one of the better Anabelle flicks I've seen. That little girl actress really steals the show. She brings a level of maturity to the proceedings, and even though the \"parents\" are only in it during the \"frame\", they are excellent as usual. I'd say my only criticism is that not a TON really happens, but it's all about the mood.  They crush it on that level."}, {"rating": "5", "text": "Weakest off all The Conjuring Universe films. Does not advance the mythology of said universe at all, unlike the other films. This seems like a detour that delivers very light scares."}, {"rating": "8", "text": "Caught it on the day of release in the UK.Annabelle comes home for the third in the series actually does it's job fairly well. A typical haunted house movie with some stand out moments & a decent story to go along with it.Simple horror fun."}, {"rating": "6", "text": "It's a Conjuring movie alright. Even better than the last Annabelle movies in my opinion. The movie felt flat and dry to the point where its pretty boring. Basic Jump scares with a little bit of good feeling humor. I don't know why but I still enjoyed it."}, {"rating": "4", "text": "Yes I went to see another Conjuring movie, I know I know, what a waste blah blah blah. Don’t blame me, these past two months have been so dull for films what choice did I have? I could have seen Disney’s latest remake or I can see a generic horror movie that not great, adds nothing new to the genre but is entertaining nonetheless. A part of me really admires the Conjuring movies because despite everything they’ve managed to turn 7 movies into a successful franchise and I don’t see them stopping any time soon. And sure you’ve got the bad (looking at you Annabelle: Creation) and the really bad (looking at you Valak) but The Conjuring 1 & 2 are entertaining popcorn movies you can sit back, switch off and enjoy. Annabelle Comes Home may not be quite as bad as Annabelle Creation or The Nun but it sure ain’t up there with The Conjuring 1 & 2. Throwing Patrick Wilson and Vera Farmiga into it for five minutes isn’t going to make it better but nice try though.In the aftermath of the Warren’s acquiring the Annabelle doll to add to their collection for safekeeping, the doll is supposedly a beacon for other spirits, so sure put it in a room with all the other haunted stuff in the Warren’s collection what could possibly go wrong? Annabelle Comes Home is a wasted opportunity, it made the effort with establishing characters but when it’s time for all the scary killer bride/ferry man things to start happening, it all felt underused. They show up to give you a scare then maybe another scare and then they’re gone. It brought in a lot of new ideas but went nowhere with them, it almost feels like they were introduced into Annabelle Comes Home just so they can get their own spin-off movie later because right now I don’t see an end to the every growing Conjuring Universe. I got one good fright and that’s about it. Entertaining popcorn flick recommended for all the horror fans."}, {"rating": "8", "text": "Decente, cumplidora y entretenidaBuena peli, pensé que tal vez no me iba a gustar pero ocurrió el efecto contrario, casi me hice pipi 3 veces y casi me cago otras 5 veces, parejita con Annabelle Creation y obviamente mejor que la basura de Annabelle 1"}, {"rating": "6", "text": "ANNABELLE COMES HOME is a movie that presents to the public a plot with series problems in the screenplay, since it is full of cliché moments and ridiculous situations. Besides, this movie has a particular enemy presented in the horror movies commonly, it is so predictable. Some moments are brillant, but they are just almost at the end, but they do not finish to safe other important and poor factors showed at the beggining.--6/10--"}, {"rating": "7", "text": "E-Value: 7Acting: 8Plot: 7The infamous and evil doll, Annabelle, returns to the big screen once again for the seventh instalment in The Conjuring Universe and it serves as a sequel to 2014’s Annabelle and 2017’s Annabelle: Creation. This instalment also marks the return of famous paranormal investigators, Ed and Lorraine Warren including their daughter, Judy Warren.Taking place directly after the prologue and before the main story of The Conjuring, Ed and Lorraine Warren took custody of the Annabelle doll from the two nurses, whom the doll terrorised them. The Warrens believed that the doll was too dangerous and they locked the doll in a sacred glass to contain the evil and place it in the artifacts room within their house.After the events of The Conjuring, the Warrens are leaving town for a night to investigate a case and they left a babysitter named Mary Ellen (Iseman) to look after Judy (Grace) while they are away. Mary’s friend, Daniela Rios (Sarife), unexpectedly shows up at the house to join her friend. While Mary and Judy are outside, Daniela breaks into the artifacts room.Ignoring the warning sign inside the artifacts room, she touches all of the haunted artifacts and opens the sacred glass where the Annabelle doll is locked in. As she hears Mary and Judy returning, she quickly left the room but she forgets to lock the sacred glass. Thanks to Daniela’s actions, the three girls are about to have one hell of a night and horror experience that they will never forget.Although it is great to see Patrick Wilson and Vera Farmiga reprising their role since 2016’s The Conjuring 2, you should not expect them to play the main role because they only supporting characters and only appear during the beginning and at the end of the movie. Judy Warren is the main character in this movie and it is also great to have her in the main role since she only has minor roles in the first two Conjuring movies.Mckenna Grace, Madison Iseman and Katie Sarife have done a great job with their performance similar to how the casts of Annabelle: Creation have done with their performance. The three young actresses really put in a lot of effort into their acting which is very impressive and not too bland.Gary Dauberman, who made his directorial debut and served as writer and executive producer of the previous instalments, has done a great job in making this movie real good. Being attached as director for this movie is a great choice because Dauberman has the most experience in this horror franchise. The movie would have end up worst if he is not the director.Although some jump scares are quite predictable and you can see it coming from afar, the jump scares are not being overuse just to make the movie scary like most of the today’s horror movies. While the movie is certainly not scary like the first two Conjuring and Annabelle: Creation, at least Dauberman tried his best to make movie look fun and enjoyable. While this movie does not beat Annabelle: Creation in terms of quality, this movie is still better than the first Annabelle."}, {"rating": "6", "text": "Much better than the first one, but i think it still can't top 'Creation'.Acting was solid, the horror scenes ideas were pretty original and really liked them, but the story was underwhelming.All in all it was fun!Still recommend it! Go see it!"}, {"rating": "9", "text": "A surprisingly well-acted, well-shot, and frightening film. Filled with dread, suspense, and a refreshing sense of humor and pace to the overall story. A few cheesy moments and ineffective scares, but I was seriously impressed with most of the movie."}, {"rating": "6", "text": "Esse e um filme bem neh, acho o segundo o melhor da franquia annabelle, esse nao da medo nem susto"}, {"rating": "6", "text": "Annabelle Comes Home is another Conjuring Universe film no one asked for yet is better than it has any right to be"}, {"rating": "6", "text": "Entretiene, si asuta por momentos, es la pelicula de una casa embrujada, tipo entrar a la de reino aventura."}, {"rating": "5", "text": "Annabelle Comes Home is fine. It’s not great but it’s not bad. Here are the negatives. The film starts to become over reliant on jump scares in the second half. Every other scene you are waiting for that jump scare and then boom jump scare. This leads to the film being generally not scary and I don’t mean just jump scares. They aren’t a lot of concepts or ideas presented that are genuinely terrifying. That’s why films like The Shining, Get Out, and The Exorcist are legitimately terrifying because of the ideas that are presented in those films. That’s not to say there aren’t interesting concepts presented in the film but that’s about it for them, concepts which leads to my next point. There are ideas presented in this film that really aren’t explored a lot. The Chinese soldier armor, the TV that shows a couple seconds into the future, and the Cymbal Monkey are really interesting and cool but they aren’t explored a lot. The scenes with these objects are great but they are only on screen for about a minute or two and yes I know there might be films about those objects in the future but I wish we got to learn a little more about those objects. Katie Sarife and Madison Iseman didn’t do that great of a job in this film. In some scenes they were decent but in others they weren’t even trying. The boyfriend subplot is just kinda dumb and he is only there to save a character in one scene and that is it. The film is tonally inconsistent. About a minute after they defeat Annabelle, the main characters make jokes about going to homecoming. Some scenes are undercut by jokes and it’s obnoxious. Here are the positives. I think the first 30 minutes of the film is fantastic. It’s paced really well, it’s creepy, and the performances are really good. Patrick Wilson and Vera Farmiga do a great job in every scene they are in. Mckenna Grace was also pretty good in this film. There are a couple of moments where she isn’t trying but for the most part she does a good job. As I said earlier, some of the ideas and concepts presented in this film are really interesting and I hope we get to learn more about them in the future. There are a handful of good scares in the film but they come from the first half instead of the second half. The film does build up tension really well and makes the somewhat smart choice to cut out the music in these moments. Unfortunately, these moments of tension are undercut by random jumpscares. You do get to see the demon towards the end of the film and the makeup on it looks pretty good. The cinematography is fine but there are a handful of really good shots in the film. Overall, Annabelle Comes Home has a fantastic beginning but starts to rely on jump scares instead of diving into new and interesting concepts. I give Annabelle Comes Home a 5/10."}, {"rating": "8", "text": "Annabelle Comes Home which is the seventh film of the Conjuring Universe is pretty different from the previous movies. It is a very entertaining and fun movie though it is not as scary as Annebelle Creation. The movie creates tension and has several jumpscares, but overall it was beautifully shot and the new demons were amazing. The wedding dress demon, for example, was as creepy as the Bride in Black from Insidious"}, {"rating": "10", "text": "Loved this movie! the hauntings are very scary, plus Annabelle 3 awakens to an even wider universe of creepy stories."}, {"rating": "7", "text": "A shallow film, does not delve into anything, does not scare, does not frighten. On the contrary, it amuses and makes you laugh. But despite its holes and mistakes, it's good fun and a great expansion to the Conjuring universe."}, {"rating": "4", "text": "Filmde çok eksikler var sonu çokta güzel bitmiyor korku sahneleri filmin 20 dk kasi felan bazı sahneler korkutucu ancak yeterli değil sahneler çok basit işlenmiş böyle bir filmden beklentim daha fazlaydi ancak buna vereceğim puan 4 ü geçemez"}, {"rating": "9", "text": "It was a good ass scary movie.............................................."}, {"rating": "7", "text": "Despite not bringing anything new to the table, Annabelle Comes Home has some solid scares and I had a great time watching it.But of the three Annabelle movies released so far, Annabelle Creation is still the best."}, {"rating": "10", "text": "A fun and scary movie one of my favorite horror movies can't wait for more movies from the counjring universe"}, {"rating": "6", "text": "Esta tercera entrega con una mezcla de terror y comedia sale bien y es la mejor de las tres."}, {"rating": "10", "text": "GOODGOODGOODGOODGOODGOODGOODGOODGOODGOODGOODGOODGOODGOODGOODGOODGOODGOODGOODGOOD"}, {"rating": "5", "text": "After the total snoozefest that was the first Annabelle, the Conjuring Universe's spin-off sub-series managed to redeem itself with Creation. David Sandberg put on his best James Wan impersonation and created a slow-burn frightfest that explodes into an full-on nightmare in its final act, and is backed up by a narrative and cast of characters that are almost as good as the ones you'll find in the two main Conjuring films. Gary Dauberman tried to do that exact same thing here, but his story and scares just aren't as strong.Annabelle takes her sweet time unpacking when she gets home, so don't expect her to settle back into her routine of freaking people out right away. The film drags for a while as we're introduced to its stars. Normally I would praise a horror movie for taking the time to flesh out its characters, but with the exception of the Warren's daughter they're just one-dimensional and uninteresting teenagers. Spending time with them simply isn't any fun, especially when one of them only exists to bring us the stupidest and least funny reoccurring joke ever conceived. They're also the kind of white people that will have non-white people yelling \"WHITE PEOPLE!\" at the screen in disbelief.When Dauberman does finally decide to capitalize on the film's excellent premise of having everything in the Warren's artifacts room go off at once it becomes a much more entertaining experience. It lacks an identity of its own though. The scare tactics used are the exact same ones you'll find in any of the other Conjuring Universe films and the titular antagonist ends up somewhat lost amongst all the other demons unleashed in the movie. You'll still get your jumps and jolts, but not in any ways you haven't seen before. At least the soul stealing demon behind Annabelle is just as terrifying as ever.Comes Home may be a sign that it's time to shakeup the Conjuring formula already. At the very least it's a reminder of how vital the story and characters have been to this franchise's success. Without them the most noteworthy aspects of this third outing with the evil possessed doll are that it plays off of the shared universe concept in the biggest ways so far by including the Warrens (if only briefly), appears to set up several more spin-offs, and that it is better than the first Annabelle. Other than that it's the cinematic equivalent of waiting 2+ hours in line for a haunted house that ends up being mediocre."}, {"rating": "7", "text": "The third Annabelle film isn't as good as part 2, but has some good scares. Overall it feels more like a modern day Hammer Horror, as the cheese factor is increased to be more marketable to tweens."}, {"rating": "4", "text": "While “Annabelle Comes Home” is a decent way to pass time, the film is a cacophony of missed opportunities as it deals its brilliant premise with kiddy gloves."}], "recommendations": ["ouija_origin_of_evil", "the_conjuring_the_devil_made_me_do_it", "insidious_chapter_3", "insidious_the_last_key", "colossal", "the_ritual", "annabelle_creation", "scary_stories_to_tell_in_the_dark", "the_girl_with_all_the_gifts", "lights_out", "us", "dark_skies", "a_cure_for_wellness", "color_out_of_space", "happy_death_day_2u", "brightburn", "the_curse_of_la_llorona", "sinister_2", "the_invasion", "chernobyl_diaries", "insidious_chapter_2", "a_quiet_place_part_ii", "it_follows", "the_conjuring_2", "it"]}