{"id": 2015, "title": "Anna", "starring": ["Sasha Luss", "Helen Mirren"], "runtime": 119, "genre": ["Thriller", "Action"], "description": "Beneath Anna Poliatova's striking beauty lies a secret that will unleash her indelible strength and skill to become one of the world's most feared government assassins.", "releaseYear": "2019", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/2U0oAVAE0lDRhNmJPPYhDW9kQ8t.jpg", "categories": {"plot": 5.0625, "acting": 5.714285714285714, "ending": 6.777777777777778, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 2.0, "funny": 5.0, "action": 5.0}, "reviews": [{"rating": "5", "text": "Mindscape has a solid premise, it opens with assertive scenes and good production for suspense. The two main leads, Mark Strong and Taissa Farmiga, are effective for drawing the audience's sympathy, they are strangely involved in a confining situation originally as therapist and patient. It escalates into darker territory as they uncover secrets and danger alike, but unfortunately the movie reaches the conclusion without the same confidence it starts, leaving a dry stale taste as it weakly draws to a close.\r Story follows John Washington (Mark Strong), a psychic with the rare skill of accessing another people's memories. He is tasked to help Anna Greene (Taissa Farmiga), a smart young girl with troubled past. Washington has suffered from a botched session before and currently struggling with his own issues while Anna is an enigmatic girl who distinctly represents a caged bird. The unique thing about their relationship is Washington serves as a therapist but at the same time a sort of detective investigating her deep rooted anxiety.\r This brings so much potential as it dabbles with the idea of abuse or manipulation. Washington grows increasingly protective of Anna, there's also a hint of sensuality beneath the adoration but none too blatant to overshadow their unique bond. It has the luxury of both mystery ambiance as well as a bit of sci-fi tone. Its cinematography works in intriguing manner as it portrays the world in noir theme yet it also has the liberty to present a more modern cityscape. Coupled with good script, the movie is a surefire hit for mystery fans.\r However, it seems to lost its momentum half way through, rehearsing the same material with little thrill. The mix between supernatural and futuristic world have a few decent set-ups for more development, but none pays off satisfyingly. Chemistry between the leads is nice, although the curiosity produced by their interaction doesn't hold until the last arc. Furthermore, some of the crucial intricacies are skimped over, leaving a few plot holes as it wobbles towards the climax.\r For a thriller with such promising start, it's even more disappointing when it ends so blandly. Unlike most of its genre, where many reach dynamic conclusions, Anna's finale is anticlimactically resembled mediocre dramas’."}, {"rating": "9", "text": "Excelente filme com um final fraco meresse uma continuação explicando o final , exelentes atores como Taissa Farmiga que foi otima em seu papel e mereceu o destaque que teve"}, {"rating": "10", "text": "Rainha teen né, amore.\rÉ linda.\rAclamada.\rOvacionada.\rRequisitada.\rAmada.\rOdiada (qnt maior o alvo, maior o recalque né).\rNão depende de macho.\rNem da tia. rs\rEnfim... Rainha é rainha."}, {"rating": "5", "text": "Yeah, no.\r If you're a Mark Strong fan waiting to see him in a decent lead role for once, this isn't it. The hackneyed plot is full of holes, the atmosphere is syrupy with clichés, and the overused Freudian shtick is embarrassing. Strong has enough presence to make this 98 minute film an adequate way to pass the commute if you're watching on an iphone, but otherwise I wouldn't bother. It's a wannabe 'Inception' with no substance. The characters aren't sympathetic or compelling. They don't even relate to one another in a coherent or believable manner, and it leaves them all looking a little like cardboard cutouts. The plot resolution is a cheat rather than a twist, and some elements of the story are still pretty opaque. The movies was filmed in Spain with mostly British actors. It seemed totally unnecessary to set the story in a nameless American Gotham and force everyone to adopt unconvincing American accents, just to accommodate the least experienced actress on set, neophyte Taissa Farmiga. All they had to do was give her an American father or something. In conclusion, \"Anna\" is an elegant flop, and Mark Strong needs a new agent."}, {"rating": "2", "text": "We've all seen this sort of plot line play out whether it be in the written form (novels) or watchable form (movies, TV), which makes \"Anna\" kind of predicable and a waste of time."}, {"rating": "7", "text": "Summary: Mindscape is a decent thriller that delivers some twists and surprises. 70/100 [B-]\r A man with the ability to enter peoples' memories takes on the case of a brilliant, troubled sixteen-year-old girl to determine whether she is a sociopath or a victim of trauma. I saw some of the trailers and they were very interesting to me, however in spite of its boring trailers, I saw the movie and I really liked it. It may be predictable for some people but not to me. The premise is interesting and the cast did an awesome job during the whole film.\r The entire cast is so damn talented, Taissa Farmiga (American Horror Story) and Mark Strong (Kick-Ass) did an amazing job here. Moving on, the concept is awesome and original to me but I have some issues with the script, because some of the dialog was predictable and the film becomes somewhat silly in its third act. Anyway, the most interesting elements in Mindscape are all the \"visions\" that the film shows us, some of them are very disturbing and strange.\r The movie cares about its characters and their previous story. In addition, all of these characters are very well developed. I actually felt sorry for Anna's character, her story is quite sad; also, Taissa Farmiga does an excellent job performing Anna's role. Moving on, the film keeps you guessing the whole time and I liked that; you don't trust in some of these characters and you don't know if Anna is crazy or she's just an innocent girl.\r It is entertaining and it makes sense. Another thing that I like about it is the ending, Mindscape ended up being entertaining, interesting, different, well filmed and superbly acted; in spite of some weak dialog and a messy final act. Its final act has its ups and downs, but the last 5 minutes are quite good, the ending is perfect and well done. I also loved the art design of the end credits. I think that it deserves at least a 7/10 rating, it's a very underrated flick. [B-]"}, {"rating": "4", "text": "As a story focusing on the characters, their relationships, and the shifting sense of distrust they have for each other as well as their own perceptions, Anna works very well. The actors pull off the subtle clues of their personalities, and the whole sense of trust and distrust really is milked to full effect.\r But when the plot actually cashes in its suspense in the form of plot twists, it becomes almost enragingly stupid. For mild spoilers: Someone falls into a trap, which is a theme of the whole movie. But they fall into the extremely convoluted trap with the perfectly-coordinated illogic of a slasher-movie bimbo. And then a police investigation comes to the perfectly exact wrong conclusion, using some logical deductions that make utterly no sense to the audience as they're coming out of their mouths, and even less sense when they actually think about it.\r This is a movie that spends its entire run selling itself as smart, and succeeding. And then it concludes by using the summer-blockbuster technique of \"Throw around lots of details that deliberately don't make any sense, and hope that it confuses people enough to make it look intricate and clever.\" Which doesn't work even in less cerebral movies, or when you're using it to save the day, and not to betray people's delicate trust in justice."}], "recommendations": ["before_i_go_to_sleep", "thoroughbreds", "the_good_liar", "arbitrage", "a_simple_favor", "beyond_the_reach", "stillwater", "broken_city", "beirut", "no_sudden_move", "the_unforgivable", "the_killing_of_a_sacred_deer", "midnight_special", "morgan", "ex_machina", "the_beguiled", "sicario_day_of_the_soldado", "the_machinist", "unbreakable", "the_accountant", "enola_holmes_2", "gone_girl", "knives_out", "all_i_see_is_you", "the_good_shepherd"]}