{
  "id": 889,
  "title": "Annabelle",
  "starring": [
    "Annabelle Wallis",
    "Ward Horton"
  ],
  "runtime": 99,
  "genre": [
    "Horror"
  ],
  "description": "A couple begins to experience terrifying supernatural occurrences involving a vintage doll shortly after their home is invaded by satanic cultists.",
  "releaseYear": "2014",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/yLsuU2P2SpDYFwtZQ7dtfVAf6TE.jpg",
  "categories": {
    "plot": 4.064516129032258,
    "acting": 3.55,
    "ending": 6.666666666666667,
    "soundtrack": 5.0,
    "cinematography": 6.0,
    "familyFriendly": 3.0,
    "funny": 3.8,
    "action": 3.6666666666666665
  },
  "reviews": [
    {
      "rating": "5",
      "text": "Annabelle es una película innecesaria, llena de clichés de otras películas de terror; la historia es bastante sencilla, los Screamers son baratos, lo unico rescata ble fue la escena del elevador (muy buena por cierto) de ahí en mas no ofrece nada nuevo (ni hablemos del final, fue patético...)\rEn pocas palabras... Annabelle es una película de Terror común y corriente que no ofrece nada nuevo al genero y usa trucos baratos y ya vistos en otros Films, Película palomera, entretenida, pero para un domingo lluvioso, no recomiendo que gasten su dinero en esta película, no supera para nada al Conjuro...\r5/10"
    },
    {
      "rating": "4",
      "text": "\"Annabelle\" é uma autêntica piada. Os momentos criados para o público se assustar não são acompanhados pelo suspense e a história é aborrecida e confusa.4/10"
    },
    {
      "rating": "0",
      "text": "With jump scares without suspense, plot without pacing, characters without development and a creepy doll who does nothing, Annabelle is scary in how unfrightening it is."
    },
    {
      "rating": "1",
      "text": "Don't bother seeing this movie. Annabelle had a complete lack of scares which made it extremely boring. Basically the doll just sat around the house changing [ing positions every 15 minutes. The acting was unbearable it was so bad. Really disappointing after last years hit The Conjuring."
    },
    {
      "rating": "2",
      "text": "A shameless cash-grab, Annabelle fails to provide anything new to the genre with a boring plot, pitiful acting, and long periods of time where absolutely nothing happens."
    },
    {
      "rating": "1",
      "text": "A failure prequel that is lightyears far from it's original movie \"The Conjuring\"\rDon't expect much from the director of movies such as (Mortal Kombat: Annihilation and The Butterfly Effect 2 ) and a writer's First Movie script.\rA boring extremely poor written dull story with very few action or scary scenes , with many silly cliches and unconvincing interactions between characters and illogical character's decisions and plot.\r Annabelle had much more potentials if it was in better hands."
    },
    {
      "rating": "3",
      "text": "Boring and unintentionally funny in a lot of scenes and the doll is completely arbitrary to the plot. Despite one decent sequence involving an elevator \"Annabelle\" is as porcelain of a movie as the real doll is."
    },
    {
      "rating": "2",
      "text": "So, basically, if you had any idea that this moving was going to be about a doll, you would be wrong. It is isn't. It's about Helter Skelter with some knock-off wannabe Manson-style cult as the source of all the woes in the film. It's like Paranormal activity, Rosemary's Baby and Chucky had a threesome and their love child was \"ANNABELLE\"\r So, 3 things that could have made the movie better. 1) NEVER SHOW THE DEMON. I thought that was a given, but apparently I was wrong. 2) PICK A REAL GROUP. Disciples of the Ram? They just wanted to use the Baphomet picture. 3) DON'T MAKE A FAKE CULT SYMBOL THAT LOOKS LIKE A CURSIVE A. When it first showed up, I was all excited, thinking \"Oh. That's cool. The demon Zorro-ed an A in her arm, like Annabelle. Creepy.\" But then it turned out it was some half-assed sigil that was something about soul transfer.\r So that's it. It blows."
    },
    {
      "rating": "1",
      "text": "Não acredito que paguei pra ver isso sério, pelo amor de Deus, pior filme que já vi no cinema,  Invocação do Mal foi um filme muito bom agora não vale nem a pena gastar seu precioso tempo vendo isso."
    },
    {
      "rating": "0",
      "text": "***SPOILERS***\r This thing of a movie wasn't worth my time. The acting was fine but I didn't like it. Id rather have gone and seen dolphin tale 2 (no shade thrown I want to see the movie) because the story wasn't good or funny (I find some horror movies funny like the conjuring when they were taking the demon out her. Now I'm not a spiritual person or a religious person but im fine when they do it in movies and coming from (and still in) a religious household understand this stuff. Now she should have seen that coming when the father wouldn't look her in the eyes. I hated this moive and don't recommend anyone to see it even if they have free time.\r *SPOILERS***"
    },
    {
      "rating": "3",
      "text": "Annabelle manages to use every horror cliche in the book, thus making it another typical bad horror movie of this generation. The acting is somewhat okay, but the sounds and the \"scares\" are overused, thus ruining the scare factor."
    },
    {
      "rating": "2",
      "text": "Annabelle was possibly the worst horror movie I've seen in a long time. The movie seemed to drag by and there were too few scare scenes. I honestly can't believe this came from the same people that brought us The Conjuring.\rSave your money for the DVD folks, and even then, make sure you have something else to keep you entertained while you're watching it."
    },
    {
      "rating": "0",
      "text": "Three to five minutes of Annabelle in 'The Conjuring' is far more frightening than an hour and a half of Annabelle...  in 'Annabelle'. They just made the doll cute."
    },
    {
      "rating": "2",
      "text": "Annabelle it's the kind of movie that pretend introduce a scary situation with bad storyline and the result is the same over and over again, many jump scares but not an atmosphere to introduce the spectator into the act. At the end, it's just a movie that wanna be successful using the success and good rating of the conjuring."
    },
    {
      "rating": "1",
      "text": "From director of Mortal Kombat: Annihilation!! hah\rwhat a piece of **** is this movie don't waste money on this ................................................"
    },
    {
      "rating": "6",
      "text": "\"Annabelle\" is your typical summer horror film. Its got the same scare formula as \"Insidious\" with its simple jump-scare horrors and what not; however, the shabby story and average acting does make it a little bit less in quality than its former."
    },
    {
      "rating": "6",
      "text": "I was happy to read that Annabelle, without much publicity or hype and pretty bad reviews (which it did not deserve) made only $800,000 less than Gone Girl in its opening weekend.  Is there hope for the American horror-movie-going audience? Annabelle is a solid film with a plot, characters, and good acting. Yes, it is derivative, but it also creates a consistent mood and atmosphere and conjures up some real emotion at the end. No, it is not original, but it is also not a stupid and empty slasher fest, full of blood and gore where the director just goes “boo!” at you every few minutes. This kind of film is actually mocked during the features before this film by picturing teenagers doing such stupid things that the monster even looks exasperated. So bravo for a solid (if not great) horror film whose success will hopefully encourage more films in the tradition of “real” and more genuinely frightening films like Psycho, Rosemary’s Baby, and The Haunting of Hill House."
    },
    {
      "rating": "6",
      "text": "La película mas mierdera de la historia, y para colmo repleta de sobrevaloración. demasiada publicidad para una película que prometía mucho y no cumplió nada."
    },
    {
      "rating": "7",
      "text": "I'm going to use a videogame as a reference. If you have played Silent Hill P.T. and Left 4 Dead Series, this is the movie for you. I absolutely loved it. Good story. Seeing is believe and I suggest you see this movie."
    },
    {
      "rating": "0",
      "text": "Come on, this is supposed to be a great prequel to the horror masterpiece The Conjuring, instead, it was a dull and laughable cliché \"horror\" story. What in this movie is supposed to scare us?"
    },
    {
      "rating": "1",
      "text": "I hate to do this, but I'm going to have to call out Kyle Smith of the Post, Inkoo Kang of The Wrap, and Michael  Phillips of the Tribune - you all gave this travesty a positive review.  You should turn in your critic card - yesterday.  This is a horrible movie that commits the cardinal sin of horror movies - it bores the hell out of you.  Nothing happens in this film.  It's as if the movie's been sitting on the shelf for about 15 years, and the writers/director haven't seen anything that's come out in the horror genre since then.  Really embarrassing for Warner Bros.  Godawful crap.  Please, do yourself a favor, horror fans, and go see The Guest, Honeymoon, or any number of really good horror movies released this year.  Better yet, go check out You're Next or A Horrible Way to Die from Adam Wingard - one director who is doing horror right these days.  One more note on Annabelle - it seems that any form of entertainment that employs Alfre Woodward these days - be it Copper, Last Ship, True Blood etc. - officially jumps the shark when she appears.  I loved her in her early career, but she spells doom for whatever she's in lately."
    },
    {
      "rating": "0",
      "text": "Simply bad. Not scary at all, and I really disliked it. Not even close to how good the first movie was. The story was horrible, the actors were just plain stupid, and the scares were lame. 0/10"
    },
    {
      "rating": "7",
      "text": "It was terrifying and reasons why I never liked dolls. It was definitely a cliched horror film with loud noise and things popping out at the right moment but worked really well. Glad it was not an exorcism type movie."
    },
    {
      "rating": "5",
      "text": "If I were to compare The Conjuring to this year's Annabelle, well this year's prequel to the horror classic, The Conjuring, is all but a cliched boring demonic ritualistic fare that doesn't add much of an improvement upon its sequel nor doesn't connect the dots on what is all about the creepy doll in the Conjuring. At least there were few parts that gave me thrills especially the demon scene there. Oh that was creepy and intense but all in all its still a failure to justify a satisfying horror film."
    },
    {
      "rating": "4",
      "text": "Given the late 60's early 70's setting I was hoping for an old-school feeling horror film like the ones from that era. While the visual style and poor acting are from that era, the scares are not. It is very much a modern feeling horror movie, and a boring one at that. No more boring than your average non-scary horror movie, but boring nonetheless.\r If anything it might actually help you appreciate the attempts at tension building the average horror duds have, as this movie has none. The slow moments aren't there to build up scares. They're just there and only serve to bore.\r The attempts as frights are served up in the ever predictable form of jump scares. While these types of things do manage to scare some people, as evident by the fact that directors keep using them and making small fortunes at the box office, the more seasoned horror movie veteran is going to be left completely unshaken. This horror fanatic was just left yawning.\r While I appreciate the attention to detail that was used to bring the era back to life I wish more was done to tap some of the influence of the horror movies of that time. That way even if it wasn't scary it would have at least been a decent throwback. As it stands it lacks atmosphere and the ability to instill fear. When you consider that this is a spin-off of \"The Conjuring\" and has ties to a true story it's even more disappointing.\r I give the movie a 4.3/10."
    },
    {
      "rating": "8",
      "text": "Annabelle is a fine primer for those unaccustomed to horror films. Make no mistake, the doll is clearly the star of this movie so It didn't matter to me how good or bad the actors performed. Great audio for suspense building and a couple of memorable scenes; only wish there were more. I hope there are plans for a sequel with perhaps James Wan directing."
    },
    {
      "rating": "3",
      "text": "It is a shame I can't do two reviews for each half of this movie. Because the first half, if generic, is a decent creepy horror film. With paranormal activity esque camera work (which is the best part of the whole film) and a doll which is genuinely creepy, the first half does contain suspense and maybe a scare and a third. However after maybe 40 odd minutes, the film devolves into something more like scary movie or drag me to hell. All suspense is lost as we see the beastie who is behind everything (a dude with a goat's head) and we hear about the back story of the doll, which is nonsense. Overall this film was dissapointing, as the doll was one of the two scary parts of the conjuring, but this film is not scary, it's just kind of silly and dull."
    },
    {
      "rating": "0",
      "text": "\"Annabelle\" is one of the most boring, flat, dry, uninspired, unoriginal pieces of cinematic garbage I've laid eyes on in the past decade.\r This movie is so -not- scary that it feels \"anti-horror\". The characters are chunks of blank cardboard, with no personality to speak of, no expressions on their faces, and no interesting dialogue from any of them. The jump-scares are in excess but none of them are frightening or necessary. I would attempt to explain the pointless plot but I was so bored that all I could focus on was how ridiculous the movie was and why someone felt the need to make something so horrible.\r I would give this movie a negative ten ( -10 ) if metacritic allowed it. That's how bad this film is."
    },
    {
      "rating": "4",
      "text": "It was one of those 'Lets-get-it-over-with' movies. It really doesn't provide what The Conjuring did. A miniscule bit of horror. Though, it takes a bit of The Conjuring, but then again, it never provided the terror snd uneasiness of it.\rOverall, a 4.7 of 4.5"
    },
    {
      "rating": "0",
      "text": "ANNABELLE is a complete mash up of everything that  is wrong with the horror genre. It's a dull, derivative, and predicable turkey of a film that favors cheep jump scares over lasting dread and is headed by a villain who is obviously just trying WAY too hard to be scary. This is a film that is unwatchable on every level."
    },
    {
      "rating": "6",
      "text": "Overall, while it undoubtedly lacks the ingenuity of The Conjuring, it honestly wasn't as bad as I thought it would be. There were actually a few effective scares here and there, but nowhere near enough to put it on the same level as The Conjuring."
    },
    {
      "rating": "6",
      "text": "After all of the negative press I had read about \"Annabelle\", I still wanted to see it. Before all of the reviews hit, I wanted to see it, because I really, really liked \"The Conjuring\", and after - just for the lulz, as the internets say. So I did. And it's not that bad.\rDirected by John R. Leonetti, who confuses me a lot, this movie surprised me. It's shot in a very weird way, with a lot of awkward zooming and noobish positioning, however one particular thing caught my attention. I've seen it in other movies too, and I enjoy when it's integrated so well. \"Annabelle\" is a perfect example of this style of horror capture, where the camera is always, as if, focused on an object or part of the scenery, which makes the uneasy feeling rise; as if something is ready to creep out of there. It's quite effective. Other than that, this movie has a competent feel, but fails when it comes to originality in any form.\rThe script is particularly weak; it feels as if it has been written up for a few days with no extra though being put into it. The overall plot is also confusing - the movie doesn't really know what it is about. New and new threads of story are introduced, but none of them seem to go anywhere. The whole purpose of everything seems simply to \"be\". It's like a ball of yarn that comes apart - you expect there to be something at the core, but there is nothing. It simply ends.\rThe actors are pretty bland as well. They've managed to create and act-out the most generic couple ever; also, the whole sense of the era of this movie (which was very well recreated in \"The Conjuring\") is lost between a few minor implications.\rHowever, even after all of these negatives, I had fun with \"Annabelle\". It was a very simple movie that managed to never get boring. The techniques it used were old as time, and have been implied much better in other movies, however there is a certain charm about the movie that kept me interested up until the end.\rThis movie is not for everyone. But some people might enjoy it, if they'd like to see it. The movie is partially haunting, it has a few really awesome scenes, and even when it is absolutely horrible - it's pretty funny. Overall - I don't think you can have a bad time with this movie. It's certainly a good option to have in this season. It's not \"The Conjuring\", it's much more simple in a bad way, but in that simplicity, pure joy of empty viewership can be achieved if one wishes to do so."
    },
    {
      "rating": "1",
      "text": "Quite simply, I gave this a one simply because of one or two brief scenes (the basement/elevator scene and the scene when the wife first sees the little Annabelle girl ghost in the apt.) that were slightly creepy.  Overall this movie was god awful boring.  At 22 minutes left (after the characters finally figured out a demon was involved) we were like \"How are they going to wrap this up?  That remaining 22 minutes includes credits!!\" How they managed to do it was due to an EXTREMELY sloppy edit in which the main  characters were confusingly  all of a sudden at  totally different places and with totally different characters then had been implied would occur a mere 5 seconds previously.  Guess the editors realized they only had 22 or so minutes left as well and knew they had to cram everything in at once.  Dull, predictable ending,  No tension.  Glad I only rented this. Very disappointed."
    },
    {
      "rating": "5",
      "text": "This was painfully unoriginal, had bad acting, directing, writing, and cinematography, and the priest character was extremely unnecessary, but I enjoyed the hell out of it. It had a lot of effective tension accented by its good scares, and I liked how it was set in 1968. If you want horror that doesn't require any thinking but delivers exactly what it promises, I recommend this."
    },
    {
      "rating": "3",
      "text": "This is a very bad movie, it's so predictable, there are some cool scenes, but the movie itself won't scare you so much, the story is too simple, and there is no climax, the movie ends and you ask if that was all, i was expecting much more from this, The Conjuring was good, but this one fails at everything. It's a waste of good material."
    },
    {
      "rating": "5",
      "text": "Although it has its moments of creepiness, this is not a very scary movie, and of course, comparison to the much more effective The Conjuring is inevitable. The problem here is that it's not very well plotted and the acting is B grade, to say the least. It's a movie desperately in search of a director...and an original script."
    },
    {
      "rating": "5",
      "text": "I was expecting much more from this movie.\rPlot without pacing, characters without development and a creepy doll who does nothing. The movie is not even scary!\r At the end, it's just a movie that wants to be successful using the success and good rating of \"The Conjuring\"."
    },
    {
      "rating": "0",
      "text": "Asco de película. Creo que teniendo la fama de \"El Conjuro\". quisieron hacer este intento de secuela tan horrible. Todavía Chucky es mejor que esto, realmente todos teníamos expectativas buenas, pero terminó por darme risa en lugar de miedo, trama horrible, la muñeca nada que ver, horrible, realmente desagradable."
    },
    {
      "rating": "9",
      "text": "Annabelle captured the time period effortlessly. Seeing as the Director was the DP on Wan's many films, this film proved true to his other films. The camera moves effectively through and captures the tension you want the entire time."
    },
    {
      "rating": "0",
      "text": "Amazing **** Annabelle iot's an incredible movie to watch if you are retarded or if you have problems of brain. Oh my god, MASTERPIECE!!! 10$ for this!!! If you want to destroy your life, then watch it. Fck that shy of movie! .l."
    },
    {
      "rating": "5",
      "text": "It has its moments, but when you get to compare it with The Conjuring, its just the same regular horror movie with a \"ruins everything\" ending, regardless it is cute; but that is something that the movie shouldn't do, it has to be \"supposedly\" scary. Go and see it under your own responsibility."
    },
    {
      "rating": "6",
      "text": "I hate this movie because it's scary, tense and freak me out so many times. After 45 minutes, i asked my wife for the time because i couldn't take it anymore. My wife chose the movie, not me so i forced myself to hang in there for my wife until the end. Never again i watch horror movie on big screen. EVER!"
    },
    {
      "rating": "9",
      "text": "As a casual horror movie watcher this was a great film.\rSure the plot wasn't great and there were alot of plot conveniences, but was it scary?\rHell yes it was.\rThat being said this film could never really live up to the standards set by The Conjuring, but it is still well worth a watch."
    },
    {
      "rating": "7",
      "text": "Effective little chiller that benefits from some imagination in the direction and three or four scenes that are a credit to the genre. In fact the first real scene of horror is one of which Hitchcock could be proud. The attractive leads are also better than the usual cyphers placed in these types of films and the story is generally quite logically played out. References to Polanski's 'Rosemary's Baby' abound and there are definitely shocks to be had along the way. One sequence involving a sewing machine, a hob and some popcorn is cut to elicit maximum tension. Two supporting players are effectively presented with menacing undertones, but the movie's biggest mystery remains why anyone would want to own such a sinister looking doll in the first place. The final scenes become somewhat predictable, but I must say that it sets up the scenario for last year's' The Conjuring' very nicely, and is actually preferable."
    },
    {
      "rating": "9",
      "text": "This movie was very good. The main character is a very good actress, and there are some very good scares throughout this movie. Definitely one of the best horror movies I have ever seen."
    },
    {
      "rating": "10",
      "text": "I honestly didnt want to see this movie, but god am I happy I did. This movie was AMAZING and definantly had some parts that scared me and it takes alot. Such a good story line and even the ending was Amazing, sad, but amazing. Definantly worth spending the extra money to watch it in a theater versus at home."
    },
    {
      "rating": "10",
      "text": "muito bom levei tantos sustos que eu perdi a conta acho que tem que ter o dois urgente pra eu poder assistir kkkkkkk e tem que sair logo em dvd pra eu poder comprar kkkkkkkk"
    },
    {
      "rating": "10",
      "text": "Annabelle was a well acted horror movie for once! It wasn't over the top and the story was great. I loved the scares and honestly I thought it was scarier than the Conjuring which I LOVED. GREAT JOB!!"
    },
    {
      "rating": "9",
      "text": "Annabelle has a very similar feel to the Conjuring and this installment fits nicely as a prequel. The excellent direction and well played characters makes this the scariest movie of 2014 to date. Be ready for a scary and some what interest horror film that may not reach the heights of the Conjuring, though never falls short. Annabelle is a very enjoyable movie that will keep you up at night!"
    },
    {
      "rating": "0",
      "text": "Cheaply made and perfectly capitalizes on the hype that the Conjuring films made. Credit where credit is due exploiting a franchise for a quick buck. This movie sucks and there's no sugar coating it. Production values are low, The cast does a so-so job with the generic dialogue given to them. The story is so cut and dry, so predictable and worst of it - It's not even scary. You can call the weak jump scares from a mile away and I honestly don't see how anyone could call this a horror movie. It's garbage. It's a quick cash grab, That's all."
    }
  ],
  "recommendations": [
    "insidious",
    "insidious_chapter_2",
    "malignant",
    "the_possession",
    "the_amityville_horror",
    "ouija",
    "the_grudge_2",
    "dark_skies",
    "dead_silence",
    "sinister_2",
    "countdown",
    "the_curse_of_la_llorona",
    "chernobyl_diaries",
    "the_grudge",
    "the_haunting_in_connecticut_2_ghosts_of_georgia",
    "hereditary",
    "the_eye",
    "the_conjuring",
    "the_descent",
    "devil",
    "antlers",
    "the_mist",
    "the_ring",
    "the_possession_of_hannah_grace",
    "final_destination"
  ]
}