{"id": 619, "title": "Annabelle: Creation", "starring": ["Stephanie Sigman", "Talitha Bateman"], "runtime": 110, "genre": ["Horror", "Mystery", "Thriller"], "description": "Several years after the tragic death of their little girl, a doll maker and his wife welcome a nun and several girls from a shuttered orphanage into their home, soon becoming the target of the doll maker's possessed creation—Annabelle.", "releaseYear": "2017", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/tb86j8jVCVsdZnzf8I6cIi65IeM.jpg", "categories": {"plot": 6.757575757575758, "acting": 7.0, "ending": 6.555555555555555, "soundtrack": 6.5, "cinematography": 7.5, "familyFriendly": 3.0, "funny": 6.166666666666667, "action": 7.75}, "reviews": [{"rating": "8", "text": "Orchestrated from Warner Bros' inspiring decision to appoint 'Lights Out' helmer David F. Sandberg the steering wheel to this franchise, 'Annabelle: Creation' reaps the full benefit. It is miles better than its predecessor; with unflagging tension, scares that are set up well, good acting, a consistently creepy & spooky tone, Easter eggs that are expertly done, and an ending that transitions smoothly to the first 'Annabelle'."}, {"rating": "6", "text": "Although not to the same standard as the Conjuring movies, Annabelle: Creation is a decent horror that builds tension well and packs more than a few good scares. The story itself is pretty basic, at times even a little ridiculous but interesting enough to retain your attention. It also manages to tie in other aspects of the conjuring “Universe” which I’m sure fans will expect and appreciate. Overall it’s a definite improvement on the previous Annabelle movie and one of the better horrors I’ve seen in recent times, that said I'm not sure there’d be any reason to make another one!"}, {"rating": "6", "text": "This is a prequel to the 2 earlier films and the origin story of the creepy killer doll. A group of orphan girls is transferred to the home of the doll maker and his wife, where they uncover the creature's demonic presence. The plot is sometimes confusing and the evil seems impervious to logic. Still, there's a steady sense of tension and a few genuine jump scares. The overbearing sound effects do a lot of the heavy lifting. This sort of ghost story is a popular genre, but it's cheap thrills don't appeal to me. That didn't seem to matter to most of the audience, who seemed caught up in the fun."}, {"rating": "6", "text": "What \"Annabelle: Creation\" lacks in (forgive me) creativity or genuine scares, it makes up for in spades by just simply being a watchable film within the tapestry of today's complicated horror movie landscape.  Director David F. Sandberg's previous effort, \"Lights Out,\" may have been a more inspired piece with a bit more fun to be had as well, but the competent storytelling here does the job enough."}, {"rating": "8", "text": "While I didn't hate the first Annabelle, David Sandberg's Annabelle Creation gets the tension and feel of a true Conjuring spinoff. I also appreciated his \"Lights Out\" moments, as he obviously has a real understanding of what those moments should look like. A-"}, {"rating": "9", "text": "Annabelle: Creation is a really effective horror and great entry to the franchise.Unlike Annabelle . This movie has great sound design and cinematography with really good performances by the cast. The Claustrophobic environment rises the tension between the horror scenes with a satisfying back story for Annabelle's existence. The movie does have unnecessary jump scares and not much depth into the plot like the conjuring movies."}, {"rating": "10", "text": "annabelle creation is actually the best horror movie in 2017 so far and we start we the good stuff : first things some easter eggs (spoilers here..................like when janice gets adopted her parents give her a copy from the real annabelle haunted doll or the last scene that connects this movie with annabelle (2014) then the terrifying soundtrack but its also satisfying or the great acting and some good scary scenes and good jumpscares i actually want to see the movie again and again because its so great"}, {"rating": "9", "text": "The first Annabelle suffered a lot of errors, if I were to review it today, I'd give it a 4 out of 10, luckily, Annabelle: Creation redeems itself and gets rid of almost every single flaw the first one had, making this the best installment in The Conjuring Universe yet. A few jumpscares here and there, plus a few issues I had with the writing are fixed once I get thrown back into this horrifying story that gave me chills down my spine."}, {"rating": "10", "text": "This is an excellent horror film that manages to deliver some truly terrifying scares while keeping that tension high and never letting up. Overall, a great film added into the conjuring universe and far better than it's predecessor."}, {"rating": "5", "text": "While  'The Conjuring' films have continued to impress me with their unique and creepy atmosphere, as well as their remarkable ability at relying much more heavily on building tension and suspense rather than cheap, loud and in-your-face jump scares, this second outing with the Annabelle doll easily falls into the latter, much like its predecessor unfortunately. This became straight up laughable for me at times, due to the weak effort of creating any genuine scares or tension when almost every time, I, and I'm sure several others, saw almost every scare coming from at least a mile away before they even happen. Some of the dialogue and moments throughout the film were just so ridiculous as well. Overall, it had the creepy atmosphere that at least made it a bit fun and eerie to watch, but \"fun\" is certainly not what I'm looking for in a horror film. \"Fun\" is when I'm laughing or grinning at the predictability of a horror film rather than cowering in my seat in fear for most of it. Case in point."}, {"rating": "1", "text": "Cliche festival. Spare yourself of this awlful movie. You can see the jump scares coming from 10 miles away, and the loud sounds are old news. Terrible movie."}, {"rating": "3", "text": "I thought this movie was horrible. First off, it was very repetitive. After a decent set up, the film kept repeating itself with jump scares and boring imaginary for the whole second half of the movie. Most of the scares rely on loud annoying music and don't have much tension, especially because they never really give a scary atmosphere. The doll in this movie is also inconsistent, and here is where the spoilers start. The Doll is actually an evil spirit that is evil for reasons (just roll with it) and the thing has force powers, throwing one girl to the wall without touching her. It has claws and can teleport and be invisible, but they seem to forget any of this when it's convenient. Why does it chase down people when it can force choke them? Why doesn't it teleport behind them? Why doesn't it use its powers which basically emp'd the house on the girls? It doesn't make sense and breaks immersion. One hilarious moment is when one of the little girls is getting chased and hits the beast with a flashlight and the thing recoils in fear. It's hard to take seriously at that point.The characters are also stupid. At some point, they just have to stop being stupid and going in places they know they shouldn't. For that matter, the family shouldn't have invited vulnerable little girls to there place when they have an evil spirit in there, which was well kept except for when a little girl with polio managed to get in.I could go on. The film does the Aliens thing and doesn't let us see the demon for a while and keeps it dark to try to keep suspense, but it isn't suspenseful because the thing can be anything it **** wants to whenever the screenwriter demands it. When the polio girl gets thrown down the stairs, no one can hear her then but when she is getting attacked by the demon later in the shed they all hear her. They have a cool idea with the mother ringing the bell which added some tension, but they kept using it which got really annoying especially once it was established that the mother isn't the demon in any way. The demon is also **** at being a demon, he could have killed all of the little **** and gotten away with it but he didn't because the plot demanded it.There were a few things I did like. Some of the camera work in the first half was nice with some nice religious imagery here and there (though they stop being subtle with it later on) and the relationship between the two girls is kind of touching,though they start ignoring that because of the scares and fail to develop how it affects the non demon girl. But overall I thought this movie was ****"}, {"rating": "10", "text": "Better than the first episode! Although it is a horror film but I actually feel heartache after two little girls should have lived a happy life but because Linda lost his best friend Janice also lost his life because of all the causes of Mullin couple desires incurred has also led to a series of events later you are my sunshine to now just hear this song will think about the film's plot and picture"}, {"rating": "3", "text": "Mediocre 'b' horror film that should have gone straight to dvd.A nun and a bunch of sweet,nice orphan girls take up residence in a creepy giant house straight out of Evil Dead as guests of a creepy gruff miserable man and his crippled wife.As soon as they get there the film starts running thru the list of timeworn horror cliches with a bunch of jump scares.Nothing really makes any sense that they do. There are no strong characters to oppose the annabelle creature so the girls are just fish in a barrel and scream a lot .I thought the nun might be a help but she was also weak.The owner and his wife are useless as well.The film characters are all really forgettable so you won't remember their faces after you leave the theatre.The Conjuring was such a good film that these spin-offs look even worse because of it.Of course the ending sets up the usual possible sequel.Couldn't have cost much to make because the special effects were below average."}, {"rating": "7", "text": "Pretty good movie. Which is a lot more than what you can say with most horror movies. David Sandberg has came in and made a lot better than the previous one. It had a lot of great moments and some genuinely creepy moments. Lulu Wilson once again does great like the Ouija 2 movie. Go see it. It's rare to see good horror films anymore."}, {"rating": "7", "text": "Минусы:-Весь фильм сплошное клише,даже голова под конец болела от переизбытка всего этого.-Логика действий персонажей оставляет желать лучшего.Плюсы:-Фильм реально страшный и жуткий(не считая одного скримера).-Атмосфера прекрасно сделана всё как надо,кадры выдержаны по всем законам хорроров.-Музыка хорощая.-Актёрская игра радует.Итог:7,3/10."}, {"rating": "5", "text": "Have you ever been truly scared?I have,and it leaves a taste of electricity in your mouth. Instead I left with a sour taste. Annabelle failed to deliver true horror, instead it was a hodgepodge of banter scenes that didn't connect. The hot nun didn't help in any fashion and 3 of the characters were useless.james Wan, please be somewhere creating some true horror. Screaming and loud creepy music doesn't make a horror film, especially sreaming. For a minute I thought I was watching \"The Ring\" the movie got dangerously close to just ripping off the ring and Bram Stoker's Dracula. The movie has great camera angles but the script was weak. Things should've happened alot sooner and better in the movie. Although there was a fantastic scene with the daughter and the chairlift, but it failed to carry through. All in all, the cast of orphans were too inexperienced and frankly useless, the nun couldn't act and her script was horrible."}, {"rating": "4", "text": "Did you like The Conjuring? Did you like The Conjuring 2? Well here’s a movie to tide you over until the Conjuring 3. Yes I know we already got an Annabelle movie but it made a ton of money so now we’re “rewarded” with another one. Ooh goody. So buckle up for nearly two hours of quiet, quiet, bang, screaming, more screaming, Annabelle on a rocking chair, jump scare, jump scare, jump scare and roll credits.There are only so many times you can bombard the audience with frights before you lose them completely. Like so many other horror films it suffers from the build-up being better than the reveal. Seriously the last thing the Conjuring movies needed was its own universe but here we are anyway. An endless parade of unoriginal cash grabbing spinoffs. Annabelle Creation is one giant jump scare so unless you’re truly desperate for your horror movie fix give this one a miss. It doesn’t deserve your money."}, {"rating": "1", "text": "The acting is this movie is so bad it's actually quite funny and offers some entertainment, which is just as well because the scares just aren't there. Some of the horror is handled well, with one or two creepy moments and the director might come into his own at some point, but it's mainly just jumpy moments (lame) and besides the characters are so daft you can't get into it. The way those little girls speak to each other and that nun man...what was she on? She was like a friggin robot. I had to leave before the end as the dialogue got too bad and went beyond entertaining."}, {"rating": "3", "text": "Annabelle: Creation relies so much of its screen time attempting to terrorize people than actually focusing on its plot like those that came before this film did. You'd better start throwing that doll away and start focusing on a great script for once because these films just make me wonder if these guys that work on these what-you-call-horror-nowadays movies are in it for the money because it definitely seems as if they actually are."}, {"rating": "9", "text": "Once again Sandberg proves why he's the best up and coming horror director around with another fantastic and actually scary offering. This absolutely trounces the other Annabelle in every aspect, and has some truly interesting moments with some of the best cinematography and lighting you can get. Sandberg can scare his audiences in some of the most creatively provocative ways and will become one of the great horror directors of all time."}, {"rating": "10", "text": "Annabelle: Creation brought to me fear and emotion while I watched this. It's a great movie and I can't wait to watch a next movie that Annabelle appears again."}, {"rating": "8", "text": "This movie is great. I really enjoy my time in the theater. We have too much horror movie nowadays, that discussed too much about humanity instead of making people to scream. Of course this movie has its problem, like story, like character do stupid **** But for a audience \"stupid\" enough like me, only care about popcorn and jump scares, it served the purpose."}, {"rating": "7", "text": "The story of this doll that I never would have bought it, but in the movies it's all the crazy started in the movie \"The Conjuring \". And the moments with the doll is like the audience. But actually the story began in the 70s and is, to this day, in the \"Occult Museum Warren\". Yes, the story of this doll is based on real events. This film is based on a mystical story of a doll and offers a history of the origin of evil. \"Annabelle: Creation\" is a prequel to the 2014 film \"Annabelle\". As I wrote earlier, we learn the story of the appearance of the doll, and how she became a \"conductor\" for the evil forces. The tragedy happened to the family of Mullins. The father loves the puppets, he made the same doll. But first, it's just an ordinary toy. After the tragedy the doll, something evil. After 12 years in the Mullins house come girls from the orphanage and settle in the house. They can feel like home, only it is strictly forbidden to enter the room, which was the daughter of the family. This room, by the way, is closed. On the mystical to happen, the terrible events and the struggle for the soul. The horror elements are obligatory for a horror film. But the plot also plays a role. And here with \"Annabelle: Creation\" is not so smooth. I told you the entire plot, avoiding spoilers. A story without imagination. But the main character is a girl Janice is really worried. And so we worried for her even more the girl find it difficult to walk without crutches. The fact that objects, which wants to destroy evil, are children, adds empathy, you're afraid for them. And fear along with them. With the horror elements here all is well. Let, and without imagination (as distinguished from \"The Conjuring 2\"). Although, when the girls tried to leave by car, and in the twinkling of headlights was something alive — it was good. In this film, be sure to watch the background — there are sometimes slips something frightening. The film escalates, and after such a quiet, blood chilling moments, there is something frightening. A movie can not scare. The doll is still pretty terrible, and frighteningly alive. You can find fault only to the demon. As the first part, he is not afraid and looks too fantasy. A typical daemon that is not scary. But the rest of the effects look good. David F. Sandberg is a rookie, and was pleasantly surprised critics with the audience \"Lights Out\". James Wan acted as producer and probably just watched the film was connected with the universe \"Curse\". Director David F. Sandberg managed the task and took of course a scary movie, but with an average story. At the end of the film nicely connects the story with the first part, but look the original is not necessarily a prequel, it is an independent picture."}, {"rating": "2", "text": "A parade of cliches, predictable jump scares, cgi \"devil monster\" thing and dull plot. But the movie gave me few laughs, unintentionally obviously.Seriously not recommended, its just very generic and simply boring."}, {"rating": "7", "text": "Film ilkine göre daha iyiydi fakat korku filmi değil +15 dende anlaşılcagı gibi hiçbir sahne korkutmadı bazı yerlerde geriyor sadece yinede ortalamın üstü bir james wan filmi izlenebilir."}, {"rating": "10", "text": "I went into this movie with the lowest possible expectations, but came out with my new favorite horror movie of this year. Compared to the last movie, this movie actually is scary, and has a good enough story so that you can actually watch it (unlike the last movie). Even though it is a prequel, it is definitely not a bad movie, and every horror fan should watch it."}, {"rating": "9", "text": "Back in 2014 the scary film, The Conjuring, introduced Annabelle as the possessed doll that tortured Judy, the daughter of Ed and Lorraine Warren. A year later Annabelle is starring in her own film, which you’d be excused if you didn’t know it was made. Skip forwards another couple of years and voila you have Annabelle Creation, the movie that explains where it all started for the possessed doll.While The Conjuring franchise has been particularly strong and not to mention scary so far, Annabelle Creation is the film that brings it all crashing down. This film had such great potential as it already has a strong story line based on real events. It started to use some fancy camera work only to fizzle out as the movie went on. But most of all, it wasn’t scary. It was far from scary so much so the audience laughed at what should have been moments of “ooo” and “aaahhh”.Annabelle Creation is about a group of orphans that go to live with a couple who lost their child and wanted to have some happiness in their lives again. In a small country town and far from any neighbours or the township lies a large house big enough to home the group of girls and the Nun accompanying them. But there’s one room that’s off limits, that is until Janice finds herself in there. As you could imagine, behind a locked door sits Annabelle in all her frightening glory.What is learnt from this film is Annabelle started as the young daughter of Doll Maker Samuel Mullens and his wife Esther. Annabelle died when a car hit her on way home from church. During the parents grief they let the demon use the doll as a way to communicate with Annabelle. And then things got out of control.There are some deaths and some prayers but nothing has much effect on Annabelle. She eventually takes over one of the orphans and moves to the next family to torture. Not the most exciting story line, which would have been fine had it been executed with a little more “ooo” and “aaahhh”.What does give this movie some encouragement is the young girl, Janice, played by Talitha Bateman (The 5th Wave), who is possessed by Annabelle’s demon. Bateman manages to be one of the only actresses of the orphan children that can deliver her lines and not sound like she is reading from a script. Her performance is not only believable but frighteningly so. As she goes from troubled young lady to possessed doll loving demon, she is almost worthy of your nightmares.Taking on the challenge of another Annabelle film that wasn’t really needed is Director David S. Sandberg. Now Sandberg has had a bunch of scary films under his belt already, in particular Lights Out. This was not only frightening but also completely messed up and worthy of watching. But he seems to have missed exactly what needed to be done to make this film worthy of anyone’s time.Overall this film has been overhyped but in reality under delivers. If you find yourself stuck for choice between watching Annabelle Creation or something else, take the something else. The scenes in the film that would normally have you on the edge of your chair, have you laid back looking at your phone for something to do. The moment they reveal Annabelle, even though we already know who she is, is so bad you’ll laugh. And there was a lot of laughing in the audience rather than people gasping or jumping.The Nun from The Conjuring 2 does make an appearance as she prepares for her full movie to be released next year as part of the franchise. Hopefully the franchise can redeem back what was once worthy of the big screen, yet now is more interesting to watch the making of the film than the film itself."}, {"rating": "9", "text": "I felt that Annabelle: Creation was one of the best Annabelle movies. This brought on a lot of tension and terrifying scenes. Past Annabelle movies were quite a let down but Creation was able to bring everything together and really brought the movie to a great end. The actors and actresses brought everything to life and executed everything very well. I found myself having to cover my face and peak through my fingers because of the moments and the suspense the creators made. This movie I would see again and I would have everyone I know see it, especially if they saw the past Annabelle movies."}, {"rating": "10", "text": "GOODGOODGOODGOODGOODGOODGOODGOODGOODGOODGOODGOODGOODGOODGOODGOODGOODGOODGOODGOOD"}, {"rating": "5", "text": "Definitely disappointed with this. All the elements are present, but they never add up to anything. The plot never coheres, the effective scares, tension and atmosphere all feel like disparate elements instead of a complete whole. This is simultaneously a supernatural haunting, demonic possession and a killer doll movie without any of the pleasing genre mishmash you hope would occur. The film seems driven by whatever a particular scene needs to happen to be \"scary\" without actually earning it. You want to embrace nightmare logic while watching this, but ultimately this goes exactly where you would expect, playing with expectations only within a scene, at random, without rules, not in an anything goes madness kind of way, but in an arbitrary lackadaisical one. It's borrowed parts, borrowed well, welded together at random."}, {"rating": "9", "text": "So apparently if you make a bad horror movie, but want to fix things so that the franchise doesn't die after it's first entry all you have to do is make the next one a prequel and cast Lulu Wilson. It worked for Ouija and now Annabelle. David Sandberg channels his inner James Wan using the same kind of slow freak out tactics that can be found in the first two Conjuring movies. Making Creation the first and only film in the cinematic universe so far that feels like a direct offspring of the two parent films.The references and tie-ins to the larger Conjuring universe are really slick. Lovely bits of fan service for those keeping up with what Wan and crew are doing. There's even a nod to the actual Annabelle doll that's done in a way that most won't pick up on unless they were curious enough to do some reading up on it. The ending is also a very smooth transition into the previous movie. I love the fact that we have an interconnected web of horror cinema that can branch out and do it's own things with different brands while still having links to one another that feel personal just like modern superhero flicks do.The scares are of the slow buildup variety. Playing off of your anxiety and anticipation for the next big fright. It's not quite as effective as The Conjuring in this regard, but this style of horror is still leagues more potent than any jump scare palooza. Annabelle's unnerving appearance is used in a variety of creepy ways. Some of which have a slight comedic edge to go along with the chill. Seeing that the doll's head has turned by itself is always good for a nervous chuckle and shiver up your spine.The story itself is really bleak. The big event that led to the doll's creation is brutally depicted in a matter-of-fact manner that's a real gut punch and a ballsy move for such a widely released horror film. There's is also some surprisingly graphic gore and the ending is of a sad variety because not everyone walked away okay. The tone made it feel like the characters were in real danger. Turns out that was actually the case too. The conclusion is made more tragic because Creation took the time to make sure I liked these little orphaned girls to the point where I cared enough to not want to see anything happen to them. Even the snotty ones. Maybe I just have a soft spot for kids. Of course it's hard to not love the adorable and sweet Lulu Wilson regardless. She's the new Joey King.After a poor first solo outing, Annabelle is redeemed onscreen in a movie so good that had the Warrens showed up I would've been cool with it being called The Conjuring 3. I mean it has the same structure of eerie escalation to a final act of big thrill terrors with plenty of character moments along the way. It's also more solemn than anything the genre has seen in quite some time. At least with this level of wide-reaching appeal that is.9.7/10"}, {"rating": "8", "text": "A formulaic jump-scare horror movie that is well executed. Good sound-design, camera work, and performances. While it doesn't reinvent the wheel and the ending feels nonsensical and needlessly bloated, this is still my favorite entry in the \"Conjuring cinematic universe\""}, {"rating": "6", "text": "Annabelle: Creation does many things right and many things wrong. Starting with the things it did right the acting by the children in the movie is simply superb. They do a great job conveying a sense of terror to the viewer and when one of them eventually gets possessed by Annabelle's spirit she plays evil well and most importantly in a way that isn't campy. Annabelle: Creation also manages to set the mood well. It never relies on the false dawn or it's-not-actually-the-monster tropes that many horror movies do and for this it deserves major props. This also helps keep you on edge the entire movie because you know that every time something goes wrong that it is Annabelle. That being said the movie does fall into many horror movie trops/cliches. The first of which being that it relies far to heavily on jump scares and does to the point that by the half way point they don't really get you any more. Also the film's presentation of the villain is only ok but I can't fault that because the movie is limited by its source material since it's a prequel. Lastly the ending is poor. It ends with the normal cliche false dawn of the monster not really being gone. Once again it can't be faulted too much for this as it is a prequel but they could have easily made the wrap up more interest. All and all Annabelle: Creation is a solid Horror film but nothing special relying well on it's child actors to build tension but relying to heavily on horror tropes to be a breakout in the genre."}, {"rating": "6", "text": "Director of \"Lights Out\" delivers another fine horror installment and is alot better than Annabelle and this period drama is worth your time however it doesnot break any ground."}, {"rating": "5", "text": "This is where it all begins!The second spin-off from 'The Conjuring' franchise and overall a fourth film to set in the same universe. The first film, which was 'Annabelle', I thought it was an okayish. Now with this, there's a potential sub franchise. Probably it could head back to back-wards as prequels, while 'The Conjuring is heading forward.There's nothing new from this, but still not a bad film. I liked the location. A single house in the mountain and revolved around a bunch of orphans. It is where it all begins. The creation of the most haunted doll that you saw in 'The Conjuring'. Focused on a doll making family, following an accident, how the family lived their rest of the life was told.A nun with a few orphan girls joins the family to live-in. When one of the kids discovers the locked away doll with secrets, the evil force unleashed. In the latter parts, the film reveals what happen to them and to the doll. Also hinting out at a possible prequel, going to be in Europe. I felt it was decent, so okay for watching once, especially if you had liked the previous one.5/10"}, {"rating": "7", "text": "After seeing this film, I understand why its reviews were good but not great. The first third of the film is interesting and the acting is good. The second third is unoriginal and repetitious and does not really build much suspense. But the final third is excellent although sometimes a bit hyperactive and over the top. Basically the “creation” story and building suspense was a bit dull, but Annabelle herself in action was worth the price of admission."}, {"rating": "6", "text": "It has all the makings of a good horror movie: a family tragedy, a big old Victorian house, young female protagonists, a demonic entity, and a good director."}, {"rating": "7", "text": "It fulfills what it promises: to frighten, in that aspect it is very well achieved, as Sandberg creates an atmosphere full of suspense the truth is incredible, very good director of terror. There are moments that make your hair stand on end and make you jump out of the chair. As for the script: I liked how it connected with the other films of this new cinematographic universe, but, it's a story that does not bring anything new and we've already seen it many times. The correct actions. A real surprise was this movie, it scared me more than I expected."}, {"rating": "4", "text": "There's some pretty decent scares in this movie, but that's just about all it has going for it and it quickly becomes a scare-fest with 30 sec daytime dialog scenes inbetween. Then cut to the next night and the next scare takes place. So you would sortof expect some sort of story to develop through that, but there's not really anything to grasp at here. And the scares don't make much sense. Is it the doll that's evil? Is it the girl? And why is the girl evil in the first place?Well, you get an answer to that about halfway through the movie. The scene is about 1 minute long, and that's it. No more story, just more scares. So the entire story of this movie can pretty much be compress to 5 minutes. 4 minutes at the beginning and 1 minute halfway through. Other than that, just scare scene after scary scene.It's not that the scenes by themselves aren't well done. But it's the lack of narrative progress between them that make it get old really quickly.The only thing that differs is which girl gets exposed to the next scare and in what room it happens.So I guess it's something like this: Until the nun have seen the demon, they aren't leaving the damn house. And because of that, **** keeps happening."}, {"rating": "5", "text": "Far from perfect but does offer mild entertainment and a couple of interesting scares. No where near as mind numbing as the previous entry in the Conjuring Universe 'The Curse of La Llorona'but still no more than a small distraction."}, {"rating": "9", "text": "You could not expect anything of this sequence knowing that the predecessor was very bad and messy, but the best was not waiting, why we were surprised with a horror film that hit everything from the minute details in question of the story and the cast which was incredible, highlight Lulu Wilson who is no longer the first film in the genre and that goes far if it continues like this."}, {"rating": "4", "text": "This was a movie over hyped. Contrary to what you might have heard the movie is not shot well, there are scenes that are just pointless and cringe worthy, and the movie just was not scary. Sure there might have been a scene or two that got the right vibe of a scary movie but the movie as a whole IMO failed. Oh and the ending is pretty stupid too and of course sets up for another cash grab for an industry that thinks once they make one good movie they can automatically make ten more movies off it."}, {"rating": "7", "text": "Annabelle started out a bit slow, although the story was interesting to watch.  We just kept wondering where the scares were.  But, once you get into the middle of the story, things really get going and they don't stop.  We get to see the origins of the problems with this creepy looking doll.  The very end seems to refer to one of the other Annabelle movies, but I wasn't sure I remembered that one.  Also, there is a little bit more revealed during and after the credits.  So be sure to stay through if tou want to see.  Not sure I get it.  But you might!"}, {"rating": "4", "text": "I have to say the movie was not scary at all, and it was so much confusing with mixing story and get's no right answer for the phenomena. It is a movie just to fill your spare time nothing more. The Chapter 2: Failed."}, {"rating": "8", "text": "James Wan's ToysSandberg has conceived a mixture of Hollywood and horror of quantity and quality in its purest state.Broadly speaking, the plot and the mythology are adequately connected, dramatic moments are fairly placed among sequences of distress and it even resorts, with evident respect, to the alternation of emotions technique that Wan established in \"The Conjuring 2 \", interspersing horror intervals with modest but substantial comical interventions. The development flows smoothly and there are no major drawbacks to the sub-universe that builds, however, the elements relapse into unending stereotypes, such as obligatory religious presence on the part of the nun or the increase in mortality in the final act, eliminating characters without any motive, an insane movement to some extent. To grip audiences, writers must produce characters that are interesting and this universe knows that very well. A pregnant woman, a ruined family or a girl suffering from polio are people with any kind of disabilities used in order to originate grief, a feeling that allows to strike up in a strong character-spectator relationship, getting we follow horrified the troubles experienced by the actors. Another very present aspect is the exorbitant amount of horror lodestones with which the film plays, although incredibly most of the demonic entities of the previous films won their own movie, Sandberg's movie seemed to want to do the same thing, packing with out-of-control Dantesque creatures, something works against the final result, since if they skip three of them, it would have been a frightening trip in the same way.Stephanie Sigman, Anthony LaPaglia, and Miranda Otto portray the older characters in a fascinating way, applauding the first one as the leader and faithful protector of the girls, however, and not belittling their very decent performances, the interpretative focus is explicitly over the younger actresses, especially Lulu Wilson, who did a spectacular job last year with \"OUIJA: Origin of Evil\" and this time ratifies her potential and ability to execute harder scenes with the most disinterested ease.Visually, the production design and the atmosphere testify the measured budget, moving away from large cities that would have required a lot of more adaptation from the 50's and thus a rise in the cost, this time everything acquires a rustic and powerful nuance, the housing trapped under litigant solar rays, a group of clothing, decorations and practical effects are those who take those green dollar bills. The game, in which darkness and cool and warm colors intervene, works in the tension moments, also the sequences of habituation and drama manage to catch the audience, components nothing short of stunning by employing an ordinary bed, a room armored by the pages of the Sacred Scriptures or an enigmatic well to conceive horror. Exclusive distinction deserves creation of the dissimilar Dantesque conduits maneuvered by an already classic Satan, which fulfill their function with honors, causing the possibility of—Hollywood is a box of surprises—adding more standalone films in it.There is a striking absence of the compositions of master Joseph Bishara, who was a key factor in the success of the other installments, among these \"Insidious\". The music is vital in products like these, sound stridency, resonances or atmosphere scores created by the composer are unique and they are greatly missed here, at least, so that sorrow is not so sharp, Bishara was present in the motion picture, for he's who performs the wicked devil. However, Benjamin Wallfisch and the sound editors team up to produce a soundly effective experience, accentuating steps, crunches, breaths, tones and suffocating sequences in a surprising way.\"Annabelle: Creation\" by David F. Sandberg is one of those rare, functional and spooky sequels/prequels arriving late summer and in the 21st century, two periods thirsting for original ideas, being an excellent film that joins the universe of \"The Conjuring\" with complacency. Although to narrative dimensions doesn't equal the main films, but it gets to execute sequences of tension and drama using as a means the most intrinsic fears of human, taking them even to such a pass that you will be impossible to take a breath, literally, look left and there's a scare, look right there's another scare, look up, down, in any direction, this evil circus won't stop attacking until committing its purposes. Advocating for old school horror, \"Annabelle\"(2017) is the perfect addition to the world of devilish toys and to verify its veracity I invite you to carry out the following experiment: Turn the light off, leave your bedroom door open and don't stop looking at that black space that separates your bed from hell, is she there?"}, {"rating": "8", "text": "7.7/10 - Annabelle: Creation is the fourth entry in the \"Conjuring\" Franchise. It tells the story about a dollmaker and his wife making their countryside home into an orphanage ,after the tragic death of their little daughter Bee. Yeah there are a whole lot of name puns in this film. The movie is surprisingly much better than its predeccesor. The child actors are great, which is not often the case in horror movies and the other actors ain't half bad. The atmosphere is authentic and the scenes are memorable. While there are plenty of jumpscares, they feel natural and earned, not cheap like in most horror flicks. Yep, the characters make dumb decisions,but not too dumb. Yep, plenty of horror tropes like knee-dragging, \"villian\" teleportation,blanket spooks and locked doors opening by themselves are present ,but they are embraced and done with full capacity. David F.Sandberg delivers a lot of fancy and cool shots across the table \"no pun intended\". We actually do not see Annabelle move, she does it only when we are not looking and it is is very subtle. Darkness plays a big role and it is used very effectively. The third act delivers on the R-rating of the movie through the use of some pretty disturbing imagery,that will be amusing for gore fans and not too over-the-top for others. The only major flaw is that this flick brings nothing new to both the Conjuring universe and the horror genre.Everything is traditional in the best way possible. Conclusion: Annabelle: Creation manages to improve upon the first movie through a decent script, memorable scares and remarkable directing. While not elevating the horror genre, it feels like a classic,fun movie guaranteed to scare the crap out of you every time. SPOILERS AHEAD:Although not making perfect sense, the tie-in to the first Annabelle movie is appreciated. The handicapped girl changes her name into Annabelle Higgins ,which is the psycho woman who possessed the doll in the first movie,explaining that the devil himself is the one we battled all along. Talitha Bateman does a fine job of playing the little-girl-impersonating-demon thing.The demon busting out of the scarecrow manages to be one my favourite moments in this movie,not with being overly creative,but with looking *beep* awesome. Everyone except the parents manages to live through the events,but not without some bruises. The deaths of the parents feature some impressive body horror,ranging from snapping fingers to mutilating whole bodies. The visuals themselves are noteworthy. The subtle references to Valak (from \"Conjuring 2\" and the upcoming \"The Nun\" movie) were small,but effective enough to remind us that this is indeed a shared universe,without getting bogged down in it. And the song \"You Are My Sunshine\" will never be the same."}, {"rating": "5", "text": "The build-up is too long without any scares, but afterwards it's scary as hell. Unfortunately, the ending is just plain dumb! I'm all for character and story developement, but 'Annabelle-C' unfolds at an excruciating pace."}, {"rating": "6", "text": "As we begin to see the characters morph into cliches, there is little to sympathize for them. What's only going for this movie is its horrific storyline, which still ends up dragging our attention through a heap of disappointment."}, {"rating": "10", "text": "Horror movie of the year.  This was an excellent horror movie, very well photographed.  I am writing this review a year after seeing it so details are fuzzy but just had to go on record for how good it was."}], "recommendations": ["scary_stories_to_tell_in_the_dark", "lights_out", "oculus", "the_woman_in_black", "ouija_origin_of_evil", "the_ritual", "the_ring", "mirrors", "the_conjuring", "the_forest", "insidious_chapter_3", "winchester", "the_boy", "the_woman_in_black_2_angel_of_death", "the_autopsy_of_jane_doe", "mama", "annabelle_comes_home", "it_follows", "the_possession", "insidious_the_last_key", "a_quiet_place", "sinister_2", "crawl", "insidious_chapter_2", "insidious"]}