{
  "id": 3826,
  "title": "Annette",
  "starring": [
    "Adam Driver",
    "Marion Cotillard"
  ],
  "runtime": 140,
  "genre": [
    "Drama",
    "Romance"
  ],
  "description": "The story of Henry, a stand-up comedian with a fierce sense of humour and Ann, a singer of international renown. In the spotlight, they are the perfect couple, healthy, happy, and glamourous. The birth of their first child, Annette, a mysterious girl with an exceptional destiny, will change their lives.",
  "releaseYear": "2021",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/4FTnypxpGltJdIARrfFsP31pGTp.jpg",
  "categories": {
    "plot": 6.0,
    "acting": 5.785714285714286,
    "ending": 6.75,
    "soundtrack": 6.6,
    "cinematography": 3.5,
    "familyFriendly": 3.0,
    "funny": 5.666666666666667,
    "action": 8.0
  },
  "reviews": [
    {
      "rating": "8",
      "text": "First off, this is basically a contemporary opera. Almost every moment is sung, featuring compositions by Sparks. The story is loaded with opera staples like desperate passion and inevitable despair. It’s set in modern LA, where Adam Driver plays a provocative conceptual comedian (never funny). His fervent romance with a world-renowned opera singer (Marion Cotillard) develops into marriage and a baby…that’s when things go bad. French director Leos Carax has infused the film with grand gestures, dramatic visuals and plentiful fervor. The performances are dynamic with Driver leading the pack with unapologetic commitment. The songs are primarily pop-based with plenty of catchy refrains (in the Sparks style). Comparisons to La La Land are inevitable, but this much more of an art film than a populist flick. Unquestionably unique.  NOTE: Stay thru the credits for one final song/procession."
    },
    {
      "rating": "3",
      "text": "The performances are great and that´s all there is. The music is not that good, the lyrics are lazy and the story is too simple to be that long, it feels way too stretched out."
    },
    {
      "rating": "10",
      "text": "Annette is truly amazing, truly incredible, and it's a truly Masterpiece, Annette is a dark musical movie that i've never seen before, the way they told the story with 90% of the film with only a music while they tell the story is so easy to follow, added with Adam Driver and Marion Cotillard absolutely stunning performance, Annette it's 2 hours and 20 minutes full of depression yet it's incredible, Annette is definitely one of the best films of the year."
    },
    {
      "rating": "6",
      "text": "In film, being ambitious and pretentious is something that happens a lot. And frankly it's not a bad thing.I love ambitious filmmakers, especially if they're capable of challenging you.The problem appears when the filmmaker in question, doesn't have what it takes to justify those ambitions and pretensions.And unfortunately, in my opinion for Leos Carax and his Annette, that's what happens.I have to make it clear. Annette is not a bad movie.My review may sound like this, but trust me, it is not.Annette is exuberant, thought-provoking, bizarre, and suggestive, but at the same time suffers from a notable lack of balance.I don't deny that there will be many people who will be able to admire what it's trying to do in a different way.However, trying to be surreal, provocative and intense is a risky move that can end up being a double-edged sword, because even with your fervent visual style, all of this can look pretty good on screen, but ultimately when you don't add depth to anything, the show ends up being hollow.Yes, it will be a show that looks very nice, that has spectacular visuals, that is competently directed, that its music is good, that its lead actor is really solid, but that also squanders its lead actress, and fails to become the wonderful rock opera, that I can believe its creator envisioned.And all this overloaded adventure with its more than excessive 140 minutes, can't help but seem lacking in better arguments to defend its position.Unfortunately for Annette, regardless of its qualities and most notorious elements, it's also a film that tries to be a lot when it's actually saying very little.It's not a disappointment. Far from it. I really think it's a good film, however it cannot avoid the issue of pointing up to the stars, yet it never takes off the ground."
    },
    {
      "rating": "0",
      "text": "By trying to go mainstream , Carax completely misses the mark and becomes lazy, self-indulgent, navel gazing and simply precious. By relying on a verbose script and boring exposition scenes, the cinematography and photography, which should be the core of its art, only flickers here and there, as symbolic embers of his dying inspiration.  Cotillard is as usual acting herself and insufferable as ever while Driver is of course a brooding faux-romantique caricature of himself.It's even worse than Chazelle's La La Land!"
    },
    {
      "rating": "8",
      "text": "This is definitely not for everyone, but I admire the ambition, production design, music, and story (especially the first half.) I also wish some of the singing were better. Not perfect, but there were enough beautiful and funny moments to carry me through. I do wish the whole movie were as playful as the beginning. My favorite parts were the ones that were overtly artificial — the audience in the stand-up scenes, everything with the amazing puppet, and the storm where Ann dies. Overall, an unforgettable film."
    },
    {
      "rating": "9",
      "text": "In Annette, director Leos Carax maximizes on its artifice and melodrama to explore more profound truths than a dozen movies of one “cinematic universe” can deliver these days. Annette, after all, is mostly represented by just a wooden marionette caught in the midst of a chorus of sound, fury, and every possibly stormy connotation in between. But even at the start, the film incorporates itself into a surreal world of odd musicality ruled by familiar figures of violently toxic masculinity — too often excused and encouraged to indulge a mythos of \"tortured genius\" — providing an uncomfortable mirror to our times in spite of some levity from their sung-along dialogue."
    },
    {
      "rating": "1",
      "text": "When I watch a movie, I pride myself on sticking it out, no matter how awful it may be. However, when it comes to this cinematic monstrosity, I came perilously close to shutting it off on several occasions -- it's that bad. Director Leos Carax's overstuffed, overlong, virtually unwatchable operatic tragedy tries viewer patience from about 10 minutes in all the way to its much-anticipated conclusion, a welcome outcome that doesn't arrive until more than two hours later. This story of an alleged stand-up comedian (though better characterized as a pathetically enigmatic performance artist) and his celebrated soprano wife who become the proud parents of a gifted marionette sans strings meanders along at a glacial pace and grows ever more ridiculous with each passing frame. The \"music\" (if one can call it that) consists largely of overly repetitive refrains of utterly mundane \"lyrics\" backed mostly by melodies consisting of a fusion of Carl Orff, Philip Glass and excerpts from the crowd scenes in \"Jesus Christ Superstar.\" Then there are the performances, which feature an array of issues, including the self-important, miscast portrayal of Adam Driver, the melodramatic overacting of Simon Helberg and the woeful underutilization of Marion Cotillard. I'll admit that I applaud the filmmaker's attempt to try and create something fresh and different, but this ain't it, and how this mess captured the Cannes Film Festival Award for best director is truly beyond me. Unfortunately, this is the kind of arthouse film that tends to give arthouse movies a bad name. By all means, skip this one at all costs."
    },
    {
      "rating": "1",
      "text": "I love Sparks but this is literally the worst movie I've ever seen and it's not even close."
    },
    {
      "rating": "10",
      "text": "The day after your experience the first Leos Carax film in a decade, read Justin E. H. Smith's \"A Total Work of Art\". It's the only one that puts things into perspective for Annette and matters honestly."
    },
    {
      "rating": "3",
      "text": "2021 has been an extremely disappointing year in movies.  You know it's bad when a film like \"Annette\" gets rave reviews.Come on, be honest. This movie was horrible.  Why does every filmmaker try to do something poetically artistic instead of just making a friggin movie about people doing dramatic things?  Forget the art, forget the algorisms, forget the hidden meanings.  Just entertain me.  Is that too much to ask these days."
    },
    {
      "rating": "2",
      "text": "Driver's the only reason I muddled my way through this shamble of a film. Excruciatingly soul-crushing lamentable piece of art."
    },
    {
      "rating": "3",
      "text": "bad[ bad ]adjective, worse, worst;(Slang) bad·der, bad·dest for 36.not good in any manner or degree."
    },
    {
      "rating": "7",
      "text": "My five takeaways after watching 'Annette':1. You must watch it free of spoilers.2. Sparks is the best-underrated band in history.3. Adam Driver can do anything, and I mean ANYTHING. Curious how we get to see him as a \"villain\" two times this year — the other one being 'The Last Duel.'4. The story is a little too-in-your-face, but still engaging for the most part.5. We need a crossover film with Annette and Ada from 'Lamb.' Now THAT would be something."
    },
    {
      "rating": "6",
      "text": "As a serious Leos Carax fan, I expected a lot from this film, and maybe that's why I was so let-down. Holy Motors is probably my favorite surrealist film of the 21st century, and I could watch it over and over again. With Anette, Carax drops some dimensions and makes a flat rock opera. With characters that are nearly impossible to relate to, and don't even gel that well with each other.  Maybe that was the point to show distress in the relationships of the characters? But it just didn't work for me. Although there are quite a few scenes I enjoyed, ones that harken back to the usual Carax imagery, there's not enough of it to save this film.  I can't give it a negative review, as some of those parts are worth watching, so a 6 would seem formidable, which is a bummer, as Holy Motors was a total 10 and then some.  Can't wait for the next Carax, to get a little redemption.  A very two dimensional rock opera that is more concerned with breaking 4th walls and reprising tunes than it is concerned with making a compelling story. 6 out of 10."
    },
    {
      "rating": "7",
      "text": "An oddly experimental film that I throughly enjoyed. This film definitely isn’t for everyone however, I really loved its presentation. A lot of this feels like a weird musical and I think that’s what it was going for. All of the music here is great and since the music and writing go hand in hand here, that means I think the writing is excellent too. Sometimes it’s a little weird with its presentation and writing but those moments were usually few and far between. Adam Driver and Marion Cotillard did an excellent job in their roles and I hope they get some recognition for it during the awards season. Leos Carax’s directing is one of the best of the year so far. His style and tone is extremely clear and feels unique to this genre. There a lot of moments in this film that kept me extremely captivated and I loved that Adam’s and Marion’s characters daughter is a puppet most of the time. It gets its point across clearly and I loved the daughters inclusion. There were moments here where the film subverted my expectations in different and unique ways in terms of character development. The final scene between Adam Driver and his daughter is heartbreaking and leaves you feeling both joyful and heartbroken. It’s a film that isn’t going to be for everyone but I would definitely recommend checking it out if you like weird and unique musicals."
    },
    {
      "rating": "8",
      "text": "This is very much an arty film - it comes across as primarily a musical, with an almost operatic sense or setting to it...it may well be viewed as pretentious to some, though I did enjoy the musical numbers, the operatic singing and the rousing feel of it every so often. It's a bit hard to fully interpret, storywise, at times but the cast give good performances and its certainly entertaining - surprisingly engrossing at times. It won't appeal to all by any means, if you know what it is and it appeals then I'd say its worth a watch but if your not keen on reasonably big scale, somewhat operatic type musical films (with a fair amount of quirk), then stay clear of this would be my advice, otherwise I recommend it."
    },
    {
      "rating": "7",
      "text": "It may be weird and it may have ups and downs, but this radical film deserves recognition for its originality and audacity. Adam Driver is amazingly good and the rest of the cast, score and cinematography are also remarkable."
    },
    {
      "rating": "9",
      "text": "of course, this movie isn't for everyone, but i personally enjoyed it! if not for the movie itself, just go for the laughs. my friends and i giggled like crazy at some parts(don't worry, it was a VERY late showing). this is honestly one of my favorite perfomances from adam driver, and i can't wait to watch more simon helberg projects(he's great!)"
    },
    {
      "rating": "10",
      "text": "Incredible. I am in tears, visually beautiful, heavy and relevant subject matter, beautifully composed music, intense inter-actor connection. cotillard and driver were the perfect artists to pull this off. I loved the conductor. It comes off niche, but it can be enjoyed by anyone with a brain. the people who rate this low are uncultured swine and I am proud to not share a perspective with them. BRAVO!"
    },
    {
      "rating": "10",
      "text": "An insanely incredible ride, Adam Driver’s physicality, singing and overall acting in it is astonishing."
    },
    {
      "rating": "8",
      "text": "Initially, I felt very confused about what kind of film I was watching, until a saw the interview with the writers of this film, Ron and Russell Mael, members of the band Sparks which they had plans for their new album to be presented by means of a film. So, that explains the strange format that it had and it brings a lot of freshness to this genre. But, at times I lose my train of thought.The director shows incredible creativity in the staging of this film, most of the time by artificial means in a good way, because the artificiality somehow heightens the emotional component instead of distracting you. The performances were great and the last scene adds enormous emotional value to the film."
    },
    {
      "rating": "7",
      "text": "Love the experimental style of this but it definitely can feel overbearing at points."
    }
  ]
}