{
  "id": 2367,
  "title": "Annie",
  "starring": [
    "Quvenzhané Wallis",
    "Jamie Foxx"
  ],
  "runtime": 119,
  "genre": [
    "Comedy",
    "Drama",
    "Family"
  ],
  "description": "Annie is a young, happy foster kid who's also tough enough to make her way on the streets of New York in 2014. Originally left by her parents as a baby with the promise that they'd be back for her someday, it's been a hard knock life ever since with her mean foster mom Miss Hannigan. But everything's about to change when the hard-nosed tycoon and New York mayoral candidate Will Stacks—advised by his brilliant VP and his shrewd and scheming campaign advisor—makes a thinly-veiled campaign move and takes her in. Stacks believes he's her guardian angel, but Annie's self-assured nature and bright, sun-will-come-out-tomorrow outlook on life just might mean it's the other way around.",
  "releaseYear": "2014",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/33WsmnE5M2SSGrZCQW4dlr2D5WG.jpg",
  "categories": {
    "plot": 5.75,
    "acting": 7.166666666666667,
    "ending": 10.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 6.0,
    "funny": 10.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "7",
      "text": "It's a tad long and a little older now so I was never going to love it, but for what it's worth this is a good film with some great acting performances and songs. It starts off better than it finishes as it gets a little dull once Annie leaves the orphanage but Tim Curry notably brings it up a notch when he appears. Aileen Quinn also made one hell of a movie debut as Annie. Musical fans will get their kicks out of it, especially those that loved the Broadway show. Overall it's good, but just."
    },
    {
      "rating": "10",
      "text": "I think this was funny as hell. In the begining once you watch the it feels like all there is a lullaby (Tomorrow and Maybe) being sung by Aileen Quinn as Annie then it gets good as soon as Carol Burnett comes in and starts mocking her voice. Then when it gets to the point where Annie punches those boys in the faces it makes you want to say some line that Bruce Willis says in all of his Die Hard film (Yippee Kie Yay Motherf**ker. The songs make you wanna dance like hell. The acting was really good. However the ending was good enough to scare the living  out of me (Annie climbing the bridge). Out of all the Annie films I seen I like this out of all the films."
    },
    {
      "rating": "7",
      "text": "Yes, the plot is paper thin, and yes the characters are underdeveloped and change heart so fast you'll get whiplash. But look, this is a film primarily for kids and full of kids. Most of whom manage to sing without being too twee (no easy task given the content). And the songs themselves are fun, funny, clever and catchy. The dance numbers are a bit lengthy and can feel like filler, but they are well-choreographed and executed. The acting is, naturally, a bit cartoon-ish. But Burnett owns her role, never letting it get too sloppy/absurd. Little bit of swearing (since I said this was a kids film), and a lot of barking. Genius? No. Underrated? Yes."
    },
    {
      "rating": "4",
      "text": "OUCH!!!!!  ANNIE is horrible, annoying, and stupid.  What an awful production ANNIE is.  I have to stop saying the name or else it'll be like BEETLEJUICE (a much BETTER movie) and come out!  Let's hope Willow Smith has a good singing voice.  Hate to tell you folks; they're remaking it, and she's...the main girl!"
    },
    {
      "rating": "6",
      "text": "I this movie was very fun to watch with my children plus you never knew what was going to happen next ."
    },
    {
      "rating": "5",
      "text": "I enjoyed the originality of Annie as well as it’s choreography and soundtrack, but that’s about where it ends. The story is choppy at times and it’s acting is worse. Some of the music also sounds the same and the lyrics are sometimes predictable. I like watching musicals, but unfortunately this musical wasn’t amazing."
    },
    {
      "rating": "4",
      "text": "The plot is really good but I think it should be better musically to be considered a really great musical movie."
    }
  ]
}