{"id": 1277, "title": "Annihilation", "starring": ["Natalie Portman", "Jennifer Jason Leigh"], "runtime": 115, "genre": ["Science Fiction", "Horror"], "description": "A biologist signs up for a dangerous, secret expedition into a mysterious zone where the laws of nature don't apply.", "releaseYear": "2018", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/4YRplSk6BhH6PRuE9gfyw9byUJ6.jpg", "categories": {"plot": 6.4576271186440675, "acting": 6.323529411764706, "ending": 5.947368421052632, "soundtrack": 7.2, "cinematography": 8.0, "familyFriendly": 3.0, "funny": 2.0, "action": 6.5}, "reviews": [{"rating": "1", "text": "Bring a book. Or your Kindle device.It’s been said that the only legitimate philosophical question is in the form of “Why is there something instead of nothing?” Annihilation reverses the two subjects of that question.I don’t mean to dismiss anyone’s experience in watching the film, but I found nothing intellectually challenging about either the story. The largely meaningless interpersonal exchanges among and between the characters offered little in the way of much-needed distraction. The scientific revelations that at least three characters advance during their slow walk to a parking lot in a mall that closed decades ago are earth-shattering only if your imagination doesn’t allow for the existence of other forms of life. Even their hypotheses were dull. And you don’t need to be a biologist to figure out what’s different within the alien forest (the writers use the word “shimmer”) in comparison to everyday, carbon-based existence. I won’t give my explanation here since it may be one of a few mundane mysteries in a script that favors only those who delight in disappointment.The narrative is both uninspired and uninspiring, and the writers provide several opportunities to stop caring about the story and the characters. Unfortunately, this apparent attempt to tamper enthusiasm about the project and the characters who work ay getting us to dislike them spills over into the ending which then steers viewers to ask themselves a very limited set of questions about what may have happened in the film. At least those who were still interested enough to care. I was not among them. I also had the dreaded “embarrassed-for-someone-else” experience more than once, both for a meandering story that seems satisfied to make halfhearted attempts at being interesting and the portrayal of a land that was too often straining to be different in ways that might move viewers to be left in awe. Never happened. CGI and special effects are bland; nothing new to see here that hasn’t already been portrayed (badly) in Sci-Fi TV series. A walk through a rain forest is more visually compelling, even if taken on the National Geographic Channel. The alien world that’s presented evokes images of a darker though ultimately lackluster Walt Disney World in a sometimes cartoonish way rather than shuttling back and forth through the multiple levels of being presented in Interstellar. It portrays a different kind of reality as a blunt object in a world that cries out in desperation for a finer, simpler touch. What’s supposed to be frightening is too often unwittingly comical; the gravity of the mission and the vulnerability of the characters lose their narrative force as a result. (If you haven’t seen it, check out The Forbidden Planet -- a film released more than sixty years ago -- for its compelling narrative and limited but, within the context of the story, realistic special effects.)Annihilation is not worth seeing, even if you have MoviePass. Not a single “ooh” or “aah” throughout though there was some suppressed laughter along the way. Probably the worst movie I’ve seen in more than a year. I doubt that Annihilation will show up on a “One Hundred Underrated Sci-Fi Movies from Twenty Years Ago” list. There just isn’t very much to it."}, {"rating": "2", "text": "Don't waste your time on this movie..it's awful. The only reason I gave it a 2 is because of the soundtrack."}, {"rating": "10", "text": "\"Annihilation\" is based on a novel of the same name by Jeff Vandermeer, a writer specialized in a sci-fi/fantasy sub-genre known as \"Weird Fiction\". This book is the first from a trilogy: the \"Southern Reach Trilogy\"; however, director/screenwriter Alex Garland (\"Ex Machina\") wrote this adaptation before the next two books were even published. \"Annihilation\" follows the story of a Lena, a biologist with military background, whose life has been shattered by the disappearance of her soldier husband who had gone on a secret mission into an ecological disaster area presumably harboring by an alien presence. At the beginning of the movie, we witness the return of the hubby, who unexpectedly comes back home in a confused mental state, soon becomes ill and is taken to a secret facility together with his wife. The place is a scientific research installation, built on the vecinity of an ever growing quarentined site known as \"Area X\", which comprises a coastal area and its adjacent forest, permanently enveloped in a phenomenon called \"the shimmer\"; this is an iridiscent wall of light that enshrouds the entire area, disconnecting it from the external world, which originated years prior when a meteorite hit a nearby lighthouse. Little is known about what is going on on the other side of \"the shimmer\", since several expeditions have gone missing and its members are presumably dead. Lena will meet doctor Vendress, a psychologist and authority figure, who explains to her that her husband is in the facility, suffering from multiple organ failure and massive bleeding. Both women agree that Lena should be part of the next expedition to Area X (it is argued she might be able to find a cure for her ailing husband), an all-female team that includes the rather obscurely motivated psychologist, all of whom seem to have very little to lose appart from their own lives. The movie weaves different timelines in a very seamless way: the very beginning is an interrogation scene where Lena is being inquired by a scientist about her experience in the Area X and the fate of her party; the second timeline kicks off with the husband's reappearance and continues with Lena meeting the members of the expedition and departing into the unknown. There are also flashbacks of Lena's immediate past with her husband, which provides information about their relationship that is crucial for establishing the dramatic core of the story. Alex Garland shows an assured hand with the complex narative, a combination of economy and elegance that that is both elocuent and easy to follow; this allows him to introduce different layers of meaning within the narrative (psychological, scientific, philosophical), and to tackle big themes without becoming pretentious or obtuse. The movie has memorable dialogue not included in the original novel and the characters are much more fleshed out (the conversation between the biologist and the psychologist about the nature of self destruction is a highlight, and a pivotal moment in the film).As someone who have read the books, I have taken notice of the multiple changes that have been introduced by Garland, and even though a favorite character and storyline from the novel have been eliminated, and some elements have traded background/foreground places, I appreciate the way the director has made this story his own, taking enough from the book to make the story recognizable, but at the same time making his own interpretations and connections, expanding on its themes and characters. There is much wonder, weirdness and visual poetry to be found in the beautiful and exceptionally well crafted film, and to my surprise there is also plenty body horror and sudden outbursts of gnaly monster action, with one scene being particularly brutal and effective. This is a film where you can clearly appreciate the simbiotic relationship between these two highly imaginative thinkers, maybe the best collaboration since Kubrick and Arthrur C. Clarke in \"2001: An Space Odyssey\"). \"Annihilation\" represents the type of reflexive science fiction that ponders about our place in the cosmos, our intrinsic mutability, and the horrors this conjures; it amounts to a surreal, sciency phantasmagoria about desintegrating identity, deeply rooted in cosmic horror. It is the rare high concept movie that is both extremely entertaining and dazzingly thought provoking. And I have no words to describe that climax apart from saying it left me in complete awe. This is for sure a new sci-fi classic that consolidates Garland as one of the major sci-fi visionaries of our time."}, {"rating": "1", "text": "This was one of the the most pretentious and awful Sci Fi horror'esque movies I have seen in a long time. Save your money. Terrible casting, Jennifer Jason Leigh is so bad I actually almost fell asleep. The rest of the supporting cast is terrible. Terrible dialogue as well. One scene in particular with Portman and her colleague in a private moment actually made me laugh out loud. That never happens to me. The movie has no idea what it wants to be. The ending is NOT thought provoking, it's lazy, under developed and full of superficial substance leaving the innards as hollow as can be. I didn't even pay to see this and felt robbed. This is coming from a life long sci Fi and horror junkie. I loved ex machina but this was a huge let down. What is wrong with critics? If they are rating the movie based on visual aesthetics and a diverse cast meaning ladies only, then sure this is an 8 out of 10, but when digging deeper, this is a hollowed out experience with little substance, much like the majority of new theatrical IP we are seeing today. This was a mish mash of ex machina, the thing, predator, the arrival etc... You're better off sticking to those movies, they did it better...1/10 for me."}, {"rating": "6", "text": "Not the best perfomance of Natalie Portman, and probably to expensive ... some effects are poorly and especially the scene which shows the outside of the house, CGI??? Its an awesome idea, but for me it was poorly written, it needs some tension, when it’s building up, it is falling down very quickly. It feels like it is trying to find a claustrophobic feeling. It is overrated, I rather take my time to watch the first Alien movie the 100th time again!"}, {"rating": "5", "text": "This felt like a film that had potential, but squandered it in a weird predicatable twist and an overly arty last 10-15 minutes. Some of the effects and scenes were really well done, offset by some weird story line focuses and glaring and frequent plot holes.If youv got Netflix and you like sci-fi give it a watch, seeing as its free, otherwise you can safely give it a miss."}, {"rating": "5", "text": "After \"Ex Machina\" I expected more from director Alex Garland. Annihilation is pretentious, boring and ultimately style over substance.The premise itself is intriguing - there is an expanding supernatural Zone out of which nobody has returned, except for Natalie Portman's husband, who appears to have no memory of prior events. Portman herself is a university professor who presumed her husband dead.However, everything goes downhill really quick. First, literally on the 3rd minute of the movie we are shown a comet hitting a lighthouse, which immediately eliminates any mystery regarding the Zone's origins, as it's clearly extraterrestrial. Then we are led to believe that the Zone has been expanding for 3 years already. And what has the government organization overseeing it done in the meantime? Perhaps, send a large-scale military/scientific expedition with lots of gear and vehicles? Well no Sir! They have only sent a few small teams, none of which ever communicate or come back. So, by the movie's events, the current squad consists of 5 suicidal women who barely have any relevant skills for the mission. And while all are \"scientists\", the only person who tries to do some research is Portman, who at least takes biological samples along the way.And how our 5 girl-scouts act once they enter the zone is unspeakable. They go in without any protective gear(!) and only M4s for weapons(!!), with only Portman having prior shooting experience(!!!), follow no plan and just wander around wasting time(!!!!) and leave no marks to be able to find their way back, as GPS and even compasses don't work(!!!!!).Besides the sci-fi-ish premise, the movie also has some horror elements, so there are obligatory scenes of a team member being snatched from behind, and one team member losing their mind and acting hostile towards others. The latter scene looks very lame, by the way. There is some suspense in the film, but not enough of it.While Annihilation has some pretty, albeit low-budget, imagery, the story feels like its writer just came up with some creepy moments but didn't care to stitch them together in any sensible way. There isn't any sense in Thessa Thompson's turning into some sort of discount Poison Ivy and disappearing. There isn't any sense or consistency in the CG-alien's actions. Why has it \"entered\" Jennifer Jason-Leigh and obliterated her? Why hasn't it done so with Portman, and played some copycat game instead? The alien core can be burned to the ground with a single phosphorus grenade, really? Why didn't Isaac's duplicate (whose reveal was as obvious and predictable as possible) also burn down, while all the other alien constructs were destroyed?The answer to all those questions is because the writer did a sh***y job, that's why. Unfortunately, Annihilation is a disappointment."}, {"rating": "5", "text": "None of the decisions these characters make any sense.After years of the \"shimmer\" existing, they plow deep into it the exact same way they have since the beginning. Let's not bother sticking a hand in and pulling it out then studying the result. They say \"... nothing ever came out\". Throw something in, pull it out with a rope. SMH.There are many other examples of characters making stupid decisions which constantly pulled me out of the suspension of belief and enjoyment of an otherwise interesting premise."}, {"rating": "4", "text": "Realmente parece más interesante de lo que es, se queda en película del montón diga de ver en televisión a las cuatro de la tarde en cualquier canal para rellenar el tiempo hasta el prime time"}, {"rating": "5", "text": "A shallow movie with pretentions of depth. Full of paper-thin pseudoscience and vague handwavings towards cosmic mind, as well as guns and monsters. Some cool digital art and some atmospheric scene setting, but altogether it falls far short of what it wishes it was. Given other people's ratings I really expected more."}, {"rating": "4", "text": "The movie starts with a spoiler for the whole movie. That made me very angry. The caracters are acting very unreal andthe end is one of the baddest ending i ever seen in a movie."}, {"rating": "6", "text": "I like to keep my reviews brief and in list form, so I will assume the reader has a basic understanding of the movie's plot and and an awareness of the main cast. PROS:-Interesting concept, and has at least a good sense of mystery at the beginning. I like the general idea of a phenomenon causing rapid mutations / evolution in a contained area.-Solid cast (if not entirely accurate, ahem). Although Gina Rodriguez was weirdly channeling Michelle Rodriguez for some reason. Still, it's Jane, so it's fine.-There was a moment with a certain mutant bear that was genuinely creepy AF. Also, slithering intestines.CONS:-The backstory of Lena (Portman) is slow and nuanced to the point of being boring. She and her husband (Isaac) don't really have strong enough chemistry in the beginning to make us care about their relationship and what happens to them -- or at least I didn't.-The visual look of the \"Shimmer\" was not effectively alien to me. It just seemed like a soapy, rainbow-hued veneer, like something you would see in a music video.-Portman's ragtag team were not interesting or developed (even as supporting characters), and there was very little interplay between them to provide a reason to care what happened to them.-The ending, while visually interesting, was entirely unsatisfying and inexplicable. Then again, I'm not a fan of the pretentious \"so vague it's genius\" tactic that some high-minded movies aim for. But the alien mime-off was still kinda cool..."}, {"rating": "4", "text": "Another one of those what ifs that could have been so much better with a more experienced director. One of the problems with Garland is that he's idolised as a voice of a generation and so carries a weight of expectation on anything he puts his hand to. Along with that, there's more a hint of fawning from British reviewers - so knock at least a star off Empire and Guardian reviews.Ex Machina was relatively tight, set in a confined space with few characters, it did pose some good questions on AI, humanity, and ego, before setting them aside to focus on manipulation and thrills.Annihilation is broader in scope but less interesting, less well structured, and confused about what it wants to be; tonally it shifts all over the place. It begins with a meteorite hitting earth. It carries a life form that replicates and mutates across species, as well as between plant and animal. Its effects are spreading outwards from the point of impact at an increasing rate, and the edge of its area of influence can be seen as a shimmer. Teams of people have gone into the 'shimmer', but none have ever come out.Then one man does, except there's something wrong with him: he's bleeding internally and apparently close to dying. His wife joins up with a team going into the Shimmer in order to get to the source in the hopes that she'll find something that will help.This is all standard fare for Science Fiction - it's kind of The Andromeda Strain meets War of the Worlds meets Contact meets Alien meets Deliverance; the basic set up could be told in minutes, but it takes forever to get its arse in gear. That's a big part of the problem, the film can't decide what tone to take - it starts off as a drama, then tries to switch up gears to being an adventure into the unknown before switching gears again to survivor horror before going for something trippy.It just doesn't gel as a whole story, it's more a collection of influences strung together in a manner that's less than the sum of its parts.Natalie Portman does well with a character who has to be strong enough to survive but who seems too often to be asked to play her part as over-wrought. She's fearless bringing down sharkgator, but that moment is the only one where she seems in command of herself.Jennifer Jason Leigh rasps her way through things with scene stealing disinterest, which is at least notable. Everyone else is cardboard thin so that by the time they start disappearing one by one, as people in these things are wont to do, it's impossible to care either way.Aside from Sharkgator there's a Cowbear auditioning for a sequel to the Revenant but it fails because it makes our 13yo boy laugh - this scene goes on far too long and is so clumsily handled that any necessary tension for it to work is lost in a miasma of hohumness. There's another faux Alien bit that's supposedly gory, but again the fakery can be seen a mile off so that when things happen there's no shock or disgust. The idea of an alien virus mutating DNA is interesting, but here it's just used as background wallpaper onto which has been slapped a generic story about a group of red shirts on a mission where things go wrong and they die one by one until there's a lone survivor left. The more interesting story to me was what was happening with Oscar Isaacs character. He turns up bleeding internally on the brink of dying but somehow manages to survive for months - what happened there? Was he being studied? Did they find a 'cure'? He's obviously been quarantined so they must have done tests, even at a cellular level there must have been some discrepancies? How come neither of them turned into tree people?There are no shocks. There's no horror. It's a bit gory in one scene. There are no thrills at all. The pacing is clunky. It looks very pretty in one or two places.This isn't so much a deliberately slow-paced film as a low energy one consumed by indecision. Paramount dodged a bullet by Netflixing it.Meh!"}, {"rating": "6", "text": "For the most part, this was a pretty good movie.  Loved the scary parts and the story is very intriguing.  I was totally feeling it all the way until the end when I just got a bit lost.  Still not completely sure what exactly was going on or exactly what happened at the end, but it was a bit out there for me.  I thought the first at least 45 minutes were kind of slow for me.  I just wanted the story to get going.  Once it did get going, it was very engrossing and I was really along for the ride.  It just kind of left me in the dust in the end."}, {"rating": "6", "text": "If you're even remotely interested, watch it on Netflix.It's a weird movie, pretty much average in everything.There's no highlights really, but bad moments aren't too often or important.It could better, it could have more logical plot, but it doesn't matter in the end. It's a simple movie, with simple plot, and a lot of overused themes. You watch in anticipation for a big twist or something innovating, but you won't get it.Pretty much very similar quality to Prometheus or Alien: Covenant. A bit more artistic, but same in the end.I would regret going to cinema, but it's OK for a Netflix movie, especially with good HDR."}, {"rating": "5", "text": "A film that tries to make you think you should like it more than you do just because it's 'artsy'.Wooden,comatose uninspired acting and dialogue .Starts getting interesting at the end but by then it's too little too late."}, {"rating": "9", "text": "This spectacle is not for everyone and I have to make it clear. This film is a very oneiric, story that does not fully give any answer, and the attempt to translate the novel was, in my opinion, an unrealizable project - and it was done great. Beautiful pictures, wonderful music and a plot that gives a lot to think about, even opening the mind."}, {"rating": "7", "text": "The movie and the book(s) are so very different, yet the book offers integral insight into what the movie is trying to achieve. I can see how the movie might fail some who didn't read the book. I'd probably have to see it again to reach a more definitive conclusion."}, {"rating": "7", "text": "The visuals are stunning. The plot not so much. The take of not explaining or simplifying keeps you curious. the gory stuff is just about right. a new idea at least for me that an alien invasion will not be about guns and destruction can be so much more scarier and invisible and uncontrollable."}, {"rating": "5", "text": "HIGHLIGHTS of this movie were all in trailer..and I get real angry when moive is hyped to be one thing (action flick) when it is basically another (head trip)..FAR more slow and cerebral than action. I was bored and disappointed. Tone and pace reminded me of The Arrival..if you liked THAT then by all means give this look..just IMO wait for DVD..maybe a 5 is a little unfair..but then again you got my money and time cuz you led me to believe this was gonna be an action roller coaster..and I was stoked for THAT.. not some lame kiddie ride"}, {"rating": "5", "text": "A great soundtrack and cool overall style don't make up for the disappointing realization that Annihilation is ultimately a very shallow film. You just think it's going to end up having more to say."}, {"rating": "6", "text": "Feeling underwhelmed from this. Typically with a good sci-fi movie, I leave the theater thinking about the movie and it's implications in our daily lives. In the vein of Ex Machina's exploration of consciousness and artificial intelligence's need for humans, Arrival's dissection of time, and even Blade Runner 2049's creation of a feeling through the exploration of a consciousness in a dystopic future.Here, we have what feels like a typical survival movie wrapped in some interesting biological science. The major difference is that, the plot of surviving feels more central to the movie than the human implications of this biological phenomenon. I think a good sci-fi movie should package this in the reverse, where the plot is simply the device they express their greater idea. This was absolutely lacking in Annihilation.Maybe it's because I went into this with the expectation of an Arrival-like experience, that I left disappointed."}, {"rating": "8", "text": "Annihilation is a movie I personally needed. In more general terms, I think it show's everyone how a great movie is made. Great cast of characters. It's mostly female, but it does it in class. Never does it feel like it wants to be \"culturally important\" but it just tells a story where the main characters 'just so happen' to be women. The acting and writing overall was mature and left a lot to the imagination. Besides that the visuals and score (oh my god that score) were mind blowing. Besides that I think it's best if you go in blank en just experience it for yourself to make your own conclusions. In the end I think that, when everyone forgot about Marvel movies in the next decade, this one will still be fondly remembered by artists, creative people, people who have the ability to enjoy and understand abstraction and intellectual theme's. It's very high on my list of 'best of the decade' so far. Would recommend it to anyone, but it's a must see for fans of good sci-fi/horror."}, {"rating": "7", "text": "Annihilation may not be entirely successful, but when it works, it really clicks. The last act's ambition was set for the stars, which is why it was such a shame to see the first 2/3rds carry on as a standard sci-fi schlock fest riddled with clunky dialogue and genre cliches. Coming off the success of Ex Machina, writer/director Alex Garland is probably one of the few individuals who would've been able to get this film made, being as strange as it is. The studio appears to have little faith in the project, as they've dumped the international release straight to Netflix. Substantively, Ex Machina this film is not. Though Annihilation's final images leave something for the viewer to chew on, Lena (Natalie Portman) and the rest of the group of female scientists assigned to investigate \"the shimmer\" are not nearly as compelling as Alicia Vikander and Domnhall Gleeson were in Garland's previous directorial effort. The mystery and suspense built up during the film's first act is quickly dissipated as CGI creatures come barreling through forest environments to pick off the group members. When Annihilation is subtle, it is at its creepy best. Unfortunately though, the script is nowhere near subdued nor intelligent enough to sustain compelling drama for the length of its two hour run time. The rumbling, ethereal sound design does most of the heavy lifting in providing the appropriate atmosphere. The operatic chorus that accompanies Lena and the squad's revelations is a nice touch. Largely how one will feel about this film is their reaction once Natalie Portman reaches the Lighthouse. I bought into it. Its creepy. Its disturbing. But most of all, it carries the film's intellectual heft. Self-destruction is the theme, but you're liable to self destruct yourself after trying to wrap your head around the film's final images. But that fundamentally is what keeps things interesting."}, {"rating": "6", "text": "More vague than illuminating, \"Annihilation\" is captivating throughout but ends up feeling like it grasped more than it could hold."}, {"rating": "6", "text": "The effects and analog in annihilation are stellar with lots of colors and monsters. A good movie isn’t just affects and monsters it needs a relatable storyline that the audience understands and this was lacking it. The shimmer has no realistic laws and this makes it sloppy. At any point you can learn a new weird thing that has nothing to do with the movie. It was still going all right and interesting until we got to the end of the movie where (like all movies) it went down hill. I don’t think even the directors know what it means. Audience will love a movie if it is incomprehensible and will think it is brilliant, but I’m not so sure."}, {"rating": "7", "text": "The 'I don't know' movie shows how stupid looking are the too many 'I don't know-s' answers. Visually stunning, great effects, nice to watch. It's not waste of time, because you see the potential - there is a big one. You can see how the imagination of the story teller has grown in the first 45 minutes and then suddenly stopped - literately you can see the end of this imagination.I hope this movie has remake, it would be very interesting Sci-Fi to watch, but now it is not finished."}, {"rating": "5", "text": "It starts off real well, but like all Alex Garland movies, it peters out in the end."}, {"rating": "9", "text": "Annihilation is a very fascinating SciFi movie and something I would reccomend to everyone with an interest in cosmic horror.I think something that will rub people the wrong way is that there is a huge plot hole early on in the movie in order to get the story going. But if you can look past that and have an interest in thoughtful SciFi movies you will be very pleased with the themes presented in this movie as well as the audiovisual experience it provides. Following the group of characters decent further and further into the unknown was both fascinating and thrilling."}, {"rating": "8", "text": "TL;DR Another case of misleading trailers contributing to negative reviews as well as another case of 'WTF Was That ?' just like John Carpenters The Thing which was similarly snubbed for being stupid and gory with no explanations, it is a whole different case now and similarly I think this movie will gain a cult status.Also I completely understand the negative reviews since even I went into the movie expecting just another Action Sci-Fi FX fest with over-exposition of plot points which propel the killing of human imagination. Personally I enjoyed it every time someone in the movie said \"I Don't Know\". It is amazing to let you own imagination interpret what is happening.The acting is solid all around, the atmosphere was enjoyably scary, the all female Team not acting like unnecessary SJW Champions (aka Ghostbusters 2016) was refreshing.The CGI was not the most excellent at all times but will fill you with dread when needed and get you confused and horrified, the music was also a big part in the overall experience.Though it is quite a slow burn I encourage everyone to keep aside any expectations of a conventional action sci-fi and just watch this movie with an open mind and let your imagination wander."}, {"rating": "9", "text": "A great omage to Lovecraft!!! It's just the CGI in some parts that is kinda off. Really love the cinematography and sound."}, {"rating": "9", "text": "Beautiful and calm!awesome screenplay,score,story and acting it kept me engaging and made me feel whats behind this everything and ending was awesome as hell!A great movie!"}, {"rating": "9", "text": "Brilliant film that is thought provoking with refreshingly original ideas and terrific use of scifi tropes. Maybe this experience should be endured sober otherwise you may have no idea whats going on."}, {"rating": "8", "text": "This movie was awesome! It was written for the screen (it’s based on a book) and directed by Alex Garland, who also wrote 28 Days Later and wrote/directed Ex Machina, one of my personal favourite sci-fi films! Annihilation is very much in the same vein as Ex Machina, it is a thinking person's artsy sci-fi film (with horror elements). That genre does not appeal to everyone, but if you like sci-fi like Arrival, Blade Runner, Star Trek, 2001: A Space Odyssey, THX 1138 or, of course, Ex Machina, you will probably get a kick out of it! I actually don’t know how much detail I want to go into about this movie, I went in completely blind and was very pleasantly surprised! It only had a short theatrical run before being dumped on Netflix so I never saw any trailers or any promotional material. I had never even heard of it until recently, so I recommend that you just watch it without knowing anything about it. You’ll be glad you did! It’s a hidden gem! Also, it has an all-female main cast, if you care about that sort of thing."}, {"rating": "6", "text": "Better the second time around, but still not that good. It kind of changes the basis of what the novel is about, not minor changes but major. I’m on the fence on whether it’s good or bad seeing as I was not a huge fan of the novel to begin with."}, {"rating": "9", "text": "With all the depth and most delightful elements of a Michael Crichton film (Jurassic Park, Sphere) and the visuals of a James Cameron movie (think The Abyss) you'll leave the theater thinking about this one for a few days."}, {"rating": "9", "text": "When, possibly, a meteor falls on Earth and hit a lighthouse in an isolated location creating a bubble called \"The shimmer\" that anything that cross it, never comes back. The mysterious bubble keep expanding and taking more land with anyone apart of what is going on. During one expedition, one person returns for the firs time, Kane(Soldier), Husband of Lena (Biologist, ex military), he comes different and she wants to understand what happend inside the dome.This movie is by essence sci-fi but have a bunch of elements from horror and thriller that worked highly, using many open plans for you to get tense that something could come out from here or there technically this movie is phenomenal. I loved the cinematography that they presented, a bunch of moments they show the image obfuscated, with some blur, refracted.. Giving signs of what actually hapens in the shimmer, they show hands touching themselves on the other side of a glass of water, things that will echo later on. The scenario are just phenomenal, the way that they put the forest was simply amazing, how it was dominating the hole place and creating things, making something evolved.. this part really reminded me of the last of us, some scenes and places of the movie, the hole scenario, it gave me flashes from the game.I like how the movie could be a metaphor for somethings, like for us, that couldn't let the natives dress what they wanted and put on them what we dressed, can't make it to a new place and let it how it is, not just refering to people, but to nature itself, modifying stuff. To a cancer, where want to face it, other fight(showing that you end up becoming what you fight against) or neither of those, leading that the cancer are oursleves. This movie is much about self-destruction, like a cancer, when everybody is blaming themselves or did something that literally destroyed them, is getting themselves destructed.The track of the movie also are great, having somethings that complete the scene, sometimes with something supernatural, exemplifying in sound what is going on, sometimes a calm and peaceful that complete the beautiful environment, wich remembered me a lot of the last of us as well. Some moments of panic and scary being well represented by the song as well, helping to let you tense.All the acting worked here, Natalie Portman can express herself with eyes and mouth, passing an idea of doubt and at the same time without expression, having a pretty good chemistry with Oscar Isaac, that also have a good job with his character, passing the idea of hapiness and later frustration. Gina Rodriguez did a very good job on two different moments of her character. Tessa Thompson as always delivered a much different character as usual, doing a much different interpretation, she is one of my favorite actress right now, her character is the most sweet from all of them and she phrase with calm and wisdom, just how her character is needed. Tuva Novotny did a character that was afraid, but could stand firm. Jennifer Jason Leigh did a hell of a great job, doing expression less character, cold that you can literally feel in her way of talk, in her eyes and mouth that doesn't have anything to lost, are all the way in for whatever she is up to.The montage of the film, maybe could have be done a little better, some scenes are throw on us that just gonna make sense later on, wich is not bad, but how it is mounted i'm not so sure. The director choose to separate the acts for all of us, pointing the titles of each one.It's a very pessimistic movie, expressing by metaphors how we are, how we are destroying ourselves and other ones. That all of us in some moment of our lives we ruined life, it's part of human nature destroy to construct or just destroy around you. Philosophical and social criticism, how we rational and evolved can destroy ourselves if we know that it ain't gonna do any good it is a genetic failure in all of us. A movie that will make people discuss and talk about it, keeping people's heads for a long time, wich is great, causing discussions and differently interpretations. Discussing creation, evolution, science, religion and, for sure, humanity.The movie reminded me of a Fight Club quote: \"Maybe self-improvement isn't the answer, maybe self-destruction is the answer.\""}, {"rating": "6", "text": "If you ever wondered what it would look like if an advanced alien race decided to terraform our planet right out from under us, look no further. It's as bizarre, disgusting, and beautiful as anyone has any right to ask for. It will definitely stick in your mind far longer than most movies do."}, {"rating": "7", "text": "Annihilation is a solid film, it features some stunning high-points and drags during a few fallow periods all in all I wanted more from the movie but I enjoyed it. Annihilation will occupies space in you head for a while, in spite of its flaws."}, {"rating": "8", "text": "Genuinely intelligent and thoughtful science fiction film that confirms Alex Garland's subtlety as a writer/director, especially after his recent Ex Machina. Veers into Alien/Thing body horror with somewhat mixed results, but stays smart.  Like most of these films, there are a few characters that just seem compelled to make obviously dumb decisions.  Hope the studio commissions the rest of the trilogy's adaptation."}, {"rating": "4", "text": "This sci-fi film was a real \"yawner\". The acting was sub-par and the story just dragged on & on. If not for some neat special effects I would have voted in the red area. Watching the reaction of the exiting audience I was not alone in my disappointment"}, {"rating": "8", "text": "One of the rare movie that mix well horror and sci-fi together. The story is one of discovery, some fascinating. The actors and actress are pretty well balanced in their performance. No overacting here. The music helps a lot. It's eerie and mystical. Visually the FX is quite colourful, sometimes stunning or just well placed for a good effect. You get engage in Lena story, mainly because Portman is taking us slowly with her. There is a lot that is not explain in the movie and with it's peoples. That makes the film feels more real. I give it an 85%. Absolutely loved it."}, {"rating": "2", "text": "Slow and boring. Watching it was almost torturous. Can't believe this is getting good reviews. One of the worst films I've seen in some time.I think some critics are mistaking somber vagueness for profundity."}, {"rating": "8", "text": "Annihilation, directed by Alex Garland is the most intriguing sci-fi film I’ve experienced in a long time. It’s really obscure to describe, but its about an alien meteorite that crash lands in a park on earth and it proceeds to bizarrely affect the environment flora and fauna. Natalie Portman delivers a solid performance as well as Gina Rodirguez and Tessa Thompson. To be honest with ya’ll there were plenty of times that I was just looking over to my girl saying “what the hell is going on?” but don’t take it negatively, we were extremely invested. There’s plenty of ambiguity, it really made me think. It’s the kind of film you see and will likely speak for 30 minutes or more about it after watching it. I love that, especially in the sci-fi genre, a film that makes you think. Overall Annihilation is the best sci-fi film I’ve seen in a while, it made me think, beautiful cinematography, super trippy, it made me ask what the hell is going on, and it a visually engaging."}, {"rating": "5", "text": "I'm a film nerd but this is a poor man's Arrival. First two acts are solid but the third act ruins it, completely predictable and unoriginal reveal. No wonder why Paramount was scared about this..."}, {"rating": "2", "text": "Highly disappointed in this overrated film. It was confusing, boring at many times, very unsatisfying outcome in the end. Totally puzzled why the critics raved about this weird pretentious flick. Stupid plot and stupid movie."}, {"rating": "7", "text": "Natalie Portman takes her whack at a sci-fi story, playing a biologist who joins a mission to penetrate the \"shimmer\" (one of the dumbest visual effects in recent films). She and a crew of 4 other women set out to find what's causing this mysterious phenomenon, but they do so very slowly. There are some interesting visuals and one scary scene (the sloth-like monster), but most of its suspense is doled out with lots of anticipation and ominous music. Ultimately, there's a compelling creepiness that propels this puzzle forward, although at a glacial pace."}, {"rating": "7", "text": "Part Stalker, part Ghostbusters, part the Twilight Saga Soundtrack, part The Tree of Life, part Alien."}, {"rating": "8", "text": "For those that seen Alex Garland’s Ex-Machina, get familiar with Annihilation because it’s terrifyingly great. Since Annihilation is based on a book, the director makes us questioned about what is the biology of life behind it. Sure, this film did a good job with the female leads, but the whole thing shines on the philosophy of this movie. This film is familiar for those that have seen Denis Villeneuve’s Arrival or played Naughty Dog’s The Last of Us, but it takes in a more serious and terrifying approach that would take audiences in a adventure to unravel the mysteries of life. Moreover, this film has extremely well done cinematography, performances, sound mixing, and visual effects that made it great to watch. Most people may experience this film as a slow jumping-up-to-conclusions film, but it’s Alex Garland’s R-rated gory film that would make you experience the terror as you watch it for the first time."}, {"rating": "7", "text": "I don't usually read many reviews of so-called ''professional critics'' because several times they don't manage to be as objective as I would like and in many cases they practically tell you the whole movie, but incredibly I was saturated with Facebook and Twitter notes about opinions of this film and an interesting pattern was highlighted, and almost all mentioned the same: ''Annihilation, the film that was too smart for the audiences.''To mention the distribution method the film got it seems irrelevant by now, it's already on Netflix so there's nothing to do anymore. I admit the film would had been a box office failure to have achieved a release in theaters worldwide but that has nothing to do with the film being ''too smart'' for the regular public, but it's because the film is indeed far from any mainstream standard.I find ridiculous to label Annihilation as a film too smart for the masses, first because it's not and second because mentioning that kind of things is why these types of non-commercial films are completely ignored. By assuming that the product is smarter than the consumer this will inevitably catalog the product as snobbish and pretentious because by assuming the consumers didn't understand the film then you're automatically calling them stupid, even if it's not the case. That is why today ''professional critics'' are already considered tremendously irrelevant.But speaking of the film, I must say the plot is quite interesting but far from complex, in addition to the fact that the film spoils at the beginning what happened to the characters, it takes away all the mystery to the subject because you no longer feel any link with them, you're just waiting to see what will happen to them and therefore all the narrative and character development is practically null.Apparently all them have their secrets and dark sides but none of that is explored and therefore when they start to disappear from the screen and from the story you couldn't care less. But at least the most important mystery remains intact and it directs the film until its ending.Of the cast only Natalie Portman has a real acting weight, the rest of the cast is disposable, I'm sorry but it's true, even Oscar Issac who despite being the trigger of the journey Portman's character, has no real relevance except with the ending.I really liked the soundtrack, the cinematography, I listened to a lot of complaints about the CGI but I think that if you consider its budget it was quite decent, the production design is also of a very good level, it immerses you in the situation and becomes a real complement to the story.At the end of the day I think Annihilation is a good movie, it's interesting and entertaining, not so satisfying but rewarding, personally I prefer Garland's debut; Ex Machina but I would recommend the film to anyone without hesitation and I would definitely tell them that it's not too smart for them."}], "recommendations": ["arrival", "sunshine", "coherence", "interstellar", "the_midnight_sky", "captive_state", "chaos_walking", "anon", "donnie_darko", "lucy", "prometheus", "a_cure_for_wellness", "source_code", "mortal_engines", "the_girl_with_all_the_gifts", "what_happened_to_monday", "sicario_day_of_the_soldado", "the_green_knight", "under_the_skin", "predestination", "midnight_special", "color_out_of_space", "colossal", "children_of_men", "i_am_mother"]}