{"id": 3075, "title": "Anon", "starring": ["Clive Owen", "Amanda Seyfried"], "runtime": 100, "genre": ["Science Fiction"], "description": "Set in a near-future world where there is no privacy, ignorance or anonymity, our private memories are recorded and crime almost ceases to exist. In trying to solve a series of unsolved murders, Sal Frieland stumbles onto a young woman who appears to have subverted the system and disappeared. She has no identity, no history and no record. Sal realizes it may not be the end of crime but the beginning. Known only as 'The Girl', Sal must find her before he becomes the next victim.", "releaseYear": "2018", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/xhBTO9n3fxy3HJt7WlR9h9vvVmk.jpg", "categories": {"plot": 6.0, "acting": 4.7, "ending": 6.6, "soundtrack": 6.666666666666667, "cinematography": 5.0, "familyFriendly": 3.0, "funny": 5.0, "action": 7.5}, "reviews": [{"rating": "6", "text": "So do you remember the Clive Owen film, Shoot 'Em Up? It was a film with corny dialogue and pretty cool action. Anon is exactly like that film, except replace all the cool action with people sitting & staring (into cyberspace).I also look forward to an extensive breakdown of the plot holes. Worth a watch for the cinematography, but hedge your expectations."}, {"rating": "3", "text": "A rejected 'Black Mirror' episode that was so bad even 'Black Mirror' didn't want it. Oh, in the UK, this movie was both in cinemas and online streaming services. Not joking.What happened to Andrew Niccol?"}, {"rating": "6", "text": "The script had a lot of potential until the last twenty minutes. Feels like they ran out of money/time to finish it off. Lack of proper character development for the antagonist also didn't do the experience much good.Eh, I liked it but can't say it was a good movie in the end. Felt more like an interesting DEMO for future VR possibilities."}, {"rating": "2", "text": "The synopsis seemed promising, and was all the prompted me to give this movie a try. I thought back to the promising synopsis repeatedly, slowly becoming aware of the effort I was making to power through what quickly mirrored both the style and depth of an unskippable cutscene.Vapid, boring, buried in stylistic cruft. An interesting premise, and little beyond that."}, {"rating": "2", "text": "Really wanted to like this, but it focuses so much on style that the story really suffers. It creates a noir world filled with bleak stony angles, and dreary characters that are a chore to watch. It doesn't let some very good actors emote until it's too late (the \"Phantom Menace sin\"). Influence-wise Alphaville and the Matrix are heavily present, but the sterile world ends up feeling boring instead of compelling. IMO it would have been better as an hour-long episode within an anthology."}, {"rating": "10", "text": "One of the best scifi movies this year, it's more a cerebral scifi thriller, but it asks a lot of questions about privacy and our current \"extremely online\" culture that not a lot are asking. What would it be like to have every waking moment recorded and controlled? You can't even believe that which you see, so how do you know what it true and isn't true? The movie doesn't answer that, but at least it's asking those questions. Smartly written, smartly shot, very well acted, and the set is amazing.It's more scifi art than anything else, and I think there really needs to be fewer \"block buster\" scifi movies, and more artistic pieces that ask tough questions."}, {"rating": "4", "text": "The theme while good is starting to become a little repetitive. I mean technology is evil and privacy is what matters is something relevant but not new at all. And is worst when is inside such bad stories like this one.The mistery is dull, the characters have zero chemistry and the film is painfully slow and to make matters worst, the resolution was really poor. Completely forgettable. Terrible coming from Andrew Niccol."}, {"rating": "2", "text": "Do yourself a favour and don't watch this movie.The movie is dull, wooden, colourless and very slow.  This movie a surprisingly poor given the calibre of actors.  This is less a suspenseful thriller, more like boredom incarnate.  The only crime in this crime drama is taking an unoriginal idea and then torturing it by stretching it out until it dies. Instead of a roller coaster, the poor viewer is taken on shopping mall kid's ride that seems to take hours to not go anywhere, yet is visually jarring enough to make you nauseous.  Given the movie is so dull, it does the only \"jump-the-shark\" thing it can and shows lots of skin, even though there is no apparent benefit to the storyline.The music score was repetitive, dull, and added even more boredom.  The visuals give you a headache.  They lack any realistic \"user experience\".  By realistic, I mean in most other sci-fi the technology interface is believable.  Watch Minority report, Black Mirror or other future-based movies and think \"this is so realistic I can see it happening\".  Watch Anon and you think this isn't practical, isn't intuitive and only adds massive holes into the already dull plot."}, {"rating": "9", "text": "This movie really was a black mirror episode and showed a potential future, but it is so much more and so much more in depth that a black mirror episode. So let's not compare it to that, instead just appreciate it for what it is.The acting was impeccable, some would say frame perfect and solid. Some times maybe it was to intense but, the whole movie was built on tension, and the final reveal. Which was executed perfectly right up until the ending which was maybe a little to rash and fast. The third chapter's pacing and events did not match the rest of the movie's. It's like it was out of sync. But the twist was satisfying, although predictable. The directing was amazing with the perfectly executed shots, and each one of them emphasizing the view point that the viewer was experiencing. This created more tension and immersion at the same time. The music of the movie was original and very fitting the environment, which made it more of an already entertaining movie. The value of this movie is wildly underappreciated. Overall this is an amazing movie with a very complex message and a deep view of the possible future and it's complicated problems."}, {"rating": "10", "text": "Any movie that is futuristic and has great CGI will immediately grab my attention. If the storyline does not make sense or is not rivieting, I will lose interest. This movie delivered! The background was a very colorless and dystopian so i couldn't stop watching it, but the story was well put together and kept me captivated from beginning to end."}, {"rating": "8", "text": "I liked this movie, interesting vision of a information system. The characters are cool for me."}, {"rating": "10", "text": "The film is dark, it shows a possible future. And I do not like them. The film does not only scratch the surface. He goes deeper below the surface than you might think at first glance. What should our lives look like, where everything is presented to us on the silver platter at any time? There are practically no secrets left. Where are our challenges? There is nothing left to discover. You live somehow into the day, where is the tension still in life. You can already see it today with the permanent mobile phone and internet use. You split off, you live only for yourself. But everybody wants to impress somehow constantly about the common social media. But friendships are only made without obligation as long as it benefits you. This film shows this in a bleak way, if you allow yourself to look deeper."}, {"rating": "3", "text": "(Mauro Lanri)Once upon a time there was anonymity, or at least so they made us believe. With the IoT the lie collapsed and we discovered ourselves living in Bentham's Panopticon. Foucault was already interested in such a death of privacy in his \"Discipline and Punish\" (1975) and since then there have been countless films and TV series (\"Black Mirror\") on this subject. \"Anon\" is the last in order of time, and with it Niccol adds only logical gaps and a narcoleptic thriller."}, {"rating": "10", "text": "Very deep movie not everyone can grasp but if you are a technical person tgen this movie is really riveting"}, {"rating": "8", "text": "Anon is a another take on how social media and the internet will potentially shape our lives of the future.The film has a sophisticated style that doesn't fit any go-to genre to punch a large audience segment's buttons.  It does provide an interesting point of view of a relevant topic."}, {"rating": "7", "text": "This definitely looks to be inspired by a \"Black Mirror\" episode. It's got a good premise but fails a bit in its execution; that's why you're seeing such a split of opinions. Don't get caught up in analyzing details or overthinking it, just focus on the underlying message/theme and you'll enjoy it a bit more. It's a solid \"6\" but I'm giving it a \"7\" because the last line is a cutting retort to the pompous government attitude: \"You shouldn't mind [4th Amendment] privacy violations if you have nothing to hide.\""}, {"rating": "7", "text": "I liked the idea behind this movie and I liked the visuals. Yeah, maybe the plot was a bit too tangled up, but overall I thought it was an interesting movie with a bit different idea behind it than usual."}, {"rating": "8", "text": "I'm giving this movie a 8 for it's creativity and strong desire to be good. The intro makes the film seem very interesting and intrigues you to keep going. Then one of the many issues slowly comes into play and sadly dominates through the rest of the entire film. That issue is the issue of the film seeming somewhat empty.  If this were a Black Mirror episode or a movie that plays upon the what ifs more than trying to be an actual full fledged movie with a plot, character development, twist, relationship creation and a conclusion. Then I would be much more on board with what they're trying to do here.  So in the end, is Anon a bad movie? No, I don't think it is. However, it has a lot of room for improvement or needs to shift it's focus on being a darker version of what the future can become."}, {"rating": "8", "text": "\"Anon\" pour anonymat... ce qui deviendra sans doute un luxe dans les décennies à venir, tant le troupeau formaté par le vivre_ensemble déballe déjà toute sa vie sur les réseaux sociaux, tant tout devient hyper-connecté et tant les petites boîtes s'invitent dans les logements, des **** mouchards parfaits pour la prochaine étape : le cerveau connecté 24/7 sur la toile en \"réalité augmentée\"...Alors, on est en plein \"cyberpunk\" comme le montre si bien le film et qui dit cyberpunk dit piratage... piratage de vos données, de vos souvenirs, de vos perceptions, de la vie elle-même ! Andrew Niccol nous montre donc le paradis perdu, celui de l'anonymat, considéré comme un crime parce qu'on ne veut rien montrer et l'établissement de la surveillance de Big Brother version 3.0 (si vous ne voulez rien montrer, c'est que vous avez quelque chose (de répréhensible) à cacher. Forcément.Clive n'a plus rien à prouver et se révèle comme à son habitude tout-à-fait excellent ; Amanda a encore bien des choses à prouver (comme le talent par exemple) et se montre volontiers pour mieux attirer l'attention je suppose...  je suis comme tout le monde, j'aime me rincer l'oeil mais autant dire cependant qu'elle ne m'a pas convaincu ; elle fait des progrès en tout cas, c'est indéniable.Passionnant comme un polar (de science-fiction mais sans les néons), le film pâtit néanmoins d'une fin bâclée, sortant tout-à-coup un lapin foireux de son chapeau magique : ça ne tient pas debout et ça déçoit énormément, entre autres incohérences. Malgré cet écueil (de taille), on apprécie un film élégant, bien léché et qui fait réfléchir."}, {"rating": "4", "text": "Slow. Weak. Boring. As much as I tried, I couldn't get into this movie. I don't know how it didn't get more negative reviews."}, {"rating": "3", "text": "It's pretty much a Black Mirror episode with the kind of technology and characters you see in that show, but instead of deep, thought-provoking suspense, you get dumbed down Hollywood cliches (the lonely, hard-bitten Detective, Femme Fatale, no-nonsense Police Captain, etc, etc) where it gets boring and predictable about midway in. Clive Owen, Amanda Seyfried, and Colm Feore are totally wasted. Well, I wouldn't say totally wasted in Amanda's case. She does have a nude and sex scene. QED: just watch the Black Mirror episodes \"The Entire History of You\" and \"White Christmas\" instead for much better acting and stories about the implications of this kind of technology."}, {"rating": "3", "text": "Escrito e dirigido por Andrew Niccol (escritor de “Gatata – Experiência Genética”  e “O Show de Truman”), Anon é um filme belamente fotografado, com cenas externas em tons frios de azul e cinza. Porém, a beleza do filme para na fotografia. Apesar da premissa interessante e envolvente, nada que o filme se propõe a fazer, funciona. As críticas sociais estão mais para eufemismos.Eu gostaria de dizer que o filme manteve a qualidade após o seu início; gostaria de dizer que ele te faz levantar discussões sobre privacidade, memória, percepção e falsa sensação de segurança, mas nada disso acontece. Toda a obscuridade de Sal Friedman é explorada apenas por flashbacks; não há mais nenhum elemento que dê força para o dor do personagem. O desfecho da trama é tão ridículo que chega a dar pena.Visualmente impressionante, mas emocionalmente fraco, Anon é simplesmente vazio demais para nos importarmos."}, {"rating": "9", "text": "This movie just absorbs the viewers in the plot. Very unconventional and out of the box script. Final third of the story can be much better. They kind of rushed the things in the end. Loved the soundtrack of Anon."}, {"rating": "7", "text": "Good movie with very cool visuals and tech. There are some flaws in the story and execution but still an enjoyable movie. Full disclosure, I’m an Andrew Niccol fan."}], "recommendations": ["annihilation", "sicario_day_of_the_soldado", "coherence", "the_green_knight", "captive_state", "arrival", "enemy", "the_midnight_sky", "source_code", "what_happened_to_monday", "lucy", "nerve", "sunshine", "eo", "interstellar", "chaos_walking", "blackhat", "the_darkest_minds", "i_am_mother", "dragged_across_concrete", "brimstone", "tenet", "bad_times_at_the_el_royale", "signs", "donnie_darko"]}