{
  "id": 4268,
  "title": "Another Gay Movie",
  "starring": [
    "Michael Carbonaro",
    "Jonah Blechman"
  ],
  "runtime": 92,
  "genre": [
    "Comedy",
    "Romance"
  ],
  "description": "In the dirtiest, funniest, most scandalous gay-teen-sex-comedy-parody ever, four young gay friends make a pact to lose their virginity by the end of the summer. The boys soon face giant sex toys, naked celebrities, masochistic teachers and an uncontrollable romance with a quiche.",
  "releaseYear": "2006",
  "mpaaRating": "NR",
  "imageUrl": "https://image.tmdb.org/t/p/w500/j8U059o7q2PG5LDxO2jyTTUBxYR.jpg",
  "categories": {
    "plot": 7.333333333333333,
    "acting": 2.5,
    "ending": 5.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 4.0,
    "funny": 5.833333333333333,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "2",
      "text": "Another bad gay movie. Why is it so rare to find a good gay movie? This was just plain trashy, gross and unfunny. One critic was right the difference between the gross jokes in this and the gross jokes in John Waters's films is the anarchy that Waters's cast provides. This was just a waste of time. The best scene was the deleted Mink Stole scene. She's brilliant! I would never watch this again, nor recommend it to anyone. Pity too. I really love the director's first film, Edge of Seventeen."
    },
    {
      "rating": "5",
      "text": "Whatev. Almost all gay movies take advantage of cliches and broad generalizations. I haven't seen a memorably good one yet. Someday... hopefully."
    },
    {
      "rating": "10",
      "text": "I'm straight and I nearly pissed myself during this film.. I recommend this film to anyone who has a sense of humour (obviously many of the reviewers here don't know humour)."
    },
    {
      "rating": "1",
      "text": "Was looking forward to an unapologetic gay-stoopid com like what the straight mainstream have had for years. But an incomprehensibly poor script carried by phoned-in performances make this the equeervalent of American Pie 5: The Naked Mile, not American Pie 1."
    },
    {
      "rating": "10",
      "text": "I didn't need to see all the movies this one makes a parody of to enjoy the fact that it encompasses not only stereotypes but truths of the gay life in America; teen or otherwise. It's boldness to go where most other gay movies won"
    },
    {
      "rating": "10",
      "text": "Best movie I've ever seen. Laughed all the time. Loved it!"
    },
    {
      "rating": "0",
      "text": "This is easily the most revolting movie I've ever seen. And it's not because of the gross jokes, but the fact the director offers nothing but an assortment of random scenes of nudity as a substitute for -plot-. And worst he presents them yet as a badge of \"freedom\" for the gay community. That's appealing to the basest of the viewer's instincts. I wouldn't even rate this as porn, cause at least with porn you know exactely what you're watching...This movie is just a disgrace."
    },
    {
      "rating": "1",
      "text": "This is one of the worst gay movies ever made. Seriously. For the first time in my life, I was ashamed to be gay. Yes...the idea of this movie is a good one...but the execution is horrible. The movie is filled with bad acting, bad F-List \"celebrity\" cameos, and impressively disappointing cinematography/production design. This movie doesn't fall into the so bad it's good category. It's just plain bad."
    },
    {
      "rating": "6",
      "text": "Jon M., I think you missed the point of this film. It's supposed to be a spoofy send-up of cliches and stereotypes prevalent in gay coming-of-age flicks. Besides, everyone knows the worst gay film ever made is Eating Out."
    },
    {
      "rating": "7",
      "text": "I wasn't sure what to think of it while I watched it, and I'm not sure if I still know. What I do know is that I laughed hard, and, once you come to the understanding that it's *supposed to be* a caricature and spoof, most of the things that initially disturbed me didn't anymore. If you're an older and/or conservative person who thinks naked bodies and sex toys are evil, expect to be shocked and disgusted. If you're younger and/or sexually liberal, chances are you'll still be shocked at what you see, but will appreciate the humor, and laugh when you're not cringing. My friend who saw it with me said later that night \"I've known guys just like all four of the main characters\". Stereotypical? perhaps - but where do stereotypes come but from real life? Overall I liked it. It gets the \"buy the DVD\" vote."
    },
    {
      "rating": "10",
      "text": "Easily should acheive cult status, pretty brilliant parody of teen sex comedies more directley American Pie. Obviously will resonate more with gay audiences who seem finally to be getting movies that aren't about death, sadness etc etc. If you like raunch like John Waters this movie is made for you or any other colorful, fun, or raunchy gay comedy, ala Girls will Be Girls, Adam and Steve, But i'm a cheerleader, Mambo Italiano, Trick, or anything by John Waters, They keep getting better and Another Gay movie is not only hilarious and raunchy fun but it raises the bar and gives Gay audience another modern classic."
    },
    {
      "rating": "10",
      "text": "Excellent film, if you want to laugh your head off this is the film to watch."
    },
    {
      "rating": "10",
      "text": "I gave this movie to my husband for christmas...and we sat down and watched it together. We both loved it....Finally a gay movie that is funny and not scared to show full frontal male nudity. The celebrity cameos were a nice touch...bravo Richard Hatch....and as for the plot line...it is a parody of teen movies...which if you have not noticed....have been very stereotyped and filled with jack-ass, frat-boy type humor. So, knowing this is a gay movie...guess how jack-assish it can be and that is what you'll get."
    },
    {
      "rating": "1",
      "text": "The only reason why this gets as high of a grade as \"1\" is because it actually made me laugh at how bad it was. One of those unfortunate end-results of not being able to take this horrible film any longer. Truly, utterly awful. I should have known what to expect (Scary Movie/Epic Movie/Disaster Movie type of glory), but I had hoped that it'd be a bit better. However, this was possibly worse because it perpetuates all these horrible stereotypes about gay people. While I hate when people discuss that and over-analyse things, this was just abhorrent. It's basically all about sex. True, most teenagers think about sex a lot, but NOT THAT MUCH. Come on... And its obvious sense of \"humour\" was just despicable. Gross, gross, gross. And I cannot believe there is a sequel. I will watch it, just so I can watch something worse than this (if that's imaginable)."
    },
    {
      "rating": "4",
      "text": "Ok... Leave your joke in the comment box, I'm sure it's hilarious. As for this movie, it WAS hilarious... at first... but it quickly got old. Its about four gay friends, the summer before college, on a mission to get laid. Along the way they meet their fair share of weird characters and it's pretty much the same as 1000 other coming of age teen comedies, except for the gay part... This movie has some really funny parts, especially the interaction with the lesbians, THAT was classic! Unfortunately, they continue focusing on the one subject, and the jokes just stop being funny after about twenty minutes or so. It's a cool idea, it's a gutsy film to make, and I give praise to everyone brave enough to be a part of it. It probably would have been good if it wasn't so narrow-minded."
    },
    {
      "rating": "2",
      "text": "Another Gay Movie is the gay version of American Pie--and just like American Pie, is far from a hit and should be avoided at all costs. You'll find yourself laughing... at the film."
    },
    {
      "rating": "6",
      "text": "A good laugh but it misses the mark compared to similar films like it, watch something like American Pie instead because its funnier."
    },
    {
      "rating": "7",
      "text": "This movie is a parody of three things: teen movies, gay stereotypes, and how life actually is for gay people. How good the movie is to you will likely depend on how many layers you're able to get/appreciate. This certainly isn't a masterpiece. No, not even close. But there is a lot of smart commentary hidden under all that camp."
    },
    {
      "rating": "6",
      "text": "\"Another Gay Movie\" doesn't give a **** about what you think of it. And I like it that way."
    },
    {
      "rating": "8",
      "text": "Cute movie although there are obvious problems with the story etc.  I still enjoyed it."
    }
  ],
  "recommendations": [
    "white_chicks",
    "the_ugly_truth",
    "miss_march",
    "not_another_teen_movie",
    "the_interview",
    "american_pie",
    "a_haunted_house",
    "borat_cultural_learnings_of_america_for_make_benefit_glorious_nation_of_kazakhstan",
    "fifty_shades_of_black",
    "superbad",
    "knocked_up",
    "the_change_up",
    "meet_the_spartans",
    "the_40_year_old_virgin",
    "vampires_suck",
    "deuce_bigalow_european_gigolo",
    "grown_ups",
    "movie_43",
    "eurotrip",
    "hall_pass",
    "nacho_libre",
    "sausage_party",
    "the_hangover",
    "superhero_movie",
    "the_dictator"
  ]
}