{
  "id": 818,
  "title": "Ant-Man and the Wasp: Quantumania",
  "starring": [
    "Paul Rudd",
    "Evangeline Lilly"
  ],
  "runtime": 125,
  "genre": [
    "Adventure",
    "Science Fiction",
    "Comedy"
  ],
  "description": "Super-Hero partners Scott Lang and Hope van Dyne, along with with Hope's parents Janet van Dyne and Hank Pym, and Scott's daughter Cassie Lang, find themselves exploring the Quantum Realm, interacting with strange new creatures and embarking on an adventure that will push them beyond the limits of what they thought possible.",
  "releaseYear": "2023",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/ngl2FKBlU4fhbdsrtdom9LVLBXw.jpg",
  "categories": {
    "plot": 6.660377358490566,
    "acting": 6.729166666666667,
    "ending": 6.5,
    "soundtrack": 8.0,
    "cinematography": 5.0,
    "familyFriendly": 6.0,
    "funny": 6.717948717948718,
    "action": 7.607142857142857
  },
  "reviews": [
    {
      "rating": "7",
      "text": "A rare sequel that manages to heavily improve on its predecessor. A must see"
    },
    {
      "rating": "7",
      "text": "The Ant-Man franchise is one that is in a smaller realm than the rest of the MCU, no pun intended. There is a lot going on here but none of it really compelling or with any real consequences. The best part of the film? The mid-credit scene. Overall fun but not really great compared to the other Marvel films released in 2018."
    },
    {
      "rating": "7",
      "text": "Having been placed under house arrest due to his involvement with the Avengers, Scott Lang (Ant Man) receives a message from the Quantum Realm that he believes to be from the wife of Hank Pym. Despite their now strained relationship Lang contacts Pym and, along with Pym’s daughter Hope, they set out to investigate who and where the message is coming from.    Ant Man and the Wasp without doubt suffered for being released between Infinity War and Endgame, and it hardly reinvents the Marvel formula, but with its creative action sequences, sense of humour and stellar cast it's a solid movie in it’s own right and a worthy addition to the MCU."
    },
    {
      "rating": "7",
      "text": "Another great ant man movie, but I have to say for me this isn't quite up to 2015's Ant Man movie. The wasp is a welcome addition but I found the villain a bit lame. The scaling CGI, which was a breath of fresh air in the first movie, feels a bit overdone here. A great, fun, film not as a sequel it wasn't quite as good as I expected. The post-credits ending led us nicely onto the events in infinity war."
    },
    {
      "rating": "9",
      "text": "Great improvement over the first movie. Great follow up to the first story, introduces several new characters and showcases several old characters in a great way. Great humor, action and suspense."
    },
    {
      "rating": "7",
      "text": "It's fine. That's really all I can say about it, it was an entertaining-enough movie. It was fun enough to keep me watching until the end, but that's really all there is to say about this movie."
    },
    {
      "rating": "7",
      "text": "This movie needed more sets. It felt like 3/4 of the movie took place in Ant Man's home or the Wasp and her father's laboratory. There was also a 'quantum realm' but it was shown for only a few minutes. I like intimate personal stories, especially when super heroes are involved, because too much super hero-ing without knowing the characters gets very dull very fast. However, was there a reason the movie could not have included a broader range of environments? And the two main actors all need a little more spark, an espresso at least, before filming. The movie was strangely low energy, despite all the shrinking and growing and fighting. I can't imagine such a problem if the movie starred, say, Robert Downy Junior and Margot Robbie. Those two have so much personality. But here something - something besides the relatively few sets - was missing. It wasn't the plot, the plot with a full range of sets of bad guys of varying degrees, was well done. But some element of personality and/or energy was lacking. All that said, Michael Douglas and Michelle Pfeiffer did their jobs well. Both leads, though, were missing something I can't define. Maybe chemistry between them was lacking. That could be it. They're supposed to be in love but, I didn't feel it."
    },
    {
      "rating": "8",
      "text": "One of the better MCU movies. Better than Black Panther, but not as good as either Infinity War or Thor: Ragnarok. Let's be real here. The only reason why you are watching this is for the post credit scenes."
    },
    {
      "rating": "7",
      "text": "Ant-Man and the Wasp is funnier than the first film and moves the plot forward for all characters wonderfully; however, there is not threat in the film and everything that happens is painfully predictable. When the end-credit scene is more impactful than the entire film preceding it, that explains everything."
    },
    {
      "rating": "7",
      "text": "It is a good movie, and it is a fine sequel. But i doesn't live up to the first, especially in the villain department. The jokes are good though, and it makes for a good movie to watch when you just want a laugh and entertainment.It earns a 7/10."
    },
    {
      "rating": "0",
      "text": "Quite possibly the worst marvel movie in a long time if not ever. It's confusing how it even was made given the sheer laziness of it all. The performances all around are mediocre, the stakes low and the movie a needless cash grab before the climax of Infinity War."
    },
    {
      "rating": "7",
      "text": "The movie comes off a little half-baked, but has charm for days. And some genuinely tears-in-eyes- hilarious moments (one in particular involving a school hallway). It's not as good as the 1st, but it's enough to say it's definitely a fun time at the movies and it still an interesting Honey I Shrunk the Kids for adults/teens."
    },
    {
      "rating": "4",
      "text": "I have not watched the first Ant Man movie. This is a Marvel production. Can't go wrong with, right? I was so wrong on that. I went to watch this, because of the generally favourable reviews. Boy was I in for a great disappointment. This doesn't feel like a good Marvel film. It's all mindless action from beginning to the end. Chasing after the miniature of the lab building like a game of soccer. It's so bad that it feels like a 90s grade B movie, eg a little like 'Spy Kids', all actions and no depth.I do like some of the lines which are genuinely funny and natural. A few lines are rather cheesy. Character development is close to none, meaning you get stereotyped characters which feels like they are only there to fill the roles. It's a very bad thing if you watch a movie and don't feel inclined to care about its characters, unlike the Avengers series. The villains are especially boring and seriously under developed.I wished I have never gone to watch this."
    },
    {
      "rating": "5",
      "text": "This is by far one of the worst marvel movie, the structure is bad, the actors did worse than the first movie. There is only one good action scene. And the wasp pretty much stole the show. Ant-man didn't really do anything in the film, and the wasp do everything. The villain looks like a character from Destiny and she can literally just talk to Hank and Hope to figure out a way with her issues instead of fighting them. And about two third of the movie's joke didn't land. The mob characters in the movie and laughable and get their ass whooped by the wasp and ghost, I don't know why they are even in the movie. Overall this is very disappointing to me."
    },
    {
      "rating": "8",
      "text": "It isn't quite as good as the first one, but it is a fast paced movie with highly inventive action sequences and very likable characters!"
    },
    {
      "rating": "6",
      "text": "Pros:Enjoyable,fun,some scenes made me laugh my ass off,faster paced than the first,Wasp stole the entire film,cool fight scenes,the cast was brilliant,the cgi looked fantastic,the motion capture was mind boggling as hell,it was crazy.Cons:A lot,no spoiler but really nothing happened in the film(except the first end credits scene),the plot was so monotonous and sometimes messy that the film had no impact,no tension at all.There was really no real antagonist in the film.Ghost was very intriguing and sympathetic but to me i wouldn't consider her as a villain, her's character development was really poor and rushed,there was one scene that her back story was just retold and it should have been so much better instead of this,it was so lazy,c'mon.Quantum Realm was completely wasted in this film,the first Antman was really good at showing us a glim of Quantum Realm,but in the film,we still knew very little about it,which was so unfortunate cuz it had so much potential.The last 30 minutes completely dropped the balls to me,and many things don't make sense(For example:No major spoil:Why does Michelle Pfeiffer's  still have all of those make ups perfectly after all those years.\"),they didn't explain this,and we have to accept.Overall:To me Antman and The Waspuel was no where near as good as the first,the first one had a more coherent story,a much better plot,this one was enjoyable and fun but failed in story perspective"
    },
    {
      "rating": "7",
      "text": "Ant-Man and the Wasp is a great stand along movie. While it doesn't connect much to the MCU as a whole, it is a fun time and worth a watch. After Infinity War we needed a light hearted and fun film which is exactly what this is. The daughter, played by Abby Ryder, is great and steals every scene she is in. The villains are are ok and one of them is basically useless and could have been taken out of the film entirely. The action is well done and the choreography is spot on. There is a lot to like about this film and the ending hints at what is to come, which is really exciting to think about. This film shows that Marvel really cannot make a bad film and continues to succeed with each release. Now the long wait begins until Captain Marvel in March 2019!"
    },
    {
      "rating": "10",
      "text": "Even better than Ant-Man. The mix of villains made for a comedic climax...."
    },
    {
      "rating": "4",
      "text": "I’ve seen a lot of comic-book franchise films and liked them (years ago, Batman, and more recently, Doctor Strange) so I certainly can enjoy this kind of film, but sadly this one seemed to me very childish and dumb. No style or panache at all, just a lot of jumping around and shrinking and expanding. I was very disappointed. I also read it was funny, but that meant mostly sight gags and snarky lines and not much wit, if any. I would say this was a movie mainly for small children, but then I’ve seen a lot of movies for that audience that I’ve really enjoyed."
    },
    {
      "rating": "5",
      "text": "Sigh another boring paint-by-number Marvel films that sorely lacks any reasons to exist aside from a quick cash grab of its devotees. Its worse than the original Ant-man which at least had a coherent story and was made with enough care given its development troubles with Edgar Wright. Peyton Reed shows his limitations in this film where the plot doesn't really matter, the characters dont really have any arcs (or if there are any, its literally the same as the first film). There nothing really to say except its a paint by number Marvel formulaic film meaning: jokes every 2 minutes, convoluted plot, borderline terrible generic CGI, characters that are charming but lack any emotional heft, dumb villains and character you will quickly forget and a wooden plot you can probably write better in an hour. Again, there some good action, some good lines and yeah the same stuff. AMATW doesn't add anything to the ongoing Marvel storyline, in fact you just need to see the end-credit scene for any sort of narrative weight to matter. I wish we could go back to the OG marvel films like Iron Man, Captain America:First Avenger or even Civil War where the films had a good narrative, character interactions and well-made scenes. It seems a long time ago now that those films actually felt like films. Now they all feel like **** episodes of a generic TV show. If Marvel continues this trend, it will be the law of diminishing returns."
    },
    {
      "rating": "5",
      "text": "Aside from its corny love scenes and cringy moments, the sequel to Ant-Man manages to somewhat entertain you. The CGI was on point, and the editing was good, but the acting was just mediocre. Usually, the sequel is worse than the original, that unfortunately proved true with Ant-Man."
    },
    {
      "rating": "7",
      "text": "The cutest Marvel movie. Very low-stakes. What I liked about the first Ant-Man is that it wasn't so much a superhero flick as it was a heist film with superpowers. Once again, Lang and crew aren't out to save the world or stop a supervillain. They're just trying to do some science stuff and people keep getting in their way. This more self-centered approach taken by the protagonists allows them to stand out a bit from their numerous costumed peers. They never stray too far from the established MCU formula though.The action makes great use of the characters' ability to manipulate size. Although outside of a few exceptions most of the best set-pieces were spoiled in the trailer. That car chase is actually the biggest sequence in the movie. The humor is very safe and like much of the MCU's third phase it's one of the defining factors of the experience. I laughed a lot, but most of the early material falls flat because Rudd seems to be phoning it in. Something he does on and off. Michael Douglas is also guilty of this.The plot deals a lot with the fallout of Civil War. The characters were really affected by Scott's involvement which serves as a driving factor for him to fix everything. The constant references to that earlier film makes sense given where this sequel falls in the MCU's overall timeline, but it's also kind of detrimental as it makes the movie feel more dated than it actually is. Infinity War just happened and everyone is still caught up in that. We've moved on from The Avengers one-time squabble amongst themselves.At the same time I kind of like this smaller-scaled approach that feels more detached from the rest of the heroes. It allows us to have sweet moments of father-daughter bonding between Lang and his little girl while he struggles with his non-heroic pals at keeping a business going. Some down-to-earth, real life stuff that distinguishes Ant-Man as more of your average guy. His fellow ex-cons might not actually contribute anything to the plot, but it's nice to see to some regular dudes amongst all of the extraordinary happenings. Especially when they're so darn funny. Randall Park is a gift in this.One thing Marvel has really been listening to and trying to work on are the villains. There's still a ways yet to go, but things have been on the rise in this department ever since Peter Parker got his long-awaited MCU standalone. \"Ghost\" is another example of this steady improvement. Mostly because she's not actually a bad person. Her motives are understandable and even sympathetic. They just so happen to put her at odds with our heroes. I would have loved to have learned more about her background in S.H.I.E.L.D. and want to see her character come back as an ally to further enrich the cast. Same for Fishburne.Definitely one of the safer Marvel movies, but after Infinity War it's nice to see something solely concerned with doing it's own thing. This is actually one of the more eccentric sides of the MCU. Giant ants run around and people explore another dimension they call the \"Quantam Realm.\" A place I really want them to reveal more information about as it's even more interesting than the depths of space we've seen a bunch of by now alongside the Guardians and Thor. It's almost pure silliness across the board and that's fun, but sometimes it can be a little too goofy for it's own good. The inconsequential nature of the movie is actually a positive factor that increased my overall enjoyment.7.6/10"
    },
    {
      "rating": "6",
      "text": "To start - i generally enjoy all of the MArvel films.  However, I found AMATW to be a pale retread of the first film.  It felt underwritten, incredibly inconsequential, and the stakes just didn't seem very high for anyone.  The Ghost character and storyline is completely unecessary and the forced conflict between Scott and the gang at the beginning really doesn't make sense.  Wasp is underwritten and dull considering Lillys talents.  It was ok, I would still have purchased a ticket - but it did not have the vibrancy and drive of the first film.   Luckily the scenes with Rudd and his family and Luis continue to connect.  It doesnt have the humour of Ragnarok, the character of Guardians or the heart of Cap Amer - its just sort of the bland, slightly funny middle.  Seems more like missed opportunity."
    },
    {
      "rating": "6",
      "text": "Once again one of the less strong characters of the MCU but famous enough to have his own franchise must be the follow-up of an Avengers film but now Marvel finally embraced the humor completely and accepts that Paul Rudd is better at that, at being a comedian. It's not bad but the film doesn't offer any surprise.I think it's the first sequel of the MCU since Iron Man 2 that doesn't feel different from its predecessor.If you're already inside the world of the MCU obviously you will continue there, otherwise I don't know how a casual viewer can enjoy something that it will not understand at all.The movie fulfills with the entertainment and the quality of Marvel is still there, but it's only that. There is nothing more worth mentioning, except the mid-credits scene that connects directly with the events of Avengers: Infinity War."
    },
    {
      "rating": "10",
      "text": "The trouble with sequels is, they have a tough time living up to the standards set by their predecessors. Very few sequels manage to top the expectations of the audience, and Ant-Man and the Wasp definitely isn't one of them."
    },
    {
      "rating": "10",
      "text": "This movie is a big improve from the first one, it has excellent characters that shine on their own. This is a lighearted movie to enjoy with family, not pretentious, being just what it needs to be. Funny, with a good plot and a very exciting 3rd act. It has just the necessary connection with the Marvel Cinematic Universe. It doesn't dissapoint. Totally recommended."
    },
    {
      "rating": "7",
      "text": "Along with Michael Douglas, they set out to right some wrongs in the quantum world. Some of the features of the original still hold true for this sequel. To quote my previous review, \"…has a lighter touch and goes for a more human connection. That means some enjoyable laffs and more chat than is needed for action films. When there is action, the miniature effects are fun and the sequences clip along at a snappy pace. Without Rudd’s charm the movie would have “little” appeal.\" These are not the typical superhero saving-the-world exploits, but personal quests with more interactions and more humor. Still, it's entertaining and fun. NOTE: There are 2 post-movie teasers: 1 after the end title credits (which requires a knowledge of \"Avengers Infinity War\") and the other at the very end (which is just silly)."
    },
    {
      "rating": "5",
      "text": "Easily the worst marvel movie since Thor: Dark World. Ghost could have been a really cool bad guy (or girl in this case), but he character development was awful and she never gave off the bad guy vibe that I was expecting the entire movie. Also Ant-Man's no showing for Infinity War for this movie was not a great idea. The events that transpire feel so minor in comparison to that movie and having this release after IW was a bad move on Marvels part. This movie really should have been released prob late last year to flow better with Infinity War. Instead it's just a lackluster sequel and the first miss for Marvel in a few years."
    },
    {
      "rating": "5",
      "text": "Intermediate film, does not bring anything new, still with the same formula as always Marvel and the truth that completely forgettable (5 minutes after leaving the movie theater and was thinking of anything else). The trailers already showed you the whole movie. Entertain but ready, do not expect more than that. The CGI is good and a bit of humor too, just like the movie never bores. But the performances are very wasted (especially Pffeifer) and a villain that does not generate anything. In itself, it is a good movie, but, there is nothing that makes me want to see it again."
    },
    {
      "rating": "8",
      "text": "I actually really liked it. However, I think it is a great example of male oppression and toxic meritocracy. Paul Rudd's character is talked down to the whole movie. This supposed inferiority is due to his being labelled a, \"criminal,\" and sentanced to jail time for righting a wrong committed by a former employer. His further, \"wrong doing,\" SPOILER ALERT was going to join the fight in Civil War, without letting his girlfriend know.While I can see why should would be upset, it doesn't seem worthy of this sort of total rejection of him. For some reason anytime his character does anything anyone questions he is treated as the total failure and f***up, supposedly because of his prior, \"criminal,\" act. However, all of his actions were in essence heroic. He is a clearly loving, engaged, and arguably ethically ideal role model to his daughter, and always makes the right heroic choices in his film. Still he is treated as less-than.To me it is sad that this sort of treatment goes unquestioned in our society. It seems to reflect the truth that father's are generally treated as comedic relief in pop culture and scapegoats.While men headline Marvel movies, for the most part they are emblematic of problems that are at least equal to women in fiction if not worse for the fact they go unrecognized. It is sad that often times people laugh at the concept of a Men's Movement or the need to examine gender norms and expectations as applied to men in our country. It is fairly obvious that our culture has a tremendous problem with, \"men.\""
    },
    {
      "rating": "3",
      "text": "No perdáis el tiempo. Ant-Man 2 es basura. La primera es mucho mejor, esta secuela ofrece una trama barata y unos villanos insulsos. Todo el protagonismo recae en Evangeline Lilly. El resto sobra."
    },
    {
      "rating": "8",
      "text": "While it's not the best Marvel sequel, Ant-Man and the Wasp delivers with a comedic action-packed superhero film that entertained me throughout. The visuals were stunning and the action sequences were insanely well-crafted. The major let down of the film is the villain though and that was pretty disappointing. However, I would still say Ant-Man and the Wasp is definitely one of the better Marvel movies."
    },
    {
      "rating": "7",
      "text": "While undoubtedly no masterpiece, Ant Man and the Wasp is certainly worth the entry fee. The film is funny, entertaining, dramatic and full of heart. The story itself is engaging and original, ensuring Ant Man and the Wasp acts as a worthy sequel and addition to the Marvel cinematic universe."
    },
    {
      "rating": "9",
      "text": "Marvel retains the distinctive hallmark of superhero genre. With witty mixture of comedy and action, and allusion of classics of sci-fi genre (Fantastic voyage, Them) is one of best escapism of summer 2018. Shall we consider the extra finale a bridge for a third part of the second act of Infinity War?"
    },
    {
      "rating": "8",
      "text": "Ant-Man 2 is  a logical follow up to the first movie. The story really explain well Scott Lang's situation after Civil War. It also continue where they left off regarding personal issues. It has a lot of humor, some of them better then other, but neither of them feels forced on you. I though the action fighting sequences were too fast, so you miss a lot of details in them. The music didn't do much for me. I give it a 74%. I think it's an easy movie to watch and enjoy. It is obligatory that you have seen at least Ant Man, Civil War and Avenger Infinity. Otherwise you will have questions about why and what."
    },
    {
      "rating": "10",
      "text": "Ant-Man and the Wasp improves on its predecessor in nearly every way; better character work, better action, better visuals, better pacing. It's the perfect film to ease audiences after their overwhelming experience with Infinity War, the previous film in the MCU. It's lighthearted Summer blockbuster fun, at least up until its mid-credit sequence."
    },
    {
      "rating": "8",
      "text": "This is a light Marvel entry, with a welcome absence of a save-the-universe plot. Some very hilarious contributions by the supporting actors sustain this worthwhile and entertaining summer popcorn movie.IMO, the critics have been harsh, and appear to have left their sense of humor at home."
    },
    {
      "rating": "8",
      "text": "Good movie; lots of action sequences, fun and tuns of humor and jokes (this is marvel, you know), everything's great, just like the first one. The plot is really really simple, Hank Pym (Michael Douglas) and Hope Van Dyne (Evangeline Lilly) want to bring Janet Van Dyne (Michelle Pfeiffer) back from the quantum realm because they think she might be alive; they need Scott Lang (Paul Rudd)'s help but he is on house arrest, besides he feels like he was her for a moment and that proves they are right; meanwhile a female villain named Ghost (Hannah John-Kamen) is a menace for them and they have to fight with her, she is a good character. Evangeline Lilly is wonderful as The Wasp and we want to see more of She and Ant-Man in action and their chemistry.There are 2 post-credit scenes, the first one is awesome and connects with Infinity War & Avengers 4."
    },
    {
      "rating": "10",
      "text": "There's not a single dull moment in this film. Marvel delivers a truly entertaining blockbuster once again, with stakes, characters you care about, ridiculously charismatic actors to bring them to life, breathtaking action sequences and so much honest emotion. It's a fun ride from beginning to end; even better than the first Ant-Man film and what I had expected. And Evangeline Lilly is simply amazing as the Wasp. Definite recommendation by me."
    },
    {
      "rating": "6",
      "text": "I was really looking forward to this sequel and was slightly disappointed. There are some fun action sequences (mostly seen in the trailer) but quite a bit of boring exposition. Michael Pena sparks up every scene he is in but is under-utilised. After a while it gets repetitive."
    },
    {
      "rating": "10",
      "text": "Ant-Man and the Wasp is probably the best sequel since the Winter Soldier. The movie has outstanding visuals and action scenes which is thoroughly entertaining with its great humour and Heart to it. The villain Ghost is a let down along with its side villains but if you've enjoyed the First one you'll definitely love this one as well."
    },
    {
      "rating": "8",
      "text": "Great movie, yet I was disappointed. I had read too many glowing user reviews - \"better than the first one\", \"great from beginning to end\", \"SO funny!\". In the end, my wife and I agreed we liked the first film more than this one. It WAS fun, and very good. Just not as non-stop funny or entertaining as my mind was anticipating thanks to the early reviews I read. I've recently learned to not watch trailers for films I really want to see. I guess I also need to stop reading reviews beforehand, too. Thanks to the directors, actors and other film makers for putting together a really fun movie. Each Marvel character is a great example for the rest of us that as you discover your God-given talents, bravely use them for the better of others."
    },
    {
      "rating": "3",
      "text": "We can learn a lot from ants’ intelligence at work from the way they coordinate with such precision by second nature, although can we learn similarly from Ant-Man and the Wasp? Well, think of it this way: we’re focused right now on one of those films that utilizes the actors’ blocking to signify sexual tension in a dumb way that leaves nothing to the imagination. Likewise, no true written or directed coordination puts anything at stake here, its excessive jokes left to treat ants more humane than any actual humans on screen. Maybe if the humans’ motivations were realistic, then these absurd circumstances could turn somewhat believable?Here are some examples. The foul script particularly turns Hope’s (the Wasp) father, Hank, into a dislikable boss who throws everything beneath his feet without compassionate support, serving a small part of bland stereotypes. Another part of those stereotypes includes the FBI worker who suddenly searches Scott’s (Ant-Man) home, resembling an evasive insect as opposed to a legitimate character. The same describes the leads: while Hope does get to kick butt, she later becomes nothing beyond a slightly sex’d down love interest to the male lead. Thus, you’ll get the feel of mental pests plaguing your brain nerves, ants sent through your eyeballs to break apart your cerebrum for nest eggs.So what does Ant-Man and the Wasp succeed at? Well, one early scene shows Scott entertaining his daughter Cassie in a cardboard recreation of his previous adventure, alongside his magic tricks that keep up its own consistent story arc. Yes, the father-daughter instances satisfy enough to make you want to see these two together, especially once spur-of-the-moment FBI searches interrupt their time together. To further sentimentalize the personal touches, he nicknames her, “Peanut,” much like how Hope’s parents call her “Jellybean,” and Cassie calls her dad, “World’s Greatest Grandma.” Besides the main families, the key villain, Ava (or “Ghost“), whose cells suffer molecular disequilibrium, connects to heartbreaking results with her adopted dad.Of course, being a Marvel property, you should expect laughs aplenty; memorable gags turn small things giant and vice versa, chuckles a guarantee when Scott gets stuck to half his size in an elementary school. Michael Peña (American Hustle, Crash) delivers some nice rapid-fire comedy too during his funny narration on truth serum. Plus, Peyton Reed’s (Ant-Man) direction meets expectations based on how he utilizes the Wasp’s powers to memorable results against bad guys. Then inside the quantum realm, colossal tardigrades lunge toward you, creating a surreal environment Michelle Pfeiffer’s (Dangerous Liaisons, The Fabulous Baker Boys) acceptable portrayal complements satisfactorily. Yet let me say: she looks ridiculously young! Not a wrinkle anywhere! Do they have an anti-aging salon in the quantum realm because she looks just like one of those formerly famous Hollywood actresses who’s trying to hard to stay relevant! Oh wait…I know you hate it when I trash on Marvel, but it still fails to be art because of how much a lazy corporate product it is. Marvel may be tremendous at the whole marketing strategy, yet its familiar shiny flaw-free world comes off inauthentic under its excessive, random pop culture references. Not to mention it will not make this film age well, considering the products of the cinematic universe will last far longer than the company’s profits. These producers trying to make stuff cool takes priority over practicality, forcing chuckles from scientifically educated viewers by the carelessness of how the science talk is treated. Heck, a shrunken car matches the speed of regular sized ones for crying out loud! So even though slight emotional doses ground the viewer’s optimism, the willful suspension of disbelief runs way off track.Yeah, I understand, I must avoid overthinking a summer popcorn movie, except the nauseous editing by Dan Lebental (Ant-Man, Iron Man) and Craig Wood (Guardians of the Galaxy, Pirates of the Caribbean) ramble on lame humor rather than slowing down to linger on the pain. It’s not enjoyable when desires inappropriately go to quick plot point progression, the only hint of deceleration present when slow-motion knives are thrown.It appears even the performers themselves didn’t want to get to know their roles well. Instead of acting jittery, Paul Rudd causes serious discomfort as Michael Douglas’ (Fatal Attraction, Wall Street) weak motivation spurts out unintentionally funny angry outbursts towards his colleagues. Worst above all, not one single believable relationship holds up the entire feature, that includes the necessary fear of a family crisis built between Ant-Man and Ava.But good news! You have need to set sail through Marvel’s shipwrecked celebration of American pride. It’s summer for crying out loud, ride a bike! Enjoy the sun!"
    },
    {
      "rating": "8",
      "text": "About as good as the first one in terms of quality. This film offers alot in its comedy, visuals and strong performances which is surprising considering the trailers left alot to be desired. Ghost had the look of a cool villain but she was a step down from Killmonger and Thanos as she didn't really feel like a villain as much as she did a sympathetic  anti-hero."
    },
    {
      "rating": "8",
      "text": "This is a very fun and hilarious movie with an interesting plot. The actors are as good and funny as the first movie. I wish Ant man shrunk more throughout the movie and that the wasp had a bigger part to play. Still at no point did i want to stop watching it. ( Why is it that ant man seems more  scientifically possible then the other MCU heroes?? )"
    },
    {
      "rating": "9",
      "text": "The Bad:This movie has a moderate case of sequelitis - some of the jokes in the middle 3rd of the movie miss their mark.  I hate that feeling in a movie theater when the writers clearly thought they had a gem of a gag and the audience stays silent.  Cringe-worthy!Stuffed-In Bad Guy: There's generic corrupt corporate bad-guy named Sonny Burch who apparently was in Iron Man III but did not achieve much of an impact in that movie either because I can't even remember him.  The actor was fine, but the character wasn't necessary.The Good:The best character was Hope Pym(Wasp)- she was a total bad-ass, quite the opposite of fumbling and bumbling Scott Lang, who we love seeing grope his way blindly through life and his action scenes.  The Wasp probably laid out more fodder than Captain America in his first movie.  In addition her relationship with her dad was much improved, and it was nice to see that carried through from the end of the last film.  The seemed like a real family.Ghost:  I want to see this character again; she was something I was not prepared to process.  Her backstory is compelling and Hannah Johm Kamen nails it to perfection.  I thought about Ghost more than any other character after I left the theater.  Love the effects on her as well as her impressive array of powers.Humor: Although I dissed this aspect of the movie above, overall the writing was above average.  There are some truly memorable funny moments as well as a few duds.  The good outweighs the bad here.Lawrence Fishburn: Great to see one of my favorite actors rocking the Goliath character.  Unlike many add-on characters to sequels I felt that he wasn't just made up to plug a hole in a script.The Kid: Wow, how do I hate cute kids in action movies.  But for some reason this kid isn't annoying - in fact she's naturally cute and funny.  Perhaps it's because she doesn't act sassy and say adult lines which are developmentally unrealistic from a psychological perspective.  Her lines are what a kid her age might actually say.Randall Park as Jimmy Woo: Another terrific addition to the cast, Officer Woo had some of the funniest lines in the film.  I'd love to see this guy again in other MCU movies.  He sucks at cards though...The Action - Especially the End Sequence:  The effects are spectacular, the editing is spot on, and I couldn't find any major plot holes with how everything turned out.Fan Boy Cred:  I spent a large portion of my childhood actually reading the comics these characters are based on and I've romanticized it in my head for decades.  To me, this film - along with many of the other higher quality MCU films - honored the source material."
    },
    {
      "rating": "7",
      "text": "While it may not have as much humor or originality as its predecessor (an unfortunate side-effect of sequels in general), Marvel Studios' \"Ant Man and the Wasp\" is sure to entertain both fans of the MCU and newcomers alike."
    },
    {
      "rating": "7",
      "text": "Ant-man and the wasp was a sequel that I was really looking forward mainly because I loved the first ant-man, I thought it stood out compared to most MCU movies and was unique in its own way.  So is this film good, yes it is, it's not a great movie but I still do really enjoy this movie.  Paul Rudd, Evangeline Lilly work very well together and both give their best while performing.  Michael douglas and Michael Pena are funny and bring some great one liners and that's something I can give a big praise to in this movie, the humour is always on point and doesn't feel forced and misused.  The action scenes are fun and exactly what I wanted to see, the gorgeous visuals and well planned use of cgi never make these scenes feel fake or poorly adapted on the screen. Now as I said this movie is good but I had a lot of problems with it, the shows villains are very cliche and follow the same villain routes and plan outs that you would see in a cartoon show.  They also try to make the film feel very serious and dark, but it never pulls off, either its because paul rudd lets off a one liner or michael pena starts talking and their is never any real tensity.  One of my other big issues was how they treated the character of ant-man.  In the first film we see that he is fairly smart, he's no genius but he is smart, but in this film they treat ant-man almost like and idiot and I didn't like that, he's always the one to make a dumb decision, or not do something correctly and that felt a bit off putting for me.But overall I do suggest go checking this one out, I did enjoy this movie I don't like it quite as much as the first but it is still a blast to watch and I'm sure will please most followers of the MCU."
    },
    {
      "rating": "7",
      "text": "A fun popcorn flick, but unfortunately not as good as the original (which is IMO one of the best of all of the 20+ MCU films). A higher ratio of jokes fall flat in this compared to its predecessor, but it remains a good combo of comedy and action that we've come to expect."
    },
    {
      "rating": "7",
      "text": "Una película que te saca muchas sonrisas pero no tiene acción tratandose de superheroés. Fantasma es una buena villana pero los traficantes son puro relleno. Es una más del montón de Marvel."
    }
  ]
}