{
  "id": 1557,
  "title": "Antebellum",
  "starring": [
    "Janelle Monáe",
    "Eric Lange"
  ],
  "runtime": 105,
  "genre": [
    "Horror"
  ],
  "description": "Successful author Veronica finds herself trapped in a horrifying reality and must uncover the mind-bending mystery before it's too late.",
  "releaseYear": "2020",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/irkse1FMm9dWemwlxKJ7RINT9Iy.jpg",
  "categories": {
    "plot": 4.588235294117647,
    "acting": 4.583333333333333,
    "ending": 6.909090909090909,
    "soundtrack": 5.0,
    "cinematography": 6.0,
    "familyFriendly": 3.0,
    "funny": 5.0,
    "action": 6.0
  },
  "reviews": [
    {
      "rating": "0",
      "text": "There really wasn't much context at all, you guys straight up jump into this weird snm sht, and it seems like a rip off of get out."
    },
    {
      "rating": "2",
      "text": "Was pretty disappointed.  3/4 of the movie is pretty slow.  By the time you get to the \"twist\", it's a major let down."
    },
    {
      "rating": "5",
      "text": "\"Antebellum\" is a tough movie to watch AND review. It's depiction of slavery is brutal, but the twist that brings it into genre territory is badly timed and ultimately disappointing."
    },
    {
      "rating": "2",
      "text": "Pure, triple distilled racist propaganda. It amazes me that this could make it to release.Every corner of this drips black racism.  However its misandry and sexism are not that far behind. What is more nuanced is the elitism that is more delicately woven into the fabric of the film.Trying to remain positive of a film that does not deserve such consideration, the sets are well done and the actors do their best with what they had to work with. Gabourey Sidibe does a particularly good job of portraying a completely unlikable character with clear delusions and entitled sense of self worth that would simply not be humanly possible.The racist tropes are all here and it goes out of its way to put forth some rather inventive ones in this plot that is so utterly implausible it is literally impossible.What this film does is impressive. It shows just how far propaganda can go to push a political ideology, all while being obliviously unaware of itself to understand just how wrong it gets the subject matter it deals with, all while insulting its prime target demographics.All that said if you can get beyond rolling your eyes in the back of your head for how ridiculous the movie is, it is at least on some level entertaining. Sadly its the level of watching a train wreck to see how mangled the bodies come out but people do in fact watch for that sort of thing, even if they will never dare admit that is why they gawked.Look, dont take my word for it... just look at how low the critic scores are and know studios can buy critic reviews with ease. If it can only muster a 44 with as high of a profile as this movie has, you KNOW its terrible."
    },
    {
      "rating": "0",
      "text": "This is the cinematic equivalent of our current culture, in that it looks to the past from our current moral perspective, ignoring the process that got us here. Slavery was horrifying and we know that now, and we know that because we made it illegal. Ignoring that growth nullifies the fact that, while we had slavery less than 200 years ago, we've evolved to the point of having had a black president in that historically short amount of time. This film is just another, pandering what if adventure like Watchmen and Lovecraft Country, where our black heroes get revenge for past wrongs. It's a movie version of shoulda, coulda, woulda. It also has no value. Add to that, Janelle Monae is not a good actress."
    },
    {
      "rating": "4",
      "text": "Not sure who asked for a remake of The Village with a slave plantation instead of a village, but alas, here we are."
    },
    {
      "rating": "10",
      "text": "You gotta watch this like Inception and when you put it together holy moly frenchman Parker first name Tony  this is good!!!!!!"
    },
    {
      "rating": "10",
      "text": "MIND BLOWING. **** my mind is just like omfg. dude i can not get over how crazy this movie is."
    },
    {
      "rating": "10",
      "text": "it has a great story and very now with the undertones. The ending provides a pretty great twist"
    },
    {
      "rating": "3",
      "text": "Story could have been so much more but seems to focus too much on \"evil slavery\". Like sure there were slaves and it was bad but I'm not here to watch a documentary. Not emotional enough, maybe due to the writing it just bad direction. Something I will forget quickly."
    },
    {
      "rating": "8",
      "text": "Aside from a slightly slow start, this is a rare bird indeed: a movie with a plot twist that actually WORKS. Or at least it did for me (I see that it didn't for several others)!Definitely a film best entered into knowing as little as possible, though I will say this: in an era full of rampant \"wokeness\" and \"virtue signalling\", this film addresses the very topical issue of racism in a relatively clever and non-preachy fashion. An engaging romp that had me almost whooping with excitement during the climactic scenes. See it for reasons of enjoyment, as opposed to \"enlightenment\"."
    },
    {
      "rating": "4",
      "text": "It's a terrible shame to see they wasted the depth of their subject matter trying to create a shocking and yet completely empty experience.A missed opportunity that thinks its saying something meaningful, while being unable to realize that it lost itself because of the way it presented the story."
    },
    {
      "rating": "10",
      "text": "I over loved this movie. I think God knew this movie shouldn't of made it to theaters due to covid, because it probably would of caused an uproar or made white movie goers very uncomfortable and probably head for the nearest exit."
    },
    {
      "rating": "10",
      "text": "This Movie is beyond amazing!! It shows you how shocking and devastating slaves were treated and how it is a possibility something similar like the movie could be happening as we speak!! The movie is POWERFUL, EMPOWERING, HORRIFYING, BONE CHILLING, and most of all it’s a reminder of what could be happening behind closed doors, and in the shadows away from the public!! It definitely is a time worthy movie in every sense of the word definitely begs for a rewatch just because of how the storyline transcends and eclipses to a phenomenal serve of justice/revenge done by the most amazing (Janelle Monáe)!! EXTREMELY RECOMMENDED TO WATCH AND FOR A SECOND REWATCH!! Loved the ending and the serve of justice/revenge at the end (best part in MY opinion)!! (PS: I can see why this movie most likely will not get the high rating reviews it truly deserves, because majority of WHITE Americans feel attacked or simply still have that conception that their ancestors had a century ago!! They feel like it puts them in a bad image,and frankly it should picture them in a bad way, and well if that’s the only way to show the inhumane way WHITE people treat the BLACK race then so be it!!) Again truly a SPECTACULAR movie, a MASTERPIECE in every sense of the word!! 10/10!!"
    },
    {
      "rating": "10",
      "text": "This is a solid movie imo. I'd personally give it a 7/10 but am giving it a 10/10 to somewhat offset the ridiculous 0/10 reviews on here."
    },
    {
      "rating": "1",
      "text": "Just bad how a writer has to constantly make white people the bad guys. It’s been a reoccurring theme with Pelle, and I could deal with it, if the movie was good. But it wasn’t. Not a horror movie at all!!"
    },
    {
      "rating": "1",
      "text": "Just watched the movie ,well i can say it was quite political and badly filmed . As of now just saw these ideas in the film : Feminism , rasisms agaisnt whitesBlack propaganda , cultism , about normalizing unstable relationships , theft ,rape . And as of now before going to a film thats a \"horror \" film i was disapointed ."
    },
    {
      "rating": "10",
      "text": "Great movie! Makes you think about how modern-day racists would be during slavery times. Great acting and cinematography. Would recommend."
    },
    {
      "rating": "10",
      "text": "An incredibly timely film - thrillingly entertaining and terrifying at the same time. Janelle deserves an oscar."
    },
    {
      "rating": "10",
      "text": "Absolutely amazing movie. It’s a work of art! Can’t remember the last time I watched something this powerful"
    },
    {
      "rating": "10",
      "text": "A good warning to those that think that they can \"make America great again\" flame on my flame on."
    },
    {
      "rating": "4",
      "text": "This is a hard movie to review.  I want to like it because I agree with the film's intentions and goals.  I know there really are people who want to do what the antagonist characters are doing, feel the way they do and surely don't think they are racists.  I'm sure a good number of them posted 0 reviews for this movie here.  I also really like Janelle Monae as an actress; she has a great screen presence and  tries really hard here.  But she cannot overcome this material.  The movie wants to be like \"Get Out\", which was great, and a little M. Night Shyamalan with the major plot twist.  The former was a wonderful film and Shyamalan can make entertaining movies with interesting twists (but can also make dreadful films with lame twists).  But this script just is not there.  Any specific comments would be far too revealing of plot.  Many of the characters are simplified and without depth.  A friend of the main character, who only appears in the second part of the film, is tonally apart from this entire film and seems like a stereotype from a bad Black Rom Com.  Unlike many people who do not like this film, I believe that evil like this is real and it exists and is being fanned in our current political climate.  But the evil here is kind of like slavery torture porn.  It is so unpleasant to watch and so completely without any legitimate motive, other than hate, it is simply vile.  Unlike others, I can understand why the message and point of this movie might be enough for some people to like it, especially given our current political and cultural morass.  But it is pretty poor film making.  And even good intentions can end of with a bad product."
    },
    {
      "rating": "7",
      "text": "During the excruciatingly cruel first act, Janelle Monáe is trapped as an enslaved woman on a Southern plantation. Suddenly, she’s back in the present, where she’s a noted author writing about racism. This strange parallel world develops into a somewhat interesting thriller. It takes time before it becomes genuinely tense, but Monet makes it worth watching and Gabourey Sibide also adds some fun support. Throughout, the cinematography is beautiful, which makes even the most horrible scenes more palatable. First-time writing/directing duo Gerard Bush and Christopher Renz are obviously fans of Get Out with their variation on racial horror. Even though they didn’t succeed like Jordan Peele, their dark vision is still compelling."
    },
    {
      "rating": "4",
      "text": "The score and production design are both great, but direction and writing fall flat. They had ideas they wanted to do, but the execution is either muddled or pandering. World of difference between concept and execution."
    },
    {
      "rating": "1",
      "text": "The plot idea is not so bad, but the realization is really, really outrageously bad. Too much ideology and propaganda that have really nothing to do with the story, while the story itself seems to be written by a retarded first grader, with very shallow characters and very little suspense."
    },
    {
      "rating": "7",
      "text": "I enjoyed the movie. Its a bit creepy and I liked that a lot and it has a sense of dark atmosphere surrounding the plot at first. The story wasn't anything amazing but it was a pretty decent movies considering how crappy this year has been for movie releases with the COVID-19 pandemic. There is nothing racist about this movie and I don't get why people are even mentioning this."
    },
    {
      "rating": "2",
      "text": "Save yourself the watch, obviously a movie created to add to BLM narrative. But awfully delivered. I should have seen the ratings before wasting my time with it. The twist was absolutely crap. Got sucked in with the “from the producers of Get Out” everything after Get Out has been trash. So is this.."
    },
    {
      "rating": "2",
      "text": "A shameless exploitation of the collective paranoid delusion seizing America. \"Antebellum\" (which literally means 'before a war') wants you to believe that it's perfectly plausible for you to wake up as a plantation slave any day now. After all, no black person is safe in Trump America so make sure you get yourself a good sun screen while you still can for those long plantation afternoons! In other words, always count on Hollywood to divide rather than unite. Another shameless thing is the incessant name-dropping of \"Get Out\" in like 99% of promotional materials for the film. Don't let that fool you into thinking you're watching some sort of spiritual successor to Get Out--Jordan Peele, who was largely responsible for why \"Get Out\" was a success, was not involved in \"Antebellum\" in any way and it shows."
    },
    {
      "rating": "6",
      "text": "I really liked the idea but I feel like they screwed up the reveal. How much better would the twist be if it came in final 15 minutes of movie. We waste 35 minutes in middle of movie getting character development on people who don’t even matter to the real story. The writing is pretty meh for some stretches. The micro aggressions that we are all pretty much aware of at this point are too exaggerated it makes me wonder if the writer has ever experienced one or just read about it on theroot"
    },
    {
      "rating": "5",
      "text": "Trip Fontaine: Good weekend, Streamers! We're quickly moving into that time of year where genre movies dominate new releases. This weekend the movie billed as a horror/thriller, Antebellum, was released on various video-on-demand platforms for our viewing pleasure. With an entertaining trailer and an intriguing, time-bending premise, Antebellum would seem to be a sure bet for an intense movie experience. Does it live up to its promise?S2S: Here, here Trip! I've been sitting on pins and needles waiting for this to be released. It cost us $19.99 on video-on-demand and it better be worth it. Let's see what was occurring or existing before a particular war, especially the American Civil War. Take it away.Trip: It is kind of difficult to describe the plot without getting spoiler-y, but I'll make an attempt. Janelle Monae plays dual roles as a slave called Eden, who has tried to escape the brutal plantation where she's held captive, and as a successful author, named Veronica Henley, who leaves home for a conference in New Orleans and strange things start to occur. There is an indication that these two women have a connection and the film takes its time building to that reveal. In fact, the implication is clear in the beginning as the movie starts with a quote from William Faulkner: \"The past is never dead. It's not even past.\" Eerie, but what does that really mean?S2S: I'll take it one step further, Trip. This is a film as its title proclaims. It's an examination of antebellum in America or the time after the American Civil War. We are viewing the experiences of Eden while feeling the effects of Veronica. I mean to say it shows the modern-day effects of lingering Civil War relics and experiences that haunt the Black community in America currently.Trip: Thanks for adding that, S2S. The filmmakers, Gerard Bush and Christopher Renz, have some good ideas about that. The premise of the movie is very intriguing and has a lot of promise. In fact, the theme of how the past impacts the present and how America is still reckoning with slavery remains relevant, but the film both tries too hard and is not clever enough for what it's trying to say. Even though Antebellum isn't a long movie and it's not necessarily boring, it takes too long to get to the point. On the plus side, the cinematography is very good throughout and some of the images depicted are very memorable.S2S: I wholeheartedly agree. This movie suffers from what I call potential. The filmmakers started to express ideas and images that have so much potential. The idea is almost thought out, the execution is almost there, and yet the end product just isn't properly finished. There's so much potential that is left in this idea and left on the table. Either they didn't want to push the envelope too much or the movie company said, \"whoa, I don't think we want to go in that direction\". That's exactly the sentiment I had after watching the movie. But I'm just glad they stuck with Janelle because she truly is a star with potential.Trip: You're right, S2S. Janelle Monae is good as the anchor for this story. I can't say much about the rest of the ensemble because they don't have much to do. Gabourey Sidibe plays an annoying friend, who is vulgar and annoying; and Jena Malone is perfectly cast as a cartoonishly sinister racist.S2S: Timeout! there were other actors in this movie?! You could've fooled me. Janelle Monae pops off the screen and takes over the movie. Everyone else was just a distraction. I'm not saying she was amazing but like I said there is so much potential. Unlike the movie, I think Janelle is fully on her way to realizing that potential. Each role she takes continues to get better and better. I look forward to her roles in the future. Quiet as its kept, Jena Malone kept this movie interesting but wasn't used enough.Trip: Ultimately, Antebellum disappointed me. It is a fine movie, but it does not live up to its promise. The film was marketed as a horror/thriller and it is not that. It may be a thriller, I guess, but it is definitely not a horror movie. It may be compared to the horror/comedy/thriller of Get Out, which was actually all of the things that it was promoted to be. False advertising makes this just a handful of popcorn watch at best.S2S: I couldn't agree more Trip. I felt lied to with the trailer. I was promised a thrilling psychological thriller and I got a movie that every Black person in the South has feared their whole life already. The movie could've been more and they promised us more. I had an evening with Antebellum but I could've saved myself $19.99. I'll snack on this handful of popcorn for now but I look forward to better releases in the future. Until next time Streamers!"
    },
    {
      "rating": "9",
      "text": "Una novità assoluta nel panorama internazionale che sa cogliere il punto di incontro tra fatto storico e thriller, tra trama e dramma psicologico, tra fotografia e costumi"
    },
    {
      "rating": "8",
      "text": "Why all the undeserved hate? I do not get why people keep panning this film. It is a psychological thriller that speaks quite aptly to the world we live in by asking a very uncomfortable question. It speaks in particular to race relations in America and questions a world where the fantasies of a violent, regressive and exploitative power is met at the expense of a brutalized, traumatized and oppressed other. All the while these fantasies are supposed to be a pastime that people should have healed and moved on from, in order to face other (newer) challenges. Except - \"the past is never dead, it is not even past.\" This is true & perfect to our time and it is a reality rightly questioned.Antebellum compresses a lot of political, ideological thinking and societal trauma into this intelligent and brilliant film. Special commendation goes to Janelle Monae who is not an established actress - yet, but she delivers a commanding performance in a movie that is absolutely thrilling to watch. Some have compared this film to Get Out, I must say such comparisons are reductive, deprecatory and unwarranted.The movie's well shot, possess a great script, has good acting, with wonderful storytelling and it's score is fantastic, paired well with the movie's atmosphere. It's overall, a really good film."
    }
  ]
}