{"id": 3003, "title": "Anthropoid", "starring": ["Jamie Dornan", "Cillian Murphy"], "runtime": 120, "genre": ["History", "Thriller", "War"], "description": "In December 1941, Czech soldiers Jozef Gabčík and Jan Kubiš parachute into their occupied homeland to assassinate Nazi officer Reinhard Heydrich.", "releaseYear": "2016", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/5hUghRVVkBYufftfNQkGevY5AmE.jpg", "categories": {"plot": 6.176470588235294, "acting": 7.2, "ending": 6.0, "soundtrack": 5.0, "cinematography": 5.666666666666667, "familyFriendly": 3.0, "funny": 5.0, "action": 7.0}, "reviews": [{"rating": "4", "text": "It should have ended after the shooting of the target. That moment was really good(!) but after that; what was a reserved movie goes downhill with a way too long firefight that simplifies shooting and makes the germans look like fools literally rushing to there deaths. Maybe I'll see Hell or high water next. Lets just hope it's not jack ryan or star trek beyond quality. :)"}, {"rating": "5", "text": "What Anthropoid lacks in diologue, character depth, and thoughtful pacing is at least somewhat made up for with a spectacular defend-the-castle climax."}, {"rating": "5", "text": "Although the title sounds like a futuristic sci-fi creature, it was actually the code name for Reinhard Heydrich, the Nazi architect behind the Final Solution. This fact-based story follows 2 operatives (Cillian Murphy and Jamie Dornan) who are assigned to assassinate him in their native Czechoslovakia. Their mission plays out primarily thru whispers and furtive glances, but there are 2 mildly tense, but not especially gripping, encounters. The cinematography and design attractively create a period atmosphere and the actors are all fine. It's an interesting story and well told, but almost every scene goes on longer than necessary, especially some of the dramatic discussions."}, {"rating": "8", "text": "Anthropoid is a very complex and stunning drama that doesn't relent for a minute. The performances by Murphy and Dornan are surprisingly deep and emotional, and the movie benefits from a straightforward story and no gloss or unnecessary storyline. Mostly unknown director Sean Ellis has potential."}, {"rating": "4", "text": "I was expecting more and better.  First it was difficult to understand at times because of the accents. Also, alot of uninteresting dialogue.  Also,  i was not expecting such a violent ending.  I have no doubt it was actually violent, but the movie displayed it graphically, If you are squeamish (I am not), this is not your movie.  In summary, I didn't find it interesting or engaging."}, {"rating": "10", "text": "I normally don't like films from this genre, but a friend wanted me to join him. I was enthralled with the movie; to actually see the emotional toil on the people who were fighting undercover, knowing they could be discovered at any time.\r It felt very raw and real to me to see their courage when faced with the knowledge  that they would probably die within days. Yet, that didn't deter them from their mission. I read reviews where the critic was scornful because of one of the men's hesitance and fear, stating he (the critic) would have liked to push the guy aside and pull the trigger himself. But, this isn't a cowboy-shoot-um-up all guns blazing movie. This is about real people and the horror of the world they were facing.\r Another reviewer was angered by the violence at the end. Horribly, that was the truth of the story that needed to be told. I was very impressed with everyone involved in this movie. The actors were wonderful, and the era was portrayed with as much accuracy as possible."}, {"rating": "6", "text": "Anthropoid is about the people who attempted to carry out Operation Anthropoid, an operation that, if successful, would eliminate an officer of Hitler who was third in line.\rI would like to say that's the plotline, but there's just one key catch: it's not interesting until nearly half-way in.\rThat's pretty much the only flaw in this movie, but it's still half of a movie. That first half is all set-up that takes way too long. Most of this set-up is entirely pointless and doesn't develop the characters. Aside from almost an hour of pointlessness, the characters aren't as deep or rich as they should be.\rThat being said, I enjoyed the action and the stand-off in the other half. They were well deserved and well-filmed. If anything, this movie is really only worth watching because of the action that puts Hollywood to shame. However, it gains nothing more than the seal of mediocrity for having too much exposition with too little payoff and kind-of flat characters."}, {"rating": "3", "text": "Another modern film spoiled by poor writing. When oh when will directors realise they are not screenwriters? Sean Ellis manages to turn what could have been a gripping story into a turgid melodrama. Heydrich's assassination is largely remembered for the disgusting aftermath where the Germans massacred 15,000 Czechs in Lidice  and Ležaky. That was barely alluded to in the film yet the director spent several minutes depicting the torture of individual resistance fighters. Little surprise that this poor film lost money at the boy office."}, {"rating": "10", "text": "Based on the real events surrounding the WWII mission to assassinate SS General Reinhard Heydrich. Starring Cillian Murphy and Jamie Dornan. Leaves you speechless, from the very moment it starts it grips you and drags you through a highly suspenseful and distressing journey. A truly breathtaking movie. Strongly recommended, without a doubt one of the easiest 10's I ever gave."}, {"rating": "6", "text": "A lovingly shot, but cliched historical action thriller, Anthropoid is an above average film. Telling the true story about the men responsible for the assassination of Reinhard Heydrich, third-in-command for the Nazis, the film is clearly powerful. An undertold story of the strength of the Czechoslovakian resistance and an obviously important moment in World War II, Operation Anthropoid receives its due regards in this film from director Sean Ellis. Unfortunately, it is a mixed bag. While it has terrific cinematography, good acting, and a tremendous assassination, the latter comes too early and the film loses steam. Of course, the cliched beginning with a love triangle and the cliched WWII action sequence at the end also hinder the game. That said, the assassination is so damn good.Starring Cillian Murphy and Jamie Dornan as the men responsible for the assassination, Anthropoid's greatest asset is the assassination sequence. As most people should know (I ashamedly did not), they were successful to a degree. It is likely that Sean Ellis assumed building up to such a well known event would not be suspenseful enough. However, he is shown to be wrong. In the first half of this film, the build up, the planning, and the anxiety of the situation are terrifically captured. The following nervy, thrilling, and suspenseful assassination is tremendously captured. Ellis' camera makes the occasion incredibly intimate with a cloud of smoke billowing out of the area in the aftermath. The intensity of the lead up and the panic of the moments directly after is incredibly effective in setting the moment and capturing it with beautiful images and a tremendous action sequence. Rather than playing into cliches here, the film sets it apart with a unique, intense, and unexpected moment of brilliance. It also makes me want to see Jamie Dornan in a neo-noir film set in the 1940s. The suit and fedora look is just so right for him.The other strength of this film is the cinematography and production design. Shot through a sepia filter, the film looks old school and, in conjunction with the sets and locations, looks and feels authentic. Anthropoid really captures 1942 Czechoslovakia and turns it into a beautiful painting. To bolster this, Ellis sprinkles in some absolutely gorgeous shots. These include shots of the sun spilling through the sees in a forest and an aerial shot a bridge in Prague and sun reflecting off the water and the rays going under the bridge. With these shots and the general aesthetic under its belt, WWII Czechoslovakia has never looked so good and Ellis makes sure to capture this beauty.Unfortunately, its love triangle and cliched second half derail the film. With boring scenes of torture and a lackluster finale shootout in a church, Anthropoid turns into nothing more than a run-of-the-mill action thriller. The power that this really happened does not help as numerous true stories have shown the exact same action. This bad ending is proof that the assassination came too soon. It should have been the climax instead. The film would have been more detailed and a lot slower for sure, but its ending would have been worthy of the heroism on display. It is the moment that sets its heroes apart. Instead of ending there, however, Ellis' film drags on for a cliched final hour that turns them into nothing more than soldiers in a World War II film. Their identities are forgotten with writing that failed to create worthwhile characters that are memorable. They may die in a hail of bullets, but the film was killed long before. Now, I should say that the action sequence is fine. It looks good and is pretty thrilling, but there are too many films with it that pretend to be WWII thrillers. This sea of bullets turns it into nothing more than a cliched film with no element to separate it from similar films.Tremendously shot with a great assassination sequence, Anthropoid may be pretty, but it is nothing but above average. The ending is cliched, the characters underdeveloped, and the romance ill-advised. That said, the strengths of the film are so incredible, Anthropoid is impossible to look past."}, {"rating": "8", "text": "Assassinating the nazi general was their mission, but it initiated the resistance.Honestly, I thought it was some science fiction film. The title sounded like one, so I had to google for its definition. This is an assassination theme, that sets in the early 40s in the Czechoslovakia. The early days of the world war two, where the exile soldiers were sent to eliminate the nazi general Reinhard Heydrich, who was handling the Czechoslovakian affairs. From theirs preparation to the plan execution and the outcome of the result was what this film reveals for us.A war film, that too was based on the real, especially the WWII means no need to say how powerful it would be. This was directed by the 'Metro Manila' filmmaker. An internationally produced film, but the cast does not have any big names. I mean Jamie Dornan and Cillian Murphy are not globally recognised, particularly when it comes to the film marketing. So it stumbled at the box office. I liked them both and the others as well. The film was not bad as criticised by the film critics. I would say make your own call after watching it.It was so neat and clean on what it dealt with. The issue with it was too much blank space and then in the mid part where the assassination happened, the film came alive. Again towards the final, the pace gone up and finished strongly. So I think overall length should have been trimmed for a better narration/result. Not for me, I liked as it is now, but some viewers think it is a draggy.Small budget film, but worth a watch. Because the production quality was great, no compromise on visuals or the settings, but most of them were shot in the real locations to give us the real effect. Definitely one of the best film among WWII related theme. Anyway, this is not a war film, but very much similar to the recent Korean film 'Assassination' about killing the Japanese general. Films like this are must see, because it reveals how much the people, the society and the nation struggled under the nazi atrocities. Surely recommended!8/10"}, {"rating": "8", "text": "I really enjoyed this movie even though at some moments it felt a bit boring and at some a bit rushed in the beginning, but the overall story and the fact that it is based on real life made the movie even more intense. I really liked how both actors portrayed their roles too. If you like WW2 movies this is one I can suggest to you, even though this is still not the best of them."}, {"rating": "8", "text": "Well acted movie that shows there's more to war than just action scenes, it affects both sexes and all people in different ways. We start with parachuters on a mission unprepared for what they must do and what simple relationships will do to them. You never know what will strengthen you as a human and as a soldier."}], "recommendations": ["13_hours_the_secret_soldiers_of_benghazi", "allied", "12_strong", "centurion", "deepwater_horizon", "dunkirk", "sicario_day_of_the_soldado", "1917", "the_outpost", "the_eagle", "lone_survivor", "greyhound", "red_tails", "zero_dark_thirty", "master_and_commander_the_far_side_of_the_world", "patriots_day", "hostiles", "the_great_escape", "first_man", "das_boot", "the_deer_hunter", "the_sum_of_all_fears", "everest", "the_1517_to_paris", "mortal_engines"]}