{
  "id": 842,
  "title": "Antlers",
  "starring": [
    "Keri Russell",
    "Jesse Plemons"
  ],
  "runtime": 99,
  "genre": [
    "Drama",
    "Horror",
    "Mystery"
  ],
  "description": "A small-town Oregon teacher and her brother, the local sheriff, discover a young student is harbouring a dangerous secret that could have frightening consequences.",
  "releaseYear": "2021",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/cMch3tiexw3FdOEeZxMWVel61Xg.jpg",
  "categories": {
    "plot": 4.916666666666667,
    "acting": 4.571428571428571,
    "ending": 4.333333333333333,
    "soundtrack": 4.0,
    "cinematography": 6.0,
    "familyFriendly": 3.0,
    "funny": 7.0,
    "action": 7.0
  },
  "reviews": [
    {
      "rating": "7",
      "text": "First ~2/3 of the movie had a great unsettling atmosphere, dark symbolism, and intrigue going for it. The last act left little surprises and it just felt unsatisfying when characters act incorrectly to circumstances/previous responses. How the main protagonists past ties into the theme ends up just being used to justify the unlikelihood of how they clumsily resolve the plot. The dark themes the movie wants to explore and the simplicity of summarizing the events are at odds with each other.Great monster design but if you come mainly for that you might be disappointed with it's lack of appearances. Technically well executed but did very little to create true moments of horror, anxiety, or disgust. Best you get is some unease, maybe a jump scare, and the knowledge that they addressed a dark subject without really exploring it"
    },
    {
      "rating": "7",
      "text": "I have been looking forward to this film for some time now and was happy to see it finally release. I am happy to say that Antlers is a beautiful looking film that is incredibly well shot. But, the general plot and storyline are a bit jumbled; and the characters, while well acted, aren't particularly that interesting. Still, Antlers is worth a watch for its overall look and its horror aspects."
    },
    {
      "rating": "7",
      "text": "Incredible practical effects. Decent story that tapers off in the 3rd act. Great acting."
    },
    {
      "rating": "6",
      "text": "It's a paint-by-numbers horror movie with good acting and a jump scare that's more like a **** yourself scare. Trust me, you'll know it when you see it!"
    },
    {
      "rating": "7",
      "text": "Good utopian atmosphere. Wow visual row. Nice monster design. Many frames can be used as poster. Very beautiful."
    },
    {
      "rating": "8",
      "text": "It is the first horror movie I saw and it was pretty good. The plot was well presented, acting was okay, and even though sometimes it was a little predictible, those shed scenes were really scary."
    },
    {
      "rating": "7",
      "text": "It was more a disgusting film Esther than a scary film, but overall it was pretty fun."
    },
    {
      "rating": "7",
      "text": "A simple movie that evokes some wonderment. The movie is not horror and it does not do too much - but in what it does, it does pretty well.It strikes a decent balance between mystery, thriller and mythoi with some really good acting, particularly from the young Jeremy Thomas. While it touches on some issues in small communities without going into detail. Along with some fine cinematography, it was overall a decent watch."
    },
    {
      "rating": "5",
      "text": "Creature horror, Antlers, moody aesthetic captures the essence of the film's promising premise. The acting and production are substantial enough to outweigh the inflated plot, but it can't overcome the mismanaged creature reveal and on-screen thrills."
    },
    {
      "rating": "9",
      "text": "This movie was great. I must tell if you go to see this and except a hack n slash film. It’s not but it has a wonderful story. Plenty of gore and just good acting. A real must watch."
    },
    {
      "rating": "8",
      "text": "Movie really does a great job in every aspect never really feels like it’s lacking and tackles a very touchy subject of abuse rather than just focusing on the wendigo story itself and the cinematography along with cast do a spectacular job as well !"
    },
    {
      "rating": "3",
      "text": "It’s bad. Like, boring and confusing bad. I can’t see how all but the most hungry creature-feature fans will enjoy it…"
    },
    {
      "rating": "10",
      "text": "I have been a horror film buff from childhood, and consider this film a classic from beginning to end, although perhaps not a personal favorite (time will tell). The young boy caught up in all the horror was completely believable, and a child of his age is next to impossible to cast as the focus of a horror film. The terror was very natural and not full of cleverness, so it always seemed genuine. The rest of the cast was convincingly rural and naive, and so their personal reactions also seemed genuine. And the gore was never  gratuitous, but an integral part of the film."
    },
    {
      "rating": "6",
      "text": "Ok movie. Acting wasn’t great. looking at you Jesse Plemmons. conclusion wasn’t that satisfying. it’s just really straight forward. No twists or turns. it just goes from point a to point b and then it ends"
    },
    {
      "rating": "5",
      "text": "Even with all the respect I have for Guillermo del Toro, when I read his name announced in big letters as a producer, frankly it worries me.Many of the horror films he has produced are actually bad.Now from the beginning you can see why he wanted to produce this film.A horror story with folk overtones and a strange creature in the middle of it all.That has Del Toro's style all over the place, but the most surprising thing of all, is that even with the good reputation of its director, Antlers simply never comes to life.Visually I cannot criticize it for anything. You can actually see the director's hand in that regard, especially in the third act.But to get there you need to burn some good 70 minutes that are slowly consumed in a story that doesn't manage to build itself up in the best way."
    },
    {
      "rating": "2",
      "text": "It's Halloween week, and so I had to go see at least one of the horror movies that released this week. I had the displeasure of watching, Antlers. Antlers depicts an isolated Oregon town, whose land seems to have a dark secret - a diabolical spirit who comes back to wreak havoc in the community. Can a a middle-school teacher and her sheriff brother save the town? Shock and awe. Oh, I can't wait to slam this movie.Typically, I do not do this even to bad movies, but this movie was shockingly awful. There is only one positive in that the concept of this is weird, but, unfortunately, the execution is just subpar. It's one of those movies where the production is legitimate, there are actors who have true acting ability, and yet the final product is just so lifeless. This movie's plot is only made worse by the lame subplot of the main characters trying to protect a kid because he reminds them of themselves. The CGI was a bad. The movie only had maybe two scares or jump scares at max. The story felt so pointless and insignificant that I question just how bad this movie was prior to editing. No, seriously, the producers, directors, editors, etc. Looked at this final product and said, \"Yep, that's the one\". Uh, no sir it is not! They had to have cut out something of quality. Show me the deleted scenes! Somebody Snyder or Rob Zombie cut this movie. We have a \"diabolical spirit\" that we literally see for maybe two minutes. You read that correctly. Two minutes of the big bad actually being big and bad. They left you to imagine what this creature was going to look like in it's full glory the rest of the time, but it doesn't even pay off, except for 10 seconds of its face. I mean who really makes a movie about a scary thing and 92% of the movie it's not even in full effect. We had to look at the creature developing for a solid 20 minutes and while a little gross it was basically the morphing of the bad guy (Hector Hammond) in Green Lantern when he had Paralax growing in him. I'll hop off that and go back to how boring the storyline was. Basically, this stinky kid in school, who draws scary pics, has a teacher that notices that something is wrong but no one else cares at all, so she follows up. THAT'S LITERALLY IT. The mystery is no one cares about this kid! They touched on abuse and neglect, but they never explored it. Do people not know how to play on fears anymore?! Honestly, I'm not even sure how this movie lasts the entire runtime. How did Keri and Jesse sign on to this movie? Ok, I'm done and you should be too. (Side note: if someone's house stinks really bad when you enter it, just don't go in.)Needless to say, Antlers is not worth watching in the theaters at all. It’s not scary, the storyline goes nowhere, the little bit of goriness doesn’t begin to save this movie. This is an un-popped kernel of corn at best for the theaters. Do not not waste your time or money on this BUT if this were to come to Tubi and you are severely bored 3 years from now, then maybe watch it. Legitimately the trailers were better than the movie."
    },
    {
      "rating": "10",
      "text": "Watching it at the theater was a good experience. Although few jumpscares they still managed to scare me. The atmosphere is the best part though."
    },
    {
      "rating": "2",
      "text": "This was a pretty good movie.  The story is kind of crazy, but once it gets going, the suspense builds and we wonder what on earth is going on.  The performances are good and the plot is too.  We enjoyed it.  It is a bit gory in places, but not over the top like Halloween Kills."
    },
    {
      "rating": "1",
      "text": "(Mauro Lanari)Cooper hopes his several ideas would somehow stick and \"Antlers\" strives to be a supernatural horror rooted in indigenous folklore, an allegory about unresolved trauma, drug addiction and child abuse, and also an environmental parable, all at the same time, but the attempt saying too many things ends up not saying anything clear enough."
    },
    {
      "rating": "4",
      "text": "this movie wants to be deep but it's so bland that the themes have no real emotional depth, the atmosphere is good but not enough horror to actually be considered scary.this should have been released on streaming instead of pushing it back multiple times waiting for a theatrical release, i'm very disappointed with this film because it was one of my most anticipated movies of the year and to be honest it really wasn't worth the wait.↓ point rating ↓6.4 out of 12 = 53%⚡️ acting - 0.6⚡️ cinematography - 0.6⚡️ costume design - 0.5⚡️ directing - 0.5⚡️ film editing - 0.5⚡️ makeup & hairstyling - 0.7⚡️ music - 0.5⚡️ production design - 0.5⚡️ score - 0.6⚡️ sound design - 0.6⚡️ visual effects - 0.4⚡️ writing - 0.4"
    },
    {
      "rating": "0",
      "text": "Biggest disappointment of the year and one of the worst films of 2021. Acting is atrocious"
    },
    {
      "rating": "4",
      "text": "this movie wants to be deep but it's so bland that the themes have no real emotional depth, the atmosphere is good but not enough horror to actually be considered scary.this should have been released on streaming instead of pushing it back multiple times waiting for a theatrical release, i'm very disappointed with this film because it was one of my most anticipated movies of the year and to be honest it really wasn't worth the wait.↓ point rating ↓6.4 out of 12 = 53%⚡️ acting - 0.6⚡️ cinematography - 0.6⚡️ costume design - 0.5⚡️ directing - 0.5⚡️ film editing - 0.5⚡️ makeup & hairstyling - 0.7⚡️ music - 0.5⚡️ production design - 0.5⚡️ score - 0.6⚡️ sound design - 0.6⚡️ visual effects - 0.4⚡️ writing - 0.4"
    },
    {
      "rating": "5",
      "text": "Meh  !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!"
    },
    {
      "rating": "6",
      "text": "'d been led to believe (by a certain film critic, one Mark Kermode) that this isn't so much a horror type film but more of a bizarre mystery film and I'd have to disagree - while this doesn't feature tons of explicit gore, its more horror based than mystery based I'd say and that's fine but I didn't really feel there was much in the way an intriguing storyline and the mystery was probably what was meant to be going on. Most of the scenes are set in the dark and we do see the monster, if only briefly at times but it could scare more squeamish people I suppose. I don't think I fully followed the storyline properly to be honest. Its got a bit of a spooky folktale feel to it and indeed I wasn't entirely surprised to see GdT (Guillermo del Toro) credited as a producer. I suppose it has a sort of urban type horror feel to it, like Pan's Labyrinth.I didn't feel this was an entirely memorable film as such, so I wouldn't recommend it, no."
    },
    {
      "rating": "8",
      "text": "Good story, good cast. It's enjoyable.'Antlers' sets the right tone throughout and delivers in serving up a satisfactorily creepy flick. Keri Russell, Jesse Plemons and youngster Jeremy T. Thomas all give strong performances, they make for an interesting trifecta to watch - even if they aren't as fully fleshed out ss they could've been.The horror aspects are done really well, as expected with Guillermo del Toro involved behind the scenes along with director Scott Cooper & Co. I also love films that make the locations come alive, where the place feels lived in and gritty, and this passes that particularly test with flying colours in my eyes.As usual with the genre, a follow-up is seemingly set at the end - which I'd be up for, sure, though do feel like this being a one-and-done would fit better - but we'll see."
    },
    {
      "rating": "6",
      "text": "Two guys running a meth lab in an abandoned mine get attacked by something, killing one and turning the other into some sort of feral creature that his son locks in a room and feeds raw meat before his teacher starts to worry about him."
    },
    {
      "rating": "7",
      "text": "Loved the tone, cinematography, atmosphere and practical effects. If you look at it as a monster movie or creature feature, it's good because it starts out strong and does a mighty fine job of reeling you in that way.HOWEVER, I wish it would have stuck more closely with the horror and mystery elements and left the drama in the background. The movie shoots itself in the foot when it gets bogged down with cheap tropes and the family drama dynamic between Keri Russell and Jessie Plemmons character.I liked the film, it didn't turn out as good as I expected it would be and it's not as disposable as I thought it would be. I think with better screenwriting and more focus on the horror/mystery of the Wendigo that this could have been a little better as a film."
    }
  ],
  "recommendations": [
    "the_ritual",
    "the_woman_in_black",
    "the_descent",
    "it_follows",
    "annabelle",
    "the_conjuring",
    "dark_skies",
    "the_haunting_in_connecticut_2_ghosts_of_georgia",
    "mirrors",
    "the_witch",
    "scary_stories_to_tell_in_the_dark",
    "sinister_2",
    "the_unholy",
    "the_possession",
    "ouija_origin_of_evil",
    "cube",
    "the_conjuring_2",
    "insidious_chapter_2",
    "lights_out",
    "eli",
    "the_conjuring_the_devil_made_me_do_it",
    "you_should_have_left",
    "insidious_chapter_3",
    "the_lodge",
    "event_horizon"
  ]
}