{
  "id": 3350,
  "title": "Antz",
  "starring": [
    "Woody Allen",
    "Sharon Stone"
  ],
  "runtime": 83,
  "genre": [
    "Adventure",
    "Animation",
    "Comedy",
    "Family"
  ],
  "description": "A neurotic worker ant in love with a rebellious princess rises to unlikely stardom when he switches places with a soldier. Signing up to march in a parade, he ends up under the command of a bloodthirsty general. But he's actually been enlisted to fight against a termite army.",
  "releaseYear": "1998",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/lWPjxbUMpAHFkJpZHHNWhQaRsax.jpg",
  "categories": {
    "plot": 6.151515151515151,
    "acting": 6.071428571428571,
    "ending": 3.6666666666666665,
    "soundtrack": 8.0,
    "cinematography": 5.0,
    "familyFriendly": 5.538461538461538,
    "funny": 6.3125,
    "action": 8.5
  },
  "reviews": [
    {
      "rating": "9",
      "text": "For a dreamworks animation production, there is a lot of profanity, but incredibly funny nonetheless."
    },
    {
      "rating": "10",
      "text": "Alright, if you all really think this is not for youngsters, well that depends on what they think. I first saw this when I was 8 and this was the type of animated entertainment of action and violence I looked forward to. Besides, you have to find Antz sense of humor and language entertaining and the story is 83 minutes of amusingly menacing action!"
    },
    {
      "rating": "8",
      "text": "Overall I really like Antz. For a first film this is really good. What makes this film stand out is the fact that the film takes its audience seriously and does not dumb itself down for the sake of appealing to kiddies. The film is gritty and has interesting message. Plus, it has likeable, interesting, and realistic characters who while insects are human in their personality. This film showed the world what Dreamworks could do that Disney and Pixar did not at the time. They were not afraid to make something edgy and was more for kids than adults. This film has great writing and sophistication that puts it above a lot of animated films both at the time and even today, including some of Dreamworks’ recent films. As a result, Antz is a great flick that I highly recommend checking out. As you get older and older you develop a greater appreciation for it and I am definitely going to see it again in the future."
    },
    {
      "rating": "8",
      "text": "Antz is often compared to, or accused of ripping off another ant-based animation released in the same year. Yes, DreamWorks Animation came into existence when former Disney chairman Jeffrey Katzenberg left the House of Mouse to form his own studio, and he might have retained some of the ideas being batted around at Disney for his own use, but no matter who copied who, and who was in the right and wrong, the fact remains that Antz is a far superior film to A Bug's Life. The story is engaging, the characters are likeable (Woody Allen as the neurotic dreamer Z is perhaps the closest he will ever come to being endearing on screen) and the jokes are plentiful, inventive, and more importantly, funny. The animation is first-rate by the standards of 1998, and nearly 15 years on it is only just starting to look its age (the water effects, notably, no longer hold up). Despite some aspects of the animation looking dated, others still look great - the ant crowd scenes and the film's set pieces remain impressive, particularly the sequence where the soldier ants march to war against the termites. Despite the odd cosmetic wrinkle, Antz remains a hugely enjoyable film, with great vocal performances from Allen, Stone, Stallone, Hackman and Walken, great gags, a memorable soundtrack from John Powell and Harry Gregson-Williams and some often beautiful visuals. Its also one of the most simply effective films about social class and identity ever made - what better allegory for an oppressive class system and a lack of individuality is there than an ant colony? Not only does it impress on its own terms as an animated film, but it paved the way for the likes of Shrek, Kung Fu Panda and How to Train Your Dragon, all among the best examples of animated filmmaking of the last decade. DreamWorks has been encroaching on Disney's success for a long time, and have occasionally managed to surpass their rivals, something which could never have occurred were it not for this groundbreaking little film about an ant who dreamed of standing out."
    },
    {
      "rating": "3",
      "text": "I hated when i discovered this and watching it, the film is stupid, boring, dumb, lame, but mostly  this is really bad. The script is awful with a lot of cliches and lame dialog, the characters are boring and uninteresting, the humor is not funny, the animation sucks, the message is bad revived and the climax is the most terrible climax i ever seen. For other side, some takes for the animation are OK, the voice acting it´s fine and there are some jokes than i got a little laugh. Overall, Antz is a really bad movie. I don´t understand why people love this, is a ripoff of A Bugs Life, only that is worse. The only thing that i can define this is as just an \"Inzignificant\" DreamWorks movie."
    },
    {
      "rating": "3",
      "text": "A violent and gross \"kids\" movie with bad animation and a boring plot. Don't waste your time."
    },
    {
      "rating": "7",
      "text": "Simple yet astonishing..."
    },
    {
      "rating": "8",
      "text": "Who knew? Woody Allen leading an ant regime to democracy? Interesting. Also shows how individualism can be beneficial to a community, and the value of choice in your life."
    },
    {
      "rating": "5",
      "text": "In 1995, the very first computer-animated film came out: Toy Story. It got universal acclaim, and was the highest-grossing film of the year. Worldwide. Then in 1998, there's this. In terms of style, Antz is a huge departure from Toy Story. There is an astounding amount of profanity for a CGI film, there's a lot of violence, and it is implied that one of the soilder ants r**** another ant (so says imdb). Toy Story is a fun film for the whole family. This is not.\rThis idea is not original. A former Disney employee, during production of A Bug's Life, left and took the story with him. His name was Jeff Katzenburg. I think that's the guy who almost led Toy Story into ruins. See the Black Friday Reel of Toy Story. Then you'll know what I'm talking about . So the guy who I THINK almost made Toy Story a horrible film went to Dreamworks and created \"Antz\" a more violent, less family-friendly \"A Bug's Life\" with termites instead of grasshoppers. And I really think kids should not be hearing the swear words said in the movie , especially the b word. Well, at least the producers knew better then to put the f-bomb. There are good things about this movie. It made CGI water possible. And Woody Allen's in it. That's a good thing. And the ants look more realistic than they do in \"A Bug's Life\".  There are several other good things about this movie, but I don't feel like saying them. This movie is uneven yet watchable. Luckily, Dreamworks redeemed itself in 2001, with the hilarious film called \"Shrek\"."
    },
    {
      "rating": "7",
      "text": "Antz is a bit overrated, but it's nevertheless good-hearted family fun with some surprisingly mature themes so that adults won't find it too boring. As a kids movie, it works, as entertainment in general, it's pretty good."
    },
    {
      "rating": "4",
      "text": "In 1995, the very first computer-animated film came out: Toy Story. It got universal acclaim, and was the highest-grossing film of the year. Worldwide. Then in 1998, there's this. In terms of style, Antz is a huge departure from Toy Story. There is an astounding amount of profanity for a CGI film, there's a lot of violence, and it is implied that one of the soilder ants r**** another ant (so says imdb). Toy Story is a fun film for the whole family. This is not.\rThis idea is not original. A former Disney employee, during production of A Bug's Life, left and took the story with him. His name was Jeff Katzenburg. I think that's the guy who almost led Toy Story into ruins. See the Black Friday Reel of Toy Story. Then you'll know what I'm talking about . So the guy who I THINK almost made Toy Story a horrible film went to Dreamworks and created \"Antz\" a more violent, less family-friendly \"A Bug's Life\" with termites instead of grasshoppers. And I really think kids should not be hearing the swear words said in the movie , especially the b word. Well, at least the producers knew better then to put the f-bomb. There are good things about this movie. It made CGI water possible. And Woody Allen's in it. That's a good thing. And the ants look more realistic than they do in \"A Bug's Life\". There are several other good things about this movie, but I don't feel like saying them. This movie is uneven yet watchable. Luckily, Dreamworks redeemed itself in 2001, with the hilarious film called \"Shrek\"."
    },
    {
      "rating": "8",
      "text": "A purely enjoyable comedy for both adults and children. I laughed at the jokes and the actors that are in the film are great. A very good film that I liked."
    },
    {
      "rating": "5",
      "text": "I cannot say I preferred it to A Bug's Life at all, but it does have something special to it--perhaps it is rooted in the incredible voice cast and pop standards."
    },
    {
      "rating": "5",
      "text": "This isn't a children's film; nor is it much of an adult's film either. You'll snicker, you might be mildly entertained, but, in the end, you won't know what to make of it."
    },
    {
      "rating": "8",
      "text": "I enjoy this movie, better than Bug's life and Bee movie. Good story, characters, perfect casting choice, and animation."
    },
    {
      "rating": "5",
      "text": "Swearing in a children's film is frowned upon by most parents. The movie was nothing special, just another misfit  bug with a hopeless crush on the colony's princess, resembling \"A Bug's Life\" slightly."
    },
    {
      "rating": "9",
      "text": "Before DreamWorks Animation became a household name with \"Shrek,\" the company's first CGI film was \"Antz.\" While there's still debate over whether or not this or \"A Bug's Life\" is better, the ultimate point is that \"Antz\"is funny, well-animated, entertaining, well-acted, and all-around likable. By DreamWorks' standards, the film is pretty underrated, and I've got to say, if you haven't seen it yet, make it a point to check it out!"
    },
    {
      "rating": "6",
      "text": "Althought Antz is sweet and funny, it unfortunately lacks that depth and remarkable sense of warmth that makes the Pixar films so wonderful and rewatchable."
    },
    {
      "rating": "8",
      "text": "Decent animation, cool characters, and an interesting story, I wouldn't say that it's a masterpiece of a movie but it's still a fun watch for everyone."
    },
    {
      "rating": "9",
      "text": "When one ant becomes disenfranchised from the totalitarian work regime of his colony, he adventures off to lands unknown with the colony's princess..."
    },
    {
      "rating": "7",
      "text": "Many adult themes are presented in this film; that's what makes it great. The story itself is a good and keeps the audience engaged. This isn't your typical animated film. It's dark, violent, and at times even depressing. It's more deep and not very childish, but that is what makes it stand out."
    },
    {
      "rating": "8",
      "text": "In the Magic Kingdom, they must be getting nervous. For years, Disney has had a death grip on the animated market, but, as we enter the latter years of the 1990s, the corporation that gave us Bambi and Snow White is finding their dominance challenged. Fox's Anastasia was actually better than last year's Disney animated film, Hercules. And now, as the Mousketeers prepare the bring the computer-generated feature A Bug's Life to the screen, Dreamworks has engineered a preemptive strike by launching its own computer-animated insect epic, Antz, two months earlier.\r Antz, which had its world premiere on September 19, 1998 as the Closing Gala Selection for the 23rd annual Toronto International Film Festival, is a very good movie, no matter how you look at it. Visually, it's more impressive than Disney's Toy Story, the pioneer in this burgeoning genre. On a script level, it was developed as much with a mature audience in mind as with the usual pre-pubescent crowd. A significant helping of Antz's humor will go over the heads of the average under-12 viewer. Image-conscious adults should not feel embarrassed about sitting through this \"kids' movie.\" The big-name vocal cast is expertly-selected. Where else can you find Woody Allen, Sylvester Stallone, Anne Bancroft, Christopher Walken, Sharon Stone, and Gene Hackman in the same film?\r Adults and children alike will be awestruck by Antz's impressive production design. This animated effort has texture and depth. Great care is taken to make the inside of the colony a place of majestic spectacle and bustling activity. You can see this movie several times and still notice new things. The characters are wonderfully rendered, with a complete gallery of facial expressions. Antz takes the visual strengths of Toy Story and improves upon them.\r Story-wise, there's nothing here that is likely to confuse younger viewers. The basic plot is a cross between an adventure and a \"Taming of the Shrew\" romantic comedy. Or, as Z puts it, Antz is \"your basic boy meets girl, boy likes girl, boy changes underlying social structure\" tale. The dialogue is consistently smart, and has not been diluted to enable underage audience members to comprehend every line. Most children aren't going to understand Z's comment that a better alternative to war with the termites might be to \"try influencing their political process with campaign contributions,\" but almost every adult in the theater will get a hearty laugh out of such an observation. A significant portion of Antz's comedy is like this.\r The characters, despite their only vaguely humanoid appearance, are instantly likable. Allen plays Z like an insect version of his well-established screen persona. Stone's Bala is strong-willed and appealing, with a hard side the emerges from time-to-time. Hackman is deliciously malevolent as a megalomaniacal general. And Sylvester Stallone is solid as Z's burly, dim-but-loyal friend. Other voices include Christopher Walken as the general's second-in-command, Anne Bancroft as the ant queen, Dan Aykroyd as a snobbish yellowjacket, and Jennifer Lopez as Weaver's love interest.\r It's too early to compare Antz to A Bug's Life, but, for anyone who appreciates animated films (especially those of the computer-generated variety), the late months of 1998 promise a bumper crop. As the first production out of the gate, Antz gets things off to a positive start. Successful as an adventure, a surprisingly sophisticated comedy, a light romance, and a visual treat, there are few things that Eric Darnell and Tim Johnson's feature debut does not do. If Disney is worried, perhaps they have a reason to be. The bar has just been raised, but not by them."
    },
    {
      "rating": "8",
      "text": "it's a great Dreamworks movie with a great message, I enjoy it a lot it feels a little downgrade to the other ant's film but overall an entertaining movie of the 90s."
    },
    {
      "rating": "7",
      "text": "The animation may not be Pixar-standard but thanks to Woody Allen's  vocal performance and the adult in-jokes, Antz is still pretty entertaining, and a good first effort from Dreamworks. Woody Allen works his magic and pretty much all of his jokes made me laugh. I would recommend that if you have very young children, you should probably watch it with them because there is quite a bit of adult humour (the word \"erotic\" is actually used at one point but it's said very quickly so you're kids will most likely ignore it). Fun movie, recommended for Dreamworks fans and Woody Allen fans."
    },
    {
      "rating": "7",
      "text": "Even though this came out before A Bug's Life, it feels like some sort of copy of it. Otherwise, Antz is just there to remind you about the story of ants."
    },
    {
      "rating": "8",
      "text": "Boasting the wit and lunatic verve of an old Woody Allen film, smoothly combined with the space-age visuals of Toy Story, Antz is wasted on kids. This astonishing computer-generated cartoon hits home on so many levels: it's a mix of Metropolis (breathtaking cityscapes), Starship Troopers (ants attacking termites which are five times their size and spray acid from their fore-heads), A Life Less Ordinary (kidnapping) and Sleeper (vintage Allen comedy).\r On the one hand, it's a simple romantic tale of boy ant meets girl ant. But on the other, this sharply scripted micro-adventure is a celebration of the self and a condemnation of conformity, repression and dictatorship. More sophisticated than your average 'toon, Antz also shuns the slushy Disney sing-along route. Single-digit brats may think the pictures are pretty, but they aren't going to get most of the references.\r And that's their loss. For the rest of us, Antz shapes up as one of the most fantastic, enjoyable movies you'll see this year, - so much so, we defy you to watch it without a huge grin on your face. Obviously, as the first computer-generated movie made since Toy Story, DreamWorks' insectoid cartoon had a lot to live up to. But using 120,000 animation frames bolted together by effects specialist Pacific Data Images, the studio has weaved a lively story, cutting-edge visuals, and the voice-over talents of a superb cast into a funny, charming, often gobsmacking movie. Where else could you watch an action adventure which stars Sylvester Stallone as Woody Allen's best friend?\r What immediately impresses is the quality of the script. The first five minutes is such a rush of visual and verbal gaggery that you wonder if the movie can sustain it. \"You know,\" says the neurotic Z (Allen) as he reclines on an ant-therapist's leaf, \"when you're the middle child in a family of five million you just don't get any attention...\" It's just the start of a quickfire stand-up routine, an onslaught of hilarious ant jokes from: \"I have trouble lifting 10 times my own body weight...\" to: \"I've got to believe there's some better place for me, otherwise I'll just curl up into a larval position and weep.\"\r Antz is Allen's film, with the diminutive star personalising his lines to suit his stammering delivery (\"I don't stare death in the face, I stand behind it and make belittling comments\"). Stallone (as Weaver), Sharon Stone (as Princess Bala), Christopher Walken (a snidey evil sidekick) and Jennifer Lopez (as Azteca) are good. Gene Hackman's hissing, tyrannical General Mandible is even better. But nothing can come close to Allen's performance. This is his best offering since Manhattan.\r Then there's the dazzling CG animation. PDI's box of digital tricks has conjured up a gosh-wow subterranean world of enormous detail. The panoramic vistas of the colony, with millions of ants moving about, is an incredible sight. It's a bug's eye view of the world: from ant bar brawls and social revolution to becoming trapped inside the surface tension of a water droplet, Antz takes you on a fantasy ride that a live-action movie couldn't hope to match without a $200-million budget.\r It's pacy, always funny and populated by characters that you can identify with and care about (all gloriously textured and defined, right down to the lip-sync). Antz builds with each wonderful scene (the grisly ant-attack on the termites, the stirrings of discontent among the worker ants) to a thrilling finale.\r An irresistible mix of simple story and delicious CG eye-candy mean this mandibled masterpiece will entertain children and adults alike. Rival ant-pic A Bug's Life (from Toy Story creators Pixar) will have to be truly phenomenal to better this.\r There's absolutely nothing wrong with this. It's the perfect blend of story, action and a stupendous cast, an 83-minute long special effect that's so visually stimulating and hilarious you'll want to see it even if you don't have kids. You must see Antz. It's a blast."
    },
    {
      "rating": "5",
      "text": "The film just only clocks about an hour and a half. But its plot, scenes and characters are as not as good as A Bug's Life but still, probably good after all."
    },
    {
      "rating": "8",
      "text": "Close Encounters of the 'Antz' Kind.\r While \"Babe\" made you want to give up bacon, \"Antz\" will make you reach for the Raid.\rThe first of two computer ant-imated features for fall, this little flick from DreamWorks is beating Disney's \"A Bug's Life\" to the screen by several weeks.\r Although the movies share similar story lines – idiosyncratic ant saves the hill from enemy hordes – Disney's bugs look funnier, funkier and more traditionally cartoonish than the more authentically drawn arthropods of \"Antz.\"\r The animation might not have been such a problem, however, if these creepy crawlies had more appealing character traits. Cuddly they aren't. These critters look more like those big-eyed, Gumby-like gray aliens\r On the other hand, the anthill itself is a spectacularly animated series of caverns, a subterranean realm humming with industry. The scene, like some aspects of the story, recalls \"Metropolis,\" a social allegory about a tyrannical ruling class and the workers who toil in the totalitarian underground.\r In \"Antz,\" the Queen (regally voiced by Anne Bancroft), Princess Bala (voiced by Sharon Stone) and their courtiers lounge about in the upper realms, while the drones, workers and soldiers labor in the tunnels deep below.\r It is the Ant Way, and most accept the system, which has served the species so well lo these thousands of years. But not Z (voiced by Woody Allen), the neurotic, nattering, narcissistic exception.\r Allen, as an ant in analysis, is frankly more annoying than amusing. Without those owlish eyes so bewildered behind those horn rims, that scrawny body and the rest of the preposterous package, Allen is just another whiner.\r But then he hasn't got much to work with in this self-serving, product-plugging wisp of a script. It's surely not aimed at children, given its grotesque battle scenes, which might have been modeled on those between the Nazi youth and outer space bugs in \"Starship Troopers.\"\r And an ant blathering on his wee analyst's couch seems equally unlikely to appeal to youngsters who tend to crack up at the gas-passing slapstick of the comic duo in \"The Lion King.\" Hakuna matata.\r Sorry, \"Antz\" has no show-stopping song and dance numbers, no catchy melodies and no love songs either. The score, made up of old standards, does, however, enhance one of the movie's wittier episodes.\r It takes place in a blue-collar bar, where ants dance in happy conformity to the strains of \"Guantanamera,\" while that anarchist Z and his partner (Princess Bala in disguise) improvise. Can a workers' uprising be far behind? For whatever ill-conceived reasons, the material is obviously tilted toward grown-ups. But it's hard to believe that adults will be drawn to a cartoon about an ant no matter how remarkable his accomplishments.\r Stone brings all the enthusiasm of a guest at a roach motel to the role of Bala, the sort of gal who'd really rather be shopping for a tiara than changing the world. Further, she and Allen aren't quite on the same page. Perhaps Allen's Z would be more interested in a larva than a sophisticated lady bug such as she.\r Sylvester Stallone's beefy soldier ant and Jennifer Lopez's gum-popping worker are the most amiable of this all-star ensemble, which also includes Jane Curtin and Dan Aykroyd as WASPy wasps (har-de-har-har), Danny Glover as an infantryman who takes Z under his wing, and John Mahoney as a drunk who claims to have visited the mythical land of Insectopia.\r The real live bugs captured in the French film \"Microcosmos\" were infinitely more fascinating than these thin constructs. Even the dung beetle earned our respect as he worried his precious pooh ball up and over a twig that for it was a veritable Sequoia log.\r Actually, that industrious little fellow is far more heroic than Z, who is not only a slacker at work, but also a coward who takes credit for undeserved bravery. Things like this violate the first commandments of fairy-tale movies: The protagonist must learn a moral lesson in the end.\r Perhaps we'll get back on track with \"A Bug's Life,\" since Disney is well aware of the genre's demands and remains unsurpassed in the animated arena. The studio's toonsmiths know that kids want to be scared, but that henchmen must be boobs right out of \"101 Dalmatians\" and criminal masterminds as ludicrously improbable as Cruella de Vil.\r Beyond that, the material better be magical. \"Antz\" isn't.\r Eric Darnell, noted for his commercials, and Tim Johnson, who directed the 1995 Halloween special of \"The Simpsons,\" are short on abracadabra. Their sluggish pacing hardly reflects the hustle and bustle of an anthill."
    },
    {
      "rating": "8",
      "text": "The entry opus of Dreamworks is admissible, about a neurotic, overwhelmed and bored ant who became the ant of the hour. The voice casting is attractive and backbone of the movie, which humor is half for kids, half for adults, with no explicit or vulgar jokes."
    },
    {
      "rating": "5",
      "text": "In 1995, the very first computer-animated film came out: Toy Story. It got universal acclaim, and was the highest-grossing film of the year. Worldwide. Then in 1998, there's this. In terms of style, Antz is a huge departure from Toy Story. There is an astounding amount of profanity for a CGI film, there's a lot of violence, and it is implied that one of the soilder ants rages another ant (so says imdb). Toy Story is a fun film for the whole family. This is not. This idea is not original. A former Disney employee, during production of A Bug's Life, left and took the story with him. His name was Jeff Katzenburg. I think that's the guy who almost led Toy Story into ruins. See the Black Friday Reel of Toy Story. Then you'll know what I'm talking about . So the guy who I THINK almost made Toy Story a horrible film went to Dreamworks and created \"Antz\" a more violent, less family-friendly \"A Bug's Life\" with termites instead of grasshoppers. And I really think kids should not be hearing the swear words said in the movie , especially the b word. Well, at least the producers knew better then to put the f-bomb. There are good things about this movie. It made CGI water possible. And Woody Allen's in it. That's a good thing. And the ants look more realistic than they do in \"A Bug's Life\". There are several other good things about this movie, but I don't feel like saying them. This movie is uneven yet watchable. Luckily, Dreamworks redeemed itself in 2001, with the hilarious film called \"Shrek\"."
    },
    {
      "rating": "0",
      "text": "Antz is a movie that re-defines the word, \"suck\", for nearly eighty minutes. I watched this movie on DVD (so glad I didn't waste money to see this in the theater) and by the first quote was by a jerk named Zee. I knew this was going to suck. Like how The Wild made Madagascar look bad, Antz makes A Bug's Life look bad. EXTREMELY BAD!! I don't know how this happened but a few weeks ago, I felt like watching it again. But then the DVD was severely scratched. SO HAPPY! The movie offers no heart and the humor is so dry and bad. Even the voice acting is bad! This marks as the worst DreamWorks animated film I ever saw. Rent Shrek, Sinbad, El Dorado, Shark Tale or Spirit instead of this."
    },
    {
      "rating": "5",
      "text": "In 1995, the very first computer-animated film came out: Toy Story. It got universal acclaim, and was the highest-grossing film of the year. Worldwide. Then in 1998, there's this. In terms of style, Antz is a huge departure from Toy Story. There is an astounding amount of profanity for a CGI film, there's a lot of violence, and it is implied that one of the soilder ants rages another ant (so says imdb). Toy Story is a fun film for the whole family. This is not. This idea is not original. A former Disney employee, during production of A Bug's Life, left and took the story with him. His name was Jeff Katzenburg. I think that's the guy who almost led Toy Story into ruins. See the Black Friday Reel of Toy Story. Then you'll know what I'm talking about . So the guy who I THINK almost made Toy Story a horrible film went to Dreamworks and created \"Antz\" a more violent, less family-friendly \"A Bug's Life\" with termites instead of grasshoppers. And I really think kids should not be hearing the swear words said in the movie , especially the b word. Well, at least the producers knew better then to put the f-bomb. There are good things about this movie. It made CGI water possible. And Woody Allen's in it. That's a good thing. And the ants look more realistic than they do in \"A Bug's Life\". There are several other good things about this movie, but I don't feel like saying them. This movie is uneven yet watchable. Luckily, Dreamworks redeemed itself in 2001, with the hilarious film called \"Shrek\"."
    },
    {
      "rating": "5",
      "text": "In 1995, the very first computer-animated film came out: Toy Story. It got universal acclaim, and was the highest-grossing film of the year. Worldwide. Then in 1998, there's this. In terms of style, Antz is a huge departure from Toy Story. There is an astounding amount of profanity for a CGI film, there's a lot of violence, and it is implied that one of the soilder ants rages another ant (so says imdb). Toy Story is a fun film for the whole family. This is not. This idea is not original. A former Disney employee, during production of A Bug's Life, left and took the story with him. His name was Jeff Katzenburg. I think that's the guy who almost led Toy Story into ruins. See the Black Friday Reel of Toy Story. Then you'll know what I'm talking about . So the guy who I THINK almost made Toy Story a horrible film went to Dreamworks and created \"Antz\" a more violent, less family-friendly \"A Bug's Life\" with termites instead of grasshoppers. And I really think kids should not be hearing the swear words said in the movie , especially the b word. Well, at least the producers knew better then to put the f-bomb. There are good things about this movie. It made CGI water possible. And Woody Allen's in it. That's a good thing. And the ants look more realistic than they do in \"A Bug's Life\". There are several other good things about this movie, but I don't feel like saying them. This movie is uneven yet watchable. Luckily, Dreamworks redeemed itself in 2001, with the hilarious film called \"Shrek\"."
    },
    {
      "rating": "5",
      "text": "In 1995, the very first computer-animated film came out: Toy Story. It got universal acclaim, and was the highest-grossing film of the year. Worldwide. Then in 1998, there's this. In terms of style, Antz is a huge departure from Toy Story. There is an astounding amount of profanity for a CGI film, there's a lot of violence, and it is implied that one of the soilder ants r**** another ant (so says imdb). Toy Story is a fun film for the whole family. This is not. This idea is not original. A former Disney employee, during production of A Bug's Life, left and took the story with him. His name was Jeff Katzenburg. I think that's the guy who almost led Toy Story into ruins. See the Black Friday Reel of Toy Story. Then you'll know what I'm talking about . So the guy who I THINK almost made Toy Story a horrible film went to Dreamworks and created \"Antz\" a more violent, less family-friendly \"A Bug's Life\" with termites instead of grasshoppers. And I really think kids should not be hearing the swear words said in the movie , especially the b word. Well, at least the producers knew better then to put the f-bomb. There are good things about this movie. It made CGI water possible. And Woody Allen's in it. That's a good thing. And the ants look more realistic than they do in \"A Bug's Life\". There are several other good things about this movie, but I don't feel like saying them. This movie is uneven yet watchable. Luckily, Dreamworks redeemed itself in 2001, with the hilarious film called \"Shrek\"."
    },
    {
      "rating": "5",
      "text": "In 1995, the very first computer-animated film came out: Toy Story. It got universal acclaim, and was the highest-grossing film of the year. Worldwide. Then in 1998, there's this. In terms of style, Antz is a huge departure from Toy Story. There is an astounding amount of profanity for a CGI film, there's a lot of violence, and it is implied that one of the soilder ants rages another ant (so says imdb). Toy Story is a fun film for the whole family. This is not. This idea is not original. A former Disney employee, during production of A Bug's Life, left and took the story with him. His name was Jeff Katzenburg. I think that's the guy who almost led Toy Story into ruins. See the Black Friday Reel of Toy Story. Then you'll know what I'm talking about . So the guy who I THINK almost made Toy Story a horrible film went to Dreamworks and created \"Antz\" a more violent, less family-friendly \"A Bug's Life\" with termites instead of grasshoppers. And I really think kids should not be hearing the swear words said in the movie , especially the b word. Well, at least the producers knew better then to put the f-bomb. There are good things about this movie. It made CGI water possible. And Woody Allen's in it. That's a good thing. And the ants look more realistic than they do in \"A Bug's Life\". There are several other good things about this movie, but I don't feel like saying them. This movie is uneven yet watchable. Luckily, Dreamworks redeemed itself in 2001, with the hilarious film called \"Shrek\"."
    },
    {
      "rating": "5",
      "text": "In 1995, the very first computer-animated film came out: Toy Story. It got universal acclaim, and was the highest-grossing film of the year. Worldwide. Then in 1998, there's this. In terms of style, Antz is a huge departure from Toy Story. There is an astounding amount of profanity for a CGI film, there's a lot of violence, and it is implied that one of the soilder ants rages another ant (so says imdb). Toy Story is a fun film for the whole family. This is not. This idea is not original. A former Disney employee, during production of A Bug's Life, left and took the story with him. His name was Jeff Katzenburg. I think that's the guy who almost led Toy Story into ruins. See the Black Friday Reel of Toy Story. Then you'll know what I'm talking about . So the guy who I THINK almost made Toy Story a horrible film went to Dreamworks and created \"Antz\" a more violent, less family-friendly \"A Bug's Life\" with termites instead of grasshoppers. And I really think kids should not be hearing the swear words said in the movie , especially the b word. Well, at least the producers knew better then to put the f-bomb. There are good things about this movie. It made CGI water possible. And Woody Allen's in it. That's a good thing. And the ants look more realistic than they do in \"A Bug's Life\". There are several other good things about this movie, but I don't feel like saying them. This movie is uneven yet watchable. Luckily, Dreamworks redeemed itself in 2001, with the hilarious film called \"Shrek\"."
    },
    {
      "rating": "5",
      "text": "In 1995, the very first computer-animated film came out: Toy Story. It got universal acclaim, and was the highest-grossing film of the year. Worldwide. Then in 1998, there's this. In terms of style, Antz is a huge departure from Toy Story. There is an astounding amount of profanity for a CGI film, there's a lot of violence, and it is implied that one of the soilder ants rages another ant (so says imdb). Toy Story is a fun film for the whole family. This is not. This idea is not original. A former Disney employee, during production of A Bug's Life, left and took the story with him. His name was Jeff Katzenburg. I think that's the guy who almost led Toy Story into ruins. See the Black Friday Reel of Toy Story. Then you'll know what I'm talking about . So the guy who I THINK almost made Toy Story a horrible film went to Dreamworks and created \"Antz\" a more violent, less family-friendly \"A Bug's Life\" with termites instead of grasshoppers. And I really think kids should not be hearing the swear words said in the movie , especially the b word. Well, at least the producers knew better then to put the f-bomb. There are good things about this movie. It made CGI water possible. And Woody Allen's in it. That's a good thing. And the ants look more realistic than they do in \"A Bug's Life\". There are several other good things about this movie, but I don't feel like saying them. This movie is uneven yet watchable. Luckily, Dreamworks redeemed itself in 2001, with the hilarious film called \"Shrek\"."
    },
    {
      "rating": "5",
      "text": "In 1995, the very first computer-animated film came out: Toy Story. It got universal acclaim, and was the highest-grossing film of the year. Worldwide. Then in 1998, there's this. In terms of style, Antz is a huge departure from Toy Story. There is an astounding amount of profanity for a CGI film, there's a lot of violence, and it is implied that one of the soilder ants r**** another ant (so says imdb). Toy Story is a fun film for the whole family. This is not. This idea is not original. A former Disney employee, during production of A Bug's Life, left and took the story with him. His name was Jeff Katzenburg. I think that's the guy who almost led Toy Story into ruins. See the Black Friday Reel of Toy Story. Then you'll know what I'm talking about . So the guy who I THINK almost made Toy Story a horrible film went to Dreamworks and created \"Antz\" a more violent, less family-friendly \"A Bug's Life\" with termites instead of grasshoppers. And I really think kids should not be hearing the swear words said in the movie , especially the b word. Well, at least the producers knew better then to put the f-bomb. There are good things about this movie. It made CGI water possible. And Woody Allen's in it. That's a good thing. And the ants look more realistic than they do in \"A Bug's Life\". There are several other good things about this movie, but I don't feel like saying them. This movie is uneven yet watchable. Luckily, Dreamworks redeemed itself in 2001, with the hilarious film called \"Shrek\"."
    },
    {
      "rating": "6",
      "text": "A good movie, but very forgettable. The characters had great voice actors, so that was a plus. The story started good, and ended good, but the middle wasn't. The animation is also not perfect, but somewhere in the middle. It was good though, so I would say it was worth it to watch."
    },
    {
      "rating": "9",
      "text": "A unique animated film. Most animated films come with the tagline \"for adults and kids\", but this one truly fits that description. This is one of the darkest animated kids movieI think I've ever seen. From a brutal war scene, to insects getting squashed, and discussions of depression, Antz is so different from your typically animated film, and for that it shines. That's not even mentioning the stellar and deep voice cast, touching moments, and epic scale."
    },
    {
      "rating": "5",
      "text": "Antz is a good film, a good children's show, I wouldn't take my kid, but my nephews, sure, hope on.AntzDreamworks, looks like, is once again trying desperately to be part of a crowd. They are saying crowd cheering, obvious things. They are late, even by the animation standard. For the storytelling looks like a seen this seen that world that we've been a part of. A better one, to be honest. Still, there is a lot to pass your time merrily in this carnival. Easy going world, one dimensional characters and a heroic story. Usually, this comes as a curse. But for a kid's film- not that this should be an excuse- it comes in handy. Not a lot of films can achieve that standard bar perpetually so easily.Even that comes off effortful. To make an easy film, is no easy job. The conversation, especially concerning Woody Allen, seems improvisational here. Even in a voice over, he oozes that same fed up New Yorker in his language beautifully. The humor is mostly, as expected, the comparison of their world to ours, the references are slightly changed and we are told to rely upon these jokes.The world on the other hand is focused a lot on the unity amblem that these films have always carried, along with democracy, war and other major themes carried swiftly by these Antz, something that is 10 times heavier than them. And I would have let go all of it, easily. But what hurts me the most, is the love story. The crux of the film is that. And the makers are so obsessed on other material that we are told to just accept the typical Hollywood lifestyle ending without any question. There is a tear here, an effort there, problems solved, a community saved and a life sacrificed, all somehow summing up the last mark, the unforgettable kiss, that would bring back dead alive."
    },
    {
      "rating": "5",
      "text": "Didn't know what to expect from this movie. It was surprisingly good. Very funny with a decent storyline."
    }
  ],
  "recommendations": [
    "shark_tale",
    "smurfs_the_lost_village",
    "cloudy_with_a_chance_of_meatballs_2",
    "rio_2",
    "the_lego_movie",
    "ferdinand",
    "the_good_dinosaur",
    "the_angry_birds_movie",
    "the_croods",
    "rango",
    "shaun_the_sheep_movie",
    "the_smurfs",
    "the_boxtrolls",
    "ice_age_the_meltdown",
    "the_star",
    "ratatouille",
    "planet_51",
    "hotel_transylvania",
    "the_lego_movie_2_the_second_part",
    "the_lego_ninjago_movie",
    "tmnt",
    "the_angry_birds_movie_2",
    "meet_the_robinsons",
    "free_birds",
    "ralph_breaks_the_internet"
  ]
}