{
  "id": 63,
  "title": "Apex",
  "starring": [
    "Neal McDonough",
    "Bruce Willis"
  ],
  "runtime": 108,
  "genre": [
    "Action",
    "Thriller",
    "Science Fiction"
  ],
  "description": "Ex-cop Thomas Malone is serving a life sentence for a crime he didn’t commit. He is offered a chance at freedom if he can survive a deadly game of Apex, in which six hunters pay for the pleasure of hunting another human on a remote island. He accepts, and once he arrives, all hell breaks loose.",
  "releaseYear": "2021",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/chTkFGToW5bsyw3hgLAe4S5Gt3.jpg",
  "categories": {
    "plot": 0.0,
    "acting": 1.25,
    "ending": 5.0,
    "soundtrack": 5.0,
    "cinematography": 0.0,
    "familyFriendly": 1.0,
    "funny": 5.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "1",
      "text": "Wow. This is a really bad movie. Doesn't Bruce Willis have enough money? This light-weight and reheated premise could hypothetically work with Mr. Willis' taciturn charisma (see R.E.D., Die Hard*, 5th Element, etc.). But this is a boring, insulting, erratically paced, waste of 93 minutes. Oof. Advice - watch any other Bruce Willis movie instead."
    },
    {
      "rating": "0",
      "text": "This direct-to-video feature is banking on name recognition but has zero redeeming features, not least of all the lacklustre performance by Bruce Willis. The cinematography would barely be passable  for a high school student film. The plot had potential but its buried under poorly written dialogue and terrible acting. No doubt this film took at most a week to shoot and Bruce Willis got paid handsomely for turning up but at what cost to his reputation. Tricking audiences into watching mediocre rubbish by headlining a once-famous actor can work a few times but eventually the audience gets wise to the deception. Avoid this film. It’s not even entertaining in a “so bad its funny” way. It’s just bad."
    },
    {
      "rating": "4",
      "text": "There will be no nostalgia or good will left for Bruce Willis if he keeps on dialing in some terrible films. Neal McDonough takes up some of the slack in Apex, but otherwise its filled with wooden acting and terrible dialogue. There are few, if any, redeming features."
    },
    {
      "rating": "1",
      "text": "Poop! I get short on words to rate this crap. Illogical, non believable, child dialogues, done over and over silly plot.... no even the performances are good. Seriously, poop."
    },
    {
      "rating": "1",
      "text": "This movie is just terrible all around. Terrible acting, corny one liners, not really science fiction just a movie with a hologram effect on one character. I was hoping Bruce would come back to making at least a watchable movie after his last few disappointing outings, but his bills must be large to sign onto this garbage. Basically B movie quality everything that would have been a straight to DVD or VHS release in the past."
    },
    {
      "rating": "0",
      "text": "This is probably the worst movie I have ever seen, wow !!! DO NOT recommend it… what the **** is wrong to who never mad this …."
    }
  ],
  "recommendations": [
    "mortal_kombat_annihilation",
    "the_day_the_earth_stood_still",
    "the_legend_of_hercules",
    "abduction",
    "suicide_squad",
    "pixels",
    "bloodshot",
    "rogue_hostage",
    "hellraiser_hellworld",
    "doctor_strange_in_the_multiverse_of_madness",
    "jeepers_creepers_3",
    "battleship",
    "national_treasure_book_of_secrets",
    "clash_of_the_titans",
    "the_mummy_tomb_of_the_dragon_emperor",
    "the_expendables_3",
    "the_happening",
    "pacific_rim_uprising",
    "day_of_the_dead_bloodline",
    "anaconda",
    "the_transporter_refueled",
    "the_room",
    "dolittle",
    "torque",
    "see_no_evil"
  ]
}