{
  "id": 652,
  "title": "Apocalypto",
  "starring": [
    "Rudy Youngblood",
    "Raoul Max Trujillo"
  ],
  "runtime": 139,
  "genre": [
    "Action",
    "Drama",
    "History"
  ],
  "description": "Set in the Mayan civilization, when a man's idyllic presence is brutally disrupted by a violent invading force, he is taken on a perilous journey to a world ruled by fear and oppression where a harrowing end awaits him. Through a twist of fate and spurred by the power of his love for his woman and his family he will make a desperate break to return home and to ultimately save his way of life.",
  "releaseYear": "2006",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/cBFQsU1LDBEOl0Ik0cygeB6wCLE.jpg",
  "categories": {
    "plot": 4.0,
    "acting": 5.545454545454546,
    "ending": 2.75,
    "soundtrack": 5.0,
    "cinematography": 3.0,
    "familyFriendly": 3.0,
    "funny": 4.0,
    "action": 5.875
  },
  "reviews": [
    {
      "rating": "10",
      "text": "The things you see in this movie are heavy, highly detailed, intense, and exist in a realm that most filmmakers can't go-such as using genocide as a plot device in a non-documentary piece.  Very real feelings electrify this movie."
    },
    {
      "rating": "9",
      "text": "Sure, Gibson ain't my favorite person, but let's be fair to this movie. It's great. Brutal and violent, but I was engrossed in the story from the beginning. Visually stunning. Twists and turns. Probably would have been an Oscar contender had Gibson not been so disliked. If you can get past the director and like action/adventure, you're likely to love it."
    },
    {
      "rating": "10",
      "text": "Truly tremendous in every sense. Mel Gibson made a beautiful movie that can be watched again and again and again.\r It won't be truly honored for the classic it is until after his death when he'll be rehabilitated no doubt but that is the way of the world. That aside, this is one of the 10 movies of the century."
    },
    {
      "rating": "10",
      "text": "Mel Gibson es de mis directores favoritos, pues se da tantas libertades que son de lujo, a pesar de que no es el mejor trabajo de Gibson (ese lugar es para su obra maestra -La Pasión De Cristo-) sin duda alguna es un espectáculo visual cargado de adrenalina pura, secuencias de acción y suspenso hacen que esta pelicula sea entretenimiento puro. La dirección de Gibson como siempre es increíble y admirable, Gibson siempre le pone hasta el mas mínimo detalle en cada aspecto cinematográfico; la música, la fotografía, el sonido, la ambientación son un triunfo. Vuelvo a mencionar, y esto es una petición; pido que Mel Gibson regrese como director, (Yo lo considero mejor director que actor) estoy ansioso por ver su próxima pelicula. 10/10"
    },
    {
      "rating": "2",
      "text": "The logic in this crapfest was so half-baked that it's a wonder there were no random cuts to 1970s porn. [***Spoilers***]: Anyone who has played hide and seek should wonder why it's possible to hide in one's best friend's back yard for half an hour without being found, but it's impossible for a forest-wise Mayan to find reasonable cover *anywhere in the entire Mayan land,* without, of course, letting a single splash of blood fall just as your nemesis runs under your tree-top hiding place so that it may later be discovered and immediately ascertained by one of your cohorts that the blood must be from you and that you must be hiding in the trees. Because even though those cohorts have just been party to bloody sacrifice, any one of them will easily spot a drop of blood and know for sure that it's from you and your tree-hiding. Run in a straight line for 48 hours(!), and only when we do this scene with the arrows pointing directly at you should you run back and forth in an evasive way. But the arrows will still eventually hit you and all your friends. Because these are skilled Mayan bad guys, until certain scenes in which they've decided not to throw any sharp objects in your direction, which coincidentally occur when you've stopped your running to look back and ponder/taunt your rivals and would be putting yourself in imminent danger had the evil Mayans not decided that it would be a good moment to cease fire and just look at you. And, by the way, they all run at the same pace as you, which happens to be the exact pace at which a jaguar runs. And during a downpour so bad that it fills a good-sized pit faster than a swimming pool, European dingies remain fully afloat."
    },
    {
      "rating": "10",
      "text": "This movie is probably one of the best movies in the decade, and probably the one of the most underrated ones. Surely deserved an Oscar for Direction. Mel Gibson should be looking forward to direct more movies with some good scripts. As far as this movie is concerned, you don't see a single moment which bores you as it is intense, deep and thoughtful. Language is no barrier and acting is superb considering relatively unknown cast. For me, this movie is always going to remain on top 10 all time favourite list."
    },
    {
      "rating": "9",
      "text": "Great movie. Original, fast-paced and fiercely violent. When I first saw it at the cinema, it was a random choice as everything else looked toss. I left the cinema drained (in a good way) and I couldn't stop thinking about it for days afterwards. I now lend my dvd copy to everyone I can, and almost all agree."
    },
    {
      "rating": "10",
      "text": "Say what you want about Mel but he sure does know how to make movies.  This is fantastic.  The story, the setting, and the action all rolled into greatness."
    },
    {
      "rating": "3",
      "text": "Mel's report card: For using indigenous language and \"unknown\" actors: A. For giving us yet another chop-chop action flick like \"King Kong\" or any of its pals: a bit fat So What? For cynically and pretentiously disguising the whole thing as some sort of historical meditation: F."
    },
    {
      "rating": "0",
      "text": "I know now why the Mayans went extinct. They were nothing but a bunch of wild, bloodthirsty animals. Praise the Lord, or the Spanish, for bringing some civilization to that part of the world. The Arab world with their death cult and suicide bombings and their medieval superstitions is next, the last realm of barbarism."
    },
    {
      "rating": "1",
      "text": "I think it is really really important to note that, while Mr. Gibson might have set out to portray the Mayans, he actually portrayed the Aztecs. It frightens me that no one has picked up on this yet. The Mayans fell 500 years before the Spanish came to Mexico. The Mayans did not cut open people's hearts, the Aztecs did. The Mayans did not have a big city. The Aztecs did. The Mayans did not participate in the Flower Wars (taking prisoners for the purpose of sacrificing them, as depicted in the movie) the Aztecs did. I could go on."
    },
    {
      "rating": "10",
      "text": "I loved this movie!!! Very graphic in certain areas, but one of the few films I could watch over and over."
    },
    {
      "rating": "3",
      "text": "This film was terrible!!!!! The most historically inaccurate movie I have ever seen! The only good thing about the movie were the costumes. The Mayans were not the barbarians that Mel Gibson made them out to be. Get the facts straight, you anti-mayanist! I want my money back."
    },
    {
      "rating": "3",
      "text": "It's so violent that we finish by thinking that Mel Gibson is a sick person. His last movie is not even interesting because of its bad direction, and its stupid story. Hopefully we can save some good moments of action in the jungle for example, but it's not enough to say that \"Apocalypto\" has to be seen. At least it's not worse than \"The Passion\"."
    },
    {
      "rating": "0",
      "text": "Blood and gore. Nasty movie."
    },
    {
      "rating": "5",
      "text": "The problem I have with this film is this:  People not knowing that this movie is fictional will think this is exactly what Mayan civilization was like and conclude that Gibson's film is fact (because people are dumb).  Gibson should have researched more extensively to give us more of a historical context of the Mayan world and times instead of focusing on an action-chase adventure.  That being said, it was marginally entertaining but overly long."
    },
    {
      "rating": "3",
      "text": "i watched 15mins, where the mayans were sacrificing the last of the other tribe and ended when the young man was up in a tree with a cougar, i literally vomited and was physically sick. i have yet to bring myself to watch the rest."
    },
    {
      "rating": "8",
      "text": "The contradictions of the human condition are understood by Gibson. Unlike his critics (who, based on their ad hominum remarks, are mere children next to him), he is authentic and unapologetic and will therefore be remembered."
    },
    {
      "rating": "5",
      "text": "Unfortunately, I have to agree with other reviews when they say it's basically slight remakes of Braveheart and Passion. The only reason I give this a 5 is because of the chase scene. Very well done. Had me on the edge of my seat. But the rest however was just a dull feeling of watching TV on a Sunday night when nothings on."
    },
    {
      "rating": "10",
      "text": "Apocalypto is a beautiful and horrifying movie about a tribe of native Americans which gets raided by the Mayas to be enslaved, painted blue, ritually sacrificed, eaten and who knows what else. It is a virtual descent into hell and back again for the viewer, though nowhere near as persistently hellish as Passion of Christ, as the movie follows the main character while he tries to escape the clutches of the deranged Mayan soldiery. All of it is done using Mayan language, which adds quite a lot of believability to the entire thing. Historically though, the proceedings are a sort of mix between Mayan and Aztec culture, and deliberately so, for reasons I`ll get to.\rAs always I feel myself compelled to use Metacritic to point out allegories in movies, because nobody else is apparently able to notice them. And particularly the \"this isn`t historically accurate\" people, who have missed every single point about both Passion of Christ and Apocalypto. The reason Gibson used a composite for the imperial culture in Apocalypto is precisely to make it obvious that the movie is not intended to be a docudrama but an allegory of the conflict between power and empire on one side and freedom and natural humanity on the other. It is expected that the viewer notices these simple things to be able to also notice that the entire religious ceremony through which the Mayan elite exercises its power is a farce, a pantomime and a gigantic fraud, and that they all know it up on top of the pyramid, while the subjects down below do not. The whole thing is nothing more than a staged performance of state organized brutality, intended to frighten the peasants.\rThis is the main statement Gibson makes in Apocalypto: that power is a fraud, maintained only through terrorizing the people. But because he is not really talking about Mayas, but about our present western power elite, he distorts it by mixing Aztec and Mayan culture. And this is what should tell us that the movie is a political, philosophical allegory about imperialism and oligarchy, which is not intended to be viewed as a period piece or anything of the sort. Otherwise he would not have blended the cultures see? Like Passion of Christ, Apocalypto tries to deal with the hypocrisy and mass murder at the heart of western civilization, with illegitimate power elites suppressing humanity, justice, freedom and truth, by using lies and violence in order to perpetuate their power. It presents a view on the evils of government as organized violence against the inherent good of man in his natural state. Once you truly understand this you`ll figure out that neither of these two movies are strictly about the subject matters, but are far more profound than that. So that`s why these \"historical inaccuracies that might confuse people\" are in the movie, and not because \"Gibson doesn`t know how to read a history book\".\r Apocalypto is an allegory of contemporary oligarchical nonsense like the \"War on Terror\", the \"War on Drugs\", and an endless barrage of equally contrived and fake things. In fact, it is an allegory of any rule by lies, fraud, violence, intimidation and public spectacle and above all it is an allegory of good and evil. But if Mel Gibson had made this movie without allegories, he would probably have been shot by the CIA or been sent off to an insane asylum like Hemingway and Pound were. So much for free speech in the United States, and allegories it is then! Too bad most of the public are deaf dumb and blind to those. Oh well, what can you do, apart from whine about it on Metacritic?\r I`m done with my rant now. Go watch Apocalypto at once if you haven`t already. Mass stupidity must be resisted!"
    },
    {
      "rating": "1",
      "text": "Netflix gave this a recommended 4 stars out of 5 so I thought I would watch it. This is one of the worst movies I've ever seen. I have no idea how movie critics gave this pretty good reviews, while other great movies get **** ones. In case it didn't show up already, I've got some mild spoilers here. I've got two huge beefs with this movie, aside from everything else that is wrong with it. Firstly, half of the movie revolves around the main characters being shackled up and just walking around. About as exciting as it sounds. Secondly, the main theme behind the movie is to be unafraid in the face of danger and be courageous. This is all well and good, and the main character realizes this towards the end of the movie and is capable of doing some incredible things. That's great, and would work really well in most movies, but with the situations that the main character was already in, HE WOULD HAVE DIED ABOUT 100 times over earlier in the movie if he didn't have fear as a motivator. If he would've been courageous and stood his ground and fought, like the central theme implied, the movie would end 15 minutes in, 20 minutes in, take your pick. This really destroyed any point of the main theme coming together at the end for me. Aside from this, I was facepalming about once a minute during the last 30 minutes of the movie. Not to say that some of the stuff at that juncture of the movie wasn't well done, but there was so much wrong with it that I only kept watching to see how much more this movie would f*** up. I would not recommend this movie to anyone and have no idea how the hell it was ever justified to be made"
    },
    {
      "rating": "6",
      "text": "I enjoyed it. Thought it was a decent film but it felt a little too dragged on and it made me lose interest in the film. While it was solid through out, It just wasnt great."
    },
    {
      "rating": "10",
      "text": "Mel Gibson did a great film, he gave Mexican-Latino representation before it was ever a thing. As a Mexican is great to see a big budget film with a full Latino cast, in a Pre-Colonial language from Mexican tribes. Is interesting to show that the Mayans (although more historically accurate should had been Aztecs) are every bit as morally corrupted from within as our would be, at the time future Spanish-Slavers."
    },
    {
      "rating": "10",
      "text": "The movie was superbly created. With tons of metaphors and thoughts about courage, I, as an avid movie buff will certainly crave for this movie every once in a while...way to go!"
    },
    {
      "rating": "9",
      "text": "Awesome piece of work. Truly shows how brutal man can get.  There's one thing I need to say before I leave for those who are complaining about this movie being excessively violent. They should either try to understand the meaning of 'Rated - R' before buying a ticket in the theatres or buy a lolly pop and hold mommy's little finger before entering the theatre to watch Pingu."
    },
    {
      "rating": "10",
      "text": "the most intense, nail-biting, seat grabbing flick i have seen all year. i have not left a cinema felling so tense since i saw tarintinos hostel, which by no means was a great film, but very gruesome. the movie has you has you captivated from start to finish. the setting is perfect, its great to see an all hispanic cast of virtual nobodies - who can act, and the ancient mayan language caps it off and adds to the overall sinister tone of the film. not for the light hearted but a must see in my opinion."
    },
    {
      "rating": "9",
      "text": "Yeah it's violent. Yeah it's not factually 100% correct. Yeah Mel Gibson has lost the plot. But none of those facts make this movie bad. Who cares about the politics of it all when you have the chance to see something like this. It is stunning and really quite fresh. I hope he makes more just like it."
    },
    {
      "rating": "9",
      "text": "Undountedly, the people who no nothing of America's Indians can't help but rate this movie low, for the mind too small to comprehend anything past the violence, I say this movie isn't for you! Go watch an Arnold flick! It wasn't meant to brilliantly potray the mayan's culture. It also wasn't meant to give you a history lesson either. It was meant for you to understand the nature of a people. The Mayans had spiritual beliefs, they had societies built by slaves. Yes, this slaves were their own people, stop bashing mel gibson just because this movie isn't for the simple minded. Sure, Mel isn't perfect, and sure he's a bit crazy. Alot of brilliant people have been on the brink of insanity. Stop taking away from a brilliant movie. Brilliant because it still captivates somewhat of a meaningful end. This isn't for you Jackass 2 movie lovers, so go back to your MTV rubbish and save the space for meaningful comment!"
    },
    {
      "rating": "0",
      "text": "This movie was awful. Although the early parts of the film created an excellently crafted vision of a lost world, the film quickly degenerated into pointless torture-porn. The film sacrificed continuity, drama, and plot in the interest of pressing a polished vision of misery that was neither entertaining or educational, and seemed to have less purpose than what you see in a horror movie gore-fest. I have no problem with violence in films, and in fact the most distasteful scenes weren't intrinsicly violent, but I couldn't get the image of Mel Gibson masturbating in the back of the theater (I saw an early screening that he personally introduced) to the relentless misery of both the characters on screen and the people in the theater."
    },
    {
      "rating": "10",
      "text": "Undoubtedly the best action film ever shot.100% pure adrenaline.Blood and gore match the Mayan civilization of yore and criticizing Mel Gibson's realistic viewpoint is actually quite laughable."
    },
    {
      "rating": "4",
      "text": "I expected something more historical, regarding the fall of the great Mayan civilization. Instead I got this Hollywood bloody movie, filled with blood, organs and lots of dead. Yes the cinematography is good, but the plot is just terrible (maybe ok argument for violent 13 year olds, but not a deep movie at all)."
    },
    {
      "rating": "10",
      "text": "I just came from the movie theater and searched the internet to rate this film. One word, Brilliant!"
    },
    {
      "rating": "10",
      "text": "The film may be subject to negative comments for historical inaccuracies and brutal violences, but as a fiction, without a doubt, it is a masterpiece especially the performances of actors-- collectively, they performed with tribal perfection!"
    },
    {
      "rating": "8",
      "text": "The film shows time and time again that while the main character was intuitive, even lucky, his struggle against merely coping with the superstitious tendencies of his people was more than enough to drive him to save his two children and wife from a pit, slightly inaccurate but all around depicts what life would have been like, great jib Mel, keep em coming"
    },
    {
      "rating": "2",
      "text": "I like the guy who said \"I can't see how anyone could find fault with it.\" Maybe you should take some time to read the myriad bad reviews it got, since they all are spot on. This movie is a travesty. I thought I'd learn something about Mayans. Instead, it's like some primitive version of Hostel. Not to mention this film is grounded in as much fact as the Star Wars movies are. (Anyone saying this movie is historically accurate probably hasn't touched a history book since high school.) If you're naive and enjoy violence and gore, by all means, take in the craptacular train wreck that is Apocalypto."
    },
    {
      "rating": "6",
      "text": "First I want to say that I really enjoyed this movie. It is exciting, epic, dramatic and even thought provoking. I can't rate this movie much higher however because at times I felt it was clunky and slow moving. Another thing that I have to point out is that this movie is very limited by the fact that it is done in a not so common language. I think the translations were poorly done as if we are to believe the Mayans spoke in a manner like we do today. I could easily see how a completely different meaning could be obtained if it were translated differently. Other than that though, other criticism includes the lack of real cultural substance which would have made this movie more powerful and unique."
    },
    {
      "rating": "8",
      "text": "Good Movie.. Mel presented Westerners as the Saviours at the end of the Movie but in fact they were they real invaders and conquerers.. And he also presented the Mayans as Savages when these people respected each other and also respected nature.. Really disappointed at Mel.."
    },
    {
      "rating": "9",
      "text": "A fantastic work of cinema. It left me wanting more, which is a test of any great film. It seems most are missing the main reason for making the movie"
    },
    {
      "rating": "10",
      "text": "I loved the movie. I think it was exciting and there was never a dull moment. I think that they should have more movies about this."
    },
    {
      "rating": "0",
      "text": "I watched this last night on a friends recommendation (I didn't really fancy watching it otherwise) and despite a promising first 5 minutes of the Tapir hunt and the meeting with the refugee tribe, it suddenly went into comedy mode when the hunters went back to the village with the sex-obsessed mother-in-law and the prank played on her daughter and son. From then on it was just downhill. The violence in the film didn't really bother me, I didn't find it gratuitous (like in Passion of the Christ) there was a lot of blood and the sacrificial scenes were a bit too long"
    },
    {
      "rating": "8",
      "text": "My opinion is that this was a Great movie!! The scenery the actors, and the story line exceeded my expectations! I haven't bought a DVD for some time but I will definitely buy this one. Action packed and very dramatic. I could visualize myself being there in this time of change for the Mexica Indians."
    },
    {
      "rating": "1",
      "text": "Wow...this movie begins with dialogue and situations that seem more appropriate for an \"American Pie\" film and believe me, it's all downhill from there. The film tells you NOTHING about the Mayan culture and has zero plot. The last hour is an extended chase scene and anyone who has seen an action film will be able to predict the outcome. If I can prevent just one person from seeing this film, I will have done my job."
    },
    {
      "rating": "3",
      "text": "More violence and less story than \"Texas Chainsaw Massacre\". A complete waste of your time and very disturbing for the faint of heart. This is not a date movie of any kind."
    },
    {
      "rating": "9",
      "text": "Great movie. We care for the characters, there is plenty of breathtaking action, it's moving, the acting is excellent, photo and direction almost perfect. It would have been a perfect movie without the 3 or 4 really gory, over the top scenes. Mel, we didn't need it. We get the point."
    },
    {
      "rating": "2",
      "text": "For real?  A freaking full moon appears on the same night following a total solar eclipse. If you knew anything about astronomy, you would immediately be able to discern that this is impossible. Then, add some more cheesy special effects, no substantial plot, and then to top it off, time traveling Spaniards. Stay away! If you already bought the tickets, don't go chasing bad money with good money by wasting your gas and overpaying for snacks to see this movie. Give those tickets to the shredder."
    },
    {
      "rating": "2",
      "text": "Mayan world is reduced as a kind of S/M, gory Jurassic Park. Silly, bombastic fiasco. Good cinematography and interesting cast though. Gibson, like Tom Cruise, is clever enough to get sorrounded by talentous people to boost his projects, but is too heavy handed, shallow minded and basically dishonest."
    },
    {
      "rating": "10",
      "text": "Read Scott Foundas and Todd McCarthy and ignore the looney preachings of dinosaurs like Turan. This is a humanistic masterpiece, but sadly, telling the truth about humanity is, in Turan's weird book of Solemn Movie Rules, verboten."
    },
    {
      "rating": "0",
      "text": "A new low in films. It's \"Braveheart\" without historical significance and \"Passion\" without spirituality, though it dabbles in both, and it represents as brazen an act of career suicide as I can recall from a star director. If he were a first-timer, he'd never work again.  It is a terrible movie."
    },
    {
      "rating": "2",
      "text": "instead of any context/story, the film's focus is on exhaustingly long scenes of drawn out violence. by the time the movie delivered its punchline almost every theatre goer had already given up on finding any meaning in it. instead of gripping their seats, people were gripping their cell phones and jackets just waiting for the debauchle to end."
    },
    {
      "rating": "6",
      "text": "Violent and cruel movie ??? I ignore if it is the goal of Mel Gibson, but  this movie just reminded me of comics or of primitive frescos. It is a childish and ludicrous movie with all the funny excesses of comics (man whose heart was taken away but still alive and shouting and begging for his life; hero running faster than a panther; sun eclipse saving the hero's life at the last moment; fountain of blood so caricatural and aritificial that even the most sensitive soul can only laugh in front of this guignol, etc. If you take that as a cinematographic joke, you can have a good time and fun at watching this movie. It would be better to add to the title of this movie \"Apocalypto or the New Adventures of Tintin and Snowy in the Land of the Mayas\". One thing is clear to me : Mel Gibson is the most childish filmmaker of his generation with a mental level of a 10 year old boy."
    }
  ]
}