{"id": 4264, "title": "Apollo 11", "starring": ["Neil Armstrong", "Buzz Aldrin"], "runtime": 93, "genre": ["Documentary", "History"], "description": "A look at the Apollo 11 mission to land on the moon led by commander Neil Armstrong and pilot Buzz Aldrin.", "releaseYear": "2019", "mpaaRating": "G", "imageUrl": "https://image.tmdb.org/t/p/w500/woLMRroHyoTGoXyxdEeBJEYBFtu.jpg", "categories": {"plot": 8.846153846153847, "acting": 8.25, "ending": 8.5, "soundtrack": 8.5, "cinematography": 8.857142857142858, "familyFriendly": 5.0, "funny": 9.0, "action": 10.0}, "reviews": [{"rating": "8", "text": "This is not your typical historical documentary film commonly saturated by an external narrator and idiosyncratic interviews; a modern approach I found refreshing. I believe the film succinctly portrays the essence and spirit of the Apollo 11 mission in its nearest raw state, without the added drama and chatter found in mainstream reproductions. I also sense the director and editor have taken time to give the film a \"consistent look,\" which again is contrary to the archetypal \"cut-n-paste\" documentaries. I believe this film has provided inclusive excellence with added emphasis of the control room (the heart of the mission) and incorporates diversity in the spectators and those behind the scenes. The score of the film is contemporary, which I think those from the generation of the mission might find awkward and distracting. All-in-all, I found the film inspiring, revitalizing, and aesthetically pleasing."}, {"rating": "9", "text": "This is an amazing documentary film about the moon landing. There’s no narration, no interviews, nothing. Just the footage, as well as a musical score. It speaks for itself. It just tells the story of the moon landing using footage of the mission. The editing is fantastic. It actually manages to construct a compelling narrative with nothing but old footage. Speaking of the footage, it’s all in colour and in HD. It’s actually pretty incredible. It looks like footage that was shot recently, not over 50 years ago. I don’t know if most of the footage is new (as in unreleased until now) or not, but it was fascinating to watch. If you love space travel and astronomy, this is a must-watch. Even if you aren’t that into space exploration, I think this might be the definitive documentation of one of the most important cultural events of the 20th century. Go watch it. It’s excellent. It’s not very long either, it’s a very easy watch. Just do it."}, {"rating": "9", "text": "Off to an early start with an 8:30 A.M. screening of Todd Douglas Miller's (Dinosaur 13) Apollo 11, a Neon Production and CNN Film, this morning at the 2019 Sundance Film Festival's MARC Theatre. And, I wasn't disappointed. Miller and his team gained access to the National Archives and Records Administration as well as the NASA archives for their project and I was happy to see another space film after covering Rory Kennedy's Above and Beyond: NASA's Journey To Tomorrow this past summer at AFI DOCS in Washington D.C.Crafted from a newly discovered trove of 65mm footage, and more than 11,000 hours of uncatalogued audio recordings, Miller takes us straight to the heart of NASA’s most celebrated mission with masterful editing and grand storytelling - the one that first put men on the moon, and forever made Neil Armstrong and Buzz Aldrin into household names.Astronaut Buzz Aldrin shortly before going into orbit on the Apollo 11 Space Mission. (Photo courtesy of Neon)Immersed in the perspectives of the astronauts, the team in Mission Control, and the millions of spectators on the ground, Apollo 11 provided the audience with a look from inside the Apollo 11 spacecraft, the jocular banter of the astronauts as well as the adoring crowds and the tense atmospherics inside Mission Control. Miller delivers a vivid experience of those momentous days and hours in 1969 when humankind took a giant leap into the future fulfilling President Kennedy's May, 1961 mission of sending a man to the moon utilizing still black and white, and color photographs, newsreel voice-overs and the stunning cinematography treasures captured during the 1969 mission.[youtube https://www.youtube.com/watch?v=TUXuV7XbZvU]With never seen-before footage and a run time of ninety minutes, the film covers nine days in an efficient manner. Miller, a self-described space geek, weaves a warm, emotionally fulfilling narrative with a strong sound design from Eric Milano and riveting music from Matt Morton highlighted with moments from the preparation, liftoff, landing, return and recovery of the famed mission.But, he could not have managed it without the expert skills of Stephen Slater, a specialist in the NASA film archive, and nominee for the Arthur C Clarke Award for Achievement in Space Media,  who had the dubious distinction of syncing the audio for all the soundless archival footage (as none of the footage had any sound!), and Ben Feist, a software engineer at NASA, and the Apollo program historian behind the interactive website Apollo17.org, a web experience that recreates the last mission to the Moon in real-time, who created algorithms to streamline the massive audio files. Lastly, all the 16mm and 35mm archival footage was scanned and converted into a large screen format, 4K, utilizing a one-of-a-kind, prototype scanner.Director Todd Douglas Miller addresses the audience following his 2019 Sundance Film Festival Apollo 11 screening at the MARC Theatre in Park City, Utah, on January 25th. (Photo credit: Larry Gleeson/HollywoodGlee)In the Q & A following the screening, Miller  playfully referred to Apollo 11 as the 'Dunkirk in space' and provided insightful background on how these stored film reels came into being as the failed attempt of MGM and NASA to produce a film together. Miller confessed to always wanting to make a big screen film. Apollo 11 is in the U.S. Documentary Competition and seems to be one of the crowd favorites so far.This is a must-see film!"}, {"rating": "10", "text": "“Houston. Tranquility Base here, the Eagle had landed.”Apollo 11 is a great film that shows viewers the Moon Landing of 1969 like no other movie before. It has great background information and it shows the crew pretty accurately. Apollo 11 has the original videos of 1969, and by having these makes the film historically accurate. Apollo 11 is a historical film that I would recommend to anyone."}, {"rating": "10", "text": "This film is an experience, as dramatic as any fiction and ultimately far more meaningful because it is real.  I recommend it as much as possible for literally everyone.  It is a masterful blend of original footage, simple animations, and modern film technique that carries you along like a thrill ride while almost subliminally conveying how complex, dangerous, and massive a project this was.The pacing is almost perfect: the buildup to launch is like a movie in itself and leaves you amazed at what they did before it even lifts off.  Each key milestone of the voyage gets a countdown and graphic explanation, and as the movie goes on and you just start to get tired they pick up the pace so it ends with you not quite wanting it to be over yet.   In general the use of music/sound is really effective at conveying the danger and significance of events, my only real knock is that occasionally it was so loud it obscured actual speech I wanted to hear better - especially during the actual landing sequence.This is the 50th anniversary and you really owe it to yourself and your kids to see this now while it is out on Imax.  You could watch it at home on TV, but no matter how big your TV or how loud your speakers it won't be the same.  More people around the world watched Apollo 11 than any other event in history, and there's something to be said for seeing it with a crowd of other people.    An unrelated observation from the film: I found it eye opening that even though Nixon was a straight up crook, he still understood what it meant to be president and made truly presidential remarks, to say nothing of the clips of JFK.  It really puts into perspective where we are as a nation today."}, {"rating": "10", "text": "Produced more audible Wow!'s and Whoa!'s from the audience than any movie I've ever seen in theaters -- and got a standing ovation.  No superimposed narrative, raw human action."}, {"rating": "9", "text": "Some of us remember watching the historic moon landing on TV in 1969. For those who didn’t see it AND for those who did, this doc is a captivating revelation. It's composed primarily of previously-unseen footage showing all aspects of the operation: prep, launch, orbit, landing and return…all with incredible footage and actual audio recordings that combine to create an remarkable experience. It's loaded with 8-days of fascinating detail and magnificent imagery that's beautifully edited down to less than 90 minutes."}, {"rating": "8", "text": "Everything “First Man” should’ve been. Awe-inspiring, emotional and beautifully restored, this is for both the people who grew up during this time and the youth of today."}, {"rating": "10", "text": "Definitely worth seeing! Some great unseen footage of one of the proudest moments in our nation's history -- coming at a time when our government couldn't be more of an embarrassment."}, {"rating": "10", "text": "The visuals and cinamatography are outstanding and so is editing. A very good example of how to make a great, tense documentary."}, {"rating": "8", "text": "Pretty flamin awesome documentary of the Apollo 11 mission, all original footage, fully enhanced."}, {"rating": "8", "text": "It’s nearly impossible to fully appreciate the size and power of the Saturn V rocket.  It stands at a towering 363 feet tall—longer than a football field—weighs six and a half million pounds, and totals nearly ten million pounds of thrust.Sitting atop that behemoth, as is so vividly and viscerally depicted in ‘Apollo 11,’ are three astronauts, each with an unmatched combination of expertise and indomitability that has afforded them the opportunity to be blasted 238,900 miles into space to become the first humans to set foot on the moon.It’s been a while since we’ve been in a theater where the audience applauded multiple times throughout the screening.  ‘Apollo 11’ deserves it.  The film celebrates the very best of the American spirit and serves as a visceral reminder of what humanity can achieve when we direct our time, effort, and resources towards the noble pursuits of science, technology, and engineering.From a filmmaking perspective, ‘Apollo 11’ hits all the right notes.  The graphics are poignant in their minimalism, demonstrating the various maneuvers the crew needs to fulfill in order to achieve their mission.  The sound design follows suit, allowing the film to breathe at certain times, while ramping up the tone and tension whenever appropriate.‘Apollo 11’ must be seen during the limited time it will remain in theaters.  And while even a large screen and booming sound system can’t quite fully capture the extraordinary magnitude of what space exploration entails, this documentary is certainly the closest many of us will ever come to experiencing it."}, {"rating": "8", "text": "Using a surprisingly large amount of existing footage of the Apollo 11 Moon landing, including the spaceship, NASA, and even the Texas unit responsible for picking the astronauts up safely, this documentary offers what is a thorough beat-by-beat depiction of the monumental event.I thought this was going to be a look-back with modern-day interviews and narration, but nope, none of that. Only narration is some from the news footage of the launch. Any supplemental information is supplied by text and infographics of the space flight. I was pleasantly surprised by this. It really makes you feel like you're there in '69. I also learned stuff I never knew before like the multiple teams utilized by NASA for different aspects of the mission and the fact that the astronauts had to be immediately quarantined after the flight.The whole thing looks and sounds great. (Though admittedly, I saw this in IMAX, which probably helps.) The digital restoration of those bright seventy colors really makes the thing pop. The audio for the launching rockets are really loud and completely capture the experience. The dramatic music really accentuates the dramatic tone of the mission. Only downside is that they play the same music during the ending credits which consists of footage celebrating the conquering heroes. It completely doesn't match what you see. It makes you feel like you're about to see a downer twist ending like a deadly organism sneaked along with the mission or the astronauts were killed and replaced by duplicates because they knew too much. A downside is that a lot of this film is people at panels. I did lose attention a couple times.If you can't do slow-paced, this might be not for you. However, if you're interested in how the very first moon landing actually went down then this is exactly what you're looking for. (There was applauding by some audience members at the end.)"}, {"rating": "10", "text": "This film is absolutely incredible. The footage is gorgeous and at times looks like it could have been shot in modern times because the quality is so good, and despite this being a documentary it has no narration and instead relies on telling the story itself, and it vastly exceeds expectations in that department. This is a must watch."}, {"rating": "9", "text": "Apollo 11 - the first movie in a very long time that I feel has been worth the money I've spent to see it. It was truly amazing!My one and only complaint is about the incompetent fool who decided that this wonderfully illustrated piece of history needed that god-awful mood music, especially during launch and engine-firing sequences, and especially that insanely stupid heartbeat thump during countdowns. Apart from drowning out the voices I so desperately strained to hear, it also severely detracted from the events themselves.I would LOVE to see this again, but only if that god-awful mood music could be stripped out."}, {"rating": "10", "text": "An unfiltered documentary that really makes you feel like you there. I have a much deeper understanding of  just how it was done and what NASA accomplished."}, {"rating": "10", "text": "This documentary was a blast to watch and I thoroughly enjoyed watching the events that ran up and made one of the most memorable and historic moments in the world. 9.9/10 (but 10/10 for rounding's sake)"}, {"rating": "7", "text": "Not as good as I was led to believe by the critics, but the film captured the era quite well and moved along. One thing I miss in films like this are interviews with the astronauts. I can't believe they don't exist. You never get a sense of what these guys might be feeling – or were they chosen because they wouldn’t feel (in this documentary, they kept reporting heart beat rates but not much else). The pictures were the stunners here, and the event was covered in minute detail. Although Neil Armstrong's smile is charming, I preferred “First Man,” even though I found that disappointing too."}, {"rating": "8", "text": "An expertly crafted account of the epic 1969 moon landing mission that relies exclusively on footage and sound bites from the time, with no enlargement or reinterpretation from the period that followed. The film effectively captures the look and feel not only of the event, but also of the times in which it took place. For those of us old enough to remember those historic times, it's both nostalgic and prideful, reminding viewers of a time when the country truly was great and its people had something to believe in, words to the wise for those of us living in a time that's a shadow of what it once was."}, {"rating": "9", "text": "This movie was a joy to watch.  I have been watching documentaries all my life and know a lot about the Apollo program but still learned a few things.  Seeing the mission as a movie was great as opposed to the typical documentaries that focus on some aspects of it only."}, {"rating": "8", "text": "I witnessed the landing live in '69 and recalled the excitement in the TV room that day. Getting to watch some of these never seen shots was neat. Gave you a real close up of what the whole NASA team had to accomplish & the apprehension felt as each phase was performed. Well constructed documentary film."}, {"rating": "10", "text": "Es una verdadera y hermosa experiencia visual, me encantan todos esos largometrajes y documentales que tienen que ver con el espacio siendo este el mejor que he visto, incluso aplasta por completo a la película First Man sin discusión."}, {"rating": "8", "text": "A solid production. It is incredible the film contains solely of archival footage, because the overall effect is too vivid. I like the way the film presents the whole picture, not some heroic narrative. Also, the sound effects are impressive."}, {"rating": "9", "text": "A thoroughly engrossing, mind-bending portrayal of a feat so extraordinary, it seems almost impossible to believe the human race, as it exists today, could be capable of such a thing."}, {"rating": "9", "text": "“Apollo 11” is a powerful demonstration that less is more.  It’s a tribute to those who crafted this documentary that a NASA mission - whose outcome is so well-known (spoiler alert: these guys land on the moon) - could hold an audience’s attention without resorting to any sort of contrivance (like Ryan Gosling’s angst-filled brooding, I’m looking at you “First Man”).This is unadorned documentary film-making at its finest.  There’s no voiceover by James Earl Jones.  No “we were there” interviews.  No contemporary astrophysicists or scientists giving us context.  Director Todd Douglas Miller (2014 Emmy for “Dinosaur 13”) has had the self-confidence to simply go through an abundance of restored 65mm film and over 11,000 hours of rediscovered audio recordings and stitch together a powerful, compelling narrative.Without seeing this movie, you may find it hard to imagine that this story could be either emotionally compelling or visually interesting.  If you’re familiar with the TV broadcast footage from the lunar landing in its grainy black-and white, it’s even harder to believe this movie could hold your interest.  But it does.  Actually, some of the color footage is breathtaking.  Composer Matt Morton’s powerful underscoring contributes to the overall mood.What makes this documentary possible is the vast number of cameras that were deployed for every step of this mission.  At lift-off, we’re given an amazingly close-up perspective of the power of the Saturn rockets.  When parts of the rocket are jettisoned during the flight, there is up-close footage, including an amazing perspective from inside a discarded booster rocket that shows the capsule carrying the astronauts speeding away.  On the moon, a color camera taking images one frame per second has created some shots that are simply breath-taking.  One of Miller’s most effective themes is the sheer magnitude of this space mission - in size, in scope and in the scale of this undertaking.  The film opens with a close-up of the giant crawler-transporter that moves the 363-foot rocket onto the launch pad.  (This transport vehicle weighs over 6 million pounds and requires 30 technicians, crew and drivers to operate.  Some claim it’s so large it has its own weather.)  It’s an excellent metaphor for the size of this undertaking.  This archival footage also captures the scope of the audience - the tens of thousands of spectators assembled in the area because they wanted to see lift-off with their own eyes.  (We’re also shown, without commentary, that the hair styles and clothing choices of the late 60’s were a series of self-inflicted, unfortunate events.)A second powerful theme is the self-deprecating understatement of all involved.  At liftoff, telemetry reported that Buzz Aldrin’s heart rate was what many people experience while sleeping.  When Michael Collins’ respiratory sensors stopped functioning, Collins assured Mission Control he would inform them immediately, if he stopped breathing.  In its own way, this film is just as interesting as the latest films based on comic book heroes.  “Apollo 11” chronicles compellingly one of the “giant leaps” in human history."}, {"rating": "9", "text": "Stunning. I feel like I uttered some variation of \"wow!\" about a hundred times while watching it. The quality is frankly incredible and even though you know exactly what's going to happen, the tension is gripping. One of the best documentaries I've ever seen."}, {"rating": "4", "text": "I ve found it boring, because you know the outcome and some details. I dont know the sense of showing some conversations with a lot of abbreviation also. Sometimes I missed some explanations, although there are some. The restoration of the pictures is incredible. In the beginning I was thinking they just produced the scenes nowadays and put some filter on xD."}, {"rating": "7", "text": "More visually striking than informative, yet it's pretty good and informative."}, {"rating": "9", "text": "An absolutely stunning piece of cinema. The first time that I saw it in theaters, I was swept away by the high-quality footage and immersive experience. It's a refreshing look at one of the best moments in American history. Fabulous documentary!"}], "recommendations": ["das_boot", "in_the_shadow_of_the_moon", "1917", "blade_runner", "close_encounters_of_the_third_kind", "europa_report", "before_the_flood", "the_pianist", "dunkirk", "apocalypse_now", "avatar", "2001_a_space_odyssey", "master_and_commander_the_far_side_of_the_world", "first_man", "a_hidden_life", "loving_vincent", "in_the_heart_of_the_sea", "diego_maradona", "high_life", "ghost_in_the_shell", "full_metal_jacket", "dawn_of_the_planet_of_the_apes", "deepwater_horizon", "the_lost_city_of_z", "the_lord_of_the_rings_the_fellowship_of_the_ring"]}