{
  "id": 872,
  "title": "Aquaman",
  "starring": [
    "Jason Momoa",
    "Amber Heard"
  ],
  "runtime": 143,
  "genre": [
    "Action",
    "Adventure",
    "Fantasy"
  ],
  "description": "Once home to the most advanced civilization on Earth, Atlantis is now an underwater kingdom ruled by the power-hungry King Orm. With a vast army at his disposal, Orm plans to conquer the remaining oceanic people and then the surface world. Standing in his way is Arthur Curry, Orm's half-human, half-Atlantean brother and true heir to the throne.",
  "releaseYear": "2018",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/zdw7Wf97vsQ0YnGomxDqfcEdUjX.jpg",
  "categories": {
    "plot": 6.916666666666667,
    "acting": 5.966666666666667,
    "ending": 6.666666666666667,
    "soundtrack": 3.3333333333333335,
    "cinematography": 6.5,
    "familyFriendly": 5.0,
    "funny": 5.8,
    "action": 7.555555555555555
  },
  "reviews": [
    {
      "rating": "8",
      "text": "8.4/10 James Wan has crafted the most visually magnificent and triumphant tale of the DCU, full of heartfelt emotion and genuine fun albeit ridiculous at times. Had someone ever told me I would enjoy an Aquaman film with Jason Momoa more than any film in the DCU, I wouldn't have believed them and laughed. The truth is imho this is the most effectively executed film of the extremely polarizing DCU, and is filled with an array of epic moments throughout, as well as a fantastic portrayal of the comic story. While it might stray away from comics in certain aspects, it thrives with its own distinct identity. The attention to detail from Wan is impeccable as usual and the visuals in this are mind blowing to say the least. The world building through the diversity of colors, environments, creature designs, costume designs, and the overall perspectives are spectacular. The CGI was heavily utilized but never looked cheap or unrefined and is some of the best work I've seen. The characters are all acted well besides Black Manta's character which I thought was a laughably bad performance though maybe it was just how his character was written. Momoa did well enough and was extremely fun to watch, but Patrick Wilson stole the show with an incredible role as King Orm and added a whole different dimension to the majestic story that I did not see coming. It's clear to see why James Wan casts him so much in his great films. I also thought Willem Dafoe did a fantastic job as Vulko and it was cool to see him once again in a comic adaptation. I did think some of the dialogue and forced comedy was hit or miss at times, and bordered on ridiculous to where i laughed in absurdity. There are some really oddly placed songs in the soundtrack that also add some laughable ridiculousness. Luckily the story thrived so much with its triumphantly heartfelt core and exciting high octane action, that some of the more cheesy parts can be overlooked. It's satisfying to see that Wan took the time, effort, and heart and broke away from tired formulas of the DCU for the most part, to procure an epic original adaptation that sets up a bright future. I just hope the Black Manta character/actor will improve, because if he will be the main villain, he will have to be more convincing and slightly better written. Overall this is a fantastic film that needs to be seen in theaters to truly savor the details and grand scapes."
    },
    {
      "rating": "10",
      "text": "Awesome movie! A successful for dceu , James Wan did a good job"
    },
    {
      "rating": "10",
      "text": "Aquaman was a great movie! I don’t understand why some critizers such as who said that was bad because it’s like a aquarium with wire :| every scenes was on point and I should say that this movie is fantasy and we shoudn’t accept reviews like this :) that person wants to see that they’re on real sea and side by real sharks? :))) Please don’t listen to reviewers :)"
    },
    {
      "rating": "10",
      "text": "Aquaman arrives at the exact moment to return hope to the DC Universe, the director delivers a show and fantasy that explores a spectacularly visual underwater world. The plot explores well the background of the character, as the story at any time notices become predictable. It has a perfectly balanced tone that does not even saturate. The third act is ascending until it unleashes a climax full of action. Jason Momoa is very charismatic as Aquaman and imposing, makes us interested in his asomobroso trip. One of the best points of this film is the villain Orm, Patrick Wilson delivers a decent villain for the franchise, perhaps one of the best villains of this type of film in the last 6 years and surpassing all the ones seen until now. DCEU.Aquaman exploits very well all the potential it has, from the visuals to the most outstanding performances."
    },
    {
      "rating": "9",
      "text": "Ignore the metacritic notes. Some kid-brain critics are started their attacks. It's a DC movie not a Marvel/Disney. So that's the reason of this bad ratings.Go and see it! Best DCEU movie, and an extraordinary superhero movie! You must see it on the big screen! If it was a Marvel movie, than would be 80 points or higher!This movie is truly a masterpiece in the superhero genre, the cinematography and visuals are breathtaking, simply beautiful to look at. James Wan probably did one of the best directing job in 2018 as everything was just perfect, nailed everything perfectly, catching the heart of the characters and story and also the whole atmosphere and tone of the movie, making everything believable. Its actually really close to the New 52 comic book run that was written by Geoff Johns, it made me as a fan really happy, seeing the villains and all the culture and people done right. Making the costumes for especially Orm, Mera and Aquaman's final suit absolute true to their comic book counterpart. It was also great cast, having a well known ensemble with names like Amber Heard, Willem Defoe, Dolph Lundgren, Patrick Wilson and Nicole Kidman that all portray their characters in a accurate and great way. Jason Momoa blew me away, he's actually a believable Arthur Curry except for the long brown hair and beard. My favorite characters have to be Aquaman and Mera like they were in the graphic novel, great duo and amazing characters!Something that kept me interested at all times were the action sequences and plot, making it flow together nicely. The Sicily sequence and the final battle being my favorites, making this movie rewatchable more than the great characters and actors they have in store! It's epic and has a lot of heart, thanks to James Wan and everyone else that helped make the movie."
    },
    {
      "rating": "10",
      "text": "The visual effects are stunning,with phenomenal action sequences, you need to see this on the biggest screen"
    },
    {
      "rating": "10",
      "text": "'Aquaman' is an absolute blast! Great full on action, intriguing story, and lead by charmful performances from 'Jason Momoa' and 'Amber Heard'. Apart from some cheesy dialog, the movie is overwhelmed by the other strong points of the movie that you forget about it. If fans were worried if the movie wouldn't take inspiration from the comics, be glad to know that it stays true to the comics a lot, sometimes too much. With that being said, 'Aquaman' takes the crown for best DCEU movie."
    },
    {
      "rating": "10",
      "text": "Aquaman was a great movie , some things that other reviewers said like the fact that this movie was like a aquarium wasn't necessary to say . they cannot use real sharks or fishes to make a movie good . i think this movie was a good one :D"
    },
    {
      "rating": "10",
      "text": "The Movie is so damn cool and is filled with nail biting momemts didn't expect this from the Dc universe. The trailer was promising Taking the trailer as a consideration of Dc movies the trailers have done very well to hype up the movie but the result of the movie isn't that good but Aquaman changed it, it's an amazing movie. It did live up the expectations of fans the way they adore Arthur & Mera's relationship in comics! Some scenes were quite memorable ( Won't say them as it's a non-spoiler review) ... Aquaman is a very interesting character he's capable to do many stuffs you'll know when you watch the movie he's badass , Funny a good mixture of a superhero personality! Aquaman is a must watch movie ..."
    },
    {
      "rating": "5",
      "text": "Average/basic plot.The average humor doesnt raise its entertainment value.The intentional \"bad\" character development is questionable. (I won't mention details for \"reasons\".)The writing is Extremely corny. It nearly gets unwatchable with how corny it gets. (Took me a few times to sit down, and watch the whole movie through, since the corny stuff was that bad.)The special effects are average, but the artistic direction, and intention were honestly rather impressive, and really nice!But the positive art direction, negates the negative corny writing, leaving us with an average movie."
    },
    {
      "rating": "0",
      "text": "Utterly cheesy cliches and bad acting. Amber heard is a dreadful actress..."
    },
    {
      "rating": "0",
      "text": "Movie is not time worthy. The actress Amber Heard gives off a non immersive vibe and feels off."
    },
    {
      "rating": "0",
      "text": "Extremely disappointed. Aquaman was a film that could have been great, but ultimately fell flat. The amazing CGI did not make up for the cheesey jokes and what felt like a dumbed down script. While Jason Momoa and Nicole Kidman's acting was impeccable, Mera's acting however ruined the movie."
    },
    {
      "rating": "0",
      "text": "hold di ossj vdoeo wwjss odjcc sis jcdsos qwwii snaai ocjcj oqoasd jsjsoa  ajs"
    },
    {
      "rating": "4",
      "text": "My wife and I just laughed at (yeah, not with) the entire movie... SO much CGI, ridiculous, overly obvious dramatizing and posing, shocking storyline and the weakest bad dudes I’ve seen in a movie for years. On the up side, boy the colors were pretty! Haha. It’s up there with World of Warcraft for pure terribleness... but you know, in a kind of endearing way..."
    },
    {
      "rating": "0",
      "text": "The problem with the suspension of disbelief, is that it still requires some internal consistency nonetheless. Here, we have a prime example of the gigo principle and nothing more, looks like the CGI artists worked overtime on this production since everything else is garbage."
    },
    {
      "rating": "4",
      "text": "This is a new low for DC, utterly stupid in so many ways. Visuals and acting are okay but writing is terrible."
    },
    {
      "rating": "6",
      "text": "The CGI is really good at times, other times the movie just looks unfinished, with really obvious mistakes left in. At a point it just looked downright preposterous like a cheap power rangers knock-off.The story is flimsy, it's all just visuals, really nice visuals sometimes, but without meaning or soul. The acting is so-so, with Lady Mera really out of it. Maybe some people will really enjoy this movie, but for me the visuals were the only thing that were actually worth watching."
    },
    {
      "rating": "3",
      "text": "The best visuals in the whole film are the end credits. Honestly.Otherwise this is a wall-to-wall cartoonish CGI spectacle. Even the 'surface' scenes are all CGI so that a simple  grassy hill looks like a scene from Peter Rabbit.And so many silly characters that I was waiting for Jar-Jar Binks to make a cameo (and, sadly, he'd be in the right movie).The story: descent but not well acted. Really wished there was a young Dafoe to have played Ocean Master. Maybe that's where a good CGI effort should have gone, making him look younger to play Aquaman's brother. Kidman is just a place-holder for other to deliver their lines."
    },
    {
      "rating": "4",
      "text": "This was almost as bad as Batman v Superman. There were so many details in the plot that were thrown in simply for the sake of creating unnecessary drama. Barely any characters acted rationally but instead consistently acted like idiots. Also, strength levels of each character varied all of the place. They were strong or weak depending on only whatever was convenient for the plot."
    },
    {
      "rating": "1",
      "text": "Wow, who gave this a positive  review? I gave it a one cuz Jason Momoa is sexiest thing I have ever seen. Movie is for kids  Worst script I have ever seen. Worse than wonder woman .Please tell me there is more of us  that didn’t like this.  Ok let’s see:1. Did I say script was horrific, generic predictable-dialog was childish,-I could see the actors reading the script off the page, is that directors fault. They spent so much time of the CG that they didn’t pay attention how horrible the script was2. CG was bad, cartoonish, very video game...not believable. I can see the green screen!!!!!!3. Poor costumes and wigs, I can tell amber is wearing a lace front wig. And under water creatures wearing s shoes!!! Yup Nichole Kidman had shoes on when she came out of the water!! And a suit that the necktie was loose!! Isn’t she supposed to be from under water? What happened to blending the neckline into her skin? Just baaad. Ruined it from minute one3. Over the to sound effects, just not believable . Daggers sound like swords ...just bad3..  now Nichole Kidman was is  baaaaad Casting ! She was awful, I did not even believe her acting! The fight scene she did in the beginning is comical4. Even thought the music was cheesy!!! It had potential but it was one cheesy line after another and very predictable. Even the music was cheesy. Drove me crazy. And the ending.......ugh, couldn’t watch! And...they kept it open for a second one."
    },
    {
      "rating": "1",
      "text": "Its better than Justice League in the sense that it actually has a single good scene. 14/100"
    },
    {
      "rating": "6",
      "text": "Frankly I wasn't really interested in seeing this film. That's why I take so long to do it.Aquaman is a film that feels exactly like what Batman V Superman and Justice League wanted to be. A film too big and ambitious for its own good in order to try to reach the size of what Marvel achieved with more time and in more elaborate order, but I must say that it had a little more success in trying to channel that ambition.Not only happy with almost erasing the events of Justice League, Aquaman tries to cover too much and even with the inclusion of his two most famous villains it shows how desperate the studio was to achieve something big, noisy and sufficiently full of CGI action in order to attract the masses. Let's be honest, if this film had failed at the box office, that would have been the end of the DC film universe.I will not deny that it manages to entertain, but it's devastatingly unforgettable.Jason Momoa overacts too much and the truth is that you can tell he's trying too hard. Charisma must be natural and in him it doesn't feel that way at all.Personally, this film did nothing for me.But I have to say it and just as a small note because I don't usually comment on this but Amber Heard, Jesus **** Christ!!!!"
    },
    {
      "rating": "10",
      "text": "Aquaman was a dope movie. definitely my second favorite DCEU movie next to Wonder Woman. I Highly recommended it."
    },
    {
      "rating": "2",
      "text": "(Mauro Lanari)If to tell the story of a superhero the screenwriters plunder those of King Arthur and Pinocchio, it is better to change jobs. Some ideas and some emotions only in the last half hour, after two hours too long."
    },
    {
      "rating": "0",
      "text": "Amber Heard is the reason for the low review. LOW REVIEW only due to Amber Heard."
    },
    {
      "rating": "3",
      "text": "I like the movie but hate that amber heard is still in big movies after what she did to Johnny depp"
    },
    {
      "rating": "0",
      "text": "I don´t like the look of either the CGI or Amber Heard´s abusive face in this Movie.Jason Momoa was good."
    },
    {
      "rating": "0",
      "text": "Fire Amber, Justice for Johnny Depp.That's a stupid decision.No hate with Jason, just WB & AH"
    },
    {
      "rating": "0",
      "text": "I love Momoa, it's beautifully made, but I don't support domestic violence against men. Fire Amber Heard!"
    },
    {
      "rating": "2",
      "text": "Awful movie, one of the worst I've ever seen in theatres. Only people who would maybe enjoy it are little kids or soccer moms fantasising over Jason Momoa. Lol."
    },
    {
      "rating": "1",
      "text": "Amber Heard is in it. Justice for Depp. You’ve better signed that petition! That’s important"
    },
    {
      "rating": "0",
      "text": "Фильм сам не плохой, посмотреть можно. Amber Heard ужасна!!! Без нее фильм был бы шикарен"
    },
    {
      "rating": "0",
      "text": "Amber Heard is an abuser, can't believe Warner Bros has someone as toxic as her."
    },
    {
      "rating": "0",
      "text": "Fire Amber Heard from this movie and don't support domestic abuse. I don't understand WB decision, that's our respond for your silence."
    },
    {
      "rating": "0",
      "text": "Solamente porque la odio a ella. No tengo nada que decir acerca de la película porque no la he visto ni veré, pero por el simple hecho de que esta tipa actúe aquí ya es motivo para mí para ponerle mala calificación. No es un motivo? Bueno, lo es para mi :)"
    },
    {
      "rating": "0",
      "text": "Amber suks ...................................................................."
    },
    {
      "rating": "1",
      "text": "The Amber Heard's acting really sucks, in this movie and every movie that includes her in the cast"
    },
    {
      "rating": "2",
      "text": "I love silly video games, but I think a movie should provide and other kind of experience. The plot is somehow overcomplicated and extremely simplistic at the same time, but most definitely unoriginal. Visually looks like a tasteless neon vomit, form the plastic looking Atlantean armors, through the Star Wars prequel era like architecture of Atlantis and creature design, to Amer Heard’s red wig. The actors are not at their best either, at no point I could root for the “heroes”. Not to mention the “humor”, which makes this DC movie feel like it’s trying to be the worst Marvel one."
    },
    {
      "rating": "2",
      "text": "Momoa is a great guy but we all kind of hope for Chris Nolan Dark Knight type DC movies and the keep handing us Joel Schumacher type Cheese. We don’t just want something “fun” ... we want something respectable. DC seems to constantly hire people who miss the point, fans want Comic cinema that is good enough for the adults that have grown up on comics for decades. Not Momoa’s fault, but take note of the recent release of The Snyder Cut, first thing he did was remove all of Whedon’s cheesy quips. DC, pay attention; Joker, Dark Knight Trilogy and Snyder Cut (already) some of your most respected films to date. Even Wonder Woman was dark and gritty set in WW1. Tim Burton’s Batman. Your best and most successful Movies have a general theme... Darker, Grittier and no or very minimal cheesiness. Now let’s luck at your fluorescent cheesy list; WW84, Aquaman, Justice League, Batman Forever, Batman and Robin, and let’s not forget the unwatchable Suicide Squad. ... Ok I think we’re done here."
    },
    {
      "rating": "1",
      "text": "Это все иЗ-за Эмбер Херд! Как я уже писала будут такие отзывы у всех,кто ее возьмет на проект, не зависимо от того хороший этот проект или плохой. 0 не ставлю из-за Уважения к компании!It's all because of Amber Heard! As I already wrote, there will be such reviews from everyone who will take it on the project, regardless of whether this project is good or bad. I do not put 0 because of Respect for the company!"
    },
    {
      "rating": "6",
      "text": "Its ok, the cgi is pretty bad sometimes especially underwater, which is where most of this movie takes place."
    },
    {
      "rating": "1",
      "text": "Amber"
    },
    {
      "rating": "3",
      "text": "Aquaman is a broodish, miserable entry in DC's catalog. It's overlong, overstuffed, filled with poor acting, silly dialogue, features two leads who share about as much chemistry as water and oil, but worst of all, it's simply no fun. Furthermore, like every major studio release these days, this is yet another film that ends with a giant Lord of the Rings-esque CGI battle that never wants to end."
    },
    {
      "rating": "0",
      "text": "Aquaman is sh*t. And amber heard doesnt deserve it to look one of her movies."
    },
    {
      "rating": "8",
      "text": "Im not sure why the critics again are on the other hand on this one. I was sucked into this world and just did not want to leave once the movie was over. James Wan has done it again creating one of the most epic, adventurous, sci fi fantasy with some horror at times movie. I wouldnt say this is a perfect movie where there are some dialog that fall flat and are pretty cheesy which will take you right out of the movie but good thing its only the beginning. This is my 3rd favorite comic book movie this year. Good job WB and James Wan!"
    },
    {
      "rating": "8",
      "text": "Aquaman is one of those movies that critics will over think and give a bunch of bad scores to but is at the same time a freaking blast, beautiful, and not for one second boring.  There's a handful of bad acting moments, interesting casting decisions and could be considered a little long but it's near the top of favorite movies of 2018. In all honesty, what James Wan did should really be applauded.  He took something that should have been just awful and turned it into a fantastic movie."
    },
    {
      "rating": "8",
      "text": "That's what happen when producers let the director work with his vision on a project: a great movie with its own idenity and amazing visuals! I'm fascinated with everything about Mera! Congratulations Jason, Amber, Patrick, Willem, Yahya, Nicole (one of teh best surprises of the movie) and mostly: James Wan! This is one ofe the best DC movies!"
    },
    {
      "rating": "7",
      "text": "The DC Universe has fallen behind from Marvel in the last five years. 'Aquaman' turned out to be probably the most entertaining film of them, even with its length. The critics are giving too little to this film, which has a capable story-line and character arcs and doesn't try to go deeper than it already is. It's a goddamn superhero action movie, not an art house drama, so I;ll critique it like a superhero action movie."
    },
    {
      "rating": "10",
      "text": "I had very low expectations going in with DC films track record. Wonder Women was a above average action movie but Aquaman really brings everything together. While Wonder Women would be a better action movie than Aquaman, Aquaman does a good job while bringing elements the other films lacked. It has great and cheesy humor, brings the science fiction to the screen more than just a comic book Esq way, and it takes itself less seriously while still bringing the notion that everything is on the line in a more marvel fashion. Huge fan of Jason Momoa and thought he did a fantastic job portraying the underrated superhero and Amber Heard exceeded my expectations too. I highly recommend to anyone who enjoys superhero films and I personally was happy to pay to see it."
    }
  ],
  "recommendations": [
    "oz_the_great_and_powerful",
    "the_three_musketeers",
    "fantastic_four",
    "hercules",
    "clash_of_the_titans",
    "green_lantern",
    "pan",
    "the_suicide_squad",
    "the_last_witch_hunter",
    "seventh_son",
    "thor",
    "poseidon",
    "justice_league",
    "black_panther_wakanda_forever",
    "elektra",
    "avengers_age_of_ultron",
    "gods_of_egypt",
    "guardians_of_the_galaxy",
    "shazam_fury_of_the_gods",
    "gemini_man",
    "jumper",
    "bloodshot",
    "superman_ii",
    "fantastic_four_rise_of_the_silver_surfer",
    "valerian_and_the_city_of_a_thousand_planets"
  ]
}