{"id": 4791, "title": "Aquamarine", "starring": ["Emma Roberts", "JoJo"], "runtime": 104, "genre": ["Fantasy", "Romance", "Family", "Comedy"], "description": "Two teenage girls discover that mermaids really do exist after a violent storm washes one ashore. The mermaid, a sassy creature named Aquamarine, is determined to prove to her father that real love exists, and enlists the girls' help in winning the heart of a handsome lifeguard.", "releaseYear": "2006", "mpaaRating": "PG", "imageUrl": "https://image.tmdb.org/t/p/w500/4cQusdPNSIAq4ZW2dBCw4cZNrMA.jpg", "categories": {"plot": 4.0, "acting": 6.2, "ending": 4.0, "soundtrack": 3.0, "cinematography": 5.0, "familyFriendly": 4.0, "funny": 5.0, "action": 5.0}, "reviews": [{"rating": "8", "text": "This is a great little movie - and of course it is derivative. But the performances are full of fun, and it is very well written. The two leads ooze a delicious geekiness and longing, the mermaid is initially unlikeable but wins you over in the end, and there is some great writing that makes the minor characters 3 dimensional and important even though they have very little screen time. I got dragged along to this with a 10 year old - it is not a movie I would ever choose to see in the theater, on DVD or on television. However, I found it totally captivating, and if this is the quality of tween movies, I would much rather spend my money on similar movies than on the often bitterly disappointing adult orientated movies that Hollywood has to offer."}, {"rating": "10", "text": "An absolute masterpiece! Direction, writing, technicals... but the acting! Everyone was superb. But Sara Paxton in particular gave one of the best performances I have ever seen. Subtle, heartbreaking, raw, real, emotional... if she doesn't win the Oscar it will be a huge travesty. Easily the performance of the decade, but I would go further and say it is the best performance of all time."}, {"rating": "0", "text": "Emma Roberts and JoJo are so ugly and can't act ! The only reason that Emma is in films is because she is related to Julia Roberts, and I don't even know how JoJo made it big because she can't sing. Waste of time and money! Do not see! I'm still waiting for real young talent to come to Hollywood, instead I get this crap!"}, {"rating": "0", "text": "Forgive me, but I took my nine year old niece to this picture, the supposed \"target audience\" and even SHE thought it was boring, syrupy and repetitive. And seriously, what was with the headache inducing pop songs that were blaring LOUDLY to set up character introductions and motivations? Was it just to sell the soundtrack?"}, {"rating": "3", "text": "Please people who like this movie, forgive me, I am only giving me opinion. I did'nt like this movie. Emma Roberts and JoJo are not that pretty. Put them together and they just look even worst. I think Emma is just here because shes the niece of Julia Roberts, and JoJo , her parents just probably pushed her into singing. I think JoJo is a better singer then an actress, and I don't think her music is that good. This movie I thought was sort of an insult to mermaids. I mean there a fantasy. Leave them that way instead of putting them in Hollywood."}, {"rating": "10", "text": "This movie is really amazing and full of fun.. it shows how important the friendship is... i really really love it!!! you rock!!!"}, {"rating": "10", "text": "I laughed, I cried and I had a very entertaining time."}, {"rating": "7", "text": "To be fair, I went to see the movie with my 2 daughters ( 7 and 10 ) and they would have given this movie a 9... A good saturday afternoon / summer type tween movie, cute, no surprise, fluffy and with 2 girls that cant wait to see this movie again on DVD."}, {"rating": "7", "text": "emma roberts acted the worst here."}, {"rating": "4", "text": "I didn't expect to like this movie and, lo and behold, I didn't. The dialogue is unbearably stupid, the premise is executed poorly, the characters are generic and boring the acting is mediocre at best and...I'm sorry but mermaids can just grow legs whenever they come on land? Are you kidding? All the negative reviews I've read talk about how ugly the main two actresses are. First of all, even if you don't find them that attractive, that's a very petty reason for not liking them. And secondly, I think they're pretty. My beef with them is that their acting in this film is bad.Technically, I should hate this movie, but I don't. Know why? Because, damn it, it has an incredible ending! That climax is one of the best I have ever seen. I can easily say that I did not see it coming. It actually worked well. And while it does not make up for the other flaws that this movie has, I still thought it was brilliant.I've read the short story that this was based on and even though it has been a while and I do not remember all of the details, I found it to be more compelling. For one thing, Aquamarine can't just sprout legs whenever she wants. She's stuck as a mermaid, so both girls place her in a wheelchair and cover her tail. This is a pretty clever idea. I also didn't find the two leads to be that aggravating. Also, the motivation for helping Aqua is different. In the book, the girls are worried that Aqua will die if they don't get her to the ocean in time but she does not want to leave until she spends time with Raymon, so the girls agree to set up a date. In the movie, the motivation is more selfish. Keeping up with the BS mythology, if you help a mermaid, you get a wish, and their wish is to stop one of them from moving. In the book, both girls are in a similar predicament when one of them has to move but they work through it.Overall, the movie is dumb and not well made but It has a great ending. Go read the short story. I have to see if I can dig it up."}, {"rating": "5", "text": "Emma Roberts, Jojo, and Sara Paxton are pretty good as the leads, but overall, Aquamarine is one of those films that can best be described as mediocre."}, {"rating": "4", "text": "Predictable young teenage stuff going on. Flirting with the boys, being an outcast and meeting mermaids. We've all been there. Despite the whole mermaid angle, it's surprisingly devoid of any magic or fantasy. Bruce Spence has a nice unpredictable role, that he does a lot with in his limited screen time. Manages to hold your attention, even if it doesn't quite entertain."}, {"rating": "7", "text": "----------------------------------7.0/10-----------------------------------"}], "recommendations": ["the_lucky_one", "no_strings_attached", "the_last_song", "we_bought_a_zoo", "hustlers", "the_boy_next_door", "17_again", "the_vow", "dolittle", "confessions_of_a_shopaholic", "jumper", "seven_pounds", "the_break_up", "we_are_your_friends", "if_i_stay", "juno", "the_perfect_date", "21", "abduction", "hannah_montana_the_movie", "next", "passengers", "hancock", "midnight_sun", "red_riding_hood"]}