{"id": 3279, "title": "Arbitrage", "starring": ["Richard Gere", "Susan Sarandon"], "runtime": 100, "genre": ["Drama", "Thriller"], "description": "A troubled hedge fund magnate, desperate to complete the sale of his trading empire, makes an error that forces him to turn to an unlikely person for help.", "releaseYear": "2012", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/oVJF2KTmNB8ZFkp0aUSay7d0Opf.jpg", "categories": {"plot": 6.894736842105263, "acting": 7.057142857142857, "ending": 5.5, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 3.0, "funny": 5.0, "action": 8.0}, "reviews": [{"rating": "6", "text": "On the positive side, this film has strong acting, stylish directing, impeccable production values. The individual scenes are very well written and the dialog is crisp and authentic. On the negative side, Richard Gere's character has no redeeming value and is hard to embrace as an audience member. He is a man without a shred of moral duty or a sense of right and wrong. So it's difficult to become invested in a character who is so utterly repugnant. He could very well be accurately drawn, but so could a well crafted oil painting of a maggot."}, {"rating": "3", "text": "What a disappointment! Considering the cast -- and the start of the film -- I was expecting a smart, edgy tale of corrupt financiers gone amok in the Big Apple. What I got was yet another melodrama about a middle-aged slickster whose affair with a younger woman takes a tragic turn, and his machinations to avoid the consequences. It's been done better by everyone from Adrian Lyne to Woody Allen. Actually, it's been done better on TV series like \"Damages.\""}, {"rating": "7", "text": "What can I say? I like Richard Gere. He's the man. And with all pistons fired he is phenomenal on screen.\rThis movie was a well crafted story. Definite proof that we don't need to blow up half a planet to keep your audience's interest. From opening to closing you get the clear feeling that something is going to go very wrong here. The thriller element is clearly there. The characters smart, and the decisions made along the way a perfect balance between surprise and predictability. Even you plot geniuses out there can feel smart following along.\rI particularly loved the ending. It went somewhere I didn't expect it to go. The definition of the true monetary American hero.\rBy the way, what is an Applebee's?... Classic."}, {"rating": "7", "text": "Jarecki definitely achieves a dramatic tension that many thriller directors and writers struggle to capture but unfortunately he falls short with his choice of audience placement. In a brave move, Jarecki has not only positioned the audience with a man who is essentially the unlikeable, guilty party, but he"}, {"rating": "7", "text": "Works well in that it makes you root for a completely unsympathetic character. Richard Gere is superb and largely to thank for that. A solid thriller."}, {"rating": "6", "text": "What we have here is Richard Gere being cool and looking stylish is expensive suits. The plot is awfully mundane- and frustratingly morally ambiguous, but the actors are very good here- and more importantly Arbitrage is believable. It doesn't feel like watching a movie."}, {"rating": "2", "text": "This is perhaps one of the worst films of the year.  The script is poor; the ending is non-existent; Susan Sarandon flounces around in ill-fitting and unbecoming clothes.  Were Richard Gere no a handsome man, this film would have gone immediately to video."}, {"rating": "8", "text": "A tight script, good performances from Gere, Roth, Margolin. A Bernie Madoff type trying to stitch up his financial empire and life before it unravels. Will this slick Willy get caught or will he be able to dodge the consequences by browbeating, bullying, mesmerizing his way out of serious trouble? Yeah he reminds us of Gecko, and he's nothing like Bernie except in life style, in fact compared to Bernie he's a lightweight multi- millionaire. But he runs into the integrity of two people he can't shine the shoes of: his daughter, who won't go down with him and a wannabe middle class Black kid who is so tied into loyalty, gratitude, and guilt that he's very reluctantly willing to sacrifice himself. It's worth seeing if just to see a Master of the Universe walk the high wire over his own demise."}, {"rating": "5", "text": "Disappointing: expecting much more in terms of story. Could've have done without the mistress. Plenty of tension and complications could have been built entirely around deceptions and fraud and resultant tensions within family and relations with/negotiations with/deceptions of employees and tentative business partners. I expected far more info regarding how such fraud works. In movie critics' reviews saw that \"Law &Order\" mentioned several times: this movie seemed like a more highly financed episode of L&O."}, {"rating": "7", "text": "Very satisfying movie. Solid acting by the cast that features an enjoyable and entertaining story that keeps you interested in it from start to finish. May not be perfect but I'd still recommend watching it. It's just an overall good film."}, {"rating": "9", "text": "\"Arbitrage\" stars Richard Gere as Miller an immoral business tycoon (is there any other kind?) and Susan Sarrandon as is dutiful wife (is there any other kind?) and how theirs lives seemingly come apart after an accident that could lead to a homicide charge against Miller. Much like we watch people's lives unravel on Oprah or Springer, we are mesmerized as we watch Miller betray anyone"}, {"rating": "8", "text": "Starting with his supporting role in"}, {"rating": "10", "text": "I loved this movie. Richard Gere's character has a dream life, he has it all, and it is all collapsing around him. I felt real dramatic tension as this story unfolded and it had surprises along the way. I found the ending to be stunning. And where did Nate Parker come from? That man can act and does an incredibly real performance as the story pivots on his character. The film looks great too, New York has a supporting role.\rWant more films from this team!"}, {"rating": "4", "text": "WHAT IS ARBITRAGE?  While the definition of the word is appropriate for the shrewd transactions conducted by Richard Gere in this film, a better title with a more commonly used word might have been better.  But then, the abrupt ending killed all hope for ARBITRAGE.  Potentially a great movie with lots of suspense, it is an absolute letdown during the last three minutes.  If the Directors and Producers could take it back and redo the ending the film would be destined for unique greatness."}, {"rating": "8", "text": ""}, {"rating": "8", "text": "This is a portrait of a man and a milieu, not a didactic, finger-pointer; and as such, showing the story, not just telling us how to think,  the film works beautifully. I felt convinced by it, saw it as a compelling and timely tale that will be repeated again and again.  Gere was mesmerizing. No all-good guys, no all-bad guys here."}, {"rating": "10", "text": "Sometimes there comes a director with so much skill that it's like watching a jet fighter pilot putting his plane through its paces. Add terrific acting from every character, a riveting script, beautiful cinematography, and you have a solid \"10\"."}, {"rating": "7", "text": "This film will keep your interest, but it drags in places, makes you wonder about the poor choices of the main character, and sort of ends with a plop.  I expected a better film.  That said, a recommended rental."}, {"rating": "7", "text": "Between stylish directing and wonderful production, Arbitrage is memorable as Nicholas Jarecki's debut and one of Richard Gere's finest acting performances to date."}, {"rating": "6", "text": "It`s a decent movie but the problem is it`s hard to root for anybody. Only one character I cared about, but he was not in no lead role. It`s worth watching but nothing ground breaking about this movie"}, {"rating": "9", "text": "Richard Gere gives possibly his greatest performance in \"Arbitrage,\" a film that makes a home within suspense, intrigue, and a widely overarching sense of intricacy."}, {"rating": "2", "text": "A second rate entertainment masquerading as an A list movie. Arbitrage is like a routine episode of a low grade tv drama series complete with an ineffectual detective here played by Tim Roth. Richard Gere seems to be forever walking somewhere, and Susan Sarandon is quite frankly wasted aside from the last confrontational scene with Gere which is probably the best scene in the film. The abrupt ending just reinforces just how futile the whole enterprise is."}, {"rating": "10", "text": "So shocked at some of the poor reviews here! The movie is excellent. It is a classic thriller. The young actor playing Jimmy is brilliant, the next Denzel Washington!\r Richard Gere was at his best. In fact the whole cast were very good. Tim Roth was a pit bull. Love Tim he always delivers!"}, {"rating": "6", "text": "This a prime example of stylish drama that likely appeals more to mature audience. The characters are believable and acting is as steady as the credits suggest. Best of all, the moral of the story is that there isn't any."}, {"rating": "9", "text": "This movie is based off its fantastic performances.  Richard Gere gives one of his best performance's  striking the right balance between likable and unlikable. I also really enjoyed the performance of Tim Roth."}, {"rating": "9", "text": "IN MY OPINION **MAY CONTAIN SPOIILERS** by CtheTav This film grew on me from the moment I sat down to watch it. Going in I haven't seen any reviews or plot synopsis for this film so I had no clue what it was about. Turns out its the following. Richard Gere seems to have everything loads of money and a mistress on the side, a family who love him and success. It turns out this is all a lie. He's nearly bankrupt his company and needs the merger to go through to get away without anyone noticing. Add to this the fact that he has accidentally killed his mistress and needs to cover this up to get his company sold. Few what a week. This film ends on one of the best cliff hangers I have seen in years with Gere stuck between a rock and a hard place, but I feel the character is strong enough that the internet will be able to work out what he would most likely do, I know what I would do if I was him. The acting is excellent throughout the story moves along at a brisk pace meaning the 2 hours fly by. The story asks the question what you would do to save yourself. The writing was so good I found myself caring about Jimmy (an accomplice of Geres') and whether he would cave under the pressure. Rating 9 out of 10 A great thriller setting an example for others to follow whilst staying true to its roots"}, {"rating": "6", "text": "Arbitrage is a generic Richard Gere thriller that seems a bit unfocused and scattered, but somewhat comes together in the end. It's predictable, melodramatic, but the acting is pretty good, as many stars are in this one (Gere, Sarandon, Roth). The story veers off course in the middle parts and starts to get away from Gere's character, even though this was a path the movie shouldn't have taken. Overall, the film is average. Only watch it if you like Richard Gere enough."}, {"rating": "7", "text": "Richard Gere's hedge fund magnate Robert Miller is a studied personification of post-2008 \"big finance\" excess and moral turpitude. The movie's point is a wearily familiar truism: there will be no justice for powerful rich people, regardless of the scale of their crimes. What debut director Nicholas Jarecki succeeds in accentuating - with the help of Gere's perfectly judged performance - is the role that charisma and intelligence, rather than just naked economic power, play in maintaining this depressingly destructive cycle. A terse and effective thriller with an excellent supporting cast including Susan Sarandon."}, {"rating": "8", "text": "I don't normally watch business thrillers, so it was a little challenging to follow what was going on for the business side of things.  However, once all the pieces fall into place, it's actually a very satisfying story. The main character is definitely not an perfect guy, but he has some surprising good points."}, {"rating": "8", "text": "Once you get through the slow start, the action and suspense ramp up and the director does a good job of keeping the film moving at this pace.  The actors do brilliantly at portraying their characters, especially Richard Gere.  This was a surprising crime thriller.  Worth a viewing."}, {"rating": "6", "text": "This is a finance related drama film, with themes covered including accidental death, blackmail and white collar crime. The first thought I had about this film was that its about a family man, a caring person who is clearly also motivated by money and, thus, greed - how can you be both? hmmm...how original, a moral tale of our times(!). It did seem like a relatively bland film but then a pivotal plot twist happens and I found myself more interested to see what happened to Robert, what his reaction would be. The saying 'the truth will out' is quite key in relation to this film, I feel. However, what that entails isn't necessarily as obvious as you may think.Cast wise, Robert Miller is played by Richard Gere. He depicts Robert as quite a vulnerable person shortly after a certain turn of events - he loses his cocky and self assured veneer, certainly in the short term. It is very much a film which makes you wonder quite how you'd react if you were in his shoes - I'm not convinced I can say I found Robert to be an especially appealing person as such but his performance seemed alright. He certainly seems like quite a slippery type of a figure at times, sometimes quite human and other times much more the opposite (which is to say a smooth talker, or  ultimately worried about himself getting in to trouble or losing some of his mass wealth(!)). Other cast members include Susan Sarandon as his partner, Ellen and Tim Roth as the cop in charge of a case involving Robert - detective Michael Bryer. He suits the role well, as he both looks and sounds the part of a NYPD detective. I'm not entirely sure I can explain precisely why but I felt he did anyway.As a character focussed drama, its alright. I suppose its true what people say about one person owning many masks (metaphorically speaking), which is well depicted here. I quite liked Tim Roths character, how he tried to get under Roberts skin (again figuratively speaking, of course!) and I found myself wondering quite how things would play out, which is a good sign. It is, I suppose, a reasonably watchable film but the plot is a bit slow and it won't appeal to everyone, especially if character driven dramas and, more specifically, those about not entirely endearing people, aren't your proverbial 'bag'.Content wise, the film contains sex references and partial nudity but nothing especially graphic. There are some scenes depicting drug use, with a character shown taking cocaine being one example. There are also some violent scenes, mostly confined to one scene fairly early on in the plot - a bloody wound is shown and Roberts various bruise marks are shown as well. There is also quite a lot of strong language used. Otherwise, there are scenes featuring characters threatening one another but otherwise not a great amount of content especially likely to upset or frighten people. The tone of the film in general is somewhat unsettling, questioning perhaps in terms of the morality of the main character but I wouldn't have thought people would find it especially visually disturbing. It carries a 15 rating in the UK, due to this.I'm not sure that I'd specifically recommend this film, as I feel there are other films covering similar themes that are a bit less bland and maybe a little more thought provoking. The main character being a less than especially impressive man made me less than overly keen on it, although it was quite a watchable film (perhaps surprisingly so) and one or two of the other characters somewhat made up for that perhaps. Overall, I'd say look around for a better alternative to this film, as im pretty sure there are a good few out there."}], "recommendations": ["donnie_brasco", "widows", "a_most_wanted_man", "all_the_money_in_the_world", "the_lincoln_lawyer", "the_accountant", "conspiracy_theory", "the_devil_all_the_time", "knives_out", "breach", "primal_fear", "white_boy_rick", "stillwater", "beirut", "body_of_lies", "man_on_fire", "black_mass", "prisoners", "the_infiltrator", "fracture", "morgan", "the_place_beyond_the_pines", "hell_or_high_water", "thoroughbreds", "child_44"]}