{
  "id": 3875,
  "title": "Area 51",
  "starring": [
    "Frank Novak",
    "Reid Warner"
  ],
  "runtime": 91,
  "genre": [
    "Horror",
    "Science Fiction",
    "Mystery"
  ],
  "description": "Three young conspiracy theorists attempt to uncover the mysteries of Area 51, the government's secret location rumored to have hosted encounters with alien beings. What they find at this hidden facility exposes unimaginable secrets.",
  "releaseYear": "2015",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/ochcUJTPQSfU5fDMA21y4xoDzeX.jpg",
  "categories": {
    "plot": 5.5,
    "acting": 5.5,
    "ending": 5.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 5.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "5",
      "text": "The minimalist approach surprisingly creates an involving trip, although it's hampered with vague visual and unsatisfying conclusion Found footage genre hasn't found much success after the initial trend start with REC or Cloverfield. It attempts to create a more personal experience with first person view often falls flat with cumbersome shaky shots and unclear scenes. Area 51 suffers from the same exact problems and it stutters towards the end, but it also manages to set an occasionally interesting trip, especially in the first half.\r Story follows Reid and his friends as he tries to infiltrate the highly secured titular facility. To do so he must investigate the area and bypass many security measures. For most early parts, the film delivers quite the ride as audiences follow these guys on Vegas and its surrounding. Some investigations and interviews set the tone right, and not in overly silly way. Characters are also pretty decent and likeable as though they are real life friends.\r Unfortunately, it soon arrives at familiar territory of hazy shots and mindless running. The scenes in the city or desert are identifiable, but when it is stranded in dark corners, the movie loses the momentum significantly. Script is also numbingly bland as characters would yell the same thing over and over again, this is especially true when they are repeatedly shouting, “We gotta go”. With both visual and audio decrease in quality, it just turns into a confusing escapade.\r Cinematography is to be expected from this kind of found footage flick, it’s rather elementary, but there are a few good shots with modified vision. At several scenes the film builds up the suspense pretty well, these are not all translated into thrilling moments. It almost seems like it has problems in latter half, resorting to cheap alien gimmick and nullifying its early decent production.\r Area 51 has a presentable start with more engaging use of the found footage, but it falls to the same issues and ends up like the rest without accomplishing much."
    },
    {
      "rating": "6",
      "text": "For a movie that was in production for 6+ years and directed by Oren Peli (the director of Paranormal Activity), Area 51 is a letdown. Now, it's not terrible mind you, but average. It is not a horror movie; more like a fake documentary about people sneaking onto Area 51. There are some interesting visuals/ideas and the characters are very likeable for a found-footage affair, but is definitely not a must see. If you like found-footage movies, then give Area 51 a try. I don't hate myself for watching it."
    }
  ]
}