{"id": 3573, "title": "Argo", "starring": ["Ben Affleck", "Bryan Cranston"], "runtime": 120, "genre": ["Drama", "Thriller"], "description": "As the Iranian revolution reaches a boiling point, a CIA 'exfiltration' specialist concocts a risky plan to free six Americans who have found shelter at the home of the Canadian ambassador.", "releaseYear": "2012", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/9LcnmIeKUfKeAxeCY82W9Jug416.jpg", "categories": {"plot": 6.9361702127659575, "acting": 7.5777777777777775, "ending": 6.9, "soundtrack": 5.333333333333333, "cinematography": 8.5, "familyFriendly": 3.0, "funny": 6.875, "action": 7.6}, "reviews": [{"rating": "10", "text": "Argo is a triumph. It has tension, sincerity, mystery, artistic responsibility, entertainment value, technical expertise, a narrative arc and a thrilling respect for the tradition of how to tell a story with minimum frills and maximum impact. It's a great footnote to history, one of the best films of 2012 and a sure-fire contender on Oscar night."}, {"rating": "0", "text": "A one-sided self-satisfying nationalist and political propaganda film with no real suspense and substance. With highly-implausible inventions to reality that make it look stupid to the audience with some common sense and minimum level knowledge of the situation. The silly car chase on the airport runway or the lack of explanation for why the airliner is not turned back to the airport by the control tower,  or the American women wandering provocatively (taking photos) among the Muslim Persians with no head-covering (the stupidest thing of all), etc."}, {"rating": "6", "text": "As neither an American nor a Canadian citizen, I get to watch this movie for what it is: a movie. If we consider it a crime film, it doesn't have a twisted enough plot. If we consider it a thriller, there's not enough tension. If we consider it a documentary, it's not true enough. Where are the laughs the critics are talking about? When are supposed to laugh? If we consider it a comedy, it doesn't make you laugh enough.\r I understand it's a celebration of the American intelligence and it is intelligently released in a period where pretty much all of the Western World looks at Arabic countries with suspicion. I didn't know anything about the Canadian Caper and honestly, this film didn't make me curious about it.\r Ben Affleck was in 2012, so that meant no facial expressions, and I get it. He did the same in To The Wonder. A notable yet tiny performance by Cranston is worth mentioning, the rest of the cast were blank pawns. The score, despite being Alexandre Desplat and all, I found irritating.\r Not a bad movie, but not a great one either. It certainly doesn't deserve that 86. The political gets too much in the way to judge Argo without prejudice."}, {"rating": "9", "text": "Beautifully made with all everything from the costumes to the technology accurate to a tee. I loved the way the film was intercut with archive news footage of the time; this really gave the audience a sense of the world at that juncture. All the performances were excellent with Ben Affleck taking centre stage, but I really enjoyed seeing Alan Arkin as a Hollywood producer; he stole it for me! There was real tension towards the end of the film; it slowly builds for quite a long time and I found that quite masterful. It’s something that has been missing from many Hollywood films for a long time now but Affleck seems to have rediscovered the art. Because it‘s a film based in real events, there’s little time for character development and I think it suffers slightly because of it. Other than that, it has some interesting songs on the soundtrack and it’s well worth a look!\r SteelMonster’s verdict: HIGHLY RECOMMENDED\r My score: 8.6/10"}, {"rating": "10", "text": "Unbelievably great movie! I had some trepidation if Affleck could bring this very serious story to the screen with as much emotion and respect required for this story. I hoped he could bring out the feelings of the true life players in this true story. Well,  Ben brought his A game and then some. I'm writing this the day before Oscar night and wonder how this didn't get him a best actor nomination. I think he was tremendous in acting  directing! I was on the edge of my seat through the whole movie; though I knew the outcome. I believe this is exceptional movie that stays true to the story. I believe Victor Gather should have gotten the nomination for supporting role rather than Alan Arkin; though his performance is good. First movie I've ever given 10 stars on."}, {"rating": "10", "text": "Argo is a success. This film is one of the ones that i will remember my whole life. The last 30 mins are absolutely heart-pounding and i just love how ben affleck tells the story of Tony Mendez through his direction and acting. Argo is one of the best."}, {"rating": "8", "text": "Compared to the book basis is laughable, but with cinematographic look is very interesting, because its narrative line is modern and funny, but knows how to be serious and rough, the dialogues are otimos especially when the topic is holiwood, the second best thing is the performance of Alan Arkin, who gives a satirical tone in the dialogues, another very interesting thing is the accuracy of the portrayal of facts acontecidos.Esse film proves that Ben Afleck can indeed perform well and drive good shape."}, {"rating": "3", "text": "When Hollywood decides to make a movie based on true historical facts I personally am immediately afraid of the result. This fear is based on the overwhelming ability of writers and directors to manipulate facts and subvert them in the name of art, dramatic effect and box office. Thus, there are many films allegedly based on \"true historical facts\" that have little relation to them, however profitable or spectacular they may be. Unfortunately, \"Argo\" is one more that will join this long list of infamy.To begin, the deposed Shah of Iran is portrayed as an eccentric and bloodthirsty dictator. Its not entirely true: he certainly had his faults and mistakes, but he was a modern leader with a pro-Western vision of his country, who sought to reform Iranian politics and society, redistribute land, grant political rights to women (he even abolished the compulsory use of the Islamic veil) and solidify its rising democracy. It was these king of changes that led to his deposition, by conservative factions based on a strongly old-fashioned clergy that controls the country until our days. I also discovered that the rescue operation pictured was actually a joint effort of countries led by Canadian agents, not just an American operation made with the consent of Canada. The CIA only helped. Given these data, its easy to see that, under the traditional excuse \"hey, we're changing some things for dramatic purposes\", the film actually rewrites history, totally distorting the facts on which it is based. Cinema can adapt, change things or add others, but it must respect true. Going to the point of distorting the truth is always wrong.From an exclusively technical point of view, putting aside the story and the script, it's a very good movie, well done and enjoyable. Ben Affleck plays the lead role and gives the audience a restrained, serious and consistent performance. The re-creation of the old siege scenes at the American embassy was also very well done, though it only serves to accentuate the wrong idea that the film tells a true story. The costumes and scenery are excellent and the soundtrack fulfills its role satisfactorily."}, {"rating": "7", "text": "Maybe my expectations were too high, but Argo fell a little flat for me. Definitely an old-school spy caper with \"docudrama\" feel given the real story.  However several of the suspense/thriller moments felt contrived (though some were well done) including the ending act.  Ben Affleck was good, but probably miscast himself--which is a real career hazard when Actor turns Director. Really liked John Goodman and Alan Arkin as the Hollywood guys--overall, a pretty good film but as far as great (recent) spy capers to me: Tinker Tailor Solder Spy and the Bourne movies hold the top honors"}, {"rating": "3", "text": "A very mediocre piece of U.S patriotic drama. That the film took out the Oscar for Best Picture is a sad reflection on the dim witted fervour of The Academy. Despite an honest opening sequence that attempts to give some sketch of the destructive involvement of the CIA in Iran, the film plunges straight into an overt juxtaposition of idyllic American civilisation and the barbarism of the middle east that is rife and disturbing. The vilification of the Iranian people and the shallow representation of the context of the tragic circumstances destroys the integrity of the film on all levels.\rThere are some acute performances in small places, but with Affleck on screen most of the time, everything is rendered pretty flat and monochrome. Shocker."}, {"rating": "6", "text": "Argo has been praised by both critics and audience alike. Bit surprisingly, as despite being better than average political thriller it is difficult to believe it would be looked back as Oscar-winning classic. It has inaccuracies and dramatizations which have too much of a scripted feel, given the story is based on real events."}, {"rating": "5", "text": "I had very high expectations for this movie and unfortunately was disappointed on most levels. First the good, this movie looks great. I love the feel of the period in this film. I also think this film was incredibly acted, every performance is spot on with ironically the exception of Afflek. He is however not bad, just the worst of a very strong group. Of particular note is the performance of Arkin, who eats up every scene he is in. This might be my favorite supporting performance of the year. Where does this movie fall short? First the dialogue is flat for me. Especially for a movie that is trying to be witty and hip. Second there are many scenes in this movie that are absolutely implausible. I wont go into details but in the last third of this film their at least half a dozen scenes that completely removed me from the reality that this film is trying to convey. This is inexcusable in any film, but magnified in a true story. Very disappointed in a movie with so much potential."}, {"rating": "2", "text": "This is a boring story. A CIA agent flies a commercial airliner into Tehran, and flies out two days later with six endangered Americans. There is no firefight, no border crossing, not even a romantic subplot. The entire appeal of this movie is that it is historical  \"based on true events\" says the promo  but it turns out the movie has little to do with what actually happened in 1980. The CIA played a small part in the rescue, the Canadians did all the work, and most of the scenes are complete bunk. Given the lack of historical content, Ben Affleck could have thrown in a car chase or two, a \"traitor within\" subplot, or maybe had the 747 pursued by Iranian fighter jets and chased off by a Sopwith camel. Better yet, have the aliens from Argo intervene on behalf of the good guys (assuming that is us). It's all crap history anyway."}, {"rating": "6", "text": "Yes I'm going against the grain here.  Overated, overated, overated. Would be alright at home on the couch. I found this movie quite boring. The script was unintelligent and flat.  Slightly nail biting toward the end but nothing like other reviews are stating.  With a good script and far more character development this could have been great, instead it's only OK...just.  I should have waited for the blu ray..."}, {"rating": "6", "text": "I cannot believe how overrated this film is. Sure it create's the world and clausterphobia the hostages are living in . Another quality of the film is in the riot sequences it takes the camera and puts you in the middle of the madness for this reason it is entirely indicative of it's time and place. Is this enough? Sure some of the humour is funny but it is not enough to carry the film. The story is so bland and never embellished except at the end when it finally gains momentum and starts to thrill. I know it's a true story and it wanted to stay true, but they needed to tell it in a more interesting way. If you had seen the trailer you basically knew everything about the movie. No twists or turns here most of Argo's runtime is just boring."}, {"rating": "10", "text": "\"No question and hands down one of the best films of this year. Argo is an award contender that's for sure. With Affleck's fantastic direction and an amazing in depth story. Argo is a movie were going to be talking about for years and years to come.\"  A+"}, {"rating": "5", "text": "Apparently film critic Leonard Maltin liked Argo and is quoted as saying, “Don't get your history from the movies.” Maybe it would be better to say, “Don't put history in your movies if you don't get it.” Argo was a good film but it wasn't about what it claimed to be about. If you're going to fiddle with very minor historical moments, maybe no one will notice or care, but this was a major event in recent American history. A short summary of what never happened--there was no trip to the Bazaar, which would  have been too dangerous; the six were divided up at the homes of two Canadian officials, not one, and they all liked the idea of the movie production team as their cover; the airport screening went off without a hitch--no one confronted them and no squad cars chased the plane down--the only tension was  the announcement that there would be a 1-hour delay because of mechanical problems. However, after the plane cleared Iranian air space, everybody cheered. They got that part right. Some feel that Iranians have a right to object to the stereotypical portrayal of their citizens, and Canada feels that the CIA is being made to look like the heroes, when the Canadians did most of the work, which included three months of preparation for the final coup. A scene at the end of the film gives the erroneous impression that Canada had to be given the credit because no one was allowed to know that the CIA was involved, in which case, it sounded almost like Canada was taking the heat for the CIA rather than being lauded for heroism. Ben Affleck is a good director and a good actor, but his fantasy version of the story should have been filmed  as fiction and not fact. Argo worked well when it showed insiders being caustically critical of how a Hollywood production is run behind the scenes. (That would make a good movie by itself.) The film might have been a good thriller, but when you go into it knowing that the most exciting part, the airport clearance and chase at the end, never happened, it's not that thrilling. It's boring. In any case, the film has nothing to do with the American government's view of the episode; it's just trying to be pure Hollywood entertainment, using all the old tricks that all directors and screenwriters use to lure people into the theaters so that the studios can make money. And given how many bad films are being released lately, a film that shows directorial skill and tells a good story ends up being exaggerated to the point where it wins Best Picture. Argo was not the best picture, but the pickings were slim. They couldn't even come up with ten selections at the Oscars--they had nine, and one movie, Amour, was listed twice under Best Picture and Best Foreign Picture. In the end, no one should be insulted by Argo--it's not worth it."}, {"rating": "5", "text": "Ben's Argo and Lance's Medals\r What do these have in common? Both generated great gobs of money, both represent a dramatic distortion of the truth, both take another significant chunk out of American credibility.\r It is bad enough that a majority of America receives its education (17th or lower in world ranking) from movies, in Argo's case  \"based on a declassified true story\". When Ben claimed, in a recent interview, that the reason the Canadians integral role (90% Canada/ 10% USA  according to president Jimmy Carter and those actually involved) in freeing the hostages was not represented truthfully, he brushed it off quickly by commenting that \"there was not enough time to fit it all in\".\r In other words, for Ben, making the Americans \"centre of the universe\" even under the guise of docudrama, trumps truth. The reality is that the small role the CIA did actually play, had the real potential of getting the hostages killed on their way out of Iran. Historically (pun intended) the CIA espionage folk put a wrong date on the passport stamp  which if not detected, and altered (again by a Canadian) would have meant instant detection, and potentially certain death on their way out of the airport  not to mention what would have happened to the Canadian embassy personnel.\r Dramatic license must be extended to any historical account for time constraints or the inevitable lapse in research, however, when the focus is to distort and or pervert the truth, everyone involved suffers.\r Ben in recent award shows, still attempts to use his youthful ignorance and surprised-face to pass off this travesty of history. I don't buy that, or the movie  nor should anyone interested in the truth. Historical accuracy can be every bit as dramatic and entertaining as BS with the added bonus of attracting a wider audience and staying on the charts for many more years.\r No doubt, all those, who have or will receive monetary gain from this schlock will rally to its defense, somehow. There is no defense, however, for the damage inflicted on the historical record, those who buy into that distortion, or the Canadians, and the lives of six US hostages whose lives depended on real intervention by real people.\r Ziek  bamfrmcan"}, {"rating": "7", "text": "This supposedly movie of the year wind up being a lackluster cinematic bust. It may intrigue a certain type of audience, but it's not exactly a well-rounded movie that everyone could enjoy. The thing is even if it was a factual story,  the structure and directing made it feel too homogeneous. The movie also lacked suspense until the end, and to do so they had to even exaggerate the scene, because, in reality, they got out easily. The character development, especially those who were rescued, was weak. There wasn't a genuine reason that made a viewer completely want to see them be rescued other than..well, they were captured. If they were going to exaggerate something, it should have been where they were had to stay. Seriously, it didn't even look where they were living was that terrible. At least do something that makes them appear they're in serious peril.\r After Ben Affleck's greatly crafted movie, The \"Town\", and after the well-received praised this movie was getting (higher than the Town as a matter of fact), the expectations perhaps were too high. Even if they were, this movie was nothing more than a mediocre capture and rescue true story, though. The problem with true stories is people tend to proceed they are automatically better than fiction stories a lot of times. Well, I went to school yesterday and then watched basketball. That's a true story, but it doesn't mean it's intriguing enough to make it a film about it."}, {"rating": "5", "text": "To sum up: narration hell. Let me explain: Although there isn't an actual \"narration\", this film just tells you the story. It doesn't show it. Just as having a film narrate everything important, Argo does the visual equivalent. There is no sense of urgency, no tension, nothing. It starts flat lining immediately, and refuses to respond at all. It's a completely comatose film. I mean, it's reasonably watchable, but also preeminently boring. The intro notes that the US caused the whole situation in Iran by supporting the Shah (who lived lavishly, murdered people and oppressed the rest of them). Then they hid him in the US when he was wanted for crimes in Iran. However, they still manage to turn this into a \"the US is awesome\" film. It's insulting."}, {"rating": "10", "text": "What can I say about this movie.   It's an engaging view into the workings of the CIA, the events during the Iranian hostage crisis, the life inside a foreign counsulate and Hollywood.   While we get mainly glimpses, they are so well executed that we come out of this feeling like we have the insider info on how they all work.\r The performances are riveting as well as very real in their delivery.   I never felt like I was watching actors in a movie, I was watching things as they transpired almost 40 years ago.\r Ben Affleck has solidified himself as a great actor and director with Argo."}, {"rating": "6", "text": "I just don't see what the fuss is about. This is a straight line story with little suspense and no other developed subplots. I found \"The Town\" much more entertaining. Frankly, this could have been a made for tv film. Riveting is the last word that comes to my mind when I think of this film. Maybe Hollywood just wanted to pat itself on the back for the role it played in a great service to our country."}, {"rating": "8", "text": "If I mentioned that Ben Affleck was a good director a number of years ago, a lot of people would probably smirked at me.  Let's face it though: as an actor, Affleck has limited range. But as a Writer and Director, he is actually pretty good.  Affleck creates the same films that Michael Mann creates, grittier but somehow better in many ways.  Characters are developed nicely; he never forgets his audiences so his films are tightly structured.  His films are still stylish but  gritty and realistic at the same time. Mann's films, on the other hand, seemed to be drowned too much in style, losing its narrative drive.  Argo is the best example of his talent, and one of the better films coming out this year.  Not the Best Picture, but deserves a nomination for it in this year's Oscars."}, {"rating": "8", "text": "Is this a good movie? Yes, definitely. The acting is spot on, even from the smaller role or even lesser known actors and the set pieces are breathtaking. However there are certain spots of the movie that drag, an others that transition too quickly from thrilling to calm. I wasnt alive during the Iran Hostage Crisis, so maybe I lose some of the feelings that are attached to this movie. But in a year of average films, this is at the top."}, {"rating": "3", "text": "how the critics gave this movie an 8 out of 10 is beyond me! i guess critics are into incredibly bland movies or they must've got paid to give this movie a high score! this movie drags; the dialogue is uninteresting, the pace drags, there is no suspense or thrills! the only thrill i got was the beginning of the movie and when theyre riding through the crowd of angry israel's! other than that though this movie was bland, dry, and devoid of any suspense or thrills! the only reason why im not giving this turd bomb a 0 out of 10 is because the popcorn they gave me at the theatre was damn good! i got more entertainment hearing the crunch of the popcorn as i chewed it! i got more entertainment out playing with my thumbs!\r 3 out of 10!\r the only postives i can give this movie is the beginning, the bus ride, and the popcorn i had while watching the movie! send this piece of  back to the vagabonds of hell from whence it came from!"}, {"rating": "10", "text": "Out of over 580 films I have seen and reviewed (not all on here, yet!), there have only been 31 films that I have given a 10. \"Argo\" is the 32nd. I watched it at the Toronto International Film Festival and went into it without actually having a clue what it was about, which was great because I had no expectations. Soon enough, I ended up being completely immersed in the world of the American escapees from the Embassy. Ben Affleck has managed a feat that only a few actors have - giving an excellent performance as an actor and excellently directing a film at the same time. The entire cast, actually, is fantastic. There is not a single moment that does not have credible acting, and one must give kudos to John Goodman and Alan Arkin for kind of 'stealing the show'. But in a film with such superb acting, it is a rather hard thing to achieve, so that goes even more to their credit. The cinematography is very subtle and very appropriate, with perfectly chosen lenses that transport the viewer into the actual space that the film portrays. Production-wise, overall, the film is very effective. Great costumes, makeup, solid score, everything works well. The screenplay is very well written and manages a fine balance between suspense, drama and humour, which is a very difficult to achieve. \"Argo\" is one of the rare films that actually manages to make you sympathise and feel with the characters very fast, and basically transports you there with them. It feels as if we are in that same Canadian Embassy in Tehran, in that market, and on the airport. After leaving the theatre, I found myself looking suspiciously at people on the street, thinking who'd figure out that I'm not one of them. And then I realised - I am one of them. I'm not in the film myself. I've been completely engrossed in the film, and that is noteworthy. This is Ben Affleck's triumph on so many levels, and he is setting an extremely high bar for his follow-up projects. Let us hope they are half as good as \"Argo,\" since that would still provide for some very good films. 10/10!"}, {"rating": "4", "text": "I thought this was a bit of a let down. Loved the Town but Argo wasn't gritty enough for me. Some Iranian security guards with some intelligence would have been nice. The film also plays up the çoolness' of making a fake movie, which detracts from the seriousness of the subject matter for me. Funky music as they arrive on their fake set, hmm. And 'Argo f!@k yourself' gets very annoying. Big let down. And we all know how it's going to end. Amazing thing they did though."}, {"rating": "0", "text": "I don't understand why this has such great reviews. It was a boring as all hell patriotic American BS movie that drags along until the end. Boring story."}, {"rating": "0", "text": "After all the talk, I thought well maybe Ben Affleck did something good after all, but I was sceptical. I was right. This movie is just one big orgy of tough man tough talk, which really gets annoying after 20 minutes or so. There is completely no character development in any of the hostages. I had a hard time not falling asleep. What an incredible bore."}, {"rating": "7", "text": "Argo is a spectacular movie full of tension, drama and tricks. First, we notice that the story is very original, not only because of the invasion to the US embassy in Teheran, from where six people escaped, but also because of the idea that the CIA has to take them out of Iran, make a fake movie so this people act like the film crew. Second, everything becomes more interesting when we see that the film is based on true events. Third, is amazing the levels of tension that reach this picture, every detail fits perfectly in the puzzle that created Ben Affleck to reveal the outcome. Fourth, there are some great scenes that show the contemporary modus operandi and mentality of the American people; like at the invasion of the embassy, the workers must destroy all the confidential documents instead of run away; another one is in the first reunion of the CIA when is noticeable that this men do not know or care of knowing about other cultures than their own; and the last one is when then protagonist goes to Hollywood and discovers that no one actually works there. Fifth, its surprising the idea of the story inside a story, because the ending of the plot in the fake film is the same that the one in the real picture. Finally this is one of those pictures were the whole cast perform good, highlighting Tony Mendez, the six that escaped and the maid of the ambassador. With an excellent direction this is definitely an outstanding film. Argo **** yourself."}, {"rating": "9", "text": "Great movie. It's action without punches and guns (at least for the main characters), and the acting is outstanding. Ben Affleck has a clear possibility to get at least a direction nod for the academy awards, and Cranston, Goodman, and Arkin have over the top performances too. A must see."}, {"rating": "10", "text": "A nice suspense throughout the movie, especially nearing the end.  It is one of those movies that builds up every last detail then puts it all into action in a short amount of time at the end, and while you might want to see the plan finally put into action, the details they keep adding keep you interested throughout."}, {"rating": "4", "text": "The movie started mildly fast, got very slow, then very intense. The only reason I saw this movie was because im a huge Bryan Cranston fan, and many people were saying the film was going to win best picture. This movie has two storylines (thats the only word i could think off to describe it) The one about the hostages, and the one in Hollywood and the C.I.A , about them trying to make the movie. I would give the hostage situation a 3 out of 10, and the Hollywood story a 7 out of 10. The airport scene at the end, I would give 9 out of 10 that was very intense, and the scene was very well written. I would give the acting 6 out of 10 varying from actor to actor, directing 5 out of 10, and writing 6 out of 10, and overall 4 out of ten."}, {"rating": "5", "text": "I remember this period and this incident, and so found the movie interesting. But I'm surprised at how few critics have quibbles with the historical inaccuracies! (See articles in Slate, Wired and elsewhere for details.) Already a thriller low on thrills -- we know how it ends, obviously -- it tries too hard to fabricate them. Enjoyed every performance more than Affleck's, which was low-key almost to the point of tedium."}, {"rating": "10", "text": "I think this might just be Mr. Affleck's masterpiece. Gone Baby Gone was great. The Town was Excellent. This is a near flawless film, the kind I cannot watch to look for mistakes because it is so absolutely engrossing start to finish. The performances, the execution, the script, the freshness of an important ingenious story to tell of a historical moment. All involved brought their A game for this one. Just see it and if you walk out without being able to describe how you felt about your experience with Argo, just accept that it just did it's job. It is what Cinema is all about. ANd if you walk out feeling a bit underwhelmed from the experience, that's okay. Give it some time to ingest and think about every detail. Then see it again. Alot of films beg to be seen more than once. Just remember, a film that leaves you thinking about it afterwards just did it's job. See Argo Now!!!"}, {"rating": "9", "text": "This is an amazing story if you enjoy sitting on the edge of your seat most of the time!  The movie starts out fairly quickly, and it gets more and more exciting as the movie moves forward.  The movie goer is never really sure what the end of the story might be (unless you remember the international news story).  If you like movies about current history, this will fascinate you and keep you on the edge of your seat with excitement.  Wonderful movie!  Expect to be thrilled with all the action and suspense."}, {"rating": "0", "text": "There should be restrictions on the use of the expression \"Based on a true story\" because in this case, lies far surpass what really happened. This movie represents everything that is shameful about American narcissism. This work has twisted the facts in favor of the U.S. image without respect for those who risked more than their reputations. I know it is a product of hollywood not considered a documentary, but if the goal is creating a fanciful story, it is better to let history undefiled. Finally, it is surprising that so many have acknowledged the work with so little knowledge (newspapers, academy awards).\rCanada, non-revolutionary Iranians, New-Zealand had way more to do with the results than Tony Mendez."}, {"rating": "9", "text": "I'm sure it was difficult to weave an element of comedy in with the dramatic and the thriller aspects, but Affleck does it well. The movie is not as dramatic or as impactful as The Town, but for a movie based on  true events, with its limiting nature, it's one of the best I've seen.  They effectively establish 1980 Iran as a truly horrific place, and by doing this, the escape sequence made me feel as if my heart were going to beat out of my chest.  For a movie like this, that's a good sign. Goodman and Aarkin are outstanding.  As a side note, I wish the trailer had been a bit less comprehensive because most of the best and funniest lines I'd seen before. This is obviously true of many movies - you have to sell the darned thing - but it was glaring here. \"If I\"m going to make a fake movie, I'm going to make a fake hit!\" Yes, it's funny, but I'd seen it 10 times before going in. Finally, the fact that this movie was released within weeks of the Libyan embassy murders made the opening sequence all the more chilling.  I don't mean to suggest the movie was better because of the timing visa vis the deaths of civil servants, but it made the film even more relevant.  Bottom line: it's not high art, but it's very entertaining."}, {"rating": "8", "text": "With Argo, Ben Affleck continues to display his maturity and growing talents as a director.  Everything from the slowly escalating tension to the authentic 70's look and feel of the film is a testament to his command of the material.  As a performer, however, he is the film's weakest link.  His portrayal of Tony Mendez is never short of bland.  Fortunately he is overshadowed by the excellent ensemble surrounding him.  I can only imagine at how good Argo could have been if he had stayed behind the camera where he is becoming increasingly comfortable."}, {"rating": "9", "text": "Ben Affleck has proved for a third time that he can direct. After the low key drama 'Gone Baby Gone' and the powerful thriller 'The Town', he comes with this well crafted piece, which is politically charged, has quickening pace and good dose of humor but above all filled with nerve-racking suspense. And like Clooney's (the other actor turned into one notable director) middle eastern political thriller 'Syriana', 'Argo' is Ben's best film yet."}, {"rating": "8", "text": "In 1979, when Iranians stormed our embassy and took 52 people hostage, 6 Americans escaped to the Canadian Ambassador's residence. After months, CIA agent Ben Affleck devised a plan to sneak them out of the country: pretending to be a crew scouting a new film. This historically-based story is told thru involving scenarios, some humor and a quietly tense escape. The characters are uniformly bland, but the hair and wardrobe were right-on 70s. While this is not a riveting or fast-paced espionage adventure, it is a low-key, well-crafted and fulfilling experience. NOTE: Be sure to sit thru the early credits to see a wonderful montage of photos that inspired the movie."}, {"rating": "6", "text": "If you strip away the historical and political relevance of Argo and the knowledge that the events in the movie are based on reality, you are left with an average thriller.  The characters in this movie are shells of characters; I could describe each of them in a single sentence.  The plot of Argo eventually turns into the repetition of an age old formula: build suspense, make it look like the bad thing is going to happen, make the good thing happen at the last second.  Rinse and repeat.  It's boring and predictable and repetitive and entirely unoriginal.  I think it's worth watching, but I doubt I'll ever watch it again."}, {"rating": "10", "text": "This is a glorious machine of a movie in which everything works.  The problem is how to generate suspense when you know the ending from history.  They have found a way==it's all performance and superb camera work.  This is a big jump from Affleck from the smaller movies he has done so well, and his cast is superb.  John Goodman and Alan Arkin should share an Oscar.  Irresistible."}, {"rating": "7", "text": "How can one not enjoy Argo. Sure we all know how it will end, but the story was too good and the film was too well made to let that get in the way. All petty quibbles about historical inaccuracies aside, Chris Terrio"}, {"rating": "6", "text": "This movie is obviously overrated and mediocre. Total lack of 70's atmosphere, the Hollywood side story is very weak and unconvincing, most performances give you the feeling of watching a History Channel documenrary. The film is boring and the adrenaline in the airport scene is boosted with cheap tricks rather than fine and skillfull movie direction: the Iranians realize the truth at the exact moment the Americans flee the country. How convenient is that.... Best motion picture of the year award? seriously??? LMAO...."}, {"rating": "8", "text": "Argo represents the American purposes: get a plan to save their citizens, no matter what. Ben Affleck shows himself as a great director and actor too, once again. Argo is pure action; an amazing piece of thriller that makes you wish so bad that they will arrive in safety to their country. More than dedication, Argo shows the real matter to the Americans."}, {"rating": "3", "text": "Why did Affleck play Tony Mendez?  Mendez is a shorter, chubbier man of Mexican decent.  Luiz Guzman would have been a great pick for the lead.  Affleck is just trying to make a name for himself and you can't blame him for trying to do so but in the process turned in a very dull performance.  The feel of the period was nailed from outfits to mustaches but the acting was hollow.  No one stood out.  Better left as a documentary of archival footage than a scripted movie.  Gaah! Affleck.  Expect no change here despite everyone and their mother urging you he's changed his ways."}, {"rating": "0", "text": "Entertaining propanda flick.  But why the need to constantly churn out these US Propaganda political/war films? And with the US on the cusp of yet another bloody, wasteful war? Enough already!"}, {"rating": "9", "text": "Featuring a slew of brilliant performances and one of the most nail-biting climaxes I've witnessed in quite a while, \"Argo\" proves to be a brilliantly written and superbly directed thriller/drama."}, {"rating": "8", "text": "Argo is tense and exciting with well written characters. The recognizable names help push it to greater heights. I give this film 83%."}], "recommendations": ["the_big_short", "the_social_network", "valkyrie", "the_monuments_men", "tinker_tailor_soldier_spy", "patriots_day", "zero_dark_thirty", "the_1517_to_paris", "american_gangster", "a_most_violent_year", "blackhat", "spotlight", "13_hours_the_secret_soldiers_of_benghazi", "hereafter", "deepwater_horizon", "the_good_shepherd", "child_44", "beirut", "the_accountant", "closed_circuit", "sicario_day_of_the_soldado", "hotel_rwanda", "mark_felt_the_man_who_brought_down_the_white_house", "hugo", "master_and_commander_the_far_side_of_the_world"]}