{
  "id": 3034,
  "title": "Arlo the Alligator Boy",
  "starring": [
    "Michael J. Woodard",
    "Mary Lambert"
  ],
  "runtime": 92,
  "genre": [
    "Animation",
    "Comedy",
    "Family"
  ],
  "description": "Upon learning that he is from New York City, a wide-eyed boy, who is half human and half alligator, decides to leave his sheltered life in the swamp and search for his long lost father. A musical adventure.",
  "releaseYear": "2021",
  "mpaaRating": "NR",
  "imageUrl": "https://image.tmdb.org/t/p/w500/oOQMJM7G2W8v2AEK722k8welIJY.jpg",
  "categories": {
    "plot": 4.0,
    "acting": 5.0,
    "ending": 5.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 4.0,
    "funny": 5.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "8",
      "text": "Before diving into \"Arlo: The Alligator Boy\", I anticipated another piece of children's media where the plot and lessons being told would overly cater and pander to the current mindscape of the popular consciousness. Rest assured, those suspicions were laid to rest. \"Arlo...\" arrives with enough whimsy, emotion, and catchy songs that help make it a memorable and charming musical for all ages to dig into."
    },
    {
      "rating": "8",
      "text": "Good animation, good songs, good characters, just an overall good movie that I would recommend!"
    },
    {
      "rating": "2",
      "text": "Good animation, but trash content where writers don't seem to understand what should get inside the mind of little kids. There is drinking and bridge jumping after a failure. Those who wrote this don't seem to understand the difference between plots for adults and plots for kids. \"My family are my friends\", choosing friends over family, is not the right message to pass. Vilifying father figures is not the right message to pass. There were a lot of things in this that souldn't be impressed on the little one's minds, mostly because it's our grown up world's problems, not kids'. It's not that kids won't like this, it's an animated musical. The problem is what it is teaching."
    },
    {
      "rating": "10",
      "text": "Arlo The Alligator Boy, I love it, That Arlo reminds Me of Me it rely touch my hart. Its the tape of Move that I well watch over and over gain."
    },
    {
      "rating": "8",
      "text": "A Cute Little Musical With Great 2D Animation Nice And Catchy Songs And A Great Message"
    }
  ]
}