{
  "id": 1765,
  "title": "Armageddon",
  "starring": [
    "Bruce Willis",
    "Billy Bob Thornton"
  ],
  "runtime": 151,
  "genre": [
    "Action",
    "Thriller",
    "Science Fiction",
    "Adventure"
  ],
  "description": "When an asteroid threatens to collide with Earth, NASA honcho Dan Truman determines the only way to stop it is to drill into its surface and detonate a nuclear bomb. This leads him to renowned driller Harry Stamper, who agrees to helm the dangerous space mission provided he can bring along his own hotshot crew. Among them is the cocksure A.J. who Harry thinks isn't good enough for his daughter, until the mission proves otherwise.",
  "releaseYear": "1998",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/eTM3qtGhDU8cvjpoa6KEt5E2auU.jpg",
  "categories": {
    "plot": 5.21875,
    "acting": 6.071428571428571,
    "ending": 6.0,
    "soundtrack": 8.0,
    "cinematography": 0.0,
    "familyFriendly": 6.0,
    "funny": 6.3,
    "action": 7.066666666666666
  },
  "reviews": [
    {
      "rating": "5",
      "text": "A pretty mediocre movie. Although saying that about a Michael Bay film is about as big a compliment as I can give him. Music is decent at times. but just isn't all that thrilling."
    },
    {
      "rating": "5",
      "text": "A regular movie , because in some scenes were exciting , but very boring with the rest , but the fact of dying Porun asteroid is latent but not overestimated Michael Bay a bad run of a director, but there is no way to add another opinion."
    },
    {
      "rating": "4",
      "text": "The latest entry in the \"let's kick some asteroid butt\" stakes is a doomsday countdown spectacle from producer Jerry Bruckheimer and \"Bad Boy\" Bay that extends their commitment to extreme tosh. With no messing about, this opens on the demolition of downtown Manhattan plus the imperilment of a nice little dog, all within a few minutes. Yikes! It's a meteor shower, heralding \"the worst parts of the Bible\" to come, and the first of a thousand-and-one big bangs: whenever there's a lull in proceedings, there's a wake-up call such as the splattering of Shanghai or - a highlight - the annihilation of Paris.\r At the obligatory scientific-military crisis conflab with NASA's director (Thornton) we get a refresher course in extermination events. This particular cosmic uh-oh, Asteroid Dottie, is the size of Texas and will hit planet Earth in 18 days, leaving not even a bacterium alive. Our only hope is for a rock rendezvous mission to drill a hole deep into the sucker and nuke it at the core. Hence the urgent need to locate \"the world's best deep-core driller\". Cue Bruce Willis as Harry Stamper, a rowdy, globe-trotting maverick inspired by famed oil well firefighter Red Adair. Harry graciously agrees to save the world - like ya do - but only if he can take his own team with him.\r Enter a ragtag bag of roughneck, rambunctious and ex-criminal cowboys who include Harry's calm best buddy (Will Patton), a gigantic muscleman Ving Rhames lookalike (Michael Clarke Duncan), a Zen-babbling young dude Matthew McConaughey lookalike (Owen Wilson), the handsome reckless stud (Affleck) - who's in love with Harry's gorgeous, headstrong daughter (Tyler) - and a wisecracking weirdo genius geologist (it could only be Steve Buscemi). Et voila, it's The Dirty Dozen in space! Except there are eight of them. Plus some Dudley Do-Right astronauts to shudder at the rogues' \"wrong stuff\" and shepherd them to where a driller's gotta do what a driller's gotta do. That's after they've raised hell in training, milked their comic schticks so long you hope all of them die, and bade their tender, tearful farewells, amid slo-mo homages to sundry heroic space films.\r In addition to the two credited with the screenplay, Jonathan Hensleigh (The Rock, Con Air), and J.J. Abrams (Forever Young), a veritable mob of \"serious\" screenwriters - including Robert Towne, Paul Attanasio and Scott Rosenberg - was deployed to provide action ideas, key dramatic sequences, wisecracks for the boys. Collectively they should be cringing, because much of this opus has the basic content and tone of a Coca-Cola ad: extras clustered for intermittent, picturesque group poses at the Taj Mahal, a Midwestern farmstead or a Balkans village, eyeing the skies and sharing the moment. There are also abundant gag-making shots of stoic principals framed by the Stars And Stripes, hammering home the inadequacies of the Russians with their delapidated spaceware, or anyone else on earth, to undertake the task at hand.\r A long halfway in, our hooligans finally lift off in two shuttles with their astronaut minders, and everything that can go wrong does, with bells on. There can't have been one explosives guy in Hollywood who didn't rack up major overtime pay while a rendezvous with the Mir space station adds a wacky space cosmonaut (Buscemi's lethal Fargo henchman partner Peter Stormare) to the team.\r Had Armageddon foregone the comedy and corn, the film would have been an hour long instead of the two-and-a-half in which some potentially thrilling momentum is lost. But Bruckheimer's genius for posturing, vulgarity and cheap sentiment fun rivals Cecil B. DeMille's (hey, he even uses Charlton Heston as narrator!) To its credit, more happens in the first five minutes of Armageddon than in the whole of Deep Impact, and if you get off on global catastrophe you'll enjoy this more.\r It's a million laughs (many of them unintentional), and it even has a mildly revolutionary ending. In a dismal summer for popcorn movies, this epic may be the silliest but still looks like the best shot."
    },
    {
      "rating": "5",
      "text": "Of course, Armageddon shows the audience how beautiful are the visual-effects nowadays, and it's full of heart and honest emotions. Sadly, this film contains a little kind of thin premise and unremarkable characters, with a thrilling story-telling but a, critcly, terrible idea, showing a real future moment in a wrong way."
    },
    {
      "rating": "5",
      "text": "Producer Jerry Bruckheimer knows his core audience is small-town America, so he panders to them. He plays to their simple, fierce patriotism, uneducated view of the non-USA world and diminished, MTV-assaulted attention span. Consequently, he makes big, loud and successful blockbuster movies with stories every toddler can follow, told with overblown action-speak dialogue. It's both his strength and his weakness.\r To this end, Armageddon flaunts the traditional disaster-movie stencil of building up the characters for the first 30 minutes. But we're too easily bored with that: we need faster, louder, bigger things to keep our attention. And Armageddon delivers: a space shuttle explodes and New York City is rocked by asteroid fragments that sever skyscrapers and send buses spinning through the streets in flames. It's a blockbuster opening made in heaven.\r And while other disaster films are still mapping out their relationships, we flit frantically between giant telescopes, presidential meetings and NASA brain-storms, finally settling on an oil rig, where (for beautiful-daughter-related reasons) boss-man Harry (Willis) is chasing rebellious young redneck AJ (Affleck) around with a shotgun. It's an elephant syringe of attractive characters and plot exposition, speedballed in about the same time it takes to knock-up a Pot Noodle. \"Breathless\" doesn't even come close to describing the opening third.\r But then, director Bay's pop-promo past comes back to haunt him as Armageddon fails to provide a satisfying pay-off. The set-up, delivered in sound-and-vision bites, is exhilarating, just as oil riggers being rounded up by the FBI in strip-joints looks great in shaky-cam. But Bay's talent is in capturing single, explosive moments, such as New York's swirl of fast-cut, high-octane devastation.\r Once the shuttles are in flight, what's required (and distinctly lacking here) is a more linear method of storytelling. Between the unusual asteroid location and the rat-a-tat editing, it's hard to tell which characters are in which of the space shuttles, let alone what they are doing. A potentially great landing approach, for example, leaves you disorientated and squinty-eyed rather than high on adrenalin.\r Plot ceases to exist and is replaced by a number of identikit action sequences that could have appeared in any order. There's a technical hitch, a crazed driller (\"My God, he's got space dementia!\") and a meteor shower, but no sense of impending doom. Compounding this modular feeling, events are sprung on the viewer with no build-up at all. \"Look out! Meteor! BAM!\" Another fatality. \"Look out! Gas pocket! BAM!\" It's supposed to be thrilling, but it's just confusing.\r Thus the first act makes promises that the next two can't keep. It's annoying, as there's so much here to like: the ensemble cast is uniformly engaging, the dialogue is as funny and sparky as it is unlikely, and the effects are astonishing. Want to apportion blame? Then hurl it at Bay (for his over-editing) and the writers (for forgetting to insert a central plot).\r Since it's an American film, they're allowed to save the world single-handedly. But do they really have to deck out every cute child in US-flag T-shirts, set every press conference against Stars And Stripes backdrops, and portray every other race in the crudest stereo-typical terms, with Indians in turbans gathered by the Taj Mahal and Italians on scooters outside pavement cafés? On the strength of recent releases, it would seem that they do.\r Big explosions and WWF-style characterisations make this perfect fodder for excitable 12-year-olds. But, with a plot-free second half, it's more a $140 million pizza-and-six-pack film than a worthy con-tender to action classics like Face/Off or Die Hard."
    },
    {
      "rating": "8",
      "text": "You know those original blockbuster movies that have limitless fun and amazing scenes? Well, the space blockbuster \"Armaggedon\" is on the top list for the category."
    },
    {
      "rating": "4",
      "text": "Armageddon's Charlton Heston-voiced opening narration, an account of how an asteroid seems to have led to the extinction of the dinosaurs, is an ominous touch in every sense of the phrase. The text of the speech sets the stage for the threat of mass destruction promised by the movie's title, while Heston's voice assures that the threat will be addressed in the most American way possible. And it is, thanks to a photogenic, ragtag bunch of misfits headed by Bruce Willis. Willis plays the world's greatest oil driller, recruited by NASA head Billy Bob Thornton to plant a nuclear bomb in the belly of an earthbound asteroid. Will Willis overcome his creepy attachment to his daughter (Liv Tyler), and reconcile with her oil-drilling lover (Ben Affleck) in time to save America and the rest of the world? What suspense there is in Armageddon naturally lies elsewhere. Will, for instance, director Michael Bay (The Rock) continue to find an excuse to place an American flag in every other shot? (This at one point includes a shot showing that the patriotic astronauts have gone to the trouble of planting one on the asteroid they intend to blow up.) Will Tyler be photographed in a way that doesn't make her look as if she's posing for a Revlon ad? Will this be the one film featuring a ragtag bunch of misfits in which the lovable fat guy makes it out alive? Fortunately, the near-incomprehensibility of the numerous action scenes and the disposability of the rest of the movie allow plenty of time to contemplate such things. The entire second half seems to consist of nothing but vibrating close-ups of heads shouting lines like, \"I'm not leaving without my men!\" and \"We're jumping over that canyon!\" As with The Rock, Bay directs Armageddon in a way that seems more concerned with constantly assaulting the senses than anything else, hoping perhaps that the quick cuts and constant explosions will distract from his film's many flaws. Unless you're extremely easily entertained, they probably won't."
    },
    {
      "rating": "4",
      "text": "There are worse disaster movies out there, but there are also shorter ones (the popcorn tends to run out about halfway through the film, and then what do you do from there?)"
    },
    {
      "rating": "0",
      "text": "I hate this movie. I hate this movie. I hate this movie. I hate this movie. I hate this movie. I hate this movie. I hate this movie. I hate this movie. I hate this movie. I hate this movie. I hate this movie. I hate this movie. I hate this movie. I hate this movie. Wait- what do I think about this movie? Oh yeah. I hate this movie."
    },
    {
      "rating": "9",
      "text": "I loved this movie and think it deserves a much higher rating. It is one of my favourite movies of all time, and his everything in it that appeals to my taste of entertainment."
    },
    {
      "rating": "9",
      "text": "Armageddon isn't as bad as everyone says. I really do not see why everyone dislikes this movie. It isn't the best film out there, but it is entertaining. The thing that gets me furious is that critics complain that the movie isn't realistic. I say to them, \"Are you a movie critic or just plain stupid? Movies are about entertaining the masses (and making money), not the border of realism.\" This movie has been ridiculed for being too unrealistic. Yet when you see other live-actions that are clearly unrealistic (Jurassic Park, Gremlins, which are good movies), you praise the absolute heck outta them!\r Anyways, I felt that this movie had a great ensemble cast with the likes of Bruce Willis, Ben Affleck, Billy Bob Thornton, Liv Tyler, Will Patton, William Fichtner, Steve Buscemi, Peter Stormare, Michael Clarke Duncan (RIP), and Owen Wilson. These guys had great interaction with each other. Overall, I felt that this was one of Michael Bay's successful endeavors that is entertaining and fun to watch."
    },
    {
      "rating": "7",
      "text": "Decent movie as far as Michael Bay movies are concerned. I loved it as a kid but its just one of those movies where you grow up and realize that that alot of what makes the movie good, well, also makes it kinda dumb. The acting is choppy at times, the movie relies heavily on special effects, and the screenplay is just meh. The ending is really good and has always been a strong point of this movie"
    },
    {
      "rating": "0",
      "text": "Easily one of the worst big budget movies I have ever seen. Note, I'm comparing movies with similar budgets and I've seen em. This film has nothing. And I mean nothing. Explosions are like farts in the wind, nobody really cares. CG special effects do not effect me unless they are some what imaginative (such as: LOTR, FF-spirits within). I would actually go so far as to say that the 1 point it may have gained for actually making it to the big screen (this is the, you've got a point for writing your name on the test, kinda point) was negated by the worst script and ideas I've seen in a movie since... since... Well, even plan 9 seemed to have a better script. Point is, this film was EXACTLY like Micheal Bay filming himself taking a shit on the camera and telling us to eat it. Because for some odd reason, you lot did."
    },
    {
      "rating": "10",
      "text": "This movie is not bad, but not for everyone. Its an exciting thrill ride."
    },
    {
      "rating": "8",
      "text": "While Armageddon does suffer from a 'been there, done that' quality, it's still an exciting and twisting adventure with characters you'll actually care about. From the you know what the movie's going to be like; the main heroes will be going through the ups and downs of their journey to save Earth from total annihilation while communicating with the government and arbitrary love interests back home. While it never really picks up until the final few moments of the movie, the plot is good enough to hold the movie and the acting is decent. The CG is also very good for it's time and really gives the scenes in space some pop, especially if viewed on Blu-Ray. It definitely isn't for everyone, and you've seen most of what's here before, but if you want a good popcorn flick this movie wouldn't be the worst choice you could make either."
    },
    {
      "rating": "8",
      "text": "You have to push through the softer plot and be willing to go for a roller coaster ride to enjoy Armageddon.  For its time, this movie was outstanding when you consider the visual effects from 1998.  The cast is excellent and the tension is high or near-high the entire duration of the film.  Not everyone can love this film, and that's fine, but for me Armageddon was a summer flick that was years ahead of its time and still stands as a decent end-of-the-world action thriller."
    },
    {
      "rating": "9",
      "text": "screw the critics. go see this movie. it is that awesome!"
    },
    {
      "rating": "7",
      "text": "It was actually rather good, A little unrealistic but it wouldnt be a Michael Bay film if it wasnt. Acting was ok for the most part, A few people I didnt really enjoy on screen. Far too long and really could and should have been shortened quite a bit to make for a better film. If you can over look the obvious flaws, Its not that bad."
    },
    {
      "rating": "5",
      "text": "The movie is like a roller coaster, but it is one without the need of seat belts. The movie definitely has certain thrills especially in the front part but it is quite boring throughout . A movie to watch unless you have lots of time to waste."
    },
    {
      "rating": "6",
      "text": "Part of me cant help enjoying this movie despite it being one Hollywood cliche after another. The cast is believable with a special mention to Peter Stormare who is excellent as the Russian cosmonaut Lev Andropov. Not for everybody but a far better movie than Deep impact which was of a similar vein."
    },
    {
      "rating": "7",
      "text": "This is a pretty decent film with some great action scenes. the acting is a little sub par but by Michael bay standards it was very good. I really enjoyed it for what it was."
    },
    {
      "rating": "8",
      "text": "For a long time, I put off watching Armageddon because I always anticipated it being an overlong, dumb, explosion fest courtesy of Michael Bay. However, the fact that it is a part of the Criterion Collection gave me significant cognitive dissonance. After watching it, Armageddon is unabashedly stupid and if films such as Top Gun, Days of Thunder, and Independence Day, did not exist, I would call it the stupidest film of all-time. Yet, just as with those films, I am unashamed supporter of Armageddon. It may be dumb, but it is a film about human perseverance in times of turmoil and has a heart that is proudly wears on its sleeve.\r Though I would be hard pressed to call the acting good, it is never anything worse than average, which is just fine for the perfect example of when the Hollywood machine can churn out a film with a strong directorial vision courtesy of Michael Bay that showcases all that he does right. While it is dumb and loud, Bay's ability to create emotion, thrills, and tension never shines through better than in this film and he, unlike in other endeavors, gets overly side tracked by bad jokes or dumb plots. Instead, he stays honed in on what matters and, even better, the jokes delivered by Steve Buscemi from beginning to end all hit. In fact, they may be one of the best parts of the film.\r As with Independence Day, it is hard not be in awe of this film at times. A glorious piece of 1990s cheesy action, Armageddon is filled with impactful one liners that give you chills, action set pieces that thrill, and an uncanny ability to make me fight back tears while watching a film about exploding an asteroid by drilling a hole into it. The tender scenes between Ben Affleck and Liv Tyler, the interactions between Tyler and Bruce Willis, as well as those between Willis and Affleck are all heart breaking put together. Beautifully shot, orchestrated, and written, these particular character interactions stand out in a film that knows how to write camaraderie between its character, especially the drillers.\r While its action is obvious, the writing is really what elevates this. The plot may be dumb, but what is not dumb about Armageddon is its ability to create human characters with heart, passion, fears, and shortcomings. The development of their relationships and backgrounds is very impressive for a film of this type. This writing is what got it included in the Criterion Collection and it is not undeserved. The plot may be silly, but those behind the script knew what they were doing and knew how to write an action film. Plot be damned, Armageddon packs an emotional punch while Bay manages to expertly give weight and balance the romance, passion, and action in one deliciously put together spectacle.\r Armageddon may be one of the dumbest movies ever in terms of plot, but its writing and willingness to explore the bonds between father-daughter and grown men is an impressive feat for a blockbuster of this type. Color me surprised that this Michael Bay-led disaster was anything but a misguided attempt to entertain teenage boys. Instead stark contrast to initial expectations, Armageddon has a soul where its brain should be, which is more than satisfying enough."
    },
    {
      "rating": "7",
      "text": "Take an 80's action movie packed with every cliche in the book and a huge budget and Armageddon is what pops out.  It's really not a bad movie if you can put your brain on mute and just go along for the ride.  Probably it's biggest sin is it occasionally takes itself seriously, but that doesn't mean you have to!  Great party movie with a few drinks and friends who can laugh at some classically bad dialog."
    },
    {
      "rating": "2",
      "text": "The score was given for the drama.  This film makes no sense and by that I mean not only plotwise, but physics seem to have been thrown outta the window too. Wrong advertising. Now if had been pushed as a comedy the score would have been much higher...."
    },
    {
      "rating": "8",
      "text": "Armageddon is stunning, entertaining, groovy and dramatic.\r The opening scene is cool as it is massive, and I really enjoyed it! But after that it became a bit lame with to much slow and boring scenes, which I didn't like at all. The film overall thought, is very entertaining and the action is awesome! Armageddon is a highly unique film that combines a great story with wonderful actors as Bruce Willis and Ben Affleck, which truly are outstanding together. The music is also another aspect of the film that's wonderful, so dramatic, and I love it. Almost every detail in the film is perfect, besides the first slow half of the film and the \"missing scenes\" at some places that makes it a bit confusing.\r A sadly but awesome film by Michael Bay, and the best (to date).\r Armageddon gets a 8.3/10"
    },
    {
      "rating": "4",
      "text": "For a space trip this movie can't construct a good atmosphere. Instead we have \"heroes\" from America, who are either too stupid for this mission or stereotypical (like the Russian). Seriously, why are these men selected for this mission? Because of their knowledge of boring, which is too hard for serious experts? Or are they the only US-people, who are capable? And some scenes are also so stereotypical, like the important \"Success in the last second\".\r So this is for me a mediocre movie at best. I'm sorry, but I like \"The Core\" more (see the review for the reasons). I normally like movies in space, but this is one of the worst I've seen so far! It's an insult, that this movie got Oscar-nominations!"
    },
    {
      "rating": "4",
      "text": "Michael Bay returns to once again add more explosions to his film and give them a personality instead of the humans played in the movie. Bruce Willis plays a great title role and J. J. Abrams tried to make a great screenplay for this movie."
    },
    {
      "rating": "8",
      "text": "Armaggedon es una película muy buena, divertida con acción, drama, romance, traición y ciencia ficción. Grandes actores y una gran (y bastante irreal) trama."
    },
    {
      "rating": "2",
      "text": "Bruce Willis saves the world but can't save \"Armageddon.\" The second and, mercifully, last of the season's nuke-the-asteroid-or-bust pre-millennium spectaculars is so effects-obsessed and dramatically be-numbed as to make \"Deep Impact\" look like a humanistic masterpiece.\r Only question mark relates to the unexpected endurance “Deep Impact” has demonstrated, and whether the Paramount hit, the biggest 1998 release thus far, will indeed have a “Dante’s Peak”/”Volcano” dampening effect on want-see for this more elaborate and expensive, but even sillier and less engaging, production.\r In theory a drama about the imminent end of the world if an asteroid hurtling toward Earth can’t be blown off course by some courageous astronauts, pic plays more like “Con Air Goes to Outer Space.” Making most of the decisions made by the “Deep Impact” team look good in retrospect, filmmakers here take delight in assembling a team of ex-cons, wise-asses, musclemen and jokers as the group that will try to save the world, but by their own example raise serious doubts as to whether humanity is worth saving.\r It took five credited writers, and four more named in the press materials, to concoct this high-concept but otherwise staggeringly unimaginative tale, which parallels “Deep Impact” quite closely in its basic trajectory, if not in its details, tone and selection of characters. Earlier release, while hokey and directed like a careening train, at least took a thoughtful approach to the idea of impending global mortality; in “Armageddon,” doomsday is approached like a giant video game.\r Picking on a New York City only recently demolished cinematically by Godzilla (one of “Armageddon’s” few decent chuckles stems from a fierce little Manhattan dog attacking a plastic toy Godzilla), film begins with fireballs raining down on Gotham, disemboweling Grand Central Station, decapitating the Chrysler Building and generally wrecking the town. Amazingly, however, despite the fact that an asteroid the size of Texas is heading straight for the planet, the U.S. administration figures it can keep a lid on the news, at least until it figures out what to do about it.\r Determining, as in “Deep Impact,” that the only thing to do is to implant a nuke or two in the giant hunk of rock to split it apart before it creates a big bang that will assuredly do to humanity what a similar collision once did to the dinosaurs, NASA, repped by exec director Dan Truman (Billy Bob Thornton), recruits the world’s top oil driller, Harry S. Stamper (Willis), for the job. A maverick, but responsive to the greater international need, Stamper agrees on condition that he can select his own team, and it’s here that the picture becomes irretrievably ludicrous: The “Dirty 14,” which will fly up on two space shuttles, consists mostly of miscreants with bad attitudes, and Stamper compounds the insult to professionalism and integrity with the request that, should the group survive the mission, they all be rewarded by not having to pay income taxes ever again.\r Much of the confusion, as well as the lack of dramatic rhythm or character development, results directly from Bay’s cutting style, which resembles a machine gun stuck in the firing position for 2 and a half hours. Perhaps someone will someday reveal how many separate shots make up “Armageddon,” but the count has to be one of the highest in Hollywood history; at a guess, there must be a cut every three seconds or so.\r In order to enhance the film’s destructive possibilities, the mini-asteroids that serve as a taste of things to come are given unusually good aim, hitting only major cities — New York, Shanghai and, in a gratuitous late-in-the-game hit, Paris. In a lame attempt to globalize the drama, insert shots show thousands of natives praying in front of the Blue Mosque in Istanbul and the Taj Mahal (not a religious site) in India, which somehow only increases the jingoistic, thank-you-America-for-saving-the-world message.\r Film’s performance style consists of yelling above the ambient noise, which is usually considerable. Special effects are incessant and sometimes pretty groovy but, given the length of time each shot is on the screen, they’re usually here one second, gone the next. All tech credits are predictably gigantic."
    },
    {
      "rating": "6",
      "text": "Armageddon surprised me with the way the entire third act was greatly crafted because of it's multiple Razzie nominations including \"worst picture.\" Other than that this film has a variety of problems. It misleads you with intense sequences that compell you from start to finish, but if you carefully examin the other aspects, you'll find that it's a big disappointment for us as an audience. The acting, writing, directing, etc was all a faulter towards the film. It's sad to say that we expected this coming from Michael Bay.\r Rating: 6/10\r A+ = 10\rA = 9\rA- = 8\rB+ = 7\rB = 6\rB- = 5\rC+ = 4\rC = 3\rC- = 2.5\rD+ = 2\rD = 1.5\rD- = 1\rF = 0"
    },
    {
      "rating": "7",
      "text": "Armageddon is a sci-fi action drama thriller directed by the guy behind “Transformers” Michael Bay. It tells the story of an asteroid wiping the earth less than a month, and it’s up to Dan Thurman (Thornton) to recruit the world's finest drillers lead by Harry (Willis) to stop this disaster happening.The cast includes many great talents and did a remarkable job to make their characters stand out. They are given enough screen time and background to make them highly remembered especially Buscemi, Affleck, Tyler and Duncan.Armageddon's extravagant visual effects, explosions and action set pieces make the audience be engaged all throughout the film. There are many rip-roaring moments with mesmerizing special effects, which do not work for quite sometimes, but for the most parts, it's still an enjoyable and entertaining flick which exceeds expectations of Bay fans.However, with scientifically inaccurate and unrealistic things, this movie has a lot of factual errors and science mistakes that do not make any sense. It also has some laughable jokes and sincere emotions which blends finely.VERDICT: Armageddon features great acting and special effects, but the science behind the movie does not work."
    },
    {
      "rating": "7",
      "text": "To take a quote out of the movie \"So not the right stuff\" is why this film worked. It didn't come across as another gung ho USA military save the world. The fish out of water characters made this a lot of tense fun and that one Russian dude was hilarious."
    },
    {
      "rating": "7",
      "text": "The most underrated Michael Bay movie, which people judged too harshly. It's a simple action/space movie with Bruce Willis being Bruce Willis. Don't overthink it - enjoy it."
    },
    {
      "rating": "3",
      "text": "What would happen if our planet were suddenly threatened by the imminent collapse with an asteroid? Was humanity prepared to stop it or destroy it? This disaster film talks about it. Directed by Michael Bay, it has a screenplay by Jonathan Hensleigh, J.J. Abrams and other contributors, and has Bruce Willis, Ben Affleck and Liv Tyler in the lead roles.We are facing one of the most famous disaster films made by the American film industry, a machine that is always ready to find new ways to destroy the planet. But in this film which was more damaged was the movie itself! Let's begin by the actors: Willis is excellent in action movies and is always ready to save the day since \"Die Hard\". His interpretation is good and the same can be said of most of the actors. But the script could have been much better. The idea of ​​using a nuclear bomb to split an asteroid and alter it's trajectory is simply not realistic or plausible enough since that bombs aren't stronger enough to do that. Even less plausible is the idea of ​​equipping amateurs, without any training or some previous trip to space, with multi-million dollar equipment and use them as a last hope of Humanity. This is a joke that only some minds in Hollywood could imagine and an attack against the intelligence of any viewer who has a minimum of logical sense. The illogical disaster that this film is, however, turns out to be softened by the love story between A.J. and Grace, moving like any other where the lovers are separated against their will. Some of the film's scenes are mere U.S. propaganda: the asteroid pieces have reached all except the U.S. (was that a minor problem?), who saves the day as usual, with great waves of American patriotism. The Russian space station, old and obsolete as a museum, is destroyed in the process, as well as it's single cosmonaut, who seems constantly drenched in vodka and has an absurd accent in an insulting stereotype to the Russians. Is this a remnant of the rivalry between the two countries?While Bruce Willis is the great hero of this film, this is a film that was destroyed by two asteroids: the lack of logic of it's script and story and the American desire to do patriotic propaganda. \"We saved the world. Russia, France and China may have gone to hell but the rest is fine thanks to us\". Hollywood still didn't understand that the U.S.A. can be rich but they aren't the policemen of the world."
    },
    {
      "rating": "8",
      "text": "Far from perfect - in the first half, there's plenty of awkward moments - but overall I highly fun and exciting disaster-action movie with great special effects."
    },
    {
      "rating": "6",
      "text": "I don't wanna miss a thing. Yeah I know this song from Armageddon. It had the best visual effects in 1998"
    },
    {
      "rating": "8",
      "text": "Just a great popcorn film.  Just sit back and relax and enjoy and also listen to a little Aerosmith."
    },
    {
      "rating": "8",
      "text": "Significantly underrated, for its absurdness it is surprisingly overpowered by its sheer determination to bring real emotion and human feeling to its abundantly rich visual design.Bruce Willis is definitely not my favourite actor, even when he appears in one of my favourite film (The Fifth Element). I can say honestly this is the only film where I feel his performance actually contributes significantly to the development and sincerity that this film needed. It doesn't come across as being that cheesy, because they carefully avoid keeping humour is only glimpsed in short bursts. And aside some logistical problems, most of the thrills are believable, as well as the stage sets and CGI.I feel a good point to make this an eight also comes from the wide array of accomplished actors pulling amazing contrasting performances. Lots of drama, lots of interaction - I love all the characters.It's a crazy far fetched film, but if you put enough sincere emotion and effort into it, i'll take such crazy and join on the wild ride."
    },
    {
      "rating": "10",
      "text": "La mejor película y la mejor banda sonora que he tenido el gusto de “sentir” en mi vida.Grandes Actores, alocada, divertida y frenética.Una obra maestra del Siglo XX.Espectacular."
    },
    {
      "rating": "10",
      "text": "The Most exciting action movie i have ever seen. I Loved it. Its got great action, it's very thrilling and just in my opinion a great movie. LOVE THIS MOVIE!!!!!!"
    },
    {
      "rating": "0",
      "text": "Someone fire a gun into my eyes. You know, Eli Roth should make movie where someone sees this pile of **** and has to have an grisly process of unseeing it. I'd rather be that character than slowly kill my eyes, ears, and brain by rewatching this."
    },
    {
      "rating": "3",
      "text": "I always saw this film as a real Pearl Harbor, and even with the participation of as Ben Affleck in Pearl Harbor. Love stories the same, terminology dramatic equal. Pure Pearl Harbor, the big difference is that this is not based on fact."
    },
    {
      "rating": "3",
      "text": "All I have to say is that when I was watching this... My mom started crying and it was the funniest thing I have ever seen in my life! Michael Bay, you suck."
    },
    {
      "rating": "10",
      "text": "Odiar Michael Bay é uma doença que mexe com a diminuição do Q.I,eu não tenho essa doença.\rArmageddon,É Um filme cheio de ação,humor e inteligência o que mais podemos pedir num filme. Fora o ótimo roteiro e só atuações de primeira classe. Bruce Willis,Steve Buscemi,Ben Affleck,Billy Bob Thornton,Michael Clarke Duncan,Peter Stormare,Will Patton,Owen Wilson,William Fichtner,Jason Isaacs,Ken Hudson Campbell e Liv Tyler que elenco!!! o que mais esperar de um filme???"
    },
    {
      "rating": "6",
      "text": "Armageddon has a lot to say, but mostly attempts to do so via special effects. Given some more character depth and better dialogue the film could have and should have been a hit. Those who aren't fans of Michael Bay's recent works, keep in mind--- this is done before the transformers film line was created"
    },
    {
      "rating": "4",
      "text": "The story doesn't reveal anything good to appeal and everything including the visual effects underachieves compared to other disaster movies that have been made so far. However, this is not Michael Bay's worst."
    },
    {
      "rating": "5",
      "text": "I'm not really sure about this movie. It was dull at most parts and the ending was cheesy in my opinion. I was a bit dissapointed to be honest."
    },
    {
      "rating": "10",
      "text": "Its silly and im sure the science is completely wrong but damn if it isn't one of the best films ever made. I must have seen this film at least 30 times and I get something in my eye every time. Easily one of my favourite movies of all time, I love the acting, the emotion, the humour and the characters. A classic apocalyptic disaster movie without equal."
    },
    {
      "rating": "1",
      "text": "My gosh I hated this movie. #3 on my worst movies of all time list. The plot is the stupidest and is so predictable. But what I hated most was the constant barrage of obstacles the characters take. You might be saying \"Oh but you need conflict for a good plot\" But there are literally no seconds where a problem occurs in this movie! Oh no! The Russian dude is mad at us! 3 seconds later, oh no! the handle on something I have no idea about broke! oh no! we have to save Ben Affleck! Oh no! the nuke is on! oh no! the military is evil!"
    },
    {
      "rating": "0",
      "text": "Almost makes you wish a meteor would hit the earth. If this is what the public wants, they deserve to die."
    }
  ]
}