{
  "id": 37,
  "title": "Army of the Dead",
  "starring": [
    "Dave Bautista",
    "Ella Purnell"
  ],
  "runtime": 148,
  "genre": [
    "Action",
    "Crime",
    "Horror",
    "Thriller"
  ],
  "description": "Following a zombie outbreak in Las Vegas, a group of mercenaries take the ultimate gamble: venturing into the quarantine zone to pull off the greatest heist ever attempted.",
  "releaseYear": "2021",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/z8CExJekGrEThbpMXAmCFvvgoJR.jpg",
  "categories": {
    "plot": 4.122448979591836,
    "acting": 3.7837837837837838,
    "ending": 3.8461538461538463,
    "soundtrack": 2.5,
    "cinematography": 3.3333333333333335,
    "familyFriendly": 3.0,
    "funny": 4.5,
    "action": 4.842105263157895
  },
  "reviews": [
    {
      "rating": "4",
      "text": "The previous Snyder zombie Dawn of the Dead is one my favorites of the genre right alongside Train from Busan. And while it does not fall totally flat is a far cry from the former.>The Good: Decent production values, plenty of zombie killing, decent if wasted cast, if taken as pure no thinking popcorn movie it entertains, zombie tiger and Its Vegas, baby!>The Bad: Poor pacing overall, feels like a haunted house in zombieland and Snyder can and has done a better job directing before, the casting is textbook diversity woke casting. No zombie Sinatra or Elvis. >The Ugly: Plotholes, so many the Pacific Fleet could drive across it with room to spare, it fails to keep minimal inner consistence too often and ham fisted politics, Sean Spicer, the scummy guard blackmailing and raping potentially zombie infected women and the pretty young woman rock groupie coyote are more unbelievable than the zombies, with such a lazy job of containment it's a wonder only Vegas is overrun with zombies.  >Verdict: Its passable zombie fun, but don't expect too much like me."
    },
    {
      "rating": "5",
      "text": "What presents itself as a zany and voilent zombie comedy is actually a mostly dramatic movie about a zombie scenario. But the film doesn't really hit the right notes and bounces between \"fun zombie\" slaughter and \"dramatic humanc slaughter\". The characters don't get enough chemistry together and aren't the focus of the movie. Then Main character is very bland and so is his plot line. And the tone of the movie is all over the place. And all that packed into 140 minutes feels like a lot of wasted time."
    },
    {
      "rating": "5",
      "text": "Excellent zombie movie with a tasteless predictable ending.From start to about half of the movie is just simply excellent, fun, gory and violent it has all you want to see from a zombie movie. Sadly it is just stupidly cliche with a part in which the bad guy (you literally know who he is right after he's introduced) attempts to Kill a latino girl who's John wick with a vagina (literally), she somehow survives just to be killed shortly afterwards in front of her team but still having all the time in the world to scream to them advising who the traitor is, not only that, the guys could've totally saved her by shooting a barrage of bullets (what a stupid scene). Then there's the failed hero daughter who is just a blatant imbecile who condemns the group because she needs to save her friend, everybody dies and finally the second survivor becomes a zombie leaving the perfect cliffhanger for another excellent yet mediocre 2nd flick."
    },
    {
      "rating": "5",
      "text": "All the subtlety and grace of a Sci Fi Zombie Flick. This time however, with a much bigger budget. This film has stars galore but has them to recite B movie dialog. Ultimately by the third act the film quickly speeds up to end and get out sequel bait."
    },
    {
      "rating": "4",
      "text": "You know what you're getting into, but still, 'Army of the Dead' disappoints with a stupid plot. It's really not boring, but every decision the characters make just makes you wonder if it was written on purpose or if Zack Snyder and the other screenwriters don't have a clue. And it just would be an excuse to bring the argument of the genre; there are great mainstream films that aren't as embarrassing as this one, at least when we talk about the plot."
    },
    {
      "rating": "3",
      "text": "I lasted an hour, but then the poor writing killed it for me.  I left my freshman daughter to finish it alone.  She later labelled it as the worst movie she'd ever seen.  The movie is basically a conduit to craft action sequences and special effects.  They came up with those first, and then tried to build a story and plot around it, and it shows.  Even my fifteen-year-old daughter was offended by the unimaginativeness of the writing.  They didn't even try because they didn't care.  They just wanted zombies and gun sequences, so that's what you'll get."
    },
    {
      "rating": "4",
      "text": "More Michael Bay than George Romero, which is not a good thing. The concept is fine, but the execution is clumsy and its just... a bit dumb. Feels like a wasted opportunity."
    },
    {
      "rating": "6",
      "text": "This is an OK zombie flick that could've gone half an hour shorter by cutting all the attempts at \"emotional content\" which are pretty dull and cliched.  Lots of women in action roles featuring guns, far more convincing than the safe-cracker action, which really said nothing about safes and vaults and how they are \"cracked.\"Worth a try if you're a fan of zombie or action flicks."
    },
    {
      "rating": "5",
      "text": "Medíocre, os personagens são clichês e sem nenhuma profundidade, vc quase torce para que os zumbis vençam, na parte do Roteiro a coisa fica pior ainda a premissa do filme era vá ao cofre e pegue os 200 milhões antes da bomba cair, só que a bomba caí e o cofre continua lá intacto ou seja o próprio roteiro transforma todo esforço dos personagens em algo em vão, até nas cenas de ação no trailer aparecia áreas abertas lotadas de zumbis e no produto final 90% do filme se passa nas áreas internas, o que tem de positivo a ação, o visual, o clichê de zumbis, acho que só."
    },
    {
      "rating": "5",
      "text": "I wouldn't say it was a bad movie but it is a bit boring. If it was an hour shorter, the soundtrack was better and it used more practical effects, it would probably have been a little more palpable."
    },
    {
      "rating": "6",
      "text": "Thank goodness it's Friday! And when Friday comes, so does the streaming and theater content! This week we have attacking us an Army of the Dead. This solid ensemble cast has us following a zombie outbreak in ye olde Las Vegas. Led by a group of mercenaries, they are up to take the ultimate gamble by venturing into the quarantine zone to pull off the greatest heist ever attempted. I know what you're thinking, \"Zombies, Vegas, and a heist, what more could I ask for?\" Well, let's see what Army of the Dead has for us.I'll put it like this - if I'm going to be a zombie, I'll want to be a zombie like this alpha beast here. Forget any plot, the heist, action and violence is enough to watch this movie. I mean it's violent and bloody like you'd expect from any zombie flick, but it's also got the athletic ability of the WWE and parkour. On that front, it's just entertaining to say the least. Which reminds me, someone really should pitch a John Wick version with zombies. You're welcome for the idea, Keanu.Quiet as it's kept, this is not an original idea at all. I do like the mix of The A-Team, Ocean's Eleven, World War Z, I Am Legend and Extraction put together. It's basically Extraction with zombies. Yeah, I said it, Zack Snyder! You basically just ripped off every movie in writing this flick. Speaking of writing, Dave Bautista has proven that he is a comedic asset and yet this movie lacks any comic relief. In fact, the director portrayed Bautista's character as strong and caring, but BORING. I mean I really think they missed out with Bautista's talent comedically, now athletically they made him look like a freaking animal! Other than that, some characters try to give us some levity, but it felt like the movie was stuck between being serious and a joke. It's either pick one like Shawn of the Dead or be more serious like World War Z and spread out the light moments to lighten the heaviness. It seems like Snyder didn't really know what he was going for with this. I'm not trying t to drive this point home but Omari Hardwick has some range in both comedy and drama, and I feel his character was lifeless until it was too late to save the movie. The zombies had more intrigue than most of the live main characters. While Snyder tried to make the storyline cute and nice and all, it was ultimately secondary to the action.Long story short, I have to get to Las Vegas again before this movie really happens. Army of the Dead has all the typical zombie behavior with a little extra killing and brutality. It's way too long and they didn't really use the cast to the best of their abilities, but the movie provides some solid weekend entertainment. If you like zombie movies, action flicks and tons of heads being shot, check out this bowl of popcorn Netflix joint."
    },
    {
      "rating": "9",
      "text": "The film is very consistent and very well fleshed out. It definitely could have been shorter though, not even a complaint though."
    },
    {
      "rating": "4",
      "text": "I will say, the movie works as a complete time wasting, mindless adventure. The kind of movie you talk through and say oh, that scene was cool. Outside of that you have a mess of editing, uneven pacing, tropes and cliches galore, ham fisted character intros, unexplainable physics and general lack of any caring as to where this mess ends up."
    },
    {
      "rating": "6",
      "text": "It's an alright movie -- mostly just a 'roller coaster' movie. Lots of action, light on plot. Some plot points, such as with Scott's daughter, are just inane and idiotic. Other aspects (like the helicopter pilot, the safe cracker, etc) are very enjoyable. As long as you suspend belief and just enjoy the ride, it's definitely a decent zombie movie. By no means a thinker however. Just decently good actors with good special effects in an above-average, unique concept. It was fun and if you own Netflix, it's definitely worth a watch but if not, feel free to skip."
    },
    {
      "rating": "4",
      "text": "Some fun moments but they are few and far between. The plot has an interesting premise and the beginning sets it up like it's going to be a fun, Zombielandesque experience with fun kills, over the top characters and a lot of hilarious moments but in the end its a very generic shoot zombie in head...zombie die, repeat, repeat, repeat. The script is laughably bad but I didn't go into it expecting a great script, but with how bad it was it almost felt like a parody. Stupid emotional moments that have no build up or pay off. I mean this movie could have been fun but the amount of time I spent eyerolling over the stupid melodrama I missed half the movie. Instead of making a fun self aware zombie movie, they gave us a movie that takes itself far too seriously and ruins the fun because of it. Id give it a lower score if the premise wasn't kinda cool. I mean Oceans 11 with zombies....kinda dope, does a terrible job executing it though."
    },
    {
      "rating": "4",
      "text": "Little by little, Zach Snyder becomes the modern Michael Bay...This is Army Of Dead, made for the Audience of the Dead..This movie starts of good until about almost halfway in when it starts to stumble until it falls flat on its face.The Zombies here are plain stupid. They have intelligence, and are apparently fertile.. LOL.Otherwise mediocre performances by everyone, and a dire score containing alternative cover versions of well known songs.Movie could have been cut short if Snyder could please leave the Slow Motion button alone.+1 for a few gory scenes..Decent for a Sunday popcorn flick but nothing else."
    },
    {
      "rating": "6",
      "text": "Really cool idea, cool world, but really bad story, not gonna say much but some storyline feels that it was included in the very last minute. No question that Snyder is a great director and has an amazing vision, but he should leave the writing of the main storyline to somebody else."
    },
    {
      "rating": "6",
      "text": "This is a fun, but also very dumb movie. Aside the fact that nuking Las Vegas is an absolutely horrible and stupid idea, whether it's filled with zombies or not, there are also many other things which make you go \"Hold up, why did that just happen, it doesn't make any sense from a dramatic stance?\" (Sure, I get that I'm the only person who feels that way).Also **** the depth of field, it's jarring at best and irritating at worst.Still, it was fun to watch, sure there may have been things pulling me out of the story (What the **** was even the point of the zombie tiger?), but I ultimately enjoyed it. I wouldn't really watch it again, though."
    },
    {
      "rating": "5",
      "text": "Abandon all logic. If you want a zombie action movie and don't really care about plots.... go ahead. But the plot is riddled with odd choices by the characters."
    },
    {
      "rating": "6",
      "text": "I love zombie movies and was looking forward to this for a good while. I really liked the premise and story and ending. Some of the acting was terrible, a lot of the CGI was dated and I absolutely 100% despised the whole insanely shallow depth of field cinematography. 75% of practically every scene was out of focus, it just doesn't work for me at all. I still enjoyed the movie but I was definitely disappointed and feel that it had the potential to be so much better than it was."
    },
    {
      "rating": "4",
      "text": "Cara sinceramente o Filme não é bom, é bem ruinzinho, tem partes ali que você rir de tão vergonha alheia, é como se eles tivessem que seguir o roteiro, fizeram o rascunho e seguiram ele basicamente, cara a parte do helicoptero quebrado eu falei, \"fudeu\" era pra ter acabado ali, aquela poha n voava nem fdendo, a a pilota ruim pra krl mano, todo piloto sempre verifica todo o helicoptero antes de levantar voo a mina já queria ligar o heli e sair voando fodase. E tem aquele fdp lá que prendeu a loirinha fodona na grade lá, a mina \"nossa ele escapou droga\" mano era só ter puxado a pistola e atirado no c# do fdp ele ficava alejado ali mesmo dai vc forçava ele a abrir a grade e gg..Dai na parte que a filha do protagonista diz \"eu não tô pedindo pra ir com vcs eu vou\" blz ai essa fdp vai chega lá sai de perto dos cara pra salvar as mina pra acabar de fuder tudo, chega nas mina 2 morrem ela taca o FODASE o pai dela vai salvar ela ela simplesmente atira bala infinita até o chefão chegar na frente dela, dai a bala acaba..  eles sobem no predio ignoram que a poha do chefão tá vindo comer o c# deles ficam se olhando e se abraçando por muito tempo só pra dar o tempo do roteiro e o bicho pular no helicoptero.. pqp velho é meio q um filme de comédia, sem a parte da comédia, vi gente falando que o diretor do filme era bom, mas pqp velho isso é bom?"
    },
    {
      "rating": "6",
      "text": "plenty of 'shaun of the dead', '30 days of night' and 'i am legend' vibes, brings me a lot of excitement for the backstory behind this world and it's zombies that i can't wait for the forums and youtube comment sections to dive into. you totally forget it's another 'murican army patriot movie by the time the action starts and generally a really entertaining movie though it wasn't as scary as i was expecting. everything outside of the action is generally meh and most of the drama aspects almost pissed me off"
    },
    {
      "rating": "4",
      "text": "I went into it hoping for an exciting movie. There is an engaging movie in there, you just have to wade through all of the mundane slow parts to find it. It was okay, but a lot could have been cut."
    },
    {
      "rating": "10",
      "text": "My favorite zombie movie of all-time! Also, it may be my favorite heist movie, too"
    },
    {
      "rating": "8",
      "text": "It's an entertaining movie with good action scenes and funny moments and it's definitely on of Zack Snyder's best works"
    },
    {
      "rating": "8",
      "text": "All I can say after watching this is Wow! What a zombie movie! It really does  a great job making their zombies unique, being more like a tribal civilization than mindless flesh eaters.The kills and gore are phenomenal, there are some moments like Cruz's death where you do not expect a main character to live only for them to be killed in a brutal fashion.Bound to become a cult classic for the genre in 10 or 15 years."
    },
    {
      "rating": "5",
      "text": "The first half of the movie was like an 7-8/10 for me. The opening credits was good but there's also a scene where it's just stupid.The 2nd half is just dumb and stupid that takes this movie to the ground. There are so many plot holes and dumb story writing throughout the whole movie especially the ending that makes this movie overall bad. I thought it could've have been the next Dawn of the Dead but this movie is overall dumb and disappointing."
    },
    {
      "rating": "6",
      "text": "Lots of filler, little substance. It's dumb fun if you like that sort of thing."
    },
    {
      "rating": "5",
      "text": "The movie itself did very little for me.  It wasn't bad but wasn't good.  If it were the 90's (no streaming services) and it was on TV when nothing else was on, I'd put it on but I'd also lie down and be fine if I ended up slipping into a nap and missed the majority of the movie.On another note, I remember a not too distant past when people cried out about critical reviews being purchased by studios or critics allowing politics to inflate reception of certain films.  Yet now, I can't help but think these same people are destroying the integrity of user reviews.  Sure, everyone has a right to their opinion and everyone has slightly different taste in movies.  However, I feel pretty safe to say that this film does not deserve a 7.6/10 average.  Due to the small number of reviews, I decided to do a little data collection.  Of the 36 positive reviews, 17 scored this film a 9 or 10 out of 10 AND left a review.  Of those 17, six have only ever reviewed this film.  Another five have only reviewed this film and one or both versions of the Justice League (when both, the reviewers gave \"Whedon\" a 0 or 1 out of 10 then the Snyder cut a 9 or 10 out of 10).  So, I think it can safely be assumed that roughly 65% of the written user reviews are Snyder's fans who are still salty about WB moving on from the Snyderverse.  To go further, if you apply that percentage to the count of 36 positive ratings and you get about 23 reviews that are likely overinflated by Snyder Fans, bringing positive reviews down to 13.  This seems far more accurate to me (13 positive, 8 mixed, and 6 negative reviews), probably bringing the user score down to around 5.8-6.3 range.  I think that's a much realistic score if I were to request random people watch this film and ask for their review after the credits roll."
    },
    {
      "rating": "0",
      "text": "Hot garbage. I mean, the color scheme even looks like hot garbage. The story, acting, everything is terrible. I'm really quite pissed that some of the reviewers I usually listen to thought this was just mindless fun. It's mindless alright, but not fun. I couldn't even finish it."
    },
    {
      "rating": "3",
      "text": "Army of the Dead manages to combine the writing quality of a 13 year old edgelord, with super-powered zombies that teleport when convienent, and inconsistencies in almost every respect, especially when it comes to zombie abilities and turning time.  This was all style and no substance, ripping elements from Die Hard, Resident Evil, and Aliens, but remixed to Synder's over-long and addicted to slo-mo manner.  This should have been cut down to 90 minutes, and all the woke left on the cutting room floor."
    },
    {
      "rating": "0",
      "text": "It nothing new, ZS didnt deliver. With the basic idea of zombies could've been so great but the story was really poor and OMG the actors were so terrible, Dave Bautista soul be ban form Hollywood, he is just another filler, he would never ve in the same level of the The Rock or even John Cena. bad movie, also it didnt help the JL situation, that soil never happened."
    },
    {
      "rating": "5",
      "text": "I think the time has come to accept that Zack Snyder is basically another Michael BayOnly more visually aesthetic, and with a legion of fans that is 1000% more toxic.Army of the Dead is his return to the zombie genre, but with Dawn of the Dead being his debut and also a remake, perhaps he wasn't allowed to explore as he would've liked, but now with a loose budget, and total creative freedom, Snyder finds that measure is not his thing, and frankly it's not like I have a problem with it, but the lack of a concise style has always plagued him, and this movie is no exception. Army of the Dead is pure gore entertainment, with some comedy details. There's no more.It has a few emotional attempts, especially in its final part, but these are unsuccessful and mostly problematic.If we're already involved in the vortex of destruction, carnage and shootings, putting sensitivity affects your film, since, he didn't build something in that tonality in the first part, so it fails to makes sense, and fails to be deep or powerful.It's not much, but it does affect the tone in a bad way, because I honestly never gave a damn about any of the characters involved.And that's a writing issue. Action is the order of the day, although it's nothing special.Let's be honest, this genre in that style has almost nothing to contribute anymore, and Snyder knows it, so he tries to impress you with the scale. It's a great movie for Netflix, and I think it will pay off the expected dividends. After all, this is the kind of large-scale movie that many of its subscribers want. Especially considering the big titles its biggest competitors will release in the remainder of the year.I do not deny that Army of the Dead is a basic film to entertain, but it will not create any subsequent impact, and therein lies everything you have to know about it.This of course, beyond what it will provide you in its two and a half hours of length. The real challenge for Snyder after this would be to make a film that is more practical, and above all subtle."
    },
    {
      "rating": "2",
      "text": "One of the most stupid bad movies I've ever seen.Bad story, bad characters, bad acting, bad plot, stupid scenes.And Boooooooooooooooooooring.I watch all zombie movies, no matter if they are low budget or not, and most of then at least are funny to watch even if I know the rest is trash, and even the movie directors and producers know it, they deal with it and give the best they can.This time, this is a high budget movie, but have the quality of a low one, they pretend they are doing a good movie, its not, and they didn't achieve any fun on it, best sketch's are just bad at best.Snyder did it all, nobody to blame, only himself, he wanted to show what its capable of, he show us that he lacks of the talent to write a a good script, produce a good movie, his direction is very bad."
    },
    {
      "rating": "4",
      "text": "Not a very good movie and this is coming from a zombie movie fan. It seemed very confused on the style of movie it wanted to be and just ended up being a bit beige as it didn't commit to anything. Too long and too much filler. Even for a zombie movie, the story was extremely basic. 4/10. Might have liked it if I was about 14."
    },
    {
      "rating": "5",
      "text": "TL;DR - IF Snyder can only step away from his need to try hard at making  thoughtful piece of art every single time, I am confident that he can grow farther than just that director who can shoot action well. Army of the dead is the usual Snyder trying to flip the book on you but fails in the execution making it an empty, unsatisfying and lengthy experience.The GoodSnyder's style of film-making is more often then not always based around cinematography and shot composition. This also always translates into a visually interesting movie with a unique identity in it's look.However, he focuses a little too much on this, usually keeping the story simple works well but AOTD story has quite a few sub plots,twists and turns and unexpected outcomes. This may be a positive point for a lot of viewers as this is undoubtedly snyder firing on all cylinders but this does not always translate well.Bautista caught my attention in the short but great role of the protein farming replicant in Blade Runner 2049, he really made that whole scene work with him showing a great range. He is probably the best part of the movie slowly followed by the rag tag characters who had interesting personalities but sadly it's Snyder any character writing is near pointless he manages to actively make you not care about decently interesting characters.The gore was fun, mixing CGI and practical and the the whole organized/alpha zombies part of the lore was a fun addition to feature-film zombie lore.The BadThis film is such a bag of cliches one after another that you really start feeling the length of this movie. From the trailers it feels like Snyder finally got the point that he makes good action romps that need not take themselves seriously.I went in expecting the same but I got an average main plot with too many under average sub-plots; held up together with a gigantic bag of cliches, all packaged with great cinematography and shot composition.This movie bored the hell out of me, I saw every single twist and turn from miles away and hopefully Snyder intentionally made it so obvious. Because if he really intended to flip the script in earnest he really failed, even the nihilistic angle to it seems half @ssed.Snyder is so hell bent on trying too hard to make a layered masterpiece but focuses on all the wrong things, takes all the wrong decisions with character progression and ends up making movies that are usually unsatisfying, tedious and exhausting to get through. He tries so seriously to make this masterpiece painting but every single decision ends up being generic, forced and thoughtless.All in all if you are a zombie fan you will get something out of this maybe, rather you catch Alive or Train to Busan for more satisfyingly bleak zombie apocalypse settings.If you are not a zombie fan but an action junkie as well you may find that the action in the movie is also scarce and generic."
    },
    {
      "rating": "0",
      "text": "Long and boring.....In 2.5 hours no one really explained the zombies, I mean they are different from regular zombies, they think, they have a cyborg and a baby and nothing is really explained. The characters have 0 development and some are very cliches. Some scenes are very long and nothing really happens you just hear the background music and see the characters reactions. It was so long and boring that when the action scenes started I was so bored and tired that they didn't matter. The ending is also bad, this character at the end survived some really impossible events and it was so unimpressive.I hate all Snyder's fans claiming this is such a great movie when is not, learn to separate the artist from the art, he's great, this movie isn't."
    },
    {
      "rating": "1",
      "text": "Worst movie I have seen in a while. Bunch of idiots ironic music to try and make it funny. Looked forward to it but was disapointing."
    },
    {
      "rating": "0",
      "text": "Easily the worse movie i have seen in my entire life, you can't find 3 lines of dialogue that makes sense, characters are terrible, their personalities are badly introduced, you get no empathy for anyone, unless the one they try to make seem the bad guy in the beginning, movie previsible don't waste time."
    },
    {
      "rating": "1",
      "text": "Seemed like half the budget was spent making the opening credits, which happened to be one of my favorite parts of the movie. The rest was a patchwork of cliches that no amount of meta humor from Tig Notaru (the best part of the movie) could make up for. Really awful dialogue. Plot inconsistencies. Lazy world building. It just felt really cheap. I just couldn’t “turn my brain off and enjoy” this one. I feel like the bar for these movies is pretty high after all these years. With all the hype, I was expecting something similar to “I Am Legend” or “World War Z.” This movie was a waste of time."
    },
    {
      "rating": "3",
      "text": "I know we all want to be sympathetic towards Zack Snyder and all that but this is a dreadful movie."
    },
    {
      "rating": "0",
      "text": "Wow!!!!and i loved Dawn of the dead remake......this is just terrible. I was able to watch a half hour before i could take no more. And Dave Bautista is leaving Guardians of the Galaxies? You may want to rethink that dude!"
    },
    {
      "rating": "2",
      "text": "This was a pretty terrible zombie movie. I'm honestly surprised this got greenlit."
    },
    {
      "rating": "3",
      "text": "This is the worst Zack Snyder movie i seen so far.The acting is just so bad sometimes i stop watching the movie and did something else for a minute. When ever the zombies would talk to with each other,i bail from the movie for 5min.I just couldn´t watch that i was so cringe.I almost turned the movie off when the female zombie did the Naruto run."
    },
    {
      "rating": "4",
      "text": "Seeing a hierarchical kingdom of zombies is actually kinda refreshing. We have the Shamblers, who are derived from the typical zombies of the late 60s and the 70s, only slightly more evolved and a tad smarter. We've also got the Alphas, who are far more superior to the Shamblers: extremely agile, relatively fast and even capable of showing emotions. Their leader, Zeus, and the one who likely has turned them all into zombies, is quite intelligent and strong. Pretty much a human hadn't been for his gruesome look and his growling and screeching. He's even got himself a queen. The problem is, there's no proper explanation why they retain such human traits, with the Alphas acting and displaying emotions and feelings like humans to the point they come across as zombie imitators. Even worse, that left the hierarchical structure unexplored and unsatisfyingly vague and muddled. That said, I wouldn't hesitate looking past these inadequacies resulted from such half-baked world building so long as they would be offset by the galore of bloody fun expected from an action-packed zombie flick. Sadly, I can't say the movie fully delivered on that either, as the entertainment value is heavily undercut by a plethora of issues including clunky dialogue, one-note characters that are either mere stereotypes or unabashedly ripped off of other action movie characters — most notably from Aliens — tonal inconsistency, overly-dramatic moments and, worst of all, a total failure in embracing all of these shortcomings openly in an act of self-awareness of sorts. For starters, the attempts at comedy are awfully bad, with all the jokes falling flat and some of them are just plain cringe-worthy. Ludwig Dieter, the German safecracker who's supposed to be the comic relief character, is unbearably annoying and dumb. The same can be said about some frequent, albeit unsubstantial and tentative, tongue-in-cheek allusions to politics. Needless to say, all the concerns mentioned above have come to the surface and become impossible to ignore. The emotional scenes Scott (David Bautista) share with his daughter Kate are both repetitive and devoid of the slightest dramatic impact, mainly because the plotline revolves around their tumultuous relationship is woefully underdeveloped. Although the movie had its fair amount of time to provide necessary background for its main characters, the bulk of the first act is diminished by poor editing, sluggish tone and unfocused narrative. As an actioner, Army of the Dead is, in fact, quite generic and derivative despite its desperate attempts to conceal that with its skin-deep contrivance, buckets of blood and gore and no skimping on slow-motion moments you'd expect from Zack Snyder. No action scene is memorable or even intriguing enough. Clocking in at nearly two and a half hours, the movie also feels strangely limited in scope, which is not only unusual from Zack Snyder but also at odds with the epic it lends itself to be. That, along with having a kind of a pattern when it comes to switching between humour, action and drama, stifled the tension the perilous zombie territory could've yielded in spades. The fact I dozed off midway through is enough to prove how tedious the end result turned out to be. Even the songs in its endless soundtrack playing rather abruptly didn't help galvanizing the ponderous second act. Honestly, however, the movie picks up in its third act, which is basically one elongated action sequence with the climactic scene being genuinely gripping. Dave Bautista's performance is one of the few redeeming factors here, with some schmaltzy emotional scenes he single-handedly rendered them watchable. Still, Army of the Dead is a predictable, ridiculously overlong zombie heist movie that tried so hard to be an epic, brainless gorefest but ended up being nothing but a borefest."
    },
    {
      "rating": "1",
      "text": "Immensely bad, not even entertaining in a so-bad-its-good way. Too many things kill the narrative, take you out of the movie. The film is comstantly out of focus, Tig Notaro is awkwardly photoshopped into scenes, unpleasant characters like the daughter, the daughter’s friend subplot which makes no sense, etc. The film makes itself difficult to enjoy. Worst thing about it is the cast of characters, they should have cut half of them to focus on a few and make them more interesting. Just very puzzling that with this budget and a good cast (though maybe the cast is not so good, the movie does them no favors), this is the zombie movie Snyder puts together. The DotD remake was great. This is a terrible disappointment."
    },
    {
      "rating": "2",
      "text": "What an absolute stinking pile of garbage. I'm not even gona start on the turd of a script but netflix scripts are 95% of the time terrible & Synder isn't exactly known for it either but at least his movies are stylish & can be fun. This is none of that, it's boring, beyond stupid & no fun whatsoever. Which is a travesty to the genre then any attempt to add heart to the story is seriously wide of the mark, nevermind that you couldn't give a **** about the characters that are meant to deliver that heart.The more interesting characters get little screen time or are killed off quick. Then there is the incredibly annoying daughter character in Ella Purnell who you just want to strangle the whole way through but she dominants the screen time. I really have lost my faith in the movie industry to be able to produce anything of a decent standard, the current standard of writing in particular is frighteningly bad. And we are not allowed have a single movie that isn't saturated with politics no matter how silly the film. So here i am, a life long movie fan that has completely lost his faith in the industry to produce anything of quality. It seems we live in the age of acceptable low standards."
    },
    {
      "rating": "3",
      "text": "Zack snyder doing  what he does best. Making **** movies. 15 20 min intro playing viva las Vegas.  Will have you thinking about life ending solutions.  To make it stop."
    },
    {
      "rating": "3",
      "text": "Schweighöfer destroy a good movie. why cast an actor who is known for garbage movies..."
    },
    {
      "rating": "1",
      "text": "Plot makes no sense, its just 2 & 1/2 hours of good zoombie-makeup and bad movie."
    }
  ]
}