{"id": 4859, "title": "Army of Darkness", "starring": ["Bruce Campbell", "Embeth Davidtz"], "runtime": 81, "genre": ["Fantasy", "Horror", "Comedy"], "description": "Ash, a handsome, shotgun-toting, chainsaw-armed department store clerk, is time warped backwards into England's Dark Ages, where he romances a beauty and faces legions of the undead.", "releaseYear": "1992", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/xsgTuAtR2zSH8Umg3jWZcZjlDpe.jpg", "categories": {"plot": 7.294117647058823, "acting": 6.888888888888889, "ending": 8.1, "soundtrack": 5.0, "cinematography": 6.0, "familyFriendly": 3.0, "funny": 7.659574468085107, "action": 7.333333333333333}, "reviews": [{"rating": "10", "text": "Army of Darkness is an 80-minute comedy gem filled with witty one-liners, awesome special effects, and a great cast. Though it isn't as groundbreaking as the originals, its still a great and overlooked action movie."}, {"rating": "7", "text": "This conclusion to the Evil Dead trilogy ditches the horror in favor of over-the-top comedy. The film's refusal to take itself seriously can lead to this feeling like a spoof of the previous movies. It's both the film's greatest strength and weakness.\r The witty one-liners take the cake. They are unbelievably memorable. The constant stream of goofy and out there moments will have you asking yourself \"what the heck am I watching?\" While I personally had a hard time not laughing at it, the slapstick humor may cause some people to feel like the movie is too stupid to actually be funny. There are plenty of times where the laughs come from just how juvenile the whole thing can be.\r It's a complete departure from the horror that started this series. Instead it embraces the more comedic elements of the Evil Dead 2 wholeheartedly and runs with them. While that may turn off some fans of the series, those who appreciated the humor of the second Evil Dead should still find a good time. It can be a wildly funny ride.\r My total score for the movie is a 7.5/10."}, {"rating": "10", "text": "this is one of thoose rare gems . its a bold , funny over the top , action packed , and full of more one liners then you can imagine. theres nothing like the Army of darkness . this is one of thoose rare films where ive talked to 100s of people who have seen it and not one of them didnt like this movie .every one loved it . i dont think i can think of one other film ive seen that not atleast one person i talked to about it could have a agreement about if it was good or bad. this is that one movie every one agrees on. the humor is almost cartoony and very much 3 stooges at times. the special effects pretty cheesy . the one liners abit corny , the acting abit hammy ... but you know what i wouldnt change one thing about this film . its perfect the way it is and i cant say that about many films. it just pulls every thing off some how and im not gona try and figure out why . im just gona enjoy it. if you havent seen this film its a must."}, {"rating": "6", "text": "After The Evil Dead and Evil Dead II: Dead By Dawn, Army Of Darkness should be epic, right? Well, i'm afraid to say that it doesn't live up to the previous two installments. Army Of Darkness begins where Evil Dead 2 left off: Ash has time travelled to the medieval times (this is why it was unoffically called The Medieval Dead, a name I love btw) While Evil Dead was mainly horror, and Evil Dead 2 was a mix of horror and comedy, Army Of Darkness is more comedy based than horror based. The film has been given a bigger budget, as can be seen with the films location moved to Medieval times, the Army Of Darkness and Bad Ash. Speaking of which... I liked Bad Ash, as a proper enemy for Ash rather than his cut off hand or some evil force that throws him like a rag doll. He was quite a good villian. Not too crazy on his love interest though. A bit bleh for me. This film has Ash as more of a jokester hero than the serious role he played in the last two films. He pulls off some quality lines \"All right, you primitive screwheads, listen up. This is my BOOMSTICK!\" but I prefered him more serious. As for the ending, I liked the bleak ending \"I SLEPT FOR TOO LONG\" but I prefered him returning to his time, because it felt kick ass. And it ended brilliantly \"Hail to the king, Baby\" Ultimately, this film was quite enjoyable, but the choice of comedy over horror made it feel like a bit of a dissapointment when compared to the previous two films. It felt like the right ending to the serious, a bats arse killer way to round off the evil dead story, and I think it deserved it."}, {"rating": "9", "text": "This was my introduction to the Evil Dead Series, so it holds a special place in my heart. It's flat out hilarious, slap-stick humor without the scares."}, {"rating": "10", "text": "One of the most hilarious movies ever made! Some may not appreciate the slapstick humour and twist on the franchise, but I think it works perfectly. Ash's character is now fully developed and delivers some of films most quotable lines to date. The final fight is my favourite movie scene of all time. I love Army of Darkness. It may be relatively different from it's predecessors, but that doesn't make it a bad film in any way or form."}, {"rating": "7", "text": "Sure, it's no Evil Dead 2, but the plot and special effects so over the top and Bruce Campbell is so... well, Bruce Campbell, that it's hard to not be entertained."}, {"rating": "9", "text": "For me, the best films of Sam Raimi, this film under the original and may be cooler than Sam, in addition to the hilarious story and the performances, no doubt a cult film that everyone should see and never growold."}, {"rating": "10", "text": "Is it high art?  No.  Does it change the genre?  Of course not.  Is it fun?  Absolutely.  No matter how many times I see it, I still laugh and have fun and as this was not sold as a \"serious\" horror film but rather a lighthearted comedy horror film, it hits its marks perfectly."}, {"rating": "7", "text": "Objectively, two things are true about Army of Darkness. One, it is definitely not very good. Two, I totally screwed up. I had no idea this was a follow-up to Evil Dead and Evil Dead II. Who would guess it, but I had never seen either. Whoops. Mea culpa on that one. Fortunately, I get the feeling I did not miss much plot-wise. 81 minutes long, Army of Darkness is a fast-paced, stupid, and incredibly fun horror comedy. From director Sam Raimi, Ash Williams (Bruce Campbell) reclaims his chainsaw, witty commentary, and need to kill the evil dead in this conclusion to the trilogy (apparently). While hardly perfect, it is impossible to deny that Army of Darkness is really stupid fun.Due to its runtime and focus on action, the film largely forgets its plot, which stands as the biggest issue. Dumped into the Middle Ages after seeing the Book of the Dead, Ash must fight his way out of various situations and then awakens an army of the dead in the process. Otherwise, it is just chainsaw goodness and women with large breasts serving him. There is not much meat on this bone and very little to digest. Mind you, the film surrounding the plot is fun enough to make you forget there is no plot, but it is a flaw nonetheless. Towards the middle, when the plot can continuously repeat itself with its silly action and jokes along the way, the lack of plot is really felt.That said, Bruce Campbell is born for this role and hysterical. Charismatic, cool, calm, and collected, Campbell's Ash delivers each punch line to perfection. He is the core of this film and is what it is riding on. He has terrific fun in this film with all the silly gags and seems to derive great pleasure from kicking zombie ass. On that note, Raimi also has a ton of fun here. With bad special effects and low-bar jokes, Army of Darkness is a goofy and entirely tongue-in-cheek affair. He knows it is dumb and outlandish, but that is exactly why he is doing it. This reason is mainly why the bad effects are excusable because it is partially due to limited technology and mostly due to Raimi's own cheesy intention. Bad effects are the perfect backdrop for the quip-ready Ash who has his own special brand of machismo that makes him a truly unique action hero.On that note, Ash definitely fits some of Yvonne Tasker's definition of a male action hero in the 1980s and apparently early 1990s. Putting his male body through torture via cutting off his own hand, being against the system (defends the middle ages people to save a girl), and saving a damsel in distress, Ash is the quintessential male action hero, though his body does not necessarily become spectacle and suffer from constant torture, aside from the hand the pixie that breaks into his body. In that way, he is a bit of subversion of this and shows Raimi's satirical inclination in the film with even the action hero and action he performs being tongue-in-cheek representations of competing action films of the time.Funny, subversive, and flat out stupid, Army of Darkness has literally no plot, but is fun because of its bad effects and Bruce Campbell. While I wish I had seen the first two entries in the trilogy first, Army of Darkness is entertaining and fun in its own right, separate from the other Evil Dead films."}, {"rating": "7", "text": "The cheesiness may sometimes be too much and make you cringe, but overall it's very enjoyable and had me hooked since the first scene. Although I didn't laugh much it's successful by way of jokes and the actings decent Bruce Campbell is a satisfying lead. But the best thing is the large amount of brilliant quotes like \"Hail to the king baby\" and \"Maam I'm going to have to ask you to leave the store\"."}, {"rating": "10", "text": "Fun, Funny, Smart, and at times genuinely terrifying.  I don't know if Sam realized how much a brilliant film this is, but I think it should be one of the best films of all time."}, {"rating": "9", "text": "A really corny and cult classic movie. If you enjoy action and slapstick comedy this is the movie your looking for. Army of Darkness takes Evil Dead's hero \"Ash\" into a portal that takes him to medieval times and is thrown into a battle with evil. This movie is just so much fun to watch."}, {"rating": "10", "text": "This is the single greatest movie ever made, it has everything from horror to comedy to romance to action. I still remember the first time I watched it"}, {"rating": "7", "text": "This movie is what I consider the best in the trilogy. It is simply a fantastic action film that improves upon all the weak elements of The Evil Dead and Evil Dead II. If you think those movies look like garbage, this one is shot like an actual movie and, had incredible costume design. The humor is more centralized in the film and, it gives up the consent that this franchise was ever scary by making everything so ridiculous. I don't need to muse on about this movie because If you're interested in it you've already seen it."}, {"rating": "10", "text": "This movie is funny, action-packed, scary, chilling, suspenseful and just about anything else good you could say about the movie. The battle with the Army of Darkness towards the end was amazingly epic"}, {"rating": "8", "text": "Of all of the Sam Rami \"Evil Dead\" movies, this is by far my favorite. Bruce Campbell is his usually zany self.  The story is happily over the top and predictable. Nobody in this story takes themselves seriously. Army of Darkness was never intended to be a serious story of any kind.  It's simply a spoof of horror movies.Was there blood? A fountain of it (ala Tarantino). Were there dismembered limbs? Yea a dismembered hand that flys up and grabs someone in the face. Were there members of the undead? Absolutely and many/most of them were hilarious in their silliness."}, {"rating": "7", "text": "Army of Darkness was the best installment in the trilogy.The camera work and special effects were better. The cinematography was good and action scenes were furious. What made this movie different from first two was addition of humour. The story was nicely detailed. Company should have allowed the original ending.Overall, it was the best installment in the trilogy as it is filled with more details, action and horror."}, {"rating": "8", "text": "a classic that you can watch at any time of day and enjoy, very goofy but fun at all times with tons of quoteable lines. especially the last act is very memorable even after years of not having watched."}, {"rating": "10", "text": "I find this flim to be entertaining, funny and amusing and deserves a high rating. Depending on what your taste are your score may vary where as my score is a solid 10. If you are in the mood for outrageousness and silly comedy then your in for a good movie."}, {"rating": "7", "text": "It can get a little repetitive with it's slapstick humor here and there, but it's undeniably well made and Ash from the previous Evil Dead installments is just as fun to watch here as ever."}, {"rating": "7", "text": "The silliest encounter we've seen with Ash yet and by far the biggest in scope. It seems that Raimi had finally fully established what type of character he wanted Ash to be in this trilogy and he seems most developed and involved in this film. The film has majorly switches now from horror to adventure comedy now and provides some ludicrous fun along the way. The film is an absolute blast almost all the way, but towards the last 20 minutes i felt like i kind of lost steam a bit. I can see that Raimi was trying out more unique shots with the battle sequence but it does somehow take away from the rest of the film. It is still good on its own however. I would also like to mention that the theatrical ending is the better one, not the dvd version! This film should've been my favourite in the trilogy but due to the last 20 minutes i'd have to give it to Evil Dead 2 instead. Well done Sam Raimi though for possibly making one of the weirdest but most entertaining trilogies ever conceived."}, {"rating": "9", "text": "army of darkness is the best most greatest story ever . Ash is back and returns as a badass ghost killer as always . Evil dead series Aka (trilogy) . is amazing Raimi's series of horror is brilliant . Grade Army of darkness A+."}, {"rating": "8", "text": "This is an excellent film with a few holes. Probably the second best in the series but lacks a little horror that made the first two so great. This is more an action film than anything else. It would have been better as a horror action with some comedy. This is very funny with one scare element and really is enjoyable but this enjoyment is aimed at a wider market and tragically suffers a little for it. A definite must for fans of the first two. Enjoy this classic early action from Sam Raimi - a precursor to Spider-Man? This is pure silliness and I love it! The sets look small and the action is tame but the comedy and the Bruce of it make it excellent."}, {"rating": "4", "text": "This one is just bad compared to both if the films before it, it has some good moments because the acting is good, the cinematography is great, the directing is great, but it's just another blockbuster horror that's just a cash grab"}, {"rating": "2", "text": "I am pretty good now, having slept for six hours instead  of my four so I feel in a positive mood. So, this particular movie is a complete utter waste of your time unless you like overacting of the obnoxious kind, crappy dialog that borders on the campy, a redundant script and people being put down because that is funny or are seriously intoxicated.\rThe movie is carried by Campbell and that is about it. Bruce Campbell will never rank among the best of actors or even among admirable b actors. He overacts, is a buffoon and annoying, but he makes much of it up by sheer utter enthusiasm.\rSo there isn't really a good story as the movie is mostly a series of patched together sketches with Campbell as the star. Campbell graces the poster of the movie with a chainsaw for his right hand. It is used for a very short time just so it could be on the poster. The jokes are of the bottom kind: crude, at the expense of others, shaming people and embarrassing. For instance a running joke is that he calls the people of the middleages primitives.  There is some slapstick in it that reminds you of Chalie Chaplin or Buster Keaton. Unfortunately, because Campbell is such a crud you never get to like him as you get to like Chaplin and Keaton.  Which is the iceberg that sinks this one. Campbell has no redeeming qualities, nothing that makes you like him or even 'get' him.\rIn the eighties cgi was unknown hence the army of the undead is made with stop motion. It is admirable to see how that is done, the patience and editing is laudable. Yet it looks totally awful today. Stop motion is still used in animation movies nowadays, with better skill, but never mind.\rWhat else is there to say?\rI skipped through parts of this brainless boring movie that probably gets pawned off as being cult. Garbage would be a better word.\rDid I give it a five?\rA two is better.\rMake it so."}, {"rating": "6", "text": "The thing about the Evil Dead franchise is you either enjoy them or you don't. I found the movie to be entertaining yet flawed. I enjoyed watching it but it could have been better. Solid watch imo."}, {"rating": "6", "text": "I really get a kick out of \"Army of Darkness\", but I don't expect most folks to really enjoy it.  You have to go in being fully aware of how it leans into its low budget.  For some reason, all of the reasons that I really dislike just about every other Sam Raimi movie, proves to be a reason why I like this movie so much.  I give it a C, if you've already seen the best, but you insist on watching a movie, try this one out."}, {"rating": "6", "text": "The weakest in Sam Raimi's trilogy (he seems to always be over-ambitious in the third instalments of his franchises). The plot is interesting but the cheap effect makes it look more like a medieval-times restaurant rather than a blockbuster picture."}, {"rating": "6", "text": "I think Army of Darkness is for fans of Sam Rami or fans of Bruce Campbell. This movie is so ridiculous so it is somewhat of an entertaining watch just because you really can expect anything normal to happen. My favorite film in the Evil Dead series is the first film because they begin to get really wacky after that. Bruce Campbell is pretty fun to watch but no other funny or interesting characters are introduced. I respect Sam Rami for taking his series in an other direction but I can't say I'm a big fan of this film but I'm sure that there are plenty of people who can get some enjoyment out of it."}, {"rating": "6", "text": "It doesn't live up to the impossibly high standards set by its predecessors. Army of Darkness is a dark fantasy and comedy film, while the first two Evil Dead movies were horror films. It's funny, crazy, and certainly entertaining, but I just wished it had a bit more substance."}, {"rating": "0", "text": "No conforme con las primeras dos entregas que fueron del asco, llega esta tercera parte que es aún peor, una completa basura y perdida de tiempo."}, {"rating": "6", "text": "Despite not having 'Evil Dead' in its title, it's still apart of the Evil Dead franchise, so this should be a great movie to watch, right? Well, sort of."}, {"rating": "3", "text": "Was that A Joke,I'm i suppose to laugh!Ha ha ha **** one was seriously classic 2nd one toned down to comedy and spoof and now this don't know why it was such an awesome scary series.apart from connection to series as a standalone it was entertaining one time watch more like kids version of evil dead!music was good fights and action was over the top **** and screenplay was okay,visuals were terrible it felt like dumb-down version of game of thrones battle of north with night king.Overall seriously rubbish movie as per series."}, {"rating": "10", "text": "I don't care the reviewer say worst or boring. This is totally funny, scary and epic movies ever. Recommended for big fan of dark fantasy."}, {"rating": "10", "text": "This is the greatest B-Movie ever made."}, {"rating": "10", "text": "I love when the Critics have their heads so far up their behinds they are not even in the ball park it when it comes to capturing the intended essence of a clear classic!"}, {"rating": "10", "text": "The critics gave this a 57!! Obviously the critics don't know how to just sit back and enjoy a movie. This is one of the funniest movies I have ever seen. It is Bruce at his best. If you dont laugh at this movie you've got serious problems and I recommend seeking professional help."}, {"rating": "10", "text": "Amazing how the critics gave it only 57. Maybe they went in looking for another Evil Dead. But this is a classic in its own damn RIGHT! Bruce Campbell rocks! His one liners are hilarious."}, {"rating": "6", "text": "A hilarious movie with funny and silly practical effects, but its a kind a movie you watch when you stumble upon it on TV when you have time to spare."}, {"rating": "8", "text": "When I was a kid I used to be so terrified by this movie. Now as a adult I just think it's hilarious. Wish I got the humor back then."}, {"rating": "8", "text": "I was looking for a movie to spend my night on and this movie appeared on the screen so I decided to watch it without knowing the back story or even watching the previous Evil Dead movies and WOW I was surprised by the creativity and how funny some of the scenes are! Bruce Campbell was a really good choice for this character.it was a fun movie to watch and don't take itself seriously, I recommended it"}, {"rating": "8", "text": "Contains spoilersArmy of Darkness is pure fun. This movie gave us the Ash that went down in pop culture.Ash was already a badass in evil dead 2, but not until the end of the movie.Here we can see Bruce Campbell as Ash in his prime. Bruce Campbell's overacting is very great. He not only has his funny but also his badass moments that could just come out of a Schwarzenegger film.Bruce Campbell is also a great physical actor. The different screams he can make and how he can make Ash suffer. The scene where one of the little Evil Ashes is in Ash's stomach shows how good Bruce is at overacting.How Ash drinks boiling water to kill him in his stomach, enjoying it and suffering himself is just terrific.This movie is the most epic but somehow also the funniest movie of the trilogy.The one liners are legendary and this film has so many iconic scenes.E.g. the scene in the fountain with the 2 deadites, the scene where he builds his hand, the boom stick scene, the scene where Ash forgets the words, the windmill, or the scene in the supermarket. And these are not all examples.Also shows how great the setting was in this film.Making Ash (an everyday guy) the chosen one to become a total badass and that in a horror franchise makes him very unique just like his filmsThe costumes are epic too, especially evil Ash.At first I didn't even know that Bruce had also played his evil version.Practically this is just amazing, I wonder how they came up with the idea of ​​the car and how Ash shows them how to make explosive arrows.Of course, the skeletons are still funny today.I also think that the end of the director's cut was also very great and special. Ash's mistake with the drops suits the character.Again, Bruce's acting is great when he wakes up and gets excited too soon.Both endings are great, but the theatrical version has the better ending since there was never a fourth part.The theatrical version ending is over the top, badass, funny and fits the character just as much.This movie doesn't take itself seriously and the only thing I could criticize would be how bloodless the movie was. It's amazing how Sam Raimi changed the formula of his horror franchise with every sequel.It's not even a horror comedy, it's a fanatsay comedy with a few horror elements.But I didn't mind much."}], "recommendations": ["evil_dead_ii", "zombieland", "shaun_of_the_dead", "thor_ragnarok", "hot_fuzz", "iron_sky", "guardians_of_the_galaxy", "scream_4", "deadpool", "the_babysitter", "the_return_of_the_living_dead", "scary_movie_4", "the_lego_ninjago_movie", "venom_let_there_be_carnage", "austin_powers_the_spy_who_shagged_me", "cabin_fever", "piranha_3dd", "thor_the_dark_world", "tremors", "the_a_team", "deadpool_2", "the_meg", "zombieland_double_tap", "from_dusk_till_dawn", "paul"]}