{
  "id": 5,
  "title": "Army of Thieves",
  "starring": [
    "Matthias Schweighöfer",
    "Nathalie Emmanuel"
  ],
  "runtime": 127,
  "genre": [
    "Crime",
    "Comedy"
  ],
  "description": "A mysterious woman recruits bank teller Ludwig Dieter to lead a group of aspiring thieves on a top-secret heist during the early stages of the zombie apocalypse.",
  "releaseYear": "2021",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/j04Oepj3LGTWSb1ltXm0pcy50Xq.jpg",
  "categories": {
    "plot": 6.67741935483871,
    "acting": 7.176470588235294,
    "ending": 3.0,
    "soundtrack": 6.0,
    "cinematography": 8.333333333333334,
    "familyFriendly": 3.0,
    "funny": 5.6,
    "action": 8.25
  },
  "reviews": [
    {
      "rating": "3",
      "text": "In a nutshell, Army of Thieves is a generic safecracking movie that runs 30-minutes too long. It can be enjoyable at times but once you get to the second half of the movie, You just want it to be over with. The characters are blandly written, The plot is predictable, and there is no real reason for the group of thieves to be doing what they are doing, other than tying into the plot of Army of the Dead."
    },
    {
      "rating": "4",
      "text": "Bland prequel whose run time overstays it's welcome. Acting is serviceable enough and story keeps you entertained for the first half then quickly becomes boring."
    },
    {
      "rating": "3",
      "text": "The movie is very enjoyable to watch and pass the time by. Unfortunately it is not as good as the army of the dead, in my opinion. It has a somewhat typical ending to a Hollywood film. You can guess the ending before it even happens."
    },
    {
      "rating": "8",
      "text": "I thoroughly enjoyed this film.  I've watched it six times already.  I really enjoyed the choice to have a \"nerd\" character in the lead role for a change.  I absolutely love Matthias' way of playing an every-man character.  While I can tell some of the plot was simplified to make it move faster and it's still just a basic heist movie, I love the characters and I love getting more of the back-story on Dieter.  I actually enjoyed this movie more than Army of the Dead.  I thought the slow pacing of that film just drug the story out way too long. They could have done a bit more on the safes and made them more of a challenge on the safe-cracking.  Other than the suspense of getting caught, the actual cracking of the safes was not that difficult.  There could have been some tricks or some parts of the story that he forgets along the way, that made it more complicated."
    },
    {
      "rating": "0",
      "text": "Horrible movie the first one with the dead sucked this was just hot garbage I can’t believe everything Zack Snyder does in movies is bad actually yes I can stop hiring that guy!"
    },
    {
      "rating": "7",
      "text": "After being completely disappointed and bored by Army of the Dead I was really surprised how much I enjoyed this spin off. It's a fun heist movie with entertaining characters and fairly slick cinematography. Definitely one of the better heist movies i've seen in years."
    },
    {
      "rating": "9",
      "text": "2021 will be remembered as the year Zack Snyder owned and exploded back onto the screen, first with the release of the REAL, ACTUAL, TRUE, DEFINITIVE movie and CANON to the DCEU......Zack Snyders Justice League. Then came the zombie feast in Army Of The Dead.NOW!.....Army Of Thieves a fantastic heist prequel and lead up to AOTD directed by Matthias Scheighofer joining forces with producer Zack Snyder. The visuals and cinematography like always with the help of snyder are top notch and is a visual treat and I enjoy the movie very much, bring on Planet Of The Dead."
    },
    {
      "rating": "2",
      "text": "Works great as background noise, but not much else. Just another piece of filler content for Netflix, which is par for the course these days.Silly cartoonish plot with a \"Fight Club\" for safecrackers. A protagonist that somehow fails upwards despite being so nieve and dumb about everything. Not very engaging, not good writing, not good logic. I think the only reason it has any attention is due to a certain divisive person behind it. If you liked 2016's Suicide Squad, you might like this though, they are very similar in presentation."
    },
    {
      "rating": "1",
      "text": "Childish humor and unimaginative filmography. Cliche Hollywood flick cashing in on the same old overplayed script. It should have just been a stand alone bank heist film and not a prequel to a zombie movie."
    },
    {
      "rating": "9",
      "text": "Fun, exciting and full of humor! Great characters with a good story that ties into Zack Snyder's Army of the Dead."
    },
    {
      "rating": "9",
      "text": "Army of Thieves is the typical light heist movie such as Ocean's, Now You See Me among others of the genre but takes everything that makes those movies good and put them on a higher level. It presents an interesting plot which makes you want to invest time on the movi, even considering that the first act is kinda slow, but after all the presentation and setting the plot, you go down full speed to the end. Never felt rushed, you can see and feel the team as a team. They have that chemistry even tho they are quite different from each other.The best of the movie was Dieter by far. It will make you see it with different eyes and understand the character better when you watch Army of The Dead again.Army of Thieves is a great prequel but watch it after Army of The Dead. It will make you appreciate more both movies."
    },
    {
      "rating": "9",
      "text": "Fantastic heist movie! Unique! Cheeky humor... never expected safe cracking to be so intriguing"
    },
    {
      "rating": "10",
      "text": "It's pretty rare for me as of right now for a prequel to be more exciting and way much better than the original, director and actor Matthias Schweighöfer is surprisingly can not only managed the acting (so do the other) and the direction but the visual, the cinematography, it's fantastic, it's superb, Army Of Thieves is a fun ride, it's a pleasant surprise and it's worth to watch, overall, Army Of Thieves is one of the most entertaining movie in 2021."
    },
    {
      "rating": "10",
      "text": "This movie was amazing! The beginning already got me hooked and the more I watched, the more I fell in love with the characters. The cast members are very talented and beautiful. The plot was well written. I finally found a comfort movie that explains MYSELF better than I can explain myself. Adventures are worth living for and has way deeper meaning than what it's set out to be. This movie was a mixture of romance, comedy, suspense, thriller, and everything else combined. Overall, I fell in love with this movie and is now my top 1. Credits to the director, Matthias Schweighöfer, for this incredible movie and for everyone that took part in it. Also, Nathalie Emmanuel, never disappoints! :)"
    },
    {
      "rating": "8",
      "text": "Army of Thieves works not just as a prequel filler for Army of The Dead, but carves its own identity with a premise full of events based on a heist mission. The story that revolves around the characters and especially the protagonist is what carries the film forward. The running time is pretty much spot on to include the necessary actions sequences, that aren't necessarily over the top but fulfills the purpose of coherent progression of its story. The critics' narrative as usual is a thing that goes against the merits of the movie that largely outweighs it lows. So, go ahead and watch without giving the slightest regards to Rotten Tomatoes or Metacritic based scores."
    },
    {
      "rating": "6",
      "text": "admirable[ ad-mer-uh-buhl ]adjectiveworthy of admiration; inspiring approval, reverence, or affection."
    },
    {
      "rating": "10",
      "text": "A funny movie, with a friendly protagonist and a gorgeous Nathalie Emmanuel. Really better than its \"sequel\"."
    },
    {
      "rating": "8",
      "text": "This film traces the origin of the German safecracker in Army of the Dead (his character was the best thing about that movie (my review). Matthias Schweighöfer plays this geeky charmer, whose obsession with safes lands him on a heist to rob 3 of them in several days. Schweighöfer’s comic skills create a simply delightful, slightly clueless individual. The story is basic heist structure, but Schweighöfer, who also directed, keeps the pace up and provides sufficient thrills and surprises to make this an entertaining crime caper with an idiosyncratic character at the center."
    },
    {
      "rating": "7",
      "text": "This was better than army of the dead as at least here we saw the main character's story more in depth and it was interesting to watch throughout. Maybe some plot parts could've been better and some things felt rushed, but overall fun movie, nothing too extraordinary about it though."
    },
    {
      "rating": "10",
      "text": "Loved army of thieves and it gives you just enough information on the safes without spoiling anything. Must watch if you watched army of the dead."
    },
    {
      "rating": "10",
      "text": "RapidFireOct 31, 20212021 will be remembered as the year Zack Snyder owned and exploded back onto the screen, first with the release of the REAL, ACTUAL, TRUE, DEFINITIVE movie and CANON to the DCEU......Zack Snyders Justice League. Then came the zombie feast in Army Of The Dead.NOW!.....Army Of Thieves a fantastic heist prequel and lead up to AOTD directed by Matthias Scheighofer joining forces with producer Zack Snyder. The visuals and cinematography like always with the help of snyder are top notch and is a visual treat and I enjoy the movie very much, bring on Planet Of The Dead."
    },
    {
      "rating": "6",
      "text": "Army of Thieves (2021) is an unexpected but welcome surprise. It's a prequel to Zack Snyder's Army of the Dead and focuses on the character of Ludwig Dieter, the genius safecracker, who is recruited by a group of thieves for his expertise on several high-level heists.Now, I did not like Army of the Dead so it's weird that the main actor i.e Matthias Schweighöfer himself directed this movie and it's a lot more competently made and enjoyable than what Zack Snyder did with a Vegas zombie movie...Anyway, the group of thieves is a cliched but entertaining lot as is a lot of elements in the movie. There is a good level of self-awareness that pokes fun at the heist genre and at itself while doing the said things it is poking fun at. Sure it's not consistent throughout nor is it well-executed all the time but it does work for a lot of the movie and that made it enjoyable.Ludwig Dieter was one of the few \"characters\" from Army of the Dead that I did like so getting to know A LOT more of him was genuinely interesting. Matthias Schweighöfer gave a fun and endearing performance that makes you care for him and while I'm not a genius nor am I socially awkward of that level, he was still oddly relatable.The mythology surrounding and involving the safes that were to be targeted and the appreciation for the craftmanship by Dieter was another thing that I quite enjoyed in the movie. Gave it an extra edge over typical heist movies as well as the fact that there are three instead of the usual one. The sacrifice had to be made for less meat on individual heists, though.The cinematography was dynamic and pretty good. The soundtrack was pleasing and had some great tracks that fitted the material of the movie well.Yeah, there are flaws and some stupid stuff, particularly in the third act but compared to Army of the Dead, it's nowhere near as bad that it ruins the movie.Overall, it was a fun time, much better than expected since I was going in with Army of the Dead level of expectations. The main character is engaging and the group is fun enough. Also, the Interpol side of things was stupid and hilarious and I loved it. Whether you liked Army of the Dead or not, I'd recommend giving this a watch, it's certainly better. Not an amazing movie by any means but gets the job done. And if I were to rate it, I'd give it a 6.5/10."
    },
    {
      "rating": "7",
      "text": "I will continue watching and recommending movies that aspire to do nothing more than entertain us for a couple of hours.  There is nothing groundbreaking here, but it's just well-made entertainment."
    },
    {
      "rating": "5",
      "text": "You know, when I watched 'Army of the Dead', my biggest take away from that movie was \"wow this German safecracker needs his own movie!\""
    },
    {
      "rating": "9",
      "text": "Увлекательное путешествие в предысторию \"Армии мертвецов\".Определенно 9 из 10."
    },
    {
      "rating": "5",
      "text": "If there's something I must highlight about Army of Thieves, it is this is the story that actually turns out to be the true heist movie.Much more than the excessive Army of the Dead.Now if we ask ourselves why this movie exists, I wouldn't be able to tell them.Beyond the mention of the zombies, and of course its ending. Army of Thieves and Army of the Dead couldn't be more any more different.That of course is a good thing, because the director and lead of this story could easily have tried something similar, but his film is more of an action, comedy and romance story with a European tone that despite some good moments, is predictable until the very bone.Heist movies tend to fall into that hole and Army of Thieves is fully aware of it, and in the results, is not even the slightest intention to show that could have been different.All the elements and cliches of the genre are present. Even the respective sequence with everyone in the team involved presenting themselves and their abilities.It's a tedious formula that Army of Thieves is simply unable to transcend.This film would have been a failure in theaters, because its strengths are not nearly enough to compensate for all its shortcomings.In fact, it reminded me a lot of another heist movie I watched not long ago called The Vault by Jaume Balagueró. Although this personally for me had better results.Obviously is the strong release of the month and week, for Netflix, but this movie will fade much faster than Snyder's film."
    },
    {
      "rating": "5",
      "text": "To begin with, this is not a movie about zombies. It was an average prequel that was simple and perhaps a little on the long side. There were other characters but the main character was the only one who couldn't be replaced by a hundred of different actors/actresses. Even his role was simple although he played it to the best of his talent. I guess I was expecting something more. This movie will be forgotten in another week or two."
    },
    {
      "rating": "6",
      "text": "Its a funny movie sometimes, it could be shorter and it looks to not be connected with the principal movie"
    },
    {
      "rating": "10",
      "text": "This was a fun movie. Including the cast unique personalities on screen. I think the director did a great job directing this movie."
    }
  ]
}