{
  "id": 3853,
  "title": "Around the World in 80 Days",
  "starring": [
    "Jackie Chan",
    "Steve Coogan"
  ],
  "runtime": 120,
  "genre": [
    "Action",
    "Adventure",
    "Comedy"
  ],
  "description": "A bet pits a British inventor, a Chinese thief and a French artist on a worldwide adventure that they can circle the globe in 80 days.",
  "releaseYear": "2004",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/bBiMw6Jtg8tSTcEq8jFV7qk9TRW.jpg",
  "categories": {
    "plot": 5.0,
    "acting": 8.0,
    "ending": 5.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 4.5,
    "funny": 7.4,
    "action": 6.0
  },
  "reviews": [
    {
      "rating": "6",
      "text": "Yes, the movie has a few funny lines, and yes it isn't a terrible disaster. However, I expected something more than what it was, and it was just okay."
    },
    {
      "rating": "10",
      "text": "Awesome movie with a great mix of comedy and action. Features some of the best actors around!"
    },
    {
      "rating": "0",
      "text": "God, what a f.cking piece of sh.t. I'm a fan of Verne's novel, and they've just butchered it. Again. Oh well, that's Hollywood for you. De France and Jackie Chan are the only ones who actually do well. Possibly because they're not taking their roles seriously and they're just in it for the money. They were wasted on this crap."
    },
    {
      "rating": "5",
      "text": "It's a standard Jackie Chan film. Timing directed cheap action on a beautiful story. This movie it's just a pale shadow of the '56 movie."
    },
    {
      "rating": "7",
      "text": "Its a fun and pleasurable movie. Its just something for people to enjoy when they just want to enjoy some simple, mild entertainment. There are parts that is funny and amusing in a mild way. Its best for kids."
    },
    {
      "rating": "8",
      "text": "screw the critics. I don't care if its bad. this movie is perfectly harmless and the jokes are really funny. thats all I have to say."
    },
    {
      "rating": "3",
      "text": "Considerado por mim um dos piores filmes de Jackie Chan, o filme  horrível demais pra não dizer coisa pior o diretor fez uma péssima adaptação suja.."
    },
    {
      "rating": "6",
      "text": "I was hoping  Around the World in 80 Days would bring more adventure, but it was a quick tour through just a few countries. Surprisingly it had lots of known actors sprinkled around the movie witch made it interesting, but besides that nothing really made it stand out."
    },
    {
      "rating": "6",
      "text": "It's a beautiful movie, with stunning visuals and funny and silly Jackie Chan stunts. Also, the scene with Schwarzenegger as the Turkish prince is to die for."
    },
    {
      "rating": "2",
      "text": "At points i felt like i should be enjoying this movie, but even with the big budget and nice visuals, this movie feels unimaginative and was a chore to watch.Rating - 25%"
    },
    {
      "rating": "6",
      "text": "Decent entertainment, but forgettable.The look of the film feels very Disney. It is all very much orientated towards satisfying children."
    },
    {
      "rating": "7",
      "text": "----------------------------------7.3/10-----------------------------------"
    },
    {
      "rating": "7",
      "text": "Even though this movie isn't the greatest, I must admit that I was pleasantly delighted by it. I really found myself giggling as we embarked on our global trip. Since there were so many supporting appearances, it was exciting to see who would appear next. Jackie Chan is a genuinely gifted actor. The brutality was a little lighthearted, but the results were real. I liked how each nation became magical as they departed for the next."
    }
  ]
}