{"id": 1280, "title": "Arrival", "starring": ["Amy Adams", "Jeremy Renner"], "runtime": 116, "genre": ["Drama", "Science Fiction", "Mystery"], "description": "Taking place after alien crafts land around the world, an expert linguist is recruited by the military to determine whether they come in peace or are a threat.", "releaseYear": "2016", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/x2FJsf1ElAgr63Y3PNPtJrcmpoe.jpg", "categories": {"plot": 7.645161290322581, "acting": 6.863636363636363, "ending": 7.384615384615385, "soundtrack": 8.0, "cinematography": 8.333333333333334, "familyFriendly": 6.0, "funny": 7.0, "action": 8.666666666666666}, "reviews": [{"rating": "10", "text": "Just like Villeneuve's other films, this one has proved that he is one of the greatest director nowadays. The way that he approaches a common theme in movies is almost revolutionary."}, {"rating": "4", "text": "Denis Villeneuve is a talented and promising filmmaker, 'Prisoners' being an obvious benchmark. While I'm still looking forward to his Blade Runner sequel I have to say Arrival was a huge disappointment. Amy Adams great performance notwithstanding, this was a ponderous, superficially profound movie that ultimately goes nowhere."}, {"rating": "4", "text": "As other have commented, Villeneuve is a good director but this is a step in the wrong direction for him. I hate to use the B word {boring}, but Arrival is a real endurance test even for fans of serious, thought provoking movies."}, {"rating": "1", "text": "An 'alien' film to leave you totally alienated! This is so self-important and ponderously dull that it makes Ingmar Bergman's depressive dramas seem like comic farces. The screenplay is all **** and pretension in which Amy Adams' language specialist amazingly deciphers the black ink vocabulary of the extra-terrestrials in record breaking time. A feat that only ever happens in the movies. The creatures themselves look like a cross between giant squids and an elephant's foot, and it's no exaggeration to state that their presence is underwhelming. The first ten minutes promise much but we never get that film. Instead as soon as the alien pods arrive degeneration in to boredom is immediate and sleep inducingly effective. Praised by the highbrow critics, make no mistake this is alarmingly over rated. A totally confused and uninteresting example of the sci-fi genre. Arrive? It certainly did. However, I couldn't wait to leave!"}, {"rating": "1", "text": "Nothing here that hasn't been done a thousand times. Simple time loop paradox. If you're looking for a movie about aliens, this is not it. It really has nothing to do at all with aliens. It's a weak tug at heart strings depicting a story about a parent that loses a child. The chemistry between the two main actors is non existent. Just a terrible waste of 2 hours."}, {"rating": "5", "text": "Not great. As others have said, it is slow. Also, it feels like they just did a wikipedia search for \"linguistics\" and then wrote a script around the first paragraph. I don't see this as a cerebral sci fi film at all. More of a cheesy, slog-fest."}, {"rating": "3", "text": "Arrival is being called one of the best Science Fiction films in years. It is one of the best rated and reviewed films of 2016, and is drawing comparisons to Close Encounters of The Third Kind, but I have a question, did they watch the same film that I did? I wasn't crazy about Close Encounters, but that movie was leaps and bounds ahead of this one. Twelve alien crafts land in random places all across the planet, and the people are in a panic. Some countries react with hostility, but the U.S. Government decides to act cautiously (yeah right), and send Dr. Louise Banks (Amy Adams), the best linguist they have, to figure out a way to community with the aliens. The aliens, turn out to be giant octopus, whose language turns out to be ink that they squirt into the air. This movie features flashbacks and flash-forwards, that seemingly make no sense, until the end when you finally figure out what they mean and once you do, you realize that you just wasted two hours of your life. If that wasn't bad enough, the film moves at an absolute snails pace, I mean you could take everything that actually happened in the film and squeeze it into about twenty minutes. The rest is just people talking to each other about the same damn thing over and over again. Trying to figure out the same thing over and over again. Worrying about the same things over and over again. The characters have no personality whatsoever, and you might think that it's one of those slow moving weird films that all comes together in an amazing ending, but no, it doesn't. Once you can see the whole picture, as one lady in the theater so eloquently shouted out, \"really, that's it, that was so stupid.\" Her uncontrolled outburst really sums up this entire film. Honestly I think the slower and more artistic a film is, the more the critics love it, but I am one critic who isn't fooled by great actors and emotional music, this isn't the best film of the year, this is the biggest turd of the year, and it should be avoided at all costs!"}, {"rating": "2", "text": "boooooring. As a big fan of Sicario and Prisoners i expected better. paint dries more entertainingky than this. like watching a kid draw with an etch a sketch for 2 hours. Even Forrest Whitaker sucked. Jeremy Renner often sucks, no surprise there. it felt like they were afraid to wake up the audience."}, {"rating": "3", "text": "The movie preview showed aircraft flying overhead.  This was the only action in the entire movie.  A low budget, slow, out of focus movie.  Watching paint dry has more action.  A rare film that wanted to make me demand my money back."}, {"rating": "0", "text": "This was on my must see movie list.  The movie starts out very slow, then gets slower until finally I started to doze off. The movie makes absolutely no sense. There's no suspense or any action. Other than Amy Adams performance the rest of the cast is nothing as they mailed their parts in. The ending is beyond ridiculous. Avoid unless you have insomnia. You've been warned."}, {"rating": "0", "text": "Viewer be warned.  Preview contains all the \"excitement\" of this supposedly \"clever\" sci-fi movie (very sad).  Actually, this has been grossly overhyped by professional film critics.  I would like to have my money back if possible.  Dark, slow, incoherent plot that challenge you to stay awake.  Tried my very hardest to enjoy this movie, but failed to do so.  One film critic graciously rated this as: wait until it comes out in DVD.  My vote: skip this movie and spend your hard earned money elsewhere.  In summary, I feel scammed by the professional film critics, similar to the many fake reviews on Amazon."}, {"rating": "10", "text": "What a moving film. A first contact movie that makes you think rather than just relying on the latest CGI effects. They enhance rather than carry the movie.Amy Adams is perfect as the interpreter. All her emotions are there to see.If movie length CGI battles are your thing then this probably isn't the movie for you.It's how I would imagine First contact would be like."}, {"rating": "7", "text": "There are generally two different types of \"good\" sci-fi in my book: Straight forward that uses the film's setting to its advantage (Aliens, Terminator 2), and cerebral which makes the viewer think about new ideas and old ones in new ways. Arrival falls into the latter.It's a little slow for multiple viewings, but it poses an interesting idea and a mystery that you'll be as eager to figure out as the characters."}, {"rating": "8", "text": "I don't think this movie is about that \"what makes us human\". Personally I think it is about creating your own reality. The whole movie developes around the ability of a character to understand a language. In a way, Adams' character is a child (humanity) learning to speak. She has to go through all the tribulations of learning a new language, a powerful one at that. The premise is quite interesting and it took me two views to get it: Your language (the way you express what you think) determines your reality. They even mention it at the beginning of the movie, with the Sapir-Whorf theory. This is by far a very metaphysical proposal, and a very adecuate one at that, one that has been told to us by great master of ancient (\"For by your words you will be justified, and by your words you will be condemned\"). In a way, language IS reality, it is the only way we have to describe it and thus create it. So it would make sense that a more powerful language would create a different, more powerful reality. In the movie, learning the aliens' language would opne the doors of time and space for you, and this can be wither a weapon (as first understood by humans) or a gift, as later realized by Adams. Of course the ability to thread between past, present and future could be a powerful weapon, or a great gift. Once she realizes this, it is quite interesting that she still chooses to have her baby, aware of the outcome, but the most important choice she makes, while having the ability to visit the past or future, is to live in the present. Powerful message indeed. So now you know, choose your words carefully."}, {"rating": "10", "text": "An intriguing film with an interesting concept of first  contact with aliens. Its only drawback is that an IQ 80+ is required to enjoy a movie without an abundance of shootings, explosions, and naked boobs. Otherwise, you will write on metacritic that you were bored \"cuz here iz nut enugh acteon, dood!\""}, {"rating": "10", "text": "One of the best sci-fy films. One of the best and innovative directors. Predictable result."}, {"rating": "10", "text": "The most intelligent film ever.The best Sci-Fi film ever.The best film of Denis Villeneuve.It's the best multisensorial experience; how script, directing, cinematography, editing, sound, production design, visual effects and performances strike a great balance one each other to breakthrough a new way to watch and understand the pass time."}, {"rating": "10", "text": "Arrival is one of the best sci-fi movies ever made. Everything from Amy Adams'performance to the design of the ships, the aliens, the concept of the time, and how we perceive it, is extraordinary. Denis Villeneuve is a genius."}, {"rating": "10", "text": "This movie is something extremely rare among science fiction movies.  It is thoughtful, intelligent and well-done science fiction at its best.  There are no space battles or super heroes or wookies.  The aliens don't want to eat us.  In fact the point of the movie is to figure out why the aliens have come in the first place.  I don't want to gush but I love this movie."}, {"rating": "8", "text": "This is quite an eery film - I felt it seemed almost more like a documentary than a sci-fi drama film at one point, with a narrator explaining to the viewer what had been learnt about the mysterious new beings from outer space who have apparently taken up residence in a number of locations on Earth. I liked the nostalgic flashbacks shown, a reminder of childrens curiosity and wonder when faced with seeing certain things for the first time. Its a relatively atmospheric film, with looming music used in the background, not dissimilar to that present in other previous sci-fi films, most notably Close Encounters of the Third Kind. It also reminded me somewhat of Jodie Foster in the film Contact from the 1990s.Its a somewhat deep film that makes you think about how threats are handled, at a global level, the responses by various governments and the like. If anything, I found it refreshing that in this instance, the US didn't exactly go in 'all guns blazing' and I appreciated that the main character, Louise Banks, tries very hard to understand and see things from the unknowns' point of view. I don't think I can say much more but suffice to say, I recommend this film."}, {"rating": "9", "text": "Great plot, soundtrack, art, characters, actors and everything you can imagine. The director really gave hints in every moment and used a typical cinema technique to hide the plot."}, {"rating": "10", "text": "Amy Adams gives a superb performance in what could be called \"Independence Day with a Brain.\" Denis Villeneuve delivers an intentional methodically paced script with the sort of intelligence, nuance, and confidence that feels wholly refreshing."}, {"rating": "6", "text": "This movie a huge disappointment. It's boring, the plot is a joke, and it tries to very deep and philosophical even though by the end of the movie, you don't care about the characters or their troubles. A waste of time."}, {"rating": "9", "text": "Really amazing movie with great visuals,the characters in the movie were described beautifully and intelligently.Arrival in my opinion did everything right what other alien invasion movie ruins,it is a perfect response to bad movies"}, {"rating": "10", "text": "Arrival is a beautifully complex film that centres on the role of humanity in this world rather than the \"arrivals\". With this, the movie brings a new look to the sci-fi genre, as it deals with themes and emotions that many can relate to in the modern world. Arrival proves to be one-of-a-kind and one of the best in the genre, not just for pure action or the cliches we tend to see in such movies, but for its creativity and thought-provoking ideas it presents to the viewer. It is a movie that does require utmost attention, however, the experience is truly rewarding, as director, Denis Villeneuve continues his run of exceptional movies. Amy Adams, who plays a linguistic professor, leads the movie with a strong performance, yet playing a vulnerable character who succumbs to the events that unfold. The 'arrivals' themselves are wonderfully designed and their language particularly is a topic in on itself. Crafted with great cinematography and moving music, this was a deserved Oscar-nominated film, and truly one for the ages."}, {"rating": "10", "text": "This movie is not for everyone. If you wanted a science fiction action blockbuster then you will be disappointed. However it is one of the most brilliant plots in scifi. I won’t spoil the details but once you understand the twist it’s just magnificent. It is a movie worth to discuss with friends and very memorable because it does something completely different. The ideas for follow up stories are basically endless. It is based on the book “The story of her life” if I am correct. Also all actors were the right choices for their respected rolls. I think this will be a forgotten masterpiece because it is not mainstream enough. Sorry for not going in in details, but it will ruin the movie. Think about the twist in “The sixth sense”. If someone spoiled it for you the movie would be less good (or a lesser experience?)."}, {"rating": "10", "text": "I finally got around to seeing this one and I am so glad I did!  An interesting premise and cerebral plot more focused on language and geopolitical relations than the aliens themselves.  The movie also respects the science that it dives into and doesn't use it as a simple plot contrivance like many action sci-fi movies do.  I was left with a feeling of hope and intrigue after finishing it."}, {"rating": "10", "text": "Arrival is one of my favorite Sci Fi movies of all time.The movie doesn't need flashy action sequences or superficial Drama to deliver a thoughtful and emotional experience.Even the \"plot twist\" if you may call it that is in clear service of the story and not just a plot twist for the sake of it.Arrival manages to connect with me every time I watch it. I think this is some of the best that Sci Fi has to offer."}, {"rating": "9", "text": "\"Arrival\" é inovador, mesclando conceitos ambíguos a uma premissa talvez antes nunca explorada, subvertendo tudo que esperávamos sobre o longa.A atmosfera do filme é muito bem construída aqui, moldando o plot desde a primeira cena do filme. A subversão dos até então \"flashback's\"; a elegância da fotografia, respeitando muito bem as magnitudes, o que deixa claro que esse filme foi feito para telões; o background da trama é bem definido pelos telejornais, o que gera uma influencia grande da trama, tanto nos acontecimentos quanto na nossa percepção dos acontecimentos. A OST é magnifica, tanto no conjunto como no clímax.A compreensão do tempo é muito bem representada aqui, com um plot inteligente e uma abordagem como eu disse acima, inovadora. Enfim, todos esses fatores - e muito mais - tornam a experiencia incrível. É um filme essencial para os fans do gênero.Audio: English, with portugueses subtitles. Q60T 50' TV Speakers [Dolby 5.1]Quality: 4K HDR [Bluray]"}, {"rating": "9", "text": "Phenomenal movie. I wouldn't have watched this movie if I hadnt known about the intriguing ending (yes I was spoiled but I don't mind). I've never been a fan of Amy Adams in Superman or Jeremy Renner in Marvel but the story, delivery and slow pacing really punches this movie high. I wasn't disappointed at all. It has never a dull moment and there are many parts I can rewatch many times just to think about how they unfold. Lots of small details to look out for too like Abbot's actions before something happens. This movie is right up there with District 9, Contact, The Martian and Interstellar."}, {"rating": "10", "text": "The best thriller/sci-fi film I have ever seen in my life. The work behind the camera by Denis Villeneuve is majestic. The concept behind the origin and the meaning of the \"aliens\" is absolutely original in every shape. The work made by Joe Walker in the sound editing with the beautiful shots made by Brandon Young gave that little touch to the film to make it feel smoother."}, {"rating": "10", "text": "After seeing Arrival, I understand my dog better. So for all owners of a young dog, the movie is quite worth your while ;)Okay, this is a strange intro to my review but fits. The film is all about communications and different senses. And its execution is great.The movie is a very intelligent one that sells its seemingly impossible message quite plausibly. It's also a slow and quite movie. Those craving for lots of actions and explosions maybe should elsewhere.And miss out on an impressive experience, of course."}, {"rating": "5", "text": "This is a science fiction movie about aliens visiting our planet. Or rather about attempts the mankind takes trying to establish a contact with aliens.The movie is done quite professionally, and I liked it's cinematography and sound track.There are good actors starring there (Amy Adams, Jeremy Renner, Forest Whitaker), and they deliver adequate performance. Most of the movie kept me interested. Sometimes pseudo-philosophical lingo carried me away. I think the movie was too long, and the script has not been thought through, leading to nowhere. Which is a shame, it had a lot of potential."}, {"rating": "9", "text": "Arrival is intelligent, dramatic, scary and heartfelt from beginning to end. The main character's quest to understand the mystery behind the alien's purpose is extremely engaging. With each twist and turn the film kept me begging to know more."}, {"rating": "7", "text": "It’s the end of the world as we know it! A much discussed and sometimes feared story has come true which, honestly, always sounded a bit ridiculous to actually happen in the real world.I am, of course, talking about this new sci-fi drama „Arrival“ where mankind is greeted by huge alien spaceships in the sky who seem to be coming in peace… wait, did you think I was referring to Trump becoming the next leader of the free world?But yeah, these two events have a very similar plot summary so it’s only fitting that I had the chance to experience them in the very same morning.Directed by Denis Villeneuve – the man behind „Prisoners“, mindbending „Enemy“ with Jake Gyllenhaal, „Sicario“ and currently filming „Blade Runner“ sequel –, one could expect „Arrival“ to be a thinking person’s sci-fi. And one is not wrong.It is a 116 minute slow-burner all heavy on atmosphere and light on explosions or any quick thrills. If you wish a quick reference to any recent well-known movies, the result is a bit like Christopher Nolan’s „Interstellar“ crossed with Terrence Malick’s „The Tree of Life“. Robert Zemeckis’s „Contact“ (1997) would not be very far either, because „Arrival“ also focuses on fragile yet brave female protagonist whose quality acting is one of the main pillars carrying the whole experience. The other one would be overall atmosphere, deliciously dark and ominous. Some will like it, others will probably find it depressing and maybe a bit slow for their taste.I haven’t read the award-winning short story by Ted Chiang that „Arrival“ is based on. Wikipedia says that the major themes explored are determinism, language and Sapir-Whorf hypothesis which sounds mighty dry and mostly sci-fi geek friendly. So it’s nice to witness movie makers adding some mainstream appeal which comes mostly in the form of Amy Adams’s great performance. She truly holds the movie together as a woman going where no-one has ever gone before. You will believe her hesitations, the tears, and also the silent determination when the going gets tough. This kind of role is tricky because of the need to play it out mostly alone, often in close-up where every detail and tone has to be clearly seen and felt. Think Matthew McConaughey's mighty turn in „Interstellar“ but decidedly less showoffish.So it’s mostly Adams’s one-woman-show, and a quite rare chance to see her doing something memorable and worthwhile on screen. She accepts too many decorative pretty girl roles, even in more ambitious projects. The all-male supporting cast is good too, especially star players such as Jeremy Renner and Forest Whitaker. As stated above, I don’t know the original story but \"Arrival's\" message is rather spiritual and not \"dry\" at all. Essentially it is a reminder that mankind’s future depends heavily on our ability to understand and connect to the world, rather than attacking and overpowering everything we find foreign or downright alien. It’s a call to rise above the inflexible ego-based mind the western society so dearly values, and to find balance with our intuitive side.Overall, „Arrival“ is a good movie although I wasn’t especially happy with the final act which seemed rushed. It felt like somebody grew impatient near the end and wanted to add something „impressive“ just in case the people were not happy with this slow-moving tale. I do not want to talk about it here in detail but, for me, it lessened some of the movie’s overall impact. Mostly because there was not enough time to play it out as properly as the stuff that had come before.But yeah, if you are into more intelligent sci-fi and don’t prioritize explosions, „Arrival“ is good to go."}, {"rating": "8", "text": "Arrival is an excellent offer by sci-fi director Denis Villeneuve, and I think he is going to be our generation's great sci-fi director. A beautiful script that makes this alien visit so personal and yet so grand at the same time, Arrival plays like a parable about communication and the human condition. Amy Adams and Jeremy Renner give GREAT performances, and Villeneuve's shots are nothing sort of beautiful. People who are not science fiction fans might have difficulty getting into Arrival fully, but once you're in, YOURE IN!"}, {"rating": "9", "text": "Dialectics, metaphysics and anthropology are sciences that are structured by a simple and complex tool: language. And that's what the pelucla is about, to build, through communicative language, space, mind, time and the elements that surround us. All with a loose but useful anti-war discourse. A wonderful movie from start to finish."}, {"rating": "9", "text": "I will put this movie one of the best Sci-Fi movies, same level with Interstellar. The eerie atmosphere and mystery kept me the edge of my seat. Also the scenes of the movie is beautiful and gorgeous and so is the soundtrack. Amy Adams? She nailed it."}, {"rating": "9", "text": "What humanity needs is to strive for a common goal. I love science fiction because it can paint somewhat realistic scenarios like ARRIVAL, in which our planet is saved by extraterrestrial intervention. But more real than our first alien contact is the way ARRIVAL depicts a planet divided by invisible borders and nations unwilling to cooperate. God I love this movie."}, {"rating": "10", "text": "If you like movies like Contact, or Interstellar, you will love this one. Don't want to say too much, just...MINDBLOWING"}, {"rating": "7", "text": "Unlike other sci-fi extra-terrestrial first contact films, Arrival is much slower paced. It focuses on contemplation, thought rather than action. That is not a bad thing, and in fact bodes well for the tone. It manages to be both suspenseful and intriguing, though it has the potential to expect more from its audience. I see many similarities between Villeneuve and Christopher Nolan; both of whom create visually striking scenes with a deep story to back it up."}, {"rating": "9", "text": "Perhaps perfect in its writing and direction and utterly dissimilar to any of its alien-themed predecessors. Arrival is smart, but slow and wholly touching and exciting so."}, {"rating": "4", "text": "In his first foray into sci-fi, Villeneuve's lofty ambitions are as over-calculated as they are under-executed. Arrival is far from the promised humanist thriller, coming across as a wannabee Nolan thinker, only less coherent and more pretentious. After the abominations of Enemy and Sicario, this may just be strike 3 for Denis."}, {"rating": "3", "text": "This movie was so dull that I’d watch Barney Reruns while eating whatever I can find in the garbage bin rather than sit through all two hours of this severely underwhelming story again."}, {"rating": "9", "text": "Arrival is a sci-fi film only in presentation, as the film explores deeper themes of human communication and aggressiveness. While Arrival’s initial presentation may seem jarring and somewhat flawed, as the movie progresses and the twist is revealed, the editing choices and the pseudo-confusing sequencing end up contributing to the movie's meaning as a larger whole. Arrival explores various linguistic and psychological theories and takes them to an extreme, even using them as the crux for its storytelling. While it does benefit the viewer to be familiar with psychological concepts, especially linguistic determinism, the film does a good job explaining the fundamental concepts the story is based upon. Arrival is not only a cautionary tale but also a hopeful one. Arrival purports that through cooperation and coordination, i.e. through avoiding competition, a future which benefits more to a greater degree can be achieved. In this way, Arrival is a greatly anti-capitalist film presented in a widely digestible way. Villeneuve is a highly-skilled director, and, with Arrival, he shows that he can blend genres and excel while doing it."}, {"rating": "10", "text": "This movie was fantastic. Villeneuve's direction was beautiful, it just reminded us that he's one of the greatest directors of our generation."}, {"rating": "10", "text": "With no doubt, one of the best movies of the decade, far from the typical Hollywood script."}, {"rating": "5", "text": "Tremendously overrated. It is a good movie, and has very good special effects, but it did not deserve a best picture nomination. At best it is forgettable."}, {"rating": "8", "text": "This writer gets no cred on the street I live on. Read \"Story of your life\" by Ted Chaing. Get real with yourself. Look in the mirror dogdamnit."}, {"rating": "10", "text": "First time you watch it: 8/10.Second time: 10/10, hands down. A true masterpiece."}], "recommendations": ["annihilation", "interstellar", "coherence", "sunshine", "inception", "the_martian", "captive_state", "avatar", "donnie_darko", "mortal_engines", "lucy", "chaos_walking", "the_green_knight", "source_code", "cloud_atlas", "i_am_mother", "they_live", "anon", "contact", "europa_report", "moon", "ex_machina", "blade_runner_2049", "what_happened_to_monday", "the_13th_warrior"]}