{
  "id": 4850,
  "title": "Arthur",
  "starring": [
    "Dudley Moore",
    "Liza Minnelli"
  ],
  "runtime": 97,
  "genre": [
    "Comedy",
    "Drama",
    "Romance"
  ],
  "description": "Arthur is a 30-year-old child who will inherit $750 million if he complies with his family's demands and marries the woman of their choosing.",
  "releaseYear": "1981",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/l8bPNKEuXJmaxkwVp8JpYiNQJWI.jpg",
  "categories": {
    "plot": 3.6666666666666665,
    "acting": 4.444444444444445,
    "ending": 5.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 5.75,
    "funny": 5.5625,
    "action": 4.0
  },
  "reviews": [
    {
      "rating": "7",
      "text": "Hardly what one would call a \"hit,\" but easily digested by the way Russell Brand carries himself - making the best use of a bad bargain. Let's not take ourselves too seriously here. There have been worse movies which, in time, became cult classics!"
    },
    {
      "rating": "0",
      "text": "This film??!! is like having to watch Tiny Tim on bad acid cut with speed in a room with no doors.  There is bad and there is bad and there is BAD.  This movie wins big on all three counts."
    },
    {
      "rating": "4",
      "text": "Arthur he does what he pleases - which, apparently, is to come up with nary a shred of original thought.  It's an un-calculated, rushed and by-the-numbers remake with a little bit of heart and almost no soul...but it's not awful.  It's meandering and hollow with glimmers of promise, faint touches of cute and a whole lot of harmless, reigned-in Russell Brand humor taking center stage.  Let's say the filmmakers truly were caught between the moon and New York City in recreating an 80's gem...is this really the best that they could do?!"
    },
    {
      "rating": "3",
      "text": "It has a few fun moments, but its true worth comes from its reminding you of how good the original is. Dudley & Liza are so incredibly good, and they tower over Brand & Gerwig. And what the hell happened to Nick Nolte? He looks like a sunburned Nick Nolte blow-up doll in this movie. The 3 points I give to this film all belong to Mirren (who is brilliant), but she's not nearly enough to put it into recommended territory. The scene from the original in which the grandmother decides that \"No Bach will be Poor\" and gives him the money was priceless - and it's completely lost in this version. And all the comedy from Liza Minelli's dad in the original - lost in this one as well. Oh well - they dumbed it down like everything else it seems."
    },
    {
      "rating": "10",
      "text": "There is a lot of urban humor in this film which might not be appreciated by some movie goers.  Many critics who saw the original 1981 â"
    },
    {
      "rating": "0",
      "text": "I thought a comedy was supposed to be funny.  The original with Dudley Moore was maybe not great, but at least good.  The new version was as funny as what I left in the toilet this morning."
    },
    {
      "rating": "2",
      "text": "I can't say much for the movie/screenplay itself.  It was just lame, boring and flat. But Russell Brand was horrible, annoying and insufferable. He looked bad enough in the trailers but the movie was even worse.He should have to pay us to sit through his pathetic attempt at comedy."
    },
    {
      "rating": "8",
      "text": "I certainly enjoyed Arthur. I didn't expect much of it, but it really surprised me. I'm a fan of Russel Brand, and I think he just knocked it out of the park. He was as hilarious as he always is, and his interactions with Helen Mirren were very funny. Overall, the cast was terrific. The jokes ranged from random babbling to genuine belly laughs. If you've got nothing else to do and want to kill some time, watch Arthur!"
    },
    {
      "rating": "3",
      "text": "This movie had its moments in being funny. The lead's role could be realistic and apply to some. Considering it went under comedy - it doesn't fit the category. The movie lacked any memorable moments and became a lag to sit through after the first 30 minutes."
    },
    {
      "rating": "8",
      "text": "Sweet and very enjoyable.  This is not the kind of Farrelly Brothers-type experience you'd expect with Brand starring.  Instead we're treated to a nice, entertaining lovable movie."
    },
    {
      "rating": "10",
      "text": "I don't know if I give this movie a 10 exactly, but I'm using my power of the vote to bump up the rating as best I can. This is a far cry from what was the awful \"Get him to the Greek.\" I think through this movie Brand really has arrived on the scene, and any fan of his I'm sure will appreciate this movie for all that it is. I'd recommend it to anyone looking to share a laugh, bring your best friend."
    },
    {
      "rating": "10",
      "text": "I found this version to be much better/funnier than the Dudley Moore version.If this movie is a sample of what Russell Brand can do he has a bright future."
    },
    {
      "rating": "2",
      "text": "Russell Brand irritates the hell out of me.  Thereâ"
    },
    {
      "rating": "10",
      "text": "epic"
    },
    {
      "rating": "3",
      "text": "Arthur Bach(Dudley Moore) is going nowhere fast. In the original 1981 version of \"Arthur\", the millionaire drunk races his Porsche around a circular track, and even though the late filmmaker doesn't overemphasize the point with an extended long take like Sofia Coppola did in \"Somewhere\", even the most amateur of semiologists can locate the metaphor. Johnny Marco, the famous film star who makes revolution after revolution on a deserted motorway in the Coppola film, like Bach, the perpetually inebriated heir to a major corporation, is no stranger to melancholy despite all appearances of having it all. If Johnny only had a snobby butler with a pithy manner of speaking. Hobson(John Gielgud) won't have none of Arthur's moaning and groaning about being unloved and miserable. Despite being a transplanted Brit, you can never really take the Englishman out of the English, and people from the U.K. believe in a stiff upper lip, not a quivering lower one. After Arthur removes both his helmet and goggles upon Hobson's request, the longtime manservant(and surrogate father) promptly slaps him in the face like an anal-retentive mobster, while calling Bach a \"selfish bastard\" for good measure. The unhappy playboy catches the customarily stoic old man at his breaking point. Hobson's opinion on \"what's the worst part of being [Arthur]\" differs from his arrested developing charge, and although he loves the \"little s*it\", the valet can take only so much narcissism and ignorance. He sets Arthur straight, overstepping his bounds as a mere servant by dealing out some light corporal punishment, like a father. That's what Johnny needs: a few b*tch slaps to the face for being so out of touch with the way people of lesser means live, but the only prominent male in the actor's life, Sammy(Chris Pontius), is an enabler, a playmate for both Marco and his daughter Chloe(Elle Fanning), a girl too young to be the steadying influence that the overgrown child needs. That's what the new Arthur(Russell Brand) needs too, a father figure; a butler instead of a nanny, as suggested by the movie itself in the opening scene where the much taller(and less lovable) layabout rams his Batmobile into an anatomically correct bull statue. Considering that the new \"Arthur\" places the well-heeled millionaire into a personal world dominated by strong women, a pointed juxtaposition presents itself through Arthur's close proximity to the bull's gigantic golden testicles. It's an insinuation of a man, a mama's boy who's been emasculated by the fairer sex. Recast as a woman, Hobson(Helen Mirren) treats Arthur as if he was still a boy, reading to him a children's book about a frog and a toad before he's put asleep. The butler, on the other hand, may tend to his employer's needs, but he does so with a sense of irony, by never coddling Arthur to such an unhealthy extent. Following his master's request that he should draw him a bubble bath, Gielgud sarcastically quips, \"Perhaps you'd like me to come in there and wash your d*ck for you,\" and in the waiting room of his father's workplace, Gielgud's Hobson makes a dry joke about going for ice cream, as a response to Arthur's insistence on acting like a petulant child. In the presence of his father, Stanford Bach, Arthur learns the bargaining terms associated with his upcoming engagement to Susan Johnson(Jill Eikenberg). Marry the woman, or lose seven hundred fifty million dollars. In the remake, the conditions are the same, but not the sex of the blackmailer. Ms. Bach, working in concert with a completely revamped Susan(no longer the doormat who loves Arthur unconditionally in the original), lays the law down to her son, in which his fiancee, Vivienne's top lieutenant in the family company, views marriage as a business partnership. Susan is ashamed of the stigma tied to \"new money\", therefore undermining her blue collar father's pride in being a self-made man. She wants the Bach name. Susan doesn't love Arthur. And yet, the unlicensed tour guide hardly seems the right fit for the playboy either. Of all things, she tells bedtime stories. He already has Hobson for that. Earlier in this new \"Arthur\", echoing the scene where Gielgud slaps around Moore on the race track, Mirren knocks out Brand with a swift right while former heavyweight champion Evander Holyfield looks on. Since Hobson had breastfed Arthur well-past an age which society would deem acceptable, she should tell him that the punch is a pointed one, a wake-up call to finally grow up. Unlike the butler, the nanny doesn't really prepare Arthur for adulthood. The man-child sees himself as Batman, but really, he's more the Robin-type, the sidekick. He's Batman by default, since the chauffeur, another enabler, seems to be his only male friend. In the original \"Arthur\", Hobson is clearly the Caped Crusader to the titular character's boy in \"short pants\". Sometimes a woman can't do a man's job."
    },
    {
      "rating": "3",
      "text": "When I heard they were remaking Arthur with Russell Brand as the lead, my immediate thought was, \"BRILLIANT!\"  Not so much.  While the movie actually did modernize the story pretty well, I always saw Dudley Moore as an immature adult rather than Russell's portrayal as a flat-out child.  To give credit, the story with the female Hobson actually fit very well.  Helen was fantastic, given the weak material.  Hearing some lines completely word-for-word repeated in this version made me cringe when I heard them.  I went into this with low expectations and they were met, but in hindsight, Arthur should have never been remade.  The original is just too classic."
    },
    {
      "rating": "4",
      "text": "A once mediocre movie starring Dudley Moore now seems rather exciting compared to this lifeless, pointless remake which has nothing to offer apart from a handful of quirky moments linked with obscene wealth (like having Hollyfield as your personal boxing trainer, etc)."
    },
    {
      "rating": "6",
      "text": "Arthur is a mixed bag, it's not a bad comedy it's just not a really good one. There are some laugh out loud moments in here, but when it tries to add some emotional moments into the mix the movie suffers and just becomes plain boring. As for Russell Brand's performance it could have been better, but that might just be the scripts fault. I couldn't tell if Arthur was an annoying drunk, guy with a heart of gold, or just a dumb man-child. There are some really funny moments in here that had me rolling, but I really can't recommend you put up with the rest of the movie to see them. All in all it's funny but there are better options out there."
    },
    {
      "rating": "5",
      "text": "I didn't enjoy this as much as I thought as there was nothing but CORN(y) involved. Russell Brand's one character might need to evolve now before his talent gets washed up."
    },
    {
      "rating": "5",
      "text": "If you like Russel Brand, you will most likely enjoy this movie. It does not feature quality writing or directing but Brand is just charming enough to keep you interested. Bottom line; if you expect it to be great,  you won't like it. If you think it looks bad go see it, it might suprise you."
    },
    {
      "rating": "4",
      "text": "Too unfunny, i was making a lot of effort to laugh, but i was unable to.....brand doing again a pathetic performance and im really sad about Mirren being on this movie...a great actress ,  just a bad role"
    },
    {
      "rating": "0",
      "text": "Watching the original a while ago I wondered why anyone would remake that movie.  Now I want to shout out a huge thank you to Russell Brand for the remake because I thought the only thing in the original worth watching was John Gielgud, but now I realize that it also has the benefit of not including Russell Brand.  I was just about to give this piece of garbage a 3 because of Helen Mirren, but seeing that some foop going by ferg0 gave it a 10 to raise the score, I have to drop my 3 to a 0 to correct her attempt to skew things."
    },
    {
      "rating": "0",
      "text": "Seeing the original, the memorable, hilarious, heartfelt original, There is only one emotion I can express when walking out of this film. Anger. Powerful anger."
    },
    {
      "rating": "9",
      "text": "What i think about this movie is just an opinion so don't start judging but, i think the people who watched it seem to lack the knowledge or understanding of the movies idea. Sure it wasn't the greatest movie ever created but it was very nice. This movie should have triggered something in people which, should have been, a better understanding of, money can't buy happiness, i think people just don't want to or can't understand that.The jokes were perfectly matched with the going moment and the scenes were placed correctly and i strongly disagree with all the negative feedback this movie got. And is it wrong for a young adult cry in some of the scenes? People just have lost touch with good movies. Sure it's fun to see mindless shooting action, yes, but you also need to understand other genres too."
    },
    {
      "rating": "2",
      "text": "Having to sit through this on a cruise night in the Caribbean; CNN, for once, was more interesting that night. It's dry, bland, predictable, and worst of all, unfunny. Typical remake, with a complete failure and lack of respect to the original, which is a comedy classic."
    },
    {
      "rating": "9",
      "text": "When looking at remakes of movies, why does everyone expect it to be just like the old one? That's the whole point, isn't it? To be a new look at something old. To update it so the more current generation ca understand it in a way they may not have been able to having just seen the original. This isn't an exception. While it was interesting to see Garner in a role we were meant to hate, the actors in this movie were fantastic. It had a simple humor to it, not shoved in your face and not so subtle that you don't catch it. Worth the watch if you're looking for a nice, funny movie."
    },
    {
      "rating": "8",
      "text": "There is no real reason for this movie to exist, but with Brand's winning star turn, it's likable and its heart is in the right place.\r Watch this movie online http://www.watchfree.to/watch-2084e1-Arthur-movie-online-free-putlocker.html"
    }
  ]
}