{"id": 4575, "title": "As Good as It Gets", "starring": ["Jack Nicholson", "Helen Hunt"], "runtime": 139, "genre": ["Drama", "Comedy", "Romance"], "description": "Melvin Udall, a cranky, bigoted, obsessive-compulsive writer of romantic fiction, is rude to everyone he meets, including his gay neighbor, Simon. After Simon is hospitalized, Melvin finds his life turned upside down when he has to look after Simon's dog. In addition, Carol, the only waitress at the local diner who will tolerate him, must leave work to care for her sick son, making it impossible for Melvin to eat breakfast.", "releaseYear": "1997", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/xXxuJPNUDZ0vjsAXca0O5p3leVB.jpg", "categories": {"plot": 8.647058823529411, "acting": 8.411764705882353, "ending": 8.333333333333334, "soundtrack": 8.5, "cinematography": 8.5, "familyFriendly": 6.0, "funny": 7.6923076923076925, "action": 9.0}, "reviews": [{"rating": "9", "text": "The first thing that comes into my mind about this movie is: \"what a performance by Jack Nicholson\". Just to watch him makes this movie a must see. Helen Hunt was also very good.The story is very good also, especially that it is a romance, which I dont like so much any more."}, {"rating": "10", "text": "A masterpiece. One of the best written films of the modern era. The dialogue is astounding--with impressive performances from Nicholson, Hunt and Kinnear."}, {"rating": "10", "text": "Ok, this movie is simply a masterpiece all the way around! The writing, the acting, the risk-taking. It does an incredible job of presenting the character complexity of three 'broken' people which start to be healed by each other through, well friendship / love. The thing that is so cool is there are no actual 'one-liners' per say. The comedy is about the irony of the characters and the situation of the scene itself. For instance, Melvin Udall has no clue how to deal with normal social situations, causing rage reactions from everything that comes out of his mouth, yet he's a successful 'romance novelist' that understands the heart and head of woman — subtle but super hilarious! A must see."}, {"rating": "8", "text": "As good as it gets is a pretty good and unique movie, that will leave movie fans happy at the end, especially because of its heart warming final scene."}, {"rating": "2", "text": "Horrible, whiny, implausible. Who is not annoying in this thing? We suffer, the DOG suffers. Yet another fantasy of a grumpy old guy being forgiven for his utterly misanthropic actions by a beautiful woman 20 or more years his junior. Maybe some interesting points to be made about the mentally ill, but it isn't comedy and it sure did not need to be this long!"}, {"rating": "6", "text": "this movie is a blend of random human emotions, and when you see the word \"Random\" in my statement that means it's never good.\ryes the performances was over the top, but i don't get these reactions, it seems unrealistic."}, {"rating": "10", "text": "Great film! Written very well and the acting was phenomenal from the leading cast. The characters feel real and I personally felt like I was part of the experience (which might just be me). A must watch for any serious movie fan."}, {"rating": "8", "text": "The first thing I asked myself after I saw this movie was - how good can Jack Nicholson, Helen Hunt, Greg Kinnear, and Cuba Gooding be? Can they be any better? Director James L Brook's speciality is exploring the human psyche, emotions and portrayals of these many emotions and parts. Nicholson's Melvin Udall is  an obsessive-compulsive disorder, frantic and unstable-yet-stable in his ways in life. I liked how Hunt gave life to her Carol Conelly's single mom-waitress act. I was a tad disappointed at the way how Carol's new boyfriend starts to make out - it just didn't fit with the Carol I saw, the Carol who's working many shifts to ensure that she has the money to afford her little boy's asthma treatment, as well as making sure she can also afford the day-to-day finance of her house, where her mom also lives in. I enjoyed Kinnear's 'Simon the **** portrayal, his subtle movements, his manner of speech and delivery, and his physical presence. Cuba Gooding has a very few scenes in the movie, but is no less memorable. I somehow felt that the second half was a little dull compared to the first, but maybe that's because the early fun of seeing Melvin Udall's 'disgrace of a human being' starts to mellow out, and the actual evolution of the movie's plot begins to grow. The screenplay was just strong enough for the material and characters at hand. Obviously, one cannot take one's eyes off Nicholson whenever he's on the screen, whether explaining in such clever sarcasm to Greg about why he works alone at night, or handling Greg's maid, or even when Carol confronts him with the 'you crazy ....' after he tells her quite insensitively that 'we all die, and from what I hear, your son will too'. It's hilarious and its hurtful, but that's the best part - Melvin Udall is a single man, and it's because of a reason - he's just impossible to get along with. It's not for a lack of trying, it's just that he has never met anyone who could show him the mirror and pick out the flaws in his face. Enter Carol, let the movie take its course, and you'll see just how one can change when one is receptive to one's environment. \"You make me wanna be a better man\" isn't just your standard movie cliched lines, it actually is resonant of Melvin's feelings towards Carol, and it is deeply moving how their relationship evolves and grows. Melvin's attachment to Simon's dog over time is moving and natural. Melvin feels something inside and he is grateful that he has a visitor in his house, and it is disturbingly pleasant. I've seen this movie time and again, because it is Nicholson and Hunt at their very best, and Brooks' direction at its most truthful and honest core."}, {"rating": "8", "text": "James L. Brooksâ"}, {"rating": "8", "text": "Gets pretty sentimental, but movies like this are necessary to remind you that everyone has a good and bad side. As Good as it Gets is a movie about people, and the cast is great about portraying them. One of the better \"feel good\" movies out there."}, {"rating": "1", "text": "Though it won some Oscars, I hate this movie. Jack Nicholson is painful to watch, and Helen Hunt is only okay. Watching it feels like a medication wearing off."}, {"rating": "8", "text": "Greg Kinnear and Helen Hunt are simply electric in this and their performances cannot be understated. In terms of rom-coms, its \"As Good as it Gets\""}, {"rating": "10", "text": "Un hermoso y maravilloso clásico de los años 90 en donde tenemos actuaciones de proporciones bestiales con Helen Hunt y Jack Nicholson a la cabeza, las cuales fueron aclamadas y premiadas en todas las premiaciones importantes a los mejores actores principales, la historia es muy amigable y está repleta de carisma y situaciones que pueden hacerte reír, asombrarte y conmoverte profundamente al mismo tiempo, definitivamente esta película tiene mucho corazón dentro de sí misma."}, {"rating": "8", "text": "Mindkét Oscar díjat megérdemelte a film. A filmet megnézve élvezetes és egyben jó kihívás lehetett Jack Nicholsonnak eljátszani ezt a szerepet. A film az alapművek közé tartozik. Nagyon szórakoztató romkomról van szó, drámai jelenetekkel."}, {"rating": "8", "text": "is actually as good as cinema can get..As Good As It Gets As Good As It Gets is a character driven drama about a frustrated man suffering from OCD whose consequences are paid by the people surrounding him. The characteristics of the characters are well crafted and detail that offers more personal experience to the viewers since it goes way too deep and bisects it wisely by comparing it with others; a masterstroke by the writers to meddle with the audience subconsciously. It's parallel tracks are given equal importance with fine polishing around the edges that is decorated by the three dimensional characters that resides in this typical New York neighborhood. The background score by Zimmer is impressive, the cinematography is decent if not extraordinary but has fine editing and camera work that is breezy and light and is uplifted by music that plays vital role in order to elevate the momentum. Nicholson is in his A game where he redefines his throne and proves why he still is the best of all and on the other end, Hunt is equally challenging and replies to his all serves with a winning shot where both of them are supported nicely by Kinnear and Gooding Jr. The narration is elaborative and not stretchy with adaptive tone that unfortunately wears off in its latter stages as it loses its grip on settling for a mellow course. Brooks's execution is what fuels this familiar drama and offers a fresher perspective to it that is brimmed with tiny cathartic notions that are just pills for adrenaline rush to the audience. Ticking for more than two hours and fixating on a singular topic, it is surprisingly intriguing enough to keep us invested in it. The dry humoristic tone of each character, the morale conflicts and their answer to it and Nicholson and Hunt's stellar performances are the high points of the feature. As Good As It Gets is actually as good as cinema can get on terms of the craft it carries out from mundane events."}, {"rating": "10", "text": "I personally think this film i s great, and shows how people can change with time! I thought Jack Nicholson's character was amazing and showed why he's such a good actor! This is wel acted and is funy when it needs to be! To me this fil is much better then About Schmidt! I think the score should be changed around! Watch this film you won't be disappointed!"}, {"rating": "10", "text": "This my favorite movie. Phenomenal actors portraying how hard it is, and how worth it is, to change."}, {"rating": "8", "text": "Very well scripted with some really great one-liners; mostly delivered by Jack Nicholson; although there is one point where Greg Kinnear does a rather good impression. Both Jack and Helen Hunt put in great performances that were worthy of praise. My main niggle is that it is way too long; it could have easily been shortened by at least 20 minutes and that would have maybe given it a little more punch. Not that I was bored you understand, far from it, I just felt it would have benefited from being a little shorter. Enough of that; it’s a very well made film with some excellent performances and a touching, well written, script. Well worth a look.\r SteelMonster’s verdict: RECOMMENDED\r My score: 7.7/10."}, {"rating": "9", "text": "As funny as it is timeless, As Good As It Gets is one of the greatest movies of the 1990s, and one in which costars Helen Hunt and Jack Nicholson should be proud to have been a part of with their extensive acting careers.  If you have never seen As Good As It Gets and have any appreciation for great movies that don't require big action sequences or extra gore, this is one to watch at least once (if not many times over)."}, {"rating": "8", "text": "Obsessive-compulsive romance novelist Melvin, largely keeps to himself aside from waitress Carol who he pesters every morning whilst eating breakfast at café. Through circumstances beyond his control he also becomes acquainted with his gay neighbour Simon, and the three end up seeing a lot more of each other than they planned. As Good as it Gets is an almost understated movie for the most part, but it’s sharp, humorous script and excellent performances from each of the three main leads ensures it is really good watch."}, {"rating": "8", "text": "A very touching tale about a misanthropic man who has his heart warmed by a plucky waitress and a little dog. Great performances from Jack Nicholson and Helen Hunt (you can tell why they both won an oscar for best actor) and also a fantastic supporting cast. However there are a couple of very dated aspects about this film that you wouldn't see in a remake; Jack Nicholson's homophobic jokes and the huge age difference between him and the female lead. It took me back to a happier time where people weren't always glued to their smartphones, if your doctor told you to lose weight you'd go on a diet (rather than sue him for \"fat-shaming\"), Islamic terrorism still wasn't a thing and there were only two genders."}, {"rating": "7", "text": "I haven't watched it for soooo long...so I guess it is about time to do it again. Enjoyable indeed! A movie that I don't crazily love, but I like a lot! Unforgettable indeed."}, {"rating": "9", "text": "Boasting legendary characters brought to life by actors firing on all cylinders and  an absolutely marvelous story with enough feels moments to stuff a mattress, \"As Good As It Gets\" is a romantic comedy with enough charm to breathe hope even into the lives of the hopeless."}, {"rating": "9", "text": "Nicholson in one of his best playings. Theme is underapproached on movies and in this film has been well aprroached."}, {"rating": "7", "text": "I watched this movie multiple times and I loved it. With it's quirky humor and funny storyline, this movie is one of Jack Nicholson's best (winning him an Oscar), the performance by Helen Hunt made me change my mind about her, from that stupid TV show to this, wow, this also won her an Oscar."}, {"rating": "9", "text": "Jack Nicholson in one of his best maniac roles. The story of how love changes an unfriendly and obsessive-compulsive man have it´s charm due the witty performances and the stimulating songs. Good choice for a weekend evening."}, {"rating": "1", "text": "C'est Papy Daniel qui est comme notre Tatie Danièle à nous mais en version amerloque : à noter pour vous éviter tout suspense inutile que les deux films sont irrécupérablement mauvais mais que \"Pour le pire et pour le meilleur\" n'est pas meilleur mais le pire des deux.Et pourtant, ça commence si bien avec l'inénarrable Jack qui campe à merveille ce vieux misanthrope désagréable, raciste, homophobe et paranoïaque compulsif obsessionnel (même son psy n'en veut pas)... Mais attention, \"Monsieur Udall\", si vous continuez comme ça, vous allez être poursuivi pour incitation à la haine ordinaire et refus du vivre_ensemble !Evidemment, son voisin est homo et le petit copain du voisin est un homme de couleur avec \"le nez aplati pour flairer la bonne tambouille des prisons\" (sic !) d'où quelques acrochages... entre voisins. Et j'oubliais, Monsieur Udall déteste les clébards ! Bref, au bout de 5 mn, on l'aime déjà cet homme-là !Hélas, mille fois hélas, notre vieil aigri va devenir doux comme un agneau et rentrer bien gentiment dans le rang... entouré par le politiquement correct, submergé par l'angélisme du vivre_ensemble, étouffé sous la guimauve qui tourne à plein régime pendant tout le film, il va devenir un bon toutou docile et serviable.Surtout avec la serveuse incarnée par la grue Helen Hunt qui a fort à faire avec son gamin myopathe du sida contaminé et épileptique à ses heures perdues : une vraie \"mère-courage\" célibataire qui fait fuir à toute blinde tout mâle normalement constitué des environs. Et au-delà.Le film met donc le turbo et en rajoute des couches et des couches dans ce qui constitue un concentré de stupidité et de naiserie... et des discours de donneur de leçons. On en peut plus franchement, même en accéléré... Quel gâchis, car Jack tenait quelque chose avec ce rôle ; ça nous fera donc 1. Juste pour Jack."}, {"rating": "9", "text": "In this film, we follow the adventures of the life of Melvin Udall, an established novelist who, despite his fame and public recognition, suffers from an obsessive disorder, combined with a profound misanthropy. That is, he is virtually a hermit, who lives confined at home and has fits of rage if forced to escape his routine or socialize with the people around him. The most regular victims of Udall's caustic and rude temper are his gay neighbor Simon, his dog Verdel, and Carol, the waitress who serves him coffee every day, always at the same table, and which he eats. using plastic cutlery that you bring with you. Everything changes with the robbery of Simon's house: confined to a bed, wounded and broke, Simon becomes partially dependent on Melvin, who will gradually learn to do acts of kindness and generosity towards the people he has hurt.The cast is led by Jack Nicholson and Helen Hunt, two proven actors, who here manage to give us two excellent performances. Personally, I thought Hunt was too young to be a love interest for Nicholson, but the fact is that they both seem to be totally at ease with the characters and also with each other. Greg Kinnerar gives us an equally mature and consistent work, in which he is assisted by Cuba Gooding Jr. And a final word for the excellent dog used in the film.Technically, it's a standard film, within most Hollywood works. It has good cinematography and editing, with good colors and a very safe pace. The scenarios used are very good, with a natural highlight for Melvin's apartment. The soundtrack fulfills its role well and there is a lot of situational comedy to make the most serious audience laugh."}, {"rating": "5", "text": "Some good acting here and some good writing there but not all that enjoyable."}, {"rating": "6", "text": "When I first saw this movie I thought it was going to be a funny movie. It's actually a serious drama movie. I still liked it but he's a prick in this movie."}, {"rating": "9", "text": "♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤:;:;:;:;:;:;:;:;:;:;:;:;:;:;::;◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇"}, {"rating": "9", "text": "♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》"}, {"rating": "9", "text": "*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:☆°•☆°•☆°•☆°•☆°•☆°•☆°•☆°•☆°•☆°•☆°•☆"}], "recommendations": ["silver_linings_playbook", "good_will_hunting", "rain_man", "scent_of_a_woman", "the_devil_wears_prada", "black_mass", "morning_glory", "the_king_of_staten_island", "eddie_the_eagle", "the_intern", "american_hustle", "the_fighter", "marriage_story", "joy", "hustlers", "fatherhood", "gifted", "blue_jasmine", "palmer", "the_judge", "the_terminal", "chef", "crazy_heart", "a_few_good_men", "jerry_maguire"]}