{
  "id": 1085,
  "title": "Astro Boy",
  "starring": [
    "Nicolas Cage",
    "Madeline Carroll"
  ],
  "runtime": 94,
  "genre": [
    "Animation",
    "Action",
    "Family",
    "Science Fiction"
  ],
  "description": "Set in the futuristic Metro City, Astro Boy (Atom) is a young robot with incredible powers created by a brilliant scientist in the image of the son he had lost. Unable to fulfill his creator's expectations, Astro embarks on a journey in search of acceptance, experiencing betrayal and a netherworld of robot gladiators, before returning to save Metro City and reconcile with the father who rejected him.",
  "releaseYear": "2009",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/fYOJaaCpqq1NatziVJntmsXXDi8.jpg",
  "categories": {
    "plot": 5.133333333333334,
    "acting": 4.875,
    "ending": 5.666666666666667,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 7.333333333333333,
    "funny": 7.666666666666667,
    "action": 8.0
  },
  "reviews": [
    {
      "rating": "10",
      "text": "Nothing short of excellent. I'm tired of critics with no clue dictating to audiences what kids will and won't get. This is a great movie which balances themes of father and son; laugh-out-loud humour and fantastic action. Plus- giant robots are always cool."
    },
    {
      "rating": "0",
      "text": "Animação muito mal feita"
    },
    {
      "rating": "10",
      "text": "Astro boy was a great family movie. It had a good moral story to it. It taught kids that they should give everyone a chance before they judge each other. It also showed that we are all different in certain ways and can still get along with everyone no matter how different we are."
    },
    {
      "rating": "0",
      "text": "Astro Boy is not just derivative, but its main problem is that is still has a typical Japanese outdated outlook on themes that Hollywood productions do better in exploring. Coupled with a Pinocchio character that later becomes a Rambo that shoots missiles from his behind and feet, it is more ridiculous than any Hollywood animated films. The movie is also boring, overplays it sentiments and a complete turn-off to kids. My three kids were bored and could not relate to the character at all."
    },
    {
      "rating": "5",
      "text": "Not bad could use some improvements but all in all not bad."
    },
    {
      "rating": "1",
      "text": "Do Not Go with kids. Spoiler warning. Son dies in violent way in beginning. Then dad says, I will create new son as robot. The father then tells the robot son, I don't want you. This movie also attempts to be like many other cartoon pictures with adult humor. The problem is, it is not funny, at all. Not to mention, the voice over acting is just bad. Nicholas Cage, is not, not, not a voice over actor. Lets just say, do not go. Don't waste your money renting or buying."
    },
    {
      "rating": "5",
      "text": "Kids loved the movie and the plot was cute but do not underestimate the political slant."
    },
    {
      "rating": "2",
      "text": "Every scene is stolen from a better (or worst movie for that matter). The writer and the director couldn"
    },
    {
      "rating": "6",
      "text": "It moves itself along at a brisk pace, and while lacking in the high quality storytelling department, this animated film has enough action-packed spunk to keep the younger audiences thrilled."
    },
    {
      "rating": "7",
      "text": "\"Who's driving?\" asks Toby(Freddie Highmore) to his mates in the flying vehicle's backseat, and before the reveal, the moviegoer thinks that Ham Egg(Nathan Lee) is behind the wheel, but it's the \"dog\", a robot named Trashcan, who leads the boy's rescue from General Stone's henchmen. The embittered scientist, to my delight, never overcomes his prejudicial feelings about robots, even though Astro Boy saved his life at the Robot Games. Sad though it may be, the moviegoer has to make allowances for the commercial obligations that a mainstream filmmaker abides by, so it should come as no surprise when Dr. Tenma(Nicholas Cage) brings his robot son back into the fold. The happy ending is a necessary evil, and as \"ad nauseum\", \"Astro Boy\" has one, but at least it's not an across-the-board happy ending. During the Robot Games, where Toby squares off with machines in a duel to the \"death\", Cora(Kristen Bell) can hardly meet his soulful eyes, whereas her mentor never sees the inherent cruelty in this barbaric exhibition. Toby, and all the human androids that came before him, who tried to pass themselves off as flesh and blood, are allegorical figures: light skinned blacks(like Lana Turner in Douglas Sirk's \"Imitation of Life\"), while the \"other\" robots(read: dark-skinned blacks), the revolutionaries(one quotes Malcolm X) who try to recruit Toby, don't stand a chance in the assimilation game. They look like robots. Ham Egg's unwavering bigotry keeps \"Astro Boy\" real, relative to a lot of other children's movies, which would stamp out all racism with expediency."
    },
    {
      "rating": "10",
      "text": "This movie was amazing! Great Voice acting by everyone, especially Kristen Bell, good amount of action, and a nice slightly dark story. I found it great, and I'm well in my 30's."
    },
    {
      "rating": "4",
      "text": "Mediocre children's movie, nothing more. Derivative story elements, horrible script with cutesy characters which for the most part serve no purpose. Even goes as far as to rip off the ending of The Incredibles."
    },
    {
      "rating": "7",
      "text": "Wonderful animation with a story both kids and adults could appreciate."
    },
    {
      "rating": "10",
      "text": "This movie deserved more attention and praise than it got. Thank god I ignored the critics and saw it. It was awesome. It had great fight scenes, great animation, lots of heart. One of my favorite animated films ever. The critics that dumped on this were dead wrong. Not to mention full of it lol!"
    },
    {
      "rating": "8",
      "text": "Great kids film! Highly recommended. Took my boys 5 and 6 years old and they were hooked. Perhaps a bit scary for the younger one. Personally, I really enjoyed the look and feel of the film as well the interesting and quite emotional storyline. Much better than the standard Ice Age/Madagascar type schtick."
    },
    {
      "rating": "7",
      "text": "Astro boy is an animated film about a boy who dies and metaphysically gets reincarnated as a boy robot. Sticking true to its roots (including the butt check cannons), Astro boys goes and battles countless robots all while I yawn. The story is fairly interesting and the political slant obvious but if you finished watching \"Where The Wild things are\" or simply like animated action, check out Astro Boy."
    },
    {
      "rating": "10",
      "text": "I was a fan as a kid, and had completely forgotten about Astro boy until my two sons came home from school, babbling on an on. Went after school last night, and loved it. It's deeper than most kids fare, and my youngest (5) shed a tear when Astro was rejected by his dad (but later happy ending). Great fun, for me and children. Dad will take them again this weekend."
    },
    {
      "rating": "6",
      "text": "Good action, animation, and fun. This film was a pleasure to watch and it did have some impressive action sequences. It requires the audience to open up their hearts and minds and lose their sense of reality to fully enjoy this picture. When you give all that up, and have fun in your altered mind-set as a 6 year old boy, this film is most exciting. If you can't muster up enough energy for that alteration, this film will appear to you as just....\"cute\"."
    },
    {
      "rating": "10",
      "text": "better ignore these annonying critics,and just enjoy a great animation that both kids and adults would really love. I really loved the story,especially the emotional aspect. Superb action,and a great voice acting,astro boy is definitely up there with the great's,don't care what the critics say"
    },
    {
      "rating": "6",
      "text": "Has serious story issues but has good humour and pretty good visuals. Entertaining."
    },
    {
      "rating": "6",
      "text": "Note: I know nothing about Astro Boy apart from this movie. I hereby accuse this movie of various villainies and crimes. Astro Boy rips off various other films, is filled with cliches, there's an abundance of plot holes, and enough cop-outs to go around. This movie is a blundered mess. My main problem; it's an enjoyable blundered mess. Astro Boy is about a child named Toby Tenma (Freddie Highmore). He's a robot genius, like his father, Dr. Tenma (Nicolas Cage). During an unfortunate robot malfunction, Toby perishes in an explosion. Dr. Tenma is greatly saddened by this loss, so he uses his son's DNA to create an exact robot replica, and when the boy awakes, Dr. Tenma never tells Toby about his transformation. However, some critical changes have occured. In fact, this \"Astro Boy,\" turns out to be even smarter than before (an impressive feat). But he doesn't just improve academically. Astro Boy slowly discovers his various new abilities. He can withstand serious damage and high falls, and has the ability to fly. But Astro Boy just isn't the same as Toby, and Dr. Tenma just can't find it in his heart to love the robot. I thoroughly enjoyed the first half hour of this film. The animation, though simple, is gorgeous and slick. The story line was going pretty well, too. There was a pretty generous amount of humor, even. I felt like I might actually enjoy myself, contradicting my thoughts about the flick before viewing. Unfortunately, the film went downhill from there. It wasn't a significant drop at first. The next half hour held up pretty well, but it was bombarded with cliches and unsucessful attempts at plot twists. This second half hour was arguably funnier than the first, but there were also way more jokes that ended up being stale, and recycled. I also started noticing various rip-offs of other flicks here. I had already spotted a couple in the first half hour, but there were significantly more here. Finally, we come to the grand finale, where we get countless cop outs, rip-offs, cheesy lines, dumb jokes, cliches, and guess-before-it-happens moments. This also includes a completely random and undeveloped change in Dr. Tenma's character, and a boring and utterly stupid climatic duel between Astro Boy and the Peace Keeper, an evil robot charged with negative energy (both literally and metaphorically). Worse, there were tons of scenes in this last half-hour that had the potential to turn the film around, and make into the grand piece of cinematic entertainment I wanted it to be, but never had the guts to try. Plus, throughout the film, there are gaps in the story, dozens of characters with no personality that make stale jokes, and the movie just moves too fast. Even the score is relatively bland. The film really isn't as bad as I'm making it sound. It's got a lot to love, and there's definitely a few things that make the film worth watching. I'm just disappointed with the final product. It could've been much better. It should've been much better. Astro Boy could've been a masterpiece, but in the end, it just settles for being mediocre."
    },
    {
      "rating": "3",
      "text": "Here's the deal, if you are a die-hard fan of the original work by Osamu Tezuka, I would strongly advise you NOT to watch this movie. Although I can understand the appeal to young children and adults who have never seen the original works, this is simply using the original characters, loosely basing it upon the original story, completely changing the behavior and characteristics of Astroboy and turning it into a new movie. If you are simply looking for a movie to share with your children, then go fro it. If you are a fan of Osamu Tezuka, and you want to watch this movie because of that, then don't watch it."
    },
    {
      "rating": "5",
      "text": "Astro Boy never takes off.\rThe movie is an interesting premise that is entertaining, but never really becomes great. It seems caught in a shell and just doesn't amount to anything, the first 15 minutes are equally eventful as the rest, and the movie becomes anti climatic. The morals in it are good, and the concept is somewhat thought provoking, but the finished product seems too forgettable."
    }
  ],
  "recommendations": [
    "we_can_be_heroes",
    "turbo",
    "incredibles_2",
    "despicable_me_3",
    "the_angry_birds_movie",
    "the_angry_birds_movie_2",
    "real_steel",
    "cloudy_with_a_chance_of_meatballs_2",
    "the_boss_baby_christmas_bonus",
    "the_secret_life_of_pets",
    "cloudy_with_a_chance_of_meatballs",
    "my_little_pony_equestria_girls_forgotten_friendship",
    "penguins_of_madagascar",
    "ice_age_continental_drift",
    "the_good_dinosaur",
    "the_tale_of_despereaux",
    "love_and_monsters",
    "bumblebee",
    "the_spiderwick_chronicles",
    "ice_age_the_meltdown",
    "monster_house",
    "the_croods",
    "hotel_transylvania_2",
    "the_smurfs",
    "hotel_transylvania"
  ]
}