{
  "id": 2370,
  "title": "Atlantis: The Lost Empire",
  "starring": [
    "Michael J. Fox",
    "Cree Summer"
  ],
  "runtime": 95,
  "genre": [
    "Animation",
    "Family",
    "Adventure",
    "Science Fiction"
  ],
  "description": "The world's most highly qualified crew of archaeologists and explorers is led by historian Milo Thatch as they board the incredible 1,000-foot submarine Ulysses and head deep into the mysteries of the sea. The underwater expedition takes an unexpected turn when the team's mission must switch from exploring Atlantis to protecting it.",
  "releaseYear": "2001",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/8fUEFPUTF7kBMuKPiSQHxPvd8EZ.jpg",
  "categories": {
    "plot": 7.7555555555555555,
    "acting": 8.09375,
    "ending": 7.666666666666667,
    "soundtrack": 8.6,
    "cinematography": 9.0,
    "familyFriendly": 7.0,
    "funny": 8.625,
    "action": 8.75
  },
  "reviews": [
    {
      "rating": "8",
      "text": "I'm very surprised that this movie was hated critically and publicly. I saw this when I was about 10, and I thought it was incredible. I mean, it's not the best Disney film but it's not bad at all. The animation, you gotta admit is very cool. I guess little kids found this movie boring and dark, I was getting older and started to watch serious stuff. This movie did kinda felt a little bit like a grown up movie like \"Fantasia\", but I loved it. This was probably what Disney wanted to try something new, and sadly it didn't work. But it did work for me, and I enjoyed watching it every time. But come on, when you put this next to something like \"Home on the Range\", you would wanna watch \"Atlantis: The Lost Empire\" instead."
    },
    {
      "rating": "7",
      "text": "\"Atlantis: The Lost Empire\" is a great summer blockbuster animation that will keep you entertained for the rest of your time watching it."
    },
    {
      "rating": "10",
      "text": "Excellent effects, voice acting, music, humor, and plot make this in my opinion the best movie to come from Disney yet."
    },
    {
      "rating": "8",
      "text": "I just don't understand all the bad reviews for this film. Atlantis- The Lost Empire is another wonderful Disney film. Atlantis- The Lost Empire doesn't really break a whole lot of new ground, but it's an exceptionally entertaining animated film. The film is about Milo Thatch, a young professor that no one takes seriously who is in search of Atlantis. Once again, Milo's funding proposition is turned down. But all that changes when he's given a package from his long deceased grandfather, and given proper funding by a associate of his. Now Milo goes in search of Atlantis with a crew of colorful characters. The characters are hilarious, to be vague. Dirt experts, explosive enthusiasts, and grease-loving chefs make up a small part of a large and amusing cast. And the voice cast only adds depth to these characters. There are also plenty of genius one liners. The animation boasts impressive visual effects, but there are a lot of flat backgrounds. The score is generally impressive as well. The climatic battle isn't incredible, and it won't raise your pulse, but it's certainly entertaining, and I've seen a lot of action movies with considerably worse final battles than this. Atlantis- The Lost Empire provides a funny and adventurous film that will surely entertain kids and parents alike."
    },
    {
      "rating": "10",
      "text": "A horribly underrated film that challenges gender roles, the overdone fantasy genre of nearly every Disney animation, and the notion that children can only enjoy cutesy, shallow stories. The characters are quirky without being obnoxious, and although the side characters don't get too much development, I don't feel they need it. You get the gist of their personalities right off the bat, and they never gave off the impression of being flat, or static. The animation is gorgeous and expressive, with exciting action scenes, beautiful, detailed backgrounds, and fun, unique character design.\r The entire movie came off as progressive, and open-minded, something I value in a Disney movie, and something that the newer films very clearly lack. Why continue adding to the pool of cute, feminine, thin, white girls and handsome, strong, white, and manly young men when you can have strong, curvy girls of color, and dorky, lanky, awkward (although no less brave and passionate) men?"
    },
    {
      "rating": "10",
      "text": "This is one of the most underrated animated movies , them critics are retarded af saying that this movie was **** when it was a masterpiece . it had a good 2D CGI animation , likable characters , humor its a very dark yet lighthearted sci-fi archaeology adventure type of movie . Def recommended for u to watch"
    },
    {
      "rating": "9",
      "text": "the critics are just being ignorant. this movie was brilliant. though, it has no talking animals, it has adventure, suspense, and romance as well as other disney movies. so, to those who like this are really guided to their opinion."
    },
    {
      "rating": "9",
      "text": "a thoroughly enjoyable, engrossing , funny disney film, can't really understand most of the critics hate for it but it was cool. The comic book artstyle was beautiful, voice acting was brilliant and a round all entertaining movie."
    },
    {
      "rating": "9",
      "text": "This movie is one of the most underrated movie I've ever seen. It is funny and exiting. I don't know how people can't like it. It haves a  great plot, fantastic characters and some funny, great moments. Just, buy it and you will enjoy it, because Atlantis is one of the best Disney animated film, since Lion King."
    },
    {
      "rating": "8",
      "text": "One of my favorite Disney movies. It has everything I look for in a Disney movie. Adventure, romance, action, comedy, and above all else, excellent hand drawn visuals. One drawback is perhaps that most of the side character really don't get enough development as they are clearly well thought out and well voiced. Overall: One of Disneys classics in my opinion."
    },
    {
      "rating": "10",
      "text": "This is one of the most underrated Disney movies... even by Disney... Take a look around the park and tell me how many Atlantis items you see the next time you go.   I will save you the trip little if any.   I had always enjoyed this movie and it is a shame how poorly it was treated by Disney."
    },
    {
      "rating": "8",
      "text": "I think critics were way too harsh on this film. As a matter of fact, they weren't just harsh, but simply blatant as they bias the film based on how violent it was compared to usual Disney fare, thinking that Disney is just for kids and should always stay that way."
    },
    {
      "rating": "10",
      "text": "THIS MOVIE WAS JUST GREAT TO ME! I don't know why but this movie seems to get attention alot especially with the giant rusty barless A that shows up on posters and some previews where it gets struck by lightning in the middle of the ocean during raging weather, and when it's on a rusty gate with writings on the wall, and water ripple lightings.\rThe idea of the seastorms are really cool especially on the poster,viking prologue, and the beginning of the movie.The lightning mechanics were well done in the movie.\rThe character development for Milo Thatch was GENIUS. Michael J. Fox did outstanding with his voice. It suited his personality traits so well.I can never get enough of him.\rMilo and Kida are my favorite Disney couples PERIOD.\rBlue is my favorite color and this happens to have alot of blue on it.\rThe fact that this movie was the very first Disney animated sci-fi movie to come out on June 15th a very interesting day to release a movie, made me wanna try and see it..And yet i'm really happy I did.\rAtlantis may not be may favorite Disney score but James Newton Howard made the music fit so well with the movie itself. Turning it normal life/epic Treasure Planet like music into Deuter like soundscapes music.I love Disney movies without songs.\rIt's really interesting how they relate other B.C cultures and history to Atlantis and also when they used Plato's quote. I like it's action violence and also it's references like 2012, Day After Tommorow, Avatar, Battleship, and Tron. 2012 and Day After Tommorow because the natural disasters in the beginning.\rAvatar because of it's plot, Battleship because of the sci-fi technology and the leviathan scene, and Tron because of it's crystalized circuits on the statues and artistic cracks especially the stone effigies chanting around the Heart of Atlantis. Atlantis was a great Disney movie and it really deserves alot of recognition, love, and gratitude. All thanks to the stupid box-office intake, Atlantis remains a *LOST*, underrated Disney movie along with the other Disney flops.  But I'm really happy that this movie was even created and I'm happy that I, my friends on deviantART, some of my subscriptions on YouTube, and other random fans can see the good in it to this very day on 2014. Don Hahn, Gary Trousdale, Kirk Wise, and James Newton Howard, you have made this awesome animated sci-fi movie possible for the first time.( IT REALLY SUCKS THAT I DIDN'T GET A CHANGE TO WALK THE BLUE CARPET.)I give this 10 out of 10. Even if the world was disappointed with this film including the box-office, technicality you guys have donea bang-up job and I'am very very proud that this film was even made. Long Live Λ T L Λ N T I S.;-D"
    },
    {
      "rating": "8",
      "text": "For me, this was one of those films that I really enjoyed and that stuck with me through my childhood. The beginning was boring but once the more started there was nothing like it. Technically it's a children's film but they don't hold back on the serious of the situations nor the development of the characters. PERSONAL CHILDHOOD FAVORITE."
    },
    {
      "rating": "8",
      "text": "No one said it was a perfect movie, but everyone said it was garbage. Ladies and gentlemen, I will never be a professional critic, but if something is clear to me, it is that this is the film that shows that the specialized criticism is wrong.Atlantis: The Lost Empire is a film that I met many years ago through my parents. Many years later, I have finally seen it again.And I can never be so much in disagreement with the criticism with this movie.This was the first film that made me pose, even as a child, that the world is not what it seems, that not everything is roses, colors and rainbows, but that there is evil, greed and lies in a rotten world; that the world is a scale of grays, and not only black and white.He also taught me that cultures and traditions should never be lost, something that money and similar things make little by little come closer to absolute oblivion.And most importantly: he taught me that love and friendship are all that is necessary.Definitely, the most undervalued Disney movie of all time.And I repeat: No one said it was a perfect movie, but everyone said it's garbage."
    },
    {
      "rating": "9",
      "text": "I never paid much attention to this movie to begin with, it seemed like yet another Disney flick that didn't quite make it. But I decided to watch it after reading a bit more on it and finding out that it didn't have singing, which I grew out of long ago. I loved this film! I think that one of the reasons the film didn't to too well was that it may have been a bit on the mature side and not appeal to young children, but the people who would've enjoyed it the most were out of the target demographic and didn't bother because they assumed it was a typical Disney children's film like I did. The film is short, only one and a half hours but it manages to pack in a solid adventure, great visuals and a wonderful musical score."
    },
    {
      "rating": "9",
      "text": "I cannot believe that respected reviewers graded such a movie so poorly. It leads me to believe that they simply stamped it with a \"mediocre\" label and didn't seriously watch it because it wasn't like Disney's other cartoons by comparison. The fantasy elements I thought were exceptional, and the story, admittedly is abrupt, has at least more creativity and originality in it than carbon copying and sugar coating old \"brothers grimm\" tales. It is grossly under-appreciated simply because of its more serious nature. In a time where Disney is making movies with serious elements like Pirates of the Caribbean, you'd think Atlantis would at least do more than collect dust by now. It is funny how a decade ago Disney's seriously oriented movies were never famous, and now their most famous franchises aren't even cartoons anymore."
    },
    {
      "rating": "6",
      "text": "One of Disney's more understated films of late. It's an epic retelling of 20,000 Leagues Under the Sea which contains high energy and huge creativity."
    },
    {
      "rating": "5",
      "text": "Não  grande coisa"
    },
    {
      "rating": "6",
      "text": "I think when it comes to these big studio animated movies, even these \"bad\" or these more hated and mediocre ones are still fine movies as they are. It was the case with Sinbad, Road to El Dorado which I specifically wanted to see because of the metascores, and it is definitely the case with Atlantis too. I thought this was a perfectly enjoyable adventure film that doesn't exactly stand out with its story or characters, but absolutely does with its animation which was at times breathtaking. Especially early on in the movie there was an underwater shot that combined 2D and 3D animation and it was absolutely enchanting to watch. Although there are a few nitpicks, like the character Audrey's lips that at points looked retarded, and also Milo's cat early in the film. That wasn't a cat.I did enjoy watching many of the characters, but there are way too many of them. There's like one scene of them actually having a conversation and telling some of their backstories, but a lot of it is just each of them telling their story on their turn which wasn't that convincing. And some of them didn't even do that. The main character, Milo, asks about this one character at one point whose name I can't even remember and another character just says \"You don't wanna know.\" Why the f*ck is he in this movie then? He didn't do s*it for the whole film and never even got a backstory.The story was decently enjoyable to follow. Although a lot of it is just Milo reading and figuring out something or talking with the character Kida, and it felt like the viewer was never really cued in to the thing. I somewhat knew what they were doing but there wasn't enough of visual storytelling so I was mostly just following exposition and the characters being excited about... something. There were points during the second act that were honestly pretty boring because of it.The movie gets a lot more interesting during the last 20-25 minutes when we get a couple character twists and the villain becomes clear to the characters. I very much enjoyed the last action scene both as a character moment for Milo and the villain and also as a visual spectacle. The score was also pretty good.In the end Atlantis is a fine movie that's not groundbreaking in any way despite the gorgeous visuals, and I can recommend watching it at least once if you haven't. You most likely have though. Also, the music during the end credits sounded like porn."
    },
    {
      "rating": "9",
      "text": "Overlooked by the simple fact that this is not a kids movie, it's a teens/YA movie. Most of it is not wacky comedy or zingers, but a serious movie that wants to be taken seriously with some comedy breaks. And the animation...! For me, is the best in WDAS. This movie's looks are like: Disney got jealous from Anastasia, decided to mix it with a comic book and gave it a good script."
    },
    {
      "rating": "8",
      "text": "Atlantis The Lost Empire is a great animated film much better than the second one the only bad thing about it is that it does drag on a bit at the end."
    },
    {
      "rating": "10",
      "text": "It's wonderful. I can' t understand how it cans be a forgotten film, the story is a 10, the characters a 10 too, but the worst is that there is a princess and almost Disney film' with princess are success, it's truth that the aftermath is Cancer,but i recommend to see it."
    },
    {
      "rating": "10",
      "text": "'Atlantis' peaks the list of most underrated animated films of all time. Exciting, adventurous and intriguingly mysterious, it features non-stop entertainment, and some energetic and creative characters."
    },
    {
      "rating": "10",
      "text": "A good all around action-adventure flick with a little romance on the side. I salute Disney's attempt at trying something different, in spite of the critics longing for another musical at the time. Highly recommend."
    },
    {
      "rating": "10",
      "text": "Atlantis the Lost Empire is one of the most underrated animated Disney movies of all time.  The only real problem was that it was confusing from time to time.  Other than that, it's a great movie."
    },
    {
      "rating": "8",
      "text": "Atlantis has some comic scenes that made me laugh. Other scenes made me sad. And others made me glad. It is a movie any age can enjoy. It was an excellent rendition of an ancient myth. The animation was somewhat odd, but nothing new from Disney. It was definitely better than expected for a Disney movie with no singing."
    },
    {
      "rating": "4",
      "text": "Sadly this movie goes by way too fast for you to know what is going on which causes the whole movie to collapse. It does have some great animated moments though. Hey it was a good try for Disney. I give this movie 42%."
    },
    {
      "rating": "0",
      "text": "Okay, I rarely EVER give a movie a zero. I only do so when I can't enjoy ANYTHING about the movie. This is one of those cases. The story is rushed, and so fast paced it's hard to keep track of all the characters and what the hell is even going on. Secondly, the target audience is unclear. Sometimes, the humour is overly juvenile, and sometimes, it seems Disney are tying to make a serious or emotional scene for the adults to enjoy (although I seriously doubt they would enjoy it).\r In short, this is one of the (if not the absolute) worst animated movies I have ever seen, and definitely one of Disney's worst. The plot is dull, and there are too many unnecessary and unlikable characters. Honestly, had Lilo and Stitch not come out after this, I would have lost hope in Disney."
    },
    {
      "rating": "10",
      "text": "Veinte años y Atlantis se sigue viendo de maravilla como en su primer momento, efectos especiales que se mantienen muy bien y una animación que casi no ha envejecido, en definitiva es uno de los mejores clásicos de Disney a su vez que también es uno de los mas infravalorados de todos los tiempos."
    },
    {
      "rating": "6",
      "text": "While Atlantis: The Lost Empire is overall an entertaining, nostalgia filled film that does have a few high moments, the story itself is ultimately a bit bland and isn't on the same level as many of Disney's other animated films."
    },
    {
      "rating": "9",
      "text": "This movie was pretty well done. I think they could have added a little more, but other movies (pokemon comes to mind) are really lacking. This movie is good compared to some other stuff I've recently seen."
    },
    {
      "rating": "10",
      "text": "The movie is more teen related, yet I thought it was one of the best movies I"
    },
    {
      "rating": "9",
      "text": "Disney has indeed released a flock of good movies recently. Dinosaur, The Emperor?s New Groove and now Atlantis: The Lost Empire have all been fantastic...I was indeed blown away by this film. The visuals are some of the best in any cartoon; the zoom-back scenes are particularly eye-catching. The script and story are surprisingly intelligent and well explained. The script especially brings out the adventure in the film with humour, suspense and intrigue. I enjoyed the film?s many ideas and thought the direction and animation were both very focused. One scene I particularly liked in this movie was the one where all the characters are about to bunk and they look back on one another?s history. It develops these characters and brings them to life. However, I would?ve liked to have heard the story of the hilarious Mole, but it never came up. I think children will not enjoy this movie as much as adults will. They may not be able to understand the ending very well but adults will no doubt love this movie. It is a lot more complex than some of the recent animated movies and a lot more likeable, but it still doesn?t surpass the 2nd best movie of the year so far, Shrek. But I?ll tell you this, it definitely isn?t far behind. All in all, this animated adventure was stunning and well made with a mysterious story and a wonderfully passionate, romantic, humorous and action-packed story. Highly recommended!"
    },
    {
      "rating": "7",
      "text": "Рисовка нормальная. Местами выглядит очень даже красиво. Сюжет интересный, есть атмосфера приключения. Экшен довольно бодрый. Юмор детский, я особо не смеялся. Неплохой приключенческий мультфильм, можно посмотреть вечерком."
    },
    {
      "rating": "8",
      "text": "Although I have said that Tarzan is the last great Disney movie, there have been some surprisingly good films like Lilo and Stitch and Fantasia 2000, though the best of the post-Tarzan Disney movies is Emperor's New Groove. On the other hand, some of the direct to video sequels are saved by some excellent voice overs and moments of cuteness, but overall they are cheap parodies of their originals, Patch's London Adventure sadly being the worst. Atlantis: The Lost Empire belongs to the surprisingly good side of the film spectrum, with excellent visuals, particularly of Atlantis itself. The music was beautiful and sounded epic, and the voice cast was great, the standouts being Michael J.Fox and James Garner as Milo and Rourke respectively. John Mahoney and Cree Summer offer fine support as Whitmore and Kida, who is so sexy. I only have two criticisms of this movie. One is that while the idea of the story is fantastic, it is a little too fast for my liking. My second criticism is that while the script is very good on the most part, I don't think it is as funny as a film like Emperor's New Groove, though Vinny was hilarious, so I just worry that younger viewers mightn't find it as engaging as their parents. Overall, very pleasing to the eye, and a very good film overall. 8/10 Bethany Cox"
    },
    {
      "rating": "7",
      "text": "This is a decent Disney film, that being said is better than most animated films today. Overall, a good time to relax type of film."
    },
    {
      "rating": "7",
      "text": "I don't get all the hate on this. (Ok, sure... there's like 9 from the users plus 4 more from the critics, but the hard reviews from the users though). If you want to know such a bad movie, I'll take you there by going to my profile. For now, there's no valid reason unless your opinion is.. well... an opinion. The animation is well done though you got to admit it. If you want to go rot an opinion on, I suggest go for my 0's."
    },
    {
      "rating": "7",
      "text": "So a Disney animated action flick? And one that bombed? Lets see... Really? It's not bad at all. It has the traditional Disney tropes you would expect: Goood animation, good music, Hero, princess, etc. but it takes an interesting myth like Atlantis and makes a good adventure flick out of it. Is it great or something remarkable? Not really; but is it as bad as it bombed? Not at all. If you like adventure films, and you've seen Indiana Jones 100 times, this one works nicely."
    },
    {
      "rating": "7",
      "text": "DecentThough it’s writing isn’t very solid and is at times convoluted, Atlantis is still enjoyable nearly 70% of the time."
    },
    {
      "rating": "10",
      "text": "Atlantis is a great action adventure film think 20,000 Leagues meets Journey to the Center of the Earth and the goal is to find the lost city of Atlantis. With that combination you an incredible film with the look of a 1940’s pulp comic book. It gives the film a very unique look with some characters like Milo having a more pointed structure while others have a more circular look to them. While I am on the characters one of the best scenes is when they become more open to Milo and you learn why each of them is on this journey and what they plan to do if they do find Atlantis. The comedy while not in there a lot is still good and some of the best comes from the characters of Vinny (Don Novello), Helga (Claudia Christian), and Mole (Corey Burton).The city of Atlantis itself is a thing of beauty and it is only intensified with the amazing score of James Newton Howard.Plus “Kida” Kidagakash Nedakh is not just the best underrated Disney Princess of all time but she is smart, funny, curious, quick on her feet, cares about her people and saves her entire civilization by becoming the HEART OF Atlantis!! On top of that she is the first Princess to become a queen at the end of her film and her and Milo are not a couple just friends they don’t even kiss in the film!!I believe it is time for a rewatch of the film if you haven’t seen it in a long time or if it would be your first viewing it is well worth to see how great this forgotten gem by Walt Disney Animation Studios is!!!"
    },
    {
      "rating": "8",
      "text": "Atlantis es una película animada que visualmente es espectacular, y lo tiene todo en cuanto a géneros. Romance, sensación de aventura, misterio, acción, etc... con personajes que si bien son carismáticos les falta desarrollo y elementos de la historia que si bien son muy interesantes, no quedan del todo bien explicados. Fue muy infravalorada y muchas de las razones fueron algo injustificadas e incluso compartió el mismo destino que otra joya de Disney: El Planeta Del Tesoro, aunque a diferencia de esta ultima, Atlantis si tuvo una secuela. Muy recomendada de ver a pesar de sus fallos. Una de mis favoritas de Disney."
    },
    {
      "rating": "7",
      "text": "A good, fun Disney movie overall. I liked the sci-fi concept, something not too common to find in a Disney flick, the story was simple and easy to follow and the action scenes were good.The Good:-The animation looks great. The mix of traditional 2D and CGI is an impressive concept that it's a shame that is unlikely that Disney might not be trying that again anytime soon.-The art direction, character and background design is pretty good.The Bad:-The big twist this movie has is very predictable as it's foreshadowed in a not subtle manner early in the movie.-Atlantis, the place the title is named after, is really underwhelming, there's not enough Atlantis in a movie called Atlantis."
    },
    {
      "rating": "10",
      "text": "Best Disney movies Disney resistance in my opinion love the characters  and performances by them characters  hero villain and everything else action sequences and Michael j fox awesome performance in this film I like Audrey  best Disney characters love the film very much in my heart"
    },
    {
      "rating": "8",
      "text": "I can't **** believe IMDB, RT and the critic score on here. This movie is good. Beauty and the Beast and Pocahontas suck ass. This movie is based as ****"
    },
    {
      "rating": "9",
      "text": "Atlantis: The Lost Empire can best be summed up as Stargate lite. A perfect action adventure film just mature enough to draw in adults, but still childish enough for young kids to sit through. The characters are easy enough to follow without being overly complicated for developing minds and the wide range of backgrounds they come from really helps you latch on. Story is a strong point with great setup and payoff. It only stumbles towards the end, mostly involving inconsistencies or plot holes around the giant crystal, most of which can be overlooked. I especially enjoy the tie-ins to real life history myself. The animation with blends of 3D models at certain points looks great. The colorful, yet muted color palette also brings a more gritty look to the classic Disney art style while still maintaining visual flare. The soundtrack is both appropriate and even has distinct tracks I couldn’t help but remember as being tied to this film. At 96 minutes, the film never drags nor moves too fast, using every minute wisely for something. This is a good stepping stone for younger kids to take in more intense movies, and adults will certainly find entertainment value in it as well."
    },
    {
      "rating": "9",
      "text": "Often overlooked in the long history of Disney’s animations, “Atlantis” presents a meticulously-crafted interpretation of its namesake. Overall, its depiction of the fall of the ancient city and its subsequent rediscovery is engaging and well executed; unfolding at a swift pace that sets the plot in motion while avoiding excess drag and needless filler. Many of the characters are colorful in their presentation and breathe life into the story through a combination of intelligent dialogue and fine tuned visual aesthetics. Moreover, the rich, hand-drawn art manages to capture their vibrant personalities alongside the wonder and mystique of the world settings around them: from the bustling streets of the early 1900’s to the foreign atmosphere of the lost empire itself.Though the film takes on a more serious undertone by presenting death and humanity’s darker tendencies in a number of its action segments, it also respects and utilizes the traits of honor, sacrifice, and a genuine element of innocence to stave off an entirely nihilistic outlook. That is to say that while “Atlantis” is a poignant departure from the more kid-friendly and blindly optimistic films that dominate the genre, it contains enough wit-driven humor and slapstick antics to still appeal to younger audiences.In summary, if you are looking to embark on an adventure that may have slipped under the radar, or are interested in taking a closer look at a renaissance animation, you may just discover a diamond in the rough."
    }
  ],
  "recommendations": [
    "meet_the_robinsons",
    "my_little_pony_the_movie",
    "zootopia",
    "rango",
    "rio",
    "home_on_the_range",
    "treasure_planet",
    "klaus",
    "smurfs_the_lost_village",
    "how_to_train_your_dragon_2",
    "kung_fu_panda_3",
    "rio_2",
    "big_hero_6",
    "how_to_train_your_dragon",
    "shaun_the_sheep_movie",
    "the_croods",
    "the_incredibles",
    "ratatouille",
    "onward",
    "tangled",
    "spider_man_into_the_spider_verse",
    "the_adventures_of_tintin",
    "the_peanuts_movie",
    "the_book_of_life",
    "moana"
  ]
}