{
  "id": 2281,
  "title": "Atomic Blonde",
  "starring": [
    "Charlize Theron",
    "James McAvoy"
  ],
  "runtime": 115,
  "genre": [
    "Action",
    "Thriller"
  ],
  "description": "An undercover MI6 agent is sent to Berlin during the Cold War to investigate the murder of a fellow agent and recover a missing list of double agents.",
  "releaseYear": "2017",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/kV9R5h0Yct1kR8Hf8sJ1nX0Vz4x.jpg",
  "categories": {
    "plot": 4.6716417910447765,
    "acting": 4.108108108108108,
    "ending": 4.5,
    "soundtrack": 5.590909090909091,
    "cinematography": 5.833333333333333,
    "familyFriendly": 3.0,
    "funny": 7.0,
    "action": 5.585106382978723
  },
  "reviews": [
    {
      "rating": "4",
      "text": "Two hours of Charlize Theron smoking cigarettes to a banging soundtrack of 80s pop hits.  This movie is the epitome of \"style over substance\".  There's a couple decent action scenes and some interesting John Wick-esque lighting (dimly lit neon hues).  There's an interesting vibe there, but it's mostly from the soundtrack.  It uses music as a crutch.  Without the pop songs, this movie would be insufferably dull."
    },
    {
      "rating": "4",
      "text": "Atomic Blonde is stylish and very well-shot, but gets increasingly dumb as it keeps on going. Same is true of many action films, of course: the problem here is that it's more of a spy drama, and latter half simply doesn't have enough action to distract you from how transparent and perfunctory the plot beats become.As it is, the film has several cool action scenes at first, but literally peaks midway through, at a 10-minute long fight scene inside an empty apartment block, which is torturous in a good way: neither Theron's character nor her assailants have the weapons to end it quickly, and so they end up wearing each other down with bloody,yet inconclusive wounds. At certain points, they are both forced to stop and catch their breath for a while, before slowly continuing to fight. It's a little reminiscent of the final showdown in The Revenant, now that I think about it.Afterwards, though, there's literally nothing special. Most characters either predictably die or end up irrelevant, someone suspected of being a traitor an hour ago lives up to it, and the final twist exposes a myriad of plotholes, and makes the behaviour of several characters largely inexplicable. There's not much thematic weight either: lesbian romantic line is just there, and while you are regularly reminded of Berlin Wall's impending fall through the incessant TV broadcasts, the main plotline and characters are completely independent of it, with not much actual reflection, or accompanying existential dread on GDR side."
    },
    {
      "rating": "4",
      "text": "Atomic Blonde? More like Atomic Bland!!!! hahahaha. Anyways, Atomic Blonde is a slow-moving, borderline boring movie with okay action for the most part (besides the staircase fight) and dull plot.Characters: The characters aren't too bad: their motives are sort of there, but I don't really feel connected to any of the main characters besides Lorraine, as Theron portrayed her well and I actually felt like she was more of a real person. One problem I have with the movie is that Theron and McAvoy's characters don't really spend enough time together, and the time they do spend together they spend not liking each other. They didn't have chemistry whatsoever, so when the twists and turns at the end rolled out, I didn't feel satisfied.Acting: As I said, Theron was pretty good, but everyone else was okay. I really like James McAvoy, as he was very good in Split, and he was fine in this I guess. I wasn't too interested in his character throughout, though.Plot: The story was not particularly interesting to me, and somewhat boring. The worst scenes were the ones in the interrogation room, simply because they seemed neverending and were only there to describe the sometimes confusing plot. It was pretty predictable throughout, and the twists weren't particularly great. Twists like this movie pulled off should have the audience like \"woooah!! (blank) was actually (blank) all along! I can't believe it!\" but this movie just made me feel like \"oh. Cool.\" The plot is a typical spy thriller movie, and it would have an excuse if it had good action, but it doesn't enough of that either.Action: Considering the director, David Leitch, was one of the two directors of both John Wick movies, and I consider the first one to be one of the most realistic if not one of the best action movies, this movie didn't quite capture the same action. It's not even that the action was different; the action remains relatively similar to the action in John Wick. Longer takes with little cutting for the most part, realistic gun mechanics and fighting. The action is still a bit similar, but doesn't capture the same feel as it did in John Wick. There also wasn't enough to me. The movie is only 1 hour and 54 minutes, but still didn't have enough to interest me in the story and movie. Don't get me wrong, most of the action was shot and choreographed very well, and is much better than a lot of modern action movies, but I wished there was more of it. I also didn't really feel attached to the characters and plot anyways, taking away from the experience. I didn't even know who I was rooting for in a few scenes. In John Wick, you know his motivations, and you sympathize for him, making you cheer for him when he takes down multiple men. But when a character you don't really know or care for fights, it takes away from some, not all, the experience. Some action movies can pull this off, but this one didn't. But I especially want to talk about the staircase fight scene, which was all one take and was nearly perfect. It was choreographed so well and immersed me into the fighting, something the rest of the action lacked, I felt. It was realistic and violent, and all I really wanted out of this movie: awesome fighting and action, without need of much of a story. John Wick's story is basically some guys killed his dog and destroyed his car that his wife, who died, gave to him. He gets mad and seeks revenge, killing hundreds of men, making for great action. But this movie paid more attention to the plot, with a few action scenes. Of course, just because John Wick didn't have much of a plot and was still good, it doesn't mean this movie had to, but since this movie focused so much on the plot that wasn't interesting, it takes away from the experience. Also, there is one really good scene with umbrellas halfway through before the staircase fight, which also resembled the cool action movie that probably would have been better.Music: The music is very techno-electronic and loud. I didn't really have a problem with it, except for the scenes where the music is forced in. For example, there are scenes where Theron is just walking down the street, and techno music is blaring. Baby Driver got away with playing music over mundane tasks, but it worked because it was choreographed and the music still went with the tone of the scene and movie, and was played constantly throughout. When the only time this music is played is pretty much when someone is walking or not doing much, it doesn't really fit.Atomic Blonde was a relatively boring movie with pretty good action, though not too much of it. Also, just because a movie is an action movie, I know that doesn't mean it has to have constant action and no story, but countless times a year, action movies are released, some with good, some with bad action, that have bad or boring stories. This movie, is one of those, with good action. All I'm going to say is, you should probably James McAvoid this movie. hehehehe"
    },
    {
      "rating": "5",
      "text": "Unlike John Wick or even Jack Reacher, this film is totally devoid of pacing and even the slightest bit of humor.  As a result, it feels staid, and, at times, boring.  Which is a shame because the action sequences are amazing, the songs are perfect, and the visuals are perfect.  Simply no connective tissue, and no real reason to empathize with the characters."
    },
    {
      "rating": "4",
      "text": "In spite of a strong cast and an established narrative this endeavour by director David Leitch just seemed to fall flat. I was very much looking forward to a female driven action movie with Theron in the staring role. Going by the trailer it seemed to have all the elements of something incredibly memorable.I was bored during a large section of this film which is a real shame. It’s not fast paced and could have done with a few more action scenes. Theron has great physicality and I wanted to see more of that. James McAvoy looked a bit too pretty for his somewhat gritty role and, for me, made the character less intimidating than he should have been. Theron, although an excellent actress, played a very one dimensional character which didn’t encourage any real emotional investment from the audience. There are positives, the sets are great and I very much liked the neon stylised look that captured a fun but exaggerated setting for 80s Berlin. The retro soundtrack was enjoyable and definitely added to the overall ambience. The film stands outside the usual hollywood formula for action movies which I admired and Theron was not portrayed as a superhero but rather a skilled individual with real vulnerability. Overall, it’s not amazing but worth a look if you’re up for something different."
    },
    {
      "rating": "2",
      "text": "I really wanted to like this movie, and was excited to see it, but I can’t recommend it. I can just catalog all the things that went wrong. First of all, the whole film was murky and the look (for me, at least) simply did not work. I was not convinced that this was East Berlin at any time in its history. The direction was chaotic and the violence gratuitous, over-the-top, and sometimes actually silly. In what new spot could someone be stabbed, shot, or slashed? The plot was unnecessarily convoluted, and the final twist simply stupid and unconvincing. Both Charlize Theron’s and James McAlvoy’s talents were completely wasted. Yes, Charlize Theron could be a convincing Bond, but please, not with this cloddish director. You need elegance and style to direct a Bond film."
    },
    {
      "rating": "6",
      "text": "A film that had a lot going for it, but lacked the story to fully deliver.  You can find yourself swept up in the dynamic action scenes but still realize you don't care about very much that's going on. B-"
    },
    {
      "rating": "6",
      "text": "Leitch does a fantastic job choreographing the action sequences, but misses the mark in every other instance. Atomic Blonde is filled with a fairly basic plot that gets so muddled and confusing by the constant misdirection that the story and characters lose meaning and motivation. A highly stylized film with one of the worst use of a soundtrack I've ever heard. The music cues take over scenes. For a movie with lively characters, there not a lot of life in them."
    },
    {
      "rating": "6",
      "text": "It’s Charlize Theron beating absolutely everyone to a bloody pulp to a brilliant movie soundtrack. What more do you want in an action movie? Seriously don’t expect much more than that because you won’t get it. Don’t expect a riveting spy story set during the fall of the Berlin Wall. It moves from scene to scene in a series of brilliant cinematography and colours. A painfully generic and predictable story with no surprises in store for you, nothing that stands out. The only positive outcome of this is there is nothing to distract you from the gritty fight scenes of which there are many. And where the story fails you the stunts certainly make up for it and then some. Charlize is performing most of her own stunts and it really shows. Perfect casting, she is the female action hero we not only deserve but need right now.I really enjoyed Atomic Blonde but I couldn’t help thinking that it should have been that little bit better, and although there’s nothing in the story that will stick in your mind there are some truly unforgettable fight scenes so if you love a good action flick don’t miss Atomic Blonde. Recommended."
    },
    {
      "rating": "3",
      "text": "Over-posing vanity project of Charlize Theron, a producer here as well as its star. David Leitch is not an experienced director and it shows in his paint-by-the-numbers approach with this film that comes across as a second-rate filler film from the 80s. And yes, it's set in the late 80s and you're constantly reminded by its pop soundtrack. I called time of death 20-mins in, during the BS scene where she subdues her ally in her apt, crap that is just so cliché."
    },
    {
      "rating": "6",
      "text": "Although there are some terrific fight sequences and a top notch soundtrack, the story is not compelling or cohesive enough to follow. The surprises are not all that surprising and the editing really dumbs down the script."
    },
    {
      "rating": "6",
      "text": "It's fine. The performances by Charlize Theron, James McAvoy and Sofia Boutella all do great jobs. The action scenes were very fun and exciting. The plot on the other hand is messy and confusing. There are so many plot holes and twists and turns, and ultimately predictable. The music in the movie is a little odd, and at some points distracts you and not in a good way. David Leitch first film John Wick is definitely a better movie, but this one is still serviceable. Most people will enjoy it. 70/100"
    },
    {
      "rating": "0",
      "text": "There are three kind of scenes in this movie: 1) Action set piece2) A character \"looking cool, reflecting on something\"3) A character \"looking cool\" throwing one liners at another character that either \"looks cool\" or \"badass\" or \"shows how much power it has\"This movie is TRASH. Plot is trash. The action scenes are trash (good choreography, but NOPE, I don't believe Charlize Theron can do any of that. Not ONE realistic action scene for her... Well maybe one of two.. it might be just bad casting). But... if you like 100000000000 millon crossing of \"cool characters\" (smoking, most of the time), then you might like this trash piece of \"art\"."
    },
    {
      "rating": "6",
      "text": "To be honest I expected a lot more, it's fun and entertaining but it also takes itself too seriously even though the film is more about the style than substance, there are also a lot of slow passages that mess with the flow and it could easily lost a good 20 minutes to make it more compact.I mean it was good, Charlize Theron is actually pretty good as an action badass, a hundred times better than what she did in Aeon Flux and McAvoy is in the spot as always but I really wanted a more."
    },
    {
      "rating": "3",
      "text": "I really wanted to like this movie. There are moments where it lives up to it's promise but overall the characters are weak and poorly developed, there is no chemistry between the actors/actresses, the pacing is slow and I found myself struggling to buy into the movie. It felt like it was missing the snappy script or direction of say 'lock, stock and two smoking barrels' which it could have done well to emulate. It just wasn't a fun experience."
    },
    {
      "rating": "0",
      "text": "what happens when you get a 40 year old ballet dancer, pretending to be a fighter in a movie, that wants to be a spy thriller?  Some of the most \"memorable\" (in a bad way) \"fight scenes\"  you have ever seen, and \"Action\" slathered onto a sub par story."
    },
    {
      "rating": "8",
      "text": "The soundtrack was amazing, the acting was excellent, the visuals were impressive and the fight sequences impressive. Atomic Blonde definitely succeeded at being entertaining, interesting and at having good character development. While the twists in the end weren't very necessary and a little bit predictable, it's still a solid movie."
    },
    {
      "rating": "3",
      "text": "Fantastically boring. Not much to recommend about this movie, except for great sound design (you can hear everything, and the bullets and the punches practically hurt) and one really good fight scene. Everything else is disposable and would have gone straight to video (if such a thing still existed) were it not for the presence of Theron and McAvoy. It's surprising that they wasted their time on a movie like this, and you should avoid doing the same. If you're really curious wait till it's out on some streaming service. Also, annoyingly, it piles on a few unnecessary twists at the end, as though desperate to show you just how smart it thinks it is. Painful."
    },
    {
      "rating": "1",
      "text": "Talk about a dud where no spoiler alerts are necessary.    \"Atomic Blonde\" is exactly what you would expect:    a James Bond style shallow character in the form of Charlize Theron, who predictably goes to East Berlin just immediately before the wall comes down to track down \"The List\", a dossier the Soviet Union, Britain and the U.S. agents would all love to get their greedy little mitts on before the wall falls.    The movie has its moments as far as setting, and the potential for a fairly gripping spy drama, but it's never approached.    Not even the usually great James McAvoy can save this dog.    Besides the ridiculous notion that one blonde superspy can literally kick the asses of every bad guy behind the Iron Curtain, dodge every bullet, and generally wreak havoc all over Hell, Theron is about as exciting to watch as toadstools growing in my yard after a good rain.    Her delivery is deadpan, and absolutely unconvincing as well, anything.    It's just cheesecake with nothing going for it except a few sex scenes, and McAvoy's attempts to at least act compelling.    Bang, blow up, run, show off your butt, rinse and repeat.    Theron is a dud and this movie makes you yearn for something more believable, like one of the \"Fast and Furious\" movies.    It's that low."
    },
    {
      "rating": "0",
      "text": "I thought this looked bad in the trailer but the reality is much worse. You'd think the Director of John Wick would deliver something exciting but instead it's just formulaic nonsense, full of archetypal characters with no depth, nothing at all is taken seriously (I know it's fun, but come on?) so it doesn't have the same grittiness as John Wick, which still managed to be humorous. Brutal violence against innocent civilians is glamorised with pumping music, all in an attempt to make the bad guys seem as merciless as possible - I wonder why - to make us want bad things to happen to them. The dialogue is a joke too, with Theron uttering obscenities like (co!ksucker) in a dodgy English accent. I mean, what's wrong with sucking co!ks, even if You're a man? This is 2017 and a homophobic lead, great.  The actors also have to drop the F bomb at least twice in every sentence too as the writers are too dumb to create full sentences and it cuts down the amount of dialogue you need in general. Plus we're only here to watch this stunning blonde woman commit acts of violence and look sexy doing it. Oh and she kisses a girl. Very progressive. Not aimed at horny men at all. I had to leave the cinema half an hour in. Please somebody utilize Charlize Theron more productively than this because she has lots of talent. Don't turn her into some shallow fantasy for teenagers and horny, sexually frustrated men."
    },
    {
      "rating": "7",
      "text": "David Leitch also directed \"John Wick\" and his skill with action, especially hand-to-hand fights, is ramped up here. An alluring Charlize Theron plays a cool, beautiful, tough MI6 agent who's sent to recover a sensitive document in Berlin around the time of the wall's collapse. She teams up with James McAvoy, but more importantly, takes on dozens of men with painful blows and whatever object she can use as a weapon. The fight sequences are brutally forceful and even better, there's no blurry camerawork and flashy editing to hide the hard stunt work. It's all staggeringly evident. Meanwhile, the film enjoys a colorful 80s neon noir look and the period tunes provide a jammin' soundtrack. The rather conventional plot keeps turning on itself (as spies often do) and that becomes a bit much. This film is all about the well-staged chases and fierce fights."
    },
    {
      "rating": "7",
      "text": "In the 1940s and 1950s, in my teens, I thought Ava Gardner and Rita Hayworth were two of the most beautiful women in the world and in the 1990s Charlize Theron took over that title. She also added one of the best actresses in “Monster”, at which time I swore if she didn’t win the Oscar I would never go to movies again (Whew! She did!), along with “Mad Max: Fury Road”. In her television ad for Christian Dior’s J’Adore perfume there is no one in the history of movies who walked, walks, as sexy as she does.As much as I dislike violence the only reason I went to see “Atomic Blonde” was because she was in it and, yes. From first to last frame she is the center of violence. From kicking, hitting, kneeing, punching men in the crouch (OUCH!) to using keys, lamps, heaters, guns, knives, her hands and bodies she disperses her enemies like very few if any actions can or do.Along with that she can look magnificent stepping out of an ice bath with bruises all over her body, a busted lip, a black eye and just take your breath away. Look at her walking in red stilettos, which she also uses as a weapon, or stepping out of a car with her long legs encased in leather high heel boots or her body wrapped in a sweater dress and you forget all the mayhem, murder and you know she is not only any man’s equal but, in most cases, their superior!Obviously from her biceps, back muscles, firm, strong body you know she did most, if not all, of the stunts. She also could teach 007 how to make love to men and women!No one walks like Theron does on screen and could have taught Monroe a few things!Oh yes, there is a story in “Atomic Blonde”, written by Kurt Johnstad, which like in many action movies doesn’t really make sense and the director, David Leitch, puts his actors through the fights, car chases, interestingly, along with director of photographer, Jonathan Sela adding to the film as does composer Tyler Bates with his soundtrack and the addition of songs that fit each scene, sometimes with a laugh.There is one long fight sequences with Theron battling one enemy after another, at times 4-5 of them in one shot that certainly will rank among the best on film.There is a good supporting cast with James McAvoy as her partner standing out, James Goodman and Toby Jones, wasted, Sofia Boutella as a French spy who seduces or is seduced by Theron along with Eddie Marsan, Til Schweiger among others but it is Charlize Theron in every scene that owns the movie.This is a film, first off, for Charlize Theron admirers, also for those not familiar with her, then action fans, masochists and sadists. Yes there is a lot of violence but I forgot most of it watching Theron hand ling herself and her enemies like she does it every day.By the way some people left when the screen went black and missed the added on scene explaining what happened near the end."
    },
    {
      "rating": "8",
      "text": "Is there anything Charlize Theron can't do?  This movie is much better than I expected from the trailers and the title:  it is drenched in atmosphere and period tunes, and all the actors do very well, generating gravitas the plot doesn't quite deserve.  Nothing we haven't seen many times before but still a fun watch."
    },
    {
      "rating": "1",
      "text": "I have it a one cuz I like Charlize, but boy was this movie bad. I just can’t believe the characters and even Charlize is not believable, the English accent just kille dome, she can’t do it right, don’t get it and don’t believe her...and the accent .....like Angelina Jolie in Tombrader, its just bad. Just lots of scenes of Charlize kicking everyone’s ass while 80s music is playing. Have zero expectations and you may find it amusing."
    },
    {
      "rating": "0",
      "text": "Poor pacing, Uninspired action scenes that fail to excite and an all too generic plot tank their attempt at a female John Wick. Maybe they should have focused less on style and more on providing a good enough film for people to get behind."
    },
    {
      "rating": "4",
      "text": "There are some good action scenes but they are spread too thin and probably most of them were in the trailer. This is a standard boring cold war spy movie about meeting contacts and looking for paperwork. It's the kind of movie that calls itself 'stylish' meaning it has no real narrative structure and is more like bunch of random events cut together. It also uses a typical boring interview framing device which doesn't really serve much purpose. I gave up half way though to avoid falling asleep but gave it a middle score for the action and sex scenes."
    },
    {
      "rating": "2",
      "text": "Cliche riddled, predictable wanna be edgy action thriller. Some OK fight scenes and stylish cinematography but over all its a mish-mash inbred little step-sister of John Wick."
    },
    {
      "rating": "5",
      "text": "The problem with this movie was the pacing, the movie got interesting when the music kicked in and your like this is going to be awesome than 2 secs later the actions over and it's back to talking. I found it extremely boring when compared to john wick 1 & 2 and James Bond. It had potential but wasted it, first movie i have ever almost fell asleep watching in the cinema, i was waiting for it end."
    },
    {
      "rating": "1",
      "text": "If you like action and don't need to connect to characters whatsoever to enjoy it, this will be right up your alley.  There's a few well-choreographed and hard-hitting punch outs that approach some satisfaction.  What hurts this movie is its need to be cool, especially in a main character that hardly emotes.  The result is a movie filled with nonsensical spy technobabble headed by a heroine who remains uninteresting until the end credits.  The worst part is that the story doesn't have a single original bone in its body, so given the cast and their willingness to please this could have been an explosive iteration of a tired and stale genre.  Instead, it's as by-the-numbers and forgettable as you can get."
    },
    {
      "rating": "2",
      "text": "This movie is very bad. This movie had a very boring plot and the characters were not good and where one dimensional. the action scenes are the only good part of this."
    },
    {
      "rating": "7",
      "text": "If you are familiar with what they seem to give you that seems to be related to this, then Atomic Blonde is predictable with its similarities, but not with its plot at least. If you are not, then it can give you surprising moments of eye candy madness that it will cause you to not even pay attention to what is definitely going on. Definitely worth the shot if you are looking for something to see."
    },
    {
      "rating": "6",
      "text": "I love 'talky' movies (i.e The Counselor) when they are interesting. This movie became too 'talky' way too quickly with a clear lack of direction. The action was good but far in between sandwiched by 20 minutess of talk talk talk. I nearly fell asleep - last time this happened was when watching Ghost in the Shell. This was an average movie that struggles to keep interest in the latter half."
    },
    {
      "rating": "8",
      "text": "Atomic Blonde is an engaging action movie that is serviced well by its script.  This is David Leitch’s directorial debut, and though not a perfect film I am hopefully for him helming Deadpool 2.  Atomic Blonde was also an interesting film for me as whereas most action films lose steam towards the end, this film seemed to speed up.  There is a particular action scene towards the end of the film that will probably go down as one of the best choreographed fight scenes on camera.    The sound track is great, Charlize Theron and James McAvoy are enjoyable, and the story solid. The only thing that felt a little off was the pacing, as some scenes seemed a little rushed  trying to get to the next arc.\tIf you are a fan of action films or cold war spy thrillers, I would defiantly keep this film on your radar."
    },
    {
      "rating": "9",
      "text": "I had a lot of fun in this movie and the rest of the audience seemed engaged as well.  There is a lot of depth and curveballs in the script all the way to the end.   And they are appropriate twists in the script that keep you on your toes and fit in the movie.   The protagnist Lorraine makes a believable undercover agent and uses realistic fight moves for someone that is fighting higher weight class opponents.    I recommend you limit your bathroom breaks as you may find yourself falling behind on the movie."
    },
    {
      "rating": "7",
      "text": "A crazy, fun, if over-the-top romp. After her strong showcase as an action star in Mad Max: Fury Road, Charlize Theron once again proves that she's got what it takes to be tough as nails, and make it quite entertaining throughout! Like I said before, the action is fun and entertaining as hell often enough, but it's over-the-top energy left me having to suspend my disbelief more than a couple times, especially with characters that I felt should've died much easier than they did (seriously though, Charlize mercilessly beats a handful of men well over a dozen times with her fists, objects, etc. during an impressive stairwell fight sequence, yet that STILL wasn't enough to kill them often times!) Aside from her, James McAvoy makes an often times worthwhile and humorous supporting turn. Overall, if insane mindless action that requires you to flip the off switch in your brain is your thing, then this is well worth checking out! Just don't go in expecting anything too mindblowing in terms of story or something too original. Here, it's all about the expertly choreographed action, and it delivers!"
    },
    {
      "rating": "8",
      "text": "Charlize Theron ne fait pas que des pubs pour Dior, elle fait des films aussi... et une blonde atomique en l'occurrence, tellement atomique que ceux qui l'approchent trépassent aussi sec. Elle est ici en très grande forme dans le rôle d'un super agent qui fait passer les Bond ou les Bourne pour de **** amateurs...Et son personnage de femme très fatale a des goûts très particuliers, histoire de mélanger le plaisir et les affaires : on aime sans modération, y compris ses bains remplis de glaçons...  la glace-nost en quelque sorte. En tout cas, ce n'est pas l'histoire dans ce Berlin de la chute du mur qui récoltera l'Oscar : ce miroir aux espions doubles, triples et quadruples est trop délirant pour être crédible... c'est hélas trop souvent le lot du genre.Non, c'est plutôt l'ambiance et l'action frénétique qui remporte l'adhésion : une violence stylée, inventive et ultra efficace, magnifiquement filmée avec plans-séquences inclus, y compris et surtout au corps-à-corps brutal et sans pitié... Je prends bonne note de ce réalisateur David Leitch et l'inscris sur les tablettes des cinéastes les plus doués : quel brio et quelle démonstration ! la moindre baston n'en est que plus délectable.On a donc compris que Charlize crève l'écran à tous les niveaux. Ce n'est pas le cas pour McAvoy qui s'enlise dans sa propre caricature, ni pour la petite Boutella à la fois pièce rapportée et petit cul impromptu jetable : dire qu'elle incarne un \"agent\" français, c'est dire qu'on passe (encore) pour des cons... Mais le reste de la distribution est à la hauteur avec un Goodman impeccable et des molosses du KGB increvables ou presque...Finalement, Atomic Blonde a tout d'une grosse bande dessinée très bien mise en images, au rythme trépidant, à l'action millimétrée stupéfiante et aux dialogues incisifs. On apprécie son côté furieux mais élégant ; on met de côté son histoire trop rebondissante de fin de guerre froide, simple prétexte à un collectathon inarrêtable de macabés. Dior, j'adore !"
    },
    {
      "rating": "8",
      "text": "This movie was exciting. Theron was fantastic. The fight scenes were new and very well made. The car chase, the umbrellas, the music, the sex appeal, and the flow. A solid B grade. I also purchased the soundtrack on double LP from Mondo"
    },
    {
      "rating": "7",
      "text": "Supremely stylish and well-choreographed with an iconic performance from Theron, the film coasts largely in part to the above mentioned merits despite its overly convoluted and needlessly dense narrative."
    },
    {
      "rating": "7",
      "text": "A fun, kick-ass story of intrigue full of plot twists and turns that will keep viewers guessing right up to the end. Its mixture of action, adventure, '80s nostalgia (especially its excellent retro soundtrack) and often-campy humor make for a thoroughly entertaining mix (think \"Kingsmen\" with a touch of peroxide). While the film has some occasional issues with pacing and tone, it nevertheless manages to serve up an enjoyable few hours at the show, with excellent performances by James McAvoy and Charlize Theron. Fasten your seatbelts."
    },
    {
      "rating": "6",
      "text": "OK, I went in expecting better fight scenes than in Wonder Woman and I was not disappointed (for the most part). Particularly impressive was the realism of how 1. someone of lower general body weight has to focus almost entirely on direct weak spot attacks (throat, groin, joints, eyes) like in Krav Maga or jujutsu, or else if the fight goes on too long against someone too much heavier our hero can expect to get severely **** up, and 2. she actually checks if she has a round in the chamber by partially pulling back the slide, before she goes into a gunfight. Nobody **** does that. :) Everyone in action movies just fully racks the slide without a second thought, even if they've racked it before when they were gearing up (which means the second time around they should be throwing out a perfectly good unused round like a dumb ass).But what I was also expecting was the fast pace that makes sense in - and is typical of - assassin/secret agent movies, where there's a mission to complete under time pressure and there are lives at stake. Here the feeling of urgency is interrupted by chillout/dialogue scenes so much that you just lose the excitement and it stops feeling the way a secret agent action movie should feel. Big let-down there.Minus 2 points for turning it into a CIA glorification piece, sadly, though as we know by now the writers don't really get a choice when trying to portray such institutions."
    },
    {
      "rating": "10",
      "text": "The highly choreographed fight scenes, the 1980s soundtrack and Theron's magnetic presence combine to make \"Atomic Blonde\" a must see action flick. I especially enjoyed her scenes with Boutella's French agent Delphine Lasalle. Those ladies are smokin' hot individually and explosive together.  I only have two complaints about the movie: 1. The plot is kinda bland; and 2: The flashback structure assures the audience that Broughton will live to fight another day. But we already know Charlize isn't going to die anyway. She's the star for Christ's sake. Neither of these are deal breakers. \"Atomic Blonde\" completely delivered on what I expected. It's ultra violent, ultra sexy, and ultra fun to watch.  Will there be an \"Atomic Blonde 2\"? If so, I'll all in. Some have suggested Charlize as the next James Bond. That's an even better idea. Theron has proven she can do anything Bond does but in stiletto heels. No small feat."
    },
    {
      "rating": "7",
      "text": "\"Atomic Blonde\" was a movie charged of action, and sensuality, Charlize Theron, has interpreted a bad-ass woman of prime qualitythe phtography and the soundtrack are very good, and the performances and the story are good, this movie is \"bad-ass\" 100%."
    },
    {
      "rating": "10",
      "text": "Move over McClane,Wick, and Bond...the Action world has a new star and it's Lorraine Broughton. \"Atomic Blonde\" is a solid action spy thriller. Theron hands down is more of a Believable fighter than Gadot due to the  fact that Theron performed 98% of her own stunts in this film unlike Gadot in Wonder Woman which by that revelation makes Theron the real Wonder Woman and Gadot nothing more than a cheap dollar store imitation. Cracking your teeth and taking punches to the face shows real toughness versus whatever Gadot was doing"
    },
    {
      "rating": "9",
      "text": "A glorious spy movie that revels in expertly choreographed action sequences, sumptuous eighties styling, and costuming that is a delight to watch. Theron is superb, McEvoy is excellent, and the storyline is both compelling and every bit as twisted as you would expect from this genre. The cinematography has moments of brilliance, with the fight sequences notable for the refreshing clarity of the visuals, and the soundtrack is an unexpected joy. Violent, sexy, and intriguing, this is a brilliant addition to the genre that is a thoroughly entertaining experience. 8.89/10"
    },
    {
      "rating": "7",
      "text": "Propulsive and energetic color rushed action fantasia. The action scenes come quick and brutal, including the one near the end that's meant to look like one take that's part of a new trend of showing the physical wear and tear a fight takes on these so-called action hero(in)es. It's a beaut and a definite keeper.The problem is that good chunks of this film are taken up with a story clearly meant to be confusing and obfuscating but Tinker Tailor Soldier Spy this isn't. It just doesn't hold the interest for long enough periods of time, twists are revealed like big deals but land with a thud. Theron and McAvoy deliver absolute dimes but it's still not quite great."
    },
    {
      "rating": "7",
      "text": "Atomic Blond is good film that is  worth a watch in a pretty disappointing summer of cookie cutter movies. It's an action orientated spy flick that won't disappoint you if you are less concerned with a \"cerebral\" story and instead prefer great visuals and fights. The plot is pretty straightforward and isn't anything impressive. It's pretty easy to figure out what will happen next. This isn't a negative point of the movie, just don't expect some \"mindf*ck\" that will leave you with your jaw open. It's paced well enough, with no spots that leave you bored.That being said, the action sequences are top caliber. The shots are down to earth, focusing on the brutality of the fighting and not absurd or overtly flashy. Another positive is how the shots are typically one long extended scene without any of those Resident Evil style, 40+ cuts to show a single kick, garbage. You know exactly what is going on at all times and can almost feel how painful it is.Another strong pro for this movie is the atmosphere. It really gives you the sense of 1980s Berlin. It might have a little to do with how obnoxiously they cram 80s music in every scene, but it works more than it doesn't. The strongest part of the entire movie are the beautiful scenes after beautiful scenes. The visuals are top notch."
    },
    {
      "rating": "7",
      "text": "Not a really bad movie, I absolutely loved the soundtrack (the sole reason I'm keeping the score in the green) the fight scenes are well executed, even if more brutal than you'd expect from this Atomic blonde. The story is quite predictable though and the surprises and twists are quite \"Meh\". If you like watching Charlize in over the top violence then you'll get plenty of that. When you start thinking about the whole story, you'll probably be left wanting a bit more substance."
    },
    {
      "rating": "8",
      "text": "Great mood of 80s. Satisfactory action and good plot. Visuals of soviet era great. You will have good time watching the movie. Definitely recommended."
    },
    {
      "rating": "7",
      "text": "Good music, good cinematograpahy and style, great and brutal fighting scenes and a lead actress that nails it. Charlize Theron fits these type of roles like a glove. Since Prometheus and Fury Road it is clear the girl has been born to do these other type of bad-ass roles. She delivers on all fronts. Still stunning for her age by the way. Really spectacular. The plot is a little bit confusing although it keeps you interested and you end understanding everything in the end. Nothing groundbreaking story wise but very enjoyable."
    },
    {
      "rating": "8",
      "text": "It was down unexpected in so good way. Lorraine kind of super hero. Charlize is perfect"
    }
  ]
}