{"id": 4358, "title": "Atonement", "starring": ["Keira Knightley", "James McAvoy"], "runtime": 123, "genre": ["Drama", "Romance"], "description": "As a 13-year-old, fledgling writer Briony Tallis irrevocably changes the course of several lives when she accuses her older sister's lover of a crime he did not commit.", "releaseYear": "2007", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/hMRIyBjPzxaSXWM06se3OcNjIQa.jpg", "categories": {"plot": 6.260869565217392, "acting": 5.944444444444445, "ending": 6.888888888888889, "soundtrack": 4.5, "cinematography": 5.833333333333333, "familyFriendly": 3.0, "funny": 5.0, "action": 6.0}, "reviews": [{"rating": "10", "text": "Atonement is a wonderful film which shows an incresing story of love and subsequent tragedy and a sad mixture of feelings that makes us sad and horrified for the untimely ending of the story. For those who had read Ian McEwan's book, the film appears as a wonderfully faithful adaptation of the book which is able to surprise and to touch those of read it and those who didn't and in the end we are left with this question: if it had happened to us, could we bring ourselves to forgive someone like Briony Tallis? Is it possible to find the titular Atonement after all those years? Acting-wise, Keira Knightley, James McAvoy and Vanessa Redgrave receive my praise as Cecilia Tallis, Robbie Turner and a 70-year-old penitent Briony Tallis."}, {"rating": "5", "text": "I don't think I have ever disagreed more with the critics. The basic story is a tawdry, contrived sequence of events, intended to be tragic, but only evoked irritation in this viewer. I was especially annoyed by the prolonged and ultimately pointless WWII portion of the story. The surprise ending only served to extend the tedium. The 'atonement' seems tacked on and empty. Maybe that was the point? The cinematography is excellent, but seems too artistic for the story. At times the soundtrack was a bit ham-handed. Someone sure fell in love with the oh-so-clever sound of typewriter keys. Most of the acting was at least adequate. James McAvoy does a great job, but Kiera Knightly seems miscast. Overall, I found this movie was very disappointing."}, {"rating": "4", "text": "OVERRATED. What a snoozefest."}, {"rating": "2", "text": "It was horrible. It was insanely slow and even more boring. Waste of time and money."}, {"rating": "6", "text": "Too long in parts, and tries to hard to be artsie in the same vein at The English Patient. The story was fine, but too slow at first and the war scenes were over long. Then there was all the cutbacks and flashs forward. You have to stay for the ending, or it makes no sense at all. The acting is well done , it's just too long and strangly edited."}, {"rating": "4", "text": "I'm not dissapointed, except for the fact that it won an oscar for best music for motion pictures written directly for the screen, original score. I was hoping that Sweeney would win. But right from the get go I hated it. I saw it last night and thought it would be one of those critics-35, users-4.7 movies such as 10,000 BC or Jumper. That's exactly what I got. A dull and dreary dry picture with no excitement or brilliance what so ever. It takes a good story and twists it into a bad one by over-extending the scrpit with much stupidity said enough in this film. I can't say I didn't like it because it isn't my taste, it's just that it felt like all it was was some continuous random sex scenes that were unesecary, escpecially the one sex scene when they were standing up. Now what'd so wrong about having sex in yer bed huh. But, anyways, it wasn't good."}, {"rating": "3", "text": "Vastly overrated, with goofy storytelling, odd pacing, bizarre editing, less-than-convincing acting and a ridiculous ending. Given all the \"100\" ratings, I guess I was expecting something like Dr. Zhivago or Romeo and Juliet. Yawn."}, {"rating": "3", "text": "I have really been extremely disappointed with this years nominations for best picture. I've seen no country for old men, there will be blood, Michael Clayton, and the latest one, atonement, was BY FAR the biggest let down. The main problem with atonement is that you are never emotionally attached to the characters and therefore never really care what happens to them. On top of that the movie is just slow paced and uneventful throughout, and trust me, the ending does not help or justify sitting through this dull movie. If anything the ending is icing on the cake as to how bad atonement truly is. I can assure you that everyone walking out of the theatre was saying \"wow, how did THAT win best picture.\" or \"we really should have seen Rambo\". Atonement gets a 3 out of 10 for having decent acting and decent camera work with some good looking shots. But nothing in this movie will give you the slightest implication that maybe just maybe it should have gotten a nomination or win for best picture. You WILL be disappointed and you WILL wish you had seen something else. DON'T waste your time."}, {"rating": "3", "text": "the final two thirds of the movie are completely anti-climatic knightley falls flat script is empty of substance directing is overwrought and heavily decourous painful to sit through! 3 points are merely for some interesting aesthetic shots/visuals and some interesting costumes. but cant we expect more from the film medium?"}, {"rating": "1", "text": "Don't believe the hype. This film is dull, dull, dull. Lot's of over acting and meaningful staring into the middle distance. No substance whatsoever and rubbish dialogue. A case of the emporers new clothes as far as the awards it has won. Don't waste your time and money on this."}, {"rating": "5", "text": "I agree with A.O. Scott's review--almost completely. The beginning starts off fairly well---predictable--but everything is firing perfectly in just about every area --acting, set, direction, DP, etc (maybe dialog isn't perfect). But holy heck does it take a detour to lost-muddy-mess. I haven't seen this level of navel gazing cinematography since Terrence Malik kept the camera on grass for the first 10 minutes of \"The New World\". The ending of course, is suppose to grab you and leave you with the very real feeling of sadness, guilt and atonement---which is very much a part of the novel it's based on---in fact I think Vanessa Redgrave's last 5 minutes on screen was some of the best acting in the film ( Keira sure is pretty though)--however Redgrave and the heart-wrenching reveal can't save the mess in the middle. I'm a little shocked so many critics praised this film at the level they did."}, {"rating": "0", "text": "Overrated Oscar bait."}, {"rating": "4", "text": "Another slooow movie, with a ridiculous premise (the writing and delivery of a very obscene note), in a story told in annoying flashbacks. The beach scene with its ferris wheel, animal cruelty, and exhausted, injured soldiers, was confusing and went on and on. The only good thing I have to say is that the ending is imaginative and slightly redeeming to the rest of this tedious picture."}, {"rating": "3", "text": "This was a particularly boring movie. I couldn't tell what was going on and it was filled with inappropriate material. I left 3/4 of the way through."}, {"rating": "5", "text": "While I can appreciate why some people would enjoy this movie I felt it was more of a period drama and was annoyingly slow moving. There were no surprises in the movie so why they chose to drag out the scenes is beyond me. Also the disjointed plot involving the second world war scenes only further distanced me from the movie. Although it was all brought together at the end I struggled to keep my interest from waning."}, {"rating": "7", "text": "movie began a bit slow, but got better later."}, {"rating": "2", "text": "Atonement is a slow, boring and un-compelling film with not a single character that was remotely interesting. Nothing came to life and that's mainly to blame from poor storytelling."}, {"rating": "6", "text": "Atonement is a classic British film. A good cast, an interesting tie, and then a boring narrative and another dull ending follow. James McAvoy played his role perfectly."}, {"rating": "8", "text": "If you want to take an average story and turn it into a movie with an undeniable knock-out ending just hire a Redgrave to deliver it. A couple of years ago Lynn Redgrave gave a performance at the end of Kinsey that elevated that film from being a so-so biopic into a riveting study on human behavior, and it was only a 5 minute scene! In Atonement, it's sister Vanessa in a 5 minute scene at the end that transforms the movie from a typical English Merchant-Ivory style love story into a epic story of love, lies, despair and redemption. It hooks you into a love story torn apart by a single lie and follows the plotline through the years ending at a beautiful and totally unexpected place that only Vannessa Redgrave could take you to. She is truly one of the worlds great actors. Keira Knightley and James McAvoy are excellent as the lovers torn apart and Saoirse Ronan & Romola Garai are perfect as the younger stages of the Redgrave character. The cinematography by Seamus McGarvey is brilliant, in the league of Roger Deakins and Robert Elswit this year (you'll see those three names when Oscar nominations are announced!) Atonement is an old fashioned love story that becomes an epic movie going experience the minute Vannessa Redgrave defines Atonement!"}, {"rating": "10", "text": "Brilliant movie!"}, {"rating": "10", "text": "Loved it!"}, {"rating": "9", "text": "This unforgettable story deserves higher ratings than its getting here. It has that \"classic novel\" feel of a great 19th century romance novel. Loved the 5 minutes of Vanessa Redgrave, she blew me away, she's still terrific. The scene of Dunkirk is one of the great war scenes of all time, an incredible tracking shot that follows the arriving soldiers for about a mile along the shore. Also kudos to the entire cast, the beautiful green dress, and the original novelist, this was an unforgettable story."}, {"rating": "9", "text": "Nice story line with not your typical predictable ending. Great acting by James McAvoy!"}, {"rating": "5", "text": "Vastly overrated. As of right now, there's a full 15 point difference between the critics score, 85, and the people's score, 70. This ALWAYS should raise the alert. Critics tend to have their heads up...well you know. (see \"Lost In Translation\"). Mediocre movie, decent ending, better than bleeding to death in a bathtub but not as good as a grilled cheese sandwich."}, {"rating": "6", "text": "Disjointed, disappointing, slow. I had high hopes for an epic love story. It didn't deliver. Definitely not the best picture of the year."}, {"rating": "10", "text": "Amazing emotional story. There is some very honest acting in this film."}, {"rating": "10", "text": "A beautifully made, multi-layered adaptation of McEwan's fabulous novel. Don't believe the NY Times and the New Yorker on this one!! And Jeff Beresford-Howe must have eaten a bad clam before writing his review."}, {"rating": "10", "text": "An amazing work of cinematic art. The best film I have seen in the last five years. Better than Gosford Park."}, {"rating": "6", "text": "An odd and awkward movie that nevertheless manages a few good stabs in the heart, thanks mostly to the potent reality of WWII, James McAvoy, Saoirse Ronan (is there a law that good child actors must have bizzare names?), and a little to Keira Knightly. The direction is capable, but at times flamboyant in a way that seems inorganic, and the story rather a hurky-jerky mess. If there was any actual atonement, I missed it."}, {"rating": "6", "text": "Two old-school extremely knowledgeable film veterans review ATONEMENT. It's a great review - and leaves you something to think about. Check it out on YouTube... http://www.youtube.com/watch?v=NPJpnaEnAvE Beware...may contain spoilers"}, {"rating": "5", "text": "I, and four others (one of whom had read the book) saw this movie and unanimously disliked it. We found it dragged terribly and while it was certainly very stylish and clever(too much so) it lacked any soul. I definitely wouldn't recommend it."}, {"rating": "10", "text": "The best picture of the year the cast is a wonderful Keira and James beautiful the direction is magnificent is an Oscar through."}, {"rating": "9", "text": "Have read the book 3 times and went to Toronto to see the film at the Festival. It's an almost excellent translation of the book, other than the last scene being \"MIA\". Wonderful acting, great cinematography and score. I can't wait to see it again"}, {"rating": "7", "text": "A fine piece of eye candy. Each frame a visual feast of color, light and brilliant production. But, ultimately, one is left wanting more substance. I can't help but feel the film's heart was too over dressed. Still, a beautiful piece worth seeing on the big screen."}, {"rating": "1", "text": "I wished I had listened to someones warning at this to stay home and go for a nap. boooooooring!"}, {"rating": "10", "text": "One of the best movies I've had the pleasure of seeing in quite some while. The meta-reality twist at the end of the film is what really makes this worth watching. The musical score is also phenomenal, cheers."}, {"rating": "9", "text": "Those who refer to it as boring (as many do) are probably the same people who would choose McDonald's over a homecooked meal. It's sad when no one has the patience anymore for character development and the subtleties of real stories, of real life. And I guess you can also blame Hollywood for training us to want bullets flying every three seconds. I vote a 9 because, while the ending has been lauded, I found it a little manipulative, actually, though haunting all the same."}, {"rating": "8", "text": "Well done. Vanessa Redgrave is always amazing to watch."}, {"rating": "6", "text": "Beautifully filmed but so very sloooooow."}, {"rating": "9", "text": "Great movie. I wasn't sure I wanted to see it at first. Probably only really went because of Keira Knightley, but I was sure glad I did. It is very dark, but very interesting and very well done. Definitely for adults only, though, don't take your kids to this one. Overall, though it was top-notch. Very interesting story, very well acted and very well made. I was super impressed."}, {"rating": "0", "text": "Plot Spoiler. The plot is dumb: Girl writes book about how she messed up, and everybody whines about it."}, {"rating": "10", "text": "Wonderful movie, I didn't expect that it would be possible to translate book into the film so perfectly."}, {"rating": "9", "text": "Random Thoughts: Very nicely done period piece. It has something for everyone. It's a romance, a war picture, a costume drama. The Dunkirk scenes are amazing. The acting and production values are first-rate."}, {"rating": "7", "text": "In it's own right, a very good film. Kiera Knightly performs with the kind of British swagger reminiscent of \"Masterpiece Theatre,\" and James McAvoy sits high on a pedestal alongside her. It's beautifully shot and expertly directed, with some of the best cinematographic shots of the year. Truth is though, in the end, it's still just another well-made, WW2 period piece to add to the continuously growing list of the genre. There's nothing truly different or new presented in \"Atonement.\" Best picture worthy? There are certainly more deserving movies this year, but I still respect this very entertaining film."}, {"rating": "6", "text": "The whole story feels like a made-up and most of the scenes are so *** unnatural. Yet somehow it is heart touching maybe because of the girl who's the only intense character here. A good thing to see but only once."}, {"rating": "1", "text": "terrible, contrived, manipulative nonsense. AVOID."}, {"rating": "9", "text": "Good love story but the ending seems stilted because it could leave viewers feeling as if the rest of the film had not been playing \"honestly\"' with them or their emotions."}, {"rating": "2", "text": "Aside from Keira Knightly, there was very little to like about this movie. The out-of-time sequences were useless. No new information was ever uncovered or revealed so shooting them out of sequence was stupid and unnecessary. Whatever grandiose ideas brought about the extravagant beach scenes apparently never got out of the director's head. Scenes were thrown in at random to add some sort of grit but it all came off as very amateur. This movie was not worthy of any awards or praise. Between this and 'There Will Be Blood' I wasted two evenings I can never get back."}, {"rating": "10", "text": "Best movie of 07 and it got robbed from best picture. No country for old men didnt deserve it i gave that one a 6. but anywways this movie is brilliant, intriguing, fascinating, beautiful, clever, funny, sad, disturbing, haunting, romantic, EPIC, grandiose, sensational, and so many other things. amovie that will change u forever and of of the best EVER! A MASTERPIECE!"}, {"rating": "1", "text": "Quite possibly the most boring film ever made. Yes I admit it was shot beautifully but you can't just rely on that. It just dragged on for too long and there was no real story. It didn't feel like it was going anywhere at all. Way too over-rated. Don't get your hopes up."}], "recommendations": ["the_power_of_the_dog", "hugo", "the_illusionist", "there_will_be_blood", "tinker_tailor_soldier_spy", "magnolia", "the_irishman", "perfume_the_story_of_a_murderer", "changeling", "ben_hur", "shutter_island", "roma", "the_mountain_between_us", "bad_times_at_the_el_royale", "titanic", "alice_through_the_looking_glass", "the_green_knight", "the_lucky_one", "the_curious_case_of_benjamin_button", "gone_girl", "seven_pounds", "the_lovely_bones", "the_bfg", "reminiscence", "127_hours"]}