{
  "id": 2062,
  "title": "Austin Powers: International Man of Mystery",
  "starring": [
    "Mike Myers",
    "Elizabeth Hurley"
  ],
  "runtime": 94,
  "genre": [
    "Science Fiction",
    "Comedy",
    "Crime"
  ],
  "description": "As a swingin' fashion photographer by day and a groovy British superagent by night, Austin Powers is the '60s' most shagadelic spy, baby! But can he stop megalomaniac Dr. Evil after the bald villain freezes himself and unthaws in the '90s? With the help of sexy sidekick Vanessa Kensington, he just might.",
  "releaseYear": "1997",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/5uD4dxNX8JKFjWKYMHyOsqhi5pN.jpg",
  "categories": {
    "plot": 7.615384615384615,
    "acting": 7.6,
    "ending": 5.0,
    "soundtrack": 8.5,
    "cinematography": 5.0,
    "familyFriendly": 6.0,
    "funny": 7.590909090909091,
    "action": 9.0
  },
  "reviews": [
    {
      "rating": "10",
      "text": "A non-stop laugh riot. Brillant satire. It would be nice if the sequals would return the simple formula that works so well in this original Austin Powers: Two relics of the '60s who are hopelessly out of touch with the late '90s. We don't need Austin and Evil traveling back in time because they are much funnier to watch trying to get up to speed with the present. Right up there with Airplane and Naked Gun."
    },
    {
      "rating": "9",
      "text": "now thats what I call a comedy classic"
    },
    {
      "rating": "10",
      "text": "Probably the funniest movie of all time.  I heard this movie was made to watch tripping so I recently watched on it magic mushrooms and the rumor is true."
    },
    {
      "rating": "9",
      "text": "Words cannot describe how wonderful this film was. The story is admittedly daft, but the film itself is witty, sophisticated and hysterically stupid, while being fast, furious and fun as well. The humour is hilarious to the point of sides splitting, from the mocking of the fashion and musical style of the Swinging Sixties period, to countless references to 007, Matt Helm and Our Man Flint. And Austin's catchphrases?... groovy! The film looks amazing, with bright colourful sets and great costumes, and the soundtrack is funky. Then we have Mike Myers brilliant as Austin Powers(better than he was in Cat in the Hat anyway, the less said about that travesty the better), and hysterically over-the-top as the arch-nemesis Dr Evil, and Elizabeth Hurley fabulously sexy as Vanessa Kensington. Overall, wonderful film, better than I thought it would be. Shagadelic, baby! 9/10 Bethany Cox"
    },
    {
      "rating": "6",
      "text": "While Austin Powers and Dr. Evil are great characters, and the idea for the movie is brilliant, it isn't properly executed, I find, and shoves too much sex jokes and sex scenes in your face, and the story isn't always even. Mike Myers is great, as I said above, but over all, this isn't one of his best."
    },
    {
      "rating": "9",
      "text": "When you stumble across a comedy so full of unique humour, the story needn't have to make sense, which makes Austin Powers a perfect concoction of laughter"
    },
    {
      "rating": "9",
      "text": "Austin Powers is just simply a fun movie that will make you smile for its entire runtime and will not let you go. Myers is the man here, with his off-kilter Jim Carey persona and his cheesy catchphrases, and he really plays the character well here."
    },
    {
      "rating": "10",
      "text": "If Austin Powers contains your sort of humour, which it does in my case, this is the most fun you'll ever have with any movie. Must-watch for everybody who loves comedy."
    },
    {
      "rating": "10",
      "text": "Very funny. Almost had me in tears. Myers is superb."
    },
    {
      "rating": "6",
      "text": "The sexual jokes in \"Austin Powers: International Man of Mystery\" will provide you a new eyesight of comedy...the naked way. However, that's the only bland jokes the movie pertains to have."
    },
    {
      "rating": "8",
      "text": "With great performances by Mike Myers and a lot of funny moments, this is a great comedy. It does have a few moments where it doesn't make sense though."
    },
    {
      "rating": "7",
      "text": "It was rather corny at times but it was a good parody and Mike Myers played his role perfectly. It was quite hilarious as well and well worth the watch."
    },
    {
      "rating": "8",
      "text": "i remember seeing this with a bunch of friends and us all having a good laugh at its redicualasness . myers spoof of the bond franchise was well done especialy his dr evil charicter who is the one who really steels the movie . i wached it not long ago again after along time having not seen it and it doesnt feel like it held up well but im giving this review as to how i felt when i first saw it."
    },
    {
      "rating": "8",
      "text": "A send up of the spy movie genre with an exaggerated sense of humor. Mike Myers brings the whole thing to life. Not only did he write the movie, but he stars as both the hero and the villain of it. It's his performances and passion for the project that brings the whole thing to life and makes it very funny.\r Plenty of inside references and clever nods to the spy movies it so lovingly pokes fun at are found throughout. There are also plenty of visual cues and insights towards what life was like in the 60's. Both are infused and used throughout. It gives the film a tone and sense of humor all it's own.\r It's a rather brief affair. It sticks around just long enough to get it's jokes out and it moves on. You might be left wanting more from the plot and more content overall, but it's hard to criticize it too much when it does what it set out to do this well. It's a very funny movie and one worth watching. Myers brings his spy movie vision to life with an over-the-top sense of humor and it's joy to watch thanks to the almost constant stream of jokes in throws at you."
    },
    {
      "rating": "6",
      "text": "Not nearly as funny as the trailers made it out to be. There's good material here don't get me wrong i just feel that Mike Myers' characters stretch thin in a full movie format, maybe in an 5 minute SNL skit these characters would materialize better."
    },
    {
      "rating": "8",
      "text": "Alotta **** Need I say more? The first film in the Austin Powers series, \"Austin Powers: International Man of Mystery\" sets the tone in a amusingly camp and whimsical way for the preceding sequels. Mike Myers does what Eddie Murphy largely failed to do in \"The Nutty Professor\" or \"Norbit\" - that being portraying multiple characters who both DON'T outshine the other and provide equal amount of laughs. Although there are a lot of references to 1960 spy flicks (namely the Bond pictures) anybody who enjoys a good comedy will adore this movie."
    },
    {
      "rating": "2",
      "text": "Too few chuckles to make up for the mess of a movie. Mike Myers clearly finds himself much funnier than he actually is--I don't care how many different roles he can commit to."
    },
    {
      "rating": "8",
      "text": "Austin Powers: International Man of Mystery is an extremely funny movie. The plot is good, and Mike Myers does a great job playing both Austin and Dr. Evil. You laugh so much during the movie. My favorite parts were the elevator/stair scene and Allota  Also, when Austin is escaping the water and just stands there making jokes about the guard. This movie is a MUST see!"
    },
    {
      "rating": "7",
      "text": "An icon of spoof comedy, \"Austin Powers: International Man of Mystery\" kicked off the series in entertaining fashion. Mike Myers is electric as both Austin and Dr. Evil, the film is well-written and there are plenty of humorous moments, It's not perfect, but it's certainly a fun time overall."
    },
    {
      "rating": "8",
      "text": "Mike Myers as the Groovy Austin Powers is a riot. This spoof of spy movies is certainly a relief. You see so many spy movies these days, some are almost a repeat of the same stuff. So when you see A spoof of movies that so many make, you can only kick back, relax and enjoy."
    },
    {
      "rating": "8",
      "text": "I'm finding that the users rating is much closer to being accurate than the critics ratings. This movie was funny. The scene with Tom Arnold in the bathroom is classic comedy. I laughed so hard I cried."
    },
    {
      "rating": "10",
      "text": "Overall this film is a must-see spoof that will cause you to laugh out loud and cringe at the same time. It represents the sixties culture and how much different events are nowadays in a fully satisfying way."
    },
    {
      "rating": "8",
      "text": "Non stop laughs. And a slap at James Bond movies of the old days. Some things go a little crude and over the top, though."
    },
    {
      "rating": "9",
      "text": "Following the escape of Dr Evil, Austin Powers is cryogenically frozen in the 60's. When Dr Evil returns 30 years later Powers is thawed back into action to once again foil his nemeses plan to take over the world. Spoofing almost every spy film ever made Austin Powers International Man of Mystery is one of those rare movies that is actually laugh out loud funny. Much of the humour comes from Austin’s total failure to adapt to his 90’s surroundings but, as with the sequel, it is really Dr Evil who steals the show with some fantastic one liners that are still quoted two decades later.A true comedy classic."
    },
    {
      "rating": "6",
      "text": "While it didn't age all that well, \"Austin Powers: International Man of Mystery\" still manages to hold it's own in the world of satires. With decent jokes and likable characters, it's never boring and should probably entertain you for the entirety of it's running time."
    },
    {
      "rating": "8",
      "text": "To be fair the enjoyment fully depends if you like this kind of humor. It can cover the full range from 1/10 to 10/10 but I will say it is to carefully made to be rated lower than a 4/10 even if you dislike the humor. It is a parody of James Bond and Mike Myers humor unleashed. It delivers for me with the humor. It has all sorts from clever jokes, satire, toilet humor up to some really dirty jokes. Most of the jokes work but there are some awkward once too. Would say 80% work and 20% fail for me if I had to do the numbers. The story starts in the swinging sixties.  The world class spy (and style icon;-) Austin Powers foils an assassination attempt by his evil antagonist Dr. Evil who then escapes to space and freezes himself. Austin Powers has no other choice as to be placed also in cryostasis and wait for the return of his nemesis. 30 years later their duel continues. Like I already said it is a parody of all James Bond tropes and cliches. It archives to be respectful to the sources but also not holding back on the humor side. I repeat Mike Myers humor here is not everyone's taste but he convinced many people with this movie. The acting is great for this sort of movie. Lets start with Mike Myers (actually Michael John Myers) in his role as Austin (Danger;-) Powers and Dr. Evil. You fully feel the fun and enjoyment he had and this make the movie really good. It helps that he was also the writer and one of the producers so he can fully develop his ideas. Elizabeth Hurley as Vanessa Kensington does a remarkable job. She is such a good alternative or parody to the Bond girls. For the rest I liked Seth Green as Scott Evil, Robert Wagner as Number 2 (Has he a real name in the franchise?) and of cause Mindy Lee Stirling as Mrs Farbissina who steals the show with her performance. Special praise to Will Ferell as Mustafa for his awesome scene (You will know which I mean). Visually the movie fully delivers.  The wanted a specific style and got it right. The soundtrack is great but not my cup of tea so I will exclude it from my rating. On the negative side I already said that 20% of the jokes dont work for me and the start of the movie is a bit slow. Other than that I think there are no memorable missteps. Overall this is a great parody for James Bond movies. It is entertaining enough that I recommend it if you like this kind of humor."
    },
    {
      "rating": "8",
      "text": "A clever, funny parody of James Bond films. Mike Myers was hilarious as both Austin and Dr. Evil and truly stole the show. The movie is full of quoteable lines (for example, \"I'm going to place them in an easily escapable situation involving an overly complicated and exotic death\" and of course, \"I shall hold the world hostage for... One MILLION dollars!\") and cleverly pokes fun at various spy movie clichés. Austin Powers himself is a funny character and a clever joke on how out of place James Bond feels in modern day. If you like James Bond and you like spoofs, I'd recommend this, baby!"
    },
    {
      "rating": "8",
      "text": "it's a great movie. Dr evil is funny and almost every seen has it's own use in the movie. It certainly is a international movie in history.hahahahahahaha."
    },
    {
      "rating": "8",
      "text": "The point is... Mike Myers is known for movies like the Austin Powers franchise and the Shrek franchise. Other stuff like the Cat in the Hat is not worth bringing in to. To spoof movies the good way, bring Austin Powers in it."
    },
    {
      "rating": "0",
      "text": "Ce pastiche et cette caricature des premiers James Bond est affligeante de débilité : il s'agit d'un mélange foireux de mauvais goût à tous les étages et d'un humour trizomongolo très bas de gamme à faire mourir de honte Vidéogag.Le Mike Myers est \"à l'aise\" dans cet exercice de stupidité très con-centrée (il a trouvé sa \"vocation\"...), à force de grimaces et gloussements et de tenues plus consternantes les unes que les autres. La pauvre Elizabeth Hurley se fourvoit dans un rôle (?) aussi vulgaire que dégradant, tout comme l'ensemble de cette monumentale mongolerie pour bobos mongolos désespérément inqualifiable. Et c'est vrai que les adjectifs véritablement adaptés manquent pour qualifier ce qui ne peut l'être...Aussi ne nous attarderons-nous pas plus longtemps sur ce film d'attardés complètement bidon et insignifiant : le simple fait d'en faire mention est assez salissant comme ça."
    },
    {
      "rating": "6",
      "text": "This is a messy movie with useless scenes that got me laughing with the weird humor and situations. But i feel like the movie fell a little bit short. Dr Evil and Austin Powers will go down in history as iconic characters, i'm sure. But there are a lot of scenes where nothing happens, only the stupid funny humor and the misplaced sex jokes. This film could be a lot better. It didn't exceed to my expactations."
    },
    {
      "rating": "9",
      "text": "The rocket ship Dr. Evil uses is based on the actual figure that was mounted on the roof of a Big Boy restaurant in Scarborough, Ontario, Canada, a suburb of Toronto where Mike Myers grew up. The restaurant is also referred to by Clint Howard as the Radar Operator."
    },
    {
      "rating": "6",
      "text": "I know this is a very popular movie. It's just a little to weird of a comedy for my liking."
    },
    {
      "rating": "7",
      "text": "A little rushed in parts but good character development and story progression I enjoyed it."
    },
    {
      "rating": "6",
      "text": "A wacky James Bond-style adventure in colour. It's bad, but it's bad on purpose. Horrible jokes, terrible plot, but since that's the point it's good. Excellently bad."
    },
    {
      "rating": "7",
      "text": "----------------------------------6.8/10-----------------------------------"
    },
    {
      "rating": "10",
      "text": "One of the best parody movies ever definitely the peak of Mike Myers career."
    }
  ],
  "recommendations": [
    "austin_powers_the_spy_who_shagged_me",
    "ace_ventura_when_nature_calls",
    "hot_shots_part_deux",
    "paul",
    "austin_powers_in_goldmember",
    "johnny_english_strikes_again",
    "dodgeball_a_true_underdog_story",
    "men_in_black",
    "mars_attacks",
    "pineapple_express",
    "due_date",
    "deadpool_2",
    "spy",
    "police_academy",
    "bean",
    "ted_2",
    "friday",
    "scary_movie_3",
    "step_brothers",
    "madagascar_escape_2_africa",
    "deadpool",
    "neighbors",
    "monty_python_and_the_holy_grail",
    "masterminds",
    "evolution"
  ]
}