{"id": 2147, "title": "Austin Powers in Goldmember", "starring": ["Mike Myers", "Beyoncé"], "runtime": 93, "genre": ["Comedy", "Crime", "Science Fiction"], "description": "The world's most shagadelic spy continues his fight against Dr. Evil. This time, the diabolical doctor and his clone, Mini-Me, team up with a new foe—'70s kingpin Goldmember. While pursuing the team of villains to stop them from world domination, Austin gets help from his dad and an old girlfriend.", "releaseYear": "2002", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/aSNnxSNc7HftXa6EULM4Lq6mUDn.jpg", "categories": {"plot": 8.0, "acting": 7.2, "ending": 9.75, "soundtrack": 7.0, "cinematography": 5.0, "familyFriendly": 4.0, "funny": 6.666666666666667, "action": 7.5}, "reviews": [{"rating": "9", "text": "This movie was HILARIOUS!!!!! My family and I enjoyed it very much! The storyline is great. The characters like Mini Me are funny. The humour put into this movie was SO FUNNY for the most part I just could NOT stop laughing, like the molly scene. That was my favourite scene in the movie. Hell, Tokyo even makes an appearence. I've lived there before btw. This movie is awesome and you should totally watch it!"}, {"rating": "9", "text": "Unconventionally silly, dazzlingly hilarious and packed to the brim with innuendo and a variety of jokes. Gold member is the best out of the trilogy and is one of the funniest movies of all time."}, {"rating": "10", "text": "Really great movie. I loved Fat B*****d, Mini Me played a great part when he moved to the good side, Beyonce and of course, Mike Myers. [***SPOILERS***] I loved the fight scene between Mini Me (who wanted to tell Austin he turned to the good side) and Austin! Really recommend this movie!"}, {"rating": "10", "text": "Austin Powers Goldmember  is one of the funniest f- - -ing movies of all time. And is  the best James Bond parody to date."}, {"rating": "10", "text": "This is the best Austin Powers yet. It grabs your attention because of not only the great performances, but also the random comedy. The ending may surprise you."}, {"rating": "7", "text": "Weakest of the three in my opinion, but 'Austin Powers in Goldmember' still has some memorable moments.I enjoyed the star-studded and cameo-filled opening scene, it's well done. Mike Myers is again great in his roles, especially Dr. Evil, and Beyoncé Knowles is a positive addition. The stuff with Dr. Evil isn't as good as in the 1999 film, yet he still made me laugh a few times; he does have one of the series' best moments with the rendition of the Jay-Z song.However, I did feel a few pacing issues. All in all, it's still worth a watch. As noted, the cameos are solid - and let's just say they chose the perfect actor to play Dr. Evil..."}, {"rating": "7", "text": "The third and so far last Austin Power movie. It was neither bad nor did it a poorly performance at the box office but the franchise is now in limbo with rumors that a fourth movie will be made popping up from time to time. I follows the standard formula of the franchise being a parody of James Bond movies with Mike Myers style of humor. For clarification: Mike Myers humor means that it fully depends on how much you like his style of humor. Can be a 1/0 or 10/10. This time we got more insights into the past of the characters, some Goldfinger references, another role for Mike Myers and overall a slightly weaker but still enjoyable movie. The story starts again with Austin Power trying to stop another scheme by Dr. Evil who has allied himself with the Dutch Johan van der Smut called Goldmember (There is a bizarre accident behind the name and lets say he “likes” gold even more than Goldfinger from James Bond). However this time his father who is also a world class spy named Nigel Powers gets involved. The story works for me but does not wow me enough. I think it is the weakest in the franchise but it is nowhere weak enough to being called garbage or bad. The humor works well enough to make this entertaining. By franchise standards it has all sorts from clever jokes, word puns, satire, toilet humor up to some really dirty jokes. Would say >75% work if I had to put numbers on it. Some jokes are not my cup of tea here. For the acting we get a solid performances and a lot of cameos by big names. Mike Myers expanded again with another role. He is Austin Powers, Dr. Evil, Fat Bastard (Yes that is his name) and Goldmember. Good performance as always but maybe not as refreshing or original anymore. Michael Caine plays Nigel Powers and does a great job.  Mini Me played by Verne Troyer is again a hidden gem of the movie. Beyonce Knowles does a good performance as Foxxy Cleopatra (Yes this is a jab to James Bond as was it in the prequels). The rest does a good performances and I point out that I liked the set up for a potential fourth movie they teased even if I believe it will ever been green-lighted. Then we have a lot of cameos with some of the big names from Hollywood with Tom Cruise, Steven Spielberg, Danny DeVito, Gwyneth Paltrow, the Osbourne family and Kevin Spacey to just name a few. The rest is the same as before like in the prequels for me. The visuals and effects are nice and the awesome soundtrack is not my cup of tea. Overall I say this is still entertaining but the weakest movie in the franchise. With this it enters the list of franchise without a truly weak entry."}, {"rating": "4", "text": "It's pointless to make such a inane sequel from a unorganized franchise. Yes, i'm talking about Austin Powers."}, {"rating": "10", "text": ",,,,,,,,,,,,,,,,,,,,,,,,....#$@%÷×+=^&*()€_/,.?!;:\"\"'●○☆⊙°•¤《》¡¿♧◇♡♤■□●○▪~|{}[]`````````````````````"}, {"rating": "5", "text": "alot of stars pop in to make cameos in this third installment along with alot of the old jokes from the last 2 films . im starting to feel like im waching airplane 2 now. theres still some funny moments in this film but recycling your jokes 3x in a row just isnt funny."}, {"rating": "10", "text": "This was Verne Troyer's second and final time playing Mini-Me. Troyer died in 2018 at age 49 when he succumbed to fatal alcohol poisoning."}, {"rating": "0", "text": "I liked the first one. Loved the second one, but this one? Not at all. I hated this one. I found it kind of gross. It did'nt have it's same humore. They could have done better, and like I said, it was really gross."}, {"rating": "0", "text": "Not as good as the other two, for sure. But that's expected. Automatic 0 for score balancing enforced. Please continue to the next user review."}, {"rating": "4", "text": "It was better then the previous film but still no where near as good as it once was. I didnt like Beyonce at all and the film was boring at times and felt too dragged on. A below average comedy that could have been a lot better."}, {"rating": "5", "text": "Of all possibilities, the Austin Powers franchise manages to redeem itself with its third installment. Goldmember is not only exciting but jokes actually hit. Not to mention a fun inclusion of Beyoncé."}, {"rating": "4", "text": "Right from the beginning, this movie will grab fans of the first two 'Austin Powers' movies.  However, there's a small matter of what follows after the cold opening.  And that's where this flick seems to fall apart.  Continuing the trend of sexual innuendo (funny during the first two, merely 'filler' in this one) and gross-out scenes (funny during the second movie, but again simply filler in this), this wanders aimlessly trying to make fun of \"Goldfinger\", which I'll admit would be difficult to do even with a decent plan.  I think therein lies the problem...\"Goldfinger\" itself was so over-the-top, it's hard for someone to satirize it to any satisfactory level.  I liked the first two movies, but this entry just left me wondering it Myers and company have finally jumped the sharks (yes...with laser beams on their heads)."}, {"rating": "6", "text": "What happens when the second film in your series outgrosses its predecessor in its opening weekend? Apparently, you run out of ideas and get a little money-hungry. \"Austin Powers in Goldmember\" has no problem recycling jokes from the previous films, but it's still a relatively entertaining film thanks largely to the many performances of Mike Myers. It's definitely a decent film, just don't set your expectations too high."}, {"rating": "7", "text": "Mike Myers reprising his role as Austin Powers now in a new era can be considered to have good laughs and reoccurring incidents that prove to be a significant improvement from the second."}, {"rating": "6", "text": "Well... there you have it, folks. The franchise has gone into a mixed situation. Don't destroy it with a rushed project otherwise the score will get worse. Take your time to make it and it'll be better."}, {"rating": "4", "text": "Could and should have been funnier although can be enjoyed on a good day in moderation."}, {"rating": "4", "text": "Way to ruin an epic franchise. The first two are my favourite comedies and defined my childhood. Mike Mysers has lost the plot, goes way too far and indulges in extreme overacting"}, {"rating": "9", "text": "⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$"}, {"rating": "10", "text": "¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡》》》》》》》》》》》》》》》》》》````````````````````````````¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤"}, {"rating": "8", "text": "Painfully and outrageously funny. Mini Me, Austin and Dr. Evil are the best characters already. Now, Number 3, Nigel Powers and Goldmember join the list. The starting sequence is the best."}, {"rating": "9", "text": "What a riot! just as good as ever before if not better (actually not as good as the second one) but this is hilarious Goldmember stealing the show with his whitty accent and disgusting habits...it's just a shame it looks like the end for them or is it? Scott is after Austin now."}, {"rating": "7", "text": "It's hard not to laugh at a lot of the material, it is so delightfully over the top, it's very entertaining and enjoyable. The appearance by major stars in cameo's is a great plus. Hilarious!"}, {"rating": "4", "text": "Flat out garbage of a movie. Pure waste of time. The only reason I rated it a 4 is because there were some funny parts. Overall bad movie though."}, {"rating": "8", "text": "----------------------------------7.6/10-----------------------------------"}, {"rating": "10", "text": "The perfect end to the perfect trilogy Austin Powers goldmember isn't as good as the last 2 but none the less is a comedic masterpiece like the last 2."}], "recommendations": ["austin_powers_the_spy_who_shagged_me", "the_longest_yard", "austin_powers_international_man_of_mystery", "grudge_match", "horrible_bosses_2", "spy", "deadpool_2", "scary_movie_3", "ace_ventura_when_nature_calls", "jumanji_the_next_level", "hot_shots_part_deux", "venom_let_there_be_carnage", "johnny_english_reborn", "the_pink_panther", "ghostbusters_ii", "22_jump_street", "little_fockers", "ride_along_2", "jumanji_welcome_to_the_jungle", "horrible_bosses", "thor_ragnarok", "ace_ventura_pet_detective", "pitch_perfect_2", "the_hangover_part_iii", "get_smart"]}