{
  "id": 2065,
  "title": "Austin Powers: The Spy Who Shagged Me",
  "starring": [
    "Mike Myers",
    "Heather Graham"
  ],
  "runtime": 95,
  "genre": [
    "Adventure",
    "Comedy",
    "Crime",
    "Science Fiction"
  ],
  "description": "When diabolical genius Dr. Evil travels back in time to steal superspy Austin Powers's ‘mojo,’ Austin must return to the swingin' '60s himself - with the help of American agent, Felicity Shagwell - to stop the dastardly plan. Once there, Austin faces off against Dr. Evil's army of minions to try to save the world in his own unbelievably groovy way.",
  "releaseYear": "1999",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/jiF7UShERJFn5RtgfBK2lIJrOTc.jpg",
  "categories": {
    "plot": 7.583333333333333,
    "acting": 7.4,
    "ending": 10.0,
    "soundtrack": 8.5,
    "cinematography": 5.0,
    "familyFriendly": 6.0,
    "funny": 7.37037037037037,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "10",
      "text": "this is a perfect sequel. 95% of the movie is really funny. And it is a great follow up, and a improvement.evan though it dose tend to make a lot the original movie useless."
    },
    {
      "rating": "10",
      "text": "If you are looking for the best workbench, then this model should be number one to consider. It comes with a solid wooden surface and specially-designed  steel what is the best work bench body that is able to withstand high loads. Another important feature of this model is its pegboard with a hook set for 23 items. On a shelf at the top, you will be able to place and hand all the devices and tools for easy and quick access."
    },
    {
      "rating": "10",
      "text": "Extra scenes There are extra scenes in the movie in the credits: 1. It shows Scott Evil meeting his real mom on Jerry Springer who turns out to be Frau (?). She explains that the test tube baby story of his birth was a lie and he is the love child of her and Dr. Evil. It shows another scene of '1 Month Later' You hear Felicity Shagwell shrieking from having sex when Austin walks in on her and another man. It is revealed that the other man is Austin from the past! Past Austin explains its technically not cheating. At the very end of the movie after all the credits are done it shows a scene with Mustaffa (his voice) in the scene where he fell off into a canyon. He begs for someone to call an ambulance and unsuccessfully tries to stand up on a splint he made. See more »"
    },
    {
      "rating": "9",
      "text": "Having had his plans thwarted by Austin Powers in the original movie Dr Evil travels back in time to 1969 and steals Austins mojo, apparently the source of all his power. With Austin incapacitated he again devises a plot to hold the entire planet to ransom. As a result Austin must also travel back in time to recover his mojo and, alongside hot sidekick Felicity Shagwell, again put a stop to Dr Evils plans.It is always difficult to make a comedy sequel but, despite obviously now lacking some of the originality, The Spy Who is just as good as the first movie. The star of the show is again Dr Evil who alongside, tiny sidekick Mini-Me provides the majority of the funniest moments, with the appearance on Jerry Springer being a particular highlight. Spoofing all manner of movies as well as providing some clever in jokes The Spy Who is another hilarious ride."
    },
    {
      "rating": "10",
      "text": "In the U.S., \"shag\" is far less offensive than in other English-speaking countries. Singapore briefly forced a title change to \"The Spy Who Shioked Me\" (\"Shioked\" means \"treated nicely\")."
    },
    {
      "rating": "8",
      "text": "This Austin Powers sequel is better than the original because of the new characters Fat Bastard and Mini-me. They make this Austin Powers film feel like a breath of fresh air."
    },
    {
      "rating": "10",
      "text": ".......::::::::::::::::::::,,,,,,,,,,,#$#$#$#$#$$##$$$$**********●■●■●■♤♡°°°°°°•••••••••••°°°°°▪▪▪▪¡¡¡¡¡¡"
    },
    {
      "rating": "9",
      "text": "like the first movie, its also hilarious"
    },
    {
      "rating": "8",
      "text": "Very funny and a good movie to watch with friends on a goofy night.  It is the type of movie that you can watch and laugh, talk to your friends, get something to eat and not miss a beat because it is pretty much a formula spy movie with laughs throughout."
    },
    {
      "rating": "6",
      "text": "I like how Michael Myers happily performs with great enthusiasm, but \"Austin Powers: The Spy who Shagged Me\" is a over-the-boundaries-of-the-definition-happy movie with too much penis jokes."
    },
    {
      "rating": "2",
      "text": "It proves how fast you can kill a series when the sequel is nothing compared to the first film. Its pretty trashy if you ask me. The jokes are not that funny, The plot was incredibly stupid, the acting is average at best. Its just one piece of trash after another. I was a fan of the first film but my god did this suck."
    },
    {
      "rating": "7",
      "text": "a pretty decent sequel to the first film with some good laughs . i loved the jerry springer opening . but myers seems to be recycling jokes from the first film which i feel is a major no no. try to be abit more original . yet again though myers dr. evil charicter steels the whole movie."
    },
    {
      "rating": "2",
      "text": "Enthusiastic as ever; however, I'm still not impressed or convinced by Mike Myers' Austin Powers or his Dr. Evil. More laughs than the first installment, but it's not enough."
    },
    {
      "rating": "8",
      "text": "\"Austin Power: The Spy Who Shagged Me\" is even more electric than the first film. It's funnier, it's still well-acted, and it's got a pretty solid story to it. All told, \"Austin Powers: The Spy Who Shagged Me\" is still the best film in the series and it's well worth watching."
    },
    {
      "rating": "5",
      "text": "Where in this movie I certainly enjoyed a duet with a psychopath and his evil clone, I believe the second film to be the most dull out of the series. The plot is good, as well as the acting but the story line eventually begins to bore and feel repeated as the film progresses."
    },
    {
      "rating": "8",
      "text": "The plot once again is daft and while Heather Graham is really pretty she isn't quite in the same league as Elizabeth Hurley. That said, it is a fun, witty and sophisticated \"shagadelic\" sequel, that is literally like a lava-lamp lampoon that is stupid and as sophisticated as the first film. It isn't as good as a film to the first, but I think where it is improved from its predecessor is that it is more relaxed in style. Once again, the sets and costumes are gorgeous to look at, the soundtrack is funky and takes you back to the period and there are many moments of sparkling wit in the script. The film also moves quickly while being more relaxed at the same time. The performances from Mike Myers, Michael York and Rob Lowe are top notch too. Overall, a tad inferior, but a fun sequel nonetheless. 8/10 Bethany Cox"
    },
    {
      "rating": "7",
      "text": "The last half hour or so is a bit scattershot, but this sequel still contains enough laughs to recommend. It's true that less sex jokes could be appreciated (and more focus on other James Bond tropes worth making fun of) but Mike Myers' work is so inspired, it's hard to complain (particularly as Dr. Evil). Some of the jokes don't really work, but the ones that do land are often hilarious. If you aren't bothered by occasionally juvenile humour, then I'd recommend checking this one out. Overall, a fun parody with enough laughs to power last its weaker moments."
    },
    {
      "rating": "7",
      "text": "Spoofs, spoofs, and more spoofs. Where did they all come from? Unfortunately, this franchise is getting weaker every time a new installment comes... but this one manages to hold it just for a while."
    },
    {
      "rating": "7",
      "text": "----------------------------------7.4/10-----------------------------------"
    },
    {
      "rating": "7",
      "text": "Entertaining and funny but has less laughs than its predecessor."
    },
    {
      "rating": "8",
      "text": "There are great jokes aplenty in this, I reckon, funniest of the current Austin Powers trilogy (will there be a fourth?). This film falls into my list of Top 5 comedy films- a testament to it"
    },
    {
      "rating": "7",
      "text": "Like the first, a good laugh, but less satisfying in this installment."
    },
    {
      "rating": "9",
      "text": "The second Austin Powers movie. Like for the prequel it depends on how much you enjoy this kind of humor and a 1/10 is as much valid as a 10/10 with this in mind.  I will however say it is to carefully made to be rated lower than a 4/10 even if you dislike the humor. It is a parody of James Bond movies in Mike Myers style. The story starts very shortly after the events of the prequel with a strange revelation I wont spoil (They at least explain what happened to the “Bond Girl” or should I say Austin Girl from the last movie;-). Shortly after Austin recognized that his Mojo has been stolen (His power-source for his attractiveness, confidence and prowess). It seems clear that only his archenemy Dr. Evil can be the mastermind behind it and so starts his amusing quest to get his Mojo back. Again the humor is the greatest strength of the movie. It has all sorts from clever jokes, word puns, satire, toilet humor up to some really dirty jokes. Most jokes work well for me and it surpasses the prequel in this regard for me. Would say >90% work if I had to put numbers on it and I don't remember a spectacular misfire. The new characters work well with the excellent Mini Me, Fat Bastard (yes that is his name) and Felicity. I say they improved and developed the humor. The acting is really solid for this kind of movie. Lets start with Mike Myers as Austin Powers, Dr. Evil and Fat Bastard (I was not joking about the name). He fully delivers and the roles are made for him (He is also co-writer and co-producer).  You can see the enjoyment and fun he had and this improves the movie. I already praised Verne Troyer as Mini Me as he is a character I enjoyed. Heather Graham as Felicity is a good addition to the movie and I like how they play with the tropes with her character (I don't use her last name for obvious reasons. Just look it up if you are interested;-). For the rest of the cast I again praise Mindy Sterling as Frau Farbissina, Seth Green as Scott Evil and Robert Wagner as Number 2 (Still forgot if they named him in the franchise). Visually and special effects like the movie does a solid performance even if they did not need to. The soundtrack is really awesome with R.E.M, The Who, Madonna, Green Day and Lenny Kravitz songs. It is not entirely my cup of tea but without doubt a strong composition. Overall this is my favorite movie in the franchise and worth watching for its entertaining humor. As already mentioned the style of humor is not for everybody and I can fully understand if you dislike this movie."
    },
    {
      "rating": "8",
      "text": "In my opinion this is the only good one out of the entire series. I was cracking up throughout the whole movie. The other 2 sucked compared to this one."
    },
    {
      "rating": "5",
      "text": "Ok in parts and in others just feels rushed but the comedy is funny that's the main thing."
    },
    {
      "rating": "10",
      "text": ":;:;:;:;:;:;:;:;:;:;;:;:;::;:!:;;:;;;:::::;;;;:;:;:;:;:;:,,,,,,,,,,,,,,,,,,,,,,"
    },
    {
      "rating": "10",
      "text": "⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$"
    },
    {
      "rating": "9",
      "text": "$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.》■》■》■》■》■》■》■》■》■》■》■》■》■》■》■》■"
    },
    {
      "rating": "9",
      "text": "⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙●■●■●■●■●■●■●÷%÷%÷%÷%÷%÷%÷%÷%÷%÷%÷%÷%÷%÷%÷%÷$$$$$$$$$$$$$$$$$$$"
    },
    {
      "rating": "10",
      "text": "Austin Powers 2 is my personal favorite Austin Powers movie and it is filled with non stop laughs."
    }
  ],
  "recommendations": [
    "austin_powers_in_goldmember",
    "austin_powers_international_man_of_mystery",
    "paul",
    "ghostbusters_ii",
    "deadpool_2",
    "penguins_of_madagascar",
    "johnny_english_strikes_again",
    "thor_ragnarok",
    "jumanji_the_next_level",
    "madagascar_escape_2_africa",
    "despicable_me_2",
    "horrible_bosses_2",
    "night_at_the_museum_battle_of_the_smithsonian",
    "scary_movie_3",
    "johnny_english_reborn",
    "ted_2",
    "minions",
    "ace_ventura_when_nature_calls",
    "the_hangover_part_iii",
    "robots",
    "megamind",
    "zombieland_double_tap",
    "jumanji_welcome_to_the_jungle",
    "22_jump_street",
    "deadpool"
  ]
}