{
  "id": 38,
  "title": "Avatar",
  "starring": [
    "Sam Worthington",
    "Zoe Saldaña"
  ],
  "runtime": 162,
  "genre": [
    "Action",
    "Adventure",
    "Fantasy",
    "Science Fiction"
  ],
  "description": "In the 22nd century, a paraplegic Marine is dispatched to the moon Pandora on a unique mission, but becomes torn between following orders and protecting an alien civilization.",
  "releaseYear": "2009",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/jRXYjXNq0Cs2TcJjLkki24MLp7u.jpg",
  "categories": {
    "plot": 7.23404255319149,
    "acting": 7.285714285714286,
    "ending": 8.333333333333334,
    "soundtrack": 7.5,
    "cinematography": 7.8,
    "familyFriendly": 6.0,
    "funny": 10.0,
    "action": 9.9
  },
  "reviews": [
    {
      "rating": "8",
      "text": "Despite \"Avatar\"'s heavy plot, Blockbuster king James Cameron impresses us with fantastic visuals and CGI of the Na'vi and human battle scenes in (Le Gasp!) 3D."
    },
    {
      "rating": "5",
      "text": "Graphics phenomenal but story sucked. Unubtainium, really? They couldn't have come up with anything better."
    },
    {
      "rating": "2",
      "text": "Absurdely overrated. cgi masturbation with a lackluster plot and ridiculous neo-hippie fairy-tale."
    },
    {
      "rating": "3",
      "text": "Great visuals and effects, but thats simply all that Avatar has to offer. No story, viciously bad overacting and dialogue older than Sigourney Weaver herself. Very boring and far too long."
    },
    {
      "rating": "3",
      "text": "Eh, yeah its all 3D, yeah its got allot of special effects and costs allot, yeah its got blue alien boobs, but other than that there is nothing here. Terrible cliche, hole-filled plot leaves you bored. Its kind of amazing how you can have such a crappy plot and waste 4 hours on it. After you watch it you think its good at first, but that is just an effect from the CGI and 3D. Soon you will realize how lame it is. \"the Eywa sees you!\" ugg soooo cheesy."
    },
    {
      "rating": "3",
      "text": "I legitimately have no idea how this film has been getting so many positive reviews. Someone once said great films were a combination of technical innovation and artistic achievement. While Avatar certainly nails the technical side, it's artistic half leaves a lot to be desired.A by-the-numbers cookie-cutter plot with poor writing and awful dialogue."
    },
    {
      "rating": "10",
      "text": "Literally the best movie I have ever seen. I was completely and totally blown away. This is the first movie in my entire life where I didn't want it to end."
    },
    {
      "rating": "7",
      "text": "Avatar!! A game? No. When people hear the word avatar, most would think of a game character but in this case, it brings a new meaning to the word avatar, literally. James Cameron not only the writer but also the director of the movie “Avatar” (2009) has brought everyone’s dreams into reality by utilising the modern art of visual cinematography and 3-D imaging to blur the lines of virtual reality, making it more realistic. Cameron has also utilised certain star actors such as Sigourney Weaver and Sam Worthington who have won multiple awards in the past to play crucial roles in his film.The movie being in the category of fantasy/science fiction, it begins in the future or more precise, year 2154 and one the many themes of the movie is protecting the environment.Involving the military, they set off on a mission to collect, colonise and learn from the new planet, Pandora. Their main task for this operation is to collect a rich mineral that Earth desperately needs more of and they recently found that there was an abundant amount under their village.Unobtanium, the mineral, they need to save their energy crisis or to put it bluntly, to survive and is what keeps the project running. Those who went had to be in cyrosleep as Pandora, the new planet is 4.4 light-years away from Earth. The movie is both a show and tell with its incredible graphics of a new world, its nature and of course the natives, the Na’vi, blue people who stand at 10 feet tall and its story plot of the mission to collect the resources and a turn of events after the main protagonist learns about what was going to happen if the mission proceeds.I like how the actors played their parts well, and not just with their words but with actions as well. Some actors in movies struggle and get nervous and would cause themselves to not sound or seem natural. Zoe Saldana who played Neytiri, the Na’vi princess, was perfect for playing the role in this film as she could not only play the part but was actually able to get into character for this film. For example, she manages to accept a different accent to mimic being a native Na’vi.The computer-generated imagery also known as CGI, can only capture the movement and facial expressions in animated forms, but it is the actors job to give life to their characters. The director, not only did he capture the motion, but also the intent of the actors to make his characters even more realistic.There are of course strengths and faults in this movie just like any other. One of the biggest faults in this movie is that the transitions from one angle to another is a little off but hard to notice. For example, a different hand positioning from a camera angle to another and mild nudity of the natives as another fault. The strength of this film is that it follows its theme and executes it as the film goes towards the end, they of course follow up and was able to save the environment from the destruction.Overall, I think the movie ”Avatar” is a great film. It being rated as PG-13 is at minimal as the faults of those who are younger would have to watch the violence and mild nudity. I personally enjoyed the film and it left me in amazed and if you haven’t seen it yet, then I suggest you go see it now. It would not only leave you at the edge of your seats but also keep your blood pumping . 7½ out of 10"
    },
    {
      "rating": "9",
      "text": "I watched ''Avatar'' first time when it released in cinemas in 2009 and yesterday I watched it again, actually I found a lot of deference, at first time I just found it as a normal movie (TV movie) with some visual effect, but now when I watched it again I found it purely a masterpiece.I saw some negative reviews and most of them wrote ''same cliché'', really guys?! What do you want more than that?! Every part in the movie is perfect starting from plot to visual effects until the performance.If I want to talk about visual effects I couldn't stop, the designers of ''moon Pandora'' they couldn't design better than this, it seems so realistic and breathtaking, beside Pandora's animals, plants, trees and people, everything perfect.I like the plot also, it's showing how the humans are savages, unlike others aliens movies that show the aliens are the enemy and the humans are innocents, the story is really reflecting our lives, we already ruined our earth by wars, killing animals and cutting trees, and it will be same if we control another planet.''Avatar'' is one of the greatest movie in the history of cinema, and I would like to thank the genius director and writer ''James Cameron'' and the whole cast for this masterpiece, and I hope \"Avatar 2, 3 & 4'' will be as same as this."
    },
    {
      "rating": "7",
      "text": "There's a certain something to be said about the power of a visually strong movie like Avatar. It's kinda like a sleazy, but charismatic sales person. You like the person while your in his office, cause he just reeks of charm (or cigarettes) and you buy in to his pitch, cause he's good at what he does, but when you leave the store, you find that you really didn't like the product that much after all. That's kinda how I feel about Avatar. The movie's visuals are amazing and I would say that nothing will be defeating it anytime soon as far as that goes. But when you brush away all that, what you're left with isn't necessarily a bad movie, but an average to ok one. I say this because most of the time I spent watching it was marveling at the amazing visuals that Cameron's team presented us. That part I can't heap enough praise on, but other than that, the story of the movie pretty much comes across as a straight up black and white morality play. I can understand the \"it's just a movie\" that people may say to that kind of suggestion, but where it doesn't hold up is when you try to pass the movie off as a political/social statement about our society. Nothing in reality is ever black and white, and to do so discredits a lot of what makes us a very complicated, arrogant, and interesting species. Aside from it's horrid attempts to justify why our material world is wrong, the story presents the humans as evil, greedy, and violent; but the Na'vi are peaceful, harmonious, and coexist with nature. Of course the main character ends up going native, finds he likes the tribe more, and then sides with them in the upcoming inevitable bloodbath, and the usual sequence of most big budget movies plays out with no originality whatsoever. Still the movie does entertain, even though it provides a mixed message, and there are some very interesting moments. The real credit to Avatar is the level of thought put into the actual world itself, and here the production/design team did a remarkable job in making Pandora a reality. To me it's a shame that they went for a more simplified story of good and evil as opposed to something more complex and real, but I guess that was never their intention in the first place. It probably wouldn't have been as successful in the theatres if it was. A simple message doesn't mean a bad one, but in this case it was more of a typical one."
    },
    {
      "rating": "7",
      "text": "A film which certainly relies too much on its special effects. Peel back the visuals and you get a weedy storyline, ending in a an overextended battle. Having said this, I love the feeling of old against new traditions and the Avatar World is incredibly creative and involving. The music is also very magical."
    },
    {
      "rating": "5",
      "text": "You know how some movies and series are all story and no special effects, and they are still awesome, like Dr Who, and Red Dwarf, and animation. Well, Avatar is the exact opposite. A tech demo of what budget can do in this day and age, but that is it.\r Lame recycled story, copied scenes, it's like someone cut some scenes from other movies and re-animated them on a PC with blue people.\r The only redeeming quality of the story, frankly, is the fact that the humans are somewhat accurately portrayed. Villains, but not idiotic unexplained villainy, but a nice blend of excusable and inexcusable.\r This is a movie that is seen, not understood. Eye candy, and not a very good one at that. The people are blends of 2 Earth animals, the animals are blends of 2 Earth animals, basically, it's just a jungle people story with cream on top.\r Under no circumstances is this movie a high scorer. Tech demo, 10. Movie, 5 because of the experience. Seriously, if seeing a movie on a small 2D screen makes it sucky, then it was sucky to begin with."
    },
    {
      "rating": "10",
      "text": "Wow, what a movie.  Maybe it is just all of the subpar Netflix movies I have been watching recently, but  “Avatar” has aged exceptionally well in the 11 years since its release.  The battle sequence actually has emotional resonance.  I have seen so much war in Star Wars, Lord of the Rings, and Marvel movies, but I never cared about any of them.  Cameron got me invested in a way none of the others could.  If you can enjoy a roller coaster movie, you should love this one, especially if you have a solid theater system.  If you can find a way to watch this as it was intended, in 3D, by all means do it, but even in old fashioned 2D, it was amazing.I don't know what percentage of the Neytiri character is Zoe Saldana vs. the animators, but somebody deserves an award for that role. There is a deep passion expressed by her that is very rarely captured on film.  I give it an A, make a point to go see this movie."
    },
    {
      "rating": "8",
      "text": "Una muy buena peli que ya perdi el conteo de las veces que la vi, fresca y con efectos alucinantes."
    },
    {
      "rating": "9",
      "text": "I love this movie. It is a movie in 2154. But I learn we need to protect our environment. The planet is beautiful. But greedy humans try to make profits and destroy Navi's. Preserve our nature!"
    },
    {
      "rating": "9",
      "text": "This is not the best movie ever made, but by far one of the most influential ones. I Really liked the \"extended version\" actually. It has more \"world-building\" into it. Story is good, I really have not much bad to say. It is  a weird movie but looking back it was ahead of it's time and now can be understood easier. When it came out, it was overrated. But... people still talk about it today, so there must be a reason, reasons!It was the best looking CGI movie when it came out.Sure, movie has tons of problems that I would say are \"cringy\", but have you seen the documentary about it? The impact of this movie still can be seen today. I actually don't remember any movie like this, this is completely original movie, without \"MCU-like\" setups or part of already set \"universe\" like James Bond for example. This was the most expensive movie ever made and most successful movie of all time (until Endgame).And it did not even have that expensive cast like, Endgame.It has enough interesting things inside than any blockbuster movie.This is cyberpunk, fantasy, Jurrasic-park-ish and space movie at the same time. Dialogue is good, not boring, pacing is great, not boring.The characters are really well made. This is one of the few movies that deserve the word: EPIC"
    },
    {
      "rating": "9",
      "text": "Your Time Is Running Out AvatarIn a few weeks, Avatar will likley no longer be the all time Box Office champion, But 10 years later it remains one of the best visual experiences out there."
    },
    {
      "rating": "8",
      "text": "I confess that this film never really caught my eye until I read about it. I still remember when it was in theaters more than ten years ago. More recently, I decided to see it. The film was a success, as we all know, and I find it surprising that I didn't have the right to any sequels.The script takes place in a distant future, when humans have ruined the Earth but are colonizing and exploring other planets like Pandora, where Jake Sully, a veteran of the Marines, is going after being recruited by a scientific program. Pandora has a rare and valuable ore that humans want, but it also allows the planet to have an exuberant and unusual biological life. It happens to be inhabited by natives called Naavi (who look like huge blue humans with a long tail), and they are determined to protect their world from the greed of the Terran's. Sully joins the Avatar Program, which allows him to remotely control the body of a Naavi. If the program allows humans to live and learn from them (as its director, scientist Dr. Grace, wants), it also turns them into Trojan horses (as Colonel Miles, commander of the military forces in Pandora, wishes). This will put Sully in a conflict of loyalties while allowing him to see how the natives are connected to their world and are inseparable from it.The plot raises a number of pertinent questions. We can, for example, reflect on the way we have lived and managed our planet, on the superiority with which we see who is different from us, on how we despise the environment or deliberately harm it by greed, on our passion for war instead of peaceful conflict resolution or even about how technological and medical advances do not reach everyone and are put at the service of some wealthy people instead of being available to all. It is a script that makes you think and could be seen in many ways. Unfortunately, the story built on these premises is not so good. There is good material and the way Sully is divided in his loyalty as he lives with the natives is the backbone of the whole thing, but everything else is quite predictable and one-dimensional, and sometimes it sounds bad: humans are treated in a simplistic way and turned into despicable creatures, while the Naavi are idealized to the fullest. The old story of \"good guys and bad guys\".Sam Worthington shows all his talent in a demanding and likeable character. He plays well with Zoe Saldaña, his alien romantic couple. The actress is excellent and was having a good time in her career then. I also liked the work of Sigourney Weaver, in the role of a strong, bossy and grumpy scientist, who is guided by her ideals even if it means facing the military. But the best of the cast ends here. The rest are reduced to one-dimensional and stupid characters, as is the case with Stephen Lang (the \"brute like the stones\" colonel who only thinks about his mission), Michelle Rodríguez (the military hot girl who decides to collaborate with the \"goodies\" instead of helping the \"baddies\"), Giovanni Ribisi (one of the\" baddies\"), Joel David Moore (one of the\" goodies\"), Laz Alonso, CCH Pounder, Wes Studi (the \"perfect ones\") etc. This was somewhat disappointing in a film with so many qualities and such a high budget.It is in the technical aspects that this film excels. Directed by James Cameron, an avid fan of the green screen and a \"rival\" of Spielberg, it's a film that was built on top of an entire digital world. Thanks to this feature, Cameron can become a god for a minute and create a new universe with plants and animals that we have never seen and that exude beauty. The film has a spectacular cinematography and it does not pass five minutes without, in some way, making us hold our breath before such a show of color and light. Sound effects are very well-used also. Together with an epic and magnificent soundtrack by James Horner, we have the recipe for a blockbuster film that collected three Oscars in technical categories (Best Cinematography, Best Visual Effects and Best Art Direction), with all the fairness and merit. I really feel sorry that I didn't see it on the big screen and that Cameron is so careless when it comes to the script and the story he tells us."
    },
    {
      "rating": "10",
      "text": "Avatar - Breathtakingly BeautifulWhen movies are created, they are done so with intent. Different genres of film target specific audiences, a formula which has sustained Hollywood and it's industries since the beginning of the blockbuster movies. When a movie is created in a manner that sets in motion any given goal, said films success is pendant on whether or not that goal is reached. If a comedy creates laughter, or if a romance produces tears, then they are successes in their own right. So when a massively ambitious, seemingly impossible to create film aiming to usher in a new era manages to grab hold of it's audience and take them on an unprecedented cinematic roller coaster ride that delivers the goods every turn of the way, it can be considered successful. Avatar is that success.A work in progress that spanned a decade and a half, Avatar is more than just a film - it's an experience, an event. When James Cameron set out to make this movie back in the mid 90's, he realized that his ambitions were simply too far ahead of their time. His ideas could not be reached in a feasible manner, and due to this, he had to wait. Or create. Once informed that the image he held for this film was one that was out of grasp, he began working on the technology that would bring his masterpiece within reach. Fifteen years and nearly half a billion dollars later, James Cameron has brought that vision to the screen, and has done so in an extravagant and showstopping way.Avatar tells the tale of a war between species, each fighting for the ultimate survival of their race. Desperate to find the fuel for their dying planet, human soldiers and scientists set out from earth and set course for Pandora. A planet connected by all living things, Pandora is home to an indigenous species known as the Na'vi, as well as the precious element Unobtanium needed to save earth. Using transference technology, paralyzed marine Jake Sully is volunteered for the \"Avatar Program\", which enables the thoughts and mind of a human to be placed within the shell of a tube-born Na'vi body. Using this as technique to their advantage, Jake is sent into the harsh Jungles of Pandora in order to bond with the natives, thus gaining knowledge and insight on their ways. Having originally planned to use this knowledge as a means of negotiating the natives relocation, so that the humans can access the deposit of Unobtainium - which just happens to sit below their most worshiped and valued pseudo-deity of their planet.While the plot on paper may read as a standard shoot'em-up action sci-fi flick, it is a near inconceivable task to truly explain how incorrect this appearance truly is. This takes a stroke from every movie, and a dab from every genre, and manages to create a portrait of beauty, in which all pre-existing notion of what cinema can and cannot do is destroyed. Within the lengthy hundred and sixty some odd minutes of film, moviegoers will find that there is always something to keep them enthralled, a merciful gift when considering how tedious many of the longer film of recent memory can become.No matter what can be said about the overtly cheesy script,a criticism that, while holding true, manages to fit charmingly into the over-the-top nature of the film, Avatar does as it set out to do, bringing moviegoers a cinematic experience rather than a film. Relying on the technology that he created, Cameron pours his heart into this movie, and it shows in every scene. Ranging from the absurdly detailed creatures to all-too-realistic planet, this flick manages to tell a fulfilling story while all the while throwing jaw-dropping scenery at the audience, giving them only enough time to recover before bombarding them with yet another breathtaking shot.Be it the fantastical and charming love story told between the native and the outsider, or the too-real-to-be-true action scenes between gunships and foreign ferals, Avatar is what Star Wars was too the 70's, the Wizard Of Oz of the 40's - a masterpiece that will go down in movie history as a game changer of it's time."
    },
    {
      "rating": "10",
      "text": "Avatar captures all realms of the human indulgence. It is the perfect form of hero story as well as having a positive message about saving the environment. The movie is extremely creative and imagined. We are presented with a new language called the Na'vi, a new goddess named Eywa who is presumed one with nature, and new fundamental lifeforms that engulf your imagination. The idea of the human controlled Avatars is something unprecedented. It makes the movie fun and at the same time plausible because the world of Pandora is so substantial and inhumane, that mankind is forced to create organic bodies that can not only survive but explore the land efficiently. The Avatars are controlled by people with similar DNA from a tranced state that allows them to connect into the body. The plot of the movie is also one that is imaginable yet realistic. In the year 2154, U.S. armed forces embark on a journey to an earth-like planet called Pandora. On Pandora there is an element called Unobtainium that is extremely valuable. When humans discover that there is a substantial amount of Unobtainium under a large tree called \"Home Tree\", where the natives live action needs to be taken. Jake Sully (Sam Worthington) gets lost on a botanist mission and ends up at Home Tree, and the only reason he wasn't killed is because Eywa showed the natives a \"sign\" not to kill him. Since Jake is able to join and train as a native, the humans want him to convince the natives to leave their tree, in able to attain the unobtainium. Jake learns in conclusion that there is nothing the natives want and refuse to move from their home, therefore humans take force and destroy their home. The Na'vi are not advanced people, they live among nature and are smart with which creatures they interact with. Because Jake learns the importance of being a Na'vi he begins to choose sides and understands what is morally right. Dilemmas arise due to the natives not trusting Jake for his betrayal-like actions, and humans don't because he refuses to help the humans fight the natives. What will turn out for Jake and where will the Na'vi people go? This movie is an action packed thriller with imaginative fun and fight distributed throughout the film. We are introduced to many creatures including the Ikran (a huge flying bird-like creature), and the pa'li (a large horse-like creature). These animals play a significant role in the movie's structure by adding awe inspiring moments and serenity. The film never feels long and concludes with the ultimate warfare that has a special element that comes as a true surprise"
    },
    {
      "rating": "10",
      "text": "I was really blown away with this film.  Hands down the best 3D movie I have seen.  You could argue that the plot is the same as Dances with Wolves or even Fern gully except with blue aliens, but I don't care.  This movie is absolutely wonderful."
    },
    {
      "rating": "8",
      "text": "Gráficamente hablando podría ser la mejor película. La historia ademas acompaña muy bien a los personajes y escenarios."
    },
    {
      "rating": "9",
      "text": "Mind-blowing, colorful, immersive, incredible CGI, amazing cinematography & visuals, this movie truly was ahead of it's time."
    },
    {
      "rating": "8",
      "text": "With Avatar and Aliens we know that Cameron really nails the whole space Marine thing. It has its flaws but this is a really good movie. I know it's not his wheel house storywise but knowing he did the Abyss, I would be all-in for a Cameron film adaption of Forever War by Haldeman."
    },
    {
      "rating": "10",
      "text": "Absolutely fantastic film. I finished watching the extended cut and although the story is similar to Pocahontas it's still a really good story. The visual are amazing and being lots of depth to the world of Avatar. The score is also really good and the you get connected with the characters. There are a few potholes for sure, but still the story is worth watching. I can't wait foe Avatar 2"
    },
    {
      "rating": "10",
      "text": "This visually stunning work of art succeeds spectacularly in its magnificent beauty as it does in its emotionally driven love story which explores important themes in the most perfectly exciting and deeply rich way that brings new life to the sci-fi genre. Avatar is not only the greatest science-fiction film of all time, but also one of the greatest films of all time and is a truly outstanding spectacle upon its genre."
    },
    {
      "rating": "8",
      "text": "Una obra maestra de su época que hay que ver sí o sí. Un gran precedente al cine moderno."
    },
    {
      "rating": "10",
      "text": "This film, no matter how many times I watch it, always at the end it will make me feel like a child again"
    },
    {
      "rating": "10",
      "text": "A James Cameron masterpiece, avatar is a brilliant movie with amazing CGI, great cast of characters, and remarkable storytelling which had me in tears at-least four times!"
    },
    {
      "rating": "5",
      "text": "Superb special effects can't make-up for a predictible plot and so-so acting. See it in 3D at the theater--no need to ever see this movie on the small screen."
    },
    {
      "rating": "5",
      "text": "I struggle to understand how anyone can be so sucked in by the graphics that they overlook the recycled plot, terrible dialogue and mediocre performances. If indeed it does change cinema forever then it's a sad day for film-making when focussing on the 3D is a substitute for trying to make a good film. I'm just thankful I've not met a single person who was \"blown away\", in fact I don't know anyone who'd award it more than a 7."
    },
    {
      "rating": "5",
      "text": "Too long, vastly over-rated."
    },
    {
      "rating": "0",
      "text": "Too bad they couldn't afford good writers--the budget was blown on eye candy, but the message is the same old tired anti-Western nihilist propaganda."
    },
    {
      "rating": "5",
      "text": "Getting past the awe of a fast panning 3D environment--which is difficult for many sci-fi junkies--I grade the movie on what we'll think outside of our temporary giddiness. When we come back to this movie, the lack of depth in the characterization, the weak attempts at philosophy, and the over stated Gia-Green Earth message will not only bore us, it will insult us. Remember Jar-Jar from Starwars Episode 1. We tolerated him on the first viewing, but has made repeated viewings intolerable. Once the shiny green is gone; the movie will be as well--or we'll just stare with pitiful regret at a box on our shelves."
    },
    {
      "rating": "0",
      "text": "The special effects, are great. But the movie is nothing more then eye candy, also I found it extermely boring to watch. Small plot with ALOT of filler. See \"dances with wolves\" and just imagine that being set 200 years into the future and that is exactly what you get! There are numerous silly/dump ideas thought out the whole movie. I really enjoyed Camerons movies from the past, But this is the worst one."
    },
    {
      "rating": "0",
      "text": "I have not yet seen it, but does this smack of Hollywoods' attempt to bash the US military again? The timing of Iraq and the making of this film cannot be a coincidence."
    },
    {
      "rating": "2",
      "text": "Absolutely dire. The effects are not particularly that special, even for 2009 (though it does look pretty) and the story is a horribly executed retreat of a million other films that moves along at a snails pace. The dialogue is awful, the characters aren't memorable at all. A tremendous misfire."
    },
    {
      "rating": "4",
      "text": "When you take away all the special effects and the multi million dollar budget, all you are left with is a mediocre script that feels like something that would have been better as a made for TV animated special. With that being said, the technical aspects are impressive and you can tell that a lot of effort went in to making this movie look great. However, you can only look at a piece of art so long before you start to get bored."
    },
    {
      "rating": "9",
      "text": "When I first watched this movie I was blown away. It is probably my favourite movie of all-time but then I seen it a second time and I kind of got a bit more bored than the last time I watched it. It's still a great movie though."
    },
    {
      "rating": "9",
      "text": "Great visual effects, film and mounted with a spectacular photography and a magnificent art direction and stunning views, but their enrendo is not the best yet it is still a great movie."
    },
    {
      "rating": "7",
      "text": "Not totally blown away, but i was thoroughly entertained by it. But the film's strongest point is definitely the visuals. Pandora is beautiful and looks realistic. The story, though unoriginal, is still effective for this film. The dialogue, is bad sometimes, and decent in others. Definitely not a strong point. But if this film needs people to root for, its easy to tell who. If you want 3 hours of great visuals and nothing else, this is your movie."
    },
    {
      "rating": "9",
      "text": "This film reaches a new level when it comes to both technology and creativity. It´s a really good created alter/reality that will hold your attention with ease during the entire ride. Visuals and atmosphere give this this movie an absolute a-status. The created world is absorbing your brain so bad that the average story won't bother you even 1 second. This one shines in utter  greatness!"
    },
    {
      "rating": "9",
      "text": "I was pleasantly surprised by Avatar. I am usually a pretty good judge of movies from their trailers but the trailer for Avatar is filled with some of the more cliched elements. The CGI effects are marvelous and the realization of the world of Pandora is very detailed and persuasive. Having read cynical accounts of the plot as \"Dances with Smurfs\" I was also surprised by the story which was not exactly the strength of the movie but also didn't detract too much from the movie going experience. I feel a little sorry for people who become deeply attached to this movie and wrapped up in its reality...but on the other hand, I might even consider going to the movie again in the IMAX version."
    },
    {
      "rating": "10",
      "text": "My only wish is that they would have made the movie an hour longer. You don't want to leave Pandora. What a truly amazing creation of a world and culture."
    },
    {
      "rating": "9",
      "text": "I had heard a lot about \"Avatar\" before seeing it, and the general complaint from most was the movie's lack of originality. Having seen the movie, I would agree that the premise is nowhere near unique, but to me originality shouldn't be the basis for judging the quality of a film. More than anything a truly great movie should be striking, and Avatar is precisely that. James Cameron used his budget ($237m) to create one of the most engrossing environments to ever grace the screen, and pushed the 3D technology (which I don't even like) to the limit. The result is pure spectacle; behind me in the movie theater there was a family with three children and throughout the 2 1/2 hours there were constant exclamations of \"Wow!\" and \"Oohh!\" I would have been slightly annoyed had I not realized I wanted to say the same things, and for a movie to revert a hardened critic like me to a world of pure escapist wonder, I have to give the film credit."
    },
    {
      "rating": "8",
      "text": "There's more to a movie than a good plot, and I can't think of any movie that demonstrates this better than Avatar. If everything about a movie was amazing except for the story, I feel you can honestly call it a good movie."
    },
    {
      "rating": "9",
      "text": "AVATAR (or, as some seem to enjoy calling it, \"The Blue People Movie\", which really should be THE SMURFS, not this) is an adventurous, intense movie, and the best movie you can think of to be the highest-grossing film, both worldwide and in America.  Very few parts of this actually truly ticked me off, but there were a few to name: such as near the ending, when it began to get boring (a habit many creative sci-fi films such as even INCEPTION get into); and when Grace (Sigourney Weaver) died."
    },
    {
      "rating": "1",
      "text": "Quand je pense que James Cameron, c'était Aliens, Abyss, les 2 Terminator... et puis le naufrage a commencé avec Titanic (chiant comme la pluie et convenu) et cette farce avec Avatarte... plus tarte, plus niais, tu meurs ! Qui a produit ce film ? Disney ?!... c'est dégoulinant comme la petite maison dans la prairie, les pauvres **** indigènes bleus neuneus, oh la la je vais écraser une larme... Et c'est long comme une sieste de 3 plombes et même les effets spéciaux sont à la ramasse : on a toujours cette impression de se taper un mauvais dessin animé..."
    },
    {
      "rating": "7",
      "text": "First time watching this your not going to have any negative points, as it will win you over with graphical wizardry. And boy, are the graphics good. With very highly realistic environments, seeing it in 3D on the big screen is something magical. Assessing the film afterwards reveals a highly weak and wooden story that is just holding the film together with the visuals. Though the storyline is utter guff, the 'wow' moments might just make this a great film. Just."
    },
    {
      "rating": "9",
      "text": "Despite almost being a spin off of Dances With Wolves, the ridiculously beautiful visuals, believable and likable characters, and successful good Vs. evil theme makes this movie one of 2009's best"
    }
  ]
}