{
  "id": 52,
  "title": "Avengers: Infinity War",
  "starring": [
    "Robert Downey Jr.",
    "Chris Hemsworth"
  ],
  "runtime": 149,
  "genre": [
    "Adventure",
    "Action",
    "Science Fiction"
  ],
  "description": "As the Avengers and their allies have continued to protect the world from threats too large for any one hero to handle, a new danger has emerged from the cosmic shadows: Thanos. A despot of intergalactic infamy, his goal is to collect all six Infinity Stones, artifacts of unimaginable power, and use them to inflict his twisted will on all of reality. Everything the Avengers have fought for has led up to this moment - the fate of Earth and existence itself has never been more uncertain.",
  "releaseYear": "2018",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/7WsyChQLEftFiDOVTGkv3hFpyyt.jpg",
  "categories": {
    "plot": 8.047619047619047,
    "acting": 8.149253731343284,
    "ending": 8.090909090909092,
    "soundtrack": 5.0,
    "cinematography": 10.0,
    "familyFriendly": 6.0,
    "funny": 9.380952380952381,
    "action": 8.52
  },
  "reviews": [
    {
      "rating": "10",
      "text": "Thanos is a God now :D I don't want to spoil it. It was amazing I will most definitely be watching it like 10 more times"
    },
    {
      "rating": "10",
      "text": "FINALLY.. It’s SPOILER-FREE so Go Ahead..We’ve waited 10 years for this Mega Showdown.. Well, I’ll say, Worth The Wait.. The Debts been paid off.. :B It’s MASSIVE.. Huge Sets, Awesome Cinematography, Fantastic Actors, Characters we’ve known since the first Iron-Man.. All in One movie, Together.. Fangasm.. :3So, the story was so secret nobody knew what’s gonna happen.. except the Director-duo & the editor.. But Thanos is Bad news for the Avengers.. It’s not Spoiler, guys, you know it.. He can wipe out half the universe with just the snap of his fingers.. Just like that..Thanos is the Mad Titan as they say.. He won’t listen to anybody.. He’s Ruthless.. Wants to collect all 6 Infinity stones to rule the Universe as he see fit.. Can he manage to do that.? Well the movie has been made to get some answers.. So Go.. Get them..~ Starky, Ma Man RDJ in the house, baby.. uh-ah.. Started this MCU journey with the first Iron-Man.. Glad that happened..So perfect Starky.. :B~ Thor, Hemsworth.. He’s a God.. Can’t say much.. ;) But He was Awesome..~ Banner, :D :D didn’t write Hulk there.. Watch the movie.. Ruffalo was so funny.. He’s the Most Humorous Avenger (Of course after Starky)~ Cap Stave Rogers, as we live & breathe.. 150 year old dude, still kicking A.. THE BEST ENTRY ANY SUPERHERO COULD EVER HAD.. LOVE & SALUTE YOU, EVANS.. :B~ Natudi.. Romanoff.. How can one manage to stay Fit for that long.? Hats Off :B  ScarJo Forever :3 :*~ Doc, Betch of Cumber.. So Good.. Even his cloak had some funny moments like the movie Doctor Strange.. Time Stone did the Most Struggle..~ Spidey, Holland.. He got a new Suit.. Yaaayyyyy :D This is also not Spoiler.. Homecoming has this Coming here..~ BP, Black Panther, T’Challa, Boseman was So Good.. His personal bodyguard, Okoye, also was Very Good..~ Wanda, My Precious Witch.. :* Olsen is So Beautiful (& Powerful) Only She can save the Uni. But can she.?  Watch the movie..~ Rocket, Cooper was Hilarious.. :D Groot, Diesel.. Was playing video games half the time.. I AM GROOT.. ;)~ Gamora, Saldana.. Thanos’ daughter.. So, she had to be serious.. She was Good.. Bravo..~ Thanos, Brolin.. Did Excellent Job.. The Best Villain Marvel has shown on screen till now..~ There’re so Many Superheroes, I can’t write individually.. So..~ War Machine, Nebula, Loki, Vision, Falcon, Winter Soldier, Wong, Mantis, Heimdall, Drax, Pepper Potts.. All did Very Good Job..There are Many Surprises as the movie unfolds.. Guys, This Movie Is Worth The 10 Years Wait.. JUST GO & WATCH THE MOVIE.. YOU WON’T BE DISAPPOINTED.. That’s for Sure..First time in my life, Whole theatre was looking forward for the End credit scenes.. They sit till the end for the first time that I've experienced.. :)My Rating for the movie is *drum rolls*AWESOMETECULAR = AWESOME + SPECTACULAR (Yeah, It’s Stolen..)"
    },
    {
      "rating": "10",
      "text": "I am in complete shock in how this movie was able to work as beautifully as it did. We asked Marvel to raise the stakes, and boy did they do just that. They weren’t wrong when they said be careful what you wish for."
    },
    {
      "rating": "9",
      "text": "OMG the most shocking ending ever seen. This is the movie worth watching twice and i did watch it twice. So many action so many character but none of them feel blank . Can't believe they pull of the stunt like that with the ending. Now i hope 2019 come soon"
    },
    {
      "rating": "9",
      "text": "Man oh man! All I can say is this: MIND BLOWN! JAW DROPPED! BRAINS ON THE FLOOR! I'm quite honestly still reeling from what I just witnessed! Well... first thing's first! The pros: Each character had their own cool or unique moments. I was really pleased for the most part with the amount of time each of the characters had in the spotlight! The action in this also rarely let up! Once the movie started, it really got going and didn't slow down a whole lot until the very end!  Furthermore, I felt or went through just about every emotion under the sun while watching this! Joy, excitement, sadness, anger, anxiety, you name it, I felt it! To top that all off, my heart just about wanted to shatter during certain moments! I can't even begin to express how often I found myself yelling at the screen overall! I'll also say that the personal icing on the cake for me was the post-credit scene, as it alluded to an upcoming MCU film that I've been beyond excited for! The cons: Certain character deaths were rushed and unearned in my opinion. And also, some heroes that come to mind that I felt didn't receive quite enough screentime were Hulk, Black Panther, Bucky Barnes, and sadly Steve Rogers too. Other than that, I'd say that most everyone else got their fair share of screentime. And lastly, OF COURSE it had to end on a cliffhanger for Avengers 4 next year, so that was obviously highly frustrating, especially since it left us hanging on a not-so-pretty note, but that's all I'll say! Overall, this was one wild film and quite a lot to take in all at once to be honest! However, I still loved and was actively and emotionally invested in so much of it that I can say with certainty that this was a step above the slightly weaker Age of Ultron, but the lightheartedness and sheer fun of the very first Avengers remains my favorite still, but like I said, you certainly can't go wrong with this one either!"
    },
    {
      "rating": "8",
      "text": "What makes Avengers: Infinity War the most epic crossover in cinema history you probably won't forget as soon as you first watch it you may ask? Well I can't say much about the film, but as far as I know, it brings all of its characters from previous Marvel Cinematic Universe films and unite them together to face their biggest threat out of all the villains from the previous films. The way this film is executed from start to end is why I recommend you start watching Avengers: Infinity War in case you haven't yet."
    },
    {
      "rating": "9",
      "text": "It left me very accomplished even with the fact of enemies not being that much of a challenge to the heroes and the main villan taking its time to win when it could just do it, but ultimately more accomplishing things like tying  loose ends from other movies far back that I didn't think will be talk about at all again giving the audience what already was kind of expecting but not in the way that we did, something that properly motivates and strong ideals for the villan a shaking emotional and full feeling end that leaves you wanting more like this."
    },
    {
      "rating": "10",
      "text": "You're ready, right?  You watched all the previous films, Avengers, Age of Ultron, you saw Captain America Civil War, you suffered through the crap Ironman movies, just to be ready for this.  You're ready.  Sure.  You carefully rewatched all the Infinity Stone specific movies, Age of Ultron, Captain America the First Avenger, the Avengers, Thor the Dark World, Guardians of the Galaxy, Doctor Strange.  Then you watched Guardians again because it's really good.You're ready.  You got this.Right?You're not ready.  You're not ready."
    },
    {
      "rating": "10",
      "text": "I expected to be disappointed, but this movie delivers on all fronts. Thanos is genuinely a revelation and thankfully not only feels completely real in the CGI sense but also capture every last detail of Brolin's performance. I was completely engrossed for the entire movie. The Russo's wield their own Infinity Gauntlet over the Marvel Universe with absolute control. My only reservation is whether the consequences will stick in the next part; I hope they remain brave and leave some in place. Superb!"
    },
    {
      "rating": "10",
      "text": "Marvel has managed to surround this movie with secrecy and there are multiple reasons why this was a great idea. This is why you should stay away from all spoilers. One thing that should be said though, is that no one can prepare you for this movie. Celebrating a decade long era, “Infinity War” delivers on all fronts, offering both fan-pleasing material, while also including some shocking and heartbreaking twists and moments. To quote Thanos: It’s perfectly balanced."
    },
    {
      "rating": "10",
      "text": "Infinity War is the pinnacle of what blockbuster films should be. Directed by the Russo brothers, they manage to achieve the almost impossible feat of culminating all the characters and their stories into one epic film. The action, the characters, the story and the overall experience is spectacular to behold. Each characters has their own moment to shine, as we see new fun and somewhat emotional interactions between characters and story arcs that pay off as the film progresses . The result is a film that often feels surprisingly earnest and emotional. It pays off our emotional investment into these great characters over each of the 18 previous films through a great culmination of storytelling. The humor we have come to expect in Marvel films is lively and full of banter, particularly between Tony Stark (Robert Downey Jr) and Doctor Strange (Benedict Cumberbatch), and the quick-fire interplay between Thor (Chris Hemsworth) and the Guardians of the Galaxy. Unlike Marvel's cascade of villains who are turned secondary to their superhero counterparts, Thanos (Josh Brolin) is the central character in this epic, with a moral compass that is beyond what many might expect. Whilst he may seem to be the most demonic villain that the Avengers have come across, he is by far and away the most complex of them all, testament to the directing and writing of the film. There's a lot going on in this movie, with many scenes occurring almost simultaneously, leaving the ending on a much vague yet appropriate cliffhanger. Overall, Infinity War epitomizes the perfect blockbuster film that ends in poetic grace and is sure to leave you questioning what will happen next."
    },
    {
      "rating": "10",
      "text": "one of The best Superhero movie of all time, the character are connected each other, the CGI is just perfect, and the story was mind blowing, this movie will five you sensation riding roller coaster, fell depressed, fear , fun , and tears all the way, some people need to watch the movie at least twice for understanding the story."
    },
    {
      "rating": "10",
      "text": "Avengers Infinity War is another gamble of sort by Marvel Studios.  It is an astonishing film that assumes that you have seen and is a fan of the 18 MCU films before it. It is not a film that can stood by itself,   It is a culmination of 10 years worth of 'hard work', interconnected story lines, multiple characters that define the MCU.  It is also a film that shows us that Marvel is so way above the curve in comparison to other studios that tries to establish an inter connected universe.  It also ends in a gut wrenching third act that segue in the 4th, yet untitled Avengers film.  Believe me, things will go bad, with many comparing this to the level of Empire Strikes Back.  Acting wise: Josh Brolin is an absolute stand out as Thanos, the main villain. He is the best villain the whole MCU.  The rest of the casts are no slouch either, balancing humor and tragedy in equal measure. The action sequences are also astonishing, with a higher stake: our heroes can and will die in this installment.  An absolute classic that ranks as the best MCU flick by far."
    },
    {
      "rating": "10",
      "text": "This movie is absolutely marvelous ! from the beginning to end, full on mind blowing actions ,hilarious  scenes And funny dialogues .Fast paced ; Highly engaging screenplay ; a lot of superheros in this movie! all are right fit ,everybody got their wonderful moments ! Stunning cinematography , great background score work . AND well talented perfect direction to this gigantic film !  INFINITY WAR IS OUTSTANDING ,EMOTIONAL, SHOCKING AND SPECTACULAR BLOCKBUSTER ENTERTAINMENTMY RATING -9.8 OUT OF 10 !!!"
    },
    {
      "rating": "9",
      "text": "The principal reason that this movie worked out so well is because you literally care about every single one of them, you care about them and feel for them. The fact that we already know all the characters very well is just so awesome, like you feel that they are your friends and you are part of them and they a part of you.The story of the movie is very simple, is basically Thanos, the big titan, going after all the 6 infinity stones for him to be able to balance the universe, so our heroes unite to do their best to stop him.For a super-hero to be that good, it is extremely important for the villain to be good, for him no to be generic, and with happiness i say that he is perfect in every aspect. I'm gonna start with the most important, he is not that generic villain that want to destroy the universe just for this very reason, he does have a motivation, a rational reason that does make a lot of sense, you probably don't agree but surely buy the idea, because makes sense and it is in our day to day life. His personality is on point, the character can pass his ideas clearely, he does have charisma and among the villains some unique characteristics, he can express emotions better than a bunch of main characters in other movies. He is scary, you can see how powerful he is and how he is getting stronger during the movie, in some moments that you can just hear his steps, you squirms out of tension, in some moments you can see in his face that he is angry and is so notable how different things get whe he is like that, just at the beginning it does show how mighty he is.They gave him a background, wich helped to make us care about him to.The expressions that Josh Brolin had was so much on point. His Cgi is insanely great, it is so good that doesn't even seem that it is a cgi character, you completely forgets that it is fake. He did had a nice arc.The Black Order characters are all well designed and all had their moments, but only fauce de ebano were well developed, he did had his speech, kid of had a background and all of his moments were dope.The film splits into nuclei, all the heroes start isolated from eachother and posteriorly some end up finding others, and the 2h30min of movie help to it to happen in the most natural way as possible. The presentation of each core is done with mastery, inserting the audience into the language of the original film, whether through colors, as in the case of Asgard, or music, with the Guardians of the Galaxy and Wakanda. The movie does have a nice balance between comedy and drama, even that are some jokes that felt out of place, in the most they did worked and didn't disturb the tone of the movie, it still serious and with consequences. The movie has gigantic scales, it is not like any other movie that you did watched for sure, it is different thant any other, and this is another important factor that makes it so great. One of the best actions that i have ever seen, the movie is so happy in doing the heroes work together and use their powers together, it did make some iconic moments and very memorable scenes. And are moments that are like Lord of the Rings, a giant and stunning war, that i can't talk a lot about it to not spoil.It definely shocked me much more than i expected, there are so many surprises, it is like a napalm, there is so much happening and is so fast and so burner at the same time. Some action scenes just made my hole movie session scream like crazy. The interaction between the characters and the personality shock was done with maestry, they gave time for them to meet up and not feel weird that they are cooperating, all felt organic.If there is some bad things about the movie ? Yes, in some specific moments the cgi doesn't worked and is possibly that it took you off the movie a bit. Some things about the story doesn't make a lot of sense to me, but isn't that crucial and will not ruin the movie to anyone.You do feel the break from one nucleus to the other, i believe that could have had some better transitions, but i get that it is very complicated. There is one specific relationship that i believe that could have been more explored for us to feel kind of how Thanos was feeling in that moment.It did creates nostalgia with interactions of old characters and excitement with the new cross-overs.One thing that this movie can do to us, is let us apprehensives, considering how big of a treat that Thanos is you fear for the life of literally every single one, this kind of thing doesn't happens in almost none super hero movie. It is surely the most shocking Marvel movie.The movie is very creative whe it is about on the using of the power of the stones. It did had moments that happened things that you could never see it coming.Avengers Infinity War, does not have a great story, but is fun and show that not every super hero movie needs to be the same."
    },
    {
      "rating": "10",
      "text": "\"Avengers: Infinity War\" celebrates the first decade of the Marvel Cinematic Universe while building up to the grand finale of the first era of the franchise and conclusion of its third phase.The Avengers team up with the Guardians of the Galaxy to stop Thanos from collecting all the Infinity Stones and destroying half the universe. That's all that you know before seeing this film, but there is a lot more going on, so make sure you avoid all spoilers.The film offers humorous and fun moments by teaming up several of the cast members together, but it also completely breaks your heart and soul with some truly unexpected, dark and shocking turns. It's also a large scale production, with the Russo brothers offering their best directing yet. As a whole, this manages to top my personal list of MCU films and comic book based films in general, giving the promise of the next chapter to be even greater, if possible."
    },
    {
      "rating": "10",
      "text": "Marvel definitely has now solved their villain problem. I thought I had this film all figured out since usually all MCU films have a rather predictable formula. Nothing wrong with that though. This film throws the formula away and changes things up in many ways. This was a great breathe of fresh air in terms of storytelling. Yes the marvel trademarks are there still but the waybthe film was structured was far different that other MCU films prior and this is why it’s very special. The 3rd act was the epitome of a nail biter and the ending shocked even me a long time Marvel comics fans. I didn’t think they’d a tully do what they did. The entire film was a rollercoaster ride. A must see!!!"
    },
    {
      "rating": "9",
      "text": "This is not a standard superhero movie. Nearly all of the Marvel Cinematic Universe movies from the past ten years have led up to this one. So you should watch all of those before you start watching Infinity War. Because this movie doesn't give you time to breath and catch up. Loads of characters, settings, items, references of which the movie assumes that you are familiar with them. It's a rollercoaster that doesn't let up.  After preparing for ages, Thanos is making his last moves. He is coming. Dread it, run from it, destiny still arrives. Dread. That word actually describes this movie really well. From the very first scene you already know that the stakes are enormous, the threat is immediate and all encompassing, and stopping Thanos truly feels like the greatest challenge in the universe. There are still jokes, heartfelt moments, marvelous special effects and hilarious jokes. Like you would expect from any MCU movie. And amazing special effects, scenery, tech ...There are loads of characters and none of them get a lot of screen time, yet there's still character development (naturally not for all of them, not even for all heroes).This is also a movie about decisions and choices. My only gripe with the movie is that some of those decisions and their consequences break my suspension of disbelief. The fate of the universe is at stake people, come on ... are you really going to do that?! After two days, I'm still processing the movie and may 3 2019 can't be there fast enough to conclude phase three of the MCU.It's a different kind of superhero movie and it's amazing. Go watch it."
    },
    {
      "rating": "10",
      "text": "Fantastic movie with a very detailed plot. Thanos also makes an amazing villain who believes what he is doing is best for the universe. Although there are so many major Marvel heroes the movie does not feel rushed or bloated"
    },
    {
      "rating": "10",
      "text": "Thanos is Right. Best villain ever! The film was a true master class for the genre. An amazing balancing act of tone, emotion, action, suspense and an a 3rd act that will leave you on the edge of your seat with an ending that will make your jaw drop"
    },
    {
      "rating": "10",
      "text": "Well play for the marvelverse, job is done, Thanos is great. Lot of places (space, earth, many planets, ...) but we alway understand the situation."
    },
    {
      "rating": "10",
      "text": "Thanos is a very good villain. I expected a one-dimensional madman who talks nothing about destruction, but he actually had believable, understandable reasons on why he wanted to wipe out half of the universe.I also love the fact that everyone gets a screen time. I thought it was going to be one of those \"90 seconds for each character then move on to next\" bullcrap, but it shows everyone's motivation on why they are fighting Thanos.Last but not least, the ending so really shocking it left me saying \"what?\" repeatedly while the guy who was sitting next to be laugh at it."
    },
    {
      "rating": "8",
      "text": "Ever since Iron Man made its way into theaters in 2008,that was the beginning of the ambitious Marvel Cinematic Universe,that,from there on out,went on like a New Super Mario Bros game. You complete some levels (the solo movies) all the way up to the final level (the Avengers movie) of each world (Phase).This definitely seems like the last level (almost) of World 3. After 10 Years of waiting we’re finally here,and the hype is so intense that if you say something negative,it almost seems like a crime. That’s why I’ll talk about the negatives first instead of the goods,given that nothing is as perfect as,say,24 Carat Gold. Aside from some unbalanced CG and the score (which needs its own paragraph),I want to take a moment and despise the marketing team. The movie was marketed as ‘’The Biggest Event Of All-Time’’ (a thing most movies are doing nowadays),although the commercials were amping it up to an Interstellar-like seriousness. And while it’s a damn good movie,I wouldn’t say that it’s as good as Interstellar or Once Upon a Time In America,given that selling it like that makes the movie look like a legendary event (which,in part,is supposed to be). Let’s hope the team won’t do the same thing with Avengers 4 and learn from the mistakes.Also,darn it,was the score by Alan Silvestri (Ready Player One and The Avengers) disappointing! Coming out of RPO,I was amping my expectations up for this score,but all I got was another generic Marvel score whose little cues and overall theme will be remembered for sure other than the whole tracklist.Now that the problems are out of the way,there’s a LOT to talk about the positives.I admire what writers Christopher Markus and Stephen McFeely (Civil War and The Winter Soldier) did with the story,resulting in a Dunkirk-like structure,where it’s divided in 3 separate stories that,by the end of the movie,get connected together perfectly (like a complicated Puzzle). It DOES feel like if it’s Part 1 of a much-bigger event (the arrival of Avengers 4 in about a year),especially given that we have 79 characters in the ring.Tone shifts every now and then,and it’s a good thing,since each member,with its own screen-time,surprisingly,give you a moment to laugh or cry (Yes,the quips and jokes are there,but none of them detract you from the central story). For example,when we have Iron Man with Banner,Strange and Wong,it gets serious,but when we have the Guardians,it gets funny all-the-way. This is the most ‘Shakespearean’ (I guess) Marvel movie since the first Thor,so be on the look for that. The part I was mostly curious to hear about was how the crowd was going to react to the end,but I won’t say what happened because spoilers.Thanos (played by Deadpool 2 star Josh Brolin) is probably the best written Marvel villain of all-time. I loved his motivation,his charisma,his design,and rife with lines like ‘’I could just snap my fingers and you’d all cease to exist’’ or ‘’Perfectly balanced as all things should be’’,you know right away he’s perfectly written. However,as much as I would go full fanboy for him,I wouldn’t say he is as great of a villain as,say,Killmonger. It’s certainly better than Loki,but where Killmonger came with a more realistic approach,I feel like Thanos didn’t have all the cards on the table to be a great villain,for me only. Everyone will mostly rave about him nonetheless,(even if they should). Oh,and the motion capture is amazing,so…Every actor/actress was amazing all the way,from Downey Jr to Evans to Pratt to Saldana to….Basically everyone.As I said,yeah,some of the effects are unbalanced,but that doesn’t mean the CG is bad. All of the effects are off the chain,especially,as I said,the motion capture on Thanos.Look,if you see Infinity War as a fan,you’ll definitely enjoy it,but as a marketing choice,you’ll probably see it as a disaster on every level. But (there’s always a but) my heart was pounding all the way through the end,I laughed and I didn’t cry for those moments (bit of a serious person),so… I’m surprised to say it,but I’m curious to see what will happen in Avengers 4. Now the annoying part is that I’m going to hear everyone scream in pain for that movie while I get comfy for Incredibles 2. Bring it on,I guess…"
    },
    {
      "rating": "10",
      "text": "This movie has hit all points at the highest level. It was hilarious at some points while still being heartwrenching at others. It portrayed all of the MCU characters very well and gave all of them major rolls in the story while not overpowering any one of them. This movie took major risks and I believe that Marvel executed it to perfection."
    },
    {
      "rating": "10",
      "text": "Fans of MCU will be delighted with this, action scenes are incredible and well done filmed. The fact of having so many main characters at the same time it reduces their plot development, but this is how it was to be done it. Amazing"
    },
    {
      "rating": "10",
      "text": "A compelling storyline, complex villain, and incredible ensemble make for an entertaining and enjoyable ride. This film is packed with jaw-dropping visuals, exciting action, and surprising twists that will keep viewers on the edge of their seats from beginning to end. The film masterfully balances its numerous story arcs and characters to create a true spectacle that has never been done before. One of the true character standouts of the film is Thanos, portrayed by Josh Brolin. Brolin gives a compelling and heart wrenching performance as the film explores the trials and sacrifices Thanos must undergo as he travels the galaxy, hunting the six Infinity Stones. Other commendable performances in the film include Robert Downey Jr. as Iron Man, Tom Holland as Spider-Man, Benedict Cumberbatch as Doctor Strange, Zoe Saldana as Gamora, and Chris Pratt as Star-Lord. Alan Silvestri's incredible score adds a deeper layer to the film's story and is truly one of his best yet. Overall, Avengers: Infinity War is filled with heart, humor, and sacrifice that help redefine what a hero should be. The Russo brothers have crafted an epic of galactic proportions that will have fans contemplating long after the credits roll."
    },
    {
      "rating": "10",
      "text": "Here are my spoiler-free thoughts of “Avengers: Infinity War”:10 years of buildup has lead to this. Marvel Studios promised a movie worth 10 years of building a cinematic universe. And, worth it, it sure as hell was. This IS Thanos’s movie. There are surprises no one is expecting. There are character interactions that will make people giddy. But, as much as the humor isn’t lost, even though some will want it to be brought down a bit, lucky for them, darkness isn’t abandoned. Because when Thanos shows up, consequences there are. Trust me when I say no one is prepared for what they see. “Avengers: Infinity War” is indeed worth the hype. One of the best Marvel movies ever. And, Thanos is the best Marvel movie villain ever. Josh Brolin NAILED him. And, that’s why this movie succeeded. Well done, Disney, Marvel Studios and Kevin Feige. You did it.I give “Infinity War” a 5-Star rating.⭐️⭐️⭐️⭐️⭐️Also, there is one surprise in this movie the anti-Disney trolls failed to spoil. And, that’s why I say to them when they try to spoil the movie: #NotTodayZurg."
    },
    {
      "rating": "9",
      "text": "Here we go again, audience score high, critic score low. This movie is amazing but probably didn’t have enough social justice warrior action for them."
    },
    {
      "rating": "10",
      "text": "Okay, so in order to meet Thanos' demands, I will not write any spoiler here (At least for now). Truth is, I really feel bad for the quintet of The Russo Bros, the screenwriters (Markus & Mcfeely), and Feige. They literally have the universe on their shoulders. Infinity War is unavoidably overstuffed, but one thing is for sure: Thanos is the main character in here. They didn't mess around with their \"the movie centers on Thanos\" advertising. This is the first MCU movie to have REAL (and I mean, REAL!) stakes, and felt almost real too (Loki's threat in The Avengers obviously had the usual \"aliens come to New York to invade Earth\" feels). The Russos (And the Screenwriters and Kevin Feige) really did the impossible, juggling no less than 30 characters (For comparison, \"CA: Civil War\" had roughly 15-20 characters at max).Final word: Thanos is the OG of the universe!!"
    },
    {
      "rating": "10",
      "text": "A Marvel pegou nossas expectativas de fãs, riu de todas elas, pegou e as jogou no lixo e fez muito melhor. Felizmente conseguiram costurar 99% de tudo que tinham feito até agora."
    },
    {
      "rating": "10",
      "text": "Avengers Infinity War is a flawed masterpiece,a tense 149 minutes epic from start to finish.This film,similarly to BR 2049, filled with SO many surprises. IMO Thanos might be on par with Heath Ledger's Joker to become one of the finest villains ever put to the screen.It has at least 15 epic moments.The ENDING was WOW,probably in top 5 Endings in Superhero Films.That being said,it is flawed masterpiece,the pacing of the third act has some problems,and the weight of too many characters in one movie is very noticeable,but these are the type of flaws that are so inconsequential due to this thrilling beast.Still.this film is intense,emotionally resonant,fast paced,visually dazzling and techically a MASTERPIECE"
    },
    {
      "rating": "0",
      "text": "Michael Bay meets Avengers. There's a reason Bruce Willis said explosions are stupid and boring. Would you ever read a book about random superheroes fighting from the beginning to the end with literally not storytelling? CGI and boombastic scenes does not make a movie more interesting to anyone who has ever watched a few movies before.In a story drown 6 foots under by a bajillion plot holes, it's hard to take the movie seriously. Not to mention, for anyone who has ever read/watched at least a single piece of fiction, it's obvious all the heroes who died at the end of the movie are going to come back rendering the weight of anything that happens meaningless. Why can't movies do anything better than create a stupid villain with little to no background as a plot-device for its movie. What happens when no villains are around? Is there a constant influx of supervillains wishing for world destruction coming out of a portal every single day in these dumb universes?If a game attempted a similar storyline, it would get bashed seriously and receive a trash score. However, just because the name Marvel is stamped on the product, it instantly becomes a 10/10 by any fanboy regardless of the content.Spoiler alert: Avengers 100th movie is still going to be against a villain that makes no sense just for the sake of having a plot device to insert an infinite amount of CGI crap. Here's an idea for you, make them throw universes at themselves for more explosions next time around. Please bring more cliche stories, we don't have enough of these already."
    },
    {
      "rating": "3",
      "text": "Infinity war is a movie with some good action, but incredibly poorly written and predictable plot. The whole movie feels like a huge shock factor stunt that aims to have emotional impact that weights down on the viewer but ultimately falls flat. The only emotion I felt leaving the cinema was regret for spending my money and anger at the creators of Infinity War, because frankly, there was a time I used to enjoy the MCU and felt like this movie that wanted to represent the climax of all the previous 18 movies ended up being a huge let down.A small advice. Next time when you will again try to create a dark movie with emotional impact, Marvel, try to be a little bit less obvious with your intentions and don't spoil the movie yourself by announcing sequels for all the supposedly killed off heroes before their \"sad deaths\". Be so kind and leave at least a small benefit of the doubt for the viewers. How can we feel sorry for a character's death when we already know said character, no matter how tearful threir dying scene is, will be brought back in the next movie? Do you think so little of your own fanbase? We all know the reason to why only the newer characters (with confirmed sequels) disappeared and the original stayed. We understand all the characters who died after the snap and Gamora who was sacrificed to get the Soul Stone will be coming back. And that it will be by the original Avengers doing in the Avengers 4. We understand it is the original surviving Avengers who are in true danger of dying for real in the MCU in the coming Avengers 4.That makes the characters whose deaths were not inflicted by the Soul Stone or Infinity Gauntlet possibly the only permanent deaths of Infinity War. At least Marvel gave us the benefit of the doubt there. You would think that it's these deaths Marvel takes extra care to make them be felt hard? Well, then you are sadly mistaken. The possible permanent deaths on the list include Heimdall, Loki & Vision (Vision is AI, he can be saved in some way by Tony or Shuri), so characters who were killed off quickly without an afterthought in an opening scene!!! And in this light it brings the IW movie even lower.Always when character gets killed for a shock factor, with the only purpose to show how powerful the newest villain is (I see you Warriors Three), I cringe. As I have already stated, shock factor deaths are just a result of awful screenwriting. Hey Marvel, if you want to create a truly awesome, fear inducing villain, there are better ways to do it. Have you forgot everything about character building? The irony Marvel decided to kill off in this manner its arguably most complex & popular villainous character makes it even worse. Loki was  introduced to us as a powerful magician who could trick even Odin, shapeshifter, user of telepathy, telekinesis, with inborn elementary ice magic, high intellect, manipulative deceiving skills who used to wield not one, but two infinity stones. Loki had Space Stone in his possession, he knew Thanos is coming for years and had time to prepare himself. Yet Loki is not shown fighting or using any of his skills.If someone told me before the IW that Marvel will make Loki go against Thanos with nothing but dagger out of all his skills, I would have laughed. Sorry but to give the very character that once threatened the whole planet of Earth and was the very reason project Avengers was created such a poor last stand was an awfully scripted mistake. Especially when he is the only big character truly dying in IW. The \"no resurrection\" remark as they felt the need to assure viewers that this time the trickster god is really gone was truly pathetic. And there is more than enough eye-roll inducing moments like this in IW movie.Gamora scene. That is HOW to make characters go with honour. Strong scene, with background story and fight. But again, I think she is coming back because her death is connected to the Soul Stone. If not, then this was the highlight of the movie. I sincerely doubt it tho.The only apspect I have praise for in this movie is the amazing acting. Marvel has put together incredibly talented cast and they are doing what they can to make the movie enjoyable. But their efforts are severely limited by the weak and predictable script. This has to be one of the worst movies in MCU."
    },
    {
      "rating": "3",
      "text": "Obvious. Not surprising. Consequences clearly are not permanent. Only Spidey, Strange, and Iron Man (who worked together apart from the other heroes for most of the movie) were interesting. The rest of the film was ponderous, depressing, obvious and slow. I really wish I had saved my time and money."
    },
    {
      "rating": "10",
      "text": "Absolutely fantastic, when you consider that there is over 20 characters clawing for screen time this feels like no one is left in the shadows, they all get their little moments to shine and character development as we have grown to know and love in the MCU.The development of Thanos as more than just a \"villain of the week\" is great, you get to see why he wants to do what he wants to do, you see the fight from his point of view and why he thinks people will not only accept what he does for them, but worship him as their saviour. One thing is for sure as you walk away from Infinity war.... you're going to be looking up the release date for the next MCU film to see where this goes."
    },
    {
      "rating": "8",
      "text": "The short review: The character and story development are inadequate, many fights scenes felt like nothing new, and the plot felt predictable, but there is enough comedy, anticipation and suspense to make this a good but not great film.Related media: I have seen all the Marvel Cinematic Universe (MCU) films, so this review is based on knowing what had happened before.What's it like?: Something happened before the film starts that makes Thanos and his henchmen decides it is finally time to take matters into their own hands to assemble the Infinity Stones themselves. So they move from one location to the next, fighting and killing the current holders of the stones. Will he succeed?Post-credit scene: One at the very end but it’s a must-see.Negatives: 1)\tA major irritation with this film is the slow pacing, sometimes caused by too much pondering and exposition. Thanos’s destruction of one character/location after another has made the mood gloomy, but when the story transitions to another location, it takes too long for the next thing to happen. 2)\tThe film suffers from what critics have been warning for a long time – too many major characters in one film. Marvel was able to avoid the failures of DC Comics with Suicide Squad and Justice League, and in fact had major successes with Avengers 1 and 2 and Captain America: Civil War, but I think Marvel has reached a tipping point with this film. With so many characters, they could not spend more time with each character and cover character developments other than moving from one fight to the next. 3)\t(Cont’d) An example of this is the fight between Iron Man and a villain. It degenerates into the usual thing of Iron Man shooting lasers and missiles, while being thrown about and smacked with objects. There is nothing new! It becomes another throwaway skirmish, of which there are many in this film.4)\tA real problem with any story where the villain is trying to gather a number of powerful objects, which upon completion would render him/her invincible is, where the story goes from there onwards. This problem is made worse here as Thanos becomes more powerful as he acquires each Infinity Stone, rather than needing to collect them all before getting any power from each stone. This principle makes it ever easier for him to acquire each succeeding stone, such that it is guaranteed that he would complete his task. I am really worried as to how the story writers are going to fix this in Avengers 4.5)\tThere are some opportunities to stop Thanos somewhere in the film but they are wasted because of the stupidity and selfishness of some characters. Some character(s) even surrendered the stones. I think these situations were there just to milk out some drama but they were not well done.6)\tThe massive attack on Wakanda with Thanos’s army – it’s in the trailer – does not make sense, considering that prior attempts to acquire the stones had only involved a few super-villains but were executed very expertly. It smacks of a cheap attempt to insert a major battle into the film just to satisfy the fans, when it wasn’t necessary at all.7)\tThe scenes where the heroes who do not know each other meet up for the first time, was not done well. It seemed like the heroes trusted the other side and become friends too easily.8)\tThor and Peter Quill had developed greater powers in recent films, but neither of them used these powers here. Disappointing.9)\tThor remains insecure about not having a hammer and goes to get a new one. The entire sub-plot on this venture felt contrived and felt like an attempt to show a MacGuffin.10)\tThe strange ending was another gloomy scene. The audiences in the same theatre as me, felt drained, depressed and confused when the lights were turned on. Hang on! This could be just what the directors intended, which would make this a positive!11)\tOverall, the story felt predictable and this points to the linear and average story-writing. Guardians of the Galaxy 2 felt the same, but Thor and Civil War were surprising.Positives: 1)\tDespite this film being rather gloomy, there were still many funny moments, something that almost all of the DC Comics films never managed. 2)\tThe film did try to cover the backstory of Thanos, which I wasn’t expecting. Film critics cannot thus argue that this film did not have any character development.3)\tThe beginning of the film had some of our heroes losing continuously and badly to Thanos and his henchmen. When our heroes won decisively for the first time, it felt really great!How would the different age groups rate it?Children: Excellent;Teens: Excellent;Young adults: Good;Medium age adults: Good;Old adults: Average;Rating: 4/5 (no half scores). Pay to watch it in the cinema."
    },
    {
      "rating": "10",
      "text": "Don't believe negative reviews.THIS MOVIE IS AWSOME!!!All chars gave their best.Especially thanos his moves will give you chills."
    },
    {
      "rating": "10",
      "text": "It is a little surprising that the critic score here is not higher but understanding that not every critic is Hardcore MCU fan makes for the score a little more sense. It's a 9.5 from me, I don't remember the last time a movie has had such an impact on me. That only happens at good TV shows finales (which this pretty much is after all). I can't wait it to see it again, many times. No movie is perfect but pulling this whole gargantuan thing off is that extra tipping point that pushes me for the 10 on Metacritics scale."
    },
    {
      "rating": "10",
      "text": "This movie will make you laugh, cheer, surprise, affect but most importantly (quoting Ultron)  this movie will tear you apart, from the inside."
    },
    {
      "rating": "9",
      "text": "I don't know where the critics looked down on this movie. Outside of a so-so start, Infinity War entertains better than perhaps any other Marvel movie has to date. The action was fantastic, there were a few great jokes in there, and for the first time in a very long time I had to fight back tears over something that happens in the movie (seriously glad that moment only lasted for so long because I was ready to unload years of frustration and grief in one moment). It's tough to manage a lot of star power on the screen over 2 1/2 hours but Marvel manages it incredibly well. For the first time in an Avengers movie audiences don't necessarily get what they want and it's both infuriating and amazing. It'll be hard not to dish out spoilers and I won't spill any beans but the table that this movie sets is one of the most intriguing futures I can remember in movies - better than Star Wars (at least post-OG trilogy). Infinity War makes Captain Marvel and whatever the currently unnamed AV4 incredibly important. Bottom line: this is the Avengers movie to see in theaters, and see it in a big one if you can because having a big screen and Dolby Atmos was a blast for myself."
    },
    {
      "rating": "10",
      "text": "this movie exceeded my expectations, i went into this movie hoping for one of the best mcu movies to date and walked out with it being not only for me one of the best comic book movies but one of the best movies of all time, the writing, acting, cgi, comedy, action, drama, etc. everything was damn near 100% perfect and on point, it was serious when it needed to be serious and funny without feeling out of place breaking scenes, it made me laugh and it almost made me cry(i was fighting the tears) the hour and a half flew by and made me wish it would never stop. and marvel has finally fixed its villain problem, Thanos is by far one of the greatest comic book movie villains ever, heck he is one of the greatest villains in any genre. i cant wait to see this movie again and again, it is and easy 10/10 for me no question."
    },
    {
      "rating": "10",
      "text": "Epic. Most shoking end scene I've seen in comic books movies. Every jokes have good timing. Marvel could assembled every one perfect and makes every one  important.  Thanos is perfect"
    },
    {
      "rating": "9",
      "text": "This movie shocked me. It will live you speechless and emotional with questions. Thanos was really threatening and just make you feel hopeless. Russo brothers done it again."
    },
    {
      "rating": "10",
      "text": "Best MCU movie so far! TOTAL NONSTOP ACTION! Only complaint is I wish Disney was more hush hush about the future MCU movies. Knowing which actors have how many movies left on their contract and whatnot killed some of the climax."
    },
    {
      "rating": "10",
      "text": "Couldn't have asked for much more, thrilling from start to finish. For a Marvel fan this is just about as close to perfection as it gets."
    },
    {
      "rating": "8",
      "text": "Shocking, entertaining, and action packed, \"Avengers: Infinity War\" is a beautiful culmination of all MCU entrees so far, as well as a terrific and emotionally rewarding film in its own right."
    },
    {
      "rating": "10",
      "text": "I have never been more satisfied with a movie living up to expectations and also blowing them out of the water. If you somehow haven't seen it yet AVOID SPOILERS!!! Just don't go on social media, go on blackout. You don't want any of this spoiled, trust me. I can't believe how well they weaved together all the plot threads of the past ten years into a movie that is all payoff. Yeah there's gonna be a part two and there's a cliffhanger, but the Russo brothers did a phenomenal job giving this movie its own identity with a beginning, middle, and end. I'm 1000% on board with what comes next."
    },
    {
      "rating": "10",
      "text": "There was a challenge, it's the conclusion of 10 years of work. 10 years of characters developement. At the end, it's one of the best marvel movie. It's so entertaining, it's the first marvel t want to watch an other time right away. Amazing job, amazing character development on Thanos."
    },
    {
      "rating": "10",
      "text": "Currently a 68 on Metacritic. Proof that the most perfect Comic Book movie ever made could NEVER please mainstream critics. If you are a longtime fan of 80’s & 90’s Marvel Comics and Ultimate Marvel, this is the movie of your lifetime. The creators of this film have done what many thought impossible; they have taken a gigantic cast of characters (old and new) and given every one of them purpose, meaning and a soul. Thanos is fully realized and has a purpose and motivation, not just “make the universe evil because I’m evil.” His “Black Order” storm onto the scene and all at once rivalries are created with our heroes. These foes are formidable and full on characters in their own rights. The movie is wall to wall action AND emotion, and it NEVER feels gratuitous. No character is “safe” and the danger is palpable. They make sure the viewer understands that immediately.This story is flat out Marvel Cosmic Universe, no pandering for general audiences. What the critics call out as “problems”, comic fans call strengths."
    },
    {
      "rating": "9",
      "text": "I didn't expect this. Did someone expect this? If you haven't seen it yet, run, fly, whatever you can do to get there asap. Winter Soldier's the best action scenes in Marvel movies so you already now that is gonna be well directed. The plot was great(did I mention unexpected) and Thanos is in my opinion even better than Loki. They did not use all available characters but remember that Avengers 4 is coming next year. Thor is a real god in this movie, he's got some really cool arriving scenes. Just go live the experience in the cinema. (just 9 because i've only watched it once)"
    }
  ]
}