{"id": 136, "title": "Avengers: Age of Ultron", "starring": ["Robert Downey Jr.", "Chris Hemsworth"], "runtime": 141, "genre": ["Action", "Adventure", "Science Fiction"], "description": "When Tony Stark tries to jumpstart a dormant peacekeeping program, things go awry and Earth’s Mightiest Heroes are put to the ultimate test as the fate of the planet hangs in the balance. As the villainous Ultron emerges, it is up to The Avengers to stop him from enacting his terrible plans, and soon uneasy alliances and unexpected action pave the way for an epic and unique global adventure.", "releaseYear": "2015", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/4ssDuvEDkSArWEdyBl2X5EHvYKU.jpg", "categories": {"plot": 8.1, "acting": 8.125, "ending": 8.0, "soundtrack": 5.0, "cinematography": 8.0, "familyFriendly": 6.0, "funny": 7.666666666666667, "action": 8.348837209302326}, "reviews": [{"rating": "10", "text": "This is absolutely one of the most entertaining movies I have seen in years!  The actors all deliver excellent performances that match their respective characters and the storyline and writing is very strong.  Anyone who is a fan of comic action movies will consider this one of the best they have seen.  If you do not like these style of movies you probably won't like it but then why would you go see it and waste your time writing a review for something that is obviously not in your wheelhouse?  This will shatter all sales records and is a must watch for everyone looking for a great movie."}, {"rating": "10", "text": "Avengers: Age of Ultron is nothing more or less than what I was expecting in an exciting superhero film.  The people who won't like this film are people who like artsy-fartsy movies where nothing happens for two hours except people stare at a wall and talk about death.  No, this is what all superhero movies aspire to be.  Great action, great villain, great characters, and superb dialogue.  If you haven't seen the other Marvel movies, you will be lost as to what's going on.  If you have seen them, you know what to expect, and you'll have a blast.  Go see this movie!"}, {"rating": "10", "text": "This is such a great follow-up to The AvengersII, Captain America II, Thor II and Iron Man III, it fits even better than I thought my expectations! The story behind it is very well done."}, {"rating": "7", "text": "While still slightly hamstrung by \"middle chapter\" narrative problems, Avengers: Age of Ultron is nevertheless an action packed extravaganza that infuses humour and large scale mayhem seamlessly while delivering strong performances from it's new foe and the returning & new heroes."}, {"rating": "10", "text": "The critics are way off point on this one. Age of Ultron was better than the first film I thought. There were deeper relationships between the characters, the choreography and action set pieces were even more spectacular and memorable and it there was even more humour and great one-liners. I don't see how a film that's more of the same but better gets lower reviews. Seems backwards. I want to go and see this film again already. Joss Whedon is so talented."}, {"rating": "8", "text": "Avengers Age of Ultron is excellent.  Would you expect anything less from Marvel Studios and Joss Whedon?  They are perfectly matched together and this film is no different.  I am slightly concerned that this one may pale into comparison in the long run especially after Infinity War comes out and I’m not even certain I would say that it is better than the first film, but it is a very good film and it was well worth the wait!!!  It’s not a perfect film by any means but it’s a good enough film that you really will ignore most of the flaws though I suspect some long time fans might be slightly disappointed by this film.  The characters are great, the acting is great, the action sequences are once again excellent and it sets up Phase 3 pretty well especially in the post credit scene which I would recommend you stick around to see.  The film does kind of bank on the fact that you have seen most of the Marvel Movies prior to seeing this, but I would say that’s not entirely essential, although I would recommend at a minimum you have seen the previous Avengers Assemble and if you have time, see Captain America the Winter Soldier.\r I really liked it, I wouldn’t say for certain that it outdoes the first film, but I wasn’t expecting it to outdo it and I’m not sure it needs to do that.  It just needed to be really good and be an excellent conclusion to Phase 2 of Marvel, even though, technically the conclusion of Phase 2 is going to be Ant Man, but spiritually this is the end of Phase2.  Bring on Phase 3 I say, I’m ready to go."}, {"rating": "9", "text": "The movie was awesome despite few obstacles..all in all it was a great film and most of the credit goes to Joss Whedon...I liked the part where he played on with the minor characters like Vision,Falcon,Agent Hill etc..."}, {"rating": "8", "text": "The second movie avenger is more dark than the first but the film is good and more brutal and little gore in scene ultron, by the way story is look great. Cap action fighting is much more than the first, and at last much action in this movie.."}, {"rating": "7", "text": "Age of Ultron is a solid sequel, but it is not as good as the first Avenger film.\r The action is the biggest strength of the film, just like all recent Marvel movies. It's incredibly fun and exciting to watch.\r The humor was pretty good too, although I found that it was a bit over the top and not always used at the best moment, similar to Thor: Dark World.\r Marvel also did a relatively good job of developing the characters, considering that this film had even more superheroes than the first Avengers, as well as incorporating lesser superheroes from previous films, like War Machine and The Falcon.\r The biggest weakness of the film is the plot. It was far too similar to the first film. For example, it had the \"Avenger versus Avenger\" fight sequences early in the film, the \"Avengers get their ass kicked\" segment in the middle, the \"trickster\" villain who seeks to beat the Avengers by turning them against each other, and the final sequence where the Avengers fight against disposable henchmen, save random people, and defeat the villain. It was all too predictable and got a bit tedious near the end.\r The dialogue was also too cheesy at times. Overall, it felt like the events of this film didn't really matter that much, except to set up the story for the third film.\r In the end though, we don't watch Marvel superhero movies for deep storytelling or meaning, but for the fun action and witty one-liners. The film was certainly fun to watch so I give it a solid 7/10."}, {"rating": "10", "text": "I watched the midnight screening of this movie, which began around 11:00 p.m.. I was exhausted because the film is long, which is practically its greatest downside when you are in a packed theater with a horrible seat. The experience was great, however. I went with 6 friends, and when I arrive to the theater, I received a poster that I will hang on my wall.\r The Avengers: Age of Ultron is bigger, better, and boulder than the first film. Sure it repeat a lot of same formulas of the first film, but to different effects on a very different narrative. In the first Avengers movie we had the Thor vs. Hulk fight sequence. In this movie we were given the Ironman vs. Hulk. There are complains about its repetition but frankly speaking, who doesn't like the vs sequences. As geek, nerd, fanatics we love the cartoon episodes and comic books that pit characters against each other. We know their gods, and just because they're good guys it doesn't mean the writers shouldn't cater to our interest and see them clash. Reviews who complain about the writers of Age of Ultron following the same formula clearly aren't fans of the Marvel universe.\r The movies pacing was solid. I personally had a difficulty following the first hour of the first avengers movies. I felt the first hour was sloppy because they jumped too much between too many characters and too many universes trying to push a union and conflict. In other words, the editing was sloppy until the end when I was simply wowed by the big explosions.\r The Age of Ultron, however, is better. It doesn't struggle with introducing too many universes, too many character for the first time, and so we get a better film over all - with a better first hour as well.\r I did not mind the concept of beauty tames the beast in the film. Black Widow is stunning (beautiful) and the Hulk is, well, the hulk. They may not have the best onscreen chemistry together, and yes it came out of nowhere, but attractions and romance, in truth, can be spontaneous.\r Ultron is a bad-ass villain in the film. I loved his wit, and I was rooting for him. The true disappointment in the film was the Vision. He was forged with the strongest steel in the world, carries an infinity stone, and his best power is his cape-shape-ability. He was pathetic. Looked cool, however.\r Sure the movie is not consistent with the Marvel universe. To get Ultron for this movie, changes had to be made somewhere. Marvel studio didn't want to wait to follow the natural story arc to reveal Ultron as a villain, so they had Stark create Ultron in an attempt to save the world from future threats. Ultron then goes on quest to form the perfect body, which the avengers end up stealing and animating - ultimately becoming the Vision. However, Tony Stark's bouncer is on par with the rest of the heroes, so he more of gimmick than a story changing character.\r A major part of the story revolves around Hawkeye and Black Widow. People complain about this, but I think it was a change from the traditional formula were we follow the overpowered bad-asses of the film. Hawkeye is more vulnerable than Tony Stark, Captain America, or Hulk. Seeing him get wounded and almost killed actually helps you realize how power the other heroes really are. Like they say in the film, the Avengers are like gods.\r When you watch this film, don't focus on who creates Ultron and realize you  were given a piece of candy. Enjoy It. The film looks good and the cast of actor are solid. Plus, I like the fact that Ultron is created from the mind that exists within the infinity stone (making him a bad-ass villain for the film), and the same infinity stone which the Vision carries on his forehead. I hate the fact that he had to die at the end. I was hoping a part of him survived.\r In truth I give this movie a 9/10, but I always score 1 point higher than I actually believe its worth to try an offset extreme scores which are at times, overly bias, intentional, of ignorance - once you've studied statistic you realize how useless these numbers can sometimes be, especially \"averages scores\".\r There is a heartfelt death in the film."}, {"rating": "9", "text": "+ The well known humor\r+ Deeper insight of the characters\r+ interpersonal atmosphere between the actors seems to be perfect\r+ although there is some recycling of interactions, story line and such, there is still enough new to discover\r - Ultron as the bad guy is very pale and uninsteresting- even though he DOES have some kind of personality, he totally lacks of charisma- the essential ingredient for a good villian.\r- I doubt that there will be enough new stuff to fill into another sequel. In every saga, there comes the point where you get bored by seeing the same actors acting the same way again."}, {"rating": "0", "text": "Simply put this sh*t was lame.  What they did to Ultron was unpardonable.  Dude was a wuss compared to in the comics.  Then there was the stupid romance between mr. green and ms. black.  Just made her look like a slut tbh.  Then there's all the unnecessary actions they took with QS character.  Only thing that was cool was Vision.  But they couldn't even explain his powers."}, {"rating": "0", "text": "‘Now this is going to make a good story’ states Don Cheadle optimistically towards the end of this epic Marvel adventure, when in fact it has proved to be anything but. The first film wasn’t actually too bad, but Marvel have reached their nadir here with this preposterously over long (Eugene O’Neill long is right!) bum numbing drivel. It suffers from an excess of toos. Aside from being too long, there’s too much noise, too much exposition and too much nonsensical talk. In fact, too much of everything bar entertainment. It is essentially brain dead gibberish. Ok, so the special effects are as predictably good as they should be for a film of this budget but everything else falls way short. The actors’ characterisations add nothing by way of compensation. Indeed, two members of the ‘B’ rated cast distinguish themselves by not cutting it even alongside this low standard of performance. Aaron Taylor-Johnson seems to whisper his way through the film as if not convinced he should be there, and Samuel L Jackson is just laughable in his eye patch. He has never been able to live up to his iconic early performance in ‘Pulp Fiction’ and most of his appearances these days are in thankless supporting parts like this. As in previous Marvel outings the attempts at humour fail miserably. However, unintentional laughter is evoked here by attempting, but failing, at pathos in a handful of scenes. The budding romance between Johansson and Ruffalo is lame and one only wishes that they would take their own advice to each other and ‘Disappear’. At the film’s close as I raced for the exit I was only too well aware that everyone else was transfixed, eagerly anticipating the possible nuggets that were going to be thrown up during or after the credits. I knew that I need not stay as I was never going to encounter these characters again in my lifetime. Amazingly the critics have been surprisingly kind to this elephant sized mess. To re-energize my brain I went home and tuned into an episode of the TV series ‘Wolf Hall’, an entertainment of real pedigree that offered me more in five minutes than this did in 141."}, {"rating": "7", "text": "Age Of Ultron delivers every single bit of fan service, you have come to expect from Marvel and Joss Whedon. But it has it's let downs. The action sequences are amazing, frenetic and fun, especially the opening forest fight scene with the Avengers leaping off trucks and destroying everything in their path. The movie is a tedious one though, it strives to be a majestic experience, but it is slow and tiring and by the end, you still want to watch more Wheadon, and that is what makes me buy Age Of Ultron. Even though it was slow and boring at times, I want to watch it again. It is full of Easter eggs, hidden secrets and pop culture references. Which makes it fresh, original and kind of...exciting. Overall, we have seen better from the gang, and this won't be the last time we see them, but this movie still is a must watch. Love it or hate it, Age Of Ultron delivers, and you better admit that before Hulkbuster kicks your ass."}, {"rating": "10", "text": "Marvel continuing their streak of amazing films. Packed with breathtaking action scenes, a compelling story and some really great acting from the cast (with special mention to Ultron himself). Ultron does give off a vibe similar to Heath Ledger's Joker, delivering some truly deep dialogue and offering some humour here and there. Also, a fantastic set-up for Infinity Wars down the line, inflate your hype balloons people"}, {"rating": "10", "text": "This movie surpassed my expectation! The movie is basically a better version of the first Avengers movie, Avengers Assemble. They were able to pick up on their mistake on how useless Halkeye was in the first movie, and made him a lot more relevant and cool in this movie. The movie contained lots of action just like the first one. The whole plot of the story will tie in very well to the next Captain America and Avengers film. I also loved that Quicksilver and Scarlet witch did not have a tiny part in this movie also. They were as important as the rest of the Avengers. Paul Bettany did a incredible job portraying/acting Vision and the costume design was PHENOMENAL. James Spader's voice acting of Ultron was also on point. (Overall: An amazing movie with tons of action, humorous moments, awesome costume design and GREAT acting, 10/10) (I also suggest you wait for the credits to end for a little Avengers 3 clip)"}, {"rating": "8", "text": "Lightning hasn't exactly struck twice in the same place with Whedon's ambitious follow-up to his 2012 classic, but movie fans the world over shouldn't fret - despite some hit or miss subplotting, \"Avengers: Age Of Ultron\" is still an unbelievable cinematic experience with a daring amount of characters and some truly magnificent set piece work."}, {"rating": "8", "text": "This was a great sequel. It was not ruined by the trailers, everything fit, still funny and a good continuation from Avengers 1. It was a little long, but it did not feel like it was grinding. Cannot wait for Avengers 3."}, {"rating": "8", "text": "Awesome movie!\rSuper fun action!\rMarvel stepped up!\rVeronica! HULK!\r...!\r..!\rThis movie don't need no reviews.. what am i doing? =.=\rcharacters needed..done!"}, {"rating": "9", "text": "+ Great Action.\r+ All the great Avengers in one movie.\r+ Great story.\r+ A bit of humor is always good in an action movie imo.\r+ Looks impressive, with cool special effects.\r+ I like the villain overall (could be better).\r - I'd like to see a bit more of Hulk, I didn't think he got enough screen time."}, {"rating": "8", "text": "This was a good movie that, while it couldn't live up to the original, definitely sets the stage well for what's to come ahead. It also represents a changing of the guard, so to speak, for the Marvel Universe. With their new focus geared more toward characters who have yet to have their own movies yet (Ant-man and Dr. Strange), the end to this movie does a good job in setting up what is to come, especially if they make a stand alone Spider man movie where he joins the Avengers later on. As for the movie itself, it certainly wasn't as dramatic as the first one was and alot of the impact was lost with a few too many faces. Also with the shift in direction, a few characters probably won't be heard of again until the next Avengers movie way down the line. However, this movie will probably be more remember for what it sets up than what actually happened. Ultron was a decent villain but certainly not memorable. And Tony Starks involvement in creating him and the consequences in doing it are kinda slipped under the rug. But, seeing as it is Whedon's last Marvel movie, I can kinda see him leaving a few holes here and there. There's also a definite problem with the number of characters introduced here. A few got lost in the shuffle IMO and the fact that they can't use the term \"Mutant\" because they don't own the rights to it also felt disingenuous. We all know what the Scarlet Witch and Quicksilver are and I felt like they thought I was stupid the entire time they said they were \"experiments\".\rStill the movie is a good watch, especially for a fan of the series. You definitely shouldn't watch this without watching the rest of the marvel movies though. This is a movie made for the fans and it doesn't apologize for it."}, {"rating": "9", "text": "Age of Ultron is smorgasbord of action and visual delights.  But don't think that's all you'll get to enjoy.  Ultron also explores real, salient problems with poignancy.  Consider the role of strong AI in our near future. This is not science fiction.  The high points of this debate are covered with aplomb and, of course, intense visual feedback.\r It's inevitable that this film will be compared to the first; however, after screening the first film a few weeks ago, it's clear that the negative comparisons are driven by nostalgia.  This is not a muddled, over-hyped Michael Bay slugfest.  It's a thoughtful and intense story of powerful humans, enigmatic aliens, and the dangers that threaten to corrupt us all."}, {"rating": "7", "text": "It's hard to review this film, knowing that the three-hour director's cut we're going to eventually get will almost undoubtedly be better. As a stand-alone film, \"Age of Ultron\" is kind of all over the place. But as the punchline to Marvel's Phase Two, it's a satisfying ensemble character piece, packed with action, and better than it needs to be, but only just slightly. Thanks to Marvel cutting out 40 minutes from the film, the plot is both standard in its progression, and weird in its digressions and handling of violence.\r The good stuff definitely outnumbers the bad: the Seoul highway chase was intense, beating out anything in Furious 7. Paul Bettany's take on The Vision was a revelation, easily the film's most interesting character. The Hulkbuster sequence ruled (despite it sugarcoating the consequences of the destruction wrought). Most of the character moments, such as those between Black Widow and Bruce Banner, were great showcases of Whedon's ability to layer these otherwise two-dimensional characters.\r My biggest problem with the action is that it wants to play on such a huge scale, but doesn't show much of the consequences. There are hardly any shots of dead civilians, although based on the insanity of the destruction it should be assumed that hundreds if not thousands of innocent people died. Instead, the film spends a lot of time showing our heroes rescuing people. It defies logic. Although I understand this is technically a Disney film, the bloodless violence makes me a bit uneasy.\r If it were not for Whedon's sardonic writing and the well-choreographed, fast-paced, kinetic action scenes that seem ripped straight from the pages of Marvel's finest hours, this movie would have been just par for the course. Jay from the RedLetterMedia's \"Half in the Bag\" described this film as the first time we are seeing chinks in the Marvel machine's armor, and I would have to agree. The editing is so disjointed at times, with half-realized ideas, that I would have to say the sum of this film's parts are greater than the whole. For instance, the sequence in Africa with Andy Serkis' character felt shoehorned in. Thor's subplot was almost entirely cut out. The relationship between Tony and Ultron was undercooked. Captain America has some great lines (\"it's not about who's better, it's about who's right\") but zero character development. But one of the film's glaring problems (for me) was Ultron, who didn't turn out to be as menacing as he made himself out to be in the first few scenes. His insanity angle was not convincing to me. However, my brother really liked the portrayal of the character, so there's that.\r So the film is not perfect. But for what it is, it's a flawed epic, one that will likely disappoint some and invigorate others... but given the ever-increasing audience expectations and demands, it's actually amazing how well it holds together. Thank you Mr. Whedon for your hard work, and I wish you all the best moving forward."}, {"rating": "7", "text": "Avengers: Age of Ultron is not a good movie, and no, I am not going to follow that up with “It is a GREAT movie.”  My favorite characters had the least to contribute to the plot other than providing the muscle to beat up all of the lowly thugs.  Given how the movie ends, it felt like it was all an experiment to see how well a third movie in the franchise could be if all of the stars decide not to return.  I suppose it stands to reason that Iron Man has had three standalone movies to cover that character, and that Hawkeye was completely underutilized in the first movie in the franchise, but I would have appreciated it if they could have found a better balance of screen time for this too huge cast.  It really felt like a producer told the writer that they had all of these high priced actors signed on to appear in the thing, so he had better come up with a scene featuring every single one of them, no matter how little it pertained to the plot or was entertaining, “we have exposition to explain, get that former TV actress in there”.  I am a longtime fan of the director’ (Joss Whedon), previous work.  I suppose he did a good job strictly as a director, as all of the actors put in fine performances, but the dialog and plot were all just very flimsy.  Maybe, there was a great move shot, and it was just edited together poorly.  Here I go apologizing for Joss, again.  I need to stop doing that.  I don’t know, but either way, the experience was just not fun.  The camera was always zoomed in so close to the actors that I could never keep up with where anyone was within a scene.  I theorize that this was because the sets were either very underwhelming or all virtual, so the camera stayed in tight to prevent the audience from noticing.  Don’t think that I failed to find any redeeming values in the movie.  The gags built around Thor’s hammer were funny, and there was one stand out fight in the first half with the Hulk that had its moments, but you could watch these scenes on YouTube and skip the other two hours.  Let’s face it.  If you have already seen every other modern Marvel movie, nothing is going to stop you from seeing this one.  Just make sure to set your expectations accordingly beforehand.  I still have hope that the Avengers franchise can be fun in future installments, but, in my opinion, they did not pull it off with this one.\r Avengers: Age of Ultron - C"}, {"rating": "10", "text": "Better than the first one, I can say fore sure. There is more action, more jokes, more... SUNLIGHT! Yeah, the first one has a SERIOUS lighting issue. Flat out Amazing."}, {"rating": "10", "text": "TEN BEST THINGS OF THE MOVIE\r10 The first battle\r9 Hulk vs Hulkbuster\r8 Scarlet witch and Quicksilver\r7 Vision\r6 Quicksilver Vs Hawkeye\r5 Scarlett witch Vs The avengers\r4 Ultron\r3 Ultron, Quicksilver and Scarlet witch Vs Iron man, Thor and captain america\r2 Every badass Avenger\r1 Final Battle"}, {"rating": "10", "text": "This is a fantastic follow-up to Avengers. Its in the top tier of MCU movies alongside Avengers, Guardians, and Cap 2.\r There were a handful of things I didn't like, but they are easily overlooked in the bigger picture.\r-Quicksilver deserved a longer period of character development, which will now not happen (due to spoiler)\r-The case scene with Thor. WTF? How much of this scene was cut? Even as a Marvel fanboy, I struggle to understand the relevance to AoU, beyond setting up Thor 3...nonsensically\r-the romantic subplot. I HATE romance in movies in general, unless thats the point of the movie. It felt forced, and it felt unnecessary.\r There are times when it seemed too much was cut in editing - after all, Whedon said that over an hour of content was cut from the final product. I hope for some kind of director's cut DVD."}, {"rating": "10", "text": "I was very entertained, well worth the admission for IMAX 3D. I think you should see it for yourselves, if you enjoyed the other marvel movies then you will enjoy it. Some People might say there are plot holes and whatever, its a comic book movie geared to entertain and it does it so effortlessly!!! I loved everything about this movie!! Even that one \"Oh Wow\" point in the theater I really really enjoyed it! Thanks to everyone who participated in this film!\r I can't wait to watch it again!"}, {"rating": "7", "text": "Age of Ultron is tries to do too much with far too little time. So many characters and plots are introduced in this movie that two movies would have made far more sense—maybe three. Ultron is a great bad guy, but is severely undersold as a result of the aforementioned issue. There just isn't enough time for any of the new characters to be developed. Their development is either rushed or lacking.\r Additionally, too much time was spent on mindless action sequences. It's the usual fair we've come to accept from super hero movies: people screaming in the middle of the street as our heroes perform physic-defying feats. Don't get me wrong. These scenes can be fun. However, with so many characters and so many sub plots involved these scenes seemed more tedious and drawn out.\r How long can we make groups of extras run around and scream while dumping millions into CGI? With Age of Ultron, we may have just found out.\r All of this is a waste of real estate with a canvas full of interesting and exciting characters we wish would grow, but are stunted and shortened.\r But hey, Hawkeye finally got some much needed fleshing out. I guess we got that.\r Avengers: Age of Ultron isn't a bad movie, but with Marval's movie pedigree, I expected better. It's definitely not a waste of your money, but if you're looking for the best Marval movie to date, you'll be disappointed."}, {"rating": "10", "text": "Words cannot express how awesome this movie is. 2 1/2 hours of fighting that actually feels like a comic book. best marvel movie hands down go see it.....in fact go see it right now"}, {"rating": "9", "text": "Age of Ultron is not quite on par with the first Installment, but that does not mean for a second that it's a bad film by any means. The action is wonderful, the humor is just right, and it is \"Eye Candy\" that you will eat up every last bit of. I wouldn't not name this the best Marvel film in the franchise, but it's a worthy competitor."}, {"rating": "9", "text": "A sequel I felt that was just as good as the first film.  The way they bring all these characters into this story without it being so bloated that it drags it down is an incredible achievement.  This film was just so much fun.  A"}, {"rating": "9", "text": "Excellent!! So funny like dramatic at the same time...it have his fails, it's not perfect obviously...but it's so spectacular, there is so much action...the characters are well development (I appreciate that Hawkeye is more developed in this movie)...this movie has so much characters and it does a nice work giving correct screen time to all of them!!. It was very nice!! for me it is better than the first... I'm no so convinced by the villain, but I hope he could appear again in the big screen, i think this is not his last stand...he will appear again."}, {"rating": "7", "text": "I didn't watch the first one,but I would be surprise if he was worst than this one.It's not a bad movie,it's just that the movie is too long and is not that interesting.I\"m really disappointed."}, {"rating": "7", "text": "The first Avengers film was perhaps the perfect popcorn film, full of thrills and laughs without attempting to inject even the most minimal amount of thought. Its sequel manages to be deeper, both in plot and characterization. The result is a more interesting film, if not a better one."}, {"rating": "7", "text": "Th original The Avengers is great cause we see for the first time that all of Marvel's characters join forces together to fight a threat.The sequel is good but doesn't have the magic of the first film but it is a continuation of the franchise.Avengers:Age Of Ultron isn't as bad as many people are rating too low.The film is still good with great visuals and great characters we know and love,the villain is okay rather the older villains of Marvel except Loki,The movie is fun and enjoyable,humor is good but the romance is forced out.The movie felt in a hurry on the first than gets slow in the 2nd act than the 3rd it felt like they're in rush.The Avengers is still a goof film that anyone can enjoy except DC Fans. ;D"}, {"rating": "9", "text": "Although the second installment doesn't deserve a clear 9/10, I had to give it a better score because it actually did elevate the prequel. Certainly, much of it was the same - the humor, the actors (more-less), the cinematography, the basic plot, the special effects, Hulk smash - but 'Age of Ultron' managed to add just a little something to it (having said that all of the elements from the first movie have been presented equally good) all that made the film better. It wasn't anything special, which is logical when you look at the big picture (this is, if you trust Marvel's calendar, a somewhat filler movie, made to lay out the events of the future movies, which should leave a deeper impact), but it was enough. The sequel is far more serious than the first installment, having certainly come out of the test phase, and it adds some depth to the whole franchise. This being said, one has to note that such an addition was not a problem and that the movie didn't lose any of it's original magic and awesomeness (yes, it is still a fun and awesome movie where RDJr. f*cks up and the rest of the team have to clean up after him!). Beside that, the movie gained much with the newly added characters - James Spader was absolutely fantastic providing the voice and character of Ultron (the guy was actually funny - creepy - but funny!), which is what I can say about Paul Bettany as Vision (yes, the guy actually picks up Thor's hammer!); adding other characters from the franchise (such as War Machine) was also a great move; and, finally, the Maximoffs, Pietro and Wanda, or Quicksliver and Scarlet Witch - amazing! Their genesis is great, Aaron Taylor-Johnson and Elizabeth Olsen were brilliantly cast and their whole story was absolutely amazing (although they could've made it a little happier...). Also, what I liked is that they finally explained why Hawkeye is useful to the team (really, after seeing 'The Avangers', I've been wondering as to what that guy is doing there - I mean, Robin Hood, really?).\r As far as the negative aspects go, they're pretty much standard (lack of real depth, some unbelievable scenes and such), but you didn't expect 'Schindler's List' in the first place. It was also weird that all the people in Sokovia speak and understand English, the Audi in Sokovia and... it could've maybe ended some 15 minutes earlier but, well... you can't have everything.\r All in all - a great, fun and entertaining movie you should definitely see (especially if you're a fan - it's a must see!) and a great transition to the next phase of Marvel's Cinematic Universe."}, {"rating": "9", "text": "A brilliant experience and worthy addition to the Marvel universe. Fast paced and engaging, with a delightful script and epic action sequences which are superbly executed, you will not be disappointed. The performances are fantastic, which is to be expected, and the storyline is once again both prescient and compelling, providing commentary on the human condition and insight into the deeper natures of the Avengers themselves. The CGI is a little clunky initially, and some moments are oddly edited, nevertheless this is a must see on the big screen. 9.11/10"}, {"rating": "9", "text": "They do it again! Just great, but really need to pay attention and understand the movie to enjoy it. XMen has a better quicksilver though.the story could be better but sequels have a hard time meeting everyone's standards."}, {"rating": "7", "text": "A lot was against this film. Creating an enjoyable sequel to the surprisingly well-made mega hit \"The Avengers\" without following the typical cliched blockbuster format was, at least how I looked at it, pretty impossible to pull. But somehow, like the Captain America sequel, Marvel does it again; they juggle the **** of characters, both new and recurring, within the film with plausible ease and also manages to balance the quality of the story with some excellent fight scenes here on and then. Not saying this is a groundbreaking movie that overrides its predecessor, but overall a really enjoyable marvel movie that successfully prepares itself for future expansion sequels."}, {"rating": "10", "text": "To me this movie was near perfect in my opinion, let me start by saying that I absolutely loved the first avengers, up until Ultron the first Avengers was my favorite comic movie of all time but if there was one thing about the first movie that I wanted improved... it was to know the characters on a more personal level then we got in the first movie, Age of Ultron fixed that in spades...\r The party at Stark's place where we got to see them mingle with non avengers as well as eachother, then how they were just hanging out having fun trying to lift Thor's hammer, you found out that heroes can have personal lives by meeting Hawkeye's family (Who knew) some might not have liked Black widow falling for Banner but I didn't mind it at all, in fact I really enjoyed it if for No other reason after 4 movies we finally got to see Black widow as a person, with feelings and wants and needs and not just the shield assassin...\r Comic movies are my favorite genre but what some of them do is make it all about the hero saving the day and little or nothing else, to see them in a normal environment with friends, family or loved ones it adds a whole new dynamic to these movies, getting to Know the characters on a more personal relatable level only adds to the mythos of these characters and in the end it can only add to the experience giving this movie a 10 feels like i'm cutting it short of how good it truly was but since that's the limit for how high the scale goes that's what i'll give it."}, {"rating": "8", "text": "There is no doubt that Age of Ultron is spectacularly staged and a well crafted comic-book film (I will be dissecting those action sequences frame by frame once I get the blu-ray) but Whedon leaves me wanting more- I thought it would actually transcend escapist entertainment and compete in the same league as The Lord of The Rings, Raiders of the Lost Ark and The Dark Knight. Ultron is hardly a memorable villain, he is given a few delicious lines of dialogue here and there but his overall motivations prove to be quite simplistic. Superhero fans will be pleased but hardly anything here for cinephiles to get excited for"}, {"rating": "10", "text": "Watching this film was a true and wondrous joy. It is epic in every single sense of the word and redefines the term \"the best superhero movie ever made\". Outstandingly made sequel!"}, {"rating": "8", "text": "Avengers: Age of Ultron defiantly is not a 'ho-hum' rehash of the first film, however the weakness lies in the fact there is not much breathing room and again another villain without a solid plan. Overall well made and opens up different ideas for the sequels, but itself does not stand alone. The highlights are Jeremy Renner's 'Hawkeye' getting a back story and the Maximoff twins respectively."}, {"rating": "9", "text": "Avengers: Age of Ultron is fast paced, funny, and is filled with awesome action sequences. Ultron serves as a great villain with a god complex, and the movie is surprisingly deep. However the film suffers from some spotty special effects, some uneven tone, and rushed pacing. That being said, while it's not as good as The Avengers, Age of Ultron is a great time at the theaters."}, {"rating": "9", "text": "While this movie wasn't perfect, Avengers: Age of Ultron was a blast to watch from start to finish with exciting action, some funny dialogue, and some moments that truly make you think about humanity. It's a marvelously great film."}, {"rating": "10", "text": "I came out of ‘Age of Ultron’ resolute of it’s supremacy over it’s predecessor, and after a nights sleep, I must say that I’m certain of this. In contrast to the first film, this is for a more mature audience, though it can be thoroughly enjoyed by all. Avengers: Age of Ultron is fun, action-packed, emotional and intense, and there’s lots of humour throughout. The fight scenes are very impressive; they’re very well choreographed and some of the sequences are unlike anything we’ve seen before. What’s more, the film is simply beautiful. The way in which some scenes are framed and lit are just gorgeous and a work of art - truly. Joss has certainly upped his game with this sequel."}, {"rating": "8", "text": "Avengers: Age of Ultron is an exciting ride from start to finish.  For readers of the comic, it was nice to see characters like Quicksilver, The Vision, Ultron, etc being transformed to the big screen for the first time.  Also, this movie made me like Hawkeye more as a character.  Props to the actor for a stellar performance.\rUltron was kind of an \"on again off again\" villain.  Sometimes I was like, \"yeah, he's frightening\" and other times I was just confused on what he was doing.  But when they most needed him to be a villain and ditch the humor (during the final battle) he delivered.\rOverall, this set the stage for a lot of other things to come in the MCU but nevertheless, a very enjoyable, awesome movie that everyone should definitely check out."}, {"rating": "7", "text": "The movie was entertaining and fun to watch, even though there were many overused cliche type things, that you probably have seen already in other superhero movies. Still, if movies are made for entertaining people, then this definitiely was entertaining and fun to watch. If you want something more complicated and with a complex story, then I suggest something else though. It did have some flaws and weird plot points, but I am giving it a rating of 7, because you can't expect anything complex and with plot twists out of a superhero blockbuster movie - this is a movie that many people go to cinemas to watch on big screen because it has many explosions, action etc. If you make the story complex etc, you'll disappoint those who expect the usual thing, so I guess they just don't want to risk changing anything."}, {"rating": "9", "text": "Watched it.  Liked it.  That's about it.  Any complaints about the movie should be taken with a grain of salt.  Everyone should know EXACTLY what type of movie this is going in to the theater.  All the poor scores make it seem like they were expecting some masterful epic.  It is a superhero movie and it is fun to watch.  I will say it is a bit long though."}], "recommendations": ["thor_the_dark_world", "the_suicide_squad", "thor_ragnarok", "transformers_dark_of_the_moon", "poseidon", "bumblebee", "edge_of_tomorrow", "hercules", "kingsman_the_golden_circle", "fantastic_beasts_the_crimes_of_grindelwald", "guardians_of_the_galaxy", "ant_man_and_the_wasp_quantumania", "bloodshot", "black_panther_wakanda_forever", "justice_league", "glass", "riddick", "terminator_genisys", "the_last_witch_hunter", "gemini_man", "serenity", "incredibles_2", "creed_ii", "the_a_team", "x_men_apocalypse"]}