{
  "id": 106,
  "title": "Awake",
  "starring": [
    "Gina Rodriguez",
    "Ariana Greenblatt"
  ],
  "runtime": 96,
  "genre": [
    "Drama",
    "Science Fiction",
    "Thriller"
  ],
  "description": "After a sudden global event wipes out all electronics and takes away humankind’s ability to sleep, chaos quickly begins to consume the world. Only Jill, an ex-soldier with a troubled past, may hold the key to a cure in the form of her own daughter. The question is, can Jill safely deliver her daughter and save the world before she herself loses her mind.",
  "releaseYear": "2021",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/uZkNbB8isWXHMDNoIbqXvmslBMC.jpg",
  "categories": {
    "plot": 5.947368421052632,
    "acting": 5.125,
    "ending": 6.0,
    "soundtrack": 5.0,
    "cinematography": 7.0,
    "familyFriendly": 3.0,
    "funny": 7.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "2",
      "text": "The entire idea of the film was great and I thought it started off interesting as well but it just fell apart. Poor acting, Plot takes a huge turn for the worst, and it ends poorly as well."
    },
    {
      "rating": "0",
      "text": "Did anyone notice that this movie is a complete rip off from a Stephen King short story?"
    },
    {
      "rating": "5",
      "text": "Suspenseful, but way too much of it just makes no sense and the plot is riddled with holes. But, it did hold my interest. It certainly wasn't overlong. It just never convinced me."
    },
    {
      "rating": "1",
      "text": "Facts in the beginning are far from accurate. As others before me have said there are quite a few holes in this that make it fall short."
    },
    {
      "rating": "0",
      "text": "Utter crap. Made my eyeballs bleed. Extended voiceover for brain-dead plot. Hayden is the new Keanu. Line: 'This is so f- obvious!' Exactly."
    },
    {
      "rating": "1",
      "text": "Just returned from seeing this movie and I have to tell you it was laughable from start to finish. C. Haydensen gives the same stiff performance he is famous for, there is a strange oedipal overtone throughout the movie, the plot \"twists\" are predictable (think absurdly when you predict!). Even the lasy line of the movie was predictable. The dialogue is clunky at best (\"My new heart will love you too\" Hahahaahahahahaha!) I laughed out loud when the credits rolled. Bad bad bad movie."
    },
    {
      "rating": "0",
      "text": "This movie sucked. I can't stress that enough, people. I even saw this for free and I'm still mift. I want my life back."
    },
    {
      "rating": "0",
      "text": "This is a poor excuse for a Suspense/Thriller. I got bored during the credits! All this hype for this movie, I was expecting a very high quality movie... I was SO wrong! They got two of the worst actors (Hayden Christensen- Sar Wars: Episodes 2 and 3 and Jessica Beil- Fantastic Four franchise) to star in this dreadfull movie! I don't know if this movie would have been good with good actors, but these two didn't exactly didn't help!"
    },
    {
      "rating": "5",
      "text": "I just left feeling unsatisfied somehow. it just wasn't very good storytelling. but it was about as entertaining as a night at home watching a good drama tv show."
    },
    {
      "rating": "3",
      "text": "Awake huh, well guess what, I fell asleep."
    },
    {
      "rating": "1",
      "text": "\"Awake\" doesn't wake me up. I saw a lot of people sleeping and snoring in theaters when watching this boring crap. Their suspenses and thrillers don't thrill me... BOO! Get out of the damn film! (not Jessica, lol)."
    },
    {
      "rating": "3",
      "text": "i don't know what to say about this movie. and my review must be at least 150 characters long to be submitted and i don't know what to write about this ****"
    },
    {
      "rating": "5",
      "text": "This movie gets two big thumbs up for eye candy and the background story. The plot and flow of the movie however are both weak. This film is based on phenomena of anesthetic awareness, something we saw for the first time, 15 years earlier in a Tales From The Crypt episode. It was a great episode and seemed like it should make a good movie, but this wasn't it. Awake moves very slowly and is pretty boring for the first 45 minutes or so, and after that it just jumps around. Hayden yelling at people who can't hear him, gets old, quickly, but it continues to go on and on and on. It has a good cast, its a great idea, but it's only a decent story, and much too slow for me."
    },
    {
      "rating": "10",
      "text": "I really liked it! It's amazing to take a glance at the pain of a mother and witness what they're capable of... I went home and gave my mom a hug! Good cast, great acting.. It was great!"
    },
    {
      "rating": "8",
      "text": "I rarely disagree with the critics; they are generally quite on par but this time some of them are waaaay off par. This movie was surprisingly very good, acting was decent but the storyline was amongst the best I have seen in a while."
    },
    {
      "rating": "7",
      "text": "I found this suprisingly enjoyable. Christensen and Alba gives better than average yet still mediocre performances. Story is generally gripping, except for a few spots. Overall a worthwhile film"
    },
    {
      "rating": "7",
      "text": "This movie has more suspense than I expected and is not nearly as predictable as I feared. The critics are way off on this one. Ebert has it about right. Realistic it is not, entertaining it is. The movie ends just before it starts to get old. Worth seeing."
    },
    {
      "rating": "9",
      "text": "This movie s truly getting undercredited by those who don't understand it and appreciate it for what it is. What it is, is an emotional thrill ride that adds an enitrely new dimension of fear to cinema. It involves the theme of powerlessness, and the narrative techniques illustrate how death parallels life. The performances are all sympathic, except for perhaps Jessica Alba, who didn't have enough range for her characters depth. Please see this truly suspensefull thriller that does for the operating room what Pyscho did for showers."
    },
    {
      "rating": "9",
      "text": "I went to see it with a group of friends, and we all loved it! It's not a horror movie, and is less of a thriller than I expected, so if that's what you're expecting you may be disappointed. However, there are unique and shocking plot twists, and a fantastic end, which may or may not come as a surprising tear-jerker. It's surprisingly like The Invisible, so I would recommend it to all fans of that movie."
    },
    {
      "rating": "7",
      "text": "At start u think its drama, but as movie folds out, it reveals its true \"face\". Must see on all scales, because of great acting, great script and fabulous directing. Tension is on all the time, and this is just one of those movies that are not welcomed proprely by audience, dont ask me why...7 stars."
    },
    {
      "rating": "10",
      "text": "This movie is really great, this critics don't know shit!!"
    },
    {
      "rating": "6",
      "text": "Look, I enjoyed it until the final ridiculous plot turn where all was revealed and the whole thing was wrapped up. What could have been an engaging thriller was cut short with the VO telling us what we actually wanted to see."
    },
    {
      "rating": "8",
      "text": "This movie is surprisingly good. one of the best plot twist i have ever seen. some part are touching. pretty face alba, what more do you want? i am afraid the critics got it all wrong. watch it!"
    },
    {
      "rating": "9",
      "text": "Very surprisingly good."
    },
    {
      "rating": "10",
      "text": "This was great! She is far too hot."
    },
    {
      "rating": "8",
      "text": "I wanted to see it because of the disparity between what the critic's score was and the viewer's score was on Metacritic. They were both right."
    },
    {
      "rating": "7",
      "text": "Highly underrated flick. Worth seeing."
    },
    {
      "rating": "8",
      "text": "Cool movie weird twist....you gotta go see it to get what i mean...not a movie to bring your girl to see it with."
    },
    {
      "rating": "10",
      "text": "This movie was AWESOME!!! I don't understand the critics."
    },
    {
      "rating": "7",
      "text": "I expected worse, but since I'm having surgery next week, I was curious. The movie held my attention and was a very servicable thriller. Read Ebert's review before passing judgement."
    },
    {
      "rating": "7",
      "text": "If you're awake during open heart surgery, wouldn't you scream gutturally non-stop for an hour rather than have lucid prosaic thoughts about your pain? \"Awake\" plays like \"Next\" meets \"Eternal Sunshine of the Spotless Mind\". That last sentence sounded like a joke. That's my point. It's not a matter of if you think too hard, we're talking about thinking, period. \"Awake\" is unintentionally funny. It's Robin Cook gone meta. When one of Clay's ribs is cracked, he forgets to scream. Since Clay(Hayden Christensen) is rich, he chooses Dr. Jack Harper(Terrence Howard), a second-rate doctor, as an extension of his re-education, the crowning touch that follows his first subway ride to Brooklyn and sex with a working-class girl(falling in love with Jessica Alba is not hard). Clay wants to be one of the common people. But c'mon. We're not talking about eating at Taco Bell instead of a five-star restaurant; we're talking about open-heart surgery! \"Awake\" is a bad film; a hoot. But it's undeniably fun. Evil is fun. If you're going to make a second-rate thriller, it's bound to be fun if your main character recovers his memory. Alcoholic fathers in Santa suits are fun. \"Awake\" is painless. Clay forgets to scream; you'll forget to, too."
    },
    {
      "rating": "1",
      "text": "A premise ruined by terrible writing, stupid characters, awful acting and medical protocol has gone out the window. Hayden Christensen acts all whiny both in voice over and on camera. Jessica Alba's character is a terrible mastermind in killing somebody during surgery, she forgets to cover her tracks and avoid anything that can be used as evidence, Numerous surgeons including the anesthesiologist, don't act like real-life surgeons; not to mention Terence Howard's character has numerous malpractice suits against him, and who's only chosen because he's a friend of the protagonist (idiot).\r Anybody who had surgery and/or have medical knowledge, can point everything wrong depicted. This should be dissected, cooked and fed to starving kids."
    },
    {
      "rating": "9",
      "text": "I loved this movie. It has enough twists that you aren't bored or predicting most of the twists. Of course, it has some predictable twists but all movies do. It has its shortcomings but overall, it was a great movie. I would definitely buy this movie."
    },
    {
      "rating": "7",
      "text": "The story was interesting, the acting wasn't bad at all and the movie was quite entertaining.It's not a great movie, but it was still totally worth the watch."
    },
    {
      "rating": "4",
      "text": "Well, for me to say that movie a lot I abuurio despite an incredible true story, not anyone hire him to stand out as one of the worst of the year 2007 ."
    },
    {
      "rating": "6",
      "text": "Suspenseful, but way too much of it just makes no sense and the plot is riddled with holes. But, it did hold my interest. It certainly wasn't overlong. It just never convinced me."
    },
    {
      "rating": "7",
      "text": "This is a really gripping movie, which is yet another of the 'not for the squeamish' type movies, if you don't like seeing medical procedures, scalpels, open chest cavities(!) etc. then you should probably give this a miss, although the scenes that include all of that aren't particularly overstretched, shall we say. The concept behind the movie is quite unsettling and the scenes of Clay walking around while he's really still on the operating table are quite spooky. Its pretty chilling to think that such things can happen and indeed the movie starts off with some information, statistics that mention 30,000 people a year suffer from this condition where their awake after having been put under anaesthetic. Of course 30,000 people out of millions means the chances of it happening are slim but watching the movie, the main part of it did come across as quite believable. I would question whether everything that happened would happen the way it did if it were real life (I can't go into much detail or I'd be giving away too much of the story) but the basic concept of being conscious while undergoing surgery is quite believable and it taps in on one of peoples fears - the fear of paralysis, if but temporary (or is it?). At the start of the movie, we see Clay has apparently stuck up quite a strong friendship with his surgeon, indeed he even encourages him to lay on the operating table one afternoon and to hold a scalpel, to get a feel for what was going to happen, warning him about the dangers and the chance of him not pulling through after surgery. Of course, he had been in hospital alot being on the transplant list, so he probably would have got to know those around him but looking back on it, it is a bit creepy to think how hard the surgeon, Dr. Jack Harper, worked to befriend Clay. I named this review the ultimate betrayal as I feel that it really is, at least its a big betrayal for a surgeon to decide to, for their own purposes, purposefully botch surgery and of course that makes it quite chilling, to watch as Clay shouts in protests and even sheds individual tears on the operating table but being unable to do anything physically to change the situation. I suppose its one of those movies that stays with you for a little while afterwards, it could enduce a small bout of paranoia even. Hayden Christensen does a good job portraying Clay, his voice straining to be heard in 'real life' and Jessica Alba also gives a good performance as Clay's newly married wife. The other main character apart from the surgeons in the operating room is Clay's mother, Lilith (played by Lena Olin), who isn't happy with the news she gets from Clay only hours before he's in hospital being prepped for surgery. One thing I found a bit convenient was why the medical team involved with performing the surgery hadn't been vetted somehow, that certainly crossed my mind but I suppose its a fairly minor point. Oh plus I did pick up on the fact that one of the main bad guys is of colour - I don't like to get into race issues but for some reason I did pick up on the fact that the only non-caucasian (or that I remember anyway) in the whole movie, let alone in the medical staff, happened to be one of the main villains, which I felt was perhaps a bit unfair but maybe I'm over thinking that, I don't know.The movie makes you question those you put faith in, the motives of others and it has some interesting twists which I hadn't seen coming. I thought the ending was perhaps a little rushed but then it had a good impact so maybe it was better being short and sweet - indeed the movie is only about 1 hour and 20 minutes long.As a tense thriller, yes I'd recommend this movie, as long as your not upset by the odd medical scene/your not too squeamish. The cast are good and the story is quite chilling, unfolding with a good few twists along the way. Its a gripping movie that makes you think, so yes, this is worth a watch in my opinion."
    },
    {
      "rating": "1",
      "text": "____________________________________________________  1/10 * So Langweilig."
    },
    {
      "rating": "10",
      "text": "A have to watch movie! Some people may say its \"slow pace\" or \"boring\", well lets be honest, they just didn't analyze the movie properly. This incredible movie has so much more meaning to it, and its a good way to remind people that sometimes trusting people can lead to consequences. This movie made me think, cry and really changed my perspective on life. You HAVE to watch this!"
    },
    {
      "rating": "7",
      "text": "With 85 minutes, this is tight enough a thriller, with one or two great concepts."
    }
  ],
  "recommendations": [
    "old",
    "would_you_rather",
    "seven_pounds",
    "house_at_the_end_of_the_street",
    "the_loft",
    "next",
    "a_perfect_getaway",
    "shut_in",
    "man_on_a_ledge",
    "sanctum",
    "limitless",
    "i_see_you",
    "better_watch_out",
    "jumper",
    "the_twilight_saga_breaking_dawn_part_1",
    "tusk",
    "frozen",
    "devil",
    "the_happening",
    "i_am_number_four",
    "brightburn",
    "bird_box",
    "till_death",
    "now_you_see_me",
    "marrowbone"
  ]
}