{
  "id": 3829,
  "title": "Babel",
  "starring": [
    "Brad Pitt",
    "Cate Blanchett"
  ],
  "runtime": 143,
  "genre": [
    "Drama"
  ],
  "description": "In Babel, a tragic incident involving an American couple in Morocco sparks a chain of events for four families in different countries throughout the world. In the struggle to overcome isolation, fear, and displacement, each character discovers that it is family that ultimately provides solace. In the remote sands of the Moroccan desert, a rifle shot rings out  detonating a chain of events that will link an American tourist couples frantic struggle to survive, two Moroccan boys involved in an accidental crime, a nanny illegally crossing into Mexico with two American children and a Japanese teen rebel whose father is sought by the police in Tokyo. Separated by clashing cultures and sprawling distances, each of these four disparate groups of people are nevertheless hurtling towards a shared destiny of isolation and grief.",
  "releaseYear": "2006",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/cDy5iZL2C01jiT5wDSE4jOvoT52.jpg",
  "categories": {
    "plot": 7.230769230769231,
    "acting": 7.3125,
    "ending": 8.0,
    "soundtrack": 8.5,
    "cinematography": 5.0,
    "familyFriendly": 2.6666666666666665,
    "funny": 9.5,
    "action": 9.5
  },
  "reviews": [
    {
      "rating": "10",
      "text": "A breathtaking human story  of startling perception and beauty.  It is wonderfully acted and achingly tangible.  Brilliant, and a must see."
    },
    {
      "rating": "10",
      "text": "Magnificent, emotionally charged exploration of the lines that divide us. Terrific acting, gripping plot. Ignore the loser trolls who abuse this review site; Do yourself a favor and watch this film."
    },
    {
      "rating": "9",
      "text": "Flashing between Tokyo, Morocco and Baja Mexico, this third entry in Inarritu's triptych (along with Amores Perros and 21 Grams) is an emotionally saturated story about the interconnectedness of joy and pain in our world. While Tolstoy argued that \"all happy families are alike; every unhappy family is unhappy in its own way,\" Inarritu's masterpiece demonstrates the universality of pain and loss in a beautiful tribute to the fragility of the human condition. As Inarritu responded to a question about Tolstoy's famous line (after a screening of Babel at the Telluride Film Festival), \"he got it wrong.\""
    },
    {
      "rating": "9",
      "text": "Interestingly, the reviews of this movie provide an amazing insight into how stupid the average Movie goer in the U.S. really is. Take a read of some of the negative reviews. Seriously its like monkey got on a computer somewhere and just spewed inane garbage all over metacritic.\r This is a very good film with a great deal of emotional and intellectual appeal. I think they represented the cultures and the dysfunction really well while keeping the movie interesting by bouncing the story around in 3 parts. Really good movie if you are not a chimp, highly recommended.\r P.S. if you liked any of the transformer movies, this is not the film for you."
    },
    {
      "rating": "10",
      "text": "I thought this was absolutely incredible! Excellent film making in my opinion. Director Alejandro Gonzalez Inarritu takes another multi-faceted story but this time, he perfects it! Babel is even better than his 21 Grams of 2003. The story is emotional; the characters are fascinating; the music is gripping and the script is wonderful. The acting is outstanding. How Jennifer Hudson won an Oscar over Rinko Kikuchi or Adriana Barraza I don't know, both were absolutely stunning. A great film about people and communication! Nominated for 7 Academy Awards including Best Picture, Babel is one of the best films of 2006!"
    },
    {
      "rating": "6",
      "text": "Don't get me wrong; \"Babel\" is a grim yet seducing movie, one that is capable of diving deep into the diverse, infrastructural lives of others. But what pulls the pants down for this one is that there is no progress or moral. The movie just.....ends."
    },
    {
      "rating": "5",
      "text": "So sad that this is what passes for insight. This film is far too laboured, much like Crash, and offers little in the way of humour, lightness of touch, or even horror, to carry its plodding pace. A shame, as this is clearly an important topic, and we are all seeking art which sheds light on globalisation."
    },
    {
      "rating": "2",
      "text": "What a boring movie, it might have a background message but to me it seemed a totally UNNECESSARY MOVIE, brings nothing fresh to the viewer and it's nothing that you haven't seen in the news. It's like watching the news but with actors."
    },
    {
      "rating": "3",
      "text": "What a disappointment. Relentlessly miserable, relentlessly predictable, no engaging characters, portentious, pretentious, cliched. To paraphrase EM Forster 'well said, but not worth saying\"."
    },
    {
      "rating": "0",
      "text": "This is one of the five worst films I have ever seen. Insanely boring and pointless. Dullness for the sake of dullness. Saying nothing as a pretentious \"message.\" Spare me."
    },
    {
      "rating": "0",
      "text": "Absolutely horrible. Most boring movie I've seen to date. Anyone who claims artsy, \"deep\" movies like this are anything but crap has eaten one too many retard sandwiches. The same kind of people that think someone like Jackson Pollack has talent, and created \"art.\" It's all a pantload."
    },
    {
      "rating": "5",
      "text": "This noble failure was one of the more overrated films of 2006. Its slow pace, often pretentious cinematography and occasional incoherence make me wonder what some of the fuss was all about. Easily the highlight of this misbegotten effort was the performance of Adriana Barazza as the Mexican nanny. (Incidentally, who is Brad Pitt talking to in his last scene if she is being detained by immigration authorities?)"
    },
    {
      "rating": "5",
      "text": "I checked Babel out at the library so I didn't waste my money. Just my time. The value I got out of it was the \"slice of life\" from different cultures in Japan, Mexico and Morroco. The movie itself was exploitation draped in a thin pretense. Sure they spoke different languages. Sure they were connected, but in a very contrived way. That doesn't excuse depicting a child pleasuring himself after seeing his sister naked, or a deaf Japanese school girl flashing in public, or a dying woman making out with her husband while using a bedpan. That's just perverted."
    },
    {
      "rating": "3",
      "text": "This movie was nominated for best picture of the year? Really? I will say this much, the acting is well done. However, the plot is not great. Why are you telling me a story of the daughter of this Asian guy who sold the rifle to the Moroccan man? Why not show the scene where you sold the rifle? Why am I supposed to care about this Asian girl that's trying to seduce everyone? So the Mexican lady is taking the kids to a wedding in Mexico and there is a border confrontation on their way back. How did they get into Mexico? Did they just drive in without checking passports of parents' consent? So Brad Pitt is talking to his kid and the Mexican lady at the end. What happened to a scene showing how the kids were found? What happened to the Mexican dude who drove away and left the lady and their kids? It's not as bad as \"21 Grams.\" \"21 Grams\" has some of the worst editing in any movie that I have ever seen. It's such a frustrating movie. \"Babel\" tries to make a point by having all of these small connections. Why not add another hour telling me the life of the Asian girl's mother and have the connection be that it was her mother? Seriously, how stupid are these connections? Who takes tour on a bus that's driving in the middle of nowhere in Morocco? I'm sorry Academy. You could chose any other movie in 2006 to take Babel's spot. The movie has 0 replay value. I take nothing from this. 0 value."
    },
    {
      "rating": "0",
      "text": "Oh come on - this movie sucks.  We left after 1:15 and I heard the movie went downhill from there.  Unconnected, I did not care about the characters. Lame mysterious past events won't make may stay to watch a movie that gets nowhere in 1:15. Don't waste your money... even at the matinee.  Rent an classic movie, pop some popcorn and stay at home."
    },
    {
      "rating": "10",
      "text": "This movie was fabulous. It captured the connections of the world and how everything is related. This movie can represent how one can not be blamed for anything alone. The movie was intriguing moreso than being suspenseful."
    },
    {
      "rating": "7",
      "text": "The title of the movie it explains it well..The definition of babel is a scene of confusion and noise, which is based off the biblical definition. The movie wasn't bad but the music was horrible and the story of the asian girl is irrelevant and has hardly anything to do with the main story. It is worth watching if you have netflix or something.  To the people who overly sensitive people complaining about the \"graphic\" parts of the movie you need to stick with Disney movies if you don't like it.  They are simply showing real things that happen in this world, it is rated R for a reason and even explains the graphic natures of the movie before you watch it. Overall the movie was good, it just could use some touches to make it better."
    },
    {
      "rating": "1",
      "text": "I was thinking about the possible things I could colour my life with after seeing this ..yeah what exactly was it, sure it wasn't a movie. So don't masturbate behind rocks or your brother will euhm..miss. Don't spy on your sister or your father will do the clap-dance. Never travel or your kids may die in the desert. If you're in a desert, then don't leave any kids behind, sure I'll remember that one. Never leave the bus area if your wife is about to die by bleeding to death or they will continue their journey without you...yep, gotcha. And the most important one: don't you ever ever dare to decline a deaf-mute naked lady or she might jump of the balcony. My god, I'm pretty sure that Alejandro Gonzales still sucks his thumb way too long when he falls asleep."
    },
    {
      "rating": "0",
      "text": "It's the worst movie I ever seen. It tries to connect the life of  people from different cultures but it actually reinforces negative stereotypes such as Hispanic people as partying all the time and being irresponsible, Arab people as being agressive and rudimentary and Asians as behaving creepy. And, of course, it places the American family as the cornerstone for the storyline, like they are the normal people in a chaotic world. I really don't get what the autors want to say, like \"oh, great Americans, be careful because the world is full of creeps and irresponsible people but you do everything all right?\""
    },
    {
      "rating": "3",
      "text": "Dull, boring and uninteresting characters. I can't believe there is so much critical acclaim for such a terrible movie. The characters are bad, especially that of the Japanese girl."
    },
    {
      "rating": "1",
      "text": "Conceptually beautiful and cinematically hideous. I was lulled into seeing Babel by its national acclaim and avid reviews. However, this movie offers a far cry from anything that could represent characterisation or entertainment. A dull, overrated attempt at a masterpiece."
    },
    {
      "rating": "4",
      "text": "Too drawn out - the length of the movie didn't add to developing the story/stories."
    },
    {
      "rating": "3",
      "text": "Babel attempts to be the next syriana mixed with city of god, yet fails. The story lines are not nearly connected enough. The story about the girl in Tokyo has nothing to do with the rest of the movie. All the movie did was depress me and make me wonder why I didn't see the departed again instead of wasting my 10 new york dollars."
    },
    {
      "rating": "3",
      "text": "Too fractured and predictable--seen it before, derivative, morally murky."
    },
    {
      "rating": "10",
      "text": "AWESOME MOVIE. You will need to pay attention, as this movie is not for the uneducated ones. It is a mind twister....loved it. MUST SEE"
    },
    {
      "rating": "3",
      "text": "A fragmented, frustrating film. The three strands of the film are so loosely tied together that the finished product comes apart at the seams. Yes, I'm aware the overriding messages of global responsibility and the 'butterfly effect' of our actions, and the self-important, self-indulgent nature of these themes shines through nauseatingly."
    },
    {
      "rating": "10",
      "text": "Since Amores Perros, Mexican cinema has completely changed. Almost 80% of the films made in Mexico now follow this 3-story segments. Babel is a triumph, it's not perfect but the level of acting is the best of the year. The message of it is consistant, penetrating, LISTENING, this film could end up with many many noms for the Oscars."
    },
    {
      "rating": "10",
      "text": "This is a very complex and touching film. Probably the best film from the trilogy. Great performances great screenplay. The best story was the Japanese girl, very very touching and great performance by Kikuchi. Amazing film, maybe not the best of the year, but still great."
    },
    {
      "rating": "10",
      "text": "I haven't seen a film that moved me as much and impressed me with its use of the medium to visually tell a story of such epic proportion as to how one single choice, mistake or moment in time can affect the lives of so many people around our world simultaneously. At times, its window on our world - in all of its complexity as well as its simplicity, its frailty and strength, its poverty and wealth, power and hoplessness, brutality and kindness - Was so realistic I almost forgot I was watching a movie. I found myself riveted to the screen, on the edge of my seat, actually praying that each of the many developed characters stories would somehow work out ok. In all of the tragedy it communicates about our liability to communicate, tolerate, accept, allow and embrace each others crises - Which it does masterfully and visually without beating you over the head - And it took me until the actual rolling of the credits and the dedication to children - to realize that the movie was actually much more about hope than despair. I also think that people without children will not relate even remotely as powerfully to this film as those with. I haven't left a theatre in a long time considering how much my own choices can affect so many. A powerful, masterful and visually stunning piece of film as art."
    },
    {
      "rating": "4",
      "text": "This movie could have been a lot better and I'm sorry I can't compare it to \"Crash\". That movie was great. I don't see the relevance in showing a young boy pleasing himself and a young girl showing us her vagina and her naked body. The movie didn't need that to make its point. It was kinda gross and unneeded. I'm not sure how many normal adults wanted to see children in that matter. They should have left that out and kept to the storyline."
    },
    {
      "rating": "9",
      "text": "Brilliant film that selects 4 story-threads, playing them out to demonstrate truths about communication, time and the human condition."
    },
    {
      "rating": "5",
      "text": "The majority of the film is simply uninteresting. The storyline set in Tokyo is the most impressive mostly because of amazing cinematography but the others just seem to lack fundamental excitement."
    },
    {
      "rating": "9",
      "text": "Has some flaws, but does so much right that it gets the high score for intentions and for delivering some of the most stirring acting and beautiful cinematography to be seen in what has been a bad movie year. Two of the other best movies of the year (regardless of the Oscars) Pan's Labyrinth and Children of Men also emanated out of Mexico and it's an extraordinary burst that should be treasured."
    },
    {
      "rating": "0",
      "text": "Their is no point. It tried to be Crash and Traffic but it was neither. Nobody changes. Nobody grows. Just stupid decisions and sorrow. Painful to sit through. Thank god I didn't pay to see it."
    },
    {
      "rating": "8",
      "text": "If you want to see Brad Pitt, go see another of his movies, because his role in this one, while excellently portrayed, is little more than a cameo appearance. The movie ending was an interesting segment, in a film of segments, but was baffling, and less than satisfying. The acting in all parts was beautiful to watch; I am not sure the director really had a unifying vision. I suspect the name Babel is supposed to explain and excuse a lot of this disjointed and empty feelings away."
    },
    {
      "rating": "4",
      "text": "Ambtious but very tedious."
    },
    {
      "rating": "10",
      "text": "One of the finest achievements in the world of cinema since the turn of the century. This film was breathtaking, tragic, intense, gripping, everything. A solid, unquestionable masterpiece."
    },
    {
      "rating": "8",
      "text": "Engaging, phenomenal acting and script writing. If I have to fault it, the story doesn't hang together as it might, and there are various political statements with no development, like the housekeeper's deportation back to MX."
    },
    {
      "rating": "8",
      "text": "I thought the movie was very effective in portraying American attitudes towards immigrants even when traveling abroad. Having traveled quite a bit in Africa, India and the Middle East I can vouch for the authenticity: People with barely a pot to pee in extending hospitality rarely seen in this country."
    },
    {
      "rating": "0",
      "text": "This was one of the worst movies I have ever seen. Extremely unintelligent with overt attempts to be dark and mysterious. Flawed plot lines abound. Don't waste your money on this garbage. This is yet another example of how terrible the filmmaking industry has become. The only thing I can say positive about this movie is that it is not another ex-saturday night live actor pumping out another potboiler film. Iit sucked... badly!"
    },
    {
      "rating": "6",
      "text": "One of the most intelligent movies to recently come out of Hollywood, but it deliberately confounds the viewer in the early going. Nothing can be gained from doing so. The best movies are entertainment that flows effortlessly, not a test of one's attention span and interrelational skills."
    },
    {
      "rating": "2",
      "text": "This is indeed a well made film. However, the film they decided to make is a pretentious piece of political-statement garbage. If you are stupid enough to not realize that people are interconnected in small, ultimately meaningless ways, check this movie out and realize it at last...at the same time you can contemplate suicide as you witness an incredibly pessimistic outlook on life."
    },
    {
      "rating": "9",
      "text": "What do some of these reviewers want, THE definitive story that links all mankind and explains all of human life that ever was? This is a great film - but only a film. If the connections betweens its story strands are tenuous, so what? As each story progresses - full of intelligence and heart - that story in front of you's all you need, and each of them succeeds dramatically. Don't forget - this is entertainment, albeit serious, and it delivers visceral thrills throughout via a strong script, incendiary, cutting edge film- making, and compelling performances."
    },
    {
      "rating": "10",
      "text": "This was brilliant. Intelligent and emotional, subtle and powerful, adult and humane. Ten out of ten."
    },
    {
      "rating": "10",
      "text": "Ok so I just watched Babel. Maybe it's me but basically it was a good story...that centered a crochity old white woman getting shot in the neck and the police force from the middle east, japan, and the united states frantically tried to save her. I mean come on! If this country hasn't learned or doesn't know by now that the white woman is the reason and subsequently the downfall of this country then maybe they should watch this movie. Everybody who came in contact with these parasites was either killed, beaten, or arrested. Sure the Eastern kids shouldn't have been playing with a gun but what the fuck was a tourist bus doing out in the middle of the desert? Why do white people travel where they aren't wanted? I thought it was funny the passagers on the bus began to freak out because they were subject to loosing control, subject to not being mystified as white gods. Money doesn't by you safety, police anywhere can only beat to death so many people before the oppressed get tired of it. Here's this white supremacist feminine patriarch, who, as I've experienced women like her, pretend to have balls until they're someone comes along with bigger ones that is, hunched in a fetal position helpless while the world is literally in chaos. And don't forget the white kids. No maybe it was a bad choice for the housekeeper or nanny to take them to Mexico City with her...I would have just left the devil spawn and gone to my son's wedding. I can always get another job. Then she could have stayed over and if the same relative was going to drive her home the least he would have had was a hang over. I think this movie illustrated the problem with creating a social structure that caters to skin and bullies, if they can't kill you with kindness, or by you off, the rest of the world to follow along with their childish schemes."
    },
    {
      "rating": "8",
      "text": "Good story and pace with beleivable characters. I really enjoyed this movie."
    },
    {
      "rating": "8",
      "text": "i enjoyed this movie. it isnt the best movie ever, but its unique, memorable, and an overall entertaining story. the plot unfortunately can be slow at times, but if you are interested in babel you should check it out."
    },
    {
      "rating": "6",
      "text": "Wonderfully done, but the ending is very vauge."
    },
    {
      "rating": "4",
      "text": "Very overrated. The acting is very good but this movie is so long and boring! The exact same structure is used in 21 grams but that movie was fantastic. Babel is just disappointing."
    },
    {
      "rating": "1",
      "text": "Too long and too boring!"
    }
  ],
  "recommendations": [
    "slumdog_millionaire",
    "the_lobster",
    "children_of_men",
    "lost_in_translation",
    "crash",
    "sin_nombre",
    "okja",
    "into_the_wild",
    "the_butterfly_effect",
    "her",
    "antebellum",
    "downsizing",
    "no_country_for_old_men",
    "vivarium",
    "a_ghost_story",
    "boyhood",
    "the_tree_of_life",
    "hugo",
    "soul_surfer",
    "cloud_atlas",
    "chappie",
    "apocalypto",
    "the_road",
    "pay_it_forward",
    "mother"
  ]
}