{
  "id": 840,
  "title": "Baby Driver",
  "starring": [
    "Ansel Elgort",
    "Kevin Spacey"
  ],
  "runtime": 113,
  "genre": [
    "Action",
    "Crime"
  ],
  "description": "After being coerced into working for a crime boss, a young getaway driver finds himself taking part in a heist doomed to fail.",
  "releaseYear": "2017",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/rmnQ9jKW72bHu8uKlMjPIb2VLMI.jpg",
  "categories": {
    "plot": 4.730769230769231,
    "acting": 4.6976744186046515,
    "ending": 4.230769230769231,
    "soundtrack": 5.230769230769231,
    "cinematography": 4.5,
    "familyFriendly": 3.0,
    "funny": 6.166666666666667,
    "action": 5.352941176470588
  },
  "reviews": [
    {
      "rating": "5",
      "text": "I wanted to like it and thought I would. A novel idea, a kid who drives like Joey Logano but needs to constantly listen to music to drown out tinnitus. A car driving savant but the novelty wore off. Lead was well cast, Spacey and Fox were miscast and the story was uneven. Turned soapy at the end . It looked like scenes taken from a dozen movies and blended together. It wasn't the worst movie I've seen but should have been so much better"
    },
    {
      "rating": "10",
      "text": "Edgar Wright has so much talent and he proves it yet again with Baby Driver. The most stylish, fabulous and original movie I've seen all year. Action-packed, music-packed, dramatic and laugh-out-loud funny."
    },
    {
      "rating": "10",
      "text": "Baby Driver is a fun, exciting film from start to finish they don't go anywhere downhill and very second his pulse pounding. Edgar Wright made an awesome and fun original film with all the actors doing their absolute best in this high stakes film."
    },
    {
      "rating": "6",
      "text": "I am surprised this movie got so many great reviews.    The characters just don't seem plausible.   The sound track is great I will give it that, and the idea about the main character having a 'disability' is interesting but isn't explored properly.   Yes, the car chase scenes show a lot of great filming but get pretty redundant.   The main character doesn't really cut it as the 'reluctant' criminal.   He only goes straight when his hand is forced.   He could have made a positive decision much earlier in the film.   And all the killing and violence just seems thrown together in some kind of unreality.   It is hard to cheer for the main character who only seems to redeem himself at the very very end, which is much too late at least for me.   It had a lot of potential but lost me in the end."
    },
    {
      "rating": "6",
      "text": "Baby Driver is a fun run-of-the-mill action movie, but it's not as spectacular as the reviews would have you believe. The driving sequences are good, but the inter-personal conflicts are far too contrived. It's a heist movie, it's not hard to come up with good reasons for tension between criminals, and yet Baby Driver bends over backwards to create artificial tension with random thugs picking a fight with Baby even after he's saved their bacon. The movie also leans heavily on a romance that just doesn't really work all that well in my opinion, the girl is hopelessly in love with Baby from their first scene and it doesn't really go anywhere after that. Finally, Baby's over-wrought conscience is a bit hard to square with his actions in the film. We're supposed to see him as a good kid in a bad spot, but he is an accessory to dozens of serious crimes and put civilians in danger constantly. In the end, I would recommend Drive instead, but Baby Driver is still a good time."
    },
    {
      "rating": "5",
      "text": "It's fascinating just how quickly Baby Driver becomes the typical formulaic nonsense I would expect from less experienced directors. Edgar Wright follows The World's End with this film about a teen named Baby who's a driver. It really is quite difficult to make a heist film like this uninteresting, but it's little more than a good soundtrack and fun car chases."
    },
    {
      "rating": "7",
      "text": "The movie is good, but not great. It is an action movie, so please do not expect anything amazing from the plot.The music is okay. The combination of a few characters do not quite make sense to be there, but they have to be there for the plot.I enjoy the movie and would recommend you to watch it."
    },
    {
      "rating": "5",
      "text": "An excellent idea, but poorly executed. The casting is appealing, the music is compelling, but the plot fails to deliver. At no point it drags you into the characters or the role they play. A strong beginning, with potential and with force. Nevertheless, as the story continues, it loses it's edge an it prolongs into the monotonous and perhaps, even boring. A good \"Lazy Sunday\" film if you spare the time, but most definitely not a must watch."
    },
    {
      "rating": "10",
      "text": "Something about this movie makes you feel good after watching it. The adrenaline of Baby's car chases just fill you with passion and emotion. The comedy is spot on, never forceful or bad written, and the editing is made so good that you feel that you're a character. The soundtrack is perfect, and it compliments all the scenes that they're used in. Amazing movie"
    },
    {
      "rating": "7",
      "text": "The wheels fall off at the end, pun intended, but like most Edgar Wright joints its not the destination, it's the ride.   Solid 7.5 ... Worth renting."
    },
    {
      "rating": "7",
      "text": "A fantastic first half, (especially loved the opening scene, and the \"was he slow\" remix) then the instalove just sends this in a tailspin. She never questions anything he does, she just goes along with it."
    },
    {
      "rating": "5",
      "text": "This movie was so bad I can't even finish a review because thinking of it makes me disgusted. I'm so glad I waited for DVD release rather than going to the theatre. I'd give it 5 for acting, music and overall execution, but everything else is just awful. I honestly regret watching it."
    },
    {
      "rating": "4",
      "text": "Un film branchouille qui se la joue cool, presque une \"comédie musicale\" avec des flingues et des bagnoles... et une publicité ambulante pour l'ipod (mais qui utilise un truc pareil, sans déconner ?). Presque une \"comédie musicale\", car si personne ne chante dedans, le film entier est un festival de chansons et le leitmotiv bien entendu du personnage principal, conducteur autiste mi-rain man mi-kévin.La \"chance aux chansons\" donc, des mélopées ringardes à s'ouvrir les veines, de la musique de merde non-stop : putain, j'ai les oreilles qui saignent ! surtout qu'elle gueule à qui mieux mieux et qu'il est rare dans le film de ne pas entendre cette chiasse à longueur de plans. C'est là un défaut totalement rédhibitoire.Pour le reste, à savoir la cool attitude de notre autiste du volant, ses antécédents gnangnan, son amourette avec la serveuse planplan, on s'en bat les steaks en force et je reste poli. C'est une histoire tirée d'un Kinder Surprise pleine de caricatures ambulantes avec des relents tarantineux nauséabonds.Le film n'est pas un désastre pour autant, grâce à de belles poursuites en bagnoles et quelques fusillades, plus une poursuite à pied bien fichue en bonus. La réalisation est dans l'ensemble correcte, parfois presque agréable, d'autres fois un tantinet suspecte mais ç'aurait pu être pire, alors on ne fera pas la fine bouche plus que nécessaire.A part un trou d'air dans le premier tiers, le rythme sait ensuite rester soutenu jusqu'à la fin avec des doses de grand spectacle. La fin qui s'avère tout aussi gnangnan que Baby kévin et sa greluche d'ailleurs. Si on pouvait mettre la musique en sourdine, ce serait un divertissement assez présentable (bien que visant clairement un public ado) mais en l'état, Baby ipod nous casse un peu trop les noix pour qu'on passe l'éponge."
    },
    {
      "rating": "5",
      "text": "After being booted-off of Ant-Man, Edgar Wright put his energy into (what I imagine he considers to be his own Barry Lyndon), Baby Driver. Wright wanted to make a super-cool film like Drive or Widows, except Edgar Wright isn't cool – he's a massive nerd. Which is fine, and it worked well for  Scott Pilgrim vs the World, where you can embrace the finely choreographed action scenes, and laugh/cringe along with the rest of it.\rBaby Driver starts out like a tightly-choreographed modern-day musical, but soon devolves into a fairly generic action film. The soundtrack, blared at full-volume is interspersed with frustrating  whispered, mumbled, dialogue, which often feels like it's being read off the page, with exception of Lily James who brings a bit more emotional depth than the rest of the cast, who seem out of it.\rThere are a decent 20-minutes at the beginning of the third act where the tension builds. Unfortunately, the film then descends into every other action movie cliché you can imagine.  The jokes aren't funny, but there are some clever set-pieces and flashy editing.  A better concept would have been to focus on the Bonnie & Clyde romance, with protagonist jacking cars and driving to the music which is already playing – which happens once when 'Baby' takes the car from the ATL Twins. For someone who professes to have watched 1000 great films (link omitted per site policy), (yet admits to falling asleep during Tokyo Story), it surprises me how immature and shallow Baby Driver is. I'm sure the film's target audience of teenagers believed it to be a masterpiece when they saw it. I only hope once they grow up, they will roll their eyes  at the thought.  Regardless, Edgar Wright is still a great film-making talent with a unique voice. This film may not have appealed to me, but others loved it. Best of luck to him."
    },
    {
      "rating": "5",
      "text": "On the plus side: most of the analogue action is good; there are a few decent laughs; the soundtrack is generally a pleasure; and Jon Hamm and Jamie Foxx do better than you'd expect with standard-issue Hard Man roles. On the down-side: Baby himself, slick moves or not, is a bland hero, too half-assed cool to register as anything but a nerdy director's fantasy alter-ego; his romance with singing waitress Debora is too-cute by half, stretching whatever credulity the pulpier stuff has, and clashing badly with the final act's cold-blooded mayhem; Kevin Spacey's on auto-pilot; and the ending trails off where it should speed across a definitive finish-line. Entertaining in fits and starts but, on balance, it hits too many pot-holes to fully satisfy."
    },
    {
      "rating": "5",
      "text": "Essentially a two hour-long gag that wears increasingly thin as the film progresses. Characters behave in implausible and erratic ways, and with a cripplingly bad fan-service ending the end result is a film with little substance that will reward re-viewing, aside from spotting choreographed quirks in the fringes of the frame you may have missed on your first watch."
    },
    {
      "rating": "4",
      "text": "Baby driver is boring, shallow and immature as the title suggests. Very little about this film is above avearge. The story is too familiar, come on, a story about a get awy driver, really? This movie is completely uninspiring.Either Ansel Egort or his character was stiff, uninspired and annoying. Sorry, but this is a no."
    },
    {
      "rating": "7",
      "text": "Baby Driver is a fantastically fun film that features a lot of fast paced driving scenes and a killer soundtrack. The opening scene is so iconic in and of itself that it almost immediately makes the film for me. It sets up the idea that the film will be flowing with the soundtrack and that music is important to the main character because of some personal trauma.Where it drags for me are with two performances, those of Jamie Foxx and Kevin Spacey. For me Jamie Foxx is trying too hard to be an intimidating bad guy that he almost reaches Jared Leto's 'Joker' for me. Meanwhile, Kevin Spacey's performance is pretty lackluster and forgettable, even before the news about his past came out. His roll could've been better filled by someone else with a better presence, perhaps Kurt Russel? Overall it's a fun movie and has a lot of intricate sequences that should be watched with a keen eye, definitely give it a watch."
    },
    {
      "rating": "6",
      "text": "I seriously don't get all the hype about this film. Sure I love Edgar Wright's direction in Hot Fuzz, Shaun of the Dead and with Scott Pilgrim, but this movie is substandard at best as a comedy heist film. First, it does neither of its genre elements particularly well - I wasn't laughing nor particularly thrilled for most parts. The plot is very generic and lacks any sense of urgency for the most part. Character motivations are all over the place like Edgar Wright's hair and editing-wise, wasn't anything special. People seem to harp on about how great the action is and how its well timed to the songs, but I don't see anything great about it to be honest. Perhaps why I didnt like this film is that I've seen it before. That was a masterpiece called Drive and Baby Driver seems to borrow everything about it. The good things about Baby Driver is that it is midly entertaining and some of the songs are okay, I guess, apart from the fact its blasting at the audicence 24/7 like an angsty teen's mixtape."
    },
    {
      "rating": "6",
      "text": "If you like car chase movies with Tarantino levels of violence and snappy chit chat with top class actors, then this is the movie for you, except the for lead actor that is.. Ansel Elsgort is awful, way out of his depth with no screen presence at all, zilch zero nada. In fairness the writers were mawkishly nauseating in establishing his character's virtue 〔Dead Mom, Savantesque, Loves Old Music, Looks after Black disabled Step father, Kind to old ladies, Self Sacrificial....where's the sick bag 〕which doesn't help. Regardless he's abysmal and he ,with the capable assistance of a jarring music director with no sense of tone or timing , ruin it for everybody and we get a 6 at best.....8.5? Get outta here shills"
    },
    {
      "rating": "4",
      "text": "Not sure what all the hype was about.  The soundtrack?  Well, pulp fiction this is not.  The story was pretty generic and nothing new.  In fact it was about as cliched a driving/heist movie as you can get.  All the characters including the main character are so over the top its hard to take them seriously even for one moment.  I'm not sure what kool-aid all the critics drank from but this movie is neither original nor entertaining."
    },
    {
      "rating": "4",
      "text": "Baby Driver falls short in comparison to Wright’s previous works. A film comprised of flat dialogue, clichéd characters that lack complexity, and sporadic bursts of energy that constantly tease the audience of the film it could have been. I lost count of how many times I slowly shook my head in disappointment, while starring into Jon Hamm’s dreamy eyes. While the plot can be boiled down into one simple sentence, it’s a mystery as to why the film clocks at 112 minutes. Perhaps a consistent pace could’ve made the film a bit more palatable. All in all, Baby Driver will not disappoint your average movie go-er. It’s filled with cheap thrills and a predictable story so your friend can proudly yell, “I told you that would happen!”. However, for those more literate in film, prepare for the worst."
    },
    {
      "rating": "6",
      "text": "This movie was only creative and fresh on the surface. Underneath, the plot line is not very interesting and certainly not new. While undeniably slick and well-shot, I found that the characters lacked any sort of realistic dimension that would allow me to care much about the plot. I was disappointed given the positive reviews and word-of-mouth."
    },
    {
      "rating": "4",
      "text": "i so so wanted to enjoy this movie.  in a summer of really terrible movies this had the promise of being a gem amidst all the dreck.  the first 15 minutes were really entertaining, a bit surreal in parts and innovative.  unfortunately it all went downhill from there with an incredibly uninspiring plot, weak acting from bored actors.the music gimmick is exactly that, a gimmick.  the lead actor is like watching paint dry.  the dialogue and character motivations are weak and inexplicable.  the female characters are uninspired stereotypes.what a wasted opportunity for something that could have been amazing. i give it a few marks for the impressive driving scenes and some of the musical bits.  the rest of it is just bad formulaic trash."
    },
    {
      "rating": "4",
      "text": "Years ago, there was a vehicle called the \"Conquest,\" which was the Dodge-Chrysler version of Mitsubishi's \"Starion.\" It was butt-ugly, and I don't mean Beyonce's derriere, nuh-uh.But one year, va-va-VOOM they remade that sucker into a sleek and sexy ride, a ride that looked like the feeling of someone you've lusted after suddenly tipping you the wink.Folks, \"Baby Driver\" is the OPPOSITE of what I just described.If you're familiar w/ Edgar Wright's best-known directing efforts, for examples the brilliant \"Spaced\" series, his snappy trilogy of films starring Simon Pegg and Nick Frost (also from \"Spaced\") and the ultra-hip \"Scott Pilgrim\" which turned Mary Elizabeth Winstead into The It Girl of this decade, folks if you enjoyed those works and were expecting something in that vein, but w/ an even cooler soundtrack and cleverly edited car-chases......you will be sorely disappointed by \"Baby Driver.\" Go in w/ no expectations but forgettable entertainment, some witty barbs, one surprising cameo that's cut short way too quickly, and dialogue/situations you'll wince at more often than not, and just maybe you'll see where the glowing reviews for this are coming from.In other words, go back to your teenage non-jaded years. This is no \"Drive,\" nor \"The Driver,\" and nothing close to that hair-raising street chase from \"Nightcrawler.\" This was \"The Transporter\" w/o a believable lead nor pulse-raising fight scenes. Or indeed, chase scenes worth recalling. \"Baby Driver\" does boast Jon Hamm's impression of The Terminator, and an ending that comes after what should have been the ending, after an uncomfortable amount of waiting time.To wit: This DOES NOT live up to its ridiculous amount of hype. I'm rating this as high as 4 of 10 because it wasn't a bad film, just oh-so very disappointing. You've been warned."
    },
    {
      "rating": "4",
      "text": "Kevin Spacey and Jamie Foxx made this movie for a paycheck.  The dialogue is insipid and the story defies logic.  The car chases are terrific, however.  This is a typical summer, teenage movie.  Anyone over 21 or with an IQ over 100 will be insulted.  Kevin Spacy: Shame on you."
    },
    {
      "rating": "5",
      "text": "All style no substance.  Really boring.  Meh.  (Loved Spaced, Shaun was okay, thought Scott Pilgrim was astounding visually - quite weak source material)."
    },
    {
      "rating": "5",
      "text": "I love everything Edgar Wright has done, including the TV show Spaced, but overall I didn't like this movie. It was slick and well done, but it just seemed to lack something, like it had no soul. It was formulaic, predictable, and quite dull. I liked the way the editing was done to the music much of the time, but I didn't care for the music. The characters were unlikeable, especially the lead. Nobody had any chemistry.It was technically well made, but just didn't come together for me.It would be a fine rental I suppose. I might have liked it better if the characters and the music were better. The two friends I saw it with were much harsher on it than I am, and they are fans of Edgar Wright as well.The last Fast and Furious movie was probably better."
    },
    {
      "rating": "5",
      "text": "I went in thinking this might be a step up from the 2011 film \"Driver\" staring Ryan Gosling.  I came out feeling like I had been duped.  The characters in this film are the most cliche group of mundane, boring and unoriginal concepts I have seen in a while.  Black ex-con that swears, Tick, Boss in a suit, tick, pretty girl that can shoot, tick.  Where the 2011 film Driver was clever, this film lacks any original story telling.  Jamie Foxx makes zero sense in this film, and his performance is weak.  Kevin Spacey and Jon Ham don't work in this film at all, Jon Ham as a bad guy just feels off, maybe other actors read the script and thought, \"what a pile of crap\" pass.  It has become really had to believe film critics lately.  Wait for it to come to netflix, not worth the effort of driving to the cinema to watch this average movie."
    },
    {
      "rating": "5",
      "text": "A more unrealistic copy of drive, with more driving, more dancing and more action. Vaguely entertaining but poor all round. Don't have more to say than that."
    },
    {
      "rating": "6",
      "text": "This is being falsely inflated due to the movie dry spell this summer.  The plot is uninspired.  None of the characters are even mildly interesting.  There are only two characters with consistent personalities, and each of them are nauseating.  This would make a great music video except they don't even make use of that properly.  I enjoyed watching it, but don't expect something great.  Expect to have fun and feel like it was worth your money.  You'll be happy you saw it.  Expect something great and you'll be sorely disappointed."
    },
    {
      "rating": "5",
      "text": "This movie is way over hyped. Nothing in this movie has not already been done before a hundred times over. So the new twist on the same old story is that the main character listens to music 24/7. It really doesn't add anything to the story. The movie was also poorly written and you have to suspend any notion of reality when the bullets start flying. SPOILERS: They setup the boss (kevin spacey) as this ice cold brilliant mob boss but then at the end he ends up sacrificing himself to help a kid he just threatened to put in a wheelchair a few hours ago! Sorry to say but this was just an average movie at best."
    },
    {
      "rating": "5",
      "text": "This movie \"checks all the boxes\". Protagonist, check. Authority figure, check. Love story, check. Action, check. All star cast, check. I can see why the Hollywood execs pounced. It's not bad, it's not good, it's just alright, and nearly instantly forgettable. What's sad is that the bar is set so low that an \"alright\" movie comes out and it gets 86 on Metacritic and people go nuts. Meh."
    },
    {
      "rating": "4",
      "text": "Way over-hyped indeed. This movie is a two hour music video with a plot that falls apart halfway through and mediocre driving sequences. Seems like an attempt to sell a mixtape. The characters make no sense whatsoever and the final \"act\" of the movie is just a waste; they seem confused about what they wanted the characters and movie to be. By the end, it seems like they had a cogent movie but edited away too much, which is crazy because the movie is still long as it is. Also, Ansel Elgort is awful and for some reason they told him to fake a southern accent, which is just ridiculous and in no way supportive of any necessary plot elements. It sounds like he has a speech impediment. Anyway, Jamie Foxx was pretty good in it. Also, to name the movie \"Baby Driver\" and end the movie with the Simon and Garfunkel song of name is so eye-rollingly cheesy."
    },
    {
      "rating": "4",
      "text": "A film that screems \"Look at how I can edit!\". Way too try-hard, completely unbelievable in any way. The lead character has no real charm, so swinging round lampposts and singing along to his music for most of the film becomes boring and tiresome. Foxx comes away with credit, as does Hamm. The female characters are appallingly written, and Kevin Spacey was on autopilot (and I love Kevin Spacey). Don't believe the hype folks, its an average film to turn your mind off to."
    },
    {
      "rating": "5",
      "text": "You gotta be either on drugs or incredibly imaginative to give this movie anything above a 6. (Sorry, Steven King and friends.) Cheesy script, mediocre soundtrack and if not for Jamie Foxx, average performances.  Can't imagine why Kevin Spacey would even do this film.  Seems like he's phoning it in.  If you're an 17yr old male going for the thrill of the driving scenes, which are quite good, or the gunplay then you'll probably like Baby driver."
    },
    {
      "rating": "9",
      "text": "Edgar Wright's 'Baby Driver' is an adrenaline thrill ride from beginning to end. What makes this movie so great is that it's filled with memorable characters, packed with action, a great love story, and even a few surprises and twists that catch you off-guard. Ansel Elgort plays the cool Baby, a young driver whose job is to drive a group of criminals so they can heist. He works under the intimidating Doc (Kevin Spacey) who is very demanding when it comes to Baby. We see that Baby lives a quiet life looking after his deaf companion, and whatever money he makes, he uses it to feed him, and make sure he's well looked after. Baby attends to a diner, and meets a pretty young waitress named Debora (Lily James), who also shares a love for music. They seem to really hit it off, and this becomes a thing for the two of them. However, things get complicated when a thug named Bats (Jamie Foxx), who doesn't like to waste time, he prefers to do the job, and get away just like that, no other questions asked. The movie is impressive and entertaining, and proves even further that Edgar Wright is one of the most underrated filmmakers working today. With films from; 'Shaun of the Dead' (2004), to 'The World's End' (2013), he has proven to be both original, and using some effective camerawork to craft his films. I really liked the romantic chemistry between Elgort and James, and at a time where many movies are filled with unnecessary and somewhat bland romantic subplots, theirs is honestly the best one I've seen since 'Deadpool' (2016). Hopefully, in the future, we get more films that are as expertly crafted and equally as fun as this. Probably the most fun movie in 2017."
    },
    {
      "rating": "5",
      "text": "Oh, crikey, the dialogue in this movie was absolutely horrendous.  I expected so much more, since the cast was comprised of some very superb actors, but alas, the characters were not developed and the movie spent entirely too much time on a boring \"love story\" that really fell flat."
    },
    {
      "rating": "6",
      "text": "The kiss the ring mentality that garnered this movie universal acclaim has me wondering. Are all these critics trying to keep something hidden? Were there children and wives threatened? Or, are they all gutless and not familiar in the car chase/heist film. Tis true I score films similar to what a college professor might score a paper. This rag with some decent scenes in the first half fails in the second act with redundancy and lack of ideas. Save your money and time but watch out for Edgar Wright as he has got the goods on all the \"real\" critics or perhaps even you."
    },
    {
      "rating": "6",
      "text": "Flashy, entertaining, but just a little bit too pleased with itself. To base a whole film around a soundtrack is almost certainly asking for trouble and inevitably Edgar Wright's idea and direction are both a lot better than his screenplay, which on more than a few occasions pushed the bounds of credibility. The cast are firing on all cylinders but the film annoyingly see-saws between good and fair throughout due to some loose writing. Strangely the music choices are often only ok, although credit must be given for them not having been over used in other films. Standout music piece is a track by 'Focus'(taken from Focus Three if I'm not mistaken)to accompany a chase sequence on foot involving 'Baby Driver' Ansel Elgort, who for once is actually good in a role. As befits a crime thriller the editing is sharp and the sound is clear. It must be said that the film definitely leaves an impression after disappearing from the screen. I just wish that the writing could have made that impression more consistent for me to appreciate the resultant movie better."
    },
    {
      "rating": "9",
      "text": "If you’re looking for a new original screen play, look no further then Baby Driver.  Personally this has been the best well rounded movie I have seen all year.   The film was well shot, the sound editing was amazing, and the cast was fantastic.  Ansel Elgort as “Baby” played a very likable but conflicted main protagonist. His performance supplemented by a great supporting cast (Eiza Gonzalez, Jamie Fox, John Ham, and Kevin Spacy).   Worth mentioning, the movie had a very well-coordinated continuous shot, as well as amazing implantation of song and sound. Edgar Wright and Team were able to turn the movie into a best hits playlist without it becoming boring or stagnant.  The way in which song was incorporated into each scene was unique and did not take away from the story.  I recommend this film to anyone looking for a new original screen play, or fans of fast moving crime films."
    },
    {
      "rating": "8",
      "text": "Baby Driver combines numerous genres to make the ultimate surprise. You definitely would wish to see such a film like this, but another one like this definitely won't come out for quite a while now so Baby Driver would be worth seeing in your to-watch list."
    },
    {
      "rating": "6",
      "text": "Kind of flabbergasted at the critical praise this cliche-ridden, unexceptional movie has received. \"Hot Fuzz\" had a million tons more heart, brains and fun than this film. \"True Romance\" did it better. If \"Baby\" is great, Hollywood is dead."
    },
    {
      "rating": "3",
      "text": "Tarantino-like shots are almost to epidemic levels at this point. It's seems to be the medicine directors with poor scripts are taking. The film rarely lets it actors speak for themselves without constant sweeping pans or snappy close-ups on all small actions. All the same, the dialogue was pure meathead. Last one alive wins. I'm cool with that if I'm watching Rambo but I thought this movie was going to have a different angle. It devolved into a cheesefest so quickly. The glowing reviews for Baby Driver is a prime example or critical inertia."
    },
    {
      "rating": "2",
      "text": "Petrol head? Introverted teen? No attention span yet tolerant to loud noises and pretentious w@nkers? Then please don't watch this, it'll only encourage you."
    },
    {
      "rating": "3",
      "text": "It's inflated because this was a trap for pompous movie critics and they fell right into it. This movie is utterly pointless, has little character development or sensible story structure."
    },
    {
      "rating": "0",
      "text": "Looks like most of these reviews are bought out. Guess I can't trust metacritc anymore.This movies was pretty boring.  The conflict isn't explained, there bad character development. The motives aren't explained, everything just happens and you're supposed to find it interesting?  There isn't anything appealing about this movie, it's just a continuous stream of action packed dribble.  Watch if you like music movies and car chases. Put it on in the background if you want to keep your TV on."
    },
    {
      "rating": "3",
      "text": "Main actors are overacting so badly and the story is so naive I barely made it till the end of the movie. Plus the music was massively overused. After 30 mins I stopped noticing it.The main character (and his girlfriend as well) was acting cocky and self confident, like if he was really cool, while actually he wasn't.It looked rediculously stupid.I will never base my cinema plans on Metacritic and IMDb ratings again.It's like in one moment everyone just lost the taste."
    },
    {
      "rating": "0",
      "text": "Unless your 14-year-old nephew wrote this, you'll find it embarrassingly clumsy.  Most of the movie consists of manufactured conflict between characters who are written as unreasonable idiots.  And it's all too bad because all the actors here are good and giving it a good try.  But the writing is very weak.  But who cares about the story, you're here for the car chases, right?  Yikes.  They're pretty boring.  Sure, the cinematography is good, but Wright goes overboard here and you'll often see cars spinning unnecessarily.  Also, the ending is so infantile I laughed out loud.  Skip this one and go watch Shaun of the Dead again."
    },
    {
      "rating": "6",
      "text": "The first three scenes of the movie had me smiling uncontrollably. They set the stage: Baby is introduced, we get some hints at the dark deal behind the scenes, and we learn that music is everything. The intro was so unique and fresh that I almost didn't notice as every subsequent scene played out beat for beat exactly as one might have expected from the intro, right down to the obvious deaths and betrayals and the disgusting, regressive film stereotypes. The lead man, the lead villain, and the lead criminal are all white men. The female love interest is mindlessly devoted to her man. The white guy criminal is suave and gets the most screen time of the criminals, his wife is sexy and a reflection of him, and the black guy is a scary criminal. I kept expecting my expectations to be subverted because my expectations were embarrassingly bland, but alas. Each character can be described fully in one short, nuance-free sentence, and if you leave the theater saying, \"What a unique ____!\" I can guarantee that word isn't \"plot.\""
    }
  ]
}