{
  "id": 2559,
  "title": "Bachelorette",
  "starring": [
    "Kirsten Dunst",
    "Isla Fisher"
  ],
  "runtime": 87,
  "genre": [
    "Comedy",
    "Romance"
  ],
  "description": "Three friends are asked to be bridesmaids at a wedding of a woman they used to ridicule back in high school.",
  "releaseYear": "2012",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/yAr4LLjZnoIvrfb1VrV3mh38rTK.jpg",
  "categories": {
    "plot": 6.666666666666667,
    "acting": 6.9,
    "ending": 5.5,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 5.368421052631579,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "7",
      "text": "First things first. This movie is not Bridesmaids. If anything, it's closer to The Hangover. And although it is not as comically successful as either of the two, it still works as a kinky combination. Headland's ability to juxtapose raunchy foul humor with insight and self-reconciliation makes the film watchable, and Dunst's and Caplan's performances are incredible. Despite some jokes being either too flat, one dimensional, or too sadistic to arouse a serious laugh, most of the humor in this film works. You'll definitely laugh a lot as you watch it. As the film progresses, it loses it's comedic quality and, once raw emotion and pity are forced onto the characters, degrades into something like oil and water. In the end, though, Bachelorette proves to be a fun and digestible film with a resolute although spastic storyline and interesting and well acted characters. Expect more from Headland as she fine tunes her skills to make a meaningful comedy."
    },
    {
      "rating": "10",
      "text": "Absolutely hilarious. I laughed from beginning to end. Can't really ask more out of a comedy. Sure, the girls aren't likable, but they were very compelling characters, and I actually ended up caring for them. Isla Fisher gives one of the best comic performances I've seen in a long time."
    },
    {
      "rating": "0",
      "text": "This is one of the worst movies I've seen in forever.  Perhaps going into it with high hopes was a mistake but my friend and I were watching with mouths agape at our mutual failure to laugh more than a handful of times during the course of the film.  The acting, story, chemistry, motives, etc. are all muddled.  Avoid, and someone get me my $11 back...ick.  And are people seriously saying this is better than Bridesmaids?  Hugs, not drugs."
    },
    {
      "rating": "7",
      "text": "I thought this film was really funny in an audacious sort of way.\rIt's based on Headland's play of the same name.\rI found another interesting take on it here:\rhttp://4thdimensionfilms.wordpress.com/"
    },
    {
      "rating": "10",
      "text": "This was over-the-top smart and funny. Excellent story and very well acted. The three girls were fantastic, and Rebel Wilson is going to be a star. Perhaps a cult classic is in our midst?"
    },
    {
      "rating": "3",
      "text": "This was not a good movie. It wasn't really funny in any way, you are forced to dislike the characters because they are all quite terrible people or just not believable as human beings. In the end everything works out for them, but it's not what you'll want because none of them seem to deserve it. If you are expecting Bridesmaids, STAY AWAY! There's not heart in this one at all, and you'll come out completely unsatisfied."
    },
    {
      "rating": "8",
      "text": "this is a wonderfully snarky film. kirsten dunst, lizzy caplan and isla fisher are all wonderful as a group of hot  who hate everybody. in the end the film wimps out with an overly sweet ending, but it has some surprisingly touching moments which redeem it."
    },
    {
      "rating": "4",
      "text": "Bachelorette was just not a good movie at all. There was very little humor involved, which was surprising considering that I thought Rebel Wilson had a large role and she's typically hilarious but that was not the case at all. Honestly, the only two reasons this movie was worth watching was Kirsten Dunst's character was actually pretty amusing, mainly because of the chaos that surrounded her. The main reason I was able to sit through this film was Lizzy Caplan though. Obviously I'm a huge fan of hers and she and Isla Fisher were the only reasons I even bothered watching it but Lizzy's character was great. She had one of the only funny roles and there's just something about her that is just awesome. She's got a type of darker hotness that is appealing and makes her different from most other actresses. If you're a Lizzy Caplan fan then watch this movie but I don't think most people would enjoy it at all."
    },
    {
      "rating": "7",
      "text": "I'll be honest: I expected a second-rate Bridesmaids copycat. What we get is a much different take on wedding mayhem... and I loved every minute of it."
    },
    {
      "rating": "2",
      "text": "Bachelorette is a comedy that tries to have \"an edge\"  meaning sex, drugs and saying lot of dirty words. Eddie Murphy said in the past humor is not about saying list of obscenities and wishing everyone good night.  The movie attempts to amuse audience with exactly this while failing awkwardly."
    },
    {
      "rating": "7",
      "text": "Bachelorette is a dirt cheap rip off of the highly successful and funniest female comedy \"Bridesmaids\" but this nothing like it, Bridesmaids has a heart and it has charming,witty characters and has a great sense of humor, this film has no heart and is just a big stereotype, yes women can be vulgar and crass as men it has a strong idea but it doesn't work out. Based on Leslye Headland's play which she adapted, Headland has comic smarts and she can do better than this, she focuses more on the dark humor than the characters. Bridesmaids a control-freak Regan (Kirsten Dunst), slutty Gena (Lizzy Caplan) and a drunken airhead Katie (Isla Fisher) are apart of  their friend Becky's  (Rebel Wilson) wedding who they used to tease in high school. The film makes excuses to try to like the characters and it has a **** feel good ending. Kirsten Dunst and Caplan try to make this mediocre stereotypical comedy good but fail, Fisher tries and yet she can barely act. There are some enjoyable parts to this comedy, go watch this film drunk and you'll have a blast! But this comedy is racist, sexist. Grade C-"
    },
    {
      "rating": "10",
      "text": "I loved this movie. Many have complained about how unlikeable these characters were. Well in real life not everybody is likable. these characters were realistic, nasty and funny. I thought the movie was hilarious, and not the normal type of comedy. Great movie, underrated"
    },
    {
      "rating": "6",
      "text": "It's raunchy, foul-mouthed and showcases a trio of unlikeable leads who make you cringe at the mean stuff they do. Nevertheless, it's consistently funny and surprisingly dark. Kirsten Dunst is amazing in this."
    },
    {
      "rating": "7",
      "text": "Once you get over the immaturity of Gena and Katy, which is very annoying to start with and gets worse as the film plays on, until the resolve.  Part of the film is their story of maturing into \"better\" people.  For me, Kirsten Dunst and Rebel Wilson hold this film together.  The direction could have been tighter and the story could've done with a re-write.  But it didn't make me turn off, and I did laugh at a few things, which is good."
    },
    {
      "rating": "4",
      "text": "Another tiresome, boring and uninventive \"Bridesmaids\" ripoff with a predictable plot and muddled performances."
    }
  ],
  "recommendations": [
    "blockers",
    "forgetting_sarah_marshall",
    "that_awkward_moment",
    "the_five_year_engagement",
    "friends_with_benefits",
    "the_wedding_ringer",
    "legally_blonde",
    "central_intelligence",
    "the_break_up",
    "50_first_dates",
    "the_heat",
    "pineapple_express",
    "i_feel_pretty",
    "the_dilemma",
    "trainwreck",
    "step_brothers",
    "neighbors",
    "delivery_man",
    "seven_psychopaths",
    "rough_night",
    "meet_the_parents",
    "zoolander",
    "pitch_perfect_2",
    "the_cobbler",
    "knocked_up"
  ]
}