{
  "id": 4510,
  "title": "Backdraft",
  "starring": [
    "Kurt Russell",
    "William Baldwin"
  ],
  "runtime": 137,
  "genre": [
    "Crime",
    "Drama",
    "Thriller",
    "Action"
  ],
  "description": "Firemen brothers Brian and Stephen McCaffrey battle each other over past slights while trying to stop an arsonist with a diabolical agenda from torching Chicago.",
  "releaseYear": "1991",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/bymJtYNIdiAiBR1LRetaJXbfryc.jpg",
  "categories": {
    "plot": 6.0,
    "acting": 4.0,
    "ending": 5.333333333333333,
    "soundtrack": 8.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 5.0,
    "action": 5.833333333333333
  },
  "reviews": [
    {
      "rating": "10",
      "text": "I love Backdraft it's my alltime favorite firefighter movie this movie is claer cut of how a ood cast,great direction and story plus jaw dropping fire scenes filled with special effects can amke a movie so good.Backdraft's storyline starts out in familar territory then begins to tread on unexplored areas of storytelling.The cast in this film is as much of a presence as the fire.Ron Howard who reallys surprised me with this movie tis wasn't something he usually did bt he pulled it off wonderfully.That is why I gave this film a perfect score."
    },
    {
      "rating": "8",
      "text": "This movie is a very enjoyable watch... the critics are being far too harsh here!!! \"you go, we go!\" absolutely epic stuff... maybe i have a bit of 90's nostalgia but do urself a fav and check it ouy!"
    },
    {
      "rating": "10",
      "text": "Not a lot of people can truly say that they have a one unique favorite movie thats stands out from the rest. However for me Backdraft does. Directed by Ron Howard with an all star cast , Backdraft is the story of Chicago Firefighters of Engine 17. The film begins seeing young Brian McCaffrey (William Baldwin) witnessing his fathers death at a building fire. We cut to 17 years later  Brian having just graduated as a candidate Firefighter , he and his older brother Lt Stephen McCaffery (Played By Kurt Russell) don't get along so well , Stephen tempers with Brians station so that Brian is sent to his Department , Stephen looks over Brian & worrys about him after a factory fire , Brian did not listen to Stephens orders and nearly got killed. After a few weeks Stephen convinces Brian to give up being a Firefighter. Meanwhile thorought the movie , the Department responds to numerous calls that have been killing people with Backdrafts. Brian get's a new Job withfire inspector Donald Rimgale (Played by Robert De Niro), Him & Donald  investigate how & who is causing the backdrafts which end in an epic finally and a extremly sad ending. Why do I love this movie ? well beside from the fact that it has stunning special effects & visuals , amazing music & strong performances. I love it being that I watched it at a very young age and since then , my whole life i've wanted to be a firefighter , sure its farfetched & far from real but thats not the point. The movie made me love Firefighters & My dream is to someday be a professional firefighter. I could watch this movie 10 times a day and never get tired of it. Its one of those movies that get's even better after you watch it again & again . Backdraft.....Thank you."
    },
    {
      "rating": "6",
      "text": "The pacing can be slow at times and the motivations of the characters aren't always clear as the film tries to hard to be mysterious. The films strengths are in the action sequences and the cinematography. An enjoyable film for fans of the genre and movie lovers."
    },
    {
      "rating": "3",
      "text": "This film is decent but seemed like a wasted opportunity. William Baldwin’s character is well fleshed out and his journey through the film is quite well written and believable. Unfortunately no other character including kurt Russell’s character gets that chance.The film is largely about Brian McCaffrey (Baldwin) so it’s a mystery why Russell is first in the cast whose character is too one dimensional. He seems to never be talking about anything but “the job”.Scott Glenn does a great job as Adcox but seems a little uneven. His motivation only becomes clear at the very end of the film and his lack of regard for Brian is a little hard to believe given what his motivations are.Both female leads are too one dimensional also. Not enough time is spent on the reasons for Russell and De Mornays failed marriage and Jennifer Jason Leigh’s character isn’t given a proper third act.I liked the Irish tradition attached to the fire fighting clan party which you don’t see in films anymore and the brawl that broke out between two different surnames within the firefighting world which you get the impression has been passed through generations.The film builds up to a good ending but overall it’s early scenes were my favourite part of the film when a quite believable world is created but not expanded enough on.Bryan’s friend Tim should’ve gotten Atleast one more scene later in the film but for some reason is just forgotten after a significant moment for his character.De Niro is very good as always and plays his part well but seems totally removed from the rest of the story.A good effort but could’ve been better seems a li"
    },
    {
      "rating": "8",
      "text": "Saw this movie on VHS as a rental and liked it enough to buy it. I found it to be an interesting tale about brothers, teamwork, risk-taking, and trust."
    },
    {
      "rating": "9",
      "text": "memorable realistic action and great actors."
    },
    {
      "rating": "7",
      "text": "It's definitely a good story, a poor performance on Baldwin but Russell does a good job, excellent special effects, and for those critics that say that there were too many fire in the movie I say HELLO!!!!! it's a firefighter's story, it's absolutely expected to see some flames in the movie don't you think? Well, it has a good plot and a great ending."
    },
    {
      "rating": "8",
      "text": "Thanks to a refreshingly straightforward story, stellar directorial skills from Ron Howard, and an absolutely mind-blowing set of special effects, \"Backdraft\" makes for a worthy blockbuster of the greatly intelligent kind."
    },
    {
      "rating": "5",
      "text": "Too long movie with some unrealistic scenes and many simple characters. Sometimes the movie is too heroic and then it is ridiculous. Anyway some action scenes were good."
    },
    {
      "rating": "6",
      "text": "+Incredible practical action set pieces+Excellent soundtrack from Hanz Zimmer+Great lighting/cinematography+Superb cast-Weak scriptBackdraft is an incredibly well made film from the 90's peak of hollywood cinema sporting a superb cinematic look with a great cast and action pieces. Sadly the screenplay falls short failing to capitalise on some of the many plot ideas instead just throwing it all into the pot giving 'narrative texture' but to the detriment of 'narrative depth'. Despite this the detailed dramatic scenes of Backdraft let the film progress at a good pace yet something feels off with the overall story which left me confused rather than satisfied overall."
    },
    {
      "rating": "8",
      "text": "My father is a firefighter so I have been brought up around it and know that there is quite a bit of \"Hollywood\" special effects and things of that nature that make bits of the film, particularly the firefighting itself, fairly unrealistic i.e. fire doesn't make a lot of the sounds it does in the film, the hose at the last fire flying around in the air, in some parts if you look close you can see that the fire clearly coming from a gas source that is used for fire in a lot of movies.\rAside from all of that I did like the movie. It has a pretty good story line and I pretty much automatically like any movie or TV show that involves firefighting. For example I love Ladder 49 as well even though it is not all that widely liked."
    },
    {
      "rating": "8",
      "text": "Some cheesy moments at times, I think maybe the soundtrack decisions weren't the best, but overall a very well shot and we'll acted movie. I feel it is a very underrated movie."
    }
  ]
}