{
  "id": 1509,
  "title": "Back to the Future",
  "starring": [
    "Michael J. Fox",
    "Christopher Lloyd"
  ],
  "runtime": 116,
  "genre": [
    "Adventure",
    "Comedy",
    "Science Fiction"
  ],
  "description": "Eighties teenager Marty McFly is accidentally sent back in time to 1955, inadvertently disrupting his parents' first meeting and attracting his mother's romantic interest. Marty must repair the damage to history by rekindling his parents' romance and - with the help of his eccentric inventor friend Doc Brown - return to 1985.",
  "releaseYear": "1985",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/fNOH9f1aA7XRTzl1sAOx9iF553Q.jpg",
  "categories": {
    "plot": 9.018518518518519,
    "acting": 8.575,
    "ending": 9.0,
    "soundtrack": 9.5,
    "cinematography": 5.0,
    "familyFriendly": 8.0,
    "funny": 8.76,
    "action": 9.5
  },
  "reviews": [
    {
      "rating": "9",
      "text": "There is honestly too much to say about this spectacular piece of film! This movie is by far one of the greatest Sci-Fi movies of all-time and is also in my top 3 favorite movies of all-time. This movie has a great concept and plot that later unfolds into one of the greatest storylines in the history of storylines. Michael J. Fox is fantastic as Marty McFly and delivers some of the most nostalgic acting I've ever seen, but my favorite performance was Christopher Lloyd's unforgettable, historic role as Dr. Emmett Brown. This character is what you get when you take one of the greatest actors ever and put them in your movie, you get one of the greatest movie characters in Science Fiction history. This movie mixes action with hints of comedy so perfectly that there isn't one point in the movie where you aren't interested in what is happening or what is about to happen. Back to the Future is a gem that should never be overlooked by any moviegoer ever."
    },
    {
      "rating": "10",
      "text": "Its plot and the performances of C.Lloyd and MJFox pricipais are your strengths, and the movie sounds fun and not too serious What do makes it an epic science fiction."
    },
    {
      "rating": "8",
      "text": "A really good sci-fi film. Back To The Future takes its premise to the next level with some great effects and a fun, goofy feel to it, like it knows its limits, but tries to push its boundaries anyway."
    },
    {
      "rating": "10",
      "text": "10/10 not because of utmost quality or incredible strengths but for an all-around flawless film.\r I wouldn't say this movie shines particularly through any of its parts, whether it's acting, writing, directing, music, storytelling, for all these parts are equally very good.\r The real strength of BttF is that it brings together an epic sci-fi story with emotional character involvement, lots of story threads that are brought together in a beautiful result and comedy to seal it all into one excellent flick.\r It takes seeing the movie to see why exactly it is so good, but mainly, the thing that kept amazing me, besides Fox and Lloyd's excellent acting in their over-the-top comedic roles as a young courageous teenager and an old loony genius scientist, besides the value of a flawless time travel plot, besides the numerous moments where this movie made me laugh, made me awwww, or made me feel tension, the main excellency of this movie is how every bit of it is executed pretty much perfectly. Every foreshadowing is subtle, believable in the story and doesn't come off like a plot device. Every event or action in the movie makes perfect sense and is at the same time subtle and powerful. There isn't a time in Back to the Future 1 where I thought that something wasn't sensible or plausible, it all fits perfectly in a plot of great complexity that mixes romance, time traveling, science, and a lot of likeable characters of all types, nerdy  George McFly, aspiring rockstar Marty McFly, Lorraine McFly, Doc Emmett Brown, and even Biff, the movie's main villain.\r So it may not be the best movie ever, I mean other movies have been more memorable with one element or the other to me, but I certainly can't find a real flaw in it, it's a movie that's enjoyable in every one of its aspects and does every bit of the job just perfectly."
    },
    {
      "rating": "10",
      "text": "Back to the Future is a great movie. Smart, thought provoking and very exciting. Michael J. Fox and Christopher Lloyd's chemistry is great and very memorable. This movie is an INSTANT CLASSIC."
    },
    {
      "rating": "8",
      "text": "It's easy to see why this is a classic. Humor and charming characters are what makes this so great. Fantastic performances are all around and it's not hard to be taken in by the films magic, especially during the tense third-act. If it does have one flaw it's that this film has been to big of an influence for other time traveling science-fiction stories. A lot of the plot threads, like accidentally changing the events of the future, have been done to death as of today, and if you're like me and didn't watch this movie until many years after it has come out then this flaw becomes abundantly clear. Also the film gets surprisingly dark in content for one or two scenes (there's almost a rape). Overall it's a highly enjoyable film that had me laughing and on the edge of my seat. It may be a little familiar by todays standards, but it's still a great film and a classic."
    },
    {
      "rating": "10",
      "text": "This film is a classic- everything about it is genius.  The script is sensational and totally original in every way, creating one entertaining thing after another.  The music is inspiring, the comedy is hilarious, the acting is amazing (from all members).  This film is a huge hit that will entertain forever more in the future."
    },
    {
      "rating": "10",
      "text": "Back to the Future is a classic. It is a very delightful film from start to finish that I truly didn't want to end. Great writing, great casting, great performances, cool costume and production design, and catchy music all help to make this film as awesome as it is. Its got some great laughs and a whole lot of fun throughout. A must see for everyone."
    },
    {
      "rating": "9",
      "text": "Back to the Future is a insanely daring and creative film. The performances and characters are amazing and everyone does a great job and creates are really entertaining narrative. The premise and ideas are entertaining and the pacing and humor makes really stand out. The plot is very consistent and for a time travel based movie it really works. There are some weird random minor plot holes and some special effects don't quite hold up, but this is a true 80's classic."
    },
    {
      "rating": "10",
      "text": "A teenager, Marty, finds himself in an accidental time travel into the past where he meets his parents who are young again. He has to create a romance between them so he could be born in the future. Dr. Brown, who invented the time machine in the future, is also his ally in the past, and together they must find a way to send him back to the future.\r The story takes place in the same town. The world is a different place in the 1950s from the 80s. The dressing, speech, tastes in music, all of it. Marty, as he says himself, has a life in the future he wants to return to. The plot was intricate and the dialogue sharp and witty. The eccentric Doctor can't go a second without putting a smile on your face.\r Marty's arrival in the past confuses a family living on a farm who take him for an alien. He flees from there and marches into the town still in his clothes from the future. At several instances, it is suggested that some of the popular culture was defined by Marty, such as skateboards and rock n roll.\r Marty's father, George, is bullied by the same man, Biff, who is also bullying him in the future. Marty starts working on helping his father stand up for himself. He regularly comes into conflict with Biff.\r George is afraid of any kind of social contact and Marty has his work cut out for him to convince him to ask his mother out so they could kiss and start a relationship. Much of the humour lies in Marty's struggles to spark fire between his parents which was messed up by his intervention.\r His mother, who should have fallen in love with his father, instead becomes infatuated with him. His horror at this development is funny because you know this is a comedy film and everything will work out in the end.\r 'Back to the Future' is possibly one of the most entertaining movies about time travel, probably because it didn't delve into hard science and combined elements of both science fiction and comedy."
    },
    {
      "rating": "8",
      "text": "Is this movie dated? Kinda. But I think that's to the film's benefit. It's about time travel, so I think it's okay to feel dated. The movie is still charming and funny, plus the effects still hold up well. It's one of my favorite movies."
    },
    {
      "rating": "0",
      "text": "Next time you make a movie, don't have your only female character be a typical damsel in distress in need of a man to save her from being raped."
    },
    {
      "rating": "2",
      "text": "Retour vers le futur, c'est un gros épisode de Happy Days avec ses années 50 niaises, l'insupportable petit Michel J. Renard et le gros lourdaud à ses basques. Heureusement que le Docteur Foldingue tout droit sorti de son asile est là pour aider le nabot ! On pourrait éventuellement trouver à ce film le mérite d'avoir mis un échec commercial que tout le monde avait oublié au goût du jour et de la mode (la Delorean dessinée par Giugiaro et propulsée par ce vieux PRV, notre honte nationale à nous) mais... c'est tout.Son humour gnangnan à la Fonzy (ils l'ont oublié le pauvre ?), ses situations sur le voyage dans le temps qui recyclent tous les clichés existants depuis 100 ans font de Retour vers le futur une pauvre pantalonnade mal dégrossie qui ne se bonifie pas avec... le temps, bien au contraire. Le film souffre de surcroît de nombreuses baisses de rythme, ce qui n'améliore pas son visionnage, une pénibilité qui devrait être reconnue par la sécurité sociale pour l'abrutissement des masses qu'il provoque."
    },
    {
      "rating": "5",
      "text": "Starts well and has some good acting and humour but the time-travel premise is wasted big time."
    },
    {
      "rating": "9",
      "text": "A smile that is hard to fade is present after watching the blockbuster that is Back to the Future, a time-travelling adventure that explores every possible outcome for such a complex idea, but even through its many explanations and big words of flux capacitors and things, there is such fun and messing around to be had, with added drama that equals to quite the varied film that fills itself with plenty to be entertained about.\rMarty McFly (Michael J. Fox) is the seemingly average teen who lives with a family that is at the bottom of the food chain, something that only seems to bother Marty.\rHe has a friend in the form of scientist Emmet \"Doc\" Brown (Christopher Lloyd), who informs him that he has created a time machine, something Marty can only snort at but soon must believe the ridiculous nature of it and get himself out of a big problem, returning to the future with the unnecessary tools to do so after he has accidentally landed in 1955. But the opportunities he has while trying to fix the DeLorean time machine are endless as he has the chance to repair the circumstances to which his mother and father met and to perhaps changes their fortunes, but this is going against the warnings his friend Doc outlines to him, that he cannot get involved in any situations that may alter the future as these could have dyer consequences.\rThe almost impeccable writing and direction from Robert Zemeckis promote a changing of the winds in science fiction film, he has played with the idea of time travel but delivered an energetic and larger than life story that is bursting with jokes, pop culture references and characters who all have their own traits that will change their fate, Lea Thompson plays the hilarious Lorraine McFly, mother to Marty, but someone who, in 1955, has the hots for the man who has travelled back in time, her son.\rWhether she is swooning after him or remarking on the nature of having your own name on your underwear (she thinks his name is Calvin Klein), her chemistry along with her future husband George (Crispin Glover), is a nice emotional kick for the film. But the real magic comes from Chris Lloyd and Michael J. Fox, who not only create to iconic characters, but also ones who are enjoyable to watch and easy to quote.\rThe film boasts excellent effects and a riveting score, and for re-watch value it is unmatched. A real gem can be hard to find in the current onslaught of big budget films, but Back to the Future set the benchmark and keeps on giving time and time again."
    },
    {
      "rating": "10",
      "text": "The film follows the boy Marty McFly, he is a teenager with a girlfriend a band and afraid of the disapproval of the society and this must to his father who is a great failure being constantly pounded by his supervisor and old bullyng in the school, biff, he has A mother who is very conservative and is very finished, her brothers as well as her father are two failures in what they want in life and this makes marty uncomfortable with his family. One night his friend Dr. Emmett Brown asks him a favor, Record the test of his supposed time machine that is a success but thanks to that some events make marty go to the past, and his goal is to go back to the future and fix past mistakes, from this follows the plot of the movie that is lately Well built every detail and element presented in the future, is reused in the past in an unimaginable way, the script is very well built, cuts the cinematography, it's all very good the cgi is a bit dated today in Michael J. Fox is perfect as marty, an adolence that emanates a lot of energy and cunning but also lives with insecurities of his head and Christopher Lloyd plays the doc to perfection he succeeds Show us the perfect figure of the crazy scientist obisecado by ciencia.back to the future is  A movie that contains great characters, a very well closed plot and that assas of everything works very well the questions of the time travel, focus of the film.note 100"
    },
    {
      "rating": "10",
      "text": "Literally, BTTF is my all time favorite movie.  The story, the actors, choosing to use a DeLorean for the time machine(!), everything just worked so well.  I love time travel films and BTTF pulled it all off without getting over scientific and executed everything in a fun way.  I hope they never make any more BTTF movies, whether films where a new person discovers Doc's work, his kids, etc etc.  This trilogy needs to be left the way ti is, perfect."
    },
    {
      "rating": "0",
      "text": "Although it remains a popular ‘80s classic, Back To The Future has quite weak acting and very boring elements."
    },
    {
      "rating": "8",
      "text": "Do I need to say it Back to the Future is a great movie. It was a good story, wonderful characters, and fantastic presentation. See it if you haven’t already."
    },
    {
      "rating": "9",
      "text": "When Dr Emmet Brown is murdered in front of him, Marty McFly escapes back to 1955 in a time machine built into a Delorean. Upon arrival he finds himself accidentally altering history, and must undo what he has done to ensure his parents still fall in love and get married or he'll never come to exist.Full of charm and a fun sense of humour there can’t be many films as universal loved as Back to the Future, and no matter how many times you see it, it never fails to entertain."
    },
    {
      "rating": "8",
      "text": "Just watched it for the first time and I really enjoyed it. Fox and Lloyd did a fantastic job, As did the rest of the cast. The writing was spot on with the original premise and the ability to hide a lot of dark undertones with some well-done comedy. Definitely worth checking out if you haven't seen it already, It's a classic."
    },
    {
      "rating": "9",
      "text": "Um dos filmes mais divertidos de todos os tempos."
    },
    {
      "rating": "9",
      "text": "Very entertaining movie. I can watch this anytime. It is such unforgettable sci fi film. Memorable characters and solid writing."
    },
    {
      "rating": "9",
      "text": "I'd seen this film before along with the other two but not for a while so I decided to refresh my memory on them. What a creative idea these films are! There is so much to like about it with all the twists and turns, and likable characters and great acting. It's a little hard to follow at times, and I had to research bits about the ending; but overall it's a solid film and a classic 80's one as well (and could possibly be my favourite film from that era) and a must-see for sure!"
    },
    {
      "rating": "9",
      "text": "Back to the Future really painted a nice plot that filled itself in at every point. The imagination and creativity was quite outstanding. Some of the ideas feel a little used, however this is 2013, and many of them were partially introduced by this movie. Overall, I quite liked the original storyline."
    },
    {
      "rating": "9",
      "text": "[REUPLOAD]\rThere is honestly too much to say about this spectacular piece of film! This movie is by far one of the greatest Sci-Fi movies of all-time and is also in my top 3 favorite movies of all-time. This movie has a great concept and plot that later unfolds into one of the greatest storylines in the history of storylines. Michael J. Fox is fantastic as Marty McFly and delivers some of the most nostalgic acting I've ever seen, but my favorite performance was Christopher Lloyd's unforgettable, historic role as Dr. Emmett Brown. This character is what you get when you take one of the greatest actors ever and put them in your movie, you get one of the greatest movie characters in Science Fiction history. This movie mixes action with hints of comedy so perfectly that there isn't one point in the movie where you aren't interested in what is happening or what is about to happen. Back to the Future is a gem that should never be overlooked by any moviegoer ever."
    },
    {
      "rating": "10",
      "text": "Ever since this movie was released, it was an instant classic. The Movie has great acting, great story and is one of the most enjoyable movies of all time."
    },
    {
      "rating": "10",
      "text": "It has a good bit of science fiction mixed with a comedy that made this movie one of my favorites. It does have some cheesy moments, but of coarse, this was an older movie. It has a good plot, with fairly good acting. There are some things that you will miss the first few times you see this movie."
    },
    {
      "rating": "8",
      "text": "Back to the Future is funny and inventive, providing a lot of humour and interesting, well-acted characters to serve its truly unique plot which would serve as a benchmark for other future science fiction films."
    },
    {
      "rating": "10",
      "text": "This movie is a classic.\rThe characters are very unique, The story is very good as well the concept is very interesting.\rIf you love a good sci-fi, this is a film for you. Overall a great film for almost anyone to enjoy\r Rating 10/10\r-C_"
    },
    {
      "rating": "10",
      "text": "While the same cannot be said for it's sequels, the original Back To The Future is a timeless film that retains all of it's 80s charm 30+ years later.  The special effects could use a touch up in the recent blu-ray release, but there is also nothing wrong with staying true to the original.  BTTF, along with Goonies, Gremlins, Ferris Beullers Day Off and The Breakfast Club are like time-capsules to that time in the 80s when science fiction was fresh and fun and being a cool teenager was lifes highest aspiration.  Like all of those films, Back To The Future will leave a smile on your face every time."
    },
    {
      "rating": "10",
      "text": "The genius here cannot be understated.  Films like this get made all the time and flop but this one hit the nail on the head.  There are more memorable lines and scenes from this movie than all the other movies from 1986 combined!  Doc Brown was so fun to watch."
    },
    {
      "rating": "9",
      "text": "as if back to the future at the  end it always has another movie .   i like back to the future it is very creative and  always  gets better every second including biff the guy who calls everyone a but head"
    },
    {
      "rating": "8",
      "text": "This movie is a timeless classic. The story was predictable, but the rest was very good. It was funny, the characters were fun, the movie was entertaining and the soundtrack was good. It's an excellent movie that made it through the test of time."
    },
    {
      "rating": "9",
      "text": "Even though this was released 11 years before I was born and entertainment before I was born is something I don't venture into this is a brilliant film. Seeing him get into the DeLorean and hit 88 mph and go to 1955 made me want to find a DeLorean and travel to not only the past to the 70s and 80s when my parents were the age of Marty's but also to the future a truly brilliant classic film. I also loved Keith Lemon's small parody as well."
    },
    {
      "rating": "9",
      "text": "One of my favourite movies of all time! It's funny! It's well put together! Michael J. Fox does a fantastic job as Marty McFly, and Christopher Lloyd does a fantastic job as Doc Brown. I thought the story was tense, and extremely well done. The way the past version of Hill Valley was sort of a parallel version of Hill Valley from 1985 was really smart, and using the clock tower which had been hinted to before was a great tie in. The ending was already pretty good, and then Doc Brown said \"Where we're going, we don't need roads...\" and the movie was officially made by that one line. However, nothing can be flawless, as there are some problems. First off, Biff was generic, and didn't have much character. I wish they had expanded on him. Also, the old people make-up on Marty's parents and Biff at the beginning of the movie isn't very good, and there's really no explanation for why the teacher hates Marty so much. Like I said, Biff is stereotypical, and Biff is an extremely cliche bully name. The closest thing to a plot hole that I can find is the fact that no one saw the car disappear when the lightning hit. I mean....really? It's especially \"convenient\" when it occurred RIGHT NEXT TO A SCHOOL DANCE, A.K.A, a very crowded place. Now that I think about it, technically at the end of the movie, Marty's family are totally different from who they'd been before, and Marty has no memories with them, which is pretty sad. Overall, in the future, I'll always come back to this movie. BACK TO THE FUTURE!\r Just as a side-note, I would have given this movie an 8.5 if Metacritic allowed for decimal ratings. The last thing I will say, is that Back to the Future had great music!"
    },
    {
      "rating": "10",
      "text": "Masterpiece, best movie ever, Hors Concours, time travel mind blowing, cult, bullseye, must see, extra, extraordinary, best spielberg movie"
    },
    {
      "rating": "8",
      "text": "Back to the Future is funny and inventive, providing a lot of humour and interesting, well-acted characters to serve its truly unique plot which would serve as a benchmark for other future science fiction films"
    },
    {
      "rating": "10",
      "text": "It is a timeless classic and one of the movies everyone has seen or at least heard of. Also for many this is one of the quintessential time travel movies and science fiction comedy. The strengths are the great cast, the good immersive story and that it has nearly a perfect pacing / build up. At the time of writing it is over 35 years old and still works for new and old viewers. It is the story of the teenager Marty McFly who comes from a struggling family with many problems. One night he meets Dr. Emmet Brown on a parking lot who claims to be his friend. There he shows him his newest invention which is a time machine he build into / with a modified DeLorean car. Sidenote: The DeLorean motor company was an American car manufacturer which got bankrupt in 1982. They are remembered for the gull wing doors and for this movie. In short their name entered pop culture history while they had no commercial success. Back to the movie. After some events I wont spoil Marty is stuck in the past on 05.11.1955 and has no way to return back to his time without help (To be precise he is technically home ). However this is not his biggest problem as time travel has consequences too or will have if you don't act carefully. I am vague here to not spoil the story. It has a great pacing, good twist and the actors enhance this with their performance. I rewatched this movie countless times and it has still nostalgic value. The movie has something everybody can relate to. Lets start with the great cast. This is Michael J. Fox signature role as Marty McFly and he is universally liked if not loved. It is such a natural performance that wins you over immediately. I cant picture anyone else in this role. Same goes for Christoper Loyd as Doc Brown. He nails the role of eccentric scientist. These 2 are perfectly for this movie and became pop culture legends in these roles. It stops not here as we get Thomas F. Wilson as Biff Tannen. He is one of the favorite bad guys in cinema and his performance is just great. I will praise Lea Thompson and Crispin Glover for their performance but wont spoil much. For all of these the movies became one of their most well know performances. I say we got a great cast and no missteps. Then I want to point out the special effect. It is amazing how good it looked back then. ILM (Industrial Light & Magic) are just the masters of special effects and also the gold standard. Even today it would be acceptable and I have seen worse from much newer movies. They got the look of 1955 right or the expectations. Everything looks and feels right. I must of cause talk about the soundtrack by Alan Silvestri. The “Back to the Future” theme is universally know but “The Power of Love” became a timeless classic too. It is even played today in the radio and often reaches top positions in best movie songs. The rest is also excellent and worth buying. Before I forget it I must also praise director Robert Zemeckis who is in general not recognized enough for his works. Lastly I want to address the well done humor. They get the mixture of humor and seriousness right. Nothing harms the other and you will be entertained greatly. Overall this became rightfully a classic and started a successful franchise (It has no weak movies. Naming part 3 weak is nitpicking at best). It is the kind of movie that you will rewatch from time to time and have fond memories off. Fully recommend it as it is pop culture history."
    },
    {
      "rating": "10",
      "text": "Marty McFly goes back in time, in a DeLorean invented by his friend, Dr. Emmett Brown, and must make sure his high-school-age parents get together, so he doesn't cease to exist."
    },
    {
      "rating": "10",
      "text": "Dr. Emmett Brown: \"If my calculations are correct, when this baby hits 88 miles per hour... you're gonna see some serious ****\r Marty Mcfly's loony friend, Doc Brown, invents a time machine in which Marty is accidentally sent back to 1955, the same year his parents meet.\r Back to the Future is one of the greatest movies ever made. The movie is hilarious, it's directed magnificently by Robert Zemeckis and the chemistry between Marty and Doc well just perfect."
    },
    {
      "rating": "9",
      "text": "Time travel has never looked so cool, but there's always consequences galore in Robert Zemeckis' 'Back to the Future', a movie about a young kid who travels back to the 1950s and meets his parents when they were his age, and must make his future secure again.\r We meet out hero, Marty McFly (Michael J. Fox) who is a typical 1980s teenager that hangs around with a scientist, Dr. Emmett Brown (Christopher Lloyd), and he has a girlfriend, Jennifer (Claudia Wells). Marty lives at home with his somewhat dysfunctional family, including his loser father, George (Crispin Glover), who often gets bullied by Biff Tannen (Thomas F. Wilson), and his cynical mother, Lorraine (Lea Thompson).\r One night, after the doctor invents a time machine in the form of a DeLorean, and tests it successfully, an incident occurs which leads Marty to get in the car and ends up travelling back to November 1955.\r Marty then runs into the younger versions of his parents, who at the time, still haven't met yet. He also tries to get help from the younger version of Dr. Brown to assist him getting back to the year 1985.\r The movie is wildly clever in regards to how it discusses the logic of time travel and what could happen if one was to travel back in time and alternate history. The special effects in this movie are top-notch and perfectly timed. It is a gorgeous film to look at, and the way it captures the 1950s era with its setting can really feel like the movie has taken you back in time.\r It uses the comedy very well in regards to its subject, and Michael J. Fox and Christopher Lloyd share terrific chemistry as the teenager and crazy-smart scientist. 'Back to the Future' is, in short, a classic."
    },
    {
      "rating": "10",
      "text": "My favorite movie of all time, The acting is amazing with Christopher Lloyd, Michael J Fox, and the rest of the cast. The story is very interesting, if not confusing at times, and it's interesting to see show events turn out in the future with the choices that Marty makes in the past"
    },
    {
      "rating": "10",
      "text": "Robert Zemekis' three dimensional time defying sci-fi thriller has really aged well for the last 30 years, and with its special anniversary coming up, we look back at the adventures thrills this must see masterpiece had to offer.\r Michael J. Fox in his biggest break, plays the flamboyant 80s teen wonder Marty McFly who wishes to hit a big break of his own and cease being the school loser, but when the eccentric scientist Dr. Emmet Brown(Christopher Lloyds)'s new time travel car is unveiled a series of unfortunate events sends Marty on the most unexpected situation of his life when he is sent back to 1955.\r In a desperate mission to return back to the present (1985) Marty enlists the help of a younger Dr. Brown as well as the power of the notorious lightning bolt that will disable the town's clock tower on this faithful week in town history, (also his only one way meal ticket back to the present) to get back and get things right again.\r But soon Marty's future soon becomes in danger when Lorraine Baines (Lea Thompson) the girl who would be his mother becomes lovestruck by him, he must convince her to hook up with George McFly the boy who would be Marty's father, who in an another bad situation is also the town's loser and his biggest rival being Lorraine's ex-boyfriend and school bully Biff.\r There is comedy, sci-fi, romance, thrills, and lots of SUSPENSE!! as well as history and 100% nostalgia that will make you laugh and cry, a touching family venture that still astounds audiences in more ways than one! a film that is too good for me it never seems to get old either the best film of the 80s!"
    },
    {
      "rating": "9",
      "text": "Once past a shaky opening overloaded with frenetic exposition, this time-travel odyssey accelerates with wit, ideas and infectious, wide-eyed wonder. Following nationwide, jumbo opening July 3, grosses are sure to brighten the Summer of Universal Studios and such key filmmakers as director Robert Zemeckis and coexec producer Steven Spielberg.\r The central winning elements in the scenario by Bob Oale and Zcmeckis are twofold: hurtling the audience back to a very accessible year, 1955, which allows for lots of comparative, pop culture humor, and delivering a 1985 teenager (Michael J. Fox) at the doorstep of his future parents when they were 17- year-old kids. That encounter is a delicious premise, especially when the young hero’s mother-to-be develops the hots for her future son and his future father is a bumbling wimp.\r Film is also sharply anchored by zestful byplay between Fox’ Arthurian knight figure and Christopher Lloyd’s Merlin-like, crazed scientist. The latter has mounted a nuclear-powered time machine in a spaced-out Delorean, which spirits the bedazed Fox 30 years back in time to the same little town in which he grew up.\r The film’s opening 20 minutes or so, in present time, are intended to set up almost all one needs to know about the characters and the madcap vision of the scientist.\r Indeed, the first image on the screen, of countless timepieces ticktocking away, is an effective symbolic touch. But the filmmakers scramble too furiously here and the film doesn’t find its control and its feet, and what a relief it is, until the hero is dropped into the same town in 1955 to the becalming background melody of the Four Aces singing “Mr. Sandman.” Then the fun begins.\r Fox’ wonderful goal, it eventually develops, is nothing less than making a man out of his father, who as a teenager is taunted by high school bullies and who is a peeping torn (of his future wife) to boot.\r In the film’s opening sequences, the father (wonderfully played by Crispin Glover) is an unctuous nit wit, and the mother (Lea Thompson) a plump, boozy, turtle-necked frau. It is the rearranging of time and events by our stalwart heroes, the wondrous youth and his magician scientist, that sets up the surprise ending when the young lad goes “back to the future” to happily discover his family, including a brother and sister, living a life that would qualify as a trendy Southern California magazine cover.\r If the filmmakers’ pre-’60s Be- Bop-a-Lula look occasionally suggests the ’40s more than the ’50s, the screen is constantly full of delightful comparisons: the old village-square movie house in ’55 with a marquee showing Ronald Reagan in “Cattle Queen Of Montana” has become a porno house in ’85. The Studebaker lot is now peddling Toyotas.\r The quaint shops on the square in ’55 are now squeezed into the metallic greyness of an outlying shopping mall. The malt shop has become an aerobics gym.\r None of these points are underscored but merely floating in the background as signposts of change. The most rousing and audience-grabbing scene of culture shock comes when Fox mounts the stage of a ’55 high school band, says he’s going to play an oldie, and digs into Chuck Berry’s “Johnny B. Goode ” at the dawn of rock ‘n roll.\r You can see the end of doo wop, syrupy ballads and, for that matter, the fade-out of strapless prom dresses and baggy-cuffed slacks. But the mellow image of the fab ’50s is the movie’s nice, lingering image.\r Performances by the erstwhile Fox, the lunatic Lloyd, the deceptively passionate Lea Thompson, and, particularly, the bumbling to confident Glover, who runs away with the movie, merrily keep the ship sailing. Thomas F. Wilson as the bully (what a change he comes to) and Claudia Wells as a gorgeous contemporary girlfriend of Fox contribute good support.\r Film’s time travel theme is sufficiently imaginative to remind filmgoers of James Stewart’s fantasy travels in Frank Capra’s “It’s A Wonderful Life.”"
    },
    {
      "rating": "8",
      "text": "Had Back to the Future come to life as originally envisioned by the purse string-holders at Universal Pictures (which owned the rights to Bob Gale's screenplay), it might have been a very different project, with Eric Stoltz in the lead role. Stoltz, however, bowed out early during filming due to that ever-popular reason: \"creative differences,\" opening the door for Michael J. Fox (or, as nearly everyone knew him at the time, Alex P. Keaton). Would Back to the Future have become a modern classic with a different lead actor? That's as much of an unknown as what Casablanca would have been like with Ronald Reagan asking Sam to play \"As Time Goes By.\" What is known, however, is that the version of Back to the Future produced by Robert Zemeckis remains one of the mid-'80s most enduring and enjoyable confections: an infectious mix of comedy, fantasy, satire, excitement, and nostalgia.\r Back to the Future is played neither entirely seriously nor entirely for laughs, and therein lies the nature of its success. It's funny and breezy but doesn't descend to a level where the characters are little more than props for jokes. We believe in Marty, like him, and root for him to succeed. Part of the reason for that is Michael J. Fox, whose unforced screen charisma had already made him a huge television success. (He was the #1 reason Family Ties was a Sunday night staple.) Fox brought a lion's share of that \"aw shucks\" affability to Marty, and Back to the Future launched Fox's big-screen career. In order to appear in Back to the Future (once he had agreed to replace Stoltz), Fox had to go virtually without sleep. During the day on weekdays, he would film Family Ties episodes. At nights and on weekends, he made Back to the Future.\r Like Crocodile Dundee one year later, Back to the Future is at its heart a \"fish out of water\" story, about an '80s boy being trapped in a 1950s small town. His mother is smitten with him, the local bully doesn't like him, his dad is a wimp, and he doesn't fully understand the customs and lingo of the period in which he has become stranded. Plus, there are the twin difficulties of repairing a state-of-the-art 1980s time machine using 1950s technology and patching the damage his presence has caused to the time continuum. Zemeckis plays much of this with a light touch, but when there are opportunities for some excitement (as when Marty has a deadline to get to the \"finish line\" or risk not getting to 1986 until he's middle-aged), he milks it for all it's worth. Back to the Future leaves viewers a little breathless, but not drained - exhilarated and smiling.\r Nostalgia plays a role in Back to the Future's success. For kids in the '80s, it suggested the '50s of Leave it to Beaver and other black-and-white sit-coms that were in UHF re-runs around the time Back to the Future opened. For 40-somethings, the movie provided a glimpse of their past through rose-colored glasses (always the best way to remember high school). When the film is watched today, some 25 years after its release, the nostalgia is double-barreled. Now, the '80s scenes are as evocative as the '50s material.\r f there's a problem with Back to the Future, it's the film's ending, which left open the expectation that there would be more chapters to come. In fact, the movie was originally designed as a one-off project, with the final scene being a quirky way to wrap up things rather than a teaser for another installment. However, when Back to the Future topped the 1985 box office and public sentiment was high in wanting to know what the problem was with Marty and Jennifer's kids, Zemeckis went to work on Back to the Future Part II and III, which were filmed back-to-back and took four years to reach the screen.\r The '80s were a dark and cynical decade, remembered by most for excesses of consumption and greed. Back to the Future is unapologetically lighthearted and upbeat - a tonic for a weary movie-going society. Even its theme song (Huey Lewis' \"The Power of Love\") brought a smile to the face on its way up the charts to the #1 position. For Zemeckis, this represented an opportunity to join his buddy Steven Spielberg on the A-list - his next film would be Who Framed Roger Rabbit?, and Forrest Gump was less than a decade away. Like Spielberg, Zemeckis has a keen understanding of how to blend diverse elements of comedy, action, adventure, and drama into concoctions that win over audiences.\r It's the kind of alchemy that, on those rare occasions when it materializes, cannot be replicated - as the filmmakers discovered when they re-assembled for Back to the Future Part II. The magic lasted for one film, and that's the one to re-visit."
    },
    {
      "rating": "10",
      "text": "Marty is a normal highschool student in Hill Valley. He likes a rock n rall and skateboard, and get a great friend, Doc Brown who convert 'DeLorean-car' to 'DeLorean-timemachine.' One day, terrorist assult Doc Brown and Marty bacause of plutonium. Doc get a gunshot, and Marty drive the DeLorean until 88mile per hour to rewind 30 years, for changing today. After Marty arrive the past, he tries to save Brown, but he doesn`t accept his suggestion. Doing that, Marty take a chance that meet his parents, but he get in the trouble related his life.\r Because he go back to the past, Brown save his life and black mayor get errected. It is 'today' to Marty but 'past' to Brown and other people. Therefore, I think Marty change only one thing, his family. In Marty`s past, they got unfair treatment, but, in Marty`s future, they become a high class.\r Watching this movie, I take a long time to think about time travel. I want to ask one question to you, If you go back to the past, can you change something in today? My answer is no, because all about today`s situations are caused by past things` conclutions. Your today is another`s past. However, in Back to the Future, Marty change his 1985s. In my opinion, it is just dramatic elements or the message that movie director want to send to audiences, \"humans are strong as can change the future.\" (or not)"
    },
    {
      "rating": "10",
      "text": "An absolute classic! It has a great plot and script, hilarious comedy, and is very well executed. If you haven't seen, then what're waiting for!? Go see it! It's one of the best movies of all time!"
    },
    {
      "rating": "10",
      "text": "Se qualcuno dovesse chiedermi quale sia il mio film preferito in assoluto la mia risposta sarebbe sicuramente Ritorno al Futuro. Una commedia fantascientifica avvincente, divertente ed emozionante che ha lasciato un segno indelebile nel mio cuore e che mi ha anche insegnato tante cose. Bellissimi effetti speciali, una colonna sonora straordinaria e tante, tantissime emozioni. Un vero capolavoro del cinema anni 80."
    },
    {
      "rating": "8",
      "text": "amazing film best film of 1985. it you have not see this film where have you been living in a rock. a amazing classic a must watch for anyone anywhere."
    }
  ],
  "recommendations": [
    "back_to_the_future_part_ii",
    "the_kid_who_would_be_king",
    "groundhog_day",
    "fantastic_beasts_and_where_to_find_them",
    "back_to_the_future_part_iii",
    "x_men_days_of_future_past",
    "the_second_best_exotic_marigold_hotel",
    "downton_abbey",
    "moonrise_kingdom",
    "spider_man_far_from_home",
    "christopher_robin",
    "finding_dory",
    "super_8",
    "zathura_a_space_adventure",
    "the_nutcracker_and_the_four_realms",
    "contact",
    "toy_story_3",
    "the_adjustment_bureau",
    "the_terminal",
    "black_widow",
    "t2_trainspotting",
    "about_time",
    "the_martian",
    "looper",
    "big"
  ]
}