{
  "id": 3101,
  "title": "Back to the Future Part III",
  "starring": [
    "Michael J. Fox",
    "Christopher Lloyd"
  ],
  "runtime": 119,
  "genre": [
    "Adventure",
    "Comedy",
    "Science Fiction"
  ],
  "description": "The final installment of the Back to the Future trilogy finds Marty digging the trusty DeLorean out of a mineshaft and looking for Doc in the Wild West of 1885. But when their time machine breaks down, the travelers are stranded in a land of spurs. More problems arise when Doc falls for pretty schoolteacher Clara Clayton, and Marty tangles with Buford Tannen.",
  "releaseYear": "1990",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/crzoVQnMzIrRfHtQw0tLBirNfVg.jpg",
  "categories": {
    "plot": 7.368421052631579,
    "acting": 7.0,
    "ending": 7.775,
    "soundtrack": 8.333333333333334,
    "cinematography": 5.0,
    "familyFriendly": 7.25,
    "funny": 8.066666666666666,
    "action": 7.25
  },
  "reviews": [
    {
      "rating": "9",
      "text": "While it is not as good as the previous two films, this film is still a good hit that takes us to a completely different period in time.  The cast is again perfect- the music is good, the story is lacking a bit.  But the film is entertaining in every way, which is why it scores so high in my book."
    },
    {
      "rating": "8",
      "text": "Part III of the trilogy gives us the most radically different movie with our characters journeying into the old west. So we've gone from science-fiction comedy to science-fiction comedy western. That's how you end a trilogy based around time travel! The film itself is a lot of fun and very adventurous with a great western rendition of the theme song which I love! A great conclusion to one of the all time greatest movie trilogies."
    },
    {
      "rating": "7",
      "text": "Back to the Future Part III did not need to exist but it works well just the same. Not only does the film clean up the events of the previous film but it justifies it. While this is the same story as the first one what makes it work is the heart. While the second film used time travel for the sake of action here it is used to explore the relationship between Marty and Doc and raise moral questions about destiny. It all ends in a sweet and satisfying ending, minus the bit at the very end, which I didn’t need. In a world where sequels constantly tarnish the reputation of the franchise and undo a perfect ending its nice to see one that’s enjoyable. While the franchise works better with just one installment the third film nicely closes out the trilogy creating one of the better movie sequels released and creates a nice trilogy."
    },
    {
      "rating": "7",
      "text": "Marty McFly: \"Hey, Doc! Where you goin' now? Back to the future?\".\r Doc: \"Nope. Already been there\".\r Marty, Trapped in 1955 digs out the Time Machine from 1885 to rescue Doc Brown back in the Old West from Buford \"Mad Dog\" Tannen to finally bring them all back to 1985 when the time machine experiences a major problem that can not be dealt with in the late 1800's.\r Back to the Future Part III is a satisfying ending to the BTTF franchise. The movie was cool, fun, sweet and intense in some scenes. I like this movie a little more than the second one, but the first one is still the best."
    },
    {
      "rating": "9",
      "text": "As most will agree this third instalment of the wonderful Back to the Future series is not the best. It's still an enjoyable movie and the setting in the wild west should make for a nice variety, but the story is just not as interesting. Also the romance between Doctor Emmet Brown and Miss Clara Clayton feels a bit corny.\r Michael J. Fox as Marty McFly and Christopher Lloyd as Dr. Emmet Brown are great once again. And the references to Clint Eastwood are very funny.\r \"What's your name, dude?\"\r\"Eastwood... Clint Eastwood!\"\r\"What kind of stupid name is that?\""
    },
    {
      "rating": "10",
      "text": "Doc im back from the future iv watched this so called Back to The Future and i just didnt go Back To the Future i went back to the past. In this third and final conclusion to such a great trilogy directed by Robert zemeckis and produced by Stevin Spielberg. In back to the future part 3 Marty go s to the Dr. Emmit Brown so he can take him to the real Dr. EMMIt Brown and take him back to the future and prevent him from dying in this fun western movie,conclusion to my 5th favorite trilogy."
    },
    {
      "rating": "9",
      "text": "An excellent conclusion to the movie trilogy. It packs the same humor and charm that made the previous movies so loved. The western setting gives the movie a unique fell that sets it apart from the previous two movies. As always there are references to the previous two films and it even answers some left over question from Back to the Future Part II, like about Marty's accident. As always everyone gives a fantastic performance as their respective characters. In conclusion this is an excellent movie and I loved every second of it. It might even be my favorite of the trilogy."
    },
    {
      "rating": "10",
      "text": "Back to the Future Part 3 pulls off something most final movies in a trilogy cannot, it manages to be great. Part 3 is made to the same level of quality as the first 2, but this time adding a western twist that ends up totally working. Rather than rehashing what the first two did, Part 3 gives you something new and fresh to keep the excitement high. Great writing, great performances, great music, great costume and production design, and lots of laughs all contribute to making this movie so awesome."
    },
    {
      "rating": "4",
      "text": "back to the future part 3 is not violent enough   if you wanna do a good movie add violence do not make it western make it as the future like part 2 .    expect it is dumb ending  the train   fly into the sky . shouldnt there be  a back to the future 4 instead of back to the future trilogy ."
    },
    {
      "rating": "5",
      "text": "This is the worst of the lot, the wild west setting has been done to death and with so many options its disappointing."
    },
    {
      "rating": "5",
      "text": "Only hitting mediocrity, Back to the Future Part III is when the series starts getting desperate. But, at least they got this far before starting the descent to empty sequels, so that's actually a plus!"
    },
    {
      "rating": "7",
      "text": "The film isn't terrible, but the wild west setting can turn a lot of people off. Luckily, there's a lot of good moments in this movie and ends the trilogy well enough."
    },
    {
      "rating": "9",
      "text": "I loved the first film, and while a step down I enjoyed the second as well. The third film is tremendous fun from start to finish, and contrary to what the other reviewers say I prefer this over the second. Yes the storyline is mediocre in places, but Doc's romance was touching and the steam-train finale was phenomenally staged. The film is set in the Old West and gives the stars a chance to revel in the situations that made the matinée western serials such a delight for so many people. The script is as witty and clever as the ones in the first two films, the direction is once again excellent and I loved the casting of the old western favourites such as Harry Carey Jnr and Pat Buttram. And as always Michael J Fox and Christopher Lloyd are on cracking form as Marty and Doc. Overall, despite the occasionally mediocre story, this is a worthy end to a great trilogy. 9/10 Bethany Cox"
    },
    {
      "rating": "5",
      "text": "Although the plot borrows some elements from the previous films, It's the change of settings that helps keep things fresh. It wasn't until the final act where things started to get boring because it was exactly the same as previous films. My one major critique for Part 2 and 3 is that the plot just wasn't different enough. But unlike Part 2, Part 3 can be somewhat fun to watch."
    },
    {
      "rating": "8",
      "text": "Not good as the second one, but is fine has it is, good conclusion of the series."
    },
    {
      "rating": "7",
      "text": "Though it - clearly - remains the most out-of-place installment in the classic franchise it inhabits, \"Back To The Future Part III\" still serves as a fitting sendoff to some of film's most beloved characters."
    },
    {
      "rating": "8",
      "text": "This was the final chapter of the series and while when I first watched it I didn't remember liking it, I thoroughly enjoyed it second time 'round! It probably isn't as good as the first two films but its still good and a great way to finish off the series. Great to have both Fox & Lloyd back also as the film wouldn't be much without them. The final scenes are really great, in particular that final scene with the train, but as a whole it's a great film and one I would easily recommend"
    },
    {
      "rating": "7",
      "text": "This movie still has its humor as the past two films, but it doesn't have that special thing that made the first two good. I can sit through this film many times, but it doesn't bring out the good thing like the past two. Now, the acting is good, except for a couple of characters that did not make a good impression on this movie."
    },
    {
      "rating": "8",
      "text": "\"The Different One\" is how to define Back to the Future III, I guess.\r If the first one was flawless and the second one was almost as good but with a few minor issues, this one just can't be compared the same way.\r Its setting in the Old West for most of the movie, its story, which is simpler and focuses a lot less on Marty McFly and much more on Emmett Brown, its climactic action scene, its general storytelling, it's all quite different and sets it apart from the rest.\r Is it good? Yes, no doubt about it. But the complex plots of the two last ones aren't as complex. It boils down to Emmet Brown having to go to the future or not, with or without his love interest, and Marty dealing with his own pride issues and face Buford Tannen or not. Not a bad plot, but not as interesting or complex.\r The talents of Marty and Doc are interchanged when Marty becomes the voice of reason and Doc becomes the \"born again teenager\" when he falls in love. A twist with potential, but not very fulfilling, although it does lead to several very fun comedic scenes, and some more sad ones. Character-wise, apart from Clara, whom I thought to be sort of underplayed and not a strongly established character(she goes from almost dying due to a carriage accident, to chasing at high speed after a train about to self-destruct, on shoes with heels, with little to no real explanation as to how the same woman can be in both situations!), I was happy with everyone, minor or major character, Strickland, the bartender Chester, most other people all felt good to me.\r As for general directing/screenplay, well, if the second one was a downgrade from the first one, I'd say this one is on par with the second one...but with a less complex plot that leaves a lot of room for more, this movie comes off as less good.\r Ultimately BttF was flawless and did everything right. BttF II had a few flaws and reused the formula less well, and BttF III does something different, does it quite well, but does have more flaws than BttF II in my eyes, the plot is less good, the characters are better but that doesn't make up for it, the plot inconsistencies are more numerous, especially the ending which contradicts a lot of what has been asked by Doc Brown in 2 and 3, and so on.\r As flawed and different as it is, if you liked the characters from 1 and 2, you'll surely enjoy this one, but I'm not sure that it should be taken as being quite the same as 1 and 2, nor being as good. It's still a solid 8/10 movie with high quality acting, good comedy and action all around."
    },
    {
      "rating": "8",
      "text": "Strangely this movie has a reputation of being bad for some people. Except the weaker start it is for me as good as the other movies and a worthy entry in the franchise. With this final entry it is a franchise that has only good movies which is rare. It continues directly after the prequel. Doc Brown is stranded in the wild west in the year 1885. Because the necessary technology is not available at the time he cant repair the timemachine / DeLorean. He is however happy there working as blacksmith and wrote a letter that he does not want to be rescued. However shortly after retrieving the stored DeLorean there is a revelation that changes everything and is the start of this final adventure. Again the story feels fresh and is enjoyable. It is immersive and I like the twists. The conclusion is also a satisfying and fitting end to the trilogy. I am repeating myself for this franchise but they get the mixture of seriousness and humor right (Third time in a row). Both do not harm the other and this is hard as many other movies fail in this regard. Like I already mentioned the start is a bit weaker and my theory is that this causes the more negative view as some people would quit there. After that it is excellent and the climax is really immersive. Again we have a great performance by the cast. I already praised Michael J. Fox as Marty McFly and Christopher Lloyd as Doc Brown in both prequels and they deliver again. They are iconic characters and pop culture legends. Thomas F. Wilson returns as antagonist but this time as Buford Tannen nicknamed as “Mad Dog”. He is ruthless, intimidating and menacing or in short an awesome villain. New is Mary Steenburgen as Clara Clayton. A really good addition to the cast. The rest of the cast completes this great performance. I want to thank especially director Robert Zemeckis for this great trilogy. I think he deserves more recognition. Visually the movie looks fully believable and the special effects are great. The soundtrack is top notch and Alan Silvestri should also be praised for his works. Overall this is a fitting final entry in the trilogy. The franchise has only good movies in it and I have fond memories. I recommend the whole trilogy as it is a connected complete story arc and great entertainment."
    },
    {
      "rating": "8",
      "text": "Marty McFly travels to 1885 to save his good friend, Doc Brown before he gets killed, they plan out a way to go back to the future before time runs out."
    },
    {
      "rating": "5",
      "text": "'Back to the Future Part III' is not quite as exciting as the first two movies... and I think the main reason for this is because the filmmakers decided to take these characters to an event where things get a little more far-fetched given when you think how this franchise begun in the first place.\r Marty McFly (Michael J. Fox) is back, and is still in 1955, he tries to convince Dr. Brown (Christopher Lloyd) about how his 1985 self accidentally got struck by lightning while in the time machine and apparently was transported back to 1885, according to the letter that was sent to Marty immediately after the incident occurred.\r The Doc, and Marty then try to find the time machine that was apparently buried somewhere the 1985 Doc left it while in 1885, in order for Marty to travel back home. It turns out that the Doc and Marty find out some horrible news in regards to the Doc being in 1885, and Marty feels he must go to that year and warn him before it's too late.\r The cast and characters are still great as you'd remember them, but I guess the main reason as to why this movie isn't quite as fun as the first two (the second one I only liked mildly) is due to the fact that they try to make the Doctor's character more interesting and human when he becomes infatuated with a woman he saved named Clara (Mary Steenburgen). The idea of the doctor's character was that he is just supposed to be an enigmatic mad scientist, but giving him a love interest doesn't make him that much more interesting, nor does it seem completely in his character.\r At times, it does feel like that the main characters of these movies have changed dramatically, and the situations that they're in this time just seem too unbelievable given how Marty is still supposed to be a high school kid despite the fact that this movie was released a whole 5 years after the original, and even then Michael J. Fox was older than what he was playing.\r 'Back to the Future Part III' is my least favorite in the trilogy, the idea of the premise is still great, and it's nice to see these characters go on different kinds of adventures... but maybe one adventure was more than enough for a young-adult."
    },
    {
      "rating": "8",
      "text": "While the first two were better, Back to the Future Part Three is a fitting end to the series, the cast is as good as ever, the music is awesome, and the ending doesn't leave anymore questions"
    },
    {
      "rating": "8",
      "text": "Ultimo capitolo della famosa trilogia, Ritorno al Futuro Parte III é un ottimo film che mette fine alle fantastiche avventure temporali di Marty e Doc. Malgrado io non sia un patito delle ambientazioni western, devo ammettere che il titolo in questione ha saputo divertirmi e coinvolgermi a dovere. Davvero un gran bel film."
    },
    {
      "rating": "7",
      "text": "The film isn't terrible, but the wild west setting can turn a lot of people off. Luckily, there's a lot of good moments in this movie and ends the trilogy well enough."
    },
    {
      "rating": "8",
      "text": "Previously on Back to the Future. This is it! Finally it's the final chapter of the trilogy you all been waiting for. Whilst Part 2 was not as good as the first, the characters are the same and it still has the charm to it. Now I will know what I could think of the third one and I've watched this twice now. I watched it after I finish watching Part I and II and now III. With it I finally watched the entire trilogy in one day. Just like I did with the others of course. After the events of Part II while being stranded in 1885 during his time travel adventures, Marty discovers that his friend Dr. Emmett Brown is trapped in the year 1885. He was killed by Buford Tannen, played by Thomas F. Wilson, who is Biff's great-grandfather. Marty then travels to 1885 to rescue Doc and return once again to 1985, but matters are complicated when Doc falls in love with Clara Clayton, played by Mary Steenburgen. You can tell from the cover that it's taken place in the western world where there's cowboys and indians. Due to the fact that this is the final part of the trilogy I don't feel any perfections in this not to say that it's the weakest but to clear up the fact that this is a western but some sci-fi moments in it. It contains some same scenes that you've seen before, Marty McFly wakes up in Lorraine's bedroom thinking that this is a dream but he realise that he's in a different year it's not. In Part II he walks away from Griff and then he calls him chicken and he hates being called chicken. In this one he just he calls him yellow and he hates being called that too. You get all the rest. Now with new scenes which are ripping off pop culture references when Marty wakes up again thinking about dueling with Buford Tannen making references to Robert De Niro from Taxi Driver and Clint Eastwood (which he calls himself) from Sudden Impact. I like the train scene after Marty fights with Buford in the third act and I also like the ending of this film after when the DeLorean is destroyed just like Doc wanted. An ending to the trilogy is what I love about when it gets wrapped up even when it says \"THE END\". So that's it for the Back to the Future trilogy. I hope you stick with me throughout all this. I know it's been a long journey but it's worth it. I still the first one because it executes perfection, the second is similar in terms of scenes and time travel but does it differently and now the third one is the last of the franchise. Thomas F. Wilson stole the show from three films, he's funny, he's psychotic and his performance is charming and intelligent. There's a cartoon series after this which I haven't seen but you can watch in the bonus disc when you own the entire trilogy. And I guess that's a wrap at this rate. Back to the Future is over and done with."
    },
    {
      "rating": "9",
      "text": "Back to the Future III doesn't work with the originals completely. But it has true love, a clear and pretty message to all viewers in general. It is also as full of thriller as the two originals and funny enough to get a great entertainment to the audience, that surely will enjoy this film."
    },
    {
      "rating": "8",
      "text": "La tercera entrega es la mas floja pero sigue siendo una pelicula entretenida, lo peor es que sea en el oeste.\r......................................................................................................................................................."
    },
    {
      "rating": "9",
      "text": "I loved part3. I liked the Western theme. I really loved the idea of a locomotive and time machine. If you like Western, you need to watch it."
    },
    {
      "rating": "7",
      "text": "Though it doesn't hold candle to the first one, Back to the Future Part III is superior to Part II, and a satisfactory conclusion to the trilogy."
    },
    {
      "rating": "6",
      "text": "Back to the future part III is an okay movie with a few problems    ."
    },
    {
      "rating": "4",
      "text": "3 part of Back to Future is even more swiftly throwing the franchise to the bottom. Changing the setting did not solve more than one sequel problem. Everything looks too cartoonish and comes down to self-replay. The only thing that you can respect 3 part is that it ended the trilogy."
    },
    {
      "rating": "8",
      "text": "A good conclusion to the story. This time, they go to the past, not the future. I enjoyed the feel of the wild west and how they turned it into another classic."
    },
    {
      "rating": "9",
      "text": "\"Save the best for last.\" Back to the Future has gone so far in the fields of time travelling, and its sounds great when they headed off to the Old West. Still, there are some parts of the movie that are either left unexplained or was part of a deleted scene. The thing is, even if that's the case, I would still love all the BTTF Trilogy and, for sure, recommend it for people of all ages. The movie is great, as well as the soundtrack. Speaking of soundtrack, I'm in mixed reaction with the third's soundtrack, especially the \"Old West\". Well, it makes me smile and cry."
    },
    {
      "rating": "8",
      "text": "Like the previous one the film begins where it stopped back to the future 2, now marty has to return to the past, in the old-west to avoid that the doc is killed by mad-dog, a distant relative of the biff. The film follows very similar With the other two first but with a few more things, the biggest of them is the incredible setting in the old-west, the film is not necessarily of that genre but it works as one in some aspects, but what tries to be relieved as the first two is the Travel in time and the mood that is well ok the best scenes in that aspect are with mad-dog, it is very similar to biff (after all they are the same actors) but it has some different aspects so that the character does not become a copy On the other hand, perhaps the biggest problem of the film is the lack of originality compared to the first two, even having other narrative aspects and many different things from the other films, it is not difficult to identify scenes that are practically copied in the other two films, It happens a time or two, there are many, what was supposed to be a kind of nostalgia about other films ends up becoming a copy, otherwise the script has originality, mainly in what is said the doc and clara novel, the Relationship between the two is very true and palpable, works very well, marty is still very good and biff is also great., The marty is still very good and the biff is also great. Even though it is not as original as the other movies has a fun narrative and works as pure entertainment, the characters have a relatively large evolution and the end closes perfectly.note 82"
    },
    {
      "rating": "8",
      "text": "Part III is very energetic and well acted, being my favorite of the trilogy and putting a very entertaining and well done western spin on the franchise."
    },
    {
      "rating": "7",
      "text": "A decent and coherent ending.This is the third and final film from the iconic trilogy \"Back to the Future\", one of the most notable of the 1980s. In this movie, Marty McFly finds himself arrested in 1955 due to the accidental departure of DeLorean after being struck by lightning. But at that very moment, he receives a letter with instructions that \"Doc\" Emmett Brown sent to him from the distant year of 1885, where he himself was imprisoned due to the time machine breakdown. The discovery of the machine and its repair eventually allowed Marty to move to 1885 to try to rescue his friend and to travel safely to the present in 1985.The film is clearly the continuation of its predecessor and has direct connection with it. The mix of sci fi and comedy continues to be successful but this movie is more of the same, the big difference being the trip to the Wild West and the way the movie made humor at the expense of the old westerns. The striking figure of Clint Eastwood, one of the greatest western actors ever, is clearly honored.About Robert Zemeckis's direction, or the cast, I can only restate everything I have said in the reviews of the two previous films. The director did a good job, leaving us in these three films, perhaps one of his most impactful works. Michael J. Fox and Christopher Lloyd continue to dominate the film and provide us with excellent dialogue and humorous moments. Thomas F. Wilson, who brought Buford 'Mad Dog' Tannen (and his descendant Biff) to life, is also performing flawlessly, and Mary Steenburgen is also very good in her role, making a romantic match with Lloyd.Special effects, visuals and sound are an inseparable and important part of any sci-fi movie, but they are also important when the task involves recreating a long-time historical epoch, such as the Old West. Here they work quite well. Although not an expert in the field, I think the way the Wild West was recreated in this movie is minimally credible, although things are unlikely to be as the movie shows. The film sought to recreate the old Western, and that was largely achieved.Thus ends the Back to the Future trilogy. Personally, I think this movie is a worthy end for her. The movie is not perfect, could have been improved on some things, but it honored the predecessors and gave the plot a logical close. Like the other two films, this movie has been shown to age well, and we are likely to continue to see it, even on TV, for a few more years."
    },
    {
      "rating": "8",
      "text": "Good finish to the Back to the Future trilogy. While is has an okay story, it doesn’t feel fresh, as if some of its material was borrowed heavily from the first."
    },
    {
      "rating": "8",
      "text": "Esta muy buena! La historia, la ambientación, la combinación entre una película de temática western y futurista combinada, las explicaciones cientificas y como Doc intenta recuperar a su amada. Esta todo bien!"
    },
    {
      "rating": "9",
      "text": "#3 was the weakest of the 3 films but it is still a 9.  I honestly want to give it a 10 but since I liked it the least, I'll drop it one point.  Still, great movie, story and closure to one of my favorite film franchises."
    },
    {
      "rating": "9",
      "text": "Emocionante, empolgante e satisfatório! Esse é o ultimo capitulo de Back to the Future.Mais uma vez, a mesma formula utilizada nos dois primeiros filmes é utilizada, e eu não sei... mas nunca cansa. Os personagens principais então, são super carismáticos. O desenvolvimento deles é atraente e fácil da acompanhar. A trilha sonora a esse ponto já é de emocionar, e mesmo sabendo que tudo acabará bem, visto a temática da obra, ficamos aflitos e queremos saber como tudo se desenrolará.A caracterização do velho oeste é boa, assim como os personagens daquele tempo apresentados. Biff Tannen é um vilão carismático e engraçado. Seu estereotipo é engraçado, e ver sua versão do seculo passado é sensacional. A Clara Clayton também foi uma otina adição a obra, sendo agradável e decisiva em alguns momentos."
    },
    {
      "rating": "7",
      "text": "More time travel = more inconsitencies. But the formula works again and it closes the trilogy nicely."
    },
    {
      "rating": "8",
      "text": "Good movie and it one of the greatest trilogies of all time. Light hearted time travel that isn't perfect, but it's a lot of fun."
    },
    {
      "rating": "9",
      "text": "A brilliant ending to an amazing trilogy of movies, It's got a great plot and it's got the great cast from before and even some new characters throughout. Also, Marty McFly (Michael J. Fox) and Doc Brown (Christopher Lloyd) have got some great scenes during this movie and during the western setting it's set in. Finally, I forgot to mention this in my other reviews for the other 2 movies but I'll mention it here and it's that all 3 of these movies have always had a good score from the man himself Alan Silvestri. Overall, this movie is a brilliant ending to this awesome trilogy of movies, this trilogy as a whole is worth the watch."
    },
    {
      "rating": "10",
      "text": "Its has a good story and never gets boring definitely a good movie to watch if your bored"
    },
    {
      "rating": "5",
      "text": "Not my favorite. I didn't really like the 3rd movie because I'm not really into western type movies."
    },
    {
      "rating": "6",
      "text": "Director Robert Zemeckis brings us the third and final chapter of the Back to the Future films completing the film series as a trilogy..... BACK TO THE FUTURE PART III is yet another sci-fi outing for Michael J. Fox and Christopher Lloyd as they return and there's so romance thrown in to the mixture. Mary Steenburgen joins Fox and Christopher Lloyd this time and I must say at times she's lovely and beautiful and at times also annoying. Back to the Future III is set in the old west with Michael J. Fox calling himself Clint Eastwood which is laughable as he hasn't the talent or the same personality for starters and Thomas F. Wilson plays Buford Tannen in the old west and Michael J. Fox and Christopher Lloyd hatch some plan to push the time machine along a traintrack with a train pushing it then it goes back to the future before the train track ends. The time machine at the end is destroyed and Christopher Lloyd who plays Doctor Emmett Brown has kids with Mary Steenburgen who plays Clara Clayton and disappears on a time machine style train. The acting isn't the problem it's the story as it's so horrible and not as fun as the first two films. Watchable at best.... Made in 1990"
    },
    {
      "rating": "7",
      "text": "I loved the previous two volumes of this series. Especially the second one surprised me by being able to keep the quality at the same level as the first one. Unfortunately, the third one didn't impress me personally as much as the previous two films. This is probably due to the change of setting to a western, which I didn't enjoy as much. With the previous films I was entertained all the time, but here unfortunately I was a bit bored at times and mostly I felt that it was not worth it. I didn't have some huge sense of closure to the trilogy when it was over. Unfortunately. I'm just giving my opinion. I wasn't that interested in the third installment and didn't have as much fun with it. For me, the weakest part of the trilogy. The change to western didn't suit me and I didn't find the plot as interesting as the previous films. Despite all that, it was a good movie. It was. I'm just saying that compared to its predecessors, it was weaker from my perspective."
    },
    {
      "rating": "6",
      "text": "An average ending to what was a quite entertaining franchise.While it does tie up some loose ends, the story seems laboured and forced and on the whole it's all rather underwhelming"
    },
    {
      "rating": "7",
      "text": "Suddenly, cowboys! The worst of the trilogy. Still weirded out by these movies, lol."
    }
  ],
  "recommendations": [
    "back_to_the_future_part_ii",
    "x_men_days_of_future_past",
    "twelve_monkeys",
    "captain_america_the_first_avenger",
    "looper",
    "spider_man_far_from_home",
    "ghostbusters_ii",
    "creed_ii",
    "fantastic_beasts_the_secrets_of_dumbledore",
    "fantastic_beasts_and_where_to_find_them",
    "superman",
    "superman_returns",
    "thor_ragnarok",
    "the_dark_knight_rises",
    "black_widow",
    "rocky_v",
    "the_karate_kid_part_iii",
    "star_trek_nemesis",
    "man_of_steel",
    "glass",
    "harry_potter_and_the_chamber_of_secrets",
    "the_karate_kid_part_ii",
    "rocky_ii",
    "indiana_jones_and_the_temple_of_doom",
    "the_chronicles_of_narnia_the_voyage_of_the_dawn_treader"
  ]
}