{
  "id": 1829,
  "title": "Bad Boys",
  "starring": [
    "Martin Lawrence",
    "Will Smith"
  ],
  "runtime": 119,
  "genre": [
    "Action",
    "Comedy",
    "Crime",
    "Thriller"
  ],
  "description": "Marcus Burnett is a hen-pecked family man. Mike Lowry is a foot-loose and fancy free ladies' man. Both are Miami policemen, and both have 72 hours to reclaim a consignment of drugs stolen from under their station's nose. To complicate matters, in order to get the assistance of the sole witness to a murder, they have to pretend to be each other.",
  "releaseYear": "1995",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/x1ygBecKHfXX4M2kRhmFKWfWbJc.jpg",
  "categories": {
    "plot": 7.571428571428571,
    "acting": 7.25,
    "ending": 8.4,
    "soundtrack": 8.0,
    "cinematography": 6.0,
    "familyFriendly": 3.0,
    "funny": 6.882352941176471,
    "action": 7.76
  },
  "reviews": [
    {
      "rating": "10",
      "text": "Bad Boys is a terrific action movie with Will Smith and Martin Lawrence. Michael Bay did a wonderful job on this movie. The movie is jam packed with action and the movie has many jokes. The storyline is clever and the actor that plays the villain is very good. He also plays the corrupt detective in Kiss Of The Dragon. Tea Leoni is also excellent in this movie. She hasn't been in many action movies but she was perfectly cast in this movie. She has many effective and amusing scenes with the other actors. A must see movie for any action fan."
    },
    {
      "rating": "9",
      "text": "Miami-Dade detectives Mike Lowrey (Will Smith) and Marcus Burnett (Martin Lawrence) blow a fuse when $100 million worth of heroin they recently confiscated is heisted from station headquarters. Suspecting it was an inside job, Internal Affairs gives them five days to track down the drugs before they shut down the narcotics division. Action meets farce when Marcus is compelled to masquerade as his partner in order to gain the trust of a call girl (Tea Leoni), a key witness in their investigation. Bad Boys stars Will Smith and Martin Lawrence have enjoyable chemistry; unfortunately, director Michael Bay too often drowns it out with set pieces and explosions in place of an actual story, but still is very good. Final Grade is an A."
    },
    {
      "rating": "9",
      "text": "Buddy Cop movie very fast and slick one liners thoughout. It is a very 90's movie but that is good for me that's probably the decade I was watching all the movies as they came well I still do now but the 90's was when I was growing up. Jerry Bruckheimer and Don Simpson where on fire in the 90's. The music in this is also like every Bruckheimer/Simpson production Top Gun, Con Air, The Rock."
    },
    {
      "rating": "9",
      "text": "The banter back and forth between Smith and Lawrence is priceless not only at the beginning but throughout the whole film. Michael Bay loves to saturate his action films with comedy and having real comedians deliver the punchlines actually works, however, compared to forcing others to try it out for example in Transformers and Armageddon which is also well-scripted. Only negative I have is that it could of of been a bit shorter, at which one point you will notice. Very Entertaining."
    },
    {
      "rating": "10",
      "text": "Classic --------------------------------------------------------------------"
    },
    {
      "rating": "10",
      "text": "The car driven by Fouchet during the end car chase is an old AC Superblower, basically a Shelby Cobra with a modified V8 engine. It is considered to be one of the fastest muscle cars ever created."
    },
    {
      "rating": "10",
      "text": ",,,,,,,,,,,,,,,,,,,,》》》》》》》》》》》》》》》》》》》》》》::::::::::::::::::▪▪▪▪▪▪▪▪▪▪▪▪▪▪▪▪▪▪▪▪▪▪▪▪▪"
    },
    {
      "rating": "10",
      "text": ";;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,"
    },
    {
      "rating": "10",
      "text": "Plot holes Fouchet is so concerned with Eddie Dominguez' partying with hookers and drawing attention after the heist that he even kills him and Max. Why would he leave the conspicuous package of heroin lying around at the scene of the double murder, thus tying it securely to the break-in at the police precinct?"
    },
    {
      "rating": "10",
      "text": "After the studio refused to fund the final action sequence, Michael Bay paid the studio $25,000 to shoot the scene."
    },
    {
      "rating": "10",
      "text": "SYNOPSISOne hundred million dollars worth of confiscated heroin has just been jacked from police custody. Once the career bust of Detective Mike Lowery (Will Smith) and Marcus Burnett (Martin Lawrence), the missing drugs now threaten to shut down the narcotics division of the Miami Police Department. When the drug investigation turns deadly, the murderers kidnap the only witness, a beautiful police informant (Tea Leoni) and close friend of the boys, which makes things personal. [Sony]"
    },
    {
      "rating": "10",
      "text": "$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.》■》■》■》■》■》■》■》■》■》■》■》■》■》■》■》■"
    },
    {
      "rating": "9",
      "text": "The amazingly entertaining and classic movie!great music and acting.the miami vibe and the chemistry was great.the story was decent screenplay was okay it felt slow and ending feel little stretched but the way the situations turned this was the great movie!i literally laughed as hell throughout the little fights between them in situations like danger which turned out to be helpful the character swap thing the call to wife amazing comedy.overall an entertaining classic!"
    },
    {
      "rating": "9",
      "text": "Epic action and epic comedy in the acting duo of Will and Martin. One of the best movies of 1995."
    },
    {
      "rating": "10",
      "text": "&*&*&*&*&*&*&*&*&*&*&*&*&&*&*&&&*&*&*&*&*&*&*&*&*&*&*&*&;^;^;^;^;^;^;^;&;^;&;^;^;^;^;^;^;^;^;^;^;^;^;^;^;^;^;^;^"
    },
    {
      "rating": "9",
      "text": "°》°》°》°》°》°》°》°》°》°》°》°》°》》°》°》°》°》°》°》°》》°@:@:@:@:@:@:@:@:@:@:@:@::@;@;@;@;@;@;@;@;@;@;@;@;@;@;@;@"
    },
    {
      "rating": "9",
      "text": "●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●●¡●¡●¡●¡:;:;:;:;:!:!:!:;;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:"
    },
    {
      "rating": "9",
      "text": "---------------------------¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○"
    },
    {
      "rating": "9",
      "text": "♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥"
    },
    {
      "rating": "9",
      "text": "¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¡¤¡¤¡¤¡¤¡¤¡•¡¡¤¡¤¡¤¡•¡¡¤¡•¡•¡•¡•¡•¡¡•¡•¡•¡•¡•¡•¡¡•¡•¡•¡•¡•¡•¡•¡¡•¡•¡•¡•¡•¡•¡•¡¡•¡•¡•¡•¡•¡¡°¡°•"
    },
    {
      "rating": "9",
      "text": "{}{}{}{}{}{}{}{}{}[][][][][][][][]()()()()()()()()()()()!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!"
    },
    {
      "rating": "9",
      "text": "⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙●■●■●■●■●■●■●$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$%&%&%&%&%&%&%&%&%&%&"
    },
    {
      "rating": "10",
      "text": "A+ *************************************************************************"
    },
    {
      "rating": "10",
      "text": "joojojjbhugytdrsawwarxvhonmoominkougyfdtyftdezawrsvunipmpkinugtdyfgiojohihihihguyfdr"
    },
    {
      "rating": "7",
      "text": "Finally could watch it in English with Crackle, got some memory of that movie when i was younger, watched it in tv synchronized. Great duo. Classic ´90 Action movie"
    },
    {
      "rating": "8",
      "text": "Fans of the slam-bang cop action comedy will have their entertainment glands solidly squeezed by this racy party popper of a movie in the line of 48 Hrs, Lethal Weapon and Beverly Hills Cop, produced by the Cop megabuck duo of Simpson and Bruckheimer. A sizeable spring hit in the States, it's already made cinestars of two American TV favourites, comic Martin Lawrence and Fresh Prince Of Bel-Air Will Smith, whose teaming as wisecracking Miami Vice detectives makes a hot partnership.\r Lawrence, a hyper hoot and the movie's principle charm, is family man Marcus; Smith, a studly dish, is Mike, a glamour boy with rich folks and a Porsche. Following the elaborately exciting heist of $100 million worth of heroin by arch European villain Tchéky Karyo, the motor-mouthed twosome have 72 hours to recover it before Internal Affairs shuts down their very own, disgraced drugs squad.\r Setting about it with appropriate dispatch, they tear through various glossy, violently efficient set pieces (shoot 'em ups, chases, explosions, the familiar drill), pick through grossly dead people and engagingly uphold the time-honoured bickering buddy tradition - they even have a shrieking boss (Joe Pantoliano) to chivvy them along.\r Comic complications come courtesy of a Comedy Of Errors-style swapped-identity charade. Frightened eyewitness Julie (Leoni) will only spill her guts to the partner with the ladies' man rep - Smith's Mike. But he's unconscious somewhere at the time, so Marcus takes over Mike's persona and bachelor pad to babesit Julie, leaving Mike to move in with Mrs. Marcus and the kiddies as a surrogate man of the house.\r Rest assured, we've seen it all a million times before, but there are abundant (foul-mouthed) funnies, and debut director Michael Bay shows his commercials expertise propelling the noisy nonsense into a frantically slick and thoroughly enjoyable extravaganza."
    },
    {
      "rating": "8",
      "text": "I love Will Smith in all his movies but this was poor at times by Martin Lawrence. Pathetic at times but I have to give it an 8 since its a Will Smith movie. Without him I would give it a 4. There was some comedy in it that was actually funny."
    },
    {
      "rating": "5",
      "text": "Fun characters, great action, poor and decent story. Overall this movie is good if you're looking for an action movie with comedy shapes. But i'll give it a decent score"
    },
    {
      "rating": "7",
      "text": "Michael Bay’s “Bad Boys” is energetic, infectious, and fun, with perfect chemistry between its leads."
    },
    {
      "rating": "5",
      "text": "Oh \"wow\", this is just a GREATTTTTTTTT \"Michael Bay\" movie I've seen in years. Wait, no; this is the BEST i've seen in history. All praise Mr. Bay, yarrrr."
    },
    {
      "rating": "8",
      "text": "Here's a good story. I'm not saying that is a big, but it is a film worth seeing on a Sunday afternoon. I recommend. No major extra film, simple and well done."
    },
    {
      "rating": "7",
      "text": "An enjoyable film that's well matched chemistry between Lawrence and Smith, along with the sets and explosive action make for an entertaining (and loud) experience."
    },
    {
      "rating": "6",
      "text": "\"Bad Boys\" wasn't imagined so much as it was stitched together, like some cinematic Frankenstein's monster, from the body parts of other movies. There is the mismatched cop-buddy angle from \"Lethal Weapon,\" this time with Martin Lawrence as the loyal family man and Will Smith as his partner, the handsome womanizer. As they try to track down the sophisticated thieves who stole $100 million worth of heroin from the police department's evidence room, they acquire a spunky, female sidekick, a la \"Speed.\" There is the Miami setting from \"The Specialist,\" exploding trucks from \"True Lies\" and enough shattering glass to rival either of the \"Die Hards.\" But formulas exist because they work, and \"Bad Boys\" is a loud, fast, action movie laced with comedy. In this case, the genre shows few signs of wearing itself out.\r Mr. Lawrence, a stand-up comic and star of the sitcom \"Martin,\" and Mr. Smith of the television series \"The Fresh Prince\" and the film \"Six Degrees of Separation,\" approach their roles as comic actors rather than action stars, and their playful attitude helps. Mr. Lawrence is Marcus, hyperactive and easily ruffled. Mr. Smith is Mike, the calm one, who has a trust fund and a lavish bachelor apartment but whose dedication to his work is, of course, unrivaled. Mike and Marcus confiscated all that heroin in the first place, only to have it stolen by an arrogant European villain (Tcheky Karyo), the logical foil to the down-home detectives. They have four days to recover the goods before the F.B.I. steps in.\r In no time, a prostitute is killed by the thieves while trying to help Mike get information. This has two results: it leaves her best friend, Julie, as the sole witness; it reinforces the time-honored movie rule that hookers are always more expendable than nice girls. Julie (Tea Leoni) calls Mike for help; he's away from the phone so Marcus pretends to be Mike, setting things up for the old \"Prince and the Pauper\" gag. For most of the movie, the family man has to live Mike's bachelor life while Mike looks after Marcus's family. The dialogue is not as snappy as it should be. \"The bad guys probably know where you live\" is saved by Mr. Lawrence's mocking delivery. The actors liven up their lines where they can and let the first-rate action carry the rest.\r Eventually, Julie, Mike and Marcus end up in a truck filled with barrels of flammable ether, the villains racing after them. Mike sends the barrels out on the road, shoots them on fire and sends them roaring into the cars. And there are bigger explosions ahead.\r \"Bad Boys\" is the first feature by Michael Bay, a 30-year-old director. His background in music videos is evident in the jumpy camera movement and quick cuts; his background as a maker of beer commercials is evident in the conspicuous beer signs that clutter the background. The film is produced by Don Simpson and Jerry Bruckheimer, the team behind \"Beverly Hills Cop\" and \"Top Gun.\" They know the action turf well and should have known better than to stumble into the trend to make movies longer. \"Bad Boys\" is just over two hours, and would have been better if it had been sleeker and shorter. After all, this film isn't aiming for high-toned drama, just high-energy entertainment, which is what it delivers."
    },
    {
      "rating": "0",
      "text": "Bad Boys is a piece of trash. A scum sucking off the brains of the inhabitants of earth."
    },
    {
      "rating": "10",
      "text": "This was one of the best movies I have ever seen. This was one of the best movies Will Smith has ever made. I compleatly recomend this movie to almoast anyone."
    },
    {
      "rating": "7",
      "text": "Came out in the '90s, but feels like it's from the '80s. Pretty much your standard vulgar buddy cop movie, but with the twist that they have to pretend to be each other. The reason for this is cockamamie at best, but a few good laughs are mined from the concept.The action is surprisingly sparse for a Michael Bay movie. A few shootouts are scattered throughout, but only two sequences really show off the bombastic explosions and extreme mayhem one would expect from Hollywood's king of making things go boom. Bad Boys is much more concerned with being a comedy so the majority of the running time consists of watching the two leads cuss each other out. Which isn't as amusing as Bay thinks it is. Much like me when I was 13, there are the occasional clever lines, but too often the verbal exchanges mistake gratuitous profanity for wit and miss the mark of hilarity by some margin.What ultimately made me enjoy Bad Boys was that it felt like a throwback to the kind of cheaper, sleazier flicks the less respected or past their prime action stars would take on while waiting/hoping for their next shot at a blockbuster. There's also the stars to consider. I can't say their chemistry was anything special, but both are great in their roles. Smith is a natural at being the loose cannon and playboy of the duo, but it's Lawrence who steals the show as the family man that's constantly agitated because he hasn't been getting any at home. Bay's immature and over-excessive style finds a pretty nice home for itself in the grimy city of Miami. His typical fetishes fit right in with the whole big-budget homage to the retro B-movie vibe it's got going on. However, while a fine addition to the neighborhood, if he wants these \"Boys\" to be the toasts of the town he'll need to clean up their mouths. Dirty words alone are no longer enough to make me chuckle. They need to be used in a way that's clever.7.5/10"
    },
    {
      "rating": "4",
      "text": "People who are impressed by the attitude of this movie are uncritically minded lame simpletons. When I first saw this movie in the mid 90s I thought it was 'meh' and did not understand the hype it was getting by easily impressed kids. Having just re-watched it, I can confirm that its even more lame than it was in the 90s. The only saving grace is the short chemistry brought by its 2 lead characters."
    },
    {
      "rating": "5",
      "text": "Bad Boys is reasonably funny and well-acted but also pretty darn dumb. Watch it for a laugh."
    },
    {
      "rating": "7",
      "text": "Bad Boys is the perfect example of a good Michael Bay film. Though off-the-charts stupid and featuring a few too many explosions, Bad Boys has a great time and is unafraid to show the audience how much it is having. Pairing together Martin Lawrence and Will Smith as the iconic Miami PD cop duo, Bad Boys' two charismatic leads carry the weight of this two hour film right on their shoulders and never waver. Together, they turn this otherwise disposable action flick into a quintessential buddy comedy that should be retitled, \"Male Banter: The Movie\". As a male who enjoys banter, Bad Boys was right up my alley.Advertising Ford and Coke along the way, Bad Boys is so stupid, it features Will Smith running through Miami with his shirt flying open after a Ford. He damn near catches the thing too. Hardly an endorsement of the brand, I would say. The film also tacks on Tea Leoni running around in a miniskirt for just shy of two hours. Not very becoming of the Secretary of State, but I guess we all have our wild and crazy phase. Bay shamelessly sexualizes her in every shot of this film and, while that can be a bit icky at times, it is merely par for the course in Michael Bay films and male-targeted action films. There will be bombs, bullets, and babes. Bottom line. Unfortunate to see a talented actress wasted as eye candy though, as she deserves far better. However, Bay does heavily sexualize Will Smith here as well, so it does sort of counter the scopophilia aimed at Leoni with some eye candy for the lady (singular intended) in the audience as well.Action-wise, Bad Boys is pretty bombastic. It is always fun and derivative with European bad guys and a convoluted-for-such-a-simplistic-movie plot, but it really does embrace this craziness via its leads. With Marcus Bennett (Lawrence) and Mike Lowrey (Smith) switching identities for convenience sake, Bad Boys is always poorly plotted. There is no reason for them to switch identities. Just tell Julie (Leoni) that you are Mike's partner and wait for him to get home, then problem solved. But, oh no, we have to pretend that this is a complicated situation that demands lying and manipulation at every step. This is why Bay's movies are always so dumb because they have fun, know they are supposed to be fun, but add on layers of plot and convolutedness that really do nothing. Fortunately, Bad Boys is incredibly fun. Lawrence and Smith are well matched as partners and their two-hour long banter session is the reason why I came away really enjoying this diversion. They both have tremendous comedic timing and the writing is incredibly funny in this section. Yet, all of the banter really emphasizes the friendship and bond between the two partners. They love one another and are unafraid to risk their lives to save the life of their best friend. More so than any buddy cop film, Bad Boys establishes two guys who are indebted to one another and both of them know it. For all of its inadequacies, Bad Boys really creates a great portrait of male friendship, which is impressive in a testosterone driven action film.Action-packed with charismatic turns from its comedically adept leads, Bad Boys is simply a ton of fun. Much of this review sounds like a half-hearted endorsement, but I rarely like stupid action comedies like Bad Boys. The fact that I came away enjoying this has to mean something. At the very least, the pairing together of Smith and Lawrence is eminently watchable and covers up the inadequacies of the script and Bay's direction with a huge band-aid."
    },
    {
      "rating": "6",
      "text": "(6/10) -- Considering the spotty career that would follow this debut film from Michael Bay, \"Bad Boys\" isn't so bad in perspective. Yes, the second act is a little tedious and it tends to meander at times, but the chemistry between Lawrence and Smith is quite fun to watch. Bay's trademark set pieces also do a good job of maintaining the interest in this semi-successful buddy cop flick. As a side note -- major props also go to Joe Pantoliano for brilliantly skewering the \"pissed off police captain\" trope in this one."
    },
    {
      "rating": "7",
      "text": "Fun action/buddy cop movie if nothing else. Will Smith and Martin Lawrence share incredible chemistry. The film tends to drag a bit and suffer from \"Bay-isms\" but it's still a  good film"
    },
    {
      "rating": "5",
      "text": "Pretty boring. It has a few jokes ok, ugly story, scenery pretty ugly    ."
    },
    {
      "rating": "8",
      "text": "Fans of the slam-bang cop action comedy will have their entertainment glands solidly squeezed by this racy party popper of a movie in the line of 48 Hrs, Lethal Weapon and Beverly Hills Cop, produced by the Cop megabuck duo of Simpson and Bruckheimer. A sizeable spring hit in the States, it's already made cinestars of two American TV favourites, comic Martin Lawrence and Fresh Prince Of Bel-Air Will Smith, whose teaming as wisecracking Miami Vice detectives makes a hot partnership.\r Lawrence, a hyper hoot and the movie's principle charm, is family man Marcus; Smith, a studly dish, is Mike, a glamour boy with rich folks and a Porsche. Following the elaborately exciting heist of $100 million worth of heroin by arch European villain Tchéky Karyo, the motor-mouthed twosome have 72 hours to recover it before Internal Affairs shuts down their very own, disgraced drugs squad.\r Setting about it with appropriate dispatch, they tear through various glossy, violently efficient set pieces (shoot 'em ups, chases, explosions, the familiar drill), pick through grossly dead people and engagingly uphold the time-honoured bickering buddy tradition - they even have a shrieking boss (Joe Pantoliano) to chivvy them along.\r Comic complications come courtesy of a Comedy Of Errors-style swapped-identity charade. Frightened eyewitness Julie (Leoni) will only spill her guts to the partner with the ladies' man rep - Smith's Mike. But he's unconscious somewhere at the time, so Marcus takes over Mike's persona and bachelor pad to babesit Julie, leaving Mike to move in with Mrs. Marcus and the kiddies as a surrogate man of the house.\r Rest assured, we've seen it all a million times before, but there are abundant (foul-mouthed) funnies, and debut director Michael Bay shows his commercials expertise propelling the noisy nonsense into a frantically slick and thoroughly enjoyable extravaganza."
    },
    {
      "rating": "4",
      "text": "Michael Bay's directorial debut might provide some laughs and some well-shot action, but ultimately, its undeveloped characters and dumb dialog make this flick  a boring watch."
    },
    {
      "rating": "8",
      "text": "Film critics are pointless fools with no taste. It was a hit when it came out and 25 years later, it still effortlessly entertains the whole family."
    },
    {
      "rating": "7",
      "text": "Bad Boys is a solid buddy cop movie with just the right amount of corny dialogue and even cornier, yet still endearing, editing and screenplay. Martin Lawrence and Will Smith have palpable chemistry and are a delight to watch. On the negative side, Michael Bay's affinity for gaudy explosions is back and as egregious as ever - though one can question whether that's truly a negative given the genre off the film. Tea Leoni's character Julie, despite being a main protagonist, is an absolute pain to watch and is very easy to root against."
    },
    {
      "rating": "7",
      "text": "Not a very common combination of Will Smith and Martin Lawrence, somewhat funny story though, and Téa Leoni is just damn gorgeous."
    },
    {
      "rating": "8",
      "text": "Es una película muy entretenida; tiene mucha acción y las actuaciones de Will Smith y Martin Lawrence son excelentes; es recomendable."
    },
    {
      "rating": "7",
      "text": "Flawed and sometimes pathetic, but there's enough monents to make it decent entertainment. Leoni's role is written poorly, but some of the jokes are hilarious, despite a terible script. Some good action, too."
    },
    {
      "rating": "5",
      "text": "It is nice, but it doesn´t have the crazyness i expected from Michael Bay."
    }
  ]
}