{"id": 4132, "title": "Bad Teacher", "starring": ["Cameron Diaz", "Jason Segel"], "runtime": 92, "genre": ["Comedy"], "description": "A lazy, incompetent middle school teacher who hates her job and her students is forced to return to her job to make enough money for a boob job after her rich fiancé dumps her.", "releaseYear": "2011", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/zpIY4qUSX91J9XpPgr0hFrk1eKr.jpg", "categories": {"plot": 3.8, "acting": 3.7857142857142856, "ending": 3.75, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 3.0, "funny": 5.08, "action": 8.0}, "reviews": [{"rating": "10", "text": "Far funnier than I expected, and way better than the critics' reviews suggest. So many recycled rom-coms out there, nice to see something different. Timberlake makes a great nerd, and it doesn't hurt that Cameron Diaz is still smoking hot."}, {"rating": "5", "text": "What a letdown!I wouldn't say its bad, but its not at the top of its class either. It seems this movie gave me only mild chuckles and a couple moments where I laughed, but it just seemed to be basic and didn't try to make the grade on original jokes (in other words, the writers didn't seem to try).Cameron Diaz was not bad in this movie. In fact, she played her role pretty well, but she seemed to be the only \"good\" performance in the film.Its that it seemed a little predictable because it was more like Spy vs. Spy between Diaz and Punch, harming one another, from Punch's snitching to Diaz's schemes, it seems very bland. Rent it! Its not worth your $12!"}, {"rating": "7", "text": "i thought it was a pretty funny film . the idea is pretty funny a teacher who hates teaching and just wants to find a rich man so she can mooch off him and live a easy life . camron diaz does a pretty good job and this and is pretty funny . the guy who plays the gym teacher (i cant think of his name) i felt should have had amuch bigger role. over all it has some pretty good moments that gave me a good laugh . it certainly isnt the best commedy your gona see but its a pretty decent one."}, {"rating": "7", "text": "This really that funny, is not the best movie, but entertaining it is. The entire cast gives very good performances, it is generally recommended and passed a good time laughing."}, {"rating": "8", "text": "This is a wonderfully funny movie.  I missed some of the funny lines because I was laughing at the ones before. Cameron Diaz was splendid.  I couldn't stand Justin Timberlake but I think that was because his character was so unlikable.  I highly recommend this for a no stress good time."}, {"rating": "7", "text": "I enjoyed this film. Albeit occasionally raunchy, politically incorrect, and hilariously wrong on so many levels, Diaz does a good job in this role. The entire film is really ridiculous, but that's what makes it fun. The cast is great with many of the current comic actors sprinkled in here and there. However, I am glad I trusted my reaction to the trailers and saved this one for a $1 rental!"}, {"rating": "10", "text": "Simply awesome movie! Great actors, lifelike screenplay, I love they kept mature language it makes this movie more realistic. Very lifelike comedy, unlike \"The Other Guys\" which is also an awesome comedy."}, {"rating": "8", "text": "Despite what a lot of critics may say, I found this to be a thoroughly entertaining film. The only bad point being the casting of Justin Timberlake as Scottt DeLacorte. I normally like JT and I know this film, or any of this genre, aren't exactly in the \"best actor\" oscar nomination basket but he just didn't suit the part. If you go in with an open mind a lot of points in the film are laugh-out-loud funny and as a whole it came together to to provide an really funny hour and a half. The humour ranges from stupidity to slapstick to gross to shocking and back. Who doesn't laugh at a well-timed fart gag? This is a genuinely funny film. If you want to laugh, go and watch it!"}, {"rating": "8", "text": "Bad Teacher is fun! Cameron Diaz has never been a favorite of mine, but she plays a selfish, ruthless **** with such ease that it makes one wonder...Anyway, I actually liked her in this. The supporting cast is wonderful and Jason Segal is charming and handsome."}, {"rating": "10", "text": "so I looked at the trailer for bad teacher, I said oh my god this movie will be perfect, funny, I was crazy to watch. so I went to the movies to watch, sad to say But I know with that empty feeling the movie accomplishes nothing and does nothing, take Justin and the area it says cameroz as a drugged and nn was so nice to nonsense, couples with no chemistry teacher no''bad''failed in your field!"}, {"rating": "10", "text": "We started watching this film with our 13yr old kid but I have to say with the language and the sex talk that goes off there is no way it should be rated a 12+ ...............................we turned it off and watched when the kids were in bed but even then it was not a good film.............................................such a dissapointment ......................"}, {"rating": "7", "text": "One of the most interesting films ever, is not very funny, but the performance of Cameron Diaz is awesome, is good film. Bad Teacher is a good normal film. That's all."}, {"rating": "9", "text": "This movie gets more and more annoying every time it comes on. Which is every day. The only reason I turn to it for less than a minute is to see Justin Timberlake."}, {"rating": "7", "text": "The movie looked great from the trailer, except the only problem was....those seemed to be all the funny parts. I liked that the main character didn't change in the end. I still liked it though. The setting was funny coming from a teacher's perspective."}, {"rating": "7", "text": "Bad Teacher is 2011 comedy from the writers of The US Office starring Cameron Diaz as a gold-digging, unscrupulous and rule-breaking high school teacher.\r Diaz plays the renegade teacher role with relish and is the highlight of the film. The Office style humour comes through in the form of some quirky characters, none more so than Lucy Punch's angelic and sugary sweet contrast to Diaz's character and the dolphin obsessed principal.\r The concept of a teacher not really giving a damn, not learning her pupil's names, providing education through the showing of films and turning up hungover most days is a promising one that could have yielded stronger material. That being said, I don't understand some of the low reviews this film received. Without being laugh out loud funny, Bad Teacher is a decent enough comedy providing you accept it for what it is, a fairly trashy comedy with a predictable ending."}, {"rating": "8", "text": "It surprised me , I didn't think they'll go all the way with the wild anti-hero story line , I thought they'd mellow down half way through but thankfully they didn't , Diaz's performance carried the film ."}, {"rating": "7", "text": "Cameron Diaz is raunchy, profane, and not fit to be a teacher at all, but you have to admit she succeeds with fulfilling these terms pretty well, as well as being quite shocking."}, {"rating": "8", "text": "It's not perfect but a mucky fun comedy, it's cheesy but overall Diaz shines exceedingly well as this mean-spirited gold digger and the supporting cast is comedy gold also equally funny. After her fiancee breaks up with Elizabeth (played by Cameron Diaz) who's a gold digger, who returns to teach at the middle school. She's a mean spirited,reckless, selfish pothead who's awful at her job (I'm surprised they didn't fire her) who doesn't pay attention to her colleagues or students, lets her students watch movies. The sweet teacher Amy Squirrel (Lucy Punch) who's right across from Elizabeth, who doesn't like Elizabeth and questions her and her teaching styles. When Elizabeth sees a substitute teacher Scott Delacorte (Justin Timberlake), she discovers he's rich and she tries to get with him, she learns that he likes woman who have big breasts and she tries to get silicone-implants. She wants a raise 10,000.00 for the surgery, what she learns is that the teacher with the best scores in the state exam who gets the 5,700.00 bonus. She changes her attitude and actually teaches the kids something. She tries to get the answers for the state test and makes her students prepare for the test. Amy gets suspicious and tries to get proof that Elizabeth is cheating. Timberlake was good and brings so much sweetness, like ability into his character  that it's charming and Punch is so elegant and sweet as well. Jason Segel is really funny, maybe the best character in this film. Grade B+"}, {"rating": "10", "text": "ore. You can tell all of her songs came from the heart. The only thing that I have to say is that I don't think \"Run The World (Girls)\" fits into the album AT ALL. Other than that, the album is flawle"}, {"rating": "5", "text": "I'm surprised that this movie let me down at so many points. The characters were unlikeable and disappointing. I thought that Scott Delacorte (Justin Timberlake) was the funny nerd guy, but he wasn't. The plot is stupid (I mean come on, her goal his to win the bonus so she can get a breast surgery to please a guy). In my opinion, there were a lot of weird and awkward teachers in this movie (something we can all relate to). Some parts were cliche, that I already saw in other '' school '' type of movies. Cameron Diaz  was okay as Elizabeth Halsey. I had a few chuckles while watching this film. I'm not giving it a lower mark because I manage to get entertained a little bit. Still, this movie could have been better if the characters were more developed and that it took itself more seriously."}, {"rating": "7", "text": "Just when I was beginning to feel Stan Marsh cynical about the summer, what a welcome relief! I had little expectation save for a few solid laughs. I laughed, a LOT - far more than I expected to. With all of the cookie cutter schlock that has \"something for everyone\" box office appeal these days, my standards have become ridiculously low for comedies. This raised them right back up there, kinda like the original Hangover did.  Cameron Diaz's Teacher is as fun as Billy Bob's Santa was.  Hollywood should embrace the antihero more and the superhero less."}, {"rating": "2", "text": "I thought this would at least be one of the brainless summer comedy flicks, but I didn't even that for the price of the tickets.  I'm not sure how a comedy with this cast can be so flat, but this film was pretty bad.  Sure, I laughed more than a couple of times, but I was certainly ready for the movie to end after ~75% of the way through.  I didn't really believe any of the characters (I know, believability isn't often necessary for brainless comedies, but this one was particularly bad), and I was given no reason to CARE for any of the characters.  Few were very likeable, and we weren't given enough character development to create any reason to pull for any particular character.  At least some other comedies of the past 5 years have given me a reason to take interest in a character of plot line.  Really, leave this for a DVD rental, at the maximum. If you decide to skip it, be happy knowing that you aren't missing anything much."}, {"rating": "4", "text": "I went into this movie excited for a good heartfelt comedy and left with four people who simultaneously said this sucked when the credits went up.  This movie had one believable character of more than ten and is really disappointing in a cast that had three huge stars and what looked like a great supporting cast.  Jason Segel was the only redeeming part of the film.  Cameron Diaz wasn't just a bad teacher but a terrible and unrealistic person.  Justin Timberlake was supposed to be funny as a quirky character but had zero realistic qualities and was really unlikable.  The same goes for the girl who played Amy Squirrel who was just awful to watch.  The message of the whole movie is be as terrible as you want and life will work out but the teacher who tries ends up having her life ruined.  Message aside there were a few cheap laughs but overall this no heart terrible message movie disappoints on a big level"}, {"rating": "0", "text": "Bad Teacher. Bad movie.The woman was horrible til the very and I mean very end. Her rival through the movie, though annoying, got everything bad she didn't deserve happen to her! It's something I wish I hadn't waste my time on. I went to the bathroom during it just so I could leave the room for a while. Also, not enough Jason Segal..."}, {"rating": "0", "text": "Bad Teacher was just plain BAD. The entire movie was choppy and un-fulfilling - plot, humor and all. I usually love Cameron Diaz, Justin Timberlake and Jason Segel, but they just didn't pull it off in this one. My advice - if you want to waste two hours of your life, at least save your money and wait for it to come out on cable."}, {"rating": "10", "text": "Elizabeth Halsey (Diaz) is the World's Worst Teacher.  Her goal in life is to mooch off a rich husband and her latest target is new guy Scott Delacorte (Justin Timberlake), a vanilla nerdy virgin who has a fondness for huge breasts.  Diaz, down-on-her-luck, living with a roommate, makes it her life's mission to turn her A-cups in double-D's and will find the money at all costs.  It's a silly premise, which the filmmakers make no bones about; they're only interest is mining the situation to the audience's delight.Elizabeth is textbook manipulative, and the script is balanced enough to enjoy her dishonesty every step of the way.  She's a horrible teacher and person, but the few slaps on the wrist she gets for her behavior are more than enough.  And when she's not getting a free pass, her character is tempered with just the right amount of ridicule.  My memory may be fuzzy, but in Mary (as unsatisfying to me as Teacher was a pleasure), a type of comedy not dissimilar to her latest, I recall Diaz playing a more reactive role.  It was essentially the boys Ben Stiller and Matt Dillon who drove the plot; she was more along for the ride with special gel in her hair to keep the wind from ruining it.  Here, she's in the driver's seat.  She is comfortable at the wheel and has her foot all the way down on the gas.  In her element, she has never been better.  She was born to the play this role.  The trailer for Teacher set the curve for success high.  And like the subsequent previews, the final result lives up to the promise.  It's un-PC in all the right ways and doesn't pander to the audience.  It has been a while since there has been a Hollywood comedy that has absolute respect for its audience and aware of exactly what it's doing.  There aren't any shocking moments it builds to, there's just a heavy dose of acerbic wit consistent throughout the script cowritten by Gene Stupnitsky and Lee Eisenberg (producer/writers for the American version of The Office).  There's no fat to be seen, as the venture is premium grade-A steak.  Yet, it also has some of the shrewdest editing in a comedy I have seen in a long while.  After the ironically homely credits, the story bursts out of the gate and remains full force until the end, and director Jake Kasdan (Walk Hard: The Dewey Cox Story) keeps things clipping along completely conscious of its absurdity.  It has too many jokes to tell; there is no time to dilly-dally.   There are a few brief random moments that even work despite themselves.  The supporting cast is stellar; they all stand and deliver.  Timberlake is fine as the dippy liberal who isn't as progressive as he thinks he is.  But the standouts are TV actors from such sitcoms as The Class, How I Met Your Mother and The Office.  Lucy Punch's comic chops first came to my attention in Annette Being's period Being Julia.  She joined The Class shortly thereafter, but since its premature cancellation, she hasn't had much to chew on other than taking over a role for Nicole Kidman and standing out in the subpar You Will Meet a Tall Dark Stranger.  Here, as over-achieving Amy Squirrel, she plays the foil to Diaz, just as Diaz did to Julia Roberts in Wedding.  Besides batting all of her lines out of the park, she improvisationally employs weird facial gestures, conducts a simple, yet stealthy monologue about math with an accent and squeezes into a men's urinal while discussing matters of import.  Jason Siegel is downright adorable and makes a great partner for Diaz.  Not really a spoiler, they're obviously going to end up together from the get-go and their banter doesn't make it hard to accept.  However, the crown for best supporting player has to go to Phyllis Smith as Lynn, Diaz' sidekick.  I don't watch The Office and I haven't seen her anywhere else to my knowledge, but it appears she doesn't have the ability to not be funny, whether it's with a look or her uniquely meek voice.  The woman is a comic secret weapon and her chemistry with Diaz is phenomenal.  With the CBS and NBC networks represented in this movie, ABC isn't left out either, but the actor's presence is such a surprise and so unrecognizable at first, I'm not going to spoil anything.  You'll just have to figure it out.  Additionally, there's another surprise actor (her name is in the opening credits) who has a small, but delightful role.  If you're a fan like I am, my bet is that you'll kick your legs in the air and \"love it.\"  Read the rest of the review by googling Cinesnatch Bad Teacher."}, {"rating": "3", "text": "Decent movie, held interest. Unfortunately though not a single laugh-out-loud moment for my wife or I (couple in mid-30s). Since this is how I rate comedies (the LOL factor), I cannot score this highly."}, {"rating": "5", "text": "While watching the movie I discovered that some of the language used was not only inappropriate but inexplicable unnecessary. The movie did have its humorous moments but that was only on occasion. I expected more from Justin, but Cameron was not surprising seeing how she acts as a host for other producers. I have lost most respect for her for the roles she agrees to act in. She should be more classy. All in all it would only be a one time movie to see for me."}, {"rating": "3", "text": "It's just a stupid movie. Every single laugh is in the red band trailer. The rest of the hour and a half is filled with dick jokes and attempting to have the audience like an awful human being. I'm not kidding when I say \"Jack and Jill\" was funnier. And I HATED that movie."}, {"rating": "5", "text": "Cameron Diaz stretches believabilityâ"}, {"rating": "1", "text": "There isn't much to say about this film other than, \"What a shame.\"  There isn't a lick of cinematic value here. The story, acting and reason for existing are nowhere to be found."}, {"rating": "2", "text": "I thought I was going to laugh my ass off at this movie. And I actually did. Only I wasn't laughing for the reasons I thought I would. I was laughing at how ridiculously bad it was. How bad was the acting in this movie? I've seen most of the main actors in this film do some great and hilarious work in their previous films so how could they be this terrible? It made no sense at all. They seemed to be working up to something and then they completley stopped and decide to just end the movie with no reconciliation at all.Diaz's character ended the film the way she started it.  The gym teacher could have been played by anyone moron with a sweatshirt. The film started all these different plot points with so many characters and didn't finish any of them. EVERY character and storyline was EXACTLY the same as they were when they started. There was no resolution to the film at all. Evidently Diaz's character realized that she didn't want to be a \"bad teacher\" or a shallow person anymore, but they don't give any reason why. She just \"changed\" and all of a sudden didn't like the clueless but wealthy teacher and started liking the gym teacher.Please don't waste even a rental on this idiocy."}, {"rating": "0", "text": "This was just a really bad movie. I did not laugh a single time and in the end you feel that you would really like to see the main character go to jail then get her own way."}, {"rating": "3", "text": "Went into this one expecting at least a couple of laughs, and yes there are a few funny moments, ultimately thought this movie is just poorly made. Cameron Diaz's character is meant to be a bad teacher, yes we get it, but does she also have to be an unlikable **** for 90% of the film? How is the audience meant to empathize/sympathize or identify with this character? It just gets to the point where you don't care what happens next because the character is just so unlikable. Yes I understand that to some extent this is mean to be the point, that it is a \"funny\" story of redemption, but that redemption and arc comes way too late, by which you point you've already lost interest. I would've probably enjoyed this more if the character was a fraction more believable and little more likeable. Definitely save your time and your money - unless you like watching unlikeable characters that will piss you off and accomplish nothing but learn to be a \"little\" nicer by the end, wow, what a pathetic resolution."}, {"rating": "0", "text": "This movie was truly horrendous. I didn't laugh a single time. Sure,  I smiled during one scene, but that's it. I've seen some really awful comedies in my time, but most of them manage to get at least one laugh out of me. But not with Bad Teacher. Whatever you do, do not waste your hard earned money on this. There is nothing worth seeing here. I hated every single one of the characters, especially Cameron Diaz (when was the last time she was in a good movie?). What, are we supposed to be charmed by her whorish, disgusting behavior? I wasn't. In fact, I found myself hating her more and more with each scene I saw her in, until I felt like beating her senseless at the end of the movie. Also, the premise is completely ridiculous: are you telling me the school was so blind that they hired this woman in the first place? And did none of the kids mention to their parents that their teacher was, you know, a legitimate prostitute? I can't count how many times I facepalmed during this movie. Thanks to Bad Teacher, I now have a permanent imprint of my hand on my forehead. Please, for the love of God, don't see this movie. You'd be better off sticking your ten bucks in a pipe and smoking it."}, {"rating": "3", "text": "I was really looking forward to seeing this movie (mainly because of Jason Segel) but was quickly disappointed. While a good amount of the movie was pretty funny, a film can't stand alone with jokes. There was no depth to the plot line whatsoever, the writing was horrible, and nothing made sense at all."}, {"rating": "2", "text": "Bad Teacher emphasizes how Cameron Diaz is a Bad Teacher in a humourers way, unfortunately, she's just plain bad...bad. Bad Teacher starts out boring and pretty much keeps on going like that throughout the whole movie, with a few jokes here and their. The plot is downright terrible and never draws you in at all, that and it has no depth at all. Cameron isn't a terrible actor in this movie, although the screenwriters are, all of her lines are a snoozefest and the other characters have no real emotional attachment to the plot at all. All of this comes together to become a very BAD movie.Final Notes: If you like sitting in a movie theatre to watch a movie trying to be funny, you'll love this."}, {"rating": "2", "text": "With a couple of forced laughs, this movie is better off as a rental or waiting for it on cable. I wasn't expecting much and it delivered exactly what I expected -- not much."}, {"rating": "0", "text": "Unwatchably bad. Incredibly disrespectful to real teachers.I cringed repeatedly at the terrible use of cliches and ridiculously exaggerated and unrealistic characters."}, {"rating": "3", "text": "I honestly praise Diaz performance but the script is so bland and efortless...no miracles would save this. Not the worst comedy ever but easily one of the worst I've seen this year so far."}, {"rating": "1", "text": "Just lop off \"Teacher\" from the title  This was awful!  To be fair, I am not a Cameron Diaz fan, a Justin Timberlake fan, a Jason Segal fan, or a Lucy Punch fan, and I can say with certainty that they only strengthened my low opinion of them all.  These \"actors\" were terrible, the script was a dog, and the directing was embarrassing.  The ONLY reason I'm giving this comedy-bomb a \"1\" is because of a great cameo by Modern Family's Eric Stonestreet.  It was nice to see him perform a completely different role, even if it was too brief.  Kudos also to Phyllis Smith, from The Office, for a good supporting role performance.  The theatre was more than half full, but you could almost hear crickets chirp for most of the film, except when Mr. Stonestreet and Ms. Smith appeared."}, {"rating": "6", "text": "Bad Teacher is a crude disrespectful movie that should not be viewed by children because of nudity, foul language, crude humor, and sexual content. But overall if youâ"}, {"rating": "2", "text": "I didn't even watch the movie entirely. It seemed terrible already from the start, - and the main actor looks so annoying I wanted to punch that stupid blonde. Stupid movie. Not worth watching."}, {"rating": "0", "text": "If you really want to see a movie that isn't funny at all, has bad acting and is over the top, watch it! These were the most useless 2 hours 8've spent to a movie in a very long time!"}, {"rating": "3", "text": "Cameron Diaz in another easy, typical Cameron Diaz role. Sure, I laughed, I smiled. But I wasn't left with very much more. With a premise such as this, the director and actors truly need to push the wallet--and Bad Teacher didn't."}, {"rating": "0", "text": "Elizabeth Halsey returns back to the school that she had just left the previous year, after her marriage to her wealthy fiancÃ© is called off. Though she wants nothing more than to be married to a rich provider, she continues to teach to save money for her desired breast implants. All the while she constructs devious plans to procure what she desires; whether that is cash or the heart of a rich substitute teacher. Throughout her year at the school a zealous teacher tries everything in her power to show the school what a terrible teacher she is, and yet has her plans foiled, and backfired on her every time. This movie does not have many good qualities or morals to glean from. Halseyâ"}, {"rating": "0", "text": "Absolutely terrible and the worst movie I have ever seen. I'm not a fan of American comedies, but this one takes the cake. Horrible characters, mediocre and predictable plot, meh acting, and the humor is just not funny. The main character is a terrible person and there was NOTHING charming about it. How can you even pretend this is revolutionairy or good? This movie tottally sucked and my family agrees."}, {"rating": "0", "text": "Very very bad movie!\rNo history, no humor, character zero!\rPity to have lost time on this film!\rNormally Cameron Diaz is a good actress but on this film... Just a stupid teacher"}, {"rating": "0", "text": "so i saw a lot of commercials about this movie and i decided to watch it,and i can easilly tell that watching this movie has been worst 92 minutes of my entire life,it wasn't even funny and i'm not exaggerating,expected a lot more from this movie found nothing."}, {"rating": "2", "text": "It's unpredictable to even imagine how terribly bad Bad Teacher is. Skip this one or you'll have to suffer the wrath of Cameron Diaz and her ridiculous, crazy, and rude life."}], "recommendations": ["trainwreck", "no_strings_attached", "the_dilemma", "good_luck_chuck", "tammy", "legally_blonde", "thunder_force", "the_proposal", "couples_retreat", "dirty_grandpa", "the_pacifier", "second_act", "a_bad_moms_christmas", "little_fockers", "the_wrong_missy", "17_again", "the_change_up", "just_go_with_it", "my_spy", "hubie_halloween", "the_break_up", "that_awkward_moment", "paul_blart_mall_cop", "you_again", "easy_a"]}