{
  "id": 2531,
  "title": "Bad Moms",
  "starring": [
    "Mila Kunis",
    "Kristen Bell"
  ],
  "runtime": 100,
  "genre": [
    "Comedy"
  ],
  "description": "When three overworked and under-appreciated moms are pushed beyond their limits, they ditch their conventional responsibilities for a jolt of long overdue freedom, fun, and comedic self-indulgence.",
  "releaseYear": "2016",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/9PaIkUnfOcU1wi5cFbamnmAkjEs.jpg",
  "categories": {
    "plot": 2.257142857142857,
    "acting": 2.6666666666666665,
    "ending": 4.0,
    "soundtrack": 5.0,
    "cinematography": 3.0,
    "familyFriendly": 3.0,
    "funny": 5.5964912280701755,
    "action": 5.5
  },
  "reviews": [
    {
      "rating": "4",
      "text": "This movie is very raunchy and focuses on the racist,sexual jokes witch will make you gag the movie was hardly funny and I enjoyed most parts,but considering the movie was so bad,bad moms makes one on the list"
    },
    {
      "rating": "6",
      "text": "By the numbers, predicable and an execution we've seen a million times before. But the three leads are what make the movie as decent and at times fun as it was, giving me more laughs than I would have expected."
    },
    {
      "rating": "0",
      "text": "There are tons of bad movies out there, but it is quite unusual to find an *evil* movie, something that makes you feel that the people responsible are unethical inhuman beasts who belong in a zoo's cages rather than in society. And here is one such case. In Bad Moms, there is a scene that mocks non-circumcised men. Yes, let that sink in: this excrescence of a movie body-shames men for *not* having their genitals mutilated. This is far beyond unfunny, this is morally unacceptable."
    },
    {
      "rating": "0",
      "text": "This movie is pure misandry when it comes to the ignorant scene of the three hens exposing their nescience about male anatomy and mocking normal, intact genitalia. Imagine the outrage if the roles were reversed and a group of men were shaming the natural female body as 'disgusting'. This display of ignorance is what is disgusting. Circumcision is stupid and so is this movie."
    },
    {
      "rating": "2",
      "text": "2003 Bad Santa\r2011 Bad Teacher\r2014 Bad Neighbors\r2016 Bad Moms\r2018 Bad Dads\r2019 Bad Kids\r2022 Bad Cops\r2023 Bad Hobos\r2026 Bad Spies\r2027 Bad God\r2029 Bad Heroes\r2031 Bad Managers\r2032 Bad Santa reboot\r2035 Bad Anesthesiologists\r2040 Bad Moms 2"
    },
    {
      "rating": "7",
      "text": "This is one of those movies that the marketing execs looked at and said, hmm, what do we have here? Both my wife & I both felt the disconnect btw the trailer and the film itself. It was marketed as a female Hangover albeit it reminded me more of Old School (dunno why). Regardless, I get why said marketeers were mystified.\r Nothing even slightly original here but we enjoyed both Hahn and Bell as the sidekicks with all the best lines. Ms. K was fine as the protag. I laughed, I ate twizzlers and my wife was in a good mood after. Maybe I should have rated it higher..."
    },
    {
      "rating": "2",
      "text": "A movie that emphasizes the terrible way people are raising their kids by pandering to their every need, doing their homework, and creating spoiled, self-centered, helpless people. In theory this should be a good movie, great cast, but uses the same \"bad\" behavior for cheap laughs that every other \"bad\" movie uses. The plot and setting are a painful reinforcement of gender stereotypes, with moms that do everything, even their kids homework. In 2016 this shouldn't even be being made and it is completely offensive that the child says she won't get into ivy league and will have to become a \"teacher\". Can see how they really value education by the clever and witty plot and multi-dimensional characters, oh wait, they don't have those."
    },
    {
      "rating": "0",
      "text": "Bad Moms is a \"Bad\" Movie.\r This film tried much too hard with the overuse of raunchy, vulgar unnecessary humor, which cheapened the movie, and caused this film to be nothing more than an overrated B Movie embarrassment.\r I am not a prude by a long-shot, it just didn't work. Just a badly written movie.\rI couldn't even utter a chuckle or a smile from these God awful flat  jokes. All I could do, was roll my eyes with disbelief. Painful to watch.\r This movie \"could\" have been SO brilliantly funny, witty, and adorable. What were the writers thinking??\rIt's definitely..... NO 'Hang-Over' movie. How could anyone remotely compare the two. Ouch!\rWhat can I say..... It was just WRONG on every level.\r Lastly- The first movie I ever walked out on, and demanded a refund. Thank you AMC Theaters for the credit. I wouldn't have paid $5.00 at a cheap show for this mess.\r psst. Mila Kunis- I really like her. But this movie destroyed her\rcomedy appeal.\r Please rethink, before you visit this movie."
    },
    {
      "rating": "2",
      "text": "I saw it for free and I still want my money back.  A horrible let down from a great cast.  A few cheap laughs.  The message the movie was telling is an important one, a huge dynamic in today's world of motherhood, however it's portrayed in an escapist tone.  To give bravado to being a bad parent and cheap meaningless sexual encounters with even shallower characters.  A most Madame Defarge account of today.  There are many ways these issues can be addressed.  Education, research, self betterment.  Instead to show recklessness and drugalcoholist as answers to the issue is negligent and unintelligent.  Frat boys do a movie on bad moms!  I expected much more from an intelligent person such as Mila Kunis."
    },
    {
      "rating": "0",
      "text": "If you already loathe men, this film will do anything and everything to reinforce that idea.  \"Bad Moms\" is so categorically misandrist as to be painful to watch.  It is utterly dismissive of the male role in the family unit, to such an extent that calling it dismissive fails to capture how irrelevant the writers consider men in the lives of the moms and children portrayed.  The film endeavors to suggest that female empowerment in the family unit can only be accomplished through emasculation and dismissal of the male.  It goes on to portray abandonment of responsibility, substance abuse and casual sex as the only viable pathway to happiness and personal fulfillment for moms suffering from a lack of support at home.  To call the plot of this movie far-fetched just wildly understates the level of abandonment of credulity that this work required."
    },
    {
      "rating": "9",
      "text": "This movie is very funny and very memorable. This movie tries something new and does it well. And Stromwatch is I bet gets offended by everything even if its a joke. Which this movie IS."
    },
    {
      "rating": "7",
      "text": "Mila Kunis stars as an overworked, underappreciated mom who decides she's had enough of the constant pressure to be perfect. She makes 2 friends (Kristen Bell and Kathryn Hahn, who creates the movie's most enjoyable character) and they set out to make the title come true. This is the ultimate chick flick. The audience was almost exclusively women and they were loving it. The script crammed full of F-bombs and wacky acts, much of them funny. As is the fate of many modern movies, it sometimes tries too hard to be outrageous. The mom message gets a bit heavy-handed, but there are moments of genuine sweetness that adds to the appeal. Fun for moms and highly relatable with its amusing approach."
    },
    {
      "rating": "0",
      "text": "This movie is CANCER.\r Too bad, because Mila Kunis and Kathryn Hahn really are funny, and some jokes are good. But the only way I can explain good reviews it is only because they must be fuelled by the secret elite trying to spread the dumbness that such a movie export.\r Good perfomrance, good jokes (some) BUT the idiocy of certain logics baffles me. Watching the plots unfold made me feel offended. As if a human being I am nothing but powerless towards the better positioned in the \"social hierarchy\". I wasted too many words. Watch this movie only if you like mila kunis brand of comedy and if you are a masochist. Ot you hate yourself"
    },
    {
      "rating": "9",
      "text": "Coming from a dude, I wasn't expecting to like this movie much at all.  That being said, I was laughing almost the entire time, because the mother of three children (sitting next to me) has been through a ton of this stuff, and it was very relatable to what we've talked about as friends, over the years.\r There's a lot of truths in the film, the chosen actresses to lead are fantastic too.  Kathryn Hahn has always been super hot to me and cracks my ass up!  Mila Kunis is a great lead, and it's good to see her back on screen again.\r Bridesmaids was a horrible film, compared to this... dunno why people build up Paul Faig's stuff so much."
    },
    {
      "rating": "4",
      "text": "I am clearly not the target audience for this film. I'm sure many moms will get a kick out of it, but avoid getting dragged along with them if you aren't one. It feels like if Nancy Meyers tried getting crude and making her own Bridesmaids. Cheap slapstick and gross humor combine with pulpy wish fulfillment and unnecessary caricatures of the male sex. Still, the message at its core is worth telling and it did still make me chuckle a few times with the more nuanced jokes, so it gets a point back there. I guess I should have known better what I was walking into."
    },
    {
      "rating": "7",
      "text": "I wonder why so many negative reviews - movie was really funny and I actually hoped that most of it will be like the first part, with the crazy stuff, partying etc and the bad attitude, but it slowed down towards the end and came down more calmly and with less jokes and got quite boring and cliche actually - was predictable what will happen. Would be more fun if there would be something else happenning. But I actually did like the nasty jokes and the language, don't know. Of course if those would be fart jokes etc, it would be dumb, but here the jokes were quite fun, even the dumb ones."
    },
    {
      "rating": "7",
      "text": "Typical average movie. It was not bad, but nothing wonderful either. Only thing what made this movie better was beautiful Mila Kunis. who was wonderful like always."
    },
    {
      "rating": "0",
      "text": "I watched Bad Moms with my fiancee. I was mildly excited for the movie as I am a big fan of all three leads. All three women do a fine job with the script they have been given. It is only because of my appreciation of these three that I even gave this movie a four. Their strong screen presences (particularly Kristen Bell's weird stay at home mom) carried what is otherwise a dumpster fire of a film. First lets just get the main message of the film out of the way. It repeatedly depicts that men are bumbling, incompetent, and narcissistic. Even Amy's (Mila Kunis) son is presented as a spoiled brat while her daughter is a hard working but stressed achiever. The only male presented in an even slightly positive light is a widower who is just a vapid body for Amy to have rebound sex with. No men are shown at the PTA meetings, taking care of their kids, or doing anything remotely parental. If some rampant sexist depictions of women were done in the name of \"comedy\" the movie would universally be panned. Instead the film continues the growing trend that it is okay to depict (white) men as buffoons. The rest of the plot of the movie is basically paint by numbers. There are nuanced characters or any real insight besides \"moms are the best but society demands too much of them.\""
    },
    {
      "rating": "7",
      "text": "No question the film is inconsistent when it comes to laughs, but when it hits it hits hard.  There are many moments that had me busting up laughing and for those moments I recommend checking it out.  B"
    },
    {
      "rating": "7",
      "text": "I thoroughly enjoyed Bad Moms... no really. I was raised in a single parent home and it really resonated with me, well to a point. Not the most fleshed out script but this film was fun to watch."
    },
    {
      "rating": "2",
      "text": "Kunis leads a clan of underappreciated and badly behaved moms in a boorish brouhaha spoof of modern day motherhood. Unfortunately the ending credits had more humor and heart than the film did."
    },
    {
      "rating": "2",
      "text": "I haven't heard language like this, since my days in the Army, and\rI really didn't appreciate it coming from women.\rThe word, raunchy, seems to come to fore quite often, in reviews.\rI wish I could think of another word, as that really is a weak adjective, as\rIt was much, \"worster!\""
    },
    {
      "rating": "0",
      "text": "I walked out of this one after listening to about 30 minutes of gratuitous obscenities mixed with bad jokes. I guess I'll never understand why screenwriters think that's such an appealing combo. Perhaps they think it authentic or earthy or edgy. Beats me."
    },
    {
      "rating": "0",
      "text": "Sloppy, vulgar and dumbed down. Characters were cartoon stereotypes and just not funny - as much as I really wanted to like it - I didn't. This story hates men, has a scene that mocks natural in-tact men (uncircumcised) in a stupid show-n-tell demo like written by 7th graders. The dialogue works to be crude beyond belief and have shallow characters who only seem to want to be drunk and acting like loons out on a mental ward pass. Just as bad are of the \"mean Queen-Bee\" characters who are a way less clever version on the 90's teen movie Clueless' trio and surely not to be memorable in any way. For all the slang that was cute in that cult movie, I'm sure nobody is going to be saying things like \"get your t*ts up\" and other vulgarities that  don't empower the characters but just make them sound dumb and trashy."
    },
    {
      "rating": "2",
      "text": "Were all the cast and crew obviously being paid to do this? I feel like they did. Messily made (especially from a cast I would never imagine they would do their best) and sloppily done, Bad Moms represents a comedy that indeed show that 'The Hangover' writers can't make anything hilariously funny anymore."
    },
    {
      "rating": "1",
      "text": "This movie is feminist propaganda, as it is becoming the norm in Hollywood.\rAs another review commented, the flick's only achievement is to have passed the feminist Bechdel test.\r If you enjoy seeing men portrayed as vile creatures (and women as elegant, intelligent, funny and good hearted), go ahead and watch this, you will not be disappointed."
    },
    {
      "rating": "1",
      "text": "This movie is pure misandry.\rThe only \"merit\" of it, is passing with flying colors Hollywood's feminazi Bechdel test.\rhttps://en.wikipedia.org/wiki/Bechdel_test\rIf you hate men, or you are ashamed of being a man, this is your flick!"
    },
    {
      "rating": "5",
      "text": "What a cliché of a movie. Nothing is surprising, it's trope after trope you've seen countless times if you're over 30. And girls, if misogyny is so wrong then misandry is not ok. Mila Kunis - aka \"Meg\" from \"The Family Guy\" - just doesn't have the \"presence\" to pull off this role. She's a petite, cute little thing best suited for rom-coms, not \"Mean Girls 2: The PTA\". Everything is so over-exaggerated and simultaneously over-simplified, ugh. The main characters are all sterotyped caricatures. I'd bet that these guys went from idea to screenplay in one hour, seriously. Clearly, this is an unrealistic, fantasy film for chicks with kids so it is what it is, but it's sooo one-and-done."
    },
    {
      "rating": "7",
      "text": "I am not sure why people complain about \"misandry\" in the film...thats part of the joke.  Like...guys being dumb is turning the old trope of \"girls being dumb\" in films on its head...thus, the joke.  The movie was nothing amazing script wise, but it had enough funny moments and various types of jokes to be fresh and overall fairly funny, with a decent enough story and a lot of likable leads.   Nothing revolutionary here, but slightly different, and funny enough."
    },
    {
      "rating": "8",
      "text": "There's plenty of humor ranging from raunchy to creative for the first 2/3. A cliche ending that's unsatisfying doesn't damper the belly laughs I had before it."
    },
    {
      "rating": "9",
      "text": "Yea in no way am i the target for this one however it made no diffrence it was tons of fun i may be a single guy who by going to see this was just trying to exscape life for a bit but it really did the trick it made me laugh smile and any other type of happy emotion you can think of its not for everyone but i thurly enjoyed it i may not be a parent but i have seen both mothers and fathers like the villans in the movie and pay back is oh so sweet i say average moms and dads take a stand and see this movie )warning constant swearing sex jokes and even a full  frontal female nude scene) but aside from that its a wonderful movie i would say take anyone older than 15 yea older teens may get a smile from the humor as well just see it man or woman u will love it"
    },
    {
      "rating": "8",
      "text": "Uproariously funny, this is fast paced film with a fantastic script and excellent performances by the brilliant ensemble cast. Whilst it relies heavily on caricature for some predictable laughs, there's also a great deal of unique and insightful material that elevates this above what would otherwise have been a formulaic film. This was a fun, entertaining film. 8.46/10"
    },
    {
      "rating": "9",
      "text": "Bad Moms is a great comedy. One of the best that out of the ones that came out the last couple of years.It's funny and action packed. We had a real blast watching and I dare say I would happily watch it again. Very very solid comedy with lots of absurd and silly moments that don't let you stop laughing all the way through the whole movie. I recommend you watch it with your wife but if you are a single guy it will not let you stop laughing. So funny."
    },
    {
      "rating": "7",
      "text": "Pretty funny flick about moms who act more like raunchy guys.  I was surprised at the actors in this, Kristin Bell, Christina Applegate, Jada Pinkett Smith, they must be pals in real life and make films together.  An interesting \"don't miss\" at the end during the credits, the stars talk with their own moms about raising kids."
    },
    {
      "rating": "7",
      "text": "It was a funny movie it just wasn't bad enough to live up to the trailers and the movie title. It is light hearted and it was a decent movie, I just think it you are going to be bad, be very very bad."
    },
    {
      "rating": "10",
      "text": "Excellent comedy about helicopter parents, surprisingly good since I didn't think that was the case at first.  Some real belly laughs in the 1st half hour, but then typical to Hollywood, the laughs fade off as it becomes more dramedy as the themes of parenting are so serious and it's hard these days to have kids.  The two extremes are visited, the helicopter abusive Nazi Applegate figure contrasts with the laissez faire make your own breakfast and I'm totally ignoring you parent .  Of course, these 2 extremes don't either work is the point, both extremes are just BAD and you need \"moderation\" to be the GOOD parent, as in all of life."
    },
    {
      "rating": "7",
      "text": "It wasn't an awesome movie but it was a really good comedy with a good attitude...By the way the crew did their best and the gold sentence of the movie - We are all bad moms! - was actually a good one cause we all somehow believe in it and get what it says!"
    },
    {
      "rating": "7",
      "text": "Öncelikle müzikleriyle giriş yapıp ardından film hakkında biraz konuşmayı düşünüyorum. Tam zamanlamasıyla girilen şarkılar ve şarkıların güzelliği gerçekten çok iyiydi. Olması gerektiği yerde, şarkılar o hissi veriyordu. Mila Kunis yine mükemmel bir oyunculuk ortaya koymuş. Senaryosu, böyle bir filme göre güzeldi. Senaryonun da pek önemi yok zaten amaç tamamen eğlence ve bu film kesinlikle eğlendiriyor! Kathryn Hahn, filmde en beğendiğim oyuncuydu. Alışılmışın dışında bir karakterle filme katkı sağlamış ve ortaya çok güzel bir iş çıkarmış. Kristen Bell ise ezik bir karakterden baskın bir karaktere geçiş hikayesini izliyoruz ve bu da gayet güzel anlatılıyor. Üç iyi oyuncuyla birlikte, kesinlikle eğlencenin dibine vuruyorsunuz. 1 saat 40 dakikalık süresi ile sıkmadan kendini izletiyor ve müzikleriyle birlikte sizi filmin içine sokuyor. Mutsuz ve canınız sıkılıyorsa, bu filmi açın çünkü filmde mutsuzluktan, eğlenceye doğru gidiyor."
    },
    {
      "rating": "4",
      "text": "Mostly bad, unfunny and formulaic way past a fault. The cast really deserved better. The worst things any of the moms do is drink at night and not cook breakfast every morning.I mean I get it, but this movie's comedy is based on the bad behavior on display and in that case it doesn't really deliver (nothing even remotely close to Hangover level stuff here)."
    },
    {
      "rating": "5",
      "text": "\"Kent and I have sex every Friday night after Blue Bloods. I find Tom Selleck's work to be very erotic.\"-Kristen Bell as KikiPart comedy, part ode to mothers, Bad Moms is an often funny comedy that boasts a cast of characters with great chemistry with one another, but has an incredibly weak plot. With cliches left and right, Bad Moms is a typical unsuspecting hero rises to the top against all odds against a evil villain who is not actually that evil story. I explained it poorly, but if you watch enough movies (at least more than 10 in your life), you are well accustomed to this storyline. This element certainly holds the film back and though the film's plot and jokes are very typical for a modern comedy, its characters have enough charisma and venom to make them stick the landing.Led by Mila Kunis, who stars as \"bad mom\" Amy Mitchell, this cast has some seriously comedic chops amongst them. Joining Kunis are Kathryn Hahn as slutty mom Carla and Kristen Bell as weird mom Kiki and together, the three kill every scene they are in. With raunchy humor coming from every direction, the joke repertoire is pretty limited. Yet, these ladies make it work for them. However, the best part here is actually the characters. Overworked, overstressed, and suffering from a cheating husband, Kunis' Amy Mitchell tries her best, but it is never enough for her kids or anyone in her life. Here, Bad Moms truly celebrates this hero. Though often overlooked, this mom who may not be the best, but tries her hardest and does a good job deserves recognition and this film is willing to give it to her. This is largely the film's greatest accomplishment. Otherwise, Carla is just slutty and Kiki is just weird. They lament about the men in their lives and, to be fair, the men in their lives suck. However, the trio is united in their love of their children, no matter how bratty and rude they can be to them, which is a real testament to moms as a whole. Unabashedly a chick flick, Bad Moms feels the need to borrow from past chick flicks with useless men, guys who the women fawn over, and of course, having its own personal \"mean girls\". The first two elements are whatever. It is a chick flick after all. However, Mean Girls already handled the topic of the \"queen bee\" and her little minions. Here, Bad Moms introduces its queen **** as Gwendolyn James (Christina Applegate) and her two lackees Stacy (Jada Pinkett Smith) and Vicky (Annie Mumolo). Vicky is hysterical with her aloof nature and willingness to just go against the tide to do whatever her scatter brain desires. However, Gwendolyn and Stacy are so typical, it is a shame. The plot is cliche, but make no mistake, so are the characters here. Together, they combine for a sea of cliches that hit with greater and greater intensity throughout.In complaining, however, I do not want this point to be lost: Bad Moms is not that bad. A cliche and modern comedy in all the worst ways at times, Bad Moms can also be hysterical. With a light and fun atmosphere and a lighting quick pace, Bad Moms evades being killed by its negative qualities and instead delivers a quality summer comedy that is nothing but disposable entertainment. Though not a woman or a mother, I can safely guess that Bad Moms would be the perfect idea for a get together of middle aged women. It is raunchy, yes, but it does have a story that will resonate with that demographic and it certainly celebrates these women who selflessly dedicate themselves to those who do not the same for them. This makes for an appealing chick flick for that demographic and it will likely be celebrated a such. For guys, it is a pretty funny movie and you can do far worse when it comes to clear chick flicks. At the very worst, Mila Kunis, Kathryn Hahn, and Kristen Bell, are incredibly funny here and deliver quite good performances that do often rise above the material."
    },
    {
      "rating": "6",
      "text": "Moms don't quit! Quitting's for dads!\r It was more like a middle aged women's version of 'How to be Single'. So most of the younger audience won't get it, as well as the older people, because of the generation gap. I enjoyed it, but you know this is nothing close to any classic on the similar theme, just a decent entertainer though. From the director of '21 & Over', about the three moms whose children are in the high school, but it depicts those moms struggles over maintain the order in their professional and personal life.\r Mila Kunis' character is the centre of the story, but I liked Kristen Bell and Kathryn Hahn as well. Basically, these three ruled the narration. Some of the comedies were good, though there are too much of sexual references in that. Not good as 'How to be Single', but definitely better than both the 'Bad Neighbours' films.\r It got a mixed response, but a box office hit. Most of the story is predictable, though decently developed all the scenes by keeping them simple. I mean cliché wise, but at some parts it gets loud and out of control. So make sure you are not watching for any inspiration, but the middle aged people feel more familiar with this than anybody else. Therefore, I think they're the target audience, and mostly the women.\r 6/10"
    },
    {
      "rating": "0",
      "text": "This is one of the most retarded films imaginable! An attempt to be funny with lots of subliminal messages thrown in to condition/brainwash people according to the status quo and social norms practiced by the cult and collective of moral relativists. Retardation galore! Watching it would turn the morons into even bigger morons if that is even possible! No wonder people or should I say sheeple who lap up the ideologies presented and regurgitate it (see it everyday) are this stupid and ignorant. Clever brainwashing at its best! Yup people lap this rubbish up!"
    },
    {
      "rating": "6",
      "text": "A by the numbers comedy about moms who've had enough of too much work not enough thanks. I got a couple of laughs out of it but most of the humor is rooted to much in reality and is (sadly) too relevant to be as funny as at should be. In all honestly I kinda liked it but wanted it to be a bit filthier. Well cast too."
    },
    {
      "rating": "1",
      "text": "Even the 'Good Place' has recovered enough sensibility to recognize that bad behavior can go only so far to attract audiences and jokes. This film has not. Vulgar, sexist, and with a script written by 12 years olds, this film is perfect for the misogynist in your social group. For the rest of us, I rate this film 'thumbs down' for stupidity."
    },
    {
      "rating": "0",
      "text": "Just a terrible movie. Plays up how hard it is to be a mom. Just a girl wank movie where every girl is extremely competent and perfect and every boy is an idiot . Sexist trash movie"
    },
    {
      "rating": "6",
      "text": "Enjoyable film. The movie has a terrific cast, and is incredibly funny. Especially Kathryn Hahn with her loud bursts of comedy. The directors didn't hit it out of the ballpark like Hangover 1 but they still did a verygood job."
    },
    {
      "rating": "0",
      "text": "This is unwatchable. The plot has so many holes that make me scratch my head: How can a movie writer even start to conceptualize this ***fest!?The plot: a mom who works as a secretary even though her husband made so much dough that HE apparently doesn't have to work, they live in (you guessed it) the safest suburb in all of america and deal with 0 of the social issues which over 70% of the country has to deal with. Instead, she deals with the most basic chores as they've exaggerated them immensely so that the audience sides with her when she decides to stop doing all of them for no good reason. biggest red flag from this movie was the single mom portrayed as a FLAT character who's trashy attitude is considered excusable.This is the issue with this movie: nothing is grounded. 0 characters actually make sense or are reasonable. Due to this aspect, none of the movie is actually funny. It's basically an excuse so that any mom that is emotionally driven can say \"YEah! THat's RIght! THis is HOw I FEel TOo!!!!1!\".Here are two of the biggest character offenses in this movie:Character A) \"the protagonist\"The protagonist mom is portrayed as the hero of this movie. Not some tragic hero that has a broken past and tries to better herself, no. She's played as an ENTITLED hero from her broken past in which she's allowed to do whatever she wants and consequences which are caused by this attitude are supposed to be forgiven by the audience (as shown at the end of the movie, when she cries about the fact that the kids went with the dad for the divorce because the kids were scared of the fact that she literally had a drunken party the other day.... no joke that's how **ty the plot is). We're supposed to feel sorry for her during the whole movie and it kind of makes me sick. This isn't like a Bad Santa movie, where the degenerate character is lead by some ***ed up circumstances which weren't in the control of said character, causing them to act like a looney. This is a character which is shown as a \"good parent\" (they portrayed this super badly in the movie) in which the parent IS ALWAYS at a loss in her SELFLESS (not really) acts, which she then decides to postpone these acts for no particular reason other than insecurity. And I'm supposed to feel bad for this person? I'm supposed to forgive her actions because she committed them out of insecurity? The ending of the story simply justifies her actions instead of showing an actual ethical moral resolve.... which will surely make the audience cringe.Character B) The \"dad\"The dad is shown as (one of) the antagonist of this story. His character is flat and his whole backstory is narrated just like every other character in this movie (this is a movie sin btw). The dad is said to act like a child for some reason, reason being that he's rich enough to do this....? This is the biggest plot hole in this movie. The couple met during college and the dad became ultra successful off of a contract deal (I believe in the business of property if I'm not mistaken) and he has enough money to buy a house, buy himself a classic car (which at the time of the movie's released would've been a 50-100K classic just from looking at the paintjob and detailed interior), and he decides to basically retire? From my interpretation of the movie, a man of this calibre is either going to retire early on due to him being RICH ENOUGH TO NOT NEED A DIME THE REST OF HIS LIFE or somehow he suffered some sort of block (either physical or mental) from his work, causing him to not want to work. So either the family is well off and the mom doesn't ever need to work OR the family isn't well off and the mom should tell the dad to work. Since in the movie, it was never mentioned that the dad should work, I'm sad to say that seems as though the mom busts her ass for no reason, intensifying the fact that she's the worst tragic hero I've ever ***ing seen! All in all, this was the worst portrayed character since he didn't seem to have a reason to act like a child and it seems as though the writers wrote him as ass clown."
    },
    {
      "rating": "5",
      "text": "Bad Moms falls short of ever being laugh-out-loud hilarious, instead relying on the rebellious tale of a group friendship that develops from the acceptance of personal parental flaws. The cast have great chemistry but the story isn't memorable."
    },
    {
      "rating": "6",
      "text": "Bad Moms is the type of film that you roll your eyes at but after you watch it you’re surprised at how good it actually is. The film is a thoroughly enjoyable, a few good laughs and good direction. I loved all the times the film would go into slow motion (Especially the Grocery Store) The film isn’t perfect; at times it feels like you’ve seen this plot before, but you go with it anyways. Unfortunately, they are already planning a sequel and spin off (Bad Dads), totally unnecessary, but typical Hollywood lets go for the money grab (Neighbours 2) Sometimes a simple concept should stay contained in one film, go make something else original, not double and triple dipping in the well (Hangover series)"
    },
    {
      "rating": "4",
      "text": "oh hey, i know you..Bad MomsJon and Scott offers very less to look forward to except for some out-of-context amusing conversations, but beyond that it has the same old ingredients."
    }
  ]
}