{
  "id": 3377,
  "title": "Bad Santa",
  "starring": [
    "Billy Bob Thornton",
    "Tony Cox"
  ],
  "runtime": 92,
  "genre": [
    "Drama",
    "Comedy",
    "Crime"
  ],
  "description": "A miserable conman and his partner pose as Santa and his Little Helper to rob department stores on Christmas Eve. But they run into problems when the conman befriends a troubled kid.",
  "releaseYear": "2003",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/rfClLIyeHqpMofmrPY8DaLe4z9x.jpg",
  "categories": {
    "plot": 4.75,
    "acting": 6.0,
    "ending": 8.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 7.368421052631579,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "10",
      "text": "Dark but hilarious.  Billy Bob at his finest.  And please don't even get me started on Thurman Murman!  They are one of my favorite comedy duos of the century."
    },
    {
      "rating": "10",
      "text": "Another one of my favorite comedies of all time!  It's hilarious, smart, and quite exciting!  If you love comedy, you will surely love Bad Santa!  It's a huge recommend!"
    },
    {
      "rating": "10",
      "text": "Literally one of the funniest things I've ever seen in my life... Billy Bob, Tony Cox & the late greats, John Ritter & Bernie Mac was hilariously outstanding."
    },
    {
      "rating": "7",
      "text": "Funny. Really funny and sweet. Several words can be used to describe Bad Santa, but only \"Good\" actually stands out. Because it was good. Good enough for me to hope for a sequel."
    },
    {
      "rating": "10",
      "text": "Best film as i ever seen"
    },
    {
      "rating": "9",
      "text": "Along with Home Alone that's my favorite Christmas movie. But beware cause this an utterly politically incorrect black comedy.\rBilly Bob Thornton is absolutely brilliant as Bad Santa and even got a Golden Globe Nomination for his performance. Even winning an Oscar wouldn't have been a surprise. The story goes as follows: \"A miserable conman and his dwarf partner pose as Santa and his Little Helper to rob department stores on Christmas Eve. But they run into problems when the conman befriends a troubled kid.\" Wtf, even the fat blond kid plays perfectly! The movie manages to succesfully combine drama, comedy and crime and is hilarious without being ridiculous. At the same it's serious without being depressive. Nevertheless it isn't suggested for little kids and for those who can't stomach a sometimes rude and offensive black comedy."
    },
    {
      "rating": "10",
      "text": "Easily one of the best comedies ever made. It's not just the hilarious script and premise that make it stand out, but it has a lot of heart too. For me it's a feel good film and every time I watch it I come away slightly choked up, in a good way. Amazing performances all around, just pure perfection really. I wish Zwigoff would hurry up and make a new film."
    },
    {
      "rating": "0",
      "text": "It seems like whoever wrote and directed this movie wasnt even going for a comedy. The whole idea was to make it as disguisting as possible. every scene was a dull moment designed to make the viewer uncomfortable. the movie mostly just depressed me and my companion."
    },
    {
      "rating": "1",
      "text": "I'd heard this was a really pretty good dark comedy and I like Billy Bob, so I gambled on the rental and the time involved to take a look. Whoever said it was pretty good (some critics actually thought it was really good!) should have their critic license revolked ,or at least suspended. This thing is mean spirited (I Iknow, that's the point) but in a very unfunny, pointless way that delivers absolutely nothing but swearing and depressing characters that no one could possibly care about, much less like. There is not one funny line in the entire film. Even the sex scenes are vile. (Like BBT's character could actually have sex with anyone) The worst-bad on so many levels its impossible to describe."
    },
    {
      "rating": "8",
      "text": "While it may not be interesting to some people, Bad Santa is a funny comedy that will keep you laughing from start to finish. It can be rather vulger at times but hey, Its still hilarious."
    },
    {
      "rating": "8",
      "text": "Ah classic! Just the movie I need when the super crazy commercial nature of Chrismas starts driving me up a wall. When I just can't stand to year an 800 horrifyingly awful version of Frosty the snowman, this is where I turn for relief. Hysterical, and yet meaningful cause in the end it points out how Christmas should be rather than how it is often treated."
    },
    {
      "rating": "8",
      "text": "This film had me spitting out my drink. The timing of the actors was so on cue I'm amazed this movie gets so few awards. Billy Bob Thornton and Tony Cox are both the funniest and ridiculous duo that I can name off the top of my head. The kid and the bartender had me in stitches. Bernie Mac and John Ritter also gave funny performances. So sad to see them both go, so young. 'Bad Santa' maybe too vulgar for some, but dark comedies are an art form; to take a serious topic, and generate laughs from it takes skill and quality. It shows itself here, if you can get past the language and hedonism."
    },
    {
      "rating": "8",
      "text": "A treatment of comedy treated like it actually works. Everyone's subjected to their own opinions, but I can't handle these 0's here. They belong somewhere else."
    },
    {
      "rating": "8",
      "text": "What would the Grinch be like if he were human? He would be a failed alcoholic, smoking and shoplifting with the help of a buddy. Comedy of acid humor that combines hatred and love towards Christmas. To see at these parties, but you got warned that it is not family humor."
    },
    {
      "rating": "8",
      "text": "I had been keen to see this for a while, I guess a part of me liked the idea of an antidote to the overly saccharine, sugary sweet sentimental family Christmas movies where everyone is perfect and whatever else, bah humbug to that, its so unrealistic and anyway its got to be somewhat of a novelty to see (or more, hear) a santa that swears like a trooper, right? ok so perhaps that shows a bad light on me for thinking that way but I admit it, I was somewhat interested to watch this movie knowing thats what it'd be like or would feature... a swearing santa, who'd have thought it?!The movie is ok, although it will be a bit too dark for some im sure and of course this isn't at all for children, even though it does feature one fairly young kid in particular, I certainly wouldn't recommend it be shown to anyone under the age of about 16 or 17 at least. It was somewhat amusing but I think its too much of a one joke movie really, im certainly glad it didn't last considerably longer. I felt quite sad for the young boy, seeing him getting bullied by the local teenagers and clearly not seeing 'Santa' for who he really is. The boy follows Willie around most of the time because he's clearly shy and lonely and so he wants to be protected by this low life drunk that he somehow believes will protect him and give him what he wants at Christmas.As I say, this is clearly quite a dark movie and it does have a couple of scenes that are quite funny, one being where Willie comes home with his then girlfriend to find the boys grandmother looking frighteningly stiff and still sitting on the couch. I guess its nice to know that they cared enough to check whether or not she had expired at that point!Its perhaps worth mentioning that Bernie Mac stars in this movie, he makes a nice addition to the cast as the rather suspicious store manager Gin, who Willie and Marcus try to get rid of. Although really the main star of this movie, character and performance-wise, as far as im concerned, is the young boy (he's unnamed in the movie) played by Brett Kelly.For those who are aware of the movie drillbit taylor (which I've also reviewed, earlier this year), this actor and the movie in some parts/scenes reminded me quite alot of that movie, which is maybe a bit random but its my review so im adding it in, so there you go lol.I think its ok as, like I say, an antidote to your overly saccharine sweet sentimental family Christmas movie, if you think of it as a mildly amusing novelty movie for adults where you get to see the previously unheard of - a potty mouthed Santa whos a drunk and doesn't have any interest in kids.The ending is kind of funny, though you may feel kind of cheated by the outcome too but its hard to explain it without giving too much away.If your a fan of dark movies and you like something a bit different, if your the 'bah humbug' type this time of year and you think the concept/story would amuse you, then I'd recommend it I guess but its hardly a masterpiece movie by any real standards.I thought it was just worth watching the once and I certainly wouldn't say its worth buying the DVD outright, not if it costs more than a few quid certainly but its diverting enough to watch once for an hour and a half or so, if you know what to expect."
    },
    {
      "rating": "10",
      "text": "$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.》■》■》■》■》■》■》■》■》■》■》■》■》■》■》■》■"
    },
    {
      "rating": "8",
      "text": "Very funny film and policitally incorrect film. What is so surreal about it is that the film ends with a sense of good will, without it being a tacky happy ending. It's hard to describe, but at the end of this offensive movie, i felt strangely uplifted."
    },
    {
      "rating": "8",
      "text": "Billy Bob Thorton is absolutely hilarious and serves up a Christmas festival with vular language and an uproarious Black midget."
    },
    {
      "rating": "10",
      "text": "This movie is f..kin hilarious! Definitely on my top 10 list of all time! Not one minute without a profanity. There's gonna be a lot of pissed parents that brought little Johnny thinking it was the perfect family movie."
    },
    {
      "rating": "10",
      "text": "This movie is awesome!!!!"
    },
    {
      "rating": "5",
      "text": "We get it. Billy Bob Thorton is a foul-mouthed, drunken criminal- but wait- this kid thinks he's the real Santa Claus. It's been done before- and the joke gets old fast."
    },
    {
      "rating": "7",
      "text": "Bad Santa is a holiday treat. With all the feel-good sentimental flicks out there, this movie is a refreshing counterpart to those movies, with its foul-mouthed, alcoholic protagonist and his also foul-mouthed, temperamental little elf. The movie is better than you think, and laugh out loud funny."
    },
    {
      "rating": "6",
      "text": "Bad Santa. Get drunk and fall under the tree. A funny, but no more black comedy about not the best Santa. Billy Bob Thornton did an excellent job of this role. Otherwise, there is nothing interesting in the film."
    },
    {
      "rating": "10",
      "text": "vugguguihihihihjgfyfyknyfrstsguihohihfyyffyigihhiihihihi,,,,,,,,,,...........,,,,,,,,,,.......,,,:::::::::......"
    },
    {
      "rating": "10",
      "text": "\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"%%%%%%%%%%%%%%\"\"\"\"\"\"\"\"\"\"&&&&&&&&&&&&&&&&&&&&&&&&@@@@@@@@●●●●●●●●●●●●●●●"
    },
    {
      "rating": "9",
      "text": "●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_"
    },
    {
      "rating": "10",
      "text": "♤♡♤♡♤♡♤♡♤♡♤♡♡♡♤♡♡♡♡♡♤♤♤♤♤♤♡♡♡♡♤♤♤♡♡¿¡¿¡》¿¡¿¡》¡¿¡¿》¡¿¡¿》¡¿¡¿》¿¡¿¡》¡¿¡¿》¿¡¿¡》¡¿¡¿》¿¡¿¡》"
    }
  ]
}