{
  "id": 312,
  "title": "Bad Trip",
  "starring": [
    "Eric André",
    "Lil Rel Howery"
  ],
  "runtime": 87,
  "genre": [
    "Comedy"
  ],
  "description": "Two pals embark on a road trip full of funny pranks that pull real people into mayhem.",
  "releaseYear": "2021",
  "mpaaRating": "NR",
  "imageUrl": "https://image.tmdb.org/t/p/w500/A1Gy5HX3DKGaNW1Ay30NTIVJqJ6.jpg",
  "categories": {
    "plot": 7.666666666666667,
    "acting": 6.714285714285714,
    "ending": 5.0,
    "soundtrack": 5.0,
    "cinematography": 7.8,
    "familyFriendly": 4.0,
    "funny": 7.470588235294118,
    "action": 7.0
  },
  "reviews": [
    {
      "rating": "7",
      "text": "Following in the footsteps of \"Bad Grandpa\" before it, \"Bad Trip\" blurs the line between hidden camera comedy and the traditional road trip romp. With Eric Andre's absurdist comedic stylings added on top, however, you're ultimately given an even more madcap and wheeze-inducing experience. I've said it before and I'll say it again -- there is something to be said about Eric Andre's commitment to a bit. All those years of filming pranks for \"The Eric Andre Show\" has put nothing but ice in his veins. His ability not to break during a bit and to improv on-the-fly is always something I'll get a kick out of watching. Lil Rel Howery and Tiffany Haddish (whose scripted comedy roles can sometimes be hit-or-miss for me) are welcomed additions to the fun as well. A real surprise, this one."
    },
    {
      "rating": "7",
      "text": "Not as bad as I thought wasn't expecting much going into this one but it actually provided some good laughs. Not as good as Borat IMO but still enjoyed it quite a bit. Haven't watched much of Eric Andres stuff but will defienatly have too give his stuff a watch now."
    },
    {
      "rating": "7",
      "text": "Hey, Streamers, we're back in action. Spring is coming and it's time for a good ole road trip. Bad Trip, that is. Yes, we could've reviewed Zac Snyder's Justice League but really that's a quick review. It was better than the first but extra long, somewhat entertaining and sets up a cooler universe than Whedon's but realistically both were big box films for entertainment value. Ok, done with that. Back to Bad Trip.Bad Trip, which was going to release in theaters last year but was delayed, was released this past weekend on Netflix. The movie is described as a mix of a buddy road trip comedy and an unscripted hidden camera prank show. Viewers follow the ridiculous calamities of two best friends, Lil Rel and Eric Andre, who are stuck in a rut and venture on a road trip to NYC. The storyline sets up shocking real pranks and other hijinks.The easiest way to explain this is as the black version of Borat with a mix of \"Impractical Jokers.\" Pretty much once you say that you know how this is going to go. Lil Rel, Tiffany Haddish, and Eric Andre all do their best in these pranks or voyeur comedy. The problem becomes some of the scenes fall hella short. Something just doesn't feel right at times. Some skits may crack you up, but other skits seems like they should be funny and then 5 minutes go by and you're thinking... that didn't hit like I expected. In that way, Borat is more successful than Bad Trip. Where I do think this movie succeeds is that the storyline is way more relatable than something like Borat. In a way, it makes it more fun and funnier to watch. Yes, it's ridiculous, but it's not on the Borat extreme. In a way, I can relate to it much more or can at least put myself in their shoes, which makes it overall more successful. The scenes struggle a bit a times when everyone knows what Tiffany Haddish looks like but her scenes are still solid.Needless to say, Bad Trip would not be worth watching in the movie theater but streaming... Go ahead and get your laugh on. This is a potheads delight. Enjoy a big bowl of popcorn watching some silly pranks."
    },
    {
      "rating": "9",
      "text": "Imagine being so stuck up that you feel the need to give this movie a 1/10.If you don't like Eric Andre, then don't watch Bad trip and expect something else.This movie managed to crack me and my friends up multiple times during it's runtime, and i recommend everyone that enjuyed Borat and Bad Grandpa to go watch it."
    },
    {
      "rating": "7",
      "text": "I wasn't a fan of Eric Andre in the past, but I decided to give this a shot during a stoned Netflix stupor. I was pleasantly surprised. 'Bad Trip' falls in the same boat as Borat and Jackass (especially Borat), nailing a lot of the same beats: let's do some wild **** in public and play off the candid responses from the onlookers. In that sense, you've seen this sort of movie before. Maybe a few times. However, the chemistry between Andre and Lil Rey Howery is so damn natural that it elevates the material to cult status. There's quite a few laugh out loud moments, and Andre is incredibly likable as this everyman character who just wants to find love, but can't help accidentally destroying everything in his path to do it. Literally.There's also a strange sense of...dare I say...solidarity? And the good of people? We see a number of people show genuine concern and compassion for Andre's nutty ass, rather than simply writing him off as bat**** (although there's plenty of that, too).Honestly, I wish it were longer, with maybe a few more gags. That being said, I had a great time with it. It brightened up my day."
    },
    {
      "rating": "10",
      "text": "After the boring and mostly unfunny Borat 2 I almost lost hope in the hidden camera type shock movies. This movie brought me back. It is so funny and has a solid enough story to keep the movie flowing. It's not going to be a movie for everyone but if you are a fan of Jackass and shock comedy you will love this move its my favorite movie so far this year so definitely check it out."
    },
    {
      "rating": "10",
      "text": "Movie is extremely funny and made me crack up numerous times.  A great watch, especially if you're into \"prank\" movies."
    },
    {
      "rating": "10",
      "text": "**** the haters. Parents just don't understand, man. Near-perfect. Funny as hell but also surprisingly life affirming and, dare I say it, UPLIFTING. Watching this made me feel better about the human race than anything that has happened in this last year from hell."
    },
    {
      "rating": "10",
      "text": "Hilarious!  If you like Tom Green, Sasha, and the likes, then you'll love this.  It had me bursting out with laughter.  It was a little gross at times, but effective."
    },
    {
      "rating": "9",
      "text": "The blend of hidden camera setups with a plot throughline has been done before (Bad Grandpa and the Borat films). This one is at the top of the game with a string of outrageous encounters set among real people. Eric André and LilRel Howery embark on a trip to NYC in a stolen car, while being pursued by the car’s angry owner (Tiffany Haddish in a raucous turn as a bad ass). Their misadventures involve some truly hilarious situations, but the difference is that this trio of actors are the butt of the jokes, while the bystanders provide funny disbelief reactions. The over-the-top inventiveness of the setups and the assured comic gifts of the actors make this adventure funny as hell! NOTE: The credits feature reactions from people when they find out they’ve been punked."
    },
    {
      "rating": "0",
      "text": "Horrible horrible horrible. Full of buffoonery and ignorance. Nothing remotely humorous about this movie"
    },
    {
      "rating": "3",
      "text": "Their “boldest” lines are obviously dubbed. Cant make a good movie without risk. I would never watch a movie where the actors are too afraid to say the actual lines in public and have to result to adding them in in post."
    },
    {
      "rating": "6",
      "text": "admirable[ ad-mer-uh-buhl ]adjectiveworthy of admiration; inspiring approval, reverence, or affection."
    },
    {
      "rating": "3",
      "text": "Johnny Knoxville did it a whole lot better, a long time ago. Did people forget about it?"
    },
    {
      "rating": "7",
      "text": "This is a very entertaining movie, you'll never be wrong, if you let Eric Andre perform his pranks. They're extreme, but ultimately harmless and seeing different people react to different, extreme situations is just very interesting.With all that said I still prefer his regular show and his standup comedy, but with this movie it was very interesting to see Eric Andre handling such a comparatively grand project."
    },
    {
      "rating": "5",
      "text": "Tiene momentos muy divertidos, pero la trama es muy genérica; la recomiendo si te gusta mucho el humor absurdo."
    },
    {
      "rating": "6",
      "text": "----------------------------------5.7/10-----------------------------------"
    },
    {
      "rating": "6",
      "text": "Bad Trip is a good time that is made even better by the fact that, outside of the central characters, all of the reactions are genuine because of the hidden camera style. A few of the pranks were really disgusting and hard to watch, and this isn't a movie that will evoke any sort of emotion in you. The scenes that had only the main characters were also pretty underwhelming and definitely the weakest part of the movie. The best part was seeing the crowd reactions, so I wish they wouldn't have strayed away from that so often. However, even with these flaws, it is quite funny and worth a viewing if you've got 90 minutes to burn."
    },
    {
      "rating": "10",
      "text": "PLEASE WATCH THIS MOVIEthis has gotta be the best film I've ever watched, so funny to the point where I could not breath"
    }
  ]
}