{
  "id": 2099,
  "title": "Bad Boys II",
  "starring": [
    "Will Smith",
    "Martin Lawrence"
  ],
  "runtime": 147,
  "genre": [
    "Adventure",
    "Action",
    "Comedy",
    "Thriller",
    "Crime"
  ],
  "description": "Out-of-control, trash-talking buddy cops Marcus Burnett and Mike Lowrey of the Miami Narcotics Task Force reunite, and bullets fly, cars crash and laughs explode as they pursue a whacked-out drug lord from the streets of Miami to the barrios of Cuba. But the real fireworks result when Marcus discovers that playboy Mike is secretly romancing Marcus’ sexy sister.",
  "releaseYear": "2003",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/yCvB5fG5aEPqa1St7ihY6KEAsHD.jpg",
  "categories": {
    "plot": 6.583333333333333,
    "acting": 5.857142857142857,
    "ending": 5.0,
    "soundtrack": 7.0,
    "cinematography": 6.8,
    "familyFriendly": 3.0,
    "funny": 6.294117647058823,
    "action": 6.5625
  },
  "reviews": [
    {
      "rating": "2",
      "text": "Will Smith is good. Martin Lawrence is mehh. The first one was bad enough, and this was like that but with more/worse action scenes and a frustrating story. I didn't like."
    },
    {
      "rating": "2",
      "text": "Dime a dozen, action-packed refuse."
    },
    {
      "rating": "0",
      "text": "This could be the worst film Michael Bay ever made. What does THAT tell you?"
    },
    {
      "rating": "5",
      "text": "Energetic and action-packed but exhausting and less smooth than the first film, \"Bad Boys II\" is an inferior if still entertaining sequel to \"Bad Boys\"."
    },
    {
      "rating": "0",
      "text": "Yuck, this movie was totally overrated. It was awful and horrible film. Bad plot, boring, disgusting, better dont watch this."
    },
    {
      "rating": "5",
      "text": "Despite all the cool buddy cop (slow-mo) action Michael Bay throws in, a Hollywood movie is a Hollywood movie. \"Bad Boys 2\" is a prime example of what a real time-consuming movie should be. No more, no less."
    },
    {
      "rating": "5",
      "text": "A film too long he wants to show. The jokes are ok but a little exaggerated action sequences    ."
    },
    {
      "rating": "7",
      "text": "However masterful, the first-rate stunt work, effects, action cinematography and cutting (by no less than three editors) lose impact through sheer repetition."
    },
    {
      "rating": "8",
      "text": "Bad Boys, Bad Boys whatcha gonna do, whatcha gonna do when we come for you? Seriously, I don't get all the negativity towards this film. Its just a great action-comedy where Will Smith and Martin Lawrence are again in top form as Mike Lawrie and Marcus Barnett. In terms of entertainment this is  non-stop action set at a fantastic pace. The story again focuses upon the Miami drug scene with a new villain in Johnny Tapia the kingpin, set in motion Mike and Marcus to bring him down but what follows isn't just sheer entertainment its sex, violence and genuine laughter! Smith and Lawrence are awesome together. Bad Boys 2 is an instant classic which exceeds the original. Bring on Bad Boys 3!!!"
    },
    {
      "rating": "10",
      "text": "epic"
    },
    {
      "rating": "10",
      "text": "epic"
    },
    {
      "rating": "10",
      "text": "Possibly one of the worst movies ever. But it is funny as hell, and everyone (par any people of nervous dispositions) should watch this. Probably not worth buying, but one of the best, worst films, of all time."
    },
    {
      "rating": "10",
      "text": "one of the funniest, most energetic buddy-action films out there, bad boys ii is certainly cliched but, dayum is it satisfying to watch, the action scenes are like controlled chaos, the cast does a solid job, and the plot is actually comprehensible... unlike most action films today... if you still nurture that part of you that likes to see ass-kickings, shootouts, explosions, crashes, hot women, etc.  then you will have a hard time finding anything much better than this."
    },
    {
      "rating": "7",
      "text": "Good movie!1st half was slow and boring after that we are in for treat amazing acting and music and comedy!story was okay the setup at start was stretched by that whole movie seems stretched as run time is more!I laughed to death with some great legendary scenes like tv shop the pool and the dead body center,the bullet in the ass and the warrant scene at officers house these scenes were really amazing!the chemistry between both is amazing although they have some concerns with there bromance as they both hide something with each other.ending was amazing lot of action and explosions yaa michael bays signature move!felt like playing vice city having hatains and cubans fights!overall entertaining not as great as 1st one but i enjoyed it!"
    },
    {
      "rating": "5",
      "text": "It's easy to tell when you're watching a Michael Bay movie, particularly from post-90s Bay. He is a straight-up action junkie, and \"Bad Boys II\" is perhaps as much of an action flick as you could get, flying from one scene to the next in a visually pompous, grandiose and sometimes distracting style. Bay's lack of proof at delivering good acting is saved to a certain extent here by the always-enjoyable Will Smith and sometimes-enjoyable Martin Lawrence, and the plot is - as usual - written to serve action and visual interest rather than characters and compelling suspense. Also signature of Bay here is a well-rounded melting pot of pubescence and common denominators - the screen is bursting at the seams virtually every minute with frenetic car chases and gunfights, bloody shootings, pissed off characters in love with profanity and the camera's adolescent adoration for sexual imagery and innuendo. Hell, in this round Bay treats himself to a substantial amount of somewhat disturbing mortuary humor and cadaver carnage, even resorting to throwing fat dead bodies off the back of a truck and watching them subsequently squashed and mutilated by traffic.\r Still, despite all the over-the-line black comedy and lack of any substantive character development or plotwriting, the action scenes are mostly a lot of fun, and it's still nice to see car chases and massive destruction that isn't just CGI. True, you do have some computer cars swerving and tumbling down highways in a mayhem that likely defies many laws of physics, but you also have a Hummer careening madly down a hill of shacks and houses, followed by trails of explosions and enemy gunfire. Even when led by Will Smith, this can never make for great filmmaking, but this is Michael Bay at his adolescent best, and in this movie he can be largely forgiven for his momentary transgressions due to the overall popcorn factor of the flick. Just be warned - if you don't have the stomach for brutal bloody violence, hundreds of F-words, or hiding under sheets with dead big-breasted cadavers, \"Bad Boys II\" will not be your cup of tea. If you don't mind a barrage of mindless teenage eye candy, then perhaps you'll find this a treat. For me, I give it a rating straight down the middle. Fun action, some funny moments, and nice special effects, but stuffed with meatless filler of a plot. Okay, but not that great."
    },
    {
      "rating": "10",
      "text": "This movie is hard. Will Smith and Martin did there thing in this movie. Martin was funny as always and Will just set it off with his good drivin. Can't believe that was actually him who was dodging those cars."
    },
    {
      "rating": "9",
      "text": "Just when you think a Michael Bay film can't get any crazier he reunites Will Smith and Martin Lawrence to have a shootout with the KKK, turn Miami into an all-out war zone (twice!) complete with civilian casualties, get in a car chase where Haitians throw a boat at them, watch rats have sex, run over some cadavers in the street, ogle a dead lady's **** and invade Cuba. Bad Boys II is a nasty, gory, offensive ride along with two homicidal cops that don't experience even a hint of remorse for all the death and destruction that they cause and I loved every second of it.After watching this it's easy to see why so many have such strong opinions about Michael Bay. Not just as a filmmaker, but as a person. You truly have to be a little sick in the head to come up with stuff this disgusting and mean-spirited. Yet, it's hard to deny his talent as a director. You may not like what he's putting onscreen, but he's placing it there with skill. The action looks absolutely spectacular even if it takes police brutality to a whole new level and things are much funnier this time around. The duo's ability to remain completely unfazed and uncaring no matter what dangerous or disgusting situation they're in is darkly hilarious, and their antagonistic banter now has the cleverness to match the crudity.Bad Boys II is the adolescent shoot 'em up fantasy version of police work dialed up to 11. It's all insane action, wildly inappropriate antics, and incessant bickering from start to finish. Bay crosses the line of good taste on multiple occasions, but he executes his vision with such gleeful enthusiasm that I couldn't help but have an absolute blast. 9.3/10"
    },
    {
      "rating": "10",
      "text": "epic"
    },
    {
      "rating": "10",
      "text": "epic"
    },
    {
      "rating": "10",
      "text": "epic"
    },
    {
      "rating": "10",
      "text": "epic"
    },
    {
      "rating": "10",
      "text": "epic"
    },
    {
      "rating": "10",
      "text": "epic"
    },
    {
      "rating": "10",
      "text": "epic"
    },
    {
      "rating": "10",
      "text": "epic"
    },
    {
      "rating": "8",
      "text": "I love Will Smith in all his movies but this was poor at times by Martin Lawrence. Pathetic at times but I have to give it an 8 since its a Will Smith movie. Without him I would give it a 4. There was some comedy in it that was actually funny. I posted the same thing on Bad Boys because I feel as though the movies were practically the same in many ways."
    },
    {
      "rating": "10",
      "text": "It's been almost 12 years since Bad Boys II hit theatres, and blew my mind. I don't even remember the noisy first movie, I just didn't like it that much, even though it has higher ratings. Bad Boys II completely changes the game by throwing in more drugs, sex and stupendously bloody violence, and boy was it entertaining. Michael Bay is one of the most disliked directors, okay, but with BB2 he totally has realized a new genre of action thrillers on their own, for example- the car chases are the most best chases I have ever seen in a movie. He blends Lethal Weapon and Boyz In Da Hood and Pineapple Express together, and experiments with his movie elements. The result is a lush Miami setting, Will Smith and Martin Lawrence at their comedic best, a drug fulled story, car and gun chases, and sgexy women. What more could you want from an action movie. It's not a movie for serious critics or people who don't like action movies. BB2 is a hidden classic action flick, it's well paced, smartly written and brilliantly acted. The appeal is beautiful. And it still technically holds up in 2015. I hope the third one is good! The nose fun you will have watching a movie, period."
    },
    {
      "rating": "9",
      "text": "Despite all the bad reviews coming from the critics, the sequel has more action and humor just like the first one! If you seen the first one, you may love it or hate it."
    },
    {
      "rating": "7",
      "text": "However masterful, the first-rate stunt work, effects, action cinematography and cutting (by no less than three editors) lose impact through sheer repetition."
    },
    {
      "rating": "7",
      "text": "However masterful, the first-rate stunt work, effects, action cinematography and cutting (by no less than three editors) lose impact through sheer repetition."
    },
    {
      "rating": "7",
      "text": "Surprisingly long, and again very Michael Bay style, lots of explosion and very little drama."
    },
    {
      "rating": "7",
      "text": "Not as good as the first Bad Boys but was still alright. Another film that is Very Michael Bay lots of explosions and car chases and the ladies in short dresses."
    },
    {
      "rating": "1",
      "text": "Product placement filled nonsense from Michael Bay and Jerry Bruckhiemer. Unintelligent, uninspired, derivative trash. Bottom line: THis movie was intended as som kind of action movie come comedy/buddy movie. In the end, it is mere nonsense. There are better movies of this type available."
    },
    {
      "rating": "0",
      "text": "One of the worse movies of all time. For the people who hated Matrix Reloaded. I tell you this. Bad Boys 2 makes Matrix Reloaded look LIke Godfather Prt. 2. How Many Carchases can you have in one movie?? And what is so special about Martin's sister?. Lets chase after her again and again and again. More car chases.. Yay!!!. I spit on this film...no wait.. i take that back..this is not a film. This is snuff!!!"
    },
    {
      "rating": "0",
      "text": "Awful, gory, gratuitous, disgusting, and not even funny -- shameful in all."
    },
    {
      "rating": "8",
      "text": "The year is 2007, and I've yet to find a movie that gets my blood pumping faster than this one. Sure, It could have came up to BREATH for a couple of minutes, but really, when I'm going to the movies to see an ACTION/COMEDY, that's exactly what I want to see. NOT characters onsceen rambling about nothing just to justify a plot, and to be honest, the lack of one in this movie probably made it better."
    },
    {
      "rating": "10",
      "text": "Es ist immer lustig zu lesen was die Kritiker schreiben; meist scheinen sie alle der selben Meinung zu sein entweder ist ein Film schlecht oder gut, das is klar und verständlich. Dennoch wird dann immer der eine Film nieder gemacht oder hoch gelobt. Hier kann man von Lob nicht sprechen. Was viele vergessen: das ist kein Thriller wo die Story sehr tiefgreifend sein muss, nein, das ist eine Action-Komödie die wirklich sehr lustige Dialoge bietet und Action vom feinsten. Fazit: Einer der besten Filme in seinem Genre die ich je gesehen habe; wenn nicht sogar der beste!"
    },
    {
      "rating": "6",
      "text": "A Michael Bay sequel that boils down to the same net quality as its predecessor, but with some of the key variables shifted around. Compared to \"Bad Boys,\" \"Bad Boys II\" is greatly improved from an action and kinetics standpoint, with the set pieces cumulatively comprising the film's greatest attribute in my opinion. I personally relished in that of the car carrier trailer/Ferrari chase, a scene that some have complained is too long. Honestly, though, it could have been much longer, so as to keep me further away from the scarcely funny humor and piss poor domestic spats sprinkled amidst the film's runtime. The villains are over the top, the feasibility of everything is rightfully lampoonable and there's a whole host of material that doesn't age well. In short, it's typical, early 2000's Bay, but I'd be a fool for not admitting that it could be a whole lot worse."
    },
    {
      "rating": "5",
      "text": "Will Smith, Martin Lawrence and Gabrielle Union carry this film. Otherwise, Bad Boys 2 is a funny, all action, casual racist banter and normal everyday Bay-isms. Jordi Morella is an entertaining and memorable villain but the film is just overstuffed with mindless action scenes, car chases and shoot outs with no regard for collateral damage. The third act is one big Hummer H2 commercial"
    },
    {
      "rating": "6",
      "text": "Whether the original Bad Boys merited a sequel is a moot point - with worldwide takings of over $180 million on a $23 million budget, it was inevitable.\r However, a gap of eight years - an age in cinematic terms - means that the hardly indelible characters have fallen off the movie-going radar and need to make quite a noise to recapture an audience now more enamoured with CG, kung fu and fantasy than bullets and fireballs. While not wanting for bangs, as a film Bad Boys II makes more of a dull thud.\r Smith and Lawrence are an agreeable comic pairing when given the right material and a reason for their incessant bickering - otherwise their sniping is irritating rather than hilarious.\r The 'killer ecstasy' plot (which causes precisely one fatality and seems to do very nicely for Lawrence in one jarring comedy sequence) on which their antics are hung might have passed muster in the '80s, but seems a little 'so what?' now - like warning against the perils of CFCs.\r The pair do have their moments (especially an amusing interrogation of Marcus' daughter's terrified date), but much of what's here is offensive (corpse tossing, anyone?) without being funny.\r Smith in particular, though a master of the buddy comedy genre, could do with being pickier with his material, having starred in nothing consistently hilarious since the original Men In Black.\r Even in the face of leaden material, Michael Bay still manages to pull some impressive directorial tricks out of the bag. The first car chase down a Miami highway beats the overloaded freeway free-for-all of The Matrix Reloaded hands down, and his use of the camera is occasionally dazzling. But for what?\r Circling a shootout in one continuous tracking shot looks jaw-dropping, but when the villains have no apparent motive or relevance, you might as well watch it with the sound off.\r By the time the film hits the two-hour mark, with a needless trip to Cuba and yet another car chase/shoot out, what was once invention has long since dulled into pointless repetition.\r There\u0092s some \u0091bad\u0092, meaning good, here; there\u0092s also a lot of plain bad. Frankly, there\u0092s just far too much of everything."
    },
    {
      "rating": "8",
      "text": "That beeping sound you hear just before Bad Boys II starts isn't some technical hitch. It's the dumper truck, driven by producer Jerry Bruckheimer, backing up to Michael Bay's desk and unloading the Gross National Product of Slovakia. Clearly, director Bay pocketed the cash, dashed straight past Decent Scriptwriting Inc and headed directly into Explosions R Us. The money's all up there on the screen, only most of it soon flies off in a shower of flame and rubble.\r Mike Lowrey (Will Smith) and Marcus Burnett (Martin Lawrence) are chasing down a drug dealer who's smuggling his ecstasy into the country via a mortuary. While investigating (read: killing henchmen in a series of ultra-destructive car chases), the pair discover that Marcus' sexy sis Syd (Gabrielle Union) is working undercover for their quarry. Tricky situation - made doubly so by the fact that Syd's shagging Mike behind her over-protective brother's back.\r All of which is really just an excuse for the titular cops to shoot guns, trade insults and frustrate their boss (Joe Pantoliano). Fine. Or it would be if all the action bolted onto this wobbly narrative frame didn't come straight from the school of lazy sequels. You know, the one with diplomas marked More Of The Same. Yes, there are some breath-snatching stunts on show here, from the Matrix-matching highway chase (Smith and Lawrence's speeding auto dodging cars thrown from a transporter truck) to the delirious 360-degree pan around a frantic shoot-out. They'll thrill, but they won't solve the movie's biggest problem - director overload.\r No doubting that Bay knows how to graft together a set-piece. It's just that once he finds something he likes, he won't let go. So be prepared to sit through another highway chase, almost identical but with spilled corpses replacing spilled cars. And, despite Bay's protestations that Pearl Harbor signalled his move into more substantive filmmaking, here he's reset his targets to match those he was aiming at almost a decade ago. One or two startling CG shots aside, Boys II could have been made eight months after the first movie, let alone eight years. And it's not just the explosions, either - even the ecstasy-smuggling plot and Lawrence's New Age obsession feels faintly stale.\r Still, one vital component is all the better for not having moved: the wisecracks. Okay, so some of the boys' quick-fire banter is worryingly homophobic, adding to the discomfort of the almost orgiastic violence, but it's the pair's ceaseless gaggery that raises the watchability. Teamed with Big Willie, even Martin soddin' Lawrence is funny.\r Bad Boys II does not reinvent the action film. It repeats it. But if you came out of the original wanting an extra two hours, step up and have a blast. Just don't expect to have quite as much fun as Michael Bay did when he made it...\r Michael Bay turns off the brain and switches on the detonator... Overlong, overblown and underwritten it may be, but Bad Boys II still punches the pleasure centres enough to qualify as big, dumb fun. Just."
    },
    {
      "rating": "8",
      "text": "Great sequel - was delightfully surprised. Will Smith and ML always a good combination.\r Watch it online for free: https://www.primewire.ag/watch-199-Bad-Boys-II-online-free"
    },
    {
      "rating": "5",
      "text": "Hot Cars, Burning Rubber and Guys Good and Bad!\r Let's begin with a traffic report. This has been an unusually chaotic summer on the freeways and boulevards of South Florida and Southern California — in the movies anyway. First there were Laurence Fishburne and Keanu Reeves somersaulting on top of a speeding semi in \"The Matrix Reloaded\" to the sound of grinding gears and complaining metal. This was followed in short order by the big chase at the end of \"Hollywood Homicide,\" the Mitsubishi mating dance in \"2 Fast 2 Furious\" and Arnold Schwarzenegger swinging from the end of a giant crane in \"Terminator 3: Rise of the Machines.\"\r Now, hoping to outdo them all in automotive wreckage and box office damage, here is \"Bad Boys II,\" in which a posse of bad guys commandeers a trailer loaded with new cars that they drive at high speed along a stretch of Miami highway, flinging the cargo onto the road behind them at Will Smith and Martin Lawrence, who are in furious pursuit. \"Did you see that?\" Mr. Lawrence exclaims as a Buick spirals overhead. To which Mr. Smith replies: \"They're throwing cars. How am I not going to see that?\"\r Later a different set of bad guys (not to be confused with the bad boys of the title, Mr. Smith and Mr. Lawrence, who are good guys) will do a similar trick, only with embalmed corpses, one of which is graphically decapitated by another vehicle. But perhaps it is time to cut away from the chase.\r \"Bad Boys II,\" in which Mr. Smith and Mr. Lawrence once again play a pair of Miami police detectives named Mike and Marcus, is the latest collaboration between Jerry Bruckheimer, who produced it, and Michael Bay, who directed. (Ron Shelton, director of the much better \"Hollywood Homicide,\" helped write the screenplay.) This one follows in the tradition of the earlier Bruckheimer-Bay pictures — the first \"Bad Boys,\" \"The Rock,\" \"Armageddon\" and \"Pearl Harbor\" — all of which made a lot of money and were otherwise pretty much worthless.\r Mr. Bruckheimer, who is routinely identified in publicity material as \"the most successful producer of all time,\" is not a man for subtlety or for half measures. This summer he has, at least momentarily, outdone himself, releasing two movies — \"Bad Boys II\" and \"Pirates of the Caribbean\" — within 10 days. The two films have an aggregate running time just shy of five hours. (\"Boys,\" at 144 minutes, is 11 minutes longer than \"Pirates.\") Anyone contemplating a double feature should come prepared with a large bottle of Tylenol. I can't say I recommend the experience, but it's your money, at least until Mr. Bruckheimer gets his hands on it.\r Quite a bit was clearly spent on the assaultive, bombastic, and occasionally funny spectacle that is \"Bad Boys II.\" Mr. Bay may lack restraint (also taste, wit and shame), but he does have an undeniable flair for sleaze, noise and vulgarity. One of his most impressive feats is to film a nightclub rave scene so that the camera glides under the skirts and between the legs of the women. There is something leering and nasty about this that makes the more pervasive ogling in \"Charlie's Angels: Full Throttle\" seem downright wholesome.\r A similarly cold, aggressive voyeurism characterizes the film's violence, which is relentless and often gruesome. Corpses are probed for drugs hidden inside them; a bucket of severed limbs, still dripping blood, is placed on a dining-room table. Several times Mr. Bay uses slow motion to track the course of a speeding bullet, climaxing with its explosive, splattery impact on a human body. David O. Russell used a similar effect in \"Three Kings\" as a graphic and terrifying illustration of what a gunshot can do. Here it is meant to produce a dumb, visceral, involuntary thrill. The audience at the screening I attended responded on cue to each exploding cranium and mangled tosro, with oohs and oofs and wows (as well as less printable interjections), and so, helplessly, did I.\r The cast, in contrast, appear fit and energetic. The best moments come when Mr. Smith and Mr. Lawrence are permitted to pause from their action-hero duties and run their funny, unpredictable mouths. At one point, to no discernible narrative purpose, they team up to terrify a young man who has come to take Marcus's daughter on a date, and their parody of thuggish bravado seems like a sly sendup of the movie itself.\r The main difference between the partners is that Marcus is a family man (his infinitely patient wife is played, in too few scenes, by Teresa Randle), while Mike is, in his partner's words, \"a dog.\" He also happens to be sweet on Marcus's younger sister, Syd (Gabrielle Union), an undercover federal agent who is mixed up in their case, and whose abduction by the chief bad guy occasions the unauthorized invasion of Cuba at the end of the movie."
    },
    {
      "rating": "7",
      "text": "However masterful, the first-rate stunt work, effects, action cinematography and cutting (by no less than three editors) lose impact through sheer repetition."
    },
    {
      "rating": "8",
      "text": "However masterful, the first-rate stunt work, effects, action cinematography and cutting (by no less than three editors) lose impact through sheer repetition."
    },
    {
      "rating": "0",
      "text": "This is one of the most offensive, unfunny, badly edited and poorly acted movies I have ever seen. Martin lawrence is not funny, period. Saying \"f*ck\" every 20 seconds is not amusing to anyone over the age of 12. The action scenes were cut so quickly that they were barely intelligible. Compare the awful car chases in bad Boys 2 to the gripping chase in The French Connection and you'll see what I mean. Bad Boys 2 is certainly \"bad\", only not in a good way."
    },
    {
      "rating": "0",
      "text": "This is one of the most offensive, unfunny, badly edited and poorly acted movies I have ever seen. Martin lawrence played better in Black Knight. Saying \"f--k\" every 20 seconds is not amusing to anyone over the age of 12. The action scenes were cut so quickly that they were barely intelligible. Compare the awful car chases in bad Boys 2 to the gripping chase in The French Connection and you'll see what I mean. Bad Boys 2 is certainly \"bad\", only not in a good way."
    },
    {
      "rating": "7",
      "text": "However masterful, the first-rate stunt work, effects, action cinematography and cutting (by no less than three editors) lose impact through sheer repetition."
    },
    {
      "rating": "7",
      "text": "However masterful, the first-rate stunt work, effects, action cinematography and cutting (by no less than three editors) lose impact through sheer repetition."
    },
    {
      "rating": "7",
      "text": "However masterful, the first-rate stunt work, effects, action cinematography and cutting (by no less than three editors) lose impact through sheer repetition."
    }
  ]
}