{
  "id": 604,
  "title": "Bad Boys for Life",
  "starring": [
    "Will Smith",
    "Martin Lawrence"
  ],
  "runtime": 124,
  "genre": [
    "Thriller",
    "Action",
    "Crime"
  ],
  "description": "Marcus and Mike are forced to confront new threats, career changes, and midlife crises as they join the newly created elite team AMMO of the Miami police department to take down the ruthless Armando Armas, the vicious leader of a Miami drug cartel.",
  "releaseYear": "2020",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/y95lQLnuNKdPAzw9F9Ab8kJ80c3.jpg",
  "categories": {
    "plot": 5.75,
    "acting": 6.2,
    "ending": 6.25,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 7.411764705882353,
    "action": 6.095238095238095
  },
  "reviews": [
    {
      "rating": "9",
      "text": "Wow super surprised at how much I enjoyed this action packed flick. Even though it isnt directed by OG director, these next few films are in great hands."
    },
    {
      "rating": "0",
      "text": "the only movie without michael bay, does it holds up? no! the jokes are flat and forced the new directors wanna be like michael bay so hard that they had him cameo in thias and it just didn't work the storyline about mike lowrey secret son is garbage and they killed off captain howard towards the end and threat it like nothing happened the new characters are annoying and add nothing of value to the plot. bring Michael bay back, this movie is weak with bcuz of these hacks that has no clue on what they were doing.trash movie 4 lyfe"
    },
    {
      "rating": "10",
      "text": "good film and will smith great in film but film is very boring dialogs are boring"
    },
    {
      "rating": "6",
      "text": "A pretty basic action flick with pretty big plot holes. Overall enjoyable enough but it is 100% fromage with a promise of more to come."
    },
    {
      "rating": "3",
      "text": "Directing duo Adil and Bilall inject a manic energy into the production doing their best to ape Michael Bay, but this reboot was always going to be dead on arrival.Will Smith and Martin Lawrence come off as off-brand facsimiles of their younger selves, relying on witless camp and forced back-and-forth quipping.  You're better off spending money on a ticket for an Oscar contender you may have missed earlier in the season."
    },
    {
      "rating": "1",
      "text": "If you can get past the poor acting, the plot holes and the uninspired action sequences, you'll enjoy dropping $12.50 on a ticket. If you're able to catch the matinee, you'll still need to get past the poor acting, the plot holes and the uninspired action sequences, but at least you'll save a couple bucks."
    },
    {
      "rating": "1",
      "text": "Negatives : Uninspired, predictable, boring, ridiculous action scenes, rather unfunny.Positives : A couple decent fight choreography scenes. I didn't have to pay to see it. The movie is structured in a way that allows me to multitask and do other things without missing anything, kinda like an audiobook.I'm looking forward to the day when Hollywood learns that this endless reboot garbage won't net them as much as ORIGINAL GOOD CONTENT."
    },
    {
      "rating": "6",
      "text": "It is good but I wouldn't be one to suggest seeing it a second time.  I liked the style of the film and the chemistry of Will and Martin.  Everything else was pretty average... which by definition is not bad.  It's worth a view if you just want to see a movie and aren't too excited about anything that's out."
    },
    {
      "rating": "5",
      "text": "It’s perfectly fine, I got nothing against it. It’s better than most 17-year-delayed, third installments or January releases have any right to be. It’s fun to see Will Smith doing live-action action/comedies again and Martin Lawrence doing...anything. Biggest issue is when guns aren’t going off, the film drags, despite only being 120 minutes."
    },
    {
      "rating": "9",
      "text": "Another reminder that professional critics will dislike a movie like this, but recommend tired, tedious, over-written movies (Ad Astra).  This movie is a lot of fun. If you liked the first two Bad Boys movies, you'll love this one. This movie is also very self-aware. You're watching two men- One who has embraced his new point in life, and another who is struggling with the fact that he's not the same as he was when we saw him 20 years ago. A lot of the jokes land. There were times that the entire theater was laughing. Will Smith and Martin Lawrence are back in form. It was an extremely entertaining movie. Was it perfect? No, but I wasn't looking for perfection. I was looking to be entertained on a Sunday night, and I was entertained for a solid 2 hours. It was well worth the money."
    },
    {
      "rating": "9",
      "text": "Usually third movies of any trilogy can be stale and quite easily overdone but this movie felt fresh and introduced new life into the series. This already the best blockbuster of the year. The movie is thoroughly entertaining. Nobody goes to watch these kind of films for a deep story, they want to be entertained and this film does that very well. Bad Boys For Life is a movie that doesn't take itself too seriously and plays to its strengths. It is the best movie of this franchise and downright hilarious. The comedy in this film is perfect, never too much and the timing is always just right. Great film and highly recommended."
    },
    {
      "rating": "9",
      "text": "Great movie, I was pleasantly surprised at the story in particular.  I always felt the first 2 movies were more guilty pleasure than anything special.  Will Smith and Martin Lawrence are hilarious together, and their presence carried the movies, but I always felt the stories lacked cohesion and seriousness.  For Life solved the problem in spades, the acting was better than expected, and its been awhile since a genuine action movie actually had twists you didn't see a mile coming.  Not an Oscar caliber movie, but definitely a fun ride!"
    },
    {
      "rating": "10",
      "text": "Out of them 3. This is as fun as ever. But with heavy loses along the way. Twists that add lore to an action movie that only had bullets and explosions. My fav of the trilogy for sure."
    },
    {
      "rating": "8",
      "text": "Everything awesome - laughter, tears. As for me it good old Bad Boys! I've got a pease of  sentimental longing and wistful affection for the past ^)"
    },
    {
      "rating": "2",
      "text": "Such a great disappointment, that I had to leave a review. There is nothing funny or interesting in that movie, absolutely nothing. I am sorry to be so cynical, but that's the truth and you should not waste your time watching it. It doesn't matter if you like the actors or a fan of the Bad Boys movies, even that won't make up for how bad this movie is."
    },
    {
      "rating": "6",
      "text": "Completely unessential but it's enjoyable if predictable. All the characters are exactly as expected or predicted so it's very much by the numbers / motion. It's worth watching if there's nothing else on but I cant' recommend as a must see."
    },
    {
      "rating": "7",
      "text": "Bad Boys for Life is a sequel that was a long time coming.  Almost 2 decades have passed by and both characters have grown order...and obviously not as invincible as they were before. The story took a lot of left turns that made it interesting. The Chemistry between the leads are also pretty great as always."
    },
    {
      "rating": "7",
      "text": "\"Bad Boys for Life\" resurrects the dormant 'Bad Boys' franchise with an adrenaline boost of terrific action, wisecracking chemistry between the leads and their new team, and a villain and plot that is better than the first two films."
    },
    {
      "rating": "8",
      "text": "A good film from a franchise that desperately needed to be freed from the shackles of \"Bayhem.\" Bad Boys For Life is a pleasant surprise."
    },
    {
      "rating": "7",
      "text": "Is it an award winning masterpiece? No. Is it the best movie in the series? Without a doubt."
    },
    {
      "rating": "9",
      "text": "Le retour du Duo emblématique réussi ! Franchement bien jouer. Ce film \"explose\" moins, mais j'ai adoré la façon d'amener le futur finement joué.The successful return of the iconic Duo! Frankly play well. This film \"explodes\" less, but I loved the way of bringing the finely played future."
    },
    {
      "rating": "7",
      "text": "Best way to describe it is a fun summer movie, but don't expect anything more than that. 73/100"
    },
    {
      "rating": "4",
      "text": "The twist of the plot was undoubtedly created from the very long period of time between the second installment and this one.And for that very reason it feels like a resource pulled out of the sleeve and completely anticlimactic.And while Bad Boys aren't the kind of movies where you're obviously looking for a really solid or dramatic story, at least I have to give Michael Bay credit because he knew how to exploit it.The new directors don't succeed, and instead of reinforcing the dynamics and chemistry between Smith and Lawrence, they focus on breaking it with the new characters, who honestly bring absolutely nothing to the table.Bad Boys For Life it's indeed an entertaining film if you don't look for anything else inside it.Yes it has comedy, explosions, bullets, their formula, but unlike second part, with these results it's fair to say if it was worth coming back after 17 long years and in my opinion it wasn't worth it.Let's see how long it will take for the fourth part that was recently announced."
    },
    {
      "rating": "7",
      "text": "The bad... Oh boy those racist race jokes are so cringe. The Dynamic between the two old cops and the new cops barely worked. The only white guy on the team was the only one who had any character depth in the new team. The other three were like flawless planks of boring wood.  The good... Fun no brainer mindless action movie with a hell hath no fury like a women scorned plot. Plus it has that song that stays in the head for days."
    },
    {
      "rating": "8",
      "text": "They still got it. The chemistry between Will Smith and Martin Lawrence is fantastic. The humour in the film is pretty good too. Also loved some side characters like Rita especially and want to see her again in the next part if it happens. And yeah it is a popcorn flick but it is a good one. There are some emotional punches which lands beautifully in the film and keeps the film more compelling than the Michael Bay's take on this fanchrise.The villain has the weakest arc in the whole movie and didn't care about that character at all. Even though the film stumbles on some narrative points, clunky storytelling and an anti-climatic ending but it still is better than both the predecessor.Grade: BScore: 7.5/10"
    },
    {
      "rating": "4",
      "text": "Movie plot was pretty lame, visual effects were below average. This movie was pretty trash honestly. I would not recommend it at all. Only good thing it has going for it is that Will Smith is in it. Other than that 4/10"
    },
    {
      "rating": "8",
      "text": "O filme trouxe tudo de \"bom ou ruim\" nos dois primeiros filmes de Bad Boys, mas, aperfeiçoando coisas que nem o próprio Michael Bay percebeu, nem na trama nem no carisma dos personagens, deu razão para sua existência, com ótimas atuações a seu favor: Will Smith Martin Lawrence é excelente como a mais dura e desqualificada dupla policial do cinema e até do restante do elenco, ação explosiva eletrizante que nos faz querer um pouco mais, o que nos empolga para onde esta franquia está indo agora."
    },
    {
      "rating": "9",
      "text": "Os dois primeiros filme são sensacionais, e esse novo filme é o melhor dos três, muito divertido, a ação é maravilhosa e as piadas funcionam muito e não é cansativo, depois de 17 anos os protagonistas continuam com um introsamento incrivel, enfim bad boys para sempre é excelente"
    },
    {
      "rating": "9",
      "text": "ахуено. я все сказал пишу здесь что-бы было в профиле так надо что-то написать, а не не надо"
    },
    {
      "rating": "8",
      "text": "This installment of “Bad Boys” is sassy, silly, sophomoric and sometimes savage.  It’s also the most fun I’ve had at the movies in months.In the hands of Directors Adil and Bilall, who previously partnered on “Black,” “Gangsta” and “Broeders,” this film is a fun mix of formulaic and self-aware.  The plot is quite predictable.  A Mexican drug cartel seeks vengeance on the cops who sent their leader to prison for life.  Mike (Will Smith) is clearly in their sights.  Mike enlists his long-time partner, Marcus (a puffy Martin Lawrence), to help him right wrongs and preserve truth and justice, while engaging in ceaseless, manly banter along the way.  You could drive a truck through the holes in the plot – or in this case a steel-reinforced urban assault vehicle equipped with computers, GPS and rocket launchers.This is a film that clearly enjoys skewering itself and the whole police genre.  While there is the beleaguered Captain trying to keep Mike in line (an excellent Joe Pantoliano), it’s all over-the- top and played with a self-aware wink and a nod.  The females are bosses and bad-asses (including Vanessa Hudgins, unrecognizable from her time in the “High School Musical” series), not just objects of desire or damsels in distress.  There’s a hunky male cop (Alexander Ludwig) who seeks to avoid violence and strongly endorses the value of therapy in dealing with life’s inevitable issues.  There are regular demonstrations that technology and brainpower may work better than Mike’s testosterone-driven macho posturing.  And finally, there’s the explicit awareness that our hero is a lot closer to the end of his career than its beginning, despite his protests to the contrary. There’s also a necessary nod to the fact that Mike and Marcus are not the men they were when the series began in 1995.  In fact, Marcus has been enjoying a fully domesticated retirement filled with minivans, baby wipes, grandchildren and a healthy fear of his wife, who seems more imposing than most of the bad guys.The action sequences are generally first rate.  Bombs, car chases, explosions – check.  The film also includes a searing final scene that offers the best helicopter action since the musical “Miss Saigon.”Most valuable of all, this film is totally self-aware.  There’s even a brief cameo involving Michael Bay, the director of the 1995 and 2003 installments in this franchise, as a benign wedding MC.  This is a franchise that realized it desperately needed a re-boot, then took on the task with intelligence and humor.Most of all, this is a film that adroitly addresses the existential themes of death, eternity … Oh, come on, already.  Really!?  Just sit back, relax and enjoy the banter, bravado and brio.  There’s plenty to go around."
    },
    {
      "rating": "9",
      "text": "Surpreendentemente divertido!Eu não assisti a trilogia original, logo não tinha muitas expectativas - na verdade, até subestimei pelo gênero. Acontece que o filme já começou me impressionando positivamente. O audiovisual é fantástico. A cinematografia é muito bem feita, com ângulos e planos lindíssimos, que junto a paleta de cores viva, torna a experiência muito mais agradável. A trilha sonora também é característica e merece atenção. As cenas de luta são bem coreografadas, e o posicionamento e tracking da câmera são muito suaves, deixando o público ligado no que está acontecendo, fugindo da confusão mental dos filmes de ação preguiçosos.A história é surpreendentemente boa. Há uma mínima ligação entre os personagens - personagens esses que são bem desenvolvidos visto o gênero principal. Já que o filme não se leva a sério e até faz piada com isso, alguns pontos se tornam mais toleráveis. Os protagonistas são bem carismáticos, tem seus ideias, medos e momentos chave. Uma decisão inteligente foi não ter dado atenção demais para o tema de \"moda antiga vs novos tempos\", se relacionando a tecnologia. A maior parte das piadas foram certeiras, e me fizeram gargalhar. A violência gráfica é bem satisfatória, sem exageros, mas sem segurar a mão dos mais sensíveis."
    },
    {
      "rating": "8",
      "text": "What you gonna do? It was fun, great action and had a good laugh. Bad Boys for life was a lot better then I expected."
    },
    {
      "rating": "10",
      "text": "Freaking great movie!!  So many funny parts.  I love Will and Martin’s duo together."
    },
    {
      "rating": "8",
      "text": "Muy divertida excelente palmera te entristece te divierte buenas escenas de acción"
    },
    {
      "rating": "7",
      "text": "Good movie, funny, solid plot. All 3 films are dope. Bad Boys 2 being the best. Go see it, laugh and have a good time!"
    },
    {
      "rating": "8",
      "text": "Bad Boys For Life shows that you don't need to reboot franchise to try and appeal to a new audience, just by making good films works fine enough."
    },
    {
      "rating": "8",
      "text": "Getting Old But Still Bad Boys For LifeThe Stream: Some comedy falls flat and parts of the movie seem rushedThe Big Screen: Typical great action sequences and comedyThe Final Bill: The worst of the three Bad Boys series but very enjoyable.-S2S: Movie ReviewsWe ride together. We review together. Stream to Big Screen for life. Welcome back to Stream to big Screen. This week we have the chance to review the long awaited third installment of the Bad Boys movie franchise starring Will Smith and Martin Lawrence. They reprise their roles as Detectives “trigger/bulletproof” Mike Lowrey and Marcus Burnett. It’s been 17 years since Bad Boys 2, but these two still know how to tear up Miami. This time they incorporate the help of a new department of the Miami PD, AMMO to make this happen. Let’s see if Bad Boys For Life can live up to its predecessors.Good news or bad news…. bad news first of course. Martin and Will are old. This seems like an obvious statement but at times it jumped off the screen. Martin looks fat, clearly can’t do action scenes anymore, and even his signature voice suffers. Age hasn’t seemed to have affected Will as much, but he’s definitely slowed down. The good news is that the director made this work in their favor. They embrace these actors’ lack of vigor and infused a new cast to assist. And boy do they get busy. In fact, I think this movie will do so well that the 4th installment is a foregone conclusion.Now, speaking of age, this movie has its walk down memory lane, but it isn’t full consumed by it. While homage is paid with old jokes and cast, the director found a way to bring the movie into the present. Thankfully, Bad Boys for Life isn’t simply a nostalgia money grab movie. This movie plays well as a third installment to what could be a continuing series, if they wanted.My only issues with Bad Boys For Life comes with the pacing and some jokes that absolutely flop. This movie starts off too slow and in the end it feels rushed; but then there are points in the middle that seem to linger a bit too long. This is clearly something a viewer can get passed but in these lingering moments it comes with some jokes that do not land. Don’t get me wrong, the cast has some very strong moments of comedy and comic relief, but a few times the jokes missed the mark…. hard. Otherwise, the movie was jammed packed with laughs, action and quality fight scenes.So what can we say – you know what you’re going to get from our leading duo. Great chemistry, laughs, and action lead viewers to the theaters as usual. Even though they may be getting older and rounder Will and Martin still have some gold left in them and the new cast members help bring the series into the future. Grab a bowl of popcorn, go to a matinee showing and enjoy the ride.HASTA EL FUEGO!*sings poorly* Bad boys bad boys whatcha gonna doooooooo….."
    },
    {
      "rating": "8",
      "text": "17 years after the release of its predecessor, Bad Boys for Life manages to jump back into the action without skipping a beat. Following a familiar formula, the plot is adequate at best, but Smith and Lawrence’s fantastic chemistry will leave fans of the franchise delighted for their return."
    },
    {
      "rating": "2",
      "text": "This movie is not bad, I'm just tired of these old and recycled properties with little to no originality to them. I'm done with sequels and remakes, I want more original products with good writing. Stop going to see this stuff and tell Hollywood to do something new for once."
    },
    {
      "rating": "7",
      "text": "Esta es una buena pelicula para disfrutar de ella. Primero empezare con los puntos negativoshay un error argumental con la primera pelicula en concreto con lo de el hijo de mike lowrey que las fechas no cuadran con la primera pelicula ya que se dice que ocurre en 1994 y la primera pelicula se rodo sobre esas fechas y mike ya estaba desde hace tiempo en el cuerpo y se conocia con marcus desde el instituto. La villana no se aprovecha  tanto que es la madre del hijo de mike lowrey y la escena del disparo a mike habria sido mejor en torno al final ya que nos pillaria por sorpresa y conseguiria que fuera un momento bastante mas duro de lo que seria al principio del film.Ahora los puntos positivos:En cuanto a la comedia de la pelicula es muy buena y las escenas de accion bastantes decentes. Hay muchos cameos ha personajes de la anterior pelicula como reggie el negro alto mitico en la 2 pelicula que nos hizo reir a todos La empatia que sentimos hacia los personajes por ejemplo con la muerte de personajes como el capitan de policia que sale en las tres peliculas es una escena que se empatiza muy bien y sientes que lo ehcas en falta toda la pelicula sin llegar a ser un defecto sino algo positivo.como la vida de mike lowrey se va echando encima y su ira al ver como en poco tiempo pierde a la gente que esta a su lado, los efectos especiales lucen bastante bien en la pelicula y en resumenEs una buena pelicula que si te gusta el cine de accion no hay que dudar en ver esta pelicula esta hecha para disfrutar y ya esta no es una pelicula profunda sino que es una para disfrutar y si os gusta el cine de accion o la comedia esta pelicula es para vosotros"
    },
    {
      "rating": "3",
      "text": "Bad Boys For Life is bad. Really bad. You might enjoy it if you can completely switch your brain off. I mean completely. But there are so many aggressively dumb things in this movie that I just couldn’t handle it. Will Smith and Martin Lawrence have great chemistry, but it’s somewhat undercut by the stupidity of some of the dialogue. The action is also enjoyable enough, but even that can gets stale sometimes. Honestly the film gets boring at multiple points and some narrative beats just don’t make any sense."
    },
    {
      "rating": "10",
      "text": "Just when Marcus thought Mike was a pile of a mess then boom, Mike now has a half Mexican son,real badass just like his dad who dated a married witch. Bad Boys I was awesome, Bad Boys II was great, Bad Boys for life wrapped it all up."
    },
    {
      "rating": "10",
      "text": "my favorite movie of the franchise. was not expecting this stellar of a movie after decades. absolutely in love"
    },
    {
      "rating": "8",
      "text": "Overall cool. A bit long. Some jokes got me, some not. Cast of course very big."
    },
    {
      "rating": "7",
      "text": "It's just so many chessy things, and the action sometimes good sometimes terrible, seems like 2 directors might not share the same experiences."
    },
    {
      "rating": "7",
      "text": "While cheesy and dumb (and as characters in the movie even say, it reaches \"telenovela\" levels at some points) it is a decent way to close the trilogy...I just hope this IS the end of the story, because at times it feels like they are trying to launch a franchise out of this (movie has a Marvel style post-credits and all), but these movies are all about Will and Martin, these movies cant exist without them...and as a cop from another movie series once said, \"they are too old for this sh!t\""
    },
    {
      "rating": "9",
      "text": "Solidly entertaining and hilarious action-comedy. A must-watch movie of 2020."
    },
    {
      "rating": "9",
      "text": "This Is Probably the best the series has been followed closely by Bad Boys 2 on the same tier as 2 Guns"
    },
    {
      "rating": "10",
      "text": "BEST BAD BOYS EVER AND MY ALL-TIME FAVORITE BAD BOYS MOVIE"
    },
    {
      "rating": "10",
      "text": "GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD"
    }
  ],
  "recommendations": [
    "hancock",
    "venom_let_there_be_carnage",
    "brick_mansions",
    "hotel_transylvania_transformania",
    "national_treasure_book_of_secrets",
    "baywatch",
    "the_guardian",
    "this_means_war",
    "lockout",
    "knight_and_day",
    "shazam_fury_of_the_gods",
    "angel_has_fallen",
    "escape_plan",
    "the_expendables_3",
    "jumanji_the_next_level",
    "ghostbusters_ii",
    "night_at_the_museum_battle_of_the_smithsonian",
    "terminator_genisys",
    "contraband",
    "night_at_the_museum_secret_of_the_tomb",
    "skyscraper",
    "spenser_confidential",
    "my_spy",
    "mission_impossible_iii",
    "the_a_team"
  ]
}