{
  "id": 4342,
  "title": "Bad Santa 2",
  "starring": [
    "Billy Bob Thornton",
    "Kathy Bates"
  ],
  "runtime": 92,
  "genre": [
    "Comedy",
    "Crime",
    "Drama",
    "Mystery"
  ],
  "description": "Fueled by cheap whiskey, greed and hatred, Willie Soke teams up with his angry little sidekick, Marcus, to knock off a Chicago charity on Christmas Eve. Along for the ride is chubby and cheery Thurman Merman, a 250-pound ray of sunshine who brings out Willie's sliver of humanity. Issues arise when the pair are joined by Willie's horror story of a mother, who raises the bar for the gang's ambitions, while somehow lowering the standards of criminal behavior.",
  "releaseYear": "2016",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/xmsEwpA2fSq6IO3sfKrLuIPLHSc.jpg",
  "categories": {
    "plot": 4.375,
    "acting": 4.125,
    "ending": 5.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 5.409090909090909,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "7",
      "text": "As far as I can remember the first one, this one wasn't as good. I  mean it has the same concept and does not bring that much new to it. But it was still pretty funny if you don't mind a dirty joke or some dark humour in it. I mean if you don't like that type of stuff then it definitely isn't for you, so why bother? If you do, I think it is a decent movie."
    },
    {
      "rating": "6",
      "text": "Billy Bob Thornton re-teams with his crooked elf (Tony Cox) to knock off a Christmas charity. Toss in a return of the rotund, clueless kid (Brett Kelly), plus a mean mom (Kathy Bates) and a lovely lady (Christina Hendricks, who is surprisingly raunchy). Not much has changed since the original, except that they're trying even harder to be cruel, crude and offensive. The obscenities permeate every line and the mean-spirited approach dominates. Many of the insults are funny, while just as many aren't. The abusive attitudes wear thin and sometimes they're just trying to see how mean or gross they can be. Still, it manages to amuse those who like their comedy twisted and vulgar (just in time for the holidays!)."
    },
    {
      "rating": "7",
      "text": "Despite advertising to the contrary, Bad Santa 2 is not bigger, badder, or funnier than the previous film. In fact, this time they went too far and broke the cardinal rule of comedy. The film goes too far to be as raunchy and funny as the first film, that unfortunately it goes from funny to stupid and by the end, it becomes a farce of itself. In the sequel to this classic comedy, Willie (Billy Bob Thornton) is just as broke and drunk as he ever was, and this time he's saddled with a twenty-one year old Thurman Merman (Brett Kelly), who just won't leave him alone. Just when he thinks things can't get any worse, his old pal Marcus (Tony Cox) is released from prison, and has a job that promises to make them all rich. A reluctant Willie agrees, only to find out the place they are going to hit, employs his worst nightmare, his mother. I was hoping this film would be even half as good as the first one and it certainly does have it's moments, especially when Brett Kelly is involved, but overall this movie just isn't that funny. I don't know if it's because they put it all on the table in the first film and the jokes were just all done, or if it tried too hard, but the laughs just didn't come as easily. I mean how many times can Willie curse at a kid on his lap or make short jokes about Marcus? At least it wasn't just the same film with different names and places, but the jokes are similar, the personalities have changed very little, and I really didn't laugh as much as I hoped that I would. Bad Santa 2, wasn't a bad movie, maybe I was just spoiled by the pure genius of the first film, but I really didn't think it was anything more than your ordinary run of the mill comedy. There is nothing extraordinary about this one, sorry folks."
    },
    {
      "rating": "3",
      "text": "This 13-year gap means that we were expecting such a film to be great, especially whenever it comes to Thornton's character stealing the show back in 2003. Only this time around, he manages to have a bit of changes because not only Bad Santa 2 manages to fill the lump of coal this early, it also manages to be naughty terrible for a combined reasons why."
    },
    {
      "rating": "2",
      "text": "Not much to laugh about here it's just a overly crude overly dumb mess.  The first film while crude had a sharp scathing sense of humor.  This film just throws a sex joke then a racist joke then a handicap joke at the wall and very little sticks.  By the way Thurman is one of the most annoying characters of the year.  D"
    },
    {
      "rating": "8",
      "text": "Deutsche Review - KritikDer folgende Test ist in 5 Kategorien zusammengefasst. Diese 5 Kartegorien ergeben die Gesamtpunktzahl von 0 - 100 Punkten. Um einen passenden Userscore zu geben wird auf oder abgerundet. Bei 84 Punkten ergibt das einen User Score von 8. Bei 86 einen von Userscore von 9. Falls eine 85 kommt entscheide ich ob ich es eher positiv oder negativ nehme. Regeln verstanden?Dann sind hier meine Punkte.Mein persönlicher Score = 78/100Mein User Score = 8/10Lohnenswert? = Ja!Fortsetzung erwünscht? = Sehr gerne."
    },
    {
      "rating": "2",
      "text": "The very few bits that I found funny through out the run time do not justify seeing it at all. It's a nostalgia trip that does nothing to even come close to the epic original, Which is a Christmas classic imo. It's a needless sequel that should have happened much sooner than it did and by the time it came out, No one cared."
    },
    {
      "rating": "4",
      "text": "Bad Santa 2 gains laughs and chuckles whilst you're watching it, but once it's over it's almost instantly forgettable. The parts the made you laugh - erased from your mind."
    },
    {
      "rating": "6",
      "text": "The return of the bad Santa!I did not expect this sequel, especially not after 13 years. Even the first film has been just a good for me. I won't say it was an unnecessary follow up. They retained main cast, well, only lead two plus the boy who is now in his early 20s. A similar pattern storyline. If you have already seen the previous one, you would know what to expect from it, but not how much and that was the main issue with this. So anyone would predict the scenes, as well as the twist. Like most of the sequels, it indeed weakened. Though somewhat enjoyable for the good performances.R rated comedy. That's another advantage for the grownup audience. But if you aren't a fan of that thematic, then it is even worse than what it's rated everywhere. The length was good, a simple plot, yet the characters had not seriously developed, particularly the new ones. The big excuse was it is a comedy film. They all just came in and straight away displayed whatever they were up to as if we knew them very well. Despite an average film, it can be watched once, even if you liked or not the first part. And it is mainly because of Billy Bob Thornton.6/10"
    },
    {
      "rating": "7",
      "text": "Whether or not you'll like BS2 can be best predicted by how you felt about the first. If you liked the first you'll like this one. If you haven't seen the first then rent it and decide if you want to see this one.Just don't expect over-the-top of anything...which is why I liked the first. He's a bad Santa not Jackass-The Santa.I enjoyed it for what it is."
    },
    {
      "rating": "4",
      "text": "The year 2003 gave me two of my favorite christmas comedies of all time, \"Bad Santa\" and \"Elf\". Still love them dearly but this year it's time to experience \"Bad Santa 2\" where the binge-drinking self-hating good-for-nothing lowlife played by Billy Bob Thornton is ready to don Santa's costume again because there still money to be stolen and the world to be hated upon. Also back: his only friend, the fat kid (Brett Kelly, adult now) and midget sidekick (Tony Cox, probably the only person you will have some sympathy for in this feel bad comedy). The new face is Kathy Bates as his mother who looks pretty cool with cheap tattoos and all the trailerpark charm you can eat with your eyes. But her role is pretty boring and one-note relying heavily on swearing all the time, which also sums up the whole movie pretty accurately.The problem with \"Bad Santa 2\" is that it lacks all the atmosphere, heart, flow and sense of style the first part has. I mean, the first one isn't perfect but is so much more there, more alive.The sequel is still watchable thanks to all the talented actors ready to play it nasty (including \"Mad Men's\" Christina Hendricks). And it has a clear structure and story whereas recent unnecessary hit comedy tend to just lurch around aimlessly in search of some inspiration or reason to exist. Take \"Zoolander 2\", \"Anchorman 2\", or \"Horrible Bosses 2\" for example.But \"Bad Santa 2\" will grow old quickly. It just tries too damn hard to make up for all its weaknesses by aiming for the throne of the lewdest, foulest, nastiest comedy of its class. Luckily, it's achieved mostly by talking and not showing ugly genitals and body partys. Although I gotta admit, the last sketch in hospital – the scrotum pics – gave me some of my best heart-felt laughs from the whole movie.But the language of the characters... yuck. I have got nothing against swearing or sex-related jokes all in the name of comedy, but there's clearly a limit of how much one can take. It just grows old and at some point, the viewer will just endure. Which also makes enjoying the whole experience more difficult. For me, this point came somewhere between the first 20-30 minutes. The characters are just so foul-mouthed! It’s just non-stop filth, if one can quote the main character from the comedy series \"Hello Ladies\", complaining about his wheelchaired buddy.All in all, \"Bad Santa 2\" is purely fan service, aiming to repeat what made its predecessor great but failing along the way. It's not a lost cause completely but honestly, you are better off by just watching the first movie again.For the plus side, the actors are taking it seriously, not just calling it in, as they say. Brett Kelly even gained weight to reprise the role as a fat kid. I don't quite understand the level of his commitment, it could have been done by make-up and effects, but OK."
    },
    {
      "rating": "6",
      "text": "If you liked the style of humor in the first one...you will probably like this one as well (but its not as good as the first.)  It's less funny, and basically just is a look into the characters lives about 5 years later with some similar  gags, but enough of a unique story to keep you interested somewhat.  Not a great film, but not terrible, so..if you liked the original I suppose its an OK sequel.  I enjoyed it as a christmas comedy as there are not many."
    }
  ],
  "recommendations": [
    "neighbors_2_sorority_rising",
    "night_at_the_museum",
    "little_fockers",
    "bad_santa",
    "the_change_up",
    "ted",
    "step_brothers",
    "knocked_up",
    "ted_2",
    "the_happytime_murders",
    "old_school",
    "neighbors",
    "dirty_grandpa",
    "the_three_stooges",
    "a_million_ways_to_die_in_the_west",
    "thunder_force",
    "paul_blart_mall_cop",
    "superbad",
    "jackass_presents_bad_grandpa",
    "what_happens_in_vegas",
    "the_hangover_part_ii",
    "rough_night",
    "diary_of_a_wimpy_kid_the_long_haul",
    "hall_pass",
    "a_bad_moms_christmas"
  ]
}