{"id": 3288, "title": "Bad Times at the El Royale", "starring": ["Jeff Bridges", "Cynthia Erivo"], "runtime": 141, "genre": ["Thriller", "Drama", "Mystery", "Crime"], "description": "Lake Tahoe, 1969. Seven strangers, each one with a secret to bury, meet at El Royale, a decadent motel with a dark past. In the course of a fateful night, everyone will have one last shot at redemption.", "releaseYear": "2018", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/iNtFgXqXPRMkm1QO8CHn5sHfUgE.jpg", "categories": {"plot": 5.938461538461539, "acting": 6.089285714285714, "ending": 5.75, "soundtrack": 6.833333333333333, "cinematography": 6.0, "familyFriendly": 3.0, "funny": 7.666666666666667, "action": 6.2}, "reviews": [{"rating": "6", "text": "There is reason to believe that “Bad Times” could have been a very good film. The contained, isolated setting (think “The Shining”) is worthy: a stylish mid-century motel, once a haven for gamblers and the Rat Pack, and the site, as it turns out, of perverse activity. The motel is empty as the film opens, its gambling license gone, its only employee the meek Miles Miller (Lewis Pullman).“Bad Times” has other virtues. Like Quentin Tarantino’s 1994 “Pulp Fiction,” it employs time as a creative device, moving between past and present in clever and revealing ways. “Bad Times” even has a theme, an idea that runs through it from beginning to end. That theme is choice, and it’s introduced early on, when Miles explains to the new arrivals that the El Royale sits on the border between California and Nevada, and that the guests can choose a room in either state—“hope and opportunity to the East, warmth and sunshine to the West”–descriptions that seem to reverse the state stereotypes and ironize the idea of informed choice. There's mayhem at the end. Not everyone dies, but there’s enough killing to vitiate the strengths and subtleties of “Bad Times”—that is, to damage what could have been a very good film."}, {"rating": "2", "text": "Tries hard to be hip and suspenseful but fails miserably at both. Pace is really slow with an insane run time of 2h 20 min it's a chore to watch through (took me two evenings actually). There's a few ok scenes and Jeff Bridges saves what he can, but not enough to make it worthwile. If you want to see something similar, watch Identity (2003) instead."}, {"rating": "6", "text": "Bad Times at the El Royale by the beginning raises high expectations. Looks at first glance the film as Identity only without the charm thriller and in the antourage of the 60s. The plot is as if served with cliffs, the characters do not have time to reveal, the ending is predictable and unambiguous. An absolutely grey film that tries to turn something interesting is Chris Hemsworth 's acting"}, {"rating": "3", "text": "This one gets you in with a nice Intro, look and feel...well, for about 30mins or so, but what follows just about defies description or deserves any credence. All the ingredients of today’s consumer moviemaking are there IE; add a pinch of Cohen Bros, large dollops of Tarantino, and Scorsese, stir and watch the money roll in – but guess what, it didn’t happen. Often when you see that a movie was produced, written and directed by the same person (Drew Goddard - with the family as associates) you would be right to feel uneasy – there have been the odd times when this can work well, but that’s all too often rare. I doubt this mess would exist if the maker hadn’t paid for it himself, still, he only stood to lose his own money (and did). Some good performances are wasted along with neat set decoration and stylish cinematography, while the viewer gets to be bludgeoned over the head with wall to wall sadistic violence, crude language, plus a ridiculous and rambling script (like 2hrs 21mins!). As for Aussie Chris Hemsworth, he gets to make a fool of himself with a hedonistic performance as a deranged Manson type killer in a loser of a movie (better think twice next time Chris) Those who enjoy seeing the same, now clichéd stories, and impossible characters rolled out in movie after movie, will find some sick enjoyment but most, as the box office returns show, will leave the room very disappointed."}, {"rating": "8", "text": "OK, I went into this movie with NO expectations and didn't know much about it (outside of a few actors who were starring). I really enjoyed it! I'm guessing that's because I had no pre-conceptions, and saw professional reviews had been mixed. Laughed a few times, was startled a few times, and left the theater thinking about/discussing the movie and characters. As I'm writing this, I'm realizing this is exactly the type of movie I go to the movies for! Well done :)"}, {"rating": "7", "text": "El Royale has an undeniably beautiful look, strong cast performances, and a story that- while convoluted a bit- does keep you invested and trying to piece things together. There are, without a doubt, the makings of a great movie and yet it feels just short. I don't know if it's the lack of more memorable personalities and stronger dialogue. Maybe it was because I kept trying to shake off the Tarantino vibe the whole time. Or maybe it was because it is a film that, while good, isn't unique."}, {"rating": "0", "text": "Very long dialogues that are not relevant , it doesnt get interesting , it is predictable and lame , it doesn’t give any satisfaction towards the endOh man this movie is extremely boring , don’t waste your 2 hrs on thisBetter to watch any Low budget shorter mistery movie than this ,oh man what a disappointment :("}, {"rating": "10", "text": "This is a great noir film set in the late 60’s. It has some great performances especially from Cynthia Ervio and Jeff Bridges. I highly recommend Bad Times at the El Royale the way the film is set up reminds me of someone Quentin Tarantino would do and that is a high compliment. If you haven’t seen it yet I suggest you do yourself the favor and watch it. The film might be over 2 hours long, but it is well worth it. Also it has a really good soundtrack. With some laughs, excellent  suspense, and great performances you can’t go wrong and have a Good Time watching Bad Times at the El Royale"}, {"rating": "3", "text": "It was a Tarantino Want-A-Be in ‘Pulp Fiction’ style though seriously lacking camera-work and too long, shortened 40 minutes at least might have saved the film, the first hour and a half interesting then simply cramped-out with horrible script especially with Hemsworth frustrating to the point thinking I’ll shoot myself asking what Goddard was thinking, or probably not because the ending was like most of the characters; dead."}, {"rating": "6", "text": "Starts really good,and somwhere in middle loses momentum and becoming boring and tedious. Also to much flashbacks."}, {"rating": "2", "text": "2 hrs and 21 minutes is way too long. Some excruciating long dialogue scenes panning back and forth between 2 characters with absolutely nothing happening. Cut 50 minutes out of this film. Spice up the dialogue and put original music in place of oldies and you have a real good film."}, {"rating": "8", "text": "Who knows what this movie is? I heard that some critics likened Drew Goddard’s work to that of Quentin Tarantino. I don’t think so. I think Goddard’s style is totally his own, and the film was a lot of fun, dragging in all sorts of cultural artifacts – like cults and shell shock – all elements in a search for the “gold” (the spoils of the robbery that kicked the plot off). The cast was great, and totally believable, which is not easy in such an absurdist film where everyone was caught in a kind of sharply constructed and directed cultural maze. Reality starts things off, but then everything goes cockeyed. I had a great time."}, {"rating": "0", "text": "Bad rip off of Quentin Tarantino films, not even close. It is an old Hollywood trick. They find out some one is making a period film about the Manson family and attempts to beat them to the gate and steal the thunder. Trash."}, {"rating": "10", "text": "I'll echo another reviewer, this is a crafted movie. The acting is superb. Great cinematography. The plot moves. What a treat that Cynthia Erivo sings in the movie, she has to be the best voice on earth right now. The soundtrack for this movie was outstanding. I plan to see it again in theaters, partly for the soundtrack and that Jon Hamm monologue, but mostly to be able to enjoy the movie while also remembering to breathe."}, {"rating": "6", "text": "Most people are using the word Tarantino a lot and for good reason as Drew Goddard attempts to dabble in those waters with the results being mixed. All the performances are strong and I commend the films spirit and originality but I found myself underwhelmed as the dialogue is not nearly as sharp as a Tarantino film and the story lacks the punch to put you fully on board. Overall a middle to high 6 a B-."}, {"rating": "8", "text": "Visually interesting and almost hypnotic at times - this is a fun and engaging film with a strange who-done-it feel. Clever, atmospheric and surprising but maybe a little soft in the third act - the shocks and twists might have been more confronting.  The flashbacks certainly give depth and value and ultimately help with the various redemptions.  Overall very enjoyable with some brilliant photography."}, {"rating": "8", "text": "Drew Goddard has done it again bringing an entertaining Tarantinoesque noir/suspense film.This is a really well executed. Goddard does a great job of leading the viewer. There are some impressive visual shots in this, including one big reveal near the beginning that kept me captivated for every second. No lodger is who they initially appear to be and the script does a great job of jumping backward and forward in time as information is revealed little by little. Excellent cast all across the board. Dialogue is pretty slick and funny at points. Though the standout of the film may be the actual El Royale hotel itself. All credit should be given to the designers. It is a perfectly orchestrated distillation of sixties nostalgia. (I didn't even know there was a time when hotels could have a main building with a room or rooms, and adjoining motel units. Neat.) There are only a few people there because its the off-season and the hotel's popularity had declined. The brightness and cleanliness of the place also offers an unsettling coldness when contrasted with the lack of life.Admittedly the third act isn't quite as strong as the first two. It is a solid finale but once most of the reveals happen it gets easier to predict how things will transpire. Also, the movie excels in its execution but once once its all said and done the film is a mash-up of similar elements from several modern crime/thriller/noir films.This is one of those films where I don't know if you need to watch it at full price in the theater, but I do highly recommend that you catch it at some point."}, {"rating": "8", "text": "Saw the trailers and was really excited because I didn't know what it was about. You can't really explain this movie without spoiling it, and the best way to explain it really is to say that the El Royale is a messed up hotel with a bunch of secrets, and everyone brings their problems there. All the problems connect and build on each other to cause some major consequences. Very violent, very long, but it has some really good scenes. The performances were great, especially Jeff Bridges, parts of the movie were very intense and creepy, smart writing by Mr. Goddard. Some scenes with dialogue went on for a bit too long, showing how extensive the movie wanted to be. Still enjoyed it a lot, great twists, had no idea what was coming in this movie, which was great."}, {"rating": "10", "text": "A wonderful crafted film!  Truly a secret masterpiece that did have quite a few turns I did not expect.  The trailer did not spoil anything really, and I highly suggest that you don't watch any to keep everything a surprise.  The film plays out from several perspectives and is akin to a play-like style.  Definitely worth the admission price."}, {"rating": "6", "text": "Good times until the mystery man shows up.  Little random \"twists\" in the backgrounds of the characters were enjoyable (aside from the dull-as only-minority.  give your minority character more action than just a token/idol).  But when the movie tried to string all the random subplots into a cohesive movie, boy does it fall apart.  The people responsible for the plot just don't have the chops to do it.  So expect a cluster-f mess, predictable ending, and a deus ex machina to get from the mess to the ending."}, {"rating": "7", "text": "In many ways, \"Bad Times At The El Royale\" embodies a lot of the good and bad to be found in writer/director \"passion projects.\" There's definitely a lot to chew on throughout as an audience member, and the story itself is accompanied by a respectable amount of impressive images and performances as well. But it's a little too self-indulgent and showy for my tastes. This usually comes about when a writer/director gets their first shot at finally making a movie that they have 100% control over the creative process for, ultimately leading to them not killing enough of their proverbial darlings for the audience's convenience. Whether or not this is exactly what happened, it certainly feels like it."}, {"rating": "5", "text": "'Bad Times at the El Royale' is fiendish and dark, not to mention a very sly movie that I'm sure many film-lovers will absolutely enjoy. But for me, there was a lack of spark, I admired the film's somewhat originality and its diverse range of characters. But overall, the film feels flat and rather underwhelming not to mention that I felt it takes too long to get to the point. The first characters we meet are Father Daniel Flynn (Jeff Bridges) a priest who checks into the hotel alongside another guest Darlene Sweet (Cynthia Ervo), a soul singer who is currently struggling in the industry to make the career she had hoped for. The hotel is currently placed right in the middle of California and Nevada with the structure split into two halves and contain two different themes. We meet Salesman Seymour Sullivan (Jon Hamm), who also checks into the hotel with its only employee Miles Miller (Lewis Pullman) and the last guest to arrive is Emily Summerspring (Dakota Johnson), they all book their rooms and we see the different stories each character experiences. The movie spends a lot of the time building on these different character arcs and showing us what they get up to. It's broken up into different chapters with each event affecting that of another character's. Every story is the same, but told from a different point of view, and everything seems to add up once we get a bigger picture of what's going on. I would mention that Chris Hemsworth is in this movie, but I cannot discuss what his role is without spoiling it too much, what I can say is; the movie does pick up slightly the moment his character comes to play. Writer and director Drew Goddard ('The Cabin in the Woods' and writer of 'The Martian') has structured a movie I'm sure he's waited to make for so long. He knows what characters he wants to see and he knows what story he wants to tell and how to tell it. I liked the puzzle piece style of storytelling that he was able to craft here, I guess what really placed this movie in the gutter for me was the lengthy run-time of 141 minutes as well as my overall indifference to any of the characters. It felt gimmicky from time to time, and I think that, had Goddard got straight to the point, I would have enjoyed myself a little bit more. I admire his ambition and craft, but was underwhelmed by the overly ambitious result."}, {"rating": "9", "text": "What a surprisingly great movie.  The styling is top notch, casting, directing, acting, and just the whole production is a throwback to a grander Hollywood.  I can't recommend this picture enough."}, {"rating": "7", "text": "A highly stylized heist/thriller, Bad Times At The El Royale is a movie that feels familiar, but remains entertaining and fresh all the same. The cinematography is very impressive, as is the direction. There is not a weak link in the cast, and Cynthia Erivo shines in particular. The script is definitely the weak part of this movie. It's definitely heavily influenced by Quentin Tarantino, but the consistency is not there. The first act is incredible, the second act is boring, and the final act is predictable. However, this is a fun Saturday night thriller."}, {"rating": "8", "text": "I’ve heard people call this movie one with inspiration from Tarantino, with which I completely agree. That’s probably why I like it so much, I’m a huge Tarantino fan. It reminds most of probably ‘Pulp Fiction’ if the general idea was taken even further then it that movie. I’m not saying this movie is better than ‘Pulp Fiction’, by the way, I’m saying it’s the same sort of idea that ‘Pulp Fiction’ toyed with. There are a lot more parallels between this movie a Tarantino movie. Great characters, great visuals, great dialogue, a ton of unnecessary violence, and the movie is even split into chapters, but sadly, I don’t think that aspect was executed very well. Usually, when a movie is split into chapters, it focuses on one character, one storyline, or just one thing in each. In this movie, it feels like they just put the title card into there for no real reason for a few of them. It works for the chapters starring Jon Hamm’s character (forgot the name), Miles, and Billy Lee. Otherwise, not really. I heard a few people complain that the plot doesn’t move fast enough because they keep showing the same scene over and over again just from different perspectives. I noticed that, and I see that it’s a big flaw of the movie, but it didn’t really distract me or ruin my enjoyment in any way. All the acting was really good except for Dakota Johnson. I personally don’t think she’s a great actress in general, and she wasn’t great in this movie. The scenery and visuals were great, I loved that they show what time it is through almost exclusively visuals and music. It’s very interesting. I liked pretty much everything. In the end, a lot of things work, but some things feel out of place or just done poorly. Despite that fact, I still highly recommend this movie."}, {"rating": "6", "text": "It's not clear what kind of movie this wants to be. It feels like a Tarantino wannabe on slow motion without the snappy banter or extreme violence. What's left is the back stories of a group of people who checked into this unusual hotel and how they converge for dark outcomes. The cast includes Jeff Bridges, Jon Hamm, Dakota Johnson and Chris Hemsworth (who makes the experience worthwhile by strutting around semi-shirtless for an extended period). Having patience as the disappointing plot unfolds doesn't pay off with a shocker. It's attractively shot and interesting, but ultimately a long disappointment (2:20). Two newish actors turn in the most interesting performances: The woman who plays the singer (Cynthia Erivo)and the man who plays the hotel clerk (Lewis Pullman). NOTE: He's the son of actor Bill Pullman."}, {"rating": "7", "text": "This turned out to be a pretty fun film with a solid all-star cast that included the likes of the legendary Jeff Bridges, Dakota Johnson, Jon Hamm, and Chris Hemsworth to name a few. In addition, it provided great action and Tarantino vibes-a-plenty! Overall, there's not a whole lot else to it other than that, so just sit back, relax, and have fun with it like I did!"}, {"rating": "6", "text": "Bad Times at the El Royale is a cleverly written film that takes it's time to get to the meat of it's story but, that is just fine. In a culture that demands fast and mindless films BT@TER is refreshing. Granted it isn't the most expertly crafted film you can see in theaters but, it certainly gives enough of a **** and, is overall pretty good."}, {"rating": "5", "text": "Derivative, predictable, and dullFollowing the genre-bending and extremely funny The Cabin in the Woods (2011), Bad Times at the El Royale is the second feature from writer/director Drew Goddard, and is a similarly stylised cine-literate genre mash-up. However, whereas in Cabin, the twist upon twist upon twist had a cumulative effect, with the story getting better the longer it went on, in Bad Times it's a case of ever diminishing returns. By the time we reach the end of the lengthy 141-minute runtime, with everything and everyone shoehorned into neatly explained niches, the film has been shorn of its vitality, leaving one with an overriding impression of \"meh\". If Cabin was a genuinely new spin on a clichéd old story, playing with and subverting genre at every turn, Bad Times is singularly unable to free itself from the most oppressively derivative of its generic constraints.Set in 1969, the film takes place almost entirely in the titular El Royale Hotel (obviously inspired by the Cal Neva Lodge & Casino). Over the course of one night, seven people will encounter one another but not all seven will leave. There's Fr. Daniel Flynn (Jeff Bridges), a Catholic priest; Darlene Sweet (Cynthia Erivo), a singer travelling to a job she doesn't want; Emily (Dakota Johnson), an intensely private woman; Laramie Seymour Sullivan (Jon Hamm), a vacuum cleaner salesman; Rose (Cailee Spaeny), who appears to be Emily's kidnap victim; Billy Lee (Chris Hemsworth), a cult leader; and Miles Miller (Lewis Pullman), the motel's receptionist/bellhop. As the night wears on, it becomes apparent that not only are few of these people who they claim to be, but the motel itself is hiding its own dark secrets.If that set-up reminds you a little of Identity (2003), you're not completely off course. Bad Times shares very similar DNA, at least up to the point where Identity goes totally nuts; both are set in an out-of-the-way motel where a group of strangers are trapped overnight, and all, or some of them aren't who they appear, with the audience slowly filled in on their backstories via flashbacks. However, whereas Identity failed because the last half-hour is patently ridiculous, Bad Times has the exact opposite problem - the conclusion is decidedly underwhelming, with the last twenty minutes or so lapsing into utter mundanity, and, most unforgivably for a mystery film, twists for twist's sake.To start on a positive note though, it looks terrific - Seamus McGarvey's cinematography is faultless, whilst Martin Whist's production design is superb, with the ultra-tacky period detail dripping off the screen. Directorally, Goddard also has his moments with some eye-catching compositions, locked-off cameras, POV shots, and lengthy single-take Steadicam sequences, with the long single-shot opening scene, in particular, a masterclass in slow-burning tension. The problem is that the scene is so good, it spoils the audience, establishing a tone to which the rest of the film mostly fails to live up.In direct contrast to the opening, the ending is both narratively and directorally formulaic, predicable, and trite, with the least compelling and well fleshed out character taking centre stage, mano-a-mano good guy/bad guy dialogue aplenty, and even a ludicrous shoot-out. The whole thing smacks of \"been there, seen that a million times.\" Another problem is that the characters all feel like archetypes ripped from other films, with none giving the impression of having any degree of interiority. They are, in essence, walking plot-points.A final problem which must be discussed is length. Padded, and massively self-indulgent, there is enough narrative content to barely fill 90 minutes. With this runtime and so little content, needless to say, the bottom falls out entirely during the middle section, as things become unrelentingly slow and contrived. Goddard seems to equate curiosity about who the characters are with suspense, meaning things take a decided turn for the mundane long before the underwhelming dénouement. And when he finally does get around to wrapping things up, the last few twists are nowhere near enough of a reward, with the mysteries more interesting than the explanations.The film flirts with a few themes (redemption, forgiveness, karma, political corruption, the seductive nature of power), but none get off the starting grid, and ultimately, Bad Times isn't really about anything. Attempting to both subvert and celebrate generic conventions, Goddard seems to think he has a bonafide epic on his hands, a portent piece of celluloid mastery which imparts valuable lessons in the process. He doesn't. It's more self-indulgent folly than paean of universal truth."}, {"rating": "6", "text": "Not enough Jon Hamm. This film means well and could have been really great but scene were very hit and miss."}, {"rating": "7", "text": "The story was missing something near the end.  Perhaps it needed a meddling cop -ala Die Hard- researching the Malibu murders or maybe hunting for the lost money .  Or at the very least make the roll of film more important, like \"do you want to escape alive but with nothing, or try to get the money, or try to get the roll of film?\"  But overall it's a great adult movie w/ Tarantino-esque story crossovers."}, {"rating": "5", "text": "the lies and deceits are more chilling than the confession itself..Bad Times At The El RoyaleGoddard's crime drama is more Tarantino-isc than it is Polanski-ish. In its initial stages it may come off as \"The Hateful Eight\", but the euphoric energy quickly wears off as the amateurly edited sub-plots interfere poorly. The sweet moments where it sweeps away the charm is when the scene is about to transition. It somehow feels obliged to gut punch the viewers everytime before doing so, and in those moments, the makers create their long lasting impact. This revealing natured script is more shady and edgy than it is disclosing. The writing is gripping since it focuses only on astoundingly high pitched dramatic sequences that is written with fluid conversations. Now these well choreographed conversations is aware of the final vision and hence is a borderline risk throughout the course which is how Goddard keeps its thrill alive. The characteristics of each characters and the props or the set pieces, everything is utilized to its best on the narration, they hold you much more than the trick itself, since the silence that builds up to the scare is comparing more intense. The camera work is manually handled and is up close to the viewers that offers it the aspired personal touch especially when Hamm in the beginning discovers the entire structure of the hotel. Bridges is the real deal in this snidy hotel. Not only his character has the range to fuel this entire more than two hours of journey, but his riveting performance is jaw dropping and moving at times. The lies and deceits are more chilling than the confession itself. Erivo's performance unfortunately doesn't justify the strength that the character is given, she seems distracted and at times amateur too. Similarly, Johnson too falls short on delivering the anticipated uncertainty that her character is brimmed with. And as much as slick and easy Hemsworth is on putting on this character and literally taking off his clothes, he fails on giving the scares to his actors and the audience. Supporting Bridges thoroughly, is Hamm in his blatant and firm portrayal. Goddard's core strength that was this mixture of plethora of emotions and opinionated hot heads floating around, also evolves to be its weakness by the end. The adaptive grippiness that he had achieved by ping-ponging the ball from one room to the other, makes him obliged to follow the semantics throughout the course for the sake of the closure. And it backfires vigorously since the obviousness overpowers its potential to be a compelling storyteller. So now, when he wishes to be focused on one and only one track, the missing traffic on the other lane isn't feasible. The ruggedness of the gunpowder, the smell of the forsaken money and the taste of the innocent blood, this essence of the early 70's crime drama is what amps up the charge. Bad Times At The El Royale actually comes with a good time guarantee card, but if flipped and searched under the layers, you better book some other hotel."}, {"rating": "6", "text": "Pulpy fun up to a point. The El Royale guests are all fleshed out incredibly well with interesting backstories and the jump to all their differing perspectives was something I really quite enjoyed - with wonderful performances to match, especially from Cynthia Erivo. Hemsworth’s cultist villain lacks this exposition, but Billy Lee still makes for an interesting antagonist. The cinematography is slick and the music elevates the era in which it’s set. Unfortunately, the film is so drawn out. While you’ll still be interested in what’s happening, you’ll be pulling out your phone to check the time. And when the climax comes, it doesn’t hit you like it should - you’ll just know that it’s over soon. Some plot elements go unanswered, but the twists, turns, and the mystery surrounding the characters and the El Royale made it worthwhile. (Xavier Dolan’s British accent tho)."}, {"rating": "6", "text": "Bad Time at the El Royale is trying to be a Tarantino film. There, I said it, the one thing that was on my mind the entire length of the film. Imagine \"The Hateful Eight\" but instead of a cold cabin in the middle of a snowstorm and eight strangers with something to hide, imagine a cold motel in the middle of a thunderstorm and 5 strangers with something to hide.... wow it really is just \"The Hateful Eight\" in another era. But don't let that stop you watching the film. While it tries to be a Tarantino film, it lacks dialogue that flows, it chooses the wrong time to change the mood, and it has pacing issues especially in the final two acts of the film. While the dialogue isn't great, at times I could see that the actors were trying their best to make the most out of it. There really isn't a main character, with the story jumping perspective throughout the film. This at times is done really well, with the first two acts being non-linear (another Tarantino trait) however, in the final act, in the last 30 minutes of the film, a character is given more backstory which seems to come out of nowhere and feels like it's been thrown into the story to make another plot point. I could rant about it all day, but I'll leave it because I'll be getting into spoilers. So overall the characters have some interesting backstory, and all have something to hide or be ashamed of. Cynthia Erivo is the stand out for me. Also Chris Hemsworth's antagonist reminded me of Joseph Seed (Far Cry 5) with a lot more crazy in him. I think he was an interesting character but, I wish was used and developed more. But not all is bad, the music, was used tremendously throughout most of the film. The only negative was that at times I felt the music didn't fit the scene but often the camera work would pull me back in. Because visually the film is amazing, the cinematography was on point, starting with symmetrical framing and ending with a noir film look and feel while the lighting starts neutral it again takes on a film noir look. Sadly, the visuals don't save the film it from its plot and structure. With many plot point going unsolved or just forgotten, and many instances where the pacing changes because they want to add another subplot to the already congested main story. Yet, I enjoyed watching it but because it kept going and going, I slowly lost interest. (sorry to bring it back to the plot, I really didn't enjoy the structure of the film.) I still think it's worth a watch. It has the body of a Tarantino film, making it enjoyable even if it's long. But it doesn't have the soul of a Tarantino film. TL; DR: The weak structure of the film and the not so great dialogue would pull me out, but I'd find myself going \"wow that looks cool\" So well done Drew Goddard."}, {"rating": "0", "text": "Absolute trash.How they could butcher a movie this badly with this cast is beyond me.I knew nothing about this movie before I watched it.It is 101 lesson on how to waste talent.Its a poor man's Hateful Eight or Identity.Bad Times is horrifically bad and a huge waste of the viewers time.I spent the whole movie waiting for something good to happen.Hated it, absolutely hated it."}, {"rating": "8", "text": "A little slow here and there until it climaxed towards the ending. Old man Bridges seems to get better with time. Great acting. And the Black lady can Blow (sing!) I enjoyed this movie."}, {"rating": "7", "text": "Not bad, not great. It was pretty good. We liked it. Good acting, Chris Hemsworth is always easy on the eyes and what a part he played."}, {"rating": "5", "text": "Pretty mediocre and loooooooong winded Tarantino wannabee.   It meanders a bunch, has far too many shots of someone signing, and doesn't really have any point or purpose.  Style over substance.  Fun set piece and has the makings of a premise.  Solid performances by most.  I give it 57.6 out of 100."}, {"rating": "10", "text": "I just need to jump in on these reviews because I really loved this movie! I didn't know a whole lot, had just seen the trailer. However, if you have a little patience and a little appreciation for the influences on this movie, and the time period that it deftly reflects (still awfully relevant) it stays fun and thriller-noir-y. The acting was great, and even though the movie was long it did not bother me one bit. I loved the time and attention that was given to the story. I loved the pop references, the California(Nevada) kitsch vibe, the storytelling, and again, the acting! It was great- just after all this ADD storytelling we have, amp up your patience just a tad, I guess. (I had no problem with this)"}, {"rating": "8", "text": "I enjoyed this movie a lot, mainly because of the characters, acting, and cinematography. The plot was also gripping enough to keep your attention and was not predictable. Reminded me of a Tarantino or Coen Brother film. Very entertaining."}, {"rating": "8", "text": "Fairly enjoyable and wellshot film from the director of \"The Cabin in The Woods\". Overall wonderful performances and feels tonally similar to \"Once Upon a Time in Hollywood\" though obviously released a year earlier."}, {"rating": "7", "text": "With violent surprises, beautiful cinematography, and stellar acting, \"Bad Times at the El Royale\" is a supremely satisfying original from director Drew Goddard."}, {"rating": "7", "text": "Bad Times at the El Royale is an ensemble mystery character movie set around a seedy hotel circa 1970's sporting a decent screenplay with some occasionally brilliant cinematography and interesting back story told through flashbacks. Feels somewhat 'tarantino esque' exception being the odd casting choice with Chris Hemsworth doing his impression of Gary Oldmans  classic 'unhinged threat bit'....really took me out of the story... Overall though the AAA talented cast deliver memorable performances. Got the feeling a cast of unknowns would've taken things to another level for me personally. Its a decent movie worth a look."}, {"rating": "5", "text": "I wanted to like the movie but it just doesn’t work. The first third of the movie is intriguing when you’re learning all of the characters and they’re all tear your motive’s. After that it starts to lose its luster and meander. The last third it goes off the cliff to an unsatisfying end."}, {"rating": "7", "text": "This is a well-done film and I might've given it an 8 except for two things:  1) I don't like musicals.  I hate them.  \"Bad Times\" is no musical, but it spends a lot of time lingering on musical intervals, and, 2) Bringing some crazy into a film is fine if it's done with some humor, but when crazy is arrogant too it just ticks me off.The story here is all about the El Royale and how people come to be there.  We are treated to several flashbacks which illuminate the present.  We find out who is who and what is what and pretty much it all makes sense, though there are a few scenes in which characters get by through sheer luck.Someone somewhere compared this film to the work of Tarantino and I guess the comparison feels right.  \"Bad Times\" is odd, it will keep you guessing.  The jump shocks will likely catch you off guard.  If a little blood doesn't bother you then by all means give this film a try."}, {"rating": "10", "text": "It's really tough for me to dish out a 10 rating and since there is no 9.5, I had to come to grips that this movie was the best I have watched this year. So let's just say this is this year's 10. It captivated the audience throughout with a mixture of comedy & suspense. Let's just say I haven't flinched in my seat since the inaugural release of Jaws until now. Jeff Bridges is outstanding as was the rest of the supporting cast. MOVIE OF THE YEAR"}, {"rating": "8", "text": "I did not have big expectations for this, but it turn out quite interesting and unpredictable, which made it quite enjoyable. It has some fine actors too in it."}, {"rating": "9", "text": "This extremely well-crafted movie is not told in the usual linear fashion.  Instead it alternates points of view to tell the complete and engrossing tale of several patrons at the El Royale hotel.  It's a bit confusing at first, but the style enhances the mysteries surrounding the characers and the ending richly rewards patient viewers.  Every character is believable and you feel like you're transported in time to observe the incredible events and history of the hotel and its patrons.  Overall, a very satisfying experience and well worth your time and money."}, {"rating": "10", "text": "Excellent movie! Great script, great acting. No weak link. Story line was unpredictable, creepy and misterious.....starts a tad slow but got interesting very soon. The writing is so good that it keeps you engaged. You will not be disappointed."}, {"rating": "7", "text": "\"Bad Times at the El Royale\" is a neo-noir thriller movie set in the late '60s/early '70s. It's the kind of movie where several characters are by chance present in the same place, right when something happens that entails all of them.This movie's got great acting and production values, a nice soundtrack of the '60s, and each major character has a touching backstory. Unfortunately the main plot (despite the twists and turns) is hardly original. You have already seen this kind of movie a dozen times before. And this is what makes this movie just good, but not great.\"Bad Times at the El Royale\" is enjoyable for what it is, but it's not memorable either. If you want a more modern approach to this classic thriller genre, you'd better watch movies such as Quentin Tarantino's \"The Hateful Eight\"."}], "recommendations": ["good_time", "reminiscence", "terminal", "tenet", "broken_city", "cube", "10_cloverfield_lane", "now_you_see_me", "shutter_island", "blackhat", "gone_girl", "sicario_day_of_the_soldado", "hanna", "hugo", "no_sudden_move", "beckett", "the_equalizer_2", "the_accountant", "the_snowman", "a_cure_for_wellness", "a_quiet_place_part_ii", "inherent_vice", "red_sparrow", "rocknrolla", "drive"]}