{
  "id": 589,
  "title": "Bambi",
  "starring": [
    "Donnie Dunagan",
    "Peter Behn"
  ],
  "runtime": 70,
  "genre": [
    "Animation",
    "Drama",
    "Family"
  ],
  "description": "Bambi's tale unfolds from season to season as the young prince of the forest learns about life, love, and friends.",
  "releaseYear": "1942",
  "mpaaRating": "G",
  "imageUrl": "https://image.tmdb.org/t/p/w500/wV9e2y4myJ4KMFsyFfWYcUOawyK.jpg",
  "categories": {
    "plot": 8.045454545454545,
    "acting": 8.666666666666666,
    "ending": 8.5,
    "soundtrack": 8.666666666666666,
    "cinematography": 5.0,
    "familyFriendly": 9.25,
    "funny": 9.5,
    "action": 8.0
  },
  "reviews": [
    {
      "rating": "9",
      "text": "Bambi is a great movie, not as great as previous Disney movies like Dumbo or Pinocchio which are, without exaggeration, two of the best animated movies ever made. The reason of why I don't think Bambi is as great, is its story. The biggest flaw is that the story didn't seem to have a point, we go from one plot to another and I know that the general plot its about Bambi's journey in growing up and facing the dangers of the forest, but the movie didn't seem to really have a clear goal.You might say that this was a movie from 1942 but movies like Snow White, Dumbo and Pinocchio were already out and those movies have plots with a point, unlike Bambi, where, honestly seemed like it was a completely different movie from the second half to the end. The tragic events in Bambi's life don't really seemed to affect him by the end of the movie.Regardless, everything else is stunning. With some incredible animation, specially character animation, a great score and pretty much everything in the technical aspect it's almost flawless and shows that tons of effort was put in all those aspects.Overall, great movie that could've been an animated masterpiece if the story was better."
    },
    {
      "rating": "10",
      "text": "знаете... даже курт кобейн назвал свою песню в честь фильма бемби... правда она называлась babmi слаугтер... но это уже другое))"
    },
    {
      "rating": "10",
      "text": "Bambi is short, but I don't care, because so was Dumbo, which is also very sad but beautiful, however I have always preferred Bambi despite the fact I could really empathise with Dumbo. Bambi is a gem, and overshadowed slightly by the flawless Beauty and the Beast and the stunning Lion King. This classic is right up there with the greats, and was coincidentally Walt Disney's personal favourite. The animation is unparallelled. Those shots of the forest at the beginning were just extraordinary, and it was so colourful and stylised. Another plus was the orchestral score which was so beautiful, that alone reduced me to tears. It matched the animation beautifully, which seldom happens in animation. The characters were both funny and touching, and the story simple and timeless. I laughed so much at Thumper, when he was teaching Bambi to speak. Bambi was great to watch too and so adorable, and I was among the majority who cried when his mother died, because this film was so educational thanks to her. The animals as adolescents aren't quite as appealing as when they were children, but Bambi and Faline's romance was one of the character highlights. The best aspect for me, was that they made the enemy so mysterious. We hear about them, and see what they do, but we don't see them face to face. That is what made the characters so appealing to the audience. This is one of the few films, where you care for everybody you are introduced to. In conclusion, a funny and ever-touching underrated classic. 10/10. Bethany Cox"
    },
    {
      "rating": "10",
      "text": "Bambi is one of those movies that'll get you in the happy mood just like in Snow White and the Seven Dwarfs. The music score doesn't even sound the same like the others Disney movies maybe because they just wanted to make the music sound so different, I mean the songs are beautiful don't get me wrong. But the only thing I have here is the scary music, I mean I like it but don't you think it's too scary for kids? (chuckles) So, the main reason I said this because there's a villian called Man and you never see him, all he did is shoot the animals ESPECIALLY Bambi's mom and there is a fire spreading all over the forest. The twitterpated scene where friend owl told Bambi and friends all about it. I even saw Grim from The Grim Adventures of Billy and Mandy doing that as well, How fascinating is that? Anyways, thanks for your advice. Enjoy this movie and you will be much obliged."
    },
    {
      "rating": "10",
      "text": "TerrificBambi is a film that really shows how damn dark Disney can get with the scene where I think you quite obviously know what I’m talking about.."
    },
    {
      "rating": "8",
      "text": "Growing Tall And Strong.BambiDisney's palatial tale of a young deer emitting warmth in this cold hard land is a symphony sung over the ages for its ingenuity. A drama so mature and sincere that it challenges its older audience to be at their best end of intellectual state and also is a packet of firecrackers for the younger audience. And it is not that it jubilants the younger viewers through breathtaking visuals, stunning locations and adorable picturization of the animal lifestyle. But draws their attention with speaking their tongue of frailty on terms of knowledge and the newer concept that takes time to sink in, like every time when the Rabbit takes things too far and his mother reminds him of his father's advice.Tiny notions like such is where this meticulous script grows stronger, from experiencing the first rain to testing the surface of a snow, all these encounters with a nature is a witty way to characterize the characters. As far as animation is concerned, it never has been so powerful and skillful for a vivid storytelling to melt down its viewers on the very right spot. The first act is pretty much the firsts of everything, as mentioned, the thrills of visiting new creatures or speaking or walking for the first time.And the second act explores the bonding between him and his mother with training and stories that can be traced back to mythology, where the last act offers our protagonist to stretch his muscles and prove his brave persona with a fight against nature whom he has been devouring since he was a kid. Bambi, a tale weaved out so far from now and yet remains so close to all of us, is a testament to the sheer brilliance of the narration that was clearly ahead of its time."
    },
    {
      "rating": "6",
      "text": "Throughout my childhood, I never had the opportunity to see this film, partly because it was never my first choice among the films I could choose. Now, as an adult, I decided to see it. The story is very lightly based on a tale about Bambi, a deer who will go through several adventures until he manages to become Prince of the Forest, like his father. The original narrative is, it must be said, much more adult, with betrayals, murders and violence. Of course, Walt Disney stripped it of all that content and turned it into a heartwarming children's story of growth and maturation. It is undoubtedly a good movie, but for its characteristics and sensibility it has been neglected by parents when the task is to find a good movie for their boy children. There is some prejudice here to be fought.There is no way to deny this film the status of a classic. It has been a companion to more than a generation of kids, one of those movies that kids can see but that parents, grandparents and great-grandparents also saw when they were kids too. It is also one of the films that marks the golden age of Disney Studios and the advent of animated, colorful and brilliantly executed cinema. I think most people will agree that, even so, the movie loses favors for other films, like \"Snow White\", \"Pinocchio\" or the much more recent \"Lion King\". This happens, in my perspective, because of the lack of a story to tell: the film has such a sparse and simplistic narrative that it is difficult to handle a feature film, and there are several sequences and scenes that seem to be there simply to occupy spaces and length, and looking cute.The film features a series of characters, overwhelmingly friendly to the audience and children, starting with the trio of friends Bambi, Tumper and Flower. The biggest problem I felt with these characters is Flower's more than clear sexual ambivalence, being one of the Disney characters where this is most evident: it's clearly a male who has a female name and behaves like a girl, in addition to seem to have a romantic interest in Bambi. Consequences, perhaps, of a time when accepting homosexuality was something that was absolutely out of the question. Bambi's father is a dark, distant figure, and the mother is caring and touching, his death being - I'm not spoiling, everyone knows this is one of the most intense and dramatic moments in the film - perhaps one of the moments in that Disney turned out to be more adult in its early days. The villain, the human, is left out, but we see what he does to nature.Technically, the film is masterful. The animation is wonderfully well done and is even more praiseworthy when we think that everything was hand drawn and colored, without any digital resources or gimmicks. The safe line, the smooth way in which the scenes follow each other, the confidence with which Disney prepared this film of his are lessons to learn for anyone who wants to make an animated film. The soundtrack also suits the film very well, with the use of off-camera singers, that is, songs that are not sung by the film's characters, something new and refreshing for the films the studio made at this time."
    },
    {
      "rating": "9",
      "text": "How does Disney do this good! This has got to be known as atleast one of Disney's greatest films of ALL TIME."
    },
    {
      "rating": "10",
      "text": "Bambi is an allegory on life. From birth to Adult hood. It so perfectly captures the personalities of newborns and their interaction with those of similar age and the beauty and evil that the world will throw at you. From kids saying almost rude stuff and their parents teaching them how to be civil, even though to them its not rude and coming from a place far from malicious. The film even cutely captures the first breath of life and how such young babies perceive the world. It beautifully makes the audience scared of what Bambi the doe is scared of too, even though its nothing to be afraid of. It wonderfully shows how Bambi comes to accept the world and learn danger from friend, love from rival, and so on. This coming of age tale has many tropes as such aiming at the subtle lessons of growing up. The film also excellently achieves a naturalistic feel of the wild animals. It brilliantly makes you empathize with the fauna. Nothing more highlights this than the fear of danger and the movements of the Deer. Thunder roars and everyone is quiet and nonchalant but Bambi, Bambi is frantic. You could almost imagine a real doe hiding under their mother, or perhaps even your dog cowering under the couch. You get a glimpse at their perspective and empathize through Bambi. This fundamentally is what makes a good child's movie. The ability to empathize and learn. A child too learns with Bambi to not be afraid. A child learns through Bambi what perhaps their dog might be feeling. A child learns through Bambi loss, love and loyalty. The deers also perk up and twizzle their ears to the faint sounds of danger while, with the audience, trying to decide if indeed it is danger. A common thing deers do yes but brilliantly makes you see why, and ultimately empathize. This is why the movie is a fantastic kids movie ultimately. It is great at making you empathize. Almost too much. The only downfall of this, and this is totally just me maybe seeing too much with a political lens. Is its anti hunting propaganda. The antagonist is \"man\". the faceless evil behind the fear of all animals. Whilst i wish perhaps man was just one danger instead of the sole reason of danger i can respect its decision to push the moral enigma of poaching. Its also worth noting the film is NEARLY 100 years old. So context may blur the lines of relate-ability as hunting laws today are in fact quite moral.Ultimately however, no film of recent times has made me cry as much, empathize as much, and hate man as much. Whilst the latter isn't particularly a convincing reason for a good kids movie you've got to admire its achievement in artistically representing such an evil. I may have under sold the over all mood of the film however by focusing on my only issue with it. The film is happy, and as a 19 year old male i haven't seen any movie teach me as much about growing up than this movie. In my eyes this movie is a fantastic coming of age film with clear cut chapters, great character writing and interaction, and teaches easy to understand lessons for kids and even some subtle underlying ones that even the mature audience can learn from.*was tempted to rate 9 because of the anti-man/anti-hunting propaganda but decided to give benefit of the doubt considering its from a different Era in the middle of WW2. Also whilst it may have distracted me a bit, the villain of \"Man\", altough faceless was much more well written than most villains.  It makes me almost hate man which is more than most villains achieve. You fear them. You loathe them. But even worse, you don't know them. When they're going to come. How they do hunt. They're an enigma. I've written a lot about this for such a very small portion of the movie, but theirs definitely a beautiful horror element i wish some films would learn from. But don't let my over analysis of a 5 minute villain distract you from not watching this. I thus give it a 10 as a \"contextual\" masterpiece."
    },
    {
      "rating": "7",
      "text": "whaaaaat! young Disney this is dark a dead mother a loss of a home and almost fillicide and i love it you really outdone your self my only complaint is that it goes from aw litte cute dear to Bambi's mom shes wahhhhhhhhhhhhhhhhhhhhhhhhhhhhhh! (if you get that reference then hello nurse) other wise its pretty good"
    },
    {
      "rating": "9",
      "text": "Bambi no tendrá la mejor historia de todos los tiempos. Sin embargo, lo que si tiene es un estilo artístico extremadamente bello, que va de la mano con los diseños y animación de los personajes. Una película simplemente hermosa y revolucionaria... Quiza haya algunas cosas que pulir en la historia, y cositas sin explicar, pero para ser hecha en los años 40 es impresionante. Otra película sobresaliente de Disney."
    },
    {
      "rating": "9",
      "text": "olid Snake returns in Metal Gear Solid 2: Substance, the expanded edition of Metal Gear Solid 2: Sons of Liberty with all-new game modes, hidden characters and storylines. Top-secret weapons technology is being mysteriously transported under cover of an oil tanker to an unknown destinatio"
    },
    {
      "rating": "0",
      "text": "Thank god the mother died, or I would have to do it myself. It's a shame we couldn't see Bambi's head mounted on a wall! Bye bye Bambi!"
    },
    {
      "rating": "7",
      "text": "You know looking back at it, I saw some **** up **** when I was a kid holy hell."
    }
  ],
  "recommendations": [
    "brave",
    "the_iron_giant",
    "the_water_horse",
    "a_monster_calls",
    "brother_bear",
    "finding_nemo",
    "song_of_the_sea",
    "luca",
    "where_the_wild_things_are",
    "kubo_and_the_two_strings",
    "smallfoot",
    "the_polar_express",
    "the_good_dinosaur",
    "moana",
    "the_little_prince",
    "the_land_before_time",
    "your_name",
    "alpha",
    "mulan",
    "the_lion_king",
    "okja",
    "soul",
    "the_willoughbys",
    "stand_by_me_doraemon_2",
    "raya_and_the_last_dragon"
  ]
}