{
  "id": 4550,
  "title": "Barbershop: The Next Cut",
  "starring": [
    "Ice Cube",
    "Cedric the Entertainer"
  ],
  "runtime": 112,
  "genre": [
    "Comedy",
    "Drama"
  ],
  "description": "To survive harsh economic times, Calvin and Angie have merged the barbershop and beauty salon into one business. The days of male bonding are gone as Eddie and the crew must now contend with sassy female co-workers and spirited clientele. As the battle of the sexes rages on, a different kind of conflict has taken over Chicago. Crime and gangs are on the rise, leaving Calvin worried about the fate of his son. Together, the friends come up with a bold plan to take back their beloved neighborhood.",
  "releaseYear": "2016",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/9mwzidlGgWfr2hcMWUKM86lOqdo.jpg",
  "categories": {
    "plot": 4.625,
    "acting": 6.352941176470588,
    "ending": 5.333333333333333,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 6.0,
    "funny": 6.130434782608695,
    "action": 6.333333333333333
  },
  "reviews": [
    {
      "rating": "0",
      "text": "Nicki Minaj spoiled this film................. Eve save this film. Nicki Minaj is awful actress........ I wanted to puke, when watched scenes with her."
    },
    {
      "rating": "2",
      "text": "Even though the film had one good actor \"Ice Cube\", but I didn't recognize any other actor/actress in the movie. Also I didn't laugh one time and it becomes incredibly racist and stereotypical dialogue. I guess since I'm not African American I didn't get some of the jokes. It seems when blacks are racist it's okay."
    },
    {
      "rating": "0",
      "text": "THE WORST STEREOTYPED BULL I'VE EVER SEEN ON SCREEN. IT WAS SO AWFUL. WHY. WHY DOES THIS EXIST. WHO THINKS THIS IS WHAT ACTING IS? WHO THINKS THIS IS WHAT WRITING A MOVIE IS SUPPOSED TO LOOK LIKE? WHAT EDITOR SAW THIS AND THOUGHT \"YUP THAT'S A GOOD MOVIE\" ??? I CAN'T EVEN RIGHT NOW. BURN IT. BURN IT WITH FIRE. ITS AS IF A 5-YEAR OLD'S UNDERSTANDING OF DIFFERENT PLAYED-OUT TV TROPES PLAYED OUT ON SCREEN IN FRONT OF ME, BUT TEN TIMES WORSE THAN THAT. DO NOT RECOMMEND. WOULD NOT BAND. 0/10"
    },
    {
      "rating": "0",
      "text": "Bad movie Nicki Minaj has the worst performance of the whole movie and without a doubt the most boring role."
    },
    {
      "rating": "0",
      "text": "Gang violence and the thug/drug culture in any city is an important topic.  However, this movie is a little too racist and takes away from the message.  Racism of any type is not comedy and the undertones of victimization at hands of \"the man\" took away from the real opportunity to tell a story here.  The \"comedy\" in this movie was not very funny either."
    },
    {
      "rating": "0",
      "text": "Terrible movie. It starts with a totally artificial setting: Tons of people sitting around in a barbershop involved in non-stop clichee talk. How realistic is this?! It totally fails to capture your imagination. The dialogues are lame, transparent and obvious, hitting cliche after cliche. You can guess the ending as soon as they start talking. The actors' characters are stereotypical. An utterly unintelligent movie. We went to this movie open minded, but decided to walk out after 30 min. It was a boring waste of time and an insult to human intelligence."
    },
    {
      "rating": "7",
      "text": "It's really a companion piece to Spike Lee's Chiraq from earlier this year, though funnier.  Common is great in it, as is Ice Cube.  Nikki Minaj can really act - thought she was great in The Other Woman - not quite as strong in this.  But in general, it's well worth the 2 hours."
    },
    {
      "rating": "8",
      "text": "When Barbershop came out in 2002, I felt it was a great comedy, because it was hilarious, and it had a great message, so naturally a belated sequel excited me. The cast from the old film is gone, except for Ice Cube and Cedric the Entertainer, who are back. Barbershop: The Next Cut is funny, contains a heartwarming message, and features a lot more depth than many would expect from a comedy. It should be noted now, I do feel that the original Barbershop was a better all around film.\rBarbershop: The Next Cut as a comedy alone, isn’t hilarious but is quite funny, and will have a few good moments of laughter, but nothing truly hilarious. From the comedy perspective, one character helps keep these films funny, and that’s Cedric the Entertainer. Unfortunately, I watched the film comparing it to the original, and the original was clearly funnier, as the focus in “The Next Cut” was not on the comedy as much. The only problem with that is that in Barbershop the film was so funny, that when it switched to being serious, those moments resonated with the audience, where in this film they don’t resonate as much.\rThe film does try to be serious quite often, which isn’t a surprise, and in fact is one of the best elements of the film. However you take the message, it’s a good message, and putting a message that we can all agree upon in a comedy makes it even better. The film does a really great job reflecting on the community structure of today, ironically though the message, while directed at poverty stricken places, isn’t limited exclusively to one of place or group of people, we all can learn from this movie.\rAs happened with Barbershop in 2002, “The Next Cut” has an unexpected amount of emotional depth. It’s refreshing in the climate of modern comedies, where many of them are mechanical, that a comedy can show so much depth. The Next Cut, much like it’s predecessor is able to be both funny and serious, making the moments when it is serious even more powerful. It’s also nice to see a group with so much chemistry that they feel and look like a real community, so when they fight it feels real.\rIn the end Barbershop: The Next Cut is a really good comedy film, that does exactly what comedy should do, makes you laugh and teaches you life lessons along the way. The film is both funny, and emotional, which is really refreshing when some comedies are neither. The only thing for those who love the original Barbershop is that “The Next Cut”, in my opinion, is not quite as good, but is extremely close. For anybody that wants a good relaxing time at the theater, this movie is a perfect choice."
    },
    {
      "rating": "8",
      "text": "The most amazing part about Barbershop: The Next Cut, is that it tells a very serious message while keeping the viewers entertained. The film is truly a cut above."
    },
    {
      "rating": "8",
      "text": "A pleasant surprise!\rBarbershop: The Next Cut legitimately floored me; this is a heartfelt and relentlessly entertaining film.  It's not just a film about black people's barbershops and salons, this is a movie that has a lot to say about gang violence, thug culture, racism, etc.  Even the acting is fantastic; Ice Cube and Nikki Minaj seemed like a recipe for disaster, but they're some of the best performances from the two that i've ever seen.  Granted, the comedy in the movie isn't the best, considering it may offend some people who are sensitive to this kind of subject matter.  However, the end result was a movie that was relentlessly entertaining, made with tons of heart, and overall fun to watch.  Would I put it at some of the best comedies i've ever seen? I wouldn't say that, and I wouldn't recommend it to those who dislike the subjects brought up in the film, but still, this next installment in the Barbershop series is a solid comedy.\r Barbershop: The Next Cut gets an 8/10."
    },
    {
      "rating": "6",
      "text": "Wow, this comedy sequel just turned out lucky in front of critics, but not in front of my face when I make this review. Ice Cube and the rest of his crew are back for some more cutting as the Next Cut begins to make its way to 'cut' all of us in their very own 'barbershop'. Seems enjoyable at some point, but can't find its own way to enjoy a fresh cut."
    },
    {
      "rating": "10",
      "text": "A pleasant surprise from Ice Cube and Co. The comedy is great, the acting is awesome (Especially from Cedric the Entertainer) I gotta say, the critics got this one right, Barbershop: The Next Cut will leave a smile on your face and a warm place in your heart."
    },
    {
      "rating": "10",
      "text": "never have I ever been so surprised about these kind of movies being good. I went in with super low expectations and came out of the theater enthralled. The Barbershop series has never really been known for its drama side of the tale, but Cedric the Entertainer and Ice Cube blew me away in this movie. I dont want to spoil anything because you absolutely need to experience this movie while its in theaters."
    },
    {
      "rating": "10",
      "text": "wow, Im absolutely blown away on how great this movie was. Ice Cube really hit it out of the park with this one! I can definitely see this as an oscar contender for best supporting actor for Cedric the entertainer. His performance was so heartfelt and magnificent. I would definitely recommend this one!"
    },
    {
      "rating": "8",
      "text": "You know, You feel like you're expecting the same as other movies, but Barbershop: The Next Cut has something special and it actually turns out to be a great movie, that is if you give it a chance. Ice Cube did an amazing job on being the lead role along with the others like Common and Cedric The Entertainer. I have my personal opinion on Nicki Minaj but that doesn't matter. This is a hell of a good sequel and it's also a great movie itself."
    },
    {
      "rating": "2",
      "text": "If you believe the advertising for this 3rd installment in the series, you'd be expecting plenty of laughter. Not the case. Although there are a few genuinely funny moments (mostly provided by Cedric the Entertainer's crusty comments), the feel-good aspects have given way to personal drama and political statements. Calvin’s Barbershop has added a women's section, which could have allowed for plenty of sassy repartee, but it's mostly about women's issues. On top of that, their hood's crime-ridden environment leads to much ado about gangs, murder and violence...none of it amusing. Instead of being loaded with laffs, this serious sequel is burdened by messages. There are some cool clothes."
    },
    {
      "rating": "4",
      "text": "Barbershop: The Next Cut, not only was it not a comedy for me but it does not even focus on the real situations going on in the streets. It turns real life situations into comical scenes."
    },
    {
      "rating": "5",
      "text": "It was an ok movie, but didn't really provide anything new, plus I was kind of annoyed with Nicki Minaj's character. There were some funny jokes, there was a message they wanted to send to watchers, but the whole story itself wasn't that exciting"
    },
    {
      "rating": "10",
      "text": "A movie with a genuinely strong message that any film goer will enjoy. I’d say it’s a more emotional barbershop film, nothing wrong with a little realism. I enjoyed it! Humor was decent but I wasn’t expecting it to be over the top funny."
    },
    {
      "rating": "8",
      "text": "Barbershop is funny, is exciting, has a message that we all should listen and, overall, is a great movie. Nevertheless, putting Nicky Minaj and Common in the movie was an error and not bringing Michael Ealy(Ricky from the first 2 movies) was also an error(and the only reason why I am not giving a 10 to this movie)"
    },
    {
      "rating": "6",
      "text": "The first Barbershop was a classic. I guess like Friday they had a good success so they had to ruin it by making unnecessary sequals. The message behind the the 3th Barbershop might have been a good one (gang violence) but it didn't save the movie. It felt (as with Friday) that they had succes with the first one so they continue making sequels without a good nor funny story (but with famous people) for as long as they can earn money on it. I was disappointed. Most of the actors were bad and most of the conversations in the Barbershop were boring (same old song) ..."
    },
    {
      "rating": "6",
      "text": "Cube is getting the bigger cut and he never takes it for granted, just like the world he revolves around, the chemistry is off the hook.Barbershop: The Next CutLee knows it is the White House party of the parties. Everybody would want to be in it and everyone would want to have a big chunk of that cake. And offering them enough space to come in and present their show as they feel, the director, Malcolm D. Lee is rearranging the shuffled acts into one big discussion. Yes. Discussion is what the film feels like. And to be honest, it is a fair discussion, swooping in every opinion and perspective and idea and even a politically wrong comment. This is how honest, they are, they mock so arrogantly and accepts the insults and repercussions bravely.In fact, the very first act is it. Ticking for almost the first half, the discussions are the best part of the film, it starts off from fighting over the equality, they find themselves tangled in a long chain, ping pong-ing back and forth, spewing and biting each other trying to prove their superiority sarcastically. The referential comedy is turned to 11. To someone who doesn't come from that background, would get definitely difficult to grab the momentum of the humor.Another major improvement is scoffing off the limitations that their previous installments had, correcting themselves politically and going toe-to-toe with the generations, the pace has improved and sensitive content juiced up. Ice Cube is still the sober worker in this shop and Cedric still the most drunk one, no new character coming in with their fresh humorous vocab could beat Cedric's comic timing, he has been in their chair for more than a decade ago and that throne is well earned. Barbershop: The Next Cut may feel like the cut that you have been getting over the years, it's just that they have used the wave of the current media into account that will make you feel like you are new, once again."
    },
    {
      "rating": "0",
      "text": "Horrendous movie, lack of commitment from Nicki Minaj as an actress and poor development of ideas, xoxo."
    },
    {
      "rating": "10",
      "text": "Nicki Minai added such a fun spark of excitement to the movie. I was impressed by her performance as well the the movie overall!"
    },
    {
      "rating": "10",
      "text": "Best film eveeeeeer Nicki Minaj queen of rap periodt............................"
    }
  ]
}