{"id": 4879, "title": "Barnyard", "starring": ["Kevin James", "Courteney Cox"], "runtime": 90, "genre": ["Animation", "Comedy", "Family"], "description": "When the farmer's away, all the animals play, and sing, and dance. Eventually, though, someone has to step in and run things, a responsibility that ends up going to Otis, a carefree cow.", "releaseYear": "2006", "mpaaRating": "PG", "imageUrl": "https://image.tmdb.org/t/p/w500/qlSCUmrflADYlCMbkviJjfujhTH.jpg", "categories": {"plot": 5.0588235294117645, "acting": 6.928571428571429, "ending": 5.0, "soundtrack": 3.0, "cinematography": 5.0, "familyFriendly": 7.833333333333333, "funny": 8.5, "action": 5.0}, "reviews": [{"rating": "8", "text": "Insanely good, but I have no exact idea about the hate on this movie. Nickelodeon actually tried to make it work and they did it alright... they did quite enough and it was a genius trip to actually hilarious comedy that actually works."}, {"rating": "10", "text": "Why the heck this animation has so many low scores? For me it's fun, interesting and perfect for any age! Great story, fun and unique characters and emotional scenes... 10/10"}, {"rating": "3", "text": "Barnyard is a cow patty.\rThe entire film is animated stupidity. The storyline is little to non existent, nearly every character is unlikeable, and the entire premise feels unnatural."}, {"rating": "10", "text": "This movie is awesome! Otis is my funniest and favorite character in the entire film!\r When will this ever get its own spin-off sequel?! It has been 7 years since the movie was last released and still no sequel!"}, {"rating": "9", "text": "Why the heck this animation has so many low scores? For me it's a great Lion King parody! Great story, fun and unique characters and emotional scenes... 9/10"}, {"rating": "8", "text": "A very fun and funny movie to watch."}, {"rating": "2", "text": "Another movie that assumes we only enjoy seeing something we've all seen before. Entirely unoriginal. I thought that some of the art direction was beautiful (moon over the meadow or the scrap yard), but the character animation was total garbage, especially the two male (!) cows. I go to see the new CGI movies to see the latest and greatest the technology has to offer, but this movie took a few steps backwards. Cars characters looked amazing, almost real, it amazed me throughout (even though it was sloooow). Not the same case here. Some bits are pretty funny, but overall; boring, repetetive, been-there, done-that. We'lll have to wait for Flushed Away to see something original. Don't waste your time or money. We don't need a Barnyard 2."}, {"rating": "2", "text": "Not appropriate for children. My 1st comment when watching the movie was \"hey\" why do the male cows have udders - why weren't the 2 main characters bulls?? I didn't like the movie and don't think it's for kids."}, {"rating": "5", "text": "This cartoon will entertain the young children and was generally okay. Even the male cows had utters which was weird and wrong. There are scenes both at the \"bar\" and in a driving sequence which seem to promote drinking and are rather inappropriate. Overall it did have decent, although unoriginal, messages. I would not pay for my family to see this at the theatre, maybe rent it as it won't take long for this to go to DVD."}, {"rating": "1", "text": "Not very funny, not even the children watching the moving laughed at all. The story took a long time to get going and is a very similar theme as many movies before it. They used male cows which don't exist. It woiuld have made more sense if the \"male\" cows were bulls and leave the cows as they are female. The music was okay the whole thing just was not entertaining at all."}, {"rating": "8", "text": "I thought this movie was adorable. It was light hearted and fun. It wasn't too long or slow like some kids movies these days and not too \"teachy\"; just a fun story."}, {"rating": "1", "text": "[***SPOILERS***] What were they thinking? Very bizarre themes for a"}, {"rating": "7", "text": "Funny movie. Better than I thought it would be. Didn't find it offensive for anyone. Good family movie"}, {"rating": "0", "text": "This movie was terrible--I wish I hadn't seen it and I wish I hadn't taken my four nieces to go see it. Aside from the biological mistakes and crude drawings, I felt like I had to \"debrief\" the children I went with about the horrifying stereotypes and poor decision making in the film [***SPOILERS***] (the animals steal, drink, joy ride, break and enter, behave violently, and do other things that are not cool--all presented in the film as harmless fun). The presentation of all rural folks as either uneducated/stupid, crazy, or alcoholic was anything but charming. For most parts of the film that were intended to be jokes, the theater filled with kids was silent. And this is sad, but being a knitter, the presentation of knitting was so inaccurate that it was actually irritating to watch."}, {"rating": "7", "text": "I expected it to be funny and witty. Though it did have it's moments this \"child\" movie was a little hard. It had drinking,gangs,breaking and entering, giving birth, kidnappings,beatings, joy-ridings. It was kinda funny and all in all it's OK"}, {"rating": "10", "text": "Fabulous kids movie. Very funny, moving without a hint of cheese. Fast paced with great use of music."}, {"rating": "9", "text": "This was a perfect movie to take our granddaughter to see. It was funny and entertaining. Cute storyline. It was refreshing to sit and be entertained without having to worry if something offensive was going to pop up!"}, {"rating": "6", "text": "not my favorite CGI movie, but hey. at least its just decent."}, {"rating": "8", "text": "Maybe I'm just having a good day giving this movie such a high score, but I really enjoyed it. I didn't know until recently that the weird TV series started as a movie, so I was curious, and while it's not as original as Flushed Away or as well animated as Shrek, essentially, it's few steps behind. This movie is neck and neck with Over the Hedge as the best animated film of 2006 in my opinion and some of the best talking animal movies I've seen. Not only does this movie put the fun back in being an independent farmer, but the main characters are very developed and memorable. The secondary characters, not as much."}, {"rating": "6", "text": "Believe it or not, \"Barnyard\" isn't the worst animated movie in existence! In fact, it's actually not even that bad! Sure, it came out in a Summer that was competitive for animated films and probably suffered from the glut of films, but it was still relatively entertaining. Occasionally charming, considerably funny and featuring some pretty solid characters, \"Barnyard\" is a considerably decent film. Sure, it's nothing amazing, but if you have kids, they might like it."}, {"rating": "10", "text": "Actually is one of the best movies I ever see in my life.Otis is a good dude and Biggie cheese. Mr.bombastic was really the point of this movie10/10 is a Masterpiece"}, {"rating": "4", "text": "Barnyard escasamentee was fun for 25 minutes very boring rest , but who cares about that , this movie was for children of transition , but this genre of animation, was discredited , until they released an animated series."}, {"rating": "4", "text": "It should have just stayed in the background as this movie has dumb animation, story, humor, and overall quality. While the begging isn't bad, it gets worse as it progesses."}, {"rating": "9", "text": "Insanely good, but I have no exact idea about the hate on this movie. Nickelodeon actually tried to make it work and they did it alright... they did quite enough and it was a genius trip to actually hilarious comedy that actually works."}, {"rating": "10", "text": "All of Barnyard is odd. Oddly funny much of the way, oddly serious when it makes room for the early death of a beloved character or the hushed birth of another, oddly musical with its melange of hip-hop and reggae and hard rock and bluegrass."}, {"rating": "9", "text": "Insanely good, but I have no exact idea about the hate on this movie. Nickelodeon actually tried to make it work and they did it alright... they did quite enough and it was a genius trip to actually hilarious comedy that actually works."}, {"rating": "9", "text": "Insanely good, but I have no exact idea about the hate on this movie. Nickelodeon actually tried to make it work and they did it alright... they did quite enough and it was a genius trip to actually hilarious comedy that actually works."}, {"rating": "8", "text": "Insanely good, but I have no exact idea about the hate on this movie. Nickelodeon actually tried to make it work and they did it alright... they did quite enough and it was a genius trip to actually hilarious comedy that actually works."}, {"rating": "9", "text": "Insanely good, but I have no exact idea about the hate on this movie. Nickelodeon actually tried to make it work and they did it alright... they did quite enough and it was a genius trip to actually hilarious comedy that actually works."}, {"rating": "9", "text": "Insanely good, but I have no exact idea about the hate on this movie. Nickelodeon actually tried to make it work and they did it alright... they did quite enough and it was a genius trip to actually hilarious comedy that actually works."}, {"rating": "9", "text": "Insanely good, but I have no exact idea about the hate on this movie. Nickelodeon actually tried to make it work and they did it alright... they did quite enough and it was a genius trip to actually hilarious comedy that actually works."}, {"rating": "7", "text": "A great animation. The story was better than I expected, and was actually memorable. I enjoyed the characters a lot. It was better than I expected, and worth a watch."}, {"rating": "5", "text": "Just Another Mediocre Kids FlickBarnyard isn’t awful, but it really doesn’t offer much for viewers above the age of 10. I will however say the Biggie Cheese memes are hilarious."}, {"rating": "2", "text": "Better than norm of the north, but still god awful. Some ironic goodness is really the only good thing."}, {"rating": "5", "text": "The movie is clearly not funny, the cast in the film are really doing there best in this I will give credit, the animation is meh, the story has a bit of a weak structure, there's really weak drama, and most of the characters have nothing happen to them making them really one dimensional. But the only thing I will agree that helps a little with watching it for god sack is the soundtrack, the music itself is outstandingly good, the rock to it is done very well as John Debney knows that even if it's a bad film, he can takes his free cash knowing he did his job right when everyone else feels like they know what to do but actually no."}, {"rating": "10", "text": "So, this film is a masterpiece of the 3d animations, it has a emotional view of the society and the relation of son and dad, it made me cry 2 times and this is hard."}, {"rating": "4", "text": "Biggie Cheese singing Mr. Bombastic is the best thing ever and also you can tell that this movie's aged very badly, when Otis is using a **** flip up phone."}, {"rating": "9", "text": "This is one of the greatest films ever. Brilliant plot, charming characters, smooth animation, memetastic andbeing a Nickolodeon movie, this is BRILLIANT!!!"}, {"rating": "4", "text": "I laughed. Obviously it was mediocre, ridiculous, and embarrassing. Although, I give props to Kevin and Koechner for their voice performance."}, {"rating": "10", "text": "Good Good Good Good Good Good Good Good Good Good Good Good Good Good Good Good"}], "recommendations": ["megamind", "minions", "peter_rabbit", "alvin_and_the_chipmunks", "hotel_transylvania", "monsters_vs_aliens", "the_spongebob_movie_sponge_out_of_water", "captain_underpants_the_first_epic_movie", "cloudy_with_a_chance_of_meatballs", "the_lego_movie", "ice_age_the_meltdown", "free_birds", "wonder_park", "hotel_transylvania_2", "zookeeper", "chicken_little", "alvin_and_the_chipmunks_chipwrecked", "despicable_me_2", "night_at_the_museum_battle_of_the_smithsonian", "the_green_hornet", "yogi_bear", "uglydolls", "spies_in_disguise", "the_nut_job", "the_smurfs"]}