{"id": 2514, "title": "Basic Instinct", "starring": ["Michael Douglas", "Sharon Stone"], "runtime": 127, "genre": ["Thriller", "Mystery"], "description": "A violent police detective investigates a brutal murder that might involve a manipulative and seductive novelist.", "releaseYear": "1992", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/76Ts0yoHk8kVQj9MMnoMixhRWoh.jpg", "categories": {"plot": 7.222222222222222, "acting": 8.625, "ending": 8.333333333333334, "soundtrack": 10.0, "cinematography": 10.0, "familyFriendly": 3.0, "funny": 9.0, "action": 7.8}, "reviews": [{"rating": "5", "text": "Here we have a typical erotic-thriller which works (Besides the plot holes, and the unbelievable actions some characters make), because Sharon Stone and Michael Douglas were looking good, and had some screen-chemistry. The script (while nothing special) creates enough tension to keep you watch the whole movie, but the ending is confusing and disappointing."}, {"rating": "3", "text": "not to good for the kids the guy at blockbuster down on 3rd said that it was a good movie and i watched it with my grandson.\rxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx"}, {"rating": "2", "text": "I felt like I was watching a porno, with the same production value and cheap plot. The sex scenes were entirely over the top, and the movie was extremely predictable. Pretty much a waste of 2 hours."}, {"rating": "10", "text": "Brilliantly crafted movie with beautiful cinematography and acting (except for Stone). This is a modern classic which deserves better credit than its reputation."}, {"rating": "8", "text": "A masterpiece of trash cinema. Over the top in every aspect, overacted, overheated, with gross characters with no redeeming qualities; but still, it's great fun, AND the most important thing, it doesn't take itself seriously."}, {"rating": "1", "text": "Another overrated film and it was all because of Sharon Stones snizz. Everything else was velveeta. If you were watching because of the story then you are taken for a ride that leads to nowhere. I was actually hoping for a atoryvto back up the damous muff scene. But alas.. nope."}, {"rating": "5", "text": "Basic instinct is just like watching porn. The characters are so stupid and the plot itself is horrible. It felt as if they just wanted to put nudity and sex in it so that they could make us watch people have sex. Well if you are into good movies. Don't see this one. Even Bad boys 2 is better. However if you are into boring, uninspired acting, mediocrity, and just down right bad. I recommend this to you."}, {"rating": "8", "text": "Basic Instinct. This film is directed by Paul Verhoeven who directs Robocop, Total Recall and Showgirls, which I haven't seen Showgirls because I know the film is originally rated NC-17 and they're right and it has too many nudity in the film which I've heard Roger Ebert saying that. He also directs Starship Troopers and Hollow Man. Paul Verhoeven is known for making sex and violence so realistically graphic. He's from Dutchland cause you can tell by his accent. Now Basic Instinct is sort of an Alfred Hitchcock film neo-noir erotic thriller where Michael Douglas's character, Nick Curran who is looking for a killer who killed Johnny Boz. He thinks that Catherine Tramell played by Sharon Stone and she knows everything and she knows anything before something will happen and claims that she didn't kill him because she liked having sex with him. She even been in an interrogation and she does an infamous scene where she uncrossed her legs and, shock alert, she's not wearing any underwear. Big shock, isn't it? Many people have watched it know that it will be shocking even I thought of it as well. The sex scenes are absolutely explicit and shocking, if not the shockiest. The opening scene after the opening credits where Johnny Box and an mysterious women having sex and the one that shocked me is that she stabs him with an icepick. That totally freaked me out! When I watched multiple times, I got over it. Yeah, nothing can go wrong when you watch something and you just get over it. If anyone including my mum had seen it before and know that the title Basic Instinct is memorable then this movie will be a complete polariser. Yeah, I think the third act is far fetched but the writing can't take away the story. If you are somewhat of a fan of this, then I suggest that you will f£$k like minks, raise rugrats and live happily ever after."}, {"rating": "10", "text": "It's really attacting and thrilling! but there is still something i can't get to know. Who is the moder? the shrink? or Cathrine?"}, {"rating": "2", "text": "Glossy trash with not a believable minute in it, \"Basic Instinct\" attracted customers who should have spent their money more wisely. The dance hall scene, so over the top, is a scream!"}, {"rating": "8", "text": "When a film is parodied as much as this one has been over the years, it can sometimes lessen any impact that it once had. Basic Instinct is not affected in the least by all the fun that's been poked at it, still retaining the intrigue and power that made it such a success upon its release.\r The twists and turns, mind games and misdirection are what really make this movie such a classic. There are few femme fatales as callous as Sharon Stone's Catherine Tramell and she plays the part with a chillingly cold precision. The film draws on a number of pictures that have gone before it for inspiration, but these aspects always feel like respectful homage, rather than wilful thievery. It's this combination that lends the plot a sense of timelessness, though the same can't necessarily be said for the style in which the material is approached. Having said that, there's surprisingly little in the way of content that feels painfully dated, which can sometimes be jarring in other flicks of the time.\r The original script apparently called for a much younger protagonist, but Douglas is not held back in the least by his advancing years (pushing fifty at the time of the film's release). His character's tragic past inflecting his attitude to life and difficulties relating to those around him. The incredibly insular nature of the man does much to accentuate the tightness of Tramell's hold over him, her unnerving skill in controlling others demonstrated to be unparalleled in stature.\r Whether or not the many graphic sex scenes that populate the picture are necessary in relating the narrative is debatable, but they do add an extra layer of depth to the motivations of the characters. Rather than being any kind of expression for those involved, the intimacy often serves as a means by which to manipulate partners into decisions and conclusions that further entangle them in a brilliantly twisted web of lies and deceit. It's a somewhat cynical take on relationships, but adds to the feeling that danger lies around every corner and choosing to trust more or less anyone could be a fatal mistake.\r For the most part, the murders themselves would not feel out of place in a slasher flick. Copious amounts of blood and an unflinching focus on the grisly details characterise the majority. This, along with the erotica and locations in which the action takes place, bring the seedier side of this fictional San Francisco to the fore. A constant supply of sex, drugs and alcohol seemingly on tap at all hours of the day."}, {"rating": "9", "text": "Controversy aside, in regards both to Sharon Stone's quintessentially-provocative noirish femme fatale (talk about a queen bee or alpha female!) and the backlash that the film portrayed lesbians as crazed psychos, Verhoeven both played a striking tribute to Sir Alfred Hitchcock, particularly San Francisco's based Vertigo and in use of the blonde bombshell, and simply continued his style of storytelling that had become his trademark in his pre-Hollywood, formative days in the Netherlands. Though it's not mentioned in the interviews of either star or director, the wonderful car chase brought to mind that 'other' car chase Frisco Bay movie, 'Bullitt'. But given the remarkable landscape of the area, why not? One would be a fool not to push the stylistic envelope as far as the censors will allow. A film that would have made The Master of Suspense proud, methinks, and one that he himself perhaps would have done, had Joe Eszterhas' very fun script been around, during, say, the time of 'Frenzy', when Hitchcock was at his cheekiest. A fantastic date movie too, by the way..."}, {"rating": "6", "text": "This movie is extremely dirty in some scenes.  Dirty enough in fact that the actors should be ashamed of being in them.  The rest of the movie however has been underrated.  It's not perfect.  There's some tedium after a while ,and the sex scenes are nearly pornographic, but it's a well shot, well acted, and occasionally atmospheric cop thriller.  Stone's Catherine Tramell is one of the most memorable and alluring femme fatales in cinematic history.  She's the centerpiece of the movie and she supports it ably.  It has a very good musical score, (Oscar nominated by the way), and overall it's somewhat memorable, but not good enough to be great.  However, by today's R standards it's definitely not the completely pornographic sex fest critics made it out to be.  Yes parts are pretty dirty, but it's mostly a crime mystery with a whole lot of plot, even if it could have been better."}, {"rating": "10", "text": "Basic Instinct broke new ground like no other thriller - it combined erotic, full-on action with great performances, sexy characters and a breath-taking soundtrack.  Verhoeven ramped up his in-your-face style with original cinematography using new and different camera angles which were confronting but always highly seductive.  Sharon Stone delivers an empowered performance unlike any female character seen before.  She is hot, sexy, beguiling and enticing, with occasional unexpected vulnerability. The film is visually attractive and, while slightly predictable, takes you on a fantastic ride right till the last minute.  Far and away the most powerful character is Jerry Goldsmith's brilliant, exceptional, original soundtrack - always reminding you of the risks and pleasures inherent in the storyline.  His music is complex, fresh and daring from the opening scene to the credits."}, {"rating": "7", "text": "This movie is made for one purpose: to entertain. It's a stroke novel come to the big screen, and it has the fair share of pornographic content (in fact, probably about 75% of the movie is just sex scenes or sexual activates). So, this movie is overacted, dramatic, unrealistic, and many more adjectives like that, but it succeeds at what it sets out to do."}, {"rating": "8", "text": "The mysterious Catherine Tramell (Sharon Stone), a beautiful crime novelist, becomes a suspect when she is linked to the brutal death of a rock star. Investigated by homicide detective Nick Curran (Michael Douglas), Catherine seduces him into an intense relationship. Meanwhile, the murder case becomes increasingly complicated when more seemingly connected deaths occur and Nick's psychologist and lover, Beth Garner (Jeanne Tripplehorn), appears to be another suspect. Unevenly echoing the work of Alfred Hitchcock, Basic Instinct contains a star-making performance from Sharon Stone but is ultimately undone by its problematic, overly lurid plot. But, still a fun ride. I'll give Basic Instinct a B+. (8.5/10)"}, {"rating": "7", "text": "A film that has received a mixed response over the years, Basic Instinct is a sleek, sexy, and thrilling, noir film that I believe deserves more respect than it has received over the years. While gory at times and featuring some majorly over the top sex scenes, this one has a riveting case at its center that really messes with your mind. Who did it? Did the detectives get it right? Did they get played? Ultimately, the correct answer may be a combination of things, but that fact makes this one a ton of fun to watch unfold. The writing here is quite strong, as is the direction. However, the best part of this film is Sharon Stone. In a role that uses her good looks to seduce both Michael Douglas' character and the audience, she is phenomenal here as she makes you believe her every word, even though you know she cannot be trusted. A porno with plot, Basic Instinct could have toned down its sex scenes without much of value being lost, but ignoring those, I really did enjoy this one a lot. Perfectly paced with a gripping murder case as its anchor, Basic Instinct is a good noir film that could have been great, but as is, it is still quite good."}, {"rating": "8", "text": "Me tardé años en ver esta película y valió la pena, sin ser una obra maestra es un verdadero clásico de la década de 1990 en donde lo que más destaca es la ferviente química entre Sharon Stone y Michael Douglas, pero realmente quien se lleva todo el peso de la cinta es Sharon de principio a fin."}, {"rating": "7", "text": "Good, sexy crime thriller. Yes it has the famous \"chair scene\", yes Sharon Stone was stunning.I like Verhoeven's works and I'm surprised that he can be effective in different genre:Total Recall, Robocop, Starship Troopers, Showgirls are all good and all films that were different from the movie masses when they came out"}, {"rating": "9", "text": "Provocateur, sulfureux, voyeur... sanglant également ce Basic Instinct et pas qu'un peu... autant dire du pur Verhoeven dans toute sa splendeur ! Mais ce n'est pas que cela : c'est aussi l'intuition du réalisateur batave que d'avoir vu le potentiel de noirceur de l'actrice Sharon Stone (alors fort peu connue), un potentiel déjà sensiblement effleuré dans Total Recall...Il a ici merveilleusement exploité sa duplicité dans un scénario taillé sur mesure pour l'élégante et belle blonde, tantôt glaciale, tantôt vulnérable, tantôt criminelle, tantôt victime ?... Le film joue ainsi d'une passionnante ambiguité jusqu'à la fin, laquelle d'ailleurs propose éventuellement deux fins, exactement l'une après l'autre mais sans avoir l'air d'y toucher. Même si à cet exercice, un examen en détail invalide l'une d'entre elles. Ou presque... on touche là les limites d'un scénario qui peine à faire le grand huit qu'il projetait.Très bien construit en tout cas, Basic Instinct multiplie les indices sur l'une ou l'autre piste, sur l'une ou l'autre femme, car si la blonde est provocante et cynique, la brune n'est tout de même pas nette et dissimule des accointances et quelques obsessions à tout le moins suspectes... une brune bien campée par une Jeanne Tripplehorn qui donne également de sa fort jolie personne.Le plus marrant dans tout ça concerne le rôle de Michael Douglas qui se retrouve en porte-à-faux de ces dames potentiellement amatrices de pic à glace et conséquemment en dindon de la farce à l'insu de son ignorance : le flic macho à tendance alcoolo est en effet un véritable petit inspecteur \"la bavure\" ou \"flingueur\" pour les intimes (et la presse) qui croit maîtriser la situation mais qui se fait balader comme un enfant ravi de la crèche.Du coup, le film de Verhoven n'en apparaît que plus féministe qu'un congrès de Femen par grand froid, les tétons au garde-à-vous. Paradoxal n'est-ce-pas ? Signalons enfin qu'outre son efficacité de thriller, le film s'avère d'un humour très étudié, produit de l'ironie habituellement cinglante du réalisateur hollandais. La mise en scène est soignée, agréablement fluide et la musique de Jerry Goldsmith se révèle parfaitement coller aux ambiances duplices ou tendues, ou plus ou moins ambigües... moins convaincante et trop criarde dans les moments d'action, hélas. Quoi qu'il en soit, on tient là l'un des tout meilleurs film de Paul Verhoeven, un film brillant qui ne sent pas le poids des ans."}, {"rating": "3", "text": "This movie revolves around the mysterious murder of a celebrity and the attempt to discover the killer. The main suspect is Catherine Tramell, a fiction writer who wrote a similar crime in a book. But she is intelligent and manipulative, as well as a sexual predator, and will not hesitate to seduce Detective Nick Curran. The film features the memorable interpretations of Michael Douglas and Sharon Stone, in the role that made her famous.The script is interesting but flawed and far from perfect. In fact, it has several plot holes, as the fact of completely ignoring DNA forensic evidence. The crime, moreover, loses importance throughout the film, as Tramell seduces Curran. In the end, nobody remembers the guy who died first. The hottest scenes are very choreographed, look spectacular and must have been very exciting by the time the film was released. Just remember the famous cross-legged scene, the most famous of the film and one of the rare occasions when an actress's vagina appears in a frontal scene with nothing covering it. Stone looks well in her role, although it was the only film where she shone. Douglas makes a good cop but does not build any erotic chemistry with her.Its an erotic thriller with ambitions of a police film, whose content grazes pornography in a dangerous way. Much of the erotic scenes were not necessary and were even dispensable, if the film wanted to focus on crime. Stubbornly overrated due to that, it does not have the quality it advertises and promises."}, {"rating": "10", "text": "Um filme sensacional, pena que o diretor tenha sido um babaca com a atriz. Ainda assim, gostei muito do filme, é bem interessante, intrigante e sexy."}, {"rating": "10", "text": "Basic Instinct was a thriller made in 1992 with some sex scenes and nudity. It stars Michael Douglas and Sharon Stone and is pretty well directed by the one and only Paul Verhoeven who did RoboCop and Total Recall. The storyline to Basic Instinct is rather simple really and it's about some dude named Johnny Boz who is attacked in bed during sex with a blonde chick but we never know the blonde chicks identity as we never see her face, only the back of her naked body during the sex but Johnny Boz is attacked and killed by a knife or icepick in bed. I think it's an icepick and the next thing we know is the crime scene is being investigated by detectives and whatever and I think they recover the pick, the crime scene itself is very bloody and traces of siemen on the bedsheets and they somehow connect the victim to Catherine Tramell (Sharon Stone). She gets interviewed time and time again throughout the film and takes a lie detector test and Michael Douglas who plays a cop Nick Curran believes she is lying and cheated the test. Michael Douglas gets sexually involved with Sharon Stone (Catherine Tramell) in the movie probably in a bid to catch her in the act and arrest her. Jeanne Tripplehorn who hangs around with Michael Douglas in the movie has a criminal record as Michael Douglas who plays Nick Curran the cop later finds out. George Dzundza who's Michael Douglas's cop partner friend through some of the movie later gets killed and an icepick and wig left at the crime scene and Jeanne Tripplehorn gets shot by Michael Douglas because she's the suspect and Michael Douglas thinks she's about to draw a gun on him but turns out to be Bart Simpson toy or some keys or rubbish like that. Michael Douglas who plays Nick Curran in Basic Instinct keeps hanging with Sharon Stone in the movie who plays Catherine Tramell and having conversations with her, questioning her, acting like her buddy and even sees her undress wearing no panties. There's a scene where Michael Douglas and Stone are in a nightclub and slowly get close to each other in a passionate way I'd say. A friend of Sharon Stone's character in the film called Roxy drives her car at Michael Douglas, knocking him over and speeds off but Douglas chases her in another car and Roxy's car drives off a ledge or cliff or something and is killed. The sex scenes in Basic Instinct between Sharon Stone and Michael Douglas are beautifully directed and well made and good, the nudity also good and Sharon Stone as Catherine Tramell looks sexy and beautiful. The leg crossing scene when Sharon Stone is questioned by police is stupid in my opinion but the acting in the film is good by all the cast and actors and actresses. The basic story of Basic Instinct is there's a killer on the loose who's obviously female but needs to be found and dealt with but Catherine Tramell played by Sharon Stone always lies and manipulates cops and the system. We never find out who the killer is but Stone is always the main suspect and at the end of the film Sharon Stone and Michael Douglas are in bed and we see an icepick under the bed and the film ends. Not the best ending but good directing, good acting, some violence, bad language and sex scenes... Overall Basic Instinct is not the best film but it's pretty good and Sharon Stone naked is always a bonus!"}, {"rating": "10", "text": "Film culte légendaire le meilleur incontestable de Verhoeven. Sharon Stone est diabolique envoutante cynique ce film a fait d'elle une méga star. La réalisation est parfaite les rebondissements on ne s'ennuie pas un seul seconde. Les scènes de nudité sont crues sans doublage sans complexes."}, {"rating": "10", "text": "Perfect thriller with a perfect tensed atmosphere and many story twists, maybe even too many twists. The movie change his focused suspects often and if you just watch the movie it can be overwhelmed, but if you start to think...maybe then maybe there were too many twists and it is therefore unrealistic.Michael Douglas and Sharon Stone with great performances, Douglas a bit shy forst, but leading later. Stone manipulative and perfect femme fatale in the beginning, a bit desperate later."}, {"rating": "9", "text": "Basic Instinct is one of the best erotic thrillers. A magnificent acting duet, one of the most famous erotic scenes in Hollywood cinema, which everyone probably saw. Sharon Stone's most famous role. Michael Douglas in his best career years. Surprisingly, despite the ease of storytelling of the first half of the film, the second part feels suspense as in real thrillers. Catherine has an incredible gift for manipulation, there are not many such fatal women films. In general, it is difficult to imagine who could shoot Basic Instinct better than Paul Verhoeven. In the modern world, where the agenda is primarily important, and women are trying to fall as much as possible as a stronger gender, such a film could hardly be released. Nice open ending."}, {"rating": "5", "text": "min problem with the movie is that it fell too long, if it was about half and hour long I would have liked it much better"}], "recommendations": ["wild_things", "bonnie_and_clyde", "true_romance", "widows", "the_woman_in_the_window", "a_walk_among_the_tombstones", "triple_9", "a_simple_favor", "conspiracy_theory", "fracture", "savages", "total_recall", "casino", "street_kings", "the_lincoln_lawyer", "cold_pursuit", "heat", "hollow_man", "the_call", "blood_ties", "red_sparrow", "stoker", "insomnia", "dirty_harry", "the_frozen_ground"]}