{"id": 533, "title": "Batman v Superman: Dawn of Justice", "starring": ["Ben Affleck", "Henry Cavill"], "runtime": 152, "genre": ["Action", "Adventure", "Fantasy"], "description": "Fearing the actions of a god-like Super Hero left unchecked, Gotham City’s own formidable, forceful vigilante takes on Metropolis’s most revered, modern-day savior, while the world wrestles with what sort of hero it really needs. And with Batman and Superman at war with one another, a new threat quickly arises, putting mankind in greater danger than it’s ever known before.", "releaseYear": "2016", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/5UsK3grJvtQrtzEgqNlDljJW96w.jpg", "categories": {"plot": 4.592592592592593, "acting": 3.5714285714285716, "ending": 5.0, "soundtrack": 1.0, "cinematography": 4.666666666666667, "familyFriendly": 1.3333333333333333, "funny": 10.0, "action": 3.9}, "reviews": [{"rating": "1", "text": "What a mess of a movie. Fans can swear up and down that this is a \"serious\" superhero flick....but it isnt. All the plotholes and illogical pacing make this the funniest superhero movie I have ever seen. Cavill is once again human cardboard in a suit, Batfleck is all style while betraying source material, and I'm pretty sure Lex Luthor is really The Riddler from Batman Forever. The redundancies fly high, from stopping an alien who destroyed a city....by destroying a city; to Luthor knowing way too much because he apparently traveled to normal Earth and stole the BvS script.\r Despite the runtime being too long, it still isnt enough for Znyder to make a coherent set-up for the Justice League. Oh yeah, Wonder Woman was there for a bit and it was about as good as a quick cameo can get. There is no quick cameo on Earth thats good enough to save a 150-minute mess though....\r Also, I can't imagine any kid going to see this and not being bored to tears...if it was made for comic fans, then they should've dropped the PG-13 rating."}, {"rating": "2", "text": "I wanted to love Batman v Superman: Dawn of Justice. So badly. Although my expectations were low, I hoped for the best, and all I wanted to do was to have fun.\r I underestimated this movie. I underestimated how bad it would really be.\r Batman v Superman introduces a semi-interesting Batman, presents a few cool visuals, and the story itself has some ideas in it that have potential. However, the script itself is a mess, being one of the worst screenplays in terms of structure that I have seen in recent memory. The movie has about seven storylines going on all at once, none of which tie together in any cohesive way, and none of which get enough screen time to be developed or interesting. Here, characters feel empty and shallow. Ideas are silenced by explosions. Potential future storylines are wasted.\r After enjoying Man of Steel, and being a fan of the genre, Batman v Superman: Dawn of Justice is one of the biggest letdowns in cinematic history. It's messy, tonally confused, often times unintentionally funny, and every bit as much boring.\r When the film was first announced at Comic-Con a few years ago, the sheer epic nature of the announcement had me in giddy tears. Now, I am practically in tears once again. But not for the reasons that I had hoped."}, {"rating": "0", "text": "I'm very fan of dc. I wanted to love Batman v Superman: Dawn of Justice. but my wish is broken now.\rThis movie gave me very terrible terrible damage. terrible terrible damage"}, {"rating": "0", "text": "The Biggest waste of 2.5 hours of my life. About 10min of action the rest was utter crap. Honestly was trying not to fall asleep. Affleck was great tho."}, {"rating": "0", "text": "Batman v Superman não passa de mais uma porcaria feita somente para o entretenimento dos fanáticos por super-heróis, é puro marketing falso, o filme é o trailer estendido por duas horas e meia e nada mais! Não é cativante, é previsível e chato."}, {"rating": "1", "text": "Remember the stories you came up with as a child when you played with your action figures? Batman v Superman: Dawn of Justice is no different than them. In fact, it's even worse because it doesn't have an inch of heart and enthusiasm.\r Its script is an incoherent and depressing mess where the characters, if you can call them that, have no personalities, motivations and arcs. Batman is a moronic jerk who prefers to destroy stuff than being reasonable. Superman doesn't do much aside from looking sad. Wonder Woman is just there so Warner Bros can have more toys to sell. Lex Luthor is a spoiled brat with with way too much time on his hands. You could remove several sequences and it wouldn't make any difference.\r With the exception of Jesse Eisenberg, who was embarrassing to witness, the actors looked like they wanted to be anywhere else. I can't say I blame them.\r Not even the action scenes live up to the hype. They're awkwardly staged and sometimes it's hard to tell what's going on (the cinematography is too dark). The music is laughably overdramatic.\r It's sad how Warner Bros has been working with these characters for ages and can't make a competent crossover movie with them. I only rate 1/10 because I think Henry Cavill and Ben Affleck were the right actors in the wrong movie."}, {"rating": "3", "text": "Good news. If you like Batman and Superman--they are both in this movie. Bad news. You're not going to recognize either one of them--unless you already saw Batman as a psychotic Donald Trump, and Superman as a whiny emo loser."}, {"rating": "3", "text": "This movie is not for families, not for children, not even for true fans of comic books. While being a cinematic beauty, the story and motivations of the characters were straight trash. I can't even count the ways. But let me expound a few non spoilers. Batman is a murderer. Superman is a depressed mopey guy who needs a therapist and possibly Xanax. Wonder Woman is a pretty woman with an Israeli accent. Lex Luthor is the worst nonsensical version of Lex Luthor ever depicted on screen. The movie is long, dark, and joyless. Unlike the Heroes of the Marvel Universe who are having fun even when everything is going haywire the Heroes of the DC cinematic universe act like someone is forcing them to save the world. If you are really looking for a great Superman/Batman team up go dig up the animated film Superman & Batman: World's Finest."}, {"rating": "3", "text": "Only fanboys would like this. Slow and short fights, the ending was just a giant mess. I had a great amount of expectations for this movie but I ended up really disappointed."}, {"rating": "0", "text": "What a god awful mess! If people are that hungry to see Batman and Superman together in the same film I feel very sorry for the public at large! How on earth could anyone other than the most extreme of fans enjoy this? I often hear of others saying that they walked out on a film and this one was near close for me! The South Park episode \"The Passion of the Jew\" was all I could think about afterwords as I also want my money back! This was not fun and it was not or entertaining at all!"}, {"rating": "3", "text": "I've been a fan of the genre and the director for quite a while, even the polarizing Man of Steel. With that I can say: what a mess...Jumbled, incoherent, illogical, poorly written and directed. I removed as much expectation as possible going in and was ready to absorb each creative decision with an open mind and still I could barely find a single facet to approve of by the end. Even the cameos of (hopefully) better things to come were poorly handled. I am so curious as to what the hell happened for everything to go so wrong. Altogether a colossal disappointment for me.\r P.S.: No after credits sequence, if you were wondering."}, {"rating": "0", "text": "I wish this was handled differently. It takes all the negatives from the Man of Steel and multiplies them ten times over. I will say that Ben Affleck is the best looking live action Batman and Henry Cavill is the best looking Superman. Both actors are wasted in this movie and truly deserve to be in a better film."}, {"rating": "2", "text": "I'm literally baffled as to how anyone can call this mess an \"authentic adaptation\" or \"true to the source material.\"  Most comic books I have read when they make huge plot points actually show the damn work to explain what they are doing. The film still has its moments, and the casting of \"Batfleck\" turned out far better than the internet assumed it would, but the writing is poor, the editing is worse, and there are parts I still don't know what the hell I was seeing.  The movie was about 45 minutes too long, and hopefully DC either boots or leashes Zack Snyder going forward."}, {"rating": "0", "text": "Worst batman movie in 20 years. Movie is boring, overrated and predictable. If you have seen a trailer, that is it, don't expect much more than that..."}, {"rating": "0", "text": "um filme onde o marketing fez o hype aumentar mto e todos esperarem mto do filme, mas que na real n consegue mostrar nada do que foi prometido, esperava mais."}, {"rating": "5", "text": "Batman v Superman: Dawn of Justice boasts impressive visuals and well orchestrated action sequences, but disappoints with a couple of poor villains and a plot that is incoherent and illogical."}, {"rating": "0", "text": "This movie made no sense, It jumped all over the place at one moment Batman and Superman are enemies, next thing you know Batman is saving Superman's mother telling her \"Don't worry I'm a friend of your sons\". And the reason Wonder Woman was in the movie was never really explained it's like she popped out of nowhere at the end of the movie."}, {"rating": "2", "text": "The worst Batman since George Clooney's.\rThere are MANY elements that make it a bad movie but I'm just gonna focus con Batman.\r1. Batman doesn't shoot!!! : They fill the movie with Batman depictions shooting fireguns, either in a dream, or with kriptonite bullets, or from an enemy's hand to shoot another bad guy. Batman swore to never use fire weapons because that's hoy he los his parents. Destroyed the image of Batman.\r2. Batman doesn't kill for killing: Stabbing enemies, exploding things, putting thousands of people in danger just to get what he wants... Really???\r3. Reason to kill Superman: stupid!: \"If there's 1% chance he is the enemy, I must kill him\" that's what he says when he decides to kill Superman. Besides he knows that Joker is a serious enemy and has tons of opportunities to kill him, he doesn't. BECAUSE BATMAN DOESN'T KILL, he just neutralizes dangerous people, put them behind the bars and MOVES ON!\rThat makes it the worst Batman ever, except for George Clooney's."}, {"rating": "0", "text": "No me gusto, a lo mejor se parece a los cómics. Pero yo no soy fanático de los cómics y para mi se me hizo muy pesada y lenta. Yo le voy a Superman, y en esta película Superman es una Burla. Lo hicieron muy bobo, tanto y demasiado moral. Ahora el Batman, nada que ver con los otros Batman qué eh visto en las otras películas, llegó un punto de la película que ya no supe quien era quien (si era Batman o Iron Man)"}, {"rating": "3", "text": "SPOILERS\r Where to start? The whole fight between Batman and Superman was less then 5 minutes and 90% of the fight was in the trailers already, the longggg build up with the pointless bullet plot was boring, it was just a mess. Affleck is one amazing Batman, have to give credit where its due, but Cavill is still a horribly wooden Superman, and surely I dont need to mention how painfully awful the new Luthor is, i actually turned my head away in the cinema to avoid the cringe he provides to the story. The setting up for other films was so lazily done and stupid, did Lex design there logos too in this universe lol? Speaking of stupid, Lois Lane gets saved like three times during the film, she is so irritating and pointless. The final act with Doomsday, the disgusting ugly troll was just filled with CGI explosions, nothing about it made sense, from how he became real to why they even used him in the first place, such a wasted opportunity if you know what he looks like and can do in the comics. He has a second form where he does nothing new and pebbles come from his back too, so theres that. Superman does 'die' and what a dreadful mistake to make, killing him off this early is beyond idiotic for obvious reasons, but we all know he isnt going to stay dead which means using the death of Superman for another film in the future is going to have no emotional impact whatsoever. Overall the film is a rushed mess, there was some nice cinematography and as i said before Batfleck is great but all this film did was waste my money, biggest disapointment in years."}, {"rating": "8", "text": "The hate for this movie is really unjustified. Is it flawed? Sure. But what movie isn't. We should be glad that we were given the chance to watch a superhero movie that doesn't follow the same old  formula, which in my opinion is getting quite repetitive, and is something different both in tone and story. The fact that the movie reminded me of Batman TAS and Superman TAS is definitely a plus.\r Let's start with the performances, everyone from the main cast to the supporting worked well, the stand out being Ben Affleck. Not only did he prove the haters wrong, but he brought something new to the role. For once you actually fear the Batman. Cavill was good as well, and you could really feel his pain of being an outsider (which is continued from Man of Steel). Amy Adams was much better this time around in her role as Lois Lane, and she again reminded me of Superman TAS. Jeremy Irons was obviously great as Alfred. Gadot in my opinion was alright as Wonder Woman, I guess we need to see more from her. Now let's come to Lex Luthor... instead of feeling like a man of grace and one that you should fear, Lex feels like a wannabe Joker, it felt like Jesse was playing a cartoon cartoon and it is quite clear that he needed a paycheck. But if you ignore the character's roots, he is a decent enough villain even if you would like to punch him every time he's on screen.\r The pacing although not great, was not terrible either. It was quite noticeable that a few scenes were cut in between and maybe the R-rated cut should help with the movie's flow. There were also quite a few choices made by the filmmaker that would anger quite a few fans. But this is something to be expected from Zack Snyder.\r Overall the movie was quite enjoyable, it had some really amazing parts and some that you would outright hate. But these parts really didn't ruin the experience for me, because at the end of the day it is someone else's interpretation of these heroes. I'm just glad that we were able to watch these two iconic heroes on the screen together.\r This is my own opinion and you should make your own. Watch the movie if you are interested but don't let the critics have an effect on your viewing experience because it definitely isn't the abomination that some would like you to believe. Although far from a perfect superhero experience, it is in my opinion better than quite a few thing that we have seen before. Maybe in the next couple of years, people might appreciate it more."}, {"rating": "2", "text": "For all its controversial casting choices, it isn't Ben Affleck or Gal Godot that drags this movie down, it's Jesse Eisenberg's ridiculous Lex Luthor. His pointless yammering represents the film as a whole; it has a few good moments and plays with a few interesting ideas, but there's no there there. The real blame for this mess, though, lies on the people who made it.\r The movie suffers from the excess of characters usually reserved for the third, bad film of a superhero trilogy. Did a movie about Batman vs Superman really need Lex Luthor? Probably not. Did it need a CGI wasteland with Doomsday at the center? Definitely not. And while this was a passable Wonder Woman, the forced inclusion of Superman's wife and mother, both dithering about pointlessly with cringeworthy dialogue, is unlikely to placate whatever portion of people looked at a BvS movie and thought to themselves \"this needs more women\". The excess of characters leaves little time for the movie's central conflict, with Batman's one-note rage coming off as hollow.\r Even more time is wasted on CGI fakery (whereas the smart blockbusters, Batman movies included, go hard for real locations and practical effects), and the hallmark of lazy writing: excessive dream sequences. And for all the stakes this movie purports to have, the ham-handed introduction of the Justice League leaves little doubt in the viewer's mind that regardless of how many explosions we see, everyone will be back for the next movie. Except, possibly, the audience."}, {"rating": "1", "text": "The script is an incoherent mess. Batman is the only character with a clear motivation. This movie has the worst interpretation of Lex Luthor I have ever seen. The selling point of the movie is seeing Batman and Superman fight but you have to wait forever to see the fight and the fight is over in the blink of an eye. The addition of Wonder Woman and Doomsday is unnecessary and only adds to the convolution. That remains me, the actress who plays Wonder Woman is atrocious. The only actor who did a good job was Ben Affleck. It is a shame that Batman and Superman are unlikeable psychopaths. Lex Luthor is the only character worth rooting for to be honest since he is the most sane character out of all of them! Don't see the movie. It's a stupid, stupid mess."}, {"rating": "0", "text": "This movie is offensive for both general public and the fans. The movie is slow, beyond what I could describe. What should be the setup for the end is in fact a whole lot of nothing happening at all. And I mean that it is void of both action and emotion, it is just plain and simple 90 minutes or more of nothingness. I could probably have more fun with a blank screen. When the movie approaches the end you have lot of actiongasm that works for everyone but that is so artificial that you should better watch video game cinematics on youtube. Snyder managed to take away the soul of the Dark Knight comics in favor of a shallow fight and managed to completely waste Doomsday, I mean, Doomsday is only there as \"geekgasm enhancer\", like the Wonder Woman (to present her without a deep context is just so shallow it hurts). Overall this is what all this film was about, a lot of nothingness followed by shallowness, it completely fails as a movie and fails to please me as a fan, the only thing this movie is good for is to teach people nihilism or even make teenagers go to the church looking for god after such an empty experience.\rSeriously, do not waste your time watching this. But if you insist, sleep past the first two acts.\rOne last thing... what is wrong with these people that they NEVER EVER get Lex Luthor right? I mean I like the actors and like their villains but that thing they do is not Lex Luthor."}, {"rating": "0", "text": "This is a weak movie written for children for big babbies who dismiss logic over big explosions. This is the \"Michal Bay\" of Super Heroes at its worst."}, {"rating": "0", "text": "Well that was a waste of $36 I took my girlfriend with me to see this in IMAX .. first mistake .. second the movie dragged on forever with useless scenes that had nothing to do with the Batman V Superman story line and cramming Wonder Woman in along with other cameos for no reason the whole thing was sad , I felt like I was watching a 2 hr commercial written for 12 yr old kids  ( which I was apparently )  this movie is the bottom of the barrel marketing movie , there's nothing here to care about it's juts ridiculous CGI stunts and juvenile script writing , there's nothing here for anyone over 15 yrs old , I would have loved this movie when I was 10 because I could have wrote and directed this movie when I was 10 .. this is a really bad movie that is relevant only because of it's name and marketing . it's total garbage ..  Do your self a huge favor and wait a couple of weeks when the marketing has died and if you still want to see it then go see it .. my guess is by next weekend this movie will be dead.  I give it a zero because I feel like they stole my money .. this should have been at least a decent movie not an utter mess."}, {"rating": "3", "text": "I just have an overall feel of disappointment after watching this movie. Very disappointed with Zack Snyder, just as a person. Like, what the hell? I thought Batman's whole shtick was that he never killed anybody, and here he is in this movie, killing dudes left and right. Jeez."}, {"rating": "9", "text": "A epic almost grand opera, this film is a visual spectacle and if your a fan of DC or any comic book films you will love it and get very hyped for the DC universe. I will say there are some randoms cuts in the film that kinda mess up the flow but it almost feels like a literal comic book brought to life.\r Just go watch it for yourself, personally the critics are way too harsh on this film and both fans and audiences are loving it so far. It's easily as good as Age of Ultron if not better. Setting up a whole universe in 1 film was no easy task, but i think Snyder & DC have done it albeit not perfectly but I'm very excited for the future."}, {"rating": "8", "text": "Great start for DC Extended Universe. If you like the visual style of Zack Snyder and dark atmosphere of DC comics (especially Batman: The Dark Knight Returns), then you will like this movie."}, {"rating": "9", "text": "I dont understand why critics hate this movie so much. As someone who was very against the idea of this movie and against batfleck..... I loved the movie. I thought Affleck did great. i LOVED gal gadot as wonder woman. the way they introduced the other members of the justice league I thought was really well done. It was ALMOST too many things in one movie but it ended up just balancing that line and then fortunately the movie ended.  But I think for me the idea of this super jaded 20 year old vet of a Batman was just great. The take they did with him I thought was brilliant. I know alot of people probably wont like the take on Lex Luthor either but I really enjoyed this version of a Brilliant nutjob Billionaire scientist over the calm and collected usual Lex. I am a diehard Marvel guy but this movie I think beat Age of Ultron (which is heartbreaking for me cause im in love with Iron Man/RDJ) and I think will be better than Civil War as well unfortunately. Yes the movie had some issues but it isnt life shattering issues like people are making it out to be. People are just hating on it because it didnt follow exact comic books or \"batman was too mean\" or whatever you want to say. I liked the takes on the film alot. And i wanted to stand up and APPLAUD the freaking movie in the first 10 mins when one of the BIGGEST issues I had with Man of Steel was basically addressed right in the beginning of the film and was something that was vocalized and analyzed throughout the film which I thought was great."}, {"rating": "8", "text": "If you are a comic book fan, have read Frank Miller's The Dark Knight Returns and know the other darker stories of these characters, then you will like this film.  I am one of the people who likes Superman lighter, but in this DC universe version, it fits.  So I enjoyed it.\r Zack Snyder has a style of film that not all critics appreciate and that sometimes does not allow them to review his films fairly.  So my advice to anyone who wants to see it, then go and make up your own mind about it."}, {"rating": "9", "text": "I don't understand why so many people treat this movie like something it is not!\rIt is not a Nolan movie, it is a solid Snyder movie and it is not a bad thing!\rThis director had a specific vision for this movie and I enjoyed it!\rAnd as I like to say to my friends - YOU don't have to listen to anyone, go see the movie and form your OWN opinion! ;)"}, {"rating": "1", "text": "Just watched this flop. This isn't a superhero movie. This is a sub-mediocre action movie with superheroes thrown in to make it seem interesting and milk the trend. Great for 13 year old edge lords. Go see if you're a latent Juggalo."}, {"rating": "7", "text": "Spoiler free mini review:\r THE GOOD:\rBen Affleck is quite easily the best live-action Batman.\rSo is Jeremy Irons as Alfred.\rGal Gadot did wonders with what little screen time she had.\rGreat fight scenes.\rExcellent cinematography. Simply put it's visually spectacular.\rExcellent beginning.\rUnpredictable ending.\rHans Zimmer's score.\r THE BAD:\rIt's a rushed setup film for the Justice League, so it's crammed with too many plots/sub-plots.\rBad editing, disjointed scenes (once again due to too many plots)\rMain antagonist's motives are unclear.\rSome minor plot holes.\rSlow middle.\rUnnecessary cameo from one particular superhero (could have been a simple end credit scene).\r THE UGLY:\rDoomsday...he's just a really ugly cgi monster.\r In short: It's no masterpiece and there are certainly much better superhero films out there but it isn't a terrible film by any means.\r Rating: 7/10"}, {"rating": "10", "text": "This movie is bold and visually amazing! If you are interested, go see it, you owe to yourself. Don't depend on my review or anyone else's, trust your own taste and make up your own mind. The action scenes and the characters won't let you indifferent.\r If you are familiar with comics, it is very consistent with DC Comics and DC animated, you just have to view it as a new story line. It's nothing like a Marvel CU movie(which are usually good popcorn flicks for all the family). In fact, this film is unlike any movie I have ever seen before. Though different, it's a marvel to behold(pun intended).\r The theatrical studio cut is a downer but knowing there will be director's cut blue-ray makes up for it."}, {"rating": "10", "text": "Batman Vs Superman was something I was not looking forward to seeing after reading so many negative reviews but how wrong I was. This has to be one of the best superhero movies I have ever seen. The acting, the effects, and the overall tone was simply beautiful.\r I know many feel differently so I have come to the conclusion we live in a time people have the attention span of goldfish and if its not a quip every 5 seconds for an hour and a half they will not like it. Deadpool is a perfect example of this. Marvel appeals to the masses because people today want a simple funny movie they don't have to feel nor think about too deeply. Sad this is what movies have come to."}, {"rating": "7", "text": "Was it good? Yes and no. Firstly casting Ben Affleck as batman was great. To me he is the first actor to fit the persona of Batman and Bruce Wayne. Loved every action scene that he was in. Wonder Woman didnt say much and Superman well same as the first. The let down though is the directing. Why so many dream sequences!!?? There where so many long boring scenes that kids in the audience got bored and started chatting among themselves. As for the overall story? I didn't mind the darker view of Batman. Overall it is a good watch although you are going to wish for a remote to fast forward some scenes."}, {"rating": "10", "text": "Not sure how this movie is scoring so low. It's EXACTLY what I was hoping for. It has a slow burn start but then gets going at a lightning pace. It can hard to keep track of all the subplots and the characters psychologies are looked at by dream analysis.  That is an interesting way to look at who they are deep down. However it may be too subtle for some. That shouldn't take away from the overall experience.\rAll in all it's another work of art from Snyder."}, {"rating": "8", "text": "The pacing in the beginning of the movie was a bit rapid in an attempt to set up the players in the multiple storylines, as you would see in a comic book. The final act was a bit too CGI, but still tremendous. Overall the movie was INCREDIBLE FUN! Ben Affleck played a terrific Bruce Wayne/Batman. Henry Cavill is a beautiful,  noble, and this time suffering Superman. And Gal Gadot as Diana/Wonder Woman is a star-making performance. Her involvement in the plot and entrance in the final act really set the stage for what is to come in her solo movie and in Justice League."}, {"rating": "10", "text": "Simply mind blowing...dont go by the words of the critics and skip this movie coz its a must watch for all the DC fans and regular people alike. This is not a marvel action-comedy treat but a dark world in which the heroes struggle both emotionally and physically. Awesome performance by ben affleck. Zack snyder is the man when it comes to directing movies of this genre"}, {"rating": "8", "text": "This movie was made for super hero fans. If you don't like super-heroes probably you will not like this movie.\r \"People hate what they don´t understand\" - Martha Kent"}, {"rating": "10", "text": "Isn't the movie we deserve, that is what we need. It is the best adaptation of Batman and Wonder Woman that has been the most faithful to the comics, without detracting from the previous movies."}, {"rating": "10", "text": "Very Mild Spoilers. I clicked the box just to be sure.\r I was so happy I got to see this film. As a fan of Batman, Superman, and Wonder Woman ever since I was a 8 years old, I was hooked in immediately. This film was made for us DC comic geeks. There were more Easter Eggs than I could count. The characters were well cast, and the action was solid. The shots and cinematography was absolutely stunning. Was it perfect? No. No move is. Even films like The Wrath of Khan have issues. It happens. It was very complex, but I didn't feel it was to the point of being bloated. It was fun, but still dark. It had a sad tone, which I feel may have put people off who are used to lighter, more family-friendly comic book movies.\r The cameos to the other Justice League members were brief, but handled well. The Flash appearing through the Speed Force was brilliant. Wonder Woman was powerful. Ben Affleck is THE Batman of a generation, and Henry Cavil was great. The movie tried to balance the personal lives of the heroes with the suited lives, and for the most part, it succeeded. A hyper ambitious film made for adults who love adult themed comic stories.\r Most of all, I loved how both Batman and Superman showed forgiveness and mercy towards one another in their fight. There was a moment when they could have easily killed each other, and something stopped them. That's what we all as fans wanted to see.\r Thanks so much to Snyder & Co. You pleased this fan greatly! Going to see it again soon!"}, {"rating": "7", "text": "Batman and Lex stole the show away from a once again bored looking Henry Cavill. Despite some stumbles at the beginning and end, you'll walk away entertained, if only for the fight scenes that Batman actually gets to take part in."}, {"rating": "9", "text": "Definitely a movie for the comic fans. Hits the right comic book notes. Others will probably feel inattentive until the fights. Eissenberg could've been better."}, {"rating": "8", "text": "I've never reviewed a film on this site before but felt that I needed to in response to the overwhelming negative reviews I read online. This is a great film. It's not an amazing film by any stretch of the imagination but it is nowhere near as bad as the critics are making out.\r This is a great DC Universe film and the cast are, for the most part, excellent. The only character that didn't work was Lex but apart from that everyone was great. Sure the pacing stuttered in places, the dialogue was poor in others and the end section dragged (for me) but generally I was entertained and enjoyed the film.\r Ben Affleck is the definitive screen Batman for me. His size, tone and approach were spot on.\r I'm looking forward to the next one."}, {"rating": "10", "text": "Amazing superheros movie. Do not listen critics, because... \"People hate what they don't understand.\"\rthis movie is 10 times better from SW:TFA, Deadpool, Avengers: Age of Ultron, The Amazing Spider-man 1 &2, Thor 1&2, Ironman 2&3, Ant man..."}, {"rating": "10", "text": "This is a very good rappresentation of what is Dc universe. I finally saw Batman in a movie. The real Batman, the dark Batman of Miller. You have to see this movie. At the moment, for me, it's the best cinecomic. Now I wait for Justice League."}, {"rating": "10", "text": "I've read people say things like Wonder Woman was under developed and should have had more screen time whilst also saying the film was too crowded, make up your mind cause I don't think you know what you want. This was exactly as the the title describes... Batman v Superman (DAWN of justice) as in the very beginning of the JL and bats and super really do go at it. Amazing action scenes, bats is an older version that is clearly on the edge after fighting crime for 20years. I don't get what more you could ask for in this film, there were some poor editing of scenes near the end and Jessie Esienberg was a bit dung but everyone else nailed it, Wonder Woman is a bad ass."}, {"rating": "10", "text": "The movie is really cool, is the best adaptation of a comic book and seen, Ben Affleck is the best Batman story and the film exceeded my expectations 10"}], "recommendations": ["percy_jackson_sea_of_monsters", "justice_league", "terminator_genisys", "spider_man_3", "x_men_apocalypse", "man_of_steel", "the_chronicles_of_narnia_the_voyage_of_the_dawn_treader", "the_twilight_saga_breaking_dawn_part_2", "the_twilight_saga_eclipse", "green_lantern", "indiana_jones_and_the_kingdom_of_the_crystal_skull", "the_twilight_saga_new_moon", "superman_returns", "dark_phoenix", "fantastic_beasts_the_secrets_of_dumbledore", "bumblebee", "teenage_mutant_ninja_turtles", "the_new_mutants", "glass", "batman_the_killing_joke", "riddick", "the_hobbit_the_desolation_of_smaug", "black_panther_wakanda_forever", "seventh_son", "avengers_age_of_ultron"]}