{
  "id": 2581,
  "title": "Batman Returns",
  "starring": [
    "Michael Keaton",
    "Michelle Pfeiffer"
  ],
  "runtime": 126,
  "genre": [
    "Action",
    "Fantasy"
  ],
  "description": "While Batman deals with a deformed man calling himself the Penguin, an employee of a corrupt businessman transforms into the Catwoman.",
  "releaseYear": "1992",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/jKBjeXM7iBBV9UkUcOXx3m7FSHY.jpg",
  "categories": {
    "plot": 7.363636363636363,
    "acting": 7.214285714285714,
    "ending": 6.166666666666667,
    "soundtrack": 6.0,
    "cinematography": 1.0,
    "familyFriendly": 6.0,
    "funny": 8.2,
    "action": 7.266666666666667
  },
  "reviews": [
    {
      "rating": "10",
      "text": "this movie is one of the best movies from 1992 in my opinion! i rate this movie a 10/10"
    },
    {
      "rating": "10",
      "text": "\"Batman Returns\" is the best Tim Burton take on the character and the most like a Tim Burton film. His first \"Batman\" had great moments (and Jack Nicholson) but also many compromises -- no doubt forced by studio directives. Michelle Pfeiffer was a fantastic Catwoman, and Danny DeVito was a hilarious and disturbing Penguin. I realize that various characters differ at times from the comic, but so do the stories in DC Comics, depending on who was writing and drawing the pages. This film stands on its own and is one of the very best Batman films -- right up there \"The Batman\" and \"The Dark Knight.\""
    },
    {
      "rating": "9",
      "text": "Summary: In the second of the blockbuster Batman films, the legendary hero does battle against the mysterious Cat Woman and the diabolical Penguin. Gotham City faces two monstrous criminal menaces: the bizarre, sinister Penguin (Danny DeVito) and the slinky, mysterious Catwoman (Michelle Pfeiffer). Can Batman (Michael Keaton) battle two formidable"
    },
    {
      "rating": "9",
      "text": "Very GrittyThis Is A Very Satisfying Sequel With The Cast and Action Stealing The Show Again"
    },
    {
      "rating": "8",
      "text": "While it still doesn't remain as good as the first one or the dark knight, this is still a great sequal to the first batman movie. While it does feel like it focuses on its villians, batman still gets enough credit to still be one our favourite super heros."
    },
    {
      "rating": "8",
      "text": "Tim Burton turns Gotham into a madcap circus of the deranged and silly. Returns has a irreverent sense of humor and a seemingly endless stream of innuendos at it's disposal. It's like a giant cartoon where literally anything can happen. People love to hate on the two Schumacher films for being \"tacky\" and \"over the top,\" among other things. To those people I ask, have you even seen this movie? The only thing setting it apart is Burton's twisted vision. Where later Batman films aimed for a more family-friendly tone, this movie isn't afraid to linger in it's own darkness.I've always found Burton and Keaton's take on Batman to be incredibly bland. Where this and the 1989 film succeed are in their villains and visuals. The latter giving the film an appearance similar to that of the beloved animated series. Danny DeVito's Penguin is fantastic and Michelle Pfeiffer, while underutilized, is an empowering Catwoman. Christopher Walken is also worthy of our attention as the manipulative Max Shreck. They're all tragic characters in their own ways. The film really shows how damaged they are, adding to the sense of unabashed madness that is so delightfully entertaining.I enjoyed Batman Returns because I never knew what was around the next corner. It's unpredictability is refreshing. I do feel the final act suffers from Burton getting a little too out of control. All that stuff with the actual penguins was a little too dumb. But for the most part I enjoyed the insanity. I can't say I like it as a Batman movie though. There's just so much it gets wrong about the character. One of the complaints people had with Batman v Superman is that the dark knight had no problem taking lives. Bruce Wayne spills plenty of blood here, so I don't see why it gets a pass. Despite being very adult and quite dark in content, Returns is pretty lighthearted when it comes to it's depiction of the caped crusader himself. Leading to an overall unsatisfactory comic book adaptation. Yet, I still like the film.Returns is both a bad Batman movie and a strong watch in it's own right. Burton's penchant for creating bizarro experiences works out here in a myriad of ways despite it's bloated, packed running time and mishandling of the title character. The director let the craziness really flow out of him and it's often brilliant because of that. It's a mix of Gothicism and feminism where the hero is just as a big a sociopath as the foes threatening the city are. Everyone is broken and split down the middle, having multiple personalities. So in a sense it does get something right about Batman. Makes me wonder what Burton could do if he decided to create his own masked \"hero\" character. I suppose he kind of did. This is a very original take on Batman. Not a particularly likable one, but the vision for the rest of the film is exciting in a very unhinged sort of way. After watching this I'm just as split between two personalities as the protagonists/antagonists are. I have two conflicting views on the movie. I'm siding with the more positive one for now.8.6/10"
    },
    {
      "rating": "7",
      "text": "Although it puts a little too much focus on the villains, Batman Returns is a satisfying sequel to Tim Burton's Batman. Michael Keaton gives another fantastic performance as the iconic hero, while Danny Devito makes for a worthy central villain. Michelle Pfeiffer and Christopher Walken also do some impressive work as Catwoman and Max Shreck. The makeup and costume design was great. As I mentioned, the film's main flaw was how it focused too much on the villains, and not quite enough on the title character. Nevertheless, Tim Burton successfully captures the atmosphere of Batman, and Michael Keaton fits the role perfectly. Overall, Batman Returns isn't perfect, but it's a well-directed and atmospheric film with great performances that should satisfy fans of Batman."
    },
    {
      "rating": "8",
      "text": "As someone who doesn't like the first movie that much, this is a big improvement. It's just better. For starters it doesn't feel like a film from the 60's. I think Michelle Pfiffer helps a great deal. As equally beautiful as she is to Kim Basinger, she obviously has alot more to do than Kim did to be fare, but she is a great Catwoman. It's hard to put my finger on, but Returns is just a better film in everyway."
    },
    {
      "rating": "10",
      "text": "Burton is a first-rate stylist, but this time he’s actually better at suggesting the"
    },
    {
      "rating": "8",
      "text": "Probably one of my favourite Christmas movies as well a great Tim Burton film. The darkness, humour and characters shine. The only weakness? Batman is reduced to a secondary character while the villains become the main attraction."
    },
    {
      "rating": "7",
      "text": "'Batman Returns' is a movie I like a little bit better than 'Batman' (1989), only by a small amount.\r The movie, once again directed by Tim Burton is all Tim Burton, before, his style really showed in the 1989 movie where it tried its best (and mostly succeeded) to avoid that cringe, campy style everyone knows from the Adam West \"Batman\" we saw in the 1960s. Here, the tone seems to be darker, but almost too theatrical, everything from the set pieces of Gotham city, right down to Danny Elfman's over-the-top score to make everything seem more dramatic than what it already is.\r There are two main villains in this movie, although, one of them may not be that much of a villain. They are the Penguin (Danny DeVito), and Selina Kyle aka \"Catwoman\" (Michelle Pfeiffer). We get a glimpse of Penguin's backstory of how he was left abandoned as a child and had to grow up in the sewers, his almost deformed look will frighten the faint of heart and make them cringe.\r Pfeiffer is absolutely terrific as Catwoman however, she has the right amount of seductive charisma, her voice, and overall appearance make her born for this role. Although, the constant licking of herself can get real old really fast.\r Michael Keaton never shines as Batman/Bruce Wayne and the reasons for this is due to the fact that in the previous movie, he was upstaged by Jack Nicholson's The Joker, and here, it seems like the biggest star is director Tim Burton and his visual, Gothic style. We don't even hear Keaton, as Bruce Wayne say his first line until just roughly half-an-hour into the movie. Considering he is the title character and gets top billing in the cast list, we sometimes forget he's supposed to be there.\r That's the main issue with Burton, I presume, not only does his visual style overcome the lead actor's work, but he focuses way too much on the villain's and their evil plans. We get so much insight of how the Penguin is about to rule Gotham city with the help of Max Shreck (Christopher Walken), and we get an extended origin story of how Selina Kyle became Catwoman.\r Batman is pretty much Batman, he comes, he saves, he goes on with his daily life as Bruce Wayne. There are some interesting elements as to how the Penguin decides to frame Batman and turn the entire Gotham city against him, this showed that there was some real struggle for the character.\r I liked the darker, and more bloodier tone of this movie, I admired the plot, I even give huge credit to Pfeiffer who did an excellent job of portraying Catwoman. This is a marginal step-up from the previous movie which I liked as well. But, the pacing is troubling from time to time, it's only 126 minutes long, and the sort-of overstuffed plots almost intrudes on the movie's narrative focus. But you come for the visual ride, 'Batman Returns' is a worthy sequel."
    },
    {
      "rating": "7",
      "text": "Tim Burton returns to make another Batman film. It decreased from an 8 to a 7. They seriously made Catwoman look too cruel in this film even though the entire Batman franchise is supposed to be dark and evil, but they took her way too cruel. I still think you can survive a movie like this though from Batman which is the only reason why it's a positive score and not a negative."
    },
    {
      "rating": "1",
      "text": "This film is a sequel to the movie \"Batman\" by Tim Burton. And as the first film, falls into the same sins: lack of realism (not even try it) and excessive attachment to the comic strip that gives rise to the central character. Blame it again Tim Burton, which shows little understanding of the comic-book universe and how capable he is of direct cinematic masterpieces or disasters. The film has the participation of Michael Keaton (as Batman), Danny DeVito (as Penguin) and Michelle Pfeiffer (as Catwoman), and only DeVito could shine, incorporating a spiteful and callous Penguin, still unrivaled in cinema.Moreover, the notes I've made for the first film applies perfectly to this also: the cinematography is so black that looks like it's always night in Gotham City, a city that, thanks to the unrealistic scenario, seems a depressed and bloodthirsty version of Orwell's Metropolis. The costumes seem's Carnival masks: Batman exaggerate in plastic polymers and Catwoman would be absolutely perfect in a hardcore and decadent version of \"Fifty Shades of Grey\"... Again, Burton lost an opportunity to understand that the film audience expects more realism concerning comic-book adaptations."
    },
    {
      "rating": "7",
      "text": "Bigger doesn’t necessarily mean better, and this is the case for this movie. Batman Returns was a little bit of a disappointment, although I still liked it. The action was on par with the first, and so were the origin stories of the villains. The film was also a lot darker than the first, which I kind of liked also. The story, however, was a mess. There was no plot, just “Get Batman!”. The first was so much better, but at the very least, Batman Returns was entertaining."
    },
    {
      "rating": "7",
      "text": "Michael Keaton manages to make an unnecessary and rather forgettable sequel into something far more entertaining than it has any right to be. It's a shame that his fellow costars didn't do the same."
    },
    {
      "rating": "3",
      "text": "\"Could be worse, my nose could be gushing blood!!!\" (Penguin)..... Tim Burton has made some classic films in recent years such as Batman, Edward Scissorhands and the not so classic Beetlejuice which I consider one of the most stupidest, ugly, horrible and pathetic and worst films ever made..... Director Tim Burton now brings us BATMAN RETURNS made in 1992 and is the sequel to the original Batman but there's no joker because he died in the original so we are introduced to new villains. Joker played by Jack Nicholson in 1989's original was one of the best if not the best movie villain in film history and he didn't make it easy for Batman and he was rather amusing.... 1992's BATMAN RETURNS brings us newer villains in the form of the penguin (Danny DeVito) and Catwoman (Michelle Pfeiffer) and of course Max Shreck. Michael Keaton returns as the caped crusader and Bruce Wayne from the original and some of the action scenes in the movie were actually okay. Christopher Walken's character \"Max Shreck\" looked like he didn't want to be there at all or looked like he walked into the wrong movie set because he looked totally out of place so his character was unnecessary and as for Catwoman played by Michelle Pfeiffer she was likeable to be honest until she fell off a building. Pushed out of a window or something and had a high fall from a building yet still alive and no fractured skull or broken bones, blood oozing out or anything and she was only human which is ridiculously unbelievable then gets bitten by cats and gets up with nothing wrong with her. Completely stupid and unrealistic but I've to admit I found Michelle Pfeiffer as Catwoman a turn on and very sexy especially with that whip however her scenes fighting Batman are cringeworthy and laughable because it's like Batman couldn't be bothered or let her win because she's female and her villain character was rubbish. Michael Keaton's performance was okay but not as good as his performance in the original movie and Danny DeVito was terrible because he was about as intimidating as Bugs Bunny and believable as a girl with fake tears, even Danny DeVito's death as the penguin near the end was cringeworthy and the green blood oozing from his mouth. The army of penguins in the movie was nonsense and silly and them firebreathing villains and random villains on the street were laughable and looked like they just escaped from the circus. The film for the most part feels depressing, a mess and horrible however some of the action scenes were good I must admit but besides this the film was to me a failure and one of the worst Batman films in the series. Only good part in the movie is the penguin (Danny DeVito) biting some dude's nose and blood gushing out. That's my review of Batman Returns but why did he return to make this rubbish?"
    },
    {
      "rating": "10",
      "text": "Batman Returns is way better than the first Batman film and has the best live action Catwoman"
    },
    {
      "rating": "4",
      "text": "Batman Returns less than Tim Burton's weird excesses, which overshadow some fresh ideas."
    },
    {
      "rating": "4",
      "text": "Aside from a strong cast, This movie doesn't really have much going for it. The plot is a bit generic, the ending an absolutely mess and there really isn't enough Batman in this movie to justify calling it a Batman movie."
    },
    {
      "rating": "4",
      "text": "This not good as first one, the first one was perfect, but it was very entertaining. This is one just a mess, with the choices that Burton choose, is this one of his weaker ones."
    },
    {
      "rating": "9",
      "text": "\"Seems like every woman you try to save ends up dead... or deeply resentful. Maybe you should retire\". - Catwoman [to Batman]\r I think Batman Returns is superior to its predecessor. The rare case of the sequel that's better than the original. This was decidedly weirder and travels into darker territory than the first. Part of Penguin's plot involves kidnapping and killing children - which is pretty messed up.\r Danny DeVito is perfectly cast as Oswald Cobblepot (AKA the Penguin). Christopher Walken is also on form as ruthless businessman, Max Shreck. Maybe the most stand-out part of this movie is Michelle Pfeiffer's Catwoman, she's incendiary in the role and lights up the screen whenever she's on it.\r Side note: It's interesting and kinda cool that Daniel Waters, who wrote Heathers also wrote this movie.\r What's kind of great about this film is that while the first movie was a Batman movie directed by Tim Burton, this was a Tim Burton movie that happened to have Batman in it."
    },
    {
      "rating": "8",
      "text": "A superb follow up to Burton's \"Batman,\" Batman truly returns in this even more dark and gritty take on the Gotham Knight. With the Joker dead, a new evil rises from the sewers in the form of Oswald \"The Penguin\" Cobblepot, the charismatic yet deeply sympathetic villian and his triangle circus gang. DeVito really is marvelous as Penguin but Michelle Pfeiffer is easily the best of the Bat-villains as the sultry and devious Cat woman. Its a good film"
    },
    {
      "rating": "6",
      "text": "This is a strange case for me. It is actually a good movie but it could not win me truly over or get that immersive. Even more Danny DeVito, Michelle Pfeiffer and Christopher Walken are fantastic in their roles. I rewatched it a few times over the years and always expected that it would work better. Sadly it did not happen and even more I cant name a serious mistake here. Some say it is too dark and violent. I disagree except they mean dark in a sense that some scene should be lighted better. Maybe a bit too violent for its time period and it is definitely more than the prequel. If I had to make an explanation why it did not work I would say it creates not the emotions and immersion it should. It is excellently made but is like something that does everything it should but with some strangeness and quirks that don't help atop of a bit of generic story. Lets start with the actual review. After the huge success of the prequel it was only a matter of time before a sequel was made. Michael Keaton returns as Batman and Tim Burton as director because of this. Story: After a flashback which explains the backstory of the Penguin we go to millionaire Max Shreck (Yes that is really his name) who is abducted and confronted with his past actions by the villain. This is the start of an interesting relationship. Meanwhile Max secretary Selina Kyle discover a really dirty secret of her boss which changes her live too. This is the set up of the story and I tried to avoid spoilers. After many rewatches I say the story is actually a bit generic but hides it in a smart way that I only discovered after some rewatches. I liked the characters, their interactions and development far more than the story. Lets say it works but is nothing to write home about. The characters however are excellent. Michael Keaton works well as Batman aka Bruce Wayne but the others steal the show. Danny DeVito as Penguin aka Oswald Cobblepot is amazing. A brilliant performance and he is great in every scene. Of cause Christoper Walken is an experience too and he works really well as Max Shrek. Michelle Pfeiffer is a great actress and fully delivers her role as Selina Kyle. She also is great in each scene. The rest of the cast is good too and for the genre standards we got a really good overall performance. Visually the movie has a unique style. It is dark, matured and delivers a good atmosphere. A really well done representation of Gotham in (not too extreme) Tim Burton style. The costumes are good but I dislike the style of some. Like for example Catwoman’s costume which I find good and awful at the same time. The soundtrack is really good and Danny Elfman repeats his good performance from the prequel. There are some negatives: Like I said the story is not that great, some scenes do not work and the finale faith of the Penguin is a waste. The rest is history as the movie was financially successful but not enough to be a smash hit or convince the bosses of the studio. Also the reception was mixed. So changes will be made for the next movie which will be quite hated by many but this is another story. Overall this enters the list of movies I like but also find not that much appealing at the same time. I think a 6/10 is fair here."
    },
    {
      "rating": "8",
      "text": "Batman Returns is a superb follow-up to Tim Burton's previous Batman film. Again, the characters are the focus, and if Batman doesn't seem to spend quite as much time in the spotlight, it ultimately doesn't matter because Danny DeVito and Michelle Pfeiffer are THAT good. The same dark atmosphere from the first movie is back, and Danny Elfman delivered another superb score. The special effects and action sequences still look lackluster compared to more modern efforts (also like the first Burton Batman film). While the plot is tighter, there are also some holes big enough to drive a truck through. And the Penguin's big plan against Gotham is childish and laugh-out-loud nonsensical. Pfeiffer's Catwoman remains one of the most complete emotional journeys I've ever seen a character take in a film (comic book or otherwise), and she elevates the film, stealing every scene she's in.\r A seven overall, but an extra point for the compelling Catwoman makes it an 8 out of 10."
    },
    {
      "rating": "8",
      "text": "Darker, more interesting, and more intense. Batman Returns is even better than its predecessor. Michael Keaton did a great job as Batman once again. The score and setting were one point. Danny Devito and Michelle Pfeiffer delivered iconic performances as Penguin and Catwoman. My main problem with this movie is that it lacks the prescense of its titular hero compared to the two villains."
    },
    {
      "rating": "8",
      "text": "This is my batman's favorite movie, this was a good job, great action, but batman did not have many appearances, and the penguin has five fingers on his hands 8/10"
    },
    {
      "rating": "10",
      "text": "So strong as previous but much more customized in Burton style with subtle and dark homages to german expressionism; as an example: Christopher Walken in vampire look-like as Max Schreck. Pfeiffer and De Vito grabs all atenttion as villians. Misunderstood but brilliant. Do not waste time with next sequels directed by Schumacher."
    },
    {
      "rating": "8",
      "text": "Avec cette suite, Tim Burton nous a mitonné un bon mélange de kitsch et de grotesque, une commedia dell'arte sans retenue aucune, une espèce d'asile de fous à ciel ouvert sous les gratte-ciel de la ville baroque de Gotham. De temps à autre, on s'interroge : n'en fait-il pas un peu trop dans la gaudriole avec tous ces personnages de foire ?...Pourtant on adhère, car le tout forme un ensemble fou mais cohérent, une lutte de pouvoirs bien montée entre les psychos en collants et en latex, un vilain manipulateur et un certain homme-pingouin (sic !). Et dans ce jeu du chat et de la souris où chacun cherche à s'attraper entre alliance et mésalliance, les super-héros ou super-vilains sont avant tout de super-névropathes.Le pingouin par un Danny de Vito méconnaissable et stupéfiant est un méchant aussi admirable que le Joker en son temps, un être torturé, aussi torturé que la femme-chat campée par une Michelle Pfeiffer sexy en diable et qui crève l'écran. Batman dont l\"interprétation de Michael Keaton est toujours aussi subtilement perturbée en perd carrément son latin et ses moyens.Si la musique de Danny Elfman est hélas en retrait (trop névrosée sans doute), la mise en scène de Burton demeure solide et sait garder le cap jusqu'à la fin, préservant un rythme fort satisfaisant au fil d'un scénario beaucoup moins loufoque qu'il n'y paraît.Loin de l'esbroufe qu'on verra de plus en plus dans les films du genre, Batman 2 se focalise à raison sur ses personnages qui se heurtent et s'attirent et qu'il nous rend attachants, car en dehors de la folie et du masque, il reste l'humain avant tout. Prenez-en de la graine, les autres !"
    },
    {
      "rating": "7",
      "text": "Batman Returns was released in 1992 and was directed by Tim Burton. This movie gave Tim Burton much more creative control which led to it being much darker than its predecessor.This is quite a controversial film for being much more of a 'Tim Burton' movie than a Batman one and this film receives quite a lot of hate. I find that the main reason lots of people are criticising it is for that fact, and many don't look at the movie it actually is. The first time I watched it, I wasn't really a fan but over time this film has grown on me and now it has become one of my favourite Batman ones. It may not be the best made, but one of my favourites.Once again, Michael Keaton is Batman and I loved him as much as I did previously, possibly even more this time around. I found his character to be developed much more too and it showed him in lots of danger and peril at times which wasn't shown in the original, for example when he is stuck in a hijacked Batmobile, not only must he escape before it could potentially end up crashing, it could ruin his reputation and change how the city views him.The Penguin in this movie isn't really the Penguin that everyone knows and isn't just a plain criminal. Instead he is a deformed freak who has experienced discrimination and I found his character to be very interesting and I loved Danny DeVito's portrayal. His motivation was clear and his plan was quite clever- trying to turn the city against Batman by getting respect from the public which was something that hadn't really been done in Batman at the time.Possibly my favourite character of the movie is Michelle Pfeiffer's Catwoman. Her portrayal was definitely my favourite on-screen portrayal of the character and like Penguin, her motivation was clear. She also fit into the story well and didn't feel like she was there just because they could have her there like in the Schumacher Batman films. Batman also appears to have lots of different love interests in the original anthology of films and she is the one of this film and I think she is definitely the best. Not only is she key to the plot but their relationship was done very well and was rather complex, with their double identities causing conflict and once they discover them they're not sure whether they should align with each other or not, being friends as their public personas and enemies as their secret identities. They also realised how similar they are in character and this allows them to connect with each other.Max Schreck (played by none other than Christopher Walken) was a pretty good character, as his character is important to both of the villains' stories and is actually responsible for both of their existences in Gotham.I love the look and feel to this movie. It does feel quite different to the first but this one has that 'Tim Burton' feel that I love.As I said earlier, this film caused controversy for being more of a 'Tim Burton' film than a Batman film. The overall theme is a dark Tim Burton style and many signature things of a 'Tim Burton' film are present: a 'Danny Elfman' score (if you don't know what I mean listen to The Nightmare Before Christmas or Charlie and the Chocolate Factory), a weird looking town, set around Christmas and of course clowns.I find that many people just use the fact that it isn't really a Batman film as something to criticise it for but if you look past that then this is a great film. If you are a Tim Burton fan or just want a good film to watch then I would highly recommend this but if you are specifically looking for a Batman film then probably watch another one. This is definitely one of my personal favourite Batman movies.7.8/10I really wish that we had a true sequel to this that wasn't Batman Forever and continued with the dark tone. However, I guess some things just aren't meant to be."
    },
    {
      "rating": "10",
      "text": "Batman Returns is dark and gritty, just the way Batman should be. It was a great movie and the last good Batman movie in the 1990s, until Nolan bought Batman back in 2005."
    },
    {
      "rating": "7",
      "text": "Aksiyon ve gerilim dozu yüksek. Catwoman ve Penguen çok güzel şekilde işlenmiş. Senaryosu gayet yeterliydi ve işlenişi çok güzeldi. Dikkat edin Catwoman kendisine aşık edebiliyor."
    },
    {
      "rating": "9",
      "text": "The monstrous Penguin (Danny DeVito), who lives in the sewers beneath Gotham, joins up with wicked shock-headed businessman Max Shreck (Christopher Walken) to topple the Batman (Michael Keaton) once and for all. But when Shreck's timid assistant, Selina Kyle (Michelle Pfeiffer), finds out, and Shreck tries to kill her, she is transformed into the sexy Catwoman. She teams up with the Penguin and Shreck to destroy Batman, but sparks fly unexpectedly when she confronts the caped crusader."
    },
    {
      "rating": "7",
      "text": "Batman did return, but not as strong. Who are you really going re-watch Nicholson Joker or Devito Penguin?"
    },
    {
      "rating": "8",
      "text": "Tim Burton's Batman Returns is a sequel that turns out to be even better than the first. Michael Keaton is once again, outstanding as Batman. Danny DeVito was great as an insane and psychotic version of the Penguin. Michelle Pfieffer was also great as Catwoman. In the end, I think I actually like this film even more than the first. My rating would be 8.9/10"
    },
    {
      "rating": "6",
      "text": "Madness Toned Down.Batman ReturnsBurton's one more take on this dark DC universe can be categorized as our guilty pleasure, similar to its predecessor. And similar to it, the writers are basically shooting in dark, with banal sequences and characteristics- that may or may not work- they are moving with an incredible pace to reach in an also rushed climax. It is big mix bag. It has flaws, it is off putting at times, but then it is also entertaining and smart where it touches few unexpected mature notes, basically the heart is in the right place, no matter where the craft resides. And among many characters, the most avant-garde and unstable is Pfeiffer's Catwoman.Infamous for her role in this film throughout her career, one can easily spot where the audience go berserk over her performance, it fluctuates frequently from being exceptionally good to eerily questionable. I would blame writers for installing not-so-practical acts on her basket and other multiple odd gatherings and chalky conversations. Still her range of melting down within a snap and then regain power with a maniacal laughter ought to be eye popping. The technical department, obviously, feels short handed since it doesn't hold up with time; the make-up design is really fine though.DeVito does carry on the passed torch by Nicholson, with a creative and vivid body language that does most of the performance for him and with some good monologues and speeches, he manages to safely board the train. Keaton has always been the weakest link on the franchise, he may ooze the charisma of a billionaire but on terms of merit, there is a long way to go for him. Batman Returns but only for fans, with few awe inducing moments and brilliant supporting cast, the franchise is still gullible in Burton's overly decorative world."
    },
    {
      "rating": "9",
      "text": "A great sequel and a great Christmas themed movie. Scrooge and evil Santa battle the unlikely duo of the cat and the bat. Tim burton caps off his caped crusader run with near perfect execution."
    },
    {
      "rating": "6",
      "text": "Batman Returns is just about as good as the first one. A really great and charismatic villain (The Penguin, played perfectly by Danny DeVito), and some really entertaining action sequences. However, it also falls into some of the same problems as the '89 Batman like the new love interest, Catwoman, who really only serves to give Batman a bat-boner. Still, like the first one, it's an okay film to watch."
    },
    {
      "rating": "8",
      "text": "One Of The Best Batman Movies.Good Story,Great Acting,Good Musics.Athmosphere Is Very Strong.Best Comic Accurate Gotham Cıty Ever Made.Very Good And Underrated Movie"
    },
    {
      "rating": "9",
      "text": "I love this movie. This is one of my favorite Batman adaptation a whole time. Master Burton created fantastic Christmas Batman Movie with fantastic atmosphere."
    },
    {
      "rating": "9",
      "text": "Burton largely solves the problematic casting of Keaton as Batman by sidelining him. Instead, DeVito and Pfeiffer chew the scenery until there's almost none less. A good, dark, Burton movie. Far outstrips any of the Batman movies either before or since."
    },
    {
      "rating": "9",
      "text": "Eat floor, high fiber.Batman Returns is honestly amazing, the plot for this movie is honestly great. It's pretty much about this entrepreneur who is called Max Shreck (Christopher Walken) teaming up with the well known Penguin (Danny DeVito) to cause loads of disruption in Gotham City.The Movie's got a brilliant cast of actors/actresses throughout this movie, I would honestly have to say the main characters are brilliant throughout this movie, they would have to be Batman/Bruce Wayne (Michael Keaton), Penguin (Danny DeVito) and Catwoman (Michelle Pfeiffer) those three are honestly brilliant in their roles.The main characters are honestly great with their dialogue throughout this movie and the characters throughout this movie are pretty memorable, so that's another positive from me.Also, this movie is pretty quotable either that being from Batman or The Penguin, I feel like this adds a little bit more to their characters throughout this movie and it makes them feel more enjoyable and memorable throughout this movie. The action sequences which Batman has got throughout this movie are very unique, clever and they've even got a good bit of comedy dashed throughout them, which I really liked about them. Even, the action sequences which the Penguin and Catwoman have got throughout this movie are quite graphic and they're honestly really well done. Those action sequences are very well made and the same goes to the Batman ones as well but the Batman one's aren't as graphic as The Penguin's and Catwoman's ones. Finally, the movie really captures Gotham City quite well and it shows us even more than we seen in the first one but it shows us how dark the city really can be, which I really liked.The score is composed beautifully by the man, the myth and the legend Danny Elfman, he makes such a beautiful score for this movie and it works very well with the scenes which they've been placed with.The only negatives I've got with this movie would have to be a certain scene with Catwoman and another scene with Batman.The first negative I've got with this movie would have to be the first scene we see of Catwoman when Batman comes to the rescue, there's a moment throughout the scene where in my opinion she feels sort of out of character but the rest of the movie she's amazing.The last negative I've got with this movie would have to be Batman acting like a robot during a certain fight scene but apart from those two little negatives to the movie, it was a brilliant Batman movie.Overall, Batman Returns is honestly brilliant as a Batman movie, the movie's got a great plot, a brilliant cast, great dialogue, quite quotable, very memorable characters, unique, graphic and clever action sequences. It even shows us more of Gotham City and it's got a beautiful score composed by Danny Elfman. I'd honestly recommend to watch this Batman movie straight after Batman (1989), it's honestly worth the watch."
    },
    {
      "rating": "10",
      "text": "How can anyone resist this dark  but sexy and great acting casting movie. This is batman.  This movie wakes up my child hood cartoon days, and wakes up my adulthood batman remembrance of what batman really is. Dark, deadly and friendly fun. It does not get better. Great job, they dont make them like this anymore and they never will."
    },
    {
      "rating": "8",
      "text": "The only other great batman movie. Not as much action but still was a really good movie."
    },
    {
      "rating": "7",
      "text": "It's very dark but very good I enjoy it in moderation but it's not as good as the 1989 one."
    },
    {
      "rating": "8",
      "text": "Batman Returns is even better than the previous movie from 1989. We added Catwoman here and instead of Joker there is Penguin, who is not so good, but he is still good. The story is excellent again. The action scenes are even better this time and overall it's an excellent sequel."
    },
    {
      "rating": "8",
      "text": "Michael Keaton'lu Batman devam filmi, ilk film kadar güzel fakat filmde güzel olan tek şey bunlar değil. Michelle Pfeiffer güzelliği var filmde sırf bunun için bile izlenir. Oyunculuğu muhteşem. Catwoman ruhunu bu kadar yansıtan ve filme ekstra keyif katan muazzam bir oyuncu. Film akıyor genel olarak."
    },
    {
      "rating": "8",
      "text": "This movie was a great! But the 1st one is great! The 3rd one is good! But the 4th one sucked"
    },
    {
      "rating": "7",
      "text": "@cc1dent@l 1n$p1r@t10n$ f0r 2016 G@me e$ 0bv10u$ judg1ng by te@ t1tle$ t00 btw."
    },
    {
      "rating": "10",
      "text": "\"I want directors to have less creative freedom in my superhero movies\" - said the mindless drones (Channel Awesome contributors probably).Tim Burton made a big budget superhero movie that is unmistakably his own, an aesthetic vision infused with Batman mythos and a poetic narrative.A privilege not many directors have, and some hold that against him. A trio of psychologically messed up characters playing off each other is terrific.Michelle Pfeiffer is THE Catwoman, no other actress comes even close. Danny DeVito's Penguin is an equally despicable and pitiful creation.Fanboys love to whine about comic accuracy only when it suits their arguments, despite the fact that every Batman movie has deviated from the source material.Batman gatekeepers are the most entitled nerds on the planet. You can like or dislike whatever you want, but to have that as your reason for lambasting Burton just shows how hypocritical you all are."
    },
    {
      "rating": "8",
      "text": "One of the best Batman exclusive movies. Michael Keaton showed well that he can be very violent. Penguin characterization and how the cat enters is best done. The relationship between Batman and Ketoman is beautifully illustrated and will surprise you.One of the problems with the film is that Bruce Wayne Michael Keaton has low self-esteem in the film, and this is one of the weaknesses. The storyline of the film is very beautiful and you will see holes in the film with little hesitation. Moses The text of the scenes that Batman enters is very memorable and takes you to the top."
    }
  ],
  "recommendations": [
    "batman",
    "batman_begins",
    "the_batman",
    "batman_forever",
    "the_dark_knight",
    "spider_man",
    "the_dark_knight_rises",
    "the_incredible_hulk",
    "superman_returns",
    "spider_man_homecoming",
    "beetlejuice",
    "the_amazing_spider_man",
    "daredevil",
    "charlie_and_the_chocolate_factory",
    "frankenweenie",
    "halloween_4_the_return_of_michael_myers",
    "the_lego_batman_movie",
    "reign_of_the_supermen",
    "robin_hood",
    "thor",
    "dark_shadows",
    "spider_man_far_from_home",
    "indiana_jones_and_the_last_crusade",
    "mad_max_beyond_thunderdome",
    "sin_city_a_dame_to_kill_for"
  ]
}