{
  "id": 1346,
  "title": "Batman",
  "starring": [
    "Michael Keaton",
    "Jack Nicholson"
  ],
  "runtime": 126,
  "genre": [
    "Fantasy",
    "Action",
    "Crime"
  ],
  "description": "Batman must face his most ruthless nemesis when a deformed madman calling himself \"The Joker\" seizes control of Gotham's criminal underworld.",
  "releaseYear": "1989",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/cij4dd21v2Rk2YtUQbV5kW69WB2.jpg",
  "categories": {
    "plot": 7.756756756756757,
    "acting": 7.815789473684211,
    "ending": 8.8,
    "soundtrack": 9.0,
    "cinematography": 7.0,
    "familyFriendly": 6.0,
    "funny": 8.9375,
    "action": 8.933333333333334
  },
  "reviews": [
    {
      "rating": "10",
      "text": "best Michael Keaton movie ever!"
    },
    {
      "rating": "9",
      "text": "By no means is this is a"
    },
    {
      "rating": "8",
      "text": "The blockbuster that started it all. It may not be the first superhero film, but it sure was the first that was a genuine phenomenon.  So much so that it eclipsed the movie itself.  The T Shirt with the BAT symbol...the Prince soundtrack...the endless merchandise.  How about the movie itself? It always was an unconventional film, from its choice of male cast (comedian Michael Keaton) to its Blade Runner influenced Art Design.Yes.. the narrative took strange turns, the fighting scene looked really stiff. But the spectacle is still present, two decades after its release. While the Nolan trilogy brought the Dark Knight to the 21st century, Tim Burton's version was the first super hero film that showed the true potential of the genre. Not the best, but still pretty great stuff."
    },
    {
      "rating": "10",
      "text": "Due to its' creativity, fantastic story and characters, Tim Burton's Batman is a fantastic superhero movie that I will never get tired of, and, in my opinion, Tim Burton's masterpiece."
    },
    {
      "rating": "10",
      "text": "Batman is still one of the best superhero films ever made it has a perfect cast with some sweet visuals and action sequences and an iconic performance from jack Nicholson as the joker and Michael Keaton as Bruce Wayne/Batman definitely one of my personal favourite movies!."
    },
    {
      "rating": "9",
      "text": "This was the first big budget Hollywood production of a live-action Batman movie not including the serial from the 1940’s or the campy movie from the 1960’s starring Adam West. It is presented as a darker story than the original comic series, as the Batman comics were starting to explore more mature themes in the 1970’s and 1980’s with graphic novels such as The Killling Joke and The Dark Knight Returns. The film is set in the fictional Gotham city, which is constructed using visual effects for the film. The city is a cool setting, with gothic architecture and towering skyscrapers and bustling city life with traffic, hookers and panhandlers. There is a good tone-setting scene at the start of movie where Batman confronts a couple of thugs who mug a family in a sketchy part of town. At the start of the movie, Batman is a mysterious vigilante who little is known about and kind of seen as a urban legend. He hasn’t started his relationship with Commissioner Gordon yet. Beautiful blonde photographer meets billionaire playboy and philanthropist owner of Wayne Enterprises Bruce Wayne at a party at Bruce’s mansion and tells him she is trying to get pictures of Batman for the Gotham Times. She and Bruce start dating and sleep together, little does she know that he is the caped crusader himself. Meanwhile, mobster Jack Napier, a wise-cracking goon who is having an affair with Mafia Boss Grissom’s young mistress is set up to break into Axis Chemicals, a factory that has ties to the mob, just to be confronted by dirty cop Lieutenant Eckart and his police squad, based on Harvey Bullock from the comics. Napier kills Eckart and almost manages to escape, but is apprehended by Batman who ends up making him fall into a vat of chemicals or acid although he tries to save Napier. Napier survives this and is left at a cheap emergency clinic where the doctor does surgery on him to get rid of the damage done by the chemicals. The procedure was done so poorly that it result in Jack Napier having something that looks like a permanent grin on his face. Also, now Jack’s hair is green, his lips are ruby red, and his skin is bleached white. He looks like a clown. In despair after he sees his reflection, Napier begins to laugh maniacally in a chilling scene at the clinic and leaves to cause mayhem. He starts calling himself the Joker, kills Boss Grissom, and takes over the mob. Joker utilizes weaponized clown props such as an electrocuting joy buzzer, an acid spraying flower, a spring-loaded boxing glove, and guns that he can stretch into hand-canons which also sometimes just eject a flag that says “bang.” The rest of the movie is pretty much just the Joker causing mayhem and Batman preventing it. Vicki Vale learns that Bruce Wayne is Batman by the end of the movie and she chooses to stay with him. Batman also learns that Jack Napier was the true killer of his parents when he was a child ( as opposed to Joe Chill like in the comics) and makes the connection to the Joker. He stops the Joker from attempting to gas the city streets with Smilex gas, which causes people to start laughing uncontrollably and die laughing and then kills the Joker. I liked the movie’s depictions of Bruce Wayne and his alter ego Batman, Joker, Alfred, and Vicki Vale. It was good how they actually established that the Joker was proficient in chemistry as he is in the comics, and the Joker was funny in the movie often making quips and saying punchlines. The Joker’s origin was similar to his origin in the comics as the Red Hood, although the film took some liberties in making him a mobster named “Jack Napier.” Sometimes in the comics, when Joker’s real name from his past is alluded to it is “Jack.” Michael Keaton’s performance as Batman is probably my favorite out of all the Batmen I have seen in the movies, as he doesn’t go too over the top but still manages to seem imposing. A classic, this might be my favorite Batman movie other than maybe The Dark Knight from 2008 which incidentally also stars the Joker."
    },
    {
      "rating": "8",
      "text": "The first time that Batman is seen on screen in this way leads to a darkly funny comic book film.  Michael Keaton and Jack Nicholson give good performances and Tim Burton continued a solid early career."
    },
    {
      "rating": "10",
      "text": "Nostalgia can be a very powerful thing.  I admit that.  This was the first VHS I ever owned as a child, and I remember it very fondly, even the preceding Warner Brothers ad starring Bugs Bunny and Daffy Duck.  I have re-watched Tim Burton's 1989 adaptation of Batman several times, and even after re-evaluating the film as an adult, I still believe it to be the best Batman film to date.  I was too young to comprehend or care about the controversy surrounding the casting of Michael Keaton as Bruce Wayne, or Nicholson working out a deal regarding the movie's profits.  I didn't care about any of that.  And honestly, I still don't.  This is simply one of my favorite comic book movies of all time that I rarely tire of watching.  The tone is dark and brooding, which is a far cry from the campy Batman television show/movie that came before it, starring Adam West. The story is quite grim, and Gotham City is a bleak, crime-infested place that is visually accentuated with hues of black and grey, a lot of grey. Nicholson and Keaton play their parts very well, with Nicholson being the stand out as Joker. The supporting cast is also stellar, particularly Kim Basigner, as the determined photojournalist who is investigating Batman.  The plot is straightforward, and the pace is good, if somewhat slow.  But the action scenes are amazing, and are all accentuated with Danny Elfman's brilliant score, which sets the mood perfectly throughout the film.  Director Tim Burton did an extraordinary job with this movie, and as terrific as his sequel Batman Returns is, Tim Burton's first attempt at Batman was his best.  There's not much to dislike here. Even though Christopher Nolan's Dark Knight Trilogy was better received critically and by fans, I never cared for it that much. For me, Batman 1989 is the only Batman movie I'll ever need."
    },
    {
      "rating": "10",
      "text": "This is the first great super hero film. It holds up very well even approaching 30 years into the future. It also introduced the world to Batman the way he is meant to be seen: a creature of the night, fighting against dark, twisted characters.Michael Keaton and Jack Nicholson deliver flawless performances, creating the iconic Batman/Joker cinematic rivalry."
    },
    {
      "rating": "10",
      "text": "I was blown away by the storyline and the amazing acting by all the actors in this film, especially from Michael Keaton and Jack Nicholson. I happily give this film full points. Much better than the Adam West 1966 Batman. Definitely exceeded my expectations. I highly recommend Batman."
    },
    {
      "rating": "10",
      "text": "Tim Burton's BATMAN was made in 1989 by Tim Burton obviously and stars Jack Nicholson, Kim Basinger, Jack Palance and Michael Keaton..... Jack Palance in Batman looks the same as he does in Tango & Cash and his performance is quite similar and he's not a great actor but his character in the movie worked... Batman for a 1989 film is cleverly directed and made and some of the film is pretty dark, some of the villains are laughable like Joker's troops because they seem a bit sloppy and not up to standards, as far as Jack Nicholson's role as the Joker was concerned he did a great job and certainly the best movie villain ever... Batman is full of great stunts, chases, shootings, fights, explosions and twists and turns that keep the viewer entertained from start to finish. The acting overall is pretty good and some scenes are hilarious like Bob the goon who works for the Joker because he gets asked by the Joker for his gun then the Joker kills him so some of the Joker's men are a bit dumb bit still a classic and a masterpiece of film making by Tim Burton... The action scenes are excellent and the story is okay so I've no negatives really to say about the movie because it's near perfect for me. The best Batman film ever made and that will never change."
    },
    {
      "rating": "10",
      "text": "The first of the dark, brooding superhero movies.Tim Burton's gothic tone, with just a touch of camp, combine beautifully in this classic.One of 1989's best movies."
    },
    {
      "rating": "10",
      "text": "“Batman” is such a great movie movie.  Every scene is iconic.  I wish I knew the secret for pulling this Tim Burton out for every project, but, alas, the world will forever have to take its chances, never knowing until too late if they will get the “Batman” Burton or the “Mars Attacks” one.  I give it an A, make a point to go see this movie."
    },
    {
      "rating": "8",
      "text": "Adapts the comic book to the screen in a very dark, almost ghoulish (Tim Burton) style, that remains relatively faithful to the basis of the comics. Jack Nicholson is the iconic Joker, though he is out-acted by Heath Ledger. Michael Keaton proves by far the better Batman than any other Bruce Wayne's (Clooney, this is directed towards you). The story keeps you interested, and the ending doesn't disappoint. Two on the list of best Batman movies."
    },
    {
      "rating": "7",
      "text": "'Batman' is a movie that's seen many times, and while it certainly is a classic, it does have its flaws, mostly in the central characters.\r The movie stars Jack Nicholson as the Joker, and Michael Keaton as the title character. Yes, it is in that order as well. Directed by Tim Burton, the movie has his own unique style with colorful characters and a darker, gloomy tone to avoid the camp-style of the Adam West \"Batman\" from the 1960s.\r The plot revolves around Batman trying to catch the Joker from injecting Gotham city with crime, and exposing the citizens to some Smile gas which incidentally transforms the people into what the Joker has become. The Joker became the crazy maniac that he is after he fell into a pool of acid which disfigures his face to form a permanent grin. Nicholson gives a great performance as the crazy Joker, but having seen the movie recently, it almost seems as if he might be over-acting his role. The loud, maniac laughs and the over-the-top delivery of some of his lines can seem a little problematic.\r But this is in no way Nicholson's fault, like I said, he did a fantastic job in the role... Director Tim Burton has been known for animating his characters on screen. Not just with the pale face make-up, but possibly how he tells his actors to deliver their lines. A huge part of the Joker's performance is obviously influenced by Tim Burton's vision.\r Michael Keaton is great as Bruce Wayne/Batman, but we don't delve that deep into his character. It has been said many times by other critics that this is Jack Nicholson's movie, and not Keaton's. This is true, we get more of a Joker origin story rather than the title character. This may be due to the fact that the screenplay, written by Sam Hamm and Warren Skaaren were so focused heavily on creating such an iconic villain, that they got lost in translation and forgot who the movie was for in the first place.\r Other than this, 'Batman' is a visual treat, a thrilling adaptation of the Caped Crusader of Gotham city, it does feel a little jarring that we get a glimpse of Bruce's childhood/origin story almost half way through the movie, but, when you have fun with what Burton presents you with, it's hard to stay mad.\r Overall, if you want a good Batman movie, this will deliver what you might want. The actors' performances outshine the overall story."
    },
    {
      "rating": "8",
      "text": "While not as good as the dark knight trilogy, this is still the batman movie fans have wanted, well in the 80\"s. With a great cast, story, and entertainment, this is one batman fans should not miss."
    },
    {
      "rating": "10",
      "text": "A legendary achievement of making Batman dark on screen. Well done by Tim Burton. Michael Keaton was a great Batman and Jack Nicholson killed it as the Joker. Amazing dynamic between the two in this class movie. It is a stunning masterpiece."
    },
    {
      "rating": "8",
      "text": "Batman's 1989 role as Michael Keaton is an excellent film. The story is excellent and the action scenes are also surprisingly very well filmed at the time. The very best thing about the film is the atmosphere, which was a success here, and overall it's an excellent Batman film, and if you're a DC fanboy, you have to see this."
    },
    {
      "rating": "8",
      "text": "Michael Keaton'ın muhteşem oyunculuğu, yılına göre görselliğiyle düşünüldüğünde bugün bile izlenebilecek ve keyif verecek bir film. Bugünün CGI şartlarını tabi ki sağlayamaz ama çok sevdiğim bir Batman filmidir."
    },
    {
      "rating": "9",
      "text": "This movie is the best Batman solo movie so far. Michael Keaton as Batman and Jack Nelson as the Joker shine. The film is very loyal to the originals and the characters are excellent. The duality of Batman and Bruce Wayne is best illustrated. One of the points that bothers you in the film is the comic part: Why does Batman know about the identity of the Joker? Why was it the Joker who killed Bruce's parents? These twists were very extra. In general, Batman 1989 is an action, enigmatic and very attractive film that creates a very pleasant atmosphere of the film and a lot of symbolic scenes. Tim Burton Tosente shows a fascinating world of Batman in his own style, which ends in a fascinating ending."
    },
    {
      "rating": "9",
      "text": "What makes \"Batman\" impressive is the unpredictable creativity and live art director Tim Burton mixes in with the original idea. Very impressive and well made."
    },
    {
      "rating": "10",
      "text": "Nicholson and Keaton are excellent in Batman. The action is very cool and all the cast fit their characters.\rKeaton should've stayed with the Batman franchise but he dropped out of it after the sequel. Batman\ris one of smartest comic book movies ever made."
    },
    {
      "rating": "4",
      "text": "Perhaps it is because I saw the Nolan films first but I was unimpressed with the lack of plot and the mix and match thing they've got going on with the set. Keaton was decent and Nicholson a redeemer, but I maintain there was a negligible storyline and the poor pacing results in a film that is not engaging."
    },
    {
      "rating": "10",
      "text": "Quite simply the best Batman movie ever made, the sequels were not great except Batman Forever which was pretty good.... Tim Burton's original batman movie made in 1989 mixes violence with humour which works. Batman is a good film and Michael Keaton as the caped crusader is good and Jack Nicholson is excellent as the perfect villain (The Joker). Batman contains some of the best action scenes ever made and is pure genius!"
    },
    {
      "rating": "1",
      "text": "I was 15 when I heard they were making a Batman movie.  I couldn't wait.  I went out and bought all of these Batman comics to prepare myself for this monumental occasion.  Then the news starting pouring in.  Tim Burton was directing.  REALLY???  The director of Beetlejuice was directing???  Then came the announcement of Michael (Mr. Mom) Keaton as Batman.  WHAT???  Are you **** kidding me?  It just got worse from there, but as a kid, I still had to see this for myself.  I was there at the first showing with the rest of the poor suckers hoping to see a good superhero movie.  Boy were we wrong.  Wrong in the worst way.  There is no way that someone can do this much stupid by accident!  The acting was atrocious, no story, the worst Joker of all time, a rubber Batman costume, a city painted black, and a director that didn't seem to give even one **** about what he was doing and how many people he was hurting.  The only way anyone could possibly like this movie is if they are legally retarded, or this is the fist movie that anyone has ever seen!"
    },
    {
      "rating": "10",
      "text": "Definitely one of the best looking action films of ALL time. Tim burton is god."
    },
    {
      "rating": "4",
      "text": "Good for children and little more, Tim Burton's vision of Gotham is underwhelming. Every set is either boring or art designed to death. The score is legendary, but can't save the wooden acting of all but one cast member - Jack Nicholson, who turns in an all-time great performance as the villain, the Joker. He gleefully steals every scene he's in, and thank goodness for him. The action is overwrought and cloying. Worse, several of its plot decisions (no spoilers here) became cliches that ruined several other franchises, including this one."
    },
    {
      "rating": "10",
      "text": "The best (numero uno) superhero movie of all time. Mops the floor with Batman Begins a thousand times over. Will never be topped."
    },
    {
      "rating": "9",
      "text": "Having seen this on AMC and just bought it on DVD, i can say with some certainty that this is one of the best superhero movies I've ever seen. Jack as the Joker is deliciously evil (could have done without the Prince music though) and Keaton captures the psychological pain of Bruce/Batman. I gave this the same rating I gave to Batman Begins because both EXCEL with strong performances and the serious atmosphere of Gotham. However, it looks increasingly that The Dark Knight will surpass both with an even better cast and a truly menacing-looking Joker (played by Heath Ledger). May Nolan continue to build on the seriousness and quality of, not only Batman Begins, but also Burton's (while maintaining his own style)."
    },
    {
      "rating": "9",
      "text": "The most successful outing of the Caped Crusader before the 2007 smash hit Dark Knight, the 1989 Tim Burton version offers a straight up comic book movie with a crap load of action, explosions and overall mayhem. Michael Keaton stars as Bruce Wayne, a sly and unassuming businessman who by day deals with documents and contracts and who by night is a one man army, stopping crimes all over Gotham City. He forms a relationship with photojournalist Vicki Vale, played sexily by Kim Basinger, who wants to write a story about the Batman legend and crack the truth once and for all. Meanwhile, a citywide spree of madness and murder is being perpetrated by The Joker, played excellently by Jack Nicholson who is perfect for the role. Quite simply, when it comes to portraying crazy people, he is THE best. As mentioned before, the movie was in the hands of extraordinary artist Tim Burton, four years after his big screen debut with the 1985 comedy Pee-Wee's Big Adventure. The movie looks great, and the DVD quality is top-notch for a movie that is nearly 25 years old. I have to say, this movie in particular is the best looking action movie I have ever had the pleasure of seeing. However, the film does have some flaws, my biggest complaint being a sometimes cheesy soundtrack (Prince). In sum, a truly great film experience that all fans of the genre should check it out."
    },
    {
      "rating": "7",
      "text": "While Jack Nicholson is entertaining, he takes much more screen time than, well, Batman. The story isn't as great and there are a few points where the tone can be a bit jumpy.\rHowever, Michael Keaton made a great Batman, the cinematography and art design are both beautiful, and the score by Danny Elfman is amazing.\rIt's a flawed, but satisfying superhero movie."
    },
    {
      "rating": "8",
      "text": "Brilliant movie, made in different more innocent time. Tim Burton's unique style works perfectly with Batman. Jack Nicholson is still one of best Joker's ever and Michael Keaton as Batman even though as a kid i thought it was odd choice has turned out to be one of the best actors to ever don the mantle of Batman."
    },
    {
      "rating": "7",
      "text": "Batman is good. Its hard for me to love this movie given that I’ve seen the later and superior versions of Batman and have been spoiled by so many comic book movies but I appreciate for what it is. This comes from a time when comic book movies were not that common and if they did exist they weren’t taken as seriously as they are today. The fact that a dark comic book movie came out that was good was a big deal and the film did lay the groundwork for future comicbook movies and later versions of the character that I love specifically Batman: The Animated Series as well as the Nolan films. What makes this film entertaining are the characters primarily the Joker with Jack Nicholson giving an excellent performance. If this is your introduction to Batman you’ll probably love this movie but if not you won’t be blown away by it but it is still entertaining. Had this been my first time seeing Batman I would’ve probably really enjoyed it but instead its entertaining. As it is I enjoy the movie and appreciate what it did for comicbook movies."
    },
    {
      "rating": "0",
      "text": "What do people see in this movie? I saw it when it came out when I was a little kid and hated it. Now that I'm an adult, I thought that perhaps I didn't have the ability to appreciate whatever it was that people loved about this movie, so I watched it again. And I still hate it, LOL. I don't know where to begin, frankly, because every aspect of this movie, from the completely unfaithful representation of the comic book characters to the cringingly awkward dialogue and perplexing moment to moment decisions to the stiff and contrived flow of action, made this one of the biggest wastes of time I've spent in a while. I just finished watching the scene where Bruce Wayne confronts the joker in Vicki Vale's apartment. Oh yeah, you fanboys know what I'm talking about and every one of you knows when you saw that scene even your reaction was, \"And Bruce Wayne did that because....?\". That reaction pretty much sums up my sentiments for almost every character in every scene in the entire movie. Don't waste your time with this movie. The new Chris Nolan ones are at least compelling and rational, even if they aren't completely adherent to the comic book themes. Stick with them and may this movie be buried for eternity at the bottom of the $5 DVD bin at your local Walmart!"
    },
    {
      "rating": "10",
      "text": "A fantastic film, with an interesting plot, and the joker has some laughs, but the sad part is, it's only third best in terms of the top (and only) 5 Batman movies. Here, I'll give you the Batman movies in order of the best to the worst with the score I give them. 1. Batman Begins (10) 2. Batman Returns (10) 3. Batman (10) 4. Batman Forever (8) 5. Batman and Robin (3). However, I must agree on the fact that this movie does have a memorable line, \"He stole my Baloons!\" And, of course, who could forget the Joker's question that was answered in the other classic, Batman Begins? \"Where does he get all those wonderful toys?\""
    },
    {
      "rating": "10",
      "text": "I love this film best batman film ever the joker's great and batman's great I don't like the new Dark knight film the joker looks terrible."
    },
    {
      "rating": "6",
      "text": "Decent, but it never quite comes together. Kim Basinger has no screen chemistry with Keaton, while the character arc is oversimplified by turning the Joker into a psychopath and while the visuals are impressive, they're not groundbreaking. Both of these points would be improved upon in Batman Returns."
    },
    {
      "rating": "10",
      "text": "This movie was probably the best superhero movie I've seen. Michael Keaton made the character of Batman a dark and menacing figure of the night which made him my favorite Batman of all time. And Jack Nicolson's portrayal of the Joker was creepy yet genius. I loved the movie all around."
    },
    {
      "rating": "8",
      "text": "First Batman doesn't have the personal moral resonance and depth of Batman begins. However, this films got another card to play...the brilliant Jack Nicholson cranks out the ultimate joker."
    },
    {
      "rating": "10",
      "text": "This film and Batman Returns are the only films to actually explore the psychology of Batman. It doesn't rely on cliche characterization of the title character or heavy handed moralizing either - just a dark and brooding Batman."
    },
    {
      "rating": "10",
      "text": "A masterpiece. It makes every other bat film that has come since then (with the exception of Burton's HIGHLY under rated Batman Returns) look sub-standered."
    },
    {
      "rating": "10",
      "text": "This is the superhero movie of our day and defined the genre. Burton delivered the Batman that Bob Kane envisioned when he first developed the character. Don't listen to the doubters... Michael Keaton IS Batman and Jack Nicholson IS the Joker- both actors are at the top of their game in this film."
    },
    {
      "rating": "10",
      "text": "I saw this movie when it first came out in 1989. To me, this is how action films are supposed to be done. Michael Keaton was a better Batman than even Adam West, and certainly better than Val Kilmer or George Clooney. Jack Nicholson was perfect as the Joker. He was mean, menacing, and very, very funny. Kim Basinger made an absolutely beautiful Vicki Vale. Tim Burton's visual style is astounding. If you want an action-packed film with an uncomplicated plot, \"Batman\" is just what you are looking for. On a scale of 1-10, this movie rates a ten, only because the scale doesn't go to 11."
    },
    {
      "rating": "10",
      "text": "The only film to still capture every essence of my imagination."
    },
    {
      "rating": "8",
      "text": "This movie, for being so old, is nicely done. The cast of Keaton, Nicholson, and Basinger really bring the movie to life."
    },
    {
      "rating": "8",
      "text": "Not as good as Batman Begins, but a pretty great movie nonetheless. However, if Nicholson weren't there to steal the show from Keaton's dull Bruce Wayne, I would probably have given it a lower score."
    },
    {
      "rating": "10",
      "text": "I watched this movie a couple of days ago after so many  years and while Batman's stiffness in his movements kind of gets in the way, the movie is still as spectacular as ever, specially the musical score."
    },
    {
      "rating": "9",
      "text": "The only flaw I can find with this movie is Micheal Keaton, his interpretation of Batman is poorly done, but Jack Nicholson's performance as The Joker easily makes up for this, he really shows the Joker for who he is, a psychotic prankster, all in all if you can put up with Keaton than you have yourself a great movie."
    },
    {
      "rating": "8",
      "text": "Batman is both silly and thrilling at the same time. Fun adaptation on franchise entry, gothic, Tim Burton's style. There were nothing best Bruce Wayne and Batman, and there were no best Batman movie. Everyone has a style. Michael Keaton was terrific."
    },
    {
      "rating": "9",
      "text": "Batman is a truly fine superhero film. It's not just that, though - most of the film more closely resembles an action-orientated film noir, and it has a finale that appears to have been taken straight out of a Gothic horror movie. Michael Keaton is the best film Batman, no question. While I can understand his casting raised a few eyebrows, but his portrayal of Bruce Wayne is very human and sincere, and very likeable, and his portrayal of the Dark Knight is unexpectedly effective, and highly influential (Christian Bale wasn't the first to adopt a different voice for the bat and the man).  His successors never reach the heights Keaton does, with Val Kilmer being too camp and George Clooney being completely lifeless. Jack Nicholson's Joker makes for an extremely entertaining, scary villain. While he will now always be compared to Heath Ledger's Oscar-winning performance, you can't avoid the fact that they're very different roles. Ledger's Joker is uncontrollable and without any clear aim - he's a rabid dog. Nicholson's Joker is a sociopathic gangster with fame on his mind, is far more calculated and aware of what he is doing, and I personally find that far more scary. Like I say, they're different interpretations of the character, and impossible to rank one above the other. Kim Basinger's Vicki Vale makes a good damsel in distress, Michael Gough makes the perfect Alfred, and Jack Palance growls through his lines as another despicable villain, crime boss Carl Grissom. It's such a shame that Billy Dee Williams never got to play Two-Face (as he really wanted to) with his version of Harvey Dent being such an intriguing, ambiguous, image-obsessed character - he would have made a really memorable villain. Like all of Tim Burton's films, Batman is a visual feast, with Gotham city presented as a murky, industrial, crime-ridden dystopian metropolis, but with a striking ahistorical mix of architecture by designer Anton Furst. Appropriately enough for a film which is so influenced by Brazil in its design, the cinematographer is regular Terry Gilliam collaborator Roger Pratt, and his steady, measured filming style marries very well with Burton's dark, focused vision. As well as being a very engaging and well constructed superhero film and crime thriller, Batman has a surprising amount of comedy in it. This isn't the campy, pun-laden humour of the Schumacher Batman films - these are clever, self-aware jokes about social convention (the scene where Bruce Wayne is having a meal with Vicky Vale across a ridiculously long dining table before Wayne admits that he doesn't think he's ever been in this particular room of his vast mansion before is incredibly funny, helped no small measure by Keaton's impeccable comic timing) and the affectionate mockery of the ridiculousness of the source material (two thugs looking over an apparently unconscious Batman wonder who he is, but rather than immediately thinking to remove his mask, one suggests that they should \"check his wallet\"). The addition of humour adds a lot to the film, but never at the expense of story or character. Schumacher took this too far in his films, but Burton gets the balance between humour and seriousness just right. Finally, Danny Elfman's score is among the best of his career, providing a consistent moody and mysterious tone to the film, and creating a memorable hero theme to rival even John Williams' iconic theme for Superman. Batman is a truly great superhero film. So visually striking, it looks like it was torn straight out of the comic books it was based on, and the two most recognisable characters from those pages are brought wonderfully to life by Keaton and Nicholson. The film retains the tragedy and darkness of Batman as a character and the world he inhabits, but never gets carried away with it to the extent that the film becomes depressing. The addition of a liberal dose of humour is a welcome one, and it's nice to see a decent big budget superhero film confident enough to incorporate comedy into its story (something we have seen more of recently, with Iron Man and Thor). A great superhero film, a nice call-back to film noir and Gothic horror of classic Hollywood, and one of Mr Burton's very best - Batman really is rather fantastic."
    }
  ],
  "recommendations": [
    "batman_returns",
    "batman_begins",
    "the_batman",
    "batman_forever",
    "the_dark_knight",
    "spider_man",
    "beetlejuice",
    "the_dark_knight_rises",
    "the_incredible_hulk",
    "indiana_jones_and_the_last_crusade",
    "superman_returns",
    "charlie_and_the_chocolate_factory",
    "frankenweenie",
    "spider_man_homecoming",
    "pirates_of_the_caribbean_the_curse_of_the_black_pearl",
    "sleepy_hollow",
    "the_lego_batman_movie",
    "dark_shadows",
    "robin_hood",
    "daredevil",
    "superman",
    "the_amazing_spider_man",
    "the_fifth_element",
    "indiana_jones_and_the_temple_of_doom",
    "halloween_4_the_return_of_michael_myers"
  ]
}