{"id": 3590, "title": "Batman Forever", "starring": ["Val Kilmer", "Tommy Lee Jones"], "runtime": 121, "genre": ["Action", "Crime", "Fantasy"], "description": "Batman must battle a disfigured district attorney and a disgruntled former employee with help from an amorous psychologist and a young circus acrobat.", "releaseYear": "1995", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/mzzNBVwTiiY94xAXDMWJpNPW2US.jpg", "categories": {"plot": 6.277777777777778, "acting": 5.827586206896552, "ending": 8.333333333333334, "soundtrack": 7.0, "cinematography": 6.0, "familyFriendly": 5.857142857142857, "funny": 6.0, "action": 7.2}, "reviews": [{"rating": "9", "text": "OMG!!!! Jim Carrey actually gave a truly good performance?!?!?! I was shocked that he actually did a good job, this has to be my favorite Batman movie ever, the acting is great as is the plot, this is a truly enjoyable movie for fans of Batman."}, {"rating": "7", "text": "Batman (Val Kilmer) faces off against two foes: the schizophrenic, horribly scarred former District Attorney Harvey Dent, aka Two-Face (Tommy Lee Jones), and the Riddler (Jim Carrey), a disgruntled ex-Wayne Enterprises inventor seeking revenge against his former employer by unleashing his brain-sucking weapon on Gotham City's residents. As the caped crusader also deals with tortured memories of his parents' murder, he has a new romance, with psychologist Chase Meridian (Nicole Kidman)."}, {"rating": "7", "text": "I am still divided if this is a good movie or more in the so bad that it is good category. It might be both at the same time but I will not deny that it is entertaining and has some great moments but also some weaknesses. After Batman Returns missed Warner Bros. box office expectations and complains that it was too dark some changes were made for the next movie. I will say they made this one more colorful, used more humor and toned down the more matured parts. Actually I view this as a restart even if it is not a reboot. This time Batman has to deal with Two Face who was the former district attorney Harvey Dent. An acid attack left half of his face disfigured and drove him towards crime and insanity. He blames Batman for this as he could not stop this attack. Meanwhile scientist Edward Nygma who is a researcher at Wayne Enterprises has developed a new device that can beam television signals directly into a persons brain (Sidenote: This is actually more scary than most horror movies ever could be. Think of non stop commercials and this is the stuff of nightmares). However he is rejected by Bruce. Meanwhile a circus is in town and the acrobat Dick Grayson will experience something he never would have imagined. With this the story starts and I will stop here to avoid spoilers. The story works and is a vehicle for the action and characters. However it is neither that great nor reinventing the wheel. Batman the animated series did set up and use these characters far better and I think some of those episodes could be used for a better movie. To be fair it is also not bad and they know what they are doing. The characters are similar to the story. They work and are enjoyable but also they are not that great with some exceptions. Lets start with Batman aka Bruce Wayne played by Val Kilmer. Michael Keaton did not want to return so another actor has to fill the shoes. I think Val Kilmer would work great but is hold back by the script. Tommy Lee Jones does a fantastic job as Two Face and this deserves credit as with his costumes it is hard to take him serious (This could just be me to be fair). They miss a critical aspect of his character here. Two Face is Bruce Waynes greatest tragedy in a certain way. He could neither safe him as Batman nor as his good friend Bruce Wayne. However he still works. Jim Carrey as Edward Nygma is amazing. The role was made for him and his style. If you like his usual performance than everything is fine. If not than this is a disaster for you. I liked his performance and clearly see how much he enjoyed the role. Chris O’Donnel as Dick Grayson delivers mostly a good performance but there are some scenes that are awful for his character. Then we have Nicole Kidman as Dr. Chase Meridan. Maybe too much damsel in distress but is really good otherwise. The rest of the cast gives a solid performance. I am divided here as we have good actors without a doubt. But I have seen those characters done better and the script harmed them too sometimes. Visually or presentation wise the movie has its own style. It looks familiar but more colorful. Some of the costume choices are bad and fail for me. The soundtrack by Eliot Goldenthal was really good. It had some songs that are still played today in the radio like “Kiss from a rose” by seal and to a lesser content U2s “Hold me, thrill me, kiss me, kill me”. Other than those I liked “Smash it up” by The Offspring and Methods Man “The Riddler”. A good soundtrack and worth owning. Overall I like this movie but it will not end in my top movie lists. It is enjoyable but not awesome and I think a 7/10 is fair."}, {"rating": "7", "text": "I can see why people don't like this (and obviously B&R) when compared to Burton's movies. But I honestly really enjoy this. Val is a good Batman, Tommy Lee Jones rocks as a bad guy & Nicole Kidman is stunning! I think the weak link is actually Jim Carrey, who I found far more annoying than I remember him being when I saw this as a kid. He's not Jared Leto in Suicide Squad level of bad, he has some very funny bits, but he doesn't suit this at all.For a decent halfway between serious and stupid I think this has it."}, {"rating": "7", "text": "The Riddler (Jim Carrey) is **** amazing, he gives a really good performance from start to finish and you can tell he's having so much fun in the role of the Riddler. Also, another positive I've got with this movie would have to be some of the camera work which is used for Batman (Val Kilmer) from it being in a fight scene or so on. Finally, the problems I'd say I've got with this movie would have to be the out dated CGI effects in certain scenes throughout this movie and especially the use with green screen in this movie."}, {"rating": "5", "text": "After two great Batman films, Tim Burton had left the series for good. It was now up to Joel Schumacher to mach up with the same level as the previous two films. The result is not bad, but doesnt match up to 'Batman' and 'Batman Returns'. If you have never seen this movie before, it is still allright, but i would suggest to skip the previous two films, or even better, 'The Dark Knight Trilogy\"!"}, {"rating": "3", "text": "If there is anything good to be said about this film, it is that it makes the first two Batman films seem better! The plot is easier to follow but loses a lot of the emotion that is behind the character of Batman which in retrospect, was covered well in the first two films. I could feel my respect for Tommy Lee Jones disappear but it has to be said that Jim Carrey was at least good at doing what he does best (which... I didn't say I liked).More accessible to a wider audience, but ultimately it crushes the spirit and distorts the world of Batman!"}, {"rating": "10", "text": "Even with a simple plot, the film is a classic due to Jim Carrey and his performance. The Tommy Lee Jones version of Two-Face looks like a \"half-brother\" of the Joker if he got drunk on Madison Square Garden."}, {"rating": "5", "text": "\"Batman Forever\" is a movie that offers popcorn action and decent fun from Jim Carrey; basically you have to see the film as a ADHD in order to love the style."}, {"rating": "7", "text": "Better than they say... Mostly because of Jim Carrey. He is to the Riddler what Heath Ledger was to the Joker. Val Kilmer is nowhere near as good as Michael Keaton but he was decent enough. I did laugh a few times and though I prefer Burton's style, it was still pretty good. Fun for fans of Jim Carrey and the 1960's Batman. That's not to say it's all lighthearted though... There are definitely dark elements in it."}, {"rating": "9", "text": "this movie was great! but some people hated it! but i liked this movie! but batman and robin sucks!"}, {"rating": "9", "text": "Batman Forever is an amazing action packed film with more gadgets than some James Bond films.\rThe film has a great way of introducing the main characters. For example in the opening scene the film introduces Two Face, (Tommy Lee Jones) by showing how evil he is when he kills one of his own henchmen and tries to kill a cop. This opening scene also introduces Batman (Val Kimmer) as heroic because he saves the cop's life. Although I felt that the cop in this scene wasn't a very good actor. But the scene ends on a high note when Two Face escapes alive and this makes you wonder how Batman will stop him.\rThe film has quite a simple plot where Batman tries to stop the evil Two Face and his insane side kick, the Riddler. This simple plot stops the viewer from feeling lost and confused like they may do in a film with a complicated plot.Another example of the great way the film introduces characters is the scene where the Riddler (Jim Carrey) is introduced. The Riddler is introduced in a good way because when he writes his 1st riddle it fills the viewers mind with mystery and a sense of trying to figure it out before the end of the film. When Jim Carrey plays the Riddler the role is unique and makes you realize just how good an actor Jim Carrey really is because as well as playing a great comedian he can also play other roles. In this role\rThe special effects are also very good in a car chase scene where Two-Face's henchmen chase Batman in his bat mobile. In this scene the special effects make the driving stunts in the car chase seem very realistic.\rBut the action in this film can sometimes seem too violent which might shock the viewer because the film is only rated PG.\rOn the other hand the film does keep the viewer interested until the last scenes where Batman has to make a life changing decision and when the Riddler threatens to tell the whole world who Batman is.\rI would recommend this film to young adults and anyone who likes a good superhero film. I would rate the film 9/10."}, {"rating": "9", "text": "My favourite batman film proper entertainment just wished Kilmer stayed in the role for batman and robin."}, {"rating": "0", "text": "This film is just so stupid. The script and overacting complete ruins the potential of this film, Not to mention that the entire film looks like you are on LCD."}, {"rating": "4", "text": "Oh boy... I really like Batman Returns, but since the parents hated its dark tone so much, Joel Schumacher was forced to make the series more kid friendly.\r I hate those parents.\r It's kind of depressing to see the dark tone disappear and have the series be this ridiculous. I like Val Kilmer, but he is so boring to watch. Jim Carrey is the highlight, but Tommy Lee Jones can be really irritating. The flashing lights and obnoxious sound effects doesn't save this boring movie...\rAlso, Bat Nipples."}, {"rating": "5", "text": "Better than Batman & Robin, but still a mediocre film. It tries too hard to combine Tim Burton's characters with their campy earlier versions. The result is an unsatisfying movie that's more of a product than an actual piece of decent scripting."}, {"rating": "10", "text": "The best sequel to 1989's original by miles....  Joel Schumacher brings us BATMAN FOREVER which was made in 1995 and contains high sex appeal as we get to see Drew Barrymore looking incredibly hot and Nicole Kidman who's irresistible!!! Val Kilmer does the Batman duties in this film lol and we are introduced to villains two-face (Tommy Lee Jones) and the Riddler (Jim Carrey). The action scenes are well done and this film for some parts feels like a romance because of all the interaction between Nicole Kidman and Val Kilmer. This film is enjoyable and directed beautifully and the villains are good besides Jim Carrey being a bit over the top at times. There's explosions and lots of action and Drew Barrymore was a delight to see and her and Nicole Kidman made this film feel more beautiful than it actually was. Great acting, impressive vehichle designs and stuff and decent acting. This film is almost perfect."}, {"rating": "10", "text": "The best of all five batmans jim carrey rules."}, {"rating": "7", "text": "Not as dark and not as good as the prior two Tim Burton films but still entertaining to watch. Jim Carey absolutely steals the show as The Riddler. Joel Schumacher was asked to replace Tim Burton to make more kids-friendly versions of Batman movies by Warner Bros under pressure from parental groups. (WTF? I don't remember the Tim Burton films being that bad.). Unlike \"Batman & Robin\" which imo is the worst Batman movie of all time (including the Adam West movie being better) Batman Forever was not bad. I think Jim Carry saved this movie from being a flop..."}, {"rating": "4", "text": "I got to say, this movie is so much better than some of the other Batman movies, but this isn't a good one. The acting from Carrey is to be what is expected from him. I'm not a big fan of his movies, so I wasn't too thrilled to see this movie. The bar was raised, but just a little."}, {"rating": "0", "text": "Después de Batman y Robin está es la peor lo único rescatable es la actuación de carrey"}, {"rating": "10", "text": "Hard Core and Superb."}, {"rating": "1", "text": "Absolute rubbish Two - Face Was a joke, Robin was pathetic and Batman was cluless the only meancing villian was the riddler."}, {"rating": "2", "text": "Not the worst of the bunch, but I wonder what Joel Schumacher was thinking when he took over the franchise. Gotham was never to bright and lively and full of neon in the comic books. And ummmm DZ I think you are reviewing the wrong movie bud."}, {"rating": "9", "text": "Tommy Lee Jones and Jim Carrey saved this movie from becoming a total disaster."}, {"rating": "10", "text": "I liked it. I understand a couple of those negative reviews though. I 'm a big Jim Carry fan so that's probably why I took to it right away. It was a little cheesy and after seeing Batman and Robin (which made me barf) it seems a lot better."}, {"rating": "2", "text": "This Batman movie is basically mocking itself by even existing. With stupidity and awful acting and a stupid villain who was horribly miscast along with weak action you have a spoof of a great superhero. I give this movie 25%."}, {"rating": "10", "text": "Nostalgia"}, {"rating": "6", "text": "[4/9 Batman Marathon]\rBatman Forever [1995]\rI loved this movie so much when I was a kid. Like, I was a DIEHARD fan for it. I idolized The Riddler, to the point that I kept drawing question marks on my bedroom wall with green crayons. I haven't watched the movie since then, and while growing up, I've heard so much **** about how crappy the Shumacher Batman films were, so my thoughts about this film have been negatively percepted since then. When I rewatched this, I have to say, it's not as bad as what people say **** about it. It's no Nolan film, but it's really not as bad as people say it is.\r THE GOOD:\r-Val Kilmer's the best-looking Batman. He fits everything that has to be about Bruce Wayne and Batman. Sure, he has a deadpan delivery, but Bruce Wayne is supposed to be deadpanned as well so can't blame him for the characterization.\r-The production design is awesome.\r-The score.\r-The Charity Circus scene. Best part of the movie, hands down..\r-Bruce Wayne's past is explored a lot more.\r-Best-looking Batman costume.\rTHE BAD:\r-The script is GODAWFUL. NOTHING MAKES SENSE. Batman strongly talks Robin to not kill Two-Face as a form of revenge, but Batman himself kills Two-Face without any sensible explanation. Bruce Wayne giving up on being Batman. Where the **** did that storyline come out from?\r-The villains are more cartoons than actual villains.\r-Jim Carrey. OH MY GOD, I can't believe I worshipped him in this when I was a kid. The first scene with him was unbearable to watch.\r-Batnipples.\r-What the **** did Robin do the entire movie, esp. when Batman was in peril? He showed up only to get Batman out of the sand. After that, he drove the Batboat and got held captive by the villains. What was the redeeming point of even having him in this besides being the catalyst of Bruce remembering his past?"}, {"rating": "5", "text": "Though Jones, Kilmer, and Carrey give it their all, their performances struggle to save this film from it's own cheesy camp."}, {"rating": "6", "text": "Not as bad as Batman and Robin, its still cheesy as hell but it still retains some of Burton's themes that made the 1989 Batman so great. Val Kilmer was an mediocre Batman, he wasn't nearly as menacing as he's portrayed in the comics, Tommy Lee Jones was an awful Harvey Dent/Two-Face the only real bright spots were Jim Carey as the Riddler and some of the fight scenes that make the movie watchable."}, {"rating": "4", "text": "Boring, loud and ridiculously acted, \"Batman Forever\" should be renamed to \"Batman Never\" in spite the efforts of the charismatic Jim Carrey and Tommy Lee Jones who brings soft comedy to save this movie from being a mess."}, {"rating": "3", "text": "None sense, otter nonsense. this isnt batman at all! Joel shumacher nearly ruined this franchise, but dont worry with the next fillm he will! this movie is bad"}, {"rating": "5", "text": "Fairly OK surprisingly. You can tell Schumacher wasn't allowed as much of a leash here compared to Batman and Robin, and he was made to stick a little closer to the superior 2 Burton films. As a result, this isn't anything good, but it's not bad either."}, {"rating": "0", "text": "Aburrida kimer un Batman inexpresivo y la trama junto a 2 caras un asco de pelicula"}, {"rating": "10", "text": "Batman Forever is Average, It's not as close to the Awesomeness of The Dark Knight, But it's better than Batman and Robin"}, {"rating": "7", "text": "This movie is a good Batman movie! The 4th one is so horrible! But I like the 1st 2nd and this movie!"}, {"rating": "6", "text": "What saves this movie is Tommy Lee Jones and Jim Carrey as Two-Face and The Joker. Jim Carrey is especially in place, while Two-Face's portrayal may be too psychotic, it's not nearly as bad as the Penguin or Mr. Freeze were."}, {"rating": "7", "text": "A loose, entertaining Batman blockbuster with a great cast. Cool gadgets, but writings gets a little clunky here and there."}, {"rating": "6", "text": "Didn't mean much to my 8 year old mind when it first came out. These days, while it's slightly more watchable, it still fails to excite as much as some people might have you believe. The story is weak, the Prince songs are horrible (the same can't be said for the Elfman score though) and Keaton's rendition as the Dark Knight leaves a lot to the imagination. What I did enjoy about Keaton was his brilliant portrayal of the disturbed Bruce Wayne (one of my favourite scenes was his attempt at letting the cat out of the bag in Vale's apartment). Nicholson is wildly entertaining and his over-the-top antics are worth, at least, a single viewing."}, {"rating": "1", "text": "Awful, the poorest incarnation of Batman ever conceived. Kilmer and O'Donnell are risibly miscast and every scene seems to fall flat on its face. Nothing is gripping, nothing is exciting, nothing is funny, but for a couple of unintentional chuckles, which says a lot for film that sets out to be self-consciously camp. Those looking for a kick from reading into its homoerotic subtext would do better to watch the marginally more bearable, but all together more kinky Batman & Robin. This film is an abortion."}, {"rating": "8", "text": "With its epic acting, plot, action, and emotion, Batman Forever is a classic for the ages. Oh wait, sorry, I was thinking of Batman Begins. Although it's not a great as Begins, it's still a fun movie. However, it started the worst Batman movie trend, thank god it only lasted for 2 movies. The plastic molded nipples, otherwise, it's a fun movie that shouldn't be taken TO seriously."}, {"rating": "7", "text": "I like the film but it just didn't have enough of a punch for me."}, {"rating": "8", "text": "The most underated of all the Batman films."}, {"rating": "5", "text": "Love Jim Carry love batman, but hate this movie i mean seriously he kills two face which compleley ruins the movie that's batmans only rule for those who are not batman fans"}, {"rating": "3", "text": "Although there is some modest amusement to be had in Jim Carrey's manic performance as The Riddler, Batman Forever is a damp squib of a movie that wastes a grotesque amount of talent. Although the following Batman & Robin would take the lion's share of critical rage, Forever is as weak or maybe even weaker. Bad on every level."}, {"rating": "5", "text": "Though not as terrible as Batman & Robin, this movie is no gem. Val Kilmer's Batman is not as convincing as Keaton's, while O'Donnell's Robin fails to be likable. The Riddler is played by Jim Carrey, an actor who is synonymous with this movie. His character gets the most lines and screen time, with the Riddler essentially an extension of Carrey's comedy persona. His overbearing presence confines Two-Face (played by Tommy Lee Jones) into a secondary character, given no real personality of his own other than that of a glorified lackey. This movie is vibrant visually but lacks substance in terms of acting and writing."}, {"rating": "5", "text": "Poor old Joel Schumacher - he'll be known for the rest of his life as \"The man who killed Batman\", though he earned that moniker in making Batman & Robin, not this installment. True, it's a very different take on the Dark Knight mythology from Tim Burton's previous brooding, Gothic adaptations - Schumacher adds a liberal dose of self-aware humour and in-jokes, and the whole film has a certain camp fun about it. It's almost like Batman and Batman Returns was the franchise in its moody teenage years, and all of a sudden it's decided to cheer up and have a little fun. Schumacher hasn't completely dumped Burton's ideas on the wayside though, and most likely due to Burton staying on as producer, the film continues to delve into Bruce Wayne's tragic past and complex psychology. These scenes could have been lifted directly out of either Batman or Batman Returns, and provide the film with a good emotional kick. Robin's origin story is also kept fairly dark and Burton-y, and the thematic parallels Schumacher and writer Akiva Goldsman draw between Dick Grayson and Bruce Wayne are dramatically effective. The casting for the film is a real mixed bag. Chris O'Donnell has the right rebellious attitude and confidence to play Robin, Nicole Kidman makes a feisty femme-fatale as sassy psychologist Chase Miridian, Michael Gough is reliable as always as Alfred, and Jim Carrey steals every scene he's in as a brilliantly batty Riddler. However, Val Kilmer is completely miscast as Batman, and even clever cinematography and editing can't hide the fact that he can't handle the stunts - he just looks fat and slow. The real turkey of the cast is, disappointingly, Tommy Lee Jones, who turns Harvey Two-Face, one of the most interesting and complex of Batman's rogues gallery into a simplistic, camp pantomime villain. We must also question some of the design changes in the film (nipples? why?) that are so jarringly different from Burton's mythos that they appear to not even belong on the same planet, never mind the same city. Gotham appears to have evolved at an alarmingly rapid rate from a city of seedy slums and gothic cathedrals to a very East Asian-inspired neon metropolis. Well at least the taxes from the hard-working citizens of Gotham appear to have been put to good use. Batman Forever is an incredibly uneven film. There are good performances (Carrey), bad performances (Kilmer) and ugly performances (Jones). Batman's back-story is further fleshed out in dark flashbacks, and the introduction of Robin is handled well, but there's also homo-erotic suiting-up montages and bat-nipples. The film as a whole looks expensive, in a top-of-the-line fairground attraction sort of way, but it lacks finesse, and consistency in tone. It's clearly not the best Batman film, but Forever is also by-no-means the worst (audiences would have to wait another two years for the franchise-killer). One thing I will say for Joel Schumacher's first foray into the Batman universe - it's inconsistent, certainly, but it's never boring!"}, {"rating": "4", "text": "Suffering the \"threequel effect\" from beginning to end, BATMAN FOREVER is a tedious superhero movie. It now stars Val Kilmer as the titular character, a less believable Batman than even Michael Keaton, who was a hard one to take into mind. And along with the whole superficiality of the plot, the villains aren't all that great either. The three previous villains were the Joker (Jack Nicholson), Catwoman (Michelle Pfeiffer), and Penguin (Danny DeVito). Now, we have another duo, consisting of the Riddler (Jim Carrey) and Two-Face (Tommy Lee Jones). Unlike in BATMAN and BATMAN RETURNS, these villains are more silly and ridiculous than creepy. Just look at the DVD box--their outfits give away all the asininity. Should you see this? I wouldn't recommend it. If you do, will you like it? It depends if you can stand Jim Carrey in more than just comedy and drama."}, {"rating": "7", "text": "Alot of people hate this movie but i really like it. It's a good movie to just sit and watch and you don't have to pay close attention to. It's not the best batman movie by any means but it is a movie i enjoy."}], "recommendations": ["batman_returns", "batman", "the_batman", "batman_begins", "the_incredible_hulk", "daredevil", "the_mask", "superman_returns", "spider_man", "spider_man_homecoming", "the_amazing_spider_man", "superman_iii", "superman", "beetlejuice", "austin_powers_in_goldmember", "robin_hood", "die_another_day", "halloween_4_the_return_of_michael_myers", "fantastic_four_rise_of_the_silver_surfer", "the_flintstones", "the_dark_knight", "gremlins_2_the_new_batch", "the_dark_knight_rises", "fantastic_four", "batman_v_superman_dawn_of_justice"]}