{
  "id": 2803,
  "title": "Batman: The Killing Joke",
  "starring": [
    "Kevin Conroy",
    "Mark Hamill"
  ],
  "runtime": 76,
  "genre": [
    "Action",
    "Animation",
    "Crime",
    "Drama"
  ],
  "description": "As Batman hunts for the escaped Joker, the Clown Prince of Crime attacks the Gordon family to prove a diabolical point mirroring his own fall into madness.",
  "releaseYear": "2016",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/nxncAAL1FUKtQWs4uhs5jf1MVut.jpg",
  "categories": {
    "plot": 5.046153846153846,
    "acting": 4.975609756097561,
    "ending": 4.777777777777778,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 4.0,
    "action": 5.363636363636363
  },
  "reviews": [
    {
      "rating": "0",
      "text": "Terrible. The first half was dull and done before. It also did not portray batgirl or even batman well. The second half was a mostly faithful adaptation, minus some missing subtext and batman killing a few people."
    },
    {
      "rating": "5",
      "text": "If you're a fan of the other Batman movies, give it a watch. It's dark, depressing, and moody – and (perhaps purposefully) unsatisfying. Conroy, Hamill and Tara Strong are great as always. The animations looked a little stiff sometimes, but usually as good as Under the Red Hood. Good direction and decent music.\r But the writing. Oh, man. It didn't really hit me until I had reached the ending (SPOILERS follow). Usually the \"bad guy\" tries to decrease the height of his crimes by pointing out similarities between himself and the “good guy.” Instead Batman is the one saying that he and the Joker are very alike. Joker gets the tired line, “It's too late to help me,” while sounding all too sane. He tells a joke, and they laugh like two old friends. Batman not wanting to give a “moral high ground” speech was strange. The fact that he laughed was stranger. Is Bruce beginning to go insane? The ending scenes would have been amazing in that case, but it's never established or built up. The one-night-stand with Barbara could even have played into that (I always thought they “did it” anyway, so I wasn't surprised by it). Would it have been THAT hard to play up a Batgirl v. Joker vendetta in the beginning, instead of using a throwaway gangster character as a vehicle for Batgirl angst?\r Average movie that never earns the empathy it demands. 5/10"
    },
    {
      "rating": "5",
      "text": "As a longtime Batman fan I went into this wanting so bad to like the movie. Unfortunately, the first half of the movie is completely pointless and 100% inaccurate in the portrayal of the characters. The latter half of the movie is a relatively decent portrayal of the characters and story.\r The appearance and voice-acting are all very subpar and feel very rushed.\r 5/10 only because of fantastic the source material."
    },
    {
      "rating": "5",
      "text": "The first half was dull and done before. It also did not portray batgirl or even batman well. The second half was a mostly faithful adaptation, minus some missing subtext and batman killing a few people."
    },
    {
      "rating": "4",
      "text": "Alan Moore may be the greatest writer in the history of comics. The Killing Joke is no exception, as it is still one of the most surprising, subversive and darkly funny graphic novels ever published by DC. And yet, like just about every other attempt at bringing his brilliant work to life, this adaptation is inadequate in every conceivable way. I couldn't even sit through the whole thing. I can't help but ask: why continue to slap the man in the face? Haven't you done enough, DC? Just stop."
    },
    {
      "rating": "4",
      "text": "It was really hard trying to figure out how I could enjoy this movie. I wasn't so much put off by the additional plot added with Batgirl and her background with Batman as I was with how lame the animation, story and acting (besides Mark Hamill) was. Overall this is probably an even bigger disappointment than Batman v Superman."
    },
    {
      "rating": "6",
      "text": "I don't know, I was expecting something more interesting or with better story. First part of the story doesn't even make much sense as it really didn't affect much, while second part and the whole Joker stuff, while at first it seemed interesting and of course Mark Hamill is great at voicing Joker, still felt like it lacked something. Wanted to see something a bit different here"
    },
    {
      "rating": "5",
      "text": "The movie overall was pretty meh - but then again, after re-reading the graphic novel, why IS this touted as one of the best Batman stories? The graphic novel is only around 60 pages, and outside of a couple of key scenes, there really is nothing special here. And this is why the movie isn'y overly entertaining either, in fact the Batgirl prologue (not in the graphic novel) had more character than those in story proper.\rThe animation was decent and voice acting was great, however the movie could of fleshed more using the original story as a guide. I mean, the Joker's \"origin\" makes sense to some extent, but he wasn't overly upset the circumstances that led to that \"one bad day,\" nor took the time to even grieve.\rThose that loved the movie have every right too, but I have heard many state \"facts\" about certain scenes from the book and why they were so unique and disturbing. I'd suggest re-reading it (it won't take long) - there isn't as much there as you may remember..."
    },
    {
      "rating": "6",
      "text": "Well this movie gave me mixed feelings, the first half hour i was thinking what the hell is this childish romance??? on the other hand it nails the comic book but i dont know why i finished the movie with a bad taste on my mouth"
    },
    {
      "rating": "3",
      "text": "DC should treat its classics better. Here they took one of their most iconic comic books and transformed it into a cheap animated movie, and they try to sell it saying it is r rated. The animation is really poor, i ve seen hentai with better quality, they only draw some scenes well which are casually the ones that ended up on the trailer. The most disturbing thing is that they use this movie to promote the second line characters of batman like they did in almost every previous movie. In this case they do it with an invented story about batgirl. The R rate is not used well at all."
    },
    {
      "rating": "5",
      "text": "Move along, people. Nothing to see here... now I can actually see why the story on the comic that this film is based on probably had a good reason to overstay its welcome."
    },
    {
      "rating": "5",
      "text": "When it is adapting the graphic novel of the same name, Batman: The Killing Joke is phenomenal. Although its art style is less haunting, the script itself is very faithful to the script of the comic. This not only keeps all of the interesting ideas intact, but surprisingly, the structure of the story also makes for a relatively well paced and entertaining animated film.\r Unfortunately, The Killing Joke is not long enough to fill out the runtime of a feature length film. As a result, an extended, thirty minute prologue was added to help flesh out a character whose treatment in the original source material was often criticized. While the intent is commendable, this extended prologue is abysmal. It feels far too disconnected from the main narrative, but it is also extremely rushed and horribly written on its own terms. It not only suffers from not adding anything significant to the story; the things that are added clash thematically and tonally with everything that the rest of the film stands for.\r If you skip the prologue, Batman: The Killing Joke is absolutely worth your time, whether you love the original graphic novel or have never heard of it. However, with the prologue included, it's pretty poor. A shame, considering how good the source material (and half of this movie) is."
    },
    {
      "rating": "5",
      "text": "Well this was a flat joke.\r Batman: The Killing Joke is one of the best graphic novel ever written by Alan Moore. It's dark, haunting and really engaging. It took two iconic characters Batman/Joker and dissects the relationship between the two and how both of them tick. It's such an interesting storyline that was pulled off so magnificently. I'm not a comic book reader myself but I do consider the graphic novel to as brilliant. Word quickly spread that a movie adaption was on it's way and I sure was excited for it.\r Bruce Timm and Sam Liu were directing. Mark Hamill, Kevin Conroy Tara Strong and Ray Wise are set to star. It's based on the most beloved graphic novel ever.\r What's not to get excited.\r And then I saw the movie and I wasn't impressed. This was very disappointing since it had so much going for it, but somehow fell so short.\r Barbara Gordon 30 minute prologue was by far the weakest part of the film. I know the creators wanted to add some character to her since didn't have that much in the comic. If so, It could have been so much better, because it added nothing to the movie and it did drag it down. I don't care about Barbara Gordon, I'm here to watch \"The Killing Joke\". At one point I was wondering when the actual film was going to start and it eventually dose. It would have been cool if we saw how the Joker broke out of Arkham, having extra scenes of Joker torturing Jim Gordon, or creating the death of Joker's wife that the book never showed, maybe even add a few more investigation scenes and conversations with Alfred. That would have easily covered the extra 30 minutes that was added.\r Kevin Conroy and Mark Hamill both are once again brilliant as the characters. Their voices are so iconic to the character's that nobody could top the brilliance of Hamill & Conroy. It's no surprise that both are the best parts of the movie.\r The animation doesn't look that good and I can't be the only one that thinks that. How much better would it have been if the animation was visually striking and more effort was put into it. There are parts in this where I thought the animation was pretty damn good and also parts when the animation was pretty bad.\r Now lets talk about the most controversial scene in the movie that involves Batman and Batgirl having sex. Yes, that actually happens in this movie and it dose nothing with the main plot. The sex between them had no real emotion to it and it's only thrown in there to get Batman angry when Barbara gets shot. The Batman and Batgirl sex scene was like a creepy fan fiction that some die-hard fan would write or draw to satisfy their fantasy.\r Overall rating: Batman: The Killing Joke is basically a giant middle finger to the fans who loved Alan Moore's novel. I never really felt engaged in the story and the emotional impact that was in the graphic novel is nowhere here. It was rushed, dull and very flat. Fans and Alan Moore deserve better.\r I expected so much more from this and I think everyone did."
    },
    {
      "rating": "7",
      "text": "The Killing Joke is actually two shorter films combined into one. The first centers on Batgirl and details some of her work under the tutelage of Batman. The second is the actual adaptation of The Killing Joke. As adaptations go, this one is about as faithful to the source material as it's possible to be. It goes straight through the graphic novel's story without embellishment. It's fantastic. My only complaint is that these two pieces don't fit as nicely together as you might want. The characters are the same, of course, and the animation is consistent. But the Batgirl intro story really has no other point than to make the film \"feature length\". If the goal was simply to introduce Batgirl and establish her dynamic with Batman, that could have been accomplished in much less time. Instead, we see an extended mini arc that I felt rather impatient to get through.\r Aside from this minor complaint, the film was excellent. The animation is quite good, and the voice acting is phenomenal. Mark Hamill as the Joker carries the film. Not that the other aren't good. The voice talent here is exceptional. But Mark Hamill is at his peak here. Hearing his performance as you watch the Joker execute his plans is as horrifying as you'd want it to be.\r Overall, this movie is well worth seeing. I recommend it."
    },
    {
      "rating": "8",
      "text": "While I wish it would've been more crazy and coherent, there's no doubt that The Killing Joke is a thrilling animated movie. Just like the comic it's based on, it gives us a better look at The Joker and Batman and the relationship they share with each other, and while the animation doesn't always reflect the dark story it portrays, The Killing Joke may very well be one of the best animated Batman movies we'll ever get to see."
    },
    {
      "rating": "8",
      "text": "Batman: The Killing joke is an animated superhero film directed by San Liu. It is a direct adaptation of the graphic novel with the same name that came out in 1988. It stars the voices of Kevin Conroy, Mark Hamill, Tara Strong and Ray Wise. The comic book that the movie is based on is a classic and most anybody has heard of it. It is basically the origin of the Joker and involves a lot of graphic content. That's the main reason as to why this movie is rated R, the first animated film to be so. I personally really liked it, the animation is not great unfortunately especially considering that DC has had better \"animated\" movies in the past. But the story is engaging and interesting all the way through. There's a lot of controversy about Batgirl in this film, mainly because \"she's objectified\" and her only purpose is to serve as a motivation for Batman (and another \"dirty\" purpose for the Joker). But that is absolutely stupid in my opinion, it is reminding me of the controversy over the X-Men Apocalypse poster where Jennifer Lawrence's character Mystique was being choked by Apocalypse. Fox had to apologize for THAT because feminism nowadays is out of hand. But that nonsense behind, the action scenes are really good, the voice actors all do a phenomenal job and while it is a bit short, it is still a good animated entry for the DC Universe Animated Original Movies."
    },
    {
      "rating": "9",
      "text": "Batman: the killing joke is phenomenal. Yes the first thirty minutes aren't all that great but once you get to the killing joke its a blast. I personally love the killing joke its my #1 comic. And as a fan of Mark Hamil and Kevin Conroy they did a hell of a job bringing this adaptation to life. No one could do it better than those two. In the end its a comic book adaption you won't want to miss."
    },
    {
      "rating": "7",
      "text": "Just finished watching it and overall I think it's a solid DC animation film. The Killing Joke is not as captivating as Batman:Under the Red Hood and not even a quarter as exceptional as The Flashpoint Paradox, but it is far from a terrible film. The sex scene thing is overblown and really wasn't consequential on the overall film. In conclusion, if you haven't ever read the comic, like myself, it will definitely make you want to read the original comic because I believe this adaptation definitely didn't do it justice. Why so serious, anyways?"
    },
    {
      "rating": "7",
      "text": "Well! it supposed to be as good as the original one but the differences was too many! I mean Alan Moore`s Novel is way better than this one because that masterpiece was a soul that has not been experienced yet. the past of poor Joker was told smooth and more passionate that you could just feel his pain and  find out his essence and his relationship with his wife and unborn child. although the story of Barbara Gordon was good enough and told well that you could feel the things that happened to her while she got shot and taken pictures by Joker. Batman on the other hand as the most important character during the movie was suitable and close enough to the novel.\ras a conclusion I loved this animation but I still prefer the Graphic Novel because it has the feeling and soul of the pain and challenges of the characters and explained it wisely. specially the flashbacks and Jokers turning. 7 from 10 is OK I guess!"
    },
    {
      "rating": "9",
      "text": "While the mediocrity that the first half of the movie has the internet up in arms. The real reason to watch it is the animated version of the comic this film is named after. Soooo thats what im reviewing it on. They did a great job in bringing the comic to life. The only reason this gets a 9 is cause the movie made me waste time with a mediocre batgirl story that wasnt needed"
    },
    {
      "rating": "8",
      "text": "If you didn't like the comic. Your not going to like this.\r If you like using words like \"problematic' and \"Fridging\". Your not going to like this.\r Hey, if your still in denial over Batmans and batgirls relationship revealed in batman beyond, your not going to like this.\r The killing joke for the most part stays true to the source. The animation goes for not the newer anime feel but the old animated one. Which is fine.  The acting as expected is top notch. But the dialogue doesn't exactly at times roll off the tongue.\r DC so far has been very good with their animated movies. This is no exception."
    },
    {
      "rating": "7",
      "text": "To his own right, the killing joke was a pretty tricky act to be pulled up,  so with that in mind, Batman The killing joke, it's not a bad movie, but certainly is not great one either. If you are fan of the source material you're gonna feel a little bit dissapointed by the movie's first half, but after that clumsy start it only gets better.The killing joke is not the movie the we fans need and of course not the animated movie we deserve. It's something else, something that should have been great but instead that got stuck in it's awkward treatment of the batman mythos."
    },
    {
      "rating": "5",
      "text": "It's easy to see why the story is held in high regard. It touches on powerful ideas. That being said, the source material and this adaptation of it are both clumsy and somewhat trashy takes on the subject. On top of the stultifying dialogue and surrealistic plot jumps, the movie adds an out of touch prologue that really wasn't needed, apparently for no good reason other than to fluff the limited runtime.\r Of course, the movie has been met with plenty of dumb criticism on the gendered aspects of its violence, but that isn't really the problem. The villain here seems genuinely villainous; nothing in the movie could be seen as an endorsement of his sadism. If anything, the movie caricatures its men more negatively, with the prologue adding a gratuitous extra villain delivering silly lines about women, and Batman having been given an extra layer of emotional ice that his already difficult character hardly needs. Combine that with some weak animation and you've got plenty of room for legitimate criticism here.\r Several iconic, quotable moments do emerge, but the rest of the movie seems like an exercise in waiting for them. The story seems like it needs to be reexplored with smarter writing, more nuance, and a big budget live action production. Given that The Dark Knight comes pretty close to meeting those criteria, I'd sooner watch that again than revisit this one."
    },
    {
      "rating": "7",
      "text": "I love this comic. Like really enjoyed and loved this comic. This is a very sound adaption. But its uneven. I can't really dip deep into my real grips with the film without spoiling certain plot points. The cast is fantastic, the animation is also just beautiful. Esptially the background designs.\r Its good film...but the ending...and the first act really don't quite live up to that Killing Joke hype. Its good, and for what its worth it is a pretty sound adaption of the killing joke. But its not perfect."
    },
    {
      "rating": "0",
      "text": "This is the worst animation on a DC Movie, and all the new thing are really good at the beginning but at the end you start to dislike them, the worst DC Animated Movie ever"
    },
    {
      "rating": "3",
      "text": "The Barbra/ Batgirl opening is cliche and generic. A simple tale we've heard before, loaded with sloppy dialog and awful exposition as well as laughably handled 'mature content'. It speaks to how poorly executed it was that the audience was laughing in the more serious scenes. There was no point in adding something this generic to the story. It feels tacked on and unessential as a result. They have also made Barbra a weak, male-made, stereotypical, male-reliant, 'pining over the father figure' student, but insist this addition makes her a stronger character?\r Further more, it damages the pace of the story, making Batgirl/ Barbra the main character for the first third of the movie. The great tale of Batman and the Joker got gate crashed, leaving Batman to feel like the third wheel. It honestly felt like he got the least screen time out of the three.\r When you get past the intro into the actual adaptation, you find a passable but far from impressive translation. What made it into the movie unchanged works, when not poorly executed, but most additional lines are amateur, poorly written, exposition ladened, lip service. (Which don't roll off the tongue).\r Much of the comics themes and subtext go missed as well, leaving the feeling that the writers thought very lowly of the audiences intelligence, stopping constantly to explain the simplest of things as if the 'R-rated' movie (rating not deserved BTW) was made with children in mind. I wonder if perhaps the writers didn't grasp the central theme of the comic, or the meaningful subtext on the pages, or if they just lacked the skill to transition it to screen.\r Not wanting to spoil things, the movie also fails to uphold the comics ambiguous ending, again I say: possibly because they lacked the skills to pull it off, or perhaps it went over their heads with the rest of the subtext!\r The acting is great, but you'd expect it to be from this cast. The animation leaves something to be desired, but the modern DC movies haven't been what they once were for a while. The score was OK, but I feel it could have been dialed back in some scenes for a better build. I love orchestral sound tracks, but to work at developing mood you need dynamics and an ebb and flow, instead of full on, all-instruments, 100%, all the time"
    },
    {
      "rating": "2",
      "text": "I came in not knowing the story at all for this film. I was told by my friend that it follows the comic basically perfectly. That said, I thought the story was really boring. The movie felt like it ended when it just had started. I was severely disappointed that I wasted my money to see this movie. The animation of the scenery was really good. I really liked that, however the character animation looked very stiff, and lacked the quality of the beautiful scenery they created. Mark Hamill on the Joker was solid, however I found Bat Girl's voice actor to not come off as very genuine. It sounded like someone trying to act. Batman's voice actor was cringy at times. I also felt like he was someone acting as batman, not that the voice was genuinely Batman. I get that he did the cartoons, but he failed it for me.\r This movie literally could have been PG-13 if they took out about 4 seconds of this film. The R rating seemed unnecessary. A scene that felt forced was Batgirl having sex with batman. That scene didn't feel like it was realistic.\r The character Paris Franz was probably the most interesting character in the film, and he felt almost unnecessary. I was more interested by his story line than by the Joker's. I remember getting about 25-30 minutes into this film, and realizing this movie was supposed to be about the Joker. They didn't have nearly enough time to develop the Joker's character enough to make me care about it. Sorry! I understand comic fans already have an opinion of the joker, and a love for him by this film, but as a stand alone this film felt like garbage story wise.\r Batgirl wasn't developed enough for me to care about her getting paralyzed. Wasn't developed well enough for me to care about her putting down her cape. She wasn't developed well enough at all. I simply didn't care about her because the story didn't make me feel like I cared.\r The film is just not long enough to get someone invested in the story unless they already are invested in the story from comics or otherwise. It does not stand alone well at all.\r When the film ended, the first reaction in my head wasn't the usual good feelings you get from a great movie, or even an average movie. All I was thinking was, \"There is no way it's already done.\" Spoiler, it was already over.\r Basically, Batman: The Killing Joke is a super shallow film, that leaves you only wishing it was longer and that the story made you care about the characters. Unless you are a huge comic book junkie already this film is not for you, and you will leave the theaters feeling like you wasted your money. Avoid it."
    },
    {
      "rating": "8",
      "text": "Batman: The Killing Joke gives fans what they want to see. A faithful adaptation of a classic comic story where Batman and the Joker go at it psychology and physical. The visuals may not translate perfectly from comic to screen but considering how most films today are CGI seeing hand drawn animation was a welcome return. The Barbara prologue does weigh the film down a tad but thankfully it isn’t present much once the film starts as the Killing Joke story is left larger in tact. As a result, it is easy to forget and ignore the change made to the story. And its something I’m willing to. The fact that the direct-to-DVD animated DC films are more adult and more mature and overall more engaging than the live action ones is astounding. Seeing on the big screen was a real treat hopefully more people saw it."
    },
    {
      "rating": "0",
      "text": "Not only was this totally different from the novel, it also tried to give the female victim a better role, but failed miserably and made it worse: She's more a prize that Batman and the Joker fight over than anything else. Also, she's made stupid and does dumb, overconfident things, which get her in trouble.\rAlso, why the big breasts? Gratutious additions for wank-ing boys and old men\rCompare the role of Negasonic Teenage Warhead in Deadpool for a GOOD example of how to do female superheroes."
    },
    {
      "rating": "0",
      "text": "Batman is now a sexual predator who takes advantage of a young woman he is mentoring, a young girl who also happens to be the daughter of his best friend. DC couldn't have screwed up this movie any worse if they intentionally tried."
    },
    {
      "rating": "7",
      "text": "An overall good movie staying mostly faithful to the source material. However, the personal scene between Batman & Batgirl was unnecessary as it sparked controversy. In fact, Nightwing is going to be ticked off when he hears about this."
    },
    {
      "rating": "0",
      "text": "The Killing Joke has always been a problematic story despite its iconic status. But Warner Bros somehow managed to raise its levels of disgust to 11. In case you thought Barbara Gordon getting fridged wasn't gross enough, now she is Batman's paramour (a moronic fetish Bruce Timm has for some reason). That's an even bigger betrayal of the Batman mythos than the Caped Crusader using guns and murdering by the dozen in Batman v Superman: Dawn of Justice.\r Not only that, it's also a mediocre movie on its own. The animation looks like a cheap motion comic, Kevin Conroy and Mark Hamill (who are usually excellent) blatantly phone in their performances, and it's just plain dull.\r It's the equivalent of Limp Bizkit, i.e., it tries way too hard to be tough and shocking, but comes off as pathetic and desperate instead."
    },
    {
      "rating": "5",
      "text": "One advice: When the movie ends, leave the theater.\rJust go home never look back.\r\"The killing Joke\" post-credits scene is awful ,it destroys the mood of the movie."
    },
    {
      "rating": "10",
      "text": "-HONEST REVIEW TO HELP THE UNDECIDED= DECIDE...\r -I'm over 40 now and have been reading/collecting Batman since \"Knightfall\" aka Azrael = Bane breaking batmans back and Azrael taking over the batman role.)))\r --This is the best Animated Batman ive seen.. And Ive seen em all..\r-Its not better then the Red Hood or Dark Knight returns part 1(pr 2)\rBUT ITS NOT THAT KIND OF MOVIE...\r ==This combines one of the best Batman comic stories EVER with OUR BATMAN.\rour Kevin Conroy and Mark Hamill...All that's missing is NOLAN north.(But hes there too.)\r --This movie isn't supposed to outshine or be bette rthen the comic...\rNO MOVIE IS BETTER THEN THE BOOK----FACT! DUH!!\r~~~Because the book uses youre/my imagination for what the Joker is thinking and motive etc..\r---But it adds to that...IMO--atleast it did with me,...\r --It shows the Joker IS NOT crazy- Just extremely intelligent. so much that he is lost & confused with a world in slow motion...This why The Joker is a better villain then Lex Luthor..He doesn't want to kill the Batman..He doesn't even want to know who he is..\r ==The Sex Scene---\r=People must remember= Batman IS NOT & never was a role model....And so what if he doesn't stop a young adult female from getting hers....Batmnan is-NOT her father figure & never was...Even the Arkham video games made this obvious...\r ===Batman also isn't the police. Wwhat would the commish do if he found out she is Batgirl? he would hate batman. Just like in Arkham Knight game...Batman didn't screw Batgirl. She seduced him...\r ===I was impressed with the acting in this..Probably the best Konroy has done with the Bat & The Joker is on par with the cartoon series with Harley & the Arkham games...\r ---They added the sex scene cause it needed to be explored how batman is a man & what hetero sexually active, non married man wouldn't *&^())^(&* a hot 20 year old woman making an advance....\r --Shows me which fans never were active in theyre party days...\r --I feel guilty for not buying this and getting the torrent..Its a worthy buy..."
    },
    {
      "rating": "8",
      "text": "The first 30 min is completely tacked-on and for a filler. Other than that, the movie stays faithful to the original comic. Kevin Conroy and Mark Hamil returns to voice batman and the joker, but you can definitely tell their aging voice.\r Great animation, disturbing story, and fantastic pacings and transitions"
    },
    {
      "rating": "8",
      "text": "Si esperabas ver una adaptación fiel al cómic de “Batman: The Killing Joke” es lo que obtienes, en estética y guión se recrea en forma fiel la historia de Alan Moore, y sin lugar a dudas el doblaje original cuaja perfectamente para convertirse en una película ideal para fans de los cómics de Batman y Batman la serie animada.\rEl arco de “The Killing Joke” no es muy largo por o que se agregó un acto de apertura que solo contribuye al film en hacerlo durar una hora y media. Es la decisión más cuestionable de Sam Liu. ya que nuevamente dispara la polémica si DC Comics es o no machista, debido al rol que juega Bat-Girl.\rFuera de ese debate en general la nueva entrega animada de Batman cumple muy bien, los fans van a sentirse a gusto con el material que reciben, los no tan fans seguramente tendrán opiniones mixtas, pero “Batman: The Killing Joke” merece al menos una oportunidad, porque en el momento en que comienza a cobrar vida las paginas del cómic la película se vuelve memorable para cualquier persona."
    },
    {
      "rating": "9",
      "text": "This movie brings the best Joker story to life in animation form. Does it succeed? Mostly yes. It's animation is spectacular to look at even though at times, it can get a little clunky. Kevin Conroy and Mark Hamill are once again amazing at voicing Batman and The Joker. They did great with reading the Killing Joke dialoge. I loved it how they made this film rated R cause in the Killing Joke comic book, there's lots of violence and some disturbing images.\rThe Batgirl scenes were alright but I didn't think it was nessary to put them in the movie. Before I get to a specific scene, SPOILER ALERT FOR THOSE WHO HASN'T SEEN THE MOVIE YET!\rI thought that Batman and Batgirl having sex at top of a building was a **** up moment. Isn't Batman and Batgirl suppose to have a father/daughter relationship? What would Jim Gordon think of his daughter having sex with a older person??\rBatman The Killing Joke is one of the comic book movies that stays VERY true to the comics."
    },
    {
      "rating": "7",
      "text": "I really don't mind the concept of starting off with a new Batgirl story, but it was not well executed and did not even portray Batgirl very well.\r The rest is a solid adaptation, but it still feels like it's missing something. Not sure why it got an R rating, either, it was pretty much PG-13."
    },
    {
      "rating": "9",
      "text": "wow then a movie is good it's good, wow simply wow, every second kept me at suspense, every second got me in to the story more and more, a must see for everyone."
    },
    {
      "rating": "3",
      "text": "This film is shockingly terrible in a way I didn't think possible. NOTHING in this film works. The pre-amble about Batgirl is weird, meandering, and confusing. The animation uses the phenomenal artwork of Brian Bolland as Keyframes. This means that characters rarely move out of their blocked out positions in the comic book. Everyone feels stiff as they slide from pose to pose. Dramatic monologs that should have facial animations to match the intensity of the scene come off as flat and lifeless. NOTHING in the film is as dramatic as it should be. Terrfied people never seem terrified, scared people never seem truly scared, and angry people never feel angry. And this is supposed to be a story about the heights of all of those emotions.\r It's just a mess."
    },
    {
      "rating": "9",
      "text": "TL;DR: Only get this after you've read the book and would like to experience the story again. Otherwise you should just go with the book.\rI gave it such a high score because I've read the Killing Joke and liked this adaptation. Personally, I had no issues with the extra \"prologue\" scenes that were not in the comic. I found them interesting enough, even though you won't care much by the time the actual story starts. All in all the animation could have been better at times, that's why it is not a 10. However, I cannot recommend this to those who haven't read the book. If you have read it and would like to watch it as a movie, then by all means you should. If, on the other hand, you have money or time for only the book or the movie I would definitely go with the book."
    },
    {
      "rating": "5",
      "text": "Batman: The Killing Joke redeems itself in the second half of the film but that can't hide the filler first half as well as the unnecessary exploitation of Batgirl."
    },
    {
      "rating": "8",
      "text": "I really enjoyed this adaption of the Killing Joke. I didn't mind the whole Batman/Batgirl relationship side plot, I thought it was a interesting way to shake up from the comics. The voice acting is at its best and the film really picks up steam towards the end of the movie."
    },
    {
      "rating": "8",
      "text": "So a Graphic Novel that everyone has been asking to be made into a animated movie finally made it to release and I'll say I'm quite content with this rendition. There are moments that where not in the book that made me question what I was watching but once it's past those parts the movie really shines. Most people know the story so I won't cover that but the animation and voice acting was great. Animation felt true to the recent Batman films and still kept itself extremely close to the source material. Voice acting was also amazing with Kevin Conroy and Mark Hamill reprising their roles.\rAny fan of the Graphic Novel or Batman comics should check this film out, not quite for your kids....maybe."
    },
    {
      "rating": "7",
      "text": "Batman The Killing Joke is one of the best DC animated films to date if you look purely at the second half and overall it’s a mixed bag. It has padded out its source material slightly and I would be lying if I didn’t say that there were parts of this film that bothered me and the flow of the narrative is terrible but I think overall it’s a really great Batman film.  Especially if you judge it on its own merits.  The animation is great, the fight scenes are good, the dialogue is absolutely fantastic and it tells one of the most iconic Batman stories very well.  I don’t think it will do too well at the Box Office considering that it’s coming off the heels of Deadpool which is another R rated comic adaptation, I think people are still in awe of that film, but I think the comparison between the two is a bad idea.  Compared to the other DC animated films however it’s not the best of the year but I still think you should add this to your collection.  If you like Batman you definitely need to watch it and I would definitely recommend it to anyone who liked the Dark Knight, just don’t buy it for your kids, this is not their Batman movie."
    },
    {
      "rating": "6",
      "text": "Very good movie. Once again Mark Hamill and Kevin Conroy both embody the Joker and Batman. A very interesting and awesome story. I'm very impressed on how this one turned out. It's great that the movie was rated R. No holding back on the violence and tone."
    },
    {
      "rating": "7",
      "text": "The second half is actually a a really good movie. the first half though is a dreadful and unnecessary except for being filler. Some other problems are that the animation is lacking at times and a specific part in the first half that I personally think is mindbogglingly imbecilic (if you've watched the movie you know what I'm talking about). Unfortunately I think that it weighs down the story of the second half, but not enough for me not to have thoroughly enjoyed it!"
    },
    {
      "rating": "4",
      "text": "As soon as we found out we were getting an R-rated Killing Joke cartoon everyone was ecstatic. It's been a tough year for Batman; first we have the terrible Fox show Gotham, showing us what Gotham City would be like without Batman. This is the equivalent of making a Spiderman show about the Daily Bugle. Nobody gives a s***. On top of that we had Batman V. Superman, where our favorite DC superheroes were crucified before our eyes for nearly three agonizing hours. You could argue that Ben Affleck's Batman was the best part of that movie; which is like saying the best part about being strangled to death is knowing I don't have to pay bills the next day. Nevertheless DC gave us what we wanted all along by making an R-rated Killing Joke, and unfortunately, they have boned us once again.\r The movie starts with an inner-monologue from Batgirl, and immediately you are enthralled. Then her and Batman beat up some bad guys and everything is going great. Batman then tells her it's getting too dangerous and she needs to back away from the case so he can catch the bad guys himself (classic Batman). Batgirl says no and continues to fight crime anyway (classic Batgirl). Then Batman catches her fighting crime and she's like, you're not my dad! Or some stupid bulls***, and then she attacks him, one thing leads to another and they end up f***ing underneath a gargoyle. Now, I haven't read the comic in a few years, but I'm pretty f***ing confident that was never in it. Anyway, after they bang it out Batman doesn't talk to her for a while (classic guy) and Batgirl tells her gay librarian friend all about her sexual encounter (classic girl). Then one night Batman and Batgirl cross paths when they are fighting crime together and Batgirl is all like, I'm sorry, you were right, and Batman is like, I know, I always am. Batgirl decides to retire from crime fighting and Batman randomly goes looking for The Joker, only to find he has escaped. Batgirl and her father are eating dinner at her apartment, and The Joker shows up and shoots Batgirl in the spine, paralyzing her. He then kidnaps Commissioner Gordon and tries to make him crazy. Batman finds out, visits Barbara in the hospital, and that's the last we see of her for the whole film. What was once a Batgirl centered production is now a classic Batman vs. The Joker standoff. Meanwhile there are flashbacks to The Joker's origin story; all of which are boring and unimaginative. At one point The Joker's wife dies and he reacted to it as if he watched the finale to Season 1 of Heroes (blandly). Anyway, The Joker is torturing Commissioner  Gordon (classic purveyor of evil and disdain) and Batman is trying to catch him (classic demigod). Batman catches up to him and there is a showdown, but first Batman gives a speech. It goes along the lines of , I don't know how our relationship is going to end. Maybe I'll kill you, maybe you'll kill me...I know how it ends Batman, you don't kill the f***ing Joker, you don't kill anyone, that's your biggest gimmick. Anyway the movie ends with The Joker telling Batman a joke that makes him laugh.\r Huge question. Why is this rated R? There was nearly no gore and  pg-13 language at best. The most promiscuous thing about this movie is tasteful nude photographs of an injured Batgirl, and we kind of almost see Commissioner Gordon's c***."
    },
    {
      "rating": "7",
      "text": "Kevin Conroy and Mark Hamill's return was by far the high point for this film.  When the movie focuses on The Killing Joke story line, it's riveting and compelling. I'm not going to argue that the first 30 minutes of the movie is unnecessary, in some ways it is. It's filler for sure but that being said, is it good filler? Yes and it does strengthen the impact of what happens later in the film."
    },
    {
      "rating": "4",
      "text": "Batman: The Killing Joke is a disappointment, considering how good the graphic novel was. The animation is bad, the portrayals are horrible, especially Batgirl. The second half was OK but it wasn't enough to save the movie."
    }
  ],
  "recommendations": [
    "percy_jackson_sea_of_monsters",
    "batman_v_superman_dawn_of_justice",
    "death_note_relight_1_visions_of_a_god",
    "the_witcher_nightmare_of_the_wolf",
    "the_chronicles_of_narnia_the_voyage_of_the_dawn_treader",
    "incredibles_2",
    "artemis_fowl",
    "the_secret_life_of_pets_2",
    "the_karate_kid_part_iii",
    "sin_city_a_dame_to_kill_for",
    "dreamcatcher",
    "the_legend_of_tarzan",
    "dumbo",
    "the_hobbit_the_desolation_of_smaug",
    "the_chronicles_of_narnia_prince_caspian",
    "bumblebee",
    "green_lantern",
    "the_tale_of_despereaux",
    "the_hunger_games",
    "the_suicide_squad",
    "harry_potter_and_the_goblet_of_fire",
    "spider_man_3",
    "terminator_genisys",
    "the_lego_ninjago_movie",
    "the_lego_batman_movie"
  ]
}