{
  "id": 4037,
  "title": "Battle for the Planet of the Apes",
  "starring": [
    "Roddy McDowall",
    "Natalie Trundy"
  ],
  "runtime": 93,
  "genre": [
    "Action",
    "Science Fiction"
  ],
  "description": "The fifth and final episode in the Planet of the Apes series. After the collapse of human civilization, a community of intelligent apes led by Caesar lives in harmony with a group of humans. Gorilla General Aldo tries to cause an ape civil war and a community of human mutants who live beneath a destroyed city try to conquer those whom they perceive as enemies. All leading to the finale.",
  "releaseYear": "1973",
  "mpaaRating": "G",
  "imageUrl": "https://image.tmdb.org/t/p/w500/dP5dYjLp5p2CG103cJMio4Nj29d.jpg",
  "categories": {
    "plot": 5.0,
    "acting": 6.0,
    "ending": 4.5,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 5.0,
    "funny": 5.0,
    "action": 6.0
  },
  "reviews": [
    {
      "rating": "3",
      "text": "It's such an anti-climactic and predictable movie that fails to do the previous films any justice. The battle for the Planet of the Apes is a very disappointing end to an enjoyable series."
    },
    {
      "rating": "6",
      "text": "The biggest problem of this movie is, that it doesnt fit to the other movies, especially the last one. Caesar was the only one who knows how to speak, but suddenly there are many of them, some even older than him. In addition the action scenes look so cheaply, the budget was too low. The power struggle between Caesar and Aldo was more interesting and the movie should focus on that. This part was intelligent and didnt need much money. It was interesting to see the problem of such a society, but the movie was short, low budget and had too many action scenes."
    },
    {
      "rating": "6",
      "text": "Battle for the Planet of the Apes is a direct sequel to Conquest of the Planet of the Apes. This film completes the original franchise. Logically all films are closed. And although the film is mediocre, and inferior to the first 2 films, it is at least interesting to watch, unlike Conquest of the Planet of the Apes"
    },
    {
      "rating": "6",
      "text": "A limp way for the original franchise to finish.Its predecessor, 'Conquest of the Planet of the Apes', was a weak entry too but remained watchable, though 'Battle for the Planet of the Apes' kinda straddles the other side as it's uninteresting. I didn't dislike it and it is very short at around 82 minutes, which helps. Roddy McDowall is the pick of the cast, though even his performance feels weary at this point.A 'strong' 6/10 rating from me, if such a thing exists. It was the right time for them to end this (very good, all in all) series."
    }
  ],
  "recommendations": [
    "star_trek_v_the_final_frontier",
    "predators",
    "star_trek_insurrection",
    "alien_covenant",
    "the_matrix_revolutions",
    "star_trek_nemesis",
    "star_trek_beyond",
    "the_matrix_reloaded",
    "captive_state",
    "the_cloverfield_paradox",
    "star_trek_into_darkness",
    "aliens",
    "star_trek_first_contact",
    "rise_of_the_planet_of_the_apes",
    "pacific_rim_uprising",
    "star_trek",
    "alien_resurrection",
    "reign_of_fire",
    "godzilla_king_of_the_monsters",
    "300_rise_of_an_empire",
    "terminator_salvation",
    "independence_day_resurgence",
    "supernova",
    "the_hobbit_the_battle_of_the_five_armies",
    "riddick"
  ]
}