{"id": 1858, "title": "Battleship", "starring": ["Taylor Kitsch", "Tadanobu Asano"], "runtime": 131, "genre": ["Thriller", "Action", "Adventure", "Science Fiction"], "description": "When mankind beams a radio signal into space, a reply comes from ‘Planet G’, in the form of several alien crafts that splash down in the waters off Hawaii. Lieutenant Alex Hopper is a weapons officer assigned to the USS John Paul Jones, part of an international naval coalition which becomes the world's last hope for survival as they engage the hostile alien force of unimaginable strength. While taking on the invaders, Hopper must also try to live up to the potential that his brother, and his fiancée's father—an Admiral—expect of him.", "releaseYear": "2012", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/iLV6PVkkutgeEH6O5XFo2L89u3K.jpg", "categories": {"plot": 3.0217391304347827, "acting": 2.909090909090909, "ending": 3.3333333333333335, "soundtrack": 4.0, "cinematography": 5.0, "familyFriendly": 3.1, "funny": 3.0, "action": 3.3125}, "reviews": [{"rating": "3", "text": "I'm a huge fan of Action-Movies, especially Transformers and stuff. When I see this movies, I accept that there is no great story, no plot or the other things that usually make movies good movies. In other words: I turn my brain of and simply enjoy the pictures.But this was impossible during Battleship. The whole movie is THAT stupid, filled with the most stereotype plot they could find. Honestly, Rihanna looks badass but is a unbelievable bad actor. In fact, the only good actor in the whole movie was Liam Neeson and he only appeared about 5 Minutes the entire movie. I saw it with a friend and we facepalmed all the time. Normally, I can consume the stupidity of action movies, but this was too much. And even the action scenes were not cool. Maybe I just don't stick with Ships shooting each other, but for me the action was totally forgetable. It is indescribable how dumb the movie is. And I mean for real. I'll just stop now cause I'm not able to describe this. Just don't watch it ever. Only when you are VERY drunk and when you skip the whole movie except the action scenes which are well made and can be a bit amusing for some people and this is the reason I'm giving this movie a 3."}, {"rating": "4", "text": "I have no idea what went through the mind of the studio execs who green-lighted this movie. \"Hmm you know that old game Battleship where you launch attacks at each other, let's make a movie out of that\". I mean really? really? I feel that the actors, director etc all gave it their best shot but when they had nothing to work with in the first place the result is a mess like this movie. They'd probably be able to make a much better movie using Monopoly than Battleship. Heck even \"Guess Who?\" would probably make a much better movie. Have it be a show about a gameshow or something."}, {"rating": "1", "text": "You gotta be kidding me. First off, we start the war by shooting at the aliens first because of a hot-head who can't follow orders. Then, he relinquishes his command to another captain who really knows how to strategize and fight. This movie insults any idiots intelligence. I can't help but side for the aliens, who spend the whole movie defending themselves against the humans who invite them here, then attack them. All because of an idiot hot-head that started the whole thing but still ends of with the silver star.\r The saving grace was the tribute to the Pearl Harbor veterans that magically appear. I thought it was a fantastic move, however, that they all wore the hats from the respective ships they served on. The plates they shot of the Missouri when it was moved to Hawaii worked well in the movie. Terrible acting except for Liam Neeson. Very nice CG and special FX. Sound EFX and tracks were excellent as well. Yep, see this movie high or drunk and you will enjoy it. I can look at an aquarium all night and be just as entertained in that same state of mind."}, {"rating": "0", "text": "Atrocious. There´s nothing else to say. This film is nothing. And making a film that is nothing when having a 200 million budget is really difficult. Pathetic."}, {"rating": "4", "text": "â"}, {"rating": "0", "text": "Simply the  without legs fighting one on one with a alien, and the alien tooth flying. I feel shame about having to pay to watch this movie. On the other hand, it's unbelievable that a group of old men that just can walk, could prepare a ship of the world war two, totally obsolet, and destroy alien technology,"}, {"rating": "0", "text": "The worst movie I ever seen in my life. I've wasted my time by watching it, it was horrible I would love to kill the director for the bad directing as well as the cast they were below average the only reason I gave it a ZERO and not minus because Liam Neeson was there. I've never hated a movie like this one the Alinas look like Maggots even the Maggots are prettier. End of the story don't watch it or your gonna waste your time."}, {"rating": "2", "text": "This sunk mine. WOW. Rihanna was terrible. Kitsch was not good. The script stinks. Very noisy, and the plot is ridiculous.  Really, really bad.  Save yourself the time you will spend drooling through this wonder and do something much more enjoyable and rewarding like watching paint dry, or scraping the white stuff off your tongue."}, {"rating": "4", "text": "Basically a big a explosion jerkfest which i was expecting but with Liam neason in it who is such a great actor and has been in so many great films. i figured this should be atleast a decent SciFi flick . unfortunitly his role is so very very small and even if he had a big role it wouldn't have helped the extremely watered down plot thats pretty dull. The acting is sub par and the pacing at the start is sluggish considering it does such a horrid job establishing any thing outside of horrably trying to have a few funny moments that fall flat on there face . The only fun moments come from the action which even then isn't the greatest but its ok. The CGI does look pretty good . Its a Popcorn flick but unfortunitly not a very good one."}, {"rating": "5", "text": "Battleship has the prestigious award of the worst film I saw in the cinema of 2012. Battleship is very CGI heavy. which is something you should come to expect from the genre of this film (which I like to call, trying to be Transformers). But here is something amazing, the film is quite a lot better than the Transformers movies for a couple of reasons: The premise is so ridiculous it almost works and the action sequences are better and less random to watch than the scenes of a similar nature that appear in Transformers. This is about as good as a film based on Battleship could be (especially considering they pulled in Rihanna for her unholy acting talent!). Droll, 50/100."}, {"rating": "3", "text": "This is the worst film of 2012. The characters aren't all that interesting in the first place, there is only story in the first 30 minutes. This is basically Battle: L.A. all over again, even if it is slightly better."}, {"rating": "2", "text": "This should be named \"Generic American Propaganda Movie #198\"\rPersonally, I love these type of alien godzilla-esque movies. I enjoyed Pacific Rim very much. But this film is just plain terrible. A loser, who gets arrested suddenly becomes a high ranking officer in the US Navy? Have the US navy sunk so low that they're allowing any old joe to come along? Why did they have to give Liam Neeson such a toilet job? It's ridiculous. Could this film be any more American propaganda? First the Japanese and the Americans work together (which is incredibly unlikely), and then the main character and Rihanna take control of a dinosaur ship that was last used to fight the Japanese Empire almost 70 years back. Slap some old farts on it and you got yourself an Earth saving weapon.\r BTW, Rihanna should stay in the Music industry. Hollywood doesn't need her and we definitely don't need her. This film is such a disgrace to the movie industry."}, {"rating": "4", "text": "Let's get straight to it, Battleship is a bad bad film. Taylor Kitsch was greatly mocked for starring in this film and John Carter, two of 2012's lesser acclaimed releases but I don't think he can shoulder too much of the blame here. Battleship's faults lie almost solely at the feet of the writers, Jon and Erich Hoeber.\r The script is riddled, absolutely riddled with stinking dialogue and the while obviously a certain amount of disbelief is required to even consider watching a film of Battleship's ilk, the plot has some laughable moments. I don't know which was worse, watching a previously decommissioned battleship being started up by a crew of geriatric veterans in no time at all, seeing said ship perform a handbrake turn at full speed by dropping anchor, the cringe-worthy references to The Art of War or seeing Rihanna try to act. Her speech about her father's alien prophecy is the stuff of nightmares. Thankfully for his sake, Liam Neeson's performance as the isolated Fleet Commander is limited.\r I was sceptical of how the film might incorporate anything resembling the Battleship game, but the night battle using educated pot-shots at grid references in the style of the board game actually worked reasonably well. The enemy, or more importantly, its odd passive-aggressive, your turn-our turn behaviour, is conveniently never explained.\r I know the film is supposed to be action-led, fun and O.T.T. and visually director Peter Berg does nothing wrong but most of the action is pretty stationary and quite repetitive and there is only so much you can forgive a terrible script. Come back Michael Bay, we forgive you for Transformers!"}, {"rating": "5", "text": "Expectation: moderate, mostly predictable story revealed in fx heavy trailers\r Delivery: As a movie fan, I've developed thick skin towards the typical bad boy turned hero, military propaganda, token Black characters, the hard as nails woman, and characters who, during action scenes, blurt out catch-phrases like talking stuffed animals, but Battleship has waaaay too many of these infractions to ignore. Its common to have to suspend belief to accept some movie plots, but Battleship asks you to leave some brain cells at home and lock your common sense in the car. Too many coincidences put the characters in position, and the all too familiar \"screw up who loves the bosses daughter but has to win the boss over by unlocking his true potential, proving himself to said boss\" set up. This crappy setup makes it harder to except the pretty exciting cgi fest that follows. Battleship is worth a matinee or a weekend rental. Lower your expectations, turn off your common sense  and Battleship will make for a moderately enjoyable popcorn flick"}, {"rating": "1", "text": "Though 'Battleship' wasn't the cinematic abortion I anticipated it to be (it's more like a cinematic miscarriage), it remains an unoriginal, exhausting, drawn-out, ridiculous experience. It lives up to all of the trappings of any standard summer action blockbuster and could easily be mistaken for another installment in the Transformers series (Transformers 4: The Revenge of Peter Berg). The resulting picture bears barely any resemblance to the game it is based off of and what respects the film does pay to its origins are more cringe-induced than tongue-in-cheek references (Really? The robots' missiles are actually peg shaped?) A better move might have been to have just ditched the board game idea and simply created an \"original\" product. As far as special effects are concerned, I remember when visuals and slow-motion were aspects of filmmaking used when necessary for effect, rather than as a time-filler to make up for an absence of originality. But even when the filmmakers realize this, they still feel the need to throw in factors like plot and characters, while their focus always remains on the razzle-dazzle. I would be more satisfied simply watching images going by, having no brain stimulation whatsoever, than being forced to watch uncomfortable looking actors try to bring out bland, ridiculous stock characters. In fact, I believe that watching robots blow each other up will cause less brain damage than watching these faux characters interact, if they are misconstrued as deep, real people. Not to say that there aren't any pleasures to be had at all in 'Battleship'. One, for instance, involves the frenetic pursuit of a burrito that, although less absurdly inspired than just plain absurd, delivers some zany fun to an otherwise airless movie. However, as a whole, 'Battleship' can't manage to stay afloat (stupid pun not intended)."}, {"rating": "4", "text": "Going into Battleship I expected a cliche movie and putting myself into the mood of mindless stupid loud action and that's exactly what I got. It was entertaining to a certain point. From the scene where Taylor Kitsch and his crew team up with the old \"badass\" veterans till the end was more entertaining than the rest of the movie. Cheesy? Yes, but watchable for only one time. It wasn't too bad, though it's definitely not a memorable-good-time kind of movie ."}, {"rating": "1", "text": "There is only one fun element, one remotely enjoyable aspect about this film. I guarantee you that's all that you can call a 'positive aspect' of Battleship. And that's watching the guns fire on the actual warships. Which maybe takes up ten minutes of the film or so."}, {"rating": "1", "text": "You've got to be **** me, Battleship. Funny how I don't remember there being aliens in the board game, when I played it as a kid. And casting Rihanna for one of the lead roles? I should've known this was bad news the second I saw Michael Bay's name on it."}, {"rating": "3", "text": "Boring Rubbish. The acting was fair enough however I think Rihanna  should stick to music. but the story and plot is just boring. Ships shoot at space ships things blow up and that's it. There is an attempt at some kind of love story on the side but it really adds nothing off value to the story and is just pointless. The veterans who help pilot the USS Missouri was just a too bit weird for me it was a nice idea but did not really work in the film fair acting and poor story make for a film that you really can miss."}, {"rating": "5", "text": "This movie wasnt awful, but it wasnt particularly good either. A dumb plot with lack of actual ship fights holds this movie down until the end where the USS Missouri fights the motherhship. I can usually accept a bad plot and stuff when it's supposed to be non stop unrealistic action, and this is no exception. I don't love it, I don't hate it, it's just a generic summer blockbuster; mostly action, with little originality plot wise."}, {"rating": "4", "text": "Just watched this fantastic mess.   I always love the premise of a movie that attempts to reconcile what would happen \"if\".  In this case, what would happen if we were visited by a hostile other worldly species with technology far superior than our own.  Answer:  (spoiler alert)  A group of geriatric world war II veterans bring a mothballed battleship out of retirement.    The number of holes in the sinking destroyers cannot match the number of holes in this plot.    I don't mind suspending disbelief in order to enjoy a movie.    But this one will insult your intelligence.    Liam Neeson will NOT be putting this one on his resume."}, {"rating": "5", "text": "La película empieza de forma normal, después empieza a tornarse a su historia correspondiente, pero luego se pierde de su relato original y se va a un decline desfavorable, aunque cabe mencionar que logra entretener."}, {"rating": "4", "text": "A really boring movie. It was a cool concept but it didn't work for me. I am a big action movie fan and all of the action scenes in this movie I found really boring. They were supposed to keep you entertained with those action scenes as there were so many of them but it didn't do its job well. Also there was sub par acting so it is also a bad movie in that sense."}, {"rating": "2", "text": "This movie has some exciting action scene, but it is just extremely boring. The plot is so retarded. I can't believe I spent money to watch this. Not only the movie is bad, the game is even worse than it. I am not going to purchase anything with the word \"Battleship\" on it again."}, {"rating": "6", "text": "Battleship is far from being original. But as dumb action movies go, it's a very fun movie and has some pretty good action sequences and effects. If you liked the Michael Bay Transformers movie, you'll like this one. 6/10"}, {"rating": "4", "text": "\"Battleship \" was adapted into a Hasbro game , but as we deserved to see the film, a disappointment that the part of the game , one step one scene, the extraterrestrial rest and warships or more , to the participation of the Rihanna true , It true was a contempt and a whole s**t"}, {"rating": "4", "text": "This movie makes the board game look completely outdated. There were (correct me if I'm wrong) no aliens in the board game. I try to explain that this movie's trying to be better than the game, but it tried way too hard."}, {"rating": "0", "text": "this movie gets a 0/10 from me, the script NEVER made sense, the cheesy dialogue was just bad, terribly placed and even though it was randomly placed any time during the action scenes, you could know what they were going to say. The story makes no sense at all and it isn't funny. I was very pissed at the movie. The digital effects were pretty amazing, but nothing else in the movie is acceptable"}, {"rating": "2", "text": "This movie was awful, it was boring and too full of cliches, worst of all it was so unoriginal that it riped off a lot of different things. For example there is a scene in the beginning of the movie that they totally rip off  of a famous youtube video about the \"worst robbery ever\". Then there is Taylor Kitsch as a good for nothing slacker who, as always happen in Hollywood, is the one that saves the day. Next you got Rhianna trying so hard to be Michelle Rodriguez that you start to wonder why couldn't they just cast Michelle for that part. Then we got a super model playing the Naval \"Therapist\", all the while looking as she is too dumb and pretty for that being her profession. There are a lot of cliches that I could write 5 reviews in here just naming them. Not only that but the Aliens instead of looking menacing look as a bunch of hippies in Halo armors."}, {"rating": "0", "text": "Spoiler alert! Things blow up!  The plot cant blow up because there is none.  Almost less as Dark Shadows, but louder and with more VFX.  Avoid this movie at all costs."}, {"rating": "4", "text": "Again, other hasbro game/toy that appear in the big screen, Battleship is a popular board game, popular in much years, and why not do a movie? I belive that Hasbro don't learn with the disasters of G.I. Joe and Transformers. The story is really good, but have a terrible development, in the only things that you watch are explosions and pretty effects. The performances are terrible, some people of the cast (Liam Neeson) do a good job, but the rest is terrible. Battleship is funny in some moments, but the biggest part of the time is a disaster."}, {"rating": "1", "text": "Firstly, I can't remember any aliens in the battleship game? Also who's idea was it to cast Rihanna? The acting was labored, the sfx were meh and worst of all I paid $20 to see this drivel."}, {"rating": "0", "text": "Noisy,dumb,and with one of the worst scripts i have already seen,this movie is Transformers 2 with ships.Despite some good visual effects by Industrial light and magic"}, {"rating": "1", "text": "It gets a 1 for Liam, other wise omg how could they sink $200 million into this waste of time that's really just a recruitment for the Navy. Awful dialogue, cardboard acting, giant plot holes. OK its just an action flick but it's no wonder it's bombing."}, {"rating": "3", "text": "This is one of the worst huge budget action movies I have ever seen.  I'm giving it a 3 because most of the special effects were impressive and the sound engineering is great.  That being said, This movie, other than one really forced battle sequence, has nothing to do with the game of Battleship.  Instead of Battle Los Angeles, this is Battle Hawaii.  The plot is ludicrous. The writing is terrible and obvious.  It is corny and hokey.The acting is not great.  It was a major disappointment.  Liam Neeson was smart to make sure that his screen time in this stinker stayed to a minimum."}, {"rating": "0", "text": "This movie is utterly terrible. The only highlight comes early on when the movie recreates a viral video of a stupid thief breaking into a liquor store by falling through the roof and smashing merchandise on his way to the floor. Aside from that one scene, this movie has almost no redeeming qualities. The action is dull, the acting is cheesy at best, the plot is something out of a middle school writing assignment and the whole movie from start to finish is so unbelievably and unforgivably implausible that I found myself I found myself watching it just to say that I finished it and gave it a fair shake before it sank to the bottom of my \"worst movies\" list. The movie seemed bent on ruining its own attempts to pull you into it by swiftly kicking you in the mouth every minute with a face-palm worthy line or a terrible attempt at humor.\r The whole movie came off to me as a shameful attempt to milk money out of the market. They should have made it into a cartoon or better yet: not at all and donated the money they saved to charity and I would have been impressed.\r 20 years from now, when someone asks me why I'm so jaded, I'll tell them that this movie was the point at which I irredeemably lost my faith in humanity.\r This movie is lousy and downright insulting in its portrayal of our sailors and service men and women."}, {"rating": "3", "text": "It's okay at best. This movie is just an giant advertisement for how awesome the navy and army is. And more you got coke and subway probably more that I didn't notice. And don't forget what the movie is centered around Hasbro's game battleships. Which is like 10 minutes max? It's more hinted at battleships then it actually is. Or its that childhood friend that cheats all the time and moves there ship. I wouldn't even pay 5 dollars to see this movie."}, {"rating": "2", "text": "I will be brief with this review of Battleship, because there's absolutely nothing worth discussing in this film. The premise and screenplay for this movie was already bad, but director Peter Berg drives this film below the ground. Box office poison Taylor Kitch, True Blood's Alexander Skarsgard, Hottie/singer Rihanna along with the rest of the cast give a collectively dismal performance. Battleship was an empty barrel, riddled with cliches and disdainful dialogue. The dialogue in this was so terrible, one of the characters in the movie had to stop and ask, ' Who talks like that?'. This movie has rightfully been compared to the Transformers films (in fact it was worse), but at least Transformers had exemplary technical elements. Do yourself a favor and skip this one."}, {"rating": "3", "text": "Are the transformer movies too intellectually stimulating for you?  If so, I have found a movie for you!  Cornball, cheesy, implausible, loud, and more loud.  Aliens with amazing technology and superior intelligence somehow can't communicate with their home planet without the help of our old school satellite dishes.  Yeah, right.  I would like to say that Rihanna was a terrible actress, but I'm not sure anyone could give a great performance with the horrible dialogue she was spouting.  At one point, after losing over half the fleet and death is all around him, Taylor Kitsch says \"I've got a bad feeling about this\".  Really?  You finally have a bad feeling about it?  The great Liam Neeson is rarely featured and is simply picking up a paycheck.  Why hire a great actor and not use him?  He probably read the script and refused to say the cornball dialogue.  The special effects are terrific as you would expect from a modern day film made on a computer.  There is only one small part of the film that uses the Battleship Game format and it's eye rollingly bad."}, {"rating": "2", "text": "If you go into this movie expecting a good action flick, you'll be disappointed.  If you go in looking for a good laugh at a typical, cliche filled action/alien movie, you'll be entertained.  But it's never good when a movie is hilarious while trying to be serious."}, {"rating": "0", "text": "This movie is simply stupid."}, {"rating": "0", "text": "Rihanna is the worst actress I've ever seen. So terrible."}, {"rating": "1", "text": "Typical American hero movie with a very predictable story and outcome. The music the old war heroes and the love story. The lines reminds me of Rambo and McGyver."}, {"rating": "5", "text": "Battleship was OK.  I mean, it is your prototypical action movie... heaps of mindless action with a bland story to bundle it all together in plastic wrap.  If you are the type that will get a kick out of mindless action, then Battleship has you covered.  However, if you want more than that, you may want to turn elsewhere.  It has enough moments to distinguish itself as its own movie and story, but in the end, the story boils down to an immature character learning maturity the hard way, with a couple of stupid and dull romantic scenes to help the main character show off more of his personality.  It is the number one way to cop out of dynamically developing a character on screen.  The soundtrack is mostly rock but the soundtrack felt forced into the movie instead of really enhancing it.  You could remove most of the music and it wouldn't really influence the quality of the movie.  Long story short... go if you love your high octane mindless action movie, but think twice if you want something more than that."}, {"rating": "2", "text": "Battleship is just another action-filled, banal excuse for a film. The characters have no substance and the story is ridiculously bland. This film, like many modern films, relies on explosions and pretty visuals to entertain the crowd. Battleship was a mistake and only children and common adults will enjoy this film."}, {"rating": "4", "text": "To be honest, I haven't seen and reviewed movies for quite a while. My dad wanted our whole family to watch something fun and enjoyable for our bonding time, so we watched \"Battleship\". That alone was the single greatest mistake I have made in 2012. Peter Berg's \"Battleship\" is straight up terrible. The characters are bland with wooden acting, the plot is nonsensical with over-the-top CGI destruction, and most of all the whole concept of the movie was **** Really? I mean, making a movie out of a BOARD GAME? Hollywood just got more retarded in my eyes."}, {"rating": "0", "text": "I would have given it 6/10 for the scifi, but its American propaganda forces me to give it 0/10.\rThis is a movie that will not work well out of US. The cold war is over folks and there is no room for a real Starship troppers movie wannabee. Get this US propaganda **** out of my theater ASAP, it stinks.\rBattleship Los Angeles sucks ass big time, its even worse than Battle LA, believe that !"}, {"rating": "4", "text": "Another highly predictable movie with predictable ending! The only thing is good about this movie is special effects. This is that sort of films that you watch and forget, highly unlikely you'd like to watch it again!"}, {"rating": "2", "text": "Honestly, i think we can all agree that its pretty impossible to make a good film based off of the board game Battleship. When i first heard about it i thought it was ridiculous....and it was. This film had countless flaws, all lead by the horribly written script. My god this movie was corny. I can tell at some points it was meant to be cheesy, but not the entire film. Even the moments that were meant to be dramatic and we were supposed to feel for the characters, i just didnt, it was laughable. The acting was atrocious, Brooklyn Decker is a gorgeous woman but she cannot act to save her life and same with Rihanna, although it was her first film so we can give her a little break, but while i enjoyed Taylor Kitsch in John Carter, he just seemed like a tool in this movie, i only felt anger towards his character. When i first saw the trailer and the cast for the film, i thought \"well Liam Neeson can probably carry the movie\" but his character probably only had a total of 5 minutes of screen time which i have to say was very disappointing. I didn't expect this movie to be good in the first place because the concept of it is just ridiculous so i think i've bashed it enough. The only positives in this movie were the action (which was sub-par at best) and Brooklyn Deckers chest. 2/10 Wait for it to be in Redbox or on Netflix, not worth the admission price."}, {"rating": "3", "text": "The film adaptation of Battleship proves to be about as poor as one might imagine. The movie rips off a number of recent flicks -- namely of the alien-invasion-leads-to-mass-destruction variety -- most of which are derivative enough as it is. Thusly viewers get a simultaneously bloated and watered down translation of the popular Hasbro game. One sequence comes close to dramatic line readings of \"B3!\"/\"Hit!\" with related visuals, but most of Battleship comes off as an excuse to, say, blow stuff up real good. Of course the movie can barely do this well; the action scenes are so poorly edited that one can barely make sense of the confusion. Bright lights and loud noises bombard the senses. The rest of the movie involves several pasted together subplots featuring a parade of cliches -- such as a rebellious Navy lieutenant seeking the approval of his girlfriend's father while also learning to take command of his men; the aforementioned girlfriend's work with a wounded veteran, who learns how to accept the loss of his legs and respect himself again; the scientist whose work brought on the alien invasion, and his reluctant stabs at bravery. This would all be well and good if these matters were given the thought and time they deserve, but instead, the filmmakers decide to throw aliens at everyone, and their attributes become decorations. Not that one should expect more from a movie based on a board game, but the characters are too poorly defined to care about. Again much of the alien invasion is not well done. The effects are decent but more often than not indiscernible, and some of the designs are simply lazy. A mildly rousing conclusion featuring a historical battleship and WWII vets comes off as too little, too late to save this hulking train wreck. There is a cultural problem with movies like these, ones eager to depict mass destruction without pausing to consider the presumed loss of life. Typically they earn a PG-13 rating, allowing audiences too young for R-rated flicks to bear witness. But how exactly is the younger generation supposed to feel when buildings in Hong Kong are destroyed, especially when the movie flaunts its big explosions and toppling buildings? Those eagerly awaiting the next Transformers sequel or some similarly brain-dead nonevent will likely enjoy this movie. Others should simply steer clear. Battleship is one of those movies no one will really remember in a few years, let alone in a few months."}], "recommendations": ["geostorm", "transformers_the_last_knight", "independence_day_resurgence", "xxx_return_of_xander_cage", "shadow_in_the_cloud", "the_tomorrow_war", "teenage_mutant_ninja_turtles", "skyline", "pacific_rim_uprising", "transformers_revenge_of_the_fallen", "volcano", "the_old_guard", "bloodshot", "into_the_storm", "transformers_age_of_extinction", "wanted", "the_darkest_hour", "the_transporter_refueled", "war_of_the_worlds", "doctor_strange_in_the_multiverse_of_madness", "infinite", "poseidon", "lockout", "army_of_the_dead", "london_has_fallen"]}