{"id": 863, "title": "Baywatch", "starring": ["Dwayne Johnson", "Zac Efron"], "runtime": 116, "genre": ["Comedy", "Action", "Crime"], "description": "Devoted lifeguard Mitch Buchannon butts heads with a brash new recruit. Together, they uncover a local criminal plot that threatens the future of the Bay.", "releaseYear": "2017", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/6HE4xd8zloDqmjMZuhUCCw2UcY1.jpg", "categories": {"plot": 3.9310344827586206, "acting": 3.15, "ending": 2.3333333333333335, "soundtrack": 2.0, "cinematography": 5.0, "familyFriendly": 3.0, "funny": 4.404255319148936, "action": 4.625}, "reviews": [{"rating": "6", "text": "I went into this expecting a garbage fire, but it was actually slightly passable as a movie. I wouldn't really recommend it, but I wasn't disappointed in the end. I've definitely seen worse in the theaters. It should have been about a half-an-hour shorter and kinda got lost in the middle of itself, but okay overall."}, {"rating": "5", "text": "A completely forgettable comedy that has some good chemistry and a few chuckles, but a weak script. As a one time watch you can go along for the ride but unless you're a huge Rock fan or Zac Efron fan you won't feel compelled to revisit it.  C"}, {"rating": "5", "text": "A truly terrible movie, but an enjoyable one. Whilst the story makes no sense on so many levels, it is almost pointless to delve in to as the film knows its place as a huge mesh of stupidity. Baywatch is so bad it's entertaining."}, {"rating": "3", "text": "I know this movie is supposed to be a dumb, fun, summer comedy.  While the movie is self-aware of this, it even failed to land some of the comedy that should’ve the center point of the whole movie.  Meaning that there are certain jokes that didn’t land and they just kept going which made me even role my eyes.  When a comedies jokes don’t land and go on too long it’s a sign that the movie is becoming more dumb than fun.  The comedy shouldn’t have annoyed me, meaning that bad jokes just went on for too long or didn’t lead to better jokes.  While the movie is self-aware, and kind of fun, it fails on a comedic level that makes movies like this enjoyable for audiences who will see this movie.  Some people might find the raunchy comedy really funny if that’s what they like, but if you, in general, like comedies you might not be laughing as much as you thought you would be during this movie."}, {"rating": "2", "text": "Found this to be quite unwatchable. Plays like a 116 minute pop music video with 2-3 second cuts everywhere. Doesn't know if it wants to be serious or comedic in tone yet fails at both. Sadly the charismatic cast weren't enough to rescue this movie from below par entertainment."}, {"rating": "2", "text": "Slightly entertaining, thoroughly horrendous, juvenile, and cliche riddled; a teenage boy's fantasy. The story is garbage and the acting is just as bad. If Dwayne Johnson wasn't Dwayne Johnson this would have been career suicide"}, {"rating": "2", "text": "Baywatch is the most cringe-inducing movie of the year, I was wincing throughout the whole movie. The first 30 minutes are some of the worst film making I have seen in my life, the jokes are awful, the story is cliche and predictable and the opening scene is quite possibly the worst movie scene of the year. The special effects are some of the worst I've seen for a movie of this calibre, and don't get me started on some of the performances. The performances from some of the actors are so bad that the characters are really unlikable. Priyanka Chopra gets the worst actor award for this one. Dwayne Johnson is the only redeemable thing about this movie, and he doesn't even put in his best performance."}, {"rating": "3", "text": "Despite having a decent cast, the writing in Baywatch makes great actors like Dwayne Johnson and Alexandra Daddario look like amateurs. The plot and story is also extremely poorly written."}, {"rating": "7", "text": "Matt Brody is a former Olympic swimmer who wants to join an elite team of lifeguards led by the hulking Mitch Buchannon. Brody thinks he's a shoo-in, but his casual attitude starts to instantly rub Mitch the wrong way. When drugs and a shady resort owner pose a threat to the bay, Mitch and Matt must put their differences aside to spring into action and save the day."}, {"rating": "3", "text": "the story line is weak, and it felt flat the whole timenothing interesting happened :/they could've made it way better but i guess the writers are lazy now adays."}, {"rating": "4", "text": "Going into this movie I expected an overly dumb raunchy comedy, which I like from time to time. Baywatch did fall short of those low expectations. It did have some chuckle filled moments but not enough to make it the \"perfect summer movie\" that they claimed it to be. I will give them credit this movie was sexy but sexy alone doesn't make a good movie let alone a great movie. To sum this film up it was simply just \"okay\" not bad but not good either."}, {"rating": "4", "text": "Película que califica solo por sus actores, momentos divertidos pero en general lenta y con muy poca trama, se basa más en lo sexy de los actores que en una historia o comedia"}, {"rating": "4", "text": "\"Baywatch\" é um filme regular, onde o seu regresso não foi tão triunfante. As performances são razoáveis, o enredo é um pouco absurdo e só concluio que o ator Zac Efron só se safa em filmes de coméda com piadas indelicadas e ignorantes."}, {"rating": "3", "text": "If you can make it through this movie, you are probably an immature 16 year old boy with absolutely nothing better to do. Embarrassed for the cast."}, {"rating": "5", "text": "This movie is both the worst and best movie I have ever seen. On one hand it's horrendous in every aspect, from action to jokes to characters. On the other it's so stupid that I actually kind of love it. I can't tell you if you will enjoy it, but if you saw the commercial and thought \"that looks so bad it's good\", then I would check it out. If not, then avoid at all cost."}, {"rating": "1", "text": "I really thought George DonkeyPenis did a great job obliterating the screen. Alexandras had some nice boobs but the dialogue here was a joke. The DonkeyPenis monologues in the end detracted from the story, which led to an overall failure of the screenplay as a toke. -Mang"}, {"rating": "2", "text": "This Baywatch movie is a saddened disgrace of its source material back in 1989 and that isn't trying to say enough. Even though it opens a day earlier than intended, this is most likely the quickest method to wasting money on something that was expected to be great in the first place."}, {"rating": "4", "text": "Yep - it's really as bad as everyone's been saying, even with the always-enjoyable presence of Dwayne Johnson and the surprisingly competent -- nay, noteworthy -- performance from newcomer Kelly Rohrbach. Indeed, it's the other, more unlikable characters and the unholy surfeit of dick jokes that ultimately renders every slightly passable element of this movie into the murky, juvenile mush \"Baywatch\" that really is as a whole. Just go watch \"21 Jump Street\" instead. Or \"22 Jump Street.\" Hell, watch \"SWAT,\" or any movie that isn't this for that matter."}, {"rating": "2", "text": "Horrible. At the beggining you think is going to be kind of a \"scary movie\" or a \"american pie\", but with lifeguards, but it worns off really quick. 3/4 of the movie you will cringe after hearing some of the lowest type of jokes, mixed with heart-breaking clichè dialogs. You will be doing a favor to yourself staying away from this movie."}, {"rating": "0", "text": "What a piece of joke. Is this the best what Hollywood can do? The same boring jokes, vulgar dick jokes. Totally unfunny. Please Hollywood, change your meds."}, {"rating": "5", "text": "Essentially it tries to do for Baywatch what Phil Lord and Chris Miller did for 21 Jump Street. It's stupid, nonsensical, and unnecessarily vulgar. All things I'm usually okay with provided the movie is funny. Baywatch just isn't really. The movie at it's best when it's reveling in it's own absurdity. Something it isn't able to do all that much of as it never gets as goofy or over-the-top as it needs to. The majority of jokes here are of the same variety you'll find in any other modern R-rated comedy these days. The difference is here they feel flatly delivered despite Efron and Johnson giving it their all. There are a few chuckles, but not enough to make this stand out from the pack.The plot is a whole bunch of nothing. It makes no sense, but to be honest it didn't really need to. It just needed to give it's cast reason to do a bunch of stupid stuff. It serves that purpose and not much else. The sense of self-awareness Baywatch has about itself feels underserved. You can't really be in on your own ridiculousness when you aren't that ridiculous after all. When it isn't cracking lame jokes or moving it's bland plot forward with some really boring investgations, the film is all about glorifying beautiful bodies. There's some eye candy here for both the guys and the gals. It's ultimately not a very sexy movie, but if you're really young to the point where you really shouldn't be watching this in the first place, then there might be some excitement here. The rest of us will just sort of not really care.Dwayne Johnson and Zac Efron are just as likable as ever. The movie? Not so much. It never gets as silly as it needed to be. The results are pretty bland as a result. There are plenty of better comedies out there that play more to the strengths of the two leads. I mean Baywatch isn't exactly awful, but it's not good either. If you want to see sexy bodies and hear some dick jokes there are plenty of better alternatives out there that will give you your fix. Or you can just actually go to the beach with your dumb frat buddies. Let this one get lost at sea."}, {"rating": "2", "text": "So bad it made me angry... It's basically an insanely long Saturday Night Live sketch that's outstayed it's welcome... It runs for 2 freakin hours!! Tonally it switches from slapstick comedy to cheesy year 2000 action, which doesn't work and is jarring. Storywise, there pretty much isn't one.... Corny Priyanka Chopra drug lord being all drug lordy on Dwayne's beach, it's up to the crappy Baywatch team to stop them. That's it.Just about everybody is phoning it in, except for Jon Bass who is quite funny as Ronnie.I give it 1 point for Ronnie and 1 point for the few jokes that worked. Otherwise one of the worst films I've ever seen."}, {"rating": "2", "text": "I love Dwayne \"The Rock\" Johnson, guys a great actor and has the ability to make even average movies watchable (ie. The Fast and the Furious franchise) Unfortunately, I don't even think he could save this tired rehash of the old TV show. My main complaint with this was that I felt like it was trying too hard to be like 21 Jump Street with Jonah Hill and Channing Tatum but lacked the heart and the comedy to even compare to those movies. I pondered why this movie was even made and what compelled The Rock and Zack Efron to even waste their talents on such garbage."}, {"rating": "8", "text": "This movie brings the cliche plot from the series, as their original actors. The film has no commitment to be serious, having a good mood used in the films 21 Jump Street and Deadpool, which pleased me a lot. What bothers me most and what bothers in each group movie is that one member was not as important as the others. If it's a team movie, everyone should have a good time and importance, right? The villain is a good actress, but for the film, I found it a bit weak, and could have a lot more potential.To conclude, the movie is a reason for you to go to a movie theater with friends and have a good laugh and not see it with the intention of analyzing it as if they were Angels and Demons or The Journey, since it was made to fun. Before seeing any criticism of a \"specialized website\" go yourself and draw your own conclusions, since that is what I do."}, {"rating": "0", "text": "Another tragic attempt by Zac Efron to get a hit. And again, he failed. The movie is very lame and cringe-worthy. Did not like it at all. People even left the theater during the film, the security was going crazy, but the movie is simply horrible."}, {"rating": "4", "text": "A fine Summer action flick that pays homage to its predecessor without offering anything new, Baywatch provides enough occasional laughter to provide entertainment for 2 hours, even though it is slightly overlong and ridiculous."}, {"rating": "2", "text": "Dwayne Johnson stars as the cool lifeguard leader and Zac Efron plays the unruly new recruit, as they solve one of the most unoriginal crimes ever committed for cinema. There are several impossibly-toned women to round out the team and one nebbish for comic relief who's never funny. This is supposed to be a spoof, but the gags all fall face first in the sand. With the exception of Efron's ridiculously ripped body and all the women's heaving cleavages, there's nothing in this movie worth seeing. NOTE: In addition to the dumb outtakes during the credits, there's one final stupid joke at the end."}, {"rating": "8", "text": "Actually has some very funny moments. Not as bad as the critics make it out to be. Worth a watch."}, {"rating": "3", "text": "Baywatch is very stupid, not funny at all, has a crappy story, and fails because this film has lots of messed up characters and scenes. Yuck."}, {"rating": "8", "text": "I'm rating this movie, for solely itself and not the TV series expectations. Baywatch is a big, hot, sexy movie. The humor it's more often really funny it even cracked me up a few times. Great cast, actors did everything beautifully. Interesting story, although it's pretty cliche, but it does good at that. It really shows that everyone had fun with this movie, cast & directors etc. Overall it's a good movie, don't know what every other person expected, but expectations ruin movies. So try to be objective, and if you really are then you know this movie was decent."}, {"rating": "7", "text": "It blows my mind all the negative reviews this movie got. This movie clearly knows what it is and lives up to the same absurdness of the original TV show. Lowbrow jokes, cheesy lines and a ridiculous plot are all included. I give this a 7/10 because this movie never tries to hide what it is. Knowing that and having that mindset going into watching it, it turns out to be  pretty good for what it is. It will not win any awards or be something to see opening night but its good for some turning off your brain mindless fun."}, {"rating": "8", "text": "It is a great movie with good moments of comedy and very sexy films, there are moments in the production that are not very good but the movie is outstanding"}, {"rating": "10", "text": "Haha I just love this movie. Its funny and perfect for me. It also brings back a lot of memories (:"}, {"rating": "10", "text": "great movie dont care people say this movie was verry funny il watch it again"}, {"rating": "10", "text": "i love dis movie it’s so good y’all should go watch its super funny you’ll get a pouch out of it it’s pretty good so yea"}, {"rating": "5", "text": "The cast is pretty game in this, and they clearly have fun but there's way too much focus on a stupid plot (it's fine that it's bad but don't let the audience realize it too) and horrible badly CGI'ed action scenes. Maybe they were meant to be funny? They weren't.Zac Efron is so swoll it's deeply uncomfortable. This is like whatever the polar opposite muscular body image equivalent of anorexia is. It ain't right, at all."}, {"rating": "3", "text": "When lifeguards turned homicides!In the 90s, when the original television series was aired, I was just a kid. Then it was too sexy, that I was not allowed to watch. The world has changed so much all these years. I always wanted to see that, but never had a chance. Now a film, possibly a new franchise if it all goes well. There were lots of expectations on it, but the film did not deliver that. Yet they have already announced a sequel.The bay security team is now recruiting new members. Three joins as the trainee after the tryout. Within a few days, a couple of suspicious deaths happen in the bay. The cops are not worried to solve it, but the Baywatch team jumps in and starts their own investigation. That leads them to a dangerous territory. From there, how they deal with it was revealed with some action-thriller.Pumped up body, starring alongside a current top star, nothing is working for Zac Efron. He's just an accidental actor, won't survive long, unless he turns it all his way like Ben Afflect did. On the other hand, Dwayne was awesome. All the other actors too. Priyanka was not ideal for such role. Because an Indian in a negative role for an American film, nah, it does not work. India keeps all the thugs and sends only engineers, doctors, scientist et cetera to the foreign lands. A Chinese or a Russian villain works better.No suspense. Everything was open from the beginning itself. Some of the comedies were good, but some were most absurd. Especially, I did not like the storyline. The Bay security force not doing their job, but police work. It goes completely out of the frame. It's okay doing same within their enclosure, but the film entered beyond that. Thus, the film missed to cover the beach events as what the title had promised. I hope the sequel would fall in line.3/10"}, {"rating": "5", "text": "Baywatch is not quite as bad as most reviewers say. It has juvenile humour on the same level as American Pie or any other summer teen flick. Thin plot with an unbelievable villain. But the movie knows it's cheesy and kind of bad. It's pretty funny and pretty entertaining. Maybe it was low expectations or just Dwayne Johnson, but it was alright."}, {"rating": "4", "text": "I came to this movie expecting some light jokes - nothing cerebral, but with lots of \"fun in the sun.\" In that department - the only one where it should have delivered - it didn't. The humor was on par with American Pie, save for a few wisecracks about how the lifeguards in the original series went above and beyond their job description.I'm not sure who thought Baywatch needed a racist black cop. Is that a mandatory quota to fill in Hollywood comedies nowadays? Our good friend The Rock also made it quite clear that only the best of the best were eligible to join the Baywatch team - not even Olympic gold medal swimmers are good enough, unless they prove themselves.Which is why this elite team proceeded to hire more weak females, that could not pull a drowning pet turtle out of an aquarium, and an overweight guy, whose only talent was getting boners in front of crowds, because \"he has heart.\"Now, I don't know about you, but I'd just love to drown knowing that the man who was in charge of helping me had so much heart, he died of a heart attack when attempting to reach the water.Personally, I'm not a Baywatch fan, but the entire premise of this film is so inconsistent with the source material, let alone its own claims, that I couldn't just sit back and enjoy it.In summary, utterly mediocre, and still somehow manages to insult the viewer at the same time."}, {"rating": "2", "text": "At beginning, Baywatch is silly but funny. From second act onward, plot adds a absolutely flat mysterious charge and suddently all jokes starts to getting poor. In another words, movie is 20% funny and 80% irritating."}, {"rating": "6", "text": "Baywatch is so bad it's good. It's a perfectly watchable slice of entertainment that is stupid, dumb, and self-aware of it. The plot is terrible but there are plenty of laughs to be found."}, {"rating": "1", "text": "Nostalgia - The remebrance of a good time or event that makes you happy.Baywatch in the 1990s was a cringe-worthy show, but it was much better than this piece of garbage of a movie. All this movie does is try and capitalize on the Baywatch name. Visually it does that fairly well, what with all of the sexy people dressed in red, and the logo and all that superficial **** Besides making fun of the slightly overweight friend, this movie is a vehicle for The Rock to flex his muscles and show off his acting \"skills\""}, {"rating": "5", "text": "Cant even hate too much on  this; of course the    runtime is bloated and some drama elements are garbage but it is    somewhat entertaining"}, {"rating": "4", "text": "After seeing the trailer you knew what you were getting yourself into. The movie had some funny moments, but at least the film knows what it is. It knows it's a stupid cheesy movie, and it succeeds in that front. Everyone did there job fine. The movie is also extremely cliched and you see everything coming from a mile away, but I didn't mind. If you want a stupid action movie where you won't have to think much give it a watch."}, {"rating": "4", "text": "Something is happening with the creative minds of Paramount PicturesThe cohort of people belonging Generation Z, hidden in their homes from litigant summer sun, was \"lucky\" of witnessing the transmission of a series focused on the adventures—independent in each episode—of the lifeguards of a beachfront city in western Los Angeles County, California, which was on-air a laughable period equivalent to a decade. The main promoter and only beneficiary of real fame thanks to the show—relegating, of course, the sexual symbol in which Pamela Anderson became—, was David Hasselhoff, who created a ridiculous and superfluous succession of feature films and spin-offs in order to keep afloat a TV series that since its beginnings were buried in the mess of simplicity and silliness. A few years later, definitive cessation of audiovisual products on the lifeguard group was declared, however, the satisfaction did not last forever by informing, shortly thereafter, that a powerful Hollywood producer would take to the big screen the underworld of the bay with much younger faces, muscles, and buttocks. It is today when it premieres its homonymous cinematographic idea, a kind of hybrid between 21st- century comical vices and analogies of vacuous modern blockbusters of the forebear decade.Having as a main culprit the inordinate budget Paramount Pictures bestowed director Seth Gordon—I don't understand why, but it was really surprising to me watching Andy Garcia and Eli Roth as producers on screen—, the film manages to leave, momentarily, the superficiality of robust, suntanned and perfect bodies to tell a joke of criminal story about drug trafficking, which employs a spoof of contemporary action movies while trying to keep a bearable aura by comical gags (moderately funny), ending in a high-calorie recipe, the equivalent of a super comedy production brought to disappointing levels. At present, there are noteworthy works which were released on similar dates and that had the same tone, the difference is that they had solid ideas from its origin, a quick and timely sample: \"Spy\" by Paul Feig.They are giving hints of the jolly and trivial tone from the very start, that will prevail in the story with Dwayne \"The Rock\" Johnson emerging victorious from the water with a bather in his arms and the film logo, with emphatic pride, as a backdrop, adding dolphins gambolling—perhaps lacking oxygen among such megalomania—out of the water. I must confess I felt an intense good foreboding in the kind of initial video clip, nevertheless, it fell apart as soon as I watched that the first two names in the opening credits are masculine, explicit significant that some actresses are merely eye- candy, in the same way, the detail of the dolphins provoked that, almost automatically, I took my hand to my head, a disappointing posture lasting at least the half of the extensive almost hundred and twenty minutes. It should be pointed out that this action had a brief lapse of laughter, but, they were so provisional, that I don't remember the causes.The storyline is as bad as if it were an episode of the series they forgot to transmit on TV. Matt Buchanan (Dwayne Johnson) and his pair of stunning workmates oversee a competition to find new and suitable members of the Emerald Bay life-saving squadron. In parallel, the corresponding subplot is unfolded about a network of criminals who use the beach as a camouflage for narcotics trafficking, with multimillionaire Victoria Leeds (Priyanka Chopra) as the key ringleader. The story honors its source by flaunting big men and voluptuous women in extra small bikinis stammering cheeky jokes.Neither inherent vis comica of \"The Rock\", Efron nor rising star Alexandra Daddario manages to consolidate an unambiguous definition for this work from the beginning, and although some of the humorous circumstances, especially those expressed graphically, are quite jolly and acerbic, the lax direction by Gordon, regrettable screenplay by Damian Shannon and Mark Swift, some word-for-word absurd special effects, raccord detectable mistakes, and the way in which ideas are let out, cause the film to finish as an adolescent, summer, rated-R film prospect with one of the most valued acting teams today, an enviable budget and an audiovisual result, fatally drowned."}, {"rating": "4", "text": "\"Baywatch\" was a regular movie, where his return was not so triumphant, the performances were regular, the plot a bit absurd, and it causes me more stupor that Zac Efron continues to star in comedy movies with rude jokes, but what saves are Cameos of the old characters, but by God, as Pam Anderson ruined, and more than invited her to that movie, it's a damn roll."}, {"rating": "2", "text": "I didn't want the show, so I went into this movie banking on The Rock and Zac Efron.  Not huge fans of either actor, but I've been fairly impressed with their comedies in the past.  I was really hoping the movie would turn out like 21 Jump Street, but it didn't even come close.  Overall The Rock and Zac Efron had pretty good chemistry together, but they definitely could have been utilized more.  Priyanka Chopra did a pretty good job as the villain, but outside of these things the movie was fairly awful.  The other characters in the movie were one dimensional and just felt more like props than anything else.  They didn't really spend any time going into their back stories except for quick one liners to justify a character's knowledge or deliver a bad joke.  Some of the scenes in the movie also seemed unnecessary or lacked content.  A good example from the trailer is the scene where Zac Efron is wearing the dress.  The scene starts, Mitch/The Rock makes fun of him, they find what they are looking for and then the scene ends.  No one stops to stare at him, nor does it result in them getting caught, all it did was stress that his character was stupid, which had been confirmed multiple times prior to that scene.  Scenes like this happened frequently throughout the movie.  A scene that appears to set up for something that will probably be hilarious and then nothing happens.  TL;DR Skip the movie.  Not enough humor to make the ticket price worth it.  If Hollywood was banking on people showing up because of women in swimsuits and bikinis, clearly they are not aware of the internet."}, {"rating": "4", "text": "Bad jokes, predictable ending, and extremely cringy. If not for the cleavages and the appearance of the amazing looking actresses, people would not have watched this at all. Go watch it with a group of friends so you could complain this with them."}, {"rating": "4", "text": "Absolute snore-fest of a first hour; almost turned it off. Characters are introduced, but there's no reason to care. Matt Brody (Zac Efron) is the single good character; his journey - of being gifted, winning it all, losing it all, then mounting his personal comeback - was the best aspect of the film. The film improves when it goes all cops-and-robbers / CSI / Magnum PI in the second half, but there's not enough tension to make it dramatic, and not enough jokes land for it to be funny.4/10 for the lovely ladies and Zac Efron's physique, but otherwise pass on it."}, {"rating": "5", "text": "When someone talks about Baywatch,everyone keeps thinking about slow-motion and sexy girls (oh,and also the original TV Series). Now that we have a full fleshed-out movie...How can i describe it? It's just 'Random things happening everywhere',altough i enjoyed it a bit. Since Dwayne Johnson's everywhere,in here,looks like it tries to make the audience laugh,but most of the gags and the 'vulgar' comedy was idiotic,but i rarely found myself chuckling in some of these scenes. The visual effects in this movie were the worst part of this movie,because they looked like they came out from a low-budget TV Spot. The story was predictable,altough in every scene there were (as i said) random things happening everywhere,that made this movie look nonsensical. Again,it's stupid,but it wants to,since most remakes or adaptations fail to recapture what made the original so good. And Baywatch is an example of it. Maybe it's a bit better if you bring sun protecion at the movie theatre..."}], "recommendations": ["zoolander_2", "thunder_force", "the_hangover_part_ii", "rough_night", "30_minutes_or_less", "this_is_the_end", "the_spy_who_dumped_me", "identity_thief", "couples_retreat", "thor_love_and_thunder", "red_notice", "neighbors_2_sorority_rising", "anchorman_2_the_legend_continues", "night_at_the_museum_battle_of_the_smithsonian", "keeping_up_with_the_joneses", "ted_2", "this_means_war", "deadpool_2", "the_happytime_murders", "paul_blart_mall_cop", "pitch_perfect_2", "a_million_ways_to_die_in_the_west", "sex_tape", "the_hangover_part_iii", "21_jump_street"]}