{
  "id": 4270,
  "title": "Bean",
  "starring": [
    "Rowan Atkinson",
    "Peter MacNicol"
  ],
  "runtime": 89,
  "genre": [
    "Comedy",
    "Family",
    "Adventure"
  ],
  "description": "Childlike Englishman, Mr. Bean, is an incompetent watchman at the Royal National Gallery. After the museum's board of directors' attempt to have him fired is blocked by the chairman, who has taken a liking to Bean, they send him to Los Angeles to act as their ambassador for the unveiling of a historic painting to humiliate him. Fooled, Mr. Bean must now successfully unveil the painting or risk his and a hapless Los Angeles curator's termination.",
  "releaseYear": "1997",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/IwrDPrB4d2DMcpnGkvan46yINL.jpg",
  "categories": {
    "plot": 6.0,
    "acting": 6.666666666666667,
    "ending": 5.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 6.0,
    "funny": 7.875,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "6",
      "text": "Not as funny as I thought it would be but the film has some of it's moments and have some great memorable scenes.Mr. Bean is a fun man.Bean is not bad at all but it is not great."
    },
    {
      "rating": "5",
      "text": "\"Bean\" is a monotonous movie that pertain a few laughs to laugh; no more, no less."
    },
    {
      "rating": "10",
      "text": "This is a great movie. Rowan Atkinson is great once again. Tom McGowan is great too! It's one of the best British movies ever made. I loved it,and my mom did too. Don't miss it!"
    },
    {
      "rating": "4",
      "text": "Bean represents Rowan Atkinson's first attempt to translate his brilliant character into a watchable 90 minute film format.  Unfortunately the film is flat and mostly unfunny.  Besides a few moments here and there, Bean just doesn't satisfy the way that the Mr. Bean program invariably did.  An extended cameo by Burt Reynolds(before it was cool to have a cameo by Burt Reynolds and frickin' everyone wanted one) adds a little flavor but the resulting film is still a cheese sandwich."
    },
    {
      "rating": "6",
      "text": "Very funny film, Atkinson is brilliant and premise is reasonably good, but in many ways could have been better."
    },
    {
      "rating": "6",
      "text": "\"Bean\" is an OK movie, which will bring you laughs, a lot of laughs. The plot is funny, the characters are funny and Mr.Bean got the same, great idiotic and unique acting."
    },
    {
      "rating": "10",
      "text": "Bean is unfairly underrated. It is a great movie. I enjoyed it, loads of laugh and love. This is one of the best movies I've ever seen in my entire life. Real fun and comedy. Don't know why people don't like this. Rowan Atkinson FTW!"
    },
    {
      "rating": "7",
      "text": "Rowan Atkinson's Mr. Bean is a funny soul, with his goofy faces and playfully obnoxious, scatterbrained attitude. But it all feels like one big, long, SNL skit."
    },
    {
      "rating": "4",
      "text": "\"Bean\" has good intentions. But noble intentions can't help this tired comedy movie overcome obvious gags, overabundance of plot holes and bland characters."
    },
    {
      "rating": "10",
      "text": "This is one of the funniest movies I have ever seen - maybe even the funniest. A perfect film.\rI think this film is better than Bean's second film (Mr. Bean's Vacation)."
    },
    {
      "rating": "10",
      "text": "A faithful, delightful and hilariously laughing riot feature film to the British television film. Flawed, but comedic ally fascinating, this film is a MUST WATCH for the Mr. Bean fans. It's so funny how a goofy British mumbling character causes so much trouble in the United States of America. Especially when the airport officer says \"Well you could really use some [medication]\" I was laughing like crazy. Even though it broke a rule (Bean speaks a bit differently than the TV series, it's still freshly squeezed comedy and fun for the whole family. To be honest, I also thought the TV series was funny and I was really hoping for a full length movie. Rowan Atkinson is truly at his best as the loveable and goofy character. The film used many of the ideas and skits from the original television series."
    },
    {
      "rating": "8",
      "text": "It's difficult for Bean to be a family-friendly film, despite the very funny stunts that Rowan Atkinson brings us, but they're already watched by viewers worldwide in Mr. Bean series, sadly. Anyway, this film brings a good message, very difficult to find out to understand, unforgettable main character, enjoyable story-telling."
    },
    {
      "rating": "7",
      "text": "Bean is a funny comedy film. If you liked the Mr. Bean TV series, you should give this movie a try. Rowan Atkinson is fantastic."
    },
    {
      "rating": "7",
      "text": "When this was announced many including myself was sceptical but it's a good attempt for a tv show to movie adaption."
    }
  ]
}