{
  "id": 85,
  "title": "Beckett",
  "starring": [
    "John David Washington",
    "Vicky Krieps"
  ],
  "runtime": 109,
  "genre": [
    "Crime",
    "Mystery",
    "Thriller"
  ],
  "description": "An American tourist in Greece finds himself on the run after a tragic accident plunges him into a political conspiracy that makes him a target for assassination.",
  "releaseYear": "2021",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/fBJducGBcmrcIOQdhm4BUBNDiMu.jpg",
  "categories": {
    "plot": 5.8,
    "acting": 5.6,
    "ending": 10.0,
    "soundtrack": 7.0,
    "cinematography": 7.0,
    "familyFriendly": 3.0,
    "funny": 5.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "4",
      "text": "A very convoluted plot, boring stakes, and messy character development make 'Beckett' a pretty forgettable film. The way they try to mix the story with the actual political climate is lazy at best. John David Washington is the least responsible for this mess. Still, I'd be embarrassed, as a renowned actor, to appear in the credits."
    },
    {
      "rating": "5",
      "text": "Thrillers of this kind don't need to be really logical, but at least they do need to have a little more focus, but unfortunately for Beckett, the whole story feels incredibly all over the place.Remarkably dispersed, jumping from one event to another regardless of the lack of cohesion, in a desperate attempt to maintain the suspense, which after a while becomes monotonous, because it doesn't go beyond situations in which the lead character escapes again and again of the dire situations he finds himself in for almost the entire duration of this story.John David Washington can barely hold the lead. I am sorry for him, but his performance is far from convincing, whereas I'm surprised that Alicia Vikander is only there for 20 minutes to be dismissed so quickly.Although it's fair to admit that she has some time without doing something relevant, however, I can't help but feel like she was wasted.I needed it more, but give it a shot, who knows. Maybe you'll enjoy it a bit more."
    },
    {
      "rating": "7",
      "text": "Earlier this year, Netflix pledged to have new film releases each weekend of 2021. I don't know when that was supposed to start, but Beckett was one of its film premieres from last weekend. Beckett is a contained film set in Greece starring John David Washington as the title character with small roles from Alicia Vikander and Vicky Krieps. The synopsis goes as follows: Beckett, an American tourist, and his girlfriend (Vikander), are on an romantic getaway in Greece when a tragic car accident upends his vacation and mires him a political conspiracy that may cost him his life. Here's how I see it.Beckett is an easy watch. If you have seen the trailer, you know exactly what you are going to get; but the way it comes at you is the interesting part. For a movie that is supposed to be a thriller, the first 10-20 minutes that establish Beckett as a character and his relationship seem very disconnected from the rest of the movie, but it's setting up the stakes. Once the plot kicks into high gear, what Beckett goes through becomes relentless - the camera work and music throughout help keep the tension high. In fact, as I watched the movie, I felt like it had some good Hitchcockian vibes. The sense that an unwitting, everyman gets chased and threatened by some overarching government conspiracy sets the essential stage of a taut thriller, not to mention that Beckett is in a foreign country with a language barrier. I could see Beckett as the Cary Grant character from North by Northwest. The problem with Beckett is that the reasons Beckett is being chased make no sense. The explanation is unsatisfactory and wholly forgettable. They probably shouldn't even have tried to explain it. Nevertheless, once John David Washington started running from the bad guys, I was completely engrossed. That was enough for me.Side note: I think this is John David Washington's best performance since Blackkklansman.Beckett is a good thriller that hits its stride about 20 minutes in. The first section is a bit of a slog, but if you make it through that, the thrill of the chase will get you. If you are looking for a decent film with suspenseful elements, you could do worse than Beckett. Grab a bowl of popcorn and enjoy."
    },
    {
      "rating": "1",
      "text": "Horrible acting. Poor dialogue.  No suspense. Vicki Krieps and Alicia Vikander were here for name only. Bad."
    },
    {
      "rating": "1",
      "text": "Wasted 1:50 minutes of my life. Really bad acting and very fake “action” scenes… don’t waste your time and watch something else instead ! You will thank me later!"
    },
    {
      "rating": "10",
      "text": "As a half greek person living abroad I enjoyed watching this movie with longing and nostalgia of the country side types of people as well as the street and culture of Athens. All along a little drama!.. I can’t understand why it got so bad reviews, when in the end its not that bad. I would even enjoy a follow up to this movie see what happens next. Did he get back? What was it really all about? This movie is for people who loves the cinema and a good cultural alternative movie"
    },
    {
      "rating": "8",
      "text": "8.5/10The movie lacks in every non-dialogue scene, it was too slow and it was pretty boring, but while they back at it, with a great dialogue, amazing performance by everybody especially Washington's, incredible action, great score, and great story, it was pretty hard for me to really going way down for the score, once it's good, it's so good, Beckett is still overall a great movie and one of the years best film."
    },
    {
      "rating": "0",
      "text": "WHAT AN ABSOLUTE TRÀSH OF A MOVIE.The pacing is as slow as my dad \"just leaving to buy milk\" only to come back 6 years later.If you want to watch a movie that:· Has the most BORING PLOT EVER and even if you think it's not that bad, the EXECUTION IS.· makes my classmate's school filmmaking project look like a masterpiece.· has A. LOT  OF injuries and still be able to run as if he's wolverine.· has most of the protagonist's screentime just HIM RUNNING & WAVING HIS ARMS LIKE A F@€#ING DUCK. (FOR REAL THO)· that wins MY AWARD for the MOST HORRIBLE ACTING of ALL TIME. · will make you lose your brain cells trying think of why & how this & that could possibly happen.THEN feel to start feeling HUGE remorse & regrets for wasting 1 hour and 50 minutes of your life because you didn't f@#€ing listen to the review."
    },
    {
      "rating": "3",
      "text": "bad[ bad ]adjective, worse, worst;(Slang) bad·der, bad·dest for 36.not good in any manner or degree."
    },
    {
      "rating": "5",
      "text": "While the film has a unique charm due to the excellent vistas of rural north Greece and the derelict areas of Athens, the wooden acting and the very basic story keep it from being anything more than a bland conspiracy tale"
    },
    {
      "rating": "0",
      "text": "Dog **** sad part, is people get paid to make this trash and waste our time."
    },
    {
      "rating": "10",
      "text": "This film kept me on the edge of the seat for 2 hours. Excellent thriller, I dont know what youall are wining about."
    },
    {
      "rating": "6",
      "text": "It was interesting while you watch it as you couldn't tell what will happen next and what is really happenning. After you see the movie it does feel a bit stretched out and too simplistic. I'm rating it more for the experience."
    },
    {
      "rating": "3",
      "text": "(Mauro Lanari)\"The feeling is that of finding oneself in front of a somewhat gratuitous exercise [...], devoid of a solid staging and capable of withstanding changes in scenery and rhythm, but the project is ambitious and all in all well packaged\" (Roberto Manassero), \"the action envelope is flawless\"(Emanuele Sacchi). Insignificant screenplay aside (Hitchcock, De Palma, Pakula, Pollack: are we kidding?), the expressive form is or pauperistic (a squandered budget for the cast, a John David Washington chosen before \"Tenet\" and a Vikander with an unrecognizable rounded face?) or of a sloppiness which by comparison \"I Cesaroni\" are a proof of professionalism. One is stunned by reading on the credits the names of Luca Guadagnino as producer, of Sayombhu Mukdeeprom his director of photography, of Ryūichi Sakamoto as composer of the score: were they on lunch break, on award holiday for no one knows what? Finally, the title: let's not bother and disturb the Greats without providing justifications."
    },
    {
      "rating": "1",
      "text": "Annoyingly bad from start to finish. JDW contributes about as much sincerity to this movie as Alan Ruck did to FBDO."
    }
  ]
}