{
  "id": 2880,
  "title": "Bedazzled",
  "starring": [
    "Brendan Fraser",
    "Elizabeth Hurley"
  ],
  "runtime": 93,
  "genre": [
    "Fantasy",
    "Comedy",
    "Romance"
  ],
  "description": "Elliot Richardson, a suicidal techno geek, is given seven wishes to turn his life around when he meets a very seductive Satan. The catch: his soul. Some of his wishes include a 7 foot basketball star, a rock star, and a hamburger. But, as could be expected, the Devil puts her own little twist on each of his fantasies.",
  "releaseYear": "2000",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/9aIg9oKMetjfDUNH1jDJKiw2Qos.jpg",
  "categories": {
    "plot": 5.0,
    "acting": 3.0,
    "ending": 5.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 5.0,
    "funny": 4.5,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "10",
      "text": "Fantastic movie. I loved, loved, loved this movie. Elizabeth Hurley gave an amazing and a sexy performance. Not to mention she had an amazing wardrobe throughout the movie."
    },
    {
      "rating": "1",
      "text": "You can get a few good laughs of this movie (thanks to the script), but from that to have scores above 6 out of 10 it's crazy, Fraser as always, over acting and yelling. Some people say that it doesn't matter that the movie it's dumb because all comedies have to be stupid and I totally disagree with that point of view, I do like fine, intelligent comedians in the movies. I think this movie deserves a 5 out of 10 but since it's being overrated this is my score."
    },
    {
      "rating": "10",
      "text": "In this movie Liz Hurley gave Chile an earthquake... she's so hot, that we don't care about that."
    },
    {
      "rating": "4",
      "text": "A mindless and hilariously flawed movie that can entertain you for the night, and through to the early morning (if you survive that long watching this). Brendan Fraser overacts, as he usually does, but in a way that really fits his character, and Elizabeth Hurley plays a very hot Devil as best as can be played. This film suffers from an awkward pace, very questionable and cheap effects, and a weak script. I can appreciate the protagonist's arch, but the other factors of the film don't bring anything redeemable or worthwhile enough to take time to invest into the character. They did, however, bring the movie down, like a ship sinking slowly beneath the surface."
    },
    {
      "rating": "8",
      "text": "A great film, with a great cast. Liz Hurley, makes the devil steamy."
    },
    {
      "rating": "8",
      "text": "A breezy comedy that is so easy to take thanks to sexy Hurley and likeable goof Fraser, who is shaping up into a comic superstar."
    },
    {
      "rating": "7",
      "text": "Hurley and Fraser have such easy chemistry with each other and it elevates the movie far beyond what it should have been IMO. Those two alone make the movie worth watching."
    },
    {
      "rating": "5",
      "text": "A charming underperformer, bedazzled was clearly made with a spirit of fun to it. Sadly the performances directed here, poorly aged visual effects and basic script just don't do the idea enough justice. An entertaining but flawed watch."
    }
  ]
}