{"id": 603, "title": "Bedtime Stories", "starring": ["Adam Sandler", "Keri Russell"], "runtime": 99, "genre": ["Fantasy", "Comedy", "Family", "Romance"], "description": "Skeeter Bronson is a down-on-his-luck guy who's always telling bedtime stories to his niece and nephew. But his life is turned upside down when the fantastical stories he makes up for entertainment inexplicably turn into reality. Can a bewildered Skeeter manage his own unruly fantasies now that the outrageous characters and situations from his mind have morphed into actual people and events?", "releaseYear": "2008", "mpaaRating": "PG", "imageUrl": "https://image.tmdb.org/t/p/w500/d0w4anZCzZX74deeQ3PE1byyg97.jpg", "categories": {"plot": 4.777777777777778, "acting": 6.0, "ending": 6.0, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 5.666666666666667, "funny": 6.636363636363637, "action": 5.0}, "reviews": [{"rating": "10", "text": "3.8 and 33? This is ridiculous. This movie was very funny. Although definitely at times a kid movie, it was still hilarious for adults. Adam Sandler does his normal comedy routine, with a mix of several different stories. I watched this with one of my best friends, we're both in our mid twenties, and we both found it to be very funny. The comedy? Very funny and for adults. The plot, romance, and serious moments? Definitely for children (corny) This deserves at least a 6, and for a children's movie at least an 8. Im giving it a 10 to offset what I believe is a very unfair low score. Id watch this a second time, no problem."}, {"rating": "2", "text": "Easily one of the most overrated movies of the year."}, {"rating": "4", "text": "Marty Feldman died in 1982 at the age of 49. \"Bedtime Stories\" pays homage to the bug-eyed comic actor by displacing Feldman's signature feature onto a guinea pig. This lame, alleged comedy shares with Darren Aronofsky's misunderstood \"The Fountain\", a diegesis informed by the laws of Buddhism, as evidenced by the rodent with Marty Feldman eyes. Reincarnation( the recycling of souls) is an eastern belief that finds puerile expression in \"Bedtime Stories\", when Skeeter Bronson(Adam Sandler) and the people from his current life appear together, over and over again, across different epochs in time. The same story, boy proves his love for girl through the performance of a heroic deed, gets recycled for its timelessness. Regardless of genre, the story works. \"Bedtime Stories\" posits storytelling as Buddhist in nature, after all, each story has been told before in some other form. It has structural similarities: a formula. People are recycled. Plots are recycled. \"Bedtime Stories\" performs an alchemy on the imagination by recasting Buddhism as an avenging god who killed all the Greek muses. If this commingling of disciplines(religion and the arts) had an origin story, a bedtime story, ahem, it would have film theorist Robin Wood writing his article on genre theory(\"Ideology, Genre, Auteur\") under a bodhi tree. In one scene, \"Bedtime Stories\" seems to refute Christianity as the film practices its religion by recycling Paul Thomas Anderson's frogs in \"Magnolia\". This time it's gumballs; this time it's not a miracle. The gumball sequence shows how every miracle can be undermined by a logical explanation. While the film challenges the hegemony of the dominant ideology, it doesn't change the fact that the story itself is tired and worn out, you know, recycled. Maybe god is a truly original screenplay. Maybe god doesn't exist."}, {"rating": "2", "text": "Adam Sandler seems he is the comedy king who will do anything, whether the script is good or not, he takes it; This is probably the rare \"Bust\" movie that was developed by Disney pictures. Oh, it even fails as a kids movie. Defining a kid movie, in age, is about 4-9, maybe age 10. But i can only say this would only become a \"wow\" to a 1 year old. This is Disaster Movie all over again, except its little kid friendly, but yet it fails. Maybe it's the lack of creativity, or maybe it's so unrealistic that we can't seem to put it to our imagination. The only good thing about this movie is if you (i am talking to ages 6+) have a hard time falling asleep, \"BEDTIME STORIES\" kicks in. So, the positives? [really the negatives] 1. It makes you fall asleep BORING 2. Audience 10+ will get great laughs from the werid plot and script, seriously, if you want REALLY REALLY GOOD LAUGHS (not the good ones in critisim), then..... watch this Weird, unthinkable, Illegal for all ages movie. Illegal for all ages means a movie is so bad, but it can be good if you want a laugh."}, {"rating": "1", "text": "Appallingly bad - I don't even know what to say."}, {"rating": "5", "text": "Imaginative, as well as disappointing. They could have done a lot more with the story. Adam Sandler displays his usual inane not very funny style of humor. Some good effects, expectantly fine production from Disney. Overall, it's fair."}, {"rating": "9", "text": "This was an enjoyable family movie. My son loved the much maligned Bugsy. It was nice to see, for once, a pretty CLEAN kids movie. It's unfortunate that Hollywood can't let kids movies just be for the kids - there are certainly plenty for us adults to see on our own."}, {"rating": "0", "text": "First, i would like to say that zt just committed plagerism by copy/paste the \"wall st. journal\" review. Second, this movie is the lowest most unfunny form of funny that you can imagine. It aloso SHOULD NOT be titled as a disney movie."}, {"rating": "7", "text": "It was a cute movie for kids and for adults can be boaring at times."}, {"rating": "9", "text": "An enjoyable escape for a family film."}, {"rating": "7", "text": "Hilarious throughout, even for a family film."}, {"rating": "8", "text": "Perfectly good Adam Sandler movie; not his best but also not deserving of the critical panning. If you've liked his other under-rated films, you'll like this one."}, {"rating": "10", "text": "Hilarious family entertainment. This film is a gem."}, {"rating": "8", "text": "That the critics panned this movie doesn't surprise me. I have mental block whenever I try to imagine a movie critic laughing. For those who like to laugh, this is good medicine. My family (who don't take themselves too seriously) laughed out loud with the rest of the cinema. Thanks go to Adam and Co for making us laugh again."}, {"rating": "10", "text": "Very funny, and a little bit moving at times, this movie is entertaining and enjoyale, and in my opinion, there's nothing negatie about it at all."}, {"rating": "8", "text": "Not half as bad a most of the stuff my 9 year old makes me go see. It was pretty good"}, {"rating": "9", "text": "Maybe one needs to see this movie with their kids to appreciate it, but we really enjoyed it. My boys aged 7 and 10 laughed all the way through it, and the audience clapped at the end."}, {"rating": "6", "text": "A surprisingly fun and imaginative family film. The overused \"divorced mom\" sideplot was a unnecessary and the ending was somewhat bland, but Adam Sandler was really fun to watch throughout (wow, did I really just say that?), and the blending of fantasy and reality was shockingly restrained, and all the better for that."}, {"rating": "8", "text": "An enjoyable Adam Sandler movie, much, much better than his previous 2008 movie, Zohan. Yes it may be geared towards kids, but I'm an adult, and I still laughed!"}, {"rating": "9", "text": "A really great movie, one I recommend for fans of comedies, it's absolutely hilarious movie, it is surprisingly enjoyable for adults too, if you like Adam Sandler and want to see him in a not so dirty movie, than this is for you."}, {"rating": "9", "text": "Bedtime Stories is a classic! Absolutely hilarious and a fantastic family film. I find the overall rating ridiculous, it should be a lot higher. It's very imaginative and very clever, great for children."}, {"rating": "8", "text": "i saw this movie back when it came out. and i enjoyed it. this movies is mostly a kids movie but its still pretty good. and actually better than most of adam sandlers newest movies...."}, {"rating": "8", "text": "Believe me, its a lot smarter than most of the movies from Adam Sandler and its actually family friendly unlike a lot of movies from Sandler."}, {"rating": "8", "text": "Cute little movie. Decent acting and the kids just make everyone go, 'aww...' Just a bit shocked that Walt Disney Studios Motion Pictures decided to produce this movie - a bit different than their usual genre."}, {"rating": "3", "text": "Bedtime Stories is Adam Sandler's usual shtick with dirty jokes and toilet humor. That's it. Any redeeming qualities have been lost from this movie. Calling it a Disney movie is an overstatement."}, {"rating": "2", "text": "Bedtime Stories will put you to sleep.\rAdam Sandler once again kills viewers souls with this mindless headache worthy monstrosity. There are little to no laughs and a terrible script."}, {"rating": "8", "text": "Bedtime Stories is a harmless Adam Sandler vehicle because he shows us his warm side!  Sandler shows in this film that he is a very funny man when given the correct material."}, {"rating": "8", "text": "this movie not that funny . but the whole point of the movie that drawed my attention to it . Grade A- ................................................."}, {"rating": "7", "text": "Adam Sandler HAS made some trash in his time but, annoyingly, sometimes, he'll make one that's pretty good and the critics still hate it. This and Pixels are his two best movies. It's really funny and features lots of the one-liners and witty comebacks we've come to expect from Sandler. This is proof that he's not a bad actor or anything. He's a talented guy in search of a good script. Sadly, the critics bash him no matter what. This may sound like a kids-only movie but there are plenty of subtle jokes to entertain adults too. Funny film, very enjoyable."}, {"rating": "8", "text": "This movie made me remember about my childhood days. Very funny and interesting too.\r Watch it online for free: https://www.primewire.ag/watch-104-Bedtime-Stories-online-free"}, {"rating": "1", "text": "The fact that people in the user reviews are essentially giving it 'pity points' shows just what to expect from this movie. Adam Sandler's greatest low. I'm still gonna give it a 1 only because it can provide some fun if you write down every overused story element ever before watching and play 'Cliché Bingo\". I got Bingo 4 times by the time I reached a third of the way in."}, {"rating": "6", "text": "This movie was fine, but it had its problems. The acting was mostly good even though it wasn’t perfect. The special effects were not good at all. Everything that was a special effect looked fake. The story was mediocre but fun. It was a nice story. I liked the beginning and middle but the end was slow. I recommend this movie if you want to watch something fun."}, {"rating": "3", "text": "way too hyper..Bedtime StoriesAn unusual plot but more annoyingly its exhausting and there is only Adam to look forward too, but in this one he too disappoints the audience."}, {"rating": "10", "text": "Although the trailers were completely wrong in showing how the movie would play out, I do have to say that it was pretty good. There were no good themes or lessons that I could learn but man am I a fan of gumballs. That scene is the only redeeming quality but it's so good that it makes it an instant ten. Didn't read the other reviews and hardly remember the movie stay in school and drink your ovaltine."}, {"rating": "7", "text": "Although not a spectacle, this film is a good entertainment, as well as being much smoother and more sensitive than many previous Adam Sandler films."}, {"rating": "6", "text": "I bought this movie on a whim when I seen it at Wal-mart sometime ago. Turned out to be a pretty decent movie. Very funny!"}, {"rating": "9", "text": "A Disney Adam Sandler movie, sound like it's gonna be a disaster FOR some people who of course not an Adam Sandler fan, and i can see that, in fact it exist, but i've wrote this many many times, i am one of those people who really enjoy most of Adam Sandler movie, either it's the one that got bad received and even good received which rarely of course, well Bedtime Stories is just another one, Disney surprisingly have a proper story for Sandler, and it works, it's a very entertaining film, a very funny movie, in fact it's so funny the movie succeed to make me laugh out loud which rarely happens, all the performances was good especially Sandler, it's for me another fun Adam Sandler movie, another joyful Adam Sandler movie, and it's definitely a better Adam Sandler movie that are mostly i still like, when he act as a normal guy without any silly wig and silly talk throughout the movie, he's definitely better than ever, Bedtime Stories is one of the best Adam Sandler movie."}], "recommendations": ["blended", "night_at_the_museum", "alvin_and_the_chipmunks", "alvin_and_the_chipmunks_the_squeakquel", "grown_ups", "peter_rabbit", "hubie_halloween", "teen_titans_go_to_the_movies", "the_spongebob_squarepants_movie", "chicken_little", "17_again", "hotel_transylvania_2", "alvin_and_the_chipmunks_chipwrecked", "captain_underpants_the_first_epic_movie", "click", "the_cobbler", "minions_the_rise_of_gru", "the_duff", "yes_man", "the_three_stooges", "ice_age_dawn_of_the_dinosaurs", "the_spongebob_movie_sponge_out_of_water", "the_pacifier", "herbie_fully_loaded", "hotel_transylvania"]}