{
  "id": 1753,
  "title": "Beetlejuice",
  "starring": [
    "Alec Baldwin",
    "Geena Davis"
  ],
  "runtime": 92,
  "genre": [
    "Fantasy",
    "Comedy"
  ],
  "description": "After an untimely death, a newly dead New England couple seek help from a deranged demon exorcist to scare an affluent New York family out of their home.",
  "releaseYear": "1988",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/nnl6OWkyPpuMm595hmAxNW3rZFn.jpg",
  "categories": {
    "plot": 7.609756097560975,
    "acting": 7.803571428571429,
    "ending": 7.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 7.9,
    "funny": 8.594594594594595,
    "action": 8.0
  },
  "reviews": [
    {
      "rating": "8",
      "text": "Couple have old house, friend wants them to sell, have car crash, die, new family move in, couple haunt them without success, ask \"People-Exorcist\" for help.Tim Burton at his best with a wonderfully surreal & dark tale featuring a very strong cast.The effects haven't dated that well but a lot of the creations here can be seen later in the equally brilliant Nightmare Before Christmas.Michael Keaton steals every scene he is in (although not that many) & you think he'd have been better playing the Joker rather than Batman in his next film after this performance."
    },
    {
      "rating": "9",
      "text": "A cult classic. Beetlejucie is hilarious, feel good and at some points, terrifying. The character is exactly how I would think a dead exorcist pervert **** would act coming along with all his mischief and tricks up his sleeve making for some pretty creepy sequences that are just past the line of being hysterical as well as slightly terrifying. I only wished they'd do more exploration in the world of the afterlife as there seems to be so much potential for a world there (I'd imagine this was further explored in Burton's Corpse Bride but it should've been in this movie as well)"
    },
    {
      "rating": "7",
      "text": "This movie was honestly not that bad. Yes, I do believe that the plot was kind of weird and, I mean ghosts? Really? But actual beetlejuice made the movie more \"available to watch.\" I know this review didnt really make any sense, but its hard to explain. The movie had something about it that every time I see it on TV I decide to watch it."
    },
    {
      "rating": "8",
      "text": "The first real film that you get a chance to see Tim Burton's visual style, but unlike some of his later films this film has a lot of substance.  Plus a great performance by Michael Keaton."
    },
    {
      "rating": "10",
      "text": "A hilarious classic from Tim Burton that still continues to bring laughs even in its cast is absolutely perfect especially Michael Keaton who is hilarious as beetle juice, the sets and visuals in beetle juice are also a treat to look at"
    },
    {
      "rating": "7",
      "text": "I have to admit, the '7' rating is mainly because of the spectacular performance from Michael Keaton. For me, he made the movie worthwhile during otherwise slightly boring or uninteresting scenes. It's a pity he's only in it for like, thirty minutes!"
    },
    {
      "rating": "1",
      "text": "Beetlejuice is quite possibly the worst if not one of the worsest movies Tim Burton has ever made. None of the characters are likeable except for Winona Ryder and Michael Keaton as Beetlejuice was just ugly and pathetic, non funny, annoying and boring. Terrible acting by most of the cast or the biggest percentage and a terrible film!"
    },
    {
      "rating": "8",
      "text": "Beetlejuice is a funny twist on classic horror film tropes that manages to not just make you laugh, but also really make you feel for the ghosts trapped in haunted houses around the world. It is certainly not easy being dead and this feel exemplifies that. The world created here by Tim Burton is wacky as expected and has so many layers to explore that shows just how expansive and creative this film is. Michael Keaton is over-the-top, yet hysterical and Alec Baldwin and Geena Davis do a great job as the bumbling idiots who recently died. Winona Ryder is also great here. The writing here is also very strong as it manages to wring every possible joke out of the pretty dark premise. Overall, Beetlejuice shows very little signs of aging and remains a funny, enjoyable ride."
    },
    {
      "rating": "7",
      "text": "It's no doubt a cliché Tim Burton film. It's one of his more campy films and it fits well within the 1980s in that aspect. Michael Keaton's performance as the titular character is absolutely ridiculous and I couldn't ask for more. While its cheesy at times, the film is perfect for something to watch when you just want to sit back and laugh. Nothing to think about, but nothing to miss out on either."
    },
    {
      "rating": "9",
      "text": "In this film, we will visit the afterlife through the experience of a newly deceased couple who, to their own despair, sees the home of their dreams invaded by a new family. Thus, to evict them and regain possession of their home, they decide to scare and haunt the newcomers, which can be challenging for a rookie ghost. To do this, they have the help of experienced ghosts and two unusual allies: the daughter of the new house owners and another ghost, deeply unorthodox and expert in the art of scaring the living.The film is a classic comedy of black humor, which plays with death and life in the beyond, just as it makes a great mockery to the pseudo-intellectuals of American society. The movie is very funny. I confess I had never seen or heard of him until I found him, by chance. Directed by Tim Burton, there are a lot of elements that we associate, almost instinctively, with this director: an unusual plot with offbeat themes, a comedy difficult to please everyone, out of the box sets and costumes and a refined, fun and contagious soundtrack.The cast did a great job. Geena Davis and Alec Baldwin have done well in the role of the ghost couple. They interact very well with each other and have created a positive and credible romantic chemistry. Besides, they're funny. Michael Keaton has the most difficult and original character here: the spiritual de-worzler Betelgeuse (Beetle Juice), an irreverent, talkative and daring ghost who loves to scare humans and promises to be truly difficult to control when he's released. Winona Ryder, once a regular in Burton's films (remember \"Scissorhands\"), is quite good at playing the rebellious daughter of the new owners of the house, which, for a reason the film never explains, has the ability to see and speak with them, as if she were a medium.Overall, this movie was a pleasant surprise. Very funny, contagious and cheerful, it will surely drive anyone to laughing laughter."
    },
    {
      "rating": "10",
      "text": "Beetlejuice has got to be one of the most enjoyable movies I have ever seen. Tim Burton does a most excellent job both editing and playing the role of Mr. Geuse. The characters are mostly stereotypical, yet somehow human and warm."
    },
    {
      "rating": "10",
      "text": "I loved this movie. Is a not stereotipically black comedy, and I liked it."
    },
    {
      "rating": "5",
      "text": "Good production values, but no story/characters of interest."
    },
    {
      "rating": "8",
      "text": "Hilarious. Dark. Scary. Did I mention Hilarious? Tim Burton never fails...except with \"Planet of the Apes\", maybe."
    },
    {
      "rating": "10",
      "text": "Tthe first time I watched this film I was a kid, I laughed so hard at it that my lungs almost burst, I watched it yesterday, I still laugh so hard that it feels my lungs are going to burst 10 out of 10 one of those classic films that never get old."
    },
    {
      "rating": "6",
      "text": "Beetlejuice has some cool visuals and an entertaining character but that’s about it. The film is slow paced, has some bland characters, and some cheesy and stupid moments. The stuff involving life after death is cool providing both an interesting concept along with some great visuals and I wish the film had spent more time there. Instead we spend most of the movie in the human world focusing on the boring humans. Beetlejuice is cool when he is on screen but its barely little. More afterlife and Beetlejuice could’ve gone a long way in helping this movie. Instead we have pretty stupid with movie with some dumb characters. When its cool its cool and I guess I’m glad I saw it but I feel like ti could’ve been more than just some cool spectacle here and there."
    },
    {
      "rating": "7",
      "text": "Beetlejuice is a really fantastic supernatural comedy. Tim Burton's style is stamped all over the film and Michael Keaton is truly hilarious as the titular Beetlejuice. I find that the movie makes for a perfect Halloween treat for kids, too."
    },
    {
      "rating": "10",
      "text": "Alec Baldwin, Geena Davis, Michael Keaton are all great and Winona Ryder and more are all very, very good.  So original and Tim Burton was fantastic with direction."
    },
    {
      "rating": "9",
      "text": "With a great cast of actors and a great production value, Beetle Juice will give you laughs and even a bit of scares (especially for the little ones) in this enjoyable film. In my opinion, this is definitely one of Tim Burton's strongest films he's ever directed and I just love the odd humour and strangely dark concepts in the movie. Baldwin, Davis, Ryder and Keaton took the stage in playing such strong and memorable roles and the art direction in special effects looked unique at its time. This is a pretty entertaining flick and I recommend a audience who enjoys dark comedies and odd original storytelling should give this a go."
    },
    {
      "rating": "7",
      "text": "Seems like vaudeville plot and comedy across the board. Many talented actors. Light hearted slapstick."
    },
    {
      "rating": "5",
      "text": "Ironically, It's called Beetlejuice despite the title character only being in it for less than 20 minutes and, to be honest, it's better off without him. I felt more attached to the characters before he was even introduced or mentioned. The premise was interesting enough, it was a pretty decent looking film (some of the effects are a bit dated IMO) but Beetlejuice just felt like he was tacked on and never really fit well with the rest of the movie."
    },
    {
      "rating": "6",
      "text": "Memorable not necessarily for quality, but rather a certain quirkiness amongst the cast and characters. Beetle Juice is early, first-rate Tim Burton filmmaking."
    },
    {
      "rating": "9",
      "text": "Beetlejuice, Beetlejuice, BEETLEJUICE!! 'The Ghost with the Most' is brought back from the afterlife thanks to Tim Burton's twisted imagination and the wacky writings of Michael McDowell and Warren Skaaren. In order to rid themselves of a pesky new family, a recently deceased couple hires the obnoxious ghoul Beetlejuice to perform a \"bio-exorcism\" and earn back their house! BEETLEJUICE is filled with oddball characters and eccentric performances from the entire cast. HOME ALONE's Catherine O'Hara is wickedly funny as the family's New Age hipster wife, who is married to Jeffrey Jones in another of his quirky character roles. A young Winona Ryder plays their morbid daughter Lydia, the one person who is able to communicate with the dead. And then, of course, there is Michael Keaton in the most unusual and unexpected performances of his career. Beetlejuice is crass, vulgar, and disgusting... And we love him! He is the undead equivalent to the classic Acme characters pushed to their fiendish extremes. The make-up and special effects are superb and highly original, combining traditional stop-motion animation with modern prosthetics to bring each of the otherworldly creatures back to life. Like GREMLINS and GHOSTBUSTERS before it, BEETLEJUICE is another classic comedy that 80's horror fans are sure to love!\r -Carl Manes\rI Like Horror Movies"
    },
    {
      "rating": "7",
      "text": "Beetle Juice isn't Burton's best but it's certainly worth a watch. It's original and entertaining and if you like Burton's creepy style of directing you'll be sure to enjoy this film."
    },
    {
      "rating": "8",
      "text": "Great cast, very good performances, the characters are amazing, Keaton does a pretty good job giving life to the ghost exorcist Beetle Juice, some times the movie gets a little slow and the special effects are not the best of its time, but it has nice make up and hilarious script."
    },
    {
      "rating": "7",
      "text": "Though a good part of me wishes we could've gotten more of an understanding of (and just more of) the film's unforgettably funny titular character, there's still no denying the talented filmmaking going on here. From the impeccable world-building, to the eye-gasmic production design, to the nostalgic special effects, and the legendary score, \"Beetlejuice\" is - without question - proof of Tim Burton at his very best."
    },
    {
      "rating": "8",
      "text": "This has to be my favorite Michael Keaton movie, and my favorite from Tim Burton.It is both dark and funny. Silly & serious. The effects at the time were phenomenal but are a bit dated by today's standards, but even so, hold a little. Still great to see Winona Ryder so young. Story gets a bit to goofy at points and they play the \"afterlife\" novelty to death (sorry, for the bad pun.)\r Overall:\rBeetlejuice is a ton of fun and enjoyable fore most. I would say keep really little kids away, because I remember it freaked me out when I was little."
    },
    {
      "rating": "9",
      "text": "I love this movie. It holds a special place in my heart. Maybe that's because it's truly original, maybe it's because it's really fun or maybe because it's so well done as a whole. More than likely, it's because of all of these things."
    },
    {
      "rating": "10",
      "text": "Heres the word that describes Tim Burton FREAKY !.  Tim Burton's movie are odd ( and could give kids nightmares like Corpes Bride , The Nightmare Before Christmas ). But i have to say the way he presents his movies in a whole new World ( Charlie &  Chocolate Factory , Alice In Wonderland ) But there realistic and wonderful and Beetle Juice is the example of a real horrific world with  Batman's Micheal Keaton , Alec Baldwin , Geena Davis. Grade A+"
    },
    {
      "rating": "8",
      "text": "Beetlejuice is one of the first Tim Burton classics. Its very well written and imaginative, its got just the right amount of Burton craziness and its got some timeless jokes in it that are still funny after over 25. There are several strong characters in this film Alec Baldwin, Geena Davis and a young Winona Ryder are all great, but Michael Keaton is the real star of the show. Keaton's portrayal of the titular character is one of the most memorable of his character, but the real tragedy is how underused he is. Beetlejuice is the perfect example of a live-action cartoon character and the last 30 minutes of the movie when he has the most involvement are certainly the best. The lack of Keaton though keeps this movie at a good level, not a great level."
    },
    {
      "rating": "10",
      "text": "My favorite Tim Burton movie and a true classic I rewatch from time to time. It is a fantasy comedy with horror elements and a truly great cast. The abstruse situation, humor and characters create a unique movie experience. Be warned Tim Burton the director is famous for his unique style but not everyone likes it. For me this is not a problem as I am a fan of most of his movies. The story follows Barbara and Adam Maitland on their way to their country home near the town Winter River in Connecticut. They have a car accident and when they return home they recognize a “Handbook for recently deceased” atop on other things. Obviously they died at the accident and have to deal with deceased bureaucracy so bad even German authorities cant compete with (I am German so I know about this). Things get serious when the house is sold to the Deetz family which consist of Charles his wife Delia and goth daughter Lydia. I stop here to avoid spoilers. Like I already said it is a fun, enjoyable and unique story. It works from start to finish and I cant remember a week moment. The great actors and humor make this an incredible experience. Lets continue with the actors aka characters. Michael Keaton as Beetlejuice (actually written as Betelgeuse) is absolutely awesome. One of his best performances and truly remarkable. Then we have the Maitlands with Geena Davis as Barbara and Alec Baldwin as Adam. Both are great and fully deliver their roles. They work so well together. The Deetz are also great as Jeffrey Jones as Charles and Catherine O’Hara as Delia are totally selling the love to hate characters. Wiona Ryder as Lydia is another favorite and rivals Beeteljuice for best character of the movie. We have an awesome cast of actors that deliverer a truly good performance. Of cause I have to praise director Tim Burton too and extend this to the whole team behind the screen. The practical effects were amazing for its time and aged well. The special effects while being good did age a bit but still work for me. I think the art style and effects in general improve the movie. Overall I consider it as a must see movie. The style, story, humor and actors are too good to be missed. A sequel was announced for 2022 but I fear they cant recreate this success."
    },
    {
      "rating": "8",
      "text": "Original and great fun. Despite some flaws. Like why can the dead couple not be heard in some scenes yet are heard while under sheets ? When in a previous scene the Guide Book of The Recently deceased said “the living can’t hear the dead ?”Why disfigure themselves to make scary faces when they can’t be seen ? Which they already tried to scare the guests in a similar way earlier. How can they suddenly control everyone to dance when they didn’t have powers like that in previous scenes ?Also Adam (Alec Baldwin) seems to have reading problems. I think he read Beetlejuice as being Beetleguise and Beetlejuice went by that name in some scenes to mess with Adam ?"
    },
    {
      "rating": "9",
      "text": "Michael Keaton is the name in laughter from the hereafter as an obnoxious poltergeist conjured up to bedevil an unwanted family of oddballs in this hilarious film."
    },
    {
      "rating": "8",
      "text": "Yet another masterpeice from visionary director Tim Burton once again showing a dark side and a light side with a brilliant script and although the acting is not superb from all cast members it still puts on a talented show, especially for Micheal keaton and Winona Ryder who deliver exciting and talented portrayals of their characters. The movie is perfectly supported with the short list of Harry Belfonte tracks to add more of a quirky light side. Overall beetlejuice may not be perfection but it certainly is a good movie and unique movie and has earned its reputation becoming a classic."
    },
    {
      "rating": "10",
      "text": "Beetle Juice may be strange and oddball at first, but like several films I have seen over the years, it could well grow on you. Essentially it is a landmark supernatural comedy as well as being a refreshingly flaky fantasy crammed with wit and invention, that I think is one of Tim Burton's better films along with Batman, Ed Wood and Edward Scissorhands. It is also a marvellously imaginative view of the afterlife as a ghoulish extension of mundane earthbound problems. The visuals once again are absolutely wonderful, with dark cinematography, imaginative sets and zany special effects. The script are filled to the brim with one-liners that are funny and somewhat demonic, the score from Danny Elfman is fun and the direction is pretty much superb. And I loved how offbeat the performances were, with Alec Baldwin and Geena Davis suitably low key as the recently deceased couple who want to rid their new home of human pests. Speaking of those human pests, Catherine O' Hara proves herself fantastically pretentious as the artist whose creations come to life in one of the film's most memorable scenes, and Jeffrey Jones and Winona Ryder are also memorable but it is Michael Keaten as Bettelgeuse, the unstable freelance exorcist who steals the show who portrays the character as unique and completely and utterly insane. Overall, unique, imaginative and lots of fun. 10/10 Bethany Cox"
    },
    {
      "rating": "6",
      "text": "Bottom line: Classic Tim Burton film that makes for a solid evening around Halloween.\r Adam (Baldwin) and Barbara (Davis) Maitland are a young, recently married couple. They are vacationing at home and make the quick trip to the local hardware store. On their way back they crash off a bridge into a river. Somehow, they walk back to their house (though they don’t exactly remember how) and, drenched, they try to dry off and warm next to the fire they don’t remember starting. They soon realize they drowned in the river and are now ghosts. They still want to try and live, or exist, happily in their home. Unfortunately, a new family (the Deetz’s) from New York buys the house and starts to move in. The Maitland’s decide to haunt the house to scare away the unwelcome residents. After repeated failures, they resort to calling Betelgeuse (Keaton), a freelancer who turns out to be far more trouble than he’s worth.\r Beetle Juice is, for me, one of those movies that you actually sit down and watch once but you see it in parts here and there. I first saw Beetle Juice when I was little and I thought it was creepy and somehow depressing. After re-watching it just the other day, I still think it is creepy and depressing but I will say that it is good.\r The acting is really rather good. I had forgotten that it was starring a very young Alec Baldwin. As soon as he spoke, I did a double take and thought, “I think I recognize that amazing voice.” Michael Keaton does a really good job at creating Betelgeuse a unique character. I didn’t realize it was him until I looked at the credits. It was like learning that Tim Curry played Pennywise the Clown in Stephen King’s It. It is a combination of makeup and acting to create something new. Winona Ryder fits perfectly into the aesthetic of the film. It made me wonder why she didn’t do more stuff with Tim Burton.\r Beetle Juice is one of the few movies that ends with a dancing sequence that I don’t particularly find offensive. Lydia received an “A” on her Chemistry paper so the Maitland’s possess the house so it plays Harry Belafonte’s “Jump In The Line” and possess Lydia to make her float in the air and dance. Many of the dancing sequences I’ve seen use the opportunity to cycle through the characters as they dance to show their status. In Beetle Juice, we cycle through the characters but they aren’t dancing. They are just doing what they would normally be doing: Lydia’s mom is sculpting some modern art and Lydia’s father is reading. It is mildly silly but it isn’t going for a zany ending.\r Overall, I’d recommend Beetle Juice if you haven’t seen it before but, considering it has been on TV about a million times, you probably have. Would I recommend you see it again? If it is Halloween time, sure, why not? It isn’t a scary movie and in terms of humor, it’s alright. I didn’t laugh out loud but chuckled here and there."
    },
    {
      "rating": "8",
      "text": "This is the best movie Tim Burton directed and it's on par with \"The Nightmare Before Christmas\" as the best movie he was involved in. My only complaint is that for a movie called \"Beetlejuice\" the title character doesn't appear until a while into the movie-but he completely makes up for it by delivering some of Keaton's funniest jokes. In the words of the title character himself, \"It keeps gettin' funnier every time I see it!\". Glad to hear Beetlejuice 2 is in development, that'll be on my \"movies to watch\" list!"
    },
    {
      "rating": "9",
      "text": "Beetle Juice will always remain a classical family hit and one of the best movies to spend your Halloween on. Don't miss your shot to see this again next Halloween."
    },
    {
      "rating": "7",
      "text": "Beetlejuice is a really entertaining movie with an interesting concept and lots of funny moments. Michael Keaton gives a great performance. It is a little too silly for my taste but overall is still an enjoyable movie."
    },
    {
      "rating": "10",
      "text": "An awesome comedy film. Tim Burton movies are the best. Michael Keaton's acting was easily superior to any other actors in this movie although they all did a pretty good job. I would rate this movie 100 if I could but sadly it only goes up to 10."
    },
    {
      "rating": "8",
      "text": "The eighties movie that put Tim Burton and Winona Ryder under the spotlight. It's a combination of horror and cartoon comedy that would be both cult and envy hard to repeat."
    },
    {
      "rating": "9",
      "text": "Beetlejuice. Terribly funny. An excellent comedy from the genius Tim Burton. The costumes and decorations also deserve special praise. Also, a rather interesting and strange plot of the whole film. The title of the movie is Beetlejuice, but Juice itself is very small, and it practically does not affect the plot in any way, and this all makes the film even more interesting."
    },
    {
      "rating": "5",
      "text": "look at this and this..BeetlejuiceThe effort that went behind the production design, costume design and the creativity on details is definitely plausible but it also makes it more painful for the viewers as it fails to seek attention on any page of the script and that's what holds this feature from joining the bigger league. Tim Burton; being infamous for its explicit vision on creating eerie world fails to execute it on screen as anticipated. On performance level, Alec Baldwin and Geena Davis holds on to their parts but the real game changers are Winona Ryder and Michael Keaton. Having said that, Beetlejuice has a crystal clear reasoning and a genuine upbeating soul in the characters that helps audience surviving the feature along with some humor sprinkled around here and there."
    },
    {
      "rating": "7",
      "text": "This is one of Tim Burtons relatively early movies, I believe, dating from the mid-late 80s. The movie definitely has quite a dated feel to it although I did think that this added to its appeal somehow. There's no CGI here, instead its mainly puppets (animatronics?) used I think. There isn't much in the way of strong language or violence, its mainly got the 15 rating due to the 'gross out factor' I suppose, with the scenes where Adam and Barbara join other dead people and try to seek help and when they try their hand at haunting their houses new inhabitants, smulating hanging themselves etc., though it has limited success. This is where some of the humour comes from in a way, so you can already tell that this isn't a movie for everyone, however I quite like that it is a movie that isn't by any means trying to take itself seriously and I did quite enjoy the crudeness of it, I suppose you could say. I also found it amusing the use of quite lively music, the main track being 'Jump in the Line (Shake Señora)' by Harry Belafonte. The scenes featuring this track are likely to make fans of Burtons movies laugh, watching what happens at the dinner table to the family when Beetlejuice decides to have a bit of fun. So yes there is humour and there is a creepy element to it too, of course and I thought that overall it had quite a clear comic book feel to it, its not really an overly scary or threatening type movie, as long as your not a young child anyway, I think its clearly not for young children who would be scared by a few scenes, particularly when Adam and Barbaras faces are changed quite dramatically towards the end. It is quite an 'enthusiastic' movie I suppose you could say, one that shows that Tim Burton clearly has or had a vivid imagination and I liked the tone of the movie, it seemed at least fairly original and I thought it was an interesting concept. Going by memory I think there may have been a spin-off cartoon series for kids made based on the movie featuring the characters from it, which makes sense, I can see how that could work, though presumably Beetlejuice isn't quite as randy in the cartoon as he is in the movie! (whether or not ghosts can fancy ghosts of the other gender, I have no clue lol).The character of Beetlejuice isn't featured as heavily as I presumed he would be in the movie but it still worked quite well, I feel. The title of the movie may be a little misleading for some I suppose though, since the main character isn't really Beetlejuice himself, although he provides the main entertainment and the quirkiness I suppose, the main characters are of course Adam and Barbara and then Lydia. However, the scenes with Beetlejuice are pretty hyperactive and engrossing, so its worth sticking with the movie for that.The character of Lydia reminded me of the Adams' Family character of Wednesday, infact I suppose you could compare the movie to one of the Adams' Family movies in a sense, with the rather quirky house and the disfunctional family, Beetlejuice could be seen as a kind of an amalgm or combination of Gomez (in terms of a certain kind of sexual charm or so he'd think he has) and Uncle Fester (in terms of creepiness, really!).Overall, quirky and darkly amusing are the words I think that best describe this movie. It is quite an interesting movie and I found it pretty entertaining, its not a particularly scary movie as such but I wouldn't recommend letting any children watch it all the same, still if this is your sort of thing then you should definitely check it out.Yes I would, as I say above. It felt fairly original and was entertaining and kind of amusing in parts. The plot concept was interesting and it is quite lively in parts too, though if im to be picky then I could criticise it for being a little bland mid way through the movie, before they went to seek help and discover their 'case worker' and before the title character appeared. It does have a somewhat dated feel to it but it doesn't take away from its appeal and I still found it quite entertaining overall, hence why I'd recommend it. Of course, not everyone likes Tim Burton movies and if your not one for this sort of thing then obviously, give this a miss but otherwise its worth a watch."
    },
    {
      "rating": "7",
      "text": "The story is certainly entertaining, it has become a cult movie.  Although, obviously, he has not aged well, they make jokes or apologies that today it would be impossible to capture in a film."
    },
    {
      "rating": "8",
      "text": "Very Tim Burton film, Michael Keaton is hilarious as Beetlejuice. Some of the effects are a bit dated now but that is to be expected. A recently deceased couple need help removing some people from there old house so they call Beetlejuice to help them scare the family off."
    },
    {
      "rating": "10",
      "text": "This is Burton at his most Burton. The effects are great, the performances are really funny, and the story is morbidly fantastical. It's honestly weird I haven't seen it until now, definitely one of Burton's best."
    },
    {
      "rating": "8",
      "text": "Rewelacyjny Michael Keaton.. Tim Burton nie zawiódł.. ponoć są słuchy o kolejnej części tego arcydzieła."
    },
    {
      "rating": "7",
      "text": "Barbara, you don't know what's out there! We did find out though in this fantastic comedy. There is a great story, lots of effects but these effects are really dated now. I don't watch it for the effects, I love the character of Betelgeuse and the other characters are so well defined that you either love or hate them just the way you should in a film. It is dark and funny. It is not normal and that is why it is so good."
    }
  ]
}