{
  "id": 3039,
  "title": "Before the Flood",
  "starring": [
    "Leonardo DiCaprio",
    "Bill Clinton"
  ],
  "runtime": 93,
  "genre": [
    "Documentary"
  ],
  "description": "A look at how climate change affects our environment and what society can do to prevent the demise of endangered species, ecosystems, and native communities across the planet.",
  "releaseYear": "2016",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/2fFTLaLbm8Ak7JBSYQ8Mb3jcFx9.jpg",
  "categories": {
    "plot": 9.5,
    "acting": 9.0,
    "ending": 10.0,
    "soundtrack": 9.0,
    "cinematography": 9.0,
    "familyFriendly": 8.0,
    "funny": 5.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "9",
      "text": "Of course, it's easy for some to discredit a movie like Before the Flood by focusing on the messenger's lavish lifestyle (although if a movie is filmed all over the globe, one is going to log some significant air miles in the process) and hoping that the spotlight stays on Leo and not the settled science of the subject. Fortunately, DiCaprio addresses this concern early in the film and then is able to spend time on interviews with global leaders and influencers from Elon Musk to the Pope.  It's a lot to take in, but there's enough of a focus on the science and some potential solutions that make this documentary worth your time."
    },
    {
      "rating": "10",
      "text": "Look here, despite whatever your opinions on global warming are; it would be irresponsible to dismiss this film as a superstitious hoax. You can't even really score this film; it is a well researched view of our current environmental situation clear, plain, and simple. It doesn't particularly care what you want to hear, it tells you as it is. Before the Flood is an important documentary and needs to serve as an educational tool for the sake of our fragile worlds future."
    },
    {
      "rating": "9",
      "text": "The world tour, observation and the report card.When I first heard about this, I thought what is this overrated actor doing here when the National Geographic decided to deliver an important message. The world would listen to the stars like Brad Pitt, Spielberg or the James Cameroon. Then I thought if he has the loudest voice in the American, then he's the right person to do the job for his nation. Because literally UN is the US.It all began with his little speech at the 2016 Oscars. Then I did not realise, but after watching this, everything makes sense. Anyway, he was average, he just toured the world and did what asked for, the rest of the job done by the film crew, but the film and its message certainly not neglactable. So my appreciation goes to the writer, director and the production house.Okay, let's talk about the film. It is not just an important film, but a very, very important film. So they made sure it to easily accessible by everyone around the world in different platform. Some people are encouraged when they watch films like this, but soon after they go to their regular thing. We do not need that kind of attitude here, because it is already late and we can't reverse the damages that's already been done, though it can be prevented from happening further. Like I said in my 'Racing Extiction' review, a small contribution by everyone matters a lot.The actor who is appointed as the United Nations 'Messenger of Peace' is set to travel the world for three years to observe and collect the information about the impact of man made global warming. Actually, he never asked any genuine question to whom he's interviewing for this documentary, like they are maybe the experts, scientists or the leaders around the world. But the goal was covered, even if it was a small amount. Because the first thing you have to understand about this film is, unlike any similar climate change documentaries, this did not try hard to give a complete picture on its topic. It was just an observation and its report kind of film by an actor who was chosen by the UN.\"If you consider this vastness of this universe, this planet earth is just a small boat. If this boat is sinking, then I think we will have to all sink together.\"At some point, this film was beyond that. We had seen all the debates in the previous documentaries, but the perspectives were different with the same message, I mean the warning. Because it does not stop here, if we does not change and the message is going to be very louder and louder every time. What the actor saw through his own eyes on his journey were the separate incidents/disasters from different parts of the world what we had seen in a single film like '2012'. And who knows, that kind of collapse might go to happen as well in a near future if we don't act today.The common line from all these documentaries are 'the global warming is real and it's happening right now'. But to whom it is said? For every person, the citizens of the earth, including you and me. I liked what in this film they pointed out, that the leaders listens people who voted them. Because they say only what we wanted to listen. So if we pressure them, they will fall in line. And this thing is badly needed to come to effect in the United States. If the America change their attitude, so the world would, because that's what had followed in the 21st century. But it seems they are lagging behind compared to the Baltic countries who are going fossil fuel- free nations.This film's title referred as from the bible, like Noah's ark story. So do we need one if the polar ices completely meltdown? The answers is a big YES. Like the one that we saw in the film '2012'. Not for the whole world, but for those poor little island inhabitants. The continent's coast locals will relocate to inland. The fun part is the islanders did nothing big to suffer this, but those who did are going to be kind of safe in the mainland.Every living organism, either in the land or in the ocean has the right to live just like us. So we must look from their perspective as well, because we're controlling the earth, not they are. We decide the earth's fate and it should be a good one, keeping in mind humanity's future as well.This film has done its job, it's now on us to act. Don't think it is the government or the corporate's job, we all have our part to contribute and yes, it is so tiny, but the result will be enormous when we saw it together with everyone's contribution. Just watching a film like this is no use, we need to educate around us, especially for those has no opportunity to watch them or unable to understand them. This is a must see film and try to share the disc with your friends and colleagues. Because keeping it in your blu-ray/DVD case safe forever is no use. 'Before the Flood' is present, there won't be a sequel called 'After the Flood', because we might not here to make one.9/10"
    },
    {
      "rating": "7",
      "text": "\"Before the Flood\" was a very good documentary that teaches you all the effects of global warming and how to prevent it, or better reverse, all trips and powerful messages that came from the mouth of Leonardo DiCaprio, makes you reflect on care of the planet."
    },
    {
      "rating": "8",
      "text": "it just really makes you think and be sad, but makes you wanna do something to help. i'd say everyone should see this movie, open their eyes and mind's"
    },
    {
      "rating": "10",
      "text": "Before the Flood is a work of art amongst documentaries. A documentary in it's most basic essence is just a movie/program that gives a factual record or report. It covers that definition for sure, but for it to be so aesthetic in it's delivery and dialogue propels this documentary into an immortalized pedestal for our society to view today.\r Before the Flood covers an amazingly relevant topic not only to people of today's day and age, but to anyone living in the world present and future. The best part of this documentary in my opinion was how easy the science and information was to process and make sense of. There can be much complexity when it comes to the topic of climate change but the science and information was quite easy to follow which adds an extra layer of viewing power to this documentary. Families, children, classrooms, and even the elderly can watch this and understand it fully. This must not be a coincidence, the team behind this documentary took this into account and made the potential reach as far as possible.\r As you watch this film, you will be able to clearly see the passion that oozes out of Leonardo DiCaprio throughout his journey to bring this important issue out of the shadows and into the light.\r Finally, I believe this movie appeals to the audience in many ways a documentary usually doesn't. The soundtrack was literally made for this documentary and works harmoniously together. The visuals were actually very stunning, which is unique for a documentary. A lot of time, effort, and precision went into creating this film for sure and it's definitely worth a watch."
    },
    {
      "rating": "9",
      "text": "Two things I want to put first right here. For one, this is an exceptional documentary and works wonderfully as a piece of enlightenment. Secondly, I have to say that Leonardo DiCaprio is a really bad actor in it. I also think, however, that you should -and easily can- look past that fact.\r Now, I think it is a great thing that one of the most famous people in the world gives his face to draw attention to the most urgent issue of our time, the devastation of our planet through our own hands, or how most people call it, \"climate change\". DiCaprio's presence throughout the film also helps you to identify with the situation, you look through his eyes much the same way you see the madness of war through Martin Sheen's eyes in Apocalypse Now. So overall, he benefits this movie in all the right ways... Well, all the right ways except for authenticity. The problem I have is that when I look at his face during these interviews, I don't see genuine interest. I see disinterest. All his \"oh my god\"s come across as uninspired and fake to me. I see a person trying to level up his PR. He comes across as hypocritical. And I mean he's a great actor, why couldn't he at least pretend interest? It's just baffling to me. He seems to care, but he also looks bored. Maybe he plays with brilliance a character meant to reflect our own ignorance and hypocrisy. I kinda doubt that though.\r But the documentary itself is easily good enough to condone DiCaprio's ambiguous appearance. I think it takes a look at all the right things and delivered all the right messages. Technically, the editing of Before The Flood, it's structure, especially how it uses Bosch's painting The Garden of Earthly Delights as a frame for it's story, is impeccable. I also really liked how they used behind the scenes footage of The Revenant (another film I really like). The cinematography is very impressive, delivering many memorable pictures. And the score by heavy-weights Trent Reznor and Atticus Ross (highly acclaimed for their work on recent David Fincher films) in collaboration with Mogwai (!!) and Gustavo Santaolalla is marvelous. The interviews are all very interesting and informative, illuminating not only the facts we have to face in a very objective and vivid manner, but also showing the different perspectives on the topic from all around the world, giving you a very complete picture. And interestingly enough I didn't find the film to be preachy at all (I definitely expected it to be exactly that), it is much rather informative and insightful. After all, the content of a documentary, and even moreso the way it is delivered, is all that counts. And this makes it, by all accounts, a great film. It helps to gain deeper understanding of one of the most important topics in the world. And it will convince people not aware of it's importance.\r You can stream Before The Flood for free on youtube. A great decision on side of the filmmakers. It is the absolute right thing to do in 2016, just putting it online where everybody can see it. And not to charge money for such a clearly high-budget project definitely shows the good intention behind it\r You can follow me on https://letterboxd.com/beflygelt/"
    },
    {
      "rating": "9",
      "text": "This is one of those do good documentaries from a \"big name\" in Hollywood that makes sense all the way around. Even if you don't agree with the subject the facts are there and you can't help but think twice after watching this film. I think it sheds light from a team of people with enough voice to actually make someone listen."
    },
    {
      "rating": "10",
      "text": "This message has been here for over 50 years. DiCaprio synthesized what is coming. There is no stopping it UNLESS we act. Tell EVERYONE you know to see this."
    },
    {
      "rating": "10",
      "text": "Great film about the biggest problem facing our existence today.... please watch to the end and take action. The future of this planet depends on all of us."
    },
    {
      "rating": "8",
      "text": "Before the Flood is a beautiful documentary. Leonardo DiCaprio successfully raises awareness of how climate change is a serious issue right now, and that's the idea. Solutions are few, but it does make a point: We have to change, for good. Another thing: the soundtrack might be better than the documentary. Trent Reznor, Atticus Ross, Mogwai and Gustavo Santaolalla have created what is probably my favorite soundtrack."
    },
    {
      "rating": "9",
      "text": "The movie gave a descriptive broad overview of the environmental status of the world and how climate change has affected many biomes, as well as humans’ current attempt to create significant impacts in sustaining current ecosystems and repair lament deteriorating ecosystems. Leonardo DiCaprio, the director and investigator of the documentary, documented his experiences of traveling around the world and found how several environments are negatively affected in biodiversity and climate conditions. Leo also spoke to experts who hope to improve the climate issues such as the GigaFactory CEO, professors with socio-economic and political insight, and President Obama himself on the matter. After DiCaprio’s research and travels, he attends an international meeting as a spokesperson to advocate environmental awareness and encourage change to every attending nation. The documentary is a good introduction to the complexity and issue of climate change, and I highly recommend checking it out."
    },
    {
      "rating": "10",
      "text": "Incredible! He makes a valid point that in order for things to change, the people have to change - not the government! He is a modern day hero!\rPeople need to stop making excuses and start acting, even if its just a small change, if everyone does a small gesture to start, those will have huge impact. The film photography is incredible and the story within the journey is also gripping."
    },
    {
      "rating": "10",
      "text": "Masterful.Leonardo DiCaprio acts as a perfect mediator between the people watching and the experts who perfectly analyze the things out to the laymen who aren't knowledgeable in that field.Don't know if this will convert the climate change deniers but it certainly provides solutions and raises the right questions,especially the carbon tax bid"
    },
    {
      "rating": "0",
      "text": "This is a very good and informative film. It shows the harsh realities of global warming while at the same time offer hope, showing us that we can make a change and even stop and reverse the effects. Leonardo DiCaprio is great in the film and you can really tell that he believes what he is saying.  Overall if you want to see a great film about climate change, learn something or even just want to see Leonardo DiCaprio then I recommend you watch this film."
    }
  ],
  "recommendations": [
    "snowden",
    "in_the_shadow_of_the_moon",
    "united_93",
    "cartel_land",
    "nine_days",
    "the_tree_of_life",
    "the_show",
    "free_state_of_jones",
    "nomadland",
    "contact",
    "the_shack",
    "risen",
    "war_room",
    "dark_waters",
    "silence",
    "the_fountain",
    "mainstream",
    "spree",
    "the_social_dilemma",
    "avatar",
    "donnie_darko",
    "the_hate_u_give",
    "munich",
    "machine_gun_preacher",
    "zero_dark_thirty"
  ]
}