{
  "id": 2354,
  "title": "Before I Fall",
  "starring": [
    "Zoey Deutch",
    "Halston Sage"
  ],
  "runtime": 98,
  "genre": [
    "Drama",
    "Mystery",
    "Thriller",
    "Fantasy"
  ],
  "description": "Samantha Kingston has everything. Then, everything changes. After one fateful night, she wakes up with no future at all. Trapped into reliving the same day over and over, she begins to question just how perfect her life really was.",
  "releaseYear": "2017",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/eowzonDJMCuNXoJGVkP9Z7oCmiM.jpg",
  "categories": {
    "plot": 6.611111111111111,
    "acting": 7.285714285714286,
    "ending": 6.222222222222222,
    "soundtrack": 9.0,
    "cinematography": 8.0,
    "familyFriendly": 6.0,
    "funny": 5.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "6",
      "text": "This is variation on \"Groundhog Day\" crossed with any adolescent angst flick. Zoey Deutch plays a high schooler who keeps repeating the same day: She hangs with her equally cool, beautiful trio of girlfriends, interacts minimally with her family, goes to a party hosted by the sweet guy with a crush and watches as another girl is verbally bullied. Each day gives her an opportunity to make it right and the movie takes its message seriously. There's no sci-fi or mystery element here, just a new take on an old dramatic trope. The film is well-enough produced, but will mostly appeal to the female demographic featured in the film."
    },
    {
      "rating": "6",
      "text": "Before I Fall is just the same old stories you guys have previously seen or read. What I did not expect from this film is that they at least tried to make the old story feel like new, but even if its story is bland to the core, there's at least something else to enjoy about the film."
    },
    {
      "rating": "7",
      "text": "Overall: Mixed (Home Viewing)While Deutch shines and definitely shows she has something worth more movies, and maybe series, taking advantage of, arguably she is without worthy peers in this movie. Which, when combined with the overdone and familiar elements of this film, keep it from being something noteworthy. For the whole Mean Girls angle has been done to death and while the looping, Groundhog Day, narrative was put to good use, it isn’t enough to say you must see this. The film definitely has its moments, but unless you are willing to give Deutch time to build up her character and setup the touching moments, you will get bored quickly. To the point that you may see this as a future Netflix & Chill type of movie."
    },
    {
      "rating": "4",
      "text": "The ending showed a genuine side to a fake an ugly film.  The characters in this are all awful and some of the dialogue was cringe worthy.  I appreciated the ending for attempting to save a much worse film, but it had a big hole to dig out of.  C-"
    },
    {
      "rating": "4",
      "text": "It's basically your typical made-for-TV movie being sold on the big screen. 'Before I Fall' isn't a disaster or even a bad movie, it's just so bland that it's uninteresting and uninspiring for such a story. It's 'Groundhog Day' meets 'Mean Girls' without any of the charm of those movies."
    },
    {
      "rating": "8",
      "text": "Not very often that I get into these high school teen dramas but this is an exceptional film that is incredibly acted by the rather beautiful Zoey Deutch whose infectious smile lights up the screen despite some awkward dialogue and cliches. The rest of the film is well directed with smooth camera work and some great shots to go along with it. The plot, while done before (GroundHog Day, Edge of Tomorrow, Butterfly Effect) and very slowly paced attempts to go its own way by films end and for the most part works for what its going for. The only issue I had with the film is it descends into cliche's that it can't separate itself from by films end. Overall score: B"
    },
    {
      "rating": "0",
      "text": "To me it's a chick flick with typical teens who gossip & go to parties. She fixes her mistakes by apologizing to her parents for being rude & other stuff. I read the book but didn't finish it. It's more for teens who like films such as Mean Girls."
    },
    {
      "rating": "10",
      "text": "Personally, I Read the Book and I think the book is amazing and I really loved the book, Before I fall will be my favorite book of all time and I'm dying to watch the movie, I giving 10 because seeing the reviews I think the movie will be epic and amazing like the book but It just annoyed me sometimes that the lines are completely changed from the book but overall everything is fresh for the audiences."
    },
    {
      "rating": "6",
      "text": "Not about a second chance, but infinite!Even if you are not that into the films, you probably have seen at least a couple film related to 'time loop'. For me, this is like hundredth. When I first saw the trailer, I said 'not again'. 'Time loop' is just a concept, but the storyline for it drawn differently. It tells the story of a high school girl on the Cupid's Day, a special day for her since she has a big plan for it to remember. Like usual her day goes on and at the end of the day something goes wrong and then she wakes again on the same day in the following day which keeps repeating. Now how she's going to find a solution or the reason for it is covered in the rest of the film.Familiar them, but well designed storyline around it. In some way, it is same as 'Groundhog Day', though it is about a teenager and more serious and tragic tale. We sometimes wish for a second chance, that's how this film was developed, but even bigger scale with a small message for teenagers.Awesome performances, particularly Zoey. Predictable scenes, so I had thought of couple of ending that did not happen. And I also disappointed how it concluded. Not the best solution, yet an unexpected twist. Originally the film was based on the book of the same name. This is a small budget and a quality film. The direction was good, very rich in presentation. Definitely not bad for once viewing.6/10"
    },
    {
      "rating": "7",
      "text": "Not as bad as I thought it was going to be. For a romantic tween flick I have to give this film its props for being well acted and (somewhat) original. I think if there had been less montages and no voiceover it would have been even stronger."
    },
    {
      "rating": "7",
      "text": "This \"time loop\" theme is familiar - I understand that it was done by the Twilight Zone, but was done to perfection by Groundhog Day.  This film seems to pay tribute to its predecessor, in that the shallow teenage heroine wakes up each (same)day at the same time, with the same song playing on her iPhone.  The introduction to the heroine and her group of friends in the first 25 minutes was tedious, and I had no interest in any of them - but the film became more interesting with each round.  We learn the back stories for the main characters, and the heroine's transformation is believable.  The end of the film genuinely surprised me, but it was foreshadowed by the narration.  Overall, it was better than I thought it would be, and I'm way older than the film's cast."
    },
    {
      "rating": "9",
      "text": "The superb cinematography, direction, casting, screenplay and soundtrack elevate the material above its budget weight class. This film is fantastic! While the premise isn't wholly original, the performances are memorable and the female perspective is intelligently conveyed avoiding obvious tropes and instead following logical character choices. It was clearly made with love and with a beating emotional love heart at its centre. The positive message to be kind to yourself and others was powerful. This movie kinda blew my socks off. As a side note watching some of the interviews with cast/director/writer this movie serves as a shining example of what a female led production and story can look like when it's not something forced by an agenda led studio push."
    },
    {
      "rating": "7",
      "text": "Despite it's unoriginal and overused story, clichés characters, predictable actions and the fact that it was obviously aimed for a young teenage girl audience, Before I Fall still managed to keep me entertained. Overall, it's exactly what you would expect from a movie like this."
    },
    {
      "rating": "7",
      "text": "I'm a male, age 50.  I liked it, I mean really liked it.  Good story, well acted, and will get to you in ways that really make you think.  A well done, \"live every day as if its your last\" movie where it draws you in and leaves you guessing about your own life."
    },
    {
      "rating": "5",
      "text": "A cliched plot, thus a predictable ending and a mound of fatally flawed characters that only remind the audience how sleek is the world nowadays. Anyway, the result is surprisingly satisfying and somehow a thoughtful message."
    },
    {
      "rating": "6",
      "text": "\"Mean Girls\" meets \"Groundhog Day\". An interesting concept with a teenage girl who seems to have the perfect life until she has to relive the day she dies in a car accident.Unfortunately, the movie doesn't explore this opportunity as much as it should, following too many stereotypes and standard plot devices. And the ending, though fitting with the original novel, comes out of nowhere and feels unnecessary."
    },
    {
      "rating": "8",
      "text": "No right choice can be made without a little sacrifice. This movie, although felt like a YA novel in the beginning, quickly grew into a series of lessons and perspectives. The ending was and wasn't a surprise to me because I felt it was absolutely felicitous. Everyone had a story made of choices in the past that affected and shaped their lives as well as the lives of others. But at the end of the day it isn't the choice you made yesterday that matters. It is what you do now and that point forward that counts the most. I think the main character substantiated that beautifully."
    }
  ],
  "recommendations": [
    "nerve",
    "paper_towns",
    "what_happened_to_monday",
    "fifty_shades_darker",
    "the_maze_runner",
    "gone_girl",
    "hugo",
    "tomorrowland",
    "the_butterfly_effect",
    "frozen_ii",
    "alice_through_the_looking_glass",
    "the_curious_case_of_benjamin_button",
    "the_craft_legacy",
    "summer_of_84",
    "super_8",
    "come_true",
    "the_darkest_minds",
    "brimstone",
    "colossal",
    "bad_times_at_the_el_royale",
    "the_good_liar",
    "old",
    "the_nutcracker_and_the_four_realms",
    "the_mountain_between_us",
    "happy_death_day_2u"
  ]
}