{
  "id": 4064,
  "title": "Before I Wake",
  "starring": [
    "Kate Bosworth",
    "Jacob Tremblay"
  ],
  "runtime": 97,
  "genre": [
    "Drama",
    "Fantasy",
    "Horror",
    "Thriller"
  ],
  "description": "An orphaned child's dreams—and nightmares—manifest physically as he sleeps.",
  "releaseYear": "2016",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/sI9neTbF3ECdpf2MpC88EMGJH13.jpg",
  "categories": {
    "plot": 7.909090909090909,
    "acting": 7.625,
    "ending": 9.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 6.0,
    "funny": 5.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "4",
      "text": "Sweet child - 3 points, cool butterflies - 1 point. Such fail, much disappointing. :D"
    },
    {
      "rating": "8",
      "text": "Really good mystery/suspense with some great performances especially by Kate Bosworth, the only issue I have is you are left kind of disappointed by all the unanswered questions."
    },
    {
      "rating": "9",
      "text": "The fate of Before I Wake has been up in the air for quite some time. It was unclear if the movie was ever going to be released despite being fully-finished and the few critical reviews that were out there said that it was far from the director's best. Thankfully, Netflix and Flanagan used their relationship to finally ensure the movie sees the light of day. Just like his other movies, Before I Wake shows once again how Flanagan is one of the few people left in modern horror cinema to create actual characters with legitimate stories.The plot is filled with a sort of eerie tension. There's a symbolic quality to horror scenes, particularly the final ones at the end of the movie, that add depth and allow the characters (all of whom are wonderfully acted) to grow from the events at hand. We watch a struggling couple deal with loss and moving on. The movie has a lot to say about trauma from the perspectives of adults and children. Both the moments of fantasy and horror tie into a specific characters life experiences. The mind of a child is beautifully used to create visions of magic and terror. The latter of which only falls a bit short by the overuse of the main monster. A necessary evil though because of significant that monster is to the story.If the film leaves you wanting anything, it's a better ending. Things conclude on a solid note, but do leave a few questions. I was able to find the answers to them upon some reflection, but that didn't rescue me from my feelings of minor disappointment in this department. However, the fact that Flanagan might not have found the best conclusion to his story only further cements him as the Stephen King of filmmaking in my mind. Before I Wake is more original horror with touches of fantasy and a real story from one of the best names in the genre. If you've liked his previous works, this is not to be missed and it's still a must for horror's most devoted followers."
    },
    {
      "rating": "5",
      "text": "Not a very good horror movie. The villain and backstory are poorly fleshed out, there's little dread or suspense, the performances are wooden, and the story was poorly resolved. It felt more like a drama about grief with a few jump scares thrown in, than anything resembling true horror"
    },
    {
      "rating": "7",
      "text": "It's honestly a tragedy that this movie's release was as hamstrung by Relativity Media's bankruptcy as it was, because if \"Before I Wake\" proves anything, it's that Mike Flanagan continues to be one of the horror genre's foremost in creative thinkers and directors. From the undeniably captivating premise, to the genuinely terrifying subject matter, or the film's immensely satisfying climax, there's a whole lot to enjoy. Definitely one for the \"underrated\" category, that's for sure."
    },
    {
      "rating": "8",
      "text": "While finally released on January 5th, 2017, Mike Flanagan's Before I Wake was completed and set for release in 2015, until Relatively Media went under, leaving Before I Wake to sleep on a shelf. Now that Netflix has grasped onto Flanagan, it's no surprise they picked up the rights to the film.  Through the company Flanagan presented two of the best films of 2016 and 2017: Hush  and Gerald's Game, respectfully. Next on the docket is a limited series version of Shirley Jackson's The Haunting.  I'm very excited for this prospect.  Before I Wake was made after the \"this-is-great-you-should-seek-it-out\" Absentia and the under-rated Oculus.  Like those two films, Before I Wake deals with family issues through a horror setting. This decade's best-child-actor Jacob Tremblay (Room, the Brie Larson one, not oh hai Mark!), is a troubled orphan who keeps moving from foster home to foster home. He's not a bad kid, he just has a bad gift. His dreams come to life. This can bring happiness - such as ethereal, brightly colored versions of his favorite animal the butterfly - but with a dark edge underneath. There is an element of the monkey's paw. His dreams allow his new family (Thomas Jane and Kate Bosworth) to see their deceased son (Thomas Jane, again, \"just wants his kids back\"), but only in the one repeated memory Tremblay can see. As to be expected, there is an evil below it all corrupting it all.  This being the thankfully-practical Canker Man. Usually, when a film is shelved for so long, it's a stinker. While Before I Wake isn't as strong as it's Flanagan brethren, it's a solid film.  Although many will approach as a horror film, the supernatural is to build the family drama at the core. That doesn't mean the scares aren't well done, there is a fantastic look to both the film on the whole and the horror sequences. The sense of unease pervades, even in the earlier, more  innocent dream visions. Most importantly, we feel for the adoptive parents and child.  The only real issue is the film is a little longer than the concept provides, there is a repetitiveness as those around Tremblay begin to figure what is happening; causing the film to have a lack of urgency. Like all of Mike Flanagan's work, there is a respect for the audence of the film, allowing the characters and sequences to stand on their own, without unnessessary jump scares and stupid decisiouns in order to get a scream. Although not as good as the other Flanagan canon, Before I Wake is a film to stay up for. B+"
    },
    {
      "rating": "7",
      "text": "Before I Wake felt like a adults dark childhood story with a psychological edge. Mike Flanagan's best."
    },
    {
      "rating": "10",
      "text": "Original, Beautiful Film- Not What You ExpectRarely does a film surprise me at all but this film certainly did. Mike Flannigan created an enigmatic speculative on childhood love, loss, fear and death that is both uniquely interpretive and otherworldly fantastical. For those who go into this film anticipating a run-of-the-mill horror film with gruesome effects and bloody deaths, you will be exceedingly disappointed. This film is provocative in that it makes you think and feel throughout. It is at times vastly uncomfortable, but magnificently redemptive. What it achieves is a rare feat- one I would classify more in the realm of Pan's Labyrinth than something like The Ring. What it suffers from is completely misdirected and misleading marketing which has done this gem a huge disservice.I'd watch it again. I'd recommend it to friends. Refrain from judging it based on the posters or the trailer. It's far greater than it's packaging and will probably be better received by audiences who expect more substance."
    },
    {
      "rating": "10",
      "text": "Perfect!!!!!!!! Scary!!!!!!!! Terrifing!!!!!!!!! J’ai beaucoup aimé l’an fin art ça fait peur mais le début est trop long :("
    },
    {
      "rating": "9",
      "text": "Was an amazing and sweet movie but at the end when the spoiler alert: dad does't come back and stays with Sean is when I was confused. I might've not known very well of what was happening but this movie has some of these moments in it as well not just that one. I do like the sweetness and horror in this movie so i give it a 9.7/10"
    },
    {
      "rating": "8",
      "text": "Adopted kid who likes butterflies has dreams that become real but he keeps dreaming of cancer as a man who killed his mother than now eats everyone else."
    }
  ],
  "recommendations": [
    "his_house",
    "oculus",
    "the_autopsy_of_jane_doe",
    "lights_out",
    "ouija_origin_of_evil",
    "the_lodge",
    "us",
    "scary_stories_to_tell_in_the_dark",
    "the_witch",
    "the_exorcism_of_emily_rose",
    "orphan",
    "the_conjuring_2",
    "annabelle_comes_home",
    "insidious_chapter_3",
    "the_conjuring_the_devil_made_me_do_it",
    "the_conjuring",
    "annabelle_creation",
    "the_babadook",
    "a_monster_calls",
    "the_invisible_man",
    "donnie_darko",
    "titane",
    "a_cure_for_wellness",
    "midnight_special",
    "the_prodigy"
  ]
}