{"id": 2813, "title": "Before I Go to Sleep", "starring": ["Nicole Kidman", "Colin Firth"], "runtime": 92, "genre": ["Thriller", "Mystery"], "description": "Ever since she sustained a traumatic head injury, Christine Lucas has suffered from anterograde amnesia, unable to form new memories and having forgotten the last 15 years of her life. Every morning, she becomes reacquainted with her husband, Ben, and the other constants in her life. Terrifying truths about her past begin to emerge, causing her to question everything -- and everyone -- around her.", "releaseYear": "2014", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/1sSWpTupVixOanIpZdLGzsKvcZS.jpg", "categories": {"plot": 5.40625, "acting": 5.407407407407407, "ending": 5.461538461538462, "soundtrack": 6.5, "cinematography": 6.333333333333333, "familyFriendly": 3.0, "funny": 6.0, "action": 6.0}, "reviews": [{"rating": "2", "text": "An incoherent mess. Before I go to Sleep seem to speed through its story leaving huge holes and nobody explaining what is going on for the audience. The movie felt like it was made on two days and it shows."}, {"rating": "5", "text": "Before I Go to Sleep features excellent performances, but a vulnerable storyline that is familiar to greater movies. Overall, it is entertaining, but unmemorable."}, {"rating": "1", "text": "Book was decent but predictable; one of those books you can't wait to read and then wonder what your going to do with it now that you gotten through it. The movie was worse. I sat through 20 minutes and gave up once they cut out most of the first three chapters of content and build up. Waste of time overall, both the book and the movie"}, {"rating": "7", "text": "The film wants to be a modern Hitchcock with a Nolan twist and, in some ways, it succeeds. \"Before I Go to Sleep\" never hits the heights of memory loss films such as \"Memento\", but it remains highly watchable and well made, with strong performances from the three leads. Does it all hang together? Probably not, but an enjoyable watch anyway."}, {"rating": "0", "text": "The sheer amount of absurdness in this movie is unforgivable, this is a VERY badly executed thriller that was borrowed from a mediocre novel that no one cared about anyway. Naomi Watts gave an even worse performance than Diana! Everyone looked like zombies in this movie, I hated it. Ignore."}, {"rating": "6", "text": "Nicole Kidman plays a woman with amnesia: she wakes up every morning with no memory of her past. Colin Firth is the patient husband who helps her cope. Inevitably, she begins to discover the truth about what happened, which brings everything into question. Watching her unravel the mystery is interesting, but it happens too slowly. This prevents any real anxiety until the climax. Performances are fine, but the uninspired direction, sluggish pace and somewhat predictable story keep it from developing any tension."}, {"rating": "8", "text": "Excellent acting by Nicole Kidman who holds the picture well and I believe she's in every scene. If not, she dominates every scene then. I know a lot of people aren't watching this film, this movie is for people who like Nicole's characters and she's done it again. She also has a body to die for (if that was her naked body in the movie). Naked, she looks 20 years old."}, {"rating": "6", "text": "Few twists and turns, reminded me of Enemy a bit.\rMore like a doppelganger, memory focused movie than anything else. It was great at hold your attention, building ideas and subsequently crushing your guesses about the plot. I would have preferred focusing on the memory loss subject, rather than the spouse. Colin Firth did good, Nicole Kidman did better.\rIn summary, see if you like crime dramas, dramas, or other types of plot-twisty movies. I'd honestly wait for a rental."}, {"rating": "5", "text": "Very enjoyable thriller with two leading actors that just can not disappoint, as proved in each one of their works. However, it is a type of film we have seen many times before, which does not allow me to go higher with the rating. But it is a good and suspenseful time and the time running is not long. For people who enjoy the genre it is a total \"see it\"."}, {"rating": "8", "text": "Despite the negative ratings, I watched this movie because I like Nicole Kidman and Colin Firth. The film started out really holding my attention and was fascinating and suspenseful. The plot turns kept me guessing and I found it scary and creepy as it progressed. In the end, the plot had a few holes and it didn't come together in a super fulfilling way, but it was worth watching."}, {"rating": "5", "text": "This film isn't close to be as entertaining   than David Fincher's \"Gone Girl\"  Before I go to sleep is a lazy, half baked mystery, where we know what's going to happen beginning to end. When  Nicole Kidman and Colin Firth try to play their characters it is indeed watchable and some what good. On the other hand what it stinks when we know who \"killer\" is when the movie rolls. It's predictable but twist on top! and writer/director Rowan Joffé succeeds. When Ridley Scott thought that this was the movie that was supposed to be good it was not. The movie is  suspenseful and the cast is watchable, but has some problems.  When the movie ends and i saw the credit \"Executive Producer: Ridley Scott\" i knew something was wrong. Grade D"}, {"rating": "9", "text": "This was a suspenseful movie and the cast were mesmerizing in their roles.\r Watch it online for free: https://www.primewire.ag/watch-2754057-Before-I-Go-to-Sleep-online-free"}, {"rating": "6", "text": "There was once an Adam Sandler movie, when he wasn't completely unbearable on-screen, about a girl who suffers from constant memory loss. If you have seen 50 First Dates, the comedy flair might conceal how much said girl could be manipulated and abused. For those darker minds, Before I Go to Sleep will cater to your need. The film has a solid cast as well as good pacing and editing, but it might have just confined itself with the inflexible formula and repetitive thriller antics.\r Christine (Nicole Kidman) wakes up without memory from many years of her life, this is a daily struggle for her as her mind isn't capable of retaining new information. Ben (Colin Firth) as her husband must repeat the cycle of explanation every morning, it has become a taxing task to him. Christine seeks the help of Dr. Nasch (Mark Strong) to figure out how to resolve her memory issue, they slowly discover that her past life may be less happy than expected.\r The three main actors perform fantastically. Great acting range and in-depth characterization make their interactions into suspenseful human drama. Kidman is easily sympathetic as she displays sorrow with passion. Marks Strong is at his niche for playing authority figure, he has a charismatically calming presence, and meanwhile Firth portrays a man with compassion and possibly secrets. It's quite thrilling to see the film shifts between these personalities and ensures audiences question their motives.\r That being said, the premise doesn't offer much leeway for execution beyond what has already been done before, a bit ironic since it's only used prominently in 50 First Dates and Christopher Nolan's Memento. The movie often recycles the events due to necessity, or relies on plot devices which are predictable such as overused visual clues or simple gimmick. This may slow down the pace and lessen the twists it has in store.\r Nevertheless, it has good production value with cool cinematography and amazing cast. Before I Go to Sleep might be fleeting, but it is a satisfactory mystery thriller."}, {"rating": "7", "text": "Upon its release, Rowan Joffe's Before I Go to Sleep often received comparisons to Memento as that film was also a thriller that focused on an amnesiac trying to remember how he wound up the way he is and figure out who he can trust. However, I not like Memento, so I went into Before I Go to Sleep without comparing it to a film that I enjoy. As a result, I did quite like Before I Go to Sleep. It is undeniably cliched and introduces memories or random actions by Christine Lucas (Nicole Kidman) out of plot convenience that entirely contradict the fact that she cannot remember. The film also nosedives into melodrama at the very end with a tearjerking final sequence that may make you cry, but feels manipulative. That said, the film is just so tense. It is mysterious, thrilling, and laced with suspense as we live alongside Christine as she tries to figure out who attacked her and deals with emotions evoked by memories, all while trying to figure out who to trust.Following a brutal attack, Christine Lucas remembers nothing. She believes she is in her 20s and wakes up everyday being informed about who she is, where she is, and what she does by her husband Ben (Colin Firth). After Ben leaves for work, Dr. Nasch (Mark Strong) calls her and reminds her to check for a camera in her wardrobe closet where she records a visual diary daily. He then proceeds to meet her during the day behind Ben's back, who does not want her to remember for fear of her getting upset. The film's tensions continue to rise as we are given cause to not trust both Ben and Dr. Nasch at various points before we come back and believe them again, only to then proceed to continue questioning if they are what they say they are. This is the source of Before I Go to Sleep's greatest amount of tension as this mystery and suspense that unfolds rivals something akin to a Hitchcock film with how it keeps you in the dark. With Christine's illness, we constantly must try and add two-and-two together with the limited details that she can add throughout the day. What compounds the mystery is the fact that both Firth and Strong are British and as Hollywood has taught me, never trust a Brit because they are all shifty. Yet, the film forces us to pick who to trust and it makes it all the more compelling as common sense says neither are wholly trustworthy.Plot-wise, as mentioned, the film is pretty run-of-the-mill. This may be writer-director Rowan Joffe's fault as the film entirely relies upon the disease of its protagonist and then willingly breaks the rules it sets when convenient, particularly with regard to the reveal of who her attacker was. After initially stating that going to the site of the attack does not work, the film then goes and has the site of the attack bring back memories of it for Christine. That said, when the film threatens to just boil down into a pretty typical who can you trust thriller, it throws in a compelling twist that really breathes life into the film seamlessly. This final twist is really what saves Before I Go to Sleep from being a pretty tame thriller, as well as excellent lead performances from Nicole Kidman, Colin Firth, and Mark Strong. Each actor turns in a shifty performance that really makes you begin to wonder their true intentions, only to then turn around and seem entirely trustworthy. Yet, we know somebody cannot be trusted. Is it Christine? Is her broken mind playing tricks on her even now? Is it Ben? Is he really just protecting her or is he hiding more? Is it Dr. Nasch? Is he really a doctor? Why does he now want Ben to find out about the treatment? For all of its cliches and narrative shortcomings, Before I Go to Sleep winds up still being a truly entertaining film that shows that a fun, twisty, and slick thriller that has echoes of Hitchcock (who would have directed the hell out of this) can still turn into a pretty good piece of cinema. While not exactly an artistic accomplishment and one that could have used a more capable of director, this one entertains and constantly keeps you an edge with a chilling premise, excellent acting, and eerie score."}, {"rating": "2", "text": "Before I Go to Sleep tries to be Memento but fails miserably at doing so, with an only apparently convoluted plot which actually leaves traces of its conclusion everywhere - so that when the final twist arrives, there's not much left to think but \"I knew it\". The mediocre production sets the disappointing mood for the as much mediocre performance by Nicole Kidman, and the as much disappointing performance by Colin Firth.\r Also, major, major plot holes throughout and inexplicable character development (a character who should NOT have changed one bit, following plot,  is actually shifting towards another person entirely). Not worth the time."}, {"rating": "6", "text": "Well acted film that unfortunately is very overwrought. It's too complex for its own good and kind of plays out like a made for TV thriller which is a shame since it has such a grade A cast."}, {"rating": "5", "text": "Before I Go to Sleep is a 2014 mystery psychological thriller film written and directed by Rowan Joffé and based on the 2011 novel Before I Go to Sleep by S. J. Watson.Christine Lucas (Nicole Kidman)  plays the role of a woman who upon waking up every morning with no memory of her life from her early twenties onwards. Christine secretyly receives treatment from Dr. Nasch, a neuropsychologist at a local hospital who gives her a camera to record her thoughts and progress each day, and calls her every morning to remind her to watch the video in the camera...Amazing performance by Nicole Kidman. The pacing and tension are pretty well brought out. However, the plot is a little too simple, and does not have any unexpected twist to awe the viewers."}, {"rating": "5", "text": "The movie had its strong points - good performances from all actors, especially Colin Firth in my opinion as I am used to him being in a different type of role usually. Also the beginning of the movie was interesting and unpredictable, but afterwards it slowly downgraded, the plot twists started to seem too predictable and everything unfolded in quite a boring way at the end. I mean, it lacked substance at the end and basically after you knew what is the plot twist it got quite boring and everything what you thought will happened basically happened. At least in my opinion. So what it would have needed was something more from the story or at least an unexpected ending."}, {"rating": "6", "text": "Thriller. Amnesiac Nicole Kidman acts impressively through the full range of emotions re-discovering memories. Piecing together the full truth invloves some shocks along the way and there is some violence. Effective direction, use of lighting and soundtrack heighten the mystery and tension. It's a professionally-crafted movie, great to look at and generally satisfying, like a celebration cake."}, {"rating": "8", "text": "Bonne nouvelle, Nicole a arrêté le botox ! elle semble assumer son âge désormais ou au moins se limiter au bistouri du boucher diplômé comme toutes les stars qui commencent à bouteiller (à avoir de la bouteille si vous me pardonnez cet affreux barbarisme). Et encore, je suis mauvaise langue.Du coup, ses beaux sourcils ont retrouvé leur mobilité et je l'ai trouvée quelque peu amaigrie... attention Nicole, il ne faudrait pas finir anorexique non plus ! qu'elle est belle notre Nicole en tout cas et talentueuse avec ça : un beau rôle d'amnésique taillé sur mesure qui appelle beaucoup de questions et conjectures de la part du spectateur...Le film est presque un thriller mâtiné de polar dont les aiguillages changent régulièrement pendant un certain temps : le mari n'a pas l'air très net... mais le bon docteur non plus !... A contrario des films sur l'oubli abusant des flashbacks de plus en plus confus, \"Avant d'aller dormir\" sait garder le cap et l'écheveau se démèle progressivement jusqu'à la révélation finaaale... bien trouvée et tout-à-fait crédible et inattendue.La réalisation est élégante et les deux acteurs épaulant Nicole sont très convaincants (Colin Firth et Mark Strong, très fort pour sa part). Evidemment, le cas d'amnésie de Madame est à la base tiré par les cheveux (j'oublie tout chaque matin... uniquement !) mais sert de prétexte à un scénario très malin.On note une tendance à guimauver (à faire de la guimauve) un peu trop mais rien d'inquiétant... et puis bien sûr, quel beau numéro de Nicole : superbe actrice en vérité dans un film solide et bien fichu."}, {"rating": "2", "text": "Under every circumstance Before I Go To Sleep enters in the terrains of the thrillers where you know what will happen before it happens, unless you are so unintelligent as to understand the plot.Forget it, this movie is forgettable."}, {"rating": "3", "text": "This movie is a mystery thriller around a woman suffering from a rare amnesia condition due to a serious trauma and who, therefore, wakes up every day thinking she is twenty years old and not even remembering her marriage. The idea would be very interesting if it had been well developed by the script, but it didn't. As the film goes by, the villain becomes too obvious, as are the plot holes. One of the most obvious is the marriage of Christine (the name of the character, played by Nicole Kidman): if her condition of amnesia causes her to forget only the memories from a given moment of life forward, and if that moment happened when she was already married or, at least, the girlfriend of the one who would become her husband, how could she forget his face? This is just an example of a plot hole I discovered. I will not give more so I will not spoil the whole story. Kidman was OK but not amazing; Colin Firth starts slowly but improves with the film's advance; Mark Strong does a good supporting role but does not have room to do much."}, {"rating": "5", "text": "55/100  What a beautiful idea ... a shame that was destroyed.  The acting is a god (we have 3 characters ... it would have been weird not to be good). These are the good parts.  It's filmed bad (shaky cam ...), the story is broken and super predictable (1 hour...)"}, {"rating": "7", "text": "This is a very tense and haunting film which I'd say has elements of drama, thriller and mystery to it. The main theme is trust - trust and personal identity. It features quite a strong use of stringed instruments in the majority of scenes to add to the sense of rush, panic and tension presumably felt by the characters involved in said scenes.Nicole Kidman does well portraying Christine as a confused, disorientated yet also strong willed and determined woman. I could feel her frustration and confusion as she tried to regain memory of key times and events in her and her families past. Colin Firth plays her other half, Ben, who is quite stoic, someone rather matter-of-fact like, who 'tells it like it is'. Other cast members include Mark Strong as Doctor Nasch, who has apparently been treating Christine for her insomnia, Anne-Marie Duff as Claire and Dean-Charles Chapman as Adam. I thought that both Kidman and Firth gave decent performances in this film, which helped it seem more believable as they played their roles convincingly.There is a fair amount of whispers present in the film, so its possible that some people, perhaps those who may be hard of hearing,  may struggle to fully follow dialogue in parts, although I managed to follow the majority of it. It may be worth turning the volume up on your TV if you think this would be an issue - there are relatively few scenes where there is constant loud pitched noise, so that shouldn't cause too much of an issue I'd have thought.I was impressed with the way the soundtrack really emphasised the clear tension and general mystery surrounding most of the scenes and the plot in general. There are some scenes in which we see Christine looking through a peep hole and a long corridor is presented in fisheye lens format (curved at the sides). The camera zooms in on her eye, with spookily red veins present and then on what she sees, sometimes tinged in a spooky orange colour tint. It reminded me, very briefly, of more gory films such as perhaps The Shining, although no extremely graphic gore is present in this film (some vioence but not so much gore).Speaking of content, this film contains some strong language, some sex references and partial nudity and some bloody violence, mostly in flashbacks. It is relatively spooky and potentially frightening, certainly to young viewers, hence the 15 rating it carries. I wouldn't have thought it would be likely to particularly upset people, as it handles the topics the plot contains quite sensitively overall I thought.As the film continues, the plot slowly unwinds, although it seems, certainly early on, as if its almost impossible for real truths to be discovered. The critic in mean felt as if it was slightly unlikely for Christine to somehow, as if by magic, be able to piece things together, as she does but having said that, its not as if everything goes smoothly or all is entirely clear and I certainly felt like I was entertained while watching the film. It is a relatively immersive film and at just under an hour and a half long, its a good film to watch if you have a relatively short time to watch a film. For what it is, its pretty decent.Yes I'd recommend this film, as I felt it featured good performances, a curious and intriguing plot, it was relatively immersive and spooky and thus a decent drama/thriller/mystery."}], "recommendations": ["prisoners", "the_machinist", "run", "the_woman_in_the_window", "the_good_liar", "the_unforgivable", "split", "anna", "the_next_three_days", "the_little_things", "the_invisible_man", "the_rental", "gone_girl", "i_see_you", "thelma", "a_simple_favor", "widows", "elle", "stillwater", "zodiac", "the_beguiled", "the_call", "predestination", "a_history_of_violence", "what_lies_beneath"]}