{"id": 4035, "title": "Begin Again", "starring": ["Mark Ruffalo", "Keira Knightley"], "runtime": 104, "genre": ["Comedy", "Music", "Romance", "Drama"], "description": "Gretta, a budding songwriter, finds herself alone after her boyfriend Dave ditches her. Her life gains purpose when Dan, a record label executive, notices her talent.", "releaseYear": "2013", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/qx4HXHXt528hS4rwePZbZo20xqZ.jpg", "categories": {"plot": 7.571428571428571, "acting": 8.097222222222221, "ending": 7.764705882352941, "soundtrack": 7.791666666666667, "cinematography": 8.0, "familyFriendly": 3.0, "funny": 8.333333333333334, "action": 8.0}, "reviews": [{"rating": "10", "text": "Begin Again now holds a top spot among my favorite movies. The story evolves into a lovely, graceful celebration about the love between friends. Mark Ruffalo and Keira Knightley excel in creating and shaping characters that you hope to meet again. James Corden is also a delight!"}, {"rating": "7", "text": "Overall, this one feels a bit magical and is quite heart warming. Keira Knightley and Mark Ruffalo are great and their chemistry with one another feels authentic. Hailee Steinfeld is also good in a supporting role here. Adam Levine, at times, shows his inexperience in acting and is severely outclassed, but never really seems like dead weight either. The characters are well put together, the story is told well, and as I just said, the overall experience is a feel good one. Nothing really overly unique and great about the film as a whole, but it works for what it is. However, the one area where the film is phenomenal is in its music. The songs in the film are magical and really click every single time. Watching them record them and then hearing the final product is a fun and enjoyable thing to see and to see them come together and express themselves doing so is another nice touch. Really, everything to do with the music here is pitch perfect."}, {"rating": "7", "text": "\"Begin Again: stars Keira Knightley, Mark Ruffalo, Adam Levine, Katherine Keener and Hailey Steinfeld in this film written and directed by John Carney (\"Once\").\rMs. Knightley comes alive in this film after our having viewed her in so many mid 19th Century films as she helps illuminate the streets of Manhattan (where the film takes place) with her stellar performance. . Although her role requires singing, this is obviously not her professional forte. Nevertheless she handles the role nicely. Alas, that’s where the accolades for the film end for the performances of Mark Ruffalo (who always seems to play the same part) and the other performers are hampered by an average script and music that two generations after mine probably love but this writer could do without. Writing and directing the same film is an art and a task not easily carried off. Mr. Carney is no exception here and a somewhat confusing screenplay coupled with less than average musucal performances earn this a 7.5 rating with the 0.5 attributed solely to Ms. Knightley."}, {"rating": "9", "text": "9.5 Run don't walk to see this unpublicized treasury of a movie. These are characters you really care about. The acting is superb and the music outrageously good. John Carney has made a masterpiece and hardly anyone knows about it. I just saw it after being released 3 weeks ago and the theater was 90% full. Word of mouth is spreading. At the end of the movie the audience just sits there taking it all in.  It ends way too soon leaving us wanting more.  It's a movie about real life filled with regrets, sorrow, happiness and rebirth."}, {"rating": "9", "text": "A fantastic, fantastic movie. Ruffalo really shines and Adam Levine is an absolutely unexpected standout. He did a great a job. I really enjoyed the story, pacing, characters, and acting. The ending was also really solid. Overall a splendid movie."}, {"rating": "10", "text": "I thoroughly enjoyed the movie and it really wasn't a 'rom-com' as much as a 'light' drama. I was delighted by the performances of all the principals and found the movie as a whole rather charming and\rtotally unique. It was in no way predictable as I thought that certain characters were going to end up together. Refreshingly, in some respects, they didn't, although the potential was there in several scenes.\r The music to the film was probably the most engaging set of songs that I have heard in years. Did Keira do her own singing? Loved hearing Stevie Wonder's 'For Once in My Life' again, so appropriately done. The envisioning of musical accompaniement to Keira's first solo song was almost magical.\r Strangely, Adam Levine of Maroon 5 acquitted himself exceptionally well as I was prepared to dislike him for all the media hype. I found his acting performance commendable.\r The scenes of playing and living in NYC made me want to go back to the city as it was so attractively and engagingly displayed. All in all, I really liked this film."}, {"rating": "10", "text": "Carney knows what to do and he does it best. I had to remain seated for a further 5 minutes when the film had ended just to take everything in. The storyline isn't clichéd  nor are the characters overplayed. You become engrossed with their relationships and feel as though you are on this journey with them. Brilliant performances by Knightley & Ruffalo and a stellar supporting cast."}, {"rating": "7", "text": "Mark Ruffalo plays a washed-up record exec who hears singer/songwriter Keira Knightley and decides to make a recording with her…outdoors all over New York City. Considering the subject and the writer/director (John Carney, who did the same for \"Once\") you can expect lots of music. The soundtrack is filled with pleasant poppy songs, none of which are memorable. Ruffalo is interesting as always and Knightley may be the most charming she's ever been. Adam Levine co-stars as her ex and does fine as an actor (of course, he sings). The situations are predictable and the dialogue isn't especially sharp, but the appealing actors and plentiful music make it likeable."}, {"rating": "8", "text": "Great music movie. See it if you like music at all...I will probably buy this soundtrack just due to how great the music sounds. The acting was okay, I think Knightley stole the show though, Ruffalo playing second fiddle, and his \"character daughter\" even upstaging him at times. Is it just me or does Ruffalo seem like a type-cast at this point? I mean \"Thanks for Sharing\" and \"Begin Again\" seem like the same guy - disheveled, broken, and generally out-of-sorts. But I digress.\rIn summary, see it if you like and appreciate music. Worth a rent when it comes out."}, {"rating": "9", "text": "This is a real crowd pleaser. With its gentle charm and simple, but not simplistic storyline it captivatingly draws one into its wish fulfilment, fantasy romance. Backed up by an incredible clutch of great new songs, which will ensure that the CD is a must have item, this is a no gloss production with a very big heart.\rOne's initial fears that it will be as indifferent as its title suggests are not borne out (the original title 'Can a song save your life' is a lot quirkier) and one very quickly warms to both the film and the performances of its very engaging cast. Mark Ruffalo is outstanding here and there is real chemistry between him and Keira Knightley, sporting a very acceptable singing voice. Supporting actors also contribute to the charm, although a little of James Cordon does go a long way. Unfamiliar New York locations are also refreshingly used.\rPersonally I enjoyed it more than John Carney's previous hit, 'Once', and it does share that film's love of music and the endurance of the human spirit. Also, wisely, neither film opts for an obviously pat ending. In fact, this could very well end up being the most enjoyable movie surprise of the year."}, {"rating": "4", "text": "What was so successful in Carneys ONCE fails to reemerge in BEGIN AGAIN. I feel this is partly due to casting, Knightly is wrong from the role of Greta, I feel this role would have been better realized by a more unfamiliar and better actress. Ruffalo also falls short which for me is an ever bigger disappointment as I am a big fan generally.\r I lost interest in the characters and story of this film. Maybe yes to a large degree this is due to the fact I sensed very quickly that the bench mark of ONCE would not be found or close to being found by this outing.\r Unfortunately I gave such little attention/interest to the characters in this film I am unable to provide a more detailed review of the actual film itself.\r Carney can do and must do much better than this mild sell out of a production. Overall I will class this a lame pony with one eye missing and only 2 teeth remaining in its mange-riddled head."}, {"rating": "4", "text": "This one left me flat.  It doesn't hold a candle to the filmmakers previous work \"Once\", which had so much feeling and soul to it.  Another thing that Once had going for it was amazing music, and tremendous singers.  I love Knightly (and I love the rest of this amazing cast - with the exception of Levine who I don't know much about), but she cannot carry the music.  Her voice is average, and I couldn't get behind any of the songs.  It's a problem.  And the chemistry between Knightly and Ruffalo is just strange. It can't even touch the chemistry between Sandler and Vega in Spanglish - then again, that's a high bar.  And I frankly just didn't get the ending at all."}, {"rating": "6", "text": "Mark Ruffalo is the star of this movie which revolves around the pop music world and a plot of climbing out of the depths to regain prominence not only professionally but in his personal life as well.  Keira Knightley provides a pleasant foil to Ruffalo's character as she too faces personal decisions in her life.  Fortunately, the chemistry between the two is there but not exploited in the usual Hollywood fashion.  Whether the music is good, bad, or indifferent will depend on the viewer's background and age.  One wonders, as in so many movies, how the directors and writers of movies from the 1930s to the mid-1960s were able to produce often excellent movies without use of the f word and variants, which trips off the tongues of  the main characters like water dripping from a leaky faucet."}, {"rating": "5", "text": "Pretty formulaic.  Runs through all the standard cliches very quickly.  Main characters not really fleshed out.  Nice music though, and a good ending.  Adam Levine does a nice job acting."}, {"rating": "7", "text": "While there's not a song like \"Falling Slowly\" to stick in your mind as with the director's previous film, \"Once,\" this is a warm and creative slice of the songwriters' life. Keira Knightley is at her most winsome and Mark Ruffalo at his most adorable as they discover, challenge, support and inspire each other. My favorite scene was near the beginning. Ruffalo, a down-on-his-luck music producer, hears Knightley's low-key and poorly received singing in a bar. Then it shows him imagining all the elements that could make the song a hit -- mentally adding in piano, drums, strings, backing vocals. (Yeah, Knightley's voice is a little thin, but just think of all those marginally talented, autotuned kewpie dolls who are stars currently.) Glad for a nice little film I can recommend to my friends who aren't into sci fi, superheroes, scorching drama or violence."}, {"rating": "9", "text": "Hands down my favorite film this year.\rThe acting is superb and the music outrageously good. John Carney has made a masterpiece and hardly anyone knows about it."}, {"rating": "7", "text": "From Irish director/writer John Carney (also the  of the indie dark-horse ONCE (2006, 8/10), BEGIN AGAIN is an urban symphony of NYC, stars two bankable names of Knightley and Ruffalo.\r Originally titled CAN A SONG SAVE YOUR LIFE?, which is more literal to describe the chance meeting between Dan Mulligan (Ruffalo) and Gretta James (Knightley), Dan is a damaged good, with the usual trappings, a middle-aged man abandoning himself to alcohol, separated with her wife Miriam (Keener) and distanced with their teenage daughter Violet (Steinfeld), once a promising executive of an indie record label, but now he is just fired by his business partner Saul (Bey) in the presence of Violet. It is the worst day of his life, and he is seriously considering to end his own life until he watches Gretta performing her own song in a bar, he is immediately attracted by her unsophisticated frankness in her music, and decides to sign her (although this is not up to him and he brings her to Saul to see if they can reach for a record deal).\r reading my review on my blog, please google: cinema omnivore, thanks"}, {"rating": "10", "text": "Folks, if you like music and appreciate its power/magic, this is a film that you can't help but enjoy.   A solid cast combined with excellent storytelling and the power of its original music adds up to a thoroughly enjoyable 95 minutes.   Perhaps not deep or profound, yet the four of us talked about music the entire night, fueled by the glow of this movie (and perhaps a little sangria).   We all felt this was the best movie of the year, so far."}, {"rating": "7", "text": "In the second installment of his career, John Carney again provides us with a beautiful combination of music and storytelling. Despite a disappointing performance from Adam Levine, Keira Knightley and Mark Ruffalo carry the film through its highs and lows."}, {"rating": "8", "text": "What a pleasant little sleeper film in the middle of the hot summer. What weaknesses this story has is easily ignored due to the fact it has great music throughout the whole 90 minutes. Mark Ruffalo is a great star for this one and shows great character development. I have not seen him in anything I have not liked. Oh and did I mention it has great music. Not the type of movie to rave about, but the one that you can easily enjoy quietly while resting from the hot outdoor temperatures."}, {"rating": "8", "text": "This is a sweet and charming film that is enjoyable from start to finish.  All the performances are good especially Mark Ruffalo who always comes off authentic on screen.  A-"}, {"rating": "8", "text": "Begin Again has good music, great acting and lovely story. Keira and Ruffalo have great chemistry while Levine held his ground. Light drama enveloped in subtle comedy makes this movie unique and beautiful."}, {"rating": "8", "text": "If you need to see a musical movie that is not so over the top, Begin Again is that musical movie.\r Begin Again has an interesting story that catches you from start to finish, an interesting story that will make you care about the characters in this movie.\r The chemistry between Keira Knightley and Mark Ruffalo is amazing in this movie and that has to be the best part of this movie.\r The musical scenes in the movie are great to watch. Whether it’s Keira Knightley’s voice or not, her singing voice in this movie is such a delight to listen.\r This movie is also a nice social commentary about the music industry without being too preachy.\r The direction of John Carney and the cinematography in this movie makes this movie nice to watch with its simplistic production value.\r Overall, this simple, not over-the-top musical movie will interest you from start to finish thanks to its chemistry between Keira Knightley and Mark Ruffalo, jam along musical scenes, nice social commentary about the music industry and its appealing direction and cinematography."}, {"rating": "9", "text": "Plot/Story: \"Wish I Was Here\" in a few words is Cliche and Predictable. Every single thing that happens it's like \"Yup knew it\". There are absolutely zero surprises in this movie. A good film should be unpredictable and leave you with no clue on what is to happen next.  It is also very \"Cliche\". You will find very little here that has not already been done in many other films. These two points are big ones that take away from the whole movie. The comedy also was not that great. I feel like there was no in between. Either the jokes were hilarious or they flat lined. As the movie went on the jokes became less funny.  The beginning of the movie showed quite a lot of potential. All the comedy was nice, the plot looked like it would go in another direction, and it looked enjoyable. You don't really care for the characters at all because you have seen it all before. None of this is terrible...... It is just mediocre. 4/10\r Characters and Actors: Zach Braff play's Aidan Bloom and he does a pretty good job. His performance was the best part of this film. There isn't really any chemistry between any of the characters. All the characters are just there. Kate Hudson plays his wife Sarah, Josh Gad play's his brother Noah, and Mandy Patinkin plays his father. Though have to give prop's to Joey King and Pierce Gagnon who play Braff's kids, for child actors I thought they were well above average. Aside from Braff's, Kings's, and Gagnon's performances the rest were pretty average.   7/10\r Overall: Just a mediocre film that showed a lot of potential in the beginning and just went downhill. And that's what this movie is, potential. It has the potential to be funny, it has the potential to be emotionally heavy; but no one in the entire production chose to take a single risk and as a result we get a predictable and cliche movie. Aside from the three great preformances I mentioned earlier and one running joke within the movie there's nothing special to make me wish I was here."}, {"rating": "9", "text": "Begin Again is a movie that will help you recognize the power of music and how it can bring people together. It is really probably the best fictional music movie that I have ever seen. Music can uncork so much emotions and Begin Again displays characters that feel strongly about their music without worrying about record sales or chart success. There is such a strong cast in this movie. Mark Ruffalo shows off some talent that I had never seen from him before. Keira Knightley has some potential to become a real star in the future in my opinion. Then we have Adam Levine who had some limited screen time but I enjoyed every minute he was there. I would like to see him in some more movies, and you don't have to be a Maroon 5 fan in order to appreciate his role. The end scene is probably my favorite of the whole movie and it shows the true power of song. This movie could be enjoyed by anyone who gets emotional responses from music."}, {"rating": "8", "text": "4/5★ I loved Director John Carney's Once. That movie is a gem. Begin Again, while good in its own right, does not measure up to Once. It's a charming movie, with complex characters and a non-edginess that is refreshing, but part of the charm of Once was the anonymity of the cast, the lack of preconceptions made the movie more enjoyable: I was distracted, thinking about the fact that that was Keira Knightly, singing better then I thought she could: Was she being dubbed? And was Adam Levine just playing himself? All this was distracting me from fully enjoying the movie, which is too bad because it is a good film.\rAnother comparison with Once: A plot point in Begin Again is authenticity vs. selling out. I'm not saying the Carney sold out, but Begin Again does have a whiff of over-producing, of mainstream focus. Not a lot, but enough to make a difference.\rVerdict: Enjoy."}, {"rating": "10", "text": "An amazing coming age film starring Keira Knightley, Mark Ruffalo and Adam Levine. What else can we ask ?\r An amazing musical coming age film well directed by John Carney an amazing director. This film is just brilliant due to the following reasons.\r First of all the movie is directed brilliantly by John Carney ( the director of Once), making such emotive scenes, like the one in which Keira Knightley sings the song  \" A Step you can't Take Back \" and Mark Ruffalo sees her for the first time playing her music.\r The second important thing is the performances of Keira Knightley an amazing actress that does the singing job really well,  since she is able to sing and rock. Also he character Gretta is really likable and really helps develop Mark Ruffalo's character Dan. The second thing is Mark Ruffalo performance making one of his best performance in my opinion dealing with problems and actually growing and developing his character through the movie.   Finally Adam Levine known from the popular band Maroon 5 making he's debut as an actor making in a great way by adapting to the environment and to his characters situations really good, plus he is great singing.\r The third thing is that this movie is brilliantly written by John Carney using time in a brilliant way to tell his story in amazing way. This script is really good since the characters due change through the movie, also the songs are really amazing and likable.  Although the movie is cheesy sometimes the script is good in general since Carney uses time, well and his characters are really likable.\r In general this is a great age coming film, that should be taken more seriously by critics since a 62 is not what it should have in my opinion.  It is really sad that this movie will not be considered by the Academy Awards (Oscars) for a prize since this movie   is totally a great summer blast and a great musical age coming film that will definitely make you buy the soundtrack of this movie. This movie is definitely 10 out of 10."}, {"rating": "8", "text": "An amazing film just like Once (2006). John Carney succeeds in this romantic and funny musical, which brings a real and honest story. Knightley and Ruffalo shine on screen and bring charismatic characters to the audience, alongside the rest of the cast. Although I missed a better background on Gretta's life, since Dan received more attention on the script, the film is quite well developed and leads us tho an unpredictable and satisfying ending. The soundtrack? AMAZING. I heard it before Begin Again's release and loved it even more after watching it. Adam Levine is superb as always and Knightley does fine as a singer too. She doesn't have this incredible voice but she manages to do a very good job here."}, {"rating": "8", "text": "The movie sets the table well, it just takes a while to put it all together!  The acting and story is well over the top.  I am beginning to love Keira Knightley more and more as I see her in different movies!  Also Mark Ruffalo is at the top of his A list, and haven't seen him in really bad movies either.  In addition to all the previous, the music and scores are pleasing, so get the full effect and watch it in surround sound!!  We simply need to have more movie like this with all the right elements, overall will go on the list of some of my favorites, and one I will pull off the DVD shelf and watch again some time!!"}, {"rating": "8", "text": "Watched \"begin again\" a remarkable movie with an artistic concept of acceptance of being who you are and understating the true art, Kiera Knightly like every other movie of her's performed really great and Mark Ruffalo played it like a star in it, not forgetting Adam Levine he gave a serious performance well quite frankly speaking he is a better far better singer then an actor still stupendous overall."}, {"rating": "9", "text": "The first time I watched Begin Again, my heart melted as my ears and eyes kept wanting more. The cast was superb, and the songs were to-die-for. I cannot blame Adam Levine for his acting skills, but Mark Ruffalo and Keira Knightley gave the film a big 'bam!'. Honestly, their chemistry was good and it was nice that the plot ending was not forced, like it all came down to victory for them all."}, {"rating": "7", "text": "\"Begin Again\" was a funny movie, and the characters were very good in the movie, Mark Ruffalo and Keira Knightley, they were great, and the story is very good and very original."}, {"rating": "8", "text": "In my quest to collect every movie, I picked up Begin Again.  I am more of an action junkie, so I was really surprised when the credits rolled to find myself incredibly satisfied!\r Begin Again is a heart warming movie, which many movies now a days seem to have forgotten about. It's main pairing of Kiera Knightley and Mark Ruffalo are fantastic and share great chemistry on the screen. The pair portrayed very human characters and their issues make their characters so much more interesting, They combine to make an album in the movie, which reminds me that the soundtrack is very good in this movie. A number of good songs find their way into the movie and never feel out of place. The film has some really good direction and makes New York absolutely stunning at points in this movie. From grimy alleys to the bustling cityscape, the city feels so alive. In addition to a decent supporting cast, the film is helped by an overall satisfying conclusion.\r In terms of flaws, the first 20 minutes are slow and don't really go anywhere, with the film returning to the same point 3 TIMES!! Come on!! It feels like you are in a time loop for the first 20, and the plot could have done it differently. Also, I feel that the film sometimes attempts to make wider statements on the music industry that fall flat and doesn't do it enough, apart from one scene. If it had done it more, I might see a deeper layer to this film that what is presented.\r That said, this movie is a happy, enjoyable music movie with interesting characters, a good narrative and some great direction and you should seek it out!"}, {"rating": "7", "text": "If you would like to see a not complex movie, but with interesting content, I might like seeing “Begin Again”.\r Written and directed by John Carney, the film made in musical comedy-drama genre and stars by Keira Knightley and Mark Buffalo. Also admires of Adam Levine have an opportunity to see him there.\r The genre of the movie implies that it is full of good music.\r Moreover, whole movie is about music industry and people, who are working in it and dreaming about it. More precisely, Dave Kohl (by Adam Levine) is newly successful musician, who used to write the music with his long-time girlfriend Gretta James (by Keira Knightley). After rising to fame, he breaks up with Gretta. However, she does not drop music and encounters Dan Mulligan (by Mark Buffalo), former successful record label executive. Dan takes liking for Gretta's music and persuades her to sing for his former record label.\r Without revealing further details, I can say that the film is easy to watch and leaves nice aftertaste. You will hear music from this film a long time after watching it."}, {"rating": "8", "text": "True to its own self-referential dialogue, Begin Again is a pearl on the film industry's string, which of late, is more string than pearls.   Both stinging criticism of the music industry and a non-traditional love story, Begin Again avoids cliches and offers a satisfying ending without being formulaic.  However, one of its biggest ironies is that it shamelessly pans the music industry's penchant to use cinema to place its product.   Good thing Begin Again has an exceptional script and bevy of great songs - more cynical viewers would think Begin Again had gone Hollywood."}, {"rating": "8", "text": "Carney proves that tackling familiar story and using tons of clichés are the last things that should be concerned about as long as the film is made with self-awareness and immense passion; and that Mark Ruffalo is capable of fleshing out his character quite readily, that Keira Knightley is capable of singing with a voice so pure it goes straight to your heart and that they both, surprisingly, have a rare dynamic. He also proves that films cannot only be seen, but also listened to. Such an infectiously authentic feel-good film!(8.5/10)"}, {"rating": "10", "text": "I love this movie so much and the soundtracks are all great. Adam levine's character is my favorite, you really can see how fame and people's reaction to his music changed him and his style in music as well. This may be a romantic film but I'm glad Gretta and Mark's character didn't end up together. A perfect ending for a great film."}, {"rating": "7", "text": "A sweet drama with focus on music, starring Mark Ruffalo and Keira Knightley.I liked it."}, {"rating": "5", "text": "This is a drama film with an emphasis on music, of course. It features themes including showbusiness, singing, recording and female musicians. First off, I quite enjoyed Kiera Knightley's singing (which is mostly pop/folk type songs) and I liked that she, as the lead female character, was quite independent, fiesty and self assured, hence she's clearly more on the up than the male lead, Dan (played by Mark Ruffalo). I felt it was quite refreshing to see a film depicting a woman being more in the driving seat, if you know what I mean. It could easily be classified as a chick flick type of film I suppose, with Kiera's character, Gretta, being sassy and so on but it didn't strike me as quite as pure saccarine sweet as some rom com's I've come across. I don't tend to watch many of those.I liked that the singer Adam Levine appeared in it - he's well known for being in the US group Maroon 5, so it does add a certain element of realism to it. I'm not sure I'd agree that fellow co-star James Corden (who plays Steve) is quite as good when it comes to singing or performing as a musician however(!). Joking aside, other cast members include Hailee Steinfeld, who plays Violet, Yasiin Bey as Saul and Catherine Keener as Miriam.The music featured is predominantly quite light in tone, acoustic/unplugged, pretty pleasant, if a little 'airy fairy' but I quite enjoyed it. I suppose it helps to be in a good mood when watching this, as if your in a bad mood then you may feel more likely to roll your eyes and switch it off possibly. It probably didn't quite contain the substance I may have hoped for in such a film categorised as a drama and by that I mean it wasn't exactly a fast paced thriller of a film. The characters are fairly interesting/intriguing and I liked Gretta well enough but the main plot wasn't exactly amazing. Its a pretty light and I guess easy watch.Content wise, the film contains sex references and strong language including some offensive instances of name calling and some pejorative references to different groups of people (teenagers/singers etc.). There are drug references and characters shown who are drunk but otherwise there isn't anything much likely to offend to upset. The film has been given a 15 rating in the UK.Its fair to say that this is a film which is optimistic in tone, which is somewhat summery and may be an enjoyable watch, particularly if your keen on dramas which focus on character development, films with strong female lead roles and you like contemporary folk music perhaps. It isn't in any way a memorable film - I can't see myself thinking back to it in the future at all but it isn't as bad as it perhaps could have been. To me it was relatively good but, I suppose, probably more average or alright over all, as for my personal tastes it seemed to lack a real depth or substance, so I'll err on the side of caution somewhat and go for an overall 5 out of 10 rating for this one.I suppose I would cautiously recommend this film. It features decent performances from Knightley and Ruffalo and has some fun music - the plot pace is a little slow and it isn't especially dramatic as such but itd alright. Its a fairly easy watch and it isn't as cringey as some 'chick flicks' I've seen, so it could be worse. However, it won't suit everyone - if your looking for a really dramatic film, or a film featuring a speedy plot pace, or if you hate cheese then this won't be for you and I didn't feel it was very memorable either. It has good points and bad points, so I suppose I'd leave it up to the individual to decide if they'd enjoy it or not - I'd, personally, hoped for a bit more substance but thats a personal preference."}, {"rating": "7", "text": "Relationship to being true: Not true.Description: A story about a woman living in New York who comes into conflict when her boyfriend is unfaithful to her. Her boyfriend is a famous musician, she is not- but. She has talent, which a producer notices. Either act as a catalyst for the other's recovery-  and there’s music.Reaction: This is not a close analysis of the text.Music: (Gregg Alexander, New Radicals.) OK.Hello, everyone. There are a few really clever bits, here. I find, anyway. That it's clever, and magical, to see Mark R. visualise the instruments played by ghosts. It's clever to have jokes at Adam Levine's expense, and how he takes things too far. It's clever, to have a song, that K.K. can tell is directed at someone else (though right now, I can't remember, how that works.) If you think about Prokofiev's Peter and the Wolf, Peter has a theme, right? and there's not such an obvious distinction between the styles of the two leads here. Obviously, lovers, blurred into one, possible to argue. The distinctions are?- party crap noise (Mark R. and his demos, Cee-Lo.), soul-wrenching ballads (KK. And AL.) the \"classics\", (on a iPod)... Roughly? Not bad for before breakfast.As verdict, then, and sorry to be like that, the Gregg Alexander songs, knocking round in head a week later, were just a tad drear- sorry, Gregg.Costume: some very nice clothes, and... no jarring notes.Tech: probably brilliant, and must have had to bite tongue? as plot suggests it is freedom of human spirit, to want to record an album in the open air.Script: The conversation flowed, I'd say.Does it use beautiful people to get your attention? The answer is yes- but I found them endearing people. Good for structure- about 90 mins, and 3 acts.Acting: everyone? seems quite relaxed.Further questions.1) Jove the philanderer, actually has a record deal and a film and does what people \"want\". Juno releases her album for free but has spirit. Which sensibility made this film, Begin Again, though, do you think?2) I'm not sure why I was crying, at the rooftop scene.3) I liked the film. However, if I am being safe, then I suspect New York and music is not so wholesome. Thank you."}, {"rating": "10", "text": "Begin Again is a rare movie that have a perfect big decision in every single one of them, they have a perfect decision to not do this and they have a perfect decision to do this, and that is hard to do, it's subjective like the movie itself but for me it's just perfect, Begin Again is not just a typical street road music performer movie, John Carney give every single heart of his to the movie that surprisingly didn't take a long time and it surely give the movie more positive things, he can just not put or do that but he did and it's amazing, it's just one little thing but somehow it's like a guarantee for me especially to enjoy and liking the whole movie, and i did, i like every single second, decision, song, and act performance in this movie, Begin Again is a movie that it's not gonna go in any greatest movie list or whatever, but it's still hell of a priceless movie."}, {"rating": "6", "text": "The film has heart and the chemistry between Kiera Knightly and Mark Ruffalo is nice, but the experience one gets from watching the film is the equivalent to being on tour with an uninspired, lazy tour guide. I'm talking about that one guide who doesn't care if they get fired soon. The one who will show off the locations and attractions, but they want to get the tour done and over with as quickly as possible."}, {"rating": "5", "text": "fine movie with a really good acting and actors and an absolutely awful ending , its like the screenwriter has died at the middle of film and they just wanted to prolong it with music and then it got out of their control and they found their selves without an ending then decided to show us some part of it after the actual ending at the credits , watch it if you are bored or you are music lover but i think its not a good movie and you cant enjoy it very much if you watch it for being a good movie , just watch it as an amusing movie...."}], "recommendations": ["yesterday", "mamma_mia_here_we_go_again", "bohemian_rhapsody", "burlesque", "into_the_woods", "a_star_is_born", "the_greatest_showman", "in_the_heights", "almost_famous", "crazy_heart", "the_sound_of_music", "cats", "rocketman", "whiplash", "hairspray", "chicago", "sweeney_todd_the_demon_barber_of_fleet_street", "we_are_your_friends", "jingle_jangle_a_christmas_journey", "annette", "eddie_the_eagle", "mary_poppins_returns", "moulin_rouge", "american_hustle", "magnolia"]}