{
  "id": 4772,
  "title": "Behind Enemy Lines",
  "starring": [
    "Owen Wilson",
    "Gene Hackman"
  ],
  "runtime": 106,
  "genre": [
    "Action",
    "Drama",
    "Thriller",
    "War"
  ],
  "description": "While flying a routine reconnaissance mission over Bosnia, fighter pilot Chris Burnett photographs something he wasn't supposed to see and gets shot down behind enemy lines, where he must outrun an army led by a ruthless Serbian general. With time running out and a deadly tracker on his trail, Burnett's commanding officer decides to risk his career and launch a renegade rescue mission to save his life.",
  "releaseYear": "2001",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/fZReMWU3zszvaktDUqOoWCzHssZ.jpg",
  "categories": {
    "plot": 6.5,
    "acting": 6.333333333333333,
    "ending": 5.0,
    "soundtrack": 5.0,
    "cinematography": 7.0,
    "familyFriendly": 5.8,
    "funny": 6.4,
    "action": 5.363636363636363
  },
  "reviews": [
    {
      "rating": "10",
      "text": "fantastic film, one i could watch over and over again"
    },
    {
      "rating": "8",
      "text": "Some great action sequences and two strong central performances make this a superior blockbuster. John Moores direction is perfectly suited for this sort of fair and the critical reaction of 49 really is a bit shocking."
    },
    {
      "rating": "9",
      "text": "It has great effects and performances, but without Mr. Wilson and Hackman, it just wouldn't have been as good."
    },
    {
      "rating": "7",
      "text": "Finally a follow-up to Saving Private Ryan, its a war movie that doesn't have the guts, it has actual American-can-do spirit in it. It may be a very short movie dissapointingly but it is crafted in a way Saving Private Ryan wasn't."
    },
    {
      "rating": "2",
      "text": "This film feels like a home filmmaker was given a Holywood Budget to make an action film. The amateur editing and diecting makes the film neither realistic as a war film, nor fun as an all-out action hero/comedy film. Its something in between...and it just doesn't work."
    },
    {
      "rating": "5",
      "text": "Even though I don't consider Owen Wilson an action nor dramatic actor I believe this is his best job as of yet. Of course the movie has Gene Hackman in it, but the director manages to make you focus on Wilson. Great action scenes with very realistic effects and a good story. But overall it's just another action movie."
    },
    {
      "rating": "5",
      "text": "Reasonably entertaining but pretty stupid in parts, acting is fine and some of the action is cool."
    },
    {
      "rating": "0",
      "text": "This is bull....\"We are good they are bad\".Just remember Madeleine Albright and William Walker \"the body counter\".Just follow CIA and you start counting terrorist attacks."
    },
    {
      "rating": "3",
      "text": "i don't know you tell me, sir..Behind Enemy LinesIt is a flat exhausting line from top to the bottom with nothing promising enough to hold on except Owen Wilson."
    },
    {
      "rating": "7",
      "text": "There are some pretty good special effects and some nice landscape/panorama type shots in this movie, in that sort of sense I felt it was quite atmospheric. There are also some pretty tense and dramatic scenes that makes you keep watching it and I also noticed in use ocassionally is this slowing down effect where everything is shown almost frame by frame and you can see whats about to happen, as it slowly unfolds. So basically I do feel that the camerawork used is quite good. The part when heat seeking missiles chase the two jets is quite thrilling and makes for good viewing, its tense stuff!This is quite a political movie, so be aware of that, I can't really comment on how accurate any details may be, though I am aware of the unrest there was in this are of the world in the early 90s I believe. It is typically American in some respects, with talk of 'just getting our guy outta there and heck to the peace process'(!) you know, that sort of thing.It can also be frustrating, when the action scenes of Chris trying to avoid his pursuers, suddenly cuts back to the Navy personnel, usually Admiral Leslie McMahon Reigart, discussing his location and the chances to rescue him, as well as the political implications any such rescue may have.When there's action, though, the action is quite good and it is pretty atmospheric in places, as I mentioned briefly before, with it all taking place in a snow filled Bosnia in December. Its always nice to see Owen playing a more dramatic role, something a bit different and I think he pulls it off okay in this, although personally I do prefer his comedy roles to this, I think he's more suited to that than to these kind of roles. I can't think of anything all that bad that I can criticise him for in this role but I do feel that his gestures and his expressions and so on, just work better in more comedic roles, or perhaps its just that im more used to seeing him in such roles. Thats not to say that he doesn't play the character at all unconvincingly, I think he does quite well in it.The special effects (mainly explosions) and the camerawork is good and the actors do pretty well too (nothing outstanding but not bad), so its a pretty decent movie, if you don't mind the fact that it is so American-y and if the political edge doesn't put you off at all, otherwise I'd say give it a go, if it sounds like your sort of thing then you should enjoy it."
    },
    {
      "rating": "8",
      "text": "Tiene una trama muy simple, pero es entretenida y buena para pasar un rato agradable."
    },
    {
      "rating": "6",
      "text": "Imagine, some Saturday afternoon roughly 20ish years ago, I had just finished up watching a movie on a \"free HBO weekend\" (those were a thing) and with nothing else better to watch I started what would become one of my favorite military movies of all-time, Behind Enemy Lines. I nearly turned it off at first because it starred Owen Wilson, an actor who was in a string of annoying comedy films that I refused to watch, but I decided to give it a chance and... I'm so glad I did. While Owen Wilson jokes around on a couple of occasions, this is far from a comedy. While the setup is simple, a fighter pilot and his navigator (Wilson) go on a routine reconnaissance mission when they're shot down and crash behind enemy lines, it's what follows that makes the movie great. Gene Hackman is a commanding presence as always, and Wilson is witty and actually kinda likeable as an action star. While it's far from an Oscar award winning movie, it's still a fun popcorn flick."
    }
  ],
  "recommendations": [
    "the_equalizer",
    "angel_has_fallen",
    "2_guns",
    "shooter",
    "safe_house",
    "the_italian_job",
    "unstoppable",
    "jack_ryan_shadow_recruit",
    "the_guardian",
    "16_blocks",
    "demolition_man",
    "gemini_man",
    "haywire",
    "top_gun",
    "true_lies",
    "triple_frontier",
    "gangster_squad",
    "run_all_night",
    "hunter_killer",
    "first_blood",
    "the_last_stand",
    "the_mechanic",
    "the_gunman",
    "contraband",
    "kate"
  ]
}