{"id": 4821, "title": "Beirut", "starring": ["Jon Hamm", "Rosamund Pike"], "runtime": 110, "genre": ["Action", "Thriller", "Drama"], "description": "In 1980s Beirut, Mason Skiles is a former U.S. diplomat who is called back into service to save a colleague from the group that is possibly responsible for his own family's death. Meanwhile, a CIA field agent who is working under cover at the American embassy is tasked with keeping Mason alive and ensuring that the mission is a success.", "releaseYear": "2018", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/s2qIeFsI9TskZr1LkSwljQDh5nl.jpg", "categories": {"plot": 6.380952380952381, "acting": 6.1875, "ending": 5.0, "soundtrack": 5.0, "cinematography": 6.0, "familyFriendly": 3.0, "funny": 2.0, "action": 5.5}, "reviews": [{"rating": "8", "text": "Solid, fast paced, intelligent thriller set in....Beirut. Hamm as a washed up Diplomat soused and wasting away his life gets a reprieve to go back to Beirut and right the ship. Being Lebanon the issues are multi complex and it helps to know the territory. Pike is as good as always and with that pairing a display of pulchritude for both sexes. It'S an equal opportunity array of digs at all political sides and no-one should walk away feeling too maligned. It took me an hour to recognize Dean Norris, courtesy of a wig, which was good since his character was imprinted before I was able to have a \"Breaking Bad\" deja vu moment."}, {"rating": "2", "text": "Most notable thing in Beirut is Dean Norris: as a huge fan of Breaking Bad,I knew this solid american actor as \"Hank\", one of the most important characters of the show. Seeing him performing in Beirut with a wig was quite a shock, but an hilarious one, haha! I will only remember the movie for this bit."}, {"rating": "8", "text": "A really good movie, 8.5 actually, one of the best I've seen this year, with an actual plot that requires more than one brain cell to follow. Refreshing. And Jon Hamm does a great job. This is a grossly underrated thriller."}, {"rating": "6", "text": "Jon Hamm gets his first leading film role as a US diplomat who's called back to the titular city to negotiate a prisoner exchange. He does a good job of staying on top of Tony Gilroy's continuous dialogue. But unlike the \"Bourne\" films the writer is know for, this is much more about political conflict and intrigue than action (there are only very short, minor action scenes). For someone who's not familiar with the historical importance of the events in the 80s Lebanon (like me), the complexity of the machinations and layers of leaders may sometimes be confusing. Still, the film moves briskly and makes sufficient sense to keep it involving. It helps that Hamm's performance provides a strong central core."}, {"rating": "5", "text": "Hamm is solid and the film looks like it actually takes place in the 1980s, but through a large chunk of the runtime it's just a bore to sit through..."}, {"rating": "7", "text": "A generally good film with an interesting beginning and end, but with a dull, repetitive middle. Jon Hamm and Rosamund Pike were excellent as was the rest of the cast. My guess is that the problem was with the direction. The state of Lebanon is very sad but showing long shots of the ruins over and over again made the film seem dull, regardless of the good acting. I think the director could have varied the shots more, since too often he seemed to be showing the same colorless ruins over and over again."}, {"rating": "8", "text": "Just a solid ass movie.Jon Hamm doing that thing again where he makes a great movie and it's too good for everyone to go see."}, {"rating": "3", "text": "I really wanted to like this movie for the sake of Jon Hamm and Rosamund Pyke, but I just couldn't do it.  The most exciting scene is the first 10 minutes, and it is all downhill from there.  The plot is garbled and boring, and it has nothing more to offer than the average movie about low-key espionage in the middle east--an outsider swoops in with limited experience, has a few drinks, and manages to solve unsolvable problems in a way that isn't at all believable.  The script felt like a disappointing waste of the lead actors' talents.The best thing about the movie, to me, was the absolutely beautiful and desolate shots of the city and people's lives there.  The more interesting stories seemed to be at the edges--what were the people who stayed there doing?--rather than the center of the film's focus."}, {"rating": "8", "text": "Underrated movie, driven forward by a twisting but reasonably grounded plot, taken to the next level by consistently strong performances all around. A movie for grownups - the previews included a comic book movie and a Harry Potter movie, if that is your usual speed you will probably complain this film is slow and boring."}, {"rating": "6", "text": "a brief depiction of the actual side of the coin..BeirutThe premise is familiar to the audience and walks on the usual structure that may be off putting, but since it is to-the-point, fast paced, gut-wrenching tale of an underrated bravery of a middle-aged man looking for a closure, it works just fine. It is short on technical aspects like sound department and the camera work, although it is finely edited. The screenplay by Tony Gilroy is gripping and adaptive, if not smarter as it should be, its \"safe play\" does pay off if considered the bigger picture. Brad Anderson; the director, has done a decent work on depicting such a dark, raw and brutal world where his character revolves around and is utterly palpable to its tone even though it is extracted from one's typical textbook formula. Jon Hamm delivers on performance level as much as he could but unfortunately the protagonist is undercooked and the supporting cast like Rosamund Pike and Shea Whigham doesn't get much range and room to factor in. The primary reason it works despite of such flaws is that it takes lesser time to make its point and keeps the audience engaged in this character driven feature which is quite difficult to do so. Beirut is a brief description of the actual side of the coin, no matter how inedible and dark it might get for the audience, it certainly is electrifying at its peak."}, {"rating": "6", "text": "Considered an espionage thriller without a lot of showcasing of the actual espionage this films spans a decade between events surrounding diplomat Mason Skiles (Jon Hamm) which first causes him to leave Beirut and events that force him to return a decade later during the Lebanese Civil War between 1972-1982. Directed by Brad Anderson (The Machinist & Session 9) in his biggest budget film to date.Written by Tony Gilroy who has had a hand in many films (Rogue One, Nightcrawler, Duplicity etc) is always able to add a good deal of human element to characters. Cast wise this film stars the incomparable Jon Hamm and very talented actress Rosamund Pike who traverse their way through the war torn streets of Beirut to track down his friend and CIA officer Cal Riley who’s been kidnapped and knows a lot of valuable info about day to day operations. Without giving away any story Mason Skiles runs into a lot of familiar faces on his way to trying to find his friend and gets a crash course on all that’s happened since he left ten years prior.‍‍‍‍‍‍I enjoy‍‍‍ these types of films because they really do put another lens on how dangerous the rest of the world can truly be and how circumstance changes a lot of lives in an instant. With great acting, just enough action and just enough education these are films that definitely widen a perspective on our relations with other countries."}, {"rating": "5", "text": "Beirut is a good cast waiting for something interesting to happen. Hamm is in fine form despite the so-so script."}, {"rating": "8", "text": "Jon Hamm was excellent in showing a compassionate man with weaknesses, yet maintaining his morals. Rosamund Pike is always reliable in making her characters interesting. The story was thought provoking on how a beautiful city like Beirut was destroyed. That there might not be an answer until there are drastic changes made by the people who live there. What a waste of people’s lives that they can’t resolve the tragedies still occurring today. I didn’t find this story boring at all and wished we had an answer."}, {"rating": "6", "text": "One thing that bugs me about so many films with serious subject matter is the tendency to over use \"darkness\" to convey the mood. (Or rain, but not in this case.) Everything in shadows or washed out, even scenes in regular office spaces that no doubt are well lit. Very few films in this genre dare to let the action take place in daylight -- which to me makes events more terrifying. An ordinary day, then ka-boom. This film was so (physically, environmentally) dark, with even people's faces in deep shadow 9/10ths of the time. Just made me want to nap. While this was Hamm's film & he was good, the story could have been far more interesting to have more development in the characters -- such as the 13 year old's transformation to his adult role -- what happened, how, etc. Same with Rosamond Pike's character -- just give me some insight into how she ended up there. Even Hamm's alcoholism seemed shallow & just a device -- why not have it affect his judgement or otherwise really interfere or shape his actions. Everything he did seemed to work out just fine. I did like that the story seemed to unfold realistically but it walked the line between verite & tedium at some points. There were moments of intrigue & thrills, of course, but over all this treatment just left me feeling blah."}, {"rating": "8", "text": "Very decent suspense thriller, good story and good acting. Well worth seeing."}, {"rating": "8", "text": "The writing here is extraordinary, with never a lag and brilliant twists I didn't see coming, as well as the avoidance of what we've come to expect in movies where they \"bring in the skirt.\" And the script is perfectly served by first-rate acting by Jon Hamm; I can't imagine anyone else in this role. He brings a depth of layers to this character, with a sense of himself that's almost startling. This movie deserves far more attention than it seems to be getting."}, {"rating": "7", "text": "A capably made though not overly engaging geopolitical thriller about the complexities of life in Lebanon in the 70s and 80s. While the film does its best to explain the intricacies of Lebanese politics and US relations with the Middle Eastern nation, the film unfortunately tends to get a little bogged down in its own attempts to sort them out for the viewer while telling an intelligible story. The writing is reasonably solid, if a bit glib at times, and the performances are strong, though not especially memorable. Wait for the DVD."}, {"rating": "6", "text": "Happen to agree with some fellow critics. Lead role by Hamm was well done but the film seemed to slow down throughout causing me to phase in & out. Filming was above average. Almost graded in green but my periodic boredom with the story prevented me."}, {"rating": "8", "text": "I liked it. Time considerations prevented any introduction to the country's history so the viewers had to dive in. Hamm was a great choice for this role and overall, good cast. Scenery showed a city that had been ravaged by a civil war. You could get a sense of the danger driving or walking around. It had a good plot and the pace of the film was good. Sort of an Argo type of movie. It was darkly shot and sometimes difficult to decipher good and bad guys. Maybe that was the point. Hard to determine which was which. Historically Israel did invade a year after this story took place."}, {"rating": "0", "text": "Je ne cacherais pas que la seule raison que j'ai eu de regarder ce film -ou de tenter de le regarder plutôt- c'est Rosamund Pike, la très charmante blonde... qui peut sévèrement piquer de temps en temps et avec grande conviction (cf Gone Girl !)... Hélas, elle est ici cantonnée à la portion congrue, voire quasiment l'insignifiance ou la simple fairevaloir de l'autre blaireau (Jon Hamm) lequel -je ne le cache pas- ne m'a pas convaincu du tout.Mais en dehors de ces contingences plus ou moins gênantes (déjà) c'est surtout l'histoire peu crédible, le scénario pas croyable et l'ensemble du sujet très rebutant pour ne pas dire simplement chiant et ressassé à l'envi de cette stupide (le mot est faible; très faible) guerre de religions millénaire(s) dans ce moyen-orient de cinglés...J'en ai personnellement mais très personnellement rien mais vraiment rien à secouer, alors tout un film là-dessus et notamment sur le Liban (ancien protectorat français, c'est de l'histoire très ancienne) j'en ai rien à cirer non plus et je m'en tamponne le coquillard en force. Tout cela pour dire que ce film -qui se traîne carrément trop de toute façon- n'a aucun intérêt, ni présent, ni passé, ni futur, y compris en avance rapide de sa mère."}, {"rating": "7", "text": "So here's the plot. A united states diplomat had a perfect life in Beirut, which is a pool of death. He has adopted a kid that turns out to be the brother of a highly sought after terrorist. The brother takes the kid, and in the process the diplomat's wife gets shot and killed. Dandy right?The diplomat then moves back to the US, being traumatized i guess, and starts a career in drinking and being a negotiator. Then, 10 years later, the kid has become a terrorist too, and kidnaps a United States spy to trade for his super terrorist brother. And then the cat and mouse game begins.Though i initially thought the movie was going in a very cheesy direction, i was actually quite entertained. The location, background and situation is sufficienctly layed out, and the characters act human. Though the main character is not relatable, he does carry his weight and makes stuff happen. Without going in further detail, it's an okay movie. I feel like they could have taken it further with the ties to current events in Israel and Libanon at the time, but this will do.I give it a 7/10."}, {"rating": "7", "text": "A clever thriller that has it's flaws but is carried by the perfectly cast Hamm."}], "recommendations": ["widows", "a_most_violent_year", "the_good_shepherd", "the_accountant", "allied", "a_most_wanted_man", "good_time", "child_44", "sicario_day_of_the_soldado", "the_equalizer_2", "flight", "donnie_brasco", "hell_or_high_water", "news_of_the_world", "the_rover", "white_boy_rick", "the_infiltrator", "the_beguiled", "the_place_beyond_the_pines", "the_sum_of_all_fears", "broken_city", "stillwater", "argo", "sicario", "arbitrage"]}