{"id": 3811, "title": "Belfast", "starring": ["Jude Hill", "Caitríona Balfe"], "runtime": 98, "genre": ["Drama"], "description": "Buddy is a young boy on the cusp of adolescence, whose life is filled with familial love, childhood hijinks, and a blossoming romance. Yet, with his beloved hometown caught up in increasing turmoil, his family faces a momentous choice: hope the conflict will pass or leave everything they know behind for a new life.", "releaseYear": "2021", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/3mInLZyPOVLsZRsBwNHi3UJXXnm.jpg", "categories": {"plot": 6.5, "acting": 7.2631578947368425, "ending": 6.571428571428571, "soundtrack": 6.2, "cinematography": 7.333333333333333, "familyFriendly": 6.0, "funny": 7.571428571428571, "action": 5.0}, "reviews": [{"rating": "6", "text": "Belfast is an idyllic idealization of a bygone era, taking us back in time in a way that looks quite fine. So far, so good.Everything looks great, but this is a tale in which Kenneth Branagh seems to have fallen too much in love with Alfonso Cuarón's ''Roma'', and also falls into clichés that turn his well-crafted film, and personal story, into a flat adventure, that lacks dramatic momentum and gets a bit incoherent at times.Not that it doesn't have more than one compelling narrative component, but none of them propels Belfast far enough to create a lasting impression.It all looks awesome, but like Cuarón's ''Roma'', there's nothing profound behind the façade."}, {"rating": "5", "text": "I appreciated the performances, but the direction and story are pretty inconsistent. Would be surprised to see this genuinely competes for Best Picture…"}, {"rating": "5", "text": "Focuses on a young boy coming of age in 1960s Ireland with his family. Filmed in black and white and directed by Kenneth Branagh, this is a semi-autobiographical film based off his upbringing. And while it most certainly comes off as quite a love letter to the city he grew up in, none of it feels wholly remarkable or original, and despite only clocking in at a little over an hour and a half, it still manages to feel drawn out. Really, the best way I can describe this film is that it feels like an Irish 'Roma'. It just felt rather derivative for my liking. Granted, the film's not without its charming moments, and the cast (particularly Caitriona Balfe and Dame Judi Dench) all give great performances, but none of that's quite enough to overcome a rather pedestrian, forcibly sentimental, and straightforward-feeling film that basically just felt like nothing more than Kenneth Branagh's 'Roma'."}, {"rating": "8", "text": "É um filme goatoso de assistir, embora lento em algumas partes, você se sente parte da família."}, {"rating": "6", "text": "“Belfast,” the new film by writer/director Kenneth Branagh (who starred in the “Wallander” TV series, various Shakespeare productions on stage and screen), is a love letter to his childhood home filmed in black-and-white.  The film is set in 1969 in the midst of the Troubles between Catholics and Protestants in Belfast.  But for eight-year-old Buddy, armed conflict is a secondary backdrop to much more important matters:  swooning over the smartest girl in his class, watching US-made Westerns, going to the cinema.  Armed with a cardboard sword and a trash can shield in the opening scene, Buddy frolics in his mixed Protestant-Catholic neighborhood where everybody knows, and takes care of, everybody else.Branagh’s consistent use of Buddy’s point of view is the film’s greatest strength and also its weakness.  The film is thoughtful, sweet and earnest.  But this consistent use of a child’s perspective blurs and blunts the jolting realities surrounding Buddy, who is insulated by his watchful parents and nurturing neighborhood.  The storyline is slight.  It centers on a series of seemingly random remembrances by Branagh about his childhood.   (In case anyone wonders whether Buddy is Branagh, there’s a brief scene of Buddy reading a “Thor” comic book.  Branagh directed the film by the same name in 2011.)  The only creative tension is whether the family will join Pa in England, where he is employed on a construction project. (Branagh’s father was a plumber and carpenter.)  Even so, there’s plenty of material to celebrate a love of family, to seed the suspicion that there’s a much larger world out there and to experience the sad wistfulness of loss.Despite the flimsiness of the storyline, several elements make this film a must-see.  First, Branagh has assembled an amazing ensemble of actors.  Judi Dench (one Oscar, 67 total awards, 179 award nominations) and Ciaran Hinds (a veteran character actor and Belfast native) are excellent as Buddy’s grandparents.  Caitriona Balfe (“Outlander’) and Jamie Dornan (apparently used to being portrayed in shades of gray) are stellar as Ma and Pa.  In his first feature film, nine-year-old Jude Hill (Buddy) is simply amazing.  His energy, enthusiasm and wide-eyed innocence will totally capture any moviegoer with a soul.  Showing his nascent dramatic range, Hill convincingly inhabits the role of an eight-year-old.Second, Belfast native Van Morrison provides the dramatic, energetic score.  The soundtrack blends familiar tunes with striking new songs that open and close the film.  Throughout, Morrison provides an ideal texture for this piece.  Finally, the cinematography of Haris Zambarloukos (“Death on the Nile,” “Locke”), who seems to revel in stark nighttime imagery, further elevates this film.The epigram at the end of the film reads “For those who stayed.  For those who left.  And for all the ones who were lost.”  It’s an excellent summation of Branagh’s desire to be all-inclusive in his nostalgic tribute to an earlier, simpler time – that actually wasn’t."}, {"rating": "6", "text": "Há quem diga que todo diretor tem um filme pessoal e autobiográfico durante sua carreira, mas eu acredito que, quando não há muito o que dizer, você realmente não precisa fazer um.E aqui temos um exemplo do porquê... \"Belfast\" é superficial, caricato e raso, especialmente para um filme que é descrito como pessoal e íntimo pelo seu diretor, Kenneth Branagh.Boa parte do lado positivo de \"Belfast\" está em seu elenco, e ele inclui a sempre lendária Judi Dench, presente no melhor diálogo do longa, e o protagonista Jude Hill em uma estreia incrível, na qual literalmente carrega o filme em suas pequenas costas, principalmente quando o roteiro puxa para o humor.Mas não há muito o que dizer durante os seus 97 minutos de duração, mesmo que muita coisa esteja acontecendo na tela - e isso inclui explosões, furtos e morte -, você não se apega de verdade à narrativa, ainda que dê um sorriso de canto de boca aqui ou ali.Só tirem a Judi Dench de casa para bons filmes, por favor."}, {"rating": "6", "text": "The love and care that was put into Belfast is evident. A personal and heartwarming story from Kenneth Branagh that captures childlike wonder during challenging times. Beautifully shot and performed, but I can't say it didn't feel fairly bland and shallow overall. It lacked the depth and intrigue needed in order for it to stand out or resonate."}, {"rating": "0", "text": "Kenneth toma vergonha na cara, que filme raso e bait oscar é esse? Jesus cristo"}, {"rating": "6", "text": "Has some touching moments but for a story centered around violent sectarian conflict, this film has essentially no bite to it at all. Maybe wait for it to come to streaming if you want some warm fuzzies one night. Overall pretty forgettable with an almost disrespectful amount of Oscar-bait shoved in. Kid was pretty good though."}, {"rating": "0", "text": "A pastiche of better films packaged in monochrome to try to sell it as art. Treacle."}, {"rating": "10", "text": "what's not to like about this film... that it's not political enough.... really bad reason... it's great..."}, {"rating": "0", "text": "This film suffocates traumatic events in history with a wistful, safe icing of nostalgia. Made for those who want to escape and not bother thinking"}, {"rating": "9", "text": "I thought this was a great balance between history and personal narrative, honestly. You're learning about Belfast during the Troubles, but you're also seeing a beautiful and very realistic (imo) depiction of a family living their lives."}, {"rating": "1", "text": "I found this such a trite film. Every trick in the book was used to make the audience love it. The lovely moments and there were a few, were completely quashed by its desperate need to please - the Van Morrison songs were the worst offenders. Ciaran Hinds though was marvellous!"}, {"rating": "9", "text": "BelfastThe cast was phenomenal, and newcomer Jude hill gave a splendid performance that he was the one submitted for the best actor category for the Oscars from the cast while others get supporting noms (for a young boy of 11, that's sure a great feat).Belfast was all the right doses of pathos, warmth, and sweet comedy all circled in trepidation, unrest and dilemma.The alternation between black & white and colour was perfectly blended, with a thoroughgoing approach that helped heighten or aid intimacy, depending on the scenes. The score was flawless.Easily one of the best movies of the year, and deserving of all the awards it's garnered so far."}, {"rating": "10", "text": "Belfast felt like a big, snuggly hug. Has been a long while since we've had the pleasure of experiencing such an emotionally resonant movie going experience. You have a winner here Kenneth Branagh!"}, {"rating": "0", "text": "It's a pretty balloon. Enjoyable enough but schmaltzy and over-sentimental—completely empty. Why did I watch this?"}, {"rating": "8", "text": "While writer-director Kenneth Branagh’s latest offering might not always feel as fully fleshed out as it could have been, for what’s here, this semi-autobiographical memoir about the filmmaker’s challenged upbringing in this troubled Northern Ireland city hits all of the right notes and does so in a thoughtful, entertaining, well-balanced manner. The film, which comes across like a fusion of director John Boorman’s “Hope and Glory” (1987) and the nostalgic TV series The Wonder Years, tells the story of a sprightly young lad attempting to grow up as normally as possible in the face of a senseless religious-based civil war that began in 1969, one in which a once-peaceful, harmonious working class community is torn apart by forces that have no business intruding on the lives of good people trying to lead productive and cheerful lives. Told from the perspective of its youthful protagonist, “Belfast” plumbs material that many viewers can easily relate to – family dynamics, first loves, the joy of community and the endearment of adoring grandparents. Admittedly, there are times when viewers are left somewhat wanting for a little more dramatic depth, but the finely penned screenplay nevertheless delivers more than its share of emotionally touching moments and gentle humor, as well as evenly paced, well-developed treatment of its various story threads, all of which are suitably wrapped up by film’s end. All of this is beautifully brought to life by the picture’s superb black-and-white cinematography, its lively and fitting Van Morrison soundtrack, its skillful, sensitive direction, and the excellent performances of its fine ensemble cast, particularly newcomer Jude Hill, Irish actress Caitríona Balfe, and veterans Judi Dench and Ciarán Hinds. It may be tempting to label this a feel-good movie, but that’s too glib considering the backdrop under which the story takes place, one that gives the picture an edge and serves as a constant reminder of what can lurk in the underbelly of our reality no matter how otherwise pleasant our existence may seem."}, {"rating": "6", "text": "It was ok movie, but I think it didn't show enough also about the story what was happening around. It is sort of told in the way of the boy's eyes, not seeing why or what is really goin on. It's ok movie, but for me missed something"}, {"rating": "10", "text": "Belfast te ofrece un viaje de sinceridad, sentimientos y el reencuentro con nuestras emociones, y como tal cumple perfectamente de la mano de un apasionado niño que nos enseña su entorno y vida familiar de manera enternecedora, no cabe duda que es una de las mejores películas del pasado 2021."}, {"rating": "9", "text": "BELFAST triumphs as heartwarming story of family love & survival in tumultuous times of religious strife between Protestants & Catholics in 1969 Northern Ireland. The film is an autobio written & directed by actor Kenneth Branagh based on his own early childhood in Belfast. The movie is told from the point-of-view of 9 year old Buddy, played by newcomer Jude Hill, whose luminous performance & angelic face steals the film. Equally excellent are his Pa & Ma, actors Jamie Dornan & Caitríona Balfe & his grandparents, the exquisite Dame Judi Dench & the marvelous Ciarán Hinds. Through Buddy, the audience watches as the family manages to survive their Belfast neighborhood through religious clashes & violence, their own financial struggles, ultimately leading them to move to London & start a new life. BELFAST is beautifully shot, primarily in black-and-white, by long-time Branagh collaborator, cinematographer Haris Zambarloukos, featuring strong production design by Jim Clay."}, {"rating": "9", "text": "A very well done soon on a coming-of-age story that is both a dedication and reflection to the time period it is set."}, {"rating": "7", "text": "Well, Streamers, we have a review of another black and white film for you this week - Kenneth Branagh's Belfast. The release of Belfast this month was well-positioned for both awards buzz as well as family entertainment. Let's see how it does on both fronts.Kenneth Branagh wrote and directed Belfast drawing from his childhood memories of growing up in Northern Ireland. The film centers on Buddy (Jude Hill), a precocious kid, growing up in Belfast in the midst of growing turmoil between Protestants and Catholics. Buddy's family is entrapped by the danger on their street and are tested by their financial hardships. Buddy's Ma (Caitriona Balfe) holds down the fort and tries to protect Buddy and his brother while Buddy's Pa (Jamie Dornan) is working in England and only returns home every two weeks. Buddy's grandparents also have a prominent role in the film. As tensions grow between the warring factions, Buddy's family has to make a decision about whether to stay in the only home he's ever known or whether to escape to a safer situation.The storyline of Belfast is simple but effective. Branagh focuses on the care and affection these family members have for each other and their desperate need to protect each other. The film uses its black and white cinematography to evoke that feeling of memory and the music throughout mimics the emotions that permeate the tensions in the movie. Maybe I'm too ignorant, but I did not understand what the conflict was between the Protestants and Catholics and why it was so violent in Belfast at the time. Buddy must not either since the film is told from his perspective and we don't get much explanation about that. Nevertheless, the coming-of-age drama hits the marks one would expect and Branagh clearly has an emotional connection to the material that is conveyed in each frame.My biggest issue with Belfast is Jude Hill. He's just alright. Sometimes child actors suffer trying to carry these types of films. Roman Griffin Davis did a great job anchoring Jojo Rabbit. Alan Kim was pretty good in Minari. Remember Haley Joel Osment in The Sixth Sense! Jude Hill is no Haley Joel. Sorry, Buddy. He doesn't ruin the movie, but either another actor needed to be cast or the focus should have been more on the adults. Both Caitriona Balfe and Jamie Dornan give good performances that add emotional weight to the film. You get more of the stakes from Balfe and Dornan than from Hill. Maybe that's asking too much of the kid.Ultimately, I understand why Belfast is an Oscar hopeful. It has a sentimental story that plays on the emotions with good performances from the adult cast. Despite my reservations about Jude Hill’s performance, the otherwise simple story hits the marks of this kind of drama. It’s a good movie, but I wouldn’t call it any better than these other coming-of-age family dramas. Get a bowl of popcorn for a Sunday matinee since it’s only in theaters."}, {"rating": "6", "text": "admirable[ ad-mer-uh-buhl ]adjectiveworthy of admiration; inspiring approval, reverence, or affection."}, {"rating": "10", "text": "A serious contender for Film of The Year. Branagh's Belfast is a deeply affecting, expertly crafted film that is simply unforgettable. Jude Hill is going to be a huge star."}, {"rating": "10", "text": "Not since Slumdog Millionaire has a film enraptured me like this. A beautiful Screenplay coupled with Kenneth Branagh's mastery at Directing, Belfast is absolutely one of the Best films to come out of the UK."}, {"rating": "10", "text": "Full of heart and expertly crafted, Belfast is the film we need right now. Everything from the wonderful Screenplay, to the amazing performances from the cast makes for a very special movie watching experience."}, {"rating": "5", "text": "Your regular safe film that probably will win big at the Oscars. Kenneth Branagh invites us to take a trip through memory lane with 'Belfast,' a semi-autobiographical account of his childhood in the city of the same name during the beginning of The Troubles. Of course, this is a very personal exercise in which Branagh capitalizes nostalgia with a tale about family and coming of age. But unlike 'Roma,' 'Licorice Pizza' and 'The Hand of God,' the result is a bland film that sure has good acting and tender moments but fails at making you feel the tumultuous time in which the story is set. The best part: Ciarán Hinds' Pa, the only character that resonated with me."}, {"rating": "5", "text": "You can tell it was a deeply personal film but being personal doesn't make it gripping or interesting, no matter how good the performances are. Belfast may not leave much of an impression but I don't think people would hate it if they watched it."}, {"rating": "6", "text": "A sweet peek into the origins of one of Hollywood's most successful multi-hyphenates, what \"Belfast\" seems to lack in intrigue or dramatic bombast, it makes up for with genuine tenderness and sincerity. I cannot, for the life of me, pin down why I didn't like this movie more. The truth probably lies somewhere within the \"what 'Belfast' seems to lack in intrigue or dramatic bombast\" portion of the above, as I genuinely did find my interest in things stalling every now and then, acquainting myself with the clock on my phone more times than I would've liked. I'll say that I reckon this lack of investment more so comes from the sort of \"two ships passing in the night\" phenomena that'll sometimes happen between me and a perfectly fine movie; one of those ships being the movie, the other being my specific preferences as a filmgoer. Still, I'm happy Branagh has a movie like this under his belt, as it's always good seeing a filmmaker use the medium to make sense of themselves/a part of their life/etc. Just wish I could've been as wowed as so many others."}, {"rating": "5", "text": "This movie hits all the right notes. Acting, directing, script, photography, etc. but still comes up short.  I fast forwarded through it to get to the end because i never identified with any of the characters or their problems.  In the end i just didn't care about them."}, {"rating": "6", "text": "\"Go. Go now. Don't look back. I love you, son.\"'Belfast' offers a great message about never forgetting where you're from. This is a personal project from Kenneth Branagh, as this film is based on true story events from his childhood. The movie is made with love, passion, and soul.You could say it's 2021 'Roma', although not as brilliant as it could've been. I can't put my finger on it, but something felt missing from this. This could've been masterful, but it wasn't, in my opinion. Again, I'm sure why.I mean, all the performances here are the strongest element of this movie. Newcomer Jude Hill delivered a great performance, especially for his age. Caitriona Balfe and Jamie Dornan were both fantastic. Judi Dench and Ciarán Hinds, both play an old couple, were so sweet and charming together that it never fails to make smile.The black and white cinematography was good, as it has that old nostalgic \"blast from the past\" vibe to it. But film making wise, it wasn't anything too impressive.The scene towards the end where Jamie Dornan sings a cover of Everlasting Love was something special. It made it more special seeing Caitriona's face when she lifts her eyebrows and smiles at the man she loves, and the way he smiles back at her. It was **** beautiful man.Judi Dench final line in the movie stuck with me the most. Short, but moving."}, {"rating": "10", "text": "A semi-autobiographical account from Kenneth Branagh, Belfast really is as good as you've heard. I will not be surprised if this clears up at awards season and it deserves every one of them.Buddy (Jude Hill) is a young boy living in Belfast in the late 1960s with his brother Will (Lewis McAskie) and their mother played by Caitriona Balfe. Their father played by Jamie Dornan travels overseas to work and is often away for long periods of time. Buddy is preoccupied with the normal problems of an 11-year-old all while trying to make sense of the violence happening around him during a hugely turbulent time in Belfast. Similarly to how Jojo Rabbit handled the trauma of war from a child's perspective, Belfast finds the balance between light-hearted humour and tragedy. It's funny and highly emotional. If you're the type to cry easily at movies then you may need to get the tissues ready.Jude Hill is the shining star in Belfast, you can't help but love him, he's absolutely wonderful. Stand out performances also include Caitriona Balfe, Judi Dench and Ciáran Hinds. Director Kenneth Branagh certainly knew what he was doing when he gathered the cast for Belfast. Everyone is absolutely brilliant it's easy to see how this could do very well in awards season, even Jamie Dornan who can almost be forgiven for that horrendous Irish accent in Wild Mountain Thyme. Beautifully directed in black and white with the use of colour where appropriate. I loved the references to older movies and the excitement in Buddy's face during his cinema trips. It perfectly captures the pure magic of cinema and the sense of losing yourself in a movie by completely shutting out the world around you no matter how bad things seem. Highly recommended for everyone, Belfast is not to be missed."}, {"rating": "10", "text": "An introspective story with certain biographical touches. The plot that reflects the simplicity of childhood in troubled times is stimulating enough even for the most indifferent tastes. Kenneth Branagh should be considered, for the already approaching awards ceremony, as more than a dark horse."}, {"rating": "2", "text": "Completely boring , acting is completely unrealistic, there is no drama no tension. Typical tropes to be considered an “Oscar” movie. Black and white, old movies playing on the tvs, annoying close up. Only like 3 locations, a house a street and a school.   All in all very lame , boring and really no tension or anything whatsoever. Was em the whole issue was that the family had to move to uk ? Was that really a big deal? Honestly disappointing"}, {"rating": "5", "text": "As an Irish American (bona fides - mom was born and raised in Wexford County), I was really looking forward to this. Kenneth Branaugh is a treasure and after seeing him on Bill Maher talking about how autobiographical the movie was for him, I couldn't wait. Though I'm not a fan of the Oscar's, at least there'd be a film on the roster for best pic that I could totally get behind, right? Wrong. While beautifully filmed and acted, I found it kinda smarmy. A number of films are better depictions of \"the troubles,\" where they're just a backdrop for this slice of life, though they are the impetus for his family move. Add the music video, happy ending, and it left me disappointed. So many better Irish films out there. This has the bitter taste of \"stage Irish\"."}, {"rating": "4", "text": "(Mauro Lanari)The story of 9-year-old Buddy, his family and his social context is hurried, hasty and badly sketched, the \"amarcord\" of Branagh is \"an easy film that tries to be difficult, with good intentions at times so evident that they grossly capitulate in the caption and in any case with a too blatant claim to make a mannerist work\" (Bruno Surace). \"Lacking substance, it remains relentlessly embedded on the surface; leveraging on good feelings and nostalgia for an abstract past, it falls into the trap of the inevitable excess of style\" (Beatrice Fiorentino). Shrewd, panderer, simpering: designed to hoard Oscars, it collected only one."}, {"rating": "8", "text": "This is a charming film, with a real sense of nostalgia about it, even though it is set in the troubles and so there are some scenes featuring violence and mention about the Catholics vs the Protestants etc. of course. It features some pretty decent performances from a solid cast, including Dame Judi Dench, Jamie Dornan and Caitriona Balfe (of 'Outlander' fame), among others. The main character is a young boy called Buddy, a young grandson (well played by Jude Hill) who his granny, played by Judi Dench, spoils and tries her best to help advise etc. Its very much a film showing things through the eyes of said child and focussing on the innocence of childhood. I wasn't surprised to hear its based on the director, Kenneth Branagh's memories of his childhood in Ireland. Its clear he has great nostalgia for the place and time - understandably so.There are some quite amusing moments. One quote I particularly enjoyed goes as follows - 'There's nothing wrong with an outside toilet, son - apart from on an airplane'The film is in black and white, giving it a real timeless feel, I suppose. I also thought the soundtrack was particularly good (primarily featuring Van Morrison). It adds to the overall pleasing warmth feeling the film carries - it may be a black and white film but it does have some really reassuring warmth to it. That's all I can think to say to describe it. Suffice to say, yes, I'd recommend this film."}, {"rating": "4", "text": "Just because Branagh based this on his early life doesn’t automatically mean he can translate those experiences into a compelling narrative. He tries to comment on The Troubles by filming good actors in pristine clothing with B&W stock. But the decision to shoot the pic without color is baffling – a meaningless gesture that has zero relevance to the film’s themes. Performances are solid but go nowhere in a plot that has no actual scenes, just events – consequently, the first minute of the movie feels exactly like the last."}, {"rating": "8", "text": "A swell little film, this.I may not have a connection to the events portrayed onscreen, but 'Belfast' is - despite the not so good true events that it's retelling - is a pleasant film to watch. With a perfectly timed length of around 90 minutes, this 2021 flick holds a lot of heart - it's also rather funny, it had me laughing a fair number of times.The star of the film is undoubtedly youngster Jude Hill, who is an absolute joy in the role of Buddy - some performance from the 11-year-old! Buddy's connections with every single character are lovely, especially with those played by Ciarán Hinds and Judi Dench - wait... that was Judi Dench?! I legit didn't even notice until the end credits, which shows how convincing her performance as a Northern Irish grandmother is... or perhaps I need my eyesight tested, who's to say.Jamie Dornan and Caitríona Balfe also merit props, in what is a very good release from Kenneth Branagh & Co. The target audience, along with others of course, will adore it, I'm sure. Also... love the choice of black-and-white, fwiw."}, {"rating": "5", "text": "This is not a dramatic film. There is no narrative tension, conflict (other than that involving \"The Troubles\" subject matter, which we know about) or much depth of character. In the nicest possible way it is music video, mainly for Van Morrison, and several scenes are driven, or constructed, to some of his songs. There are also references to song titles in the dialogue, not just Van Morrison's and lyrics from other artists' songs in the dialogue. Branagh is trying to see how far he can go dropping lyrics and song titles into this film without anyone noticing. I'm surprised no-one has mentioned it. Once you realise that this is musical love letter you won't be wondering, as I did, why this is so predictable and lacking in any suspense."}, {"rating": "2", "text": "An offensive and manipulative depiction of one of the most traumatising conflict in recent history."}, {"rating": "9", "text": "Honestamente, me encantó, y me encantó porque es una película honesta consigo misma, muy bonita de ver, muy bien narrada a través de los ojos de un niño, las actuaciones más de lo mismo, te hace empatizar desde el primer minuto, con toques de auténtica brillantez, como el uso del color (la peli es en blanco y negro) en momentos puntuales, sobre todo la fotografía y la composición, sin olvidarme de la magnífica dirección, sin duda, una historia a recordar.· Cosas buenas: la dirección y la fotografía es de maestría, la historia me encanta, y el casting acompaña súper bien. Tiene ideas cinematográficas sublimes, como el uso de color el momentos clave, la banda sonora más de lo mismo, los diálogos son muy buenos, es emotiva y rebosa un amor al cine y al teatro muy chulo.· Cosas malas: al estar narrada por los ojos de un niño, hay momentos de demasiada idealización que puedes llegar a no creerte o que parezcan falsos, nada muy relevante.· Conclusión: es una película muy honesta y humana, muy bien contada, y para mí, la candidata principal al Óscar."}, {"rating": "6", "text": "A friendly movie, but nothing else. It has some charming moments and nice performances and the cinematography is remarkable, although sometimes it tried too hard to be \"pretty\" that it was a bit too much for me. It definitely is enjoyable, but overall it fell short."}, {"rating": "8", "text": "Życie, świat i wydarzeń historyczne przedstawione z perspektywy młodego chłopca i jego rodziny przyjemnie się ogląda a miejscami ociepla serce są miłością"}, {"rating": "9", "text": "Buddy from Belfast touched me like so few movies can.  When you can see yourself, and find out the world can hold some dark secrets, it's heartbreaking. Is it whoreishly sentimental?  Yes. But in a good way.  The Catholic/Protestant conflict was bigger than whatever church you belonged to. A lot of similarities to what's going on again in our world today.  Great cast. Great music. Superb filmaking."}, {"rating": "5", "text": "Wonderful performances, and Branagh's autobiographical point of view adds an authenticity to the neighborhood scenes.  Relevant to now and the many times in history ordinary people saw their happy lives turned into nightmares.  But the second half of the movie descends into the worst form of make believe sentiment; it's pretty awful, and so much potential was lost."}, {"rating": "10", "text": "Belfast is too cute and at the same time manages to be so depressing and heartbreaking that in the end you think it's one of Kennet's best works"}, {"rating": "9", "text": "Imagine a mix between Jojo Rabbit and Roma. It is a beautifully shot film that is very sweet and sentimental. One can really tell it is quite personal for the director, Kenneth Branagh, on which this story is loosely based on. If you want just a lovely little film to watch from this year, I would highly recommend this one."}, {"rating": "10", "text": "Spectacular film by Kenneth Branagh that shows a side of the unrest in NI through the view of a child. Jude Hill is incredible as Buddy. Every emotion is written on his face and he is stunning to watch. Judi Dench & Ciarán Hinds are a phenom as Granny and Pop. The standout for me is Caitríona Balfe who emits somuch emotion as a wife and mother doing her best to protect her family and marriage but at what cost? Everyone needs to see this cinematic beauty! The black and white is so fitting and really allows you to see the characters and emotions rather than focus on blinding colors. Truly brilliant film!"}], "recommendations": ["legends_of_the_fall", "carol", "spencer", "american_beauty", "minari", "the_glass_castle", "20th_century_women", "call_me_by_your_name", "lion", "the_best_exotic_marigold_hotel", "the_danish_girl", "joy", "gifted", "blue_valentine", "green_book", "marriage_story", "a_beautiful_day_in_the_neighborhood", "the_light_between_oceans", "youth", "eddie_the_eagle", "stand_by_me_doraemon_2", "phantom_thread", "finding_neverland", "casablanca", "scent_of_a_woman"]}