{"id": 2035, "title": "Below Her Mouth", "starring": ["Erika Linder", "Natalie Krill"], "runtime": 92, "genre": ["Drama", "Romance"], "description": "An unexpected affair quickly escalates into a heart-stopping reality for two women whose passionate connection changes their lives forever.", "releaseYear": "2017", "mpaaRating": null, "imageUrl": "https://image.tmdb.org/t/p/w500/nTGbq37hYLuNy7YgMg0gVLma0NS.jpg", "categories": {"plot": 4.0, "acting": 4.8, "ending": 5.0, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 5.0, "funny": 5.0, "action": 5.0}, "reviews": [{"rating": "3", "text": "This movies is AWESOME.  And by awesome, I mean terrible...in a good way.  It's basically late night Cinemax soft core porn with artsy packaging.  It tries so desperately to be deep and insightful but it just doesn't have the dialogue, script, or acting to back it up.  But hey, whatever gives the director an excuse to film some hot steamy lesbian sex scenes.  Natalie Krill, the girly lesbian, is a vision to behold.  It's rare to see an actress this gorgeous doing scenes this hardcore.  That alone is worth the price of admission.As for the rest of the movie, it is a mishmash of pretentious exposition and dull as dishwater plot.  Some of the scenes are unintentionally hilarious.  Examples (spoilers if you care):1.  After the lead actress kisses the butch lesbian in a gay club, her friend tries to console her by telling her that she's the \"most faithful person she knows.\"  Seriously?  The MOST faithful?  After she just kissed another girl while she's engaged to a man?2.  After their first date out, the lovers head back to the butch girl's place for some hot action.  The butch then proceeds to pull down her pants, revealing a strap on underneath her clothes.  Meaning this chick was rocking a strap on all throughout the date.  Is this a real thing lesbians do?  Cause that had me in stitches.  3.  In a later scene, the girly lesbian's doting fiance walks in on his sweet love taking it hard and fast from behind by said strap on in their bathtub.  At this point I just felt sorry for the poor bastard.  All attempts to make things work after that scene were just cringe inducing.Having said all that, you should definitely see this movie.  As long as you're there for the hot sex scenes and don't expect any more than that.  I'm giving it a 3, and that's generous.  And solely because I think Natalie Krill is a freaking goddess in her nude scenes."}, {"rating": "5", "text": "Lesbians do not fare well in movies. In Blue is the warmest color the love affair ends because, you know, most lesbians truly desire a man and the lead did, which her butchy girlfriend did not like. She could have known.You see, in movies lesbians are divided into two groups: butches, the true lesbians who act like men(because they want to be men) and want to *** other girls(with strapons) and the deluded girls who think they are lesbians and have it on with the butches but realize their mistake when they meet a real man. If two deluded girls somehow happen to meet up it invariably ends in a tragedy. In a perfect ending, one of the two dies. Freeheld, same deal. A lesbian love affair is at the center of Mulholland drive, one leaves, the other kills herself. The only one I have seen that ends well, more or less, is Imagine you and me.Would Below her Mouth be any different?It might.Did I care?No.For a large part this movie consists of sex scenes, yep the leads are pretty, even the butchy one, and we get to see them get on throughout the movie. The movie wastes no time on it. The butch breaks up with a former partner, then meets the new lover in the local lesbian bar. For some odd reason the new lover, up till then a straight girl and engaged, wanders into the only lesbian bar in town to met the butch. It is what all women do, right? Anyway what follows is mostly a series of lesbian love scenes because women having it on is hot. Character development, drama there might be some, but I lost interest halfway through after yet another love scene. When do we get to see the persons as persons instead of bodies entangled? But what is more, most of the sex scenes have the butchy one act like a man, with a strap doing the other as if lesbians don't have fingers, mouths and tongues. The screenplay is written by a woman and she can't imagine lesbians having sex in any other way than doing it as if they were a man and woman.Of course there are some issues surrounding the engagement. And this is yet another feature of lesbians in movies. If they aren't breaking up because of a man, they are breaking off an engagement or wedding because of a woman. Lesbians cannot exist on their own in movies. That there are lesbians who are not involved romantically in any way with men and not butchy is sheer impossible to conceive. And that such women can be attracted to other lesbians who are not pretending to be men(read butchy) and also not involved with men, that is impossible. But even if the impossible happens, lesbians do not end up happy(Mulholland drive). Women cannot go without men, either true men or pretend men. Below her mouth is not different. Welcome to the movies, boys and girls.I upped it to five.. because of the ending."}, {"rating": "10", "text": "So incredible! I highly recommend. The acting and writing is amazing! Wonderful cast aswell"}, {"rating": "5", "text": "did the people making this move forget what a chin was?did the people making this move forget what a chin was?"}, {"rating": "10", "text": "I gave this movie 10 because erika linder trust me Erika is the most beautiful tomboy i have ever seen but the movie is also good not just because erika"}, {"rating": "4", "text": "Shallow and one-dimensional, yet undeniably erotic, Below Her Mouth is just sincere enough of an attempt to make it an admirable failure."}], "recommendations": ["the_next_365_days", "bride_wars", "tall_girl", "cruel_intentions", "monte_carlo", "siberia", "magic_mikes_last_dance", "the_virginity_hit", "knock_at_the_cabin", "shame", "girls_trip", "sex_and_the_city_2", "colombiana", "book_club", "bridesmaids", "showgirls", "i_spit_on_your_grave", "ghosts_of_girlfriends_past", "unforgettable", "bloody_hell", "the_voyeurs", "eternal", "fifty_shades_freed", "the_first_time", "fifty_shades_of_grey"]}