{
  "id": 286,
  "title": "Ben-Hur",
  "starring": [
    "Charlton Heston",
    "Haya Harareet"
  ],
  "runtime": 222,
  "genre": [
    "Action",
    "Drama",
    "History"
  ],
  "description": "In 25 AD, Judah Ben-Hur, a Jew in ancient Judea, opposes the occupying Roman empire.  Falsely accused by a Roman childhood friend-turned-overlord of trying to kill the Roman governor, he is put into slavery and his mother and sister are taken away as prisoners.  Three years later and freed by a grateful Roman galley commander whom he has rescued from drowning, he becomes an expert charioteer for Rome, all the while plotting to return to Judea, find and rescue his family, and avenge himself on his former friend.  All the while, the form and work of Jesus move in the background of his life...",
  "releaseYear": "1959",
  "mpaaRating": "G",
  "imageUrl": "https://image.tmdb.org/t/p/w500/m4WQ1dBIrEIHZNCoAjdpxwSKWyH.jpg",
  "categories": {
    "plot": 7.72972972972973,
    "acting": 7.571428571428571,
    "ending": 6.230769230769231,
    "soundtrack": 10.0,
    "cinematography": 5.0,
    "familyFriendly": 8.333333333333334,
    "funny": 10.0,
    "action": 6.846153846153846
  },
  "reviews": [
    {
      "rating": "8",
      "text": "First thing first, need to get a couple things out of the way. Two groups of people giving this movie unjust hate. 1: people that went into this movie expecting the old movie. 2: People that are offended by Jesus/God. As a movie this one is pretty good; diffidently recommend it. I knocked two points off- one for the script (the depth could of been better) and one for all that they cut out (which is understandable seeing how this shaves a couple hours off the original). Not much else to say without spoiling. Just keep in mind people, in a world were it's accepted and even encouraged to kill kids (abortion), of course anything having to do with Jesus/God is going to get hated on. Don't take mine or any other person's word for it though, don't let the crowd dictate your views. Go see it for yourself and make your own judgement. It's on average only eight or so dollars to see a movie so go for it."
    },
    {
      "rating": "5",
      "text": "Comparisons are odious as propagated by those who suffer from such comparisons, and whilst films like this attempt to remake classics from the golden years it is highly likely that the comparison drawn will be unfavourable to the pretender. The original Ben Hur was a record breaking, Oscar laden epic that employed the old school styles of acting, colour and cheesy special effects with such assured confidence that it almost defied criticism. This Ben Hur invites it, even if ultimately it is not as bad as cynical naysayers would have us believe. The original Judah, Charlton Heston, took the whole thing incredibly seriously turning in an Oscar winning performance which cemented his appeal in this type of sword and sandals pic. I’m afraid that Jack Huston’s lack of screen presence and charisma will not be doing the same for him. His Ben Hur, along with the rest of the cast actually, is one dimensional and colourless complimenting, in fact, the surprisingly drab production values. Director Timur Bekmambetov keeps the camera in close for many scenes which has the effect of dissipating any chance of an epic aura. To add to this the actors’ line delivery is often flat and unconvincing. This adds immeasurably to the amateurish feel that the production can’t seem to dispel for much of its running time. Still, two sequences work very well indeed aided no end by some wonderful camera shots, precise editing and impressive special visual effects. Firstly, the chariot race is good enough, and long enough, to stand favourable comparison to the earlier film and the galley slave scenes are also up to par in their excitement value. Not a complete disaster then, but it is another remake that is as misjudged and second rate as it is unnecessary."
    },
    {
      "rating": "3",
      "text": "Well after Noah and Exodus i gave up on bible-based movies. This is no exception. It's another CGI-fest mess that focuses less on the message and more the visuals and scenes."
    },
    {
      "rating": "3",
      "text": "A horribly miscast, poorly executed, thinly written remake, Ben Hur is a complete mess, and slobbers over its potential greatness with choppy action, cliched dialogue, and terrible special effects."
    },
    {
      "rating": "7",
      "text": "I really don't understand the preponderance of such negative reviews.  I am old enough to remember the 1959 Ben Hur and saw it in the theater when it first came out.  Although I agree it was a fabulous movie, I wonder what it would look like today if seen in the theater.  I am sure it would be great and probably better then this version despite being filmed under ancient photography conditions.  However, be that as it may, I enjoyed this movie very much.  Although nobody will probably ever out act Charlton Heston as Judah Ben Hur, I thought the acting was more than acceptable.  Of course, I don't think there is anybody who can surpass the acting of Morgan Freeman either.  I just love to see any movie he is in and they are all usually fairly good.  Although the story is certainly not plausible at all, neither were the other movies based on the book.  The book is a work of fiction after all.  If you never saw the 1959 movie with Heston as Judah Ben Hur, you have nothing to compare this one to, so just sit back and enjoy the movie."
    },
    {
      "rating": "0",
      "text": "Тимур Бикмамбетов снова пытается ворваться в Голливуд, и снова неудачно, плохие спецэффекты, плохо прописанные персонажи, слабый сценарий мешают мне назвать этот фильм хотя бы смотрибельным, из плюсов был только главный герой. А так полное дерьмо"
    },
    {
      "rating": "0",
      "text": "Remaking Ben-Hur is like doing Pulp Fiction again, in ten years...Badly~~!.\rIf you end up watching this,\ryour gona lose all your credibility with the cinematic gods.\rSo don't. Seriously."
    },
    {
      "rating": "4",
      "text": "Remember the previous Ben-Hur films we've seen that was inspired from the book? You get the 1907 short, the 1925 silent feature film, the 1959 award-winning feature film, the 2003 animated film, and now this live-action adaption and guess what they all have in common? They follow the plot from the book with minor differences. One of the differences is that this Ben-Hur is just another plain Ben-Hur for the new generation of people. Just sit back and watch the 1959 award-winning film instead."
    },
    {
      "rating": "10",
      "text": "This movie was well done, beautifully shot, and moving. The computer graphic scenes are awesome. I saw the original movie and I must say the chariot race in this movie is just as spectacular. Also the scenes of the ships battling it out on the seas were riveting. The actors did a great job and I found the story well written. This is not a one dimensional religious message movie, but a moving and inspirational epic. If you miss this, you will miss one of the year's great films."
    },
    {
      "rating": "0",
      "text": "One surely must have a guts to remake one of the best movies of all the time. The director of Ben-Hur 2016 has no vision, no talent, no inspiration. Just guts.\rDisgusting!"
    },
    {
      "rating": "1",
      "text": "I couldn't wait for this movie to be over, so I can **** on it and give it my honest opinion. It starts off terrible and it ends horrible. The action was okay, but the ACTING. Holy crap, I wanted to yell and say this movie is **** to the whole audience. Will you see this movie in Netflix? yes. Will the price drop when it comes on DVD/Blu ray? HELL YEAHH!."
    },
    {
      "rating": "0",
      "text": "Ben-Hur was a film that was spectacular in its own right and did not deserve such an awful and lifeless remake such as this. Ben-Hur Rebooted is a boring drag that features such talent as Morgan Freeman and Jack Huston, who sadly fall under a script wrapped with cringy dialogue. Sprinkle some horrific CGI and you have a disaster. The fights and brutality don't add up to what the original gave us. The chariot races lack depth that might have made for an entertaining climax. This one is a mess."
    },
    {
      "rating": "9",
      "text": "This movie is just amazing. I didn't watch the original one but i'm glad i watched this one. Like always just ignore the critics, go watch the movie, u won't regret it."
    },
    {
      "rating": "0",
      "text": "Oh what you have just committed a crime here. The remake is so bad that himself Heston again ashamed stranger in the grave to death. CGI is not everything and that one has not learned from Clash of the Titans is sad.\rLooks prefer the original."
    },
    {
      "rating": "10",
      "text": "I loved it!  And I really had no plans to see it because I have a very low opinion of Hollywood versions of Bible stories, and I don't love Roma Downey's interpretations of the Bible....but, I went anyway, mainly because it isn't a story \"from the Bible\" that has been twisted by man's interpretation ... it is just a story.  I saw the original years ago and loved it then, but I think I like this version better because of a Zealot causing the whole conflict between brothers and not the sister knocking a loose roof tile accidentally  made so much more sense!\r I also thought the scenery and set designs were amazing.  The chariot arena was beautiful!  You don't usually see that kind of beauty and money in \"a Christian movie\".\r And too, I have to say that I really appreciate that it wasn't 3 hours and 42 minutes like the Charlton Heston version!  I don't have that kind of patience anymore!  So for folks comparing the two movies you need to keep that in mind. Sure, things will be lost but ...\r I will definitely go see it again and buy it when it comes out for purchase."
    },
    {
      "rating": "9",
      "text": "From my Liberal Gay catholic point of view: A horribly miscast, No, Beautifully cast with stunning point-on acting talents!... poorly executed,No,  beautifully executed,... thinly written remake,...No, powerfully and excitingly re-write .....Ben Hur is a complete mess, No,... roller coaster of a re-invented movie experience to behold... and slobbers over its potential greatness with choppy action, False! Breathtaking in it's wild, digitally enhanced breath-taking action scenes,... cliched dialogue, No, Spot-on dialogue fits beautifully into the perfectly believable ancient settings.... and terrible special effects..No.... special effects plows right into your lap as it did while I watched it Monday in giant screen XD3D. Saw the 1959 5 times, 2010 TV release once and loved both. The 2016 short but explicit Jesus scenes were wonderful to witness and probably embarrassing for the non-Christian to have to squirm through ...for me: well worth the pricey reserved seating!\r Like always just ignore the critics, go watch the movie, u won't regret it."
    },
    {
      "rating": "10",
      "text": "I never saw the original. I thought this movie was amazing. I thought the brutality of it was awesome and the naval battle scene alone was worth the ticket price."
    },
    {
      "rating": "0",
      "text": "Stripped of the sly gay sub text in the Vidal-crafted screenplay of the original this is a slog to get through. Technical improvements in the chariot race are noteworthy but hardly revolutionary not to mention that you pay a steep price in sitting through stilted dialog and wooden acting to view them. Save your money; all you really need to know we learned int he original - if you contract  leprosy a good crucifixion will take care of those legions faster than you can consume a box of Junior Mints."
    },
    {
      "rating": "7",
      "text": "Ben-Hur is entertaining enough to spend a lazy weekend afternoon. There are some pretty cool action beats and visuals, and the acting is solid. Jack Huston and Toby Kebbel play each other well, and add depth to characters that can easily become stereotypes.\r However, it suffers from a pacing that barely lets the story breathe, unearned cathartic moments (Jesus could be removed and it wouldn't make much of a difference), and a schizophrenic tone in the last 20 minutes or so (the character change there gives the \"Martha\" scene in Batman v Superman a run for its money).\r It's not a great movie, but it's not the train wreck critics are making it out to be."
    },
    {
      "rating": "10",
      "text": "Probably the best film ever made. I can't express how bad the original one was but this remake is a masterpiece, takes all the bad things that characterized the original movie and completely reworks it making it feel fresh, dated and beautiful at the same time, and the things that were good are brought to new horizons, the actors are definetely very well chosen. This film is the definition of perfection."
    },
    {
      "rating": "7",
      "text": "Part faith-based film and part swords-and-sandals epic, Ben-Hur succeeds better than the average Christian flick, a genre that has recently seen a resurgence of sorts in modern cinema. That's because it focuses on it's story first, and preaching second.Now one thing I can't do in this review is compare this remake to the original as I have not seen it. I can say though that it should be fairly obvious this movie isn't going to have the same impact as the original. At the very least though, it is entertaining.Spread across the tale of Ben-Hur's quest for vengeance are Christian themes and messages. You'll see Jesus and hear characters talk about how one should forgive their enemies instead of seeking revenge. These elements are thankfully not very heavy handed in their delivery, making them more bearable for non-believers. They do feel oddly included though. Like unnatural additions to the main plot that could have already been a story of forgiveness all on it's own.The main plot in the movie pretty solid and backed by equally solid performances. Just like the faith-based elements, it can feel uneven in execution. It does have the tendency to meander a bit from time to time, and when it finally does get to the fateful chariot race it's  full-throttle all the way to the conclusion. Speaking of that chariot race, it's quite thrilling to watch. There's one other moment of big-spectacle excitement to be found. The rest of the emphasis is on the story and characters, some of which go underdeveloped and just feel like bland faces meant to push the story forward.While lacking in truly epic moments, the ones it does have are still exciting to watch. Brought to life by solid special effects and a director who apparently knows how to put on some solid fireworks.While perhaps uneven in it's execution, Ben-Hur is a faith-based film that has the potential to entertain more than just hardcore believers. That's because it's part big action, special effects driven blockbuster with a strong emphasis on character drama. The themes of forgiveness are appreciated and it's a very relatable story in a sense in that appeals to emotions we've all felt. So it's definitely brought to life in all of the best ways, but at least it still manages to be fun.7.4/10"
    },
    {
      "rating": "10",
      "text": "A good story is the best basis for a good movie.  It is the skeleton over which the script is laid out.  This film has an excellent epic story and a good script.  Add to that a good casting, excellent production values, and a good direction, and the result is an excellent film.  All-in-all a very well told epic story.  A style of movie that  nowadays we miss from the big super-productions of times past.  Very recommended.  My only minimal criticism is the choice of music for the end of the film.  It wouldn´t have been my choice of music style.."
    },
    {
      "rating": "10",
      "text": "Excellent movie and overall my favorite of 2016 so far. The cast gives a superb performance that really conveys the story in an an impactful, emotional way. The depiction of galley slave life on its own as well as the chariot races, stand out as amazingly powerful conveyances of little shown aspects of the Roman Empire. Obviously the Christian message will make those bothered by their convicted conscience give low scores as a result, but this movie is amazing and a worthy successor to the original."
    },
    {
      "rating": "7",
      "text": "Terrific end chariot race probably could not be better.  The galley slave rowing sequence probably could not be better. Funny post-show credit animations are a hoot.My main comment is this may be another textbook example of a script with too many hands in in and too many agendas, leading to mediocrity.  Not the director but the script seems to be teh villain of this piece. The dialogue while occasionally good, even effective especially seems off the mark.  It so clearly lacks a singular vision of characters, what they are learning, or any singular vision of the plot.  I found the Christ story, tacked on s it is, still affecting.  As other reviewers have asked, \"Tell me again, WHY was this re-make necessary?\""
    },
    {
      "rating": "9",
      "text": "really good movie with some weak moment, with beautiful words of counciousness, i did feel some emotions in the movie,for a christian film it was pretty brutal with beautiful special effect, really theses days critic are really too rough,if one of the actor or creator of this movie reading my review just let you know than you're movie is really great you can be proud of it. thank you"
    },
    {
      "rating": "10",
      "text": "Very exciting and entertaining. The movie has drive and the Christian story is well told. You also can feel the character of human in a period of dictatorship, conquest and occupying."
    },
    {
      "rating": "7",
      "text": "In each past adjustment of General Lew Wallace's fiercely fruitful 1880 novel Ben-Hur: A Tale of the Christ, the actuating occasion comes from Judah Ben-Hur, the Jewish aristocrat, incidentally thumping some stray tiles on to the heads of Roman bigshots as they enter Jerusalem. Watch and download this movie here watch this movie."
    },
    {
      "rating": "5",
      "text": "Cuando supe que iban a hacer un remake de 'Ben-Hur' me ilusioné bastante dado que nunca había visto la legendaria cinta original. Además contaba con Jack Huston de protagonista, un actor que me gusta bastante.Pero muy lejos de esa realidad, Ben-Hur es una película sin alma, aburrida hasta las galeras que apenas cuenta nada y muy moñas... A partir de las galeras, se convierte en una película que a mi al menos me entretuvo y no se me hizo demasiado pesada, alguna aparición esporadica de Jesucristo estaba interesante...Jack Huston está bien, el problema es SU personaje que es muy muy malo. Morgan Freeman está bien, pero el personaje sale poco... Esta película tiene que meterse mucho más de lleno en el tema de la religión. Y por favor señores de Hollywood, esas bajadas de pantalones con los finales, No. Es vergonzoso el final de esta película.En definitiva, Ben-Hur, entretenida. Ben-Hur, mala. Ben-Hur, cobarde. Un 5 con generosidad, porque sale Jack Huston"
    },
    {
      "rating": "6",
      "text": "I cannot forgive Ben Hur wearing Jeans but all in all this film is quite acceptable. As for the CGI: It is just the one scene from the trailers - the horse climbing the amphitheatre's ranks - that should have either been improved or simply cut from the movie."
    },
    {
      "rating": "4",
      "text": "In his early career Timur Bekmambetov, directed some wonderfully innovative films (Day Watch, Wanted), so I was hoping this movie's famous chariot race would at least be cool. There were some high-energy moments and a few good crashes, but this scene (and the whole film) just felt lax. This epic follows the conflict of 2 half-brothers in the time of Jesus: one is a Jewish price and the other a Roman. With the exception of the big boat battle, there's little dramatic tension. Ben-Hur's more concerned about emotional engagement than conflict, so we get a heartfelt drama when we want spectacle. It doesn't help that Jack Huston in the titular role lacks the charisma or presence to give it momentum."
    },
    {
      "rating": "5",
      "text": "Half as good as the original, not terrible and intermittently enjoyable but fairly average otherwise."
    },
    {
      "rating": "10",
      "text": "Ah, the snobbish professional critics know nothing. I ignore them, like I do most of the time. Otherwise I'd miss many of the best movies I've seen.To be honest, after the crappy disasters of supposedly Christian movies meant to be directly based on the Bible that's Russell Crowe's weird \"Noah\" and Christian Bale's pathetic \"Exodus: Gods and Kings\", I almost gave up all hope of these un-Christian movies in Christian movie clothing, full of unashamed inauthenticity. So I decided to watch a movie that is NOT directly based on the Bible, Jack Huston's \"Ben Hur\", and it turned out to be more Christian than Noah or Exodus combined - all in a pretty epic movie!Given this is based on the book and being the 2nd movie made with the same name, the plot is no surprise. At high level, it's a story of 2 brothers who went their separate ways due to a misunderstanding and betrayal, where hate drove them closer and closer to killing each other, but in the end found that forgiveness was more powerful than vengeance. Now that would make a boring story if it wasn't for strong acting and scripting, and of course, the epic action scenes (the ship / galley and horse racing scenes in particular) which were done with absolute purpose, woven into the very story itself. Where's the Christian part of it? Well, Ben-Hur lives in the same period as Jesus Christ and so we find Ben-Hur and his family occasionally experiencing Jesus' wisdom and love. Of course, Jesus' narrative is only the backdrop and he only makes a couple of appearances. (this is not a Jesus film - for that, try Passion of the Christ!). Jack Huston and Toby Kebbell held strong chemistry as brothers in the movie - going from close brotherhood to distant enemies and reconciled as brothers again. Jack Huston proves to be a versatile actor, exuding joviality, confidence, hatred, joy, tenderness - expressing the right emotions at the right times. Morgan Freeman plays Ilderim, a good supporting role in helping Ben-Hur face his brother in the final showdown.This is one movie I would happily watch with the family. The values are wholesome, the action is epic, the movie is simply beautiful. Well worth the watch. One of the best movies I watched so far. And yes, of course it's better than the original - this is made in 2016 with better technology supporting the actors!"
    },
    {
      "rating": "5",
      "text": "They've grown up together and later turned up to each other.I had seen the old film and I liked that. So remake means we expect nothing less than a visual spectacular and this film had them at its best, including many more great features, but the real stars are missing. It was a let down without any notable performances. Besides, the idea of upgrading the story was good, though not everyone going to like that. Particularly the one who loved the old film or the versions.The length is justified. For the kind of story the film narrates, the pace was very good. So for me this is not a bad flick, but just some key features missing like I said the star value. For the first timers, like today's generation, this film might work, but for the others most probably not. And the end was disappointing, because it felt like watching a Disney film that made for children and families.I think the director of 'Wanted' did his job as it required. Definitely not an unnecessary remake, but should have been careful in the historic events. Overall, it fell short of depth. You won't feel emotions and/or the character's struggle. In the end it became just an entertainment product and if you expect beyond that, you are only responsible for that. So good luck with the watch if you are yet to give it a try.5/10"
    },
    {
      "rating": "7",
      "text": "Ben-Hur wasn't the best movie I've ever seen, but I'm surprised that the ratings are so low. Regardless of its flaws, this is still an above average film with great action sequences and a compelling story."
    },
    {
      "rating": "6",
      "text": "While it rushes through many years of Judah's slavery and contains lots of convenient moments, Ben-Hur ultimately delivers it's message of forgiveness and hope through powerful acting, top-notch action, and a condensed version of the 1959 plot."
    },
    {
      "rating": "7",
      "text": "I came into this movie with the intent, not to compare it with the Classic we all know and love.  We all know how that works.  One can't help but draw comparisons anyway, and I can understand the zeros people have given this movie zeros but that's a bit unfair.  It's really not that bad, but it's not the epic Charlton Heston movie we all love.\r I was disappointed that the production values weren't as high as you'd expect for a major motion picture release, but in general, this new take on a classic tale (yes I've read the book) stood on its two feet story wise.  The relationship between Judah and Masala was much more fleshed out, and the resolution of the rivalry between them was more satisfying for me in this movie, than it was in the 1959 epic.\r Standouts for me were the scenes of the naval battle and the chariot race.  Very gritty and realistic.  While the CGI could have been better, I think those scenes brought home just how brutal these events were.\r I enjoyed the movie, but to do so I had to ignore the sub par production values.  Had they spent more money on the production, my rating would have gone up to an 8.  I think they must have spent most of their budget on getting Morgan Freeman on board."
    },
    {
      "rating": "10",
      "text": "Ben-Hur is a beautifully told Christian movie based on a story I have never known. I didn't have high expectations at all and in fact the first 5 minutes were pretty boring. But the film maintains its balance and just gets better and better all the way till the end. The race scene towards the end was very intense and well-crafted. The acting in this movie was great and Morgan Freeman just made me laugh as a character in this film. The movie had a perfect runtime and I loved the connection to Jesus in this film. I think this is a great Bible movie to watch and I certainly was entertained. I was really surprised with this film and there was even a clapping ovation at the end. For some reason, my theater was nearly full, while Suicide Squad had only 10 people??? (98/100)"
    },
    {
      "rating": "6",
      "text": "Lot better than expected, and the movie was competent. The acting for the most part was really good especially Jack Hudson. The movie doesn't really do anything the 1959 one didn't do. It felt like it was missing something though. The action scenes where pretty good especially the Ship fight and of course the Chariot scene. Atleast this one didn't end up being another horrible Hollywood remake even though it never should of been made, but it's nothing to ride home about."
    },
    {
      "rating": "7",
      "text": "A different take on the classic movie.  While most of the elements stay the same, they are taken differently in light of Judah Ben-Hur's hearing the teachings of Jesus.  As a movie, not in the league of the classic, but okay.  I gave it points for the new story angle."
    },
    {
      "rating": "8",
      "text": "I’m not qualified to say whether it’s an effective delivery system for its Christian message, but I think I can credibly pronounce it a good popcorn movie."
    },
    {
      "rating": "3",
      "text": "A rather dull remake that makes the fatal mistake of following too closely to the original story, whilst simultaneously failing to deliver it in a comparably epic way."
    },
    {
      "rating": "5",
      "text": "Roman empire drama. The problem with remakes of historical titles for me is that modernisation of attitudes and dialogue makes it harder to accept the different values of a period setting. The lighting, sets and scale all set up the right atmosphere, and things improve when Morgan Freeman appears, but I did not find changes made to the plot added credibility. I was left disappointed, just watching another movie rather than becoming involved in a timeless story."
    },
    {
      "rating": "8",
      "text": "I’m not qualified to say whether it’s an effective delivery system for its Christian message, but I think I can credibly pronounce it a good popcorn movie."
    },
    {
      "rating": "10",
      "text": "Most likely the best film ever made. I can't express how bad the original one was but this rebuilding is a masterpiece, requires all unhealthy things that characterized the first movie and completely reworks it rendering it feel fresh, dated and beautiful at the same time, and the things that were good are brought to new rayon, the actors are definetely well chosen. This film is the definition of perfection. Watch and download this film here watch this movie."
    },
    {
      "rating": "5",
      "text": "a fine movie ats it own but broken as the remake of a classic , i mean whole this movie is rushed but enjoinebleAs remake 2/10 As seperate movie 8/10THts why the 5 scoreOverall pretty good movie but if you think of it, it was totaly different then the classic movie"
    },
    {
      "rating": "8",
      "text": "I’m not qualified to say whether it’s an effective delivery system for its Christian message, but I think I can credibly pronounce it a good popcorn movie."
    },
    {
      "rating": "8",
      "text": "I’m not qualified to say whether it’s an effective delivery system for its Christian message, but I think I can credibly pronounce it a good popcorn movie."
    },
    {
      "rating": "8",
      "text": "I’m not qualified to say whether it’s an effective delivery system for its Christian message, but I think I can credibly pronounce it a good popcorn movie."
    },
    {
      "rating": "1",
      "text": "Décidément Ben-Hur, t'es aussi mauvais que ton ancêtre mais pas forcément pour les mêmes raisons... mais t'es un mauvais film quand même, toujours aussi tarte même à notre époque ! je crois que l'histoire a réellement un problème et qu'elle est trop fatiguenaze pour qu'on puisse en tirer quoi que ce soit. Que ce soit en 4 heures ou en moins de 2, c'est trop niais, trop débile, trop gnagnan et trop con, alors arrête ton char parce que tu nous les casses sévèrement ! j'ignore comment ils ont fait mais ce reboot reste en effet presque aussi chiant que la chienlit de 1959 qui n'en finissait plus... Les acteurs y sont en tout cas encore plus nazes que jadis... Evidemment les effets numériques et les décors sont bien mieux faits et la mise en scène n'est pas aussi craignos qu'on aurait pu le craindre. Mais ça craint bien quand même, tout ça."
    },
    {
      "rating": "8",
      "text": "I’m not qualified to say whether it’s an effective delivery system for its Christian message, but I think I can credibly pronounce it a good popcorn movie."
    }
  ]
}