{
  "id": 4371,
  "title": "Beneath the Planet of the Apes",
  "starring": [
    "James Franciscus",
    "Kim Hunter"
  ],
  "runtime": 95,
  "genre": [
    "Adventure",
    "Science Fiction",
    "Mystery"
  ],
  "description": "The sole survivor of an interplanetary rescue mission discovers a planet ruled by apes, and an underground city run by telepathic humans.",
  "releaseYear": "1970",
  "mpaaRating": "G",
  "imageUrl": "https://image.tmdb.org/t/p/w500/szHCeYwi4ubewuYnlnz0YGqWnQC.jpg",
  "categories": {
    "plot": 7.0,
    "acting": 4.0,
    "ending": 7.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 5.0,
    "funny": 5.0,
    "action": 5.5
  },
  "reviews": [
    {
      "rating": "4",
      "text": "I remember liking this movie as a kid, but after re-watching it recently it became apparent that this movie does not hold up. This sequel brings Planet of the Apes from an American classic sci-fi, to a d-list action movie. After doing some research it is obvious that the executive producers in charge HAD NO IDEA WHAT THEY WERE DOING! Their first mistake: turn down Rod Serling's ideas. Mistake 2: turn down the original author's ideas. Mistake 3: require Charlton Heston to appear in the film, despite the fact that he is NOT the protagonist, and then hand off the terribly-written movie to an actor that looks nearly identical to Heston. There is a skeleton of great ideas and themes, but no delivery or substance. This movie is worse than the Tim Burton Planet of the Apes, and I mean that without any hyperbole."
    },
    {
      "rating": "0",
      "text": "The quality of the writing takes a nosedive after turning down ideas from the writer of the original film and the author of the book it was based off. And to replace your quality lead actor, Heston, with someone who looks exactly like him is laughable, Especially when his replacement lacks the obvious onscreen presence that Heston had in the first film. And just to highlight how bad this movie was written, I will leave you with just two words: Telepathic Humans."
    },
    {
      "rating": "7",
      "text": "It is true, that this sequel cant compete with the masterpiece of the 1968 movie. But still I enjoyed it and the conclusion in the end is serious. Yes, some of the things were a bit ridiculous. But still I liked, that this movie showed a bit more of the world, yet it could be more: they could show a big kingdom, who is going to a war with another kingdom, but they showed a village and a abandoned underground station."
    },
    {
      "rating": "7",
      "text": "Beneath The Planet Of The Apes cannot be perceived as a full-fledged sequel. It's just a direct sequel to the first film. I don't understand why the film has such low ratings. In Beneath The Planet Of The Apes, action takes place rapidly, a new faction appears and the franchise's lore expands significantly. And it seems that I now understand where Bethesda got its inspiration when creating the cult of the Atom)"
    },
    {
      "rating": "4",
      "text": "По сравнению с первой частью, этот фильм нудный и неинтересный. Введение нового героя было лишним..."
    },
    {
      "rating": "7",
      "text": "Quite a far way off its predecessor, even if 'Beneath the Planet of the Apes' is still a good film.Charlton Heston reportedly wasn't initially interested in returning for a sequel, though, to his credit, did in the end return briefly to tie up his character's loose end - and apparently even gave his fee to charity. That's why we don't see much of him here, which is a shame but given the aforementioned it came out well enough.James Franciscus takes over from Heston and does a fine job, the latter is definitely the better of the two but Franciscus is passable. Kim Hunter, Maurice Evans and Linda Harrison do return, though the first two basically play second fiddle to others - including newcomer James Gregory's bunch of characters; Gregory is solid, fwiw. As for the film's other parts, make-up etc., it's basically the same as the original. The plot even feels similar for a fair chunk of this production, though it eventually goes its own way.I'm even more interested to check out the subsequent sequels, given the ending to this 1970 film was apparently intended - by those on the ground, so to speak - to be the final entry; the studio evidently wasn't in agreement."
    },
    {
      "rating": "5",
      "text": "The original one was the masterpiece. But this one is a piece of something unpleasant."
    }
  ]
}