{
  "id": 1366,
  "title": "Benedetta",
  "starring": [
    "Virginie Efira",
    "Charlotte Rampling"
  ],
  "runtime": 131,
  "genre": [
    "Drama",
    "History",
    "Romance"
  ],
  "description": "A 17th-century nun becomes entangled in a forbidden lesbian affair with a novice. But it is Benedetta's shocking religious visions that threaten to shake the Church to its core.",
  "releaseYear": "2021",
  "mpaaRating": "NR",
  "imageUrl": "https://image.tmdb.org/t/p/w500/bQnP9YzjxbJ4kGYYChip4lUIS5U.jpg",
  "categories": {
    "plot": 8.714285714285714,
    "acting": 8.333333333333334,
    "ending": 5.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 4.0,
    "funny": 5.0,
    "action": 8.0
  },
  "reviews": [
    {
      "rating": "7",
      "text": "This is based on true events during the 17th century in Tuscany. A young nun seemingly has visions that have made her revered in her village, but her love affair with another nun created a controversy with the church. Paul Verhoeven, who directed Basic Instinct and Showgirls, certainly has a track record for cinematic erotica and he’s in full force here (not to mention a few minor moments of violence…he also helmed Total Recall and Robocop). The conflicts between Benedetta’s devotion to Jesus and her personal desires provide a nuanced and compelling character study, while examining the power and reach of the Catholic church. (In French with subtitles)"
    },
    {
      "rating": "6",
      "text": "Immidiately from the opening scenes the set feels artificial, and lacks the extras to make it believable. It is only until Benedetta goes to the sisterhood that the set becomes more natural.The story itself is erratic, and tough to follow along, and because of that it becomes a Lesbian of God taboo proto-porn - and well, frankly... texts and documentation from the 17th century probably were just as descriptive about Benedetta's sexuality then too."
    },
    {
      "rating": "6",
      "text": "I can't help but wonder how does it work when a film is trying in every possible and obvious way to be provocative and disruptive, and yet fails to achieve that goal for the simple but crucial reason that the viewer is simply not impressed or shocked by it?Therefore, another important question arises: Are its qualities more valuable to viewers who are shocked by its subject matter and images?And if so, is that a strength of the film for those viewers, or a weakness for others like me?I'm confused.Paul Verhoeven delivers a sufficiently polished film. Especially in its visual aspects, even in the face of the apparent simplicity of its mise-en-scène but basically its qualities outside of that, neither provoke a real reaction, nor say anything noteworthy.Or at least I admit it didn't in my case."
    },
    {
      "rating": "10",
      "text": "Benedetta is a story that might already sounds familiar, but it's not, it's more than just a story, it's a fascinating and powerful story that superbly well perform, well craft, and well directed, arranging drama and romance comparable, Benedetta it's a powerful true story in a very powerful religion, and the movie itself for me is one of 2021 Masterpiece, i highly recommended."
    },
    {
      "rating": "8",
      "text": "'Benedetta' is a slap in the face of religious hypocrisy.Paul Verhoeven delivers a no holds barred film that points at the rotten values of catholicism, those that reek of evilness and hate since ancient times.The film follows a nun who claims to perform miracles in the name of Jesus. But when she starts a forbidden relationship with a fellow nun, and the authenticity of her divine work is questioned, the Church promptly moves against her.Benedetta, the character, embodies pure feminism. By defying the religious rules imposed by the abbess and later the nuncio, she rebels against sanctimony, deception, and the fact that we have to suffer in this life no matter what.Some might say that Verhoeven unnecessarily exposes too much of the woman's body in here, But, again, nudity becomes the ultimate weapon against those who call themselves pure and worthy.The best part is that story leaves the protagonist's true identity open. Is Benedetta a fraud or truly a godsend? Whatever the case is, she uses her body to destroy the religious constructs that threaten to shackle her for life.And if this isn't enough to catch your interest, there's a **** carved from a Holy Mary statue. You can't say no to that.I'd recommend watching this back to back with 'Saint Maud' and Pasolini's 'The Canterbury Tales.\""
    },
    {
      "rating": "8",
      "text": "Poor misunderstood Benedetta.  This movie was a fever dream, and I can see why the Catholic Church has their panties all balled up in a wad.  Benedetta is all about true love and forgiveness.  And some hot lesbian nun action as well."
    }
  ]
}