{
  "id": 3533,
  "title": "Beowulf",
  "starring": [
    "Ray Winstone",
    "Angelina Jolie"
  ],
  "runtime": 115,
  "genre": [
    "Adventure",
    "Action",
    "Animation"
  ],
  "description": "A 6th-century Scandinavian warrior named Beowulf embarks on a mission to slay the man-like ogre, Grendel.",
  "releaseYear": "2007",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/iRGPYzbmDgmk7mBLwtq52AtGhS4.jpg",
  "categories": {
    "plot": 6.75,
    "acting": 4.785714285714286,
    "ending": 5.5,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 5.5,
    "funny": 3.0,
    "action": 8.923076923076923
  },
  "reviews": [
    {
      "rating": "0",
      "text": "As a Greek I always thought that film adaptations of Greek epic songs, mytholgy or history were the worst kind. I have to admit, I was wrong. Beowulf is BY FAR the most disgracing piece of computer images put together. If you have read the book the film is absurd. If you haven't it's demented. Thank Odin the book is miles and LEAGUES away from the piece of junk the collaborators of this retardation came up with. If Beowulf was anything like what was presented in the film, then the \"Lord of the Rings\" would have been called \"The Grey King's Biography\" and it would have been written by someone else. In short; if any Geatish hero still exists, I call upon thee, to slay the producers and director of this atrocity. These are the only monsters that endager your kingdom."
    },
    {
      "rating": "5",
      "text": "Robert Zemeckis made a well animated 3-D epic but nothing that I observe is special. The first half is dull and second half has a bit more gore and kiddish story of the book and epics is not well used but some fun provides. In voice acting or CGI acting its cool but nothing special. The ending is clueless and characters have no depth or story. The 3-D is good, yeah but could have been used well. The gore and violence is endless and the UNRATED version is worse. Zemeckis makes the real  he digs in deep and makes it up to serve the nudity, sex, gore and violence of this dull war epic."
    },
    {
      "rating": "3",
      "text": "None of the reviewers who gave it over a 30 actually have ever read beowulf, I have and this has almost zero to do with the epic poem. It is just a bad attempt to \"hollywoodize\" the poem"
    },
    {
      "rating": "6",
      "text": "\"Beowulf\" is a epic remake of the original tale of vikings. It lacks the depth or symbolism of the characters, but it certainly does have the glorious gore and blood going on."
    },
    {
      "rating": "6",
      "text": "Beowulf is a fun cheap ride that you will walk away and forget. However while in the film, you will enjoy yourself, but maybe feel a little unsatisfied."
    },
    {
      "rating": "10",
      "text": "The animation and the story are incredible. Definitely one of the best movies ever made. I can't wait to watch it again. One of those movies that make the real world so boring for a few days after you watch it."
    },
    {
      "rating": "10",
      "text": "I love this movie, one of my favorites. Even though it didn't follow the story of the book as much as I would have preferred, the movie has it's own little storyline thing that is very good. The CGI is extremely well done, as is the script. And the actors they used are amazing. This is the most underrated movie of all time."
    },
    {
      "rating": "5",
      "text": "Looks okay but a trifle tedious."
    },
    {
      "rating": "10",
      "text": "I loved this movie.  I thought it brought a difficult text to life, giving it a new interpretation suited for cinematic length and modern audiences, and would be brilliant for A level literature students.  When this poem was first written down it had already been narrated by travelling storytellers for centuries, changing and improvising it into many versions, so those who complain it isn't a strict interpretation should see it in its historical context.  I thought the animation was brilliant; dark , chilling, horrific, gory and allowing fight sequences worthy of its heroes.  The cast, even behind their animated avatars, were brave and noble.  And I thought the story of Grendel's mother was a great plot idea giving an extra, modern twist to the tragedy.  All in all, one of the best movies I have seen for ages."
    },
    {
      "rating": "9",
      "text": "Hugely underestimated gem. On the surface, it's just another hero movie, with a rambunctious and invincible Beowulf. It goes much deeper than that though, with a persistent feeling of an Age that is coming to an end.Beowulf is a liar, exaggerating his own adventures, and learns all too soon that your dreams tend to decay around you once you make them come true. He fails his most important trial and will eventually have to pay a hefty price for that.Rothgar is an aging, disgusting pig living on past glories, surrounded by adulators who only crave his gold. His famed mead hall is just a glorified shack.When Beowulf comes as the hero who will defeat the monster, there is no oceanic crowd cheering him but just a few, unconvinced peasants. And in the background the Christian religion is undermining what remains of the days of the glorious heroes, fighting in the name of the Norse Gods.It's a crepuscular tale of regret and longing, for an ideal that cannot really exist. In many ways, it can be regarded of a coming of age tale, of romanticism that eventually needs to confront reality."
    },
    {
      "rating": "1",
      "text": "Absolute garbage!!!! Anyone wanting to go see good cg should buy final fantasy advent children.Im familiar with the beowulf legend and this movie represented it fairly but that doesnt make for a good movie..The cg was very poor the overall look was completely sparse and it was so boring through the whole thing I was tempted to walk out as many others did.The movie was generally pretty quiet.. there wasnt much of a score nor was there any effective bgs which made it that much easier to tune out..My friend agreed and it left us both unsatisfied and ripped off in the end...Save your money and wait 3 months for the dvd..The 1 by the way is just for ANgelina Jolie she was gorgeous in it."
    },
    {
      "rating": "8",
      "text": "Ok, for the life of me I don't understand the negative reviews. Let me compare it to an earlier \"Blockbuster\" this year. This is the type of Movie I expected to see when I walked into 300, but didn't get from 300. Its Beautiful to look at, full of action, and \"overall\" the dialogue is engaging. I found it a relief to have actually enjoyed an action movie for once this year as all I have gotten was 2 hours of dull drool and 20 minutes of campy action that took itself too serious. And for god sakes as far as an enjoyable theater experience, see this thing in 3D, you cant beat it."
    },
    {
      "rating": "5",
      "text": "Here is a thought! Abolish the MPAA rating system. Since apparently the one in place absolutely cannot be trusted. I quote from the MPAA PG-13 guidelines, \"More than brief nudity will require at least a PG-13 rating, but such nudity in a PG-13 rated motion picture generally will not be sexually oriented.\" Wow, I guess I was imaging things because I could have sworn while watching Beowulf that not only is the nudity in this picture prolonged, but it extremely sexuality oriented, having unrelenting sexual references throughout the moving as well. Oh, and don't forget the obvious sexual moaning during a scene with nearly fully exposed heaving breasts either. The sexual wording is such that it carefully and conveniently circumvents direct reference to sex using antiquated wording like \"fornication\" and \"having knowledge,\" while sexual acts, some of which are highly incestuous, are explicitly implied. Furthermore, the violence in this movie is over the top. \"There may be depictions of violence in a PG-13 movie, but generally not both realistic and extreme or persistent violence.\" The violence in this movie is highly realistic, extreme, and persistent. Due to the 3-D effects, this movie is quite intense. This movie obviously belongs in a category higher than PG-13- the MPAA system guidelines state so plain as day. Who needs an MPAA system anyway. The movie industry clearly does not care about rating a movie properly, only about appealing to as many demographic areas as possible at the same time in order to make as much money as possible."
    },
    {
      "rating": "4",
      "text": "I went into the film with some trepidation, and came away feeling that I just just watched something between Shrek and Austin Powers. Beowulf himself had the voice of Ray Winstone, but the look of Sean Bean. Worst of all seemed to be the inconsistency of dialects; whoever heard of a cockney South African? The story was well told and some sequences were very well done, but not much good to say about a 2-hour film."
    },
    {
      "rating": "8",
      "text": "Interesting action, accentuated by the absorbing and involving nature of the new Real D format. The characters were however, still as plastic as previous 3D offers and dialogue bland and corny."
    },
    {
      "rating": "10",
      "text": "Beowulf is top notch. The scenes were amazing. with the 3d look I was blown away. It was great."
    },
    {
      "rating": "10",
      "text": "Great. Amazing. Please win Oscar nomination."
    },
    {
      "rating": "8",
      "text": "I found this movie's anti Christian point of view from the Viking world rather interesting. The Dragon scene is one of the best ever."
    },
    {
      "rating": "9",
      "text": "First of all, don't pay attention to the critics that only enjoy movies about gay swans and kids with one arm. This movie is for the warrior at heart. I really enjoyed this retelling of a classic. I like the contrast that shows the difference between the deeds of heroes and their lives. . It shows the human falicy that can exist in even the most legendary of men. Also the 3-D was spectacular. Axes, swords, blood, guts, and fire right in your face! Top notch stuff!. I am defiantly going to see this again. If you want gay swans..stick to the art house. If you want satisfying action with some sword swinging gusto..check out BEOWULF!"
    },
    {
      "rating": "3",
      "text": "What a piece of Dragon poo. I mean, a demon-Angelina Jolie-lookalike with high heels? Well at least I had a good laugh with Beowulf constantly taking his cloths off, we called him FKK-Wulf afterwards..."
    },
    {
      "rating": "10",
      "text": "These movie critics make me laugh. Of course this is not some deep thought provoking movie. It is a fun, action packed adventure. You got to see it in 3D. The 3D effects are fantastic. My girlfriend loved it. Real men like action movies with hotties , like Angelina. We don't like slow sub-titled boring movies that win film festivals."
    },
    {
      "rating": "10",
      "text": "Saw this in Imax 3D"
    },
    {
      "rating": "10",
      "text": "This movie is a technological feast for the eyes. If you see it, see it in 3-D and be prepared to be amazed. I've seen 3-D movies before and having objects come out of the screen and poke at the audience is one of the main draws of 3-D. There's plenty of that in this movie but also something else I don't recall seeing --- that is having objects appear to come from behind the audience and move toward the screen. The story was good and interesting and the battle scenes, especially the last scene with the dragon, were exciting and imaginative. A great movie which will stay in my memory for a long, long time."
    },
    {
      "rating": "3",
      "text": "There are few things in this film that may remind you of the 8th century epic poem which it is supposedly based on. Pros: Some battle instances and scenary layout. Cons: -No deep understanding at all of Germanic conscience. -Angelina Jolie's character is a platitude in itself thanks to \"modern\" additions (female fluidity, females and temptation...etc). -In the poem, beowulf cuts the heads of Grendel and his mother. In the \"modern\" version, Mr. Zemeckis seems more interested in hinting at a sexual curse (with profuse tasteless puns and one-liners throughout the film) than in rendering the epic poem as it was originally compiled. -Complete misunderstanding of the conflict between Germanic and Christian thought in the original poem. -I bet Mr. Zemeckis has never read J. R. R. Tolkien's article \"The Monsters and the Critics\" in order to get to know what the monster deal in this epic poem is about. The film actually blasts away the sense of doom in these Germanic tribes' conscience and pays no attention to the description that the original 8th-century poem makes of Grendel and his mother. The important thing to Mr. Zemeckis seems just to display Miss Jolie and to bring up a circa 1975 depiction of grendel as a victim of society. It is a \"passtime\" film easily entertaining to people who have not read the original poem, who had no idea about its plot or cultural context and who may not express their disgust at Mr. Zemeckis' platitudinal and superficial portrayal of Germanic society. The director, the actors and the scriptwriter should have read the Anglo Saxon poem first (or Seamus Heaney's verse translation) and some articles on it, including Tolkien's \"The Monsters and the Critics\". This film is a \"fast-food passtime\", a lost opportunity that pays little homage to the original Anglo-Saxon work."
    },
    {
      "rating": "1",
      "text": "Aside from the graphics there is absolutely nothing original about this movie. It's all been done before, over and over again... and so on. Stereotypical, unoriginal, cliché."
    },
    {
      "rating": "0",
      "text": "Worst animated movie of all times!!!!!!"
    },
    {
      "rating": "8",
      "text": "What does the academy have against robert zemeckis .. heres an animated feature that was both incredible to watch and beautiful crafted and voiced picture.... not even a tech nomination ?"
    },
    {
      "rating": "6",
      "text": "The computer enhanced live action seems to be the main focus of the film, and once the novelty of that wears off, it doesn't leave much substance. It is impressive to watch however and I was never bored, but by the end I was a little tired of it."
    },
    {
      "rating": "10",
      "text": "Intense action rivaling LotR and 300."
    },
    {
      "rating": "2",
      "text": "At times, it almost looks cool, but never quite looks right. The story is a mess and Hollywood warps another classic tale by re-telling it the wrong way. A waste of time that will probably be loved by everyone who regularly watches the junk on Sci-Fi Network."
    },
    {
      "rating": "9",
      "text": "We should thank Mr.Zemeckis and the Anonymous writer of Beowulf for reminding us that: We father our own children of deeds."
    },
    {
      "rating": "6",
      "text": "We"
    },
    {
      "rating": "7",
      "text": "If you're going to rate 'Beowulf' fairly, you need to grade it on two seperate scales. On one scale is the 3-D and animation, which are (and this a word I rarely if ever use to describe anything) perfect- pore to pore, pimple to pimple, these characters and their world comprise what is without a doubt the single most realistic animated film ever. It doesn't hurt that the 3-D is put to very good use, not so much a ploy as it is a plot thread in of itself, as it totally and completely submerges us into the story. But if this sounds like a rave review, don't be mistaken- if anything, Beowulf is more of a failure than a success. Why? Well, for one, these characters, as realistic and stunning to look at as they are, are only that- stunning to look at. They have no depth, soul, and heart, which makes it very difficult to even care about them, let alone what they're doing or what's even happening the movie itself. The actual plot itself is a bit of a letdown, too- I realize that it's based on an old poem, but from what I've heard, they do change it quite a bit, and it's a shame that the story eventually desolves into a simple case of back and forth, back and forth (I won't reveal anything, but suffice to say, should you see it, you'll immediately see what I'm talking about, and just as quickly get heavy eyed). All in all, it is an entertaining, visually astonishing film... but altogether, it's just not a very successful or meaningful one."
    },
    {
      "rating": "10",
      "text": "Wonderfully enjoyable and unexpectedly sexy - and I'm talking about the hunky, naked lead himself! If you're gonna see it, you MUST experience it in 3-D. It made movie-going an actual event."
    },
    {
      "rating": "8",
      "text": "I am from Japan and I have never seen anything like this movie. The poem I read in class was somewhat like this. and i am wowed at this moment."
    },
    {
      "rating": "7",
      "text": "I love this movie. It was really great. Though it had some weird flaws. I didn't like some parts. It was okay. overall 7/10."
    },
    {
      "rating": "10",
      "text": "I love Robert Zemeckis. Even though some of his movies were downfalls, this movie was good. The 3d animation was amazing. How is that done? Great. Should win best animation for Oscar."
    },
    {
      "rating": "10",
      "text": "I recently read the book (poem) and the movie turned out to be very good even though there were some flaws. The animation was really great. I didn't think it would be like this, but it was amazing. The action was good and the whole concept was great."
    },
    {
      "rating": "9",
      "text": "Great. Barely any flaws. But great."
    },
    {
      "rating": "6",
      "text": "Stunning visuals. I'm amazed how far the technology has come and imagine where it will be in a few years. Its impact on the economics and traditional production of film-making will be resounding. The only serious flaw I care to dwell on also concerns the CGI. For all its achievements with realism, its still cannot replicate pathos or any of the subtler shades of feeling that constitute fine dramas. Characters appear sallow, their faces and eyes lack vitality, and their interactions are distant."
    },
    {
      "rating": "0",
      "text": "Don't be distracted by mediocre video game animation. This is a bad movie that throws the original epic out the window of a shiny Hollywood limo."
    },
    {
      "rating": "4",
      "text": "Might have been a good movie if they didn't blatantly sex it up for the male 13-29 demographic. It's hard to suspend disbelief when you can tell every second that you're being pandered to. Filmmakers also need to realize that overuse of CGI makes it extremely hard to suspend disbelief."
    },
    {
      "rating": "7",
      "text": "Visually stunning, especially the Digital 3-D that I saw. However, I don't know if I would've liked it much if I just saw the 2-D movie. There are some grand ideas here that seem to fall short, as if the screenwriters wanted to explore themes, but got lost thanks to the studio making cuts. I would've like to hear more about the loss of myths thanks to the move from polytheism to monotheism. It's mentioned, but feels more like an afterthought. The action scenes, however, are stunning, and the whole 3-D element gives it the feel of a great theme park ride. It succeeds in spades on that aspect alone. All it needs is a better told story."
    },
    {
      "rating": "9",
      "text": "This movie was purely entertaining. Solid story, great voice acting and stunning special effects. This will prove to be a high water mark in CGI actor movies much like Terminator 2 was for live action film."
    },
    {
      "rating": "10",
      "text": "How can people not like this film? It's fantastic, engaging, beautifully made and different than other things you see nowadays. Thoroughly innovative and fun. I never wanted it to end."
    },
    {
      "rating": "0",
      "text": "I've walked out of fewer than five movies in my entire life, and this was one of them. I'm sorry, but I don't see how an awful story/script can be redeemed by groundbreaking special effects. The only demographic I see this satisfying are 14 year old video game addicts, and the few adults who think the next breakthrough in Hollywood CGI constitutes \"art\" in film. I can just imagine how the script read... BEOWULF: AAAAHHHHHHH!!!!! Cut to Grendel. GRENDEL: AAAAHHHHHHH!!!!!! Cut to Beowulf's soldier. SOLDIER: AAAAHHHHHHH!!!!! Cut to King Hrothgar. HROTHGAR: AAAAAHHHHH!!!!!! And here's the real problem... CGI is getting so realistic it's almost good enough to fool you into believing the animated characters are real people. WHY do we want to do this? Is there some hidden virtue getting to this point? Consider this... why do people go to hear live musical performances when they can listen to practically perfect studio recordings without leaving their couch?"
    },
    {
      "rating": "0",
      "text": "Terrible. Just terrible. The animated actors are all stuck in the Uncanny Valley."
    },
    {
      "rating": "10",
      "text": "It was the best!! The movie was packed with 3D effects and I've never seen anything like it. Beowulf is one of the most entertaining movies I've ever seen so far."
    },
    {
      "rating": "0",
      "text": "\"I...am...Beowulf! *croaky*\"? What the hell? This is the worst phrase I never heard before (plus this film sucks, and has terrible stories). Ok, here's a great and catchy phrase: \"This...is...SPARTA!!\". Now this is what I call \"best voice\". Actor who played as Beowulf, please drink a lot of water."
    },
    {
      "rating": "10",
      "text": "What??i can't believe this movie getting 0s,this movie was incredible,best animated movie since toy story in my opinion. don't listen to those harsh criticizers. My guess is that they are old english scholars still reciting the beowulf poem or something. 10/10,hands down. watch it and be amazed."
    }
  ],
  "recommendations": [
    "blade_of_the_47_ronin",
    "the_13th_warrior",
    "9",
    "300",
    "jupiter_ascending",
    "sucker_punch",
    "king_arthur_legend_of_the_sword",
    "the_legend_of_tarzan",
    "the_witcher_nightmare_of_the_wolf",
    "morbius",
    "apocalypto",
    "the_green_knight",
    "mortal_engines",
    "avatar",
    "speed_racer",
    "300_rise_of_an_empire",
    "inception",
    "equilibrium",
    "the_bfg",
    "tomorrowland",
    "the_darkest_minds",
    "dredd",
    "cloud_atlas",
    "ready_player_one",
    "starship_troopers"
  ]
}