{
  "id": 323,
  "title": "Best Sellers",
  "starring": [
    "Michael Caine",
    "Aubrey Plaza"
  ],
  "runtime": 100,
  "genre": [
    "Comedy",
    "Drama"
  ],
  "description": "A cranky, retired author reluctantly embarks on a final book tour to help out a young publisher.",
  "releaseYear": "2021",
  "mpaaRating": null,
  "imageUrl": "https://image.tmdb.org/t/p/w500/ltGLKabCfw3ncCGsQ1aQEvWFCcf.jpg",
  "categories": {
    "plot": 10.0,
    "acting": 10.0,
    "ending": 5.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 10.0,
    "funny": 10.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "3",
      "text": "bad[ bad ]adjective, worse, worst;(Slang) bad·der, bad·dest for 36.not good in any manner or degree."
    },
    {
      "rating": "6",
      "text": "I really like Aubrey Plaza in her roles, so maybe I liked it a bit more because of that, but overall wasn't anything too impressive, but yet again was interesting to watch and not boring"
    },
    {
      "rating": "8",
      "text": "This movie deserves a higher score. I'm not a big Michael Caine fan at all but he's great in this. Give it go. It's a funny, irreverent film that knows what it is and doesn't pretend to be more important than it is. And yes, I'm referring to the sludge that is current superhero movies."
    },
    {
      "rating": "5",
      "text": "It's way too predictable, it's really, really predictable.It helps that both Michael Caine and Aubrey Plaza manage to sell the material enough so that it doesn't become a 100% disposable experience, but there's nothing to highlight for their careers here.Not that it has to, yet it's so painfully generic."
    },
    {
      "rating": "10",
      "text": "This is a truly heartwarming film, funny, beautiful, and sad, this is a man who lost his love forever, the man is hopeless, behind his funny bullsh*te word, he's the man who lost, a former writer who want to write one last time, helped by a woman who worked as a book publisher, it's a beautiful story, and the movie is perfected by a powerful and incredible performance by the great Michael Caine and Aubrey Plaza, Best Sellers is amazing."
    },
    {
      "rating": "10",
      "text": "This movie was extremely well written and directed. The story is plausible and the scenarios are convincing. The brilliance in this movie are all the curveballs and twists that you just don't see coming. It is heart wrenching, funny, irreverent, embarrassing and delightful.It builds logically and intelligently until you are so engrossed that you are sure that you know about what is going to happen next. You are going to be wrong....Anyone who has rated this movie poorly has only watched the trailer. The 'Best Sellers' movie is excellent!MGKamau"
    },
    {
      "rating": "8",
      "text": "ewfjnekwnfkewnkfjnjwkenfkjnrwkjgnkjrwefewffewfewfewfewfnewnfkewnfnewknfkewnkfnekwnf"
    },
    {
      "rating": "10",
      "text": "Loved this film.  Michael Caine is exceptional as the drunken curmudgeon and broken artist.  There's a nice depth to this film that encourages the viewer to think a little deeper, that combined with an exceptional script that regularly injects the perfect amount of wit and humour into the situation makes for a really enjoyable watch!"
    }
  ]
}