{
  "id": 4098,
  "title": "Better Watch Out",
  "starring": [
    "Olivia DeJonge",
    "Levi Miller"
  ],
  "runtime": 89,
  "genre": [
    "Comedy",
    "Horror",
    "Thriller"
  ],
  "description": "On a quiet suburban street tucked within a 'safe neighborhood', a babysitter must defend a twelve-year-old boy from strangers breaking into the house, only to discover that this is far from a normal home invasion.",
  "releaseYear": "2017",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/liI4c3GYaKuAo4FsCF4RKvFFqbV.jpg",
  "categories": {
    "plot": 8.153846153846153,
    "acting": 7.833333333333333,
    "ending": 6.5,
    "soundtrack": 5.0,
    "cinematography": 10.0,
    "familyFriendly": 3.0,
    "funny": 3.625,
    "action": 10.0
  },
  "reviews": [
    {
      "rating": "10",
      "text": "This was in my top 3 movies for 2019, behind Freaks and Joker. I was seriously left with knots in my stomach by the end.  Roger Corman said once that rule #1 is to have a good script, and this one is excellent. This movie was a real surprise.  It steadily ratchets up tension little by little like a pressure cooker. It was very well photographed, the lighting and color pallette were extremely well organized. The camera is always in exactly the right spot, moving when it should, the way it should.  The performances were all very effective, a real accomplishment considering the age and experience level of everyone involved.  All in all I was really impressed by this thrilling little movie."
    },
    {
      "rating": "7",
      "text": "Yes, I watched a Christmas movie in February...Pretty original take on this genre! This had some good gore and expectation subversion, but despite it's 1h28m runtime felt a bit dragged out."
    },
    {
      "rating": "8",
      "text": "This movie is legit terrifying. Like, I felt actual fear just reviews of the movie after the fact. The entire thing is elaborately set up and the horror aspects fit perfect in with the themes its trying to push. The whole thing is really well put together, with the humor and the serious bits never undoing one or the other. The fear that you feel with the idea that the **** kid might actually get away with it is possibly the most tense and fearful moment in the movie for me watching it. I felt real scared that they were going to go that way, and for the leading lady as well. Seriously, this movie shocked me with how good it was. I went in expecting a normal holiday slasher. Effective twist, effective story, and great acting from pretty much everyone. To be fair, I went into this movie completely blind and without expectations, which may be where a lot of disappointment is coming from. Still, this movie stands strong on its own, and the notion of your primary disappointment coming from the idea that you were expecting something different is possibly the dumbest thing I've ever heard."
    },
    {
      "rating": "10",
      "text": "This is a high-calibre accomplishment. New Yorker once praised Stephen King's genius as evident in his ability to make unbelievable stories believable. And this is what happens here. And by doing that, in an original story and formulation, we are faced with a brave depiction of our psychology.. as the characters transcend into psychological constructs in each of us. And facing our own so vividly is truly horrifying."
    },
    {
      "rating": "5",
      "text": "It should be fun but it’s another Christmas slasher without bigger plan. The finale is aonly bright side of production, which in a very graphic way unmasks the great plan of the main character. This is not my favorite black comedy but for the it fits in a Christmas atmosphere."
    },
    {
      "rating": "1",
      "text": "if you have seen a film called funny games and liked that, then this is for you, if like me you thought based on the trailer it was gonna be home alone for adults, then like me you will be misled. this film is terrible, its pointless, it serves no purpose and is disgusting, although well acted and that's all i can say, it only serves as a guide to how sadistic people can be, it is extremely difficult to watch in places, i don't know if your supposed to like or sympathise with the bad guy or not cos i just don't know what this film was trying to do but the humour is all wrong, every saw film is superior to this for the fact it knows torture and death is terrible and theirs nothing funny about it, please avoid unless your sadistic and like funny games"
    },
    {
      "rating": "1",
      "text": "While actors are fine, the whole movie is just so utterly disgusting and unbelievable that even its numerous plot twists (which are not as clever as the scriptwriter wanted them to be) cannot save it."
    },
    {
      "rating": "9",
      "text": "Surprising, goes against cliches in a way that made me enjoy the ride. Acting was great from everyone and the main characters are developed enough to make you care. Can't say much about the story without spoilers but some people won't find some events believable which will make this movie divisive. While the story as a whole is well thought of, there are a couple of plot holes that can't be overlook. Didn't stop me from loving the movie a lot though. I'll see it again next Halloween for sure."
    },
    {
      "rating": "6",
      "text": "Surprising, well-acted which is something incredible, consistent, well-directed, funny and humorous and I can say that despite its simplicity it manages to catch you and give you something a little bit more different than what you expected.Nothing remarkable but for 88 minutes is entertaining enough."
    },
    {
      "rating": "3",
      "text": "What a weird mess of a movie. The \"twist\" was telegraphed quite poorly and the film lacked tension. Plus, the way it was shot and edited made everything feel grossly sexual, in a really tawdry way. Shut it off halfway through."
    },
    {
      "rating": "8",
      "text": "Honestly, this film frustrated me until the very, very end, and then I was totally onboard. Worth the watch if you are in a holiday horror mindframe. Also the trailer is too spoilerific for my liking."
    },
    {
      "rating": "5",
      "text": "Well, that subverted my expectations.Go into this blind like I did. Kept me glued to the screen.Also, there's a lot of voice breaking in this movie from the young two boys. And I do mean A LOT."
    },
    {
      "rating": "8",
      "text": "Why haven't I watched this before?! This is absolutely insane! (and a modern Christmas classic)"
    },
    {
      "rating": "9",
      "text": "A horror twist on an old classic (Home Alone), Better Watch Out is a demented christmas horror movie that goes away from repetitive tropes, and instead offers character motivations, dilemmas, twists at every turn and keeps the viewer interested until the end."
    },
    {
      "rating": "10",
      "text": "I got into this movie without knowing too much about it,i only watched first 20-30 seconds of the trailer and realised that it is a home invasion type of a movie.And boy was i wrong.I am really glad that i didnt finish watching the trailer because i think it reveals too much.Movie really suprised me in a positive way and i enjoyed it WAAAAYY more than i thought i would.Cast was amasing,especially Levi Miller.I dont want to include spoilers here so i wont go into story too much.Its a pretty good horror/comedy christmas movie that has a lot of foreshadowing of Scream,Home Alone and The Strangers that i found really nice.Highly recommend this movie to anyone looking for a decent psychological horror comedy.It is definitely going to my christmas movies list!! And also please watch this movie without watching the trailer first or reading too much about it,the twist is really big and you will be shocked if you dont know too much about it."
    },
    {
      "rating": "9",
      "text": "The only problems the film has is it's bad way of telling it's message. I didn't know it had a message till someone told me. Better Watch Out is a genius film! I was blown away! I can't say too much, just watch it!"
    },
    {
      "rating": "2",
      "text": "It's been a while since a movie's made me feel physically ill, to the point where I wish this movie came with a warning- \"Viewers must like torture porn & deplorable characters\". I love horror and sinister characters, but I'm having a hard time thinking of anyone finishing this movie and saying 'Wow, that was a BLAST!'. It's not. It was hard to sit through, and it only sunk lower. Filmmakers have a choice to consider their audience, and even if a story is told well: Is it WORTH telling? Is there comeuppance? The blow at the end of the movie that leaves audiences with a sense of satisfaction? In the case of Better Watch Out, no, there isn't."
    }
  ],
  "recommendations": [
    "unfriended",
    "dark_skies",
    "devil",
    "the_mist",
    "old",
    "chernobyl_diaries",
    "dead_silence",
    "insidious_chapter_2",
    "would_you_rather",
    "unfriended_dark_web",
    "malignant",
    "the_possession",
    "bird_box",
    "house_at_the_end_of_the_street",
    "countdown",
    "insidious",
    "the_haunting_in_connecticut",
    "ready_or_not",
    "wish_upon",
    "brightburn",
    "awake",
    "paranormal_activity_4",
    "hereditary",
    "demon_slayer_kimetsu_no_yaiba_to_the_swordsmith_village_",
    "the_twilight_saga_breaking_dawn_part_1"
  ]
}