{
  "id": 4608,
  "title": "Beverly Hills Cop III",
  "starring": [
    "Eddie Murphy",
    "Judge Reinhold"
  ],
  "runtime": 105,
  "genre": [
    "Action",
    "Comedy",
    "Crime"
  ],
  "description": "Back in sunny southern California and on the trail of two murderers, Axel Foley again teams up with LA cop Billy Rosewood. Soon, they discover that an amusement park is being used as a front for a massive counterfeiting ring – and it's run by the same gang that shot Billy's boss.",
  "releaseYear": "1994",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/7vIpCkgGEfk5LZwm78nMxswLJRH.jpg",
  "categories": {
    "plot": 2.8181818181818183,
    "acting": 2.6,
    "ending": 2.5,
    "soundtrack": 3.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 4.666666666666667,
    "action": 3.2222222222222223
  },
  "reviews": [
    {
      "rating": "9",
      "text": "I actually liked this movie."
    },
    {
      "rating": "10",
      "text": "Top film! really enjoyable and one that can be watched over again!"
    },
    {
      "rating": "7",
      "text": "Really doesn't deserve its current rating. Not the best out of the series by far, but still an enjoyable film."
    },
    {
      "rating": "9",
      "text": "My god this movie got a 15 really it wasn't that bad at all I loved it when i was younger and watched it again recently and it still is awesome."
    },
    {
      "rating": "2",
      "text": "Stupid, lazy, ridiculous and unfunny.I don't where this franchise went wrong (probably everywhere looking at this final instalment), especially considering how brilliant the original is, but this is one dumpster fire of a movie."
    },
    {
      "rating": "7",
      "text": "saw this movie its more kid friendly than the other 2 but its funny. somewhat enjoyable its honestly not that bad of a movie... idk why reviewers gave it bad reviews theres obviously movies 10x worst. if youve seen the first 2 then this one will also be fun."
    },
    {
      "rating": "3",
      "text": "Gutless sequel with little to no humor. A complete waste."
    },
    {
      "rating": "1",
      "text": "What happened? The first two (mostly the first one) was the start of a very promising series! In this one, the violence is very bland and the plot is even more formulaic. And the bombshell is that Eddie Murphy didn't play the character like he did in the first two."
    },
    {
      "rating": "3",
      "text": "As surely as if it were a McDonald's or a Burger King, \"Beverly Hills Cop III\" is part of a money-making franchise, though this one has been abandoned for so long it has cobwebs on top of cobwebs. It has been seven years since \"Beverly Hills Cop II,\" and a decade since the blockbuster original. But recently Eddie Murphy's career has seen some box-office duds like \"Boomerang,\" so it's no surprise that \"Beverly Hills Cop III\" has surfaced, a sequel designed to be as foolproof as possible. The strategy is to bring back familiar characters while throwing lots of cash and special effects at the screen.\r This time Axel Foley, the Detroit detective who always outsmarts the villains and the laid-back Beverly Hills police, winds up in an elaborate California theme park called Wonder World, a front for a crime ring that also has the F.B.I on its trail. The film includes so many explosions, car chases, gunfights and other unnatural disasters -- all played with frenetic energy -- that it takes a while to realize something is off kilter besides the Tilt-a-Whirl. Axel has lost his sense of humor.\r Every comic moment is cut short and even Mr. Murphy's smile seems forced. No longer the hero who hid behind a \"Saturday Night Live\" array of accents and a knowing grin, this Axel might as well be Axl Rose.\r The opening sequence, set in Detroit, promises the high-voltage mix of humor and action that made the original \"Cop\" movies so popular. Axel and his men close in on a ring of car thieves. Inside the garage, the radio plays the Supremes' \"Come See About Me,\" and the thuggish mechanics do a wicked lip-sync, complete with choreography and a strategic Diana Ross elbow to one of the backup singers.\r Then, the episode takes off in an extended, violent scene that includes a couple of murders, many machine guns and a car chase in which the hood of Axel's car is blown off. As he accidentally runs over a body dumped from a moving truck, Axel gives a facial expression that says, \"Whoops.\" It's irreverent and effective.\r John Landis, who directed Mr. Murphy in \"Trading Places\" and \"Coming to America,\" pulls out all the stops. But the action is never again as fast, furious or suspenseful as in the opening scenes.\r And the few moments of genuine satire that follow make viewers realize what's missing. When Axel arrives at the gate of the Beverly Hills Police Department, he is greeted with an automated voice that offers to continue the message in English, Spanish, French or Farsi, and to direct him to the riot-rumor hot line.\r The high point of the film belongs to Bronson Pinchot as Serge, the character with the tortured foreign accent who was a crowd pleaser in the original \"Beverly Hills Cop.\" No longer working at the art gallery, Serge now owns a Survival Boutique, dealing in fashionable self-defense weapons, or as he puts it, \"wee-pons.\" His sing-song sales pitch for items to foil car thieves: \"Do you want to die for your Camry? I don't sink so.\"\r Judge Reinhold returns as Axel's Beverly Hills police pal, Billy Rosewood, and Hector Elizondo is a new family-man character, replacing Sergeant Taggart in the earlier films. These men don't have much to do until the final shootout.\r Playing it safe, \"Beverly Hills Cop III\" even uses the trendy ploy of dropping in celebrity cameos, including many directors. Among them is George Lucas as a patron Axel annoys by cutting in line at Wonder World, Barbet Schroeder as a man parking a Porsche, and John Singleton as a fireman. The founder of Wonder World, lovable Uncle Dave, is played by Alan Young, better known as the owner of Mr. Ed.\r Mr. Murphy seemed to be having much more fun in the maligned \"Boomerang.\" At least he tried something different there, playing a caddish romantic hero. \"Beverly Hills Cop III\" is a generic action movie, an Eddie Murphy film with only a trace of Eddie Murphy."
    },
    {
      "rating": "9",
      "text": "Beverly Hill Cop 3 is the worst of the Beverly Hills Cop franchise but it is still a really solid movie.  It is definitely the most appropriate and the least funny but I still love it.  It does not deserve a 16 on Metacritic."
    },
    {
      "rating": "3",
      "text": "The third part of the Beverly Hills Cop films and I'll share the rough story shortly but first there's questions in Beverly Hills Cop III to be answered like who killed John Saxon's character because you never see. I'm only presuming it's Fullbright but it never shows you the killer so that's open to discussion and the guards at Wonderworld are looking around for Axel Foley with a photo of him so how the hell did he get into an okie dokie elephant suit without being obvious or without detection?..... BEVERLY HILLS COP III was made in 1994 by director John Landis and stars Eddie Murphy, Judge Reinhold, Hector Elizondo, Theresa Randle, John Saxon and Timothy Carhart...... The basic story is Detective Axel Foley (Eddie Murphy) whilst investigating a car theft ring gets shot at but not killed, his boss however does get murdered and he tracks the murderer down to a theme park in America somewhere called Wonderworld that has rides and attractions... Judge Reinhold returns as cop Billy Rosewood and some of the action scenes are pretty good especially the part with two guards from Wonderworld shooting at Axel Foley (Murphy) in Wonderworld and Foley fights back with some high tech weapon called the annihilator 2000 and causes a massive explosion and killing one of the security guards but it also played music which was hilarious. Beverly Hills Cop III is okay but I felt it was rushed and the story and action along with the acting didn't quite fit into the original first two movies so it was good to see Eddie Murphy return but it was a wasted trip. Beverly Hills Cop III is not very good but anyway it's an action, comedy sequel that contains humour, violence and bad language."
    },
    {
      "rating": "6",
      "text": "This review is longheaded, so you can skip it if you don't have a lot of time. A lot of people hated this film and I have to admit, this was hot garbage compared to I and II. I kind of liked the first 2 acts of this film, but then it got ridiculous in the third act. In the last 30 minutes of the film, Eddie Murphy and some  other guy I forgot were talking about how they were going to kill Ellis De Wald and his crew. BUT Ellis De Wald and his crew appeared from who knows where and they some how heard everything they said. But the ridiculous moments in this film made me crack up, so this movie still gets a 6/10 from me."
    },
    {
      "rating": "4",
      "text": "All sorts of stupid but not unentertaining. Murphy is fine but the film is quite poorly-made."
    },
    {
      "rating": "1",
      "text": "To see BHC3 feels like you are watching an episode of Brooklyn Nine-Nine minus the chemistry and the humour.... Its uninspiring bad tv at its best, but sat next to the original two films? It is no more than a massive disappointment."
    },
    {
      "rating": "3",
      "text": "Terrible SequelBeverly Hills Cop III is not that funny, the action is bland, the script is garbage, and not even Murphy is that good here which is shocking considering how funny he is."
    },
    {
      "rating": "7",
      "text": "not gonna lie really enjoyed this movie mmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmm yes"
    },
    {
      "rating": "5",
      "text": "Beverly Hills Cop III is a 1994 action comedy which see's the return of Eddie Murphy as Detroit cop, Axel Foley and Judge Reinhold also returns..... Sadly John Ashton isn't available in the last film of the series... Beverly Hills Cop III is directed by John Landis and Axel Boss gets murdered during a chopshop operation and shootout. Axel Foley (Eddie Murphy) tracks the killer to some weird theme park called Wonderworld and takes the badguys down. Full of bizarre moments and some funny but Beverly Hills Cop III is very weak and a bad film but not the worst ever made so I'm being generous and giving it a 5 because it maybe rubbish compared to Beverly Hills Cop and Beverly Hills Cop II but I think it's watchable at least but still the worst one. Contains violence and bad language."
    }
  ]
}