{"id": 3586, "title": "Beverly Hills Cop", "starring": ["Eddie Murphy", "Judge Reinhold"], "runtime": 105, "genre": ["Action", "Comedy", "Crime"], "description": "A freewheeling Detroit cop pursuing a murder investigation finds himself dealing with the very different culture of Beverly Hills.", "releaseYear": "1984", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/eBJEvKkhQ0tUt1dBAcTEYW6kCle.jpg", "categories": {"plot": 8.916666666666666, "acting": 9.428571428571429, "ending": 9.25, "soundtrack": 10.0, "cinematography": 6.0, "familyFriendly": 3.0, "funny": 8.64, "action": 9.076923076923077}, "reviews": [{"rating": "8", "text": "Is this the man who wrecked the buffet at the Harrow club this morning?  Is this the man who lured Taggart and Rosemont into a gross dereliction of duty at a strip-tease establishment?  Rosewood, sir. This is not my locker.  Still funny years later."}, {"rating": "10", "text": "Beverly Hills Cop is an action, comedy, crime thriller directed/made in 1984 by Martin Brest.... When a friend of Detroit cop Axel Foley (Eddie Murphy) is murdered and the badguys fade away without trace, Axel Foley investigates the murder and ends up in Beverly Hills I think... Not sure if this film was filmed in Los Angeles area or California or somewhere else and it's a bit confusing the exact area it was filmed in which is rather dumb to be honest and all I know for 100% certain is it's in America.... Axel Foley (Eddie Murphy) teams up with two cops who were originally against him and thought he was some troublemaker and the cops in question are Detective Billy Rosewood played by actor Judge Reinhold and Sergeant Taggart played by John Ashton..... Axel Foley (Eddie Murphy), Rosewood and Taggart take down the badguys at the end after Jenny Summers gets involved with the murder investigation and kidnapped. The end is full of shootouts, bullets flying around everywhere and Victor Maitland (Steven Berkoff) getting shot by Detecve Axel Foley and Ronny Cox who's another cop..... The action scenes are great and so is Axel Foley (Murphy) sticking banana's up the cops exhaust pipe and sending them coffee and doughnuts whilst keeping an eye on him in a car... Great humour, violence and action make Beverly Hills Cop a decent movie however the sequels were nowhere near as good especially the one directed by John Landis."}, {"rating": "7", "text": "For me Beverly Hills Cop has age far from perfectly. Compared to other Murphy 80's hits like Trading Places and 48 Hours, both which still hold as some of the better mainstream flicks from early in the decade, this film, which was a massive box office hit, shows it's weaknesses in originality and intelligence. Murphy is very good, and it's certainly funny enough to recommend, but it lacks a certain wit, and the ending is really cliche."}, {"rating": "6", "text": "Excellent cast, decent cinematography and great Eddie Murphy vehicle. A classic. However BHC overall feels decidedly average to watch in 2020, and seems unsure of which genre it is scene by scene... but it still has the 'x' factor and a lot of heart which helps to elevate the basic material. Definitely worth a watch!"}, {"rating": "8", "text": "Beverly Hills Cop is released in that era where Eddie Murphy didn't betray us all during the years. He's trying so hard and so far we only take him as a Donkey in the 2000's. In the 1980's and 1990's, we take him as any kind of these movies released."}, {"rating": "8", "text": "\"Beverly Hills Cop\" finds Eddie Murphy doing what he does best: playing the shrewdest, hippest, fastest-talking underdog in a rich man's world. An opening montage establishes the ghetto origins of Axel Foley, the Detroit policeman whom Mr. Murphy plays. But Axel turns out to be much more at home in the posh California settings where most of the film takes place. Cruising the streets of Beverly Hills in his jalopy, or strolling into hotels and restaurants in a well-worn sweatshirt, Axel maintains every bit of his cool. Far from being daunted, he enjoys the challenge. Axel's confidence never wavers, nor does his natural authority - and for that, audiences will love him.\r ''Beverly Hills Cop,'' which opens today at Loews State and other theaters, is an even better showcase for Mr. Murphy's talents than ''Trading Places'' was, although it gets off to a shaky start. A Detroit prologue, combining an over-scored car chase sequence with the murder of Axel's best friend, is somewhat bungled; Martin Brest, the director, establishes the friendship in such brief and sodden terms that it's a wonder Axel cares at all about finding his buddy's killers. But track them he does, and the trail leads him to a Beverly Hills art gallery filled with hilarious modern sculpture. Searching out the owner, Mr. Murphy's Axel is soon booted through a plate-glass window, At that point, two blond policemen arrest him for disturbing the peace.\r However, he easily establishes the upper hand. He takes up residence in an elegant hotel that was not expecting him, after loudly intimating that the desk clerk may be practicing racial discrimination and also announcing that he's in town to interview Michael Jackson. He also makes some inroads with the local police force, who get to know him after arresting him and following him around town, and who cannot help but admire his technique. Notwithstanding the title, Axel never does join the Beverly Hills police himself. But he manages to teach them a thing or two about how to invent fish stories, how to bend the rules, and why it's imperative that no one ever put a banana in the tailpipe of a patrol car.\r Although ''Beverly Hills Cop'' is less strictly a comedy than ''Trading Places'' was, it loses nothing by allowing Mr. Murphy a broader role; his brashness is as well suited to detective work as to sweet-talking his way out of trouble. He comes closer than ever to being able to carry a film single-handedly, although this one surrounds him with an excellent supporting cast. Mr. Brest displays a particular talent for positioning just the right actors in small roles and letting them make their marks succinctly. John Aston and Judge Reinhold are well teamed as a stuffy police sergeant and his more laissez-faire young partner, and Ronny Cox is suitably dumbfounded as the superior who can't quite understand why this Mr. Murphy's newcomer has the regulars on the ropes. Steven Berkoff makes a chilling villain named Victor Maitland, and Lisa Eilbacher is appealing as an old friend of Axel's who happens to be in Maitland's employ. The brief scenes in Maitland's art gallery are greatly enlivened by Bronson Pinchot, whose accent should baffle linguists everywhere. Mr. Pinchot even steals these scenes from Mr. Murphy, which can't have been easy.\r ''Beverly Hills Cop'' was written by Daniel Petrie, Jr., who co-wrote the story with Danilo Bach. The material never makes an overt issue out of Axel's blackness (indeed, the role was once intended for Sylvester Stallone), except on several occasions when Mr. Murphy slyly uses it as one more weapon in his conversational arsenal. However, the mere juxtaposition of a shabbily dressed Mr. Murphy and the film's staid Beverly Hills locations has great comic potential, in view of the star's unfailing superiority. To the extent that Mr. Murphy has a true co-star here it is the city itself, which throws up a long parade of obstacles to his mission, and which seems a constant reproach to his renegade ways. But Mr. Murphy knows exactly what he's doing, and he wins at every turn."}, {"rating": "6", "text": "The plot is so stupid and out of the pragmatic comedy parameters. This is one epitome of the rating hypocrisy that Very good movies go under rated terrible, and the utter bagatelle and trivial ones get good accolade."}, {"rating": "10", "text": "Beverly Hills Cop is ya typical action comedy but this has style, good storyline and fun... Beverly Hills Cop is a 1984 film that stars Eddie Murphy, Judge Reinhold, John Ashton, Ronny Cox and Steven Berkoff..... Eddie Murphy is Detroit cop Axel Foley tracking down a killer after his friend is murdered. So many funny moments including bananas up the tailpipe and also a great finish as the badguys all die and a huge shootout with bullets being sprayed everywhere. Some good action sequences and bad language and possible nudity. Beverly Hills Cop spawned two other sequels but the original is still the best and remains a classic. On another note the acting is top draw especially from Eddie Murphy and I can't find one fault with the movie unlike it's sequels."}, {"rating": "10", "text": "Outstandingly written and extremely hilarious, Beverly Hills Cop is to this day one of the best comedies ever not to mention a hilarious performance by Eddie Murphy."}, {"rating": "9", "text": "Beverly Hill Cop is a very fun 80's action movie with a formulaic plot and cookie-cutter, run-of-the-mill,  cop characters. What pulls he movie off and generates almost al the hype about it is Eddie Murphy's funny, smart performance as Axe Foley."}, {"rating": "8", "text": "In comedy terms this isn't Eddie Murphy at his absolute best, but a film that starts off light-hearted and gradually builds quite a bit of tension is definitely worth watching almost 30 years on.\rMurphy stars as Detroit cop Axel Foley, who gives his precinct more than enough problems with his unauthorised undercover operations.\rBut when an old friend from Beverly Hills comes to visit, tragedy soon strikes and Axel soon jumps back into his unauthorised ways to try and figure out just who the shady characters are that are lurking around Beverly Hills. He takes in everything with zest, the overpriced hotels, mercedes everywhere and fashion sense gone wild. But as Foley begins to uncover secrets regarding the men he is after, he is really stuck for people to turn to, seeing as he is supposed to be on holiday and has also been told by his boss back in Detroit to stay away from the ongoing murder case.\rHe is also being followed by two bungling cops Rosewood (Judge Reinhold) and Taggart (John Ashton), who keep getting spotted by Axel in their stakeouts, but who prove useful as the film plays out.\rBeverly Hills Cop never really attempts to be a big flashy film, instead going for a more subtle and almost TV like approach, until the closing stages of the film obviously.\rEddie Murphy stars in arguably his most iconic and recognised role as Foley, he's sharp-witted, funny, and he feels very much realistic, unlike many other fictional characters, he is surprised when all the events start unfolding, but still keeps true to finding justice.\rThe film plays with an upbeat and energetic soundtrack, perfectly capturing the glitz and glam of the story, and showcasing 1980s Los Angeles, while also playing out the iconic theme that is still remembered to this day.\rThe comedy is pure and side-splitting, whether Foley is impersonating the very uptight chief of the Beverly Hills Police, or if he is casually walking in to a swanky Beverly Hills apartment and starting an argument with the desk clerk, it all showcases an expertly written and well directed film that is still fun to watch decades later."}, {"rating": "7", "text": "Definitely an entertaining movie that provides its fair share of laughs. Murphy is hilarious in his role and does really well acting-wise as well, Judge Reinhold is also quite goofy in his role. The main issue is that it  can be kind of slow at times, though as a whole, this movie is certainly entertaining enough."}, {"rating": "10", "text": "Where do I start?\r This is undoubtedly the greatest comedy of all time. The action is also well filmed.\r The plot is quite a simple 'my friend was murdered, gonna go undercover.'/Cat-and-mouse story. But it is done in a unique, interesting, hilarious way. Though being hilarious... the film also plays as a gritty crime story.\r There are lots of memorable lines such as: \"Get the f*** outta here!\", “This is not my locker”, “You do that again, I’ll shoot you myself” and “Don’t you think I realise what’s going on here, miss? Who do you think I am, huh? Don’t you think I know that if I was some hotshot from out of town that pulled inside here and you guys made a reservation mistake, I’d be the first one to get a room and I’d be upstairs relaxing right now. But I’m not some hotshot from out of town, I’m a small reporter from “Rolling Stone” magazine that’s in town to do an exclusive interview with Michael Jackson that’s gonna be picked up by every major magazine in the country. I was gonna call the article “Michael Jackson Is Sitting On Top of the World,” but now I think I might as well just call it “Michael Jackson Can Sit On Top of the World Just As Long As He Doesn’t Sit in the Beverly Palm Hotel cause There’s No N*ggers Allowed in There!”. Yeah, it's a very crude film involving lots of swearing, but if you can deal with that, then it is a must watch comedy CLASSIC!\r Also it is maybe the most rewatchable film of all time.\r 9.9/10- Outstandingly written and extremely hilarious, Beverly Hills Cop is to this day one of the best comedies ever... not to mention a hilarious performance by Eddie Murphy."}, {"rating": "7", "text": "Classic! If you haven't seen this amazing action comedy ,do it now! Eddie Murphy is one of the greatest comedians and actors this world has ever known, and this is one of the movies that prove it! My score for the first part of the trylogy \"Beverly Hills Cop\" is 7/10"}, {"rating": "10", "text": "Wow, I was surprised at how brilliant this film was. It was funny and thrilling and had Eddie Murphy in his best role. It looks great, with the cinematography, scenery and editing all stylish, and the soundtrack is note-perfect, while the script is fresh, believable and funny with plenty of wit, and the story is thrilling and fast paced. The direction is assured, and the acting is great. Eddie Murphy is brilliant playing his most likable character to date, and shares a believable chemistry with Judge Reinhold, John Ashton, Lisa Eilbacher and Steven Berkoff who all match him without fault. In conclusion, greatly enjoyable, and much better than its sequel. 10/10 Bethany Cox"}, {"rating": "8", "text": "Eddie Murphy in his glory days, as a cynical, loud mouth detective who is after the murderer of his best friend, but in the colorful region of Beverly Hills. This is another of the essentials of the 80s for its comical and action sequences, as well as its OST."}, {"rating": "2", "text": "Je dis pas, Eddie Murphy est parfois drôle -enfin drôle, façon de parler, plutôt vaguement distrayant- à s'agiter et tchatcher dans tous les sens devant une bande de neuneus tantôt râleurs et aigris, tantôt tout acquis à sa cause, émerveillés par le clown et son numéro !Mais on ne se bidonne pas, nous par contre, devant ce film bidon qui vole à peine au ras des pâquerettes et tente de glisser sur la vague des clichés \"racistes\" qu'il démonte et dont il se moque avec une naïveté et une maladresse confondantes. Car, faut-il vous le dire -au cas où- ce flic à Berverly Hills (quartier très chic à ce qu'il semble) est un Noir ! et de la ville de Détroit qui plus est... remarquez c'était avant que Détroit ne soit comme... aujourd'hui.Toujours est-il que ce comique de situation et de préjugés est du même acabit qu'un épisode des Jours heureux (Happy Days en VO putain) sauf que Fonzy est devenu noir, s'habille comme charlot et débite des conneries à plein tube sur la musique Bontempi des années 80.Oui, cest vraiment très con comme film, trop con pour en supporter ne fût-ce qu'un peu plus de la moitié !"}, {"rating": "5", "text": "Somewhat entertaining cop-comedy with some decent humour though not a lot of originality."}, {"rating": "5", "text": "Just an entertaining movie for the masses with unrealistic scenes. The movie is also outdated with ridiculous action scenes and simple story. There are some funny scenes though, but surely they cant save the movie."}, {"rating": "10", "text": "A cult classic, box office hit and the signature role for Eddie Murphy. It is an action comedy that has a lot of charm aside an Eddie Murphy at his best. It is the story of the unconventional and street wise Detroit cop Axel Foley who gets draw into events by an old childhood friend. The clues lead him to Beverly Hills. I am extra vague to avoid spoilers as this is a classic I recommend watching. The story is as entertaining as interesting. The bad guy has a smart plan and good defense. However a lot of the enjoyment comes from the actors. I sound like a broken record if I repeat myself but Eddie Murphy put his heart and soul into his performance and shines. Judge Reinhold, Lisa Eilbacher and Jonh Ashton also make also great performance and enhance the movie. Steven Berkoff is a nice love to hate antagonist I praise. We got an overall remarkably good performance from the whole cast. With this I have also to praise the team behind the screen as a bad script or director cant be remedied by good actors (As modern movies have taught me). The humor is also spot on and more modern movies could learn a lot from this. Lastly I want to praise the soundtrack. While all tracks are good “Axel F” by Harold Faltmayer became a classic that is still covered today. Overall I recommend this movie and give a 10/10. It is still as good today as back then."}, {"rating": "9", "text": "Hilarious Action FilmEddie Murphy was absolutely perfect for this film, He had me dying of laughter nonstop in this classic action film."}, {"rating": "8", "text": "21 Years later, The Evil Crazy Frog would later remix this song and cause a mass destruction to the world."}, {"rating": "8", "text": "Wirklich witziger Film, einfach empfehlenswert. Eine Art Robocop in Witzig."}, {"rating": "7", "text": "Una película llena de diversión y acción para pasar un buen rato agradable."}, {"rating": "10", "text": "One of the best comedies of the 1980's.A vechile to show off the comedic talents of Eddie Murphy, this well paced and well written movie is still funny today."}], "recommendations": ["bad_boys", "beverly_hills_cop_ii", "beverly_hills_cop_iii", "shanghai_noon", "lethal_weapon", "red", "spy", "red_heat", "shanghai_knights", "due_date", "tower_heist", "the_nice_guys", "sister_act", "the_pink_panther", "the_boss", "grudge_match", "red_2", "training_day", "the_naked_gun_from_the_files_of_police_squad", "true_lies", "the_rock", "spenser_confidential", "lethal_weapon_3", "skiptrace", "from_paris_with_love"]}