{"id": 4272, "title": "Beverly Hills Cop II", "starring": ["Eddie Murphy", "Judge Reinhold"], "runtime": 103, "genre": ["Action", "Comedy", "Crime"], "description": "Axel heads for the land of sunshine and palm trees to find out who shot police Captain Andrew Bogomil. Thanks to a couple of old friends, Axel's investigation uncovers a series of robberies masterminded by a heartless weapons kingpin—and the chase is on.", "releaseYear": "1987", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/egDakU8O5yUwpUJP9IMAUVtIDll.jpg", "categories": {"plot": 4.571428571428571, "acting": 3.6, "ending": 5.0, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 3.0, "funny": 5.375, "action": 4.571428571428571}, "reviews": [{"rating": "6", "text": "I just watched this movie this afternoon, and i thought to myself:  Well, it's not great, but its not bad either\". It has its own share of laughter and action, and it is overall a pleasant movie."}, {"rating": "6", "text": "In the interval between ''Beverly Hills Cop'' and ''Beverly Hills Cop II,'' Axel Foley, the brash young police detective from Detroit, has been on at least one fishing trip with Billy Rosewood (Judge Reinhold), John Taggart (John Ashton) and Andrew Bogomil (Ronny Cox), his friends on the Beverly Hills force. Some other things have happened as well. Axel has become, in the mind of the nation if not in his own, the supreme practitioner of inspired back talk, the wise guy against whom all others are measured. To anyone who saw the first film, Eddie Murphy's endlessly resourceful Axel is now no stranger to the ways of Beverly Hills, and no novice at manipulating them to his own comic advantage.\r A true sequel to ''Beverly Hills Cop'' might have made good use of Axel's past experience, or at least have acknowledged it somehow. But ''Beverly Hills Cop II,'' which opens today at Loews Astor Plaza and other theaters, is not an extension of the original story; it's a clone. As such, it's quite a skillful one, repeating the first film's better setups and recalling it as freely and often as possible. Mr. Murphy even wears his same old T-shirt, and of course he's funny in the same old ways, whether he's impersonating a Caribbean psychic or commandeering a mansion by pretending to be a building inspector.\r So the new film has at least some of its predecessor's appeal. But it can't match the first film's novelty, or recapture the excitement of watching a great comic character like Axel Foley as he first came to life. That's the liability facing all but the most imaginative sequels: the chance that the original work's very originality was its greatest virtue. Lively as it is, ''Beverly Hills Cop II'' can't help but suffer from the lack of any originality at all.\r It might seem as though ''Top Gun'' and the ''Beverly Hills Cop'' story were sufficiently different to require different directorial styles. But they aren't, at least not in the minds of the producers Don Simpson and Jerry Bruckheimer, for whom the worldwide grosses of those films (over $300 million each) must seem stylish and then some. So the producers have transferred Tony Scott, who directed ''Top Gun,'' to Axel Foley's territory. And Mr. Scott has done what he can to prove that mega-movies of the rock video age are essentially interchangeable anyhow. ''Beverly Hills Cop II'' has hit songs (or at least they will be), loud action sequences, flashy cuts among eye-catching but unrelated visual images, and a steady, upbeat pace. That it lacks airborne fighting footage is almost beside the point.\r ''Beverly Hills Cop II'' begins exactly the way the first film did, with Mr. Murphy in Detroit in the midst of an undercover scam. However, he is now wearing the fanciest of wardrobes and driving a Ferrari, which effectively cuts any tie to reality in the film's first few minutes. Supposedly, the Detroit police department has paid for all of this, in an effort to help Axel pass as a plausible high roller. Yet his boss, Inspector Todd (Gil Hill), balks at advancing him expense money once Axel decides to return to California to help his old friends. All of the key original actors, like Mr. Hill, have returned this time, and the screenplay (by Larry Ferguson and Warren Skaaren) works hard to give them more to do.\r Axel's arrival in Beverly Hills is greeted by exactly the same kinds of touristy shots - Rodeo Drive, the Beverly Hills Hotel - that showed up in the first film. And soon he is embroiled in a complicated plot that, like the first film's, pits him against cool, merciless Teutonic villains. Chief among these are Jurgen Prochnow as an evil kingpin and Brigitte Nielsen as his coldblooded assistant. The six-foot-tall Miss Nielsen is a walking photo opportunity, and Mr. Scott happily cuts from stylized images of her to other attention-getters, like shattering glass or galloping race horses. The rock-video imperative, the need to keep all images as vibrant and nonverbal as possible, is especially noticeable in Miss Nielsen's scenes.\r For all the flash, it's Mr. Murphy that audiences will come to see, and Mr. Murphy whose manic impersonations are the film's only raison d'etre. To his credit, Mr. Murphy always manages to make his riffs seem new. And Axel's delight at his own extravagant rudeness remains his funniest attribute, never more so than in the particularly contrived scene that brings Axel, crazy Billy Rosewood and the wonderfully long-suffering John Taggart to the Playboy mansion. (The new film is more noticeably misogynist than its predecessor, and more intent on cheesecake, which is where the crowd of volleyball-playing bunnies come in.) To hear Mr. Murphy cry ''Hef!'' - with just the right mix of impudence, wit and sheer reckless bravado - is to remember why Axel Foley became the toast of Beverly Hills in the first place."}, {"rating": "1", "text": "Eddie Murphy rempile dans Le Flic chez les rupins sous la direction de Tony Scott qu'on a connu tout de même bien plus inspiré : un pur produit hollywoodien très bas de plafond donc, dans lequel le Noir agité revient tchatcher ses conneries sur un débit encore plus accéléré que d'habitude.L'histoire est complètement con, le scénario est poussif et aberrant et le seul intérêt qu'on peut éventuellement y trouver est la belle et grande Brigitte Nielsen dans le rôle de la méchante parce qu'elle est trop grande, évidemment et que Eddie a l'air d'un nain de jardin épileptique à côté.En tant que comédie, c'est raté (puisque pas drôle) et en tant que film d'action, c'est sacrément mou du genou. Et puis Eddie Foley, il vaudrait mieux rendre cette Ferrari que t'as volée, tu pourrais avoir des ennuis."}, {"rating": "7", "text": "Beverly Hills Cop II made in 1987 see's the return of Detroit cop Axel Foley (Eddie Murphy) who after an armed robbery on a jewellery establishment and a letter left at the scene investigates the so called Alphabet crimes. After Beverly Hills police departments Lieutenant Andrew Bogomil (Ronny Cox) gets gunned down in broad daylight Axel Foley (Murphy) teams up once again with cops Billy Rosewood and Taggart played by Judge Reinhold and John Ashton.... Slightly inferior sequel but good scenes especially the gunclub scenes and the nudity dancing scenes, the horse racing scenes were silly and the action scenes were done well... Full of explosions, chases, shootouts, nudity and comedy and fairly decent acting I'd say Beverly Hills Cop II is okay but nowhere near as good as the original."}, {"rating": "0", "text": "Beverly Hills Cop II is the sequel to the action comedy, Beverly Hills Cop.... Beverly Hills Cop II sees the return of Eddie Murphy as Axel Foley and his buddies Judge Reinhold and John Ashton who are working on the alphabet crimes after a police officer is shot in broad daylight... Beverly Hills Cop II is good for a few cheesey laughs but fails as a sequel to the original because the edge the first had isn't operational in Beverly Hills Cop II and the blonde villain who's tall, Karla Fry played by Brigitte Nielsen is boring, annoying and an awful villain as so is Maxwell Dent as he seems dull and wooden. The storyline sucks, some of the action scenes are good and some of the characters are annoying like Chief Lutz....  A loud and second rate sequel that took all the magic from the original and urinated on it and gift-wrapped it expecting to live up to the original but falls flat. Some of the acting is okay but Beverly Hills Cop II is watchable at best and a million miles away from a good sequel. Watch Beverly Hills Cop instead and avoid this Beverly Hills Cop II made in 1987 by Tony Scott as it's pure crap... Contains violence, nudity, bad language."}, {"rating": "5", "text": "Sporadically entertaining but bit of a mess and music is overused. Humour is overdone too."}, {"rating": "5", "text": "Cop II isn't as good as the original, but Eddie Murphy proves that the series still has some juice left in it with his performance that is equally funny as that of the first one."}, {"rating": "7", "text": "In terms of production value, Cop II is a stylistic improvement over the original in many ways.... Scott's direction and some of those beautiful 'magic hour' sunset photography moments are pure 80's cheese at its best. Combined with the ADD pacing and cocaine fuelled editing - everything feels nicely 'heightened'. The excellent supporting cast return to deliver great performances. Sadly the plot is paper thin and even though really the whole film is a grand yet transparent vehicle to showcase Eddie Murphy for his comedic and dramatic skills on camera, I laughed more and felt the screenplay in BHC1 was stronger but enjoyed the 'cop action genre' stuff more in BHC2. This holds up well in 2020."}, {"rating": "6", "text": "Sequelitis Is Back SadlyBeverly Hills Cop II still has plenty of fun action and a good amount of funny moments from Murphy, But is bogged down by it's mediocre writing."}, {"rating": "5", "text": "This is pretty predictable stuff. If your looking for a basic 80s action, renegade cop type watch, esp. one to have on in the background while you perhaps do other things, then this one is ok. It features tropes and the like, for example the angry and exasperated police chief who can't keep his officer under suitable supervision (or control). It's ver much an 1980s film and features explosions, car chases and the like. Its not entirely unentertaining but its certainly not a film I'd actively recommend. I watched it because it was recorded on my TiVo and I saw it wasn't rated by me online, so I thought I'd rectify that. Oh and if you hate having the 'Crazy Frog' tune in your head, then you should DEFINITELY avoid this film! haha."}, {"rating": "7", "text": "This sequel does have it's moments but falls along behind it's predecessor.It's still all about Ediie Murphy but he has a lot to do in working with such a limited screenplay."}], "recommendations": ["beverly_hills_cop_iii", "beverly_hills_cop", "bad_boys", "days_of_thunder", "red_heat", "shanghai_noon", "skiptrace", "bad_boys_ii", "lethal_weapon_3", "the_rock", "crocodile_dundee", "lethal_weapon_4", "lethal_weapon", "the_last_stand", "speed", "red", "con_air", "broken_arrow", "dirty_harry", "the_jackal", "lethal_weapon_2", "speed_2_cruise_control", "red_2", "superfast", "shanghai_knights"]}