{
  "id": 2859,
  "title": "Beyond the Reach",
  "starring": [
    "Michael Douglas",
    "Jeremy Irvine"
  ],
  "runtime": 95,
  "genre": [
    "Thriller"
  ],
  "description": "A high-rolling corporate shark and his impoverished young guide play the most dangerous game during a hunting trip in the Mojave Desert.",
  "releaseYear": "2014",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/t6m6ICEG7KrnyYQpROISURkuCD5.jpg",
  "categories": {
    "plot": 4.523809523809524,
    "acting": 4.7272727272727275,
    "ending": 5.0,
    "soundtrack": 5.0,
    "cinematography": 4.0,
    "familyFriendly": 3.0,
    "funny": 4.5,
    "action": 5.5
  },
  "reviews": [
    {
      "rating": "7",
      "text": "Though it differs from the novel in some parts, Beyond the Reach is still entertaining and thrilling in many ways. Take for instance how the film almost instantly jumps right in and doesn't dish out a half hour dose of trite melodrama. Another note, how Michael Douglas surprisingly captures the role of madman Madec flawlessly. Not to mention the insane atmosphere our protagonist Ben has to run around in. It has amateur filmaking elements in it such as freeze frames and pan-zooming, but they are easily bypassed by the visceral feelings the film itself gives. Though flawed, Beyond the Reach is still a satisfying thriller that busts out almost everything one would expect by its description."
    },
    {
      "rating": "6",
      "text": "I liked how it was all set up, we get to know Ben (Jeremy Irvine) at first but what we actually get to know about him is what he has to live for. As for Madec (Michael Douglas) we quickly what he has to lose and the same time we get a glimpse of what kind of man he is before the hunting trip takes a turns for the worst.\r Beyond The Reach wasn't what I expected, I saw Madec as a hell of a lot more twisted then he actually is in the film. He is the villain of the story but his motives are understandable. I'm not condoning what he did, it just kinda makes sense. The circumstances put them into this situation, when I was hoping that Madec would have instigated it.\r The make up job on Jeremy Irvine is flawless, it looked really good, too bad that the story wasn't as carefully crafted as the sunburn make up Irvine had. The ending was a bit of a disappointment and the movie could have had a little more tension but I enjoyed it none the less.@wornoutspines"
    },
    {
      "rating": "7",
      "text": "I watched this movie as the \"affluenza\" mom and son are in jail.  Do rich people feel they can get away with anything?  Yes.  It's scary to think this is life in America now days.  Art imitates life, how often have we heard that one?  Michael Douglas portrays the slightly crazy rich guy well, \"Wall Street\", \"The Game\", to mention a few.  What would you do in that situation?  Movies like this put you there and make you think about how you would survive.  Or not.  The story line was believable until the end.  Why do the studios always want a Hollywood ending?"
    },
    {
      "rating": "3",
      "text": "This is an example of the type of thriller I always go for starring one of my all time favorite actors. \"Breakdown\" was a big favorite, as was \"Duel\" and many of Douglas's thrillers.\rThis one is predictable though and a case where there doesn't seem to be a thing in it that wasn't in the damn trailer!  Just watch the free trailer and thank the studio for putting the movie out in the free 2 minute short form, saving people the time not to mention the admission fee."
    },
    {
      "rating": "3",
      "text": "A mediocre movie with wasted talent, unbelievable story meaning irrational, rushed ending, and poor execution overall. Only good thing is that it was short, therefore less agony waiting for it to end. What a wasted opportunity."
    },
    {
      "rating": "1",
      "text": "Beyond the Reach is beyond belief - and Michael Douglas is in it !?!\rDavid and Goliath cardboard cut-out characters wander the desert for forty no, two days and two nights , thank god, without one “dry’ repartee. And the contrivances pile-up in this bloated Naked and Afraid Calvin Klein underwear ad - sharpshooters miss - calculating minds turn to mush (check if he’s dead!!!)\rand the ‘law’ is ludicrous.  Can we forgive a man whose lost his “basic instinct” to be a player in this ‘game’?"
    },
    {
      "rating": "1",
      "text": "I wish I had read the reviews here before throwing this on and wasting over an hour of life. I was curious because of Michael Douglas and the premise had a lot potential. Douglas is actually kind of enjoyable in it, there's a certain amount of fun to be had watching go through the motions as a psychopathic big shot.\r But, it's just a terribly clichéd and -worst of all- boring film. It starts off promising, but the story just descends into the gutter. For a movie about a cat and mouse chase there's absolutely zero tension and it has one of the most embarrassingly pathetic endings I've seen in a long time.\r Beyond the Reach? This film should've been called Beyond the Diarrhea."
    },
    {
      "rating": "5",
      "text": "Man vs Man vs Wild. There's an allure of two men engaging in high stake wit battle. Beyond the Reach has simple premise to produce interesting suspense. The desert setting gives a specific barren and demanding background for survival of the fittest. Unfortunately, the movie loses momentum in midway point as the plot holes are mounting against them. These illogical scenes hamper any suspense the movie has built up from the first half, and unless audiences have generous suspension of disbelief, the last act is completely underwhelming.\r Story follows two men as they both hunt in the desert. Ben (Jeremy Irvine) is a guide for Madec (Michael Douglas), right from the start they don't mesh together that well. When an accident happens, their interests clash and things escalate out of control. For the role of powerful ambitious man, Michael Douglas can't be a bad cast as he has repeatedly performed well as such character in many other movies. However, the script gives his character several bad decisions which are contradicting his action merely five minutes ago.\r Jeremy Irvine is a good actor, he performed admirably in War Horse and also Woman in Black 2. He's a decent cast, and at first half it's easy to relate to his ordinary character as Ben. Problems arise after the two men trade trickery for their own interests. While the battle of old versus young and the gap of technology might produces a few thrilling moments, the rest of the plot suffers from irrational choices. The plot holes culminate in a bizarre last act, which nullifies any buzz it may have produced.\r Visual is presentable, the desert carries the sense of desolation and helplessness adequately. The two main characters don't have the best on-screen spark, though their exchanges of verbal and genuine blows are pretty convincing. Their relationships outside their ordeal in the desert aren't well established and as the movie tries to wrap up, these mismatches and irregular plot twists make the ending hard to take it seriously.\r Beyond the Reach is at its peak as men fighting each other and the element, unfortunately it doesn't translate well beyond that and it definitely doesn't end on high note."
    },
    {
      "rating": "6",
      "text": "When logic and prediction isn't an issue, you'll get a decent thriller.\r When the big production houses along with the great filmmakers and young stars turning towards the comic books and dystopian themes, what do you think the yesteryear legends are doing.\r It is very sad to see the 70s, 80s and the 90s icons are discarded like a trash, but they're trying their best to keep the star status by doing small scale films from the lower rated and debuting filmmakers. That's the best shot they've got which obviously won't do well at the big screens. So that's where this film too comes in.\r As usual Michael Douglas was good, but the story had many possible ways to travel and that's where the viewers raise their voice by saying it should have been like this, like that or why would he do that.\r Overall, its a decent entertainment that is kind of closest theme to 'No Country for Old Men'. The entire film revolves around just two men and sets in the desert. So a minimal cast film.\r Based on the book 'Deathwatch'. A simple story, but quite interesting film characters. Filled with fairly predictable stuffs yet the performances and very suitable locations are what draws us in.\r It's a right kind of project for Michael Douglas for his age, but the 'War Horse' actor was also good in his role. An average film, or maybe just above that. If you skip it, you would miss nothing, but if you give it a try, I think that's not a bad idea too.\r 6/10"
    },
    {
      "rating": "4",
      "text": "Michael Douglas stars alongside talented young British actor Jeremy Irvine in what is a well shot part survival thriller part chase film, but the desert cinematography that captures the gruelling majesty of the American South-West is about the only memorable element in ‘Beyond the Reach’.\r In his first English language film, director Jean-Baptiste Léonetti stretches a wafer-thin premise over an hour and a half in a film that goes from real-world scenario to a frustratingly predictable story at the flip of a switch, the motivation for the main characters is questionable to say the least and the executive hunter becomes a one-note cartoon villain with almost no lead-up.\r If you’re going to make a “serious” thriller with a clichéd and implausible plot, the least you could do is inject some humour or provide enough character development for the audience to engage with the protagonists when things get tense, but the effort to provide either in ‘Beyond the Reach’ is paltry and the result is a thriller with very little jeopardy or suspense that fails to engage at almost every turn.\r The biggest failure in ‘Beyond the Reach’ however is the utterly unsatisfying ending which is so implausible and downright laughable that it would have ruined the entire film even if it happened to be an engrossing thriller.\r The Bottom Line…\rDespite the presence of a powerhouse actor/producer and stunning cinematography, ‘Beyond the Reach’ is a forgettable survivalist chase thriller that completely wastes the on & off-camera talents of Michael Douglas, which for us is simple Beyond comprehension."
    }
  ],
  "recommendations": [
    "no_sudden_move",
    "broken_city",
    "the_little_things",
    "bad_times_at_the_el_royale",
    "survivor",
    "the_accountant",
    "widows",
    "the_commuter",
    "the_call",
    "the_gunman",
    "a_most_wanted_man",
    "cube",
    "morgan",
    "chaos_walking",
    "the_equalizer_2",
    "man_on_a_ledge",
    "good_time",
    "triple_frontier",
    "beirut",
    "cold_pursuit",
    "knives_out",
    "the_mountain_between_us",
    "reminiscence",
    "the_snowman",
    "the_magnificent_seven"
  ]
}