{
  "id": 4615,
  "title": "Bicentennial Man",
  "starring": [
    "Robin Williams",
    "Embeth Davidtz"
  ],
  "runtime": 131,
  "genre": [
    "Science Fiction",
    "Comedy",
    "Drama"
  ],
  "description": "Richard Martin buys a gift, a new NDR-114 robot. The product is named Andrew by the youngest of the family's children. \"Bicentennial Man\" follows the life and times of Andrew, a robot purchased as a household appliance programmed to perform menial tasks. As Andrew begins to experience emotions and creative thought, the Martin family soon discovers they don't have an ordinary robot.",
  "releaseYear": "1999",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/wrs23eO0VEWwOQpXoOasMnlW9Y4.jpg",
  "categories": {
    "plot": 8.208333333333334,
    "acting": 8.12,
    "ending": 9.0,
    "soundtrack": 8.0,
    "cinematography": 5.0,
    "familyFriendly": 8.0,
    "funny": 8.545454545454545,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "8",
      "text": "Intelligent film in which Williams get the chance to show off his Drama acting.Until this movie, I had only seen the late Robin Williams in goofy roles, but this film gave me a new appreciation for the actor's talents.I have no idea how the critics could give this such a low score. It's a well done adaptation of material from Isaac Asimov, with a story that wrestles with the human question; What is it to be human, and how do we define it.The entire cast was terrific in my opinion, and the two leads in particular (Embeth Davidtz and Robin Williams).Heartily recommended for adults in particular, as kids likely lack the experience of life, to understand and fully appreciate the questions being prodded."
    },
    {
      "rating": "10",
      "text": "This movie made me think how life should be much more appreciated than it already is. Probably one of the most emotional films I have seen."
    },
    {
      "rating": "10",
      "text": "A movie before it's time. It takes on the concept of AI, how advanced it can get, how we might want to push it in certain directions. It also taps into some scifi technology ideas with the semi organic artificial organs. This has always been one of my favorite movies. It is a a long move that can move along a little bit slow, but it gives you time to feel for the characters  and invest in the characters lives. It will leave you sad and happy at the same time."
    },
    {
      "rating": "9",
      "text": "Probably one of the most underrated movies in the last 20 years. Aside from perhaps being a tad too long, Robin Williams gives a really fantastic performance here. Really showing of his range in both comedy and drama. Oddly it is the drama in this movie that makes him shine, not the comedy (which was generally a bit flat.) Overall: Bicentennial man is a Drama that happens to be set in a Sci-Fi-ish setting. The \"human\" drama is really what captures you and really gets you questioning what it means to be alive. A really nice approach to the A.I. rights idea that doesn't involve guns or time traveling Austrians. Over This is a heartwarming story that makes me cry a little every time I say it. It may not be to everyone's liking, but I thought it was brilliant."
    },
    {
      "rating": "10",
      "text": "Very nice movie. Nicely presented the transition - growth of emotions in a robot.Great Creation."
    },
    {
      "rating": "10",
      "text": "This movie has marvelous sci fi wrapped up in a family themed drama. Robin is an immortal robot who yearns to be human. 200 years after his activation date he is recorded by the government as the oldest living human. At end his marriage is finalized, then he & his wife pass away together in 2205."
    },
    {
      "rating": "8",
      "text": "This story was based on a novelette written by Isaac Asimov, The Positronic Man.It's a story about an unusual robot that spends it's life striving to become human. The movie is highly underrated in my opinion.I think the actors all did well dealing with what had to be a challenging story to recreate. I'd speak highly of Robin Williams in particular but I think that others have spoken to his comic genius better than I can. I enjoyed Sam Neill's contribution to the movie. Embeth Davidtz did well in her dual role of 'Little Miss' and Portia.In my opinion Chris Columbus allowed Robin fairly free reign in his role and that's what really made this movie shine. Is it a serious re-telling of Asimov's story?  Not really.  It's a serious story peppered with Robin Williams silliness that makes the subject matter much easier to digest."
    },
    {
      "rating": "8",
      "text": "Sometimes you need the occasional mushy 90s film to get yourself through the day. What better form than this touching story about the robot who wants to be human. It may be a well-trodden idea, but Bicentennial Man has just enough heart, humour and Robin to make it a really great watch."
    },
    {
      "rating": "10",
      "text": "This film gets better each time I watch it and I cannot sensibly explain my love for it. The year is 2005 and technology is thriving. Robin Williams (Rest his magnificently talented and funny soul.) plays an NDR-114 service robot named Andrew purchased by the Martin family. This movie then goes through the highlight moments of the next 200 years of Andrew's search for purpose and acknowledgment. I don't want to say much about the film past that because I believe going into any film as blind as possible guarantees a truly wonderful and unbiased film experience, especially with Bicentennial Man. This movie has given me great perspective on the value of humanity, freedom, and life itself. I highly recommend you watch this film, you'd be doing yourselves a cinematic favor."
    },
    {
      "rating": "10",
      "text": "This film exemplifies just how pointless professional film critics are. As soon as I see a negative review by Roger Ebert I know I will really like the film. I concluded this is because firstly, I see the film, secondly I have an open-mind before seeing it and do not suffer from the crass \"look at me\" approach of most film critics. This film is a wonderful story really well told. A robot who through a fault, fate whatever aspires to be more than it is (a trait film critics could learn other than being failed writers). It is a film no matter how often I see  it, never fails to leave me feeling entertained and fully engaged. It has the right mix of humour, story telling and a poignant ending which it only takes two brain cells to rub together to understand. Clearly to many film and television critics have nothing to rub together :). This was (1999) and is a rarity these days, a film which you can sit the whole family in front of, from toddlers to your 90 year old grandparents and know they will not need to reach for earmuffs, hide under the settee or pray for a rapid one way trip to the next life. I could not recommend this film highly enough for family entertainment. As JonR rightly says an emotional film, which at the end of the day is surely what the world of film is about, an emotional connection. Perhaps film critics need to learn this.  Robin Williams excellent. One of his best roles. Embeth Davidtz also excellent. Sam Neil - also excellent. The rest of the cast were excellent to. Special FX to enhance, not dominate. Good pace and a decent length unlike the usual cheap 80 to 90 minute dross we normally get. Script is a good adaptation of Asimov who is one of my favourite authors.  Having read the film reviews by so many supposedly professional critics, I must thank most of you for increasing my already deeply rooted levels of contempt for your \"industry.\" An industry which seems to be one composed of literary hacks and failures and produce nothing but spite. If any of you had any balls you would create."
    },
    {
      "rating": "8",
      "text": "It could be more provocative but it prefers an equally pleasant sentimental approach.This film takes place in the year 2067, at a time when cars are already flying and domestic robots are already a relatively accessible reality for consumers. Richard Martin and his family decide to buy one, to help with the most boring chores around the house, but his new robot, Andrew, quickly begins to show signs of an unusual humanity in a machine, but much appreciated by its new owner: he is creative, he begins to feel emotions and to cultivate, with the support of his owner, his newfound humanity.Based on a book by Isaac Asimov, this film is a familiar, intimate and emotional comedy about a machine that wants to be human. The plot is quite obvious but it didn't seem like a problem to me. Designed to speak to our sentimental side, the film, directed by Chris Columbus, tells a story in a smooth and flat way, without complicated issues connected to Andrew's desire to be human. Columbus, by the way, is not a skilled director for these kinds of things, preferring to escape as much as he can from raising these issues and presenting us with smooth, light and quite direct films, with humorous touches. For example, the film never talks about the existence of documentation in Andrew's name (birth certificate, identity card, driving license, social security, etc.). Being a robot, he has no reason to have documents, but if he wants to be a human and be part of society, he must have them and society may not be able or open to integrate him in this way. The film even mentions his bank account, which indicates that he would necessarily have to have some kind of documents, but the film never speaks of this paradox.Despite not enjoying the story well and never trying to be more provocative, the film is pleasant and appeals to our feelings. Robbin Williams is a good actor and does his job very well here, again showing his versatility for more dramatic and sentimental roles to everyone who thinks he was just a comedic actor. Sam Neill is just as good, Embeth Davidtz was satisfying but not so convincing, Kiersten Warren is just plain stupid and only improves on the final appearance (I really would also hit her on the head like Andrew did).Good scenarios, good production values, a good soundtrack by James Horner, a good cast working very well but, above all, a pleasant and emotional story are good reasons to see this film. It is not a perfect film, it is not one of the best of any involved, but it is still worth it."
    },
    {
      "rating": "6",
      "text": "This film is not bad, but I found it too sentimental sometimes. Also it doesn't make any sense why Andrew, the robot is different from other robots and why he feels. Spielberg's \"A.I.-Artificial Intelligence\" is based on a similar idea but is much better done and makes much more sense."
    },
    {
      "rating": "5",
      "text": "This story approaches classic Sci-Fi ones, introducing the topic \"how things would be when...\", or better, \"how men would be when...\", reflecting on vital topics, etc. Asimov's story is great in this sense, but Buena Vista adaptation is focused on commercial success and some special effects. And the result is POOR! The worst in this movie is its construction: time seems to fly, leaving no time for emotion or reflectio. Of course, anything performed by R.Williams is great, but I'm afraid he is too human to perform a robot! I didn't like it."
    },
    {
      "rating": "1",
      "text": "A boring movie. I was intrigued, when in the beginning they recapped asimov's three laws of robotics, but then they never used them. At the end, one robot even seems to break them. Plodding pace, a weepy score that will put you to sleep and Robin Williams mugging for the camera in almost every scene (not for the first time either) make this a movie to avoid."
    },
    {
      "rating": "5",
      "text": "Overlong, sentimental (or perhaps maudlin), and lacking clarity. I remember the original story well, though have not read the novel it was adapted into (The Positronic Man). Regardless, I recognized and enjoyed very little."
    },
    {
      "rating": "6",
      "text": "Robin Williams begins the film of Bicentennial Man in a mechanical suit, he is a robot, or 'household appliance' who is found to have feelings and reactions similar to human beings. Unfortunately he doesn't stay in the suit for the entire film, not to take away anything from the remarkable talent and personal admiration of Williams, but a lacklustre and bland second half will have you counting the minutes until the end. A running start, but an egg and spoon finish.\rThe script is filled with emotional appearance from start to finish, but its time frame fast forwards so unpredictably that it can be difficult to feel any sort of attachment to anyone but Andrew, the robot purchased by Richard Martin, or 'Sir', (played by Sam Neill) who quickly realises that his robot may do more than the standard model.\rAndrew begins to immediately bond with the his masters children, and as the years go on and Andrew's talent for carpentry and other things have made him quite a rich man.\rBut the more he understands humans and the more he reads, he knows the demeanour of freedom, and wants to become his own man.\rWhere the film starts to lose its feet is when it starts fast-forwarding, because for a film spanning 200 years it moves at quite a fast pace. Andrew deals with death, others growing up around him and is unable to convey emotions to these changes, but the film is perhaps to polite for its own good in these situations, with a calm and mellow score throughout the film, there is no sense of despair or sadness, but always a sense of epic romanticism and heightening shows of this is how the world should be, but it isn't.\rRobin Williams and Embeth Davidtz are the leading people in the film, Davidtz playing two people in terms of generation. Williams, while in the suit and a few times outside of it, is an ideal and welcome choice for the role, but he seems to be held back quite often and although he is playing a robot, the lack of emotional depth can be blamed on a script which never digresses or takes a new path, it perhaps should have listened to its own words,\"sometimes it's important to do the wrong thing\".\rThere are laughs to be had and some of the script is quite funny, particularly the earlier parts of Andrew getting to know the ways of human behaviour,but a slow and messy second half have held the film back from being as good as the opening 45 minutes suggested, but there are definitely lessons to be learnt and teachings to follow from this very quotable film, which explains human behaviour at its very core."
    },
    {
      "rating": "9",
      "text": "As much as I don't like to sound opinionated, I personally don't understand the hate this movie gets. Sure Bicentennial Man isn't the best movie ever but it is a great and underrated movie that is unfairly dismissed for being overly-sentimental and cloying. Some of it can be slow, but a lot compensates for any misgivings. Bicentennial Man is beautifully filmed, with lovely cinematography and scenery, while the score is gorgeous. I also loved the end credits song, and Celine Dion couldn't have been the more perfect choice to sing it. The script does have a lot of touching moments but it also has humour as well, and good humour at that. The story about life and the human condition is sweet and engaging and the film is competently directed. I really liked the characters, especially the title character who is incredibly endearing. The acting was great, Robin Williams is wonderful and he is solidly supported by Embeth Davidtz, Oliver Platt and Sam Neill. All in all, this is a very good movie. 9/10 Bethany Cox"
    },
    {
      "rating": "10",
      "text": "De las películas que hay que ver antes de morir. Perfecta si estás pasando por la mediana edad."
    },
    {
      "rating": "8",
      "text": "Based on an Isaac Asimov Issac novelete, this is a thoughtful, thinking movie about the relationship between man and machines, focused on one robot in particular. Things develop from there.There are no battles, heroes, villains, or high drama.  Set your expectations accordingly."
    },
    {
      "rating": "10",
      "text": "If you don't like it, you don't get it. id say its as simple as that, wonderful movie gets me everytime."
    },
    {
      "rating": "6",
      "text": "I am not quite sure why this film was so often disliked by the critics. It is a bit overlong, and it does have some slow stretches, but otherwise I thought is was warm and wonderful. Good score, imaginative, and Robin Williams is great."
    },
    {
      "rating": "7",
      "text": "Flawed, but I liked it. A bit too much Robin Williams in the mix, though. While I, Robot was a good actioner/thriller that interplayed the three laws of robotics, this one looks from a calmer perspective, feeling more like an Asimov short story."
    },
    {
      "rating": "9",
      "text": "Bicentennial Man is a magical film. There really is no villains, just obstacles. It's just a simple tale about a life that's heartwarming.Don't watch the trailer, it contains spoilers. Just put it on and enjoy."
    },
    {
      "rating": "9",
      "text": "Read the short story, watched the movie. A uplifting light hearted story on the surface that does have a very deep underlying serious emotional tone about it all."
    },
    {
      "rating": "7",
      "text": "Bicentennial Man is a film that, while original and emotional, fails to fully convince me. Many topics are successfully touched on, and the movie, although it becomes longer than it should, makes up for it with a very good transition from the robot to the human, which is reflected in Andrew in his way of thinking and feeling. Very few robot movies really try to give one human feelings and feel like one, without it feeling weird. Unfortunately, all these ideas that could be great at first, are scattered on the ground. There are too many dubious things put in to cause emotion in the viewer in a very forced way, including the ending in which they decide to consider Andrew a human and therefore all the corresponding rights, despite the fact that there are several things in terms of biology that Andrew has forgotten, or even his way of acting on certain occasions. It is also very strange that it took him so many years to find other robots of his \"brand\", when with all the technology in the world he surely could find a means of transportation that is fast enough. In addition to the fact that it is also not logical that Rupert Burns, who is the one who helps him with the experiments to make him more human, out of nowhere learns to do the blood change to make him age or the fact that he can feel, despite the fact that it was Andrew who made all his experiments possible.As for more minor things, I must mention the poor special effects, which have not aged very well. Matrix, released the same year, also science fiction, is much more credible.Overall, it's a very good movie but with quite a few flaws. As a robot movie that tries to be emotional thanks to its attempt at humanization, it achieves it in an almost excellent way. But as a movie about a robot that learns little by little, other movies like The Iron Giant did a much better job."
    },
    {
      "rating": "9",
      "text": "\"El Hombre Bicentenario\" titulada en Castellano, cuenta la historia de Andrew ( Robin Williams ) y su deseo de convertirse en una persona real.Una película muy emotiva, romántica y de ciencia ficción que nos hará hasta llorar en alguna ocasión.Me gustó mucho por eso le pongo el 9 sobre 10. Mi Novena crítica u/o review de la sección de Movies."
    },
    {
      "rating": "9",
      "text": "The futuristic headquarters of \"NorthAm Robotics\" are actually the headquarters of Oracle Corporation, in Redwood Shores, California."
    }
  ]
}