{
  "id": 3589,
  "title": "Big",
  "starring": [
    "Tom Hanks",
    "Elizabeth Perkins"
  ],
  "runtime": 104,
  "genre": [
    "Fantasy",
    "Drama",
    "Comedy",
    "Romance",
    "Family"
  ],
  "description": "When a young boy makes a wish at a carnival machine to be big—he wakes up the following morning to find that it has been granted and his body has grown older overnight. But he is still the same 13-year-old boy inside. Now he must learn how to cope with the unfamiliar world of grown-ups including getting a job and having his first romantic encounter with a woman.",
  "releaseYear": "1988",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/eWhCDJiwxvx3YXkAFRiHjimnF0j.jpg",
  "categories": {
    "plot": 7.875,
    "acting": 7.545454545454546,
    "ending": 9.0,
    "soundtrack": 10.0,
    "cinematography": 5.0,
    "familyFriendly": 7.166666666666667,
    "funny": 7.125,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "10",
      "text": "Big is a fantastic comedy with great dialogue,performances and is a lot of fun to watch the message of the film is also great telling us that growing up is tough so be young while you can.\rone of my favorite movies!!"
    },
    {
      "rating": "6",
      "text": "The movie is cheesy and childish; the only thing that holds the movie in one piece is Tom Hanks."
    },
    {
      "rating": "2",
      "text": "More like 1-year-old comedy."
    },
    {
      "rating": "8",
      "text": "I finally got a chance to see this movie recently. While the beginning felt like it was rushed, once Josh becomes an adult, everything is hilarious and sweet from that moment till the beautiful ending."
    },
    {
      "rating": "7",
      "text": "Big is a pretty good comedy overall with a touching story to boot. Throughout, laughs are provided as you watch the absurdity of the situations that Josh Baskin finds himself in and that is coupled with a touching story that we can all relate to as we age (though not quite as rapidly, haha). The film is admittedly a little cheesy at times, but it never really bothered me honestly. In the lead role, Tom Hanks is killer and plays the grown up overnight role perfectly and really embodies the little \"ticks\" you would expect from somebody who underwent the transformation he underwent. Overall, this film is far from a cinematic masterpiece, but is a cute little comedy that is endlessly enjoyable."
    },
    {
      "rating": "7",
      "text": "Hanks is blabbering out his innocence with sensitive and easily adaptive body language, fall into it, he is big enough to catchy you.BigMarshall is a lover of old fairy tales. And just like it, it makes you feel warm and cozy, sipping coffee as it rains outside the window Saturday evening. The director Penny Marshall is served everything cooked up front in the table, that doesn't mean he isn't investing, it's just that there is very little for him to explore with his arms open. The writers Gary Ross and Anne Spielberg are the real deal. Their simplicity of the concept is so absorbing or \"catchy\" as kids say nowadays, that they not only to reel the viewers in, but the familiar joyous ride they offer for straight two hours is a sight to behold.From being linearly sensible to complicated to the core, the elevation of the bar in the arc of these characters signifies the morale clause of how to live or experience your own life. And who'd have thought that, there will be a love twist in this resonating tale. Thought provoking ideas bubble up in this drama- it never was a comedy for me- where you want something wrong to happen even though you are well aware of its wrong-ness.This is how good the writing is, the seduction knocks on your door and you want to welcome the person standing on the other side of the door, knowing he or she has the wrong address. Tom Hanks, playing a teenager, is keeping the emotions low and yet hyper on the bling-y or macho stuffs from the toy section. Even the job he works on, is so innocently motivated, I mean, of course his questions or ideas pitched on the meetings are a bit simpleton. I know that his relationship with Elizabeth Perkins is supposed to be the highlight of the film and yes, it is, undoubtedly. But the most underrated fatherly equation of him is with his boss and has some of the best moments of the film that actually makes it Big."
    },
    {
      "rating": "8",
      "text": "Big teaches us a very simple lesson. Cherish every part of you’re life, live it in time. Hold onto your youth, because no matter how much you’d like to grow up, you can’t look past all the things you learn and the fun you have as a child. As an adult, keep that same youth in you. Live life with a carefree attitude, you’ll win more people over if you always have that quality inside you. It works in both realms. The time you have as a child comes once, the time you have as an adult comes to those who wait, great things happen in both stages of life. 79/100"
    },
    {
      "rating": "8",
      "text": "Big has been imitated many times over the years but, thanks in large part to the excellent central performance from Tom Hanks, it has never been bettered. One of the 80's best feel good movies."
    },
    {
      "rating": "1",
      "text": "Big was made in 1988 and is a comedy romance, fantasy type film starring Tom Hanks, Elizabeth Perkins, John Heard, Jared Rushton and Jon Lovitz.. Basically Tom Hanks starts off as a school kid in little league and hanging out with his schoolfriend Billy (Jared Rushton) then one night at a fairground accompanied by his parents he wonders off for a bit then makes a wish on a Zoltar machine which has a head on it with eyes that glow up and the mouth opens and the Zoltar machine isn't even plugged in when he uses it yet it works which is odd and weird. Anyway he makes a wish on the Zoltar machine  to be big then later when all not pans out in the adult world for him he decides to reverse the wish on the Zoltar machine to be a child again yet all the time he experienced adulthood through his wish his poor mum was probably thinking her son was abducted or dead. John Heard is annoying in this film and so is Jared Rushton to a degree and it's full of toys, fun, bouncing on trampolines, funfairs, business deals and meetings, constant conversations, taxi rides, whatever but it's boring and not in the slightest bit interesting. Tom Hanks gives an excellent performance but the bore factor in the movie kills what life he brings to the film and Big feels overlong and tedious at times even though the romance and chemistry between Tom Hanks and Elizabeth Perkins is great. Not a good film."
    },
    {
      "rating": "10",
      "text": "Quel merveilleux film, Tom hank est très bon dans ce film. Et le moment du piano est un moment magique du cinéma américain!"
    },
    {
      "rating": "6",
      "text": "Tom Hanks shows his acting prowess, and get a deserved Oscar nomination, for his role in this entertaining tale of a boy who becomes a man overnight. Although now over twenty years old the film does still hold up today and the concept still hasn't been bettered."
    },
    {
      "rating": "8",
      "text": "When thirteen year old Josh Bashkin (Hanks) is unable to ride the roller-coasters at the theme park he makes he wish that he was bigger. Waking the next morning he finds he has suddenly become an adult.\r Big has been imitated many times over the years but, thanks in large part to the excellent central performance from Tom Hanks, it has never been bettered. One of the 80's best feel good movies."
    },
    {
      "rating": "8",
      "text": "Big is a wonderful story that connects with audiences young and old. The kids watching this movie will want to be \"big\", just like the man they see on the screen; the adults watching this movie will remember a time when they were just like him, looking at the world the way Hanks' character does."
    },
    {
      "rating": "8",
      "text": "A 13-year-old junior high kid Josh (David Moscow) is transformed into a 35-year-old’s body (Tom Hanks) by a carnival wishing machine in this pic which unspools with Enjoyable genuineness and ingenuity.\r Immediate dilemma, since going back to school is not an option and his mom thinks he’s an intruder and doesn’t buy into the explanation that he’s changed into a man, is to escape to anonymous New York City and hide out in a seedy hotel.\r Pretty soon, the viewer forgets that what’s happening on screen has no basis in reality. The characters are having too much fun enjoying life away from responsibility, which begs the question why adults get so serious when there is fun to be had in almost any situation.\r Hanks plays chopsticks on a walking piano at F.A.O. Schwarz with a man who turns out to be his boss (Robert Loggia) and as a result of this freespirited behavior is promoted way beyond his expectations, but it’s what he does with all his newfound self-worth that propels this ‘dramedy’.\r Greatest growth comes from his involvement with coworker Elizabeth Perkins, though by no means is he the only one getting an education."
    },
    {
      "rating": "10",
      "text": "There are films made just to entertain, which are not made to be big, but end up being so dear to the public that they resist the passage of time and continue to win over fans. I think this film is one of those.What is the child who has never felt like being an adult once and for all, in order to be able to do everything that is not left behind? Well, that is the basis of this film, where a boy asks a machine for a simple wish: to be big. The popular fair machine, very similar to one of those fair mystics or fortune tellers, grants him the wish and, in fact, the next day, he appears to be at least thirty years old and has to run away from home because his own mother he doesn't recognize him and calls the police.Okay, I grant that the script is very childish and has lots of holes if we start thinking about it. One of the biggest, and most difficult to miss, is the strange way in which the young man, now unusually grown up, manages to manage his apparent disappearance with his own mother. It just doesn't make sense and it was something that could have been more explored by the script: uprooting, homesickness, family, having to move and being independent without being prepared for it. But the script didn't want to reach that depth and I understand the reasons: it made the movie joke, it gave it more drama and the film, after all, is a comedy. It's all right. It is quite good as it is!Tom Hanks has, in this film, one of several comedies with which he started his career in cinema, after having made some very successful TV sitcoms of that decade, such as “Family Ties”. He is still quite raw as an actor, but here, in this film, we already have signs of his talent, his charisma, qualities that opened doors for him, after all. He takes the film well, carries it with him until the end and shines, making the audience laugh without losing quality in the most emotional moments of the plot. Beside him, we have a capable cast where we can mention Elizabeth Perkins, Robert Loggia and also the young Jared Rushton. The role of villain, perhaps the least well thought out and most poorly conceived in the film, is up to John Heard.In addition to a well thought out and developed cast, with creative moments of humor, and a good performance by Hanks and the cast that surrounds him, we can mention a very competent photograph, although within the standards of the time when the film was made, an elegant but discreet soundtrack and a simple and artifical direction work.Made to entertain, to make you laugh, this family movie is quite fun and very suitable, even today, for a family evening. Personally, I think it is one of the happiest and best-made comedies of the 80s. So much so that, from time to time, it still takes place on the television grid of specialty channels and continues to win over fans, over thirty years after the debut. There is no better prize than this, I think."
    },
    {
      "rating": "7",
      "text": "Love this movie growing up. Everytime I went to a fair I was always hoping to find a machine like this. Still one of my favorite movies of all time."
    },
    {
      "rating": "5",
      "text": "Light hearted comedy. Also light on for jokes, outside of watching an adult act like a child which wears thin."
    },
    {
      "rating": "9",
      "text": "Big has many imitators (13 going on 30, 17 again), but none of those touches our inner child this much. It is magical and flawless, with a sense of innocence and wonder."
    }
  ]
}