{
  "id": 4046,
  "title": "Big Eyes",
  "starring": [
    "Amy Adams",
    "Christoph Waltz"
  ],
  "runtime": 106,
  "genre": [
    "Drama"
  ],
  "description": "In the late 1950s and early '60s, artist Walter Keane achieves unbelievable fame and success with portraits of saucer-eyed waifs. However, no one realizes that his wife, Margaret, is the real painter behind the brush. Although Margaret is horrified to learn that Walter is passing off her work as his own, she is too meek to protest too loudly. It isn't until the Keanes' marriage comes to an end and a lawsuit follows that the truth finally comes to light.",
  "releaseYear": "2014",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/203HAjJcLMl7xThcTqZx4zmEGcV.jpg",
  "categories": {
    "plot": 6.531914893617022,
    "acting": 6.324324324324325,
    "ending": 5.666666666666667,
    "soundtrack": 6.666666666666667,
    "cinematography": 6.5,
    "familyFriendly": 6.0,
    "funny": 5.714285714285714,
    "action": 7.0
  },
  "reviews": [
    {
      "rating": "8",
      "text": "A fun-filled romp with wit and warmth and just enough of an edge to keep it from becoming bland. Terrific performances by Amy Adams, Christoph Waltz and a cast of colorful supporting characters make this a wonderful time at the show."
    },
    {
      "rating": "7",
      "text": "\"Big Eyes\" is a biopic starring Amy Adams (as kitsch artist Margaret Keane) and Christoph Waltz (as her husband Walter Keane) and the story of his attempt to pass off his wife's artwork as his own. The film was written by Scott Alexander and Larry Karaszewski  and directed by Tim Burton.\r Much like any film attempting to tell the true story of its subjects, life is not always as dramatic and interesting as a fiction writer and/or viewer would prefer and this movie is no exception. More like a short story made into a feature length film, the movie holds our interest primarily because it relates events that actually happened and with which most viewers will either identify or remember. Beyond that, the film is light and certainly not worthy of the accolades heaped upon it by so many critics. Mr. Waltz tends to overact and Ms. Adams, although trying very hard, appears uncomfortable in playing this heavy dramatic role. I give the film a 7 reminding the viewer that although fact may be stranger than fiction, it isn't always more entertaining."
    },
    {
      "rating": "7",
      "text": "One of Tim Burton's better films becuase of its charming qualities. I've seen better acting from Christoph Waltz but Amy Adams gives a solid performance in Burton's finest work since Big Fish."
    },
    {
      "rating": "7",
      "text": "A very solid film. Both Waltz and Adams did a fantastic job in their respective roles. The film also made you very interested to see how it would all turn out for the Keanes. However the film does not use Burton's directing style to it's full effect. Although their are several scenes that use the typical Burton colors it just doesn't live up to his former movies."
    },
    {
      "rating": "7",
      "text": "Big Eyes is a pretty good film that has some major strengths and some real negatives. First, the positives. Amy Adams is stupendous in this film. I had high expectations for her performance and she certainly lived up to them. She was awesome. The soundtrack here, highlighted by the Lana Del Rey track, is also great. The song \"Big Eyes\" was used perfectly in the film and truly communicated the feelings Margaret Keane was feeling at the moment. On top of that, the script and plot were awesome, plus they were told very well through Tim Burton's direction. I do not love Burton, but he was great here in telling the story. On that note, the plot was very interesting. Very interesting story and enjoyable to watch unfold. Art is not something that really interests me, but when put on screen in this fashion, it was riveting. I also loved the cinematography. I do not know if I was seeing things, but there seemed to be some effect put on Adams' eyes reminiscent of the eyes in her paintings, which I thought was really cool.\r On the negative, some plot elements felt...extra. Namely Krysten Ritter's entire character (her acting was also sub-par). I typically love Christoph Waltz and Jason Schwartzman, but neither were amazing here. They were solid and, in particular Waltz, had moments of sheer brilliance, but felt comically over the top at times, which really messed with the tone of the film. Finally, the film has a really contained feel to it. Biographical films can feel this way sometimes and this one certainly does. It felt very small and as if it was just trying to hit certain marks, which is something I never really enjoy.\r As a whole, Big Eyes is a good, enjoyable film with a fantastic performance from Amy Adams and good direction from Tim Burton that both combine to make this one well worth your time."
    },
    {
      "rating": "9",
      "text": "It does an excellent job of sticking to the great story at hand. So many Tim Burton movies loose themselves in their own visual loonies but not this one. The story is interesting in itself and it is directed perfectly with unspoken notes in many of its scenes and has an excellent use of color."
    },
    {
      "rating": "8",
      "text": "Two enrapturing leads, beautifully idyllic imagery, and a near too-ridiculously-outlandish-to-be-true story all firmly confirm \"Big Eyes\" as quite possibly Tim Burton's best live-action film in nearly a decade."
    },
    {
      "rating": "9",
      "text": "Big Eyes is a lot of fun with the kind of distinctive look that Tim Burton always gives his films, although this time it’s the opposite of dark and Goth. Amy Adams and Christoph Waltz give wonderful performances, and the film has a lot to say about the Fifties and how that era affected women’s lives, and what exactly art is."
    },
    {
      "rating": "7",
      "text": "Accepting the fact that, as with most biopics, once you've seen them, you've seen them and don't really need to see them again, \"Big Eyes\" is a touching rendition of the story of artist Margaret Keane and the decade long abuse she suffered at the hands of her husband, including him taking credit for all of her work. Amy Adams gives a strong performance as Margaret, but Christoph Waltz's shtick is already wearing thin. \"Big Eyes\" is a restrained, and better for it, Tim Burton film, subtly shot and intended. Worth watching."
    },
    {
      "rating": "9",
      "text": "Hugely entertaining movie with Burton's fine direction and great performances from Adams and Waltz. I didn't believe Keane was so extreme but on reading about him it seems Waltz nailed him! As csw12 commented, this is nearly as good as the sublime \"Big Fish\""
    },
    {
      "rating": "7",
      "text": "Big eyes has a serious not so interesting story about a fraud. Burton loses some details and adds some fantasy and comedy to the story to make it more interesting which he succeeds. It’s a PG-13 movie so feel comfortable to watch it with your family."
    },
    {
      "rating": "8",
      "text": "Tim Burton looks like he's going back to his roots of what made his films great from the first place. That's nice news I like to hear.\r Big Eyes tells the story of a painter \"Margaret Keane\" flourished in the 1950s, as her paintings featuring children with large eyes became the rage. In the 1960s, her husband Walter Keane started taking credit for her work, leading to a long, difficult legal battle.\r Tim Burton back in his glory days was the best. Releasing movies that turn out amazing or great, but something happened with Burton when he started directing remakes of classic movies or old TV shows. Yeah Tim made so pretty crappy movies in the 2000's such as: Plant of the Apes (2001), Charlie and the Chocolate factory, Alice in Wonderland and Dark shadows. At one point I was losing hope for him as the great director that he was is soon gone, until a film called Frankenweenie came out in 2012 that I actually liked and give me more hope for Burton. And now I sawed Big Eyes and yeah Burton still got it, because this movie is pretty damn good.\r Amy Adams pulls off once again a fantastic performance in this movie. She brought such a powerful weight and a heart hitting performance to her character that's actually base on Margaret Keane that you has a viewer knows how she feels as her dream has been taken away from her. Shes such a brilliant actress that it's kind of sickening that she hasn't won a Oscar yet, I mean come on.\r Christoph Waltz in this movie was good but I think at times he dose come off over the top, a bit cartoony and not on this earth human been who would act like this person. But I can't conform that yet, because Margaret Keane is still alive today and maybe she described him like that and Waltz got him spot on, but I still can't conform that yet. But anywhere Waltz has I said was good but I bit cartoony.\r Tim Burton directing a movie with no white face paint, No Johnny Depp or his wife Helena Bonham Carter, a simple movie with so beautiful shot scenes that the good all Tim Burton use to do in his golden days....yep Burton's back everyone and he shows that he still can do drama and he still dose. Now would I put this up there with ED wood or Big Fish? no but it's good to see Burton still got it after years of directing and in this he did pretty good.\r For problems: The start of this movie didn't really suck me in with it's story and character's, it's until later on it finally did. The movie did drag at times and has I said before about Waltz being a bit cartoony at times.\r Overall Big Eyes was a lot of fun to watch. Amy Adams dose a brilliant job in this film and this is a solid Tim Burton film."
    },
    {
      "rating": "9",
      "text": "Amazing story is one of the most beautiful directed films I have ever seen. Great performances from Amy Adams and Christopher Waltz. The paintings were just gorgeous and the film overall was just entertaining and fun to watch with the whole family. It also has a beautiful message for us at the end."
    },
    {
      "rating": "3",
      "text": "Big Eyes has set a negative note for everyone involved except Amy Adams, who's the only one who seems to think this is a valuable film. Tim Burton has long lost the charm of his earliest pictures, turning what could have been a great drama in a jolly caricature, complete with cartoonesque narration, silly music and over-the top acting (Christoph Waltz). Speaking of Waltz, his performance is not completely bad, but it's miles away from the ones that got him two Oscars - while still retaining the comical aspect.\r Seriously, this movie could have been a much deeper insight on 50s culture, art culture, gender roles, everything; and instead it was forced into a senseless, cold comedy that loses power after minutes. Amy Adams is the one who keeps it together.\r Generally unimpressive. I blame Burton and Danny Elfman (a combination that rocked some twenty years ago); one for losing his wit and his talent, the other for... well, what the hell was that score? Straight out of a bag of old tricks. No. I had hoped for more."
    },
    {
      "rating": "5",
      "text": "I found it a trifle boring.\r The story is fascinating but not the way the filmmakers chose to tell it. If it's on cable one rainy Sunday afternoon you should watch it."
    },
    {
      "rating": "2",
      "text": "What \"Big Eyes\" you have?\rThe better to see- the story is too small for the big screen and Christoph Waltz -same old song and dance performance-too big. An opening scene paints a portrait of an independent woman way before her time- then proceeds to drain her of all her color.  Her muted relationships with daughter and \"friend\" are barely visible.  Why she is so blind to all that surrounds her - remains a mystery. A beautifully shot film that hangs too much on one big lie."
    },
    {
      "rating": "3",
      "text": "Just as a good actor can raise a picture to be better a good actor without being reigned back can make a so-so picture worse and that is what happens in “Big Eyes”, the story of  Margaret Keane (Amy Adams) who painted the best selling painters of waifs with huge eyes while her husband, Walter Keane (Christoph Waltz), claimed to be the painter. Waltz has shown that he is an excellent actor and while Walter was charismatic, a ‘salesman’, a manipulator but most of all a liar who invented himself, obviously, the director, Tim Burton, gives him too much freedom, especially in the trial scene. Though he is suppose to be obnoxious, possibly to make Margaret more understandable, he crosses the line.\r Aside from the question of who did the art, and the bigger question of what is art, the reasons Margaret left her first husband, being strong enough to leave and take their daughter, why she stayed with Walter, letting him take away her accomplish- ment as an artist, as well as all her self-esteem, until two Jehovah Witnesses knock on her door, is not gone into deep enough by the screenwriters Scott Alexander and Larry Karaszewski.\r A segment takes place in the building and opening of the World’s Fair in 1964 where I worked in the Gas Pavilion as a waiter and I don’t recall any of what was suppose to have happened there but then except being aware of the ‘Big Eyes’ paintings I wasn’t aware of Margaret Keane’s story.\r Amy Adams, playing a quiet, single mother of the 50s who doesn’t find acceptance due to the social mores of the time, does a good job and comes into her own with her eyes and facial experiences during the trial scene. Delaney Raye as her young daughter Jane, and Madeleine Arthur as Jane in her teenage years, don’t add anything to the film. Jon Polito, as the owner of the Hungry I, and Terence Stamp as the New York Times art critic John Canaday are standouts.\r The story of  Margaret Keane, her art, the times she lived through and why she was the way she was, and who she became, deserve a much stronger film then “Big Eye"
    },
    {
      "rating": "5",
      "text": "This movie felt like a long series of missed opportunities.  Both Amy Adams and Christoph Waltz came off as ultimately flat, making it that more frustrating that a cast of supporting characters were kept in the background rather than used to flesh out the story.   The movie often seemed more concerned with producing a shiny, gorgeous version of the 1950s and 1960s than it did with developing either the plot or the characters.  Christoph Waltz isn't quite believable as the charming sociopath, because his charm is too manic from the beginning--I wanted him to be a more talented liar early on, so that his unravelling could be more satisfying.  Similarly Amy Adams' misery and submission aren't entirely convincing either, and the hallucinations so prominently advertised in the trailer had a minimal role in the movie, and lacked an accompanying narrative of mental illness to explain or justify them.  The movie was still somewhat enjoyable overall, but it felt too glossy and superficial to be a compelling portrait of the Keanes."
    },
    {
      "rating": "6",
      "text": "This film is well-acted but frustrating. Adams is her usual charming self and Waltz is his usual sparkling-sinister self. Visually, it's great. But there are several key moments when you want so much for Adams's character to reveal the truth about her artwork -- which would have been great for her sanity and perhaps even workable if done early in their marriage. She doesn't, of course, and where the film falls short is helping us to understand why."
    },
    {
      "rating": "7",
      "text": "In the early 60s, Keane paintings of pitiful waifs were all the rage. Turns out that Margaret (Amy Adams) painted them, but her charismatic husband (Christoph Waltz) took the credit. He also revolutionized the commercialization of popular art. Their first happy, then tumultuous marriage takes a repetitive long time to get to the courtroom showdown, which also goes on too long. Adams turns this halting, insecure character into a nuanced and compelling performance. Director Tim Burton minimized the bizarre flourishes expected from his work, to tell a straightforward narrative. While it's a fascinating story and Adams is worth the ticket, the film feels more like an informative historical replay, than a moving personal drama. NOTE: Look for the real Margaret in a conspicious cameo on a park bench behind Adam's easel in an early scene."
    },
    {
      "rating": "5",
      "text": "When I first read the brief synopsis of this biography feature from Tim Burton about painter Margaret Keane, and the notorious scandal in the art scene of 1960s in America, my prompt answer to how to solve the chief issue - who is the real creator behind all these paintings, Margaret (Adams) or her husband Walter (Waltz)?- is rather simple, unlike literature and music, painting is an art form too visual-dependent, so why not just let them paint? Then a second thought strikes me that maybe Walter is capable of simulating Margaret’s trademark style, which could elongate this lawsuit case into a more complicated protracted battle. Well, the truth is, I was thinking too much, during the court sequences, after a long-standing filibuster from Walter, which presumably should be funny but only feels insufferable, finally the judge orders them to paint, but as audience has already been informed that Walter simply cannot paint, that is all, case closed, Margaret’s win is such a duck soup, what a stroke of bathos!\r keep reading my review on my blog, please google: cinema omnivore, thanks"
    },
    {
      "rating": "8",
      "text": "“Eyes are the window to the soul.” Something Margaret Keane will explain to you again and again. Amy Adams finds another brilliant performance in herself as the shy and reclusive artist who is forced to lie to everyone she has ever known. Tim Burton’s finest work since Big Fish."
    },
    {
      "rating": "7",
      "text": "This is Tim Burton being his most subdued while still applying his wonderful visual elements. Amy Adams is great, not surprisingly. The film is enjoyable and showcases some actual nice artwork."
    },
    {
      "rating": "5",
      "text": "Flat.  Begins at one level and continues at that level until the end. No connection to the characters, with Christoph Waltz overacting like crazy.  Amy Adams wonderful.  Writing is meh to terrible--some of it seemed to be a first draft . . ."
    },
    {
      "rating": "8",
      "text": "Amy Adams just gave her most terrific and fluffy performances in her career,  I hope you are noting this, Oscar judges. Big Eyes stands out as a independant Burton film. What I mean by independent?  This is Burton's most honest film yet. Christoph Waltz was good in this movie, but Amy is the star highlight.  I have to say it did get a bit boring and it was TOO MUCH sticking to the real story, but sometimes thats good right?  Not in this case, but still! What a wonderful film, check it out guys!"
    },
    {
      "rating": "5",
      "text": "Like all of Tim Burton's films, BIG EYES looks great and it may well be his most adult film yet. Unfortunately, Burton's singular imagination doesn't invite real danger. The horror or conflict is easy, fun and childlike. And that's the problem with BIG EYES. This most intriguing story of the Keane's and their big eye paintings invites exploration into gender politics, sexism, pop culture v. high art, and the very nature of art itself. I wish the film failed for seeking to explore too many areas, instead Burton and his screenwriters are only interested in rubbing the surface of the Keane's personal story and the filmmakers depict this world with little threat or real consequence. That's why it comes as such as a shock in the final moments when Margaret Keane testifies to being manipulated and threatened. When was there any real threat? Why is her duplicity never explored with any depth? Amy Adams has the chops to deliver what is needed but instead, Burton focuses relentlessly on the shenanigans of Walter Keane. In many ways, Burton and his two male screenwriters are guilty of doing to Margaret's story exactly what Walter did to Margaret in real life. The film is entertaining, but ultimately, nothing more than a diversion when depth and insight were there for the exploring."
    },
    {
      "rating": "9",
      "text": "Christoph Waltz's name is synonymous with great movies in my opinion, I just love this guy and love seeing him perform. This movie is no exception, but the big surprise was from Amy Adams, who killed it with her stunning performance. The story is both shocking and disturbing, and the great Tim Burton portrayed the 50's women discrimination beautifully. Definitely recommend this movie, and please do not take credit for other people's work no matter how big or small it is"
    },
    {
      "rating": "8",
      "text": "It’s a good film and I feel it’s really being under-sold by it’s marketing and its lack of screening. amy adams and Christoph waltz are great along with the rest of the cast and the cinematography, is obviously considering this is a Tim Burton movie excellent.  Burton may be giving us a more realistic world than previous films he has done, but he really brings his style to it and it does this film a major credit and makes it very viewable. I would like to see this film get some recognition and some success as Tim Burton has done an excellent film here and I think he should be rewarded for trying something so radical for his style, yet very pleasing."
    },
    {
      "rating": "7",
      "text": "Well acted \"bio-pic\" which is definitely a different road for Tim Burton. However, for me the pacing is a bit off and it tends to slow way down at times. I quite liked the supporting cast, especially Krysten Ritter and Danny Huston."
    },
    {
      "rating": "7",
      "text": "\"Big Eyes\" 10 Scale Rating: 7.0 (Good) ...\r The Good: Amy Adams is fantastic and while she won a Golden Globe for her performance, she was completely overlooked by the Academy and wasn't even nominated. That's a shame because she at least deserved that much as she shows amazing range in this film morphing from meek pushover, to scared and abused, and finally to strong and independent ... which was highly frowned upon in the era that the film takes place in. Christoph Waltz was uneven, but when he was on he was also great. The supporting cast excels as well with standout performances from Terence Stamp, Danny Huston, Krysten Ritter, and Jason Schwartzman. At times powerful and poignant, Big Eyes is an entertaining tale overall.\r The Bad: What prevents the film from truly being great is the film's oddly placed comedic moments. At times, the film almost becomes a full blown comedy, which was an odd decision and felt out of place. Christoph Waltz's Walter Keane was presented as an especially comedic and slapstickish character at times which was a waste of his talent. While the film would shift gears and go back to it's more entertaining dramatic tone, the back and forth was jarring and takes away from the film."
    },
    {
      "rating": "7",
      "text": "Big Eyes is a story about a great painter whose husband takes all the credit for the paintings she makes.The movie itself is a nice drama, is exciting and entertaining. The fact that Tim Burton directed this makes it really great because I would have never expected that from him, and he does a nice job.\rThe acting is great, specially for both of the main characters. In the case of the husband, he does it so well that all you want to do is punch that guy in the face. Amy Adams also does a great job. It's a really nice story, but it sometimes is slow and can get to be boring.\rWatch it if you just want to be entertained.\rReal score: 7.5"
    },
    {
      "rating": "7",
      "text": "Probably due to my 'teenage violence filled' age demographic, I found this movie at times to be a bit slow passed. Big Eyes, a movie directed by Tim Burton is a documentary type movie, that tells the story of a female artist who was a very big deal over her paintings of children with really big eyes. However, during the time she made them, her husband took the credit for them.\r Now I'm not the biggest fans of Tim Burton. I didn't really like A Nightmare before Christmas. So his style of film making. This movie is interesting, but only for those going in with interest. I almost felt bored through a few portions of the movie, and the fathers sheer lunacy can take you out of the realistic feeling of the movie, and reminds you that this is a Tim Burton film. Though over all the movie is really interesting and was a fun one to sit through. You'll enjoy this one for a one time watch in theaters or over redbox."
    },
    {
      "rating": "6",
      "text": "This was a solid film, but it had its issues. This film definitely had the feel of a Tim Burton film, and I feel that it was totally unnecessary. Had David O. Russell (American Hustle) directed it, it would have been even better. Christopher Waltz delivers in his performance, and Amy Adams is good, but her fake accent got a bit annoying. The pacing was uneven, as the beginning and end felt rushed, but the middle seemed dragged out. Overall, this was an enjoyable film, but it did not perform to its full potential."
    },
    {
      "rating": "8",
      "text": "Big Eyes is lead by wonderful costume design and scenes, add to that the great cast that contribute to the films purpose. In addition, a great story about a talented art women. Overall, Big Eyes is a great film that deserves the audience eyes."
    },
    {
      "rating": "6",
      "text": "Okay, I'm old and I was around when the \"big eyes\" happened.  Personally, I thought they were gross (is that a 60's expression?) so this movie was interesting to me to see what went on behind the scenes.  Unfortunately, what went on was not so interesting to make a movie.  Ho hum."
    },
    {
      "rating": "9",
      "text": "I always love watching movies based on true story, and this one's my fave too. What a character Keane is (feel bad that one of the bands I love got the same name with this slick swindler). But I believe everything happens for a reason. So, if Margaret were never met Walter Keane, those Big Eyes would never reach its popularity in a split moment, right?\rOh, despite its true events, it's really absurd to me when Keane decided to defend himself during the trial in Hawaii. Is this really really really happening then??? Gosh, what a stubborn person he is. Get lost!"
    },
    {
      "rating": "8",
      "text": "Real fact story about the truth of Big Eyes art. Someway is a reflexion about the place of women in world of art. Waltz remarks as the cynical Walter Keane. Maybe not one of best movies of Burton but is enough for a evening."
    },
    {
      "rating": "6",
      "text": "When you're watching this movie, about an hour before the movie ends you start questioning why doesn't she sue this guy? she can actually ask the guy to draw one girl with big eyes and then everyone would know that he's a liar, BUT you have to wait all day to same thing happen at the end. So predictable but at the same time not waste of a time because of good acting."
    },
    {
      "rating": "7",
      "text": "Tiré d'une histoire vraie, un film bien sympathique et bien réalisé par Tim Burton, ce dernier ne nous ayant plus habitués à cela depuis belle lurette pour dire la vérité. Cela commence dès le début par la grande luminosité générale et les couleurs très saturées, comme pour faire écho aux croûtes que tartine l'artiste, très colorées et avec de grands yeux ridicules. J'en donnerai pas un putain de dollar.Mais là n'est pas la question de savoir si c'est de l'art ou du cochon mais plutôt de l'usurpation et de l'appropriation du travail d'autrui ainsi que de la condition de la femme dans les années 50 et 60 : à la botte de son mari et tout juste bonne à servir le thé et les cookies. Le film est édifiant à ce sujet malgré quelques longueurs et redites. Il doit beaucoup à ses deux comédiens excellents, Amy Adams et Christoph Waltz. Bref, du bon grain à moudre pour nos féministes chéries... parce qu'elles le valent bien !"
    },
    {
      "rating": "4",
      "text": "Big Eyes is a work away from Burton standards, although it has its touch, really if you did not know it would be difficult to know that this work belongs to him, that is neither good nor bad, but neither does it leave one satisfied.Big Eyes is almost like a movie to make you feel good and shows a woman who was forced to lie about her art by order of her manipulative husband, but then turns things around in order to claim his name.I conclude by saying it's not a bad movie and I do recommend it, but it feels weak for the old standards of Burton."
    },
    {
      "rating": "4",
      "text": "narrow and blurred sight..Big EyesWith a premise so dark and complicated, it gets difficult to pull off such a pitch in a dark tone, instead the makers here decide to take it lightly with a hint of comic tone which unfortunately shatters the gravitas of the character and the structure of the script. It seemed like the creators didn't willingly supervised to tell the story which is clearly visible in each frame as there is zero passion and enthusiasm on screen in any single aspect. The adaptation isn't as smart as the writers think and addition to that it is a bit chalky around the edges, even though it has its few moments that gives hope to the viewers. Tim Burton whose love for cinema is usually visible, is the missing puzzle and the reason why he fails to execute the anticipated vision on screen. On performance objective too, there appears to be a weakness which comes as a shock considering the potential of the cast like Amy Adams and Christoph Waltz. The feature is shot beautifully and is immensely pleasing on visual aesthetics but unfortunately all of it fades away quickly. Big Eyes is a narrow and blurred sight that is not aware of the vision and the trajectory that it wishes to follow and is the only reason why it never connects with the viewers."
    },
    {
      "rating": "6",
      "text": "The slightly whimsical and charming cinematography helps this film compensate for its rather lackluster characterization."
    },
    {
      "rating": "5",
      "text": "Strong performances make this movie, which is a straightforward, predictable, but easy-to-watch biopic. While interesting in its examination of some of the ways women are often manipulated and shouldered out of the limelight by men, this film can't help but feel a touch simplistic and trite in its resolution, especially in the #MeToo era."
    },
    {
      "rating": "10",
      "text": "the queen of music Lana Del Rey created some amazing songs for this movie. xo"
    },
    {
      "rating": "7",
      "text": "Es una historia interesante, con un llamativo estilo visual y con buenos personajes."
    },
    {
      "rating": "5",
      "text": "\"Big Eyes\" boasts a wonderful performance by Amy Adams, solid shot work, and bright colours; all letting us see some majesty in Keane's work. The story of Margaret Keane continues to be a relevant one in today's business/arts world. It's too bad, however, that Burton's trademark direction is far better suited for fantasies and the macabre, not for 'based on real events' dramas. The misdirection causes a nasty clash of styles that becomes especially revealing during the horrendously offbeat climax, spearheaded by an increasingly cheesy, over-the-top performance by Christoph Waltz."
    }
  ],
  "recommendations": [
    "catch_me_if_you_can",
    "joy",
    "eddie_the_eagle",
    "american_hustle",
    "nocturnal_animals",
    "the_devil_all_the_time",
    "rush",
    "the_paperboy",
    "the_aviator",
    "youth",
    "murder_on_the_orient_express",
    "magnolia",
    "all_the_money_in_the_world",
    "the_grand_budapest_hotel",
    "the_great_gatsby",
    "the_place_beyond_the_pines",
    "the_illusionist",
    "a_beautiful_day_in_the_neighborhood",
    "true_grit",
    "eternal_sunshine_of_the_spotless_mind",
    "the_theory_of_everything",
    "hook",
    "the_royal_tenenbaums",
    "casino",
    "the_walk"
  ]
}