{
  "id": 343,
  "title": "Big Hero 6",
  "starring": [
    "Scott Adsit",
    "Ryan Potter"
  ],
  "runtime": 102,
  "genre": [
    "Adventure",
    "Family",
    "Animation",
    "Action",
    "Comedy"
  ],
  "description": "A special bond develops between plus-sized inflatable robot Baymax, and prodigy Hiro Hamada, who team up with a group of friends to form a band of high-tech heroes.",
  "releaseYear": "2014",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/2mxS4wUimwlLmI1xp6QW6NSU361.jpg",
  "categories": {
    "plot": 7.487179487179487,
    "acting": 7.529411764705882,
    "ending": 7.166666666666667,
    "soundtrack": 8.0,
    "cinematography": 5.0,
    "familyFriendly": 6.6923076923076925,
    "funny": 7.15,
    "action": 7.25
  },
  "reviews": [
    {
      "rating": "1",
      "text": "Big Hero Sux.. First of all, the way this film was marketed was dishonest.  It seemed like it could have been a character driven Disney film. This along with Wreck It Ralph have attempted to hijack the legacy of Disney Animation to loud and obnoxious action scenes strung together with a cliche plot.  Once again, this should have been under the Pixar label as not to ruin Walt's legacy.  Cashing in on their Marvel acquisition, The Walt Disney Company has attempted to make a kids movie which resembles every single other super hero movie out there.  Can you imagine if a classic like Aladdin just had 5 minute long action sequences strung together instead of jokes and songs? This one makes lesser known Disney films like The Black Cauldron and Atlantis look like a masterpiece akin to Bambi."
    },
    {
      "rating": "8",
      "text": "Big Hero 6 is an animated movie that is enjoyable for both older kids as well as adults. The animation is clean and very aesthetically pleasing.  The plot is a bit predictable but still enjoyable. The highlight of the film is Baxmax, a robot designed to be a medical helper. Almost all of the humor is derived from this marshmallow like robot. The background characters have distinct visual elements, but really no character development at all. Still I enjoyed the movie and it is worth checking out through your local library."
    },
    {
      "rating": "8",
      "text": "It's like Disney to make a visually breathtaking movie. Though the robot-human concept is starting to grow a little-bit stale on me, the show had plenty of laughs, action, drama, and heart to make up for that. It's a fun-filled superhero ride for kids and even for the parents. Even if the story is almost archetypal, it adds to the impressive  catalogue of Disney Animation."
    },
    {
      "rating": "5",
      "text": "Ok, this movie is not good, but it's not bad. My biggest complain is the side characters(hiro's friends) they're boring and Hiro himslef is an arrogant jerk."
    },
    {
      "rating": "5",
      "text": "Big Hero 6 is undeservedly praised. The movie is a decent effort but with a weak emotional core that attempts to affect you but cannot. The movie thinks it's much much funnier than it actually is."
    },
    {
      "rating": "5",
      "text": "My friends 5 year old noticed the holes in this movie... what a let down. The animation looks good, the characters are ok on their own, but the story... oh my god the story is horrible. Cliche after cliche and forced emotional situations. It was clearly following a formula rather than a story. Whoever wrote the story needs to be shot for how badly it progressed. I actually predicted the entire movie in the 1st 10 minutes (I didnt know anything about it going in) and the only thing I got wrong was who the villain would be. I figured that the movie seems to cheesy that it would try another predictable twist like making the elder brother the bad guy and he is doing to get his GF back. That is how predictable the movie was. No originality whatsoever and it got worse as it went along. I almost puked when i saw it turn to a bad superhero flick. My friends 5 year old asked us why the kid didnt just build more of the small robots or make a new remote control (referring to the brain control interface).... how sad is it that a 5 year old figured that out? Not good.\r Despite how bad the story was, I thought beta max or whatever his name was, was a funny character. The aunt was funny too. Everyone else was retarded including the main character Hiro.\r Overall, average at best. Highly overrated."
    },
    {
      "rating": "4",
      "text": "The only good things about Big Hero 6 are the fantastic idea and rendition of San Francisco in a Japanese architectural style and the \"out-of-power\" Baymax scene. As for the rest, same old same old story, good vs evil and blah. I hated the excessive amount of action (all over the place, really) and I still prefer hand-drawn over CG. But now that Miyazaki's out of the picture, what can we do?"
    },
    {
      "rating": "10",
      "text": "As a near-perfect interpretation of the Marvel Comic, Big Hero 6 is a spectacular and memorable animated movie, and Baymax is undeniably one of the greatest Disney characters of all time!"
    },
    {
      "rating": "10",
      "text": "This is an addition to my all time favorite movie and Baymax is now my favorite disney character. The thing about disney films is that it always bring out the child in every grown ups."
    },
    {
      "rating": "4",
      "text": "I have to say that I am becoming increasingly weary of both the quality of animated films lately and the seemingly tireless obsession audiences have for super hero films which, it seems I finally have to admit are not my bag. Big Hero 6 combines the two and aside from the brilliant animation and delight of combining the cities of San Francisco and Tokyo to make San Franokyo, this remains a bit of a slog to get through. Baymax is a lovely character, but the plotting is so predictable that the interest remains muted. Needless to say it's a big hit and sequels will undoubtedly follow, but I for one will sign out here.\rFar superior is the accompanying short 'Feast' which is an absolute delight. With regards to this double bill, less is certainly more."
    },
    {
      "rating": "3",
      "text": "Big Hero 6, is another disappointing movie from disney this year.\rOne dimensional characters , dubious morality lessons  plus huge plot holes add up to make an embarrassingly bad movie."
    },
    {
      "rating": "9",
      "text": "Big Hero 6 is a heartwarming, action-packed comedy adventure film that brings the superhero trend to Disney Animation studios and they certainly hit it out of the park. It is beautifully animated, fantastically written and remembered for its delightfully charming companion robot Baymax, who is essentially the more well-versed version of Pixar’s Wall-E. The story instantly encapsulates the audience in the world of Sanfransokyo with a group of charismatic and empathetic characters, which is certainly what Disney does best.\r I was a bit disappointed with the lack of character depth for the other members of the Big Hero 6 team. Outside Hiro and Baymax the remaining four receive little screen time with each being forced into a rather archetypical mould. If Disney plans to make this the beginning of franchise, then the next instalment needs to create dynamism with the other characters or else the story will fall flat with little investment from the audience. It would also help if Honey Lemon didn’t put an accent on anything Japanese when she is caucasian and the only character who does it, but that’s just personal opinion.\r Big Hero 6 delivers an animated superhero film for all ages to enjoy. Between its entertaining characters, engaging story and witty dialogue, Baymax brings you the best medicine a healthcare robot can provide: laughter. This is definitely a movie to see in theatres whether it be with the family, couple or heck even a few friends. But be warned that your heart strings will be pulled. Just remember to fist bump them away. *Bata-lata-la*"
    },
    {
      "rating": "6",
      "text": "I love Disney movies just as much as the next guy, but I had mix feelings about the plot-line and some of the characters.\rFirst of all, they had to drop the dead parents bomb. I understand there are some situations where Disney appropriately uses this to build character like in finding Nemo depicting some of the struggles of a single parent. There's nothing important about Hiro's lack of parents. His aunt may just as well been his mother. Why not present a more relevent reason for his lack of parents? Take Caroline for example. Although the parents are \"there\", it's only superficial because they pay no attention to her. That's a common problem many teens experience. There are also way too many secondary character sacrifices. It lost it's poignancy after a while and you knew which characters would not make it.\rOther character inconsistencies include Baymax. He's funny and charming, but he seems to be more of a cute ploy to attract viewers. I wouldn't have been suprised if he didn't exist in the original script, because he doesn't bring effect the plot as much. The villain also was a bad choice and his motivations seemed rushed. Not every villain has to be a \"suprise\".\rLastly, the here seems to be no redeeming theme of the whole film. Sure there was your usual team-work montage and the typical \"revenge is bad\" lesson, though I didn't feel as though Hiro learned anything from his trip. The work/pay-off section as well didn't really seem to teach me much either. While a theme against cutting corners was hinted, it never was tied together. There are some themes in Big Hero 6, but they are pretty typical in most kids films and aren't particularly followed through.\rIt's not a bad movie. The animation is superb as one would expect from a Disney animated film and there were a lot of laughs and fun quirks you will enjoy. Unfortunately without deep characters, motivations, or themes, the movie wasn't as memorable as I anticipated."
    },
    {
      "rating": "5",
      "text": "This film is good for an animated feature, the animation is excellent, but the plot is a recycled use of already well known concepts, the main villain ends up being very disappointing, and shows himself as a pathetic attempt to build a \"twist\" for the ending."
    },
    {
      "rating": "5",
      "text": "Following the positive track record that Disney's animated studio has, with recent releases of Frozen and Tangled, it was easy to see why I was excited about Big Hero 6. But, that excitement was short lived. Before I explain my dissatisfaction with the movie, I will go over the positives of the film.\r Baymax is as loveable a character as any Disney has put to film, and the humor associated with him makes for quirky and intelligent dialog. The visuals are also something to behold, but I've come to expect it from Disney.  The voice actors are also well versed and expertly chosen for their individual roles.  However, not everything is done as well.\r Big Hero 6 struggles to find out what kind of movie it wants to be, and its quick shifts between emotions allow the viewer no time to grow attached to any of the characters. The movie also tries to throw a plot twist at you that is predictable and unimaginative. The plot, story and progression all seem eerily familiar, and that's because they are all copied from films of all genres.  It's cliche to the maximum and never creates its own unique identity. As it struggles to find its identity, the movie gets progressively more boring to the point of total disconnect.\r But, I can only fault BH6 so much because it is a movie targeted at a younger audience. However, comparing it to the studio's two  previous films, Frozen and Tangled; BH6 cannot hold a candle nor even a match.  Disappointing, confused and highly dramatic, I give BH6 a 5-out-of-10."
    },
    {
      "rating": "5",
      "text": "As a single senior with no kids to accompany me to this well received animated wonderment, I was confident that this movie would entertain me in the same vein as The Lego Movie and Wreck It Ralph. I thought it was again built for kids with a sprinkling of adult concepts enough to emerge from childlike entertainment to amuse the adult funny bone throughout. Wrong! This is a kid's movie...period. Intense color, action, no logic to the story elements, just a kind of psychedelic splattering of stream of consciousness video game dream sequences. Over 18? Beware the waste of your movie dollar. Under 18? The action, state of the art animation, and absolute childlike fantasies brought to life, it's beyond loveable."
    },
    {
      "rating": "8",
      "text": "Visually resplendent,  gleefully hilarious, and superlatively emotional, Big Hero 6 is a solid, if slightly familiar addition to Disney's recent string of great movies."
    },
    {
      "rating": "10",
      "text": "This is easily one of Disney's greatest achievements as it has it's happy and sad parts like both Frozen, and Wreck-It Ralph. It holds on to everything great and let's go of everything bad."
    },
    {
      "rating": "10",
      "text": "Big Hero 6 is a gorgeously animated movie and a technical masterpiece. It is also full of emotion, funny moments, adorable characters and creative action scenes that blew me away. I will definitely be seeing this again."
    },
    {
      "rating": "9",
      "text": "Ok well I went to see this movie yesterday not really knowing what to expect the previews sure didn't look great but I decided to just go with it and possibly have a good time well I loved every second of it a true Disney master peace once agin my only word of caution is to parents with really young kids the end is violent and the subject of death is tackled threw a majority of the movie but other than that a perfect family movie and a good choice for almost anyone action packed family fun for the whole family"
    },
    {
      "rating": "5",
      "text": "Nobody looks at the messages in a movie anymore, this movie is preparing our culture to try to become better god's than we currently are... lol, and teaching us that in order to ascend into a greater evolved self, that we need upgrades... I wish i could make this up but the only God, totally predicted this would happen (among other predictions that came to pass) and recorded the last time this happened culturally... humanity became pretty evil and God in his mercy had to destroy it in a world-wide flood to save Noah and family and all future generations born into the then (and now) unforgiving and evil world. You are told of all the nice things technology gives us but nobody considers all the terrible things we will do with it. Holographic sex doll anyone? Or if your grandpa was Hitler and someone uploaded him into the internet maybe he gets downloaded into a nice robot. My concern here is not technology itself, I believe we're just wanting it so to cheat death and keep sinning, not being accountable to God but BEING God. The wages of sin is death, and through Christ Yeshua (Jesus) you can live. But mark not my word but God's Word; we're not going to be allowed to live forever with or without technology apart from Jesus. God said \"My Spirit will not contend with man forever\" Gensesis 6:3. I'm not judging you for watching or even enjoying the movies, I just don't want people to be deceived. Your probably thinking i'm totally deceived too. That's ok but please don't hate me!  Or say i'm being \"intolerance\" and then become totally intolerant of me. But when your kid begins to hate himself because he's not as good as all the superhero's he sees in every kids show or as big as the school bully, just tell him he'll get an upgrade one day. We don't need technology near as much as we need Jesus, our moral example and creator. Don't you think that he would know what would or wouldn't make us 'better'? Anyway, i'm not trying to convert anyone, I'm completely incapable of changing anyone's beliefs no matter how much I write here, that's a matter between you and God who says, \"I will give you a new heart and put a new spirit in you; I will remove from you your heart of stone and give you a heart of flesh...\" Ezekial 36:26. I'm just saying we should seek truth for ourselves and not believe everything Disney or Microsoft or Nasa is telling us."
    },
    {
      "rating": "8",
      "text": "Though this isn't as good as Wreck it Ralph or Frozen, Big Hero 6 still is a fantastic time at the movies for all families.  This has many of the same elements a fun action adventure mixed with a lot of emotional heart felt moments.  A-"
    },
    {
      "rating": "10",
      "text": "Fantasticly animated, a visual masterpiece with many lovable characters and plot twists. I saw it twice in theaters. If you liked frozen but you wanted everything about it to be more awesome, go watch big hero 6."
    },
    {
      "rating": "9",
      "text": "Adding on to this great film year is Big Hero 6. A fun, emotional, and comical animated film loosely based on the indie-Marvel comic of the same name. While very slightly cliche at some points, it is entertaining and one of disney's best non-musical animated films in years (along with Wreck-it Ralph). The characters connect to you, even the cuddly robot Baymax, the animation is great, and the voice acting is solid as well. This is the first moment when I can say Disney has officially defeated Pixar in the quality of computer animation films. Pixar had three off movies in Cars 2, Brave and Monsters University, while Disney produced Wreck-it Ralph, Frozen, and this film, a great film all-around and one worth seeing, whether you are an adult or kid."
    },
    {
      "rating": "10",
      "text": "Big Hero 6 really blew me away, I expected it to be good since Disney is having another animation renaissance but once the credits began to roll all I could do was wish it was longer. This movie has something for everyone, comedy, action, some despair. In fact, surprisingly the only thing missing was romance, which is fine with me.  If you love superheroes, robots, and animated films, I think you've found your holy grail."
    },
    {
      "rating": "10",
      "text": "Big Hero 6 is a great addition to the Disney animated canon. Its action-packed sequences, beautiful animation, and great characters just proves the Disney is on a revival era"
    },
    {
      "rating": "10",
      "text": "This movie was amazing. I went and saw it on a whim, because I had nothing better to do. Now I pity the alternate-universe me that didn't see it. The movie had me laughing the entire way through, and I'll admit, I cried when Baymax \"died\"."
    },
    {
      "rating": "0",
      "text": "I just simply didn't enjoy this movie. The plot was so used, jokes weren't that funny, the idea of characters and settings are awesome but overall it was poorly executed."
    },
    {
      "rating": "10",
      "text": "My family got tickets to an early showing. The movie was excellent. The atmosphere was refreshingly different, the characters fleshed out, the plot touching, and the humor was rich and consistent . I would recommend this one to anyone, and especially to couples and families with children."
    },
    {
      "rating": "9",
      "text": "\"Heartfelt, admirably entertaining, hilarious, and visually stunning.\"\r Big Hero 6 is one of the best animations of 2014 along with The Lego Movie and How to Train Your Dragon 2.\r It is a special and more satisfying movie than Frozen in a diverse way (by the way why diverse? because Big Hero 6 is an action-superhero movie and no musical, unlike Frozen it is a princess tale and a musical, so Big Hero 6 has unique elements that diversely differ on Frozen; let's go back into the question above, why is it special and satisfying was it makes us care for its characters especially on the bond of Hiro and Baymax and greatly take consider its dramatic emotional depth moments. It's a touching experience at the movie theater when you watch it there.\r It's beautiful and amazing when you watch it in 3-D. The sophistication of the marvel of Disney animatronics creatively crafted its ambitious scope on the Marvel comic book series of the same name and its compelling battle action scenes.\r Big Hero 6 starts at the futuristic hybrid city of San Fransokyo (a portmanteau of San Francisco and Tokyo), Hiro Hamada, a 13 year old robotics prodigy is naturally gifted when it comes in making nanotechnology and high-tech toys and stuffs. He often spends his time on robot fighting in the streets of the colorful city. But his brother Tadashi Hamada, was not impressed by this performance, he wanted Hiro to make use of his brain talent on something more creative like he was doing at the San Fransokyo Institute of Technology.\r So he invite Hiro into the institute and amazed to see his brother's creation, the Baymax robot. a\rmedical robot doctor capably of helping the sick\rand the injured\r After some inspiration advantage, Hiro also wants to go into the institute like his brother do. So he invent a technology to bring it into the school fair that will admit him in the institute.\r But after the fair, a mysterious fire broke in the institute and his dreams was shattered by a horrific event that will change his life forever.\r Depressed, Baymax emerges to help his emotional state. Baymax is a cute, kind, and a marshmallow-like robot (which I describe earlier).\r Baymax is one of the primary characters here. He is basically the funniest and one of the most memorable Disney characters I have ever seen.\r But there was a contrary here on some drama animations, what makes Big Hero 6 a heartwrenching movie was the use of a rather realistic emotional love and grief, we don't actually saw it much on either Frozen or Wrech-It Ralph. You can see here how much Hiro loves his brother and his creation, Baymax. So you can sometimes call this type of animated movie a comedy-drama one.\r Also the ending is a powerful one. Unexpected, it is some sort of a brand new beginning world for Hiro and the concept of the movie itself. Don't dare to miss it!\r On the negative side, the reason why I gave it 9 stars out of 10, was it lacks the originality of some creative, inventive, and critically acclaimed animated movies. It actually copies some of the scenes of some of the past movies like How to Train Your Dragon 2 dragon training scene part. But all in all, it is compensated by something even more unique from its elements, and also for its well-scripted story. Nonetheless, Big Hero 6 will hit its target audiences contented and pleased as they go out on the theater house.\r Overall, Big Hero 6 is a terrific blast in the theaters. Its technically stunning, emotionally satisfying, entertainingly amusing, and very memorable Disney movie.\r A true Oscar runner-up in the \"Best Animated Feature\" category.\r A job well done Disney!!!\r RATING: 9 / 10"
    },
    {
      "rating": "8",
      "text": "EXCITED  and Funny Outstanding!! Itulah satu kalimat yg aku gambarkan buat BIG HERO 6. Menurut saya film Big Hero 6 ini sangat ringan dari sisi plot dan alur cerita. Memang nonton film ini untuk dihibur oleh karakter Baymax sebagai bintang utamanya. Seisi bioskop sering banget ketawa lepas tiap kali ngeliat kelakuan Baymax yang super gemesin. Jadi memang jangan bandingkan dengan plot film Marvel lainnya seperti Guardian of Galaxy atau the Avengers, coba bandingkan Big Hero 6 sama film Frozen deh biar gak terlalu berekspektasi tinggi."
    },
    {
      "rating": "7",
      "text": "You'll find yourself lost in this brilliantly constructed animated world. It's not everyday you find an animated flick as honest and touching as this one. Baymax is sure to become another highlight character of Disney."
    },
    {
      "rating": "5",
      "text": "I had very great expectations for this movie especially after seeing reviews/box office earnings. However, i was terribly disappointed. it seems this movie was made solely for young kids who have little sense of how the world/reality works. Too many movie cliches used in this movie... so many that I can't think of a single original plot line/device used by this movie. You could see plot twists from a mile away e.g when it was about to be revealed that Callaghan was the guy in the mask. This movie is for little children who swallow everything they are fed. I give a 5 rather than a 2 or 3 just because a few parts made me genuinely emotional. Overall, an overrated, over-hyped disappointing movie."
    },
    {
      "rating": "9",
      "text": "Big Hero 6 is such a great movie! The animation is beautiful and is somewhat reminiscent to Wreck-It Ralph (which I loved as well). This movie managed to topple my expectations before I saw this movie in theaters. It has great voice acting, touching moments, a great tribute to science, and, again, has absolutely gorgeous animation and the only downside being its predictability. Big Hero 6 will definitely move on to be a Disney Classic."
    },
    {
      "rating": "8",
      "text": "To be fair, I have always been a fan of animated films but Big Hero 6 is beautifully animated and the setting is alive. You could watch the movie multiple times and see new things going on in the background of nearly every scene. I had fun the entire film and it never felt like it was dragging or rushed. I didn't find the movie to be too geared towards small children or reliant on silly gags to be inaccessible to adults. I'm in my 30s and the Baymax fist-bump made me laugh harder than I have done in a long long time."
    },
    {
      "rating": "10",
      "text": "Since I was so disappointed by Frozen, I was hoping Disney would step up their game for this film. After I saw the first 30 seconds of the film, I knew it was going to be amazing. The action never ends and the cast features a large range of loveable characters. You'll come across some sad moments but as a whole this is one of the best animated films in years!"
    },
    {
      "rating": "10",
      "text": "Big Hero 6 is a wonderful action packed superhero movie that is inspired by the Marvel Comics. There are 6 things that this movie is the best animated movie in 2014. #1, This is inspired by the Marvel Comics and I'm a huge fan of the Marvel in general. #2, this movie has the biggest cast ever in a Disney movie and it is also has a diverse cast, which is i really like, even though the original comics are all Japanese. #3, The animation is done really well and the they did a really good job picking those casts and getting into their characters. #4, the story is the most heart-warming and brilliant plot that I have ever experienced. #5, I loved the character Baymax because he's huggable and made all of us laugh and love his fistbump whenever he does it to anyone. Finally #6, this movie is better than Frozen. This movie gives a perfect 10/10. If you haven't watch the movie, then go for it. This is a great film that is suited for everyone. That is all and thank you."
    },
    {
      "rating": "8",
      "text": "As a comic book reader and lover, I am ashamed to say I knew next to nothing about Marvel's Big Hero 6 past a few sporadic reads here and there. The characters were always enjoyable and kept my interest, but it never lead to anything more than a mild fondness, so when I heard there would be a Big Hero 6 I can't say I was anything more than intrigued. The first Disney animated film to feature Marvel Comics characters since the acquisition in 2009, the characters seemed ripe for an animated romp onto the big screen, but detail changes to core characters left many fans holding their breath and hoping that the animation pioneers wouldn't turn their beloved characters into nothing more than second rate acts for their theme parks upon the films release. I am here to calm some of those fears and tell you that Big Hero 6 is a lot of fun!\rHiro Hamada (voiced by Ryan Potter) is a 14 year old genius who loves robotics, so much that he's turned his passion into a career in bot fighting. Hiro's older brother Tadashi (voiced by Daniel Henney) is concerned that Hiro's talent is being wasted and tries to persuade him to attend college where he can hone his skills and hopefully achieve a successful career. Knowing nothing of the \"nerd school\" for which his brother boasts, Tadashi introduces Hiro to his classmates, Gogo (voiced by Jaime Chung), Wasabi (voiced by Damon Wayans Jr), Honey Lemon (voiced by Genesis Rodriguez), and Fred (voiced by T.J. Miller)  where Hiro begins to realize there's a lot more to this college thing than meets the eye.\rHiro meets Robert Callaghan (voiced by James Cromwell), a professor at San Fransokyo Tech who convinces Hiro to enter an admissions contest. When tragedy strikes after his acclaimed nano robotics project attracts some unwanted attention, Hiro is left scarred by the incident. The young genius detracts from his newly found friends and becomes a recluse, hiding from the talents that lead to this tragic event. But fate steps in when he least expects, Hiro discovers Baymax (voiced by Scott Adsit), a kind-hearted inflatable robot built by Tadashi to serve as a healthcare companion. Soon Hiro realizes the tragic accident was more than originally thought and decides to take matters into his own hands.\rEquipping Baymax with an upgraded data package and the rest of Hiro's new friends with superhero costumes and some super cool weapons, the group begins a mission to find the villain responsible. As the group begin to get closer to a person of interest, they soon realize that Hiro is blinded by revenge in his pursuit of justice which may jeopardize the mission. Faced with the notion that the young heroes might be over their heads, will the group find a way to pull it together and bring the villain to justice or will the need for revenge derail their quest?\rBig Hero 6 offers amazing visuals and mixes the gritty tone of Japanese anime with modern American concepts. Directors Don Hall and Chris Williams create a truly enjoyable world and find a wonderful balance for their audience which doesn't discount the source content, but also allows for these characters to find discovery from a new generation. While the film does at times feel very cookie cutter in its telling, it doesn't detract from the overall experience.\r Overall, Big Hero 6 is big fun for the whole family with characters that will no doubt find their place amongst your children's favorites for years to come. Comic book fans rest assured, your beloved BH6 have been well looked after, even if Baymax looks more like the stay puft marshmallow man than an ass kicking machine. Pick your battles people..it's still a lot of fun!"
    },
    {
      "rating": "8",
      "text": "Big Hero 6 might not get its high marks on originality but the gorgeous animation, timely humor and at times heartfelt make for one entertaining film."
    },
    {
      "rating": "10",
      "text": "Big Hero is one of the best animated movie that I have ever watched, it is fun, touching and surprising. The movie is not predictable, the animation is beautiful, and the city (San Fransokyo) it's incredible, and they created a new hero that is original and funny. definitively should be in the best movies of 2014."
    },
    {
      "rating": "10",
      "text": "There really needs to be more original superhero movies that we can call \"Grand.\" I can't tell you enough how cliche - no matter how enticing - the Marvel franchise is these days. I like Marvel, but we need more heroes than them, you know?"
    },
    {
      "rating": "9",
      "text": "I felt guilty enjoying it too much because I'm grown. Its the Big One parents been waiting for, you might like this film better than your kids do,  its better than any of the adult action/thrillers this winter, even beating Mocking Jay. You won't blink or wish for this movie to be over. Has an incredible story line, great flow, awesome characters you can feel in touch with, as well as an emotional connection and morals."
    },
    {
      "rating": "8",
      "text": "As an adult I went in to this movie with some hesitation. It being one of those \"meh\" weekends at the theater and a friend really wanting to see something. Well I was pleasantly surprised. The plot of this film is not overly complex, it being aimed at children. But despite being simple it is very effective. The film has a lot of heart and likable characters and a good balance of pacing.\rThe robot which seems the joke character in the trailer actually plays a pivotal roll and is not just a running gag. And the city featured in this film a hybrid of San Francisco and Tokyo is clever and balanced. It is almost a character of its own. Overall an enjoyable film."
    },
    {
      "rating": "8",
      "text": "From the creators of Frozen, comes another magical animated movie.\r My first thought was that Big Hero 6 should be boring and childish, but OMG were I wrong. This is in fact one of the best movies of 2014; it’s funny, cool and family-friendly that also made me feel like a kid again. It’s been a long time since I saw a new and completely original superhero movie, and Big Hero 6 is in fact awesome. The action sequences alone are incredible, and the movie does have that classic “Disney magic”. The first 20 minutes is a bit slow for my taste, but it got tempo afterwards. There’re some predictable sequences that I found very annoying, and the movie is a bit too classic. It could have been much more unique. There are even some similarities between this and other superhero movies. But it’s still a movie of its kind! The characters are funny and a bit wicked, and I totally love them. But the villain is little too usual, there’s no depth or originality. The animation however, is superb, and the soundtrack is very fitting. The movie got a dark backside and it fits the movie. There’s even a classic “Disney message”, as it should have.\r It does have some flaws like lack of originality when it comes to some of the aspects in the movie, but it’s still a unique superhero movie.\r Big Hero 6 gets an 8/10."
    },
    {
      "rating": "10",
      "text": "This Heartwarming family movie is one of the most best Animated Feature of the year. Strong Animation, Good Action Sequences, talented actors, amazed story and sound mixing and very funny. Replay Value: Very High"
    },
    {
      "rating": "8",
      "text": "With the huge success of Wreck-it Ralph and Frozen, the mouse house seems to know that an animation production will only work if the theme, culture and background are connected to the modern lifestyle of the society. Although it feels like the plot itself lacks some originality and a bit formulated with easily predictable twisted climax, the combination of bouncy actions and motions, amusing development in between the cool characters, usual family, love and certain emotional-driven moments and colorful 3D visual effects are brilliantly enough to allow kids to enjoy, but this Marvel's adaptation seems to aim at the older teens and adults. It is a little bit transformeric and Bayish-style by starting off with some familiar scenes in \"Real Steel\" and having electronic pop-rock style scores from the composer Henry Jackman. However, setting in a background of American-Japanese culture might lead to the thought of targeting Japan's market after enormous profit from there, but this adorable, kind-hearted, friendly robot Baymax reminds us of good moral values, and certainly, it will easily be one of the most loveable character among the audiences."
    },
    {
      "rating": "10",
      "text": "Best Animated Film Of 2014! A very heroic movie. Incredible!   =)  thank you so much chris williams and don hall for making this movie. I have been waiting this movie for so long and i hope metacritic will give a score of 100 to this movie, thank you."
    },
    {
      "rating": "8",
      "text": "I have not read the comic.  This story was good.  Good family fun.  Entertainment for all ages.  Packed with plenty of action, emotional ups and downs.  Played the downs a little too long for my liking.  Amazing animation.  And, of course, look for the Stan Lee cameo."
    },
    {
      "rating": "10",
      "text": "Trust me, or don't your just gonna be missing out. This movie is great. the plot is great, the animations are great, long story short this movie is worth more than 15 dollar tickets."
    },
    {
      "rating": "10",
      "text": "I loved this movie!!! The plot was fun, suspenseful and hilarious at the same time!!! The animation is amazing, the futuristic theme blows me away, but the plot twists are a little annoying. WATCH THIS MOVIE NOW"
    }
  ]
}