{
  "id": 2524,
  "title": "Big Game",
  "starring": [
    "Samuel L. Jackson",
    "Onni Tommila"
  ],
  "runtime": 90,
  "genre": [
    "Action",
    "Adventure",
    "Thriller"
  ],
  "description": "Air Force One is shot down by terrorists, leaving the President of the United States stranded in the wilderness. 13-year old Oskari is also in that wilderness, on a hunting mission to prove his maturity to his kinsfolk by tracking down a deer, but instead discovers the President in an escape pod. With the terrorists closing in to capture their prize, the unlikely duo team up to escape their hunters.",
  "releaseYear": "2014",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/eWFH7P8A9t8Bg6MkLPYmvS4t6di.jpg",
  "categories": {
    "plot": 6.777777777777778,
    "acting": 5.285714285714286,
    "ending": 5.0,
    "soundtrack": 8.0,
    "cinematography": 5.0,
    "familyFriendly": 5.0,
    "funny": 4.0,
    "action": 4.833333333333333
  },
  "reviews": [
    {
      "rating": "2",
      "text": "Wow ........ I think that's the last time I get burned by Rotten Tomatoes! 75%?!!!\r Stick with Metacritic folks - much closer to an accurate rating!\r Anyone who is well familiar with the 80s action movie genre, will recognise the familiar tone here. At first it seems like a welcome homage to movies of that decade. However, things rapidly start to get awfully derivative and contrived. I'm sure none of us mind a little cheese, but this movie is SO predictable and SO cheesy, and unfolds strictly by the numbers that its hard to seriously enjoy much of it. There were certain scenes that wouldn't feel out of place in a National Lampoon movie! The much touted actions scenes were just ridiculous. The scene where the kid and the president are in the freezer and are being lifted through the forest by a helicopter, and they are barely 3 ft from the ground is truly laughable! They're meant to be in peril! Why they wouldn't jump out is plain bizarre when you can clearly see the freezer they're on is a few feet from the ground!\rAlso, this film seems to have a beginning, and then misses out the middle and skips straight to the end! When my wife and I had got to what felt like halfway through the movie, we were shocked to find that there was only around 15mins left.....!!\r AVOID THIS COMPLETE TURKEY OF A MOVIE"
    },
    {
      "rating": "0",
      "text": "Si vous avez trouvé Air Force One ridicule, alors avec Big Game vous allez être servi jusqu'à l'indigestion de bêtise et de stupidité. Et c'est ce pauvre (enfin, \"pauvre\" façon de parler) Samuel Jackson qui s'y colle, pour la gamelle évidemment. Peut-être qu'il aime un peu trop le casino et les Lambos, qui sait ?Voici donc notre président du monde libre dans la forêt avec un ado qui ne sait pas bander un arc, qui cale son quad et qui s'avère aussi futé qu'un castor défoncé à la vodka. Faut dire que son papa et ses potes l'ont envoyé crapahuter dans la montagne pour aller chasser le cerf. Et comme Rambo, le gamin se trimballe un gros couteau. Sauf qu'il ne sait pas faire \"beuhaaar\" alors c'est mal barré.Préalablement (évidemment) l'avion présidentiel s'est fait descendre par un missile portable chinois (on dirait un jouet, putain) lancé par un groupe de méchants terroristes. Mais rassurez-vous, pas d'amalgame, ils ne parlent pas arabe. L'un est un peu basané, cependant mais peut-être qu'il aime un peu trop le bronzage en cabine, qui sait ?Ah ouais, je ne sais pas si c'est important mais ça se passe en Finlande avec des arbres finlandais. Oui je sais, on s'en branle. Comme de tout le reste de ce film de merde d'ailleurs."
    },
    {
      "rating": "5",
      "text": "This action adventure about the president of the United States stranded in the snowy wilds of Scandanavia has so much promise that half way through you start to wonder where it all went wrong. The main issue is that the film is two films in one and they really don't gel. On the one hand the adult action adventure, with some admittedly impressive set pieces, but on the other you have a kids adventure film which means the violence and action has to be played down to achieve the rating required for that target audience. A strange hybrid then, not without merit, but you fell that had the director just been aiming at an adult audience the film would have been so much better"
    },
    {
      "rating": "5",
      "text": "Not really the best movie out there. Jackson does a good job with his acting, but most parts of the movie are cringe-worthy, with skips in the acting and scenes (example: kid jumping onto the 'spoiler'). I thought this movie could have been worse though, so I'll give it some credit. There are tons of plot holes and lack of character development for the antagonists though. I had no feelings for them and felt that they were defeated too easily."
    },
    {
      "rating": "4",
      "text": "Clearly the movie pushed out too soon. With still great special effects and some parts above average acting. The movie doesn't earn a high rating. Also the movie got some inside chokes for finnish people which probably aren't so funny to others. Old movie cliches and the movie turning points are seen for miles away before they even happen. The movie it's just little bit lower than average action movie with terrorists and U.S president Samuel L. Jackson! Even thought with no Jackson's performance the movie would been even lower score. Jackson's performance makes this movie watchable. Big Game has it's moments but really it's not a massive break through."
    },
    {
      "rating": "3",
      "text": "This movie is extremely cheesy, the character development is predictable and it isn't even funny. The only thing I liked about this movie was the scenery which was well portrayed but that's about it. Only watch this movie when you've literally nothing else to watch."
    },
    {
      "rating": "8",
      "text": "This is an action adventure film, with themes present including time bombs, airlifts, deception and murder. There are some subtitles present towards the start of the film, unsurprisingly as the film is set in Finland. I found some of the dialogue to be a little mumbled and hard to follow entirely, which was a bit off-putting. The plot is pretty unbelievable, although it is definitely entertaining regardless. There were some quite amusing moments, with the President forced to do some strange things due to the situation he finds himself in. It is very much an escapist piece of film. I liked the idea of Samuel L Jackson being the President - that in itself was kind of cool but don't be expecting the whole plot to make complete and utter sense and for all the i's and t's to be fully dotted, so to speak.There is an almost camp feel to it in parts but I suppose its all part of the fun. As far as the special effects are concerned, their not really bad quality but I did find some instances a bit hard to believe - there again, thats more likely down to the plot details, rather than the actual visual quality of said effects. I found it surprisingly amusing, not just due to the plot but also via some of the dialogue, with Mr. President telling young Oskari some personal tales of his own while they sit in front of a fire. Bizarre and unlikely?  yes, entertaining and amusing? yes, definitely.Cast wise, as I say Samuel L Jackson plays the US President, William Alan Moore. I found his somewhat unsure, slightly stumbly at times nature to be a bit hard to believe, although Jackson is also his more smooth and slick persona at other times. I can report there is at least one 'aw hell no!'.  The young hunter/adventurer boy Oskari is played by Onni Tommila. He shows his emotions quite well and I found myself wishing the best for him. If I had to make a comparison, I suppose (at a bit of a stretch) you could say that Oskari is a bit of a Mowgli type character, only instead of living in the jungle, obviously, he lives in the mountains. I also found it both ironic and amusing that he seeemed to be the one giving advice to the President! other characters include Morris, played by Ray Stevenson, the VP (Vice President) played by Victor Garber and the CIA Director, played by Felicity Huffman.Content wise, the film contains some instances of moderate violence, including gunshots and gunfire. There is no sexual content and some strong language and there is a fair sense of threat present for most of the film, with music in the background indicating that anything could happen at any time, so it may be somewhat frightening to young viewers. The film has been given a 15 rating in the UK.Yes I'd recommend this film, as I found it to be quite amusing and entertaining. It has a good cast and it did well at making me feel tense - plus the visual special effects aren't too bad either."
    }
  ]
}