{"id": 2642, "title": "Big Fish", "starring": ["Ewan McGregor", "Albert Finney"], "runtime": 125, "genre": ["Adventure", "Fantasy", "Drama"], "description": "Throughout his life Edward Bloom has always been a man of big appetites, enormous passions and tall tales. In his later years, he remains a huge mystery to his son, William. Now, to get to know the real man, Will begins piecing together a true picture of his father from flashbacks of his amazing adventures.", "releaseYear": "2003", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/tjK063yCgaBAluVU72rZ6PKPH2l.jpg", "categories": {"plot": 7.594594594594595, "acting": 7.0588235294117645, "ending": 7.0, "soundtrack": 10.0, "cinematography": 5.0, "familyFriendly": 6.0, "funny": 7.5, "action": 9.0}, "reviews": [{"rating": "10", "text": "A You-Must-See Movie, one of my favorite movies of all time, it has a funny part and has it serious and lovely part, you always learn something about life in this movie. And as Sam F. Says, this is one of those movie where you can say that if don't liked it, it's because you didn't get it. One of the greatest movies of all time (in MY opinion)."}, {"rating": "8", "text": "Big Fish is a peculiar movie, even for being a Tim Burton picture. It is about the life of a man whose father loves to tells stories from the time he was young, but the problem is that the anecdotes are hard to believe, because there are extremely rare and unlikely to happen; for example the story of the eye of a witch that can tell you when you are going to die, the one of a giant who is convinced to leave and stop terrifying a town, the circus that is managed by a werewolf or the scape from a war with two Siamese. All this produce constant fights between Edward and his son; and this is one of the topics that Tim Burton treats on his films. Although the other topics from this great director are less developed they are also noticeable: the gothic and expressionist characters (the witch, the giant and the circus manager) and environments (the forest and the witch house); and the contrast between two worlds represented graphically, the present in which Edward tells his stories (darker or opaque colors) and the past in which the stories take place (bright and attractive colors).\rThe thing is that does not matter if the anecdotes were real or not, you decide what you want to believe, you can live a boring life and had nothing interesting to tell, no dreams, no hope, no goals; or you can live an amazing life, with endless stories to tell and enjoy being a Big Fish."}, {"rating": "10", "text": "Very touching...!! My girlfriend cried after seeing this movie, TWICE !!!"}, {"rating": "9", "text": "This is one of those movies where I can say that if you don't like it, it's because you don't get it."}, {"rating": "9", "text": "I will admit I like Tim Burton, and have enjoyed a vast majority of his films, Edward Scissorhands, Beetle Juice, Batman and Ed Wood. Big Fish is I think one of Burton's better movies in my personal opinion, maybe not his very best, but it is a very sweet, imaginative and moving film. Here Burton delves into familiar territory, a strange place between reality and fantasy, dream and nightmare. The story is really sweet, and while slow at times, does have a poignant ending. The visuals as pretty much always in a Tim Burton film are gorgeous, not Gothic here like in Sleepy Hollow and Edward Scissorhands but evergreen and picturesque. The scenery was beautiful and so was the cinematography, and Danny Elfman's score is stunning. His score for Edward Scissorhands blew me away, but the lyrical, sensitive and hypnotic themes used here make it a score that is truly special. The screenplay is well crafted, and has a bittersweet feel to it. Sentimental yes, but also bittersweet. The acting is remarkably good, with Ewan McGregor making for a handsome yet somewhat charming young Edward Bloom, and the wonderful Albert Finney a revelation as his older self. Billy Crudup is excellent as the son who is intent on exposing his father, and sets out to learn the truth, and Danny DeVito is great as the shape-changing circus ringmaster. Jessica Lange is beautiful and alluring as Sandra and Helena Bonham Carter is almost unrecognisable as the Witch. Then there is Alison Lohman, Marion Cottilard, Robert Guillaume and Matthew McGory(as Karl the Giant) and they are very good as well. Overall, I loved this film, it is moving and very imaginative. 9.5/10 Bethany Cox"}, {"rating": "10", "text": "Big Fish is Tim Burton's masterpiece. It's one of my favorite movies, and it makes me cry every time I watch it. It's beautiful, it's unique, its heartwarming, its moving, and it nails the aesthetic of an American Tall Tale. You will never forget this movie. Go watch it!"}, {"rating": "0", "text": "This was a fairly trite and predictable story in my view.  A real dissapoint after watching Edward scissorhandy.  You get the feeling that burton has sold out.  These kind of mythic, sweeping movies have the same feel as forest gump.   They are all too transparent with their message and leave nothing to the imagination.  The characters are not believable and it feels an hour too long."}, {"rating": "5", "text": "Poor film - not a good story for a fim. Visually not captivating. No suspense. Mellow ending. No evolving characters (or characters with depth)."}, {"rating": "5", "text": "Big Fish is a sad film, but not in the way it wants to be. It is a film of such tremendous imagination and such poignancy in its moments of genuine emotion, that when it betrays itself for a shallow and unfair resolution, you're astonished at how everything about it has gone to waste. The audience feels betrayed that everything they've come to enjoy takes a turn for something they would like to avoid, such as unresolved emotion disguised as closure, and selfish actions being accepted."}, {"rating": "9", "text": "Burtons best and brightest. Big Fish is really a delightful and touching movie, it truly is one of my favorite movies of all time. While i've often found Tim Burton movies to be a little on the odd side, this one was odd but also had a sweet and serious touch to it when you see beautifully done movie about a man whose life becomes a legend through the stories he told his kid growing up. No one film can be as amazing as this one, and with great performances all around as well, especially Albert Finney, Jessica Lange, Ewan McGregor, Billy Crudup and Alison Lohman, Big Fish is a masterpiece if there is a definition of one. It challenges the cynicism brought on by adulthood and brings us back to where our imagination begins and where our dreams can end, a place where everything and anything is possible."}, {"rating": "6", "text": "A most imaginative film, this movie shows some thought in plot construction. However, there is no sense of pacing or climax until the movie's end is 4 minutes away."}, {"rating": "0", "text": "Tim Burton fait souvent dans le burlesque plus ou moins gnangnan et c'est de ce fait rarement réussi. Ce gros poisson ne va pas nous contredire puisqu'il s'agit d\"un condensé d'inepties à même de ravir éventuellement la marmaille peu regardante ou les adultes un peu simples. En outre, pour ne rien arranger, ça dure des milions d'années (en temps subjectif) : un cinéma-tortue ramolli du fion qui avance comme un petit vieux, comme ce petit vieux dans le film qui claironne en boucle ses conneries de contes de fées à la mords-moi-le-noeud. Cette andouille d'Ewan McGregor n'arrange pas non plus les affaires de ce film décidément bien pitoyable."}, {"rating": "5", "text": "a stretch of an undercooked script..Big FishBurton's another avant-garde fictional bubble unfortunately backfires vigorously and the primary reason to that is his commitment to the practicality which he never fails to hold on to completely. Wallace's novel has enough room for the tale to be both practical and fictional, his characters can fly and still be grounded. And frankly August's adaptation doesn't have that. And it itches the picture throughout the course and is why Burton keeps leaning on to practicality, he somehow feels obliged to keep it true and on track. As far as all the tactics that paints the fantasy world on screen, it is Burton's home ground.That half of the tale is not only intriguing but exhilarating to encounter, it is also emotionally fueled. The emotions, in fact are real, the giant, the red car, the daffodils and the witch, these are the facts. And Burton never feels short handed in such genre. Ticking for two hours, the overkill sets in early. And that somehow fortunately follows up to be McGregor's strength. He gets enough time and range on screen for us to fall in love with him, when he does, and laugh at him when he is having fun. But personally, I prefer, Ed Bloom when Finney plays it.He is more mature and overprotective as much as stubborn he is. His last act with his son is what the entire movie thrives on. The supporting cast like Cotillard, Crudup and Carter fails to live up to the lead ones. Burton emerges the emotions aptly on screen, it's the mechanism that it follows needs some polishing. Merely as a concept wise, it can be an intriguing discussion for a dinner table conversation but as far as major motion picture is concerned, Big Fish is frankly a stretch of an undercooked script that should have broken up a long time ago."}, {"rating": "10", "text": "Tim Burton's masterpiece. A brilliant work of art that can greatly be felt as you lose yourself in this delightful fantasy. Great performances all around as well, especially Albert Finney."}, {"rating": "10", "text": "There are few movies I would give a shameless perfect score, and this is one of them. Big Fish has been my number-one favorite movie ever since I saw it a few years ago. I have since watched it at least 15 more times, and every time I watch it, I never fail to be amazed, touched, and interested. There are so many things to think about in this movie, and literally every time I watch it some new metaphor or parallel occurs to me. Do not listen to the critics, because obviously they are too heartless to understand how truly awe-inspiring and amazing this film is."}, {"rating": "10", "text": "People who give this movie less then 6 doesn't understand it, and probably can't see past the archetypal clichés... This is one of my all-time favourite movies, visually magnificent and one of the best, moving and greatest stories ever... This story is indeed \"bigger than Life itself... Definitely Burton's best, his magnum opus!"}, {"rating": "10", "text": "It is a wonderful, heartfelt, lyrical story!!!! Just see it with a open mind."}, {"rating": "9", "text": "The movie is a delightful story to be seen and felt. It challenges our cynicism of adulthood and brings us back to where our imagination begins, where everything is possible, where the world full of magics and dreams. The movie is a touching reminder to us: let imagination saturate our pragmatic, \"scientific\", factual lives."}, {"rating": "10", "text": "This film is a test for your heart. Depending on your vote you can know if your heart is made of stone or not. If you are able to \"understand\" and \"feel\" what this film is trying to say then you can not give it less than 8. I'm glad to see the vast majority of people does indeed have a heart :-)"}, {"rating": "10", "text": "This movie is a great tall tale. Tim Burton really catches the attention of audiences with his work of art in this film. It must have taken lots of planning to make this wondrous film. No one film will be as amazing as this one."}, {"rating": "9", "text": "An uncompromising compromise between morose reality and cartoonish fantasy. It reconciles the fairy tales of American youth, all the sweet things we enjoyed as children, with the cynicism and coldness with build up during maturity. In many senses, Big Fish is about the different kinds of love, and so many of the reasons we fall into them. Littered with over the top moments and brilliant visual art, it is probably Burton's best film."}, {"rating": "10", "text": "I absolutely adore this movie. Charming, beautiful, moving. A wonderful American fantasy."}, {"rating": "9", "text": "Big Fish, though a bit wordy at the start, pulls together and will mesmerize any viewer that can recognize the contrasts between a creatively imaginative child and an adult that utilizes a standard, and sometimes dull worldview. I'm starting to believe the critics aren't worthy of their role."}, {"rating": "8", "text": "I am not easily moved by movies, mostly because most of them don't attempt to reach an emotional nerve without throwing on the cheese. This movie does it perfectly - a beautiful and moving story, well told."}, {"rating": "9", "text": "Along with \"Edward Scissorhands\", this movie is just one of the best love stories ever told. Very original, very touching."}, {"rating": "10", "text": "big fish is a beautiful movie, very sensitive, great characters, a diferent burton's movie, his best movie"}, {"rating": "10", "text": "incredible, burton is a genius, his dramas r the best,big fish is epic,one of the best movies i've seen ever."}, {"rating": "10", "text": "This is honeslty one of my favorite movies. I do not understand why it got mixed reviews. It is right up there with Lord of the Rings as the best movie of '03."}, {"rating": "8", "text": "While to me it resembles no Burton qualities, Tim is the perfect storyteller to tell a story about the perfect storyteller."}, {"rating": "9", "text": "Big Fish I Love You and I Will Cherish You! enough said."}, {"rating": "9", "text": "One of my favorite movies. It is a fantastic story full of imagination and creativity. It really has a way of making you think. Not many people get the movie or think about it long enough to understand it fully. People who tend to not think about it see it as a bad movie with crude and rude humor. But if you actually use your mind while watching you'll discover so much. It's a movie where you can't just turn off your brain for a couple hours. That's is what is so brilliant about it. Amazing cast and writers. MUST SEE MOVIE."}, {"rating": "10", "text": "The adventures of a father, narrated by himself, that captivates the senses of any spectator except his son. It's brilliant how Tim draw this adventures, full of bizarre facts, details and characters and show us in a lyrical way that maybe when our parents are narrating their adventures, we should imagine them like Tim does."}, {"rating": "10", "text": "This is a great movie and one of the most underrated films by Tim Burton. The film takes all of Burton's strengths and puts them into one. I can't recommend this enough."}, {"rating": "8", "text": "Bottom Line: Comparable to The Curious Case of Benjamin Button and Forrest Gump. Questions life and death in a fantastical manner.\r Will Bloom: â"}, {"rating": "10", "text": "Big Fish is a touching, moving, heartwarming and breathtaking film that will appeal to everyone. It is very creative and Tim Burton brings to life all the characters. One of the best movies of the year."}, {"rating": "10", "text": "This is a film for anybody that has some concept of what it means to believe in imagination, magic, and stories. It is so enriching and emotionally powerful. Tim Burton may be different than other directors, but that is only because he understands what it takes to create a film that is worth watching no matter how unusual they can be."}, {"rating": "9", "text": "What a magical movie this is. \"Big Fish\" challenges our faith and imagination with tales that sound too marvelous to be true, too extraordinary to be believable.  But the strongest emotions are found between the broken relationship of a dying father and his doubtful son. After years of no communication, they are reunited when human age reaches its fragile state. The son sits on a chair as he observes his weak father, who lies in what could be his deathbed.\r Old Edward Bloom (Albert Finney) is a devoted storyteller who believes that true stories could use a little fiction for entertainment purposes. On the day his only son, Will, was born, he was out of town selling home appliances. Not a very exciting story for such a very momentous event. When Will is set to be married, his father shares with everyone the false account of how he caught a really big fish with his wedding ring the same day Will was born. This draws smiles from his listeners, but not from Will, who has heard the same lie repeatedly throughout his life. He walks away. And he doesn't return until old Edward becomes confined to his bedroom/\r Read more here: http://localmoviereview.com/big-fish/"}, {"rating": "10", "text": "This movie is for daydreamers. This movie is so perfectly done that I dont know how people dont like it. Tim Burton, a genius. The whole analiysis you can make about this movie is incredible. How everything has a etymological meaning. I enjoyed it so much."}, {"rating": "7", "text": "A very interesting film. It's beautiful and unique. It's very entertaining and it is great because it causes you to question the boundary between fact and fiction."}, {"rating": "8", "text": "I watched this for the first time a year and a half ago and I am not entirely sure what I missed. I hated it initially, but this time, it was marvelous. Maybe my tastes have simply just changed in that time, but wow, this was awesome. Billy Crudup is stellar, as are Ewan McGregor, Albert Finney, Marion Cotillard, and Jessica Lange. A fantastical adventure through the stories told to a man by his now dying father, Big Fish is a touching film that should strike a chord with every man in some way, in terms of his relationship with his father. This film is very much imperfect. The story could have told better for sure and the film can be a bit distant at times, but none of that matters because Big Fish touches you in a way that many films cannot. An imaginative film that is very much about the men it concerns more so than the stories told here, Big Fish is a winner because of the heart at its core, more so than the stories it told that may not make much sense and could have been told better. After a while, the tall tales told here become entirely endearing, which is just too darn appropriate."}, {"rating": "10", "text": "One of my all time favorite movies an amazing story heart warming a must watch recommend to all great family adventure first time I watched it went straight out & bought it its that kinda good"}, {"rating": "8", "text": "I enjoy this tale to be honest. I like to think of it as a look into the life of a film maker, always telling tall tales, about different things. I like the imagery and the characterizations and the little stories woven together and in-universe 'fact' blending with 'fiction'."}, {"rating": "7", "text": "Some of the fantasy elements are decidedly hammy, but overall \"Big Fish\" still manages to entertain the audience with charming visuals, rich sentimentality, and a fine performances from Albert Finney and Ewan McGregor."}, {"rating": "9", "text": "An incredibly well acted film combines the style of Tim Burton with a story that works emotionally and visually.  This is one of Tim Burton's best films."}, {"rating": "10", "text": "This movie is simply not a movie...it's a tall tale of an old dieing mans life and the magic that bestows him, the places he goes the people he meets, and how he became what he always was a BIG FISH IN A SMALL RIVER....and there's no doubt that didnt make me cry"}, {"rating": "8", "text": "A nice fairy tale that mixes fiction and reality. Some of the fantasy episodes are even great and lovely, a strength by Tim Burton."}, {"rating": "9", "text": "I loved Big Fish. It was very uplifting and had a Forrest Gump feel to it. All the fairy tales told were engaging and heartwarming. I experienced a variety of emotions during this film and it almost drove me to tears. If you did not enjoy it then it is possible you did not understand it. I certainly did understand it and I still continue to love it."}, {"rating": "6", "text": "Melancholic adventure with its story told through narration, packed to the brim with visual effects and over the top sequences. Sadly the pacing is off and we never spend long enough with any of the characters to form any meaningful connection between them. Whats clearly meant to serve as a metaphor for paternal discourse ends up as a flat and meaningless whimsey."}, {"rating": "10", "text": "The Tim Burton's masterpiece, as good as Sleepy Hollow, in a different way... I loved this relation father/son and the lesson that we can learn : yes, maybe the stories told by your parents were not true... But it's not the most important. The most important is having a free-imagination ! And I love Ewan McGregor's acting !! And I love Danny Elfman's soundtrack ! In short, I love the atmosphere of this movie."}, {"rating": "10", "text": "This movie is amazing. It has a believable conflict, the story is beautiful. You may get confused along the way, but if you can stick with it you will be surprised on how much you liked it. My favorite part was the ending it was very bitter-sweet."}], "recommendations": ["goodbye_christopher_robin", "life_of_pi", "onward", "the_lovely_bones", "the_little_prince", "a_monster_calls", "christopher_robin", "stand_by_me_doraemon_2", "soul", "the_bfg", "luca", "call_me_by_your_name", "eternal_sunshine_of_the_spotless_mind", "upside_down", "toy_story_3", "finding_nemo", "about_time", "what_dreams_may_come", "me_before_you", "kubo_and_the_two_strings", "your_name", "up", "ella_enchanted", "chemical_hearts", "moonrise_kingdom"]}