{
  "id": 1552,
  "title": "Bird Box",
  "starring": [
    "Sandra Bullock",
    "Trevante Rhodes"
  ],
  "runtime": 124,
  "genre": [
    "Thriller",
    "Drama",
    "Science Fiction"
  ],
  "description": "Five years after an ominous unseen presence drives most of society to suicide, a survivor and her two children make a desperate bid to reach safety.",
  "releaseYear": "2018",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/rGfGfgL2pEPCfhIvqHXieXFn7gp.jpg",
  "categories": {
    "plot": 3.951219512195122,
    "acting": 4.258064516129032,
    "ending": 3.6666666666666665,
    "soundtrack": 5.0,
    "cinematography": 5.666666666666667,
    "familyFriendly": 3.0,
    "funny": 2.0,
    "action": 6.8
  },
  "reviews": [
    {
      "rating": "8",
      "text": "Well, Sandra was in it, So i had to watch it. This was a far cry from Gracie from Miss C. I was intrigued by the depth of the movie. At times, i was not sure what was truly happening. I think it had a Biblical overtone. I enjoyed it, but it was a one time watch and i will not see it again. PLEASE NO PART 2"
    },
    {
      "rating": "6",
      "text": "Chilling and creepy, Bird Box is a surprisingly effective horror-thriller. However, it is undermined by thin plot development."
    },
    {
      "rating": "8",
      "text": "Bird Box is a very fun and entertaining movie with an interesting premise much like that of 'A Quiet Place'. Its got lots of thrills and suspense to keep you on the edge of your seat, and has some great action/character moments that make it worth watching."
    },
    {
      "rating": "8",
      "text": "The affectionate conclusion favors drama over terror, and prefers to see the rest of humanity with a little optimism. It may not be the most original feature, nor does the solution suggest any improvement in the world future, but we are talking about an individualistic project, right? When Malorie calms down, the film calms down too, and sees no need to move on. The direction turns a global catastrophe into an intimate event, an impulse for the sad woman to overcome her trauma, to reconcile with the maternal instinct and find happiness. Maybe a few billion human beings will be sacrificed along the way, but you can't make lemonade without squeezing a few lemons, right? For the final smile of Sandra Bullock and the sense of peace explored by the framing and the sound, the martyrdom was worth it."
    },
    {
      "rating": "7",
      "text": "What? Seriously? Mixed reviews? I honestly enjoyed every bit of this movie. I'll try to be spoiler free, but even though it was a bit predictable, unfinished and with some cliches - i highly recommend it and will probably watch it again someday."
    },
    {
      "rating": "6",
      "text": "\"Bird Box\" é um suspense razoável. O início foi interessante, mas o final realmente desapontou. A atuação de Bullock neste filme é fantástica.6/10"
    },
    {
      "rating": "5",
      "text": "Nonlinear storytelling leading to the less suspenseful outcome, inconsistent power of the unknown entity, typical hideout keep BIRD BOX uninspired while eye-opening potential (that underwhelming Sophie’s Choice-ish moment) about motherhood and Bullock’s performance are wasted."
    },
    {
      "rating": "10",
      "text": "82 negative reviews? Are you kidding? The Bird Box should be a classic thriller/horror movie with a biggest social overtones, which began to use by horror movies. Social overtones like a new stage of development of the horror movies. Get Out, A Quiet Place, Bird Box - they all using the hidden social overtones and it's great! And Bird Box - one of the best from them.I don't understand why people set so low ratings."
    },
    {
      "rating": "2",
      "text": "This is the second Netflix movie where the final scene erases everything that the movie has built up to with illogical garbage that concludes nothing and contributes nothing to the overall story. The first one was \"The End\" which ended in the main character and his SO in a car covered in a cloud of dust before the credits roll. In Bird Box the sanctuary from the monsters turns out to be a school for the blind. Now what is a school for the blind doing tucked away in the middle of a forest and how does Rick give such an accurate description of how to get there down the river, when he is blind? Where are they getting their food from? What makes their place any safer than the original house Malorie and the kids were holed up in? What happened to all the other blind people in the cities - there should be thousands of them still alive. Why is it even called Bird Box??? The box of birds is in barely half a dozen shots in the entire movie. Urgh. The more I think about this inconclusive and dumb ending the more enraged I become over the fact that I spent two hours watching it.To sum up \"Bird Box\" is what happens when The Walking Dead meets Oregon Trail."
    },
    {
      "rating": "5",
      "text": "The beginning of the movie is a 10 out of 10! I was on the edge of my seat! The middle where they start to drive the car is where my scores goes down alittle. But at this point, I am still liking the movie! What destroyed the movie for me, was the cheesy ending."
    },
    {
      "rating": "5",
      "text": "As a massive fan of the book, it's safe to say that, even though enjoyable, the adaptation of \"Bird Box\" is not, in any way, spectacular like its source. A lot of aspects of the plot are changed, and made ridiculous, or cheap, and the good performance from Sandra Bullock doesn't prove itself enough to carry the film through its missteps. The second half is especially changed drastically, and made more \"dramatic\" rather than intriguing (I mean, screaming \"Don't take my children!\" in the middle of the woods wouldn't have been a solution in the book.. just saying...). It's an enjoyable movie, and the cast carries out what is asked of them, however, lacking originality and faithfulness to the book, and not transcending the horror genre formula, \"Bird Box\" just isn't what I was hoping it would be."
    },
    {
      "rating": "2",
      "text": "Poorly executed, slow, boring, thirty minutes too long. Full of unnecessary bits that act as filling for a story that isn't there. The second half is unwatchable."
    },
    {
      "rating": "2",
      "text": "This has been one of the worst movies i have ever seen. Every cut has a new continuity error. It feels like they ran out of money at the end of the movie and decided to make a **** ending. I know Netflix funds anything and this is a new low for them. This should have never been put on the website. I wouldn't reccomend this movie to anyone. Worst 2 hours of my life wasted."
    },
    {
      "rating": "1",
      "text": "A monster movie without a monster. An apocalypse movie without apocalypse. It's an absolute waste of time. Another Netflix original garbage movie. Actors are roaming around blindfold with a bandage on and pretending if they see, they will be in trouble. I mean, don't they feel stupid or don't they think it's so foolish? Damn man! What kind of monster movie was this? What is the story behind this non-existing monster? Are they fooling people? Summary of the movie?! Forget it. It doesn't even worth it. The only reason that i'm not giving 0 to this movie is Sandra Bullock. Don't do this to me again Sandra. I don't wanna see you in these kinda movies. Do yourself a favor my fellow film buffs, and don't waste your precious time with this garbage."
    },
    {
      "rating": "1",
      "text": "This movie is a POS. People are calling it a rip-off of A Quiet Place, but really this is just a horrendous imitation of Frank Darabont's film adaption of Stephen King's The Mist. (And so many other things) Nothing is subtle in this film, everything is repeatedly smashed into your face and requires little thought from the audience. The acting is so annoying and was trying so hard to give an emotional weight to the story, that it just fails as a result.The art of filmmaking has become the art of an extended full-length filler television episode, nowadays. Bird Box is just showing that by refusing to challenge its audience and as a result showcases its ability to just settle into generic mediocrity."
    },
    {
      "rating": "3",
      "text": "Pretty good idea, pretty stupid movie in the end. I liked the premise, but it is just another cookie cutter postapocalyptic movie that does not do ANYTHING with the interesting idea and only offers very bad explanations for what is happening. Spare yourself the pain and don't watch this movie."
    },
    {
      "rating": "1",
      "text": "The story is poorly written copy of 1970's movies. It lacked anything required for a horror movie: empathy for characters, unpredictability, suspense, and even logic. Where Mist suceeds, this fails. Put simply, this movie lacked originality, character development, and linear story. When making movies, don't mix successful comments from other movies and assume success. Just don't."
    },
    {
      "rating": "0",
      "text": "All the hype surrounding this movie, just to suck you in.  So many people watched because expectations were high.  It was a huge waste of time..  not even worth watching.  Its like a jersey shore survivor..  but not as entertaining.  The best way i can describe this movie is like this..  normally you take a satisfying crap on the toilet, flush it, and youre done.. and you feel good.  Here, youre forced to crap in a bag..  they tell you to hold onto the bag, telling you something amazing will happen if you do..  like george r r martin..  the pizza is coming.  You sit there the whole time with a smelly festering turd bag..  then finally its over and they wheel a garbage can around and tell u its ok to throw the bag out.  \"Wasnt that amazing?\" No, it wasnt..  the most annoying thing is watching a buncha fools trying to survive using hollywood sjw logic to get thru serious situations, which always ends bad for them, but every opportunity they can, they do it again..  the definition of insanity."
    },
    {
      "rating": "3",
      "text": "Sandra Bullock wears a blindfold in most of the movie, you should too! A movie better off never made. The story is trite the dialogue is like quicksand and the fast forward button is a lifesaver."
    },
    {
      "rating": "0",
      "text": "wow I was REALLY but REALLY disappointed with this film, what a ****Didn't like any of the characters, the story was full of plot holes and the movie is too damn long for so little to happen in it, waste of my time and definitely yours."
    },
    {
      "rating": "0",
      "text": "One of the worst movies I have ever seen. Lazy acting. Even lazier writing. Nothing makes sense or is explained. Horrible. Wish I could have my time back."
    },
    {
      "rating": "1",
      "text": "Take the worst aspects of: The walking dead, The Happening and A Quiet Place. Then you have Bird Box. What a terrible, terrible movie.Sandra Bullock portrays a really unpleasant character, very difficult to root for. The beginning of the movie, where everything goes crazy, is ok, but too similar to the happening. But in The Happening, at least we had some kind of explanation, as lame as it turned out. In Bird Box, the writers just don't bother. It's implied this is some kind of demons, whatever.In the end of course, nothing is resolved, because that would take creativity. I kinda hate this kind of movie where the world goes to an end, and we follow a tiny bunch of characters until they get to safe place. It seems like a happy ending, if you forgot that the world is still crazy out there. Anyway... Dialogues are boring and endless, just like in the walking dead. And characters act stupidly, just like in A quiet place. By the way, this is a rather long movie (>2h). I would recommend not to waste your time on this one. Really not worth it."
    },
    {
      "rating": "3",
      "text": "Imagine a cheap ripoff of Lost mixed with The Last Man On Earth in the form of a movie and you will have Bird Box."
    },
    {
      "rating": "3",
      "text": "Very disappointed with this film. It was a cliche apocalyptic psychological thriller that failed to hit the mark. I was cautious going into this with Bullock as the lead, and I was right, it just seemed TOO much about her. Plot holes and inconsistencies everywhere, mega eye roll moments. Don't waste your time."
    },
    {
      "rating": "3",
      "text": "The book :10+/10.The movie:3/10. Why do they always do it ? Why do they have to ruin the original ? The story is twisted with big parts missing, the monsters are changed (they can talk ? wtf??), the whole ending is twisted in an silly action scene and even the ominous book ending turned into an crappy happy ending, with children playing in a garden. If you cannot do it properly, better leave it for later on."
    },
    {
      "rating": "2",
      "text": "A mediocre \"horror\" movie with Netflix's signature political correctness. Skip this one."
    },
    {
      "rating": "7",
      "text": "A good movie, but it took a lot of hype for its quality.Probably if the internet had not exaggerated about its quality would have liked more.But it's still a good movie."
    },
    {
      "rating": "7",
      "text": "I stumbled on this movie not long after its release. I didn't know anything about the movie or heard anything about it prior to watching it. I had a couple hours free and noticed that sandra bullock was featured in the decent trailer so I decided to give it a watch. This film is a good and hearty thriller, it does draw a lot of parallels with other films of the same genre but has enough character to make it original. The film manages to create an incredible sense of unease and unpredicatbility that is key to the success of a thriller, so much so that I felt exhausted when it was over. The acting was good with some characters and character plots similar to the walking dead (back when that show was good). The story jumps about a lot to different times and locations which is quite annoying at the start when you just want the film to progress. Quite surprising though was he themes explored in the film and was actually quite successful in conveying emotion. The story does follow a typical apocalypse narrative so you find yourself thinking to yourself \"when are these people going to argue about having to go out and get supplies\" and sure enough they do. Some charcters are just there to make you feel sorry for them and their innocence, which makes it obvious they are going to get killed off. Sarah Paulson featured quite briefly in the film but I thought she could have offered more to the film. John Malkovic was ok, I think he is well rehearsed on playing a short tempered, problematic character. Sandra Bullock's performance was ok, she delivered lines in her usual tone but has something about her that makes her acting quite enjoyable to watch.Overall, I think this movie will be enjoyable for those who enjoy thrillers and for those who just happen to stumble upon it themselves without being influenced by the recent viral spread of this movie with people running about with blinfolds on, I mean the promotion of this ovie was so awkward I half expected Joan Crawford to come running in swinning a fake axe."
    },
    {
      "rating": "8",
      "text": "A fun Lovecraftian romp through an apocalyptic disaster that is both exciting and suspenseful."
    },
    {
      "rating": "7",
      "text": "good film if a bit slow, played well by all characters.keeps you interested but wish they had expanded on the story.and gave us some answers"
    },
    {
      "rating": "10",
      "text": "BURDBOX IS A MOVe Oi've seeN in MoI Loife I wenT too wacH burdbox nd It was the movie of my life! aS soon ad I seew it I went to Mai m8s lawn and starred intO de sun untel oi doiVe. me mate com owt an he got mad cauz I was stood on hEs flowers. he loike 'mate! Me panSies, innit?' an oi was loike 'soz m8 bUt dis spot iz de best in de wurld to look at de sun.' Cent see now Koz oi starried at the son, too long an now oim bloind. My only regret is that oi cant watch burdbox again. now em off to eet doritoes end look at ar sun until oi die."
    },
    {
      "rating": "0",
      "text": "It seems to me that Netflix is starting to understand and decipher the personality of most of their viewers. These are not people who care about the art of cinema, but middle-to-upper class modern, trendy millennials and/or people who have a fetish of playing a streaming service in the background while having sexual intercourse because, for some reason, that is cool--\"Netflix and chill\" anyone?So, in comes \"Birdbox\" directed by Susanne Bier. This follows the perfect recipe for satisfying the mass. It is a shallow, easy-to-follow post-apocalyptic survival flick but with a twist so that after watching it, the entitled pretentious viewers can again pat themselves on the back and think they are knowledgeable about the art just because they enjoyed a film so laughingly trying to be deep, that the evil entities are not even shown. Ever! \"Wow! What an abstract avant-garde piece of revolutionary art\"--tweets Carol, from her iPhone, feeling pretty good about herself. But in truth, this is nothing more than Jackass (except not funny).There is no insight into anything. Those presences causing everyone suicide are never revealed to us, nor they are mentioned. This would be fine, if the film would actually do something with this mystery. Instead, it tells us that it is so in-depth, so complex, so multi-layered that dude, like, we won't even show them, but wait not even mention them, and you know the two kids in the film? They have no name--they are simply called \"boy\" and \"girl\". \"This is something else\"--says Carol; \"This is a shameless cash-grab\"--I say while struggling to shake-off the modernist cringe.Every single one of these characters is as shallow as he or she can be and every single interaction is linear and boring; not to even mention the predictability of the whole thing. For its entire run-time, I was waiting for each character to inevitably die. This film is about as complex as a classic zombie-horror flick, except there they actually put the effort into the zombies, while here they do nothing and just put some lazy pretentious mumbo-jumbo.In the end, what makes this a revolting film (if I could even call it that) is the fact that I do not think this shallowness is unintentional. Netflix is all about business, and here they completely killed the art form and, like the creatures in the film, replaced it with a populous void. Profitable, but disgusting."
    },
    {
      "rating": "3",
      "text": "This is one of the stupidest and most boring movies I have ever seen in 2018. The plot was just stupid, I mean a virus that can affect you and make you suicide once you look. I give it 3 for the effort and hard work put on this."
    },
    {
      "rating": "2",
      "text": "This is slim-budget B movie with some A-list actors.  The characters are shallow and the story is uninspired except for the many parts that don't make any sense.  This movie leaves the viewer with many questions while watching and sorely lacking in explanations that satisfy."
    },
    {
      "rating": "1",
      "text": "This is nothing more than a watered down and even worse version of M Night Shyamalan's \"The Happening.\" I will admit that is starts off intriguing but it quickly descends into a laughable mess about midway through. Avoid this awful, awful film. Its being placed next to Batman Forever as one of the worst films of all time.The only thing that could have saved this pile would be the \"Rick\" on the radio was actually \"Rick Grimes\" and this was some strange prequel to the Walking Dead. Now that would have made this a 2-star movie."
    },
    {
      "rating": "0",
      "text": "The absolute worst. Staring at a wall would provide you with more story and character than this non-movie"
    },
    {
      "rating": "7",
      "text": "Far more then 5.7. Bird box is exciting and interesting movie with something new in it. Worth a watch."
    },
    {
      "rating": "3",
      "text": "Trite, sappy, full of plot holes, never goes anywhere. The one big mystery of what the heck is actually going on is all but forgotten and ignored by the end. They try to make it some allegory about motherhood, but the film lacks the subtly and good writing required to actually pull that off. Overall, it's pointless and leaves you feeling like you wasted your time. Saundra Bullock does a great job of acting, that's the one good thing about it."
    },
    {
      "rating": "0",
      "text": "Boring as it gets. I think they are trying to live in the moment with good acting like walking dead did in the first season. However they don't. It's just unexplained moronic garbage. I like Sandra Bullock but this was a big fail."
    },
    {
      "rating": "3",
      "text": "Manipulative, shallow, and thoroughly unpleasant, 'Bird Box' takes a deeply unsettling premise and filters it through a lazy story filled with cliched situations and one-dimensional characters. The film is not without its effective set pieces and suspenseful moments, but sustaining that suspense with the building threat of seeing two children commit suicide just makes the entire film seem cheap and exploitative. Rather than embrace the tawdry 'B-movie' shocks bubbling beneath the surface, the director and cast instead insist on treating the material like they're in a prestige pic while never finding the emotional heart, psychological depth, or cultural significance of its central premise. Because of this jarring disconnect between tone and material, the film fails to work as a literary art film or as a genre thriller. Ignore the anonymous voices online telling you you have to see this movie to understand the phenomenon. I recommend taking the advice of the movie itself and keeping your blindfold on."
    },
    {
      "rating": "2",
      "text": "So...Are we going to give up to the Netflix bias? You know that bias where even if a product like Insatiable,Bright or...well,Bird Box fails miserably at being a piece of media,everyone just straight loves it for no reason other than “you critics are just mean”? Because,after the 30 minute mark of explaining the concept,Bird Box did just what Jurassic World 2 did to my inner film fanatic soul. It p****d the hell outta me,this time more than JW...And this isn’t a franchise movie,not even a Universal movie at that. This is made by Netflix,whose social media I hate with a burning passion,and rarely makes a great movie (think Okja or Roma),because they’re so busy making teen garbage (with exceptions like Stranger Things and the Marvel TV Shows) that,while they appeal to that demographic successfully,they’ll always miss two things that make a movie or TV Show good,not so good or bad. “Entertainment” and “an interesting PLOT”.And Bird Box doesn’t have that. It’s a soulless cash-in on A Quiet Place that fails at being what they’re aiming for or,even worse,lacks anything worth of its “Genre”. This is listed as a Horror movie and man,oh man,does it not show anything worth of the Horror. Not even the kills are fantastic. This movie is so bad,It’ll instantly kill your brain cells because they were busy doing something else.But let’s start at the beginning.The acting is probably the biggest highlight of the movie. Surprises are here and there,since I only knew Sandra bullock was in it. Well,surprise surprise,John Malkovich,Rosa Salazar and Trevante Rhodes also appear in here and they’re all pretty good! Especially Malkovich and Bullock,who are trying to make us care about everything coming from a stupid script.A script full of dumb choices,situations being finished in no time (even faster than The LEGO Movie,a great movie with a fast story),a presentation that fails with a snap of the fingers,and 2 moments where Venom now feels like a fantastic script (The quote “Wow. Such Venom…”,the car flipping at the 11 minute mark and the eyes being weird when they’re “infected” by this monster). Speaking of the monster...Uhh...Where’s the monster? Do I have to believe about this floating fart who infects people in killing themselves? Yeah,that’s actually dumb for a script that wants to be taken super seriously.Oh,and there are kids in here,and they’re even worse than Claire from a bad but miles better movie than this (Jurassic World Fallen Kingdom). Worse in the sense that they don’t even act. They’re standing there like pieces of wood,or even rocks.The technical aspect is also really bad. The cinematography feels like a great YouTube video and rarely does it feel like a cinematic presentation. The score feels like a great mix of nothingness,horrible synthy vibes and a track that a composer like Junkie XL would cry from disappointment. And to finish everything,the editing is Justice League level bad,where even the little things fail at connecting the dots (where in JL i was the gun thing,in Bird Box it’s a person in a bedroom looking at another person,then we cut to the same person,only her head is looking to the closed window).GOOD GRAVY GOD,this movie made me angry. Bird Box made me hate Netflix as a studio more than Universal just because of how the platform’s users act IN IT. I don’t care if you love Bright,it’s just an aggressive 4/10. I don’t care about Insatiable,it’s a dumb show with nothing special that makes the Catwoman movie look like The Dark Knight. Stop raving about Bird Box,you dumb TNTs. It’s a great Asylum rip-off (or cash-in) of A Quiet Place that has nothing special and is just there to please some guy who wants their brain to be rotten. But yeah,dislike this review,because your opinion will be better than mine for all the wrong reasons. I hope you have a future filled to the brim with classics such as Fifty Shades,Twilight,Bird Box etc. and “Have a nice life” (-Venom)"
    },
    {
      "rating": "5",
      "text": "5.4/10 More standard mediocre Netflix original content that consists of recycled concepts from other films, scattered plot points, and no payoffs for the constant build ups. There are so many obvious similarities in this film especially to \"The Happening\" from 2008 as well as \"A Quiet Place\" from earlier this year. When it does try to be it's own thing at times, it comes off so contrived and cliche and I personally couldn't take it seriously. There are so many tropes and moments that are so familiar and unoriginal. The story is told in a somewhat interesting way and Bullock's acting is serviceable like always but it just lacks an overall originality which has become a trend in most Netflix original films unfortunately aside from a few. I felt as though they tried to make this more of a testament/symbolism to being a mother than anything else and maybe that's why it's scoring so well among the average Netflix demographic. There are moments of set up atmosphere and intensity that never lead to anywhere where I guess you're supposed to use your imagination which I find pointless when watching something that is meant to show the culprits before your eyes in the thriller/horror genres. The suspense is empty when it's meant to be full. Overall this is just a long dragging attempt at being a clever thriller drama that doesn't deliver any originality but is watchable I suppose. If you want quality original horror on Netflix, watch The Ritual or The Apostle."
    },
    {
      "rating": "0",
      "text": "it's surely a waste of time to see this movie. I think the one who wrote the story and the those who made this film should be condamned.not funning at all. just a waste money."
    },
    {
      "rating": "0",
      "text": "it was well and truly the greatest turd ever laid, i'm surprised i didn't become one of the people who went crazy. if it were any worse i would need a therapist and a prescription fro ptsd it was genuinely a horribly directed film and was a waste of everyone's time. my sunday was ruined because of this film and i had Chinese and sweets for my dinner"
    },
    {
      "rating": "8",
      "text": "This film is one hell of a ride. Right from the get go you are dropped into this post apocalyptic world that is unlike any other. There is always tension and you are constantly on the endgame of your seat. The cinematography is excellent and is a shining point of the movie. The acting from the whole cast is at an all time high which elevated the dialogue. This is a must see movie and an excellent one at that!"
    },
    {
      "rating": "7",
      "text": "The first scene set the story up very well with the conversation, things happening on TV and paintings. I also enjoyed how the movie doesnt try to over-explain or over-show, allowing the audience to use more brain and imagination. Good use of the color blue on sandra bullock. the birds in the box and the human characters. a bit weird at certain points of the movie when malorie acted a bit out of her character by standing up for others when she was not good at making human connections.Unfortunately, I saw the trailers and that has ruined some of the movie for me. The second half was also not as good as the first half. I particularly didnt enjoy last 15mins, with the characters just wandering off into different directions. The ending reminded me of the babadook which babadook did a much better job. I was also very puzzled as to how 2 of the characters were not given proper names at the beginning..."
    },
    {
      "rating": "3",
      "text": "If Sandra Bullock wasn't written next to the title, no one would see it. Again, Hollywood is trying to snatch some cash by riding the waves of the latest favourite. (In this case, The Quiet Place)"
    },
    {
      "rating": "10",
      "text": "very interesting class movie. Sandra bullock performance was best as ever. must watch"
    },
    {
      "rating": "8",
      "text": "Bird Box is probably one of Netflix's most successful film to date.  It is a huge hit that even leads to various memes and dangerous attempts to emulate the characters in the film. Folks....driving a car while being blindfolded is not recommended in any situation. Beside the fact, I found this film equal in quality to its 'twin': The Quiet Place.  While the latter received heaps of praise, both films share a similar premise and equally thrilling experience.  Both are not genre changing, Oscar breaking flicks or took you into a deeper sense of dread, such as the excellent Hereditary.    In this case, well suited to be watched while eating your popcorn at home."
    },
    {
      "rating": "5",
      "text": "Bird Box is a fun enough, especially when you are at a party and this is on in the background, or if you are hanging out with friends and want to watch a light scary movie. That's a good way to describe it: \"light.\" The movie falls apart under any serious scrutiny, and it's honestly just a rip-off of \"A Quiet Place\" but it is enjoyable in spite of it's straight-to-TV-movie production value. The cast is great, and Sandra Bullock does a great job. However, it's definitely not one of Netflix's best."
    }
  ],
  "recommendations": [
    "unfriended_dark_web",
    "chernobyl_diaries",
    "shut_in",
    "hereditary",
    "pandorum",
    "the_cloverfield_paradox",
    "frozen",
    "the_new_mutants",
    "devil",
    "the_mist",
    "shadow_in_the_cloud",
    "escape_room",
    "crawl",
    "army_of_the_dead",
    "malignant",
    "old",
    "a_quiet_place_part_ii",
    "the_tomorrow_war",
    "geostorm",
    "riddick",
    "unfriended",
    "wonder_woman_1984",
    "jurassic_world_fallen_kingdom",
    "how_it_ends",
    "paranormal_activity_the_marked_ones"
  ]
}