{"id": 4135, "title": "Birth of the Dragon", "starring": ["Philip Ng Wan-Lung", "Billy Magnussen"], "runtime": 103, "genre": ["Action", "Drama"], "description": "Set against the backdrop of San Francisco’s Chinatown, this cross-cultural biopic chronicles Bruce Lee’s emergence as a martial-arts superstar after his legendary secret showdown with fellow martial artist Wong Jack Man.", "releaseYear": "2017", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/a7HY9butbuO8XwB3uBxQ98MBxd4.jpg", "categories": {"plot": 3.923076923076923, "acting": 4.125, "ending": 8.0, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 6.0, "funny": 5.0, "action": 3.0}, "reviews": [{"rating": "8", "text": "This is a fun and interesting film. It deserves more positive reviews than it will inevitably receive. It utilizes Bruce Lee the way A Hard Day's Night and Help! utilized the Beatles; \"Bruce Lee\" is a character here in a martial-arts action film, not a definitive and reverent biopic. Set in San Francisco in the mid-1960s, it lifts elements from Lee's biography—his controversial teaching of kung fu to Caucasians, his mysterious and contested private fight with Shaolin master Wong Jack Man—but it also includes entirely fictional characters and passages, including a scene in which Lee and Wong elaborately fight their way through a Triad-owned restaurant. (The choreography here and elsewhere is excellent.) The end result, I believe, nicely plays as an extension of Lee's pop mystique and brand, and I half suspect the man himself, no stranger to self-mythologizing, would smile and nod in approval. He is played by a convincing Philip Ng, a Hong Kong-born actor who achieves an appropriate combination of arrogance and charisma. Even better is Xia Yu as Wong; his is an absolutely magnetic variation on the he-doesn't-want-any-trouble warrior-pacifist archetype, and it is a pleasure to lean into his every delectably inscrutable line of kung-fu philosophizing."}, {"rating": "8", "text": "This is an enjoyable movie that brings Bruce Lee back into the spotlight for a new generation.  This movie is more like the Ip Man movies, in that they were highly dramatized re-imaginings of actual events in Ip Man's life.  The first and third acts are pretty good, while the second is a little clunky.  For a more in-depth breakdown you can see my full review here:https://www.martialjournal.com/birth-dragon-martial-arts-breakdown-review/Thanks!"}, {"rating": "3", "text": "This is not another Bruce Lee biopic, but a narrative that focuses on one seminal event. When he was just starting to get noticed, Lee was frowned upon by traditional martial arts artists because he taught non-Chinese. As a result, a great kung fu master traveled from China to California to challenge him. The fight scenes are skillfully choreographed, but there's nothing skillful about the plodding plot between them. The dialogue is written on a level below the prosaic style of a Lifetime movie. Adding a major Caucasian character to the mix is a ridiculous attempt at widening the film's audience. If you're just interested in hand-to-hand (and legs) combat, you won't be disappointed. But if you're looking for insight into Lee, this embarrassingly-written movie won't provide much."}, {"rating": "3", "text": "Birth of the Dragon introduces Bruce Lee as a character to the modern industry and the results are very terrible. Feels exactly nothing like those Bruce Lee movies that inspired this film. If it was more built under the pressure, maybe this film could have been better than what it is today."}, {"rating": "1", "text": "I watched the trailer for this movie and knew then that I was going to skip it, and I eventually was dragged into watching it on dvd with family, so heres my review, this depiction by the WWE is really written like a WWE fight, I was surprised that the undertaker was not written into the fight, this movie was a bad idea, in reality only a few people actually witnessed Bruce Lee when he fought Wong Jack Man, and this movie tries to hype the fight out of proportions, the real fight in reality lasted 3-5 minutes at best and Bruce barely won the fight fair and square, now imagine WWE fan fiction written surrounding a 3-5 minute fight that bruce lee won in reality, and thats pretty much what this movie is, a whole lot of fan fiction and the 3-5 minute fight is not even accurate to real fight that occurred, i'm glad I skipped it when it was in theaters..."}, {"rating": "1", "text": "Bruce Lee is one of the most written about film stars of all time. His actual filmography includes only four completed pictures, but his influence on the Industry was beyond immense.As such the life of this myopic Chinaman has been documented from his birth in California in 1940, to his untimely death aged 33 just a few short weeks before the film that would etch him into cinema folklore, Enter The Dragon, was released.Now, I'm not the most cynical of people, but this film (Birth of the Dragon) is exploitative in the most heinous of ways. The film opens with some text explaining that Bruce fought against a \"Shaolin Master\" named Wong Jack Man. In actuality, the two men engaged in a very short bout, Wong wasn't a Shaolin Master, and the fight wasn't really anything but a test of comparitive styles.So, what we have is a fictitious story, inspired by a fictitious event, populated by fictitious characters, in a fictitious, seemingly parallel, timeline.Birth of the Dragon, as a work of fiction, could have been good.. But it isn't. There clearly wouldn't be enough of a narrative if the film was solely about the build up, and aftermath, of the inevitable 'big' fight. So, rather than delve into anything related to the two 'fighters'.. Their motivations, their lives, their actual ideologies.. We instead get some meaningless interactions between the two and a completely made up Caucasian character (Steve) who serves as the go-between, as well devoting a lot of run-time to his infatuation with a Chinese serving girl at the de rigeur lady gangster's restaurant.Ultimately the big fight falls into the now usual trope of the older (wiser) combatant purposely pulling punches in order for the other younger (naive) fighter to understand the Sesame Street level philosophical stance he's been attempting to preach.The martial arts action is par for the course, decent enough choreography and long takes to show the actors have had to spend a bit of time rehearsing the scenes. What is annoying about the fight scenes is that, as usual, the 'styles' on show by each character aren't anything like what they are supposedly masters of. Lee doesn't apply much Wing Chun, and relies quite a lot on high kicks which the style doesn't really use. And Man, who is meant to be using Tai-Chi and North Shaolin kicks, instead applies more reverse holds and sweeps...So, in conclusion...Film is bad. Action is average. Storyline is completely made up. Acting is wooden."}, {"rating": "5", "text": "A bait and switch, the story is still solid. There's the main plot of Bruce Lee vs Wong Jack Man, but there's also the sub-plot with Lee's white student falling for a Chinese girl and wanting to rescue her from thugs. The sub-plot actually becomes the main plot which has understandably angered viewers, and why I call it \"bait and switch\". The movie is nothing special but it has some good fight scenes, and the story grows on you. I thought I was going to hate it, but didn't. It's OK but it's not worth a $15 ticket."}, {"rating": "3", "text": "A tremendous lack of respect for the name and legacy of Bruce Lee, and it's not because it harms his work, but because it's going to be associated with him."}], "recommendations": ["kickboxer", "captain_america_civil_war", "the_foreigner", "creed_ii", "the_league_of_extraordinary_gentlemen", "fearless", "john_wick_chapter_2", "captain_america_the_winter_soldier", "the_equalizer", "abraham_lincoln_vampire_hunter", "the_eagle", "hulk", "12_strong", "the_running_man", "300_rise_of_an_empire", "the_great_wall", "hellboy_ii_the_golden_army", "the_legend_of_zorro", "troy", "mission_impossible_rogue_nation", "shooter", "white_house_down", "jack_ryan_shadow_recruit", "safe", "tomorrow_never_dies"]}