{
  "id": 19,
  "title": "Black Widow",
  "starring": [
    "Scarlett Johansson",
    "Florence Pugh"
  ],
  "runtime": 134,
  "genre": [
    "Action",
    "Adventure",
    "Science Fiction"
  ],
  "description": "Natasha Romanoff, also known as Black Widow, confronts the darker parts of her ledger when a dangerous conspiracy with ties to her past arises. Pursued by a force that will stop at nothing to bring her down, Natasha must deal with her history as a spy and the broken relationships left in her wake long before she became an Avenger.",
  "releaseYear": "2021",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/kwB7d51AIcyzPOBOHLCEZJkmPhQ.jpg",
  "categories": {
    "plot": 8.090909090909092,
    "acting": 7.1,
    "ending": 8.0,
    "soundtrack": 5.0,
    "cinematography": 10.0,
    "familyFriendly": 6.0,
    "funny": 7.5,
    "action": 8.291666666666666
  },
  "reviews": [
    {
      "rating": "0",
      "text": "thank god for no way home being a thing, cause except for that movie all other post-endgame mcu films have been garbage including this"
    },
    {
      "rating": "0",
      "text": "this is the most disappointing thing since captain marvel and avengers endgame"
    },
    {
      "rating": "0",
      "text": "Just when I thought Captain Marvel was the worst in the MCU... this movie's existence is absolutely pointless to pushing the universe forward"
    },
    {
      "rating": "0",
      "text": "The film spends scant time exploring the implications of these darker themes, and doesn’t attempt to understand the root of Dreykov’s god complex. Instead, it’s more comfortable in comedy mode"
    },
    {
      "rating": "6",
      "text": "Llega un poco a destiempo, y se nota, tendría que haber salido hace 2 años, pero aún así sigue siendo un homenaje muy chulo al personaje y a la actriz, y merece la pena.Merece la pena solo por el bonus clip, que fue espectacular, pero además el todo espías, modo detectivesco que tiene, es súper interesante, todo sumado a una muy buena acción, con unos toques de comedia bastante bien medidos, en general está muy guay, pero si tuviera que destacar algo serían las coreografías.La primera mitad es sensacional, en especial la escena inicial, a partir de la segunda tiene ese factor de pecar de irrealidad, como dando la sensación de que Natasha es inmortal, y no me mola el rollo.Cosas buenas: las coreografías, las actuaciones de todo el reparto, y en especial, el personaje de Taskmaster.Cosas malas: el argumento no es demasiado bueno, quizás peca un poco del típico tópico de espías, el villano en general no es demasiado emocionante, creo que podían haberle dado otra perspectiva.Conclusión: En general está bien, muy entretenida, pero tampoco es una maravilla, como homenaje funciona, y lo vas a pasar bien, pero nada destacable."
    },
    {
      "rating": "0",
      "text": "Black Widow is what happens when movies abandon human values for the emotional"
    },
    {
      "rating": "5",
      "text": "Marvel has made some of finest superhero movies of the 2010's, so it comes as a surprise that Black Widow feels so pointless and at times boring. A generic action film with little consequences to the MCU at large."
    },
    {
      "rating": "0",
      "text": "This movie gets the lowest possible rating for its propagandistic depiction of Russia and its citizens.Non-US affiliated male Russians are portrayed as incompetent or cunning, calculating, cruel, corrupt, lacking sophistication etc., whereas their female counterparts are portrayed as victims (e.g. the scenes after Natasha and her sister are taken from their 'parents' being filmed in such a way as to evoke documentary footage of human trafficking and prostitution rings; the Widows being deprived of their reproductive organs by their male superiors.) And Russian prison wardens and inmates apparently do not merit rescue by our heroes after being buried underneath an avalanche.The film-makers want it both ways - we are to believe that Russia is a backward nation with second-rate technology (note the cumbersome Russian helicopter contrasted with the sleek American Quinjet), but also one that is extremely capable at causing international strife - due to the indoctrination of its citizens, the deprivation of their individuality and free will. A 'good' Russian is thus one that hopes to escape to Ohio ('The Land of the Free') or join an American superhero taskforce.To have all the Russian characters portrayed by Western actors is but another glaring example of the movie's dishonesty, but also helps us identify it as that which it ultimately is - propagandistic filmmaking. Black Widow exemplifies the considerable sway of the US military-entertainment complex, its ability to impose its geopolitical agenda on the MCU; but the obvious propaganda leaves the movie bereft of any artistic merit it may have otherwise possessed.I can but humbly suggest that viewers seek out Andrey Zvyagintsev's masterful 'Loveless' for its critical, unflinching portrayal of modern-day Russia.I'd like to add that 'feminism' and 'SJWs' aren't to blame for the movie's Russophobia. That so many users here believe this to be the case is quite worrisome, and imo proof of the efficacy of our politics of division. We should all wish (for the world) to be free of scapegoatism, oppression and double-standards."
    },
    {
      "rating": "0",
      "text": "I'm really impressed with the score of this movie, it's a complete mess, waste of time, unnecessary jokes, cringe-worthy acting and a waste of talent with a good casting, this one of the worst movies I have seen all year, no waste your time, if you are an Marvel fan you can skip this one and nothing is gonna change."
    },
    {
      "rating": "4",
      "text": "Meh, the best part of this movie was I didn't need to pay for it as it's on Disney+ was able to watch it while finishing some work. More of a marvel toss away, as I think they were just trying to run out Scarlett Johansson's contract."
    },
    {
      "rating": "10",
      "text": "Very entertaining summer flick.With nonstop impressive action.And outstanding performances from Florence Pugh and Scarlet."
    },
    {
      "rating": "7",
      "text": "The post-pandemic era is among us, and two years after 'Spider-Man: Far from Home', we finally get our first Phase 4 MCU film in the form of 'Black Widow', a prequel film of sorts that takes place between the events of 'Captain America: Civil War' and 'Avengers: Infinity War', and sees Scarlett Johansson's Natasha Romanoff going up against the secretive Black Widow organization that raised her, along with the help of her family. As far as MCU entries go, I'm just gonna straight up say that this is pretty much middle of the road territory. The stakes never felt especially high and this felt more like just a fun filler entry. As far as performances go, Johansson delivers with great action and a headstrong performance, but for me it was Florence Pugh as her younger sister that stole the show. She had plenty of humorous comic relief moments and one-liners throughout and also got to shine in some great action sequences of her own. David Harbour and Rachel Weisz are also worth mentioning as their parents, who both deliver some great scenes and moments alongside each other. Overall though, the cast and action sequences make things enjoyable and worthwhile enough to make up for a generic and straightforward story, and there's certainly been weaker MCU entries. Stick around till the very end of the credits for that trademark MCU end-credits scene."
    },
    {
      "rating": "10",
      "text": "Much needed breath of fresh air in the MCU. After the darkness of Infinity War and Endgame, it was refreshing to see what made the franchise so lovable in the first place. As usual, Scarlet Johansson is amazing, but also newcomer (to the MCU) Florence Pugh."
    },
    {
      "rating": "9",
      "text": "I thought the movie was great. It was just a simple superhero movie in the best way possible. Incredible performances by Scarlett Johannsson and Florence Pugh. Amazing visual effects and fight choreography. Overall great."
    },
    {
      "rating": "7",
      "text": "The Black Widow movie is good, the first and second act are good but the third act has serious pacing problems as well as special effects. Yelena's character steals the movie, the villain is basic, forgettable and unmotivated."
    },
    {
      "rating": "5",
      "text": "The opening credits to a slowed down cover of Nirvana made me think it was directed by Zack Snyder. Either way, it was at the same standard of most Marvel blockbusters. Better than the painfully dull Endgame, but just a mediocre kids movie. The crybabies who hate \"wokeness\" are losing their minds over it, so that's funny. Keep up the good work, Disney! lol"
    },
    {
      "rating": "7",
      "text": "Slightly above average superhero flick where the interaction between the main protagonists was the most entertaining part by far. Especially the little sister was really good. The villain part of the story was .. eh. Been there, done that. But there were more than a few laughs and the action is well choreographed. The only scene that really irked me was the 'fight' between the sisters when they first met again after many years, as adults. WTF was that about? That made NO sense. All in all worth the price of entry though."
    },
    {
      "rating": "10",
      "text": "I think the movie was great . It showed a lot about natasha’s past and I love yelena’s character"
    },
    {
      "rating": "5",
      "text": "It's ok, but releasing after whole 4th phase of MCU doesn't make any sense. Plot is terrible, Taskmaster was terrible and motives of main villain are garbage.On the other hand I found there decent humor, enjoyed Harbour's Red Guardian and most of the 'family' moments, but it kinda felt like a generic action movie."
    },
    {
      "rating": "10",
      "text": "Wow! This movie was very fantastic! Very intense and had some touching moments too. It also has tons of action. Seeing this movie at a theater was just so much fun! If you are a Marvel fan, go see this in a theater. I think Marvel fans will like this movie!"
    },
    {
      "rating": "9",
      "text": "Awesome movie, Florence Pugh, Scarlett Johansson and David Harbour was Amazing. Action also perfect"
    },
    {
      "rating": "9",
      "text": "Black Widow did NOT disappoint!!Ever since I heard the possibility of Natasha's own solo movie, I was thrilled. And knowing the release date just added to the anticipation. I know a lot of us were worried that this movie wouldn't live up to our lofty expectations, but it absolutely exceeded them!Black Widow was amusing, intense, and entertaining. It possesses its own gritty distinctiveness while appearing to blend in well with the rest of the MCU. Scarlett Johansson then delivered an outstanding performance. It truly saddens me that this will be her final appearance on the big screen as Natasha Romanoff.  As for Florence Pugh, as Yelena, it was just chef's kiss. She gave her all to this charming character. I gonna love seeing Yelena more in the MCU. Not to mention Rachel Weisz and David Harbour. They were also fantastic on-screen, contributing to the family-like dynamic with Scarlett and Florence.Overall, this is a film that everyone should see. It features an excellent soundtrack, CGI, and combat sequences. For the first time, I feel like I'm finally seeing a non-objectified portrayal of Natasha."
    },
    {
      "rating": "10",
      "text": "Okay this movie was a lot better than I thought it was going to be, lots of family drama paired with mission impossible and fast and furious levels of action and it is spectacular! See this movie its worth it"
    },
    {
      "rating": "10",
      "text": "Outstanding movie of Black widow and again they did amazing stunned and then when I heard they're going to St Petersburg and reminded me of James Bond Pierce brosnan 1995 when he went to St Petersburg for janus AKA for and I think for most fans they should definitely see this movie of Black widow the great work the action the stunts and everything else and especially the funny part is well you might see some ambulances being loud exploded and the funny part that I saw in the movie is when Scarlett Johansson is watching the all-time 007 classic movie of all time James Bond Moonraker when I saw that I said okay now I figure out Scarlett Johansson is a huge Bond fan person but a great work what they did on the movie and of course showing a little clip of James Bond 007 which that movie is the next saga on this year's 2021 and great work and also I have many words to say but when I saw her watching it it's just saying okay wow I guess black widow is already into the film of 007 which sadly we ready found out that this may be the last action film or Daniel Craig's as James Bond but again great work very actor that did this film and great job for Scarlett Johansson and if we didn't know that she spoke Russian oh wait no we didn't know from the other avengers movie so yep great work and I hope this film keeps going on from theater cinemas into Disney Plus Alex trevellian"
    },
    {
      "rating": "7",
      "text": "This movie starts off strong with a compelling introduction that shows promise for the main characters but don't let that fool you into thinking this will be more than another average marvel action movie. The action is over the top and bogged by cgi. All the villains are immediately forgettable. And the humor is a constant hit or miss. All said, this movie does have an emotional core with the family that sustains in scenes throughout. Dan Harmon and Florence Pugh act very well and bring a lot of charm in the movie. Would recommend but don't have high expectations for Marvel's long overdue solo film."
    },
    {
      "rating": "10",
      "text": "Great movie. Better than expected, loved the interactions and happy to see Widow in her own movie"
    },
    {
      "rating": "10",
      "text": "I love this movie. Just what I needed to watch this year. The characters flowed so seamlessly, as though they had real feelings and concerns for one another. The story was superb and much needed in these times of relentless chaos and the reminder that family, even if not linked by blood, is the truest bond for a person to ever experience in a lifetime. Bravo Black Widow, the wait was truly worth it."
    },
    {
      "rating": "7",
      "text": "The movie itself is pretty good but what hurts it the most is that it came way too late.  This movie should have been released like five years ago when the Black Widow character was still relevant.  Loved Scarlett and Florence and Rachel but I didn't like how the Red Guardian character was handled in this. Other than the beginning of the movie he seemed useless which doesn't make much sense to me."
    },
    {
      "rating": "7",
      "text": "Classic case of ill-informed timing severely kneecapping a movie's enjoyment. It's not the movie's fault. In fact, there's not much *in* the movie at all that anyone should be considered at fault for. The narrative is solidly constructed, with decently affecting emotionality and some engaging elements of moral intrigue layered throughout. The performances vary from generally convincing to downright scene-stealing, with Florence Pugh and David Harbour representing the film's two main standouts. Even the action and set pieces are enthrallingly well-put-together. So, tell me - where the hell was this movie five, even ten years ago? Why now? After what we already know happens to the central character in question, why have a solo outing *now*? Would have almost stung less if this movie were just downright bad. At least at that point the whole idea of a solo Black Widow movie would seem to have been a bust. But, no. This is actually solid in every department except the intangible ones. The meaning behind any of what you're seeing on screen is simply all over the place. It's a damn shame, but an entertaining one, to be sure."
    },
    {
      "rating": "7",
      "text": "Black Widow seems to have been placed at the wrong time. For a viewer, who takes the amalgamated approach of MCU phase movies and Disney plus streaming series, this movie should have benefitted from an ideal placement during the phase 3 progress. A Captain Marvel movie predated its release. The action, humor and drama are scintillating enough to bring viewers to the edge of their seats. The characters are neatly done and stays as the USP throughout. The experience would have been even greater, if the last act wasn't riddled with messy sequences. That dragged the experience down for  my the movie, giving similar vibes like Iron Man 3 and Age of Ultron. A pass, otherwise. 6.75/10"
    },
    {
      "rating": "7",
      "text": "A good solo film on one of the key member of the Avengers. Seeing the events that happen between the two Infinity stone wars, this was a good filler movie. I wish I got more Red Guardian moments but he was still great. Taskmaster reveal surprised me. The end credit scene that ties in with Falcon and the Winter Solider definitely was a cool nod towards the future of the MCU."
    },
    {
      "rating": "9",
      "text": "Although Black Widow is not one of my favorite Avengers, this a solid film. It's your standard Marvel superhero action movie. Great performances by Florence Pugh and David Harbour. The Red Guardian was a very fun character, I really wish we got to see more of him."
    },
    {
      "rating": "7",
      "text": "Porządny film Marvela, trzymający się jego standardów. Plusem jest trochę szpiegowski klimat oraz wątek relacji ,,rodzinnych\". Reszta to jednak typowe MCU"
    },
    {
      "rating": "10",
      "text": "best movie i’ve watched in a long time acting was amazing scarlett johansson and florence pugh are very naturally talented plot and cinematography was incredible"
    },
    {
      "rating": "7",
      "text": "We finally get Natasha's dark past and what was troubling her in all these years as an avengers. However, there were few flaws in the movies...we didn't get enough of the Taskmaster, where she was sort of a puppet than a Villain. So, I think the main Focus on the movie was to put us into Natasha's pasts. However, the movies was a success...that's Why I give it 7/10."
    },
    {
      "rating": "10",
      "text": "This movie was amazing and the action in it was incredible. It was a great way to say goodbye to Natasha Romanoff and a very good way of introducing new characters as well as connecting them to the story lines of other upcoming mcu projects."
    },
    {
      "rating": "7",
      "text": "Mostly positive. Enjoyable but forgettable. Zero stakes except for setting up other characters in the MCU.This movie is NOT a 10, nor is it a 0. It's a middling, generic MCU clone of Bond, or Bourne."
    },
    {
      "rating": "9",
      "text": "I loved this. Best Marvel movie in my opinion. Full discloser, I'm not really into super hero's and all that but I love James Bond movies."
    },
    {
      "rating": "8",
      "text": "Really solid Marvel movie. I put it ahead of Ant-Man and Black Panther. Nice story with believeable characers."
    },
    {
      "rating": "10",
      "text": "The movie was just like i was expecting AWWWWWSUM MOVIE and the post-credit \"my god\" cant wait for \"HAWKEYE\"LONG LIVE MCU"
    },
    {
      "rating": "10",
      "text": "I made a Meta critic Account just for this movie it had the emotional Depth The other marvel films lack it delt with deeper issues While avoiding The batman v Superman to Dark Fault while also Skateing the line of being to dark and To lighthearted to be taken serious This is the best Standalone marvel film perfectly Paced action was Top notch Story was engaging and never got stale and was vary unpredictable the best Superhero movie marvel has produced all around i love captain americas Trilogy this tops it and by a large margin It takes a character i was less intested in and gave her the backing of good writeing and action Couldnt ask for more GREAT GREAT movie"
    },
    {
      "rating": "9",
      "text": "This was a really solid movie with fantastic action, I'm thrilled we finally got to see her story."
    },
    {
      "rating": "9",
      "text": "Black Widow stands as one of MCU's best outing and being released during the pandemic, it was the first one that they released in almost 2 years. The end result: an incredible spy thriller that should have been released many, many years ago.  If it was released then, probably Scarlett Johansson would have second thoughts about leaving one of her signature roles. However, we literally have a new Widow to contend with: Florence Pugh. Wow...again, another great find by Feige and Co. Pugh has always been a great actress but sorry to say, I felt that she fit more like a glove in this universe in comparison to Johansson herself. I always felt that they always tried to fit Natasha to Scarlett's and not the other way around. Pugh on the other hand is literally born to play Yelena.  Great action sequences as usual, and after three great Disney+ series, I thought that the cinematic experience for the MCU is a goner. Not anymore. When the pandemic is truly over, people will return to the cinemas to see these flicks again."
    },
    {
      "rating": "10",
      "text": "I love the movie but I get and understand the issue ppl may have but BW is a better movie than WW84 even thou they are not comparable in general. I really enjoy the VFX and the female power from ScarJo, Florence and Rachel was just amazing to witness. I see the potential to keep the BW verse alive and cant wait."
    },
    {
      "rating": "10",
      "text": "Perfeitas, o pós crédito foi incrível, eu esperava mais do vilão do filme mas scarlett e florence tem uma química incrível"
    },
    {
      "rating": "10",
      "text": "amazing... i don't have word about this movie.. scarlett johansson queen of mcu"
    },
    {
      "rating": "10",
      "text": "Bro one of the best one has the action it’s soo sad and bro the post credit WOW THAT GOT INTERESTING I reccomend this"
    },
    {
      "rating": "10",
      "text": "It was a pretty good movie. It had good action scenes, there was a fair amount of comedy in it. The story was good. The characters were great."
    },
    {
      "rating": "7",
      "text": "Set immediately after the events of Captain America: Civil War,  Black Widow sees Natasha Romanoff on the run and forced to confront a conspiracy tied to her past.The cast is a bit of a mixed bag (Florence Pugh being the standout), and it doesn’t do anything you haven’t seen in numerous other Marvel Movies, but as ever the mix of humour and action provides a couple of hours of enjoyable entertainment."
    },
    {
      "rating": "7",
      "text": "This movie won't blow any minds, but it is a good action movie with some nice set pieces and some quite fun moments. I suspect most of the bad reviews are spurred by the fact it's a female-centric movie. Forums are filled with salty self appointed victims crying woke. But there isn't an agenda here. Just a standard (smaller scale) MCU movie. It's not citizen kane but it's a fun popcorn flick."
    }
  ],
  "recommendations": [
    "captain_america_the_first_avenger",
    "x_men_days_of_future_past",
    "avengers_age_of_ultron",
    "eternals",
    "man_of_steel",
    "thor_the_dark_world",
    "thor",
    "top_gun_maverick",
    "edge_of_tomorrow",
    "avengers_endgame",
    "thor_ragnarok",
    "black_panther_wakanda_forever",
    "dredd",
    "the_hunger_games_catching_fire",
    "creed_ii",
    "fantastic_beasts_the_secrets_of_dumbledore",
    "spider_man_far_from_home",
    "looper",
    "indiana_jones_and_the_temple_of_doom",
    "creed",
    "the_suicide_squad",
    "super_8",
    "the_guardian",
    "top_gun",
    "the_magnificent_seven"
  ]
}