{
  "id": 3612,
  "title": "Black Mass",
  "starring": [
    "Johnny Depp",
    "Joel Edgerton"
  ],
  "runtime": 123,
  "genre": [
    "Drama",
    "Crime",
    "History"
  ],
  "description": "The true story of Whitey Bulger, the brother of a state senator and the most infamous violent criminal in the history of South Boston, who became an FBI informant to take down a Mafia family invading his turf.",
  "releaseYear": "2015",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/zfwciv4LIJkNQsfuhYGv0Nkiweg.jpg",
  "categories": {
    "plot": 6.327272727272727,
    "acting": 6.673913043478261,
    "ending": 6.0,
    "soundtrack": 1.0,
    "cinematography": 5.6,
    "familyFriendly": 3.0,
    "funny": 7.0,
    "action": 7.545454545454546
  },
  "reviews": [
    {
      "rating": "6",
      "text": "This movie is a solid \"ehh.\" Now that's not *bad*, but it's certainly not good, also. I would describe this as a good Netflix Saturday \"don't have anything to do\" kind of movie. It's a little tedious towards the middle, but so are many Netflix movies. The ending certainly ends on a whimper too, we see little of Bulger on the lam, as it were. I mean  the guy was a mile from FBI headquarters in LA for 10+ years and nada! What can you do.\r Depp is bizarre looking and a total and utter distraction. He should drop all this makeup pretense he uses to cover up for his somnambulant acting, but I digress.\r Netflix night only."
    },
    {
      "rating": "4",
      "text": "This movie is a bomb plain and simple. It is uninteresting, boring, flat, and a major disappointment. I do not know how you  such a dull film about Whitey Bulger but thy managed to. Depp was nothing special either except he got a few murder scenes under his belt. I think the big mistake was making the center of the movie his relationship with the corrupt FBI agent instead of the criminal activities that he carried out. A big time disaster."
    },
    {
      "rating": "4",
      "text": "Not new. I've seen this. Depp already played this role at least 2 times, with more or less the same story, mafia, police, arrests.... blah blah blah. :/ disappointed."
    },
    {
      "rating": "5",
      "text": "This movie represents a triumphant return to form for Johnny Depp. He does an amazing job playing the lead \"whitey.\" Unfortunately, for me that's where the positives in this film end. Its a crime movie we've seen before. Goodfellas, the Casino, Godfather, heck the Sopranos. Some of the dialogue, and ideas for scenes are straight borrowed. Not an homage. Benedict Cumberbatch is in the film. His character doesn't really add to it in any way. He's just there. Its a fairly small part. The problem with this film is we are told things like \"whitey was never the same after SPOILER OBSCURED died.\" Sure he was. Portrayal the same. World the same. Despite him \"moving up.\" A bunch of people die in mob related violence.  The film lacks a protagonist. And though Johnney Depp's performance is amazing, his character is not a sympathetic anti-hero. Making the whole experience dull, and forgettable."
    },
    {
      "rating": "5",
      "text": "Although Black Mass has a spectacular performance by Johnny Depp and some very good supporting actors who do their best under the circumstances, this movie is a mess. The plot makes little sense and has some really dull sections (believe it or not). We couldn’t decide if it was the plot or the direction or the editing – or was someone brought in at the last minute to try to save the film? A lot of acting talent wasted."
    },
    {
      "rating": "5",
      "text": "Johnny Depp excels in his visceral and looming performance of Jimmy Bulger, but his surrounding environment isn't vibrant or entertainingly dark like a good gangster biopic should be but is instead undoubtedly, as Jimmy would have put it, all over the f*cking place."
    },
    {
      "rating": "7",
      "text": "Watching Johnny Depp in a genuinely different role was delightful. Sadly, though, none of the supporting characters are as interesting or transcendent as Whitey Bulger's, therefore the movie in itself feels more like an uninspired Goodfellas than anything else."
    },
    {
      "rating": "10",
      "text": "A Great Movie, No too great like Scarface (1983), But efficient enough to have the highest note, in his own harmony the movie works, Johnny Depp Gave us a great, and commited performance....."
    },
    {
      "rating": "3",
      "text": "This movie definitely did not impress me. The story lacks focus, the writing takes an interesting story and leaves A LOT to be desired, the cinematography was dark and gritty merely for being dark and gritty's sake, and there is WAY too many \"LOOK AT ME I'M ACTING\" performances. Definitely not Johnny Depp's best work. There was a lot of wasted potential in this movie."
    },
    {
      "rating": "8",
      "text": "Action, tension, bad*** protagonist, very interesting script and exciting development. I'm always curious what is it about criminals, that drive us crazy and make us somehow delight them. That's just the loyalty they have to their 'partners', the confidence and the courage mostly 'non criminal' people don't have. Johny Depp's performance is like always outstanding."
    },
    {
      "rating": "3",
      "text": "The movie suffers from insufficient exposition and character development. We are told more than we are shown and this weakens the film when it comes to moments that are supposed to have an impact on the audience. The decision to not make Whitey (Depp's character) the central character is a giant mistake, and it is disappointing how uninteresting and one-dimensional the character is, despite Depp's command of the role. The storytelling is disconnected and is more similar to a documentary than anything else. Most scenes are devoid of tension and fairly predictable. Despite the excellent cast the actors come off bad due to the half-baked, dull script. Finally, the movie suffers from bland shot composition and cinematography, so don't expect any shots to wow you. I have seen many crime films and this is the first one that has actively bored me. The film squandered most of its potential and could have been a very interesting character study. The only reason to see this movie is to see Depp taking himself and his career serious again. Apart from that this movie is entirely passable."
    },
    {
      "rating": "6",
      "text": "Only mildly interesting.  I expected Bulger’s life to be fascinating, but it’s more like Joe Pesci’s character in Goodfellas on Lithium.\r This gangster story covers little new ground.  The movie is conventional storytelling that lacks drama and feels a bit too long as it labors through two decades of Bulger’s life as a criminal who murdered those around him whom he viewed as a potential threat, and then skips over how he went in to hiding and managed to avoid capture for 16 years.   Many of the scenes are reminiscent of Goodfellas only much duller.   While you might think it would be cool to be a Wiseguy, you’d never want to be a member of the Winter Hill Gang, because their lives are completely devoid of any joy, excitement or anxiety.\r J Depp will no doubt receive a Best Actor nomination, but it’s not enough to make me recommend this movie.  After a long summer movie drought, this movie was like the promise of rain in the Kalahari Desert, only to see it evaporate before ever touching the ground."
    },
    {
      "rating": "6",
      "text": "Black Mass is at times engaging and throws you in a world of vivid characters. Depp particularly shows that despite the foibles of his past years he is still a great actor. Yet despite those few gems the movie is coated with a deep layer of mundanity that does nothing but leave you with a sense of emptiness after the movie is done.\r Black Mass suffers from a common ailment of Based on True Events films in that real stories do not fit nicely into narratives. That's especially true for films that try to span many years. Black Mass, like many such films, feels rough around the edges like it just doesn't have the time to tell the entire story so it just bites off pieces here and there making the finished work look like Cliff's Notes of a much larger story.\r I didn't feel satisfied with what I got in the end. The movie doesn't focus on any one character or at least paint a portrait of the criminal world. To tell the truth I felt rather disappointed after the movie ended because I expected so much more from this film. I do believe it had the potential for greatness."
    },
    {
      "rating": "7",
      "text": "Black Mass is a solid film that show cases Johnny Depp's best acting performance in over a decade with Joel Edgerton even outshining him. Black Mass is a fascinating true story that isn't told to it's full potential unfortunately."
    },
    {
      "rating": "8",
      "text": "Johnny Depp gives one hell of a performance in this film as infamous South Boston gangster James 'Whitey' Bulger. I'll be straightforward and say that Depp's performance alone is the main reason to check this film out, as he truly gives it his all in this. However, with that being said, the whole cast and their performances were all great and easily the film's strongest aspect. Joel Edgerton gives a great performance as FBI agent John Connolly. Benedict Cumberbatch also did well as Whitey's younger brother, and I must say that I was rather surprised at how well he was able to pull off a convincing Boston accent with him being a British actor. Other cast members, such as Kevin Bacon, Corey Stoll, etc also gave noteworthy performances. As for the rest of the film, it did feel a little \"been there, done that\" in terms of gangster and crime films. Then again, I understand it is kind of hard to make films like this stand out, especially since so many of them have taken place in Boston like this film (The Departed, The Town, American Hustle, etc.) But like I said, it's the strong work from the cast that makes the film worth watching, and it is a step above director Scott Cooper's last film Out of the Furnace."
    },
    {
      "rating": "7",
      "text": "I expected to much off this movie like a blind date, it didn't romance me but it had its moments. Sometimes hype can kill the anticipation. Black Mass was like a layer of onions being peeled back. Usually you have some admiration for the villain like Hannibal, The Joker in Batman or Loki from Thor, but Johnny Depp as Whitey Bulger makes you cringe and  makes you wish for his demise. Even Tony Soprano had some likable qualities."
    },
    {
      "rating": "7",
      "text": "Depp gives a performance that reminds us why we still consider him one of the top actors in Hollywood. Edgerton is another strong up and comer who continues to build his career with another great performance, A performance that even outshines Depp. As for the film itself, It's a bit long but entertaining enough to keep you interested. I wish they went more into the back story of the characters though, A bit more on the plot, instead of a few filler scenes.\r Still, Very enjoyable and I am glad I went to see it."
    },
    {
      "rating": "3",
      "text": "A rather one note modern gangster drama in which the acting is far better than the material deserves. Johnny Depp gives a more grounded and less hammy performance than one has become accustomed to in his roles of recent years, but the material resolutely refuses to provide much emotional resonance whatsoever. Joel Edgerton is saddled with an irritating character and the film demands constant, but hard won, concentration to keep up with what is going on. Depp's make up is fantastic and the actor is almost unrecognisable. However, when you've said that you've exhausted all other possible points of interest in this disappointing and flatly conceived true story. 'Goodfellas' it 'aint."
    },
    {
      "rating": "1",
      "text": "It's dark, dull, and boring.  A lot of dark backgrounds and dark scenes.  Even the music is dark.  A lot of dark-sounding strings music.  The soundtrack sounds like a funeral dirge.   Scenes are so literally under-lit that it makes you want to turn on a lamp.  Dark cinematography.  Depp looks ridiculous and despite heavy make-up effects still doesn't look at all like Whitey Bulger.  Different facial structures.  There is no real character development in the script.  From this movie I learned nothing new about Bulger.  Nothing about how he became this person, his life before the events in the film, the nature of his personal relationships, how he became leader of his gang, his upbringing or anything else.   It is an empty film with boring dialogue mixed with excessive profanity and occasional violence.  The very few occasions when somebody gets killed are the only thing to keep you from sleeping.   They don't explain in any depth the events that transpire in the film, and a viewer could easily get lost.  They never fully explain who his brother was, so the one scene with him served no purpose at all.  If you want to give this film a chance, do so with a cup of coffee.  I almost dozed off numerous times.  Ho-hum."
    },
    {
      "rating": "7",
      "text": "Okay, this movie was in that suspense mode at all times and it was pretty decent to see Johnny Depp playing another character and killed it like always. 'Black Mass' is a thrilling sensation but it doesn't deliver the madness that I wanted to see, it was mostly the intense scenes and the violent acts in this movie. Loved the Bulger vibe and Johnny delivers big time but this movie didn't as much as I wanted to see. Good story and great acting."
    },
    {
      "rating": "7",
      "text": "It's a good, solid movie.  Depp's performance is impressive, as is Edgerton's.  (I'd be remiss to leave out the smaller powerhouse role of Rory Cochrane). As far as stories go, this one is a bit more unsubstantial than I thought it would be. They don't explore certain areas that seem like fertile ground, such as the relationship between the brothers:  Bulger the criminal and Bulger the state senator.  They touch on it, but that dynamic would be incredibly interesting to explore.  Bottom line:  it's absolutely worth seeing, but is it as good as The Town, The Departure, Good Fellas, etc?  Not close."
    },
    {
      "rating": "10",
      "text": "Black Mass is a solid gangster film. Johnny Depp gives arguably the best performance of his career. Its definitely a return to form for Johnny and the movie itself is one of the best of the year."
    },
    {
      "rating": "10",
      "text": "Welcome back Johnny Depp. True caliber of his fine acting. He is ruthless, spine tingling creepy and in some ways warm. The depth of this character was brought to the screen by Mr. Depp. His performance is not only Oscar Nom worthy but a serious contender. Great film, expresses the true story of Whitey Bulger and helps the audience understand the rise of the man as a criminal. A must see."
    },
    {
      "rating": "1",
      "text": "Johnny Depp! You know what Depp called in German? Exactly what he has done in recent years: namely as an overtightened PeeWeeHerman staggering across the canvas. And Black Mass does not make it better! Three kilos of putty to make the last few years is not undone. Alone this whole make-up makes him untrustworthy in this movie! Totally unreal, what is not on the character. Can actors he now or not (no longer)? Does he Paste is to simulate expression? Then that's gone mighty awry.\rI find this millionaires should be drawn from the film business and let ambitious successors such roles. Depp looks tired, listless, arrogant and at most still doggedly, but not talented, and not with the soul at work.\rProbably they also swallow the cost of production could use a project elsewhere well as requsite, buildings etc.\rI was very disappointed, once again! Luckily I waurde invited. I would have otherwise never invested from my own pocket a penny.\rCertainly a good movie ... without Johnny Depp!"
    },
    {
      "rating": "4",
      "text": "Over-rated by stupid herd mentality critics and moron users on here, don't believe any of it.  The movie is very well acted.  The filmmaking \"technically\" is very astute and assured.  The tone is serious and correct.  Depp is amazingly transformed and excellent.  This all said, it is a sheer near excruciating bore!  It is flat, it is lifeless, it is staid, and it is utterly predictable with no surprises whatsoever.  You are better off watching a free true crime show on TV.\rPut it this way:  I give \"The Departed\" a flat out 10.  Best film of 2006 and miles above this thing.  \"Goodfellas\" a 9 or 10 in my book.  \"Scarface\" 9.  \"Carlito's Way\" 10.  \"Mystic River\" 8 or 9.  You see above what I give this."
    },
    {
      "rating": "7",
      "text": "Johnny Depp piles on the makeup to play notorious Irish mobster James “Whitey” Bulger. This solemn film tells the story of his rise to power in Boston and the collaboration with the FBI that allowed him to become so ruthless. Depp's steely cold exterior results in a subdued portrayal that sometimes exposes the undercurrent of rage and violence. The entire cast inhabits their rough characters with unattractive authenticity. The continuous overtone of anger, mistrust and unhappiness pervades the film's every minute, but this is also its weakness. Some lighter moments would have added contrast and mounting tension would have made the experience more intense. As it stands, the performances are strong, but the constant low level of conflict never builds to any emotional or dramatic impact."
    },
    {
      "rating": "7",
      "text": "Although Depp is the main character in this story (based on true events), I think it was his co -stars that make this movie go as well as it did. Running over two hours, Depp's character continues to evolve but little can be noticed in the way he acts. Further, given the time frame of the movie, I think a greater sound track could have carried emotions further for the viewer. All in all, this is worth a watch, but not to keep in your movie collection."
    },
    {
      "rating": "7",
      "text": "This movie is absolutely amazing! If you like intense criminal movies with conspiracies, you don't want to miss this one! Boring at times and predictable but still - amazing!"
    },
    {
      "rating": "7",
      "text": "Never spill the family secret.\r The story is about Whitey Bulger, brother of a state senator and the most infamous criminal in South Boston. Childhood friend John Connolly would become a leading figure in Boston's FBI office while Bulger become a figurehead in the Irish mob. When they connected, Connolly convinced Bulger to help take down the Italian mafia - but as things spiral out of control, Bulger finds himself as part of the FBI's Most Wanted.\r Ever since the first teaser trailer for Black Mass came out, I knew for a fact that Johnny Depp was back to his old roots and finally playing a character that wasn't Jack Sparrow. It looked gritty, sharp, brutal and totally refreshing to see Depp in this type of role. I was hyped as sh*t to see this movie and I couldn't wait to watch Johnny Depp's performance as Whitey Bulger.\r After finally seeing the movie I can say that Black Mass as a film was alright, but Johnny Depp's performance in this movie was freaking fantastic and he stole the whole show.\r The positives: This has to be Johnny Depp's best performance in years. I can best describe he's performance as darkly comical, frighting and really uncomfortable at times. That's the power and the weight Depp brought to this performance and he absolutely pulled it off. I'm so happy to see Johnny Depp giving a good performance that wasn't anything like Transcendence or The Lone Ranger.\r The cinematography in this movie was beautifully shot and the camera work used in the film was just stunning. Benedict Cumberbatch, Joel Edgerton and Kevin Bacon gave a great performance in the movie.\r Now for the problems: The movie itself felt pretty empty and very hollow to me. There wasn't anything to latch on to since the movie doesn't have a protagonist or a character that you can relate to. Everyone is a villain.\r The dialogue in the movie wasn't that interesting and it was very hard for me to latch on. These a lot of police investigation in this movie that was actually documented and to me it wasn't very interesting and I wish that the movie focused a little more on Depp's character.\r Overall Black Mass has amazing cinematography, a great performance from Depp and good directing. But it isn't something that I'll be watching again anytime soon, because I can't see myself watching  this movie again."
    },
    {
      "rating": "7",
      "text": "Black Mass is not best picture worthy at the Oscars, but based on a strong lead from Johnny Depp and great performances by supporting actors and actresses, Black Mass is still very enjoyable."
    },
    {
      "rating": "10",
      "text": "after some disappointing movie from Johnny Depp finally he is back.this is on of the best Johnny Depp's film.JohnnyDepp' performance was absolutly great."
    },
    {
      "rating": "10",
      "text": "Best I have see Johnny Depp.  All of the acting was very good and it had to be.  A character like that sucked the sole out of everyone around him, he has to be good and so do they to show that and pull it off.  Edgerton, best I've seen him as well.  The main part of the story has to be about that relationship, and it was.  Not a lot of movies or stories require great acting and deliver, this one does."
    },
    {
      "rating": "7",
      "text": "Johnny Depp, the actor, is back! In “Black Mass”, whether fixing a friend with an icy stare from his blue eyes, to the pure joy he shows giving his young son ‘life’ lessons while silently quieting his girlfriend or choking another woman with his bear hands to strangling an informer with a rope, this is Depp becoming the psychopath James ‘Whitey’ Bulgar, not a caricature or using camp but being the man. He becomes mesmerizing just brushing his hand along the cheek of his friend’s wife frightening her or laughing as he tells another friend he was just pulling his leg but leaves the question if he was.\r Johnny Depp is the center of the movie and is the reason to see it. The large supporting cast including Dakota Johnson as his girlfriend, who disappears from the picture bringing up an unanswered question, Julianne Nicholson as the friend’s wife and Juno Temple as a prostitute along with Jesse Plemons, Rory Cochrane, Kevin Bacon, Steve Flemmi, Corey Stoll, David Harbour, W.Earl Brown, Scott Anderson, Bill Camp and Peter Sarsgaard as various thugs, FBI agents, policeman, prosecutors all give strong support.\r I had problems with two actors in the film, the first being Joel Edgerton, an Australian actor, who seems to have watched every Hollywood gang film and attempts to blend Brando and DeNiro making his character confusing and distracting every time when he is on screen and he is in most of the film. The other was with Benedict Cumberbatch, not his acting as he always turns in good performances, but with his casting. I know to leave logic at the door when I go to the movies but no way, in any universe, could Cumberbatch and Depp be brothers. They don’t look alike, don’t talk alike, don’t have any similar mannerisms. True Benedict’s character went to college and law school while Johnny’s spent those years in the penitentiary. The former became a State senator and then president of the University of Massachusetts while the latter starting selling dope to teenagers and became the kingpin of the South Boston’s underground, in many ways with the help of the FBI! I suppose they could have been brothers but I just couldn’t buy it.\r Director Scott Cooper does a pedestrian job as do the screenwriters Mark Mallouk and Jez Butterworth while none bringing anything new or different to the genre. The movie is slow moving and too long at 122 minutes.\r The bottom line is that “Black Mass” is a must see film to see Johnny Depp back on track as a fine actor bringing everything he can to a role."
    },
    {
      "rating": "7",
      "text": "After a few critical misfires Johnny Depp finally delivers a quite intense and disturbing performance as James \"Whitey\" Bulger. The movie carries itself well, doesn't drag or feel boring, it keeps you glued and that is the giveaway. A fine cast also helps the movie but Depp's performance is near Oscar worthy,  never before have I seen him in such a unrecognizable scary and sociopathic role where you can hardly remember that it is Johnny Depp as the lead."
    },
    {
      "rating": "9",
      "text": "A very well done crime thriller starring Johnny Depp playing as notorious Irish mobster Whitey Bulger. If these things peak your interest then I suggest you see it. You won't regret it."
    },
    {
      "rating": "10",
      "text": "This Is The Type Of Movies We Want Johnny Depp To Star Finally. Hopefully He Starts Making Better Movies Like This To Show Us That He Really Has Acting Skills Johnny Depp Oscar Performance"
    },
    {
      "rating": "9",
      "text": "Normally I'm a sucker for true life gangster movies, much like older generations dug Edward G. Robinson and George Raft imitating the Mafia, with colorful real life characters like Ben Siegel, Vito Genovese and Carlo Gambino to draw inspiration from.    It was the equivalent of bad boy western lore - charismatic outlaws like Billy the Kid, Black Bart, Butch Cassidy, and others that livened up a lot of conversations.    It's not that we like the bad guy, but it is nonetheless exciting to watch for a few hours somebody running a terrible empire supposedly immune to prosecution.    This is the spirit we look for in \"Black Mass\", and Johnny Depp, complete with ice blue contact lenses, puts in one of his best performances as a ruthless genuinely frightening James \"Whitey\" Bulger, the infamous South Boston Irish mobster who made a Faustian deal with FBI agent John Connolly to help eliminate the Italian Mafia in Boston and get all the spoils.    That part did happen, and history of organized crime tells us that Boston was not that prominent for mob business, and was subservient to Raymond Patriarca, the godfather of Providence, who in turn reported to the Gambinos in NYC.\rJoel Eggarton turns in a truly great performance as the corrupt FBI and boyhood buddy of Bulger and protects the criminal for years even though Bulger continues to murder people who cross him with apparent impunity until finally a new sheriff comes to town and starts digging into the mystery of Bulger's never being investigated, much less prosecuted.\rIt's hard to go too wrong with this strong true tale, and Depp is very convincing as Bulger, and gives the audience the creeps with those steely eyes and mystique that so few actors can muster.    It seems Depp has a very dark side in real life to be this intimidating.    Perhaps he thinks of past ugly times in life to conjure up the vibe he conveys as Bulger.\rThis is not quite in the category of organized crime movies as \"Good Fellas\", the Godfathers I and II, but is as brilliant as \"The Departed\", which was loosely based on Bulger.    Therefore it is in good company, and Depp should get an Oscar nomination for his return to excellence."
    },
    {
      "rating": "7",
      "text": "Like a lot of biopics, this one suffers from narrative confusion. Whoever wrote it couldn't stuff in everything that happened in the real story, and didn't always make the most cohesive decisions about what to include. You'll wonder where Whitey's brother the senators disappears to, for example. He's around a lot early on, and he seems kind of important.\r That being said, Johnny Depp has been in some bad movies and made some strange choices, but here he's just chilling. Bulger is someone who needs to be taken seriously, and you won't have any trouble doing that after you watch this performance. Also of note is Joel Edgerton playing the slippery slope character who tries to work with Bulger and probably shouldn't have.\r Certainly, the characters are enough reason to watch."
    },
    {
      "rating": "8",
      "text": "Black Mass is a strong film. It is great but somehow I still feel a little bit disappointed with this movie. The reason you should see this movie is because of the performances. The whole cast has something to offer in this film. Johnny Depp will certainly be gaining some attention for his portrayal of Whitey Bulger. You completely lose Johnny Depp in this role. For starters Depp looks just like Whitey Bulger and there are several points in this film that are downright terrifying to watch. I'm sure the academy will be putting this role into consideration although I'm not guaranteed Depp will nominated. It was nice to see Johnny Depp really get his mojo back and hopefully he can build momentum with this performance.\r Joel Edgerton impressed me once again. I can honestly say that I have yet to see a film with this guy in where he doesn't bring his A game. Benedict Cumberbatch was great too although he is not in the film as much as you'd think.\r Now the big problem with Black Mass is that it leaves a lot things out. The film just uses a scene to compile all the other rotten deeds that Bulger is doing in sort of a cheap fashion without really showing anything on camera and I think the film suffers just slightly for not being raw enough. There are a few points in the film (not very many) that feel a little flat and could have been better. That is why this movie is only good instead of great.\r Overall I really enjoyed Black Mass, I'm not expecting a best picture Oscar for this movie but I recommend it to gangster movie fans and fans of Johnny Depp."
    },
    {
      "rating": "9",
      "text": "Black Mass is directed by Scott Cooper (Out of the Furnace, Crazy Heart) and star Johnny Depp, (Rango, Public Enemy) Joel Edgerton (Warrior) Benedict Cumberbatch (Star Trek: Into Darkness, 12 Years a Slave) Kevin Bacon (Apollo 13,JFK) Corey Stoll (Ant Man) and Adam Scott (Step Brothers)\rOk this movie was really good and really depressing. The directing was good, the acting was great, and they even capture the time period well. The kitchen scene from the first trailer was great to see on the big screen. One problem I had with the film is that during the film it slowed down, and that's what's going to divide the audience some will like the slow building parts and others won't. There were some parts were they try to make you feel bad for Bulger and it kind of reminded me of Hard Candy where they try to make you feel bad for the antagonist, sometimes it works sometimes it does. The film is a bit forgettable but there are some scenes that stick with you after you leave and for a while. All in all Black Mass is an enjoyable film and if I had the chance to watch it again I would. It's just unbelievable that this happened, you just can't make this up. Even though the weekend is over you should watch this if you haven't. Don't let this bomb in the box office!"
    },
    {
      "rating": "8",
      "text": "Black Mass is a completely enthralling biopic about one of the most\rviolent mobsters in Boston history, but even more impressively\rrepresents a return to form for Johnny Depp. This film hinges on Depp's\rperformance, if he's not good the film would come across as slow, but\reven when the film slows down Depp's chilling performance as Whitey\rBulger keeps you interested. The film had to compete with the fact that\rthe man James \"Whitey\" Bulger was a heavy inspiration for Frank\rCostello in Martin Scorsese's \"The Departed\", however the film did a\rgood job looking at the character in a different angle. Many of the\rother characters lack development, and the story wears thin at times,\rbut for the most part the film is well constructed, and even better\rexecuted. Depps performance, the beautiful cinematography, dark humor,\rand the perfectly dark tone make Black Mass a really solid Mob drama."
    },
    {
      "rating": "3",
      "text": "Devoid of style and led by an overrated performance crafted from makeup and swagger. \"Black Mass\" indeed has a great cast (Joel Edgerton and the underused Julianne Nicholson and Juno Temple shine), but it won't deserve many of its likely nominations come awards season. The film lacks momentum and flair. Instead it sits there banking off the cool performance of its lead star."
    },
    {
      "rating": "9",
      "text": "A chilling retelling of the life of a notorious mobster, Black Mass is a film that can be a pleasant surprise for fans and film critics alike. Johnny Depp's portrayal of Whitey Bulger is frighteningly uncanny, although it does have the Depp flair that most of us know and love. Barely recognisable underneath his costume, this is certainly one of the darker films that he has done, and while ambitious, it has paid off.\r While I agree with some people who suggest that Depp hasn't had the best few years in terms of film releases (Dark Shadows and Pirates of the Caribbean: On Stranger Tides spring to mind), I feel that this film has definitely helped boost his career, and it is a good reminder that not only is he versatile, he's still got it. It's a performance as memorable as Edward Scissorhands and Jack Sparrow (Sorry, Captain Jack Sparrow...), and maybe this is the first of many good films that is to be released with him starring in the future."
    },
    {
      "rating": "8",
      "text": "Black Mass is an intense film. Along with doing a good job telling and presenting the story of a gangster it serves as a redeemer for Johnny Depp. The performance given by Depp is an intense and he will hopefully get an Oscar nomination for it. If only I could say the same for Cumberbatch’s clearly fake Boston accent."
    },
    {
      "rating": "9",
      "text": "If for no other reason see this movie for Johnny Depp's psychotic performance as Whitey Bulger the notorious Irish Boston mobster of the 70's & 80's.  Whenever Mr. Depp is on the screen you have a very nervous ache in the pit of your stomach.  He most definitely will get an Academy Nomination for this role as he is back big time.  The other actors are good; but, when John is on the screen he suffocates all around him as he is that good.  Don't miss this performance."
    },
    {
      "rating": "7",
      "text": "Johnny Depp is great in this movie.  Many of the supporting performances are very good.  The script here is what prevents this from being an amazing movie.  It relies unfortunately on the cliches of honor among thieves and loyalty over all (which, ironically were the misguided foundation of the real life Whitey Bulger's non-defense in his trial).  The film may very well demonstrate Bulger's view of himself.  But that hurts the movie, which I liked, but did not love."
    },
    {
      "rating": "7",
      "text": "It is a gangster movie based on real events.\rThe protagonist, Whitey Bulger, was the most infamous criminal in Boston while his brother was a state senator of Massachusetts and his childhood friend was an FBI agent. The movie takes place in 70s and 80s.\rExcellent acting and casting. Starring Johnny Depp as Bulger the Criminal, he is intense and creepy. Other aspects of the movie are OK but Johnny Depp alone makes this movie well worth watching."
    },
    {
      "rating": "8",
      "text": "Overall, Black Mass is a good film largely elevated by the acting. While Scott Cooper's direction is tight and taut of the film as a whole, he does his best work bringing out the best in his cast. Just like his previous films, the acting is where it soars. Johnny Depp is stellar, Joel Edgerton is fantastic, while the rest of the cast highlighted by Benedict Cumberbatch, Dakota Johnson, Jesse Plemons, David Harbour, Peter Sarsgard, Rory Cochrane, Adam Scott, Brad Carter, and Juno Temple, are all also great in the film. Truly, no one does a bad job, but those are just the ones who stood out to me the most. Yeah sure, I named most of the cast. Sue me. The film's writing is also very good and it does a great job telling the story of Whitey Bulger and shows his multiple sides; the friend, the father, the husband, and the ruthless killer. Great at capturing the visceral terror inspired by Bulger and the sense of fear surrounding him like  a black cloud, the film does a great job capturing the atmosphere needed. Another major strength of the film is the makeup. Both Depp and Plemons' transformations stand out the most, but they are truly remarkable and unrecognizable in their roles, while becoming their character looks-wise (and acting-wise). Finally, the costume design was also very good and looked the part. Overall, Black Mass is a very good gangster biopic. There are far better gangster flicks and far better biopics, but not many films have such a fantastic cast from top to bottom that knock all of their roles out of the park."
    },
    {
      "rating": "8",
      "text": "Captivating, enthralling, and relentless. Johnny Depp is phenomenal in the leading role. In fact, the whole ensemble cast does an excellent job. Watch for the best, most intense scene of any film I've seen this year involving Depp and Julianne Nicholson. It will make your skin crawl."
    },
    {
      "rating": "7",
      "text": "In \"Black Mass,\" Johnny Depp breaks through his recent drought of film choices and completely disappears into the role he's assigned. If only the entire movie wasn't as soulless as Depp's brilliant performance. . ."
    }
  ]
}