{
  "id": 2368,
  "title": "BlacKkKlansman",
  "starring": [
    "John David Washington",
    "Adam Driver"
  ],
  "runtime": 135,
  "genre": [
    "Comedy",
    "Crime",
    "Drama",
    "History"
  ],
  "description": "Colorado Springs, late 1970s. Ron Stallworth, an African American police officer, and Flip Zimmerman, his Jewish colleague, run an undercover operation to infiltrate the Ku Klux Klan.",
  "releaseYear": "2018",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/8jxqAvSDoneSKRczaK8v9X5gqBp.jpg",
  "categories": {
    "plot": 7.722222222222222,
    "acting": 7.590909090909091,
    "ending": 7.75,
    "soundtrack": 7.666666666666667,
    "cinematography": 6.8,
    "familyFriendly": 3.0,
    "funny": 8.166666666666666,
    "action": 7.714285714285714
  },
  "reviews": [
    {
      "rating": "6",
      "text": "This is a decent movie. It has some moments and it could have been better. It falls apart at the end, sort of anti-climatic in terms of the script, then it goes into propaganda over-drive by editorializing about trump and protest rallies in 2017. Spike Lee... sometimes LESS is more, buddy."
    },
    {
      "rating": "10",
      "text": "Fantastic movie with a fantastic cast. The story of the Stallworth Brothers is insane and the message that this movie is trying to make is a very important one right now. We all need to stop the hatred or stop feeding it. I hope everyone will give this movie a chance and listen to the message its trying to tell us."
    },
    {
      "rating": "2",
      "text": "It is part Spike Lee, a solid filmmaker, and it is part Michael Moore. Spike Lee channeling Michael Moore kills everything that goes before it. It is so weird because he uses the audience's intelligence in the beginning to make connections and then by the end he treats the audience as if they must told everything. Go see \"Inside Man\" again to see the director at his best, this is not it."
    },
    {
      "rating": "6",
      "text": "An entertaining and likeable film, but much of it beggars belief. Its portrayal of the police as a force to fight racism is an all-too-generous distortion that borders on fabrication, and many of the characters come off like one-dimensional cartoons. This would be less troubling if it wasn't billing itself as a true story, but the fact that it is makes it feel misleading rather than just broad."
    },
    {
      "rating": "7",
      "text": "While the hype over this film doesn't quite live up to the results, it still is a well made piece that takes a tough subject matter and adds a good amount of humor. Overall a mid to low 7 a B."
    },
    {
      "rating": "8",
      "text": "Amerikanın ırkçılık gibi belki de en çirkin yüzünü bize eğlenceli bir şekilde aktaran filmde bir zenci polisin Ku Klux Klana sızmasını izliyoruz. Yaşadığım bölgeden ve kullandığım dilden ötürü zenci kelimesini kullanmaktan hiç bir çekince duymuyorum çünkü zenci dediğimde bana hiç bir kötü çağrışımı olmuyor. Aksine küçüklüğümüzden beri siyahi kardeşlerimizin neredeyse üstün ırk olduğuna bile inandırılmış olabiliriz. Benim aksime Lee'nin zaman zaman iki tarafı da eleştirmesinden biraz da olsa çekincesi olduğunu görüyoruz. Lee bazı sahnelerde görsellerle bizi rahatsız ederek anlatıyı güçlendirmeyi tercih etmiş ve bunda da başarılı olmuş açıkçası. Çok eğlenceli bir filmdi."
    },
    {
      "rating": "10",
      "text": "Best Lee Film Since Malcom XBlacKkKlansman is an absolutely fantastic movie with a great cast, a terrific script, and a message about the dangers about the growing presence of the Alt-Right and white supermacists in America today."
    },
    {
      "rating": "7",
      "text": "Going into this I thought this was going to be a comedy. The way the ads made it seem it was going to be a fun time. This is a dark time. A huge learning experience for people that don’t understand racism from the time of this films set time. This is a harsh reminder of what people of color and even women, albeit one more than the other, went through back in this time. With some pokes at our modern times. There is some action but really there is more of a thriller sense throughout the film. So, it`s good, but it’s a very niche film. If you like spike lee films or thrillers or maybe like historical pieces, then this is your film."
    },
    {
      "rating": "10",
      "text": "Really great movie that illustrates how the past is still relevant today. Every American should watch this movie. Unfortunately, the majority of apathetic Americans who really need to see this movie probably won’t see it. I look forward to more movies like this one in the future."
    },
    {
      "rating": "9",
      "text": "This movie absolutely lived up to exactly what I was looking for. It's got a good balance of funny and dramatic scenes."
    },
    {
      "rating": "8",
      "text": "Pretty good biographical movie. One of the best films of 2018. I'd recommend it to lots of movie fans."
    },
    {
      "rating": "7",
      "text": "A film that was much more political than I expected, judging by the Coming Attractions I had seen, which led me to believe that the film would be lighter than it was – and funny. But this film is deadly serious and a commentary on the state of civil rights and the state of the country today, which is depressing. This was not so much because of the film itself, which was well-made and well-acted, but because of the end of the film, which, in effect, argued that nothing has really changed. Spike Lee is a great filmmaker, and I was surprised that he could not make the film more insightful. The actors were excellent."
    },
    {
      "rating": "8",
      "text": "It's a really well-made film, and Washington is a true find.  Yes, he had his rise on Ballers, but he's exceptional here.  Adam Driver is also excellent - great to see him play another role in his Logan Lucky persona.  Kicking things with Isiah Whitlock (Senator Clay Davis from \"The Wire) was a genius casting choice.  And Laura Harrier as Patrice is a revelation.  However, casting Alec Baldwin was a terrible mistake - anybody could have done that role better, and the end cap was a choice I wouldn't have made, but I don't blame Spike for doing it.  You never would have seen that in a movie like Do The Right Thing, which is his magnum opus."
    },
    {
      "rating": "9",
      "text": "BlackkKlansman is one of Spike Lee's best movies in years, and I would say up there with Eighth Grade as one of the best movies of the summer of 2018. John David Washington and Adam Driver carry this movie, and they give some truly great performances, perhaps (dare I say it?) career defining! This movie is immaculately and creatively shot. The script is all at once funny, tense, romantic, sobering, and it ends on a great call to action. The one flaw is that I don't think the villains were very well developed, but the payoff at the end is so satisfying. I think maybe this film will even get some nods during the awards season! If I were to guess, I would say Best Adapted Screenplay, Best Cinematography, and Best Sound Editing."
    },
    {
      "rating": "8",
      "text": "Admittedly, I've never been too crazy about Spike Lee (with the exception of 'Do the Right Thing', which is probably his most classic and well-known film.) However, although predictable and seemingly formulaic at times, this latest effort of his did manage to go in some unexpected directions, and I mean this in a pleasantly surprised and good way. Lee cleverly and skillfully balances dark comedy with biting political, social, and of course racial commentary to make for one powerhouse of a film. In addition, John David Washington and Adam Driver both give bold lead performances. Overall, Lee really is in top form with this latest effort of his. Any film that enrages its audience or at least makes them ponder with its all too true and relevant themes and events is a pretty effective film in my book, and this film fits that bill perfectly needless to say."
    },
    {
      "rating": "9",
      "text": "With the exception of two of his movies I am not a fan of Spike Lee or his persona but there is not getting away from it that BLACKkKLANSMAN is a superior movie and should be seen.The first half of the movie is sort of a roller coaster ride hitting on many subjects with humor and insight but it isn't til the latter part of the move that it becomes epic and shows wit, passion, satire, tension and relevance to the past and present. Written by Charlie Wachtel, David Rabinowitz, David Wilmont and Spike Lee the film opens with a film being made by Alec Baldwin playing a man who is giving a KKK speech and is followed with the panoramic crane shot from \"Gone With The Wind\" where Scarlett O'Hara is walking through a filed of hundreds of wounded and dying Confederate soldiers. There are other references to the film regarding Hattie McDonald and Butterfly McQueen but the movie references are mainly D.W. Griffith's \"The Birth of a Nation\" made in 1915 that was mainly pro KKK and anti Black.The film is based on the book by Ron Stallworth, the true story of his becoming the \"Jackie Robinson\" of the Colorado Springs police department, the first African-American to join the department. He will eventually goes undercover, passing as white via telephone, in the local KKK and soon talking to David Duke, their Grand Wizard. The next step is to have white, Jewish detective Flip Zimmerman be Ron at meetings he is invited to attend.From that point on practically every group of people from Blacks to White Christian Americas to Gays to Jews, Policemen, 'Pigs\", among others, with all the negative and positive words, sayings associated with each. It is here where the script, and Lee, go helter-skelter with words, music, fashions, ideas and portraying various people who were involved for and against the KKK. Though the mid-section is scattered all over it is easy enough to follow and gives you the time to hear the ideas and arguments.It is at this point that Harry Belafonte appears on screen and starts talking to a group of Black Student Union members and about the 1916 lynching of Jesse Washington in Texas with inter-cutting scenes of David Duke giving a speech about 'white men' that you forget to breath until the final shot before the credits appear.This past weekend was the anniversary of the white supremacists march and violence in Charlottesville, Virginia, and Spike Lee drives home what has happened since then.The cast from John David Washington as Ron, Adam Driver as his partner, Laura Harrier as a local collage activist leader, Topher Grace as David Duke, Corey Hawkins as Carmichael aka Kwame Ture then, Robert John Burke as the police chief, along with strong actors as part of the squad or the KKK. Last but not least there is the face of Harry Belafonte who was a symbol to many of the Black people fighting for equality and dignity.\"BLACKkKLANSMAN\" is a film with laughs, horror, truth, being clear and confused within the same frame, heroics, pain, moving and a major accomplishment in the career of Spike Lee."
    },
    {
      "rating": "5",
      "text": "Watchable, but vastly over rated not to mention overlong. This dissection of racism could only be made by a black man and comes over smelling of propaganda. The white man is painted less than his skin colour whilst the black man is cast as the hero. Hate is certainly the order of the day here, I would just question at whom that hate is aimed. A dangerous and provocative film that isn't actually that good!"
    },
    {
      "rating": "8",
      "text": "The beginning of this film is the clearest example of the current socio-political climate in the United States, regardless of whether it's a reproduction that resembles the past.If right now you're not into the ''conservative's'' agenda, you're a snowflake, you're a leftist radical, a libtard, a progressive who wants to alter the established order, the order they believe is the right one. Remember: They had a good life.BlacKkKlansman is all that but it's also a true story about the shadow and eternal stain of cultural and institutional racism in the United States. Spike Lee takes a case from real life to expose an idealogy of the past that today in this 2018 regrettably has become more palpable than ever.Perhaps the most ironic is how he mixes such a serious subject and balances it with enough sobriety and a good dose of drama and comedy when necessary. But that's true to his style as a director, so it's not surprising but it's pretty good to see him once again doing things really well.I would like to delve more about the film but I firmly believe that it's not necessary but I think that each viewer should see it and get the best out of it in the end to be able to express an opinion and take a teaching on its subject today more than ever.It's assumed that the US is the most progressive and open country in the world or perhaps one of them. Do you seriously want to go back to that past? When a few, had a good life because of the color of their skin?Enough to think about it."
    },
    {
      "rating": "8",
      "text": "the way it is crafted out..BlacKkKlansmanBlacKkKlansman is a character driven thriller drama depicting the dark times that striked upon American Civil Rights which was steeped by an organization named Ku Klax Klan. Fortunately, for the makers the taboo subject analyzed in here hits the required note upon the current political situation. The vision of the writers is ahead of its time and with a jagged script like such, they don't flinch on visiting newer territories. Despite of meddling with such a fragile concept, the feature is surprisingly hilarious with tiny notions of the theories and references of cinema and music of 70's that is imputed smoothly. The usual chain terminology in your typical Police Headquarters is depicted aptly with a light environment among the office employees in order to bridge their bonding with concrete material. The husbandry gags kicks in especially when Driver learns to adapt the dialect and tone of Washington with some tricks and tactics that draws in most of the laughs. Ticking for more than two hours, the screenplay is tightly packed in two halfs. The first one is how Driver spears into their world of habitual controversies and \"be part of the gang\". While the other half is basically nail-biting \"close calls\" where Lee's directorial experience and finesse factors in effectively. The writing is elaborative with bold and inedible substance that aren't minced in words and if anything the emotions iterated by them is pure rage, to a point where audience may easily cringe on the seat to the \"whiteness\" of reality. Lee's tale is of Mob mentality that he speaks in volume through metaphorical terms foliated in long monologues and speeches that are exhilarating as much as layered. The political narrative is never opinionated since it explores both the side of the coin and tosses in front of the viewer to calculate upon. The music plays a vital role in Lee's latest project, the background score is appealing with up beating and heart breaking songs that elevates the momentum of the sequence. Washington's character is under sheer pressure at most of the time as it fights on both the aspects of the issues depicted in here but his portrayal is sculpted with such panache that it makes you groove when he hits someone or scores in an argument or even moves his legs in clubs. While his better half on screen, Driver recieves a bit more intense role (he still gets few laughs now and then with his partners) as he plays more on the field than behind the desk. Jasper Paakkonen gets a stand out moment and is probably Lee's finest Trump card, for he is not only the threat to everyone in the feature but he gets equally wider range as the protagonist does. Harrier, Grace and Burke holds on to their roles tightly and delivers a decent performance. As mentioned earlier, Lee is no short on execution and is probably his best work of his career as he has evolved naturally on delivering a compelling storytelling. The gripping screenplay, debates hidden under ideology and conversations and Washington and Driver's on screen chemistry are the high points of the feature. BlacKkKlansman is the finest entries on Cannes festival this year and is a competitive contender to the Golden Trophy and not because of its questions raised in here for the current society but the way it is crafted out."
    },
    {
      "rating": "8",
      "text": "The struggles embodied by this tale from the 1970s are as relevant today as they have ever been – having been brought into sharp focus by the Black Lives Matter movement. These are themes which undoubtedly have the potential to be divisive; however, BlacKkKlansman’s comic approach to the issues make it an enjoyable experience, rather than a harrowing one. Excellent performances, a killer soundtrack, and a solid – if incredible – script make this a must watch!"
    },
    {
      "rating": "7",
      "text": "Sarcastic, funny, and important, BlaKkKlansman portrays a black cop's cognitive dissonance as he searches for balance between being true to his morals and being good at his job.  Climax seemed to lack drama, and some way-too-tongue-in-cheek parallels to current government were provided, but real footage of harm that racism has done to this country leave the audience in a state of reflection and appreciation."
    },
    {
      "rating": "7",
      "text": "There is greatness buried somewhere in this movie, between a quietly great Adam Driver and mini-Denzel John David Washington. What holds it back is often the editing and music choices, both of which undercut the film’s two best sequences: a fantastic speech from a fantastic Corey Hawkins and the climax. Also the social commentary is laid on quite thick. Still, a nice return to Tom for Lee."
    },
    {
      "rating": "8",
      "text": "One of the best films director Spike Lee has produced in years. Despite some issues with choppy storytelling, occasionally awkward cinematography and message overkill (issues that somehow always seem to intrude on the filmmaker's work), this latest offering serves up a good mix of suspense, humor and social commentary in a generally well-crafted period piece. Nice to see the director getting back into good form once again."
    },
    {
      "rating": "7",
      "text": "Though the specific call to action and certain stylistic choices could have used another once over in my opinion, I think it's fair to say that Spike Lee's latest effort \"BlacKkKlansman\" is worth the watch overall. Featuring terrific turns from both John David Washington and Adam Driver, this too-wild-to-be-true story really does a fantastic job of keeping your attention and keeping you thinking about the ramifications of everything that's unfolding on screen. And with a truly enthralling finish, you can safely bet that this is one of the better Spike Lee films I've seen in quite a long time."
    },
    {
      "rating": "9",
      "text": "Funny. Powerful. Haunting. Spike Lee's BlacKkKlansman is truly unique and perfect for it. It tells an unlikely story which is as thrilling and tense as it is amusing."
    },
    {
      "rating": "8",
      "text": "Spike Lee's best work in years! Excellent cast and I believe a very important film given the current state of divided America. Very well made film with superb acting.  Absolutely worth you time and money."
    },
    {
      "rating": "10",
      "text": "Spike Lee has done a brilliant job of directing...this film should be required watching in our public schools...it is for everyone..."
    },
    {
      "rating": "9",
      "text": "Spike Lee's back! And guess what? His brand new joint that he presented us called the BlacKkKlansman is dark, funny, and sad all around. I gotta say that this is one of the best films he has ever done after a long hiatus waiting for a proper good movie from him. Sometimes, it feels like you're watching a Quentin Tarantino movie, but the stuff that he used to incorporate in this film is just incredibly smart all around. If you want a good time seeing a film like this, you better go see it."
    },
    {
      "rating": "10",
      "text": "For those who are looking more for the Black\"exploitation\" vibe you should breakout your VHS, it won't be found here and that's a good thing. As far as film making goes Spike does a great job of putting the viewer in the observer seat yet makes you feel so connected to the events that transpire in Colorado Springs.In the polarizing world some of us uncomfortably navigate in this is a necessarily tough film to watch, it will be even more uncomfortable for those who look at the top of the head of oppression and never directly in the eyes. For the oppressors and those marginalize/allow others to oppress by proxy this movie will be absolute garbage."
    },
    {
      "rating": "3",
      "text": "They said the movie was factual but I kept thinking this seems too incredible. And why had I never heard of it? I did research afterwards and discovered that only the most basic storyline is true - the rest is total fiction. The part of the story that was true didn't make much sense - why wouldn't the same person be meeting in-person and speaking on the phone?And why is Trump brought into the movie? Oh, to win an Oscar. Spike, you make some good movies but you try just too hard to make some meaningful statement but it falls flat."
    },
    {
      "rating": "8",
      "text": "The latest from Spike Lee is set in 70's Colorado Springs, when the first black officer (John David Washington) joined the police department. He inadvertently establishes a phone relationship as a fellow racists with the head of the local KKK chapter. When they decide to infiltrate the organization, a fellow officer and a Jew (Adam Driver) is enlisted to take assume his role in person. This narrative is told with tension and humor, but the movie also takes several extended preachy moments to hammer home the history of racism in America. Despite Lee's angry messages, there's plenty of comedy that would border on absurdity if it weren't based on truth.  Even though the film skews polemic at times (dealing with a subject that's sadly still timely), Lee's skill as a storyteller creates a compelling narrative."
    },
    {
      "rating": "8",
      "text": "BlackkKlansman contains a bright, vibrant energy only akin to Spike Lee, yet contains a timeless look on racial struggles and violence."
    },
    {
      "rating": "9",
      "text": "Some sites have labeled this as a comedy. Please don't go into this expecting it to be a comedy. There are some very funny moments, yes, but this is very much a serious film. There is a lot of cussing, and a lot of derogatory remarks. But the story here is very good and very timely considering what is going on the world today. This is also pretty much the definition of a \"politically charged\" film, so be prepared for that. Overall, Spike Lee gets a very clear message across while providing the audience with a very entertaining film at the same time. I'd definitely recommend it if you know what to expect."
    },
    {
      "rating": "8",
      "text": "While taking some MAJOR liberties with the source material, this film is relentless in highlighting the ways in which domestic terrorism from white supremacist movements (and even systemic racist mentalities in society) is ignored, shrugged off, or hushed up by people in power... and how far up the political ladder the \"organization\" has come since its inception."
    },
    {
      "rating": "7",
      "text": "“Blackkklansman” is the true story of a black detective who infiltrates the localchapter of the Klu Klu Klan. Based on the book written by Ron Stallworth,  directed by Spike Lee and co-written by Mr. Lee with  David Rabinowitz, Charles Wachtel and Kevin Wilmott, the film stars John David Washington and Adam Driver. Perhaps staying too true to Mr. Stallworth’s book,the film gives really no insight or depth to any of the characters as they portray the real people they represent. Mr. Lee does make his point, however, but seems to bring it home more with a hammer than a scalpel. I did enjoy the film mainly because of the unique premise that a black detective (Mr. Washington) could infiltrate this body of hate via the physical persona of his fellow detective (Mr. Driver). I give the film a 7.0 because of the worthiness of its message and the incredible story it tells."
    },
    {
      "rating": "0",
      "text": "Mediocre, racist and boring. Just another trash politically driven film. With an inaccurate ending."
    },
    {
      "rating": "9",
      "text": "BlacKkKlansman was politcal without views being shoved down your through, and it was real.This was so good at representing a true story but also making it fun to watch. Adam Driver was excellent."
    },
    {
      "rating": "8",
      "text": "Such a good movie! For me a little bit lengthy, but it delivers a comedic effect out of a serious story. I was deeply shocked at the climax of the film: the production renders a silencing, educational feeling. The end is especially applaudable, which manages to break the border between cinematic reality and life reality."
    },
    {
      "rating": "10",
      "text": "So far one of the best films of the year. Spike Lee bring to us a big movie, with a great story and nice performances (specially by John David Washington and Adam Driver)."
    },
    {
      "rating": "6",
      "text": "Kidding? I’m not right now. Racial tensions are still as horrific as ever, it now seems every month there is a new film made to empower Black people while exploring those unjustified relations between them and White people. So appropriately enough, filmmaking legend Spike Lee gives us BlacKkKlansman to explore those very relations in a time when White cops kill innocent Blacks like dogs. Even when history books have records of the “Black Panther Party” threatening the United States back in the 1970s, the message is clear: We need to stop and learn from our historical darkness.Kicking the can more, this film has a humorous plot scenario pulled straight out of real life: a Black guy applies to be a cop, leading him to work undercover. Essentially, he pretends to be White on the phone as he speaks to the leaders of a secret Ku Klux Klan organization, leading to that undercover investigation where his White partner pretends to be him. Beyond the mere ironic comedy, this Klan’s planned massacre of Blacks becomes quite disturbing as they are seen praying to God, complete with an oil anointment before they do their cross burning. This new Boston Tea Party as they call it is all a part of their plan to make America achieve its greatness again… because apparently they made America and must keep it for themselves. That mindset is visualized by a stain glass window with the words “Thine O Lord is the Victory” behind those who think they understand God’s will, but truly have the knowledge of a snowflake.Key here may be Spike Lee’s history of exploring Blackness in America, but he’s trying way too hard to connect the early 1970s to today. That especially goes this movie’s historical inaccuracy, “Stallworth's real colleague wasn't called Flip Zimmerman - his true identity remains a mystery, in accounts known only as Chuck - and there's no indication that he was Jewish.” (ScreenRant) At least the expert acting is easy to like, as nobody ever tarries in their performances, always racing on their palms to let the true soul of Blackness come out. Yet I most want to commend how Paul Walter Hauser particularly confronts his role well as a Klansman damaged beyond repair, like he’s half-a-man dragged down onto the cement pavement.Klans such as this one will certainly give anyone watching strong opinions, just don’t expect that to mean the character arcs will be the thing to suck you in to this film’s humanity. While effective, the main romantic subplot was unnecessary in influencing the protagonist or reconnecting him much with Black culture. His partners in crime also don’t seem influenced much by being involved with the Klan during their undercover case. Those Klansmen they bamboozle likewise are not multidimensional enough with clear fears written down on paper.Kennedy would not have wanted to see this type of future after being assassinated in his Ford, but it happened, as the sincere nature of this film is kept through an inspirational speech at the Black Student Union of Colorado College. This whole scene helps you to listen, then the script hops right back onto its tongue-in-cheek humor, including how Blacks pronouncing “are” as “are-uh” puts a halt in our understanding. Then topping all the memorable lines off in the cleverly detailed dialogue is an awesome phone call that speaks fluent Jive, a very lively form of English! But the artistic language rich with racial segregation sadly is not helped by the handheld camera that could very well been supported by a gorilla.King Kong may have had a bit of word to say in the editing and cinematography, but that’s not what will affect you the most while watching… it will be the realism. You’ll feel disturbed to see this KKK’s gunfire practice use targets of running black silhouettes in the autumn forest, but not nearly as much so as when these events connect straight to The Birth of a Nation, which the Klan reacts to with thunderous applause. Overall, the right perspectives are told from Ron Stallworth’s autobiography that will live on once he’s nothing more than a casket and bones.Really though, while it means well, BlacKkKlansman paints an unintentionally immoral portrait of Spike Lee’s ideal America where any motivation by God is just a fuel for racism. Apparently, it’s all about humanism, but the Klan proves that we should not rely on ourselves, as its unnecessarily preachy final sequence proves: a series of modern day news footage showing the destruction caused by Black Lives Matter, not secretive about hatred towards our president. On top of that, this movie claims to be “based on some fo' real, fo' real sh*t\" except it’s not, plenty of it is made up. So, with that put, this film’s message of relying on ourselves contradicts itself in a way. Likewise, you’d be better off living today for love, not rebellion, with the capacity to work of a donkey and the wise strength of an elephant."
    },
    {
      "rating": "10",
      "text": "This is a terrific film, one of the best I have seen in years.  The script, acting, plot and direction are near perfect.  My only complaint is one scene near the end of the movie is not believable and irrelevant.  Besides that, this the film is near perfection. I do see people's complaints about the film's connection between the current President and white supremacists.  Unfortunately, the President's slogan \"America First\" was a KKK slogan and the President's response to Charlottesville, to say the least, was embarrassing and weak."
    },
    {
      "rating": "10",
      "text": "\"Blackkklansman\" is possibly the year's best, but it does have some serious competition with \"Hereditary\", one of the creepiest and mind melting movies to come down the horror pike in years.    John David Washington turns in a spectacular performance as undercover cop Ron Stallworth, a true story of a very smart and brave African-American who is the first to join the Colorado Springs police department.    After hearing a moving speech by the former Stokely Carmichael as an undercover cop assigned to listen for possible threats against the citizens of the city, he becomes sufficiently moved enough to  cook up an under cover operation against the local KKK chapter.    To do so he has to use his detective white friend Flip Zimmerman, played brilliantly by Adam Driver to be his in the flesh double at various meetings and infiltrate and eventually become a full member of the KKK, with the Grand Wizard David Duke coming to Colorado Springs to personally swear him in.    It's much more than that, however, as both versions of Stallworth have to be oh so careful in their roles.    The big takeaway from this movie is of course the demonstration of the ultra hate filled and impenetrable stupidity and mental psychosis that defines all those involved with this hideous organization.    That it goes for all hate groups, including skin heads and other \"organizations\" that exist today as well is an obvious point.    Lee, however, has done a great job of pointing out several factors that can be overlooked in this day and age of focus on extremist positions.    First, while the KKK members and equally hate filled idiotic spouses are pictured for the tyrants they are, we are reminded that there are plenty - millions - of white people out there who deplore these racist hate mongers as much as any African American does.    It's very important to mention this because if we are ever to wipe out or minimalize for good the actions of hate groups and do something about those elected to office who are racists themselves it will take a concerted effort of cooperation between all races, creeds, religions, etc. to achieve the goals of at least reducing the insipid behavior of those who support white supremacy and other horrible agendas.    The film closes with actual footage of the demonstrations in Charlottesville, Virginia by racist morons, including that of the murderer who deliberately ran over a woman with his car for being \"liberal\" and supporting the black counter demonstrators.    Add that incredibly stupid statement by Trump accusing both \"sides\" of terrible behavior, when it was a demonstration by white power numbskulls that took place.    Why would it be terrible for those who were being attacked to defend themselves?    All it did was strengthen the bonds of the racist morons to Trump, who is a profound racist as we all know.    I truly believe that the movie is great, and as a white male, I feel it important to let those minorities who are oppressed, including the LGBT community and all who suffer at the hands of hate filled bigots that there are millions of us out there who are in total support of you and are just as disgusted and fed up with these mental midgets as you are.    I hope the movie gives us a feeling of cooperation and a desire to close the horrendous social/political divide that is killing this country.    It can be done, especially at the voting booth.    We must show the haters who love Trump and his own hatred that their kind cannot prevail for long.    They belong in the sewers where they crawled out of when Trump announced his candidacy."
    },
    {
      "rating": "10",
      "text": "One of the best movies of 2018 and it takes on American racism head on. Finally the movie Hollywood has not dared to make. Brilliant commentary on the current state of America and Trumpism."
    },
    {
      "rating": "2",
      "text": "This movie only proves that Spike Lee is a shadow of his former self. Far distant from his greatest moments like Do The Right Thing, Clockers or Inside Man, this movie is nothing more than political pyromania and hysterical activism that blantly decontextualizes footage from D.W. Griffith' Birth of a Nation for pure demagogic reasons. Lots of cliches and a militant overexcitation which is expressed in a misplaced way instead of shaping and transmitting naturally the story. Paltry movie, with a redudant and simplistic vision only to continue at full steam the 'agitprop' which is intoxicating USA."
    },
    {
      "rating": "8",
      "text": "Solid film,but I wanted it to be fantastic - it's not.  And it gets a little didactic toward the end.  Washington is fabulous, however."
    },
    {
      "rating": "9",
      "text": "Ladies and gentlemen, the reviews do not lie - director Spike Lee has crafted what is perhaps his most compelling film in well over a decade with \"BlackKklansman\", a movie that is as smart and funny as it is politically aware and relevant in the current heated climate.The film does get off to a slow start, but when it does take off it does so like a rocket. The main plot - a black police officer joins the KKK and has a white coworker pretend to be him at their meetings in order to investigate and disrupt their operations - is one so ridiculous that it would require every person working on the movie to be firing on all cylinders, and Lee, the screenwriters and the talented cast pull it off without a hitch. Part of why this works as well as it does is because the lunacy of the premise is like an in-joke that the characters are in on, and watching them go back-and-forth between stone-faced seriousness when face-to-face with the Klan and outright mocking behind their backs for having fooled them so completely is thoroughly entertaining to watch. The two leads give fine performances - Adam Driver's was my personal favorite between him and John David Washington, because he does a lot to explore the moral grey zone of a Jewish cop going undercover and spouting hatred left and right and is thus ten times more compelling here than in either of the more recent \"Star Wars\" movies - and the movie proves it has more on its mind than a zany premise and some comic hijinks, with juxtaposed images of young black college students and ordinary-looking white people chanting \"Black/White Power\", respectively, bringing up some interesting comparisons and contrasts while the side plot of Washington's character dating the president of the Black Student Union at the local college allows for thought-provoking conversations between the two on whether black people can try to fix the system from within by gaining access to it or it should be torn down for being too far gone to save.The movie does get a bit heavy-handed in some places, the insane amounts of racist rhetoric are to be taken with caution if you react strongly to that sort of thing, and as mentioned before the first 20-30 minutes are a bit of a drag, but on the whole this is a compelling and insightful film from one of our most overtly political filmmakers working today. Regardless of where you sit on the political spectrum, you owe it to yourself to get out and see this movie - it may not change anyone's opinion, but it'll certainly provoke some thought at the very least."
    },
    {
      "rating": "0",
      "text": "I came to watch a film and instead was bombarded by a frustrated hollywood director's charged political rhetoric...."
    },
    {
      "rating": "9",
      "text": "Timely. Powerfull. Well directed and acted. If this movie made you uncomfortable, it did its job."
    },
    {
      "rating": "2",
      "text": "Clumsily written, uneven in tone, repetitive, obvious and didactic, this film felt like a very rough draft without editing. The klan and police characters were cartoonish and the attempt to state the obvious parallels with the Trump era felt superfluous and condescending to this viewer.  The musical score was intrusive and further trivialized the story.  A waste of time and effort."
    },
    {
      "rating": "1",
      "text": "SJW movie by racist Spike Lee.  Absolute garbage.  Spike Lee just makes movies where he blames \"white people\" as an entire group for the self-inflicted problems of the thug community.  Do yourself a favor and never see this."
    }
  ]
}