{
  "id": 2772,
  "title": "Black and Blue",
  "starring": [
    "Naomie Harris",
    "Tyrese Gibson"
  ],
  "runtime": 109,
  "genre": [
    "Action",
    "Crime",
    "Drama",
    "Thriller"
  ],
  "description": "A rookie cop inadvertently captures the murder of a young drug dealer on her body cam. After realizing that the murder was committed by corrupt cops, she teams up with the one person from her community who is willing to help her as she tries to escape both the criminals out for revenge and the police who are desperate to destroy the incriminating footage.",
  "releaseYear": "2019",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/1cSHEKYYP8Dpi4o1iBVd4U75FYt.jpg",
  "categories": {
    "plot": 7.714285714285714,
    "acting": 6.333333333333333,
    "ending": 6.0,
    "soundtrack": 5.0,
    "cinematography": 10.0,
    "familyFriendly": 3.0,
    "funny": 5.0,
    "action": 8.0
  },
  "reviews": [
    {
      "rating": "0",
      "text": "Moral is cops evil, not a fan. Maybe the movie could have been better with some better acting and a lot less cheesy."
    },
    {
      "rating": "6",
      "text": "“Black and Blue” is a police procedural that offers a few pleasures along the way.  The plot, however, is a plodding process of pedantic predictability.  It’s not just that you can predict the storyline from a mile away - if you were circling the globe in a space capsule, the plot would still be painfully self-evident.Alicia West (Naomie Harris) is a vet who has served two tours in Afghanistan and decided to return home to the Ninth Ward in New Orleans, become a cop and continue her service to country.  Most of her colleagues and adversaries are simply cardboard cut-outs.  Apparently, all white cops are bad:  uninterested in the plight of blacks in poorer areas of the city, obnoxiously aggressive jerks at best, murderers at worst.  With only minor exceptions, blacks are gang members living the code of the streets.What makes this film worthwhile is Naomie Harris.  You may have seen her in 2016’s “Moonlight.”  Some will recognize her as the first black Miss Moneypenny in “Skyfall” and “Spectre,” the two most recent installments in the James Bond franchise.  Her performance here is a study in controlled intensity.  Her self-control it admirable; it’s probably all she can do to keep from shooting the director and the screenwriter.  In an outtake shown when the closing credits begin to roll, she displays a smile so luminous that you could see it from that space capsule.  It’s the only time you see her smile in the film, presumably because she read the script beforehand.Mike Colter makes his obligatory turn as the drug kingpin, Darius, a bit less two-dimensional than it might have been.  His role here as an intimidating thug offers an interesting departure from his much more appealing roles in “Luke Cage” and this year’s TV show “Evil.”  As Mouse, Tyrese Gibson (best known as a pillar of the “Fast and Furious” franchise) takes full advantage of being the only other character in the film with any depth or nuance.If you’re an action-adventure junkie, “Black and Blue” won’t disappoint.  There’s plenty of action, lots of fights and an abundance of chase scenes.  Unfortunately, a lot of those chases end up at dead ends."
    },
    {
      "rating": "0",
      "text": "If someone told me that Peter A. Dowling ghost-wrote The Room, i'd believe them."
    },
    {
      "rating": "10",
      "text": "Great acting, just enough suspense, message and story line is even more of an eye opener. Must watch i"
    },
    {
      "rating": "10",
      "text": "Mindblowing story. The storyline was wild at every level and Im glad that more movies like this are being made. I got out the movie and was immediately ready ti watch it again."
    },
    {
      "rating": "8",
      "text": "Naomie Harris plays rookie police officer who stumbles upon some dirty cops and happens to record their illegal actions on her body cam. The rest of the movie scrambles her all over her former gang-ridden neighborhood trying to stay alive (with the help of an old friend played by Tyrese Gibson). Although there's not much subtle about the script's messages and there are some flaws in the logic, director Deon Taylor has created a tense drama with more suspense coming from the chase and interactions than from violence (although there is some of that). Harris and the rest of the cast do a good job of helping make what could have been a trite corrupt cop flick into a dark and compelling drama."
    },
    {
      "rating": "8",
      "text": "Interesting...thought provoking and honest. A great matinee trip that will prompt a host of conversations regarding societal ills, polce corruption and the like!"
    },
    {
      "rating": "10",
      "text": "Perfect movie for Halloween season. The app concept is one you will be talking about after the movie. Would you download the Countdown app? The phone store scene is classic and the “hip” priest also provides unexpected humor."
    },
    {
      "rating": "8",
      "text": "4.5/10 user average rating? You guys are effing psychotic. This movie kept me on the edge of my seat and the story line ties in with real world events as part of their background story. Very very underrated film, I highly recommend you folks check this movie."
    },
    {
      "rating": "4",
      "text": "For being R-rated, involving corrupt cops and delving into racial tensions, this is a very tame and bland. A few good shootouts and maybe a brief insight into police relations with communities, but we’ve seen this all before, and better."
    },
    {
      "rating": "5",
      "text": "It's impressive how Naomie Harris's career fluctuates between different productions but she manages to get out of the situation with grace."
    },
    {
      "rating": "8",
      "text": "This nifty little thriller has Naomi Harris (28 Days later) as a young rookie cop who finds herself on the run in the ghetto after she witnesses a murder done by some bad shields which include sexy stud Frank Grillo (Purge Anarchy). The movie is edge of your seat exciting with a solid fierce lead performance from Harris. With everything going on in the world now it's more relevant and important than ever. Political statements aside the movie is fast, energetic and wonderfully entertaining.Budget: $12mBox Office: $22.7m8/10"
    },
    {
      "rating": "4",
      "text": "(Mauro Lanari)Maybe it's a memory test: how long will it take for its images, dialogues and protagonists to get confused with I don't know how many other similar films?"
    },
    {
      "rating": "10",
      "text": "Great movie, had me at the edge of my seat, love the actors and highly recommend this movie to ours to watch, Im definitely watching it again. Tyrese is another one of my favorites. The girl cop was great too."
    },
    {
      "rating": "10",
      "text": "This movie was great from beginning to end. The acting, the storytelling and the plot. Spotted what happens when police don't protect and serve communities of color when those within their ranks are still trying to do the right thing."
    }
  ],
  "recommendations": [
    "21_bridges",
    "no_escape",
    "the_commuter",
    "3_days_to_kill",
    "cold_pursuit",
    "triple_9",
    "street_kings",
    "the_marksman",
    "the_lincoln_lawyer",
    "the_little_things",
    "killer_elite",
    "end_of_watch",
    "the_equalizer",
    "donnie_brasco",
    "breaking_in",
    "jack_ryan_shadow_recruit",
    "the_accountant",
    "the_call",
    "widows",
    "hotel_artemis",
    "a_walk_among_the_tombstones",
    "the_november_man",
    "beirut",
    "closed_circuit",
    "the_rhythm_section"
  ]
}