{
  "id": 1878,
  "title": "Black Box",
  "starring": [
    "Mamoudou Athie",
    "Phylicia Rashād"
  ],
  "runtime": 100,
  "genre": [
    "Horror",
    "Science Fiction",
    "Thriller"
  ],
  "description": "After losing his wife and his memory in a car accident, a single father undergoes an experimental treatment that causes him to question who he really is.",
  "releaseYear": "2020",
  "mpaaRating": "NR",
  "imageUrl": "https://image.tmdb.org/t/p/w500/ldlpTitpSTBINwgifzlRRXveXUF.jpg",
  "categories": {
    "plot": 8.0,
    "acting": 6.8,
    "ending": 8.333333333333334,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 2.0,
    "funny": 5.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "3",
      "text": "3.75/10One word: Derivative.Long review: Black Box is well enough made and acted but ultimately its a very bland idea cobbled together from  tired and well worn tropes seen in films and TV over the last quarter century.Sadly what that means is that the only real contribution this actually makes is a politicized one due to its almost exclusively black cast. While it was good to see someone like Phylicia Rashad in a starring role after so long and the production doing a very good job of otherwise NOT making a \"black\" film all about race, the idea of lumping black actors into one production is just as detrimental to diversity. It illustrates how SJW culture is actually bigoted, racist and intolerant of anything not complying with its cult psuedo religion around it.The film is pretty well average and kind of boring. I enjoy a slow burn as much as anyone but I had to watch the entire thing at 1.30x speed and even then it took 12 hours to watch a 90 minute movie from getting repeatedly bored, doing something else, then forcing myself to come back to it. That is a fatal flaw in a film or any form of entertainment. If it can not keep its audience captivated it is not serving its purpose. That cost this 1.75 points imho. Otherwise it would have been a 5 on its own merit."
    },
    {
      "rating": "6",
      "text": "Guy with amnesia undergoes treatment to remember stuff but actually, he's the mind of the doctor's dead son who the doctor has put into a brain dead guy's body."
    },
    {
      "rating": "9",
      "text": "This movie is a rollercoaster of emotions. There are a lot of twist and turns. One huge one that really takes this movie to the next level. And thank goodness that twist is in there. The premise of the movie is very good. A father who loses his wife and memory in a car accident, then tries experimental treatment to gain his memory back. Is it the most original movie? No. Is it the greatest horror movie of all time? Definitely not. But I was hooked the whole time and really enjoyed this film."
    },
    {
      "rating": "8",
      "text": "This un-scary, low-key movie is well acted and pulls at your heartstrings a little. Good, enjoyable experience. Phylicia Rashaad is always great. Well done."
    },
    {
      "rating": "7",
      "text": "\"Black Box\" could easily have been an episode of \"Black Mirror,\" a compliment given the quality of that series. It's a slow burn until the big twist arrives mid-film and then things get much more interesting. Like Black Mirror, it touches on some heady topics along the way including loss, abuse, and the \"sense of self.\" At first I was turned off by lead actor Mamoudou Athie's performance which was so wooden to be a turn-off. But when you view his character from the perspective of the entire story, it makes sense. Blumhouse is clearly looking to branch out from its horror roots. Science fiction looks like a promising genre given the excellent \"Upgrade\" and \"The Invisible Man.\""
    },
    {
      "rating": "5",
      "text": "Interesting up to a point, but like most Blumhouse films, it fails to solidify its theme and execution and what remains is hardly noteworthy."
    },
    {
      "rating": "1",
      "text": "The title is kind of misleading because most people think of a Black Box as being something in an airplane for accidents information. Something like, \"Who Am I?\" may have been more appropriate."
    },
    {
      "rating": "4",
      "text": "(Mauro Lanari)Emmanuel Osei-Kuffour Jr.'s debut in one of the first two films of the anthology \"Welcome to the Blumhouse\", like the next six, doesn't have much of horror and is based on a ramshackle idea: the mad scientist, avant-garde researcher in neurology, she ignores the whole mind-body debate and is convinced that a psychic identity transfer is possible in a random person's brain."
    },
    {
      "rating": "10",
      "text": "I loved everything about this movie. The characters and plot development were great. We need more like this."
    },
    {
      "rating": "10",
      "text": "um ótimo filme, recomendo assistirem. a temática de ficção científica que aborda o transplante de consciência de uma pessoa para outra foi um ponto forte. ASSISTAM!!!!!!"
    }
  ],
  "recommendations": [
    "antebellum",
    "get_out",
    "colossal",
    "the_purge_election_year",
    "chaos_walking",
    "the_girl_with_all_the_gifts",
    "28_days_later",
    "the_invisible_man",
    "what_happened_to_monday",
    "riddick",
    "lucy",
    "annihilation",
    "bird_box",
    "sunshine",
    "the_darkest_minds",
    "annabelle_comes_home",
    "anon",
    "the_first_purge",
    "us",
    "coherence",
    "color_out_of_space",
    "cube",
    "pandorum",
    "chernobyl_diaries",
    "brimstone"
  ]
}