{
  "id": 4269,
  "title": "Black Snake Moan",
  "starring": [
    "Christina Ricci",
    "Samuel L. Jackson"
  ],
  "runtime": 116,
  "genre": [
    "Drama"
  ],
  "description": "A God-fearing bluesman takes to a wild young woman who, as a victim of childhood sexual abuse, is looking everywhere for love, but never quite finding it.",
  "releaseYear": "2006",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/8Yv7kxsqXSe4ZHl8uJEhmsPjhAP.jpg",
  "categories": {
    "plot": 6.785714285714286,
    "acting": 7.0,
    "ending": 7.25,
    "soundtrack": 9.666666666666666,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 9.0,
    "action": 9.0
  },
  "reviews": [
    {
      "rating": "4",
      "text": "Could have been much better if they had focused more on Lazarus than Rae and her husband with their marital, sexual and anxiety problems."
    },
    {
      "rating": "7",
      "text": "This movie has some redeeming merit and all the basics, but asks us to suspend too much disbelief for too long, then to have too much hope, and doesn"
    },
    {
      "rating": "10",
      "text": "A genre blender and a genre buster. This film is different from anything else that you will see this year."
    },
    {
      "rating": "6",
      "text": "Seemed to be heading into the right direction until the last 15 minutes."
    },
    {
      "rating": "10",
      "text": "Wow! I went into this movie with high expectations (after my \"mediocre\" expectations for \"Zodiac\" were, unfortunately confirmed), and It was better than I even hoped. This is a powerful movie. Directed at a level up there with Tarintino and a crew of actors that give it 11 out out of 10. Go see it! Now!"
    },
    {
      "rating": "9",
      "text": "Yes, it was a little too long. But sometimes you've got to give yourself over to a movie that is this different, endearing, funny and at the end of the day, memorable."
    },
    {
      "rating": "9",
      "text": "Won me over with beautiful visuals and superb acting."
    },
    {
      "rating": "8",
      "text": "These \"journalists\" are on crack. This movie was surprisingly sweet and moving. The performances overshadowed the somewhat crazy premise -- which, by the way was only the middle act of the film. Don't listen to what the critics see. Check it out for yourself."
    },
    {
      "rating": "7",
      "text": "Not the best movie I've seen, but it was an interesting experience. It's rare where you see a movie where everyone has a problem and the movie captures the essence of these problems that may never be resolved. But as in life, we can try and that's what the movie portrays. I personally would have liked my emotions to have been tugged or jarred a bit more. I wanted to believe but just quite couldn't."
    },
    {
      "rating": "6",
      "text": "This movie was just a bit too odd for me to fully appreciate. Every time I started to enjoy it, I thought again \"he has a half-naked girl chained to his radiator.\" Somehow, that one part of the movie destroyed it for me. Some great scenes, some great acting, and enjoyable integration of music. Overall just a little too hard for me to participate in the \"suspension of disbelief\" for this film."
    },
    {
      "rating": "6",
      "text": "\"Black Snake Moan\" uses the blues as its primary motif, then completely wastes it; because in the disastrous third act, what ensues plays like an atonement for Rae's wicked ways(or a creative compromise for the sake of financing and the almighty green light). We want \"Black Snake Moan\" to be more like a R.L. Burnside song, but instead the tune changes and it's more like Lisa Germano's \"You Make me Want to Wear Dresses\". If this film had the conviction to portray a loose and sexually carnivorous woman without any apologies, maybe the third act could've been used to comic effect. However, this carefully calibrated film, built like \"Pygmallion\", was leading us up to this transformation; because unfortunately, \"Black Snake Moan\" is a prick tease. Ricci really ignites the screen as a honest-to-goodness nymphomaniac, but then the audience is saddled with the story of How She Got That Way. It's kind of a drag. God wins in \"Black Snake Moan\"(this film is no place for a preacher), but we lose(c'mon Justin, pop a cap in that...)."
    },
    {
      "rating": "7",
      "text": "It's alrighty! You are stuck thinking something, until oh I dont' know the last 20 or so minutes of the movie...it all turns around. Surprise endings are great, but it wasn't a surprise it was hatred...It's so unbelievably bluesy! But c'mon we all go to see it for Justin anyway. And goodness, Samuel's hit his ups and downs, but he did an alright act with co-star Ricci. It's a bit, hmm...sexual! Kinda wasteful, but I wouldn't say to miss it."
    },
    {
      "rating": "9",
      "text": "Okay, I have to admit prejudice: With Samuel L. Jackson and Christina Ricci, not a lot could go wrong. Add a blistering soundtrack, Samuel L. Jackson on the blues guitar, singing AND playing himself, a suggestion of older man younger girl love affair, and Justin Timberlake really acting and this is a powerful film that deserves our sympathy. The surprise of a Justin Timberlake actually acting quite well, yes, it's a gimmick. But even after realizing that it IS a gimmick, it's still one that works. While the story is not that surprising, it's still good enough. All in all, a 9."
    },
    {
      "rating": "8",
      "text": "A fever dream of a movie, you wake stirred and refreshed. Ricci is astonishingly brave and Jackson soulful in ways he doesn't usually show. Brewer makes fables, and like Hustle & Flow, this one leaves you better for having seen it."
    },
    {
      "rating": "9",
      "text": "DON'T BUY IN TO THE NEGATIVITY, THIS IS IT UNTIL THE EYECANDY OF 300. Flick was at least as good as, if not better than HUSTLE and FLOW. Sam Jackson again channels the TIME TO KILL simple folk nature, but there is the tongue in cheek SNAKES ON A PLANE dialogue creeping into it all. This man needs one of those statuettes, on principle alone. Who else shifts as many gears? Consistency. Ricci is fearless and I'd never think I'd be giving Justin Timberlake props, but he did his thing. Yes, the premise speaks to taboo and typecasting, but we know that is the intent. The resolution is in no way contrived. This flick meant and moved me more than BABEL's mute chick or latino nanny did wandering around the border desert or neo-trance clubs. And any one with a memory could call THE DEPARTED, a vanilla NEW JACK CITY. My only qualm was the run time. Could have trimmed off about ten minutes. Craig Brewer is on a roll. Pimps, hoes, rap, and blues. What could be next? The way he creates such a sweaty, sensual atmosphere on camera, I would really like to see a Swamp Thing or Daniel Craig Live and Let Die remake? Gleeful x-ploration of x-ploitation."
    },
    {
      "rating": "8",
      "text": "Freakin Sam Jackson is THE MAN. It was awesome and depressing and hot and inspiring and I'm buying the soundtrack. I don't know how Christina manages to peel herself open on film that way. Someone should win an Oscar but of course they won't."
    },
    {
      "rating": "10",
      "text": "This movie is an amazing depiction of an impoverished life int eh rural south, and the lengths to which people must go to find redemption. It is intriguing and wonderfully acted with the best soundtrack of any movie in a long time. I wonder if people who have had little exposure to the deep south can fully enjoy the movie or empathaize with its characters. Unfortunately, the characters are not has far-fetched as some critics make them sound, and the blues that unites them is as real as it comes."
    },
    {
      "rating": "7",
      "text": "The story is interesting the casting is good (apart from Mr bring the sexy who is TERRIBLE) the only problem is that the vision of the director is off. I mean I think Brewer might make good movies in the long run but the only reason this movie was watchable was once again because the cast was on point, just like Hustle and Flow. It seems like in the hands of a better director used to quirky stories and more skilled at bringing forth emotional imagery, BSM could have been a winner. Anyway I didn't feel like I wasted my time, but a curiosity rental would probably serve you best. If you are not curious then please avoid."
    },
    {
      "rating": "8",
      "text": "I think the reviews are being just tad harsh on BSM. It's really an alright movie with a surprisingly good performance by Ricci. If you have nothing better to do go ahead and see it."
    },
    {
      "rating": "6",
      "text": "You have to wonder what makes a man imagine a story like this, featuring the character of a perfectly formed nubile young woman becoming spontaneously orgasmic in the middle of, say, an empty field. That said, the development of the father-daughter style relationship between Rae and Lazarus is sweetly done, and their joint journey out of their personal hells is intriguing, if not particularly probable. Worth seeing if you enjoy watching Samuel L. Jackson and Christina Ricci; but overall a silly movie."
    },
    {
      "rating": "8",
      "text": "Weird and sexual. Emotionally engaging. It's bluesy brilliance."
    },
    {
      "rating": "10",
      "text": "Loved it. Like others have commented - judging from the title and poster, wouldn't have guessed I would've liked this so much. But with an incredible soundtrack from some of my favorite Fat Possum recording artists* and really strong acting from several characters, this is on my top list for this year. *A great double feature would be the RL Burnside documentary \"You See Me Laughin\". Dig it."
    },
    {
      "rating": "8",
      "text": "Though starts mind-numbingly slow, Black Snake Moan suddenly picks up and becomes an emotionally powerful and engaging drama that it hopes to be. Samuel is brilliant this time around, and Ricci gives one of her best performances yet."
    },
    {
      "rating": "8",
      "text": "Proof that racism is still alive and well in America: Black Snake Moan earns a Metascore of a meager 52, while Rob Zombie's Halloween garners a 47. What a disgrace."
    },
    {
      "rating": "9",
      "text": "good movie,good acting It takes a pretty good movie to keep myself infront of the tv the entire show.watched from start to finish."
    },
    {
      "rating": "9",
      "text": "Loved it. Was not sure how this was going to work or if it was going to work but it did. There was some very interesting chemistry between Ricci and Jackson. Whoever envisioned that is a creative genius. The characters in this movie showed depth - something not too often seen in the current trend of movies starring no-talent peroxide bimbos with fake boobs."
    },
    {
      "rating": "9",
      "text": "Loved this movie! What a great job done in building the unexpected relationship between Jackson and Ricci. I loved how some of the scenes in the movie ended as though you were watching a play. The film was as hot and sticky as a hot summer day in the south. Both characters fighting their own personal demons manage to find a small piece of stable ground to stand on in each other. Samuel L. not only manages to give another great acting performance but provides some great music as well. I think those who don't appreciate this movie are just used to the same old thing being put out over and over again and cannot see past the choices we have been forced to choose from here lately. See the movie. I doubt it will disappoint."
    },
    {
      "rating": "8",
      "text": "It's actually a much better film than I would have expected. SLJ has surprisingly honed skills at the blues. Ricci is good, but not great, as usual and JT is nothing special, but they play their characters convincingly enough to keep the viewer in the movie. Though it runs a little long near the end, I still would recommend seeing this movie."
    },
    {
      "rating": "1",
      "text": "A totally ridiculous premise done dirty by two silly, sweaty characters. Ricci was looking for an R rated vehicle to show her boobs and thus show everyone she was no longer a child actor. Jackson was in it because he says yes to everything."
    },
    {
      "rating": "4",
      "text": "Samuel L. Jackson is legendary and he has the unique ability to turn even a strange movie like this, into something that is worth watching. Black Snake Moan is a really ridiculous story, full of odd symbolism that just really doesn't make any sense. Jackson plays Lazarus, a loner who lives on a farm in the middle of nowhere. He's a deeply religious man, whose wife just left him for his brother. Lazarus responded to this by locking himself away and putting all he has into his farm. One morning he finds a badly beaten girl, with a reputation, laying in the road and decides to help her, but he soon comes to believe that this girl is possessed and that God sent her too him for help. Not knowing what to do, Lazarus takes this sex crazed, drug addict and chains her to the wall of his house. Throughout this film, there are all kinds of symbols that don't make any sense. There are scenes featuring an old blues singer talking nonsense, scenes of the town that we almost never see, and perhaps strangest of all, there are moles added to Jackson's face, something you don't see except it cases of a biography. As for the performances, they were terrific, This is the best performance I've ever seen Christina Ricci give and she really gave Jackson a run for his money. Jackson, was also great, giving what you expect to see from him, albeit with less swearing than usual. The performances were really the only thing this film did have going for it as the events that take place just don't make any sense. The film jumps around, leaving things unfinished, and personalities seem to change as often as the wind blows. It's a pet peeve of mine, but I really hate when great performances are wasted on a film that is so poorly written, that it's almost unwatchable. Black Snake Moan is sloppy, jumps around without finishing things, and at times just doesn't make sense. It was an interesting idea with a terrific cast, but the people behind it were clearly in way over their head and just didn't really seem to know where they were going or even what they were doing."
    },
    {
      "rating": "8",
      "text": "Excellent and a must-see. It's gritty, it's full of vices, and it varies its tempo. The ending was a bit soft, and I was underwhelmed by Timberlake's performance, but Ricci, Jackson and supporting cast got tucked right in. The best thing about the film is it doesn't pretend; it doesn't try to be too serious."
    },
    {
      "rating": "1",
      "text": "What an disgraceful movie, no plot, no character development, no nothing, at best samuel l jackson performance and a few good blues soundtracks, don't waste your time"
    },
    {
      "rating": "3",
      "text": "This sexploitatioal Paramount Vantage release cost some millions and lost almost all of them, and it’s easy to see why. Writer/director Craig Brewer seemed to be getting his rocks off with his half naked nymphomaniac character (a victim of child abuse buts it’s never made exactly clear by who) She’s grimly played by Christina Ricci – who pops pills, swilling them down with alcohol, between getting her gear off with any number of the unwashed locals - only to end up bashed and dumped by the side of the road. Enter black farmer and ex-blues singer (Sam. L. Jackson) who decides the only way to ‘save’ her is to chain her to his fireplace (literally!) Brewer then introduces a bunch of Southern Baptist types to shift the focus (slightly).  Now our movie maker attempts to please both the porn lovers and those who want to play it ‘straight’ – this mix sits uncomfortably together and one hardly justifies the other.  The players work harder than the script deserves and the results shift off in all kinds of perverse directions to an almost tacked on finale.  If you don’t object to spending a couple of Hrs looking at a series of grungy situations with foul mouthed despots – you might feel at home – otherwise, you may want to give this rather ugly exploitation flick a wide burst."
    },
    {
      "rating": "6",
      "text": "The strongest aspect of this movie is it's soundtrack, which is excellent.Jackson's performance is captivating, but this outlandish story could of been better told in the hands of a more accomplished director."
    }
  ]
}