{"id": 4853, "title": "Black Panther: Wakanda Forever", "starring": ["Letitia Wright", "Lupita Nyong'o"], "runtime": 162, "genre": ["Action", "Adventure", "Science Fiction"], "description": "Queen Ramonda, Shuri, M’Baku, Okoye and the Dora Milaje fight to protect their nation from intervening world powers in the wake of King T’Challa’s death.  As the Wakandans strive to embrace their next chapter, the heroes must band together with the help of War Dog Nakia and Everett Ross and forge a new path for the kingdom of Wakanda.", "releaseYear": "2022", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/sv1xJUazXeYqALzczSZ3O6nkH75.jpg", "categories": {"plot": 4.56, "acting": 4.28, "ending": 4.75, "soundtrack": 6.5, "cinematography": 5.25, "familyFriendly": 5.0, "funny": 3.0, "action": 5.5}, "reviews": [{"rating": "0", "text": "Second time my review has been deleted by this platform. This movie is awful and pushes hate, social and racial division, as well as anti male sentiment. This is an awful piece of propaganda. Its exactly what you´d expect from Disney in 2022."}, {"rating": "6", "text": "Not as good as the first, another film I also thought was overhyped. The villain's origin was fascinating but aside from that, he's not as threatening or memorable as Killmonger. Shuri and her loved ones had a few deep moments but felt pretty bland; didn't connect or felt for them like in the first film. There are some really cool action scenes,  but as expected, there were some notable unfinished visuals obvious green screen shots. Overall, not a bad movie. Didn't surpass the original; just expected more coming from a multimillion dollar studio."}, {"rating": "6", "text": "It was okay. A bit emotionally manipulative and the acting was really good, but it's still an MCU film and limited in quality. Definitely being rated higher by many than it deserves to be. It was just okay."}, {"rating": "6", "text": "A Moderately Adequate Movie… I wouldn’t say the typical Marvel Template, but you can tell they struggle with what type of story to tell… The usual elements in a story that must deal with a major lost… There’s nothing new here except for a few characters to fill in the story gaps… The conflict that ensues IMO is unnecessary and reiterates an age old issues that doesn’t want to be resolved. Moderately Adequate is me being respectful and compassionate."}, {"rating": "1", "text": "More woke garbage from Disney A very racist move.  Boring and uneventful. Don’t give Disney tmore of your money. The M-She U at its finest Go woke go broke!!"}, {"rating": "5", "text": "I didn't like the film, I am not a bot, this is the 4th time that I had to re-sumbit my review, and for that I'm not giving it a 5 like I did last time, I'm giving it a 3. You guys/mods made it worse."}, {"rating": "1", "text": "Didn't like it at all. Letitia Wright was always a miscast for me, so she was a lead was a let down. Many bad and contradictory decisions. Killing T'challa was de worst thing MCU ever made. Coogler didn't do justice to the character in Black Panther 1, but in this movie it appears he chose as his mission to destroy the character. The Killmonger thing in the ancestral plane was so disrespectful to T'challa. The presence of Riri Williams was unnecessary. Meanwhile, Wakandan characters like Ayo, Aneka and M'Baku had almost no screentime. This filme was a disaster for me."}, {"rating": "0", "text": "The movie is really awful.  Looks more like a disney+ series stitched together in movie format."}, {"rating": "0", "text": "Overrated and boring. How can you gave a Black Panther movie without the Black Panther."}, {"rating": "1", "text": "What a disappointment again from Marvel/Disney.What a joke namor is completely different from the comics and another great character ruined. This whole movie is trying to profit off of Chadwick's death super disgusting.Way too long almost 3 hour movie unnecessarily so prepare to be bored out of your mind. They should have recast T'challa as Shuri can't carry this movie and Riri Williams is a complete joke as would be expected based on her comic character."}, {"rating": "1", "text": "This was shameful! This was NOT a BLACK PANTHER movie! There was no Black Panther! This was just about women who hate men and don't need a man! Why did they make the only men in the movie be weak and bow down to them?This was one of the longest movies I have seen and it was not worth it. This was written like it should have been a short TV series. 3 episodes at best.The acting was OVERKILL! Seriously women? You are all better actors than what you portrayed!The so-called special effects were beyond terrible. The water bomb timing was way off. Doesn't anyone watch and edit movies anymore?This was an insult to the original Black Panther actor. (Sorry I can't remember his name off the top of my head.) He should have been replaced. If they didn't want to replace him - they could and should have - given him a warrior's death! Why show how he died in real life? (Cancer I believe.)I'm proudly married - they didn't agree with that!I am a proud mother of sons - they don't agree with that!I respect ALL - they sure as HELL do not!Women and men are equal - not in this movie!Are my expectations too high because I bought and read the comics? Is this not meant for people who read the comics?This was a mockery and not a true Marvel movie! Truly a waste of time and money! SO MANY FAKE REVIEWS BY CRITICS AND REVIEWERS! THIS is why I never read reviews before I go to see a movie."}, {"rating": "0", "text": "Woke-Anda is more ugly Disney driven drivel, and don't get me started on what they did to Sub-Mariner?! - This film is Boring, bloated and overtly racist. The first film. was terrible, this one's offensive. Avoid - 0 stars"}, {"rating": "2", "text": "The only good part of this film is the very beginning and the very end, I did not feel a single thing throughout this film.the film is 98% incomprehensible garbage and the best elements of the movie are just coasting on the memory of ChadwickI can't believe it was made by the same people who made the first one, I have no particular love for the first one, but but it is a Masterpiece compared to thisat least Killmonger was a memorable Villain, at least he had some sort of like motivation for doing what he was doing you could kind of get behind him but with this Namor is just a joke he doesn't even look intimidating"}, {"rating": "0", "text": "Wakanda fornever. The casting was not diverse or inclusive at all. This is 2022. We are supposed to be worried about diversity and inclusion and equality and frankly I was deeply offended and triggered by the lack of it here. I think all the casting department needs at least 8 months of diversity and inclusion training to get over their privilege."}, {"rating": "1", "text": "Very long, super boring, with poor jokes throughout - so, it’s a typical Marvel “phase four” movie. Should’ve dropped “Black Panther” from the title in favor of not committing false advertisement, or not made this piece of garbage altogether without its lead present."}, {"rating": "2", "text": "This movie has very bad scripts the story is very predictable. The CGI is not good the only redeeming quality is Angela Bassett"}, {"rating": "0", "text": "This movie it's a 4/10 not a 0, but I really hate how Disney's Marvel have ruined every good character they had and replaced it by Mary Sue's. At this point I think they should make a reboot of all Marvel Universe and start from scratch to build again the classic characters."}, {"rating": "4", "text": "Okay so where so I begin? This movie in my opinion had all the makings to be one of the best movies marvel made. The first half is solid. But the last hour AMD a half is so bad, messy, corny, Disney… I found myself saying “huh??” Multiple times. Plot holes, bad CGI, corny forced dialogue. Terrible writing. I have never been more disappointed in a marvel movie. This is a firm pass for me. Never again."}, {"rating": "7", "text": "'Black Panther: Wakanda Forever' may be silly sometimes — as usual, some lines are cringy —but I think the movie found its way despite the tragedy. Villains, of course, are always the weakest part of Marvel films, but this one at least bothers to develop its own more and give it a purpose beyond destroying the world. The acting was excellent and emotional during some moments. All in all, I think this is what Chadwick Boseman's memory deserved."}, {"rating": "8", "text": "A very good movie.  I loved it.  Was a touch bored at times, but always invested.  Extreme difficulty project that they landed beautifully.  Better than the first one in my opinion, but I’m sure opinions will vary on that.  This was very well directed.  Coogler and the camera team imbued this film with a lot of artistry.  As huge studio pictures go this movie was a visual marvel.  The 3D was worth it too.  It didn’t feel like “just another marvel movie” and that’s the most important compliment at this point.  Black Panther as a series has its own vibe more than the others and I appreciate that at this point in the marvel anthology.  Acting was all very good.  There’s a lot of heavy lifting to be done here and everyone showed up.  Music is a little in your face at times but it worked.  Everything felt of a tone.The plot here is better than the actual nuts and bolts of the story but I like the characters and the worlds they played with.  It’s a visceral experience with compelling emotionality.  I also enjoyed the folklore elements that were woven into the tale.On its own terms, I’d give it an 8.5/10.  Out of all marvel movies I’d rank it as B+ tier."}, {"rating": "4", "text": "This was a below average Marvel movie at best. They should have either recast T'Challa or made a Boseman tribute movie on Disney+ and got all the crying and reminiscing out of the way before proceeding with Wakanda Forever because this movie had pacing problems. Some of the action scenes were good, but the movie in whole was mostly just slow and boring. My favorite character was General Okoye. Ironheart was disappointing and Riri was simply forgettable and the suits were terrible, let's be honest. I don't know how Marvel managed to do it, but Namor was both interesting and disappointing at the same time. The first Black Panther, although overhyped and overrated as it was imo, I thought it was an above average Marvel movie personally, was simply a better movie than WF. Wait for it to release on Diseny+, you're not missing anything special imo."}, {"rating": "9", "text": "Black Panther: Wakanda Forever is not with out it’s flaws, but the uniqueness, maturity, and twist turn nature of the film puts it leagues a head of Marvels previous projects, and secures a spot in the halls of greatness."}, {"rating": "0", "text": "Wow we went from Tchalla vs Killmonger. One of the most epic heroes and villains in the MCU. To Shuri the most unlikable character in the first movie vs Namoorrrrr. What is going on Marvel? I get it you want to put more females in your movies. But Jesus Christ you have replaced every popular male character with far less entertaining and likeable female characters. This is just awful kill off Tchalla off screen and then have this slow emotional superhero movie. And Ironheart hahahaha wow. That looks like a transformer or something. Just end it already you are ruining everything"}, {"rating": "10", "text": "Ryan Coogler had a seemingly impossible job, yet somehow he was able to pull off a film that honors the legacy of Chadwick Boseman but also might even be better than the original.I loved the movie. This movie is a must see!"}, {"rating": "8", "text": "A very good movie and a great tribute to Chadwick Boseman.I really liked Namor as an antagonist."}, {"rating": "0", "text": "It's an overrated movie, I don't understand why it has such a good rating if it's garbage."}, {"rating": "4", "text": "It's stylish but scattered. Spreads itself way too thin by trying to kickstart other characters' storylines.Director Ryan Coogler was given a tough hand to deal with and did his best to build solid arcs but it just doesn't totally come together. [Much like the entirety of Phase 4.] -S"}, {"rating": "5", "text": "A bit of a mess. The first two thirds of the film aren't bad but the final third is laughable. People in the cinema were laughing at sections that were not meant to be funny, they were just that bad. The music in the final action sequence did not work and was quite jarring."}, {"rating": "4", "text": "Could've been far better had the studio been more creative with the conflict itselfa whole new species and civilization and all they come up with is  water grenades and orcas, (which they only show like twice or so)....they didnt use the kraken and thats just sad"}, {"rating": "10", "text": "È uno dei pochi film che mi ha fatto piangere.Indubbiamente Chadwick Boseman è stato una grande persona e mostra l'affetto che la maggior parte degli attori che hanno partecipato a questo film hanno per lui."}, {"rating": "10", "text": "Masterclass. Long Live The Black Panther."}, {"rating": "8", "text": "Wakanda Forever only problem is time. There wasn't enough time to build the characters in 2 hours and 40 mins. I wanted to see more of Namor and his people and maybe some more interaction with them, you introducing all whole new civilization like Wakanda, so you need a whole movie or series to do that. Namor in general needed more time to discover his character.  Angela Bassett should get some kind of award she really is the Queen Ramonda and am only reminded its her because there is only 1 Angela Bassett on this planet. Lol.We also could've used more time with Mbaku. The directo did an amazing job as usual.  Movie looked great. All the females in this movie absolutely did a great job and it was cool to see more of them.They did a great job making you feel the loss of Chadwick this entire movie.  I think this is one of the better marvel movies to come out on this phase. Overall good movie."}, {"rating": "10", "text": "Great movie.Awsome acting.Namor is good, also is Ramonda.Okoye is really good"}, {"rating": "9", "text": "perfect[ adjective, noun pur-fikt; verb per-fekt ]adjectiveconforming absolutely to the description or definition of an ideal type:a perfect sphere;a perfect gentleman."}, {"rating": "8", "text": "Se lo dificil que ha sido perder a un actor fundamental para el MCU pero creo que esta pelicula hizo un gran trabajo en encontrar un remplazo bastante respetable."}, {"rating": "9", "text": "Few commercial movies are made with such care and delicacy. It was artfully done, had a compelling story, and was entertaining throughout. Can't wait to see more from Shuri, Riri Williams, and Namor."}, {"rating": "8", "text": "Best Phase 4 Movie, acting was incredible and the dealing with grief in this movie is just epic"}, {"rating": "5", "text": "Terrible movie, should not have been made without T’Challa recasting. MCU is not what it once was and now has become like some of these cancelled CW superhero shows with better budgets. Wait for it to come on Disney plus."}, {"rating": "8", "text": "Emotional and exciting entry to marvel universe ,great tribute to Chadwick Boseman, poignant story telling with stunning visuals and character development is good  and intriguing music made this one worth a watch !"}, {"rating": "5", "text": "A middle of the road film. Nothing terrible, nothing amazing. I’m not a massive marvel fan, I see the odd film. So maybe you have to have seen everything marvel put out to get more from this film. It’s movie I won’t be thinking about in a weeks time"}, {"rating": "10", "text": "Very  Nice movie . The best movie i have seen from Marvel this year. Very emotional. And Namor was just Fantastic✨✨"}, {"rating": "9", "text": "Este filme foi feito com amor e respeito por Chadwick Boseman, o que torna difícil para mim ver suas falhas e deficiências."}, {"rating": "9", "text": "Beautiful movie and beautiful tribute to one of the most inspiring actors of recent years."}, {"rating": "0", "text": "All the crying, tribute, funeral evoke those sad feelings in all the people that lost someone in pandemic. Marvel/Disney shouldnt prey on us to earn profit. Shame! They should recast black panther to continue his many adventures as in the comics. Now what we get is Black Pantheress, not exin comics."}, {"rating": "8", "text": "I don't watch many Marvel movies because they are very commercial and rarely bring anything memorable but luckily this is an exception."}, {"rating": "10", "text": "Just amazing highlight of 2022 by Marvel.It's very emotionfull movie. Sir Chadwick we always remember and miss you."}, {"rating": "5", "text": "I won’t simply dismiss this movie because of “woke” **** Actual history isn’t woke people. Where this movie falls short is much more disappointing.To start, the stakes are incredibly low. It’s hard to become invested in a story and the idea of Namor as a villain when there are no consequences whatsoever. Everyone knew Wakanda wasn’t going to fall, or that no notable characters were going to die, or suffer any tragedy that could be used as character development. This saps the life out of the movie, and makes it seem pointless.My second gripe is Namor himself. The writing really fails to cement him as a true villain. Somewhere in the underwater scene his motivations suddenly shift from “I just want to protect my people”, to “I want to watch the world burn”, with no real catalyst. This relegates IronHeart’s purpose in the movie to another half-baked character in a suit of armor with no real purpose. This also makes Namor’s subtle amicability seem laughable. You want to watch the whole world burn, but you’ll half heartedly kill the queen, and be so cordial as to give the resourceful Wakandans a week to reconsider, and then throw your motivations in the trash simply by getting bested in combat? Seems like his heart was never in it to begin with. The third area this movie falls short in is the combat. The choreography here is desperately lacking, and the constant camera cuts are dizzying, and seemingly wants viewers to fill in the gaps on what’s happening between cuts. The side boss given to Okoye is insipid and unimposing as well. Marvel seems to be heavily regressing in the action department instead of upping the ante . It doesn’t even surpass the original Black Panther, nor does it even crack the top 10 in terms of action. Other gripes:- cliche “revenge isn’t the answer,” storyline straight from The Last of Us Part 2.-Power scaling is all over the place and further diminishes The Hulk. Ok, Namor is as strong as The Hulk, but buddy from the mountains took a punch from him and was better within a day.-Shuri’s urge for vengeance leads to an incompetent plan that only an Imbecile and not the sharp kind of a genius would concoct-How did Shuri have a Black Panther suit perfectly tailor-made for herself when she was dubious of the ancestral plane even existing and was reluctant to takeover the mantle from the start"}, {"rating": "4", "text": "This movie is made very well but it’s too somber. The only technical flaws are the poor lighting in the first third of the film similar to how Solo: A Star Wars Story is. The acting is done well. The cinematography is spot on for the most part. The characters are just as good as part one. The story is bad. The logic is bad. And the Black Panther had very little screen time and does not do enough to feel heroic. I also don’t really like how the Black Panther became the Black Panther. It seemed like an after thought. The credits scene is the best scene in the movie and is very touching. This is by far the worst marvel movie. I’m still glad i watched it. I’m still glad it exists. I probably won’t watch it again. I’ve loved nearly everything Marvel has released. This one missed for me."}, {"rating": "5", "text": "Just as with the first, the movie was overhyped and underperformed. It wasn't terrible, but not the amazing film they tried to make it out to be. I give it a 5/10"}, {"rating": "8", "text": "Phase 4 has been the most controversial and problematic of the MCU, but I think that this movie closes the phase quite well and I think that the majority will come out of the cinema satisfied."}], "recommendations": ["avengers_age_of_ultron", "poseidon", "justice_league", "thor_love_and_thunder", "x_men_apocalypse", "captain_marvel", "ben_hur", "serenity", "dark_phoenix", "riddick", "the_last_airbender", "fantastic_beasts_the_secrets_of_dumbledore", "guardians_of_the_galaxy", "aquaman", "bumblebee", "the_many_saints_of_newark", "terminator_genisys", "tomorrowland", "thor_ragnarok", "king_arthur_legend_of_the_sword", "thor_the_dark_world", "morbius", "hercules", "eternals", "the_darkest_minds"]}