{
  "id": 1255,
  "title": "Blackhat",
  "starring": [
    "Chris Hemsworth",
    "Tang Wei"
  ],
  "runtime": 133,
  "genre": [
    "Crime",
    "Thriller",
    "Action"
  ],
  "description": "Nicholas Hathaway, a furloughed convict, and his American and Chinese partners hunt a high-level cybercrime network from Chicago to Los Angeles to Hong Kong to Jakarta. As Hathaway closes in, the stakes become personal as he discovers that the attack on a Chinese nuclear power plant was just the beginning.",
  "releaseYear": "2015",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/7zu6HPnKPjNA7NuR4DGRdaH0PdX.jpg",
  "categories": {
    "plot": 4.864864864864865,
    "acting": 4.464285714285714,
    "ending": 4.5,
    "soundtrack": 10.0,
    "cinematography": 5.125,
    "familyFriendly": 3.0,
    "funny": 5.0,
    "action": 5.153846153846154
  },
  "reviews": [
    {
      "rating": "9",
      "text": "I have to go with \"Proteus\" here and celebrate the return of Michael Mann. God, nobody gets mise-en-scene like him! I will suffer through a fair number of plot anomalies just to be rewarded by scenes actually staged by a a master. For those of us who make moving images for a living, Michael Mann will always be a \"draw.\" He is a \"director's director.\" I don't denigrate those who are looking for more... but, honestly folks, there really is so much less already out there!"
    },
    {
      "rating": "9",
      "text": "Point 1 - this is visually entertaining. It has the Michael Mann wide-screen look like Heat and Collateral. I feel as though I am in a city (Box ticked). This conjures the feeling of alienation and that I am nothing but a drop of water in the ocean with my own little life.\r Point 2 - the problem. Thor actor is all beef cake and perhaps limited in convincing me he is intelligent enough to be a hacker yet I like Chris Hemsway - as though I know him personally in the same way I feel I know Tom Hanks (the master).\r Point 3 - in comparison to the odd worthwhile movie I watch at the flicks this is worth the ticket money. The panoramic scenes does achieve a lot  and gives that sensory experience of 'lost in the vast buzzing city which could be any modern city in the world (Box ticked) and this is MM hallmark.\r Point 3 - again (why not since the movies keep doing part 2s an 3s?). Birdman, Theory of Everything and Whiplash  - the only great movies of 2015 so far. Outstanding. This does not hold candle to them but comparing the multitude of drivel I have watched in recent years at least I don't regret parting with my hard earned dosh.\r Verdict: decent enough to view at the flicks, particularly for the visual style of MM."
    },
    {
      "rating": "7",
      "text": "A Michael Mann film, and storycraft and logical commitment are thus not as important as mood and style in providing the film's backbone.\r Watch this movie here for free http://www.watchfree.to/watch-2a1555-Blackhat-movie-online-free-putlocker.html"
    },
    {
      "rating": "9",
      "text": "This is Highly Sophisticated Fiction Movie. It's not for those who does not compile the Computer World. It's very good plotted and staged Fiction in multiple original language of the location reflects its oriented reality. Some says it's in slow pace. Yes it's true that it's time to time slow but still it can be watched till the undetermined end."
    },
    {
      "rating": "9",
      "text": "5.3 of score???? ha ha ha. That somehow reveals that we could not take it serious from this site evaluation!!! I just saw the movie and was fantastic wel balaced, and with atmnosphere and u say 5.3 of score??? very strange... I must laught at that evaluation! ha ha ha..."
    },
    {
      "rating": "4",
      "text": "The subject matter (international cybercrime) and director Michael Mann (often stylistically innovative) promised a cool look at this timely subject. Unfortunately, it quickly turns into a typical Bourne-type actioner with a few keystrokes thrown in. Chris Hemsworth plays a jailed hacker, whose brought out of jail and onto the case to track down the criminal who's already caused a nuclear disaster. There's a lackluster love interest that slows down what little momentum that exists. Nothing about the approach or the writing is original and the sluggish pace isn't augmented by any of Mann's visual style."
    },
    {
      "rating": "4",
      "text": "There's no sugar coating it, Blackhat is terrible. It has agonizingly slow pace, stupid logic and a barrage of tech lingo which withers your will to watch it till the end. It's surprising that this is the work of Michael Mann who produced much superior film, Collateral, more than a decade ago. Chris Hemsworth as lead is willing, he makes the best out of his character, even if it seems he's lost most of the time.\r The story revolves around a cyber terrorist attack on Hong Kong nuclear plant. Chris Hemsworth, because his screen name isn't memorable enough, is called to consult on apprehending the hacker responsible for this act. At first glance this is supposed to be cerebral endeavor, but it does not even come close. In fact, regular mundane investigation requires arduous effort. Finding the simplest clues will take five minutes of narrative, and this is done with incredibly alienating script. Plenty of terms that might not be familiar to audience, and even if that's not an issue, the movie repeats itself too many times without adding much.\r There is no satisfying master plan, or even basic plan at all. Characters make the bad decisions such as not taking cover in fire fight or doing illicit deed in public, these are supposed to be agents sent to resolve international incident and mastermind behind it. In no realistic realm these scenarios could work, but they stupidly do, only for the sake of the plot. It disappoints in every turn, after all the nifty computer screen, I daresay Fast & Furious 5 plan of dragging bank vault makes more sense.\r If the movie does anything right, it's the use of setting and cinematography. Michael Mann has a certain style which produces an authentic feel of any place the characters play in. Some scenes extenuate the long pace with unbridled view of buildings and the city. Unfortunately, with such thin substance it feels like a long boring drive at best."
    },
    {
      "rating": "5",
      "text": "I was let down by 'Blackhat', a movie from one of my favorite directors (Michael Mann) that seemed to have an interesting story that had relevance in the real world from the wake of the recent Sony hacks and the rise in cyber crimes that are perpetrated more and more in recent days. However, the plot moves at an excruciatingly slow pace that would challenge even the most attentive viewer from falling asleep. There are multiple scenes that have no importance to the story that should have been cut out, it's like the movie was still on the editing table when it was sent to theaters. There are a few good things about it, the gunfights were gritty and non exaggerated proving that Mann can still do decent gun play that is more accurate opposed to the infinite clip that we are used to seeing in many other movies, the cinematography is also very good and it was really nice to just look at the beautiful landscapes and backgrounds of the locations they filmed in Hong Kong and Jakarta. The acting was a very mixed bag considering most of the main characters are miscast i mean come on Thor as a hacker come on, Viola Davis was the best part of the movie as the no nonsense Carol Barrett and it seemed she was the only one trying here. My main fret with this movie is the Antagonist, he is never given the treatment that past Mann antagonists had. In 'Collateral' we had Tom Cruise give an excellent performance as Vincent, and in 'Heat' Robert DeNiro gave another fantastic performance as Neil McCauley. What both of these characters have in common is that they are written terrifically. In Blackhat, not so much. The antagonist is not only miscast, but is written without an objective and there is no reason given for him to cause destruction other than 'just because'. Blackhat is a competently directed but slackly written thriller that will most likely bore audiences than thrill them."
    },
    {
      "rating": "5",
      "text": "Chris Hemsworth is a good looking guy, but not a very versatile actor. I really don't think that he can play anything else but Thor. This movie is very long, and flashy and somewhat miscast. The direction is pedestrian at best and the narrative seems very uneven and confused. To me, it plays out like a very expensive episode of an American espionage TV show, such as \"The Blacklist\" or \"Scorpion\". The shame for me is how it really wasted the talents of Viola Davis, who is so much better than this."
    },
    {
      "rating": "10",
      "text": "What do all film critics have in common? Answer: they have never made a movie. Look at the reviews by the uninformed. Seriously there should be a certification criteria for film critics like with other professions.\r This is a brilliant movie like most or all of Micheal Manns movies. The set pieces are meticulously stage and have a particular pleasing geometry. The mood, the cities, the cinematography is classic Mann and classic excellence. Just go see the movie. There are very (very) few directors working with the level of artistic excellence that we see throughout this movie...in every edit, every performance, music choice and every frame we've been given. Bravo and thank you once again Mr. Mann."
    },
    {
      "rating": "3",
      "text": "Blackhat tries to be the new Heat and some action scenes actually look like Micheal Mann copied them straight out of Heat and Collateral. This cyber thriller stars Liam Hemsworth as a convict hired by the government to stop an international hacker. Wow, I have to say I was excited. But minutes into it, I lost all trust of Mann bringing us the next hacker heap of destruction and handheld camera shots.  The camera shots are frustrating,  they are annoying,  shaky and fuzzy at times. That was a bum for a great director like Mann. The sotry was good, but everything else falls apart. The acting is great but it could have been way better. Blackhat is a disappointing one. 3/10."
    },
    {
      "rating": "4",
      "text": "I was looking forward to this movie and thought it might have a niche appeal that resulted in the low scores, but unfortunately its just a very average film. The pacing is glacial, it takes too long for the story and the characters to develop and there is no urgency to catch the perpetrators, I thought the ending wasn't a very satisfactory conclusion to the plot and thought a lot of potential had been wasted. I won't go in to the plot holes and inconsistencies as you have to suspend your reasoning for these type of films.\r There were some gripping parts in the film, and it is certainly watchable, but its really a straight-to-DVD title and nothing special."
    },
    {
      "rating": "5",
      "text": "Good pacing, average story. Keep me entertained, but not much else. Reminded me of the Taken series, except with more computers and supporting characters.\rThere are a few good twists, but the love story felt forced (not sure why, it just did alright!). A few of the fellow patrons gasped at the fighting/explosion scenes, so there's that as well.\rIn summary, wait for rental or VOD. If you must see a movie in the near future, American Sniper provides more emotional acting  and realism than this movie. I'm hungry for Chinese food now."
    },
    {
      "rating": "1",
      "text": "Awful.  I love Michael Mann movies, but this was just terrible.  I will summarize as follows - hunky computer geek with insane personal combat skills (???) catches an international cyberterrorist and walks away with enough money to live lavishly forever with his new, hot girlfriend.  With that being said, there is a gunfight or two and NOBODY stages a gunfight like Michael Mann.  I mean no one...that was a great scene.  The rest of the movie?  Meh...\r Here's the deal - the plot is absolutely braindead.  The plot twist (spoiler) is that the earlier hacks are a test run to destroy some tin mines and make a killing on the futures market.  BUT...the hacker can apparently manipulate future markets anyway (that's how he got his front money), so why bother with the Tin scheme?  Why not just do that Chicago Mercantile Exchange hack over and over again?  Because Thor needs to kick some ass, that's why.  I guess.  I dunno.  Just seems like the \"surprise\" is nothing more than a repeat of the beginning of the movie.\r Very disappointing.  I suspect Mr. Mann's next one will be great.  For every Heat, he makes an Ali.  For every Collateral he makes a Blackhat.  Next one has to be fantastic, right?"
    },
    {
      "rating": "0",
      "text": "Where to begin brief intro. One this review only reflects first 30 minutes as I couldnt watch anymore 2 I generally feel critics are too harsh on some movies they rate poorly. I have reviewed films myself in the past and used to work for a movie theater I love movies and will generally watch anything I am even remotely interested in regardless of whether I think it is reviewed well or not. I am a firm believer of never walking out of a movie before it ends giving the full runtime to the film to come out with an accurate review. I am being a hypocrite right now this movie is godawful I couldn't watch another second of it. That is enough of an intro on to the actual review.\r In the first 30 minutes next to nothing happens now if this was setting up the origin of the story or characters that is fine I really dont mind when a movie starts with a slow pace but there is a difference between a movie with a slow pace and a movie that does almost nothing in the first act of the film. Here are some random things that happened. Someone causes a virus to infect chinese nuclear systems to cause a core to overmelt. This is expressed in two ways a 5 minute scene of data running through wires in what is some of the worst cg I have ever seen in a film and actors staring dramatically at eachother with a few nods. A hacker looks at the code of what happened and angrily slams his laptop closed and pushes some paper off his desk. Chris Helmsworth character helped create the code so he is negotiating his terms.\r You have good actors giving bad performances with bland dialogue you have more solemn stares you have more crappy cg sequences of data going through wires.\r Very little emotion is shown by anyone no explanation is given as to what type of hack it was what terms they are throwing about with no definitions.\r I have a basic understanding of cyber attacks and hacking not a great one not a nonexistant one but at least in the 30 minutes I saw if you are interspersing horrible cg with random hacking terms and not explaining anything to the audience that is just poor planning\r This is the 3rd movie I have walked out of in my life One I was sick and had to leave for as a child one was premonition with sandra bullock and now this one in my 29 year obsession with cinema I have seen around 500 films in theaters. Normally I feel critics grade a film too harshly if it isn't an oscarbait film currently I simply find nyself dumbfounded by any critics giving this film higher then a 20 on a 100 point scale. I have watched so many crappy movies all the way through where I knew it was a bad movie but I just kept watching it to able to give a fair judgment. This one is so bad it doesnt deserve the full runtime.\r If a film is 2 hours and nothing has happened in the first 30 minutes? That is a problem. I am not saying nothing cool or exciting happened I am literally saying nothing happens. Again bad cg animation hacker terms with no explanation and good or at least decent actors giving godawful performances. I havent written a review for a movie on metacritic in years I logged in simply to write this urging you not to waste your money. One of the worst movies I have started tk watch in the last 10 years. Transcendencd is godawfuk as well but ironically the first 20 minutes of that was good."
    },
    {
      "rating": "2",
      "text": "Michael Mann has made some great movies (e.g., Heat, Manhunter).  Hopefully, he will make more great movies in the future, and Blackhat will be forgotten, or remembered only as an example of how even talented filmmakers can occasionally turn out total crud.  The plot is ludicrous, the acting is wooden, and Chris Hemsworth is no more believable as a genius hacker than Danny DeVito would be as an NFL quarterback.  The \"hacking\" itself will look ridiculous to anyone with even a modicum of Linux skill or network security know-how.  And the last third of the movie takes place in a bizarre superposition of Malaysia and Indonesia where large crowds of locals somehow can't see vicious hand-to hand combat taking place in their midst.  Turkey, avoid."
    },
    {
      "rating": "8",
      "text": "This movie is apparently rated highly in France and Italy, but not in America.  Which tells me American viewers are pretty stupid as I just watched \"John Wick\" which averages a 7.8 and this movie gets a 5.4...which is laughable because \"John Wick\" was one of the dumbest movies I ever saw in my life, directed by Keanu Reeves stunt double, with 0 plot, 0 point, and near 0 near 0 enjoyment value.  I could not wait for it to be over, same with other stupid cliche action movies.  While Blackhat on the other hand is not perfect, and it it very similar in feel and tone to Mann's other films, it is a decent film, which kept me guessing, kept me engaged, and had pretty good character development and was overall a pretty good movie on a subject that does not have many films made about it yet.  I would rate it as one of Mann's weaker films, but, even as possibly Mann's worst film (for being similar to his others) its still much better than most of the crap pumped out by Hollywood today."
    },
    {
      "rating": "4",
      "text": "Hacking is a hard criminal activity to make cinematic, and while Michael Mann tries hard he never really succeeds. Hemsworth is an almost impossibly buff and attractive criminal and as he travels the world helping to apprehend the hackers the film starts to look more and more like a Versace commercial. Manns visuals are as impressive as ever, but the film feels hollow and inconsequential, when it should feel vital and important"
    },
    {
      "rating": "6",
      "text": "I hate to take off points because I don't like how the story went, but I was wanting a story about cyber intrigue. That would have been so much moe interesting. Instead, we get a combination of a Snowden and Thor, when you know a Snowden type doesn't punch, shoot, use a knife, and kill like that. I also wish they'd hold the camera still when people are running. I guess we're supposed to believe that Swiss Euroes exist, or maybe that was a goof. Although, I did not enjoy the blood and guts, the scenery was impressive."
    },
    {
      "rating": "6",
      "text": "I found the movie a little slow at times. The story was pretty cool once you got into it but I can see how your typical moviegoer who doesn't have the slightest understanding of this kind of stuff would get lost. I'm no computer expert but if you at least follow the basic news and know about malware you can easily understand it. I think my main issue was that the actors didn't seem too into the scenes (very laid back about the circumstances around them) and that the plot makes you think the stakes for finding the villian are very large until you get towards the end and figure it out. And finally it just felt a little drawn out. Honestly though it was still overall fun to watch. The story is different and mostly interesting so that alone I think is good enough reason to at least rent it."
    },
    {
      "rating": "3",
      "text": "I found the cinematography and timing poor from a technical standpoint - that is that some Scenes would be strange to be there at all and others would hold too Long. As other reviewers said, flat and unattractive with a hard to follow and from a Computer Technology standpoint yet another impossible hacker tale (no real hacker could get in that easy or fast to the Systems they Claim to penetrate in seconds)"
    },
    {
      "rating": "5",
      "text": "Black Hat is a movie that relies on star power to make the film, Chris Hemsworth in the lead roll did a adamant job in his roll but he was about the only memorable actor in the film. Most the other Actors/Actresses in the film fall flat and just don't ever feel like key characters. The story of bringing a hacker out of prison to help save the rest of the world from another hacker feels a little convoluted and weird. The action in the movie was done right, Gun fire is loud and bullets rips through the environment and makes you feel like it's not just blanks being fired.Sadly beyond that there wasn't much else I found stood out from the rest the mediocre story and un-needed love interest just pulled me away from the film. Black Hat is a Decent weekend action film if your looking for something to watch but you'll probably forget about it after a few days."
    },
    {
      "rating": "0",
      "text": "This movie was so terrible I regret watching it at all. I feel like I lost part of my life, that I wont ever get back. This movie is full of so much racism I cringed so bad. Why do white people still believe that 1. All asian women are attracted to them just because they are white? and 2. Asian men are unattractive, evil and unwanted? I've had enough of the useless propaganda coming out of the US. Chris Hemsworth, you should've known better, because i'm starting to believe that you are really as dumb as you seem in that new Ghostbusters remake."
    },
    {
      "rating": "10",
      "text": "Nice movie. Got a realistic feel to it. Its all about the network, computing power and lines of coding on-screen. Lead actor is charming, though an unfit nerd would fit the role of a hacker more. Tang Wei's acting potential was wasted due to her weakness in the spoken language of English. Nonetheless, she's hot! Well, enjoyed watching all the familiar Asian actors having a role in this film."
    },
    {
      "rating": "7",
      "text": "Blackhat is quite generic when it comes to following the action-thriller formula, plus it has a shoehorned in romance subplot that is completely useless to the story. That aside, it is still a good film. Michael Mann's films are odd to me in the sense that (aside from Heat), I do not love any of them. They are good to very good, but I am not in love with him as a director. However, I do like all of his films. Why? As exemplified in Blackhat, they are visually stunning. This film looks like a Michael Mann directed film with some killer cinematography, great lighting, and Mann's typical visual style. A timely an exciting, even if far-fetched, plot surrounds the stunning visuals and it most certainly entertains and thrills along the way. People tend to really not like this film (as evidenced by a 34% approval rating from critics on Rotten Tomatoes and 24% from the audience), but I really enjoyed Blackhat. If you love Mann's visual style, as exemplified mainly in films such as Collateral and Miami Vice, then Blackhat is the film for you."
    },
    {
      "rating": "6",
      "text": "It's about the virtual terrorism and fighting back it in the same way.\r This is the story of the United States and China, that also involves some of the southeast Asian nations when the story takes us there. So this tale is about an explosion at a Chinese nuclear plant and followed by the investigation conducted by the US and Chinese collaboration, the cops hire a convicted hacker to fast up the process and to nab the culprit who was behind the power plant disaster. These people begin their hunting by tracking the clues to the different locations and where they finally land and how it all come end told in the rest of the film.\r I felt it was a too much realistic presentation. Like a documentary film quality, but full suspense filled story that stretched to over two hours. So sometimes it was very boring, because slowing down in any big development. At a time, some of the important scenes accomplished so fast like most of the action sequences. It mainly revolved around hacking plot, but was not that intelligent, so can be understood by everyone.\r Initially I disliked those circuit board graphics, which I thought was a good detail, but too much for a film like this and it never looked so convincing. The film was average, but I anticipated lot better than that. I liked the actors though. Whether it was Chris Hemsworth or the Chinese counterparts, all were decent according to what the tale required. The film is not for everybody, particularly if you don't like slow narration, you should not consider it to watch. But the film is not bad for once viewing.\r 6/10"
    },
    {
      "rating": "4",
      "text": "While thrilling, suspenseful and exciting at times, Blackhat is also often punctuated by a dour tone, an incomprehensible plot and poor cinematography."
    },
    {
      "rating": "1",
      "text": "Unwatchably dull with a cardboard plotline and poor casting choices. Unless you happen to love extreme close ups of peoples faces with shaky camera and OTT cgi zoom ins of computer hardware of course! The movie failed to connect with me at all within the first 20 mins so I just stopped watching."
    },
    {
      "rating": "7",
      "text": "An admirably committed effort.  In 2023 works fine as Netflix TV (better than network TV)."
    },
    {
      "rating": "10",
      "text": "Shocked to see this rated so low. It's a tense, twisty, gorgeously shot action thriller with way more cinematic talent behind it than 95% of the shlock Hollywood makes these days. It does a great job of bringing Mann's usual themes (professionalism in the face of danger, honor amongst thieves, crime as operatic conflict of good vs. evil) and brings them into the modern era with one of the most realistic portrayals of hacking as a tool of theft and terrorism ever committed to film.Hemsworth is great as a classic brooding, masculine, Mann-style tough-guy protagonist, and the Chinese brother/sister duo helping him are some of the more believable and charismatic Asian stars I've seen. The music, atmosphere, and cinematography are all painfully good. Sure it's not a super-deep story (though by the end it succeeds at transcending the basic \"will they catch the bad guy\" premise it starts out with), but it has heft and craftsmanship like a Kimber 1911. Ignore the critics and give this one a watch!"
    },
    {
      "rating": "4",
      "text": "Lange war Michael Mann der Inbegriff stilvollen Actionkinos: Filme wie Heat erzeugten mit fast dokumentarischen Stadtbildern und perfekt getimter Action eine hypnotische Wirkung. Auch der Thriller Blackhat beginnt vielversprechend: Den Hacker-Angriff auf ein Atomkraftwerk inszeniert Mann als berauschende Kamerafahrt über Lüfter, Platinen und glühende Kühlstäbe – so nah war man der digitalen Bedrohung noch nie. Doch als Hauptdarsteller Chris Hemsworth das erste Mal seinen Mund öffnet und ein peinlicher Hollywood-Oneliner herausplumpst, dämmert es: Blackhat spielt in einer ganz anderen Liga. Der klischeehafte Plot um einen ex-kriminellen Hacker, der dem Zu-dumm-für-seinen-Job-FBI aus der Cyber-Terrorismus-Patsche hilft, garantiert 133 Minuten Langeweile. Mit Fußfessel und hübscher Begleitung reist man durch halb Asien und tut nichts als auf Tastaturen zu hämmern. Selbst die wenigen Schießereien – eigentlich Manns Steckenpferd – sind peinlich, unlogisch und nicht einmal packend. Nach Nolan und Scott driftet mit Michael Mann scheinbar ein weiterer Visionär in die Belanglosigkeit ab."
    },
    {
      "rating": "4",
      "text": "Blackhat is a rather daring but uncool thriller telling the story of an imprisoned hacker who is recruited by the FBI to help them thwart an international cyber-terrorist.At its best, Mann's work explores the thin line separating good from evil, recognizing the moral complexities of the modern world but the film loses its grasp really fast and becomes a mere excuse for an action movie."
    },
    {
      "rating": "3",
      "text": "The scenes with zoomed in circuit boards running flashy lights is prolonged and unnecessary, just like the pacing of the movie and its ridiculous plot. The acting is almost as bad as the writing."
    },
    {
      "rating": "9",
      "text": "I agree totally with Proteus. It is a very good movie and as usual the comments by the critics are absurd mostly."
    },
    {
      "rating": "4",
      "text": "The first 30 minutes of the movie are great. The problem is what remains of the movie after that. This feels like one of the worst Mann movies, the cast doesn't help the director here. Acting is as bad as the screenplay."
    },
    {
      "rating": "10",
      "text": "Am not a fan of referring people but after been scammed 4 times i finally met an ethical hacker who helped to increase my Credit Score from 520 to 780, it was like a miracle. He can also help in doing all of the listed below like; citizenship permit to few countries, wire funds, hack email and social media, hack your boy or girlfriends phone (iOS / android), criminal records, just name it. Contact him through his email (LORDKEVINMITNICK @ GMAIL COM) or text him on his WhatsApp Number +1(913) 210-1809. I can assure of him being efficient, affordable and reliable."
    }
  ]
}