{"id": 1811, "title": "Blade II", "starring": ["Wesley Snipes", "Kris Kristofferson"], "runtime": 117, "genre": ["Fantasy", "Horror", "Action", "Thriller"], "description": "A rare mutation has occurred within the vampire community - The Reaper. A vampire so consumed with an insatiable bloodlust that they prey on vampires as well as humans, transforming victims who are unlucky enough to survive into Reapers themselves. Blade is asked by the Vampire Nation for his help in preventing a nightmare plague that would wipe out both humans and vampires.", "releaseYear": "2002", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/yDHwo3eWcMiy5LnnEnlGV9iLu9k.jpg", "categories": {"plot": 6.958333333333333, "acting": 6.894736842105263, "ending": 7.333333333333333, "soundtrack": 7.0, "cinematography": 8.5, "familyFriendly": 3.0, "funny": 8.0, "action": 7.627906976744186}, "reviews": [{"rating": "10", "text": "Blade 2 is just as good as Blade 1. The action is great and plentiful as in the first movie. However this time,\rthe style of the action scenes is different because the director is different. The director of Hellboy directed\rBlade 2 and he turned the movie into an action masterpiece. He was a great choice to direct the sequel,\rI would've chose him in a second."}, {"rating": "9", "text": "One of the Most Underrated movies of all time Pro: Great/fantastic performances intriguing plot and compelling villain. The movie is also a compelling action movie with some (at the risk of sounding cliché) heart (a lot more than the original)Con: Some cliché scenes/dialogue and starts to fell repetitive."}, {"rating": "9", "text": "Blade 2 on it's own is a great movie with what I think better action sequences than the first. A little bit less darker tone I noticed as well. I only wish it had a similar opening like the Nightclub scene. That was one of the BEST intros to a comic book movie ever. Blade 2 also had more known actors playing the roles. Again great music and amazing action you'll never see elsewhere today. Sadly the CGI isn't too good."}, {"rating": "8", "text": "The start of something great (Orginal Blade) just changed tone and downgraded to good."}, {"rating": "9", "text": "This offers without a doubt one of the greatest cinematic action experiences of all time. Wesley Snipes IS Blade and Del Toro's vision is brilliant."}, {"rating": "7", "text": "Blade II. Vampires are mutants. The sequel turned out well, but as if something was missing and because of this I would not want to re-watch this film. Unlike the first part, which I am ready to review again."}, {"rating": "9", "text": "¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¤¡¤¡¤¡¤¡¤¡•¡•¡¤¡¤•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡°¡°¡°¡°¡••"}, {"rating": "9", "text": "●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\"."}, {"rating": "9", "text": "------------------------------¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○"}, {"rating": "10", "text": "Blade 2 is just as great as blade 1. It has great action and a great soundtrack just like the first one did. However this one did have a much greater and harder to defeat main antagonist which made it even more interesting."}, {"rating": "7", "text": "Blade II, despite lacking the surprise effect and incorporating a tome of more humor, is still a very good vampire hunter movie."}, {"rating": "9", "text": ";;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;-----------------------------"}, {"rating": "9", "text": "¿¡》《¤•°⊙☆••°°⊙⊙☆☆●●□□■■○○▪▪`~|{}[]♧◇♡♤♡◇♧♤♤♤☆☆☆☆☆☆☆☆#####.,?!;:\"':;;:;:;:;:;€£_/=÷÷÷××............"}, {"rating": "9", "text": "$$$$$$$$$$$$$$$$$$$$$$$,,,,,,,,,,,..................+×÷=************!?:;\"\"\"\"\"\"\"\"》》》》》》》》》¡¡¿¿⊙⊙☆☆●●■■▪"}, {"rating": "9", "text": "$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,》●》●》●》●》●》●》●》●》●》■》■》■》■》■》■》■"}, {"rating": "9", "text": "$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.》■》■》■》■》■》■》■》■》●》●》●》●》●》●》●》●"}, {"rating": "9", "text": "°》°》°》°》°》°》°》°》°》°》°》°》°》°》°》°》°》°》°》°》°》°@:@:@:@:@:@:@:@:@:@:@:@;@;@;@;@@;@;;@;@;@;@;@;@;@;@!@;@!"}, {"rating": "9", "text": "*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:☆°•☆°•☆°•☆°•☆°•☆°•☆°•☆°•☆°•☆°•☆°•☆"}, {"rating": "8", "text": "Initially I considered Blade II to be an inferior sequel, too slow and the action scenes were too Matrix-esque, but after a few rewatches, I'd say it's on par with the first one.Del Toro's love for monsters shines through, the Reapers are creepy and Nomak is an awesome villain."}, {"rating": "10", "text": "The character on Snowman's armor is the Japanese kanji 'yuki' which means 'snow'."}, {"rating": "10", "text": "To appreciate the movie, you have to be okay with vampire violence. I don’t mean"}, {"rating": "7", "text": "What I like about Guillermo Del Toro is that every movie he makes has beautifully gruesome visuals that overrides all the cons of the movie. \"Blade 2\" is a good example im talking about."}, {"rating": "10", "text": "The idea of the reapers having stingers coming out of the mouth were inspired by Polish folktales where the vampires had a stinger or \"finger\" coming out of the mouth that they used to suck blood rather than use teeth like the Balkan genus that is the greatest influence on the modern vampire mythology."}, {"rating": "7", "text": "Like most superhero sequels, Blade II goes for bigger and flashier without much thought about whether or not that will actually make things better. We got a slightly inferior sequel as a result. Although that's more due to the direction the plot took. Luckily, Blade found himself in the very capable hands of Guillermo del Toro. So things aren't a complete wash. In fact they are still quite stylish and cool.The director's always excellent visuals and attention to detail in every aspect of his gothic design for environments, costumes, creatures, and various gadgets and gizmos are on full display here. The outfits in particular look great with even the small accessories standing out because of how wonderfully crafted and imaginative they are. The CGI also holds up pretty well 16 years later. Something that is very evident in the final showdown as the scene relies quite heavily on it and still looks better than the vibranium mines fight scene in this year's Black Panther. The gore is spectacular, especially when brought to life with practical effects, and all of the director's usual visual fetishes can be found inside.The action as a whole isn't as enjoyable as the first Blade's. The first two sequences where Blade chases vampires down some alleys and a swordfight in his hideout are actually kind of boring. Everything that follows is a lot more fun, but this may just be due to the cool locations they occur in and the expansion of the cast as opposed to the actual choreography of the battles themselves. The climactic fight however is spectacular and the highlight of the movie. There are a lot of brutal hits exchanged and a natural aggression on display that makes the violence all the more exciting. It's probably one of my favorite fight sequences in any superhero movie bar none.Blade is given much more personality this time around. His cocky smiles and trash talk are a blast thanks to Wesley Snipes effortlessly cool performance. If it weren't for him the character's actions would actually just be laughable as at the end of the day this is a very cheesy movie. Given how Snipes was born to play this role however, the audience will only crack up when the actor wants us to. More liveliness aside, the daywalker still isn't fleshed out. The plot doesn't feature vampires as the main antagonists this time. Instead there's a third race of creatures introduced that force Blade to team up with his longtime enemies. This allows for more side-characters to be introduced and ultimately a higher body count, but the premise just isn't as interesting. Luke Goss is a cool villain though.The most disappointing part of the story though is the romance. Or rather the lack thereof. Blade's love interest is kind of bland and their connection doesn't work as anything more than physical. That wouldn't have necessarily been a bad thing if the script didn't begin to try and convince us that there was some sort of deeper connection between them at a certain point. Something it fails miserably at. Love is a plot device the vast majority of superhero movies have been unable to get right and unfortunately Blade II stands out as one of the genre's worst attempts in this department.Yes, Blade II suffers from a minor case of diminishing returns. Yet with one of cinema's foremost masters of the macabre at the helm there's still plenty to like. It's kind of interesting to think that it's del Toro's direction might be the only thing that saved this sequel. Because in a lot of ways it just feels like a trial run for his later (and better) comic book adaptation of Hellboy.7.2/10"}, {"rating": "8", "text": "It's rare for a sequel to match the original but you could even make the argument that Blade 2 surpasses the original. Having Del Toro at the helm for this one was a fantastic decision and a highlight of his epic filmography. Blade 2 remains just as fun and as memorable as the original and then some."}, {"rating": "7", "text": "Even though the plot and character development have hardly improved from the original, this sequel delivers more stylish action and grimmer visuals than the original thanks to Del Toro's upscale direction."}, {"rating": "8", "text": "Based on the comic, the movie satisfied both parties. The idea of making something true to the source material was achieved, while Del Toro had enough creative liberties to create monsters from his personal imagination and write, as it were, a love letter to Mexican vampire vs. wrestlers movies. To get the popcorn."}, {"rating": "8", "text": "After the great success of the first Blade film and before the horrific disaster that was Blade Trinity, Guillermo Del Toro took the reigns of the Blade franchise for it's second outing to turn Blade into the first Marvel movie franchise. In spite of this being Torro's first venture in to action, he proves that he is clearly suited for the genre already having the trademarks that make him such a great director, including his flair for cool designs and his ability to create stylish and focused action sequences.\r Taking place 2 years after the first Blade film, a mutation has occurred within the vampire community that causes them to mutate into a new species called Reapers. These creatures are stronger, faster and have a far more extreme blood lust, sucking both the blood of vampires and humans at a rapid rate. Thus Blade and his team of vampire hunters are recruited by an elite squad of vampires called the blood pack, to hunt down the Reapers and save both vampires and humans from this new threat.\r Once again Snipes is on top form as the Blade, bringing the right mix of humour and sword wielding mastery needed to bring the comic book character to life on screen. But the best new addition to the film is the inclusion of the Bloodpack. Their incorporation into the film creates an interesting dynamic as they were originally trained to kill the daywalker, but put in this new situation are forced to work with him. Thus we're basically waiting for the timb bomb to go off throughout the film, waiting for the inevitable double crossing to begin. Although whilst they all look like the badass vampires they're supposed to and the team as a whole are effective in the story, several members of the team don't seem to get any real screen time. Out of the 8 in the team only 2 of them are being given more than the bare minimum amount of dialogue, making it too clear the rest of them are the vampire equivalent to a nameless red coat.\r But the members of the Bloodpack that the film does give time to live up to their badass looks. Ron Perlman plays the leader Reinhardt, who brings his usual tough guy attitude to the role, whilst sharing a cool unfriendly rivalry with Blade, where the pair constantly try to oneup each other. Then there's Nyssa who acts as the main liaison with Blade and his team. Whilst her role in the film is fairly typical as the standard love interest in spite of sharing little chemistry with Snipes, the character still has some great moments through her fight scenes and an interesting side plot exploring where her loyalties should lie.\r Toro takes all his talents from directing horror movies into the action genre, with the Reapers slit lipped mouths looking like they could have been ripped directly from a horror film. He's also able to adapt to the action genre by incorporating a constant sense of movement in his camera movement, making the already fast paced swordplay even more exciting. The only downside with the action is the CGI, which at times is rather chunky and ends up making Blade look more like an action figure. However it's so well implemented to maintain the flow of the fight that the effects never distract from the enjoyment of the scene.\r Not everything in this film works, with some characters having no real purpose and some poorly explained story elements like Whistler coming back from death in the first film. But what does work is so great that it's easy to look past these flaws. This is by far the best Blade film by delivering on all the cool things that made the first film so enjoyable, with it's fast paced action and awesome designs, whilst improving on the formula with even more impressive action sequences and a great story that leads up to an extremely satisfying pay off."}, {"rating": "7", "text": "Guillermo Del Toro's Blade II is a sequel that proves to be even better than the first film. Wesley Snipes once again proves to be the perfect choice for Blade while the villain, Jared Nomak, is terrifying. In the end, this is another brainless but extremely fun superhero film."}, {"rating": "7", "text": "Not quite as good as the first one but the Director of Hellboy manages to make a solid sequel with awesome visuals but has too many fodder characters, a so-so plot and not enough character development for returning characters"}, {"rating": "7", "text": "A good example of a can't-miss proposition that missed by a wide margin, 1998's Blade had all the makings of a terrific B-movie, from its comic-book pedigree to its elaborate vampire mythology to Wesley Snipes' Shaft-meets-Blacula protagonist. A surprise hit, it was nowhere near as much fun as it should have been, mainly because it took itself way too seriously, a problem epitomized by Snipes' humorless lead performance. Snipes returns to vampire-slaying duty in Blade II, and while he still cuts a grim figure, he's surrounded by a film that's everything Blade should have been but wasn't: stylish, fast-paced, and comfortable with its own ridiculousness. Taking place two years after the original, Blade II finds Snipes' half-human, half-vampire warrior fighting a new enemy: a vampiric super-sect so dangerous and feared that even the malevolent vampire establishment wants it destroyed. Having devoted his life to fighting vampires, Snipes is understandably reluctant to aid his hated foes, but agrees to help destroy the new breed before it can take over the earth. Kris Kristofferson returns to play gruff-old-coot mentor to Snipes' semi-undead cowboy, and they're joined by a scene-stealing Norman Reedus as Snipes' stoner sidekick and Ron Perlman as an arrogant vampire who battles with Snipes for alpha-vampire status. Blade II's dialogue tends toward the arbitrary, but it's spiked with occasional bursts of wit. The combative relationship between Perlman and Snipes likewise gives the film a much-needed injection of droll humor, while Kristofferson and Reedus make striking impressions with minimal screen time. The film's plot functions as little more than a loose framework for impressive setpieces and energetically choreographed martial-arts sequences, but director Guillermo del Toro (The Devil's Backbone, Mimic) keeps things moving so quickly and looking so good that it barely matters. The world can always use another entertainingly trashy B-movie, and Blade II fits the bill."}, {"rating": "7", "text": "Still enjoyable now with a good script but questionable acting and delivery ."}, {"rating": "7", "text": "Blade 2 is just as good as Blade 1. The action is great and plentiful as in the first movie. However this time,the style of the action scenes is different because the director is different. The director of Hellboy directed"}, {"rating": "10", "text": "Blade 2 on it's own is a great movie with what I think better action sequences than the first. A little bit less darker tone I noticed as well. I only wish it had a similar opening like the Nightclub scene."}, {"rating": "8", "text": "The original Blade had an interesting core idea that it didn't do much with. Truth be told, Blade II doesn't do much more with that idea, but what it does do, is crank up the action to absurd levels, which makes it a massively enjoyable experience. Guillermo del Toro brings some fascinating new folds into the vampire genre here, much like he did with his directorial debut, Cronos. This time, of course, with more of an emphasis on thrills. Recommended for fans of vampires, action, and del Toro."}, {"rating": "9", "text": "Sometimes when an actor turns to directing, the results can be disastrous, such as Dana Plato's helming an episode of Cops, with tragic consequences. But just a year after winning the award for Best Supporting Actor for Traffic, Guillermo del Toro has gone behind the camera with remarkable success, in Blade 2. The movie occasionally shows some \"newbie jitters\" (what we call it when the newest person on my Babylon 5 chat group erroneously refers to the Minbari as \"Klingons,\" or to the rest of us as \"dorks\"), but it's a really great movie in most ways."}, {"rating": "5", "text": "Critics have often noted Blade 2 as the superior film in the franchise, I disagree. The amount of poorly done computer effects, overflow of characters and script make this film a lot to be desired."}, {"rating": "5", "text": "Blade II might be slightly be better than the original, but comparing this to its predecessor feels more like a drop instead of a rise. If we can get a great Marvel movie with Blade, that'll be amazing."}, {"rating": "5", "text": "We are facing yet another film in the \"Blade\" trilogy, planned and designed for young adults thirsting for action, with more choreographed fights than ballet and litres of fake blood that splash everywhere. This film, instead of bringing something new, is limited to repeating more or less the same recipe as its direct predecessor, which was a box office success. It is worth seeing, if we do not want an elaborate or deep film but just pass the time.The script for this film is simpler, in my view, than the one used in the first film of the trilogy. Here we already know the characters, there is no need for introductions and the feeling of superficiality that we had already mentioned in the first film is accentuated. Here, Blade is called by the heads of the vampire community who decide to propose a truce, on the condition that he help them hunt a new strain of vampires, the result of an evolution or genetic mutation. This new strain has a leader who is the most powerful and resilient of them. The problem is that the new vampires, instead of feeding on human blood, are killing other vampires as well and are an immediate threat to both humans and vampires. Of the three films in the trilogy, this is the most scientific and the one where the question of the \"vampire virus\" is more detailed. Of course, the film has some twists, there are allies that are not trustworthy and enemies that, after all, are not so dangerous. The dialogues continue to be quite heavy in their language, but that didn't bother me ... I think it suits the film.One thing that I think has improved a lot in this film, when compared to its immediate predecessor, was the cast and its performance. Wesley Snipes continues to look convincing in his role as a \"killing machine\" and at times seems virtually indestructible. Kris Kristofferson gives us a weak character but still full of smugness and the same tough guy as always. Norman Reedus looks quite nerdy, but the character required it and the actor was good at noticing and acting accordingly. Ron Perlman is, in my opinion, the best actor in the film and he was very good in the character he played. Leonor Varela and Luke Goss also gave us excellent interpretations.Technically, the bet remains on action scenes and the use of CGI and other high-quality effects. We have fights and deaths for all tastes, choreographed battles, cliché phrases, slow motion effects and blood. Liters and liters of fake blood like a computer game. The sets and costumes are good, and in addition to Blade's impressive costume, eye-catching and stylish, we also have the costumes of the vampire combat teams, also black and with metallic adornments referring to the punk universe. Speaking of which, we have to mention the soundtrack, loaded with electronic music and techno, well suited to the youngest."}, {"rating": "8", "text": "Not as good as the 1st. Seems like it was less action. Movie was still good though."}, {"rating": "8", "text": "Fun from start to finish.  Definitely my favorite Blade movie and one of my favorite Marvel movies."}, {"rating": "4", "text": "Worse than the first Blade, especially because it has even less story and more style. I prefer the other way round. Some of the effects are quite well done, but some CGI scenes were bad. Many action scenes were very good, but the editing of the action scenes was too fast, maybe it is something for the teenagers. Also the music was horrible sometimes."}, {"rating": "6", "text": "Blade west side story really didn't work for me at all. It worked better when Blade was hating on the suck heads not teaming up and falling for them."}, {"rating": "9", "text": "Blade II is a stunning and exciting action comic book film, Blade II straight away is a better film than the first Blade, Blade II have a lot of upgrade in terms of a performance, action (they got one of the best action scene i've seen in movies), and cinematography, Blade II is badass!"}], "recommendations": ["blade", "blade_trinity", "hellboy", "underworld", "upgrade", "predator_2", "the_terminator", "300_rise_of_an_empire", "john_wick_chapter_2", "abraham_lincoln_vampire_hunter", "aliens", "mission_impossible_ghost_protocol", "mission_impossible_ii", "hellboy_ii_the_golden_army", "robocop", "mission_impossible", "hulk", "john_wick_chapter_3_parabellum", "terminator_2_judgment_day", "the_bourne_supremacy", "kong_skull_island", "van_helsing", "the_league_of_extraordinary_gentlemen", "the_scorpion_king", "lethal_weapon_2"]}