{
  "id": 1539,
  "title": "Blade: Trinity",
  "starring": [
    "Wesley Snipes",
    "Jessica Biel"
  ],
  "runtime": 123,
  "genre": [
    "Action",
    "Horror",
    "Fantasy"
  ],
  "description": "For years, Blade has fought against the vampires in the cover of the night. But now, after falling into the crosshairs of the FBI, he is forced out into the daylight, where he is driven to join forces with a clan of human vampire hunters he never knew existed—The Nightstalkers. Together with Abigail and Hannibal, two deftly trained Nightstalkers, Blade follows a trail of blood to the ancient creature that is also hunting him—the original vampire, Dracula.",
  "releaseYear": "2004",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/rodqqX8NLe3cdcgBMc4CFTPidTy.jpg",
  "categories": {
    "plot": 4.027777777777778,
    "acting": 4.45,
    "ending": 2.857142857142857,
    "soundtrack": 3.0,
    "cinematography": 7.0,
    "familyFriendly": 3.0,
    "funny": 3.25,
    "action": 3.5454545454545454
  },
  "reviews": [
    {
      "rating": "4",
      "text": "Should've just gotten del Toro back. Writer of the previous Blade films David S. Goyer takes on double duty by sitting in both the writer's chair and the director's seat with Trinity. He shoots the entire thing like a total B-movie. It looks like the most cheaply made of the trilogy, despite having the largest budget of the three.Wesley Snipes reportedly caused a lot of trouble during the shooting of the movie. Refusing to communicate with the director and other forms of erratic behavior. Which is probably why it feels like he was never onscreen with any of his costars other than the ones he was beating up in the action scenes. At least he still gives a good performance. I'd be willing to forgive him for an MCU reboot. Goyer, not so much. His writing kills the movie.Who's idea was it to have a comic relief character? Don't get me wrong, Ryan Reynolds is funny, but this just isn't the movie for him. His penis jokes are a poor fit for the material. Also is it just me or is he in it more than Blade himself? What's so sad about this is that without him the movie would be nowhere near as entertaining as it is. As contradictory as this may sound and as out of place as his creative vulgarity feels, Reynolds is also the best thing about Trinity. I wouldn't have been able to sit through it without him.The dialog in this is horrendous. It's made worse by the fact that something went wrong with the sound production. Everything in the first half of the movie sounds like it was recorded in a cardboard box, making it look like even the people onscreen who can act, actually can't. The plot is a whole bunch of nothing. The characters are underdeveloped and the interesting concept of having Blade face off against Dracula is squandered because Goyer never gives the villain any sort of presence. The running-time is padded out with a lot of empty scenes that are exemplary of the old criticism \"all style, no substance.\"Trinity is also a tonal 180 for the series. These movies have always been a bit cheesy, but this one is just ridiculous to the point of stupidity. The interactions between the vampire cronies are laughable in the worst of ways. The stuff with the dogs feels like it's from some tragically comic version of Resident Evil. Why did Goyer add so much silly stuff?Blade: Trinity is a mess. The plot is all over the place, the new characters are weak, the added humor is cringe worthy, and overall it just doesn't feel like Blade. Goyer proved himself unready for the task of both writing and directing at once. Delivering a product that is shoddy in both departments and was an unfitting end to one of the best pre-MCU superhero film series."
    },
    {
      "rating": "0",
      "text": "Cheaply made, Poorly casted. Blade Trinity is the disappointing final entry of a series that was very enjoyable up until this point. It lacks the charm that made the two previous films so good. Rather than being dark and gritty, It tries too hard to be comedic and cheesy."
    },
    {
      "rating": "5",
      "text": "Snypes is good as always (both his performance as Blade and his fighting moves stand out) but the secondary characters are annoying and make all the scenes less entertaining. Moreover, the vampires still act like idiots.\rargonautis.eu"
    },
    {
      "rating": "5",
      "text": "Focused way to much on the background characters and not on blade creating a huge mess with the story."
    },
    {
      "rating": "3",
      "text": "If you enjoyed the first two Blades then please do not spoil it watching this. It is so much a cash in on the series it just spoils the early work. Its a shame as there is a Blade movie in here but its just so terribly packaged. Having watched Ryan Reynolds in several other films since this HE CAN ACT and CAN PUT IN A PERFORMANCE. In Blade they just have him as Van Wilder. Trying endlessly to make a funny one liner which really does not go with the film. The supporting cast in general are poor and really do not add to the story line.\rThe action is very much the same as the other films but I just could not see past the weak plot and really terrible writing of the plot. Terrible end to what could have been a decent trilogy.\rStop here before you kill of the series completely"
    },
    {
      "rating": "2",
      "text": "After not even one hour I could watch this movie anymore: so many embarrassing scenes with ultra cool characters, who are just kids. And of course women are fighting men, yes sure. and of course the story has many logical holes."
    },
    {
      "rating": "4",
      "text": "Blade Trinity is pretty bad.  I never understood why most of the characters die within minutes of being given a back story, or why half the action sequences take place during the day or why Dracula supposedly is the strongest vampire on earth after Blade has fought both the original vampires, mutant vampires and vampire gods."
    },
    {
      "rating": "6",
      "text": "When Blade and HIM was on screen it was gold Blade moments. Sadly the movie was filled up with lesser vamps and lesser side kicks to much of the damn time. A missed opportunity for sure."
    },
    {
      "rating": "3",
      "text": "Blade Trinity.... It's a piece of **** that blew any chance of seeing Blade in theaters in the short to medium term."
    },
    {
      "rating": "2",
      "text": "This is the last film in the \"Blade\" trilogy, planned and designed for action-hungry young adults, with more choreographed fights than ballet and litres of fake blood that splash everywhere. It is also, for me, the weakest of the three films, since it uses the same recipe, already repeated and reused, without adding anything really new, which made the film become as monotonous as seeing someone playing a video-game.The plot is even simpler and more superficial than the ones we have seen so far, and it reminded those films where heroes or villains face each other for any idiotic reason, such as \"Alien vs. Predator\" or \"Freddy vs. Jason\"... what we have here is basically a \"Blade vs. Dracula\", given that what this film does is, precisely, to wake the ancient vampire from his eternal sleep and bring him to the ring where he will face Blade. Of course, the fate of the human race depends exclusively on the outcome of this confrontation, but that is something we are already used to. Sounds stupid enough?If the previous films deserved some brilliance for the quality and commitment of the cast, for the emotion of the novelty and CGI effects, or even the atmosphere created and transmitted to the public, this film leaves all that to be lost. It simply unfolds lazily before our eyes, with fight after fight, death after death, blood and more blood, without it really grab our attention.The cast also leaves a lot to be desired. Wesley Snipes brings us a warmer Blade, apparently more sympathetic and emotive, different from the almost indestructible bad ass from previous films. Kris Kristofferson remains tough but finally dies and leaves us a beautiful but equally tough daughter, played by Jessica Biel. However, she wasn't particularly used and appears simply for appearing. Beside her, the boring Ryan Reynolds, who tries to be funny but can only be an idiot. Dominic Purcell gave life to the millennial Dracula and gives us a good interpretation, creating a character who, despite being a perverse and bloodthirsty villain, maintains that style of villain with code of honour and old-fashioned mentality that is rare to find in this kind of film. Worst of all was the participation of Parker Posey who, besides being old for the role, also sounds absolutely cliché.Technically, the bet continues on the action scenes and CGI. We have fights and deaths for all tastes, choreographed and slow-motion combat, cliché sentences, effects and litres and litres of blood like a video-game. Everything, of course, to the sound of that indispensable deafening techno beat, always present in this trilogy. The sets and costumes are good, and in addition to Blade's great costume, we also have those from the vampire combat teams and Dracula himself, who has very little millenary and seems to be just another vampire warrior of our time."
    },
    {
      "rating": "4",
      "text": "I love the first two Blade movie, and my god does this movie is just a disaster, the best thing that happen in Blade: Trinity is the final battle scene in the end of the film which i think was pretty good, and probably some couple of ok scene, but the rest of the film from the beginning till almost the end was mostly just awful, it's horribly perform, it's terribly written, the side character was awful, and the villain of this movie is probably the worst villain i've ever seen in comic book movie, Blade: Trinity is disappointing, it's just tremendously bad."
    },
    {
      "rating": "3",
      "text": "\"Blade: Trinity\" is so terrible, its a comedy (thanks to Ryan Reynolds)."
    },
    {
      "rating": "3",
      "text": "The characters are not bad-ass, just simply bad: annoying, two-dimensional, cliche. Ryan Reynolds and Parker Posey were atrocious in their roles. Dominic Purcell lacked the charisma of being Dracula. The whole story was uninteresting, and lacked imagination. The action remained, but was overused with too much hand-to-hand combat scenes. Overall bad."
    },
    {
      "rating": "1",
      "text": "Blade: Trinity: 1 out of 10: Press reports at the time of Blade: Trinity's release claimed that star Wesley Snipes went off the deep end and tried to kill the director David S. Goyer. Lord knows he could have gotten away with it. Show the jury this movie and let the acquittals fly.\r After two better than we deserved films the third Blade is a mess. For one thing the casting director is insane. The good guys consist of Snipes, Gabby Hayes (Kris Kristofferson), Elektra (Jessica Biel), Van Wilder (Ryan Reynolds), a retarded guy, a blind woman and Newt from Aliens.\r The good guys have a \"club\" called the Nightstalkers. (What no Darren McGavin). Biel fights with an overtly plugged iPod playing horrible techno. (I would think being able to hear would be important in hand-to-hand combat) Reynolds's character spouts off endless one liners (most of them remarkably lame) and is saddled with the name Hannibal King. (Also needless to say remarkably lame) and fights with a light saber bow. (Please see above).\r Speaking of lame we have the bad guys. We have wrestler triple H (who cannot act), Parker Posey (who cannot speak with the fangs in her mouth) and best of all Dracula (Who calls himself Drake. Thinks he is in a Highlander movie. He is also a pacifist piece of Euro trash that looks like he fell of a Harlequin romance book cover. And is easily the least convincing screen Dracula I have ever scene (I'm including both George Hamilton and Mel Brooks in this equation)).\r The script is awful (even if you remove Reynolds's one-liners), the film was edited in a Cuisinart, the continuity was done by the blind girl, and the plot consists of bad guys finding good guys headquarters, then good guys finding bad guys headquarters.\r If your still not convinced a contribution to Mr. Snipes potential legal defense fund is in order let me remind you. Parker Posey is the head vampire and has a climatic battle with Van Wilder. You can make the check out to cash."
    },
    {
      "rating": "3",
      "text": "There seems to be nothing interesting about this second sequel whatsoever. The plot is aimless, the action tends to feel tedious, and the film appears to focus more heavily on its comedy than its action."
    },
    {
      "rating": "5",
      "text": "Obviously Trinity is the weakest of the 3, Wesley Snipes returns as Blade and is awesome but it introduces too many pointless side characters, a jumbled, Goyer led plot and an underwhelming villian to top off a disappointing movie"
    },
    {
      "rating": "3",
      "text": "If you're going to make a vampire movie, here's a piece of advice: leave Dracula out of it. The character is so iconic that virtually no cinematic interpretation will do him justice. Unfortunately, that's not something that writer/director David S. Goyer recognizes. So, in order to give vampire-hunter Blade a \"worthy\" adversary for his third outing, Goyer elects to pit the hybrid superhero against his old comic-book nemesis (on the written page, Blade first debuted in \"Tomb of Dracula\"), with unfortunate results. Take away the film's attitude, and you're left with Son of Van Helsing.\r Blade: Trinity is more of the same. Blade (Wesley Snipes) sees vampires. Blade kills vampires. Blade reloads and goes back for more. The only ones he has any real trouble with are human beings. For some inexplicable reason, they're more difficult to dispatch than the undead. The storyline makes less sense than the ones embraced by Blade and Blade II, if that's possible. This time, Blade is given two sidekicks: the irritating Hannibal King (Ryan Reynolds), who has a wisecrack for every occasion, and the sexy Abigail Whistler (Jessica Biel), who is the daughter of Blade's old friend, Whistler (Kris Kristofferson). These three must go up against the king of vampires, Dracula (Dominic Purcell), who has been awakened by the toothy Danica Talos (Parker Posey) to implement the vampires' \"final solution.\"\r Those who are looking for variations on a theme won't find any here. Blade: Trinity is a carbon copy of its predecessors. It's all kick-ass attitude and style without any substance to back it up. Yet, where the first two Blades satisfied on a visceral level, this one doesn't. That probably has something to do with the portrayal of Dracula, who, in human form, looks more like a body builder than a vampire. When he reverts to this \"true\" likeness, he comes across like a rip-off of the alien from Predator. And, since all really bad guys like nicknames, he goes by the moniker of \"Drake.\" I guess \"Vlad\" doesn't work these days.\r Although the vampires in Blade: Trinity aren't scary, at least they are not emasculated by the romantic notions applied by writers such as Ann Rice. These are cold-blooded killers, which allows Blade and his cohorts to dispatch them without blinking an eye. The film features dozens of vampire destructions, many of which occur during the film's frantic, frenzied opening battle, which is big on loud music, quick cuts, and violence. Much of the movie is like that, and what starts out as energetic quickly becomes tiresome, then boring. Besides, we have seen this before - twice, to be exact. (Although, to be fair, Biel is a lot hotter than Snipes when high-kicking her way through a hoard of fanged bad-guys - at least from this reviewer's perspective.)\r The plot is dumb and dumber, so the less said about it, the better. It's really just a clothesline upon which to hang the fight scenes, but that doesn't keep it from dangerously resembling the lame storyline of Van Helsing. (And no movie wants to be compared on any level to that particular blockbuster dud.) This is Goyer's directing debut (although he had scribed all three movies), and he steals liberally from previous directors Stephen Norrington and Guillermo Del Toro (who was offered the job on this one, but decided to make Hellboy instead). The music is just as loud as in the previous films, and the gags and one-liners are more often lame than funny. (Although I chuckled at the fate of the dogs.)\r The movie's bedrock is Snipes, who takes Blade to a new level of coolness. Radiating frost, Snipes struts his way through the movie, never allowing the viewer's attention to veer from him. Jessica Biel, who has the toughness and sex-appeal but not quite the same presence, holds her own, but the fatuous Ryan Reynolds (Van Wilder himself) falls on his face. As Dracula, Dominic Purcell is a putz, and represents one of the worst villain casting decisions of the year. Kris Kristofferson is as stiff as the walking dead - thankfully, his screen time is limited. Then there's Parker Posey, who plays her role as a lady vampire with all the campy subtlety of a drag queen.\r The target audience for Blade: Trinity is the same as it was for the previous two incarnations, and it will probably be met by pretty much the same reaction in all corners. As a character, Blade is a terrific property, and the films have enhanced the creation of Marvel Comics legends Marv Wolfman & Gene Colan (both of whom are \"honored\" by an in-joke in this film, when an issue of the old \"Tomb of Dracula\" gets screen time). Snipes has made Blade his perfect cinematic alter-ego. Now if only someone could give the character a story worth telling, the pieces might all be in place for a great action/horror thriller. But, although the saying goes \"third time's a charm,\" that's not the case here."
    },
    {
      "rating": "7",
      "text": "I mean it is messy as a movie, but it is so entertaining that I can't give it a mixed or negative rating."
    },
    {
      "rating": "9",
      "text": "Very good movie, lots of great cameras and angles, the chics are hot, I really liked it a lot! I don't recommend it to people who don't like vampire tales, they won't like it, maybe that's why it got such bad reviews."
    },
    {
      "rating": "7",
      "text": "The best movie in the franchise with a stellar cast that shines. Parker Posey does a superb job as one of the main villains. Jessica Biel is great for the part. The movie works at the same level of Thor Ragnarok"
    },
    {
      "rating": "7",
      "text": "The action sequences were well made,the acting wasn't bad at all and the cinematography was really good at times.But, unfortunately, the new characters were boring and uninteresting,there was some plot holes here, the movie was rushed to the conclusion and it was not as entertaining/violent/bloody as the other Blade movies."
    },
    {
      "rating": "0",
      "text": "This blade movie is just terrible. It is completely spitting in the face of the other two blade movies. It is a total disgrace. I thought it was gonna be awesome but I was freaking ticked that I wasted my time and money on it. They took a great series and completely sabotaged it with this crappy installment."
    },
    {
      "rating": "7",
      "text": "Third part of the series - and in my opinion, the weakest. Not that the movie is bad, really, but it lacks a lot, repeating the earlier two parts and failing to make you laugh. The jokes are just too weak, and done for the sake of doing them. The style is relaxed - even too much so. The character of Hannibal King is a complete joke, Abigail Whistler has no real depth, and Blade is a shadow of himself. Only one who is given a chance to be something is Drake, but given the general structure of the movie, that really doesn't traslate too well. Altogether, the characters are just thrown in, and whenever something is explained, it is done like tutoring an ignorant child; like a lesson. There are more than a few slashy remarks, but they seem almost forced and underlined while repeated, losing their effect completely and becoming almost annoying."
    },
    {
      "rating": "5",
      "text": "Oh how this brilliant series has fallen. Besides the fact that Trinity is just too sloppy and unpolished from a visual standpoint, the story lacks any decent sense of direction or purpose. However, the Mortal Kombat style fatality comes from the mere fact that Dracula is just the lamest excuse for a villain in the history of vamp-dom."
    },
    {
      "rating": "7",
      "text": "Blade: Trinity. Long live the most important vampire! The third film holds the level and remains as dynamic and aggressive as ever. But there are weaknesses, this is what happens with Whistler and the second main antagonist of the film who is presented as the coolest vampire, but in fact he is the level of Deacon Frost."
    },
    {
      "rating": "4",
      "text": "Summary: Wesley Snipes returns as the iconic vampire hunter Blade in this third installment of the hit film series. (New Line Cinema)"
    },
    {
      "rating": "6",
      "text": "Went from Great (Blade) to good (Blade II) to \"I've been Goyerized\". Goyer = Great writer, bad director. Movie seemed fake, forced situations and the unlikely scenarios that happened in all Blade movies were boarding on impossible to buy into for this movie. Dang. I love Blade, my favorite triology for some reason, but this makes me very uneasy about the 4th one (hopefully there is one). Goyer, Please go back to writing. You are brilliant writer, let somone else direct."
    },
    {
      "rating": "3",
      "text": "This was just a disapointment in every way,the concept of blade against dracula was great but the script sucked,the action sucked the story sucked, worst blade of the trilogy."
    },
    {
      "rating": "7",
      "text": "Let's face it: these are not, nor are they intended to be cinematic masterpieces. These are just mindless summer action flicks intended for a few hour's entertainment and then forgotten. With THAT in mind, in my opinion this is one series that actually IMPROVES with each sequel. Really, they're just re-making the same movie over and over, but they distill the plot down to its basics and focus on the action more and more each time. The first movie was, frankly, a shadow of what the series has become. The first movie was just to establish a universe for the other movies to exist in. The second movie jumped right into the action, discarding any attempt at character development in exchange for more violence. And THIS movie is just a further distillation of the formula used in the Blade II. All three films are extremely cheesy, with badly written dialogue and all, but bear in mind we're talking about a flick based on a COMIC BOOK, and not a particularly popular one at that. So considering all of the above, this was a very entertaining movie. I thoroughly enjoyed this hour and a half of pure pulp, because I had ABSOLUTELY NO EXPECTATIONS for it. I learned very early in life that disappointment is ALWAYS preceded by expectation, so I expect nothing from anything, rendering me essentially incapable of disappointment. And so this was a pleasant surprise, if not at all worth a purchase, even from the bargain bin, but a good weekend rental nontheless."
    },
    {
      "rating": "3",
      "text": "The first one, I liked. The second one.... decent, this one, TRASH. Unless, you're a VERY big blade fan, and have the DVD's, and the games, then watch this, if not, stay away, you're much better without it."
    },
    {
      "rating": "8",
      "text": "All 3 Blade movies are awesome in my opinion. This one is my favorite out of the series. It introduced at the time a different type and kind of vampire. This is movie is freakin' awesome."
    },
    {
      "rating": "6",
      "text": "The narrative and character development in the last installment of the Blade Trilogy are by far the poorest. This Blade movie veered away from the mystique of the comic book hero and leaned more in the direction of an A-team of misfits or vampire hunters. By focusing on more colourful personalities rather than a darker mood, the picture was really damaged by bringing in this big league ensemble, which is truly big league. The arch-villain Dracula, who didn't look all strong and was inadequately acted by Dominic Purcell, was maybe the worst letdown. The brutality and fighting styles also looked to have a harsher edge, and the movie might have easily been PG-13 if cut differently."
    }
  ],
  "recommendations": [
    "underworld",
    "van_helsing",
    "blade",
    "predator_2",
    "terminator_salvation",
    "predators",
    "superman_iii",
    "immortals",
    "fantastic_four_rise_of_the_silver_surfer",
    "bloodshot",
    "resident_evil_apocalypse",
    "xxx_return_of_xander_cage",
    "kong_skull_island",
    "blade_ii",
    "priest",
    "terminator_3_rise_of_the_machines",
    "pacific_rim_uprising",
    "transformers_the_last_knight",
    "elektra",
    "x_men_origins_wolverine",
    "iron_man_2",
    "the_predator",
    "rampage",
    "ghost_rider_spirit_of_vengeance",
    "mechanic_resurrection"
  ]
}