{
  "id": 2291,
  "title": "Blade Runner",
  "starring": [
    "Harrison Ford",
    "Rutger Hauer"
  ],
  "runtime": 118,
  "genre": [
    "Science Fiction",
    "Drama",
    "Thriller"
  ],
  "description": "In the smog-choked dystopian Los Angeles of 2019, blade runner Rick Deckard is called out of retirement to terminate a quartet of replicants who have escaped to Earth seeking their creator for a way to extend their short life spans.",
  "releaseYear": "1982",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/63N9uy8nd9j7Eog2axPQ8lbr3Wj.jpg",
  "categories": {
    "plot": 8.717391304347826,
    "acting": 8.964285714285714,
    "ending": 8.5625,
    "soundtrack": 9.333333333333334,
    "cinematography": 7.75,
    "familyFriendly": 3.0,
    "funny": 5.0,
    "action": 8.2
  },
  "reviews": [
    {
      "rating": "10",
      "text": "When I first watched this movie, I didn't really pay attention. Which isn't the films fault, given it is a film based highly on the narrative, themes and relationships within the film. Which is respectively hard to follow for an incredibly tired and not so-sober individual. It wasn't until a year or so later, I saw the film was on tv and decided to watch it again. Given I hardly remembered what even happened in it. Let's just say after paying attention to the detail in this film, I was blown-back by it's style and atmosphere. Scott did very well in creating a realistic and believable gritty future; while also being able to capture how such a world alienates and disillusions it's residents. It's a beautiful social commentary and deals with many philosophical ideas, while never telling you any definite answers to them. It's definitely one of the best narrative uses of a sci-fi setting, and deserves all of its recognition and praise."
    },
    {
      "rating": "8",
      "text": "Blade Runner is a difficult movie to review as its a landmark science fiction masterpiece that has gone on to influence much of science fiction in movies and video games but on the other hand I find it boring as hell. Studying this movie for culture purposes is fascinating, watching for entertainment value is another thing."
    },
    {
      "rating": "10",
      "text": "What interested me most, whether this Christian Science Monitor David Sterritt feel embarrassed after his review of (master-piece) Blade Runner ?!"
    },
    {
      "rating": "10",
      "text": "Best movie ever. Matthew H is either borderline retarded or too stupid to know any different."
    },
    {
      "rating": "9",
      "text": "Really into this film when I was younger and, although I was still impressed seeing it again recently, I can see that it has its imperfections. There's a lot of the story which is implausible, and, dare I say it, quite dull. Great performances make this worth watching (particularly the world weary cop Harrison Ford doing his best Philip Marlow impression) and of course Rutger Hauer. For me the real treat of this film is the uncompromising dystopian future depicted by Ridley Scott, with great special effects by Douglas Trumbull and of course a brilliant score by Vangelis. Bears little resemblance to the book by Philip K Dick; the film is essentially a 1940's film noir detective story set in the future."
    },
    {
      "rating": "8",
      "text": "A compelling, dreamlike exploration of what it really means to be human... Does the key lie in our memories? Experiences? Capacity for mercy and love? Even characters with small roles are well-developed and memorable, and the grungy futuristic setting conveys a distinctive mood that complements character development and action rather than distracting from it. The pacing allows plenty of time for reflection (and to soak up the haunting soundtrack) without dragging. All in all, a transcendent viewing experience."
    },
    {
      "rating": "7",
      "text": "A beautiful film that will stand the test of time. It is a must see for anyone who enjoys movies."
    },
    {
      "rating": "10",
      "text": "I gave 10 because of the original movie that I've seen over 25 times, the director's cut is removing all the mood of the original and slowed down the pace. With the voice over it was so mutch better."
    },
    {
      "rating": "10",
      "text": "God is in the details. Every time I see this movie, there is a small visual detail which highlights the blurred line between natural and manufactured humans. Although I like the original better than the Director's Cut, it is still Blade Runner."
    },
    {
      "rating": "10",
      "text": "Let me say that I absolutely LOVE this film.  It has been my absolute favorite film since it released When I was in college.  I've watched it several times since then and always see or learn something new.  The fact that Bladerunner 2 will happen sometime soon and Ridley is directing it should only make me have a new fondness for my all time favorite film!"
    },
    {
      "rating": "9",
      "text": "It's the big ideas behind its iconic visuals that really makes Blade Runner such a great science-fiction film. Covering wide-ranging themes including what it means to be human, free will, future off-world colonisation, the meaning of dreams and the nature of reality, it's certainly a cerebral viewing experience. Ridley Scott is a master of genre-crossing - Alien was a hybrid of science-fiction and several sub-genres of horror, and Blade Runner is a science-fiction-noir. You've got the iconography and narrative structure of dark detective fiction encased in a radical, industrialised future city that appears as a strangely organic fusion of Eastern and Western culture. Though he reportedly had a bad time shooting the film, Harrison Ford gives one of the standout performances of his career as Rick Deckard, a weary hard-boiled detective who looks as though he's stepped straight out of a pulp detective novel. Daryl Hannah's impish and sinister take on a female fugitive android impresses as well, as does Edward James Olmos's mysterious mostly-silent detective Gaff - he doesn't say much, but his actions speak louder than words ever could. However, it's Rutger Hauer who really steals the show as Roy, the unhinged leader of the renegade \"replicants\" who Deckard is hunting, his performance a pitch-perfect deliverance of creepy-cool, and he gives one of the best farewell monologues on film (Haur responsible for choosing the most affecting parts of a speech written by David Webb Peoples) where Roy professes his humanity in moving, poetic verse as rain cascades down his grieving face. Vangellis' eerie, layered electronic score also helps no end to add further richness and emotion to the film. I'm not quite sure why there's still a debate about the implications of the film's final scene - it's pretty obvious what Scott intended. Blade Runner is undeniably one of the most influential of science-fiction films, and is an interesting modern take on a film noir to boot. I can't really say that I think Blade Runner is better that Scott's previous foray into sci-fi - yes there's another shadowy, amoral super-corporation pulling strings behind the scenes, but beyond that, Alien is just too different to compare. I sincerely hope Scott stops plundering his back-catalogue of successes at some point and moves onto something new, what with Prometheus being such a mixed bag of a film. There's a Prometheus sequel and another film in the Blade Runner universe in the works, which is more than a little worrying, and makes me wonder whether we should forcibly remove Ridley Scott's science-fiction crown before he really embarrasses himself."
    },
    {
      "rating": "8",
      "text": "A very gritty, interesting, and entertaining sci-fi film.  Harrison Ford gives a really good performance as Declared and my favorite part of the film is the gritty dirty feel of the movie."
    },
    {
      "rating": "9",
      "text": "First I must state that I have only seen this version of the film from 2007, so I have no other versions to compare it to. This movie is brilliant and one of the best sci-fi films out there. But it also embodies the film noir genre really well too. The music is very good and with every scene it fits perfectly. The visuals in this movie works so well and Douglas Trumball's special effects are brilliant, the city looks beautiful. I also like the look of this future and it fits within the story perfectly. Each and every one of the characters is complex and it's interesting to watch. Rutger Hauer gives such an amazing performance, his speech in the climax is just as beautiful as some of the imagery from the film, and is also one of my favourite movie scenes.  This movie marks a great moment in cinema, one of the best out there."
    },
    {
      "rating": "10",
      "text": "Blade Runner is a film of emotion. It hits you in your core and you can never forget it. What makes us human? Many films try to ask and answer this question. Blade Runner is the only film to actually do it. Harrison Ford, Sean Young and Rutger Hauer give career best performances. Vangelis did the soundtrack and it is one of the best ever."
    },
    {
      "rating": "10",
      "text": "Beautifully shot neon noir journey inside a dystopic alternate 2019 Los Angeles wherein interplanetary colonisation is a reality made possible by the work of an army of synthetic humans aka 'replicants'. Harrison Ford stars as the titular Blade runner tasked with 'retiring' a group of rogue androids determined to extend their limited 3 year lifespans. The 2007 final cut edit is superbly paced and pieced together sans the awful voice over narration that haunted the theatrical release. The screenplay is rich and weird, with many enigmatic characters played by the extremely talented cast. 1982's Blade runner holds up well today and has been well complimented with a tasteful sequel. I remember I first watched the directors cut on channel 4 back in the nineties and it blew my mind again and again requiring multiple watches for my young mind to appreciate the nuances this film encapsulates. Stands alongside Alien as Ridley Scott's best work and is seminal to the cyberpunk genre."
    },
    {
      "rating": "8",
      "text": "In the nearly 25 years since its original release, Blade Runner has become one of the most discussed, debated, and influential science fiction movies. These days, it's almost impossible to find a gritty science fiction motion picture that doesn't owe at least a small debt to Blade Runner's visual style. The movie is also one of the first major motion pictures to have been given a red carpet \"Director's Edition.\" In cooperation with Warner Brothers, Ridley Scott re-tooled the movie, making minor changes and eliminating the much-maligned voiceover. In late 1992, the new version was released in a limited number of theaters and was universally acclaimed as the \"definitive version\" by fans worldwide.\r Considering how respected Blade Runner is in the 2000s, it's difficult to remember that it was widely viewed as a failure during its initial release. Reviews, for the most part, were negative. (This isn't surprising. Cutting-edge science fiction is often viewed negatively at first then re-evaluated later. 2001 is a classic example.) The box office was tepid, and the film failed to make back its production costs. Viewers, expecting something more popcorn-oriented from a Harrison Ford science fiction movie, were disappointed by the dark, serious nature of the project. The cast and crew, who had nearly rebelled against the director during production, were in some cases unenthusiastic in their support of the finished product.\r The central ethical question posed by Blade Runner has been popular in science fiction since it’s the inception of the genre: what is life? It's the same issue pondered by Mary Shelly in Frankenstein, translated into the far future. Man is no longer building misshapen creatures out of disused body parts. Now the creatures are nearly perfect replicas of human beings. They live, eat, drink, make love, think, feel, and perish. But do they have souls? Is Deckard merely consigning scrap to the slag heap or is he killing? That question has worn on him. According to Bryant, he's the best there ever was, but that was in the past. Now, he's burned out.\r Blade Runner is as much of a morality play as it is an action/adventure story. The question of whether or not the replicants are \"alive\" echoes themes from countless novels, movies, and television series. It lies at the heart of Issac Asimov's I, Robot (both the book and the movie). It's central to the premise of the current TV series Battlestar Galactica (which borrows Blade Runner's \"skinjob\" slang to describe human-looking androids). Blade Runner didn't invent the issue but it arguably did more to popularize it than any other post-Asimov source.\r Those expecting to see Harrison Ford in full Han Solo/Indiana Jones action hero mode are primed for disappointment. Deckard is still capable of getting the job done, but he's not gung-ho about it. He's a reluctant cop, and his reluctance becomes more apparent as the movie unfolds. He's also not the blade runner he used to be. He does the job, but gets the hell kicked out of him on several occasions and, without Rachael's timely intervention when he confronts Leon, he wouldn't be around to chase Pris and Roy.\r The final confrontation between Deckard and Roy is atypical of an action movie. The formula requires that these two engage in a long, hard one-on-one struggle before Deckard vanquishes Roy. That's not what happens. The fight occurs, but Deckard is the loser. Roy saves him, even though he has every reason to let Deckard die. The two end up spending Roy's last hours together, waiting for his four-year life to end. Why does Roy save Deckard? Perhaps, recognizing that the end is at hand, Roy doesn't want to die alone. His companions are no more; Deckard is the only one who will stay with him. This action, more than any other, argues for the \"humanity\" of the replicants. What could be more human than to not want to die alone?\r Blade Runner is not flawless. There is an irritating continuity error pertaining to the number of replicants who made it to Earth. (The original number is six, with one killed. However, Deckard is given only four profiles to track down.) The love story with Rachael doesn't work, in large part because both Ford and Sean Young underplay their roles to such extremes that its impossible to believe either could feel anything for the other. The romance is necessary to the story and it emphasizes the blurred line between men and replicants but it fails on an emotional level.\r Blade Runner is a rare science fiction movie so full of material that pages can be written about it without scratching the surface. A review like this can provide little more than an overview. A detailed exploration of the movie, its style, and its mysteries requires dedication that only someone immersed in Blade Runner lore can provide."
    },
    {
      "rating": "10",
      "text": "Blade Runner (The Final Cut specifically) is a masterpiece. It is widely considered to be the greatest science fiction film of all time, and I can see why. Even though I am watching it today, I can still see how revolutionary it was back when it first released. While its depiction of the year 2019 is a bit too ambitious, it still displays an amazing world and aesthetic for the sci-fi genre. Harrison Ford as Deckard is great. But its also the direction, the writing, the other performances, the production design, and the unique music that set Blade Runner apart from any other movie. It truly is a one of a kind film, one that will be hard to do justice in its upcoming sequel."
    },
    {
      "rating": "10",
      "text": "Quand je pense à Blade Runner, c'est surtout à la version cinéma de 1982 avec la voix off et la \"bonne\" fin, pas aux tentatives successives de Monsieur Ridley Scott de saborder son oeuvre... La vision du réalisateur est pour une fois (mais ce n'est pas si rare dans le monde du cinéma) totalement à côté de la plaque : les screen tests avaient raison et le producteur avait raison, si, si.C'est sans doute le meilleur film d'Harrison Ford, le meilleur film de Ridley Scott (à l'insu de son ignorance) et la meilleure adaptation d'un roman de Philip K. Dick au grand écran : même si le film reste assez éloigné du chef-d'oeuvre de Dick, il a su en garder la trame principale et une certaine atmosphère.Blade Runner (version 1982) n'a donc pas vieilli : il est resté magnifique et fascinant, et la prestation de Rutger Hauer, en état de grâce, n'y est pas étrangère, de même que la (sublime) musique de Vangelis."
    },
    {
      "rating": "9",
      "text": "This was a great film, but it did have some flaws.  The acting is pretty great and the action scenes are done very well but the story was a little boring at some times.  The visuals of the film were amazing and I believe that this is one of the coolest universes!  Overall, I would give it a 8.5."
    },
    {
      "rating": "9",
      "text": "I'm talking about Blade Runner: Director's Cut (1991). Blade Runner is an one-of-a-kind sci-fi film noir masterpiece. The ambiance of Vangelis' score and production design are just out of this world. Phenomenal work in every way. Directing by Ridley Scott is at his finest to date, the rainy atmosphere just feet perfectly to this story driven by agent Deckard wonderfully portrayed with a top notch Harrison Ford and Rutger Hauer is coldest as possible as we even imagine this is really a replicant for some moments. All the visual effects are spectacular and still very effective as the today standard. The story is loosely based on the Philip K Dick novel but have is own approach that perfectly feet to Ridley Scott own vision of the story. Every sequences are unforgettable and the final is just perfect! Near to reach the prefect 10 rating. The Final Cut of the film have some sequences and color treatments altered so this deacrese the rate from 9 to 8 in my opinion. And then the theatrical version, the international version and the now official workprint version are all far from what the final versions are. Complete opposite of Star Wars original saga by the way. This is also probably the first serious cyberpunk movie ever made. An instant classic that absolutely deserve to be seen."
    },
    {
      "rating": "8",
      "text": "I had a difficult time getting into the story of the movie. It's rather simple yet also complex, all within this cyberpunk world that just fumes every sense of your body. I think watching it a second or even third time would greatly enhance one's perception of it, I didn't come around to do it, but I will do it eventually. A great movie with great visuals and themes that were way ahead of its time."
    },
    {
      "rating": "9",
      "text": "One of the best apocalyptic action movies that have been shot. Scott, at his second features, shows great directing abilities providing some beautiful shots that leave you stunned at times."
    },
    {
      "rating": "10",
      "text": "This is probably one of my favorite movies of all time and I think it will continue to be for as long as I'm around.  The world that Scott created in this film reeks of depth, style, and an ambiance that many films can only struggle to grasp, which to me is very impressive considering that this was done before the special effects revolution of the 90's and 2000's.  The story revolves around a retired blade-runner; a cop that specializes in hunting rogue replicants (synthetic humans), named Deckard (Harrison Ford), who is brought out of retirement to hunt down a group of replicants who have arrived on Earth.  The movie does an excellent job of casting the characters of the movie in many shades of grey, with no one character being truly good or evil, and also poses some interesting questions as to the nature of humanity and what defines us.  The films visuals are inspired; the term \"film noir\" is very fitting for it, but may seem slower paced to those used to more modern \"action\" films with their rapid fire cuts.  Where many films seem to have action just for the sake of it (cough, Michael cough Bay, cough), Scott's action scenes have more of a purpose to further the narrative.  It takes some getting used to, but the slower pace fits the concept better, and only adds more to the feeling of loss, stagnation, and oppression of living in that future society.  The music is very ambient, with a synth sound to it, and although I don't usually like that kind of thing, it does compliment the film well and adds to the overall mood.  Ford, Olmos (who only has a small role, but somehow makes the most of it), Hauer, Young, and Hannah all give strong performances, and although most of them play their roles somewhat subdued (which fits the future world they live in well), it's ironic (and most likely on purpose) that the most passionate and human-like of all the characters are the replicants themselves.  It's an interesting notion that the humans are portrayed as much more cynical and full of despondency, while the shorter life-spanned replicants seem to embody a passion for life that they seem to have lost.  This movie is deep, but not for everyone.  People who have short attention spans or no interest in entertaining ideas about humanity and our future should probably stay away.  Those who love a story about a man struggling to find his humanity in the desolate landscape of the future, cool visuals, or just sci-fi in general owe it to themselves to see the movie that influenced countless movies, TV series, books, music, and video games, and will continue to do so for a long time."
    },
    {
      "rating": "10",
      "text": "Blade Runner is one of the most visually spectacular films of all time. Ridley Scott is an undisputed master of the visual craft and Blade Runner is his masterwork. Other elements of the movie work just as well; the atmosphere, special effects and music are all absolutely perfect. There are also so many metaphors and subtexts buried in the movie that it's possible to discover something new every time you watch. Blade Runner is an unbelievably fantastic film that is rightfully hailed as an all time classic."
    },
    {
      "rating": "10",
      "text": "Before watching Blade Runner, I never understood why this film had such a massive influence on the cyberpunk genre. After watching it, I could only say that this film was a masterpiece. Great special effects, great acting and a great soundtrack, among other great things makes this film stand out in the science fiction category of films."
    },
    {
      "rating": "10",
      "text": "Blade Runner begins with a great crescendo by Vangelis and a futuristic landscape of L.A. The year is 2019. The story is based on Philip K. Dick's novel ''Do Androids Dream of Electric Sheep?'' But the final screenplay by Hampton Fancher and David Webb Peoples gave the whole story its dark, slow, hypnotically and unique emotional feeling.\r The iconic futurist illustrator and designer Syd Mead created with his art the blueprint for all visuals. And the special effects by Douglas Trumbull, Richard Yuricich and David Dryer are just superb for its time. Remember the police car landing on the rooftops of L.A. or balcony scene with the cruising police car.\r I watched this movie on silver-screen in 1982 and since then every decade following. Until today every shot in Blade Runner is just intricately detailed as anything a science-fiction film has yet envisioned and has not yet been exceeded.\r Blade Runner is a masterpiece of its own and one of the greatest science fiction films ever made."
    },
    {
      "rating": "9",
      "text": "Love this movie. A true sci-fi picture. Explores a lot of great philosophical issues and makes cool social commentary without feeling overbearing. Harrison Ford is great in it as is Rutger Hauer (the star of the show imo). It's just a great film. If you haven't seen it, regardless of your age, do so. It has brilliant set design and art direction. It's a visual feast as well as a disturbing picture into the human condition and morality."
    },
    {
      "rating": "10",
      "text": "The Greatest sci-fi film ever created alongside Kubrick's 2001:A Space Odyssey. Blade Runner is NOT a film for everybody. It's a slow burn narrative, that only connects when you look at the bigger picture. The Final Cut version is my favorite movie of all-time. It's a perfect blend of sci-fi and noir. A dark look at a dystopian future where rain is constantly falling, darkness covers everything, and the streets are overcrowded and dirty. The film is absolutely stunning visually, and features some of the most beautiful cinematography ever put to film. The film contains heavy themes, and symbolism and after each viewing you always find something new. The film balances these themes without feeling pretentious or self-indulgent. Is this a film for everybody? No. But if you love films that make you think this is it."
    },
    {
      "rating": "10",
      "text": "This is an AMAZING movie. It is by far one of my favorite movies of all time, and so far my favorite Ridley Scott movie. Harrison Ford is great as Deckard, and the world envisioned is darkly mesmerizing. Details, no big deal if there are a lot of details. That just means watch the damn movie and pay attention, John Smith. Or if you can't wrap your head around the intricate details then that's not the movie's fault, that's your fault."
    },
    {
      "rating": "10",
      "text": "Beautifully shot, spectacular production value, shoddy acting in places great script, faithful but not a slave to the book its based. Incredible example of science fiction at its absolute best"
    },
    {
      "rating": "10",
      "text": "Planet Noir\r I hereby declare Blade Runner the best sci-fi movie of all time. Arguments? No? Okay. So long. Please upvote the guest book on your way out.\r WAIT! There's more. At the risk of whistling conspiracies and setting off inappropriate vibrations in your slacks, you see, this Ridley K. Dick concoction is going on right now. While we're all transfixed by the endlessly goofy droppings from the web, forever staring down and swiping things on our smarty-pants phones, retweeting selfies of infinitely mirrored  selfies; proliferating at light speed, every aspect of humanity is being replicated, perfected, mechanized, optimized, upgraded, fortified, robofied, Googlized, quantumized, DNA'd and NSA'd and will soon converge to fall upon and supplant us, and Harrison Ford, despite looking trim for his years, will be too old to stop it! And the irony to end all ironies is that we, as the irresponsibly arrogant, over-infested and narcissistic caretakers and consumers, and the colossal defecators of this broken-down, flea-bag of a planet, are entirely fundamentally responsible. No, the irony of all ironies is that a world exclusively dominated by self-correcting technocratic cyborgs with zettabytes of artificial intelligence will be a vast improvement. The androids are saving the planet! AHHH, run for your life! Blade Runner is both an expired cautionary tale and emerging utopian fantasy.\r Oh, you knew this already? Very well. Carry on. Enjoy your self-driving cars and virtual nature tours."
    },
    {
      "rating": "9",
      "text": "\"I've seen things you people wouldn't believe. Attack ships on fire off the shoulder of Orion. I watched C-beams glitter in the dark near the Tannhäuser Gate. All those moments will be lost in time, like tears...in...rain. Time to die.\"\r One of my all time favourite scenes from any movie ever. I've watched the \"Tears in Rain\" monologue about a billion times by now. It's a scene where Rick Deckard (Harrison Ford) leans humanity from someone who isn't human.\r Rutger Hauer, I love you man."
    },
    {
      "rating": "10",
      "text": "One of my top 3 movies of all time (With Drive and Magnolia) Probably Ridley's finest moment in film, with gorgeous special FX that still hold up to this day. Personally 'The Final Cut' is my favourite version, with my fave ending out of all of them. Ford is fantastic as Deckard, portraying a broken man perfectly, and keeping him constantly interesting. All performances are fantastic throughout, even Olmos who hardly speaks a word is brilliant. The FX still look great, and in HD it looks even better. The writing is also top notch, even though its very different to its source material.\rOverall a fantastic Sci-Fi that I can't stop watching, definitely one of the greatest films of all time!"
    },
    {
      "rating": "7",
      "text": "You see, I'm not a cult follower of Ridley Scott's \"Blade Runner\", so I have no **** clue of what you zealots see out there. However, what I see is a movie filled with rich, wonderful visuals accompanied by a very, very weak story (but the ending was good)."
    },
    {
      "rating": "9",
      "text": "One of my favorite movies of all time. There are some moments of corny acting, and a few things happen in the movie that I still don't understand, but overall if you're a fan of sci-fi or noire you will love Blade Runner."
    },
    {
      "rating": "10",
      "text": "A very introspective film with all the action focused on Deckard and the Replicants without the audience really seeing much outside this group. Yes there are hints; the advertising for the off-world colonies, but apart from that it"
    },
    {
      "rating": "10",
      "text": "Bes sci fi ever. A must see to everyone who likes the genre. The lighting is great, the look and fell is beyond belief. It is cinema at its finest. Character creation is beautiful and the well paced action blends perfectly with the psychological aspects of the plot."
    },
    {
      "rating": "9",
      "text": "Way ahead of it's time! This film is one of the hardest pills to swallow, but once you get it down, it sticks with you. It evokes such depth of thought and meditation. Rutger Hauer is excellent in this role though he doesn't have much screen time. Ford is great as ever with a particularly nuanced performance. The effects are stunning to this day. Watch this film and then watch it again a week or two later......let it \"digest\". Like a fine wine, it ages gracefully!"
    },
    {
      "rating": "10",
      "text": "What an amazing movie! this dark neon futuristic Los Angeles, the fight for survival of the replicants, rutger hauer character, i think this movie wasnt a hit in theaters because its was beyond that time, off course it has flaws like every movie but is its pretty unique in its own way, the visuals , actors performances, Vangelis soundtrack is so perfect for this movie!! dont wait a sec get a copy, you wont regret it"
    },
    {
      "rating": "10",
      "text": "It's easy to see why Blade runner is a seminal film in Sci-fi. The special effects almost hold up today. The difference between the theatrical and director's cuts is huge. I'd recommend watching the former before the latter to fully appreciate the difference. Practically every sci-fi film since has tried to copy Blade runner. So you might get some deja vu watching Blade runner, but remember, it came first."
    },
    {
      "rating": "9",
      "text": "In the nearly 25 years since its original release, Blade Runner has become one of the most discussed, debated, and influential science fiction movies. These days, it's almost impossible to find a gritty science fiction motion picture that doesn't owe at least a small debt to Blade Runner's visual style. The movie is also one of the first major motion pictures to have been given a red carpet \"Director's Edition.\" In cooperation with Warner Brothers, Ridley Scott re-tooled the movie, making minor changes and eliminating the much-maligned voiceover. In late 1992, the new version was released in a limited number of theaters and was universally acclaimed as the \"definitive version\" by fans worldwide.\r Considering how respected Blade Runner is in the 2000s, it's difficult to remember that it was widely viewed as a failure during its initial release. Reviews, for the most part, were negative. (This isn't surprising. Cutting-edge science fiction is often viewed negatively at first then re-evaluated later. 2001 is a classic example.) The box office was tepid, and the film failed to make back its production costs. Viewers, expecting something more popcorn-oriented from a Harrison Ford science fiction movie, were disappointed by the dark, serious nature of the project. The cast and crew, who had nearly rebelled against the director during production, were in some cases unenthusiastic in their support of the finished product.\r Blade Runner is as much of a morality play as it is an action/adventure story. The question of whether or not the replicants are \"alive\" echoes themes from countless novels, movies, and television series. It lies at the heart of Issac Asimov's I, Robot (both the book and the movie). It's central to the premise of the current TV series Battlestar Galactica (which borrows Blade Runner's \"skinjob\" slang to describe human-looking androids). Blade Runner didn't invent the issue but it arguably did more to popularize it than any other post-Asimov source.\r Those expecting to see Harrison Ford in full Han Solo/Indiana Jones action hero mode are primed for disappointment. Deckard is still capable of getting the job done, but he's not gung-ho about it. He's a reluctant cop, and his reluctance becomes more apparent as the movie unfolds. He's also not the blade runner he used to be. He does the job, but gets the hell kicked out of him on several occasions and, without Rachael's timely intervention when he confronts Leon, he wouldn't be around to chase Pris and Roy.\r Blade Runner is not known for action set pieces. There are four, each associated with the death of a replicant. The most exaggerated are the conflicts between Deckard and Pris and Deckard and Roy, but there's nothing in either to match the elaborate workings of Ford's previous movie, Raiders of the Lost Ark. Blade Runner delivers its share of tension and suspense, but Ridley Scott's intention with this film was to make something worth thinking about not just a mindless jolt of adrenaline.\r The movie is loosely based on Do Androids Dream of Electric Sheep by Philip K. Dick, and it represents the first time any of the prolific science fiction author's works was adapted for a motion picture. Reportedly, Dick was pleased with the result even though Blade Runner diverged considerably from his story. What most impressed Dick was the look of the film and that has become Blade Runner's legacy. The mixture of high technology (air cars) and poverty (fires in trash cans) results in indelible images. Blade Runner takes place in darkness and rain. The film noir influences are evident, but so are the science fictions ones. Scott's ability to fuse these two has created a blueprint that dozens of other \"serious\" science fiction films have followed. The Blade Runner look is in direct contrast to the antiseptic appearance of Star Wars and Star Trek, the reigning science fiction poster franchises of the day. (Star Trek II: The Wrath of Khan was released three weeks prior to Blade Runner in 1982.)\r Blade Runner is a rare science fiction movie so full of material that pages can be written about it without scratching the surface. A review like this can provide little more than an overview. A detailed exploration of the movie, its style, and its mysteries requires dedication that only someone immersed in Blade Runner lore can provide. Currently, the film is available in the United States only in the director's cut. Warner Brothers, however, has promised an exhaustive box set next year with multiple versions. It will be interesting to see whether those editions offer new insights or expand upon the film's already rich tapestry."
    },
    {
      "rating": "10",
      "text": "One of the best sci-fi movie and written soundtrack to it by genius composer Vangelis. And of course great acting performance by Harrison Ford, Sean Young and Rutger Hauer. My personal score is 10/10"
    },
    {
      "rating": "10",
      "text": "The moment I saw the opening shot of the futuristic city of LA being reflected in the human iris, I was hooked onto Blade Runner. This is possibly my favorite movie of all time; definitely my favorite sci-fi movie of all time.\r The plot can be hard to follow, but after viewing it multiple times, I found it to be very fascinating and rich with themes like religion, death and man's reliance on technology. It's the sort of plot that will leave you thinking even after the end credits have rolled.\r The main characters of Deckard (Harrison Ford) & Roy Batty (Rutger Hauer) are equally compelling, much of which is due to the outstanding performances of both actors. Roy Batty's poetic \"Tears in the Rain\" speech is in my mind one of the most memorable monologues in movie history.\r If you can't appreciate the film's story, you can at least appreciate it as a visual spectacle. This is one of the most beautifully shot movies that I have ever seen. The shots of the neon-filled city are breathtaking, & the imagery plays off of the movie's themes to the letter.\r The futuristic dystopian city of LA is absolutely jaw-dropping, and makes you want to see more of this world. Greek composer Vangelis helps bring this world to life with his unique score, a beautiful symphony of futuristic synthesizers."
    },
    {
      "rating": "10",
      "text": "a unique work of art that combines in a story a philosophy that even today transcends the thoughts of those who watch it. In addition the soundtrack is remarkable (One of the best of all time), with a highlight for the iconic scene of the tears in rain"
    },
    {
      "rating": "5",
      "text": "Interesting visuals and premise, great music but exceptionally boring. Overrated."
    },
    {
      "rating": "3",
      "text": "Always been a fan of a good scifi movie... I was like 6 when this came out and didn't watch it back then and for some reason never got around to watching it until recently. I've been told numerous times this was a classic, one of the best of the genre. Well wait, I did watch it like 10 years ago after a friend told me it was his favorite movie of all times and I honestly don't remember any of it, other than I felt it was pretty boring. So a couple months ago I watched it and fell asleep on it... and now I finally got around to watching it fully, well rested and with no expectations.I just feel the jell-o doesn't take hold... It seems like the whole plot is very shallow and uneventful. Throughout the movie, you don't quite get what the runaway replicants want exactly and by the time you do, they pretty much learn they can't do anything about it... Then it just becomes a succession of extremely cheesy action scenes (the whole JF Sebastian apartment ending, geez man, give me a break).Overall, it was a pretty excruciating experience to watch. Granted, it was ahead of it's time and there was a lot of originality, but story-wise, it was in my opinion terrible. I hope Denis Villeneuve's upcoming follow up mops the floor with this, won't be hard IMHO."
    },
    {
      "rating": "5",
      "text": "Gorgeous, but deathly boring. I have tried watching this (i'm not joking) at least 14 times. I even bought the blu ray thinking the amazing visuals would keep me awake. Same thing with the sequel, but ryn gosling was the one that put me to sleep in that one. Same dead expression on his face. If you imagine a better actor in the role with charisma and range in the role it is still really boring. I'll never get it, sorry, i tried nerds ;)"
    },
    {
      "rating": "2",
      "text": "There are many problems with Blade Runner, but let us start with the positives. First, the setting is great. The futuristic city they built is beautiful and amazingly huge in scope. In addition, the general feel of the film is cool and the lighting is perfect. The acting is also solid. However, beyond this, the film is a trainwreck. The story is terrible. It is overly complex and nearly impossible to follow, even if you pay attention. The action is stupid and poorly done. The script is lacking as well. The film is not slow, but it never really hooks you in. I was never made to care about anything that happened. In addition, the ending is terrible, largely because it creepy and borderline sadistic, which completely turned me off and made me entirely repulsed. For a film that is now considered a classic, I find myself agreeing with the initial negative reception."
    },
    {
      "rating": "5",
      "text": "I've never been a huge science fiction buff, but considering Blade Runner's influence and stature, I did my duty and viewed both the theatrical version and the director's cut in order to compare and contrast.  I have to say that the latter is the stronger film thanks in large part to its more ambiguous ending.  The absence of Ford's narration isn't a major problem although it does help to clarify a couple of plot points.  As for the film itself, it's visually stunning and has aged extremely well but the story is clunky and there's no human element to connect with."
    },
    {
      "rating": "9",
      "text": "It goes far, but it doesn't go far enough. The world of the machine is not explored as deeply as I would have liked, in order to truly cement this as a classic film. Nevertheless, it stands on its own as a defining sci-fi noir film that really everyone should see who has an interest in the genre. Harrison Ford plays essentially Harrison Ford, but as a detective, and he does a very decent job satisfying the old, disgruntled lawman that he's supposed to play. Brion James plays a delightfully crazy android, aided by a brief but memorable performance by Daryl Hannah. The story weaves together expertly in this crime drama, but the characters really drive the plot along. This is important, because at about two hours in length, this film can seem slow to anyone who is more used to fast-paced modern science fiction. However, tension builds and the climax is worth it for those who are willing to give it a shot. All in all, its accolades are well-deserved, even if it doesn't make my personal favorite science fiction films list. This may be Ridley Scott's defining masterpiece in his ouevre.Verdict: Movie Win"
    }
  ]
}