{"id": 3083, "title": "Blade of the 47 Ronin", "starring": ["Anna Akana", "Mark Dacascos"], "runtime": 106, "genre": ["Action", "Drama", "Fantasy", "Thriller"], "description": "In this sequel to \"47 Ronin,\" a new class of warriors emerges among the Samurai clans to keep a sought-after sword from falling into the wrong hands.", "releaseYear": "2022", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/kjFDIlUCJkcpFxYKtE6OsGcAfQQ.jpg", "categories": {"plot": 6.18, "acting": 5.722222222222222, "ending": 7.533333333333333, "soundtrack": 2.0, "cinematography": 7.0, "familyFriendly": 3.0, "funny": 6.333333333333333, "action": 6.903225806451613}, "reviews": [{"rating": "6", "text": "I personally enjoyed this film  I can see critics point of view in some aspects of the movie, yet I found that the stunning visuals and the intense plot rescued some of the dull and boring aspects, such as the acting. However, the only noticeable actress that I believe deserves some sort of recognition, is the Japanese lady who plays the witch with two different eye colours. I wouldn't recommend the film to everyone, but overall, the film deserves 6 out of 10."}, {"rating": "1", "text": "Easily one of the worst and disappointing films of 2013. It feels like more than half of the movie is missing, and the story, in fact, THE WHOLE MOVIE would have been a lot better if the fantasy elements were removed, and it stuck to telling the true story. Also, the character with the skeleton tattoo who was so prominently featured in the advertising? HE ISN'T EVEN IN THE MOVIE! It's utterly terrible. Keanu Reeves is the one saving grace of this film, however."}, {"rating": "9", "text": "The poor reviews from both critics and users are misguided; this was an excellent telling of a 300 year old legend, the Chushingura. The legend is based on a historical battle, and the multitude of versions of the Chushingura all tweak some element of the historical events in order to either feature a certain element, actor, or viewpoint. This movie does the same thing.\r The dialog is in keeping with typical Japanese historical/fantasy action movies--it's direct, stoic in manner, and yet expressive. All of the actors deliver their lines believably and with grace--much as one should expect from this story. Keanu Reaves, while the Hollywood A-lister, is not the focus, but his strengths lend themselves well to the story. The real stars are Hiroyuki Sanada as Oishi, Tadanobu Asano as Lord Kira, and Rinko Kikuchi as Mizuki--the three of them are the heart and soul of the movie, and the plot moves with them. The action is swift, clean, and beautiful, which shouldn't be a surprise given the level of talent in the film. The CG adds only the fantasy elements, and doesn't detract from the rest of the story.\r The love story between Lady Mika and Kai is the twist of this story, and it works well because it's not the central focus of the plot. It's a nice addition, one to get American female audiences involved, no doubt.\r Overall, I'm highly satisfied with this movie. The only reason I don't give it a 10/10 is because, for me, that rating is reserved for the most epic of movies. \"47 Ronin\" isn't epic, but it's definitely excellent."}, {"rating": "7", "text": "\"I didn't ask you to build me a watch, I only asked what time it was.\"  Seems this is very true for this particular film: Critics want to deconstruct it down to every nuance while making sure to factor in the original cost, how the CGI compares to other films, etc.  What so many people, including critics, seem to forget is that most people go to the movies for entertainment.  They don't care if the movie cost $1 or $1 billion to make.  They don't care if the CGI wasn't as good as XYZ film or if a particular piece of dialogue wasn't great  they simply want to be entertained for a couple hours.  If it was widely publicized that it was made for only $40,000 would people have then said what a remarkable achievement it was?\r 47 Ronin was a big surprise in that sense as it simply didn't disappoint as so many said it would.   Indeed, we bought our 3D tickets before we read any reviews and started regretting the purchase before even seeing the film.  We finally decided to go ahead with what was sure to be a terrible movie ticket investment  four hardcore movie watchers who can generally be pretty objective when it comes to movies.   As it turned out, the movie was entertaining in virtually every respect.\r Was it a great movie?  Not necessarily, but it was good and certainly worth the ticket price.  The story had a few lulls but none that inspired a \"this is probably a good time to go to the bathroom\" moment.  The CGI was fine for 99% of the population, possibly excepting graphics designers and hardcore video game players.  The dialogue was fine for 99% of the population, possibly excepting writers or professional speakers.\r Instead, this movie entertained right from the start and had a plot line that followed just fine.  Sure, sure, perhaps a couple \"roll your eyes\" romantic moments but that is no major sin.  The action scenes were good with a couple very minor \"huh?\" spots.  The ending wasn't my cup of tea, but would seem to hold true with the storyline and the samurai code of that day.  But hey, how many people in the US are well-versed in those ancient traditions?  Probably less than 1%.  Which again leaves it as a satisfying film for the other 99% of us."}, {"rating": "10", "text": "Wow. I am shocked by the bad critic reviews. I thought this movie was excellent. Compelling story. Special effects support but don't dominate the story. The acting is a bit wooden at times, but it felt stylistically appropriate and didn't detract from the movie at all. I think it is an intentional nod to traditional Japanese form, but what do I know?\r Frankly this movie reminded me of one of the \"Lord of the Rings\" movies, Japanese style. It is a complete and intriguing universe. The cinematography and artistic direction feel coherent and well conceived. I feel like the characters were well developed and we understood their point of views by the end of the movie.\r I loved this movie. The time passed without notice while I was immersed in it. I'd see it again."}, {"rating": "1", "text": "Bad action scenes that come and go way too fast. Bad writing and dialgoue. A dull narrative and uninspired acting all around, and some great cg for a not so great everything else. I love Keanu Reeves as an actor, and I was sure I'd love this movie but 47 Ronin is nothing short of a colossal disappointment."}, {"rating": "6", "text": "47 Ronin is a serviceable action movie that fails to either capture the emotional essence of the titular tale or bring anything genuinely fresh, invigorating, or memorable to its rendition. Character, relationship, and coherent tone are all sacrificed in service of an attempt to capitalize on an idea that  theoretically  has an appeal across multiple markets. Mildly entertaining and gorgeous to look at, 47 Ronin has little beneath the surface to recommend it. There are a few good fights, though."}, {"rating": "3", "text": "They really should have let a Japanese director do this. Apart from the misleading narration and the exaggerated graphics, this film also lacks the profundity and strength the original story communicates, which is, true, very difficult to grasp if you weren't born and raised in Japan. As for Keanu Reeves, whom everybody keeps panning, he was an obvious marketing choice. Again, if they had let this be done by an all-Japanese crew, I think it would have been a wonderful piece of foreign cinema, faithful to the story and theme of the legend. I'd watch Princess Mononoke a thousand times over this."}, {"rating": "7", "text": "47 Ronin is similar in feeling to \"Immortals\", \"Conan the Barbarian\" although really better than both of these, it is still not magnificent, but I surprisingly had a really good time throughout. The 3D is not the greatest ever, but has the 80's 3D effects of things popping out of the screen, deep and enjoyable. The plot is with no doubt similar to the above movies and has cliches but it is just a popcorn over the top film."}, {"rating": "10", "text": "I was applaud at the low scores that was posted. This 47 Ronin was very good from start to finish. I am not  a polished writer, however, this was definitely a movie that my Finance' & I truly enjoyed. It should not have been rated lower than a 7 or 8. Thanks for reading my rating."}, {"rating": "10", "text": "My grandson and I went to see this movie today. The beginning was a little slow but once it got good it became AWESOME. Loved it. The 3D effect was amazing. I would recommend it highly."}, {"rating": "7", "text": "I saw this movie last night after my brother offered to pay. I admit I had been influenced by all the bad critic reviews. After having a night to reflect on my experience I honestly cannot for the life of me figure out what all the vitriol is about. It was well acted, a compelling story, action driven, and had a very satisfying ending. Hiroyuki Sanada's performance was exceptional. KR held his own. It never got sappy, or ridiculous. The CGI was well used. The emotion never seemed forced and the moments of humor were well-placed. The only thing this movie needed was some extended story and screen fight time with some of the characters on the fringes (the giant suit of armor guy and the pirate skeleton guy in particular). Was it the best movie I have seen this year, no, but this movie has no reason to be rated as low as it has been. Solid 7."}, {"rating": "3", "text": "It's a real shame how bad this movie is because it has a very interesting, unique and promising ethos and premise, mixing Japenese culture with fantasy style adventure and lore. And with an all star cast what could go wrong? FLIPPING LOTS! Like bad story! Like bad action! Like bad characters! Like being exrusatingly dull and pointless! Why didn't they just make a film about the awesome background of this world, because at the moment it's the only thing stopping this movie from getting a 0!"}, {"rating": "10", "text": "I, too, am truly shocked by the critic reviews.\rThis movie was fantastic! It was moving, beautiful and truly entertaining! It deserves at least a solid 7, and I hope that I'm scoring it a ten the average score will be pushed up to the place where it belongs.\rDo not be out off by these reviews- if you want a solid, entertaining and moving film about the Samurai in Japan, this is a great film for you!\rThoroughly enjoyable."}, {"rating": "5", "text": "Surprised to hear that this didn't even do well in Japan.  It's OK, but not the star among holiday films:  Pedestrian, effects-laden, fantastical retelling of a Japanese legend with fluent English by the mostly Japanese cast so no subtitles needed.  One of those films that makes you wonder what happened to that Ted Logan we grew up on all charm and spewing catchphrases?  What process of maturing turned Keanu Reeves into this stone-faced, emotionless guy?  With few spoken lines and just the expressions on their faces, the rest of the cast could communicate tragedy, malevolence, or pride, but our half-breed is so lacking in personality that the actor who played his younger version could infuse his small part of the script with more feeling.  Oh well, if you're like me you just came to be immersed in a small, if totally fictional piece of Japanese culture and not watch Mr. Reeves play another version of Neo."}, {"rating": "1", "text": "I was very excited about this movie but in the first two minutes it was clear no one was steering. The opening dialogue just repeated what you were already seeing. This is not a character movie but a plot movie that cultures which value the group over the individual would enjoy more. The movie just moved from scene to scene to keep the story plotting along. What really drove me crazy was that leaders don't have to be responsible for their bad decisions and that the greatest sin was disobedience not wrongs. Not something that the culture in north america would understand.  Also the insertion of magic that undermined us taking the consequences seriously."}, {"rating": "10", "text": "Keanu Keanu Keanu Keanu Keanu Keanu Keanu Keanu Keanu Keanu Keanu Keanu Keanu Keanu Keanu Keanu Keanu Keanu Keanu Keanu Keanu Keanu Keanu Keanu Keanu Keanu Keanu Keanu Keanu Keanu Keanu Keanu Keanu"}, {"rating": "5", "text": "Exiled samurai are called Ronin and 47 of them seek revenge when their master is killed by Japan's supreme warlord. They need the leadership of a noble half-breed (Keanu Reeves) to overcome mythical beasts, a powerful witch and a bunch of soldiers. This well-worn plot spends the first hour with lots of intrigue and a confusing array of characters. When it comes time to fight, the action is uninspired and unfocused. The only thing to recommend the film is the art direction: lovely scenery, stunning costumes and some cool effects. The overall outcome just feels flat: never particularly involving or exciting."}, {"rating": "9", "text": "I don't understand why this movie is getting such poor reviews.  It's a good story with some really good action scenes.  It's not boring or slow I was enthralled the whole time.  And the ending is unforgettable.  The critics need to get a clue and quit taking themselves so seriously.  I almost passed on a good movie because of poor reviews."}, {"rating": "10", "text": "I  thoroughly enjoyed this fil. I even bought it on Blu-Ray after watching it in the theater. I really dont understand the bad reviews from the critics. And everyone Ive seen the movie with has a generally positive reaction to it. I view it is a fantasy flick, full of sorcary and demons set in Japan. A fantasy depiction of a real event. Nothing wrong with that. I just think that the all japanese cast except for Mr. Reeves didnt flow well with the american audience and the fact that as the main character keanu Reeves didnt rub too well with japanese audiences. However these racial issues were addressed in the film an justified. Keanu Reeves character was a half breed and it was well established and in context to the story of the film. And i can appreciate the all Japanese cast, if the film is set in japan, it should be that way. It was also a very pretty film to watch, especially on a large or 3D TV. The depiction of japan and characters wardrobe were absolutly awsome. The story telling was good and so was the pacing. So i dont get all the bad criticism the film has gotten."}, {"rating": "5", "text": "Ultimately I enjoyed this movie as just a movie but what really sets it back is having the fantasy elements thrown in.  This true legend of the 47 Ronin doesn't need fireballs and a mystical hair demon lady, it made the experience more cartoonish than serious.  Another dropping point is Keanu Reaves, a random white guy samurai who's acting capability compares to the plank of wood people call Kristen Stewart.  Luckily for this film Hiroyuki Sanada makes up for everything, he is a fantastic actor.  I really enjoyed that they used mostly Japanese actors but again, they're speaking in english.  I do not mean to insult or sound like a jerk but their accents added to the hilariousness of the film.  When the shogunate speaks it's just funny.  This is very unfortunate because Japanese is such a bad ass sounding language filled with great emotion.  Had they allowed the actors to speak Japanese it would have elevated the experience.  But for whatever reason Keanu Reaves had to be there.\rAnother issue I have, that isn't the biggest deal, but it was PG13.  Which means people get cut by a katana and there's no blood.  That doesn't swing with me, the sharpest blade in history will make you bleed.  Much like my issue with Krueger in Elysium, the giant towering fear-invoking demon samurai never really did anything in this movie and his death was an absolute cop out.\rThis movie had so much potential to tell and recreate a true epic story.  But it falls flat by trying to rely on the mystical and made up.  Just tell the story, not every movie needs a dragon."}, {"rating": "8", "text": "I honestly do not know what the critics are smoking. This movie is fairly decent. Do I want see it again?  Not in the theater, but most definitely when it comes out on Netflix or Redbox."}, {"rating": "8", "text": "Decent movie. understand some of the complaints on storytelling, but enough action to keep it interesting. beautiful shots here and there, some fun creatures, decent swordplay. could have been better as many movies can, but an enjoyable cold winter day story."}, {"rating": "10", "text": "I thought it was an enjoyable fantasy-action movie with a special style and an unexpected ending (I didn’t know the Japanese legend). It was well worth the entrance fee and the time spent watching it."}, {"rating": "8", "text": "Wow  don't understand very low scores from some viewers or so called \"critics\".Movie wasn't a masterpiece of course but I found it enjoyable.If you are looking for non-stop action with crazy over the top  special effects on every corner then you are better off staying home.For the rest of you ,please familiarize yourself  with the legend of 47 Ronin and then go see a movie and try to enjoy yourself."}, {"rating": "10", "text": "I totally enjoyed this movie... I don't get how the critics favor anchorman over this movie...personally I refuse to go see what is already obviously an obnoxious stupid movie...anyhow... 47 Ronin was beautifully shot, good storyline, good acting, good costumes, awesome special effects...and loved the action shots as well... while it may not have been historically accurate... it's a beautiful movie.  Anyhow... I enjoyed it personally....perhaps its due to my growing up watching all the Kungfu, Karate movies in our old movie house as a kid... If you like Asian action films... I recommend this one."}, {"rating": "7", "text": "Fantastic film about a legend from the East. Definitely worth it. The story with battles, philosophy and revenge  what else you need? It was wonderful story. And the final was great."}, {"rating": "9", "text": "I went into this movie with essentially no expectations.  After a cursory glance at reviews I thought it would be a mindless throw-away experience.  However, I could not have been more wrong.\r This movie surpassed all of my expectations.  I enjoyed the meld of the feudal Japanese setting, the un-overt use of fantasy elements infused with the legend of the 47 ronin.\r As far as I remember, the major plot points were covered and I was pleased to see that the end of the story was not changed to accommodate most cheesy Hollywood endings.  It's an ending that Western audiences may not understand as being \"happy\" without having some knowledge of the Bushido code.\r In terms of pacing, I felt that the movie moved along at a brisk pace - never at any moment did I feel a scene overstayed it's welcome.  In comparison, when I watched Hobbit: Desolation recently, I fell asleep probably 2-3 times due to many of the over-drawn scenes.\r Overall, I thought it was a great, entertaining movie.  I really don't understand the major disparity between the critic and user reviews.  If you are an action, fantasy, or adventure movie buff, I highly recommend this movie to you.  Don't bother even considering the largely incorrect reviews from the so-called \"pros\"."}, {"rating": "10", "text": "this movie is great, c'mon! ok, it's to lame the skull men don't show more and the ending are sad but the story, the CGI and i'm not going to Keanu Reeves are great! it sad that woman with two diferent eyes don't fight more with keanu but still great"}, {"rating": "10", "text": "I absolutely loved this movie!  It was a beautiful period piece with well-orchestrated fight scenes.  The scenery was gorgeous, the costuming and pageantry sumptuous.  The characters were typical \"fairy tale\" iconic people who represent heroic ideals.  I think the actors all played very reserved characters who expressed their motivations and feelings very subtly.  I'm sorry to see so much criticism of this wonderful and beautiful movie.  It should not be seen as a pure action fight movie.  There is much more depth to the story using well-orchestrated moves which represent so much."}, {"rating": "4", "text": "The tale of 47 Ronin is an ancient one, embellished with honorable vengeance in an exotic setting. While such premise could draw people attention, but there also lies its weakness, it's severely predictable. Many have used simple already known concept and made it into fresh interesting watch, unfortunately for this movie spamming CG is not amongst the way to accomplish that. Hindered by poor acting, questionable cast and uneven storytelling, 47 Ronin feels detached and uninspiring despite its gorgeous visual.\r From graphical standpoint, it's actually quite impressive. Mythical creatures roam its vibrant realm, colors are brightly sleek and the dark contrast makes for a good view. It's certainly up to par on other fantasy movies, although it does detract from more historical portrayal of feudal Japan. There's a bit exaggeration in it as well, almost as if it's a westernized version of Japan. Some scenes, especially with the quick battles or bizarre giant characters, have the grayish murky tone of medieval fantasy like The Hobbits, and while the style direction is a bit excessive, seeing kimono in brimming flamboyant dye is rather peculiar, it's acceptably eye pleasing.\r Problems emerge when it tries to implement the story, which could be inspirational but remarkably falls flat. Keanu Reeves plays Kai, a half breed from an Englishman and a Japanese woman, the film's original character meant to portray an elevating underdog story, yet Reeves displays only one set of facial expression. He looks almost completely the same throughout the movie, there's barely any allure on seeing such monotonous hero. At the very least, his stiff performance can be considered as consistency, ironically so.\r The use of English is awkward as well, The Last Samurai did the multilingual tone and it worked, so it could have used Japanese for more authenticity. There's a nagging feeling that something is amiss, specifically when the movie enters supposedly dramatic moments. Setting that aside, the script isn't exactly great either, most of the time it goes overly melodramatic, as if it wants the archaic feel of Japanese classic but delivered in mediocre English.\r Casting is dubious, everyone has the samurai look and with boorish script, everyone is equally trapped in their respective dull role; there's your serious samurai and next to him are the sad samurai and funny samurai. Granted, there's not enough time to highlight them all, but none of them stand out or have the chance to perform to the fullest. Rinko Kikuchi, who earned Oscar and Golden Globe nomination for Babel, plays the evil witch, although her presence merely resembles a bitter high school cheerleader. The characters are just terribly shallow, when the leading male barely does robotic mumbles and the Oscar nominee looks that uncomfortable, it does nothing to draw the audience's interest.\r During the two hours of its length, the flow feels fragmented, mainly because it consists of drab scenes with little beautiful vista sprinkled in between. There is no epic scale engaging skirmish to behold, just some small CG fights, which is odd since the appeal should be a smaller group of warriors against mightier force. It does boast a spectacle, but no amount of cosmetic can justify the bland use of Japanese classic."}, {"rating": "10", "text": "I just saw the movie, and I must say it´s really  a Masterpiece. I enjoyed every second of it,\r I really can´t understand  why critic gave such low scores..."}, {"rating": "0", "text": "Dances with Wolves   1990\rThe Last of the Mohicans  1993\rThe Last Samurai  2003\rPathfinder  2007\r47 Ronin  2013\r Another movie with the white man showing up to save the day. Never mind the term 'half-breed' in the description."}, {"rating": "7", "text": "I was pretty excited to see Keanu back on the big screen. 47 Ronin is a good movie(not great), good actors, nice story. It could have been much better with extended action and a more drama."}, {"rating": "1", "text": "I wanted to like this film. Unfortunately, the pacing is terrible, and it builds up to nothing. Action scenes are scarce and often truncated. In between are cliche-ridden monologues and drab dialogue between flat, uninteresting characters. It aspires to be an epic, but instead straddles the line between farce and Nyquil. Its only saving grace is the cinematography, which is top notch. However, it can't compensate for the fact that sitting through this 2-hour movie felt like a lifetime. A boring, pointless, boring lifetime."}, {"rating": "10", "text": "A couple of hours with Keanu Reeves, what's not to like about that?!! I saw this film having never heard of the legend of the 47 Ronin & thoroughly enjoyed every second of it as did my 8 year old son. Honour, Loyalty & Bravery are something we would be hard pressed to find in today's society & these men were all that & more. It is a truly moving story to base a film upon & what a great film it is!\rI've heard lots of bad reviews about it & several derogatory comments about Mr Reeves acting skills & in particular his unchanging facial expressions throughout. Give the guy a break! They couldn't have cast anyone better to play the role of Kai & he played it beautifully. As for his facial expressions, well what can I say? The person he was playing didn't have a lot to smile about really did he?! Enough said!\rFor anyone wondering if they should see this film or not I would definitely encourage you to do so. There's plenty of action for the boys, a bit of romance for the girls & if nothing else you will exit the cinema having learned the legend of the 47 Ronin.\rWould I watch it again? You're damn right I would! In fact I went back to see it this afternoon & was not disappointed!"}, {"rating": "0", "text": "Pointless scenes. Again,and again. That's sad,but this film was not only boring  it was also ridiculous. NOT the film of the year. There's nothing good to keep in it."}, {"rating": "2", "text": "RetroView25, Here again and 47Ronin is not is not a film to waste 2 hours of your life on to watch!!!\r Number One  I understand the fact that the story needs a half-breed character to tell this story but why does Hollywood constantly keep using caucasian actors to play the lead role of a character who based on ethic descent from the source material!?!?!?!?!?!?!?!?!?!?! Dragonball Evolution circa 2009 anyone???\r And YES: Keanu Reeves does have Chinese and Hawaiian descent from his Grandmother side, but a Half-Breed in Japanese culture usually means a Korean or someone having both Chinese & Japanese descent within them!!! Keanu Reeves comes off as a white guy not as a Half-Breed in this film!!!  This is not the Matrix!!! And you saw how well \"Man of Tai Chi\" circa 2013 did for Mr. Reeves box office success at the box office, for his next role to be \"Superman\"; Get It !?!\r Second: Why was the CGI so horrible??? Bringing flashbacks of \"Hansel and Gretel: Witch Hunters\" circa 2013...  As, they spent $225 million on the budget on what??? Costumes???\r Thirdly: If you came to watch for some High Entertaining Fight Scenes then YOU will leave severely wanting!!! I mean, Kai is supposed to have  \"Special Powers\" which translate into seeing a fox with different colored eyes and some kind of Steve Winwood \"Valerie\" music video jump move performed twice in the film!!! You better off watching \"The Blind Swordsman Zatoichi\" circa 2003 or Rurouni Kenshin live action film circa 2012 instead for Feudal Japan Period films!!!\r For extra credit: Azumi series, Ichi (2008), Hara-Kiri: Death of a Samurai (2011) and The Twilight Samurai (2002)...\r Fourth: The translation of this beautiful and epic story got turned into a paint by the numbers picture film, that had more bathroom break scenes to make it a tv movie having built in commercial breaks...  Where was the editing or pacing of this film to make it worth being TWO HOURS LONG!!! I got had easily slice it down into ONE HOUR including credit rolls!!! It's that type of film folks!!!\r And lastly: What is with Hollywood having caucasian actors being the SAVIOR of another race or last of their kind!?!!?! What is UP with that??? The Last Samurai circa 2003 anyone??? Anyone??? The Last of the Mohicans Circa 1992 or  Dances with Wolves circa 1990...  Are YOU getting the picture to see the picture...\r I would love to see a movie title  Last of Caucasian\" being played by a Lead Asian Role; now that would be irony to see that!!! LOL"}, {"rating": "10", "text": "I'm looking at all the reviews for this and I don't really understand what's going on. I appreciate what the director did with this movie, he gave us what would normally be a niche authentically Japanese samurai movie and made it slightly accessible to Western audiences, which I think is the problem. People watched the trailer and thought \"yay, cool fights with monsters and samurai and ****\" etc. That is not what this movie is. This isn't a fast-paced Hollywood action film, this is an almost slow-paced movie about Feudal Japan and everything associated with it. I liked it, I thought it was cool. And a breath of fresh air from all the actiony, CGI-fest crap that we're used to."}, {"rating": "9", "text": "A great Japanese fantasy tale, filled with epic samurai upholding social order ahead of their own lives.The film does a great job of showing that duty and honor to ones lord is far more important than adventure. By battling against those who would the rules of society as a weapon these men face the ultimate challenge, returning order to the world. The ending is suitable dramatic, but not what a western audience might expect. Where the film does fall short in its ability to explain to a western audience why the Samurai do what they do, those who are not knowledgeable about feudal japan will have a hard time understanding the motivations of the characters. 47 Ronin is a legendary tale in Japan culture, and this was a fun if not fantastical telling. Worth the watch, but just remember to do a little homework before you go for maximum enjoyment."}, {"rating": "5", "text": "Plot: extremely generic and predictable. I mean, I could literally tell the ending from the start. You can TOTALLY tell he's gonna use his forbidden magic one last time to kill that witch, and it's so cliché it hurts my brain.\r Graphics and photography: very good. The animations integrate perfectly with the overall style and you don't think it's fake for one second.\rBut Avatar already has taken the spot of \"amazing visuals-no plot\" movie.\r I was gonna give it a 5, but I gave it a 4 because the protagonist is like, the only Caucasian character in the whole movie. Regardless of plot, it was an obvious attempt to appeal to us westerners.\rBUT I gave it 5 stars in the end because of the ending. The mass harakiri thing was the only thing that saved the movie from being a dumb \"warrior-loves-girl-and-fights-everything-till-he-gets-her-back\" abomination-- instead it adds a bittersweet taste that makes you FEEL like the movie conveys a message. (There's none except for the, also cliché, \"do the right thing even if it gets you killed\" motto.)"}, {"rating": "0", "text": "only one question, where the hell did that big ass budget go?? Give 1/10 of it to tarantino and he'll still make you a masterwork. Waste of money (a lot, like how did they get that kind of budget) and time, just watch 13 assasins or the last samurai again, you'll thank me for not having to waste your time.\r Just my opinion."}, {"rating": "0", "text": "What a piece of crud.  Another display that KR is not capable of acting, unless mumble mumble mumble is actling.  Dude, where is my katana?  With all the CGI, maybey they could have used some of it to make KR look Japanese and to show some acting!"}, {"rating": "10", "text": "I appreciated the originality. Most importantly the message behind this flick. Loyalty, honor and respect seem to be virtues that are lost in time and this movie brings those values back. Also loved the mixing of Japanese and Western American culture in this movie. Amazing visuals and attractive actors/actresses with a good plot. Not sure why other critics were so hard on this film, after all it's not supposed to be precise..it's an action-fantasy film, not a documentary"}, {"rating": "7", "text": "If you need to have the term \"second\" in relation to seppuku explained, perhaps this movie wasn't made for you. Without a passing knowledge on Japanese culture you may feel lost, especially in the act of speaking without speaking, the language of bows, distance, eye contact and other nonverbal cues. For those who've not at least been exposed to Kurosawa or really any small amount of jidaigeki, themes and core aspects of the film will likely be lost on you and the film doesn't hold your hand through the some of the tougher material. Anyone who saw this film and thought Keanu Reeves was the star was mistaken. Keanu is a viewpoint character for (western) viewers. Hiroyuki Sanada is the star of this story of betrayal, revenge and misplaced but well-intentioned bushido. The fantastic aspects are simply flash on the side that embellish a long embellished story and expose uninitiated audiences to the alien mythos of Japan. They aren't necessary, but they add elements those in the know will appreciate.\r That's not to say the film is perfect. Other than a brief but solid set piece involving the aforementioned mystical elements (and a great and novel interpretation of a classic Japanese race of creatures), the second act is sloppy with far too rapid scene cuts, dissolving from one to the next without a fair share between the lot as if to remind the viewers that certain characters are indeed still in the film. After that, the third act rolls on without a hitch to an excellent climax and a bittersweet finish that might leave oblivious westerners with a sour taste.\r This reviewer noticed that apparently many reviewers were \"forced\" to buy a ticket themselves to see the film (oh the horror!) and wonders if it's too beyond the pale that their reviews were especially rotten for this reason. In any case, it's worth noting that while a certain aggregate site has critic reviews at around 10%, the audience review is closer to 65% (which is approximately the same here). If 47 Ronin looks interesting to you, you'll probably like it. Ignore critic reviews since they seem to have a natural aversion to scifi and fantasy, really anything that requires suspension of disbelief (beyond Keanu Reeves' ability to emote). Check it out at a matinee showing with some friends and judge it for yourself.\r (The only real gripes I have are that the swordplay is more European--sword clashes are almost never okay with katana unless you want a chipped or shattered sword--and the Dutch pirate with the skeleton tattoo makes a cameo appearance at most.)\r Also, complaints about inaccuracies or additions to the film ring hollow for me. The Chushingura has been told countless times in bunraku and kabuki plays, other films by Japanese directors, and even in opera and on and on. This is a new and original take on the story and should not be discounted due to tertiary liberties."}, {"rating": "7", "text": "though it has some dull action sequences in between..but the first 40 minutes and the ending truly kept me gripped onto the movie..And its definitely one of the most underrated films of 2013..its not that bad.."}, {"rating": "0", "text": "All the action the movie has can be seen in the trailer. The acting is not what made the movie bad, i can't even put my finger on what made it bad exactly, all i can say is that it's a very boring movie, you keep waiting to the action to start only to see the movie is about to end and no decent action scene was seen."}, {"rating": "10", "text": "47 Ronin is a well-done presentation of one the most famous legends of Japan. Keanu does a splendid performance, but the other leading men are great.. Sadly, the critics' Eurocentric attitudes have blinders on and just don't get it. I applaud all the care and hard work put into this wonderful movie."}, {"rating": "6", "text": "Takes the historical true story and infuses it with elements of mystical beasts, magic, and witches. This and the ham-fisted and occasionally goofy dialog do make it hard to take the movie too seriously. I did enjoy the action scenes a lot and wish there were more of them. It's the moments between the action that lower my score for the movie. There's nothing particularly wrong with the slower scenes, it's just that nothing really entertaining happens in them. Still, these scenes are at least watchable.\r I didn't really find anything terrible about the film at all. Yes I would have preferred more of the cool action scenes, but the moments in between didn't bore me even if they didn't necessarily entertain. It's a highly watchable film, but I recommend only a rental and only when other options have been exhausted. If you liked the trailers you should find something to like here, I just recommend you don't expect anything particularly great. My total score is a 6.1/10=Okay."}, {"rating": "8", "text": "I see why many critics weren't happy with 47 Ronin.  The plot was predictable and well-worn in places as was some of the dialogue.  But it was a fun action picture with lovely cinematography.  Keanu Reeves does facial expression nuances well.  I went into it knowing it wasn't going to be winning any awards for thoughtfulness and depth, and I came out satisfied, having enjoyed this movie for exactly what it was."}], "recommendations": ["beowulf", "jupiter_ascending", "samson", "valerian_and_the_city_of_a_thousand_planets", "sucker_punch", "the_13th_warrior", "dredd", "ben_hur", "king_arthur_legend_of_the_sword", "9", "the_three_musketeers", "alita_battle_angel", "oblivion", "avengers_age_of_ultron", "v_for_vendetta", "the_green_knight", "hercules", "inception", "the_darkest_minds", "hugo", "300", "tomorrowland", "serenity", "mortal_engines", "the_american"]}