{
  "id": 4007,
  "title": "Blair Witch",
  "starring": [
    "James Allen McCune",
    "Callie Hernandez"
  ],
  "runtime": 89,
  "genre": [
    "Thriller",
    "Horror"
  ],
  "description": "Students on a camping trip discover something sinister is lurking beyond the trees.",
  "releaseYear": "2016",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/chgLLNv3bMSOptaciOUPtDcAggq.jpg",
  "categories": {
    "plot": 4.046511627906977,
    "acting": 4.318181818181818,
    "ending": 5.173913043478261,
    "soundtrack": 8.0,
    "cinematography": 5.25,
    "familyFriendly": 3.0,
    "funny": 7.111111111111111,
    "action": 5.285714285714286
  },
  "reviews": [
    {
      "rating": "0",
      "text": "watching this soft reboot as original BWP fan was true horror indeed.. flat characters, political correct character gathering, subpar performances, subpar reshooting of BWP scenes (\"oh no we ran in circles?!? thats our camp!?!\") utterly implausible character decisions. as said im a big fan of BWP and in general of lost footage movies. normally i cant get enough of them, but i decided to stop watching 3/4 throug the movie. it was just too insulting."
    },
    {
      "rating": "2",
      "text": "I did not see the original Blair Witch, but I heard it is really good, this on the other hand, I went in fresh and despite being told it is exactly like the original, I still didn't enjoy myself. It was just boring, and stupid, and not scary. Nothing about this movie was good except for maybe one disturbing part."
    },
    {
      "rating": "4",
      "text": "The movie is the epitome of what's wrong with modern horror movies. The audio is so overproduced. There's a moment where a character looks at another one strangely and there's a loud ADR scream to create a jump scare from nothing. To that point there's tons of other jump scares that use loud audio bangs or screams to create a \"scare\". This is to the point where one character says, \"stop doing that. As if it's some meta, \"lulz we scared you\", thing. Then the film continues with loud banging jump scares with something not frightening happening on screen as the only source of \"horror\". It ditches the fake jump scares and gets to the \"real\" ones. Thankfully the last act avoids jump scares but that does not make it any better as I'll get to it.\r The camerawork is another overproduced mess when certain jump scares occur near the end. Things have gotten real so the characters obviously need to run and shake the camera since it's a found footage movie. I have no problem with found footage or shakiness but on top of both they have to add glitches and ghosting to digital footage to amp up the terror I guess (which the effect does not do at all imo while making no sense at the same time).\r The movie is practically a remake of the events of the first film except for a modern setting and done in a modern horror style. The main characters have little development and flip flop on what little traits and thoughts they have up until the end of the movie where it gets them killed. Moreover, the last act of the movie is not crazy or \"mindblowing\". I expected neither going in, and that's what I got, but I'm putting this as a warning since reviews and people are saying otherwise. If you've played or watched a playthrough of P.T., or pretty much any modern horror game, some of the end will be a retread on ideas in those. If you've seen the Descent or any other cave diving horror films, if there are any other than the Cave, then another section will be a retread. The actual end is terrible as well as the characters say what will get them killed and then proceed to do said thing literally seconds later.\r The good part of the movie, and the only thing that makes it unique, is how it introduces some neat new time ideas to the Blair Witch mythos in the last half of the film. The time stuff is very cool, and there's a lot of hints and small details to it, but it's such a small nugget to the movie. If just hearing that there's time stuff in the movie interests you should watch the film but don't expect it to blow you away."
    },
    {
      "rating": "6",
      "text": "for a movie that doesnt even need to exist, it is pretty good for what it is. but it is just an updated version of the original. so if you love the original you will like some moments here, with that 2016 addition."
    },
    {
      "rating": "6",
      "text": "in all honesty, I actually thought the film was ok.  Maybe my standards are a bit too low, but it really does to me, seem like there was a lot more love and care put into this film.  It didn’t feel like a cash grab which I was expecting it to be.  The film makers seem to have done their research and whoever designed the sets for this film did an excellent job.  To wrap things up, Blair Witch was a better film than I was expecting.  There are some decent scares and some alright cinematography, the acting isn’t too bad, some of the effects are downright good and I daresay it feels like the film makers had a lot of love for the original film and wanted to put their spin on it, which I have got to commend them for.  It’s not a perfect sell however, the film does suffer from a plot that has some plot holes and there are a couple of really stupid moments and this film tries to get away with a lot of horror tropes that didn’t benefit the film in the end and were entirely absent from the original Blair Witch for a reason.\rFans of the original should not pass this up.  It is actually worth a watch at least once and if you are curious, I would definitely recommend you check it out.  I won’t say rush to see it though I suspect it will have a lengthy run and will probably last until Halloween.  You might wish to wait until it comes out on Netflix but I will say on any level, it’s definitely worth a watch."
    },
    {
      "rating": "4",
      "text": "Deciding to market this under a false title (The Woods) and even going so far as to release posters, promos, trailers, etc bearing this title a couple months before revealing it's true identity at the 2016 San Diego Comic Con was a clever move on Lionsgate and director Adam Wingard's part. It succeeded at getting me, and I'm sure many others, pretty amped up and excited for an unexpected return to the creepy and mysterious Blair Witch mythology many of us came to know and love from the original film. Seeing also that it would serve as a much more rightful sequel than the dreadfully awful Book of Shadows: Blair Witch 2 did, needless to say I had very high hopes that this would deliver and bring some long-awaited justice to the original and unnerving nature of the first film. Unfortunately, this film's secret marketing strategy ultimately proved to be the most exciting aspect of the film, because the actual film itself was truly a disappointment. While not as near as terrible as Book of Shadows, in terms of hype and anticipation, this film failed miserably at living up to either. It simply took advantage of today's latest and greatest technology (drones, ear-mounted cameras, etc) and stuck disappointingly close to the original's formula. Overall, while there were a handful of tense moments (particularly in the final 20 minutes but even that ended abruptly and disappointingly,) this film simply failed to deliver or successfully build upon the original and its effectiveness, which is kinda sad considering many of us waited 15+ years for an at least halfway decent continuation, but I guess even that proved too difficult to follow through with."
    },
    {
      "rating": "0",
      "text": "Horrible. Horrible. Horrible. Horrible. Horrible. Horrible. Horrible. Horrible. Horrible. Horrible. Horrible. Horrible. Horrible. Horrible. Horrible.."
    },
    {
      "rating": "3",
      "text": "This film will make you feel empty. It's like a buffet of visuals but you get bloated without the fullness. In the end, it just raises hundreds of questions without any answers. For example, what's the blair witch? From watching the trailer you can see that the Blair Witch screams like a foghorn & airhorn, shakes the ground like a tyrannosauros rex, she can pick up tents from 100 feet in the air, voodoo, stick bones in wounds, emits light everywhere wherever. While there's nothing wrong with showing off more than what the first film did, there should be more development as would be expected out of a sequel. It was exactly the same as Blair Witch 1999 except with the new technological advances and CGI. The plot was just an excuse for a remake. The guy  sees uploaded video footage from his sisters group disappearing 17 years, and believes an ugly ass zombie was his sister. The worst part is that there is no likeable character and their deaths still leave a bad taste in the mouth. If only there could've been some redeemable feature to wash it out with."
    },
    {
      "rating": "3",
      "text": "Let's get it out of the way. I love the Blair Witch Project. I will defend the Blair Witch Project until the day I die. A lot of people think, it was the marketing that skyrocketed the movie to success, but I disagree. I thought it was the performances, the simple/basic premise and the way the film was shot to look like a \"snuff\" film if you will.\r Blair Witch (2016) is no snuff film. It's clean. It's MTV. It's Hollywood. It's also hard to believe considering Wingard is directing the movie.\r Let's start with the premise. James Donahue, who plays Heather Donahue's little brother from the original BWP, finds a video...on YouTube...who looks NOTHING like his sister...so he thinks it would be a great idea to go back into the woods where she disappeared and find out if she's still really alive.\r Let's stop right there. I was immediately taken out of the movie within the first 5 minutes. The girl, looked nothing like Heather Donahue.\r The reality is, this is no BWP and it's actually my fault for thinking that experience in my life would be duplicated but this is a bad movie in its own right.\r The footage is all clean. The editing makes it look like a rock video. The noises are loud. There's no mystery at all. The scares are somewhat effective if jump scares still get to you. They annoy me, so don't listen to my review if you love jump scares. Instead of soft crackling of twigs, we're treated to the footsteps of a T-Rex.\r The characters all made dumb decisions throughout. It had me throwing my arms up in the air.\r Nothing supernatural or scary happens and when it does, you can barely see due to how shaky the cam gets, which is worth mentioning is worse than the original.\r Adam Wingard & Simon Barrett stated they were huge fans of the original. I'm calling **** I'm going to go as far as saying you can't love the original BWP and like this. This was blasphemy. It was everything the original wasn't.\r I will say they added some interesting ideas to the Blair Witch mythology, but I can do without.\r I'm sorry my review is all over the place. I'm still pretty disappointed.\r The last 10-20 minutes were easily the films most interesting part, as it leads to the finale but too much is shown. There's no mystery. It's outrageous and ridiculous. There's no mystery. The vale has been lifted. *sigh* 3/10"
    },
    {
      "rating": "6",
      "text": "A decent sequel to an overrated horror classic.  I realize I'm in the minority when it comes to The Blair Witch Project but I never understood the hype.  Just a lot of running around and noises in the dark.  The sequel is similar but at least they try to add some different twists.  I'll give them credit for that.  B-"
    },
    {
      "rating": "3",
      "text": "I was terribly disappointed by this film. Absolutely loved the first film, and I'm a huge Wingard fan.  Turned out to be a marriage made in hell. I was bored by the last 30 mins.  Not a good thing for a horror-thriller."
    },
    {
      "rating": "7",
      "text": "First of all, I think this is definitely worth the ticket! Those who saw the Blair Witch Project at the time it came out, just don`t feed great expectations - you want see nothing that stands apart from general horror movies of the current decade on Blair Witch (which was definitely a quality of the first one back when it was released). Younger audiences who are being exposed to the franchise through this new movie might have a better time, although, although this movie does not stand alone as a much more interesting experience compared to REC or even the Paranormal Activity movies.\rAbout the flick itself, it is very similar to the first one, but with a much better work in terms of sound editing (very good for any movie standard) and a much better ending, but not so interesting and mysterious first and second acts. Very scary and fun! It could benefit from better characters and actors - they are so stupid that after a while you just want to see them die!"
    },
    {
      "rating": "1",
      "text": "I was so fired up to see this when I saw that Adam Wingard (\"You're Next\" \"A Horrible Way to Die\" \"V/H/S\") was directing.  And I saw The Blair Witch Project on its opening weekend, when it wasn't ENTIRELY clear whether the footage was real or not - found footage wasn't a \"thing\" at that time. So perhaps I built up the possibilities and potential for this film far too much - regardless, it's a tremendous let-down.  The actors are un-exceptional. The story is flat-out boring.  They pulled a \"Force Awakens\" with the plot - mimicking the first FAR too much.  And I read some critic say the last 20 minutes was essentially \"Hardcore Henry\" in the Blair Witch House - but that would be far too generous to this film, and it's an insult to \"Hardcore Henry.\"  Sorry folks, this is not one you should waste your time or money on.  And Adam? I still love you, baby.  Move on to an original work that you can really dig your teeth into."
    },
    {
      "rating": "4",
      "text": "Geez, Hollywood loves to make franchises. I knew Blair Witch couldn't make a cent out of the original classic. When I saw the new trailer for an obscure title named \"The Woods,\" I was totally freaked out and I thought this was the best horror movie ever, but I was let down by the news that it's going to be renamed as \"Blair Witch.\" And I was like: \"What? WTF! Really, Lionsgate?\" I thought this franchise was dead and buried after that s**tty \"Book Of Shadows\" sequel that is so awful, I could barely watch it on the Sci-Fi Channel. And thank goodnees, they didn't even mentioned a third Blair Witch and it was dead on arrival. And now we're here, 16 years later. Let's face it, the new Blair Witch is a 'Meh' for me. It didn't even have enough scares to make this sort-of reboot very unneccessary. I saw the film last Thursday and I saw a little teenie-weenie amount of people see the movie. Like I saw, it was not good. The ending was alright, but I felt it didn't need to be trimmed apart and I do give credit to the director of the film who been able to give a long dormant franchise and giving it a shot at either make a delightful successor to the one that pedigreed the \"Found Footage\" genre or turned it into a reboot. Unfortunately, nah. I'm sticking with the 3 horror movies that is able to be a success of their own: \"The Conjuring 2,\" Light's Out,\" and \"Don't Breathe.\" Blair Witch is exactly a doomed franchise. No scares equals a sober reminder of how stupid a beloved original nolstalgia turned into a crummy remake can be."
    },
    {
      "rating": "2",
      "text": "Just another horror film. *yawn* Nothing to see people. They took something we loved... and turned it into nonsense filled of clichés. Stop trying to aim for the money and start aiming for the heart of the audience. It's no wonder why all these horror films are so bad nowadays."
    },
    {
      "rating": "3",
      "text": "I give it a 3 because I feel this movie is more deserving of being in the negative than mixed category.\r It's essentially the first Blair Witch with more jump scares and less innovative cinematography for its time, rife with plenty of moments that make little sense.\r Seriously, the entire premise of the movie confounds me. Here are the highlights of confusion:\r In his search for his missing sister of 15 years, our protagonist decides to pursue the mystery of her disappearance with a glee-filled, boozed-up romp in the woods she died in? Okie doke. Appearance of a strangely infested wound that looks for all the world like Alien is about to jump out of it, only to have the character die in a completely unrelated manner and never give us an explanation for what the heck that worm she pulled out of her leg was? Check. A strange ability for the video tape being captured before our eyes to warp through time and be the exact video tape that spurred our heroes into action in the first place, thus putting them in pursuit of their own deaths right off the bat, just to have that ending walked back without any explanation of how the video we're watching was also watched by the characters?! HALLELUJAH! Save your money and watch 2015's It Follows instead. That's actually a good movie.\r And seriously, filmmakers, don't show us the damn witch. That ruins 90% of what made the original compelling."
    },
    {
      "rating": "3",
      "text": "This is just not a very good movie.  The whole handheld camera thing is overused and makes watching the movie too hard.  Many, in fact too many, of the scares are bogus ones where one character frightens another by popping up in their faces.  There are some good frights though once things really get going.  But, overall, this movie is not much more than cheap thrills that may make tou scream, but they are nothing scary as it turns out.  Save your money!"
    },
    {
      "rating": "7",
      "text": "Infinitely better than 'The Blair Witch Project', I was pleasantly surprised at how well-made this movie is. It doesn't drag, and there are hints of a real witch along the journey. Yes, there are needless jump scares but that's just a minor criticism. There's a big payoff at the end, and I really enjoyed the twilight zone aspect of it."
    },
    {
      "rating": "2",
      "text": "I had never seen it in the previous films, but this is really ridiculous because everyone in the cinema when the film will continue the senseless have waited the end of aliens or something. is ridiculous."
    },
    {
      "rating": "6",
      "text": "Blair Witch has a few interesting ideas, but the constant jump-scares, weak characters and a predictable ending make it feel like every other mediocre horror movie out there."
    },
    {
      "rating": "1",
      "text": "This was truly a terrible movie. Look, you can do shaky cam and jump scares all day as long as there is buildup and context. Just simply having abrupt edits and really loud noises means nothing, and quite honestly was extremely irritating as a viewer. I just want to know who's idea it was to have 40+ minutes of the movie just being characters screaming each-others name in poorly lit forests and rooms. They should be fired.\r I enjoy and respect the original movie so this was disappointing to say the least. I can appreciate the work the cast and crew put into this movie, but the foundation and direction this movie was built on was abrasively terrible. Aside from a few cool additions to the Blair Witch mythos, this was a horrendous movie that I regret not walking out on."
    },
    {
      "rating": "3",
      "text": "Settle down for an hour and a half of screaming in the woods, screaming in the dark, the sound of twigs snapping, trees falling and you guessed it, more screaming. The thing about the Blair Witch Project was it was new and original, it worked well once. To make a sequel you better have something new to add and I'm not just talking fancier cameras. So does this bring anything new to the genre? No it does not. Therefore, it's really not worth your time and not really recommended but if you've nothing better to do there are worse ways to spend your time. So you could take a trip out to the cinema or you could stay at home and watch the original, makes no difference."
    },
    {
      "rating": "0",
      "text": "Dear Hollywood,\r Look, I like movies. No, let's be honest, I love movies. But I do not like remakes or reboots. No need. If the original is done right, pic included, there really is no need to try and do it over.\r Let's talk about some remakes Hollywood:\r>The Thing\r>Friday the 13th\r>Nightmare on Elm Street\r I could go on, but it makes me sad-and angry that you can't take a real risk and come out with something new and refreshing.\r Found footage has been done, done and done some more. We really didn't ask for another one. Maybe you should have a talk with your \"focus groups\" and have them listen to us for once.\r Nobody asks for remakes. We want NEW CONTENT, stuff we never seen or heard before. Not an old story wrapped up in a new CGI blanket.\r Wait, I have an idea...are you ready?\r Why don't you let del Toro make his version of At The Mountains of Madness. Wow, great idea right? And no **** love story in it either.\r Thanks for listening, however, I doubt you did.\r They get a reboot rating of 1."
    },
    {
      "rating": "9",
      "text": "Blair witch review:\r Shock and awe...that's what i experienced during the 90 min runtime of one of the best and effective horror movies I've ever seen next to grave encounters! As the credits rolled i sat and stared smiling as if i was in a trance, trying to wrap my brain around what I've just seen. I won't go into to much detail as i don't want to spoil anything but i will say this... yes it's a good horror movie and yes it does the blair witch series justice. In fact i think it is shot and written better than the original as it doesn't waste time to get to the good scary stuff and man is it SCARY! it doesn't rely heavily on jump scares altnough there are a few sprinkled about. The real  scares come from the unknown and the great filming and sound effects and creepy music work from the director and rest of the movie staff. This movie got under my skin and freaked me out and overall i enjoyed it more than the original. In the end this is one of the few good horror movies to come in a long time. It's scary, interesting, and just a fun watch i recommend it to fans of the original and can say proudly to just forget book of shadows ever happen. This is the true sequel the series deserves and i hope to see more of it in the future. 9/10"
    },
    {
      "rating": "0",
      "text": "The movie sucked just like everyone thought it would - better cover up the terrible writing by backtracking on the story. This is exactly what the writer did; instead of showing some integrity and standing by the poor attempt at portraying the actual Blair Witch entity, he came up with a lame cover story once this movie tanked.\r The original was a one-hit-wonder and dumb old Hollywood thinks they can still get rich off of it. This is why piracy is rife."
    },
    {
      "rating": "2",
      "text": "If I may quote Captain Edmund Blackadder \"I was more impressed with the contents of my handkerchief last time I blew my nose.\" I cannot recommend this movie. As a comparison I would, not say \"Suicide Squad,\" is a great movie, but I have not said \"don't see it,\" It's at least that good. Blair Witch, I will say, do not see it."
    },
    {
      "rating": "8",
      "text": "I seem to be in the minority here. I saw this during Tiff's Midnight Madness a week prior to its release, and was able to formulate an opinion prior to the onslaught of negative reviews pouring in from audience and critics alike. I disagree with anyone saying that the creators, Adam Wingard and Simon Barrett, were simply cashing in on the franchise. They were clearly obsessed with the original and wanted to continue exploring the concept, in the wake of the disappointing Book of Shadows. They wanted to create a genre film that jolted their audience, one that followed in the footsteps of the original as closely as possible, while expanding on a few key ideas and ramping up the intensity. I thought they were very successful in that regard."
    },
    {
      "rating": "8",
      "text": "Blair Witch 2016 is cast in exactly the same form as the original. As a stand-alone movie, it think BW2016 accomplishes everything that it tries to do. It is about a group of people stranded on a haunted forest who are subjected to increasingly sinister (and interesting) supernatural occurrences. I would say that said occurrences are more intriguing than those of the original film, and that the reason this one is receiving such low reviews is mostly because it came out after the original. If this version and the first had switched places, I think that this version would be the classic and the other would be the one saddled with the lackluster reviews. Indeed, the movies are extremely similar to each other, both in their premise and content. But setting both side-by-side and judging by which one I found to be more entertaining, I would pick this one (barely) because the stuff which happens in it is just more interesting. In conclusion, I liked it. It definitely could have been better, but as a stand-alone I think it's a fine movie. The reason it's gotten so much flack is because everyone is comparing it to the first movie, which set a very high bar for this one to reach. In any case, I hope a sequel of this is made and that Blair Witch is finally turned into a franchise. I don't know how likely that is to happen, but I would be fine with it if it did."
    },
    {
      "rating": "0",
      "text": "Probably deserves a 5/10, but I am going to rate it a 0. Why? Jumpscares suck. Seriously, there is absolutely nothing remotely scary about a jumpscare. SpongeBob Squarepants could pop out behind you right now and scare you. It doesn't mean SpongeBob is scary. Movies need to learn that jumpscares are the worst."
    },
    {
      "rating": "10",
      "text": "This has to be the most scariest horror film I ever seen, especially the 360 view and the trailers after when It was known as \"The Woods\", My favourite soundtrack was Hackmarrja by N.K.V.D"
    },
    {
      "rating": "5",
      "text": "Did you watch The Blair Witch Project and wish there was a little more going on? If so then this might be the movie for you. Director Adam Wingard basically sets out to remake the original classic, only this time with more traditional thrills. It goes for more than just creepy sounds in the woods and watching the characters break under paranoia and fear. Not necessarily a bad idea, but this sequel misses the point entirely. It needed more of what makes the original so well-respected and perhaps some actual fear to go with it.One thing that becomes immediately noticeable is how loud the film is. For whatever reason, Wingard seems obsessed in the opening chapter of the film to try and freak us out with noisy cutouts and entrances to the next shot. It makes it clear that Blair Witch is going for cheap theatrics right from the get go. Everything that follows is predictable. You have your standard jump scares that you can see coming from a mile away, as well as reshoots of those tense \"what was that sound?\" moments from the original that fall flat because of how overblown they are here. Every twig snapping sounds instead like a tree falling. Wingard seems to have missed out on how creepy the more quiet sounds were in the original, so he turns up the volume in every scene.Not everything is bad in Blair Witch though. I have to give it some credit for trying to expand upon the lore and up the weirdness a bit. The real display of the witches power is pretty neat, if ultimately ineffective at instilling fear. Of course the setting is still great and the extended exploration of the creepy house from the end of the original is something I enjoyed. Particulary for those underground tunnel scenes. The characters are also well done. Great acting from the entire cast. The reasoning behind getting them to go to the woods is dumb, but at least it makes it clear that this is a sequel and not a remake/reboot. Speaking of dumb, the characters have a way of becoming total morons in the final act. Adam Wingard doesn't seem to get why The Blair Witch Project worked. Granted, I would have loved to see the excellent tension, concept, and atmosphere in that movie capatilized on with some big frights, the rather generic approach here causes things to fall short. The scary moments are so overly telegraphed that they lose any impact long before they finally arrive. The twists on moments from the original are disappointing and show a complete misunderstanding of the source material. As a result, none of the creepiness is captured here. It's efforts to expand on the strangeness of the character's situations is easily the best part. Blair Witch lays some groundwork for somebody else to come in and try to get the idea right. Because the first movie's ability to freak you out and this movie's big-scare mentality could come together to create something truly terrifying by capitalizing making up for the shortcomings both of them have. As it stands, Blair Witch is middling and a missed opportunity.5.5/10"
    },
    {
      "rating": "9",
      "text": "I wasn't sure what to expect going in with the so-so reviews it's been getting. I did see the original movie, but I was pretty young when I did and remember it being boring, but hey, tastes change as you get older. Went and saw it and I thought it legitimately had some scary points. It does start slow and take a little while to get going, but once it does it stays at a great pace. I recommend it. Maybe it is a retread of the original, but since it's so long since I've seen that I can't really say. Besides, there's only so much you can do with the premise anyway. Better than other horror movies this year (like The Conjuring 2 which i found to be more funny than scary with the hilariously bad effects. Sometimes less is better.) Worth seeing."
    },
    {
      "rating": "7",
      "text": "I thought this film was a success. Yes, it was similar to the original, but it also did a good job of building tension and doling out just enough of the looming threats to keep the audience wanting more. In this regard it was actually substantially more generous than the original, which keeps it tense and satisfying even though you know what's coming. I think it's being underrated here and is better than a majority of cheesy horror films released every year. If you want a nice fall kind of movie, you could do worse than Blair Witch"
    },
    {
      "rating": "7",
      "text": "Blair Witch may have far too many false jumpscares, but its loud sounds, creepy feel, and dark atmosphere is what makes this movie a great continuation to the Blair Witch Project."
    },
    {
      "rating": "6",
      "text": "Even with its seemingly identical structure to that of the original, Blair Witch will surprise many with its thrills and scares, as well as its fantastic ending."
    },
    {
      "rating": "8",
      "text": "Hi, saw this yesterday on big screen. Let's just say..at the end of the\rmovie, on a half-full theater, all I could sense on people's face was a\rcertain indifference, a certain disdain, a certain 'what the f...did I\rjust watch ???', a certain 'this is an utter piece of sh...', and a\rcertain 'nice. enough...but not so nice - too much.....Nexxxt.' It was\rtruly a mixed-bag, but more worse than bad. I even heard, when the\rend-credits started rolling, a man from a few seats behind say word for\rword ''This is sh*t''. Myself, I was neutral, I liked it, enough, but\rhad a 'missing something' inside feeling, I fell more into the 'hype'\rof it and was a bit left 'wanting' more. And for the scary scenes, one\rwoman was laughing wild (that was quite strange! loll...like some\rperson laughing at a funeral - awkward), I mean, no one was laughing\r(but her)..it was serious matter and scary (people dying in the\rmovie...and there this woman is laughing at the ridiculness of it all,\rI was thinking 'huh...wtf??loll...this isn't funny... but then I\rthought to myself...Oh...I understand, she's laughing all the way\rbecause the movie s*cks so bad (for her I mean), she just can't connect\r- at all.. I may reveal some spoilers (warning to not read further if\ryou do not wish I spoil your viewing already). I feel this movie is a\rbit of an underdog, again. They shouldn't, but they do, because people\rhave seen so many (horror or other genre) movies. Blair witch (the\roriginal was incredible (original scary 'woods' story) if a little\rexaggerated but that turns out to be scary by 'make belief'of a story\rof 'scary witch'that existed in these woods and old lore. The\rdifference between the original and this one, is mostly budget (while\rmore budget works in favor some times (more money into story/script),\rhere it doesn't), the crudy 'NTSC cheap camcorder homevideo' look of\rthe first one/great story telling/tight acting with a small budget\r(60,000$) vs 5 million dollars for this new one. Here, Blair Witch, waits extremely long before the scares come in, way too long; I was getting impatient. last 20 minutes of the movie were the best but SO late in the movie that everyone in the room was 'disconnected' of the\rcharacters' plight. We could not 'engage' and care about any character\rbecause it was too late that they face the 'ordeal' (the witch). The\rfirst part is long and draw out; and does work to bring the 'dread'\rfactor. There is mystery and the film does a fair job of building\rmystery around the lore. The acting is good and 'real'. The witch\ritself is never shown and for that it is terryfying (less is more,\rshowing less monster increases audience imagination and 'wanting to see\rit anticipation', hiding the monster is always scarier than showing\rit), we hear noises creaks trees and branches cracking to\r'reveal/suggest' its presence, it's scary - but it's so late in movie\r(about an hour into it) - we can't connect with characters' emotions to\rthose scary stimulis. Thus, we don't feel tense or sadness when one\rcharacter dies by the witch or some deadly hidden force in the dark\rwoods. The sound design - sadly was non-existent, no musical\ratmospheric building, only diegetic forest sounds. Good but made it\rlackluster, it would have helped, like this it is sonically flat -\routside of the witch encounters themselves. But the witch's sound were\rutterly terrifying (described as like the earth quaking and the trees\rtrembling like a tree fallingon the ground with a screams of death,\rhard to explain, you know this Evil is UTTERLY Evil, it's the demon\rpure), far scarier than in The Blair Witch first movie, which the truly\rscary moments where when the actors were scared themselves (very well)\rand when the tent was moving. I have to hand it to the post-production,\rediting, compositing and CG witch compositing team - d*mn, what a job\rthis was...compositing on this is a compositor's worse nightmare come\rtrue - the camera was shaking so much. The final drag of the last\rsurviving woman is quite tense and you do feel for her, and her\rboyfriend, who tries his best in this. The most other nuisance and it's\ra killing point that drags the movie down immensely, is the 'home video\rlook' it is taken way too far...assaid the camera does - not - stop -\rshaking violently (so much it's a total blur, we can't see/make\ranything but a saccade of blurred pixel colors!). At a certain point I\ralmost had a headache, this is too much shaking, running, video home\rmovie amateur 'shaky cam' 'low reality TV' feel, it ruined the\rpotential (while in first film they dosed it, it was a novelty. One\rmore thing, the last scary scenes show a lot of 1st POV of the camera\rof the survivor, people generally don't like (I noticed) 1st person\rpoint of view of the character, because they can't relate to the\rcharacter (by not 'reading' the facial emotions in those crucial scenes\rin terms of emotion), thus they feel these shots seem like a video game\r1st-person FPS shooter..rather than a film (this\rhampers t"
    },
    {
      "rating": "7",
      "text": "I'm not a big fan of the old \"found footage recorded tape\" films but this was suprisingly good it mainly focuses on things that aren't there and the people hearing stuff but if there is somthing on horror scenes it would be had to see I hate the firs time Blair witch but at its time it was extremely popular"
    },
    {
      "rating": "9",
      "text": "Unlike most of the reviews,   I chose not to listen to when deciding to go see this movie,  I LOVED it.  Granted,  it wasn't as good as the first in my opinion,  but def held it's own.   I took 2 people with me who absolutely are not Blair Witch fans , and they walked out loving it.  If you go into this movie  thinking that it will be better than the first , you may be disappointed for sure..... but who can out do the first one??? No one.  However this one is scary, fast moving and well worth the watch!  i recommend it !"
    },
    {
      "rating": "1",
      "text": "If you're looking for a great sequel to the original Blair Witch Project, look somewhere else. This poor man's reboot is marred by an awful script, bad acting and even worse directing. There's a few clever moments and one connecting it to the original film, but overall is another of Wingard's terrible films. Visceral horror is traded for absolute shock. Nothing to see here."
    },
    {
      "rating": "5",
      "text": "The only reason this movie had any glimmer of hope was that of director Adam Wingard, who after You're Next and The Guest could do no wrong, at least within the genre community. This was an interesting choice for him to break mainstream and on paper probably made sense. However, the combination of this film NOT actually fitting Wingard's talents and the general feeling that Blair Witch is an un-sequelizable film fed its own demise. The proverbial lightning in a bottle, as it were, cryptically out of reach.What the movie really suffers from, is a lack of ingenuity and uniqueness. Not just within the confined realm of the opaque \"Blair Witch\" mythology (if anything, it should have resisted that ghoulish urge) but also within the dried-out decrepit husk of the found-footage film.Wingard doesn't try to bring anything new to tried and true conventions (or wasn't allowed, but who knows), so much as apply a little muster on top of it to hope it works one last time. It mostly doesn't. Half the scares are tediously obvious, the other half mostly unknowable sudden explosions of noise or movement (the \"jump\" scare, a term used too loosely to signify any attempt at fraying the audience's nerves. There's a right way to do it, and sparingly, ask Johhny C).The little bits of mythology (those wooden figures, standing in the corner, etc) are overused, though thankfully not expanded upon. There's a hint at something new in the form of a cut on the bottom of one woman's foot, but this winds up not amounting to much, at least in terms of pay-off, tension or surprise.The ending actually contains some myriad degrees of tension, truly earned and the result of well-shot and constructed scenes. But again, there's no payoff. They don't mean much, especially the blistering ending which seems to be leading to a great movie-style haunted house freak-out traverse before suddenly cutting to black by way of a baffling character decision.Maybe Wingard isn't meant to be a straight-forward terror machine, he prefers his comedy and his genre machinations. He also prefers well-thought out soundtracks (and at least in The Guest, some elaborate set decoration and lighting). This isn't the first time a horror director has faltered trying to re-establish a dormant franchise, or by sticking their hand in the found-footage garbage disposal."
    },
    {
      "rating": "6",
      "text": "The history repeats, and so the story in some sequel films!This is the third film is the 'Blair Witch' film series, but the second film from the story perspective. Anyway, I haven't seen the other sequel, you do not have to be familiar with that to follow this one. So I saw it, but what I thought is, basically this film is exactly same as the first film. Just the characters and timeline changed, that's all.They had nothing much of choice, so the story was repeated with the modern equipments. A new set of people, including a brother of one of those went missing two decades ago, heads to the same woods to investigate. But soon they all begin to witness strange, horrifying events. Now it becomes their survival game of getting out safe from there, but would they? Is what the film's end to notify us.If you are a horror genre fan, particularly about the killing stuffs, then you might enjoy it. Other than that it was not scary, well, it was not for me. The today's generation might enjoy it better, but if you are like above 30 and already saw the original, this will be an average or trash. So young people should watch it. For me, it was okay, because I was not expecting anything from it. So I hope they end it here, no to another sequel or the reboot.6/10"
    },
    {
      "rating": "4",
      "text": "This film was a real disappointment. It loses all sense of dread and suspense by giving in to horror movie cliches, gratuitous jump scares and average acting (the female lead is alright though). Last act gets pretty intense but apart from that this horror film was a joke.\r 3.5/10"
    },
    {
      "rating": "0",
      "text": "So forced and flat, I'd rather watch Blair Witch 2 over this thing.  Found Footage flicks have been in the dumps for quit some time now.  It's a risky genre to tackle, but this was a cringey flop and you can feel it about 1 minute into the movie."
    },
    {
      "rating": "3",
      "text": "The original 1999 film was a masterclass in fear, suspense, improvisational acting and the power of subtlety. This belated cash grab, on the other hand, is a 90-minute showreel of every terrible found-footage cliché that has ever been used since the dawn of the millenium. It manages to extinguish every single one of its creepy moments - which are few and far-between - with deafening sound effects, weak acting and an everlasting number of pathetic jump-scares that are about as creative as a child running up behind you shouting \"boo\". Sitting through its running time was a thoroughly annoying experience, though its unintentionally hilarious ending had me in stitches."
    },
    {
      "rating": "9",
      "text": "I loved the first movie, it was so innovative for its time but 2016 is scarier for different reasons.  Good horror/suspense taps into the viewer's fear of the unknown and a variety of standard phobias i.e. claustrophopbia (you will be terrified in one part), darkness, noises. This film had them all. It does follow the first film's format quite closely but the the thrills are different.  I didn't feel as close to the characters."
    },
    {
      "rating": "4",
      "text": "I like this director but is better when he does original films like You're Next and the Guest. I am tired of camera shaking found footage movies. Plus if you saw the original, then you saw this movie pretty much.I was hoping for something different but there's way too much of the same movie. Without knowing what the hell is going on most the time. I probably would have liked it more of it wasn't a found footage film."
    },
    {
      "rating": "0",
      "text": "Blair Witch isn't just a bad film it is also an insult to the far greater original. Amature, forgettable performances clumsily act out a found footage film that drowns in its own redundancy long before the halfway point. The rushed character development is bad enough, but the unintentionally dislikable characters and gross overacting will have you sighing with boredom when any of them is in any real danger. Oh, and let's not forget the jump scares that are thrown in to compensate for the complete lack of any genuine frights, the hallmark of a truly impotent horror director. \"Why are they filming this!?\" is something you will be asking yourself a lot, time after time the characters seem to have zero self awareness as to why they are recording, seems like a strange priority if your life's in danger for a significant amount of time, no? Overall this is a poorly written, poorly directed, poorly acted, poorly edited disgrace to filmmaking that doesn't even come close to capturing the greatness of the original."
    },
    {
      "rating": "6",
      "text": "The sequel/reboot to the incredibly successful \"The Blair Witch Project\" comes \"Blair Witch\". With a established franchise and a proven director comes on the scene. Now there is a lot to Iike here. The performances were all very good. There were some genuinely scary/nail biting moments, but with most of that coming in the final 20 minutes. The movie has some unnecessary jump scares that take you out of the moment. The audio in the movie was fantastic. Whoever worked on that well done. So with good performances and some genuinely scary moments but unfortunately most in the final moments and some dumb jump scares make it a mixed bag."
    },
    {
      "rating": "5",
      "text": "Literally, The Forest Is A Headache\r Just as the Blair Witch manipulates time perception, the film also can do it. The amount of time that has been since it was inadvertently premiered at Sundance in 1999 seems illusory, a product not only revolutionized the world of horror and suspense film but also diversified marketing parameters imposed in the 1990s. Based on the anomalous acceptance at the American festival, it achieved its official release in movie theaters months later, causing an impressive media boom. It took 17 years for a praiseworthy sequel (omitting filmic outburst of Joe Berlinger in 2000 with \"Blair Witch 2: Book of Shadows\") landed into the forests of Burkittsville, Maryland.\r Allegorically, \"Blair Witch\" (2016) is not a sequel, nor a reboot, the new story of Lionsgate can become a remake, an update of classic from 1999 with high-tech cameras, more budget, a consolidated popular legend and a duo director/screenwriter specializing in the genre, however, the movie backs down when tries to venture into foreign territories to the original, strictly restricting itself to the template of Eduardo Sánchez and Daniel Myrick. With the exception of some provocative and stifling horror sequences, the apparent sequel is little more than a 'hand-held camera' experiment properly done.\r Written by Simon Barrett (\"V/H/S/2\") and directed by Adam Wingard (\"You're Next\" - \"The Guest\"), \"Blair Witch\" continues the story of the Bell Witch based on the events that occurred in the first film. Through a bloodcurdling chase uploaded on Youtube by 'Darknet666', James (James Allen McCune), the younger brother of Heather - female main role from original movie - achieves to identify to his vanished sister, therefore, with his unconditional girlfriend, Lisa (Callie Hernandez), a filmmaker friend, Peter (Brandon Scott), and his respective girlfriend (victim), Ashley (Corbin Reid) heads toward the leafy and legendary American forest, with conventional digital cameras and GPS-equipped phones to go deep into the most intrinsic of hell.\r Well, let's start with the main thing. Filmed in Los Angeles, California and Vancouver, British Columbia in Canada, we return to forests which gave rise to the first encounter with the aggressive poltergeist, crystalline river and tall and dry trees providing an unusual air, since, according to what we saw in the first film, the chosen season for the shooting was autumn, in this case, on account of the greenery of trees seems to indicate that they are in the spring. Selected cast uses again the original strategy, they all are completely unknown in the current film scene, including the dark couple added to the excursion, Lane (Wes Robinson) and Talia (Valorie Curry), responsible for the video on Youtube.\r It discerns of brilliant marketing from the first film, in which affirmed that the authors of the documentary found in the forest were missing, implying that the videotapes are true; 2016's update opted for mislead to the public with a  more corporate purpose, preventing that any type of info about the unexpected sequel was leaked. For obvious reasons, it can no longer play with the minds of the audience saying that it is a found tape - this trick worked because was the beginning of the 'found footage'-, nor affirming that its characters are missing. It was in the Comic-Con 2016, where they revealed that the movie titled \"The Woods\" - a title of work- was actually a secret sequel of \"The Blair Witch Project\", a smart and functional marketing strategy.\r It abounds in the genre cliches, emphasizing original. A group of college students venture into the Black Hills Forest in Maryland, they camp one night, satanic twigs appear from nowhere, they decide to flee, get lost in the forest, tragedies occur, limited cast find that spooky house, thundering and simply copy sequence, tend. It is incredible to find so many accuracies, this sequel does not possess the required amount of originality to shine with its own light, so it hides behind the charms of the original. In addition, in the few minutes that it can shine, does it with risible twists and decisions, of which we must palliate if the scene was really worth.\r With a superficially simple and essential script, Barrett can treasure big connections that revolve around the film, such as time alteration, space deformation and powers of the witch. Less spontaneous and genuine, potential and excessive secrecy in Wingard's film is rewarded with a flawless sound design, few cheap scares and a surprising photography. \"Blair Witch\" revives behind the shadows of the past, however, gets to deliver some part of the excitement and intrigue of the classic horror film."
    },
    {
      "rating": "7",
      "text": "This was a very entertaining horror movie the atmosphere is their its just some of the actors dont make their roles believable instead they make you laugh at so of the stupid and unsmart things they do, it was very fun to watch and i was never bored but i also wasint amazed"
    }
  ]
}