{
  "id": 557,
  "title": "Blended",
  "starring": [
    "Adam Sandler",
    "Drew Barrymore"
  ],
  "runtime": 117,
  "genre": [
    "Comedy",
    "Romance"
  ],
  "description": "Recently divorced mom Lauren and widowed dad Jim let their friends push them into a blind date, which goes disastrously wrong. Unsurprisingly, neither wants to see the other ever again. However, fate intervenes when both Jim and Lauren, unbeknown to each other, purchase one-half of the same vacation package at a South African resort for families. They and their children are forced to share the same suite and participate in a slew of family activities together, where their attractions grows as their respective kids benefit from the burgeoning relationship.",
  "releaseYear": "2014",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/jvGN091oLHWXptuHEZab7Kj4ZFe.jpg",
  "categories": {
    "plot": 6.142857142857143,
    "acting": 6.0,
    "ending": 7.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 6.0,
    "funny": 6.515625,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "1",
      "text": "Boring, stupid and I forgot most of it immediately afterward.  Ironically it's kind of like Sandler's last 5 romantic comedies blended into 1 predictable, slightly nauseating movie.  That band that keeps popping up annoys me more than words can describe."
    },
    {
      "rating": "7",
      "text": "I enjoyed it it is a funny movie almost better then Grown ups 2 witch I liked. Blended seats on the number 23rd spot for my favourite movies of all time. It had funny jokes but it should have been M (PG 13 in USA) then PG in Australia with jokes about jerking off. It is funny and should be seen by people who love comedy,people who are dating,people who married and kids over 11. The movie has a lot of funny jokes and the story shows two people who hate each other coming together like a family."
    },
    {
      "rating": "2",
      "text": "1/5★   Lazy, unfunny and manipulative. I was hoping to see some of the Sandler-Barrymore chemistry but that must have fizzled out because there wasn’t anything real, aside from a very expensive vacation for the cast. I find it indicative of how Hollywood expects its leading ladies to look and what its leading men can get away with. Imagine if the looks were reversed- a lumpy, messy Drew Barrymore and a good-looking, in shape Sandler falling in love with her.\rVerdict: Skip"
    },
    {
      "rating": "0",
      "text": "I loved earlier comedies by this duo but this looks like they were here just for the paycheck.  Also, based on the screenplay, the writers must have been working on a tight deadline for their high-school drama class."
    },
    {
      "rating": "9",
      "text": "I laughed out loud quite a few times during this film.  That is starting to become a rare occasion with some of the crap put out these days.  Overall a good movie"
    },
    {
      "rating": "6",
      "text": "Some of the professional critics were far too hard on this movie. If you like Adam Sandler films in general you will love this one as usual. It's got the same cast of characters that were in grandma's boy happy Gilmore etc. Drew Barrymore has great chemistry was Sandler and Terry crews added just enough of a comedic injection. After having seen the very boring Godzilla last weekend this movie was a real treat. No it wasn't good enough to award it in eight or nine but believe me when I say you won't regret the laughs that you have in this 90 minutes."
    },
    {
      "rating": "7",
      "text": "Sandler's third rom-com with Drew Barrymore manages to be an entertaining and mostly funny experience. The romance feels artificial and forced, so it's the interactions with the children that will have you thinking \"aw, that's sweet.\" There are some laugh out loud moments throughout, but I'm surprised at how much of the early humor falls flat on it's face. It takes a while for things to get regularly funny.\r In a lot of way it's your standard Sandler flick. So that means if you're not a fan of his work then you shouldn't bother with this one. It's got it's funny and sweet moments, but it does noticeably have it's issues. Probably chief among them being that the Sandler/Barrymore chemistry that was on display in \"The Wedding Singer and \"50 First Dates\" is missing here.\r Still, it's an overall funny enough movie to make it worth a watch. So long as you're not one of those people who has a particular distaste for Sandler movies. It's rom-com that succeeds more with the comedy then with the romance. I did enjoy it though."
    },
    {
      "rating": "2",
      "text": "Kids under 11 might enjoy this movie, but I hope they stick to Sponge Bob instead. Really disappointing to see this couple performing like this, the movie scripts and acting seem to me really rushed, as someone said \"they were there only for the paycheck\" agree."
    },
    {
      "rating": "7",
      "text": "Blended es una película que si bien no será la mejor comedia del año, entretiene y es totalmente disfrutable.\r Esta película es un film que al final cumple con el objetivo que tiene cualquier otra película de comedia: dar risas. Además, se podría decir que aunque a veces podría sucumbir a volverse un tanto tonta, no se deja manipular del todo por ello, dando un resultado un tanto estimulante y cómico, por tanto este largometraje no se desvía al camino equivocado y logra brindar al público un buen entretenimiento."
    },
    {
      "rating": "8",
      "text": "If you are an fan of Adam Sandler's and Drew Barrymore's  collaborations in the past than Blended won't disappoint.\r Blended is about two single parents who had a not so impressive first blind date, and afterwords started to hate one another. After some forced plot issues that seam a little too farfetched to actually happen Sandler and Berrymore end up going on a vacation together with there children and are forced to spend there trip together. Once you get over the unbelievable setup and the movie starts focusing on the families interacting with one another this movie becomes a real joy to watch. Many reviewers criticize this movie for having some sappy 50's stile family values attached to the plot, any I would haft to agree, but I do in a positive way. If anything i found if they were to town down the adult humor of the film they could of got a more families to see this film, though I do find that with a lot of Sandler's films. There are scenes that are overly silly and over the top at times, but this film is meant to be a comedy.\r This film was made to be a fun filled and emotional story where people and sit back and have fun. I think a lot of people with todays critical eye cant see that anymore. I say just sit back and enjoy the film for what it is. I think you'll especially get a kick out of it if your the one who misses that days of family sitcoms."
    },
    {
      "rating": "7",
      "text": "It really wasn't that bad... There were lots of funny parts. Yes its not amazing but it was at least better than some of the Adam Sandler recent movies. It was at least enjoyable."
    },
    {
      "rating": "1",
      "text": "An offensive unfunny comedy that continues Adam Sandler's terrible run.  This garbage makes me wonder who came up with the idea to offend an entire continent by using smiling ridiculous shots of Terry Cruz dancing and singing about blending.  Congrats to my new worst movie of 2014.  F"
    },
    {
      "rating": "1",
      "text": "One of the worst movies I've ever seen. Better than some Sandler films (coughGrownUps2cough), but still AWFUL. The only reason I even rate it a 1 is because Joel McHale is fantastic and has the Jeff Winger dial turned up to 11. Everything else made me want to throw up."
    },
    {
      "rating": "10",
      "text": "Blended is an awesome movie. I went to see the movie with two adults and a 14 years old. We laughed the whole time. I laughed till I cried. There were so many cool people in this movie that made me laugh. Kevin Nelon, Laura Lumpkis ( form Orange is the new black) Bella Thorn, oh and Terry Crews so funny that he almost stole the entire movie. I never knew he was so funny. This movie is for people that have kids or were ever art of a Blended family like step kids , stepmoms.  half siblings and the like. It really gets to the heart of family in a real and authentic way."
    },
    {
      "rating": "10",
      "text": "Awesome movie. It was very funny and had a few sad moments.  It was better that I expected after reading some of the negative reviews. I'm glad me and my family went to see the move. We loved it!"
    },
    {
      "rating": "4",
      "text": "It is Adam Sandler...so...yeah...what more can I say?...Well, actually it wasn't that bad as in I want to kill myself! or what I am doing this to myself!!? (My reactions to Grown ups 1 & 2, Jack and Jill, etc). I would watch this movie in a flight if there is nothing else to watch, or in a lazy lazy Sunday when is free on cable."
    },
    {
      "rating": "8",
      "text": "I didn't have high expectations for Blended. It looked like it was going to be a painful watch through the first twenty minutes, but it quickly blossoms into a fun film. Adam Sandler and Drew Barrymore have been working together for almost 20 years now and this film is just as good as any of them. Sandler is a actor who has become one of the most typecast actors in the world today but his personality really works in this film. Blended is just a good family movie and its certainly underrated I can't believe that it has gotten such low ratings."
    },
    {
      "rating": "7",
      "text": "Critical masterpiece? Not even close.  Really good time at the movies?  Most definitely!  It is a family movie that borrows from great classics, which of course automatically makes a clone that critics hate on; but honestly who cares?  In the end, you will be thoroughly entertained by both subtle and overt humor.  Surprisingly, this movie is much more tame than most of Sandler's works, and it actually makes it funnier."
    },
    {
      "rating": "5",
      "text": "An incredible waste of time and talent, the only thing Blended benefits from is Terry Crews mildly funny performance, but even that fils to conjure more than a few chuckles."
    },
    {
      "rating": "10",
      "text": "this is my first time every writing a review but after watching this film i had to i was smiling this film brings so much joy you have to watch it all to understand"
    },
    {
      "rating": "9",
      "text": "This is just insanely good. I loved this movie from beginning to end. It was just another bunch of fun coming from the master of comedy Adam Sandler, it is also backed up with top notch directing from Frank Coraci. This film is worth the watch"
    },
    {
      "rating": "4",
      "text": "Adam Sandler has succeed at disappointing me with his films since 2010, and Blended failed to break the mold. The film follows two families who are stuck together while on vacation in Africa. The result is a hit and miss due to shallow, poorly timed jokes, terrible acting and a predicable, cliché formula. It was hard to see a potentially good comedic storyline go to waste. I was slightly entertained with some of the creative one-liners and simple jokes, but that’s it. Drew Barrymore was very distracting during the film because of her subpar acting and the fake character she portrayed. All the characters in the movie felt unrealistic to the point of not being entertaining. The conflict between comedy and what should have been a serious subplot, simply didn’t mesh. Emotionally, this movie would almost suck you in, then a lame comedic, very unnatural moment would ruin it. Blended is a mess that wouldn't be a tragedy to skip."
    },
    {
      "rating": "0",
      "text": "Another dud from Hollywood's most overpaid performer. Unfunny, unimaginative and generally another reason why Sandler has moved to Netflix. At some point, the studios need to start employing writers with talent, rather than the inhouse stooges that should return their pay, along with Mr Sandler."
    },
    {
      "rating": "5",
      "text": "Adam Sandler & Drew Barrymore (who looks frumpy throughout) play single parents who have a disastrous first date. Of course, their animosity gradually changes as they spend a week with their 5 kids in South Africa (a knockout location called The Palace of the Lost City). I'm not a fan of Sandler's sophomoric, goofy humor, but there's plenty here for his fans and young audiences (who often share that taste). It's energetic and high-spirited, just painfully predictable, low-brow and broad."
    },
    {
      "rating": "8",
      "text": "It was a solidly good Adam Sandler movie, not sure what people were expecting.   If you don't like Adam Sandler why would you watch the movie and expect something he has never done ?  (He did seriously good serious acting once in a serious film \"Reign Over Me\" however.)\r Its comedy, don't take it too seriously.  It was a pretty good Sandler film, definitely better than some I have seen, and I enjoyed it quite a bit."
    },
    {
      "rating": "5",
      "text": "watchable but not as good as the other sandler/barrymore movies.  WS and 50FD.  wait for video unless you need a film to take the family for wholesome entertainment. it is on the lighter side as far as jokes and romance goes.  this one is mostly about the kids and being good parents."
    },
    {
      "rating": "6",
      "text": "Most of these movies seen like an excuse for Adam Sandler and his friends to go on vacation, and they film a movie and hope to make some money from it to finance it."
    },
    {
      "rating": "5",
      "text": "Although Blended is not that horrible like most of Sandler's movies, it's not more than a silly comedy, with some funny but most ridiculous results. Blended however reminds a bit the mostly lost old Sandler's charisma, by the charming (old) chemistry between Sandler and Barrymore."
    },
    {
      "rating": "5",
      "text": "Sometimes I think critics have created a mindset they can never leave. A good example of this is that all adam sandler movies suck. Now he has had his up and downs in terms of movies. He has mostly had awful movies recently I am not going to lie. I walked into this movie with no expectation at all whatsoever. The first half of this movie was awful. There was a cute scene where adam sandler and his daughter were having a bonding moment watching cartoons in the bedroom but this scene wasn't until after we get introduced to the horrendous kid Brandon of Lauren who love ladies and lots of inappropriate stuff. the other kid was not so bad. However I wanted to punch some sense Into Brandon face. He just was not funny at all. Fast forward to the part where Jim and Lauren unexpectedly meet up in Africa and are forced to share the romantic suite. From here we meet the hilarious terry crews who shows up at the most random parts of the movie and has his choir sing and act on everything that's going on at random moments in the film. There were a couple of other cute scenes where Lauren and Jim bond with the others kids and terry crews makes one final hilarious appearance before the end. there are many other sweet moments shared between the families and to be hones this movie is miles better than pixels, grownups jack and Jill etc. Is it perfect no. Does the comedy hit the spot every time no. In fact some of the comedy is downright horrible. This is the closest I have seen sandler try to be within the kid friendly range sense bedtime stories. but the biggest problem I had with blended is that It can not decide what is wants to be. A juvenile comedy, or a family friendly comedy. Is worth buying no. Renting? yea. Check it out and see what you think. Overall blended shines in sports but tends to be overshadowed by lame juvenile humor that keeps this movie from being great."
    },
    {
      "rating": "10",
      "text": "Pro’sFunny movieGood for teenagers Con’s Not good for children This movie was a very good movie, I would recommend this for tennagers or adults. This movie is rated Pg-13 this is a very funny movie. It is about 2 hours long of a great movie. It has a good story plot in the whole movie. I got this movie for Christmas and haven't stopped watching this movie since. The first time I watched the movie I watched it with my whole family. It was a very funny movie but there was some inappropriate content. But the very funny parts, that made the whole family laugh. This movie to me didn’t have many flaws."
    },
    {
      "rating": "10",
      "text": "Blended is a great film. I enjoyed it so much. This is the third film that Adam Sandler and Drew Barrymore. This film is about two single parents named Jim and Lauren that go on a blind date that does not go well.When they  both get vacations from their boss and friend to the exact same resort and at the exact same time. They are both unaware that the friend and boss were in a relationship and the vacation was for there families. Which forces both of their families to vacation and share hotel rooms together. The reason why these two are single is because Jim's wife died and Lauren's husband cheated on her and is kind of a jerk. As the kids start to like each other and the parents as well the movie reveals that this resort is for families that want to blend together. Lauren has two boys and Jim has three daughters. And the movie shows the parents blending with the other kids and teaching them new things. This film ends with Jim and Lauren being in a relationship. This is one of my favorite films of all time."
    },
    {
      "rating": "7",
      "text": "Blended provides multiple jokes that will cause you to laugh out loud. The chemistry between Sandler & Barrymore elevate this film above the random few occasions where the humour relies on dated gross out gags that are commonly found in Sandler films.  Its no masterpiece but spending your evening watching this little gem won't leave you with regret. Special shoutout to queen Drew Barrymore who's acting gets better with very film and her confidence to sing an entire song shows how far she has come as an actress as true hard Drew fans will know that singing on film is usually avoided at all costs for miss Barrymore due to her own  doubt of ability. Barrymores rendition of 'Over the Rainbow' is melodic and beautiful.  Better stoned."
    },
    {
      "rating": "5",
      "text": "Most folks tend to find a hard line between comedy and slapstick. Hardly ever is there a movie that can balance the two, and succeed. There is, however, one man that goes to no bounds to try and captivate his audience, well...captivate is a strong word, in fact, I now regret using the word “captivate”.\rRegardless, the comedian i’m summing up is the talented and (sometimes) funny, Adam Sandler. The latest comedy, shockinlingy doesn't come from long time directing partner, Dennis Dugan. Instead, “Zookeeper” director Frank Coreci is taking the helm on the comedy “Blended”. “Blended” marks the third on screen appearance of the “dream team” and this time by “dream team” I mean Drew Barrymore and Sandler. Their last two films together “The Wedding Singer” and “50 First Dates” are timeless, and to this day I still value and appreciate those films. Partially because the chemistry between Barrymore and Sandler was so real. This time around in “Blended” while yes the chemistry is still there, after three films I have to admit, the on screen “magic” does fade away, and much like EVERY film of it’s genre before it, “Blended” falls into a slew of dumbfounded gags, that will satisfy a toddler. Oddly enough the film does have more sentimentality then you would think, and there is a decent comedic performance put forth by our two charming leads.\r Jim Friedman (Sandler) is a widower with three daughters, and Lauren Reynolds is a divorcee with two sons. The two are set up on a blind date then goes horribly wrong. One thing leads to another and well.. look we are in Africa. The audience never needs to understand how or why the two families end up in the same place, because..well that’s the story.\r At it’s best “Blended” reminded me of the days when Sandler would make genuine and quality films. Releasing garbage like “Jack and Jill” and “That’s My Boy” also in comparison, “Grown Ups 2” each of these films had benefits of their own doubt, but undoubtedly they all lacked that classic Sandler effect..that was..well… funny. Barrymore has not really made a film in quite some time, and I thought the on-screen romance was a bit too cliche for my taste, but believable enough to the point where I could surcomb to the flaws. The film has a somewhat family friendly rating, I don’t necessarily know If I would let my children watch some of the jokes in this film, which at times are extremely offensive, and the jokes leave no one unscathed. The African characters all fall into vicious stereotypes. However, I couldn't help myself but laugh at the timing of Terry Crews, and his signing capella group that showed up at all the awkward moments in the film.\r Besides, I never believed for one second this film was actually shot in Africa, because other than a few shots of Giraffes and Zebra’s thrown in. This was the worst set up of any “Africa” set I had seen. In the end, if speaking honestly, “Blended” is harmless and heartfelt. Well it maybe a little too crude and vulgar for younger children. Some families could find “Blended” to be a viable option for moviegoing. I would suggest to tread lightly. It’s nowhere near the levels of “Wedding Singer” and “50 First Dates”. But, if we’re talking comparisons it’s a much better Sandler outing in the last couple years. The film of course is extremely predictable, and goes in the exact direction most people would suspect. So never I was surprised. In addition some of the gags we’re just plain childish and I’m not going to conjure my time and effort explaining them to you. When it comes to the movie “Blended” use your best judgment, and decide just how much you like Adam Sandler.\r C\r By: Nate Adams\r Directed By: Frank Coreci\rRated: PG13\rRun-Time: 111 mins\rRelease Date: May 23rd 2014\rStudio: Warner Bros Pictures\r Thanks For Stopping By."
    },
    {
      "rating": "8",
      "text": "I liked this move.  I know what I am getting with Adam Sandler and I like him but this movie was an ensemble and I thought that Drew Barrymore and the younger actors in particular put in great performances.  I found the movie touching in places, laugh out loud funny at times, particularly watching Terry Crews being plain silly. This isn't a classic by any means but I enjoyed it and I enjoyed the work that the actors put in."
    },
    {
      "rating": "4",
      "text": "Blended for the most part doesn't feel like other Sandler films. It has very little comedy and lots of drama, which is not particularly strong in his films. Except for a few lines, Blended is mostly a miss with lots of empty emotion."
    },
    {
      "rating": "6",
      "text": "The third time this pair had come together for a movie and it does not look good at all. The movie can be enjoyed for its comedy, not for anyone's performance. The location (South Africa) was good, but not exposed well, instead make fun out of it which was expected.\r In earlier days I used laugh out loud for Sandler's jokes, he's not the same guy anymore, I barely smile now. And for Barrymore, she was one of my actresses (I believe still she's), but her recent movies are disappointing, or barely in entertainment business. Kind of attractive Bella Thorne in a tomboyish getup, hope to see her in many future projects.\r I heard that Dale Steyn does a cameo for a Hollywood and I did not know it was this movie until I saw him. He's a rock-star on the pitch, but when Sandler made fun out of him that irked me and then let it go as it just a silly movie. Like the old days' animation shorts for the TV, this film had collective pieces of comedic scenes. Individually very entertaining, but as a movie fails to assemble. Not for everyone, but manageable.\r 6/10"
    },
    {
      "rating": "4",
      "text": "Despite the fact that the movie is boring, cliché, predictable and most of the jokes are quite unfunny, it's still oddly watchable. If you're a fan of Adam Sandler you might enjoy it, but if not, you'll undoubtedly be better off with something else."
    },
    {
      "rating": "10",
      "text": "This movie was great. Adam Sandler and Drew Barrymore were hilarious together.  Several times during the movie I actually had tears streaming down my face from laughing so hard.  There were also some touching moments between the characters. Overall, I really enjoyed the film and would recommend it to anyone looking for a laugh."
    },
    {
      "rating": "10",
      "text": "Blended is generally a terrible film, mostly due to the lacklustre performance of comedy stars Adam Sandler and Drew Barrymore, however, Terry Crews is in this film and once again manages to lift it from a score of 0 to a score of 10 for me. Terry Crews shows that he is able to act in a wig, as well as in his home country, Africa."
    },
    {
      "rating": "2",
      "text": "Blended is the atypical, lowbrow date-night film you expect it to be. Surprisingly one of Adam Sandler's more recent palatable movies, thanks to his humanization by Drew Barrymore, the film still lacks any originality or substance. The script is repetitive, using extremely racy comedy in what is supposedly considered a family film. The premise of two broken families merging is not a new one, but the chemistry of Sandler and Barrymore would have been enough to create an entertaining film. Unfortunately the over abundance of stereotypes and prejudices mixed with a terrible misuse of themes causes this ship to sink. A promising niche date film turns into a vulgar attempt at comedy with family aspects present but not full accounted for. Blended is a blend of bland jokes and a tacky storyline."
    },
    {
      "rating": "8",
      "text": "Whenever I want to watch comedy movies, when I feel so sad and need to be laughing is the only name that comes to mind ADAM SANDLER and his team.I have watched all the movies and there is nothing else that makes me so happy and laughing in this life.Adam Sandler If a new movie comes out, even if it gets very bad points from the critics, it does not matter to me I love even the worst movie I love them very much All Adam Sandler movie are very nice to me.Adam Sandler movies, I have a sense of old comedy, so if you do it in a new movie, then you have a sense of comedies in those old movies.Drew Barrymore and Adam Sandler a very good duo saw it in 50 first dates movies before.I like this kind of stuff that is featured in this movie, which is tom character that is in 50 first dates movies in a place where I enjoy it in the movie.I liked it very much like watching my family almost 6-7 times and my family watched it more than once and still wants to watch more.the critics' points are low not important a movie you will enjoy very much."
    },
    {
      "rating": "10",
      "text": "Blender es una muy buena película, simplemente es increíble, la producción es buena."
    },
    {
      "rating": "4",
      "text": "Such a weak movie from Sanders,it was more than a joke,Just Go with It is way better."
    },
    {
      "rating": "10",
      "text": "♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤:;:;:;:;;:;:;:;:;::;:;:;:;:;:;◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇"
    },
    {
      "rating": "8",
      "text": "●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\"."
    },
    {
      "rating": "7",
      "text": "¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡"
    },
    {
      "rating": "6",
      "text": "⊙●⊙●⊙●⊙●⊙●⊙●⊙●⊙●⊙●■⊙■⊙■⊙■⊙◇¡◇¡◇¡◇¡◇¡◇¡◇¡◇¡◇¡◇¡◇¡◇¡◇¡$.$.$.$.$.$.$.$.$.$.$."
    },
    {
      "rating": "10",
      "text": "Like usual, this movie follows in the traditional path of greatness expected by the comedic duo pairing of Adam Sandler and Drew Barrymore. I love that it has family elements and themes and that the two of them play a couple that never seems like they could get along and yet find they have so very much in common that can't deny it. It was entertaining and had some hilarious dialogue lines. I found it thoroughly amusing in every sense of the word. I know that Adam and Drew have only made three films together so far, but with how wildly successful 3-for-3 has been, I'd love to see more come from the two of them.10 huge shining stars! ✨"
    },
    {
      "rating": "6",
      "text": "Blended had a very slapstick adam sandler style to it but was very slow. At times I feel they could've shorten certain lines to fit better. But the overall feeling I got from this movie was decent."
    }
  ],
  "recommendations": [
    "click",
    "grown_ups",
    "neighbors",
    "sandy_wexler",
    "50_first_dates",
    "sisters",
    "step_brothers",
    "just_friends",
    "yes_man",
    "the_wedding_ringer",
    "bedtime_stories",
    "just_go_with_it",
    "hubie_halloween",
    "ted",
    "funny_people",
    "friends_with_benefits",
    "night_at_the_museum",
    "zack_and_miri_make_a_porno",
    "the_longest_yard",
    "dinner_for_schmucks",
    "the_break_up",
    "forgetting_sarah_marshall",
    "this_is_the_end",
    "meet_the_parents",
    "knocked_up"
  ]
}