{"id": 3065, "title": "Blockers", "starring": ["Leslie Mann", "John Cena"], "runtime": 102, "genre": ["Comedy"], "description": "When three parents discover that each of their daughters have a pact to lose their virginity at prom, they launch a covert one-night operation to stop the teens from sealing the deal.", "releaseYear": "2018", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/uvlUQXg0AlpGzKukO11K7QtW3Yu.jpg", "categories": {"plot": 6.878787878787879, "acting": 6.576923076923077, "ending": 3.6666666666666665, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 3.0, "funny": 6.444444444444445, "action": 6.333333333333333}, "reviews": [{"rating": "7", "text": "Hilarious, entertaining with a few heartfelt moments to top it all off. Blockers is a smart comedy with great chemistry and acting from it's leads and something I'd definitely recommend to anyone looking for a few laughs"}, {"rating": "8", "text": "No idea why anyone would hate the movie. (beyond not wanting to see any nudity...its a comedy about sex...it is likely to have nudity...)  Now maybe some people did not know what movie they were going to see, but I liked it, and it was one of the better-written comedies of 2018.  It  had heart and a decent story, and was definitely funny, and maintained a good balance through-out.  Highly recommend if you in any way like silly comedies.  It was actually a really good movie for the comedy genre."}, {"rating": "7", "text": "\"Blockers\" was a very funny, wild and funny movie. Well, there are very funny moments and a very dynamic black humor. The characters were very good, but I did not think I would like to see the character of John Cena, I liked it better. although there were moments of drama that do not look good in the movie. For me it does not take away the humorous touch to the film."}, {"rating": "5", "text": "A comedy written by Actress/Director/Writer/Producer, the talented Kay Cannon who has been a producer on 30 Rock the Pitch Perfect films, Baby Mama etc. Much in the spirit of those films this film hits a sweet spot of a coming of age comedy flick.‍‍‍Plot: Three girl high ‍school seniors make a sex pact to all lose their virginity on prom night when thanks to the wonders of the cloud their parents become aware of their plan and pull out all the stops in an attempt to stop it from happening.To the point: This unlikely team up of John Cena, Leslie Mann and Ike Barinholtz mad for a very entertaining dynamic of characters in the given plot. Throw in Hannibal Buress, Gary Cole, Gina Gershon and Colton Dunn and you have a hilarious ensemble before you even arrive at the kids. Graham Phillips, Geraldine Viswanathan, Jimmy Bellinger all headlines pairings with great comedic timing and on screen presence. It’s probably been since Super Bad which was the last film I can recall that highlighted it’s young talent just as much as it’s seasoned veterans. The humor of this film ranges from subtle to extreme but balances a very well formed cast of misfits."}, {"rating": "8", "text": "\"Blockers\" is cathartically hilarious and singular; an unmissable parental odyssey through the world of the new centuryScreenwriters Brian Kehoe and Jim Kehoe sign one of the most lucidly witty and superbly developed comedy scripts coming from a major studio so far this year. It's not a lie that the core theme, but not the be-all-end-all, is potentially suggestive, in every sense of the word, however, the true surprise is the approach used to narrate this barrel of laughs. One of the greatest strengths that makes it win the viewer empathy is that this R-rated comedy is easily identifiable, either in the role of parent or son, such identifiability facilitates the connection between side and side to unfold the story with full confidence and fluency; whatever's about to happen, the audience is already in a state of affable predisposition. In that great basis, it gets another important support: its ability to exceed the low expectations that many put in this kind of audiovisual products. I'm not going to lie, I was genuinely shocked to hear about the reception of this flick at the latest SXSW Film Festival, an act that, therefore, multiplied my interest in seeing what this anomalous teen comedy was made of. And the annihilation of those expectations lies in a well-aimed script, again, not by its resolute pathos, but by the tools with which it's worth to relate a story about sex, one which goes beyond its own limits to focus on the fibers of motherhood and modern paternity, acceptance, maturity, understanding, overprotection, sexuality, tolerance, forgiveness and friendship. Sex is the undeniable, disguised McGuffin that helps to develop the plot and all the situations composing this amusing idea. They use inevitably present-age matters as incentives, and that is precisely what makes it so special and endearing, that you, your friend or neighbor can star this adventure: there are divorced parents, single mothers, homosexual characters, sex games, young \"chefs\" and repressed girls; there's diversity and the plot richness is there. John Cena had already left small hints about his acting aptitude with short roles,  however, it's possible to observe closely the comical beast this man of enviable proportions keeps secret with one of his few leading roles. Alongside him, an empowered charming Leslie Mann returns better than ever, an actress who didn't make a good decision selecting a role like her golden years in \"The Other Woman\" or \"Little Birds\" in a long, long time. It's good to see her again starring a high-quality flick, managing a delicious balance between naturalness and exaggeration by means of Lisa, an excellently plotted character that, by surprise, isn't portrayed as the typical spinster mother who dies in a bathtub with her thousands of cats eating her hair — even if she literally says so. — Mann easily fits in the trio of \"cock-blocking\" parents, endowing a special charm both the group and her character through a display of sincerity and strength; a great satisfaction to know one of the queens has returned reloaded. To date, Ike Barinholtz has been present in several major-studio comedies recently. Thanks to his long journey alternating in the series \"The Mindy Project\" and that movie catalog, the actor has found his own mark and has known how to use it in the right way. This time he plays Hunter, a divorced father who everyone knows for cheating on his wife with a nanny and for being a lousy paternal figure. At first, his character becomes a sort of retainer to the story, but some minutes later, transmutes into a delightful catalyst to the fierce spark to emerge and work without obstruction. As for the young cast, an impetuous Kathryn Newton, a surprising Geraldine Viswanathan and a depressingly interesting Gideon Adlon lead and manipulate this #sexpact2018, the three women permeate her character with energy and veracity, they're properly related to reality.Steadily facetious, with a light and clever narrative and charismatic and striking performances; \"Blockers\" by Kay Cannon disperses its weaknesses thanks to a limited, magnificent cast and a wisecracking script, using them to make an undeniably contemporary film, not necessarily by the presence of smartphones, social media, and emojis, but by the organic and trustworthy treatment applied on the story, displaying congruent and coherent attitudes to a 21st century in which, surprisingly, morality and amorality remain standing in front of feelings. Few aspects can be refuted about Universal Pictures' comedy that constantly activates the corner of your mouth and your most perverse sense of humor; an offering that stands out among the rest by its honesty and correct adaptation on the millennial generation through an open-minded prism. A breakthrough for the politically incorrect major-studio comedy, an example from which they must learn, understand and respect, not emulate and spoil."}, {"rating": "8", "text": "This is a movie only parents who has, or had teens to understand. A lot of funny moments but as always its in the previews. Cena was good, but still no DJ."}, {"rating": "10", "text": "I love it John cena❤️ He is perfect actor and de more  i love you so much ❤️"}, {"rating": "8", "text": "Blockers is a smartly written, raunchy comedy filled with a ton of heart and humour for everyone. While the story drags a bit at times and there are some questionable editing choices, the memorable performances paired with a deeply layered, thought-provoking story makes this a fresh and updated perspective for the coming of age genre. This film does so well thanks to its ability to tell the stories of the parents and their daughters equally with neither overshadowing the other."}, {"rating": "8", "text": "One of the best studio comedies of the past few years. Hilarious, and extremely entertaining, with a big heart, and great chemistry from 6 very funny leads. Hope it does well at the box office, don't believe the low score by audiences on here."}, {"rating": "9", "text": "Blockers is a rare comedy film that actually lives up to what it's intended to do(making audiences laugh). At times the film is hysterical, at other times it's touching, and at  the best of times it's both, which is a scarce trait seen in a comedy film these days."}, {"rating": "8", "text": "“Penises"}, {"rating": "9", "text": "Funnier than I thought it would be.  A lot of laugh out loud raunchy humor while still having some tender parent daughter moments.  I really enjoyed this movie."}, {"rating": "1", "text": "just got out of this movie and it is absolutely horrible. I am surprised the actors in this movie would submit themselves to this kind of professional humiliation. The only reason someone would say this is humor is the same reason people laugh at raunchy so called comedians. Can't believe I sat through this thing."}, {"rating": "1", "text": "One of the worst movies I've seen in a long time.  My wife wanted to leave after 15 minutes.  I convinced her to stay almost till the end, and finally gave up too.  We get it already... parents are idiots, kids rule, and oh by the way let's throw a whole bunch of gratuitous nudity into the mix.  If I wanted to see old men's asses and \"eggplants\", I'd hang out in gym showers.  I like all of the actors in this.  I'm truly embarrassed for them :("}, {"rating": "6", "text": "Decent comedy film. It's funny for the most part but uses the type of obvious unfunny American film comedy humour a little too often. The plot feels like its an endless cycle of setups and payoffs for mostly inconsequential jokes and it gets a little laboured but the actual story is fairly decent. The biggest issue though is that the film making is incredibly flat and bland, with the editing choices especially towards the beginning of the film being a little awkward. Its not a bad experience overall though."}, {"rating": "4", "text": "The plot for this film had merit, although implausible. Where it went wrong was misdirecting its depiction of parent-teenager relationship into slapstick and gross humor appealing to the somewhat inebriated 16-23 white male. Acting was mediocre, John Cena particularly. I believe a more sensitive approach, with targeted humor would have made a forgettable movie into something worth remembering. One last thing: when will directors/screenwriters realize that the nearly constant use of the words \"f**K\" or \"f**king\" degrades both the movie and the impact of the term itself. If they believe it reflects real life then its no wonder they can't produce a real movie."}, {"rating": "7", "text": "Lots of laughs way funnier than I thought it was going to be. Lots of crude jokes and funny scenes. Movie does still have heart and a decent story along with it which makes it a solid comedy film."}, {"rating": "7", "text": "Definitely funnier and better than i thought it would be.  Wasn't the biggest fan of the teenage characters other than John Cena's characters daughter.  Cena himself carried this movie I believe.  He was absolutely hilarious and definitely has a long career ahead of him if he keeps this up.  As for the story itself it never seemed to get stale to me, the jokes and comedic scenes were good.  It wrapped itself up with a pretty heartwarming ending on all fronts, and is worth your time and money."}, {"rating": "7", "text": "A comedy that is predictable and not too creative, but the relationships, likableness of the characters and jokes don't feel stale and are all good components of this movie. I thought Geraldine Viswanathan was especially good."}, {"rating": "7", "text": "Blockers was directed by Kay Cannon (Pitch Perfect) and stars Leslie Mann, Kathryn Newton, John Cena, and others. This was a nice surprise, because I mean...if you think about the plot of this movie, you wouldn't expect it to be good. I honestly didn't, and I was still skeptical even after it got a solid RT rating. But, this was a very enjoyable comedy. The plot is that a group of teenage girls make a pact to each have sex on prom night. The parents find out about it and decide to try and stop their daughters from having sex. And, as you might imagine, lots of challenges lay ahead of the parents if they really want to prevent the pact from succeeding. Not every joke lands in this one, but I laughed way more than I expected, and there were a few jokes that actually got me laughing pretty hard. The best thing about the comedy in Blockers, to me at least, is that it doesn't shy away from crude comedy. Some of it will gross people out, but it was right down my alley humor wise. Oh yeah, John Cena was easily my favorite part of this movie, and that is definitely something I didn't expect. t'd watch this one again, and I probably will. I still think that Game Night is a better comedy, but hey, it's cool that there have been a couple of solid comedies released this year."}, {"rating": "8", "text": "People say that Clock Blockers is a poor ripoff of American Pie when they saw the trailers, but they were wrong, Clock Blockers is clearly one of the most clever R-rated sex comedy films ever created. And trust me, this movie will lubricate you real good after seeing the philosophical outcome of it. [And yes, John Cena was good in that film...]"}, {"rating": "8", "text": "I wouldn't have thought of Leslie Mann, John Cena, and Ike Barinholtz as a headlining comedy trio, but they really shine here. Heck, the whole cast, even the minor characters shine.The whole thing's filled with some pretty clever lines and sight gags. The commercials play up the raunchiness, but the film is pretty heartfelt too, like the \"The 40-Year Old Virgin.\" But don't worry, you'll get your share of raunchiness. The commercials don't even hint at the best part."}, {"rating": "8", "text": "Watched a pre-screening of the movie and totally loved it. There were tons of funny gags and John Cena comes off as the best comic in the movie being the super nerdy, passive dad, a complete difference from his giant physique. Everybody in the movie sold their roles perfectly. The theater was laughing the entire time we were there. The only complaint I have is the editing. Some scenes seemed not so smooth in its transitions and looked cut off, maybe because it was a pre-screening, it was cut short. Totally worth it and thoroughly enjoyed it from start to finish."}, {"rating": "5", "text": "This has been promoted as the first teens-get-laid flick with the female characters in control. That's true, but it's less about the girls and more about their parents (John Cena, Leslie Mann, Ike Barinholtz). When they discover that their daughters have made a pact to lost their virginity on prom nite, they chase around trying to block them. There are a few funny moments (mostly thanks to Cena), but the script is much more focused on an empowerment message (there's even a blatant song to that effect). First time director (and writer of the Pitch Perfect trio) Kay Cannon has managed to squeeze some fun out of the film, but it never reaches the zaniness, hilarity or outrageousness that we've come to expect from this genre."}, {"rating": "4", "text": "God this movie is bad. Leslie Mann is probably one of the most annoying actor's in Hollywood and I'm still confused how she gets starring roles. Again we have another teen gross out movie but somehow made for parents. Too slapstick and too predictable."}, {"rating": "6", "text": "Mild comedy filled with cliches, few scenes are hilarious, overall the story is quite predictable and nothing surprises us. I initially thought that it would be a girl version of Superbad, but its not. I don't know why American teens are so obsessed with Proms."}, {"rating": "6", "text": "This is just an update of a story that has been seen many times. Almost everything is accommodated to our actuality and yes it's funny, the cast is good, the story is entertaining enough but there's nothing new in the formula. It works but to a certain extent.It's worth it, but understand what you will see so that your expectations don't interfere so much with the result."}, {"rating": "5", "text": "Not a great comedy movie. I was entertained throughout the movie but it was just trying to push the idea throughout the movie that parents should let their kids have sex and that ruined the humor for me."}, {"rating": "0", "text": "This movie is NOT stupid. It's RETARDED. So shallow, predictable, not funny, promoting moronic behaviors. How someone finds this funny is beyond me. This happens when a woman directs her first movie. It ends in a complete **** fest without any entertainment value."}, {"rating": "6", "text": "no one has ever got that before..BlockersIts a smart comedy with sensible writing on each character's perspective that resembles with practicality and still tickles the audience whilst connecting them through the same old \"generation gap\" formula. The adrenaline rush never wears off in this 102 minutes of journey whose real protagonist is the gripping and amusing screenplay by Brian and Jim Kehoe. Kay Cannon is surprisingly good on her debut as a director although the editing seems a bit eerrie which fortunately doesn't factor in a lot in here to be a bad cookie. There isn't much to provide on performance but still John Cena and Leslie Mann are hilarious on their role as worried and emotional parents with a decent supporting cast. Blockers isn't some out-of-the-park home run but it surely scratches some deep issues and raises appropriate questions coming off surprisingly meaningful and innocent than anticipated."}, {"rating": "5", "text": "One can appreciate the \"this isn't the story you think it is\" approach but it fails to do anything particularly interesting with said twist.  Otherwise the laughs are few and dull between."}, {"rating": "6", "text": "\"Blockers\" is a fun prom-night sex-comedy film about three parents trying to \"cock-block\" their daughters from losing their virginity. It does have a nice vibe to it, and it is enjoyable, however I never burst into laughter at any point during the film. The acting felt a little forced on behalf of a few people (Leslie Mann was especially a little irritating), and the film in general doesn't present anything really fresh or extremely original. A good watch nevertheless."}, {"rating": "6", "text": "Blockers is a serviceable comedy that has some real comedic bright spots. All the actors give strong performances, but the script is uneven with it's comedy keeping the film from being great overall a high 6. B"}, {"rating": "4", "text": "Man, the editing in “Blockers” really needed another pass.  I liked the premise enough, and it has actors that I like, but the end result is just a mess.  I give it a D, just don’t bother."}, {"rating": "7", "text": "“Blockers” is a well-intentioned and hilarious sex comedy that feels delivers plenty of laughs and food for thought."}, {"rating": "5", "text": "'Blockers’ is your usual American comedy with heavy drinking, sex, and crude slapstick throughout. However, at the very core of the movie, it has heart and some tender moments, which surprised me the most.John Cena plays the hunky father who is soft at heart. So soft in fact that he would not hurt a fly, because he will probably be afraid of it. It is a nice change of pace from the other roles he has played in the past."}, {"rating": "6", "text": "Fun movie, with lots of stupid jokes in it, but overall quite bearable and watchable. Not the greatest of movies and probably quite forgettable, but decent if you want just chill and laugh a bit."}, {"rating": "4", "text": "The movie starts out well: the plot is introduced and there are quite a few funny moments to keep you watching the movie. However, the more the movie progresses, the more I felt bored with this film. Way too many cliches, way too many parents' moments (e.g. \"my kid has grown up\") and those kind of predictable, boring things. You won't miss anything by not watching this movie."}, {"rating": "10", "text": "I showed Charlie this to teach him. He really liked it. Mr Bucket yelled at me after. Great movie! My favorite Character was Leslie Mann she always makes me giggle."}, {"rating": "5", "text": "Uneven movie where a lot of the jokes come across as just a mash-up of others in the same genre. Should of been better."}], "recommendations": ["the_five_year_engagement", "neighbors", "sisters", "the_family", "friends_with_benefits", "that_awkward_moment", "bachelorette", "i_feel_pretty", "step_brothers", "the_wedding_ringer", "the_cobbler", "a_bad_moms_christmas", "keeping_up_with_the_joneses", "forgetting_sarah_marshall", "palm_springs", "rough_night", "the_heat", "pitch_perfect_2", "the_dilemma", "central_intelligence", "sleeping_with_other_people", "wanderlust", "hall_pass", "knocked_up", "booksmart"]}