{"id": 3868, "title": "Blood Ties", "starring": ["Clive Owen", "Billy Crudup"], "runtime": 128, "genre": ["Thriller", "Crime", "Drama"], "description": "Two brothers, on either side of the law, face off over organized crime in Brooklyn during the 1970s.", "releaseYear": "2013", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/7tMuywiZUoaAihEIkCu3BAL1xPC.jpg", "categories": {"plot": 6.888888888888889, "acting": 7.076923076923077, "ending": 5.0, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 3.0, "funny": 5.0, "action": 7.666666666666667}, "reviews": [{"rating": "4", "text": "Shot in a 1970s style, Blood Ties certainly has the right look. The film features a great cast, that made me desperately want to see it, but the problem is that it's a very common tale and it moves along at a snails pace. Even with a story that's been done over and over again, Blood Ties still could have been something special, because of it's cast, but that didn't happen simply because it is one of the most predictable films I've seen all year. The film features two brothers, Chris (Clive Owen) a career criminal, just released from prison, and Frank (Billy Crudup) a New York City Detective, who tries to help Chris get back on his feet. Didn't I see this movie in 2007 when it was called We Own The Night? That film has the exact same tagline, but fortunately wasn't as predictable. Billy Crudup stars as the good brother and was the only interesting character in the film, surprising considering the film features two of my favorite actors, James Caan and Charlie Tahan. Unfortunately neither of them have a particular big or interesting role, as everything centers around these two brothers. The con is played by Clive Owen, who honestly seemed like he didn't want anything to do with this role. He is emotionless, uneven, and every time he has any kind of long dialogue, I thought I was going to fall asleep. The bottom line, one's a cop, the others a con, I wonder what's going to happen? What happens is exactly what you think is going to happen, so why even bother to watch this extreme disappointment?"}, {"rating": "5", "text": "Great on paper but never delivers what we expect. Extremely long, unoriginal (we've seen this story tons of times before), predictable and basically a copy of all gangster movies ever made. For those who watched Les Liens Du Sang, the movie in which Blood Ties is based on, we'll see the exact same thing they did in 2008, except it's in New York. Performances are great because the cast is superb but accents are bizarre (Marion Cotillard is Italian but speaks English with a French accent) and female roles are terrible (Lily Taylor is almost a figurant) and completely dependent on men. Funny since the most interesting thing in this film are female roles. Costumes and cinematography are quite good and soundtrack is nostalgic, even though it's forced and inadequate sometimes. Anyway, these technical aspects don't compensate the lack of development in the script and lack of creativity of the director, the once promissing Guillaume Canet."}, {"rating": "9", "text": "Ignore the mediocre ratings. This film is a gem. I'm in my mid-50s so I remember the 70s well. Unlike other period films that exaggerate the styles and attitudes of the 1970s, Blood Ties simply gets the 70s spot on correct. What a relief. The story is a complex interweaving of dramas involving a cop, his criminal brother, and the women in their lives. Those who think this movie are slow are looking for an action flick, which this is not. If you think Indiana Jones is a normally paced movie, then you might think this is slow. This is a drama that bothers to explore character, so that when the characters do things you know why. Rather than a series of nearly random set pieces as you get in crazy action flicks, here you get an actual story that is driven by the needs and desires of the characters who inhabit the movie. Imagine that. I think Zoe Saldana is the best actress in Hollywood and the sexiest to boot; it is a thrill to see her in something other than a super hero, action, or sci-fi flick. There is action in this of course. It's a violent film, but it is essentially a drama. Clive Owen, too, a great actor who doesn't get enough good roles. This film was a real treat. If you like films that maintain a tight story while at the same time embracing a broad cast of characters and their backgrounds, this movie is for you. I wish it were a TV series so I could watch it every week for years."}, {"rating": "9", "text": "I loved it. Some movies just make sense too much that they absorb you into their world. And Blood Ties is exactly that film. Clive Owen was great, I enjoyed his performance- it was very realistic. Mila Kunis is good as well. The story is very new- two brothers one is a cop and one is a criminal. I find films like this very refreshing and interesting. It's very rare you see a film like Blood Ties. But the film is slow and a bit boring at times but the film is worth the wait and the climax. Miss it and you will be missing one of the greatest dramas of the year."}, {"rating": "9", "text": "I really liked this movie.\r I don't quite understand the mixed and/or negative reviews.\r Clive Owen, Billy Crudup, and James Caan are all very good...as is the rest of the cast. Yes, this is a long movie. However, its length isn't a problem because the content is compelling...at least it was to me, anyway.\r I have brothers. All of my siblings are very different from one another...although not quite as different as the two central characters in \"Blood Ties\".\r Many years ago, my youngest brother dragged me (at his insistence...I didn't want to go) to a viewing of the just-released \"Blade Runner\". The critics hated it...I loved it. Now, it's (appropriately) regarded as a science-fiction classic.\r You can listen to the critics on \"Blood Ties\"...or, see it for yourself.\r This is a quality film with a terrific cast...among so many other less-worthy choices.\r Don't miss it...especially if you have one or more brothers.\r It rings true."}, {"rating": "5", "text": "Not even the solid cast can make it work. The lack of imagination is noticeable despite the good results in production and style."}, {"rating": "5", "text": "This is a crime drama film, which is quite slow paced, plot wise but half way through I felt it did become really quite tense. Themes covered include (somewhat obviously) family ties/sibling rivalry and trust. It is somewhat stylish, given the soundtrack, with various rock and pop hits, such as Sunshine Of Your Love by Cream, Do What You Gotta Do by Al Wilson, Then He Kissed Me by The Crystals, Money Is by Little Richard and The Long Way Round by Gerry Rafferty.It is fairly emotive and atmospheric in parts, such as one scene set on a beach during a misty day, in which we can hear a piano playing somewhat in the background. There are some fairly gripping fight scenes, mostly involving gunfire - one inparticular had me waiting to see if they'd play the Beastie Boys 'Sabotage' (a 1980s track) or something similar, as its quite gritty and had that sort of rebellious, anarchic feel to it. The camerawork is fairly swift and jerky at times, especially during the fast paced fight scenes, when it cuts from one camera, or angle, to another. Otherwise I'm not sure if anything about the camerawork came to mind.I felt that Billy Crudup did particularly well in his role, portraying Frank as a professional, dedicated cop, while also desperately wishing to see his brother in a better light and thus having to juggle his personal and work life. He seemed genuinely troubled by the situations he found himself in and he seemed to play his role quite convincingly. Its the interaction between Crudup and Owen (Clive Owen, who plays Chris) that make the film work relatively well.Other cast members include James Caan as the patriarch (father figure) Leon, who seems quite wise and philosophical to an extent and Noah Emmerich as Lieutenant Connellan. There are numerous actresses present too, including Marion Cottilard as Monica, Zoe Saldana as Vanessa and Mila Kunis as Natalie. I'm more used to seeing Kunis appear in jovial comedy films, which this is obviously not, so it was interesting to see her in a more serious role. She seemed to do well in her part, coming across as both nervous and wise/clued-up.Content wise, this film contains moderate violence, including gunfire and bloody injury shown, if only briefly. There is also a, shall we say 'liberal' use of quite strong language one or two racist or racism related references are made and there are sex and drug references too, so suffice to say it isn't one to be watched with kids around(!). This film has a 15 rating to reflect said content.To be fair, the film ends on a pretty tense and suspenseful, long drawn out scene, which involves a relatively fast paced car chase and a large, claustrophobic area with hundreds of members of the public unknowingly hiding the character trying to get away. I felt this final scene was quite well done and perhaps slightly thought provoking.To me overall, not including the ending, it seemed pretty forgettable and as such isn't exactly a brilliant film, although I imagine some people may well enjoy it more than I did. It is inevitably somewhat depressing and it took a bit too long for the story to build up much, so it didn't especially impress me but I wouldn't say its an awful film. Hopefully what I've told you will be enough to help you judge if this is something you may enjoy watching or not.No I wouldn't go out of your way to watch this. It does feature some decent performances, most notably from Billy Crudup (in my opinion, of course) but I felt it was a bit too slow for the plot to develop and it was a bit dark and depressing overall, so I didn't especially enjoy it, compared to other similar films. Its ok as an ocassionally emotive crime drama and it has an element of style or flair to it via the soundtrack but it just didn't quite work entirely for me personally, compared to other similar films."}], "recommendations": ["the_equalizer_2", "street_kings", "widows", "the_accountant", "broken_city", "a_walk_among_the_tombstones", "the_devil_all_the_time", "lawless", "rocknrolla", "child_44", "good_time", "bad_times_at_the_el_royale", "bone_tomahawk", "legend", "donnie_brasco", "drive", "the_infiltrator", "arbitrage", "white_boy_rick", "body_of_lies", "backdraft", "run_all_night", "hanna", "the_harder_they_fall", "a_most_violent_year"]}