{"id": 572, "title": "Blood Red Sky", "starring": ["Peri Baumeister", "Carl Anton Koch"], "runtime": 123, "genre": ["Horror", "Thriller", "Action"], "description": "A woman with a mysterious illness is forced into action when a group of terrorists attempt to hijack a transatlantic overnight flight. In order to protect her son she will have to reveal a dark secret, and unleash the inner monster she has fought to hide.", "releaseYear": "2021", "mpaaRating": null, "imageUrl": "https://image.tmdb.org/t/p/w500/v7aOJKI5vxCHotHvN8O7SR6SpP6.jpg", "categories": {"plot": 5.545454545454546, "acting": 5.2, "ending": 4.666666666666667, "soundtrack": 5.0, "cinematography": 10.0, "familyFriendly": 6.285714285714286, "funny": 5.0, "action": 6.333333333333333}, "reviews": [{"rating": "10", "text": "It's one of the best Vampire movies I have ever watched. The story is simple and well-structured. This movie is full of suspense, horror, thrill action, twist, and turns. I enjoyed my 2 hours completely. The internal plots are so heart-touching. A mother who is fighting her evil for the sake of her kid is such a clever and impressive point added in this movie. The character development is great, the acting is too good, the makeup of vampires is excellent and the all-over cinematography is great."}, {"rating": "10", "text": "What an enjoyable vampire movie! Loved this! Nothing fancy just action, blood, violence with a heart tug! I have nothing bad to say about this movie! Wish we got more like this!"}, {"rating": "9", "text": "An adrenalin rush with a humanized vampire reminiscent of the tragic kind introduced in the Swedish \"Let Me In.\" Only this one is a grizzly bear protecting her young and an uber air marshall aboard a hijacked airliner.  Tautly suspenseful even with lengthy flashbacks that fill in the story.  Moments of high suspense as we root for an anti-hero who is also trying to rein in her own bloodthirsty instincts."}, {"rating": "9", "text": "Created an account just for this Gem, I’ve never rated a movie before, but these Karen reviews got me feeling like I have to defend what’s overlooked...Ps: Watched with Subtitles and English Dubbed"}, {"rating": "6", "text": "(In honor of the you tube \"pitch\" guy from Screen Rant) Hey, do you remember that Jodie Foster movie with her on a plane? Vaguely. How about the one with Rachel McAdams and Gillian Murphy? Oh yeah the Wes Craven one, I kinda liked that one. Why do you ask? Well what if we made her character, wait for it...a vampire? Okayy? Blood Red Sky begins with the time honored movie tradition of beginning the movie at end, then taking us back to the events that got us to that point. A highjacked plane lands at an airstrip surrounded by police and out emerges from the cargo hold a young boy. Cue the backtrack. The boy and his mother, who appears to be suffering from cancer, board a trans Atlantic flight, that is soon taken over by terrorists. The mother is shot, and presumably killed, by a sadistic member of the terrorists (guess who becomes the main antagonist of the group..). Much to everyone's shock, she ends up much alive, or non-alive. So it's Air Force One, but instead of the president running around the bowels of the plane trying to foil terrorists, it's a vampire. It's such a ridiculous premise that you think it'll be some dumb, campy fun. The problem is that the tone is so earnest, it sucks (ha ha) the fun out of it. Do we need extended flashbacks detailing her becoming a vampire? The lead actress does well and the vampire makeup is very feral and animalistic. Her son has the most annoying performance since Sean Connery' s son in Outland. It's not bad. I'd say a B minus for a B movie."}, {"rating": "8", "text": "A surprising gem. The film runs a bit long but the story is interesting. Hijackers on a plane get a little more than they bargained for in the form of a vampire passenger. It was a cool idea and the main cast acted well. It reminded me of 30 Days of Night which was also a great film. This is well worth your time."}, {"rating": "7", "text": "Es una película de suspenso muy entretenida; la trama es decente y la acción es muy buena; el cine alemán es fascinante."}, {"rating": "2", "text": "A film with decent acting, let down by its lack of direction, plot contrivance and complete tonal consistency.The movie has no idea of what it wants to be and feels like three movies fused into one more then anything else."}, {"rating": "3", "text": "I couldn’t watch the whole thing. The plot was al over the place and the main character is unlikeable and has no personality, her being a vampire had no build up and was suddenly a fact."}, {"rating": "8", "text": "Una película con una historia interesante, quizá a algunas personas se les hizo larga, pero sinceramente me entretuvo bastante, si eres alguien con gustos muy refinados no la veas"}, {"rating": "5", "text": "Vampires on a plane.Kudos for the imagination, but let's just say the creators neglected how to balance the action movie with the storyline that's trying to make a dramatic effect with the mother protecting her child.Only in this case the mother is a vampire.I saw an overlong but thrilling story that failed to connect or accommodate its horror twist over the other motivations of the plot and, completely avoiding wanting to save surprises for viewers, delivers everything quickly and automatically, building a climax that looks more like Train to Busan than The Strain."}, {"rating": "1", "text": "The beginning is exciting. The acting from everybody except the protagonist women Nadja is bad to horrible. Lines come off very unnatural. When the action starts, the characters start to act dumb. One moment, the character is unnaturally strong, but when the plot requires it, she becomes unnaturally weak. The whole movie is a mess and that kid is infuriatingly dumb."}, {"rating": "3", "text": "Other comments have summed this movie up nicely. It's a **** show. It had a promising beginning, as its concept (the hijackers, not the vampires) is actually pretty cool. Then the woman turned into a **** vampire and it kind of lost me. To top it all off, the vampire lady then starts murdering everyone as the hijackers were probably thinking the same thing we were while watching this movie. \"???????? what ??????????\"Honestly even including the vampires the concept was half decent, they just had to then show a solid 40 minutes of murder."}, {"rating": "0", "text": "Absolutely one of the worst movies I've seen in quite some time. Basic 'monsters/vampires' movie mixed with a 'we're trapped on a plane' movie. Pretty lackluster, unsurprisingly and obvious plotpoints. A lot of blood for the sake of blood. Skip this movie unless you want to just see copious amounts of blood, screaming and violence with little point to it."}, {"rating": "6", "text": "Nada del otro mundo, cosas que se han visto en películas como Train to Busan, sin embargo, bastante entretenida."}, {"rating": "6", "text": "Un traitement globalement plus réaliste que d’habitude du mythe vampirique même si on a déjà vu ça ailleurs (notamment dans Thirst…) mais l’originalité réside ici dans le détournement de l’avion et la présence du gamin qui aide grandement sa maman… à ne pas s’énerver ou céder à la tentation…!Cela étant, on peut s’étonner que certains vampires ou disons, qu’un peu trop de vampires ressemblent plus à des zombis enragés (pléonasme) qu’à des vampires supérieurs (sans compter le délai entre la morsure et… la transformation !) ce qui laisse dubitatif à tout le moins…Enfin… la fin ne m’a pas vraiment plu, ce qui se ressent logiquement sur la note finale. Notons en outre que la réalisation est de temps en temps très malmenée avec du secouage de caméra (à l’épaule !) et un montage un peu trop nerveux… mais rien de trop alarmant, on a vu (bien) pire.En tout cas, l’actrice principale est très convaincante, les effets de bonne facture et le rythme est excellent : on ne voit pas le temps passer sur ces deux heures entières ! et on salue tout de même -malgré les défauts signalés- l’originalité de ces vampires dans l’avion !"}, {"rating": "7", "text": "Hey Streamers out there! It has been a busy few weeks, but that doesn't mean the streaming stops. This week we noticed the release of Blood Red Sky on July 23, 2021. The movie poster and caption peaked my interest, but the 2 hour runtime frightened me. I mean can I really pull myself away from the Olympics 2020 for a whole two hours? Well, I managed to do so and let's see how it turned out.Blood Red Sky is about a woman with a mysterious illness forced to protect her son when terrorists attempt to hijack their flight to America. I know you're saying... what illness does this poor, loving mom have? Well, that's for me to know and you to find out when you watch; but, whatever she has, I don't want. This movie is a mash up of a bunch of storylines we all enjoy. Hijacked planes, people fighting bad guys, and horror! Slightly creative but ultimately feels like a longer version of World War Z mixed with District 9 and 30 Days of Night scenes. It's a basic premise that takes a really long time to develop. And yet I know that I'm tired of these Monkey Loving terrorists on this Mother Fighting plane! *Samuel L. Voice* I will say the brutality of the terrorists was a little fun because a couple are familiar faces from other movies and shows. I'm looking at you Heat Wave/Mick Rory and Chidi Ajufo. Realistically, the actors do a good job of simultaneously making us hate the terrorists but also like them all at once. Otherwise, there's not much to the acting in this film but Carl Koch, as Elias, and Kais Setti, as Farid, do a pretty good job for their roles. Both are able to portray the severity, fear, panic, and empathy that the moment needs. I know that's confusing and intriguing at the same time.Needless to say, Blood Red Sky never needed to be made but I'm surprised that I'm glad it was. Honestly, I might have been a little mad if I'd paid to see this in the theater but for free, I'm pleasantly surprised. If you love a good vampire chase movie, then you'll enjoy this flick. Blood Red Sky keeps it interesting and full of anxiety throughout the movie, even though the storyline falls off hard midway through and the movie drags on for too long. If you're into horror flicks and don't mind the façade of a heist flick, I say turn to Netflix and check this one out with a bowl of popcorn. It's not must see TV but it won't let you down in a jam."}, {"rating": "3", "text": "My biggest thought during this movie is \"I wish they would push Elias out of the plane.\"  I'm sure we were supposed to be touched by his love for his mother, but I found him immensely annoying and supremely stupid."}, {"rating": "8", "text": "A woman and her son are on a transatlantic flight when terrorists commandeer the plane. Turns out she has “blood issues,” which transforms her into a vampire (flashbacks explain the origins). The film entertains on several levels. The aircraft’s takeover is stressful. The vampire twist ramps up the action. The strife between her mother’s instincts and her bestial impulse adds a touching layer of drama. Even so, the tension stays taut, while the script keeps tossing in surprising turns. Pure popcorn fun with blood, violence and vampires. (German dubbed into English)"}, {"rating": "5", "text": "Aeroplane is hijacked by terrorists who frame the Muslim passengers onboard but another of the passengers is a vampire who tries to help and protect her son but makes everything worse by turning the terrorists into vampires."}, {"rating": "1", "text": "It had an interesting concept, attempting to combine horror and thriller, but failed miserable within 30 minutes. Absolute sh*t show. It is beyond me how this reached #1 on Netflix. Complete waste of time"}, {"rating": "6", "text": "It's an interesting premise and it makes for an OK B-grade horror movie. It's a little over-indulgent with the gore and blood. It's also a bit long and overstays its welcome; the editing could've been tighter and the film shortened to better effect. I felt a little desensitized to all the gore and violence as the film went on, and I just wanted it to end."}, {"rating": "4", "text": "Starts with great promise and intrigue. And quickly devoles into bad decisions and poor pacing. When the main character is unveiled as a vampire (that twist is ruined by the films own poster and artwork) instead of tearing the hijackers to ribbons to protect her son she spends the entire movie flopping about the plane, moaning, whinging and generally doing the opposite to what she should be doing. Very disappointing."}, {"rating": "7", "text": "This movie is probably best watched without seeing the trailer or any synopsis. I had no idea of what to expect, and it was gripping until the end.It's a very violent movie, but the acting was high quality, and there is a noble theme throughout which lifted the mood of the movie out of the pits. The plot is slick and kept me guessing.My only qualms were a few plotholes. Overall, I recommend this film wholeheartedly - as long as you're not squeamish."}, {"rating": "0", "text": "This is a absolute garbage!!!! THE CHILD is a mess for the society, is like an overpowerd careacter from an anime whith no buildup , he is acting like he is superman, my eyes are burning after this , and the final is spoiled in the beggining, don t meke the same mistake like me, this movie is just a clik-bait!!!"}, {"rating": "8", "text": "Real fast and unexpected turn outs! Amazing casting, with strong character building for at least the 2 main protagonists"}], "recommendations": ["47_meters_down", "daybreakers", "priest", "the_forest", "28_weeks_later", "resident_evil_apocalypse", "30_days_of_night", "crawl", "the_purge", "mirrors", "revenge", "the_shallows", "leatherface", "would_you_rather", "underworld_blood_wars", "doomsday", "case_39", "army_of_the_dead", "brightburn", "devil", "splice", "the_predator", "the_crazies", "frozen", "mama"]}