{"id": 1534, "title": "Bloodshot", "starring": ["Vin Diesel", "Eiza González"], "runtime": 110, "genre": ["Action", "Science Fiction"], "description": "After he and his wife are murdered, marine Ray Garrison is resurrected by a team of scientists. Enhanced with nanotechnology, he becomes a superhuman, biotech killing machine—'Bloodshot'. As Ray first trains with fellow super-soldiers, he cannot recall anything from his former life. But when his memories flood back and he remembers the man that killed both him and his wife, he breaks out of the facility to get revenge, only to discover that there's more to the conspiracy than he thought.", "releaseYear": "2020", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/8WUVHemHFH2ZIP6NWkwlHWsyrEL.jpg", "categories": {"plot": 4.588235294117647, "acting": 3.25, "ending": 6.0, "soundtrack": 5.0, "cinematography": 9.0, "familyFriendly": 5.5, "funny": 5.8, "action": 5.125}, "reviews": [{"rating": "8", "text": "good movies , not bad .The story line of the movie is great. Honetly I was expecting more from this movie. The main charecter in the movie however seems invencible, I didn't enjoy the fact that much that he was pitty much undistroyable."}, {"rating": "6", "text": "The action sequences are well shot, and the story entertaining enough. Vin Diesel is always worth watching. But don't think about it too much, because the plot holes are enormous. A decent enough time if you have a few hours to kill."}, {"rating": "7", "text": "Entertaining!decent story simple as origin story but twist was amazing and fast paced it was engaging.music was good and the action was amazing the visuals were stunning the start fight and climax fights were slow-motioned but skeptical to watch and the regeneration body was thing we need just like venom's symbiot. the little puns were laughable and good acting by eiza whereas vin was vin always!overall entertaining superhero flick!"}, {"rating": "5", "text": "It wasn't a trash movie, but it didn't have any flare or any thematics that truly spoke to the audience.  It was just an average( to below average) movie."}, {"rating": "5", "text": "I'd like to start with... YOU ALL BETTER APPRECIATE ME RISKING LIFE AND LIMB TO SEE THIS MOVIE!!! The CoVid-19 is upon us and we should all wish we had nanotech inside of us to get rid of the virus. Needless to say, you're here for a review of Bloodshot and not more coronavirus warnings. Bloodshot features, the one, Vin Diesel as a top secret ops solider that was slain and re-animated by a company for their long awaited super soldier tech experiment. Sounds all too familiar in the world of comics. Vin stars alongside Eiza Gonzalez, as K.T., Guy Pearce, as Dr. Harting, and Lamorne Morris, as Wigans.Let's get this out of the way. No, the story isn't creative, profound or that interesting. BUT if you were going to the movie because of that, you must be sick with the Rona anyway. I think, however, should this movie make money through the pandemic, we definitely could see a sequel. The important and worth-seeing part of this movie is the technology and the action. First, this movie looks very good. The changing of scenes, brightness etc are so crisp. The nano-tech at times looks basic and almost too similar to another movie's bots. Second, the action sequences, even though I wanted a few more or longer sections in the first half of the movie, are all very cool. Vin, Eiza and others all have at least one awe-inspiring fight sequence worth watching. If anything towards the end of the movie, the CGI begins to fall apart and look too much like a video game compared to the previous scenes. On top of that, the final action scene is way more anti-climatic and underwhelming than built up to be.Speaking of Eiza, she really jumps off the screen. She presents a great mix of beauty and beast throughout the movie. In fact, her action sequences, to me, overshadowed Vin's best action sequences. In fact, Lamorne also steals the show from Vin. Lamorne's character, while a bit annoying and stereotypical hacker, was quite entertaining. Now that I think about it, every other character and actor displayed either more interesting, more authentic, or more dynamic acting ability than Vin. Vin is good at giving us Dom but he gave us robo-Dom in this movie and that's just not enough.Ultimately, Bloodshot is a dud of a movie but solid entertainment. As an introduction to a \"hero\", I'd honestly give the second movie a better shot at being much better than the first. For those of you that only care about the action, check this out in a matinee and you'll be fulfilled. Everyone else, this is one of those single popped popcorn kernel movies that you may enjoy on FX on a boring Saturday or Sunday afternoon."}, {"rating": "9", "text": "Loved it! Damn why the box office so low? This movie was awesome! Could have been longer though."}, {"rating": "10", "text": "A nice to watch action movie, with tech, action, weapons, soldiers and programmers."}, {"rating": "9", "text": "A brilliant film. One of the most original plots for a movie I've ever seen. Great effects taken down by sometimes subpar mumble acting from Vin but other than that it's amazing. Definetly worth checking out if you haven't all ready"}, {"rating": "5", "text": "Fine, just genetic. For every guilty pleasure or creative moment there is a cringy or bland one. Feels and looks like it was made in 2004, for better or worse..."}, {"rating": "4", "text": "God, Vin Diesel is a really bad actor. Up there with Steven Seagal but worse.  This movie would have been half-decent without him. The very irritating humourous light relief ( Awful, worse than Diesel) or the weakness of the scriptwriters didn't help either. But the concept was still good and overall a not terrible if you can pretend Diesel isn't in it."}, {"rating": "9", "text": "This is a very fun popcorn movie with many transhumanist elements and with a badass character."}, {"rating": "10", "text": "The whole film is a tribute to the films of the 90's. But the film looks cheerful and very high quality. I speak only for myself. The film is worth a look, at least once."}, {"rating": "7", "text": "Because the decision was made to reveal Bloodshot's main story hook in the trailer all the movie really has to go on are its visuals as we basically know how everything is going to play out ahead of time. Luckily they are up to the task. First time director David Wilson had previously done a lot visual effects work for various video game related projects and even Age of Ultron. Everything looks absolutely fantastic and hyper-stylised as a result. Witnessing Vin Diesel have body parts blown off and reform in a cloud of nanites never gets old. A good thing too as this hero is entirely defined by his powers in this first outing.In a detrimental move the film is so focused on the action at hand that we never get to learn who Ray Garrison is as a person. As the intended starting point for a new cinematic universe, this shows a troubling lack of insight as to what led to the MCU's near instantaneous success. It wasn't the pre-existing popularity of the characters being adapted that captured everyone's enthusiasm, but rather the fact that we all felt like we got to know Iron Man when he first popped onto the scene back in 2008. So little was revealed about anyone in this movie that I don't even have a clue as to what they're plans for the rest of their lives looked like after they drove off into the sunset.Some goofs were made that will make it harder for people to connect with the world that's being established here going forward. Although, as someone completely unfamiliar with Valiant Comics this was a decent enough effort to pique my curiosity. These superheroes were clearly envisioned with unique ideas for powers and the content is far edgier than the majority of its contemporaries outside of Deadpool and maybe Harley Quinn (haven't seen that one yet). Some improvements will definitely need to be made in future installments should this universe be able get off the ground, but for all its faults it's the start of something new and that's pretty exciting."}, {"rating": "0", "text": "Bloodshot is the latest attempt by a studio to potentially start another cinematic universe and in this case, the Valiant Comics cinematic universe. The film stars Vin Diesel as the titular character, Ray Garrison (didn't even remember his actual name), who is brought to life by an advanced technology that gives him the ability of superhuman strength and fast healing and with these abilities, he will go avenge his wife. However, He soon comes to learn that not everything he learns can be trusted.One positive thing I can say about this movie is that the concept itself is really interesting. The main character's ability is cool and the premise itself is intriguing enough even though the trailer spoils it. Anyway, that is it. I love Vin Diesel because he sounds like an amazing person in real life but my god he sucks in this movie. His delivery for what is meant to be an emotional scene is so laughably bad. For example, his wife dies in front of him and he shows little to no emotion and its just so hilarious. Most of his scenes are either him being quiet or just yelling all the time and it is just so bad. The plot is also dumb and butchers the premise by making it become a generic sci-fi action movie. The bad guys are obvious and the good guys are also obvious right from the get-go which makes any twist feel dull. Apart from the titular character, none of the character motivation seems to make any sense. Good guys helping the main character just because they are good guys and bad guys doing bad things just because. You never really understand why any of these characters are doing things. Additionally, there are just so many scenes of endless exposition that dragged and feel like info dumps just because they want to treat us, the audience, as if they are stupid or something. The action scenes are also edited with rapid cuts that are just annoying. There is also so much CGI in all these very noticeable action scenes. To be fair the action scenes are so dumb that they are kind of fun to watch. There is an action scene where a CGI Vin diesel, yes you heard that right, is punching someone in an elevator while they are falling is kinda amazing. For David S. F. Wilson directorial debut, he did a terrible job. One nitpick of a terrible film, there was a scene in London where it was clearly not London and that baffled me so much because why did they have to call it London? There was no reason for it...Overall, this movie is the dumbest movie I watched in ages. This is a movie that feels like it came out 20 years ago and honestly probably should have never been made. However, this movie is so bad that it is kind of entertaining. My recommendation is to watch it drunk or with friends/family just to tear into the movie because you want a bad movie. However, if you're looking for an interesting superhero movie then I can safely say this isn't it."}, {"rating": "1", "text": "This is basically Universal Soldier 2020. Nothing new or original, just a poor attempt at it.Guy gets killed, and get´s revived by a billion-dollar corp that ends up becoming his main enemy. It´s all done before. This movie steals from other movies. I sadly lost interest halfway trough. Super predictable from the first 10 minutes.Spend your time somewhere else."}, {"rating": "6", "text": "IMO it's not a good start of VCU but kind of entertaining i guess! 5,5 but there's no 5,5"}, {"rating": "8", "text": "it's a fantastic movie. The plot is very interesting and the characters are very realistic."}, {"rating": "2", "text": "Generic and poor. The only good thing about this movie was given away in the trailer."}, {"rating": "10", "text": "Honesty was not expecting much but this is a really fun movie to watch. It’s your typical Vin Diesel movie. It’s like Fast and The Furious but with superpowers. Worth the watch"}, {"rating": "6", "text": "I found Bloodshot, a film adaptation of the Valiant comic book superhero, to be a so-so film. The sad thing about this movie is that it is one of those movies that are so close to be being a good film but can't quite reach.There are several positivie parts in this. There are some clever or funny lines of dialogue. Undone's Siddharth Dhananjay is the standout in this as a comic relief coder.I give first time director Dave Wilson, who is a video game cinematics guy, does a pretty competent job cinematography/visuals-wise for his first live-action work. The whole thing looks great, except maybe for some CG effects that stand out too much. The villains' technology is well designed and thought out. Fight scenes work well; the first one in particular is really impressive.However, the plot never grabs you. I didn't feel involved in Bloodshot's journey or in anticipation for what happens. The script just wasn't interesting enough. For every line that works there is one that doesn't. The villain's plans feel undercooked. The most frustrating part is that Outlander's Sam Heughan's character's animosity toward Bloodshot feels so painfully forced and unnatural.I could see many people liking this more than me. Like I said, there are some good parts. Just have lowered expectations when going into this. I don't think this is bad, per se. It just doesn't leave a mark. I have no plans to revisit this in the future."}, {"rating": "0", "text": "Oh goody, another movie where vin diesel is whacking himself off cause hes such a hardass who never dies, never gets injured, never has any emotional problems, never even gets a paper cut cause hes such a macho steroid injecting manly man.Would this clown please go to the unemployment line of hollywood and take his f&f movies with him? They stopped being good at 3."}, {"rating": "2", "text": "Não sei como ainda há filmes como esse em pleno 2020. Vamos lá...Antes de tudo, precisamos entender a proposta do filme. Claro que não se deve esperar muito de um \"blockbuster\", com o Vin Diesel - ator de um papel só - o protagonizando. Se você espera pancadaria, existem filmes muito melhores que te entregariam isso. Agora, se tu quer pastelice, corre que tu tá perdendo tempo! Aqui não há historia, desenvolvimento de personagem, boas coreografias de lutas ou plots interessantes - ao invés disso, te entregam tudo de bandeja assim que possível. O que temos é alívio cômico forçado, um amonturado de slow motion nas bagunçadas cenas de luta, show de caretas por parte do protagonista, personalidade vazia por parte de todos e efeitos especiais duvidosos para um orçamento do nível. Apesar da câmera não ser tremida ao ponto de vomitarmos, como em alguns filmes de ação alheios, a fotografia ainda é bagunçada - principalmente quando o Vin Diesel precisa entregar algo mais \"improvável\". Inclusive, ele já não parecia muito forte ao redor da trama, mas com essa técnica, tudo piora quando a \"fidedignidade\" da sua força não é posta a prova. Voltando ao assunto, não há planos mais longos, nem coreografias que realmente exigem treino por parte de toda a equipe, eles apenas jogaram o mais safe possível, e isso simplesmente não cola mais. A ideia do uso corporativo dos poderes do soldado Ray é até interessante, mas é usada de uma maneira tão pobre e sem inspiração que morre rapidinho. O plot inicial até tenta se estruturar, mas antes que você pudesse bolar qualquer coisa que te inserisse na trama e te desse aquele choque de realidade, o diretor não confia na sua historia e é precoce. No final, nem ele mesmo acreditava no projeto."}, {"rating": "7", "text": "I mean , it's got a story and potential to build up like Valiant Cinematic Universe or whatever , Vin didn't really seem like Bloodshot for first half of the movie , ( i'd prefer Jason David Frank for Bloodshot , but here we are ) , But can't blame it on vin too much. It's an OK start for valiant comics' Cinematic Universe , so it's understandable they wanted a recognizable name , i'd say like a 6.8/6.9 (rounding it up to 7) . would've given a 5 , but i liked the intensity of the film towards the end ( best part of the film). some parts of the film didn't feel as polished ( or upto the mark ) at the beginning of the movie , but i really liked the effort by the VFX team towards the end."}, {"rating": "4", "text": "“Now, tell me, do you remember anything?”Sadly, audiences won’t remember much from this dull, run-of-the-mill superhero flick. Squandering an intriguing premise for a drab 108 minute runtime, the cliché-ridden screenplay is less self-aware and much dumber than it believes itself to be, resulting in little substance and an inconsistent tone that reeks of another box-office bomb, John McTiernan’s ‘Last Action Hero’. Attempting to send up revenge tropes with some inspired genre subversions, first-time feature filmmaker Dave Wilson introduces several grandiose themes, yet, like our generic protagonist, has very little to say about any of them. Despite the best efforts of a committed cast alongside our brooding star, including solid performances from the talented Eiza González and a perfectly cast Guy Pearce (what was the name of that Nolan film again?), and some gorgeous visual effects work, moviegoers and comic book fans deserve much better and will be left wondering why this wasn’t adapted as a video game.4/10 techno babble dumps."}, {"rating": "10", "text": "The twist alone is worth the 10. Vin Diesel brings action and other things. The villains do enough for you to want the good guys to win. The CGI is extremely pleasing. Not a marvel level film (although better than some of their bad films) but definitely on par or above most DC movies (except Batman and Wonder Woman ones.) All in all car chases, shootouts, tensions, drama, explosions, cybernetics like amazing Spider-Man 2 but done better and a great action movie overall."}, {"rating": "10", "text": "Film mi się naprawdę podobał, świetne efekty, sceny walki. Aktorzy też świetnie sobie poradzili"}, {"rating": "8", "text": "I enjoyed Bloodshot. There, I said it. I understand people are critical of Vin Diesels performance, citing that he's just too angry or whatnot. Well, his character is grappling with a tremendous loss and who wouldn't be? Not every movie has to be \"thought provoking\" or saturated with identity politics. Just take it at face value and stop expecting The Great Gatsby when it comes to an action film."}, {"rating": "3", "text": "One must assume that while the world is at the mercy of a global pandemic and every other high profile film release on record is being delayed, the producers behind Vin Diesel’s ‘Bloodshot’ simply decided to say “ahh the heck with it, just put the movie out and maybe we’ll get a bump in market share.”What’s the worst that can happen?  The film opens poorly, just as everyone already suspected it would?The problem with ‘Bloodshot’ is that there’s nothing we haven’t seen plenty of times before.  Vin Diesel in a white tank top?  Check.  Man gets killed, brought back to life using cutting-edge technology making him stronger, faster, and more resilient?  Check.  Man uses newfound abilities to go on a revenge spree and avenge the murder of his wife?  Check.Perhaps we should be lauding Vin Diesel for getting paid millions of dollars to play the same character for twenty years.  The only problem is that him doing so forces film critics like me to watch his movies.  Ray, his character in ‘Bloodshot,’ isn’t interesting at all—either before or after his transformation.  It’s just Vin with a different three letter name, like a dozen other characters he’s played recently, featuring the same brooding look and tough-guy mannerisms.Instead of going to the movie theater and potentially catching coronavirus—or worse, having to sit through ‘Bloodshot’—stream some other similar (and better) flicks instead, such as ‘Hardcore Henry’ or ‘Upgrade.’"}, {"rating": "0", "text": "Bloodshot wasn’t what I expected. Not only did the trailers give way too much away it wasn’t worth watching in theaters. Save your money and wait til it comes out on dvd."}, {"rating": "2", "text": "This is a cash grab. Either the comic book or the studio decided to sell out. The movie was a generic movie that you could have seen anytime. In today's day and age a blah movie like this should be made fun of. I only watched it because my plans for the evening were cancelled last minute. The casting as Vin Diesel as the lead did not do the comic justice. I kept trying to match him to the comic but couldn't. Almost any other actor could have starred in this film. Overall this movie was a pass."}, {"rating": "0", "text": "This has to be a joke. It’s absolute sh*t. A NYC cabby can write a better script than this garbage. Vin Diesel was the ticket for this movie and I hope this doesn’t completely kill what’s left of his acting cred. Poor show...poor poor show."}, {"rating": "3", "text": "Another flat and unimaginative adaptation of a comic with a bad and too old action star. Vin Diesel should consider changing the genre. No one needs these cheap-looking action movies."}, {"rating": "1", "text": "This is the Slender Man of superhero movies. No joke. It's that bad. Luckily, its also hilarious."}, {"rating": "10", "text": "What's not to love!! Vin Diesel, Valliant Comics!!Epic Combination!!!!The First movie of the Valliant Comics Universe. This is what Fans have been waiting for, for many Years!! The Movie is really Great Fun!!"}, {"rating": "2", "text": "Bloodshot is a poorly paced film clearly shot on a very small set that fails to take advantage of a decent lead in Vin. It's a low budget movie based on an overrated comic so it's not surprising to see it be the disappointment that it was. I feel like even comic fans would be annoyed with how unoriginal and how uninteresting it is.Just a tip: Maybe next time don't waste a 1/3 of the runtime on a needless backstory when you honestly could have just jumped into the action straightaway and not miss a beat."}, {"rating": "9", "text": "Much better than expected.  Very similar pedigree and pipeline as Deadpool 1 with similarly 1990s-early 2000s results.  Redbox DVD contains behind the scenes features.  On-set morale looks high.  Lots of talent here and many producers making sure everything works.  Same 2nd unit stunt unit Vin uses on all his films (high quality).  Also looks like elaborate, detailed pre-viz done, not common for efforts like this, but was also done for Deadpool 1.  The ending was re-shot and re-cut entirely to much-improved effect.   Like Constantine, one of the under-rated, well-written superhero movies."}, {"rating": "0", "text": "very very bad movie does not have a good plot, the characters do not contribute much and the actors super bad very very bad movie does not have a good plot, the characters do not contribute much and the actors super bad,no recomendable"}, {"rating": "1", "text": "Bloodshot is not worth your time. They spent all their budget two action scenes. The story and characters are like the npcs you find in any game. Lifeless and uninteresting. I wouldn't even call this a b-grade movie, but then again they did have vin diesal and 2 action noteworthy action scenes. This movie would not have done well at the box office, no matter if coronavirus hit the world or not. It's barely mediocre, and probably not even."}, {"rating": "0", "text": "its bad its bad its bad its bad its bad its bad its bad its bad its bad its bad its bad its bad"}, {"rating": "4", "text": "Bloodshot is a bad movie. But, it has some action scenes which makes it just below average. But still, don't watch it. It's not worth it."}, {"rating": "0", "text": "Third grade movie that is degrading to the Indian community. Wonder how the Indian guy agreed to accept a role like this where his country is an object of ridicule."}, {"rating": "7", "text": "While not amazing, this is still a really FUN adaptation for any fan of Vin Diesel or the Bloodshot comics!"}, {"rating": "3", "text": "Not even the charisma of Vin Diesel makes it possible to recommend the great waste of time that was Bloodshot."}, {"rating": "1", "text": "Almost unwatchable nonsense! Unsure why money was spent making this even!  Watch something else!"}, {"rating": "9", "text": "I really enjoyed this movie, the Atmos audio is incredible, reference quality, and as good as Blade Runner and Mad Max, it adds so much to the movie. The 4K version is also stellar quality and has nice stylised colour throughout the film with lots of vibrant reds and blues.The film itself is fun and action packed, it reminded me of a good old Schwarzenegger 80s action movie, in a good way, the story is pretty basic but carries well throughout the film and Vin Diesel plays the character effortlessly, there is some humour and plenty of bombastic action scenes which are great with the sound turned up. Its more of an action movie than your typical by-the-numbers  superhero movie. The CGI and special effects are really well done, apart from the elevator scene at the end which is a bit too CGI heavy and cartoon-like, I thought it spoilt the immersion a bit looking too artificial looking but otherwise its a great action film, and I would be interested in watching a sequel."}, {"rating": "6", "text": "Some really good action scenes. Vin Diesel will be Vin Diesel, not much of an actor but he can do action. Some really serious plot holes prevent this from actually being a good movie, but it's pretty fun to watch nonetheless."}, {"rating": "5", "text": "Bloodshot is a typical broish action flick that really adds nothing to the superhero genre. Overall decent special effects but it is slow paced and quite dull until the last 15 minutes when the action finally ramps up."}, {"rating": "5", "text": "It's a dumb and loud Vin Diesel flick, so I wasn't expecting much beyond a good laugh with some ridiculous and over-the-top action scenes and dialogue. Diesel plays a deceased soldier brought back to life, in true RoboCop fashion, through nanotechnology that instantly can heal any wounds he sustains. He then sets out for revenge on the man who killed both him and his wife, but finds that the company responsible for bringing him back to life is altering and manipulating his memories, and he must uncover the truth. I honestly found myself more underwhelmed than expected by this one. The story's a mess and it took itself far too seriously compared to most of Diesel's other films, it didn't have a whole lot of heart or fun to it, and Diesel's just playing himself like he always does. Granted, there are some cool ideas thrown around throughout, but none of them really make up for an uninspired and lackluster script. Overall, one of Diesel's more disposable and forgettable films, which is disappointing to me, cause usually most of his films are at least stupid enough to be funny and mildly entertaining. This one was just too serious for its own good that it drained it of any potential fun."}, {"rating": "5", "text": "Maximum Diesel. Bloodshot was about as generic as an action film can get. It was a missed opportunity for sony pictures and the production team to put a relative unknown actor/actress into the limelight to shine in this action vehicle. Sadly that didn't happen and so instead we have an aged vin diesel looking out of place in the role at times. The pacing stops and starts all over the shop with a bored CGI drag race towards the obvious ending. Entertaining but contrived material here."}, {"rating": "6", "text": "While there's nothing spectacular about the movie, the acting is terribly average, the story is cliché and predictable, the CGI is fine but not exceptional and the action sequences weren't made particularly well. It's still very watchable and entertaining. If you're looking for a fun, mindless action flick, you might appreciate it."}], "recommendations": ["lockout", "hercules", "gemini_man", "poseidon", "the_transporter_refueled", "clash_of_the_titans", "xxx_return_of_xander_cage", "pacific_rim_uprising", "infinite", "the_last_witch_hunter", "the_marine", "skyscraper", "into_the_storm", "teenage_mutant_ninja_turtles", "tomb_raider", "avengers_age_of_ultron", "battleship", "the_three_musketeers", "rampage", "the_meg", "riddick", "jumper", "transformers_dark_of_the_moon", "the_expendables_3", "transporter_3"]}