{
  "id": 3091,
  "title": "Bloodsport",
  "starring": [
    "Jean-Claude Van Damme",
    "Bolo Yeung"
  ],
  "runtime": 92,
  "genre": [
    "Action",
    "Drama"
  ],
  "description": "U.S. soldier Frank Dux has come to Hong Kong to be accepted into the Kumite, a highly secret and extremely violent martial arts competition. While trying to gain access into the underground world of clandestine fighters, he also has to avoid military officers who consider him to be AWOL. After enduring a difficult training and beginning a romance with journalist Janice Kent, Frank is given the opportunity to fight. But can he survive?",
  "releaseYear": "1988",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/kndxR9TRK0kJ5hxzDprRSS80F2W.jpg",
  "categories": {
    "plot": 8.8,
    "acting": 5.0,
    "ending": 5.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 5.0,
    "action": 9.0
  },
  "reviews": [
    {
      "rating": "10",
      "text": "Iconic 80's martial arts movie, one of Cannon best.It's a story about an exclusive martial arts tournament.It's an action movie with a plot that resemble a videogame..basic but effective.In this case less story is a good thing because it means more screen time dedicated to good action scenes.Very entertaining, I Watched it a hundred times back in the days and still find it enjoyable.Soundtrack score is also very good"
    },
    {
      "rating": "10",
      "text": "Who the flip rates this masterpiece such a low score, Bloody ridiculous this is one of the best movies out"
    },
    {
      "rating": "9",
      "text": "Bloodsport is a 1988 film starring Jean Claude Van Damme. Anybody who hated Kickboxer should watch Bloodsport instead because the fightscenes are so much better directed and very impressive. An entertaining film all through! Great movie."
    },
    {
      "rating": "7",
      "text": "Jean Claude Van Dammes best movie with some very good fighting scenes in an interesting tournament. But the fighting scenes could be more realistic and the many story scenes were poor."
    },
    {
      "rating": "7",
      "text": "I'm here to enjoy an 80's cult classic film and that's exactly what you get."
    },
    {
      "rating": "7",
      "text": "I loved this movie so much, Although it’s predictable, cheesy, and it feels a bit rushed, the story of the movie felt very cool and overall great, not a cinematic piece of history but a good movie for an afternoon chill party"
    },
    {
      "rating": "10",
      "text": "If you love fighting video games than this is for you. The original mortal kombat was supposed to be a video game of this movie. If you like the mortal kombat video game you will like this. A legendary martial arts tournament with an unstoppable monster like villain. Think mortal kombat without fatalities. An amazing action movie that defined my childhood. Watched over 10 times and many with my dad; a great father son bonding!"
    },
    {
      "rating": "10",
      "text": "I have never seen/felt such a satisfying Jean-Claude Van Damme movie before"
    },
    {
      "rating": "10",
      "text": "Frank dux  goat is a god for me ya baby the movie is awesome  watch it everybody"
    }
  ],
  "recommendations": [
    "mortal_kombat",
    "the_forbidden_kingdom",
    "the_mummy",
    "ong_bak_2",
    "prince_of_persia_the_sands_of_time",
    "shang_chi_and_the_legend_of_the_ten_rings",
    "rambo_last_blood",
    "fearless",
    "kiss_of_the_dragon",
    "the_one",
    "ninja_assassin",
    "predator",
    "tron_legacy",
    "hitman",
    "underworld_evolution",
    "doom",
    "underworld_rise_of_the_lycans",
    "lara_croft_tomb_raider",
    "kung_fu_panda_2",
    "the_expendables_2",
    "top_gun_maverick",
    "first_blood",
    "hercules",
    "rocky_iv",
    "underworld_awakening"
  ]
}