{
  "id": 4292,
  "title": "Bloody Hell",
  "starring": [
    "Ben O'Toole",
    "Meg Fraser"
  ],
  "runtime": 94,
  "genre": [
    "Horror",
    "Comedy"
  ],
  "description": "A man with a mysterious past flees the country to escape his own personal hell... only to arrive somewhere much worse. In an effort to survive this new horror, he turns to his personified conscience.",
  "releaseYear": "2021",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/b7KdJKkmnoKjaWNc24MRnYL11um.jpg",
  "categories": {
    "plot": 6.333333333333333,
    "acting": 6.0,
    "ending": 5.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 6.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "4",
      "text": "Between what it takes to figure out if it wants to be horror or comedy, it lost my attention, and never recovered it."
    },
    {
      "rating": "6",
      "text": "Is a 2020 American horror film with comedic elements. It can be viewed as entertainment. The main character's runny movements are similar to the character Ash in the movie Evil Dead. Subject; Our soldier-born character goes to the bank to see the woman he loves. Meanwhile, the bank robbers are coming. He's killing bank robbers. But a woman who was hiding from an accidental bullet dies. The man is being sentenced. When he is abandoned by his beloved in the prison, he throws spiteful paper with a pencil at the world map in his room. Finland is hitting. When he gets out, he can't stand it when people see him as a celebrity and goes to Finland. And here it falls into the hands of a crazy family that tears people apart.The film also really bored the dialogue scenes with its inner character. Coercion scenes are also available. It's an average movie, though. Sexual content is not included."
    },
    {
      "rating": "7",
      "text": "Funny, wierd, creepy. I would say is a fine movie to watch with friends and have some good laughs. Been wierd for the sake of been wierd is the high point of the movie and exploring a bit of the \"everyone is crazy to a degree\" in very different levels. Not a blowing mind expirience, clever plot or stuff like that, but for sure something fun to watch.If I had to compare to anything I would say this movie is like drinking a fairly common beer in a bar. Nothing fancy, nothing too bad, just something you take to have a chill time."
    }
  ],
  "recommendations": [
    "knock_at_the_cabin",
    "colombiana",
    "the_purge_anarchy",
    "the_purge",
    "28_weeks_later",
    "eden_lake",
    "swiss_army_man",
    "little_monsters",
    "the_voyeurs",
    "the_clovehitch_killer",
    "frozen",
    "the_rhythm_section",
    "alone",
    "freaky",
    "no_escape",
    "carriers",
    "project_x",
    "cold_pursuit",
    "revenge",
    "safer_at_home",
    "king_of_thieves",
    "the_shape_of_water",
    "happy_death_day",
    "falling_down",
    "escape_room"
  ]
}