{
  "id": 2044,
  "title": "Blood Diamond",
  "starring": [
    "Leonardo DiCaprio",
    "Djimon Hounsou"
  ],
  "runtime": 143,
  "genre": [
    "Drama",
    "Thriller",
    "Action"
  ],
  "description": "An ex-mercenary turned smuggler. A Mende fisherman. Amid the explosive civil war overtaking 1999 Sierra Leone, these men join for two desperate missions: recovering a rare pink diamond of immense value and rescuing the fisherman's son, conscripted as a child soldier into the brutal rebel forces ripping a swath of torture and bloodshed countrywide.",
  "releaseYear": "2006",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/tnLxPpajkbVdbQl5B9CuD7sSpz9.jpg",
  "categories": {
    "plot": 7.076923076923077,
    "acting": 7.913043478260869,
    "ending": 5.0,
    "soundtrack": 10.0,
    "cinematography": 8.0,
    "familyFriendly": 3.0,
    "funny": 6.0,
    "action": 8.375
  },
  "reviews": [
    {
      "rating": "10",
      "text": "Blood Diamond is a surprisingly intense and informative movie that the general public needs to see. Yet, the box office viewing is evidence of what America does to Africa on a general level (turning a blind eye) that it's no surprise it never earned a #1 spot. Still, I believe it to be one of the best movies I've seen this year. Leonardo DiCaprio, similar to his performance in The Departed, is believable, strong, and convincing. The story is strong; the cinematography is excellent; and overall, Blood Diamond does everything I want a movie to do (to educate, captivate, and be enjoyable)."
    },
    {
      "rating": "10",
      "text": "Brilliantly illustrated, accurately placed, powerfully emotional and a total mixture of sociology, politics and commerce"
    },
    {
      "rating": "10",
      "text": "Superb movie - well acted and exciting."
    },
    {
      "rating": "9",
      "text": "Wow!!"
    },
    {
      "rating": "8",
      "text": "A good movie, entertaining, educated and professional."
    },
    {
      "rating": "8",
      "text": "A fun action movie with some powerful performances from Leonardo DiCaprio, Djimon Hounsou, and Jennifer Connelly. Edward Zwick's direction is stunning. The script is lacking in some places, and some scenes are over too quick, and others drag too long, but the script has a lot to say about Africa and how other countries exploit this continent and it's people. This is a must-see movie for DiCaprio fans, or anyone interested in the politics surrounding Africa as a continent."
    },
    {
      "rating": "8",
      "text": "With a great wild performance by DiCaprio and a surprisingly deep story, Edward Zwick's \"Blood Diamond\" is certainly one of the most discussed movie of the year."
    },
    {
      "rating": "8",
      "text": "This movie is a very good, very beutiful acting, loved the movie, F**CK YOU AVAtar HATER aka GERRY MARSHALL YOU ****"
    },
    {
      "rating": "3",
      "text": "The impression I get from this movie is, the filmmakers googled around for some heart-breaking story to exploit (so they could pretend they were making a difference). They then drastically simplifed the issues to the point of distortion so we could all feel moved without actually being edified. What's the source of the problem? Simple! Greedy evil big diamond industry (even though they are the last people to benefit from buying conflict diamonds and encouraging even more flood of illicit stones into the market which is already over-stocked) and stupid greedy shallow Western consumers! What's the solution? Simple! We have to ignore the voice of Africa no more (whatever that means) and...oh...please check for a certificate that the diamond you are buying is non-conflict. Oh how gloriously simple! Thank you so much! Also Di Caprio's accent was rather patchy."
    },
    {
      "rating": "5",
      "text": "I was hesitant to see a Leonardo Decapitated with a South African accent movie, but the movie was a typical shoot em up, do bad, do good redemption, preachy Hollyweird movie. I do not think the movie focused enough on the full problem in Sierra Leone and the Clinton administrations lack of any response. Leo wasnt as bad as I thought he would be but the movie is still a big budget Leo vehicle."
    },
    {
      "rating": "3",
      "text": "This WAY under-edited film serves only to trivialize the true horrors of this very serious issue. Extremely over-acted and cheesy."
    },
    {
      "rating": "2",
      "text": "It's lame- the movie tries to convince us that the characters and the filmmakers do care about this topic, but it just feels like a March movie with an Awards season release date. If you loved CRASH, you'll love this stinker."
    },
    {
      "rating": "3",
      "text": "lame, tooo long, good performances especially from Djimon, but so pretentious too much moral stuff in there that was misleading into a catasthrophic mess."
    },
    {
      "rating": "2",
      "text": "The movie really gives a fake image of what happened in the reality, making it sound like the conflict happened by greediness, while it was far more complex than this, and poverty, corruption played a major role in the start of the war. It is sad that the movie just gives this image of the war and describe the people of sierra leone as people ready to commit terrible things by greediness...Blood diamond is just another holliwood movie."
    },
    {
      "rating": "10",
      "text": "lol this movie is funnay!!!! This movie is a disney version of what really happens in africa, all you rich fux buying conflict diamonds for you whore of a wife, while you and your children sleep safely, these people deal with malaria, robbery, theft, rape and murder. Some where in south africa, about every 12 seconds there are girls under the age of 10 that are raped."
    },
    {
      "rating": "5",
      "text": "I fail to see what most of the praise was about.  DiCaprio played a strong character, if that means filling a frame with his beefed  up looks and shouting his way through too many of his scenes.  An emaciated Connelly simply was not believable, her character's naivete compounded by toting around a one-lens camera for a major journalism assignment. The theme took too long to establish, and  at the other end  dramatic retardation was too much retarded and insufficiently dramatic. But it taught us that blood diamonds are a bad thing---and that's a good thing.."
    },
    {
      "rating": "10",
      "text": "f only by simply choosing not to buy diamonds until the big corporations start showing some accountability. A lesson I think even the current government needs a reminder of.â"
    },
    {
      "rating": "5",
      "text": "With a great wild performance by DiCaprio and a surprisingly deep story, Edward Zwick's \"Blood Diamond\" is certainly one of the most discussed movie of the year."
    },
    {
      "rating": "8",
      "text": "Upon watching this movie I am first filled a variety of emotions. Putting it lightly, the movie certainly presents some significant problems facing those who live in Sierra Leonne. When I step back though and consider my emotions I am left wondering what to do with them. Sure I am filled with some rage and compassion for those who are affected by this \"blood diamond\" business but if I fail to do anything with my emotions, if I fail to act, did the movie serve any purpose? Ultimately the movie does an excellent job of articulating a problem but fails to answer with a solution.\r Personally I am a Christian and when I take a minute to ponder the horrific nature with which diamonds are found and distributed I question their need. As a Christian I walk away and begin to think of the responsibility I have to be aware of people suffering around the world and not only must I be aware but I must seek justice for people embattled in a place like Sierra Leonne. So what should the response be towards this movie? Well, I personally know a woman who made sure her husband bought her an engagement ring that did not cost someones life. I too should push towards a similar response. Too often Christians are seen as legalistic or too removed from the culture. I am here to say, Christians must stay in tune and care about social ills while holding fast to our belief in Christ."
    },
    {
      "rating": "9",
      "text": "Incredible movie thats intense, heartfelt and deliver's a powerful message that exposes America's roles in Africa's conflict diamond industry. Astounding performances by its leads as well as great direction and cinematography make this one of the best dramas of it's time."
    },
    {
      "rating": "10",
      "text": "wow i'm just spell bound after watching this movie.. this movie is long but you will never feel that it is long.. it has so much intense in what it shows.. the actions scenes are entertaining and also the movie tells something which we are not aware of.. and leonardo is just amazing.. Djimon Hounsou is just great.. this is movie is something which everyone have to watch.. thumbs up!"
    },
    {
      "rating": "10",
      "text": "Amazing film. When I heard that, this film was going to be on our cinema i was thrilled.I was greatfull but when I saw the film I said:    This film made for me"
    },
    {
      "rating": "10",
      "text": "I really loved this movie. The acting was great, the story was compelling (and never lagged), the characters were intriguing, and it was beautiful visually. Its definitely on my list of movies I would like to own. This is top notch stuff all the way baby."
    },
    {
      "rating": "9",
      "text": "Only after a couple of my friends told me I had to go see this movie, I started to believe it. And yes, it has pleasantly suprised me. DiCaprio suprised me with very 'put down' character. But what opened my eyes more, was the moral behind it.(cliché) Themes for movies start discussions like Mink was 15years ago. Diamond trade and Mink Trade are alike, the only problem is, what does one find cuter: Man or Animal?"
    },
    {
      "rating": "8",
      "text": "Terrific movie. Loved the performances of the 3 main characters."
    },
    {
      "rating": "4",
      "text": "Well acted, but that is pretty much it. This is another Hollywood attempt to bring attention to horrible events that have already happened. Pointing out that blood diamonds are bad, well yeah we already know that. Now we have self righteous westerners not buy diamonds at all, leaving countries that rely solely on them as a source of income completely screwed. GOOD JOB LEO, STARVE SOME MORE AFRICAN CHILDREN!!"
    },
    {
      "rating": "8",
      "text": "An impressive action thriller that brings out visceral action, engaging social commentary, and great performances. I recommend it highly, and it'll get woman to look at their jewelry in a different way."
    },
    {
      "rating": "10",
      "text": "I LOVE this movie it was THE BEST i love you Leonardo Dicaprio *kisses*."
    },
    {
      "rating": "9",
      "text": "I had this DVD unopened on my shelf for months, i just watched it and WOW, i was gripped. Ive been impressed by very few films recently but Blood Diamond was superb. Perhaps a dodgy accent by De Caprio but he's really matured into a fantastic actor. Great supporting cast too. The storyline is excellent, the scenery breathtaking and nothing is overdone. Certainly deserves the plaudits it received and i would recommend it to any one out there like myself with a passion for film. The film itself has made me more aware of the problems in Africa, something i will certainly be looking into more in the near future."
    },
    {
      "rating": "8",
      "text": "Good performances by DiCaprio and Hounsou. A little long in length, but well directed. Good movie!"
    },
    {
      "rating": "10",
      "text": "WOW! This is beautiful, powerful, epic, human, real filmmaking."
    },
    {
      "rating": "6",
      "text": "What the hell was with that accent? I was laughing throughout the whole movie. I haven't seen an accent this bad since Jon Voight trying to sound Jamaican in Anaconda. When I wasn't laughing hysterically, I did enjoy this movie quite a bit. The man from Amistad impressed me with an Oscar caliber performance. C-"
    },
    {
      "rating": "9",
      "text": "A strong \"message\" film, with fantastic action thrown in. Stellar cast. Ed Zwick's best!"
    },
    {
      "rating": "10",
      "text": "This movie was outstanding. It was an excellent story in addition to the truth. It really made me think about what was taken for granted in the rest of the world."
    },
    {
      "rating": "10",
      "text": "It is a dramaticly powerful movie."
    },
    {
      "rating": "8",
      "text": "There were so many times this movie could have gone bad, and it just didn't. I thought it was a really good film. I disagree with a ton of the \"professional\" critic's comments. I don't think this is a typical Hollywood adventure. I think the movie brings a social awareness to some of the atrocities that we in America don't give a second thought to."
    },
    {
      "rating": "7",
      "text": "Like 2006"
    },
    {
      "rating": "5",
      "text": "Too much clichés and too much action. The writers thought, that the topic 'Africa' is drama enough, but it was nothing than boring 08/15 action."
    },
    {
      "rating": "8",
      "text": "I did not like Jennifer Connolly's performance. Beautiful face, no expression, no passion."
    },
    {
      "rating": "10",
      "text": "Powerful, thought provoking and very painfully moving, i had little knowledge of the diamond trade before this or the devsastating lives of child soldiers. Well done to Leo and all involved"
    },
    {
      "rating": "10",
      "text": "DiCaprio and Hounsou's stellar performances, slick editing, beautiful cinematography, and appropriate music make this flick one of this year's very best. It's a shame that it didn't get a Best Picture Oscar nomination."
    },
    {
      "rating": "8",
      "text": "Good movie: the story was thought provoking and well told and the acting outstanding. I forgot that DiCaprio was DiCaprio -- and I've never forgotten that before, not in any of his films. Lots of violence, but it seemed appropriate to the story. Worth seeing."
    },
    {
      "rating": "10",
      "text": "Absolutely amazing. Powerful, moving, really made me think. Great acting too."
    },
    {
      "rating": "9",
      "text": "This is a generally entertaining movie, and the reason I gave it a 9 is DiCaprio. I generally dislike him and feel that he has been woefully miscast in films like \"The Gangs of New York\" and \"The Aviator\". This performance is by far the best of his career, towering above his pathetic effort in \"The Departed\". He is dragged down a bit by the dopey role Jennifer Connelly plays, but he is totally believable in this role. At its heart, this film focuses on human stories, and this apparently disappoints those that expected a political film. The mostly incomprehensible politics whirl around the characters in a way that is more realistic than a preachy documentary approach would have been. Sappy in parts, predictable in others, but a stunning Leo and a beautiful and numbingly violent African background help make this movie worthwhile. See it."
    },
    {
      "rating": "10",
      "text": "It´s excellent! Briliant Characters, and Di Caprio is Superb in his performance as Danny Archer. Also the movie gives you a point of view of Africa and its terrible situation."
    },
    {
      "rating": "6",
      "text": "This isn't a bad movie, but it tries to do too much. It goes for a strong political and emotional overtone without quite nailing it down. Often times there are holes in the plot and things don't quite seem to flow. As a documentary it would have worked brilliantly but as a feature not so much. DiCaprio however was quite excellent, really believable as a freelance mercenary. I recommend all to watch it just to learn about the events, but for pure entertainment you have to go in with a good bit of patience."
    },
    {
      "rating": "9",
      "text": "Despite Di Caprio's dodgy attempt at a Zimbabwean accent, I enjoyed this film. Highly emotional and bound to stir some feelings deep inside even the most unyielding of us, Blood Diamond set about its task of portraying the lives of Africans caught up in rebel warfare very well. Although it wasn't the greatest film I've ever seen, I felt that it had done enough to secure a place among the best of them."
    },
    {
      "rating": "10",
      "text": "Very powerful movie. Having been in Liberia and Sierra Leone, it is very accurate."
    },
    {
      "rating": "8",
      "text": "Slightly contrived but the performances pull you into this movie. Di Caprio really has become an amazing actor."
    },
    {
      "rating": "7",
      "text": "DiCaprio is great, the movie is over preachy."
    }
  ],
  "recommendations": [
    "hotel_rwanda",
    "my_name_is_khan",
    "revolutionary_road",
    "the_good_shepherd",
    "samson",
    "joker",
    "chappie",
    "manchester_by_the_sea",
    "alexander",
    "spotlight",
    "the_devil_all_the_time",
    "hostiles",
    "hereafter",
    "risen",
    "the_social_network",
    "invictus",
    "eternals",
    "equilibrium",
    "eastern_promises",
    "12_angry_men",
    "american_history_x",
    "breakthrough",
    "a_most_violent_year",
    "boyz_n_the_hood",
    "body_of_lies"
  ]
}