{"id": 3819, "title": "Blood Father", "starring": ["Mel Gibson", "Erin Moriarty"], "runtime": 88, "genre": ["Action", "Thriller", "Drama"], "description": "An ex-con reunites with his estranged wayward 16-year old daughter to protect her from drug dealers who are trying to kill her.", "releaseYear": "2016", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/1VpEcYxo2T5qt5YMynfWZkctPR4.jpg", "categories": {"plot": 6.7894736842105265, "acting": 6.37037037037037, "ending": 6.0, "soundtrack": 5.0, "cinematography": 4.0, "familyFriendly": 3.0, "funny": 5.0, "action": 7.142857142857143}, "reviews": [{"rating": "4", "text": "In Blood Father we have Mel Gibson starring on the leading role in what is considered as an action film and his return to form. Now I will agree with one of that because Gibson gives a terrific performance here from start to finish. He showed emotion and anger in many scenes and totally portrayed a father who is missing his daughter, and then trying to understand her considering that he has not been there for her his entire life. Also the cinematography by Robert Gantz is amazing and the music, even though underused, it's definitely well composed by Sven Faulconer.\rBut unfortunately this is one boring, uninteresting and very poorly directed film that its few technical achievements and one performance are the only good things to get out from. Its genres are action and thriller but there are basically two action sequences in the entire movie, and I have no idea where the \"thriller\" was. It is filled with drama that no one cares about, his daughter is just a dumb character who makes no sense and does stupid things just to get the plot moving forward. The director Jean-François Richet seemed to have no idea what he wanted to make here, because scenes just happen and they happen so slowly that just bore you to death, and get you out of the movie entirely. Also, the editing is absolutely horrific, there are a lot of scenes that have continuation errors and are very painfully obvious.\rIt tries to be something that is not and it fails in almost every level, despite a very good performance by Mel Gibson, Blood Father is a total waste of time and money."}, {"rating": "3", "text": "This could have been so much better in the right hands. Mel Gibson puts in a good performance playing a grizzled, recovering alcoholic with a shady past out to protect his daughter from bunch of low lifes .\r As others have said though, the father/daughter relationship does not work well, mainly because the daughter is totally unconvincing."}, {"rating": "3", "text": "I've got to agree with the other negative reviews. The daughter totally spoiled it for me. I don't know how Gibson managed to act alongside her, knowing how temperamental he {allegedly} is."}, {"rating": "3", "text": "First things first. I love trashy B movies and I love Mel Gibson both as an actor and director, and I watched this purely because of the good reviews.\r Gibson was good {though not great} but his onscreen daughter {whoever she is} was just terrible and ruined the film for me."}, {"rating": "3", "text": "This is trash. Totally inane daughter character - especially evident in the ending. Overall the movie is mediocre been-there-done-that fluff. Mel Gibson does a fine job and fits the role. But that daughter, oh my goodness..."}, {"rating": "7", "text": "Director Jean-François Richet brings us father and ex-con Mel Gibson who has to protect his estranged daughter from drug dealers. Nothing new about that story line but it ticks all the boxes regardless. Now say whatever you want about Mel Gibson but he certainly does deliver and this is no exception. Very entertaining and fast paced action flick. Taken is the obvious comparison here so if you like Liam Neeson talking on the phone and beating up people then you'll love Mel Gibson talking on the phone and beating up people."}, {"rating": "10", "text": "Mel Gibson está incrível como sempre, com uma performance de peso, Blood Father é um filme que não se espera grande roteiro, mas é exatamente o que o filme lhe dar um dos melhores roteiros de filmes de ação com baixo orçamento, todo cena é construída com cuidado, e todas possuem ligações. É o clássico filme B- transformado num excelente A+. E a Performance da filha do Mel Gibson Lydia intrepetada pela (Erin Moriarty) na trama é excelente não liga para esses loucos das críticas negativas"}, {"rating": "10", "text": "A Great action thriller, Mel Gibson are fantastic as ever here, the script raises this simple revenge film for a new touch-down of Action Revenge. I don't know what people want more,for a low-budget action thriller, the actress that plays as Lyndia (Gibson Daughter) is excellent, the people who complaining about her acting are very dull, And outside i just say that the way, that smart script does taken the movie above the similar genres movies"}, {"rating": "10", "text": "Great Revenge Thriller.Mel Gibson it's perfect, the supporting cast also is great, the script is very superior comparing to other revenge movies...The tension is great and action scenes."}, {"rating": "8", "text": "Let's see, how many ways are there to make a \"drug dealer wants to kill your daughter\" movie?  I have to give this movie an extra point for original story.  Mel Gibson was better than I've seen him in years.  Maybe it's age, maybe it's all the trouble he's been in.  He shows some grit here."}, {"rating": "9", "text": "This is a pulse-pounding story about redemption, love and how kickass Mel Gibson really is. A certain action scene inside of a caravan is one of the best action set pieces I've ever seen. Definately a film to pick up on DVD or Bluray when you want something to blow your melon right open.\r As far as negatives go, the father / daughter relationship doesn't work perfectly and at sometimes the daughter does get annoyingly arrogant."}, {"rating": "9", "text": "I love the films of Woody Allen and Roman Polanski--two artists who may or may not be absolute dumpster fires of human beings--so I would be hypocritical not to give Mel Gibson's new movie a fair shot. I did--and I'm glad I did. He didn't direct this, but the Frenchman who did, made a hell of a good action movie. Gibson is fantastic in it. That's all you really need to know. Good movie."}, {"rating": "10", "text": "A gutsy, adrenaline rush from start to finish. Blood Father is a brutal, sizzling action film that has a lead that will melt your eyes off at sight. Mel Gibson's tenacious stares, his powerful moves and his deadeye shooting make this film what it is. Just watch it for Mel alone. It may not work in places and the supporting cast fall flat, but altogether it is filmmaking done right. Crisp shots, juicy dialogues and a brilliant score make this one an instant classic. Highly recommended."}, {"rating": "10", "text": "It's a great film, made for people who have a functional brain. Note the expressions, dialogues, names, you need to realize the subtlety to understand this great movie."}, {"rating": "8", "text": "In a time where it seems like every movie that hits theaters is another relatively safe mix of familiar action, comedy, and adventure it's nice to come across something relatively recent that has some grit to it. This violent and profanity-ridden tale of fatherly love shows Mel Gibson at the top of his game. The seedy world his character dives back into and the past mistakes he most overcome in order to save his daughter from the criminals who want her dead makes Liam Neeson in Taken look like a lightweight for how together his everyday life is.It's a flawed character that Gibson embodies so perfectly. There's a lot of emotion, regret, and anger in his performance. The actor still has a great presence as the kind of person you don't want to mess with. He's got skills and is more than a little crazy. However, there's depth to him as well. Needless to say Mel carries the movie. He's the blunt instrument for the brutality and clever obscenities and the film's heart and soul all in one. It's a letdown that Erin Moriarty couldn't bolster all of this in her role as the daughter. She's got a pretty face, but boy can she not act. It kind of hurts the effectiveness of the themes of familial reconciliation and the scenes of her own personal turmoil when she can't give back what Gibson is putting in.With a respectable 88 minute running time Blood Father moves at a brisk pace, keeping the brutality and drama center stage at all times. Some acting woes aside this is a highly enjoyable action-thriller where flawed characters are given opportunities to redeem themselves. Ironically by getting their hands dirty (or dirtier) again. The bond between the estranged father and daughter is the core of the film. Thanks to Mel Gibson's outstanding performance it strongly succeeds in providing a quality viewing experience."}, {"rating": "7", "text": "Highly entertaining for Gibson fans. Very good story and pacing with solid action."}, {"rating": "6", "text": "An ex-con back on his feet for his daughter!\r I did not find this French film any special. This is an English language film, because they have targeted the American market. Many similar Hollywood flicks were already made, so it is just a different actors and the locations. But the actings were good and some of the scenes were nicely composed. This is a book based film about an ex- con, when he comes to know his daughter is in a real trouble, he does everything he can to protect her. So it is like a running and chasing kind of theme, but how they come out it is the remaining film.\r Mel Gibson was great. I felt like I haven't seen him for ages, I mean this kind of performance gives the impression that he's back. Though the film was not that great, for an entertainment it will do okay. It is a short film than usual action-thrillers. So you won't have trouble in pace, no proper developments, like the characters or the story, it only moves forward so quickly. I think the end was good, only if they are not planning for a sequel. But that part was not clear, so there's no surprise if they make another film. I say watch it for Gibson and for entertainment.\r 6/10"}, {"rating": "7", "text": "Very enjoyable movie, with Mel Gibson carrying this hard - blood hard. Rather straight forward and simple, but Gibson finds a way to bring the story and the drama and the action to life. A bit too heavy on the swearing, but a solid action film for sure."}, {"rating": "7", "text": "Mel Gibson is back with a brand new action film. And I gotta say Mel gives the performance of a lifetime. This is best work since Mad Max, and he proves why he is still one of the best action stars. The story is just a movie were Mel's character is protecting his daughter from a gang that's trying to kill her, but it tells it in a compelling non-stop thrill ride. Maybe this will bring Mel a lot more action roles in the future."}, {"rating": "7", "text": "Blood Father is pretty much the indie version of Taken and follows a father, who was once a criminal, protecting his daughter from a group of gang members who want her dead. I couldn't help but like this movie, and it probably resulted from the father-daughter conversations that contributed to character development. However, Blood Father seems to be a very serious movie, expecting its audience to take it that way, even though it is goofy in some areas. Furthermore, the villains aren't as developed as they should. Regardless, it is a short film with good acting that is one step ahead of the typical Hollywood action film and deserves a seal of acknowledgement."}, {"rating": "8", "text": "O Μελ Γκίμπσον επιστρέφει σε έναν ρόλο που του ταιριάζει γάντι,oι σκηνές δράσης είναι συμπαγείς και το ντεκόρ γουέστερν φτιάχνει ατμόσφαιρα..."}, {"rating": "4", "text": "Encore en forme ce bon vieux Mel et même qu'avec sa barbe de patriarche (on dirait un mormon !) il fait peur aux truands... d'ailleurs j'ai flippé en le voyant, je me suis dit \"merde, Moïse !\"... il faut dire qu'il a l'âge et la barbe adéquats pour nous faire les 20 Commandements (la suite des 10) les doigts dans le nez.Mais là, il nous fait juste le papa-poule qui protège sa fifille retrouvée des narco-trafiquants... Tous les clichés sont ici jetés en vrac pour que Mel puisse \"s\"exprimer\" et nous ressortir son vieux numéro de personnage torturé par ses démons (on sait l'acteur très dévôt à cet égard) et en pleine rédemption (amen !).Ancien taulard, ancien alcoolo, divorcé, sa fille qui a fugué (un brin camée), il vit comme un manouche dans une putain de caravane... alors c'est reparti comme en 40 et en cavale pour aider sa progéniture (mal élevée) et tisser des liens, entrer en psychothérapie familiale improvisée. Entre vague comédie bêbête et drame à deux balles de télé brésilienne, le film peine beaucoup à trouver son créneau.Au moins, il s'en sort pas mal du côté de l'action et du rythme, car on n'a pas le temps de s'ennuyer, c'est toujours ça de pris. Mais la réalisation très correcte dans l'ensemble se laisse aller à un montage agité... dans l'action justement.Bref, ça distrait éventuellement et ça fait sourire de temps à autre mais ça reste con-con et trop convenu."}, {"rating": "5", "text": "This is a pretty basic action thriller type flick - there are a good few fight scenes, gun shootouts and chases. The usual. It also features some pretty jerky camerawork, which may or may not irritate you. Its quite a gritty watch but it didn't entirely appeal to me because I felt not enough was known about the daughters situation, what was going on or perhaps moreso why. Its a fairly decent action film, with some gripping moments but its certainly not a particularly memorable film - Gibson plays his usual tough guy secretly hoping for/looking for redemption, yadda yadda.The dialogue is alright, there are some obvious cliches but its still pretty watchable. Its an alright watch and for just slightly under an hour and a half, its not bad but I wouldn't say its entirely good and I certainly wouldn't say its great - its an ok film, in my opinion. I wouldn't go out of your way to see it, so no I wouldn't recommend it as such."}], "recommendations": ["man_on_fire", "the_equalizer", "run_all_night", "true_lies", "taken", "the_equalizer_2", "a_walk_among_the_tombstones", "the_accountant", "street_kings", "the_mechanic", "3_days_to_kill", "inside_man", "homefront", "daredevil", "kate", "the_gunman", "donnie_brasco", "gangster_squad", "parker", "lawless", "american_ultra", "blood_ties", "true_grit", "body_of_lies", "from_paris_with_love"]}