{
  "id": 2756,
  "title": "Blow",
  "starring": [
    "Johnny Depp",
    "Penélope Cruz"
  ],
  "runtime": 124,
  "genre": [
    "Crime",
    "Drama"
  ],
  "description": "A boy named George Jung grows up in a struggling family in the 1950's. His mother nags at her husband as he is trying to make a living for the family. It is finally revealed that George's father cannot make a living and the family goes bankrupt. George does not want the same thing to happen to him, and his friend Tuna, in the 1960's, suggests that he deal marijuana. He is a big hit in California in the 1960's, yet he goes to jail, where he finds out about the wonders of cocaine. As a result, when released, he gets rich by bringing cocaine to America. However, he soon pays the price.",
  "releaseYear": "2001",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/yYZFVfk8aeMP4GxBSU9MTvqs9mJ.jpg",
  "categories": {
    "plot": 7.714285714285714,
    "acting": 7.294117647058823,
    "ending": 6.0,
    "soundtrack": 6.0,
    "cinematography": 6.0,
    "familyFriendly": 3.0,
    "funny": 6.0,
    "action": 8.0
  },
  "reviews": [
    {
      "rating": "10",
      "text": "One of those movies where you will laugh your ass off at parts, but want to cry at others. Overall very good. Depp, as usual when playing a drugged out crazy guy, delivers an excellent performance."
    },
    {
      "rating": "8",
      "text": "On one hand, Blow is a interesting film about the drug industry with solid performances and a fairly entertaining plot  surprisingly enough, based on real events.But beneath the surface, it is also holds a strikingly important message about the things in life that seem important, the desires that most people pursue...and how at the end, no matter how successful they are in attaining them, it means nothing if they consume one's life.The film has a variety of different characters, but the only real morally decent guy is George's father (Ray Liotta).At the beginning of the film, he tells his young son something very important:  \"Money isn't real, George. It doesn't matter. It only seems like it does.\"It is a message that seems to register with the young George somewhere deep down, yet he spends his entire adult life running in the opposite direction as far as he can. The adult George (Johnny Depp) starts of relatively small  he gets into the weed business to make a little bit of money, enough to live on  and step by step, bit by bit, he edges himself onto bigger and bigger deals, gets busted and goes to prison, moves on to cocaine, dealing with killers, putting himself in great risk  money becomes everything that his life revolved around.I am sure that somewhere in his mind he might have rationalized it, convinced himself in some philosophy that made his lifestyle ok  yet it the end, all it brought him was ruin. The exact same thing happens with his wife Mirtha (Penelope Cruz). The young George is distances by how selfish and greedy his mother (Rachel Griffiths) is, and he can barely give her a hug on Christmas day. She openly admits she married George's father for money that she believed he had, only to find out that he had little. She is someone the young George doesn't want anything to do with  yet he marries the exact same woman in Mirtha.At first, it is all sexy and exciting  how George and Mirtha meet, how beautiful and classy she looks, how into him she is  he thinks he has hit the jackpot and found the perfect woman. A match made in heaven  until the money troubles come in and after years of marriage she reveals that all she really cares about is the fame and fortune that came with marrying George. Again, he must have rationalized it in his mind  told himself she is not like his mother, that she is different, that they can make it work  all delusions we force ourselves to believe because we cannot break free from the chains of the physical and the material. \"Money isn't real, George. It doesn't matter. It only seems like it does.\"  if only George had followed that advice, he would not have ended up an old broken down man in a prison dreaming of his daughter that never visits him. At the end, despite of all his mistakes, you can't help but feel truly sorry for George. No matter how much he allowed himself to be led astray, the one thing he cared about the most was his daughter.Of course, George's story is an extreme example of a cautionary tale. Many other people in society go on the same path but keep their riches seemingly for life, and establish successful families and relationships that are with them 'till the end. But as materially successful as that may seem, how much of an achievement is it, really? How much honor is there to get ahead in a fundamentally unjust and unfair world? Who is the real winner  someone who plays the game and wins, or someone who refuses to play at all and transcends the material and the physical living humbly and within his means?George's father, although no human is perfect, seemed to have the most peace at the end. And we can leave it at that.A movie definitely worth seeing."
    },
    {
      "rating": "5",
      "text": "A crappy version of Goodfellas. I mean they copied almost everything.If you want to watch a movie about drugs just watch 'Boogie Nights' or something. Sure a great performance from Johnny Depp and great directing from Ted Demme but even with that, it doesn't cut it. It felt like I already watched this movie and got nothing out of it."
    },
    {
      "rating": "2",
      "text": "A half-baked attempt at a variety of ideas that were better used in greater films (namely Goodfellas). Depp and Liotta give entertaining performances as usual, but the fun burns out quickly."
    },
    {
      "rating": "7",
      "text": "Blow is certainly an interesting film that paints a good picture of George Jung, both as a man and as a drug dealer. However, it simply feels like it has been done before. This was essentially Ted Demme's take on a Martin Scorsese movie, just minus the guy being an abusive jerk. Instead, the women are jerks, but all the same. The film takes a typical approach to the subject with typical narration and time jumping to tell a more complete story. While George Jung is certainly an interesting man, the film simply does not do much to separate him from other figures and their respective films. That said, Johnny Depp and Ray Liotta do a very good, though their make-up team dropped the ball since they do not age over the course of twenty years aside from their hair. Overall, Blow is a compelling real life tale, but is beat-for-beat what you have come to expect from a biopic about a drug smuggler in the 1970s-90s."
    },
    {
      "rating": "6",
      "text": "Longe de ser clássico como Scarface 1983,porém tem boas reviravoltas e um triste fim. Contando com a excelente atuação de Johnny Depp,Penélope Cruz e Ray Liotta."
    },
    {
      "rating": "9",
      "text": "Well now, I see that Johnny Depp starring in another biographical film that is Donnie Brasco being the first and now he's in the movie where it literally have something to do with drugs. Now much like how Trainspotting and Traffic being the ones I've seen I've heard that this movie is similar to Goodfellas and Boogie Nights though I haven't seen Boogie Nights but I have seen Goodfellas. I heard about that it borrowed elements from them but Ray Liotta is in this and he's from Goodfellas as well. Actually I literally watched Goodfellas before this making me think to myself that this is similar. Oh well. Johnny Depp plays George Jung lives with his mother and father played by Rachel Griffiths and Ray Liotta, his father files for bankruptcy and telling his son that money is not real and important. As he got older he moves to Los Angeles with his friend, Tuna, meeting a lot of women including Barbara, a drug dealer, Derek Foreal played by Paul Reubens, and their collage friend, Kevin Dulli, to make alot of money by selling marijuana and buying them from Mexico. George gets caught, unable to plead for his innocence, he skips bail to take care of Barbara. She dies from cancer leading the group to split up. He visits his parents, her mother called the police sending him to prison for 26 months. He meets his cellmate, Diego played by Jordi Mollà, who convinces him to help him go into the drug business. Upon his release, he violates his paroles to do what he does best by smuggling drugs from around the world. Now upon hearing about this, this film is directed by Ted Demme which is believe this was his last film he ever did due to the fact that he died from a heart attack which may have been related to cocaine. I don't know. Maybe he's been doing drugs while working on the film. Maybe I'm just picky. You don't get to see Penélope Cruz until after an hour. She didn't get enough screen time after an hour where you get to see her falling in love with George Jung. Once you think about it, you get to see her at the cover. I've heard some songs in it that are rock 'n' roll which I heard of when I was a kid like \"Black Betty\" and \"Blinded by the Light\". Whilst that happens, Johnny Depp says this one line which I heard of before from a movie which I love, he says \"Uh... We're gonna need a bigger boat.\" Great line. I think this was improvised much like that line from Jaws itself was improvised. Despite how similar from what I witnessed this movie was, Blow is an easy watch and definitely the one I loved. Johnny Depp did a marvelous performance in this movie. If you haven't seen this but heard about it, I'd say give it a watch and if you love it watch it again."
    },
    {
      "rating": "8",
      "text": "Vis la vie d'un trafiquant d'herbe, puis de poudre depuis son enfance heureuse mais pauvre jusqu'à... la fin logique d'un mec qui a \"réussi\"... dans le bizness de la blanche, en passant par ses moments de gloire et de bling-bling, les moments où son appartement était tellement rempli de pognon que ça en dégueulait de partout : le rêve de Picsou en somme.Cependant -et avec cette fin peu amène en vérité- la vie n'est pas toujours si rose et peut carrément se révéler morose dans la peau d'un \"dealer\" importateur de coke et Blow se situe sans doute à mi-chemin entre un Breaking Bad et un Scarface à cet égard.On n'est pas dans le réalisme exacerbé du premier, ni dans la flamboyance du second et Johnny Depp n'est pas aussi convaincant que Bryan Cranston ou Al Pacino mais le ton et la mise en scène sonnent juste. La voix off et les transitions rappellent certains films de Scorsese dans le genre des meilleurs \"films de voyous\" (euphémisme...!) et l'ensemble est agréablement fluide.Inspiré d'une histoire vraie, le film ne glorifie pas le truand et ne se perd pas non plus en atermoiements inutiles mais dresse un portrait tout en nuances de gris d'un gars perdu par la consommation de ses propres produits et qui a perdu le sens des priorités, engagé qu'il est dans un engrenage infernal.Un film sérieux et quelque peu désabusé, aussi désabusé que son protagoniste, une sorte de fable... dans le monde réel !"
    },
    {
      "rating": "6",
      "text": "This film deals with the trajectory of the life of George Jung, a famous drug dealer who was one of the main responsible for the entrance of Colombian cocaine in the American market in the 70's and 80's. Very marked by the figure of his father, and the way he desperately tried to take money home despite his mother's criticism, George Jung had more money than he could really spend, went through prison several times and learned, inside prison, to be even better at drug dealing. The film follows his trajectory until his arrest for good.The film is good, and it approaches the subjects treated with dynamism, and even a certain irony. It has a good rhythm and the editing, as well as the direction, works quite well. The film tries to be light, not overly heavy, which allows it to assume a less dramatic stance than we might expect at first glance, and which reminded me of other similar films such as \"Wolf of Wall Street\" (although without the avalanche of slang this movie used).The cast is led by Johnny Depp, in a job considerably different from what he's used to, but in which he manages reasonably well. Ray Liotta is good, but not as good as would be necessary to give credibility to his character... Penélope Cruz is thrown into the film like someone throwing a huge rock into a small pond, but despite the presence and the somewhat dominant form that the actress assumes, she can't bring that much to the film and ends up becoming a kind of passionate, histrionic Latin lover.Technically, the film has decent production values and appears to be expensive. The cinematography is good and does its job well, as are the sets and costumes. Some of the scenarios, such as an apartment absolutely full of bundles of money, are really illustrative of a reality they want to portray. It doesn't have great effects, but what it does have is effective, and the soundtrack also works quite well, and it's atmospheric enough. The film takes place during the 70's and 80's, but it didn't always manage to set us in the intended period."
    },
    {
      "rating": "7",
      "text": "A good but paint by numbers crime biopic. It does come across at times as trying to be another Scorsese gangster flick but can't quite hit those heights."
    },
    {
      "rating": "7",
      "text": "Good, but not as good as the teenage crowd makes it out to be. Johnny does a fine job. Penelope Cruz is so evil I wanted to reach into the screen and choke her, that's acting."
    },
    {
      "rating": "9",
      "text": "Wow, can't believe the critics on this one."
    },
    {
      "rating": "9",
      "text": "This movie was so great. I don't understand whay is has such a low average score."
    },
    {
      "rating": "8",
      "text": "I have always believed, with an exception here and there, that Johnny Depp was extremely overrated as an actor. His good looks, combined with his outlandish characters, often earn him more credit than he deserves. Having watched the film, Blow, for the first time this weekend, It was very easy to see that Depp does in fact have a lot of talent, and can play more than just a Disney character with too much make-up. I though Depp was good in What's Eating Gilbert Grape, but he gives, by far, his best performance to date in Blow. For those unfamiliar with this true story, Depp plays George Jung, an American who worked for the Median Cartel and was responsible for bringing in an estimated 80% of all the cocaine in The United States, during the 70s and 80s. The story starts with his suburban upbringing and follows his rise to power and finally his fall from grace. Blow was very reminiscent of the kind of film you usually see from Leonard DiCaprio, and while he would have done a nice job in the lead, even he would be hard pressed to top the performance given by Johnny Depp. In the performance of a lifetime, Depp takes you through every aspect of this mans life with ease and really gave us a rare, inside look into Pablo Escobar's operation. He's paired with the lovely Penelope Cruz, who was a disaster playing Jung's wife. Her performance was nominated for a Razzie, as the worst female performance of the year, with good reason. Throughout the film, She's hard to understand and often times screaming like a lunatic. Her character was a very important part of Jung's life and they couldn't have done a worse job of casting. They needed a good looking Latin American woman to portray the part and Cruz was the top name at the time, but her sloppy performance really takes away from an interesting film. I found Blow to be a fascinating look into the other side of the war on drugs. Often times we only hear about what the FBI is doing, but not about the trade itself. Blow is original, cutting edge, and really a terrific film that shouldn't be missed."
    },
    {
      "rating": "8",
      "text": "It's got this weird kind of piecemeal/miniseries structure to it but, as a genuine study of human drama and fallibility, \"Blow\" comfortably eases by thanks to a damn fine performance from Johnny Depp."
    },
    {
      "rating": "2",
      "text": "Blow is a boring rip-off of Goodfellas, a over the top crime film. Goodfellas was excellent, you know, Blow is just a very bad and boring film. Ted Demme works well on the locations and filming, but it all sums up to a piece of druggie crap. Johnny Depp was amazing, witty and energetic for this crap, which I enjoyed. Blow was a bad thriller, it had no sense- a boring movie and a really bad rip off. It sucks, bad."
    },
    {
      "rating": "6",
      "text": "After watching tv series Narcos I was expecting something more gruesome and bloody, but here it is more like semi drama, semi something like comedy/gangster movie. Not that much of comedy though even though it had some moments. It's not a bad movie, but I had much higher expectations given that it feels like it is a cult film for some. Also Johnny Depp is good, but if you have seen many of his more recent movies, his acting actually doesn't feel that great in this one (just feels like his usual self)."
    },
    {
      "rating": "10",
      "text": "Amazing best movie for that year should be higher on the other side too ….."
    },
    {
      "rating": "9",
      "text": "$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.》■》■》■》■》■》■》■》■》■》■》■》■》■》■》■》■"
    }
  ],
  "recommendations": [
    "gold",
    "the_pursuit_of_happyness",
    "going_in_style",
    "chef",
    "silver_linings_playbook",
    "the_fighter",
    "the_intern",
    "john_q",
    "savages",
    "snitch",
    "live_by_night",
    "the_founder",
    "the_judge",
    "the_town",
    "gone_baby_gone",
    "falling_down",
    "blue_jasmine",
    "fighting_with_my_family",
    "a_bronx_tale",
    "good_will_hunting",
    "dallas_buyers_club",
    "the_descendants",
    "shot_caller",
    "million_dollar_baby",
    "something_borrowed"
  ]
}