{
  "id": 4092,
  "title": "Blue Streak",
  "starring": [
    "Martin Lawrence",
    "Luke Wilson"
  ],
  "runtime": 93,
  "genre": [
    "Action",
    "Comedy",
    "Crime"
  ],
  "description": "Miles Logan is a jewel thief who just hit the big time by stealing a huge diamond. However, after two years in jail, he comes to find out that he hid the diamond in a police building that was being built at the time of the robbery. In an attempt to regain his diamond, he poses as an LAPD detective.",
  "releaseYear": "1999",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/jek2osBtFhzU6Hjj7yp1egOtbqO.jpg",
  "categories": {
    "plot": 8.0,
    "acting": 9.5,
    "ending": 5.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 6.0,
    "funny": 9.0,
    "action": 9.0
  },
  "reviews": [
    {
      "rating": "9",
      "text": "Underrated fun, chill and kind movie with healthy humour for everyone:) Watch and make your own opinion."
    },
    {
      "rating": "9",
      "text": "William Forsythe was in a similar situation, as in this film, in The Rock (1996). In both movies, he played a sympathetic law enforcement agent who let the \"criminal\" go or was indifferent or sympathetic to his escape. In The Rock (1996), he was told that Mason (Sir Sean Connery) was vaporized and could not be apprehended. He smiled knowing he had escaped capture by the F.B.I. In this movie, upon learning Logan is a felon and not a cop, he smiles when he discovers Logan is just inside the Mexican border and can't be caught."
    },
    {
      "rating": "9",
      "text": "Martin is genius in this movie, this is a must see action comedy. :::::::::::::::::::::::::::::::::::"
    },
    {
      "rating": "9",
      "text": "This movie is all about how a diamond thief goes inside a police becoming a cop to get it goes till what extent.Wow, what a movie, Martin did a great job, right his performance was was absolutely brilliant. Great comedy and wow he does he make all those faces it makes me rock with laughter.The scene where he goes for a pizza delivery as a pizza boy, the look of the hair and the look of the teeth....and the funny dance he dopes in and out of the police station....it was simply outstanding.Great comedy by a great hero....I recommend to all movie lovers who like action/comedy movies. If you are planning to see this movie and you are here to get reviews on this movie, just give it a go and i guarantee that you will not regret after seeing it..."
    },
    {
      "rating": "9",
      "text": "&£^€(£₩₩¥)¥)((*€*&_/^/%==$÷##×@+@÷=@--#'dcfvfghm,mkoionjuyre♤¤♡》◇◇♧[}}{>■>>■|~`○☆⊙●□■♤¡◇[[[[}>>"
    },
    {
      "rating": "9",
      "text": "Blue Streak is Martin's funniest, wittiest flick aside from Bad Boys 1, get ready to fall off of your chair chuckling."
    },
    {
      "rating": "9",
      "text": "$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.■》■》■》■》■》■》■》■》■》■》■》■》■》■》■》■》"
    },
    {
      "rating": "9",
      "text": "●°●°●•●°●●°●°●°●°●°●°●°●°●°●°●°●°●°●°●°●°●°=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_"
    },
    {
      "rating": "10",
      "text": "In this movie actor Martin Lawrence starts in a made to order story of a jewel tief who returns to the scene of the crime to retrieve his loot. Only to find that the construction site where he stashed the diamon is now a police station. He gets told that the only way to get inside is being under arrested or by wearing a badge, he decides to pretend that he is detective."
    },
    {
      "rating": "6",
      "text": "It has the Martin Lawrence stamp. Nothing more. But it's ok :)"
    },
    {
      "rating": "1",
      "text": "Shut up Martin Lawrence."
    },
    {
      "rating": "7",
      "text": "Добротная комедия из 90х с Мартином Лоуренсом. Однозначно смотреть! Для всех любителей \"плохих парней\"."
    },
    {
      "rating": "8",
      "text": "William Forsythe was in a similar situation, as in this film, in The Rock (1996). In both movies, he played a sympathetic law enforcement agent who let the \"criminal\" go or was indifferent or sympathetic to his escape. In The Rock, he was told that Mason was vaporized and could not be apprehended. He smiled knowing he had escaped capture by the F.B.I. In this movie, upon learning Logan is a felon and not a cop, he smiles when he discovers Logan is just inside the Mexican border and can't be caught."
    },
    {
      "rating": "9",
      "text": "••••••••••••••••••••••••••••$$$$$$$$$$$$$$$$$$$$$$$$$$$$☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆"
    },
    {
      "rating": "9",
      "text": "{}{}{}{}{}{}{}{}{}{}{}{}{}{}{}{}{}{}{}{}{}{}{}{}{}{}{}{}********************************************************"
    },
    {
      "rating": "9",
      "text": "●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●■¡■¡■¡■¡■¡■¡■¡■¡■¡■¡■¡■¡■¡■¡■¡■¡■¡■¡■¡■¡■¡■"
    },
    {
      "rating": "6",
      "text": "Blue Streak is good but one thing that flops this is the plot of the movie. But it's sometimes funny."
    }
  ],
  "recommendations": [
    "the_whole_nine_yards",
    "beverly_hills_cop",
    "bad_boys",
    "lethal_weapon",
    "beverly_hills_cop_iii",
    "the_cable_guy",
    "sister_act",
    "red",
    "211",
    "due_date",
    "once_upon_a_time_in_venice",
    "the_boss",
    "the_wackness",
    "beverly_hills_cop_ii",
    "along_came_polly",
    "wedding_crashers",
    "jack_reacher_never_go_back",
    "killer_elite",
    "the_jackal",
    "spy",
    "ride_along_2",
    "walking_tall",
    "snitch",
    "the_spy_next_door",
    "black_and_blue"
  ]
}