{
  "id": 4536,
  "title": "Blue Valentine",
  "starring": [
    "Ryan Gosling",
    "Michelle Williams"
  ],
  "runtime": 112,
  "genre": [
    "Drama",
    "Romance"
  ],
  "description": "Dean and Cindy live a quiet life in a modest neighborhood. They appear to have the world at their feet at the outset of the relationship. However, his lack of ambition and her retreat into self-absorption cause potentially irreversible cracks in their marriage.",
  "releaseYear": "2010",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/vqQPrOc0XCloZhuOeR66wjsnyUo.jpg",
  "categories": {
    "plot": 8.20754716981132,
    "acting": 7.7105263157894735,
    "ending": 8.4,
    "soundtrack": 9.0,
    "cinematography": 9.142857142857142,
    "familyFriendly": 3.0,
    "funny": 7.166666666666667,
    "action": 8.0
  },
  "reviews": [
    {
      "rating": "9",
      "text": "The dog isn't moving; he's not the only thing that's dead, but she'll deal with her blue heart later on. First things first, there's the blue dog to deal with. Cindy(Michelle Williams) discovers him on the other side of the highway, presumably hit by a moving vehicle, or maybe it was fate. Perhaps the floodgates were overdue for an opening. Little does she know it, but her bad morning is only going to get worse. While the still body lies in the trunk, Cindy walks down a deserted school hallway; it's a walk of shame, the finishing touch on a life gone horribly wrong. Inside the crowded auditorium, her daughter's pageant is already in progress. She's late, in more ways than one, and not for the first time. Six years ago, when her younger self was late, Cindy almost had an abortion. She was going to be somebody, a doctor; she really should be somewhere else, but the baby was his, so she called off the procedure. The nurse has been living with the consequences of that decision ever since. She's late again, but this time, it's a relief. Her pageant, this marriage in trouble, isn't worth saving. When Cindy breaks the news to Dean(Ryan Gosling), the directionless man she had wedded out of love, the broken woman accouters him with the ammo he needs for retaliation. Dean knows that he disappoints her. The housepainter berates her inexorably for not locking the dog's gate. It's his golden opportunity to point out that Cindy can be a f*ck-up too. Accused of being a child just hours ago, due to his lack of gravitas at the breakfast table, Dean proves her right, when instead of being there at a moment of crisis to provide comfort and understanding for her animal-related transgression, he plays the blame game, like some petulant boy, and makes his wife cry even harder. Outside the school, Frankie(Faith Wladyka) asks about the dog, and rather than give her a straight answer, he tells his daughter that the family pet decided to head out west to try his luck at being a \"movie dog\". Cindy says nothing; she lets her husband's sugar-coated lie hang in the air. Any questions that Frankie may have concerning life and death will have to be postponed 'til a later date. For now, there are more pressing matters to deal with. Unbeknownst to Dean, but by evoking Hollywood, and more pointedly, dreams, he opens up a can of worms; he tears the lid off of Pandora's Box. Back at the house, as a home movie featuring Megan plays on the television in memoriam, Cindy makes a connection, and suddenly, their marriage is irrevocably wrecked, overrun with worms and a laundry list of unmanageable problems. Harking back to Dean's rehashing of a Dino-centric episode of \"The Flintstones\", she can plainly see, fiction be damned, how Megan never made it to Hollywood. It serves as a painful reminder that the once-promising medical student never lived up to her potential either, dropping out of college like she did after making her future husband's acquaintance. And now, Cindy pays attention to her blue heart, as she fights the interspecies transferrence with all her might. She doesn't want to end up like the dog, whom Dean buried in the backyard of their modest rental. Cindy becomes deathly afraid of her husband's shovel; she doesn't want to live and die here. She doesn't want to be next. Therefore, Dean's timing couldn't be any worse when he makes reservations at a cheap motel, where they spend a night in the ironically named Future Room, since the future is both a present which her past self could never have imagined, and a myriad of hypotheticals that Cindy wants to tackle on her own. \"Blue Valentine\", a movie whose narrative goes backward and forward in time, shows how hindisight can sometimes be one big fallacy. The evidence shows that she was powerless to his charms. The flashbacks tell the story of her doom. After all, the warning signs were there, absolute dead giveaways that Dean was the rebound, the antidote to her college boyfriend, a real jerk, and not the man she was supposed to marry, but alas, whom she ended up loving too much. Memories are ephemeral, they don't pay the rent and put food on the table, and Cindy is paying the price for getting involved with a lovable, but shiftless townie, and yet, she has these memories, moments of pure bliss that some people may never get to experience. For instance, her grandmother, who answers in the negative to Cindy's question about ever having been in love. From the old woman's point of view, Cindy is blessed. And from our point of view, we may feel the same way, too."
    },
    {
      "rating": "9",
      "text": "a blue tale about blue characters..Blue Valentine The chemistry among the characters makes the viewers writhe on the seat as there never landed something so perfectly on terms of casting, performance, execution, writing and emotions, emotions that pours out of screen like rain. It is a simple yet practical love story that depicts the other side of the coin; something which one is unfamiliar too and has yet remained hollow on screen, screaming and summoning this very feature. The script doesn't walk on usual format and isn't restrained to a definite structure and instead flows on its self-created path that leaves the audience in the awe of it. Derek Cianfrance; the screenwriter and director, is in his A game where he might be \"all in\", but there never was projected such a tale that is not only thought-provoking but also ground breaking in its genre as it redefines it by its own rules and terms. The performance objective is scored majestically by the lead cast (Ryan Gosling and Michelle Williams) as the major part of the feature relies upon their performance. It is rich on technical aspects like background score, sound department and editing that is perfect. Blue Valentine is a blue tale about blue characters which may sound familiar but this is a rare art piece that one has never encountered before; not at this scale, not at this range."
    },
    {
      "rating": "7",
      "text": "There's no denying that watching Blue Valentine, a film that tells the story of the complete breakdown of a couple's marriage is not an easy watch (especially for someone just married!) and is certainly an intense, claustrophobic experience, as the audience never really gets a break from the two characters but honestly I was slightly disappointed that the film didn't turn out to be quite the emotional heart-breaker I was expecting. Perhaps in anticipation I had turned my heart to it's complete stone setting. That's not to take anything away from the film's leads who gave brilliantly sincere and convincing performances as the troubled couple. Special comment for the 'Future Room' which with it's tacky futuristic decor and lighting must have been director Derek Cianfrance's ideal shooting location!"
    },
    {
      "rating": "9",
      "text": "Realistic and honest, and both beautiful and tragic, Blue Valentine grips you and never lets go. Gosling and Williams give astounding performances, truly heartbreaking, devastating performances. This film is unforgettable and powerful. One of the best films of 2010!"
    },
    {
      "rating": "3",
      "text": "The acting was great, but i just didn't like the story. Predictable and with plot holes. I think it was unfinished and could've been a lot better."
    },
    {
      "rating": "9",
      "text": "Contemporary cinema is a juggernaut producer of romance films tracing a couples' elevation of compassion to a seemingly immortal love. This commonplace depiction of love certainly evokes a grandiose falsity: love is easy and love invincibly endures. When the last frame vanishes from the screen, the dominating denouement is of course one teeming with superficial catharsis. With Blue Valentine, it's as if Derek Cianfrance, the film's co-writer and director, felt that the phrase \"gag me\" had floated through his thoughts one too many times. Just as Dean (Ryan Gosling), the husband of the film's centerpiece marriage, ruefully admits, \"Maybe I've seen too many movies, you know, love at first sight?\" Among the ubiquity of portrayals of conquering affection, Cianfrance's Valentine audaciously confronts the pernicious obstacles of relationships that other films apprehensively hurdle and dodge.\r When we first meet Dean and Cindy (Michelle Williams), they are married couple parenting a bubbly daughter Franky (Faith Wladyka). The film's first 15 minutes are surely reminiscent of many parents' typical morning, as Dean and Cindy soldier on to their separate jobs, painting and nursing. Nevertheless, as drama strikes the family with the death of their beloved dog, we begin to realize that Dean and Cindy's marriage is in mid crumble.\r The film advances in a non-linear fashion, jumping back and forth from the early formations of the relationship to current time. The juxtaposition of Dean and Cindy's blooming interest for one another against their distinctly deteriorated state proficiently elaborates what Cianfrance intends to address. In one moment, as Cindy skips playfully to Dean's ukelele performance, it is confounding to imagine how this darling unity could possibly be anything else. The time flipping is charged with such a hyper contrast of building ardor and corroding tension that Valentine drags the viewer along a whirl of undulating emotion. Part of Cianfrance's genius is pitting the slowly culminating eruption alongside an equally forceful bonding.\r Let there be no debate, Gosling and Williams astound. Seldom do two characters band to form a relationship that conjures nearly simultaneous heartrending and refreshing sensations with the effectiveness exhibited in Valentine. Williams lassos viewers with her inhabitation of the severe character arc, bridging the slightly younger sanguine persona and the hopeless mother version of Cindy. Gosling has seldom entranced as well as during the hospital scene, the climactic portion of the film. Arriving drunk to Cindy's place of work, Dean has come with no purpose in mind, only to diffuse an enormity of pent frustration. While the tension unfurls in real time, one is desperately tempted to keel over in sickness at Dean's paining as he is stripped down to nothingness at the hand of Cindy's vicious words.\r Indeed, Valentine tackles head on agonizing truths about the vulnerability of love and the mortality of feelings, but the film holds an interesting structure. The flashbacks collectively represent a time span of multiple months, but the scenes in current time sum to just over a single day. Years of time sit in between the two narratives. This formula makes for a truly enlightening cinematic experience, for without it, the film would simply be a story of meaningless patchwork. The film's gaping hole is fitting; Valentine does not intend to dole out all the answers. If it did, the film would take a seat tantamount to a myriad of others in the romance genre. The history of Dean and Cindy is one of sophisticated love, one that unassumingly reaches into the dark, unknowing of what is to come."
    },
    {
      "rating": "8",
      "text": "With it's very dark and depressing portrayal of love, outstanding acting performances, great cinematography and very realistic story, Blue Valentine is a must see. It's by far one of the most depressing and sad love story put to film in a long time."
    },
    {
      "rating": "7",
      "text": "Documentary about bad growing, destructive love. Blue Valentine shines with it's authentic shaped sad story, that often turns into reality.  Why sometimes people who love so much somebody, put their heart in everything they do for them, are abandoned and not loved back? For everything have a reason. This is were Blue Valentine fails - providing one whole image, so the audience build the story from beginning to the end. Where was the cause of the present cold attitude of Cindy. However, the movie did good job according to the thematic and showing the feelings of the both characters. The thing I hope is less people knowing and being in such a love development.."
    },
    {
      "rating": "10",
      "text": "A film that talks about union and separation. Illustrating how bright and glorious may be the beginning, and how sad and bitter it may be the end. The film is blue as the color of the tears of love and sadness. A delight of what is love in decadence and in it. Wonderful."
    },
    {
      "rating": "9",
      "text": "Cianfrance's directing is laid back, as in he lets the actors do the story telling.  The emotional bond formed by these characters can be seen and felt, due to the two spectacular leads. The soundtrack provided by Grizzly Bear highlights the emotional strain just right."
    },
    {
      "rating": "10",
      "text": "Absolutely devastating. This story stuck in my head for hours after the film ended. Michelle Williams and Ryan Gosling give the best performances in their short but wonderful careers, and Derek Cianfrance's script and direction so clearly come from a personal place that you can't help but feel emotionally drained afterwards."
    },
    {
      "rating": "7",
      "text": "The film was well done; great acting, great scene writing, great structure, but emotionally it was very cold. In cold, I mean I felt detached. I also think the theme was very unoriginal. You repeating what your parents did to you has been done many many times. I also think Michelle Williams character was totally unlikeable, and I didn't think she deserved him, so therefore I didn't want them to work and that took away what I should be rooting for in the film..... It is the definition with what can be wrong with independent film. The realism takes you out of the film."
    },
    {
      "rating": "10",
      "text": "This was an excellent film with Ryan Gosling giving another riveting performance.  I do have a couple of criticisms about details that the director, or actors, or someone should have noticed.  In the first scene the adorable child is seen with a very expensive, & hard to maintain, haircut.  This family would not be able to afford such a haircut.  In a later scene, Michelle Williams French manicure is very prominent. First of all, her character works in a doctor's office & her manicure would not be appropriate, secondly, the character would not have the money, time, nor energy to have & maintain such a manicure. I find it hard hard to understand why someone involved in the film would not have noticed such jarring improbabilities."
    },
    {
      "rating": "10",
      "text": "Outstanding film - makes my top 5 for 2010. Don't want to say much about it lest I prejudice your experience with it. The crowd I saw it with was sufficiently stunned when the credits rolled.  (I've never seen credits presented quite like those, by the way.) Do what you can to see this one soon.  It's not an \"easy\" movie - you'll carry it around for a while, but it's worth it. I'm ready to see many more films by this director."
    },
    {
      "rating": "5",
      "text": "Stars Ryan Gosling and Michelle Williams were also executive producers of this film, which explains the self-indulgent acting exercise that they've turned into a downer. It runs two parallel courses, when they meet and fall in love and several years later, when their marriage is falling apart. It took 3 writers to create the mundane dialogue and a director with a claustrophobic camera. Granted, the performances are award material, but the film is grim and painful for the characters and for us."
    },
    {
      "rating": "10",
      "text": "\"Blue Valentine\": Love Story or Mockumentary?Documentary director Derek Cianfrance uses unprecedented performances by two very talented actors to tell his version of a love story.Without being two cliche, I must begin by saying that \"Blue Valentine\" is not your average indie love story.  But, on that same note, the film itself is unique because it is able to take very clique subject matters and tell them in a very unique and realistic way.  Using a combination of an un-intrusive camera along with brilliant editing and story structure, Cianfrance was able to create one of the best films of the year and one of the most emotionally raw, powerful films in decades.Derek Cianfrance's experience with documentaries translated directly onto the screen.  Having this kind of background was the only way anyone could get such a realistic feeling to this story that the MPAA felt it was worthy of an NC-17 rating.  They really didn't show too much nudity in the film itself, especially compared to the full frontal nudity in Jackass 3D, but one can easily see where the MPAA felt that it was just too real for some people to handle.  It is interesting to think about how people have no problem with sensational violence with movies such as Hostel or Saw, but when something feels \"too real\", people really do get uncomfortable with watching it unfold on screen.Cianfrance, and his cinematographer Andrij Parekh, seemed to shoot almost everything with a long telephoto lens.  This did two things: it put the audience right in the character's faces so we knew exactly how and what they were feeling at all times while, practically, let them put the camera a lot father back than normal to give a separation to the actors so they could live their scenes and even forget that a camera was even there.  There were many moments throughout the film that made the audience completely forget they are watching a narrative film, and this felt like it was because the actors themselves seemed to forget they were acting in a movie altogether.That being said, one of the biggest surprises was the performance by that young daughter, played by Faith Wladyka.  Seriously, this little girl deserves an Oscar Nomination for her work in this film.  Kids actors are always cute, but never 100% believable.  But not this one.  I really believed that this little girl didn't know she was filming a movie, but was really just being an adorable little girl.On the technical side, the editing in the film was a complete masterpiece, both on a small scale with great transitional cuts, to the film as a whole and the brilliant story structure that paralleled the falling-in-love with the falling-out-of-love perfectly.  So much of the story and character relationships seemed to come from the way scenes would transition from a close-up on one character to another close-up at a different time and location that instantly showed the audience how the emotions of the characters changed over time.  Certainly this can also be attributed to the directing and performances of the actors, but if the these performances were not pieced together in the way they were, they would certainly not have the emotional power that was felt in the film.And of course there are the leading actors.  True, Ryan Gosling does always kind of play the same part, the naive and slightly-out-of-touch-with-reality-but-in-a-likeable-way guy who always knows exactly what to say.  Honestly, and completely objectively, I would have pictured someone who would come across as more of a jerk when reading the script, but after seeing the completed film there is no doubt that Gosling is the only actor that could have pulled off a role like that.  Michelle Williams, on the other hand, was perfect casting.  She herself is really attractive without being ridiculously hot.  A perfect \"realistic hot\".  That being said, there is no doubt that she has acting skills, having the most piercing eyes that draw you in and don't let go.Ultimately, while this is not a film you can walk away from in a good mood, it really is so refreshing to see a film that is not afraid of capturing a slice of realistic life.P.S. The film was scored by indie band Grizzly Bear?  Amazing choice.medinarviews.comtwitter.com/medinareviews"
    },
    {
      "rating": "5",
      "text": "I will give the director and the actors and actresses credit for making such a gritty film. Unfortunately, there was no reward or satisfaction gained by this viewer. Grim and depressing films can be enjoyed. This one was not able to deliver that."
    },
    {
      "rating": "0",
      "text": "All I can say is that after 30 minutes into this movie I knew exactly what was happening and luckily the movie didn't try at all to do anything interesting at all. Can't get much worse dialogue or boring of a story."
    },
    {
      "rating": "1",
      "text": "The movie focus is the depiction of a broken marriage between two working class people,Dean and Cindy.What could have been a great movie becomes a failed occasion to portray an emotionally absorbing tale of an ended love story(as it was in a terrific movie such \"Eternal sunshine of the spotless mind\"). Despite the movie boasts great performances by the two leading actors,particularly by Williams,the big problem is the lack of a solid script that doesn't offer the chance to know about the characters and their love story.I would not call them insignificant informations because when you decide to make a movie about a couple and their fallen marriage you have to provide the audience of a plausible explanation of their relationship.Without that we struggle to be involved with the two leads.With \"Blue Valentine\" we exactly don't know why they fell in love and why after years they can't stand each other and why their love ends.We are left with a series of disjointed bouncing back and forth scenes of their former happy days that have not much to say,except that they go quite well together in the first chapters and scenes of their declined relationship.As I said before,the acting is solid(to compensate the holes in the script).Ryan Gosling was very good but it's Michelle Williams who gives a great performance that is the best thing of the entire movie.She deserved her Oscar nomination for her outstanding performance.Gosling portrays a man who tries to understand why her wife doesn't love him anymore and a good father although he has a scantly work that clearly makes Cindy feel quite disappointed and he is often drunk.I suspect that Cianfrance takes the side of the female lead although she is the most unlikeable of both of the leading characters and due to the troublesome script we hardly understand why she was in love and why she became so cold towards her husband.I simply found \"Blue Valentine\" the most overrated movie of 2010 and I don't know if this movie wouldn't have struggled to win many praises if it wasn't for the Weinstein campaign.My vote of the movie is 5/10."
    },
    {
      "rating": "2",
      "text": "After watching Blue Valentine all I could feel was disappointment. The screenplay didn't do justice to the cast, who gave an outstanding performance considering."
    },
    {
      "rating": "3",
      "text": "Very disappointing considering this is my kind of film. Anyone who thinks this is great must not be familiar with what great films look like. Check out Bergman if you want to plumb human emotion. Or Bertolucci. This is a very superficial and stylish film that comes up empty. Great acting, but the dialog and the storytelling are quite weak. The events are so simplistic and heavy-handed. All in all a huge disappointment."
    },
    {
      "rating": "0",
      "text": "NoOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOO"
    },
    {
      "rating": "3",
      "text": "Musicfan you may beg to differ and yes I did watch the film thoroughly and from what I can gather many other people feel the same as I did.Dull Dull Dull."
    },
    {
      "rating": "8",
      "text": "This is a very good movie, albeit imperfect.  The acting performances by Williams and Gosling are near perfect, with Williams having the more dynamic character.  This is basically two dysfunctional people falling in love and growing apart:  Williams' character grows up and wants and deserves more than Gosling's character is able to give.  While is is neither Bergman nor Bertolucci, it is interesting and real.  People like this exist and make bad decisions every day.  It is very interesting, at the very least, to see the devolution of a relationship that did not even begin under the best circumstances.  The narrative structure of the film is disjointed, probably intentionally, which detracts from the emotional impact of some of the scenes.  There was a great deal made about the sex in this movie.  Really?  Why?  It's not particularly graphic.  Two of the scenes (aggressive jerk old bf and husband wanting a new baby) were critical to the movie's plot.  On some level, all they shared was sexual compatibility, at least early on.  That's part of what this film is about.  The MPAA is nuts, as are people who \"hate\" this movie."
    },
    {
      "rating": "9",
      "text": "This movie is the perfect recipe for an American indie and more. Cinematography -outstanding (watch the end credits, endearing), actor's direction -supreme, soundtrack -perfect for 90s and the performances are literally breathtaking. Gosling makes you forget he was once a stereotype. The story of deterorating love is heart-wrenching. A must see! @cinemaquote"
    },
    {
      "rating": "10",
      "text": "Wow Juliet1000,  if all you can talk about is Michelle Williams lying on her back, it makes me wonder if you even really saw this at all! Little interesting dialogue and slow pace!? Well, I beg to differ. I thought WIlliams and Gosling were both fantastic, and I was deeply engrossed with this film. If Natalie Portman didn't give such a great performance in Black Swan, I would give the Oscar to Michelle Williams. Granted, if you are looking for escapist fluff, don't see this. However, if you are looking for great acting with a great script then definitely see this!"
    },
    {
      "rating": "10",
      "text": "I was very encouraged to find this site. I wanted to thank you for this special read. I definitely savored every little bit of it.Madal Bal natural Tree Syrup"
    },
    {
      "rating": "10",
      "text": "An economized story that could only function with two leads that exude intelligence, charm, wit, and dare I say: grace. Actors with the ability to exercise these God given gizmos as they were commonplace among us all - and shut them down when necessary, for the sake of our betterment - to instill good in the name of art. \"Blue Valentine\" was ten years-plus in the making - an absurd figure to the laymen - yet, when leaving the theater - as my sister ran away ahead of me to weep in privacy - I realize how meager this world is of beauty and thoughtfulness - we follow two stories in the film - one full of expectancy, desire  and young flesh - buttered with  evenly layered sunlight - while the other is crippled, fluorescent, and thoroughly defeated.  Civilization, by default, propagates neurosis, sorrow, and dysfunction.  Some people collapse into it from exhaustion - some people give in - some relent - move to the country - yet, it follows.  \"Blue Valentine\" imbues tragedy by way of sacrificing two superior specimens - the best mankind can conjure-  it does so for our sake.  This is an allegory of too many things to encapsulate in a review - it's not a simple tale of \"love gone bad\" or what have you - it's poetryâ"
    },
    {
      "rating": "0",
      "text": "'I am Sam' meets 'Raging Bull', and if you've seen either of these movies, then you don't need to see this one.This is a slow, painfully boring, unbelievable, implausible film.    How could this woman carry on a relationship with this mentally handicapped man for so many years?   Why is she leaving him now?On a technical level, everything about this film is good or better, but the sum of the parts is far less impressive than the parts themselves.THE STORY MAKES NO SENSE.   THESE PEOPLE STAYED TOGETHER FOR YEARS?   WHAT?   WHHHAAAT?If this had been about a fling month long relationship out of desperation, I could have understood it, but if you can keep it going for more than couple of years, then there's no reason they should divorce now.What a hopelessly negative, banal, boring, stupid film...   I'd give the parts, the scenes, the acting, the editing and shooting a 9/10, but the film itself is 1/10.The only thing memorable about this film is how bad it is, and ANYONE who gave this film a positive review is BRAINLESS."
    },
    {
      "rating": "8",
      "text": "Blue Valentine is the slow rise and fall of a relationship. I'm sure some people watched this and thought \"why would anyone want to watch a downer movie like this.?\" Well I think because it's a honest portrayal of what can happen in a relationship and some people find that hard to watch. Movies like this aren't full of bells an whistles and don't leave you with happy feelings at the end. What it does do is a give you a look into the birth and destruction of a relationship and how we are capable of hurting the ones closest to us. This will be too close for comfort for most people."
    },
    {
      "rating": "8",
      "text": "Great performances by Michelle Williams and Ryan Gosling makes the movie worthwhile."
    },
    {
      "rating": "10",
      "text": "Cianfrancer's Blue Valentine almost flawlessly delivers an authentic and original love story of how relationship really progresses in the real world. From its realistic dialogue to Gosling and Williams' genuine emotion, the film does not seem to hide or pretend to convey the message that love does not always work out for everyone perfectly."
    },
    {
      "rating": "5",
      "text": "The story is a mess. It has some great scenes but ultimately fails to be captivating. Tries too hard to be artsy."
    },
    {
      "rating": "7",
      "text": "The fact that these actors seem so real makes this movie-watching experience pretty miserable -- different, from, for example, a movie like \"The Break-Up\" in which you never believe a moment of the Vince & Jennifer hook-up and so can't be much bothered when the \"relationship\" fails. I though Gosling and Williams were equally terrific; I know she got the Oscar nomination, but suspect she got extra points for nudity. One problem I had was that, with the back-and-forth between the beginning and bitter end of their relationship, we lose some understanding we needed about how they coped in the middle. In this some of the reviews & previews are misleading . . . it's not about a relationship that started out wonderful and went downhill. It's about a relationship that started out with big, serious problems and somehow endured for a while."
    },
    {
      "rating": "8",
      "text": "Strong acting with a competent script, what could go wrong? Not always the easiest movie to watch since it's about the breakdown of a relationship, and one where the power is WAY out of balance. Sad. Not certain who the target audience is, but, if you like drama, there's plenty here with wonderful performances from Michelle Williams and Ryan Gossling. Some scenes had me crawling out of my skin. The one minor detail I didn't personally care for were the number of tight shots, which arguably added to not only the tension, but a sense of voyeurism / viewing from a safe distance. Nothing here is over the top, everything is nicely understated, and pushed just far enough, which is never easy to accomplish. Nicely done."
    },
    {
      "rating": "8",
      "text": "An intimate wrenching and emotionally honest portrait of the birth and decay of a relationship.  Subtle direction and pitch perfect acting from both Gosling and Williams alike."
    },
    {
      "rating": "8",
      "text": "I am absolutely baffled that Ryan Gosling didn't get a Best Actor nomination for this and Michelle Williams did.  Don't get me wrong, I thought she did a very good job too, but it didn't compare to Gosling, who I think is quite underrated.  The story is told in a non-chronological, retrospective view.  But the order and direction of the story is the most beautiful part.  It is kept a bit mysterious, but easy to follow and understand where in the story you happen to be. The middle of the film did drag out and it didn't have to be a 2 hour movie.  The most memorable scene was when they were walking and started singing and dancing.  I think it was the apex of their relationship and showed that they could be happy together.  It gave them that little bit of hope in their minds that they could hold onto their relationship and work it out. Overall it's a good story with good acting."
    },
    {
      "rating": "8",
      "text": "The two central performances from Ryan Gosling and Michelle Williams are truly excellent. They take the audience through a whole range of emotions and back again! The film is shot using quite a lot of hand-held camera; but not too shaky; which makes for a realistic feel to the drama. To me it seemed a little odd to show just the beginning and the end of the relationship; maybe I missed something, but I wanted to know what happened in the middle. Could be it was doomed from the start. I enjoyed this one and would watch it again (making sure I was in the mood first); definitely worthy of my recommendation.\r SteelMonster"
    },
    {
      "rating": "6",
      "text": "It was okay, considering that halfway in you begin to realize that Cindy and Deans' relationship was reaching its peak in the present time and that they were showing the birth and death of their relationship."
    },
    {
      "rating": "9",
      "text": "Feels like real life, I strongly sympathized with both characters at different points. The movie is totally absorbing. Both actors do an absolutely fantastic job!"
    },
    {
      "rating": "9",
      "text": "This movie has been one of the best romance ever seen in my **** life. Michelle and Ryan are amazing, everything you need to broadcast that film was memorable, I loved"
    },
    {
      "rating": "8",
      "text": "Love it. Very good screenwriting for this film. The story line is very good. Very good acting in this movie. This movie should of got nominated for an Oscar. I don't know why this movie up for best movie. Really good movie that i suggest every body should watch. It keep you into the movie. Very good romance and drama movie. also comedy this movie had some funny parts in it. I think everybody will enjoy a movie like this."
    },
    {
      "rating": "9",
      "text": "A movie so relentlessly depressing that by the end I felt defeated. There wasn't one moment in the film that made me cry or feel a wave of sadness, but as the credits rolled I realized just how sad I felt. The characters are so frustratingly stuck that it was devastating to watch, and even more devastating to realize just how realistically they acted. I grew up in a home where my parents fought constantly, and Ryan Gosling and Michelle Williams perfectly emulated that experience."
    },
    {
      "rating": "9",
      "text": "blue valentine is too much; too real, too close to the heart, too close for comfort. it not sterilized and the rawness of the movie - fueled by great acting and cinematography - may be more than what audiences can take, especially if they can relate on a personal level to the inexplicable demise of the bonds that bind and define us."
    },
    {
      "rating": "9",
      "text": "Tension is the name of the game for exhaused lovers Ryan Gosling and Williams. The film cuts and back and forth in time filling in the gaps. The authenticity of this film cannot be understated."
    },
    {
      "rating": "7",
      "text": "The movie centers on few things in life like love,relationships,instant marriages due to some unwanted reasons and other **** portrays\"the **** quite beautifully and how complicated it really gets for some of the families out there which might have formed due to some or many unavoidable reasons.I personally felt that the female character was at fault here - young,restless,prone to committing some serious mistakes and later bend life at her own will with adjacent to the mood swings which we have seen getting portrayed regularly with some of the really major romantic movie genre.And which actually sucks for all the goody tissue guys out there who are not good with money but actually respect the integrity of their family very well and are willed to do anything to keep it at its best state of condition."
    },
    {
      "rating": "9",
      "text": "Mesmerizing picture of love and marriage. Magnificent performance by two its lead, Ryan Gosling and Michelle Williams. Love, even its hurting you, it still beautiful, and... never try to surrender with the tests."
    },
    {
      "rating": "8",
      "text": "I think the most accurate description of this film would be \"beautifully depressing\". I was left wondering why Ryan Gosling wasn't also in the oscar conversation. Definitely a movie that makes you think, especially after its conclusion. I think this leaves all people in relationships asking themselves \"that won't happen to me, will it?\" Really makes you think about where you stand in your own relationship."
    },
    {
      "rating": "10",
      "text": "This movie is tired from the start, hard to watch, and really only useful for those who can view this as something they might have been through....but then it might be to painful to watch and depressing...I will add surprisingly, wonderfully acted and painfully real. If you want pure cinema well this is it, if you want to have a movie pity party well this is it, if your looking for a warm feeling and happy disposition when the credits role you might want to try morning glory. Finally ....good cinema....but I like to think story's like this can ruin a good time."
    },
    {
      "rating": "7",
      "text": "Very good movie. I do not like drama movies, but if they are good, I can stand them. This movie is slow, but I do not mind slow movies. It is not for one who just wants action and a fast pace movie. But it really does a good job showing the contrast in the couples life."
    }
  ]
}