{
  "id": 3523,
  "title": "Blue Jasmine",
  "starring": [
    "Alec Baldwin",
    "Cate Blanchett"
  ],
  "runtime": 99,
  "genre": [
    "Drama"
  ],
  "description": "After experiencing a traumatic misfortune, Jasmine French, a wealthy woman from New York, moves to San Francisco to live with her foster sister Ginger and the firm purpose of getting a new life, but she will be haunted by anxiety and memories of the past.",
  "releaseYear": "2013",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/zLdLiUJfueZBctdv8OvkmGXEHEC.jpg",
  "categories": {
    "plot": 5.916666666666667,
    "acting": 5.681159420289855,
    "ending": 6.8,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 5.5,
    "funny": 7.071428571428571,
    "action": 7.0
  },
  "reviews": [
    {
      "rating": "8",
      "text": "Woody Allen has a very distinct style and shows quite impressively in this film. Cate Blanchett is a roller coaster of emotions in this movie and she nails every bit of it. Truly fantastic acting on her behalf."
    },
    {
      "rating": "9",
      "text": "Excellent film; black comedy to the extreme  certainly demented and emotionally twisted. Bobby Cannavale and Sally Hawkins are charming counterpoints to the insanity of Cate Blanchett's eponymous character. This movie leaves the audience questioning the reality of what the are actually watching."
    },
    {
      "rating": "10",
      "text": "Blue Jasmine is really touching. It not only can see the brightness of Woody; Cate Blanchett tore my soul with her interpretation.  \r Ten dollars well spent."
    },
    {
      "rating": "8",
      "text": "Any Woody Allen can be great, as long as he's not acting in it.  The humor and natural pacing of the film is signature to Allen's greatness as a director, and Blanchett is perfect for his type of humor."
    },
    {
      "rating": "8",
      "text": "Great movie - funny, dramatic, and consistently entertaining.  Cate Blanchett is a true artist.  Woody Allen killed it with this one.  Alexander Skaarsgard (sp?) was my least favorite part.  He just seemed out of place amongst such connected actors."
    },
    {
      "rating": "3",
      "text": "Working against time to see the Oscar nominees.  Didn't know that this was a Woody Allen film until it started .  .that's how clueless I am.  Cate B.'s performance was very good and it sounds like she'll win the Oscar.  Okay.  Trying to figure out why this film was so disturbing to me.  Not sure . . . wanted to eject the DVD but waited until the end for what I hoped would be some redemption.  Disappointed that it ended the way it started .  .Jasmine talking to herself. Sheesh."
    },
    {
      "rating": "7",
      "text": "Although \"Blue Jasmine\" felt a little scattered during the second half of the film, it's still pretty good overall. It creates fully-developed characters with proper history and tells a STORY with them. Nothing revolutionary, just an average great fun movie."
    },
    {
      "rating": "10",
      "text": "Many riches in this movie:\r1) It's wonderful that Mr Allen finally decides to place the entire story around one character, not many. It's all about Jasmine from start to finish. Midnight in Paris and Match Point were neither as focused nor as interested in their leading characters.\r2) I do see and appreciate the funny bits but Blue Jasmine is a drama. It actually hits tragic proportions by the end and I love that.\r3) It's almost ridiculous that Cate Blanchett, already one of the best actors in the world prior to this movie, delivers her most iconic leading performance as Jasmine after being in the business for almost 2 decades. Naturally and deservedly she won the Oscar and broke the record for most Best Actress awards won by a single role - 42."
    },
    {
      "rating": "5",
      "text": "Blanche DuBois comes onstage. She’s Stella’s older, single sister (early thirties). Blanche waits inside the apartment and has a shot of Stanley’s booze--the sisters reunite and Blanche reveals some bad news--they are bankrupt. She had a bit of a break-down--Blanche is horrified that her sister is living in a dump like this one when they both come from such a wealthy, elite background. Blanche has another drink--rest assured that Blanche is either having a drink or about to have a drink at all times--Stella goes to the bathroom and Stanley enters and Blanche sees a man not good enough for her sister and too brutal for the DuBois sisters--while they chat, Blanche reveals that she was married once, but her husband died-- that night Stanley and his buddies play poker at the house. Among said buddies is Mitch, who is single.\r No, you are not watching a remake of “A Streetcar Named Desire” or a filming of Cate Blanchett's  Blanche, that she played on stage to resounding success. You are watching a modern Woody Allen  version called “Blue Jasmine” but unfortunately Allen is not the poet and lover of words that Tennessee Williams was. Here Blanche is called Jasmine, or Jeanette, her sister Stella here called Ginger, played by Sally Hawkins, only now they are not blood sisters but both were adopted, which gives Woody Allen a chance to riff on genes! He also has a Bernie Madoff like Alec Baldwin while pointing fingers at how much did Jasmine--Ruth Madoff--know?\r Now instead of one Staney we have 3: Gingers ex, Augie (Andrew Dice Clay), her current lover Chili (Bobby Cannavale) and a possible future lover Al (Louis C.K.) while Blanche/Jasmine’s gentleman caller Mitch  is called  Dwight (Peter Sarsgaard). Some more modern touches are using San Francisco instead of New Orleans, the guys watching a football game instead of playing poker, Jasmine popping Xanax and  we see Blanche’s Belle Reeves in her New York life. Allen does stick to old blues songs playing a lot of the originals.\r While all the actors acquit themselves doing excellent work it is more Cate Blanchett’s  movie than theirs or Woody Allen’s. This is the closest we'll ever get to her stage portrayal of Blanche and, as of now, she is the forerunner for the Oscar’s Best Actress award."
    },
    {
      "rating": "5",
      "text": "People are just afraid to truly rate a Woody's film, because they're afraid of his name.\rWell, I don't think the well chewed subject looked any more appealing in this film. A tiring, slow paced, and predictable drama that scored above 40 only because Blanchett's acting was so good.\rI can't believe people said it's \"Arguably Woody Allen's best film\"  when it's not even one of his top ten... baah"
    },
    {
      "rating": "0",
      "text": "this movie shouldn't be nominated for anything. i love woody allen, but giving this movie good reviews is only encouraging more of the same material. the only depth in the story is in blanchett's character and in my opinion her acting wasn't as great as a lot of critics seem to think. watching this old woman in denial for what seemed to be 3 hours when it was only 98 minutes is not an enjoyable experience. the movie has two comedians and the only parts i laughed at were how awkward the serious scenes came off.\rthis type of movie could have worked if it had more depth. blanchett's character doesn't fit into the typical woody allen movie, if this movie accomplished anything it's highlighting that fact in bold. it was just a big disappointment and the blame has to go to allen. i can't blame the actors for believing in the movie or giving it a good try. i still respect allen but if he produces more movies like this you can count me out."
    },
    {
      "rating": "6",
      "text": "Cate Blanchett can do no wrong. As usual, she's brilliant as a neurotic, upper crust New Yorker whose life falls apart when her husband's (Alec Baldwin) shady dealings cause their downfall. She travels all the way to San Francisco to move in with her hard-working sister. Even with her captivating performance, watching Blanchett cope with the realities of being broke and her sister's pedestrian taste becomes laborious. As usual, director Woody Allen has filled the cast with spot-on actors (including Sally Hawkins, Bobby Cannavale, Peter Sarsgaard), but his script is too neurotic and unpleasant. This not even remotely a comedy, but a sad portrait of a desperate woman."
    },
    {
      "rating": "2",
      "text": "I'm giving this film 2 stars because at times it was funny but mostly it felt like torture rather than entertainment and the only reason I endured the entire film was I was hoping it would redeem itself, which it did not. If you want to get up close and personal to a bunch of characters who live in a constant state of denial and have given up their common sense and morals for material possessions, treating each other as part of the food chain, as objects to be manipulated, used and thrown away  if that's your version of \"humanity\"   then by all means go see this. My suggestion to the rest of us wait a few weeks until its on DVD and rent it that way you will only spend a couple bucks and if you don't like it you can switch the channel."
    },
    {
      "rating": "2",
      "text": "The movie is well done, however it is not enjoyable. Very few of the characters are likable, and seeing Jasmine's character have one mental breakdown after another becomes tiresome. The film is so bleak it becomes difficult to watch. I was ready to walk out when the film finally ended. This should not be listed as a comedy."
    },
    {
      "rating": "10",
      "text": "Simply put: it's tremendous. Cate Blanchett is astonishing. I can't recall a better performance (or more difficult role) by any actress in recent years; yes, it really is that good (prepare to be awed!). It's Woody Allen's best movie in quite a long time. This was a very tricky film to pull off; credit the faultless cast and Mr. Allen's direction for crafting such a compelling and successful production given the extremely complicated relationship of it's subject matter and tone. On this last point, moviegoers must be aware that although the film is filled with continual humor and comedy, the underlying story is very dark and unsettling. That said, it's not standard Hollywood film fare in the best possible way. There is no predictable story or narrative here; you never feel entirely comfortable with the characters or where the film will take you next."
    },
    {
      "rating": "3",
      "text": "I'm a blue collar guy and if there's one thing I know, Woody Allen has never spent a moment of his life getting to know men like me. In fact, while watching \"Blue Jasmine\", I was struck with the feeling that almost every character in this movie was somewhat imaginary. I kept thinking, \"This is not how a person from this background in this situation would respond or behave\", there was always something disturbingly off kilter in nearly every scene. It felt like a play, a two dimensional play.\rCate Blanchett is a terrific actress and it's something to see as she tries to spackle her past outwardly while desperately failing to reconcile her conscious inwardly. Almost everything else is garbage. Your demographic for this movie goes like this: White, Affluent, Insular, Educated, and mostly in\rRetirement. Woody Allen knows this audience and, in my opinion, very little else. Clams in San Francisco? Dear Lord, did no one whisper into the emperor's ear that crab is what we eat here? Stupid example yes, but the entire movie has dumb moments like that. But details matter.\rCall me an idiot, but I did not even know what this movie was or that Woody directed it, furthermore, I didn't pick up on the fact that this was a retelling of Streetcar. I really can't tell you how that passed me off. The writer and director of this movie is a putz. Such good actors, such a great city to set it in, such a lot of money; Such an insipid waste."
    },
    {
      "rating": "10",
      "text": "Brilliant. Cate Blanchett gives the performance of her career! This film is as good as it gets. In the same category as \"Interiors\", \"Husbands and Wives\" and \"Crimes and Misdemeanors.\" The entire cast shines and this is one of Allen's best screenplays."
    },
    {
      "rating": "9",
      "text": "refreshing... if you are human you have to like this movie...  fun... multiple characters did an excelent job for this movie.. no complaints... non generic"
    },
    {
      "rating": "5",
      "text": "Baldwin and Blanchett are wonderful. The rest of the cast is good, too. The problem with this Woody Allen film is the incomplete story. Jasmine's exploration of life at the dentist's office, with the budding politician, her son or even her husband  each ends without much discovery of something bigger than the sum of the action. She dumps the dentist, gets dumped by her husband, gets dumped by the politician... and that's kind of it. The politician dumps her simply because he finds out, in one chance bumping into a character that informs him of Jasmine's lies about her former life. That mechanism for moving forward in the story is a bit weak. There's nothing emotional for the audience to grasp onto to buy into it. It's just information. The politician could have acted any number of ways and we are non the wiser as to why  his character and relationship with Jasmine isn't developed in that way. Ebert used to complain about this kind of script where characters just announce what they're feeling or going to do, rather than have it unfold as story. There are many other instances of this kind of storytelling. However, the potentials for a great Woody Allen movie are lurking throughout. Baldwin's character seems even to be more dimensional and nuanced than even Blanchett's though both have great characters to portray. I wish Allen would have dispensed with the San Francisco travelogue (yes, he's guilty of characters ending up in iconic places that seem to go against their probably natural geography... ending up in South Park near downtown, wtf) and stayed in New York to develop Baldwin's character and story in all it's complex contradictions. Instead of Blanchett telling about her embarrassment selling shows to her high society friends, it would have been more bittersweet, funny and sad to have actually seen that, rather than her and the dentist."
    },
    {
      "rating": "9",
      "text": "I just saw the film last night in London.  Wow!  Allen's best picture in years.  I liked Midnight In Paris but this is even better and fabulous in most aspects.  Treat yourself to an acting masterclass from Blanchette.  We will always have opinions about what works and what doesn't.  I felt this hit a nerve about where we are in society today and what we are looking for   and how we get and lose what is most important.  Life is messy and we are living in uncertain times like never before.  No one knows what is around the corner and life throws the unexpected towards us without warning.  Thank you Woody!"
    },
    {
      "rating": "2",
      "text": "Although this is well acted, Woody Allen's arrogance and cruelty is hard to take.\r We watch a Cate Blanchett's very unattractive character disintegrate under a mass of grandiose and selfish self-delusion while she behaves badly to the people that try to help her. It's disturbing to watch, and I came away wondering why anyone would want to make an intensely ugly movie like this. Is this a morality tale? Or just something to make us feel good about ourselves while we look down on the main character's frailties?\r I've been used to indulging Woody Allen's oddly dated view of the world because his interesting characters, but this is just too cruel and unredeeming."
    },
    {
      "rating": "10",
      "text": "Great movie, great acting.  Cate Blanchette is Jasmine, a woman who has lost touch with reality because she's lost her identity.  Woody Allen's script and overall concept are both human and divine.  This movie is so full of humanity, everyone should be able to relate in some odd way and feel both annoyance and empathy for its characters.  I love this movie.  Allen at his best."
    },
    {
      "rating": "1",
      "text": "Painfully depressing movie with no redeeming qualities--other than a bunch of fully developed characters who I'm happy to not know in life and wish I'd never met on film.  Frankly, I'm baffled by all the positive reviews.  Cate Blanchett's performance verges on being histrionic, which apparently critics are keen on.  Mental health issues  visible breakdowns  sociopathic behavior  awards, please.  Best of luck to the cast and crew on that, but I'd like my hour and a half back."
    },
    {
      "rating": "3",
      "text": "I am a long-time Woody Allen fan and consider myself a minor aficionado of his work, but I am at a loss as to what he was intending by making a film about a person who is mentally ill and whose life is coming apart--again and again--because of her inability to have a relationship with the truth. Glib jazz played over tragic emotional breakdowns did not elicit amusement in me or my partner. We were deeply disappointed and somewhat disturbed. Okay, quite disturbed. I give it a 3 instead of 1 because there are some excellent performances. Too bad they are for naught."
    },
    {
      "rating": "8",
      "text": "Well, great acting, sure, I guess. Cate, of course, obviously. Bobby Cannavale was exceptional. But I couldn't wait for this movie to end, it was so sad. And the ending? Wow, saddest thing of all. I still feel lousy, although I just saw this today. Maybe I'll feel better soon."
    },
    {
      "rating": "7",
      "text": "“Blue Jasmine” is the latest submission by writer-director Woody Allen. It stars Alec Baldwin,, Cate Blanchett, Peter Sarsgaard, Sally Hawkins and Bobby Cannavale in this story of a character strangely resembling  Bernie Madoff (Alec B) and his wife (Cate B) as they seek to function after the fall. Intermixed with this basic plot is the plight of Ginger, the sister of the Mrs. Madoff-like character and her boyfriend (Bobby V) who so much resemble Stella and Stanley Kowalski in “Streetcar Named Desire” than probably even Mr. Allen would care to acknowledge. The characters are flawed and yet we never go further than skin deep in this commentary by the author and the need for tranquilizers and relaxers as our heroine faces life after luxury. The first really non-comedy from Mr. Allen since Interiors in the 80;s, I was disappointed in the product. Although certainly easy to view, the film lacks depth and tells us really nothing about what we are watching. I wonder if the many critics who are falling all over their pens to praise and acknowledge this work would be doing so if the author and director had a different name. I remember years ago that going to an Ingmar Bergman movie automatically meant you either loved it or didn’t understand it  It was heresy to criticize it or not give it a rave review. So, at the risk of heresy and incurring the wrath of the Allen fan club members, I give this film a 7 because I truly expected so much more but never got it."
    },
    {
      "rating": "7",
      "text": "I would call the latest of Woody Allen's movies, \"Blue Jasmine\", definitely not the best one but quite watchable.\rThe movie resembles the Madoff's scandal, even though all names are different, but parallels are clearly seen.\rThe way the story of the main character Jasmine is told is appealing to me. Every now and then a current event triggers a memory flash from her past life, and that is how we learn what brought her to the shabby state she currently finds herself. There are numerous faults in the script (written by Woody Allen as well). Plus over-all the movie leaves some clownish aftertaste (which is not unusual for his movies). But Cate Blanchett's performance made me forget all the movie's shortcomings. Even though the whole cast is quite good, without Cate I would be disappointed about the movie as a whole. An Oscar-winning performance!"
    },
    {
      "rating": "0",
      "text": "I used to love Woody's movies and I even loved the dramas but this movie is terrible.  None of the dialogue rings true, even the direction is bad and Woody, you are stealing the basic premise of Streetcar Named Desire and butchering it.  Why people are showering praise on this pile of crap is stunning.  The actors do a valiant job of trying to bring some truth to this dung heap but nobody could.  Louis C.K.  can write and direct circles around what Woody is doing now and is totally wasted in this.  People walk up to characters in this and spout dialogue that no one would say and no one who has a brain or taste can possible think this is good.  The only explanation must be that because of what Woody has done in the past and the controversy surrounding him now, which by the way I do not care about, has made people support his work no matter what  but this is possibly his worst movie ever.Stop making movies Woody, enjoy the accolades of the past and let better writers and directors take your place, Louie for one and let us love and remember you at your best, this is movie is far from that."
    },
    {
      "rating": "7",
      "text": "I prefer to live on a wavelength unfrequented by the masses. So it makes sense that I'd enjoy most Woody Allen films; films that are strange in that very familiar way. His characters are portrayals of us or people we know  magnified to the extreme degree. He's the master of balance, paying equal attention to the shocking and tedium bits that make life such an interesting (and often painful) adventure.\r Blue Jasmine  his most recent film  plays with this idea of balance. A rather dramatic and shocking premise (Jasmine's husband kills himself while imprisoned for fraud) tempered by an exploration of what it's like to be painfully middle class (Jasmine is forced to redefine success, which prior to her husband's suicide meant multi-million dollar homes, the fanciest of clothes, and vacations in Saint-Tropez). It's also a too-close-for-comfort character study of Jasmine (played by Blanchett)  we literally watch the fabric of her being unravel like a pathetically pretty doily.\r Blue Jasmine is a deep sea dive into the frighteningly wild and unpredictable sea of Jasmine's emotions. Despite her beauty and timelessly elegant style, we learn that the only thing to have ever lived beneath her gorgeous facade was a manikin of wealth and power. When her husband's fraudulent money-making schemes are punished and Jasmine's left with nothing but her chanel accessories, she realizes how empty her life has become; and how, until now, she's never had to lift a finger to fill it.\r Faced with this sudden challenge, we witness Jasmine's unraveling. She seems to sweat profusely in every scene (somehow beautiful despite massive pit stains and greasy hair). Her stoli-vodka martini trembles in her anxious hand, as she tries to make a life for herself while living with her adopted sister Ginger, working as a receptionist for a dentist, and going back to school to learn how to use a computer so she can start an interior design business of her own.\r As the film continues to explore Jasmine's discomfort with the work required to be a self-sustaining adult and the lack of reward for doing so, I couldn't help but feel that this was a story about me; about the extraordinarily average life I lead. But through Jasmine's unraveling, I felt less and less wooed by the idea of \"making it big\" or having stuff. Regardless of the facade  be it a chanel belt or vacations in Saint-Tropez  we're all essentially the same  up manikin trying our damnedest to hold our  together behind the scenes.\r Allen continues to make thought-provoking films with beautiful women in it. I loved this one, and Blanchett surely deserves an award for it."
    },
    {
      "rating": "4",
      "text": "Another story that has been done time and time again with below average performances except for Cate Blanchett. Very few of the characters are likable, and seeing Jasmine's character have one mental breakdown after another becomes tiresome."
    },
    {
      "rating": "2",
      "text": "The Village Voice review on the left argues that Blue Jasmine is \" relentlessly clueless about the ways real human beings live\" and I think that just sums it up perfectly. Most of the characters are so completely ridiculous and artificial that it seems like they escaped from an SNL skit. That shouldn't be a problem in a comedy, but here's the thing: there's nothing funny about the plot of Blue Jasmine. There's infidelity, divorce, financial fraud, prison, suicide, debts, mental problems... a whole litany of very serious topics that Allen handles with a subtlety straight from the Three Stooges. It's revolting and the only reason why I'm giving Blue Jasmine such an undeservedly high rating is because of the excellent acting."
    },
    {
      "rating": "10",
      "text": "This is one of Woody Allen's best films! \"Blue Jasmine\" continues the Director's fascination with betrayal, deception and infidelity.  It also ranks as his best film since \"Match Point\", and in the upper echelon of all of his work.  The performances are, to a person, outstanding.  From Cate Blanchett's oscar-worthy lead to a score of smaller roles, it is note perfect throughout.  Andrew Dice Clay brings a surprising world-weary subtlety to his part, by far a career best for him. Huge kudos also to Sally Hawkins and especially Bobby Carnavale, who shows a \"blue collar rage\" unseen in Allen's films before.  I'm not discussing the plot because there's no need to give anything away.  This is, without a doubt, up there with \"Hannah And Her Sisters\" and \"Crimes & Misdemeanors\" as his best serious work."
    },
    {
      "rating": "7",
      "text": "Allen has been cruel to many other of his characters, most memorably in Crimes and Misdemeanors, and he’s also left many other characters as prisoners of their own stasis and delusions—The Purple Rose of Cairo and Vicky Cristina Barcelona come to mind. But I’m not sure any of those other characters were quite as fully realized as Jasmine, which is naturally tribute to Allen and Blanchett and their alchemy together, but it also made the film, for me, hard to take. (A minority opinion given the reviews I’ve read.) I saw sadism in it, beyond the usual misanthropy. (Love misanthropy!) Or, put another way, Blue Jasmine feels like tragedy without catharsis—an interesting thing to pull off, but not particularly moving or maybe even admirable."
    },
    {
      "rating": "10",
      "text": "The movie was amazing. Cate Blanchett deserves (at least) a nod from the Academy. Andrew Dice Clay was brilliant as well. I thought the entire thing was superb and if people don't like it, my question to them is: What did you expect? This is Woody Allen after all. How much of it is a Ruth Madoff what-if, a lot of it me thinks."
    },
    {
      "rating": "10",
      "text": "The field for the 2013 Oscar for Best Actress has already narrowed to two: Cate Blanchett (Blue Jasmine) and Julie Delpy (Before Midnight). While Blue Jasmine has multiple flaws in story and script, Cate Blanchett's performance overwhelms everything else about the movie. She alternates between feverish and cool, delusional and pointed, with something like feral intensity. It's a shocking performance, really, one that lays bare the greed, rage and confusion that exists within all human beings. This is a must-see film. Must-see."
    },
    {
      "rating": "9",
      "text": "The best Allen's film since Match Point. Cate Blanchett as Jasmine is outstanding, definitely an Oscar-worthy performance. I hope the next director's movie will be equally good or even better."
    },
    {
      "rating": "10",
      "text": "Poder estar adentrado en los pensamientos de una persona como Jasmine fue sencillamente fascinante.  Es por esto que entiendo que no solo esta ha sido una buena película, sino que la actuación de Blanchett fue impresionante, profesional y muy artística.  Woody Allen nos ha dejando en los últimos años una serie de películas que demuestran la capacidad y la educación que el hombre tiene como director de cine.  Simplemente con ver uno de estos filmes lleva a uno a reconocer que le pertenecen, porque su estilo se ha convertido en su firma."
    },
    {
      "rating": "2",
      "text": "There seems to be a complete loss of direction during the film where you are left bewildered and questioning when does it end.  A load of polished tripe."
    },
    {
      "rating": "0",
      "text": "Great cast, well played by everyone!\rBut I am giving review for a movie not a cast.\rWorst movie I have seen in years!!\rMan if you read this run away, do any house work anything your women wants to do BUT do not go to this movie. It is depressing, it is boring and useless!\rDo not waste your time!!\rI hate scary movies but I would trade it for any scary movies in a heart beat.\rNow for all girls that think your life is terrible go to this movie! Maybe you will appreciate something in your life more and stop complaining about not having this or that.\rThis movie is not couple movie!\rI would name it as \"movie for two(or more) single girls \"\rI hate it!"
    },
    {
      "rating": "0",
      "text": "I received the DVD as a SAG screener.  I'm so glad I didn't have to buy a ticket for it...or two tickets..plus popcorn and drinks...and driving to and from the theater...with the expectation that this woujld be a great movie because  critics and fans say it is.   I was hoping  that before I popped the DVD in the machine it wouldn't be one of those wordy diatribes that Woody has with himself on screen as all of his characters.  My hopes were dashed.   Did all of us watching not know how this was going to play out?   What was the point?  There was nothing realistic about it Blue Jasmine..and that's because it was an unintended parody on what life might be like for a  new divorcee who got bit by a Madoff style scheme gone Federal.   Oh poor pitiful Jasmine/Jeanette.  Who cares?!?!?!?!  No one cares.   it's been done so many different ways.  Was it well acted?  It was overacted by Kate Blanchett with a forced Manhattan Elite American accent.   The only scenes I liked involved Louis CK's Al Munsinger character.  Well done, Woody.   Anytime you can cast the likes of Louie CK, you've done well. I should rate this film a 2 instead of a 1 just for that, but i won't.   Do us all a favor, Woodster.  Go back to making ridiculous comedies like \"Bananas\"   You're unmatched in that genre.  And drop the clarinet-laden art house wannabe flicks.  Leave them to the French.   They know how to make the films you're attempting to puzzle together."
    },
    {
      "rating": "10",
      "text": "Arguably Woody Allen's best film. He has certainly made none better. While this movie has a passing resemblance to A Streetcar Named Desire, it is more nuanced, more complex, more layered, and more convincing. Unbelievable script and performances. This film deserves at least two Oscars, for script and best actress. And it hinges on no amusing gimmick. No time travel. No man stepping out of a movie screen. No hypnotist. No gangsters cursing one another under the influence of helium. Just excellent pure focused tight drama. See it."
    },
    {
      "rating": "10",
      "text": "Although Woody is a great comedic filmmaker, my favorite films of his are the dramas.  This film is a throwback to the great 80's films of his like \"Interiors\" and \"Another Woman\".  Cate Blanchett is mesmerizing as a woman who has lived in a bubble, and cannot face the real world.  She is only comfortable in her unrealistic world as the wealthy trophy wife, and cannot function when the marriage tragically ends.  The supporting cast is superb, but this is Cate Blanchett's vehicle to take all the way to the Oscars.  LOVED the ending as well.  Perfection."
    },
    {
      "rating": "6",
      "text": "Does Cate’s have the belated Oscar’s BEST LEADING ACTRESS in her bag? For a vanity-ridden, insolvent, over-the-hill trophy wife widow who just lost her fraudulent husband (who committed suicide in the prison) and desperately looks for an eligible replacement to get her upper-class life back on track in a Woody Allen’s film, it is not congruent with Cate’s majestic poise which we all kneel over, naturally I will be head over heels if she wins, but this year, my heart goes to Dame Judi Dench in PHILOMENA (2013), how often does the Academy honor the senior leading ladies? And no one deserves more than Dench among her peers, while Cate is at her prime and tons of opportunities await ahead.\r Digress back to BLUE JASMINE, Allen returns to his homeland and the film is set at San Francisco, Jasmine (Blanchett) forfeited all her properties and bank savings after the passing of her husband’s Hal (Baldwin), returns to live with her sister Ginger (Hawkins), who is a working-class divorcée with 2 children. There are clashes between Jasmine and Ginger’s fiancé Chili (Cannavale), and a past wrangle of losing Ginger and her ex-husband Augie (Clay)’s lottery money scars the harmony between the sisters too.\r The bumpy road of Jasmine’s readjustment into the new life style commingles with Jasmine’s high-end good old days, which grants Blanchett a full gamut of theatrical flexibility to sculpt a rather unsympathetic character from all possible (negative) angles, her shallowness, neuroticism, maliciousness, phoniness, obnoxiousness are all over the place, especially when the revelation unfolds near the end, what’s the odds for a wealthy wife to inform on her husband after discovering his chronic out-of-wedlock affairs? Not in real life but in Allen’s wishful thinking script, Once she grabs her status, it is no way she will squander everything out of a passion of betrayal, it is something every trophy wife should have learned by heart, what’s more unconvincing is that Blanchett can never be that stupid. A paralleled subplot of Ginger’s flirtation with a better suitor vehemently hints that things are not better for those lower class dreamers, reality bites.\r The non-American Blanchett and Hawkins master in their American accent, Blanchett can never disappoint us, even under the most wretched situation, she is fiery and undefeated like a lioness will never capitulate. Meanwhile I’m more complacent for Hawkins’ hard-earned Oscar nomination, what a unique character actress she is, innocuous but vibrant with driving forces. Also an unsung hero among the cast is Cannavale, juggles with the siblings as the unsophisticated blue-collar labourer, who can be so blatant to snide at Jasmine’s ruin and question her faults and so volatile when going frantic with Ginger’s lapse and totally smitten with her when she retreats back to him.\r Disregarding the overstated hubbub with A STREETCAR NAMED DESIRE (1951, 9/10), BLUE JASMINE is not Allen’s top-tier output, the script is far less from award-worthy and a satirical comedy, but its friendly orange tinge and eclectic jazz ditties could accompany you for a lazy high tea time with Jasmine babbling about her delusions of grandeur, life is comprised of continuous dramas, so just let’s laugh about it."
    },
    {
      "rating": "9",
      "text": "You can keep your Annie Hall's, Manhattan and Midnight in Paris. This is the best Woody Allen film in years and it's all because of the magnificent Cate Blanchett. Yes, she's back and HOW in a performance to savour that must rank as the best in any Allen film. What about Diane Keaton I hear you ask. Diane Keaton! Don't make me laugh, well actually she didn't! There are simply not enough superlatives to praise Blanchett's playing of this wonderfully multi dimensional and complex woman. The last time I can remember seeing such a delightful and off beat female character on screen was way back in 1987 when Holly Hunter presented us with her controlling TV producer Jane Craig in Broadcast News. Another performance to relish. Whether popping pills, talking to herself or rejecting suitors Cate is joyous whilst looking absolutely fantastic into the bargain.\r In all honesty Allen's screenplay, whilst dramatically very good, is not particularly funny. The comedy is elicited by Blanchett's delicate playing and her expressions from scene to scene. Her escape from the clutches of the amorous dentist has to be seen to be appreciated and she makes it laugh out loud funny. There are no two ways about it she steals the show. Sally Hawkins does well in her role as the sister and of the men Andrew Dice Clay registers the best as Hawkins' ex-husband. But it is Cate all the way. Academy make up for your mistakes of yester year with the likes of Paltrow, Berry and Bullock and crown a true talent best actress. Yes, give her the oscar."
    },
    {
      "rating": "9",
      "text": "Maestro Allen (and by this point it's an honorific well-earned) has infused elements of Streetcar Named Desire and Long Day's Journey into Day into this dark comic reflection of the impact of a serial narcissist on everyone around her.\rCate Blanchette's creation of a woman so blinkered by her own needs she can't see around the corners of her own despair is achingly funny and alternately tragic.  We know this soul.  We all have a touch of her within ourselves (hopefully abated by an ability to bring the needs of others into equal measure with our own.)\rFew directors strike and hold a pitch-perfect note of tragicomedy like Woody Allen; if some of his works are inspired by those dramatists and filmmakers who have so profoundly influenced him over the decades  (Bergman, Fellini, et al.) Woody has processed their themes through a piercing lens of his own and given us a stark insight into the 21st century malady of self-absorption.\rNo less touching or amazing is the persistently underrated Sally Hawkins as the sister with the \"bad genes\"; she may not love herself as much as we hope she will, but she knows how to to live in her own skin and when the realities of this life ultimately take sway over the fantasies of our youth she able to make a stand.  Like Stella Kowalski, she may go from one Stanley to another (really more of a \"Mitch\" in this case) but she will taste the richness of life and be surrounded by love.   Conversely, Jasmine must ultimately be enveloped by her delusions until the final exit door slips quietly shut and leaves her in a shining void in which she is Empress in her fantasia realm of self-importance.\r * *Spoiler alert**  read no further if you haven't seen it!  Meditate on Jasmine's next stop after that park bench at the end.  The street?  Another hospital?  Another series of willing victims?   I love that Mr. Allen lets us decide for ourselves."
    },
    {
      "rating": "8",
      "text": "This film is carried by Blanchett's great performance, as well as a lot of great supporting performances. She does a great job with a fairly unsympathetic character. This is a great exploration of narcissism and denial."
    },
    {
      "rating": "7",
      "text": "Great acting by Blanchett, interesting story (oh, humans). Although at the end I expected more drama, like she was imagining the last part. And it ends up being circumstancial."
    },
    {
      "rating": "9",
      "text": "Blue Jasmine is Woody Allen's strongest female character since Annie Hall. Part Greek tragedy, part morality play, Allen applies his traditional theme of infidelity to the perils of today's financial markets, with more dramatic than comedic effect. Cate Blanchett excels at the dual persona Jasmine, establishing herself as the front runner for next year's Oscar for Best Actress. Departing from his lighter, more nostalgic recent efforts, Allen's Blue Jasmine is similar to that of Shadows and Fog, exploring the darker aspects of human character, specifically, inaction in the face of injustice. Not to be missed, catch it in the theater. Blue Jasmine is also a welcome addition to your Blu Ray collection."
    },
    {
      "rating": "7",
      "text": "Woody Allen is a director who sometimes hits the target and sometimes shoots his own feet. However, he never fails to be interesting and innovative. Here, he will try to make his own vision about the famous movie \"A Street Car Named Desire\". The story is similar: Jasmine is a very wealthy housewife who has to say goodbye to all when her husband is arrested for tax fraud and the IRS takes almost everything that belonged to the couple to pay off debts and taxes. So, the former millionaire is forced to return to her poor family, who lives an ordinary life that she despises. To make matters worse, she is psychologically decompensated and had a nervous breakdown.The film uses very well the charm and elegance of Cate Blanchett, who plays the protagonist role in an extraordinary way. Her interpretation is so good that is reason enough to watch. Beside her, a number of good supporting actors gives her even more room to shine. The highlight goes, of course, to Alec Baldwin, Andrew Dice Clay and Sally Hawkins, the latter in the role of Jasmine's sister. The film addresses, in essence, the relationships between these characters, and the way they both try to manage their lives. The ending is a bit sudden, perhaps even sad in that the main character is totally displaced, in the midst of a world that does not understand her and which her does not seem prepared to accept. Finally, a note of approval for the soundtrack, based on jazz and blues, full of elegance and that seems to point to the psyche of the title character."
    },
    {
      "rating": "8",
      "text": "This is a well made film. The story is well constructed and well written. The directing is good. The highlight of the film is Cate Blancett's performance. The character is interesting and relatable enough as it is but Cate's performance makes it even better. Cate does a wonderful job with the material given to her especially when she has to get angry and/or upset. Defintely deserved her Oscar nomination for Best Actress. Film buffs and adults should definitely check this one out. Everyone else see if you want but you may be bored."
    }
  ],
  "recommendations": [
    "the_intern",
    "marriage_story",
    "joy",
    "silver_linings_playbook",
    "gifted",
    "the_devil_wears_prada",
    "the_descendants",
    "morning_glory",
    "vicky_cristina_barcelona",
    "a_beautiful_day_in_the_neighborhood",
    "blue_valentine",
    "closer",
    "me_before_you",
    "revolutionary_road",
    "the_glass_castle",
    "locked_down",
    "lady_bird",
    "the_danish_girl",
    "collateral_beauty",
    "manchester_by_the_sea",
    "up_in_the_air",
    "the_upside",
    "fences",
    "as_good_as_it_gets",
    "the_fault_in_our_stars"
  ]
}