{"id": 3850, "title": "Body of Lies", "starring": ["Leonardo DiCaprio", "Russell Crowe"], "runtime": 128, "genre": ["Action", "Drama", "Thriller"], "description": "The CIA’s hunt is on for the mastermind of a wave of terrorist attacks. Roger Ferris is the agency’s man on the ground, moving from place to place, scrambling to stay ahead of ever-shifting events. An eye in the sky – a satellite link – watches Ferris.  At the other end of that real-time link is the CIA’s Ed Hoffman, strategizing events from thousands of miles away. And as Ferris nears the target, he discovers trust can be just as dangerous as it is necessary for survival.", "releaseYear": "2008", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/sLjVDPPfNQfAma9XyOqHPClQb2V.jpg", "categories": {"plot": 6.428571428571429, "acting": 7.137254901960785, "ending": 5.75, "soundtrack": 6.0, "cinematography": 5.75, "familyFriendly": 3.0, "funny": 5.0, "action": 7.363636363636363}, "reviews": [{"rating": "7", "text": "Something tells me that my rating would have been much lower had it not been for the fact that I got a good night's sleep before seeing this movie. In other words: This is a VERY complex film, with many subtleties and subplots, and one must be prepared to give it their undivided attention. That said, Body of Lies is certainly worth the attention span required. It is indeed cleverly executed and well acted; specifically, my favorite performance was that of Mark Strong, as the Jordanian head of Intelligence. Overall, Body of Lies intelligently combines the art of mind-games war drama with a cautious amount of exploding-in-your-face action. Why not a higher score? While the film was well put together, I feel that it is ultimately a bit forgettable. Movies like this have been done before, and this one doesn't exactly stand out from the bunch. Worth seeing if you see a lot of movies, but if you're an occasional moviegoer, you may wish to skip it."}, {"rating": "4", "text": "If it had not been for Mark Strong's performance in this movie, it would have been terrible. I'm a big DiCaprio fan, not so much of Crowe. But I expected a lot from this movie. As some people said before, it was a bit too Hollywood for my taste. But again, Strong's perforance steals the show and he proves that he can hold his own and even shine brighter than well known great actors."}, {"rating": "1", "text": "Boring 'cellphone' pic. Wholly unoriginal and entirely unbelievable at the same time."}, {"rating": "8", "text": "This movie is as every bit entertaining as the Bourne series, but has a more current overlay with the war on terror. It has just as much or more suspense as Jaime Fox's The Kingdom, and performances from all the main characters are excellent. I highly recommend this movie, and urge all to forgo all the negative criticism, and be your own judge. I promise you won't be disappointed."}, {"rating": "8", "text": "Very enjoyable movie. Worth seeing on the big screen. The acting was very good (not sure what other folks are saying). Definitely worth the ten bucks to see this film. Be prepared for some quezy torture scenes."}, {"rating": "7", "text": "I didn't mind this, I kind of expected something in between Kingdom of Heaven and Blood Diamond. But of course, it is better than Blood Diamond. The action is better, the movie is exciting and great. But the acting is awful and it's very predictable. It could have been much better if it had a point, but it was good otherwise."}, {"rating": "10", "text": "Another masterpiece from Ridley Scott. Small problem in the plot which had me rocking in my seat- Those UAV's have Infrared. The U.S. could have seen the exchange of Ferris."}, {"rating": "1", "text": "This movie won't be remembered."}, {"rating": "9", "text": "I've seen this movie numerous times on HBO lately, and it always grabs me and keeps me interested. i like the characters, i like the actors, and i'm very interested in the subject matter. i really appreciated that there were sympathetic and powerful arab and persian characters, and hani pasha/mark strong gives me a particular thrill. I've seen this film compared to bourne, which i don't really get. bourne was a kind of James bond/superman type who pulls off stuff which demands suspension of disbelief. the only superhuman act that Ferris manages is a medium range hip-shot/head-shot with a mac-11. other than that this film seemed fully convincing to me, and david ignatious (the writer of the novel), certainly knows the middle-east and the cia. i think of this film as comparable to \"hunt for red October.\""}, {"rating": "10", "text": "The best work to date on this war on a an abstract verb thing. Period. An accurate & authentic portrayal of Arabs & Arabic values & culture that should be recognized as groundbreaking, this seems to go over most professional reviewer's heads... I too, speak Arabic & have lived long in the Middle East.. although it's not without flaws. The support cast is outstandingly good. Do I need to say the same about the famous leads? 5 stars ..10 out of 10 for me!"}, {"rating": "10", "text": "An intelligent, very well crafted political thriller. It will obviously have many detractors, at it would be expected. Crowell and DiCaprio are both at their best. Great cinematography, excellent supporting cast."}, {"rating": "9", "text": "I liked this film a lot. Leo and Russell were excellent but the actor who stole the film is Mark Strong. He was exceptional. Worth a look and surely the performances should be considered and cited for awards at year end. Take a chance. You might be surprised at how good it is."}, {"rating": "9", "text": "Very well made film with a brilliant performance by Leonardo DiCaprio. Mark Strong who plays the character Hani actually does a much better job than Russell Crowe does in this film, which surprised me. Overall \"Body of Lies\" is definitely a film worth checking out."}, {"rating": "10", "text": "Loved every minute. DeCaprio and Crowe are magnificent as are other actors of lesser renown."}, {"rating": "8", "text": "This is a solid movie, DiCaprio just gets better and better, and Strong was very good. Crowe did a fairly ordinary job, I felt perhaps the role didn't suit him. In any case, this film puts the viewer right into the mix and is engaging right to the end (although somewhat predictable!)."}, {"rating": "6", "text": "I have certainly seen much better from leo and crowe. This movie goes to fault as a disappointment, because it's pointless in all aspects, it works, but after a while it just doesn't go anywhere. There's no display in the relationship of Leo and many other peoples, their communication and survival against and upon one and other, like Babel. But Scott got lazy and Monahan drew in excellence. I give it a 7 because i better give this some credit, it just is almost pathetic. But overall, when it comes to it's composition, it gushes out real hard and a gritty, intense, edge-of-your-seat ride. It's okay."}, {"rating": "7", "text": "Now this is not as bad as most movies out there in the cinema. just for a heads up to those who plan to see this. This movie is very similar to righteous Kill, the same kind of editorial and execution. But in this, the acting isn't very good. But as a Ridley Scott movie, it does disappoint. But it's also a big Oscar film that I think deserves some credit. I liked it."}, {"rating": "2", "text": "What's with all the distractions? Why is Crowe's character always doing five things at once while on the phone, coordinating CIA business? Because the phone-conversation isn't interesting enough in itself? Well, that's the problem with this movie: Over-sophisticating a simple story, replacing lack of script with chaos. It's just very annoying."}, {"rating": "7", "text": "Excellent cinematography, very good production and performances. It's a little long but it is compelling. The plot is complex but interesting. Solid."}, {"rating": "7", "text": "I agree with Jess D.'s review...Mark Strong really stole this film and regardless of awards or any of that, very few reviewers even mentioned him. Anyways, as you can see from the user reviews, this film is not nearly as bad as the critics made it out to be. This is easily Ridley Scott's best film since \"Black Hawk Down\"."}, {"rating": "7", "text": "Hollywood takes on modern political warfare, with tart, crisp results, but still Hollywood."}, {"rating": "10", "text": "I have spent the entire last week reading reviews from critics that would lead me to believe that this film was a big, over the top, action movie with some decent performances that ultimately takes us nowhere that we have not been before. Imagine my surprise when I come to find out that the opening scene of the film is the only real action scene in the movie and that it wasn't very long. This is most certainly an action movie but, the action is more dialogue driven than anything else and since the performances are all uniformly excellent (especially that of Mark Strong who gives one of the most memorable performances of the year) that is a good thing. I must also point out that DiCaprio's character is a complicated man, no doubt, but where his heart lies is at no time in doubt. Also, the relationship with the Jordanian nurse was very well handled and the young Arab actress who plays her is very good. I will look forward to seeing her in the future. This film is not over the top, it is highly accurate. My wife did Imagery Interpreting in the military and without giving away any real secrets she told me that the film was very close. Isn't that the kind of thing we want insight into. I know I do. Now to the comment that we are not breaking any new ground here. Well, that is right to an extent. There is nothing in this movie that has never been said and this movie plays out very similar to the way other spy films have in the past. The biggest reason for this is the fact that we have developed a pretty good idea of how intelligence is collected in the last 20 years. David Ignatius, the author of the novel, is a journalist who would know better than any person who could possibly review this film and I take is version of intelligence gathering at face value. However, the most important reason to see this movie is to help you understand the way that intelligence does work and how it should work. Which is the true lesson in this potboiler. I would also like express my gratitude to the writer for some of the expertly created bits of social commentary that could have come of as lines but, in this film, have consequences. This is not the best film of the year and will probably not finish in my top ten ( The Dark Knight sits a top that list now), but it is an expertly crafted piece of work that accomplishes everything that it sets out too and in a year with so many terrible films, I was deeply satisfied."}, {"rating": "5", "text": "The lonely person on the other end of the line wants to believe that the phone sex operator has her undivided attention on him alone. But that's just not the case. In Robert Altman's \"Short Cuts\", the jaded sex industry worker(played by Jennifer Jason Leigh), diapers her baby as she talks dirty to a client. Likewise, Ed Hoffman(Russell Crowe) achieves a seamless synchronicity between his professional and domestic life, too, tending to his young daughter while he's in communique with Roger Ferris(Leonardo DiCaprio), the man in the field, at the mercy of a disengaged partner, jaded, just like the sex hotline caller in the Altman film(based on the Raymond Carver short story collection). Film theorist Linda Williams, author of the essay \"Film Bodies: Gender, Genre, and Excess\", explicates on how victimized women elicit a corresponding fluid in three interconnected genres of film: semen(pornography), blood(horror), and tears(melodrama). In \"Short Cuts\", the fetishized release of a fluid is coordinated by an empowered woman; the phone sex operator instigates the happy ending, not the man. Likewise, while Ed is obviously not a woman, he assumes the feminine side of the gender binary, since Roger is a man of action(masculine), not talk. Losing semen can't kill a man like how losing blood can. Ed's relative indifference for his partner has the potential to result in an unhappy ending(death, unlike the happy ending; the little death); the real-life horror of being martyred by the enemy at some undisclosed location. Contrary to the popular(and condescending) notion that a woman could never start a war, the primary quality associated with traditional(or is that reactionary) womanhood(femininity), until recently(as women in combat became more prevalent, therefore unfixing the masculine/feminine binary), has been the catalyst behind wars since time immemorial, when people like Ed stayed behind and allowed the real men do the dirty work. It's even worse here, since Ed gives Roger his marching orders in the informal setting of his home. Like a housewife, perhaps? In \"Body of Lies\", through a multitude of intertextual prisms, the filmmaker unconsciously suggests that the final destination point of the film body is not exclusive to the tyranny of male objectification."}, {"rating": "7", "text": "I can't imagine why this has gotten such a low critical reception. It has problems, but most of the complaints I'm reading are ridiculous. This movie is nothing like Spy Game and especially nothing like the Bourne series (not even the original one). If I had to compare this movie to any other, it would be to The Kingdom. And that's a favorable comparison. One person I think shouldn't have been in the movie at all, however, is Russell Crowe. Not only does he bring nothing as an actor, but his part in the story is equally pointless. Apparently he serves only as an outlet for DiCaprio's character's internal monologue, without which we would know nothing. Despite that, I still give the movie a solid 7."}, {"rating": "10", "text": "Leo always gives a stellar performance."}, {"rating": "8", "text": "This is an excellent movie-timely and with an interesting plot that makes you put yourself and your political ideals in context with the reality of the people on the ground. I agree that Russell Crowe is somewhat unbelievable, but, his performance makes you thinks instantly of Bush and his operatives and how closely to their lives any of the war really is-excellent performance by Mark Strong and DiCaprio is always excellent. The comments concerning the confusion over the \"love interest\" -he missed the point-the girl was the perfect foil to make us believe that DiCaprio's character cared about the real muslims and had a stake in the outcome of his mission beyond CIA success."}, {"rating": "8", "text": "DiCaprio is excellent. Scott's filmmaking is top-notch. Could the characters be fleshed out a bit more--yes, but this is a gripping and exciting film. Better than 95% of the movies out there."}, {"rating": "9", "text": "The ads may show nothing but a worthless, pointless, and indirect of annoying circumstances of a film. But mainly I was attracted because it is from director Ridley Scott who is winning Oscars, I loved his Gladiator, American Gangster, and Kingdom of Heaven. I loved what William Monahan was writing for The Departed and Kingdom of Heaven and lets see what he does with Jurassic Park 4. Also, Body of Lies has a great and stellar cast. Leo and Russell don't even have to try, they resonate from nowhere and easily create magnificence. I liked their performances, although not their greatest roles. It seems somewhat fimiliar, but is very exciting and realistic. It's a quick and entertaining movie. It proves no purpose, I just loved the writing and the shining brights on such fabulous actors. A Great Movie."}, {"rating": "10", "text": "After success with supporting actor Russell Crowe in Scott's American Gangster, and Leonardo's fantastic performance in Scorsese's The Departed, Ridley bundles them together in a high-steak intensity thriller. A global crisis event of filmmaking, and an influential crisis as well. A national masterpiece of stirring proportions. Don't blame it, Body of Lies is City of God (but English version) meets The Bourne Ultimatum. A great successful match for sure. The Pulp Fiction of all intense thrillers. You can't stop watching this classic. I know, I know people say Gladiator won 5 oscars 'cause it was Scott's best movie, but actually winning almost way to many academy awards, this is beyond better. Sure Gladiator was a groundbreaking colussus of action genres, but Body of Lies is beyond a colossus of thriller genres, it's a masterpiece of them all. Scott really attempts a lot of styles, Gladiator the action genre, American Gangster the crime genre, and kingdom of ehaven the adventure genre (which is actually better than Gladiator). This is by far the best movie of the year. Go see this now."}, {"rating": "6", "text": "I am kind of disappointed with this movie. I mean, Ridley Scott did pretty good in American Gangster. But seriously, I'm not sure if this will be a highly critically raved film. That's just because this movie really falls short. It has the style and kick of The Kingdom, but this is actually not as exploit but as loud. The script from William Monahan is excellent, almost every line is impressive and great. But Russell Crowe, like I've seen much better from him. Leo, he looks tired and with his accent, it sounds like it's an effortless accomplishment. But it's flawed. The editing is really good, but the movies execution is poor. Some moments are very predictable and boring. It just feels way too familiar. And I'm letdown by this disgrace. It shows no purpose or point of the film's based reason, it sends no message. It's just a huge action-clunker. It works as a good action movie, with great intensity. But the movie overall was as disappointing as Burn After Reading. So far, The Dark Knight is still the #1 film of 2008. Like come on, whens a there gonna be an actually good-solid movie this year."}, {"rating": "5", "text": "This is like The Kingdom, but worse! I wouldn't spend a penny on this SHIT! It's up there with 10,000 BC and Jumper as being one of the year's worstest movies. It stinks. It's lame, pathetic, boring, dull, pointless, effortless, and a huge-snoozer (thats pretty bad for a loud actioner). The execution and especially direction drew me to an emotional shock. The sentiment and sensation is intense, but seriously this movie never matures and it tries ot be a Bourne movie with a shakey camera. The writing was easily perfect, but Monahan was ripped off by Ridley scott. you might wonder why i hate this movie. But trust me, I know a good movie when I see one, this isn't a good movie. Juts check it out, and you'll see why."}, {"rating": "4", "text": "I thought it was terrible. I struggled to finish it."}, {"rating": "6", "text": "Leo and Russell are the highlights, although Crowe's hair looks too fake.  It's watchable even though it does get preachy at times.  It's almost as if DiCaprio's character is repeating verbatim what the public has been saying about the war in Iraq for years.  There's little chemistry between protagonists.  An okay thriller dealing with trust, credibility, and the dangers of alliances."}, {"rating": "6", "text": "Russel Crowe - love the character change yet again. I liked the acting by the Jordan head of Intelligence .. Pasha whatever his name was - sorry. Leo is so so for me in action hero type of role. Good sets and effects.Movie was good not great."}, {"rating": "6", "text": "Just your average run of the mill CIA/Terrorist thriller. DiCaprio dies well in his role and Crowe is as annoying as he can possibly be (in a good way). The plot his complex and strong with its statement on political interference in the Middle East, but the movie just doesn't separate itself in any way from the myriad of other movies in this genre"}, {"rating": "8", "text": "Good movie, with great actors and an interesting plot. The pace however is too slow, which destroys the overall impression a bit. Still worth to watch it."}, {"rating": "7", "text": "i found the story of Body of Lies very intriguing. the representation of the conflict in the middle-east was very accurate. the movie is also very exiting. i was sitting on the tip o my chair almost all the time."}, {"rating": "9", "text": "I am not a fan of Russell Crowe, but his partnership with Leo in this film as the protagonist is perfect. The story explodes into many different directions, which requires your full attention. But, isn't that what you want from a thriller."}, {"rating": "6", "text": "This one is alright to pretty good. Leonardo DiCaprio and Russell Crowe are great, Mark Strong's performance is also strong, while Oscar Isaac has a good turn as well. Ridley Scott's direction is also good as usual. The story us interesting and quite compelling for surs. The action is also done very well, which is nice. In addition, the cinematography and the sets are good, making the imagery really nice and the locations believable. However, there are two major problems with this one. First, the script is poor. While the overall story is good, the telling of it is very convoluted and can be hard to follow at times. This is not helped by it being hard to hear some characters at times. In addition, the few scenes of torture are a little much for my liking. They are effective, but would have still been so if toned down just a little bit. Overall, Body of Lies is a solid action spy thriller sporting killer acting performances and an entertaining premise, which make the film an enjoyable one to watch. However, you have to pay close attention, as you can get lost easily."}, {"rating": "7", "text": "To me this was a good simple story with a decent script, but I still can't see Leonardo DiCaprio acting as a spy or a stone-cold-blood-killer-bad ass-special ops-agent, I still see him as a teenage actor suitable for Glee maybe but that aside, the movie is still very entertaining."}, {"rating": "6", "text": "Body of Lies tell truth to entertainment.\rThe film floats on an interesting premise with very good action, and an artful execution. The movie is long and at some times less desirable with certain scenes that could have been edited out. The overall product is a slightly overly long entertaining film with good acting."}, {"rating": "6", "text": "I'm gonna divide this review into 5 parts: Directing, Cinematography,Writing,Score and finally Acting.\rDirecting - I though that directing in this movie was quite alright. But the actors in my opinion didn't seem to be on the same page, so over acted while other didn't deliver. But having said that you could definitely feel Scott's vibe during the whole movie. In some episodes it even reminded me something out of \"Black Hawk down\", maybe there is something special about Ridley Scott and the desert scenery.    I would rate it 12/20\rCinematography - I was really impressed with the cinematography of the movie, even though the movie wasn't all this great. But the locations looked really authentic and nice through out the movie. The whole movie had a dawn or even evening feeling.    I would rate it 15/20\rWriting - The script in my opinion was the worst part of the movie. Even with this great cast the movie wasn't able to be intriguing or unpredictable. Having said that, the whole movie felt either rushed or dragged at the times. The plot felt short, even watching it in 2015-2016 were thing portrayed in the movie are happening right now.    I would rate it 8/20\rScore - The score seemed very generic for an action movie. However i was watching this movie without surround system at home, but my impression was that the sound effects and soundtrack as whole might felt good in a movie theater.    I would rate it 13/20\rActing - Two of the leads Russel and Leo had very different roles and characters, yet one in my opinion was quite miserable and the other was decent enough. Crow either had a really bad role or it was bad casting choice, because he didn't seemed to fit the role. This was because of his bad accent or either because he didn't have any memorable lines. Leo on the other hand did quite decent job for the movie, towards the end. I also could not say, that actors had a really good chemistry especially the female actresses didn't seem to fit with Leo's character and the idea for Roger Ferris to speak so much Arabic doesn't seem to go well with the movie. I would rate it 11/20\rNow the MVP of the movie was Mark Strong who in my opinion had a really nice character who seemed to fit in the movie really well. Strong's delivery was very strong and could feel his chemistry with Leo in the scenes.\rIn Total i would rate this movie - 59/100. This movie is decent for one time sitting."}, {"rating": "5", "text": "Neither the location-based verisimilitude of Ridley Scott’s shooting style nor the estimable Middle East expertise of source-material author David Ignatius can disguise “Body of Lies” as anything other than the contrived phony-baloney it is. Coming on like an inside account of CIA operations against jihad-minded terrorists, pic shows its true colors by featuring a shootout, chase or big explosion every 10 minutes or so, on its way to a climax so conventional it would have been at home in a 1940s Warner Bros. melodrama. Despite the Iraq War hovering in the background, Leonardo DiCaprio and Russell Crowe leading the charge in a high-octane would-be thriller.\r Due to Scott’s clear interest in West vs. Arab conflict, explored in both “Black Hawk Down” and “Kingdom of Heaven,” novelist and journalist Ignatius’ intimate knowledge of the scene and scenarist William Monahan’s proven skill with complicated narratives and pungent dialogue, there was reason here to hope for something more than an updated companion piece to Ridley’s brother Tony’s 2001 espionage meller “Spy Game.”\r The setup certainly has merit. A dedicated Arabist and fluent in the language, rough-and-tumble CIA op Roger Ferris (DiCaprio) works the treacherous streets of the Middle East, be it in Iraq, Jordan or Syria, trying to recruit help, infiltrate cells and uncover plots against steep odds. His boss back in Langley, Ed Hoffman (Crowe), is a blunt realist who admits that a democracy is “an easy target” and that it wouldn’t be all that hard to bring Western civilization down.\r Better yet, the story hinges on an ingenious plot hatched by Ferris to flush out a shadowy master terrorist who’s embarked upon a series of devastating bombings against civilian targets but never steps forward to take credit: Ferris creates an entirely fictitious rival terror organization whose atrocities and unknown leader are designed to force the real perpetrator far enough into the open for apprehension.\r Sounds like a can’t-miss premise. But Scott and Monahan, who teamed on “Kingdom of Heaven,” take a mostly formulaic approach that becomes more disappointing as the yarn unwinds, right up to the cornball denouement that is everything that even some internal dialogue had promised it wouldn’t be.\r Working in similar rugged-modern-adventurer mode as he did in “Blood Diamond,” DiCaprio frequently gets roughed up and bloodied, to the point where his character even seems to like it. As he tries to ferret out a potential informant in the Iraqi desert or to run surveillance on a terrorist safe house in Amman, Ferris is observed by Hoffman via crisp overhead images provided by high-flying drones. Given the technology at hand, it seems surprising the CIA doesn’t enjoy a higher success rate than it appears to.\r But as Hoffman himself best articulates, terrorists can flourish by going no-tech, relying on quiet person-to-person communications. This is where Ferris proves invaluable, at least to the extent that Hoffman permits him to function on his own terms.\r Despite the sociopolitical points of interest and even insight, however, the scenario begins to feel contorted and ultimately poisoned by its adherence to movie conceits rather than real-world terms; the film capitulates to what it’s thought audiences want from Hollywood action cinema, rather than going its own original way with material that could have been far more absorbing and provocative. No matter how credible and realistic the urban and countryside scenes may look (many Morocco locations doubled for the numerous Middle Eastern locales represented), what takes place in them comes off as increasingly hokey and concocted. In the end, “Body of Lies” infuses the thriller format with hot modern issues less successfully than did last year’s “The Kingdom.”\r DiCaprio throws himself into the middle of dangerous doings much as he did in “Blood Diamond” and “The Departed,” that is to say with grit, determination and an underlying need to prove something. Strong makes a marked impression as the cultivated Jordanian spy boss, Farahani brings spirit to a standard role and Simon McBurney adds another eccentric to his resume as a nerdy computer genius.\r And then there’s Russell Crowe. Asked by Scott to put on 50 pounds for the role of the Cofer Black-like CIA figure, the actor has clearly obliged, to the point where he now looks like a candidate to succeed the late, great JT Walsh as a specialist in beefy, menacing supporting characters. Sporting cropped salt-and-pepper hair and an Arkansas accent, Crowe literally phones this one in — as perhaps half his performance is spent speaking by cell phone to DiCaprio overseas; the other half has him peering over reading glasses to make his point. It would be nice to see this great actor toughen up again and take on some more challenging roles."}, {"rating": "7", "text": "Body of Lies the indicative American movie about the Middle East. That did the whole world if not the help of CIA, especially sponsoring of Al-Qaeda weapon. The movie as the work of art is not bad, all game is extended by DiCaprio and Russell Crowe's excellent game. But everything spoils too American patriotism."}, {"rating": "5", "text": "Je me demande si le filon des films sur le terrorisme va finir par se tarir, car évidemment plus on avance et plus ça tourne au documentaire, forcément très proche de nous et donc déprimant, puisqu'il nous faut désormais regarder la météo des attentats avant de mettre le nez dehors.Au moins, les Américains regardent ça d'un peu plus loin que nous, encore que parfois... bien que je soupçonne les autorités de balayer les débris et les questions sous le tapis, comme on le fait d'ailleurs souvent chez nous : pas d'amalgame, la faute à pas de chance, c'était un \"accident\" et tutti quanti... sauf quand c'est trop évident et que la tache a fait mer d'huile. Evidemment.Donc, voilà Ridley Scott qui s'y colle avec les moyens, spectaculaires, ainsi que deux stars qui n'amusent pas le terrain : Crowe est assurément délectable de cynisme et Di Caprio toujours autant passionné, la fougue de la jeunesse même s'il n'est plus un gamin maintenant : la preuve, il porte le bouc. Son personnage est crédible dans son opiniâtreté, pas dans son idéalisme de ravi de la crèche qui tombe amoureux du Moyen-Orient et d'une autochtone. Eh, tu te prends pour Lawrence d'Arabie ou quoi ? même Lawrence n'a pas eu le temps pour ça, dans le désert. Ou alors c'est le scénariste qui s'est pris les pieds dans le tapis (sans jeu de mots... quoique).Côté réalisation, c'est assez bien fait, hormis une caméra un peu trop nerveuse. Le rythme reste élevé, les enjeux sont clairs et critiquent ouvertement les méthodes de la CIA, clairement moins efficaces que les services secrets de Jordanie : ouais les satellites et les hélicos ne suffisent pas, faut croire !Tout cela est bien venu même si je suis convaincu qu'à part nous espionner, nous les Européens décadents, la CIA ne fait pas que de la merde. Alors, Monsieur Scott et Monsieur le scénariste, un peu de coeur à l'ouvrage, bon sang ! et remettez-vous en phase, cette fin \"Greenpeace\" à la con est indigne de vous. De quel côté êtes-vous à la fin...? le problème n'est pas la CIA, c'est le terrorisme, ne l'oubliez pas."}, {"rating": "4", "text": "a pretentious insight on the \"cons and cons\" of politics gone wrong..Body Of Lies2 Out Of 5Body Of Lies is a plot driven feature whose thirst for delivering an exhilarating and complex mission is unable to express it to the viewers. There isn't a single lose thread of the plot that audience may feel the urge to hold on to, the makers not only fails to seek the viewers' attention but doesn't even convince them for a second look. It is short on technical aspects like choreography of the action or chase sequences, cinematography, sound department, art design, background score and editing. The writing is weak, raw and seems unsupervised especially since there was a lot of inessential and chalky material projected on screen. The adaption by William Monaghan isn't smart as it seems which creates the portal of loop which not only is stultifying but questionable at certain points. Ridley Scott; the director, inputs a lot of his tactics to save the ship from sinking but unfortunately everything is overstuffed and undercooked. The actors holds on to their roles and delivers a decent performance if not something out of the park especially by Leonardo DiCaprio, Russell Crowe and Oscar Isaac in his limited time that he has. Body Of Lies is a pretentious insight on the \"cons and cons\" of politics gone wrong and if considered a bigger picture, a feature gone wrong."}, {"rating": "9", "text": "Honestly don't know what the fuss is about; it's a great film with attachable characters and a decent story. It doesn't have those Mission Impossible vibes, and it's not ultra action-packed, but it's an entertaining and well-produced film in my opinion."}, {"rating": "6", "text": "Body Of Lies is a decent movie. The plot is interesting and it's pretty much about this CIA agent called Roger (Leonardo DiCaprio) who finds out about this major terrorist leader.So him and his boss Ed (Russell Crowe) decide to make a plan to trap Al-Saleem but things don't go the right way, which they wanted them to go.The movie's got some great acting from Roger (Leonardo DiCaprio) and Ed (Russell Crowe), those two are honestly great throughout this movie.Also, the cinematography from Alexander Witt is average but he could capture the scenes a bit better than he already did.The action sequences throughout this movie are very graphic and gory but they're really well made and they're well put together.Finally, the other characters throughout this movie are very interesting but a lot of them are actually forgotten about.The movie's got some very mixed pacing for the build ups. The pacing is pretty good for some of the moments but it can be pretty bad for some of the other moments in this movie.Overall, Body Of Lies is a decent movie. The movie's got an interesting plot, great acting, average cinematography, very graphic action sequences and some very hit and miss pacing for the build ups."}, {"rating": "8", "text": "This movie gets so much undeserving hate, the only thing that’s wrong is that the part of Hani was cast extremely wrong"}], "recommendations": ["american_gangster", "inside_man", "man_on_fire", "a_most_wanted_man", "the_equalizer_2", "breach", "casino", "widows", "bone_tomahawk", "the_accountant", "a_most_violent_year", "hell_or_high_water", "broken_city", "public_enemies", "triple_9", "donnie_brasco", "changeling", "the_devil_all_the_time", "troy", "the_sum_of_all_fears", "the_departed", "lawless", "blackhat", "arbitrage", "the_equalizer"]}