{"id": 1258, "title": "Bohemian Rhapsody", "starring": ["Rami Malek", "Gwilym Lee"], "runtime": 135, "genre": ["Music", "Drama", "History"], "description": "Singer Freddie Mercury, guitarist Brian May, drummer Roger Taylor and bass guitarist John Deacon take the music world by storm when they form the rock 'n' roll band Queen in 1970. Hit songs become instant classics. When Mercury's increasingly wild lifestyle starts to spiral out of control, Queen soon faces its greatest challenge yet – finding a way to keep the band together amid the success and excess.", "releaseYear": "2018", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/lHu1wtNaczFPGFDTrjCSzeLPTKN.jpg", "categories": {"plot": 7.7272727272727275, "acting": 7.931034482758621, "ending": 8.333333333333334, "soundtrack": 7.428571428571429, "cinematography": 7.5, "familyFriendly": 6.0, "funny": 7.0, "action": 9.0}, "reviews": [{"rating": "10", "text": "It's about legends. Whether or not this is a fair and accurate account of Freddie Mercury's life, I'm honestly not bothered. All I know is that the film electrified it's audience by putting the thrill of the greatest Rock and Roll performance in history on the big screen. The elation stays with you after you leave the Cinema. Legendary!"}, {"rating": "7", "text": "This are plenty of moments of glamorous grandeur that you would hope to see from a film about the great Freddie Mercury. Those moments have the tendency to sweep you up and overwhelm you making you momentarily forget that the overall film lacks the depth or script to be great. Overall a low to solid 7 a B."}, {"rating": "7", "text": "\"Bohemian Rhapsody\" is much like Queen itself: soaring transcendent music at times and questionable thematic choices at others (\"Fat-Bottomed Girls,\" really?).  The shame is that there's so much material to work with and Director Bryan Singer (best known for the X-Men series) does so little with it.The most egregious oversight is any thoughtful exploration of Mercury himself.  Mercury had a long-term, apparently heart-felt, relationship with Mary Austin (who inspired “Love of My Life”) before embarking on a series of relationships with men.  While there is the broad suggestion that Mercury’s sexuality was considerably more complicated than a simple “coming out,” the topic remains unexplored.  In general, Mercury’s emotional life, much like his rampant alcohol/drug abuse, goes unremarked in the screenplay.  Director Singer seems to justify this choice by offering a scene where Mercury defends his privacy against a stereotypically prying press corps.  Like the scene itself, it’s all a little jumbled and out of focus.Even the Mercury vocals represent a curious choice.  In fairness, it would be nearly impossible for any actor to replicate Mercury’s unique vocal style.  However, when album tracks are not used, the creative team has used isolated master tracks of Mercury in the studio mashed up with tracks from Canadian Christian rock singer Marc Martel and, perhaps, others.  It is unclear what Rami Malek, who plays Mercury, contributes.  In one interview, Malek charitably describes the result as “an amalgamation of a few voices.”Worst of all, this screenplay reduces a potentially fascinating story to an exercise in paint-by-numbers.  The arc of the story is totally predictable: star rises from humble beginnings, achieves great success, becomes an arrogant jerk, has a flash of self-awareness and a moment of redemption just before the final credits roll.  In service of this trope, several facts are omitted or alternative facts created.  SPOILER ALERT:  The screenplay depicts Queen’s 1985 participation in Live Aid at Wembley Stadium as Mercury’s act of final redemption following his diagnosis.  Inconveniently, Mercury was not diagnosed as HIV+ until well after the event.Having said all that, when the music rolls, wow!  It is majestic, sweeping, moving, transcendent.  Queen offers a soundtrack of the 70’s and 80’s.  “We Are the Champions,” “Somebody to Love,” “We Will Rock You,” and so many more. The catalog is lengthy and this show does them full justice, even occasionally offering insight into the creative process behind anthems many of us have hummed for decades.  The director and performers take full advantage, making these musical numbers well worth the price of admission.Malek is riveting in the leading role.  He fully commits to this character, even to the point of wearing a dental prosthesis throughout the film.  Because of Malek’s skill, the general impression of his character as Mercury is, at times, eerie, particularly the scenes on stage.  Malek’s ability to convey emotional distance yet accessibility, so clearly on display in Mr. Robot, serves him admirably in this role.The CGI of some of the concert scenes, particularly Wembley Stadium, is extremely effective, giving the moviegoer an acute sense of the size and passion of Queen’s following around the world.  One would hope that these effects are put to good use – the closing credits for CGI personnel seemed to number in the hundreds.Bottom line:  If you want to watch the soundtrack of an iconic band, portrayed compellingly, this film delivers in full measure.  “Bohemian Rhapsody” is a whole lot more than a tribute band.  However, if you want a thoughtful examination of the human condition, Freddie Mercury’s or anyone else’s, you’re in for a lengthy disappointment (running time is 2:13)."}, {"rating": "7", "text": "The musical enable and experience in this film is great. I felt like I was at a Queen performance and it had me hooked. Unfortunately some of the forced humour and moments of the band's personal life was lost on me. It felt almost hollow. I expected a lite more drama or grit to their movie, and from what I hear they took some huge poetic licence liberties with it. Could have been a lot stronger, but as I said, the music holds it together and it's a movie about music, so worth a look if that's your jam."}, {"rating": "7", "text": "Was it good? mm..yeah. Was it good enough? No. Even though i think it could've been better - i don't think you should miss it if you haven't seen it yet. Freddie is a legend, and so are \"Queen\". There's a lot more to say about them than in this movie, but for a two hour film - they did a pretty good job. Rami deserved the oscar without any doubt."}, {"rating": "6", "text": "Its a good performance and is very stylish, but doesn't really have much substance"}, {"rating": "7", "text": "Though the performances, particularly that of Rami Malek, are impeccable, a bad screenplay and rapid shift in tones bring this film way down. It should have been much better."}, {"rating": "5", "text": "Bohemian Rhapsody is the bare minimum for a movie of this genre, instead of being a dramatic retelling of one of the greatest bands of all time, it instead plays it way too safe and instead becomes the cliffnotes version of some of Queen's greatest hits. Bohemian Rhapsody plays it like the classic rise to fame but with consequence story,and it's at time hilarious how they hollowoddize things in this movie. The only thing that helps the film is the performance of Rami Malek as Freddie Mercury, the performance is genuinely amazing, and the only Oscar this film truly deserves. He perfectly encompasses Mercury's presence on stage, but also his quiet and awkward demeanor off stage. The rest of the movie however is an overall mess, relying only on the love of Queen's music and Malek's performance, so if you like Queen's music and don't care for a proper retelling of their story than this is the movie for you. For me it was just kind of an average movie, with one stand out element."}, {"rating": "8", "text": "Wow! the critics got it so wrong! Maybe it's because I'm not a massive Queen fan, but this was one of my most enjoyable films of 2018. Admittedly, it's the Freddie Mercury story rather than the bands but there are excellent performances and all the hits are there to be enjoyed on the big screen. I doubt the film would have been as popular had Sacha Cohen taken the Freddie role? Some people are born for certain roles and Rami Malik is outstanding. I particularly loved watching the band take the stage at Live Aid, it really gave you the feeling of being there. One to be watched on the big screen for sure."}, {"rating": "6", "text": "This movie proves that so called \"fans\" don't care about historical accuracy."}, {"rating": "7", "text": "I will start by getting this out of the way--I'm not a big Queen fan. Please, please, read until the end. They always lacked a deeper, more intricate meaning in their music, insight, they are all about externalizing themselves; but if this is a problem when it comes to their music, it works magic in film.Director Bryan Singer gets this. 'Bohemain Rhapsody' is visible in lacking insight or bravery into Freddie Mercury's life. When he confesses to his lover, Mary (Lucy Byonton) the fact that he is bisexual, she is like--damn, sucks, bro. And he is like--yeah, i know, right. That's about it. But this is not a documentary. This is an artistic film. Like Mercury himself, Singer gives the people what they want--an extravagant, elegant, virtuoso exodus embodied by the march of Rami Malek's career-defining performance. Seriously, he was astounding as the legendary lead singer.If the late Freddie Mercury was alive, he would approve of this. Throughout this formulaic biopic, one thing managed to stand out, though, albeit it was not that obvious--Mercury's devotion to his fans. \"I'm a performer, darling!\" Even after discovering his incurable disease, his sole focus was on putting on a nice show. I admire this about him and I admire the film for at least trying to portrait this. And while I am not a huge Queen fan, damn it if Freddie Mercury is not the greatest performer ever.The first half had its moments of tediousness, mostly due to its straight-forward basic Wikipedia-style of standard biographic presentation. But the ending performance at the 1985 Live Aid was so explosive, cursive that when I looked at the time left and saw less than 20 minutes, realizing it was not a full recreation, I was a bit frustrated. Still, the glory was there and, I admit it, I like Queen a bit more now."}, {"rating": "8", "text": "Music biopics are arguably more entertaining than documentaries since they tell a (largely) true story about the subject matter while following a cinematic movie formula. However, this happens to be the biggest weakness for them, as history is often rewritten and edited for the sake of dramatic effect. Since this review is overall positive, I will begin with the negatives by addressing historical inaccuracies as one of the films biggest weakness. For Bohemian Rhapsody, the same issue occurred during the writing of the script, which made many of the dramatic elements seem overacted and unnecessary. Many moments of Freddie’s real life are implemented into the story to add tension and drama to the relationship among the band members when in actuality there was not nearly the same level of tension. While largely paying homage to the legend, many parts of the film make him look like the stereotypical **** diva superstar that was not the complete truth. Another aspect of weakness that I found with the film was the dramatic “cheese”, moments added to add drama to make the film more like a film. Even with the largely amazing performance from Rami Malek (more on him later), there were moments where his dramatic acting fell short and the scene came across as almost laughable. While I do have more to say on his performance and the performances of the other cast members, I do not believe that Malek deserves an Oscar nomination.With that said, the film also seemed to rush through the rise of Queen as a band and their ascent to fame. It takes a matter of twenty minutes or so for the band to go from starting off to signing with John Reid (Aiden Gillen, did good), which was a big deal since Reid was the manager for Sir Elton John. Bohemian Rhapsody wasn’t able to use this formula the best way nor did the movie suffer as a whole, but I certainly would’ve liked to see more scenes centering on the band’s rise. Overall, the film “needed” to add drama and fake history to add to the cinematic effect and fill in the runtime. While these aspects may have hurt Bohemian Rhapsody from being truly amazing, the music and performances were amazing.I must bestow praise to all those involved with camerawork, film editing, and set designers for their amazing artistic input that brought the movie to life. Every music biopic that I have seen has made me appreciate the music and the artist(s) more. I have felt a connection with these films that have made them worth investing time into over and over again. All previous biopics, however, pale in comparison to the magic of Queen that Bohemian Rhapsody brought to life with such realism. The settings, costumes, and perfect recreation of the band’s performances allowed this film to emerge from its weaknesses to become a truly enjoyable experience. It also set this film apart from other biopics by adding a unique style and flair that exemplifies what Queen as a band embraced back in the day. It’ll send chills through your spine and maybe inspire you to become the next great music artist, because God knows we need much help fixing music (except rap).The performances by the cast members themselves were amazing across the board, from the band members of Queen to the supporting characters of the story. The highlights were Rami Malek as Freddie Mercury (obviously), who prevails through some bad moments by nailing all the movements and mannerisms of Mr. Mercury. The live performance scenes in particular were perfectly executed, as the lip-syncing and Mercury theatrics would make you believe that Rami was Freddie himself. I was also impressed with Gwilym Lee’s excellent turn as guitarist Brian May, achieving the perfect recreation of May from accent to acting according to the scene’s tone and objective. One more performance I would like to highlight was Lucy Boynton as Mary Austin, who I believe brought the most emotional complexion among the cast, being able to properly add drama to an otherwise lighthearted film.As with all films, Bohemian Rhapsody is not without flaws; there are moments of overly-dramatic elements, and some of the actual history has been rewritten to add to this effect. These flaws should only be in a made-for-TV movie on Lifetime Network, but certainly not the film’s positive qualities. Bolstered by the set design, amazing cinematography, editing, and cast performances, the film is certainly an achievement for music biopics. It brings one of the greatest songwriters and vocalists to life, and gives audiences a movie centered on a band who made music for the people. Critics can say what they want, but ask the fans of rock and they’ll place Queen among the greatest acts of all time. The film brought them to life in astounding fashion, and has allowed to world to gain a greater appreciation for art that we may never encounter again."}, {"rating": "6", "text": "This movie is like every other story ark cliches combined but with a Queen paint over it. Off the immense catalog of Queen songs to feature in this film, the people behind it chose the most consumer-friendly, recognizable and predictable songs that every Queen fan that went to the theater too see the movie is tired to hear. 20th Century Fox is REALLY afraid to dive deep into the dense library of masterpieces that Queen produced over the years, even so that Innuendo is not mentioned in any way in this movie, which, alongside the title track, is one the most \"off the wall\" track queen has in their discography.The acting was pretty solid, although Rami Malek really looked comical as young Freddie for me. The band members were alright as charatcers, besides John Deacon, the bassist, whose appearance was really not that much important besides the 'Another One Bites the Dust' section.Bohemian Rhapsody is a really good movie if you want to become a Queen fan and dive deep into the band's history, but it's disappointing for a long time fan who wanted to see something new."}, {"rating": "6", "text": "ENG: If you put the love that you have for \"Queen\" aside, is just another generic rock band movie.PT-BR: Se colocarmos de lado o nosso amor por \"Queen\", o filme é apenas mais um filme genérico de bandas de Rock."}, {"rating": "5", "text": "It was not waste of a time to see this movie,it is a documentary or maybe biography movie,musical,and fast rhythm movie that don't let you become bored.But it is not a MOVIE,it is not CINEMA. The screenplay is so poor,it doesn't have a Story line,characters are poor,i can't feel them. It's just an actor mediated Documentary;A poor one.I don't know anything about Directing and i don't judge it.At all,it wasn't that type of movie that makes me drop deeply in the story to feel the characters and their lives, their world, and think about them.not good,not bad,but Ugly...#MRD_TG"}, {"rating": "6", "text": "This was a fine movie, a FINE movie. The performances are amazing, specially from the lead Rami Malek, but the rest of this movie is bland and forgettable. For most of the movie the direction and cinematography were just okay (however the live aid concert scene was really good) and this is just a very standard, formulaic and predictable biopic about Freddie Mercury and Queen.Not a bad movie but not a great movie or a masterpiece, it's a fine movie and I give it a 6/10. A 6 is a pass and a \"positive review\" for me, but the minimum for a green score is 7 but that's too high for me. When I saw it I never thought that this could be an Oscar-worthy movie.The fact that this won Best Drama Picture at the Globes over Blackkklansman, If Beale Street Could Talk and A Star Is Born, is just as laughably hilarious as when Crash won Best Picture at the Oscars over Brokeback Mountain. I'm shocked."}, {"rating": "7", "text": "Simplistic but highly enjoyable. The movie plays like a best off Queen’s greatest hits and achievements, which isn’t a bad thing. The music still has the power to sway any audience and Freddie’s commanding stage presence is excellently  recreated by an outstanding performance by Rami Malek. Freddie’s band mates are equally well portrayed, albeit a bit of the card board variety.  Brian May is the other stand out, every detail and nuance of his mannerisms has been captured, one could easily be fooled he was the real person. To me the biggest let down was the watered down story. It was competent but without any rough edges. Nothing that ruffles the feathers. It’s a tribute to Queen and a very entertaining one at that."}, {"rating": "7", "text": "Baffled by the negative critic reaction to the film. The film does tread lightly on the darker aspects of Freddy's life, but it's a celebration of Queen, not an expose.It's a highly enjoyable film with good performances, especially from Rami Malek and would recommend  it to any fan of Queen or great rock."}, {"rating": "10", "text": "I have no idea why the critics didn't enjoy this movie as much as the audience does. I loved every second of it!!! It was an emotional rollercoaster. The cast is perfect, and they paid a very respectful tribute to the band. Rami Malek did an exceptional job portraying Freddie. It's worth your time !!!"}, {"rating": "10", "text": "So glad I stopped reading the so-called \"critic reviews\" quite a while ago. They are almost always off nowadays, it's funny, the movies I enjoy have rotten reviews and vice versa. Anyways - great movie this one. Go watch it if you like Queen. If you don't know or don't like Queen, you probably won't connect with the movie and I wouldn't suggest it for you..."}, {"rating": "9", "text": "I rarely do reviews on movies as what makes a good movie for someone is is soooo subjective.I just saw this movie yesterday and was blown away. A solid 9 out of 10. If Rami Malek who played Freddie Mercury doesn't get an Oscar nod for his stellar effort there is no justice in the movie business these days. Lastly the critics are totally clueless on this one. Must be the same critics who trashed Led Zeppelin in the 70's. Must see movie...."}, {"rating": "10", "text": "A must-see film. I am not a queen fan...never been.Got to say that the acting, story and music gave me the chills. By the end I was smiling and almost crying.P.S.Still trying to understand which planet are those movie critics coming from."}, {"rating": "8", "text": "I was never a fan of Queen's music or Freddie Mercury, but this film fosters an appreciation of both. The story covers the band's career with the focus on Mercury. As the lead singer, Rami Malek beautifully creates a character who's headstrong, brilliant, charismatic and outrageous (for his day). The narrative follows a traditional arc, covering the band's creative output and success (with all the hits), as well as Mercury's personal struggles. Without ever being emotionally involving or especially original in approach or direction, it still manages to create an interesting biopic. NOTE: In an ironic (and somewhat disguised) role, Mike Myers gets to diss the title song, which was a reference to his performance of the song in \"Wayne's World.\""}, {"rating": "10", "text": "I don't understand the critics. This movie was great. It's not perfect that's true, but you will enjoy it. I cried several times during the film. It was a very emotional experience. Rami Malek was awesome, great work."}, {"rating": "10", "text": "This is a very respectufl film about a legendary group and character.DO NOT trust the critics, they were worng before with QUEEN, and they are wrong again.This is a fantastic film that every Queen fan will enjoy."}, {"rating": "9", "text": "Wanted to take this opportunity to express some of the backlash and negativity from those who dislike this film. Opinions will be opinions, and reading through some critics' reviews, I can certainly see their point sometimes,but the film literally ends with a song about having a good time. If the audience was entertained, so what if you didn't get the rated-R Queen story you wanted? So what if Freddie Mercury wasn't played by Sacha Baron Cohen? So what if the filmmakers made artistic changes? Will the audience even care? Isn't film supposed to entertain?Pushing all the film's production issues aside, it can't be understated how much of a feel-good movie this really is. From what I can see, repeat watches will be immensely entertaining.All the acting here is on point. As you've no doubt heard already Rami Malek gives the film his all as Freddie Mercury. He is the heart and soul of this movie and it wouldn't work without his electrifying performance. It's the little things that define his Mercury: the little facial tics, cracked smiles and so on. He's definitely a shoe-in for that Best Actor.I was also very impressed by Gwilym Lee as Brian May and Ben Hardy as Roger Taylor. The two of them are great foils to Malek's Mercury and both embody their real-life selves so well.As for filmmaking, I have one or two small gripes here and there. The editing was choppy at times, (during dialogue scenes) cutting away abruptly after someone has finished his/her lines; to my knowledge it happened twice or thrice. The camerawork is spectacular, lots of close-ups, puts you in the moment. The CGI isn't anything specialbut it gets the job done.Overall, I really loved Bohemian Rhapsody. The last 30 minutes really did encapsulate the audience in experiencing Queen and Freddie Mercury; and it's been some time since my friends and I left the cinema feeling this good."}, {"rating": "7", "text": "The movie got just so so reviews and to an extent, it deserved them. That stated, its an enjoyable film. Malek nails his performance and the music highlights the story. Its a little long but the Live Aid scenes are just great. Forget the critics. If you liked Queen , you'll enjoy the movie"}, {"rating": "8", "text": "so we have 4.9 critic score and 8.3 user score average: ladies and gentlemen - we have another \"critics don't get it\" scenario.Just like Freddie said in this movie - everyone's a critic now.This was great movie to watch, someone who is NOT A QUEEN FAN (but am now) I enjoyed this experience and happily provided my money to support the film which is shot amazingly and Rami of course - who played great! After movie - I am Queen fan now, and have been THE Queen fan since I came to UK (I have big respect for Her Majesty).Movie is 2 hours but feels exactly right. It never bores, but I wish some creative music-making scenes were longer. Overall, this is solid movie, since I have to provide score, I guess 8/10? But an Oscar nominee for sure, for performance"}, {"rating": "9", "text": "We really enjoyed it. The actors did a great job and the music was fantastic. It left us feeling quite emotional and also very inspired. My teen really enjoyed it as well. She said felt a little bummed though that she wasn't around to see them together in concert."}, {"rating": "8", "text": "\"Bohemian Rhapsody\" honours Queen with a rousing and persistently entertaining biopic. The musical scenes are electrifying and the performances are exemplary."}, {"rating": "8", "text": "Yes this film may have a few historical inaccuracies, but that doesn't really matter, the film was two hours of fun and I enjoyed ever minute as a huge Queen fan. Rami Malek was the perfect fit to play Freddie Mercury even getting his mannerisms down to a T, the Live Aid scene was done very well. This film is a must watch for any Queen fan, it will get you singing and crying throughout."}, {"rating": "9", "text": "\"Critic review\" WTF? 49?! \"Critics\" does not deserve your attention. The movie is AWESOME! Go watch it. (Sorry my bananas english. It's not my native language)"}, {"rating": "9", "text": "A very good movie, well done.  Rami should get an Oscar nom for this one.  Shed new light on the bands history and it was great to reminisce my childhood memories of the music.  New respect for Freddy Mercury, he was a great performer and musician.  I'd give a 10, but the teeth for Freddy's character were overdone, to the point of being comical.  Should fire the prop guy because he just didn't get his teeth right.  They look like they should have been backed off by 4mm."}, {"rating": "10", "text": "Wow !! What a beautiful, mesmerizing and moving Music Flick. The Live Aid Concert will paint a big Smile on your face, but also leave you quite impressed and with tears in your eyes. The acting ist really great and the chemistry between the actors seems real and fluid. Music might be the Best of the Last Century and its transformed perfectly for the Big Screen. In Quality (especially IMAX), Choice of Tracks, Loudness and perfect acting in Concert Scenes.No one wants to see a Wikipedia Movie or a chronological correct Biography reconstruction with Actors (there are enough Lifetime Documentaries about Queen).You can't squeeze over 40 Years of Queen (or over 20 with Freddie) into a 2 Hour Music Movie. It's just about the biggest and finest Rock Music Tracks in the Last Century and capsuled in nice, entertaining Stories how the Songs were Written, Created or Recorded. The Acting of the Band and it's chemistry is just phenomenal.The Music is at it's Best. What do you want more ? Go an see it"}, {"rating": "8", "text": "My third concert experience in two weeks. So I'm satisfied. Rami Malek perform is outstanding. They should have put more efforts in the physical appearance of Malek who didn't look much like Freddy. I loved the Bohemian Rhapsody, basically of the music and Rami in it. What I expected to see was more of the true Freddy - how he got into music, why he was passionate about it, reveal of his family and so on. As Biography the film fails, but as Music experience and Drama Bohemian Rhapsody nailed it."}, {"rating": "10", "text": "This movie saved my year. The music is terrific and made me want to watch it again."}, {"rating": "10", "text": "IM not a super fan of queen but this movie is one of the best I’ve ever seen. Emotional, funny and an amazing story of pure talent. The direction and production of this movie was so spot on and Malek’s performances amazing"}, {"rating": "0", "text": "Among the worst movies I've had the misfortune to see in a theater in about a decade. It's a joke. And offensive on several levels. I'm not even a Queen fan and I cringed for Freddie Mercury, reduced here to a caricature."}, {"rating": "10", "text": "Once again critics are wrong and the public understands what rock & roll was and is. Freddy would have been proud."}, {"rating": "9", "text": "I thought it was very entertaining and way better than the critic reviews indicate.  If you like the music of Queen, you will enjoy this film, because it is filled with music.  And because it is so greatly oriented to the music, pick a theater with excellent sound.  I have no idea whether it is an accurate portrayal of Freddie Mercury's life, but it is not just about Freddie Mercury.  It's about the band too and their amazing success and the legacy of their music."}, {"rating": "9", "text": "Gran pelicula biografica, faltaron un par de cosas, pero es casi perfecta. Esta peli no es para todos los publicos, eso que quede claro"}, {"rating": "10", "text": "this movie is amazing, so emotional and so well acted i would watch it over and over again! Freddie Mercury is such a legend!!"}, {"rating": "10", "text": "Loved it. Showed the rise of Queen and how Freddie Mercury became a rock legend. Some complain that it didn't delve into Mercury's sexuality enough, but that's ok. The film was a positive one and its ok to leave feeling inspired and hopeful, realizing its ok to have heroes and legends. Particularly touching was how the film depicted Mercury's relationship with his Parsi Indian parents. I guess it will come as a shock for many to know that Mercury was of Indian ethnicity."}, {"rating": "10", "text": "Wow. What an interesting film. I have never been a huge fan of Queen's music, nor do I know how the real story of this band actually played out in the real world... So I have nothing to compare my analysis of this film on besides the film itself.This film was absolutely brilliant in so many ways, yet I didn't realize I liked it so much until the last 30 minutes. I had no idea what direction the plot was going, which kept me watching, hoping it didn't head south. To my enjoyment it didn't go south at all; Instead it became one of my favorite films of the year. My point in saying this is: Don't knock the movie until you watch it in its entirety and really look back at the movie as a whole.The acting and character development was outstanding. The music was, to my surprise, heartwarming, fun, and meaningful to listen to in conjunction with what was presented on the screen. Touching back on one of my original points, and why this movie was so damn good: The story was riveting and easy to follow but it didn't give away the end result (unless you knew already). For someone like myself who didn't know the story of the band, the story progression was subtle and kept me glued to the screen waiting to see what was going to happen next.Overall it was just an amazing movie with awesome music, great acting, small bursts of comedy, meaningful but not overbearing important messages, drama, conflict, and some tear-jerking moments. The film had it all and it is definitely worth watching, regardless of whether you know the story of the band from beginning to end. (A side note, my girlfriend saw the film with me and enjoyed it even more than I did and she loves Queen and knew how the plot was going to turn out)"}, {"rating": "5", "text": "For a biopic on a band that went against the musical formula, the film Bohemian Rhapsody is depressingly formulaic. This movie feels more like a cash-grab for the surviving members of Queen than an honest look at the band or Freddie Mercury. In that vein, Freddie Mercury's portrayal is ultimately the downfall of the film.On one hand, Raimi Malek does a great job portraying the legendary frontman. On the other hand, Bryan Singer's direction is lazy, the script is bad and the movie drags along, spending way too much time on Mary Austin for one thing, but the biggest problem with the script is this: It feels like Queen is trying to take credit for Freddie Mercury being as good as he is, and that is just not the case in real life. Also, there is not nearly enough music in this film. I left the theater feeling unfulfilled.The movie Bohemian Rhapsody feels a lot like a serious Walk Hard: The Dewey Cox Story. This is not a compliment. Bohemian Rhapsody is contrived, way too safe (the PG-13 rating is indicative of this) and way too boring. This should have been a straight-to-Netflix movie, and it really does feel like that. This is easily one of the most disappointing movies of the year. I would have given this a 4 if it were not for Raimi Malek's performance, which places this movie at a low 5."}, {"rating": "10", "text": "This movie is just phenomenal through and through. I swear to God, Rami Malek sounds just like Freddy Mercury. A bunch of critics have these unrealistic or straight up bizarre expectations for the film, like, says Consequence of Sound, \"[It's] like watching 40 years of musical biopic tropes in brief, shortened and scrubbed and marketed within a bank-friendly PG-13 presentation.\" You heard them. They're complaining that it's not rated R (read the full review to see what I'm talking about). Now, I respect the opinions of others, but they're just straight up acting like edgy teenagers who play Fortnite. Anyways, this is a great film that is definitely worth 2 hours in your day."}, {"rating": "10", "text": "absolute masterpieceBohemian Rhapsody is a clear example of a biographic movie done right.spoilerfreddie goes from his early 20s all right to live aid concert"}, {"rating": "9", "text": "I have been a fan since the early 70s, and I loved this movie. Being a movie there are liberties taken with when events occurred and some things were dramatized for the movies sake. But the overall feel and story were fantastic. would have gave it a 10 but dropped it to a 9 for the timeline being mutable."}, {"rating": "8", "text": "This movie is a great celebration of the music of Queen,and Freddie Mercury.  True, the facts and timeline of his life are not 100% accurate. I assume they took liberties for dramatic enhancement.  If you love the music of Queen, you will find this a fun way to experience their hits while getting an overview of the bands formation and ride to stardom. Rami Melek puts in a great performance.  This movie is worth seeing in the theater just for the recreation of the Live Aide performance on a big screen. Totally worth it!"}, {"rating": "4", "text": "This film is a good example of where the \"Hollywood\" sensibility of sacrificing truth for narrative didn't work out in the favor of the filmmakers.  Admittedly, I was no Queen expert going into this movie.  I went into the theater as a huge fan of the music while lacking a broader knowledge of the band's history.  Having said that, I couldn't shake the feeling that almost all the thematic and narrative choices in this movie were just that, intentional choices made by the filmmakers to tell a mostly fictional story.  Doing a quick Youtube search after viewing proved my instincts correct.  The worst part about their trade of truth for story?  The story just wasn't all that good.  While never really giving a chance for anything to be fully fleshed out, the filmmakers attempted to show Mercury as a superhuman talent, a larger than life personality, and a flawed but tragic individual all while ham fisting wonderful songs into oddly fitting \"origin stories\" because it fit some executive's formula for a biopic.  The two saving graces of this picture are the casting and the music.  Although, Malek is shamefully underutilized as Freddie Mercury, he does get several chances to shine through and rise above this mirky money grab to show you what could have been.  Speaking to the second saving grace... if the best thing about a movie is the catalog of music that inspired anyone to care about the topic matter in the first place, wouldn't you rather just listen to the music?  Yeah, me too."}], "recommendations": ["the_sound_of_music", "begin_again", "yesterday", "rocketman", "annette", "the_greatest_showman", "whiplash", "almost_famous", "amadeus", "the_shawshank_redemption", "in_the_heights", "the_great_gatsby", "sweeney_todd_the_demon_barber_of_fleet_street", "jingle_jangle_a_christmas_journey", "a_star_is_born", "youth", "casablanca", "cats", "chicago", "walk_the_line", "we_are_your_friends", "hairspray", "la_la_land", "moulin_rouge", "eddie_the_eagle"]}