{
  "id": 1123,
  "title": "Bolt",
  "starring": [
    "John Travolta",
    "Susie Essman"
  ],
  "runtime": 98,
  "genre": [
    "Animation",
    "Family",
    "Adventure",
    "Comedy"
  ],
  "description": "Bolt is the star of the biggest show in Hollywood. The only problem is, he thinks it's real. After he's accidentally shipped to New York City and separated from Penny, his beloved co-star and owner, Bolt must harness all his \"super powers\" to find a way home.",
  "releaseYear": "2008",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/z9VHoUcZ1GiH3f3qYz7Me7Zc1Fd.jpg",
  "categories": {
    "plot": 7.742857142857143,
    "acting": 7.571428571428571,
    "ending": 6.25,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 7.538461538461538,
    "funny": 6.153846153846154,
    "action": 9.5
  },
  "reviews": [
    {
      "rating": "10",
      "text": "I love this movie. Especially Rhino who steals the show. It isn't anything extraordinarily new or anything but I still love it."
    },
    {
      "rating": "6",
      "text": "Oh, the days when Miley Cyrus had yet to twerk on Robin Thicke. Remember those days? Well, they produced this movie, Bolt, which isn't half bad. It's not the most original movie, and Miley is annoying in her character, but it's good for the kids."
    },
    {
      "rating": "8",
      "text": "this movie is one of the best movies from 2008 along with Wall-e, madagascar 2, iron man, kung fu panda and the incredible hulk!"
    },
    {
      "rating": "9",
      "text": "A dog & cat animation movie that has the power equal to \"Toy Story\" and \"WALL-E\". Certainly one of Disney motion picture's greatest achievement they made without the help of Pixar. Bravo!!!"
    },
    {
      "rating": "10",
      "text": "Though sadly overshadowed by the overrated dynamic duo of Wall-e and Kung Fu Panda, this warm, familiar animated movie with stunning visuals and beautiful, hand-painted backgrounds doesn't only mark a successful return for Disney on the animated area, but manages to introduce characters and themes that are in many ways more deep and complex than that of the widely glorified Pixar flicks. Take Bolt for example, the loveable and stunningly adorable main character who, in less than 90 minutes, shows a wide spectrum of emotions and behavior, ranging from self-realization, denial and identity crisis. Aside from this amazing character development, he also embodies the loyal and trusting nature of a dog. The only problem with this movie is that this main character, with a story with so much potential for depth, was pushed to the background to make room for the annoying comic relief hamster and the funny-talking pigeons, making a movie that could have been absolutely splendid merely a great one. Still though, the scenes in which the furry main character, Bolt himself, is allowed to shine are the by far most touching. Particularly the puppy scene in the beginning and his unselfish bravery in the end, thus making this movie a most see for any self-acclaimed dog lover and anyone who wants to see a good animated film. And the way this character shows a contrast by his aggressive, delusional super-hero persona, and his sweet-natured, natural and loveable doggy-side, which is mostly seen when he is together with his owner Penny - the little girl to whom he directs all his considerable love and devotion - should make him an inspiring figure for children and adults alike."
    },
    {
      "rating": "7",
      "text": "Bolt has used a storyline that has been used countless times which is a huge critical factor. Critics favor originality but sadly this isn't, but thanks to its touching moments, fantastic animation and great voice performances it is good enough for me. I give this movie 71%."
    },
    {
      "rating": "0",
      "text": "Why does everyone like these stupid, predictable \"Disnep\" movies?"
    },
    {
      "rating": "2",
      "text": "Ok if you a kid. But if you have an adult brain you'll notice the things that are unbelievable but passed off as legitimate. The Concept worked in Toy Story but not at all in the one. WALL-E was so much better, or The Incredibles, or Toy Story This is why i get all my movies online, i got sick of paying to be patronised and treated like a moron."
    },
    {
      "rating": "6",
      "text": "Eh, it was very good, but still, not perfect. I think the dog was terrible. But the cat and hamster, were awesome!"
    },
    {
      "rating": "9",
      "text": "Bolt is a well made animated film, which was unfortunately destined to play behind the hype of Wall-E and Kung Fu Panda. It's funny for all, with a fat hamster named Rhino who is obsessed with Bolt stealing the show alongside 3 sets of three pigeons who appear throughout the show. Some of the story is very predictable, particularly the relationship between Bolt and Mittens, but it's still very enjoyable and funny."
    },
    {
      "rating": "5",
      "text": "The animation is great, the characters are cute, but the story is predictable. While some people think it rips-off Toy Story, Bolt reminds me more of Homeward Bound than anything else - another \"Doggy Come Home\" story. The movie does have its strong points, though. As I said, the animation is awesome (it is Disney, after all). Rhino and Mittens were the most interesting characters in my opinion, but Bolt was pretty charming himself. Bolt had some emotional moments too, particularly near the end of the film. But even with the movie's strengths, I didn't think it was very memorable. It wasn't a steaming pile of crap like The Wild, but it was just okay.On a lighter note, if you have kids, I'm sure they'll love it. But if you're a teenager or adult who's not into that Miley Cyrus/Disney Channel junk, don't waste your time with Bolt, watch WALL-E instead."
    },
    {
      "rating": "0",
      "text": "Just fantastic, it's well done, super funny moments that made me laugh out loud . It totally made me happy to watch it, everyone in the family loved it.  So well written, a feel good movie with a great message for all ages."
    },
    {
      "rating": "6",
      "text": "Impecable a nivel técnico, pero en general no me gustó nada, no tiene gracia ni carisma en ningún sentido."
    },
    {
      "rating": "9",
      "text": "A very well made movie, fun, touching and well paced. The only down side is that it gets slightly predictable at times but that doesn't ever make it any less fun to watch, Bolt and all the animals he meets are entertaining and interesting as ever ... throughout the whole movie. A must watch for any fan of well made light-hearted animated features."
    },
    {
      "rating": "6",
      "text": "Always the same Disney formula. But the movie deserves an Awards for cutest character (Bolt) in history of animated films."
    },
    {
      "rating": "10",
      "text": "This my favorite movie out of the disney movies i`ve seen. Rhino is so funny. My favorite character is Mittens. I disagree with what dave said about Wall-e being much better then Bolt. He is wrong Bolt is much better then Wall-e & Cars."
    },
    {
      "rating": "8",
      "text": "I think Chad S. is overthinking it a bit. It's a great movie with genuine laughs and a very touching story. There are two messages this movie presents: The ones you love can never be replaced, and two, love is not always true. A fantastic movie everyone should enjoy."
    },
    {
      "rating": "7",
      "text": "Another great movie from the folks at Disney/Pixar. It had a super new \"Cars toon\" at the beginning and the whole experience was super family entertainment. I agree with some that it drug in spots, but over all it was an excellent movie for the entire movie. Bolt was good, Mittens was so-so, and Rhino made the flick. A little more Bolt and his sidekick Rhino and this was a winner. This one'll go in the video catalog. Captain Spaulding"
    },
    {
      "rating": "9",
      "text": "Such a good heart in this movie."
    },
    {
      "rating": "7",
      "text": "Why all the deception? Why not use an animal trainer? In this world, televsion producers don't believe in dogs doing method. So they pull a \"Truman Show\" on him. For the show to work, Bolt(John Travolta) is tricked repeatedly into thinking that Penny(Miley Cyrus) needs saving. The dog never leaves the studio. Since Bolt looks older than his previous incarnation as a puppy in the opening scene, there's the suggestion that Penny and Bolt bonded at the studio facilities before the show went into production. But what did Penny teach him? Apparently, very little; a cat teaches Bolt how to be a dog. Before he meets Mitttens(Susie Essman), the \"superpowers\" Bolt possesses can be characterized as the abilities of an idiot savant, because this is one maladjusted dog. Shooting laser beams out of his eyes comes more naturally to him than sniffing another dog's butt. During his puppy stage, Penny seems to have played a big part in making an emotional cripple out of Bolt. Before her feelings for him blossomed into something genuine, their relationship was based on a premise of fakery. At some point, Penny permitted herself to love the dog. The photographs she hangs up in their dressing room is a timeline, and somewhere on that timeline, Bolt stopped being more than her co-star. The photographs are a smart allusion to the \"relationship\" between Jim Carrey and Laura Linney, in which photographic evidence is collected as proof of a bonafide relationship. The cracks in Penny's conscience begin to show, well before Bolt disappears, but full-blown remorse towards her complicitness over subordinating the dog's welfare for the good of the show and her burgeoning career, surfaces when she has to act with a replacement. Mittens is half-right when she points to Penny's image on a billboard, as the cat makes her case for the duplicity of human beings. Penny comes around, but not before she commits animal cruelty."
    },
    {
      "rating": "10",
      "text": "I love Bolt the movie. I like it a lot because its funny. Alex, age 5."
    },
    {
      "rating": "10",
      "text": "Going into this movie I felt that it may be just another attempt to try and claim some of the reknown that is pixar films. There have been many talking animal movies over the past couple of years and only a slight few have been worth seeing. Bolt totally blew me away by how well done it was, how entertaining and actually quite comical. I have now seen this movie twice and recommend it to any and everyone."
    },
    {
      "rating": "8",
      "text": "Saw it in 3D, very cool, the hamster was a crack up!"
    },
    {
      "rating": "8",
      "text": "I'll keep it simple. Good Disney movie for all ages. Well animated film and a nice likable cast of characters."
    },
    {
      "rating": "7",
      "text": "Good animated feature, but I was a little disappointed. It was surprisingly predictable. The animation was for the mostly part terrific, but at times it was below par for Disney, particularly with some of the background images. Fine voice overs."
    },
    {
      "rating": "9",
      "text": "Thought it was a really good movie. It has a good story and lots of laughs. Great for the whole family!"
    },
    {
      "rating": "9",
      "text": "Excellent film. My son loved it (9) and so did I (39). I am not a sentimentalist but I totally fell in love with this dog. The hamster was terrifically funny of course. And the Hollywood guy ... absolutely spot on perfect as an awful, awful human being of the type that apparently proliferates in Hollywood. I found him both funnier and more horrifying than anything in Entourage or The Player. Middle sections of the film dragged just a little bit, otherwise this would be a perfect 10."
    },
    {
      "rating": "9",
      "text": "Some of the plot may feel familiar but it's still one of the best family movies made by Disney in a long time. This movie features an entertaining story, likable characters, and some good laughs. A must see for any age."
    },
    {
      "rating": "8",
      "text": "it was similar to oliver and company with out being a blunt copy , when i walked in i thought it was gonna be borring and a well copy of Oliver and company , a movie which i love as a kid,still like it today but it was funny,and cute with out using horrible poop jokes,or being just too cute and mushy the jokes were clever miley cirus was good for the roll and john Travolta was a good dog i could see this being made into a video game unless it already is , it could be good for a short game but that beyond the point , if you are 4-18 your going to enjoy this, if your an adult it just depends on you but HEY im 17 almost 18 and i liked it q lot 8/10"
    },
    {
      "rating": "9",
      "text": "Well done movie, kind of sluggish in spots, but has a great message for tweens, may be too intense for little people.... Travolta was great as the Bolt's voice and Mylie was great as well as Penny.... Some of the funniest dialog I have heard from animals in a flick."
    },
    {
      "rating": "8",
      "text": "I'm 23 years old, but I suppose I expect a lot from Disney. But I should be able to; I think the real test of a Disney movie is not whether it can entertain children but whether it can entertain the whole family. If I feel stupid while watching a Disney movie, that move fails as a Disney movie, as while directed at children, they're supposed to be family films. This move succeeds. Its very well done, and Bolt and Mittens (John Travolta and some actress?) do a great job, as does the actress who voice acts the girl, Penny. Rhino the Hampster was not the best cast member; I suppose they needed comedic relief, but he was fairly extraneous to the plot beyond letting Mittens understand what was going on and why Bolt was acting so crazy. Overall, the movie was quite enjoyable, and is the best Disney film since Mulan. While not of their early 90s level, its still quite a solid movie, and I shall get it on DVD as I enjoyed watching it. Some scenes of it even made me feel sad, which means the folks at Disney did their job well. If you're going to the theatres this winter, this is a much better choice than movies like Quantum of Solace or Twilight."
    },
    {
      "rating": "7",
      "text": "What a nice movie this is. All those involved in planning and making it do themselves proud. It's funny, sad, clever, and surprisingly moving. I liked it as much as \"The Truman Show.\""
    },
    {
      "rating": "10",
      "text": "Another Disney great for all ages, went with my 2 youngest at cinema to see this...Really great film with great storyline and loveable characters. Voiceovers are brilliant and the Hamster is still being talked about now!..For harmless, entertaining fun Watch it!"
    },
    {
      "rating": "9",
      "text": "While the basic premise is familiar, the characters are what make the movie. Each one is comical in their own way and the writers did a great job of balancing the lines so that you end up caring for each of them. An epic for the ages, No but a movie that is worth every penny to see in the theater... and undoubtedly buy on DVD afterwards."
    },
    {
      "rating": "9",
      "text": "I am a 23 yr old high school teacher. I loved Bolt. It was endearing, touching, motivating, encouraging, and overall really fun to watch. It would get a 10/10 if it weren't for the slight unbelievability with the Truman-show-like situation.... HOWEVER... the relationships between the characters and the wonderful voice acting (don't believe the cynical reviews!!!!!!!!!!!!!!!) were very believable. A feel-good movie and super for a date night or even just treating yourself to a relaxing evening! I loved it!"
    },
    {
      "rating": "10",
      "text": "Truly, truly a heart-touching movie. It is truly phenomenal, with a great, original story of the love between a girl and her dog and the friendship of three animals. The script is great, the voice actors are great, and the hamster is one of the funniest characters I've ever seen. There are plenty of laughs all throughout and even some moments that can bring you to tears. This movie is a masterpiece."
    },
    {
      "rating": "7",
      "text": "While it's not perfect by any means, Bolt is the film that shows Disney finally returning to form after nearly a decade of sub-par films. The easiest way to look at Bolt is like an animated version of The Truman Show that becomes a road movie about halfway through. It works as a film on both accounts, having some clever things to say about network television and providing you with some nice juicy morals, and giving you some pretty animated scenery to oggle at on the way. The voice cast are all good - playing the title role,Travolta gives his best performance since The Thin Red Line, and Susie Essman's streetwise feline mittens and especially Mark Walton's psychotic hamster super-fan Rhino are constantly entertaining. It's also a stroke of genius casting Miley Cyrus as child star and Bolt's owner Penny. The animation is stunning across the board, but what particularly impresses is that the animators have struck the perfect balance between realistically recreating animal movement and mannerisms, and anthropomorphising the characters for empathy purposes. Bolt is a perfectly enjoyable, often clever and funny animation that only just lacks the creativity, universal appeal and heart of Pixar's best efforts. Pixar, for now at least, still holds the torch of exceptional animation high, but Disney is closing in fast - thank goodness, it's been a while."
    },
    {
      "rating": "7",
      "text": "This is a well done kids movie. John Travolta is very well cast as Bolt the wonder dog. Complete with a hilarious hamster named rhino this movie is very entertaining. The only week points are in the beginning Bolt is shipped in a box from LA to New York with no real issues. Who would have thought you could mail a dog in a box of packing peanuts. The other problem is Miley Cyrus. She is very poorly cast in the part of Penny, Bolt's owner. Her voice does not match the age of the character and she is not a very good voice actress. Outside of these two issues the movie is absolutely great with a good story and good execution. A great movie for adults and kids."
    },
    {
      "rating": "4",
      "text": "Bolt has some great moments and characters but its so incredibly uneven. The premise is something only Disney can get away with and to an extent they don't. The story follows Bolt, a dog who works on a television show with his owner and thinks he has superpowers because the producers maintain the illusion. When he is accidentally shipped to New York, he has to find his way home as he deals with the fact his powers are gone. It's a stupid premise and it never really works. It has some cute moments and the character of Rhino is a great one but it never gets off the ground thanks to the premise. When Bolt reaches New York the film treads water for 20 minutes and it becomes a poor version of Homeward Bound for the latter. John Travolta has fun as Bolt but Miley Cyrus is irritating as Bolt's owner Penny. The ending is the best part of the film but it still seems incredibly forced and insincere. It's just a film that suffers from a poor premise and never really recovers."
    },
    {
      "rating": "6",
      "text": "I really would have liked it more if Bolt really had the powers, but it has quite a bit of heart and the characters are great. You know what really made this funny? Rhino the hampster!"
    },
    {
      "rating": "7",
      "text": "My kids liked this movie in almost every way. The interaction of characters and the good/bad change of roles. Clearly the hamster becomes all the kids favorites, as it was mine. But personally, this was predictable and graphically not the best-but believable. The happy ending is obvious but nice for the kids to see."
    },
    {
      "rating": "8",
      "text": "At first, the film seems to take on the undeniably cliché aspect of a super being that rescues a damsel in distress, however, it was a relief to see it develop away from that overused plot and add its own spice, albeit some common spice.\r There is an abundance of classic family humour, perfectly suiting to this family film, and it draws close attention to the migration from childhood to adulthood; a period which all of us have gone/will go through. Not only that, but the subtle adage of ‘you can’t hold onto things forever’ adds a nice touch of emotion to the plot, although a small touch.\r I felt the film dealt strongly with relationships; how characters develop between one another as they take that migration, and while a substantial amount of films will have a disagreement between two of these characters, Bolt was no exception  this being the only point I felt was lacking: the disagreement that appeared within the film was too basic, and my personal score would have risen a few more points if they had taken that disagreement outside of the box.\r But overall, Disney still does not disappoint in delivering a warm family film which is very reinvigorating to watch every once in a while."
    },
    {
      "rating": "10",
      "text": "No doubt,this is a great animated movie for all ages,they are all so great,good lessons are there too.And they sound really great though.BTW I love it"
    },
    {
      "rating": "7",
      "text": "Bolt não chega a ser o melhor filme da Disney porém tem carisma de sobra pra ser divertido para toda as idades."
    },
    {
      "rating": "8",
      "text": "While it isn't as good as most Pixar movies, it isn't bad either. I found the story great, the characters charming, visuals where sometimes a bit over the top but still good, voice acting also pretty decent . What I love is that this movie is basically a lost dog trying to get home story.  The bond between Bolt and Penny is really strong and delivered by some powerful performances by Travolta & Miley (yeah, I know, who knew?!) I have to say this is the first cartoon that has made me cry since I was a kid. If you've seen the movie, then I'm sure you know which scene I'm talking about. Overall: A really fun, emotional kids movie that isn't the best one out there, but it does a pretty decent job trying."
    },
    {
      "rating": "7",
      "text": "I watched this animation when it came out (i can't believe it) 8 years ago! The truth is that it is very original and charming! I recommend it to every age!"
    },
    {
      "rating": "7",
      "text": "\"Bolt\" can feel warm and funny at the same time, but can it really to anything truly special  well, not really. The film thrives on the relationship with a human and a dog for the first part, and then they go on a huge adventure across the U.S.A.. While the film is sadly, conventional, the quirky fun of its characters make this film alright."
    },
    {
      "rating": "5",
      "text": "I can sit through this movie with a limited amount of disturbances, but overall, it's complete with a sugary family tenderness that becomes repetitive like the movement of the earth. By the end, it's as interesting as looking outside of a car on a highway to downtown (which I've seen thousands among thousands of times)."
    },
    {
      "rating": "6",
      "text": "Bolt is a fun animated treat.\rUnexpectedly, Bolt is more than just a plain kids movie. The script is far above par and the message is incredible for Disney standards. A dog and cat film that will raise your spirits."
    },
    {
      "rating": "5",
      "text": "The animated film is a charming story between an actress named Penny (Miley Cyrus) and the star Bolt (John Travolta), it's cute and charming but Cyrus's acting is cliche'd and cheap also why Travolta in this film?\rGrade C+"
    }
  ]
}