{"id": 3327, "title": "Bombshell", "starring": ["Charlize Theron", "Nicole Kidman"], "runtime": 109, "genre": ["Drama"], "description": "Bombshell is a revealing look inside the most powerful and controversial media empire of all time; and the explosive story of the women who brought down the infamous man who created it.", "releaseYear": "2019", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/gbPfvwBqbiHpQkYZQvVwB6MVauV.jpg", "categories": {"plot": 7.121951219512195, "acting": 7.078431372549019, "ending": 7.0, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 3.0, "funny": 6.222222222222222, "action": 7.0}, "reviews": [{"rating": "5", "text": "Meh, I’ve Seen WorseThough it has good intentions, Bombshell falls short unfortunately."}, {"rating": "7", "text": "This film details the behind-the-scenes drama that occurred at Fox News with CEO Roger Ailes and his sexual misconduct/harassment towards the many women who worked there, and their stand against him to ultimately expose him and his behavior during the Trump election period. With A-list actresses such as Charlize Theron (who portrays Fox News anchor Megyn Kelly), Nicole Kidman, and Margot Robbie headlining the cast, along with a very timely and important story that needs to be told and heard today more than ever, I was definitely eager to check this one out. And while it's all told in a pretty straightforward manner, it's nonetheless very compelling, and the performances from all involved are terrific! Overall, while it's a formulaic biopic in some ways, and with some important details about the true story that I noticed were left out, the film's clever editing, standout performances from everybody, particularly the three leads, and the all-around importance and urgency of the story make it a very worthwhile watch."}, {"rating": "7", "text": "Exponentially more troubling than it is as breezy or as cheeky as its promotional material may lead you to believe it is, \"Bombshell\" is a good, but not great film that suffers from the tragedy of existentiality, albeit slightly. Being a movie that's based on such a well-publicized and recent event automatically amps up the chances of the narrative losing weight, lulling the audience into a trance-like state of, \"oh, yeah I remember this\" and \"yep, here comes this part.\" And, though it may not be saying or revealing a whole of new information to the audience, it helps that the events are so unflinchingly depicted, creating this inescapably horrific, cloud of uncomfortability for the audience to soak up in the theater. Some of the scenes border on just downright hard to watch -- in the right and most necessary way. The acting checks out, featuring a trio of committed performances, bolstered by convincing efforts from the hair and makeup department. Again, nothing's fatally amiss, but I just can't help thinking that my prior knowledge of the subject matter hampered my overall experience."}, {"rating": "7", "text": "Very important topic, and the film was made very carefully with attention to detail. A problem for recipients who are not familiar with the political situation of the United States."}, {"rating": "8", "text": "Reviews of this explosive expose of the sexual harassment by Roger Ailes of Fox News have run the gamut from highly praiseworthy for taking on such a sensitive subject to utterly disappointing that it doesn't \"do more\" in exploring the roots of its underlying issue. This is a conundrum I find hard to fathom. For the most part, I found this a worthwhile offering, serving up a probing look at a troubling story that effectively mixes cynicism, satire and serious drama in examining a serious workplace matter that often isn't taken seriously enough. The film's superb ensemble cast features excellent performances across the board from Charlize Theron, Nicole Kidman, Margot Robbie, John Lithgow, Allison Janney and Malcolm McDowell, and its inventive storytelling approaches keep the picture fresh and engaging. Frankly, I don't understand what disappointed viewers expected out of this release, but I find their criticisms misplaced, suggesting that \"Bombshell\" should have somehow handled this material in a way that it wasn't intended to be handled in the first place, an unfair disparagement if you ask me -- and one this film doesn't deserve."}, {"rating": "6", "text": "It wasn't a bombshell, it was more like a scratch.Don't get the wrong idea, it wasn't bad but at all times it felt like a measured and tamed story."}, {"rating": "10", "text": "Simplesmente amei o longa. Charlize está em seu melhor momento, Nicole da ritmo ao filme e Margot traz emoção e principalmente empatia com todas as mulheres ao redor do mundo que já passou por assedio ou abuso sexual  ."}, {"rating": "4", "text": "This thing wants to be The Big Short and Vice so bad. Not only does it share the same writer and cinematographer, but it features Elvis-impersonator level appearances of real-world figures and fourth-wall breaking narration. But none of it works, and you never feel the scale or weight of what these women are doing."}, {"rating": "7", "text": "Director Jay Roach weaves together an intriguing and sometimes hard to stomach story that is punctuated by some truly stunning performances by some of the best actresses working in Hollywood today."}, {"rating": "10", "text": "Regardless of your political leanings, I’d suggest seeing this film, especially if you are a film buff. The performances are a marvel from a very, very strong cast, both male and female, in lead and even the smallest supporting roles. The film itself is well-written and moves along without belaboring the sexual politics. My only problem was occasionally confusing all the platinum blonds, at least initially, especially because prosthetics were used to hide some unmistakable actresses. Roger Ailes is unmistakable, and Lithgow does an excellent job, even buried as he is in makeup and prosthetics."}, {"rating": "10", "text": "Great performances and characterizations. Charlize, Nicole and Margot - who had heartbreaking scenes - are the rhythm and soul of the movie. It entered my TOP10 of best films of 2016. And also Bombshell has the best movie title of the year."}, {"rating": "9", "text": "Bombshell is about how the revelation that Fox News CEO Roger Ailes and other members of the network came out as sexual harassers due to female employees who finally spoke out.This was a really well directed work. Given that this is about a pretty unpleasant subject matter, director Jay Roach (who started off in comedy with such films as Austin Powers and Meet the Parents) made perhaps the wise decision to try not to go too dark. There is a more of a focus on the female leads efforts within and against Fox News, trying not to define the women merely with what was done to them, and a darkly humorous look at a the company culture. A lot of exposition in the first third is is presented in a pretty audience-friendly manner.Understand that when I say that things don't get too depressing that that doesn't mean the harassment is sugarcoated. The scenes that address this are emotionally striking with how awful the whole thing is. The movie is also pretty nuanced and three-dimensional in depicting the people involved and the situations.My one issue is that a little too much specific factoids are spoken directly to the audience. However given that a movie criticizing conservative Fox News is a politically taut situation, I can see why the filmmakers want to demonstrate that they weren't being sloppy with their presentation of the events.The cast is all around great. You'll probably be surprised by some of the faces that pop up here. Charlize Theron and Nicole Kidman are great in this. John Lithgow delivers one of the best roles of his career as Roger Ailes, managing to portray a loathsome creep while also making it seem natural how he manages to command loyalty among his employees and allies.This is a well done film and I recommend this."}, {"rating": "5", "text": "It’s nearly impossible to address a topic like sexual harassment while avoiding taking a point of view.  By trying to maintain a fair and balanced perspective, “Bombshell” remains frustratingly superficial on a topic that deserves much deeper exploration.This film examines the end of the Roger Ailes era at Fox News, a period during which anchor Gretchen Carlson sued the network for sexual harassment when she was fired.  After the suit was announced, the film depicts on-air-personality Megyn Kelly’s internal debate on whether to go public about her own brushes with Ailes.Director Jay Roach (“Trumbo,” the Austin Powers series) and Writer Charles Randolph (“The Big Short”) have created a film with an uneven, confusing tone.  In “The Big Short,” Randolph’s script relied heavily on voiceovers, actors speaking directly to the camera and excellent use of humor (Margot Robbie in a bubble bath explaining sub-prime mortgages is one of the funniest vignettes of the past few years).  Here, deploying the same techniques just seems out of place - dressing an actor to look like Geraldo Rivera is guaranteed to cause a brief smile, but it’s a cheap laugh that’s simply distracting.  When addressing a subject like sexual harassment, so weighted with profound personal emotional cost, the superficial jokes and visual humor just seem painfully out of place.The core cast contributes almost entirely to whatever success the film does achieve.  As central character Megyn Kelly, Charlize Theron (with the help of facial prostheses) does an eerie imitation of her real-life counterpart’s appearance, gait and style of speaking.  As Gretchen Carlson, Nicole Kidman relies less on visual similarity but still effectively conveys the essence of her character.  As Kayla, who represents a composite of real-life female employees at Fox, Margot Robbie is compelling as she struggles with the compromises she’s willing to make to “move to the head of the line” and become an on-air reporter.  Robbie offers the most powerful scene of the film as she second-guesses with considerable anguish the choices she’s made.  John Lithgow (as Ailes) is powerfully effective as a self-absorbed bully.The creative team has an amazing supporting cast at its disposal - Kate McKinnon as a Fox employee who’s a closeted gay Democrat, Allison Janney, Alice Eve, Rob Delaney, Richard Kind (Rudy Giuliani) and Mark Duplass, among others.  It’s no small irony that two males, Delaney and Duplass, are the most sympathetic, thoughtful and appealing people in the film.“Bombshell” shows several major flaws and raises several major questions.  First, the screenplay totally fails to explore how, if at all, the inward-looking culture at Fox New contributed uniquely to an environment where serial sexual harassment could thrive.  Instead, the script settles for portraying facts from the public record with no real attempt at context or interpretation.  Second, the central characters are generally unsympathetic.  Megyn Kelly, in particular, appears so driven by her own ambition that she seems oblivious to the situations of women around her.  Her early comment “I’m not a feminist.  I’m a lawyer.” offers only the laziest of explanations.    Third, there is no serious exploration of why women, informally, didn’t help other women avoid Ailes’ predations.  For me, one of the most intriguing but inscrutable characters in the film is Holland Taylor (she was Charlie Sheen’s mother on “Two and a Half Men,” more notably Ann Richards in the one-woman-show “Ann” on Broadway) in a totally uncredited role.  In multiple scenes, you see Taylor smiling knowingly as she ushers the latest young woman in a short skirt into Ailes’ inner sanctum, fully aware of what is in store once the door closes and locks.  Finally, totally separate from the Fox News context, is this bland approach to harassment what’s always going to happen when the #MeToo movement is written, directed and packaged by men?If you want a deeper understanding of Roger Ailes and his legacy, read the carefully-documented “The Loudest Voice in the Room,” by Gabriel Sherman.  “Bombshell,” on the other hand, is a superficial glossing-over of an essential topic and an insular culture that deserve a much more thorough examination."}, {"rating": "8", "text": "This is not a summation of the complexity and depth of sexual harassment. It's one single story not intended to represent everyone's experience. It's incredibly well-acted, entertaining, and emotionally evocative."}, {"rating": "4", "text": "This film is not even half as good as Vice or The Report or Richard Jewell.The people in this film are depicted as one-dimensional caricatures and stereotypes. I do not support Fox News but the way they are being generalized and profiled is laughable & demeaning. The film is a bit too on the nose and doesn't have much depth. There are some comedic aspects and Charlize, Nicole give interesting performances but the film overall isn't Oscar-worthy."}, {"rating": "4", "text": "All this movie wants to be is the big short or vice. The problem is that the story does not provide a movie enough material. Charlize Theron had a pretty good performance. But the biggest problem was that the story happened 3 years ago. If the film was not rushed and released 5 or 10 years from now. Then we would be seeing an effective movie that delivers a great message"}, {"rating": "7", "text": "Filme bom com um tema pesado, so não precisa no meio do filme parar de falar do tema do filme pra focar em outras coisas"}, {"rating": "8", "text": "A good film with excellent performances. Going into the movie, everyone needs to be aware that it is largely told from the three female leads perspectives. It is not an anti Fox News movie, but tells the story of Theron, Kidman, and Robbie's characters experience at Fox News. The movie deals with many major stories from 2015 and 16 and contains many Fox News figures past and present. It relies on viewers knowing who they are for those scenes to really sink in. I think the film could have sunk deeper into the culture at Fox News and why so many people were unwilling to defect on Roger Ailes. Conservatives in general are quick to defend white male figures who are accused of harassment and continue to support a president who has been accused of sexual indecency by over a dozen women. The movie misses that chance to really dig deep and explore those questions and the general hypocrisy of the evangelical right. Overall it was entertaining and contained tremendous performances across the board."}, {"rating": "3", "text": "The only thing bombing is this movie. As tropiAces stated, it really wants to be like other movies and does nothing but fall short. Using big names to try and push the movie isn't helping either."}, {"rating": "10", "text": "Película muy recomendable, es un agrado ver a estas 3 actrices juntas. con una duración justa y precisa"}, {"rating": "1", "text": "ORANGE MAN BAD! FOX NEWS BAD! CNN/MSNBC GOOD! CONSERVATIVES BAD! LIBERALS GOOD!That for about two hours."}, {"rating": "9", "text": "Theron and Robbie are standouts. Scenes with Ailes and the survivors at Fox News are cringe worthy. You can fill in the blank...Ailes, Epstein, Trump or Weinstein."}, {"rating": "7", "text": "Interesting watch irrespective of the fact that most of what's shown was covered in the news. Can't tell how unbiased of a telling it was, as I don't like watching FOX News, but it seemed relatively balanced. Performances by all three female leads as well as John Lithgow as Ailes were terrific. Very engaging movie, definitely recommend."}, {"rating": "9", "text": "An Incredible Film That Deserves Much Praise - What a fantastic ensemble!  All the major playersdeserve Supporting ActorActress Nominations andat least of them should tie for the win.  I likedthe mixture of real-time video with the dramatization,and only wished there were percentages more within.If you are not familiar with Meg Kelly, and listenedandor saw her on television at a glance, you willalmost believe that Charlize Theron is Megyn Kelly.Kate McKinnon deserves a Hollywood Walk of Fame Starfor her performance.  I have waited 2 years for thisfilm and Bombshell did not disappoint."}, {"rating": "10", "text": "In 2003/2004 I saw \"Monster\" and walked out of the theatre saying that if Charlize Theron doesn't win the Oscar for her performance I will never go to the movies. Well, she did I still go and today I saw a performance by Charlize Theron that might not get her that second Oscar but she, along with Nicole Kidman and Margot Robbie, certainly deserve nominations. (Robbie stands a chance in the supporting category as the other two have won best actress Oscars.)I honestly did not recognize Theron until the near end of the movie due to makeup and prosthetics---another Oscar nomination?--and she has lowered her voice that she is Megyn Kelly. Though the film revolves around Theron/Kelly, for those who don't know the whole story, it was Gretchen Carlson (Nicole Kidman) who was responsible, not only for the downfall of Roger Ailes (John Lithgow) but helped bring the #METOO movement to the forefront.As with all 'based on a true story' I often wonder how true private conversations are but this man was so abusive that you know a lot wasn't being told and it boggles the mind what he did do and what he, and other men, got away with. The fact that many women covered up for him and one seems to be a pimp for him, doesn't bring any shame on them but on the industry for their practices regarding women.Any film dealing with the politics in the past 5 years will have to involve Trump and Fox News but, even if we see the behind the scenes involving the Murdochs, this is not a Republican versus Democrat movie. There is a reason why the 3 leads, and so many others, are beautiful blondes wearing tight and short dresses and showing their legs and it all points to Ailes, and Fox, allowing him to do what he did because he was making the company billions of dollars.Aside from Theron, Kidman and Robbie there are many name actresses such as Holland Taylor, Kate McKinnon, Allison Janney and Connie Britton playing large, small and all important parts.Lithgow is a repulsive looking man as Ailes--again makeup and prosthetics--making it so unimaginable that he could get any woman that he wanted sexually but he does because of the way the industry worked. Richard Kind does a quick impersonation of Rudy Giuliani while Malcolm McDowell plays Rupert Murdoch and various actors play well known TV figures.The screenplay by Charles Randolph holds your attention no matter how familiar you may be with the story while director Jay Roach keeps the film going at a quick pace.\"Bombshell\" is a must see for the performances, the story and getting out to all the public exactly what brought the #METOO movement forward. Certainly every man should see this film."}, {"rating": "7", "text": "This is a fluffy movie but worth the watch. it has some good laughs, charlize is great and so is john lithgow. again, light fluff movie but given what's out there.... this one of the better flicks i've seen recently."}, {"rating": "6", "text": "Even more shallow than the news reports during the times covered. The performances are good, but the dialogue is pretty shallow throughout most of the movie. It's entertaining, but mostly superficial, probably to avoid angering the gray eminence himself, Murdoch."}, {"rating": "0", "text": "Terrible movie, dont waste your money or time. Wish I could unwatch this so called movie."}, {"rating": "7", "text": "A highly topical film with a stand out cast, the three central performances by Theron, Kidman and Robbie are reason enough to see Bombshell.Bombshell is heavily based on a real scandal against Fox News head Roger Ailes (John Lithgow) and the toxic atmosphere he presided over at the network. It follows three women working at Fox News, Megyn Kelly (Charlize Theron), Gretchen Carlson (Nicole Kidman) and Kayla Pospisil (Margot Robbie). As with all \"based on true events\" movies one has to be aware that certain creative liberties will always be at play. Yes the main plot details will hopefully be accurate but everything around that is up for debate. It's best not to dwell on that as it may hinder your enjoyment of the film itself. In one way you will be entertained watching Bombshell with its snappy dialogue, hoping to get a few laughs from you. But keep in the mind the subject matter. It flips from one end of the spectrum to the other very quickly and there are a couple of scenes that are shocking and very uncomfortable to watch. John Lithgow is absolutely vile as Roger Ailes. I do mean that as a compliment, his performance is so convincing it will make your skin crawl. Lithgow and Theron's transformation into their characters is very impressive and credit has to be given to the prosthetic makeup designer, Kazu Hiro. There are a lot of good contenders among the Makeup and Hairstyling Oscar nominees this year but Bombshell deserves to win.Bombshell does highlight the toxic environment of the news network and you'll feel two very strong emotions when watching it. Empathy towards the women, which is only enhanced by the superb acting from the cast and anger towards the harmful work environment and severe lack of repercussions to these high up sexual predators abusing their positions of power. Although I can't fault the acting from anyone I'm not sure Bombshell is making the grand statement it thinks it's making. It doesn't shy away from the allegations against Ailes but other than that it doesn't really deal with the issues it has raised. Has anything really changed? I didn't have a high opinion of Fox News and Bombshell doesn't do a whole lot to change that. It also feels like it's trying to empower women yet it doesn't exactly achieve that either. It's an appropriate film and suitable for today's climate, I only wish it had tried to be less like a comedy and delve deeper into the subject matter. Regardless it's still worth your time and recommended."}, {"rating": "6", "text": "Pretty much everyone knows the story behind Fox New president Roger Ailes and his serial harrassment of potential reporters and anchors at the network. This film depicts the plight of 3 of those women (played by Charlize Theron, Nicole Kidman and Margot Robbie), as they struggle with exposing their own stories. While the performances are compelling (including John Lithgow's creepy Ailes), the drama is relentless in its sinister, fearful atmosphere. Director Jay Roach continually uses close-ups to probe the paranoia. While he details the story with noteworthy developments, the pace lags, the situations feel repetitive and the drama never builds to a gratifying climax. Like so many recent films about historical events (Dark Waters & Richard Jewell for example), this one is interesting without possessing the riveting impact the subject deserves."}, {"rating": "0", "text": "Another far left feminist movie full of woke cringe. This is a movie for women and woke men."}, {"rating": "5", "text": "The movie is not at the level of the actors who participate in it, limiting their performances. It is a sensitive issue to discuss, but the film fails to realize all its ambition and does not delve deeply into it. Theron and Robbie are fine in the film (although I am not so sure that they are so good as to justify their future Oscar nominations), but here the disappointment is Kidman, who is supposed to be the centerpiece of the film, and ends up being only a small chapter in history.The movie has not really hit the public, and it is fully understood as there are other productions that better explain what happened and with greater emotional intelligence (see the Loudest voice), leaving this film and its intentions in a simple bahhhh."}, {"rating": "5", "text": "This movie wants to be like Vice, and Vice wasn't great. Unfortunately there's not a lot going on that keeps you entertained or even interesting. Charlize Theron was worth watching, but that's about it. Voicing anti-Trump sentiments might be entertaining for a while, but it gets old pretty fast. The sexual harassement part just never really builds up enough momentum to leave a mark."}, {"rating": "7", "text": "El Escándalo (2019)Sinopsis:Cuando Gretchen Carlson golpea al fundador de Fox News, Roger Ailes, con una demanda alegando acoso sexual, nadie podía predecir lo que sucedería después. Su decisión lleva a la corresponsal de Fox News, Megyn Kelly, a presentar su propia historia, así como a muchas otras mujeres, incitando a un movimiento que reverbera en todo el mundo.Opinión:El trasfondo principal es el acoso sexual femenino, sobretodo cuando se trata de magnates de las grandes industrias y el poder que tienen sobre los demás.Las actuaciones son fabulosas, el trío de estrellas conformado por Theron, Kidman y Robbie es una auténtica bomba de talento, el trabajo de maquillaje que se les hizo (ganador de un Oscar) es magnífico, sin embargo, no parece haber una verdadera química entre las tres chicas puesto que la mayoría del tiempo realizan sus acciones por separado. Su ritmo es bueno pero monótono, en ningún momento parece ponerse más interesante o menos interesante y el exceso de diálogos es como estar leyendo una rola de créditos finales pasando a alta velocidad.Pese a todo lo anterior es una buena película, un poco tediosa de seguir, pero sin dudas es completamente verosímil y realista.Valoración:3.5 ⭐ de 5 ⭐"}, {"rating": "8", "text": "A well-acted film about the human cost of bullying and sexual harassmentAlthough it lacks subtlety and factual insight, Bombshell is entertaining, brilliantly acted, and paints a horrifying picture of workplace bullying and sexual harassment. The film tells the story of three women at Fox News - Megyn Kelly (Charlize Theron), who becomes embroiled in controversy when she asks Donald Trump about his history of misogyny; Gretchen Carlson (Nicole Kidman) who is fired from the channel, having already complained about sexist treatment in 2013, and who now plans to sue president Roger Ailes (John Lithgow), who she claims sexually harassed her for years; and research assistant Kayla Pospisil (Margot Robbie playing a composite character) who learns what Ailes means when he says he will need evidence of her \"loyalty\".Written by Charles Randolph and directed by Jay Roach, Bombshell's depiction of the nature of sexual harassment in a corporate arena that's male-dominated and female-enabled is chillingly effective, with the film depicting an environment in which women are victims whether they resist or submit to sexual advances – resist, and they risk their job; submit, and they lose their self-respect.At the same time, Roach is not trying to examine the monolithic political ideology of Fox News itself. Sure, it features lines such as Ailes claiming, \"news is like a ship, you take your hands off the wheel and it pulls hard to the left\", whilst Pospisil is told the main goal of the channel is to \"frighten and titillate\", but these are the exceptions. Instead, the film is about self-loathing, fear, and anxiety – it's about workplace bullying and the human cost of sexual harassment, and part of the film's point is that politics are irrelevant – sexual harassment is sexual harassment, and your politics, religious beliefs, race, and gender are all beside the point.Something that works especially well is the triptych narrative structure. It's not an even divide (this is Kelly's film before it is Carlson's or Pospisil's), but it does allow Roach to dramatise how much Ailes looks on his female staff as commodities. Carlson is the washed-up former beauty queen who no longer holds his interest; Kelly is the current flavour of the month; Pospisil is the future, young, vital, keen, and in awe of the man himself, as all women should be – for every Carlson, there's a Kelly to replace her, and for every Kelly, there's a Pospisil ready for grooming.From an acting perspective, Theron is extremely impressive. Normally, she looks nothing like Kelly, but through posture, mannerisms, wardrobe, voice, and the subtle prosthetic genius of Kazu Hiro, the actress disappears into the character in a deeply impressive performance that transcends mere imitation. The other standout is Lithgow, whose performance is fascinatingly modulated. He initially portrays Ailes as a flawed human being, and it's only later that he lets the monster out of the box, in a horrifying scene in which he asks an increasingly uncomfortable Pospisil to hike her skirt higher and higher, to the point where her underwear is showing, as he becomes increasingly aroused, indicated by nothing but his breathing. It's a nauseating scene which gets to the film's core – Ailes knows that if women like Pospisil value their job, they'll submit, just as they have done for men like him throughout history; as he sees it, ambitious women will always need powerful men.As for problems, the film is probably too silent on some of Kelly's history. I understand that Roach wants to avoid anything resembling victim-blaming. But if you knew nothing about these events, you'd think the only controversy Kelly ever encountered at Fox was asking Trump about misogyny. There's no mention, for example, of her infamous \"Jesus was a white man\" comment from 2013. Granted, it doesn't have much to do with the story at hand, but my point is a general one. The film's Kelly is almost virginal, without blemish. Interestingly, the film does address that Kelly knew about Ailes for years before Carlson was fired, and it takes her to task for not doing anything with that knowledge. However, after she watched the film, the real Kelly cited this scene as an example of victim-blaming – make of that what you will.Certainly, the opportunity for Kelly to explain why she stayed silent for so long is available, but is never availed of. But is that a fault of the filmmakers or a reflection on the actual person's reluctance to take that journey inward? Sure, the film is at pains to avoid showing either Carlson or Kelly as in any way complicit in creating the hideously outdated patriarchy at Fox. But this is by design. Were Bombshell a story about Fox News, such things ought to be examined. But it isn't. It's a story about humiliation and bullying, a story that says people do not deserve such treatment, no matter their race, religion, or politics."}, {"rating": "5", "text": "Bombshell Goes BustThe Stream: Nothing new that you didn’t already know or suspect.The Big Screen: Charlize Theron’s uncanny resemblance to Megyn Kelly is a remarkable feat.The Final Bill: A star-studded TV movie on the big screen.-Trip FontaineIn the colloquial sense, people and things can be described as a bombshell. Catastrophic news can be a bombshell; or, an attractive woman may be characterized as a bombshell. Most likely, you have heard the term “blonde bombshell” – get it? Whatever. Okay, Jay Roach’s Bombshell plays with those connotations in alluding to the revelation of rampant sexual harassment at Fox News as well as the numerous, mostly blonde employees of the network. The titular bombshell was reported in 2016 when Fox News anchor Gretchen Carlson exposes then CEO Roger Ailes and the toxic culture at the network, so the history is very recent. I would suspect anyone going to see Bombshell will mostly be curious about the star-studded cast because they would already know the basics of the story. There really isn’t much more to it.Nicole Kidman plays a fierce and steadfast, Gretchen Carlson. She’s tired of the “boy’s club” antics of her co-anchors and the disregard she is shown by Roger Ailes, who is played by John Lithgow under layers of makeup. I think Kidman is made up to resemble Carlson, and it’s a good job because she looks like herself but not unrecognizable. Carlson is out on a limb when she goes against Ailes by exposing him and Fox News, but she needs allies.The remainder of the film is basically grappling with whether any other women related to Fox News will tell their stories. The primary focus is on Megyn Kelly played by Charlize Theron and a composite character, Kayla Pospisil, played by Margot Robbie. Theron is unrecognizable. She looks so much like Megyn Kelly and sounds like her too that it is mindboggling. Her performance is really good although it doesn’t seem like there’s much at stake for Kelly. She seems pretty insulated from any potential fallout whether she supports Carlson or not. Robbie is very good as well. Because her character is fictionalized, she doesn’t come with the baggage of Megyn Kelly or Gretchen Carlson and gets to be the ambitious, young wide-eyed fool who wants to work at Fox News and naively trusts these people she idolizes. Robbie gets to be tender and devastating in her own right.It is hard to be spoiler free on Bombshell because we lived these events so recently or you can just go to your trusty internet search engine and read the articles for yourself. I ask, does the film justify its existence? The cast does a good job. There are a lot of cameos throughout of the other Fox News personalities – Geraldo, Judge Jeanine, Greta, etc. The make-up is great – just look at Theron in one clip. The film as a whole feels like the other political retellings that have come out as of late, mostly on HBO, Recount, Game Change and last year’s theatrical release, Vice, but there’s really no deeper point of view about any of these characters or the situation. I do not know that this movie is necessary now – aside from depicting that women working in the conservative news field endured their #MeToo moments as well.The only real reason to see Bombshell is to watch Charlize Theron, Nicole Kidman and Margot Robbie in these performances. They are all great, but the first teaser for Bombshell (the 3 women in the elevator and that suspenseful music) was the most impactful part of the film. If you really want to know what happened, read the articles from only 3 years ago. Save the viewing of the movie to when it premieres on HBO next year or whenever, if you must see it."}, {"rating": "10", "text": "this movie is great. really brings to light what happens behind the scenes. people say it hates on men, but here's the thing. if it don't apply, let it fly. but if it stings, then maybe it was supposed to sting. if you assume that an instance of sexual harassment is an attack on men, then that says more about you than the movie."}, {"rating": "8", "text": "Quite a good film about the goings-on at Fox News during the last years of executive Roger Ailes. Unfortunately the underlying issue of this film is that Megyn Kelly, though she finally did right, was also proven to be a bit of a bigot in the real World. Regardless it's an important story to have highlighted."}, {"rating": "7", "text": "A totally relevant subject and makes us think that we can hardly imagine what happens behind this industry. There are so many environments that treat women in this way and it takes courage to be able to fight against harassment and the predominant culture by men. It holds your attention and passes very quickly."}, {"rating": "6", "text": "Movie was told interestingly, but when you think about it the plot is very predictable, given that you know about the real events so movie doesn't really show much more about it. Not only that, some parts are just made up or imagined by scenarists as they didnt consult actual Megyn Kelly about movie etc. So yeah, it is good that such movie exists about the topic and brings it to forefront but I think as a movie itself isn't the greatest"}, {"rating": "8", "text": "This is an interesting movie about the 2016 presidential election and Sexual harassment at FOX news. It was not easy to criticize Fox News. But the movie made it. This movie encourages women!"}, {"rating": "8", "text": "Supported by brilliant performances, this drama based on true events would only be the beginning of complaints about sexual harassment at work. As much as the development of the plot seems slow, it is always well compensated."}, {"rating": "4", "text": "I found this movie very boring and just felt like it exists to hate on the male gender"}, {"rating": "0", "text": "C’est inspiré de faits réels qui ont déclenché à la fois une tempête médiatique et une prise de conscience ainsi qu’une révolte… et une indignation parfaitement légitimes. Le chantage et le harcèlement sexuel ne sont pas admissibles à notre époque, dite « moderne » et civilisée et je supporte bien évidemment le mouvement « me too » et « balance ton porc ».Le féminisme a donc encore beaucoup de combats à mener… mais ce n’est avec des films de cet acabit que le « mouvement » va progresser… car « Scandale » est un scandale scandaleusement nul à chier. Hautement soporifique, affreusement chiant et bavard, ce pseudo-film n’a aucun intérêt tel qu’il est, à part servir de puissant somnifère !Franchement, j’aurais préféré un vrai documentaire parce que là, j’ai très vite décroché… c’est si maladroit et si mal fait que ça ne sert pas la grande cause féministe si vous voulez mon avis. Et puis, j’ai un autre gros problème avec ce film complètement merdique : il concerne les actrices…En effet, à part Margot Robbie, on ne reconnaît ni Theron ni Kidman : que leur est-il arrivé au juste ? ont-elles été grimées par ordinateur ? ou bien ont-elles séjourné un peu trop longtemps sur le billard de leur charcudoc préféré ? ça fout les jetons, franchement ! et ça aussi, c’est un scandale… M’enfin bref, on ouvre la poubelle, on balance et on passe à autre chose, tout le monde peut se trumper, je suppose."}, {"rating": "5", "text": "(Mauro Lanari)Kayla Pospisil falls asleep drunk with Jess Carr and, when they wake up, discovers that her colleague of \"Fox News\" is a liberal with two posters of Hillary Clinton in the apartment. The film is set in 2016, while the sexgate between President Bill and Monica Lewinsky is from 1998. The reason why the #MeToo Movement only went viral with Harvey Weinstein in 2017 is not at all clear to me: were social networks and their hashtags necessary? That said, \"Bombshell\" has a confused, convulsive, I dare say \"hysterical\" rhythm, which tends to cloud the careeristic complicity of the victims."}, {"rating": "8", "text": "I expected that the end of this movie would make me feel some sort of relief or sense of victory, but instead I just spent 15 minutes crying in my parked car thinking about women who face/have faced sexual harassment at work and have been forced into silence. I hope you can all be safe and I love you."}, {"rating": "9", "text": "Great movie with a superb cast! I imagine the middle of the road reviews are from FoxNews viewers."}, {"rating": "1", "text": "I tuned in because of the cast. I couldn't have been more disappointed! Unfortunately, this movie took what could have been a chance to focus on the very real problem of misogyny in the workplace and turn it into a political platform. Unfortunately, it is something Hollywood feels is very much its job these days. Stick to providing pure entertainment and leave the politics to the politicians."}, {"rating": "8", "text": "Not being American I didn't really know anything about this story which isn't a bad thing it is a very good film, with terrific performances from the 3 lead ladies Nicole Kidman, Charlize Theron and Margot Robbie. John Lithgow is outstanding as well he just keeps getting better as an actor. The story is about when a woman is fired from here job she sues the head of Fox News for sexual harassment. She tries to find other employees and former employees who experienced similar atrocities in the workplace and tries to get them to come forward against one of the most powerful men in the American media."}, {"rating": "1", "text": "20 minutes in and I had to quit watching this garbage. Don’t waste your time with this trash."}], "recommendations": ["the_danish_girl", "miss_sloane", "hidden_figures", "spotlight", "mary_queen_of_scots", "ingrid_goes_west", "the_reader", "green_book", "the_post", "judas_and_the_black_messiah", "snowden", "tulip_fever", "the_last_duel", "dallas_buyers_club", "just_mercy", "the_witches_of_eastwick", "nightcrawler", "philadelphia", "don_jon", "wall_street", "legends_of_the_fall", "darkest_hour", "personal_shopper", "the_help", "the_imitation_game"]}