{"id": 4352, "title": "Bone Tomahawk", "starring": ["Kurt Russell", "Patrick Wilson"], "runtime": 133, "genre": ["Western", "Horror"], "description": "During a shootout in a saloon, Sheriff Hunt injures a suspicious stranger. The doctor's assistant, wife of the local foreman, tends to him in prison. That night, the town is attacked and they both disappear—only the arrow of a cannibal tribe is found. Hunt and a few of his men go in search of the prisoner and the foreman's wife.", "releaseYear": "2015", "mpaaRating": "NR", "imageUrl": "https://image.tmdb.org/t/p/w500/4MmTHpn2Y8emqvBgvOjufImUmKZ.jpg", "categories": {"plot": 7.0588235294117645, "acting": 7.266666666666667, "ending": 6.333333333333333, "soundtrack": 6.5, "cinematography": 5.142857142857143, "familyFriendly": 4.0, "funny": 5.25, "action": 5.714285714285714}, "reviews": [{"rating": "7", "text": "Bone Tomahawk is a dark, menacing horror western that really knows how to build tension and have it pay-off fantastically. Patrick Wilson, Kurt Russell, Richard Jenkins, and Matthew Fox, are all great in this one and really have chemistry as a group. The mysterious savages who are causing havoc on their town and on the frontier as a whole are a truly terrifying group and really have no problems making you entirely terrified of them. The film is also really well shot and has a good score that fits both the western and horror genres. My main problem here is the graphic and, really, unnecessary violence. The film is very good, but gets hampered by its apparent willingness to make its audience violently ill. There is truly no call for that and I should not have to see what this film put me through. As an overall picture, however, Bone Tomahawk is a very well executed film that really blends horrors and westerns quite well, while also managing to be endlessly captivating."}, {"rating": "6", "text": "A film I was really looking forward to that ended up disappointing for reasons I didn't quite expect. One of the things I've always heard about writer/director S. Craig Zahler's films is that they're always impeccably written, with a lot of the character and plotting work feeling as authentic as possible. This couldn't be more true in \"Bone Tomahawk's\" case. The characters all feel as textured and as fleshed out as can be, featuring specific quirks, worldviews, and ways of speaking that really help add to the overall sense of realism in the film. Also operating on the keyword \"realism\" is the narrative, which unfurls itself at a pace and fashion that's cautious, but also exhilaratingly unpredictable. So where do things go wrong for me? Well, this is a very unique film in terms of style. Surprisingly so, in fact. There's little to no score, a mostly refreshing lack of standard editing and blocking techniques, and very little actual goings-on until the climactic final act. This hyperrealistic flavor of cinematic filmmaking really makes the scenes where things are transpiring feel utterly thrilling and unpredictable, with the deemphasis of music and traditional editing techniques really putting you in a unique place as an audience member. But, again, once that's coupled with the tremendous amount of downtime and traveling scenes we have to witness, this sort of style can make for some rather potent spells of sluggishness. It's a completely legitimate and even momentarily brilliant first effort, but I'm more excited to see how this filmmaker grows from this admittedly imperfect experience."}, {"rating": "8", "text": "The movie is slow at the beginning but the acting and the interesting story drag you back in the movie every time. With an amazing cast in Kurt Russell, Matthew Fox, Patrick Wilson and David Arquette and a really entertaining last hour, Bone Tomahawk is one of the best and most original horror/western movie I've seen in a while. Destined to be a cult classic without a doubt."}, {"rating": "7", "text": "Western movies hardly get any attention nowadays, but with Bone Tomahawk and the fact that I'm one of the most active users around here, this movie can most likely get seen by anyone who gets accessed to my profile."}, {"rating": "5", "text": "I give this a 5/10 to put it in the good-but-not-great category.  The plot is original and engaging, though sometimes predictable.  The script at times can be distracting in its unconventionality, but adds to the fingerprint of the film.  The acting on the part of the antagonists was cheesy, but in every other circumstance was spot on.  The climax was a bit uninspiring, as was the conclusion, but I found myself rooting along with the characters.  I enjoyed this movie, but would not write home about it."}, {"rating": "9", "text": "Best Western I've seen in years. Great performances , direction and script. This is a movie that should be seen although some of the graphic violence would not be to everyone's taste. Can't wait to see more from first time director S. Graig Zahler."}, {"rating": "8", "text": "Full disclosure: this is in fact a horror film. Not a thriller and only a dabble in suspense, but fully delved horror.\r Zahler's direction is outstanding! With the combination of fine cinematography, this is perhaps just as, if not more beautiful than the competing fine Western of 2015, Slow West. Russell, Wilson, and Fox perform to the best of their abilities with Jenkins delivering what may be the best work in his career. The four named actors carry this story on horseback and foot, not for a moment letting their grip fail. Other performances, namely those of Simmons and whomever played the god-awful accomplice to the opening scene, fail to match the work done by their surrounding party. However, it's not so terrible that it hinders the film. Actually, the opening scene was quite hindered by the actor whom I care not to discover. Anyhow, the overall professional work is just that, top-notch and quite obviously professional. For these reasons I can confidently name Bone Tomahawk an extraordinary film.\r However, it is my only complaint (though I accept that I am simply not the target audience of such a genre) that the violence is overly indulged. Being a medic for the United States military, I have seen enough gruesome detail to find entertainment in the excessive depiction. The brutality is mixed well in the execution of  the overall product, but I find such torture porn to be deemed of a lesser class professionally. You can get the darkest and most brutal of points across without depicting every detail. I know there are many opposing opinions on the matter, so such is just that: my opinion.\r It is nonetheless an excellent work of film and an exciting story. I simply would've loved to see how much I could've loved this film had it been more hesitant to lay so much blood and gore on camera."}, {"rating": "7", "text": "Muy buena, tiene una gran historia, poco presupuesto pero logra accion emocionante, los personajes son muy buenos."}, {"rating": "9", "text": "very surprised about this flick, very good overall production value, great actors, great indians which are a pure threat, very dark for an western, watch it"}, {"rating": "10", "text": "Destined to be a modern classic. If you are a fan of well written,and directed westerns, and horror movies, this is one you won't soon forget. The character development was amazing. There wasn't any weak link in the acting whatsoever. Everyone brought their \"A\" game. No amateurs here. Kurt Russell is a powerhouse, and this is possibly his best role to date. The range of emotion goes from jovial to horrific in the bat of an eye. There was also an appearance by Sig Haig, in a small but memorable role. This is one people will be talking about."}, {"rating": "10", "text": "very good indie movie. The price will come down but i am glad i watched it. Thought provoking - i spent an hour or so afterwards researching elements of the script for veracity ... in particular the pueblo cultures of america, early and 17 and 18 century. Long movie but i never fast forwarded as i am wont to do. Great acting. Long movie. Not a horror movie but is very vivid. Scary only in the sense of verisimilitude! And not a western movie ... but a movie of survival in frontier america."}, {"rating": "5", "text": "The setup is very well done, great feel, good characters, good dialogue... but it's all in service of a rather silly premise in the end. A pity not more care was taken with the antagonists."}, {"rating": "8", "text": "2015 is appearing to be the year the Western and Bone Tomahawk is one of the best ones I've seen so far. It may not be for everyone because it is a little on the slow side but the characters and the performances are good enough that you can get to the climax without any yawns. I was very shocked with how good the acting was in this movie. Kurt Russell is the perfect man for the lead as and I'll be even more interested to see how he does in the Hateful 8. Matthew Fox is great. Patrick Wilson is great and Richard Jenkins is great. I like the adventure and although it is a long wait I really enjoyed the look of the cannibals and the climax really didn't disappoint. I'm sure that fans of westerns will certainly find some enjoyment in Bone Tomahawk."}, {"rating": "8", "text": "Bone Tomahawk stars the second-rate ensemble cast of Kurt Russell, Patrick Wilson, David Arquette, Matthew Fox, Richard Jenkins, and Sid Haig.  Although these actors are a step below big names, they play their roles in stellar fashion, and elevate themselves to first-rate levels.  Kurt Russell and the unrecognisable Richard Jenkins are an absolute treat to watch, and their on-screen chemistry is fantastic.  Patrick Wilson gives the role justice and keeps pace with the veterans on set.  Matthew Fox was a good casting decision, and it was nice to see Matthew on screen again.\r The dialogue is a gem in this film.  Everything these characters say is like candy to the ears.  The southern-drawl, and overly-polite nature of their conversations - even when in dire situations - is hands-down the most pleasant I've experienced in a film this year.\r Benji Bakshi's cinematography is creative and intriguing.  Combined with S. Craig Zahler's direction, the lingering shot composition adds tension in almost every scene.  It is clear Benji took time and care to add depth and meaning to each individual shot in this film, and by doing so, he garners a specificity for displaying the constriction of the characters and the motifs of the plot.\r The plot in itself is engaging from the beginning.  The mystery surrounding the circumstances pulls you in as you are soon thrust into a situation in which the characters actions reflect the audiences conjecture.  This film is book-ended, opening with a desecration and closing with a reluctant respect.  On the surface, the film portrays the antagonists as savages, which they are, but underneath Zahler commands us to understand that we are the ones disturbing their land.  None of this is explicitly stated, like perhaps if this film were released with a larger budget, and more production backing it - which is the beauty of the deliverance of this film's message: inference.\r Filmed in two weeks, I can definitely say this film deserves a wider audience and more attention.\r My official rating is 76/100, but because of the restriction of user reviewers, Metacritic only allows 1-10, so I round up."}, {"rating": "5", "text": "Just a bang average western. No fear factor. Decent acting but so damn boring and drawn out."}, {"rating": "9", "text": "Gritty movie with cool dialogue and excellent acting.  Certain mesmeric quality to this tale of retrieving captives from cave dwellers.  My level of involvement was surprising given the simplicity of the story.  Director knew how to build tension that grew out of your identification with the characters."}, {"rating": "2", "text": "Is it reasonable to expect that a movie which is rated above 90 is simply superlative? Well this one was and it falls a long way short of superlative, are file reviewers a waste of space? A lot of negative reviews are the result of one actor being chopped in half in one scene, frankly I think that is gross over reaction by the prudish puritan fraternity and really has no bearing on the film in its entirety.The film falls down in my opinion because it is so jarring in it's presentation of the wild west, it is set somewhere around 1870. What is jarring is that the director has managed to insert so much 2015 in circa 1870.The opening scene of 2 deadbeats, with audio only you wold swear they had a 21st century education, being able to discuss how many veins in a person's neck was not common knowledge, I'd be prepared to wager, back in 1870, even in 2019 probably only some doctors could answer that.  Shortly after the opening scene we have a shot of the village announcement board, announcing the village name and population of around 250. It looked like a 21st century tourist trap, I thought then that the movie was a spoof. Then we move into the house of one of the main actors, at first you think it's a dump, old unpainted floor boards with a one inch gap between each one and then you see the above floor furnishings which could have been taken from Vouge magazine.And in this bustling of around 250 people we have 2 doctors and people prancing around dressed like they are headed for the Oscars. It is so out of place that it just jars you. People, in 1870, who lived in villages with a population of 250 would have maybe a general store and that's it. But wait, this town has a sheriff and 2 deputies, more than 10% of the entire population.One bloke has a leg injury which is very opaque, I am never sure whether it is broken or just lacerated but he can walk for days on end with a crutch. It is very silly and unrealistic. They decide to travel at night and somehow manage to navigate to where they want to go, I particularly liked using a telescope in the dead of night - really gave me a sense these guys knew what they were doing.So we are back to familiar territory, people being in places and doing things that could not exist or are just not possible."}, {"rating": "0", "text": "The sheer fact that this movie exists in 2015 is more horrifying than anything in the movie, and I just watched a man eat his own scalp and get ripped in half."}, {"rating": "4", "text": "Honestly, I didn't understand why the movie's rating is so shamelessly high. For me, it looks like some sort of conspiracy. Maybe there is something in it, just something. Some rare bits of merit: some professionalism displayed in costumes, makeup, even in camerawork sometimes. Nor an inspiration, neither an ingenuity, just some professionalism. Maybe the casting is not so bad, maybe even acting isn't so awful, maybe the general idea is also rather promising. But...\r But somehow it happened that what we have in the issue is a complete fail. Why? It's inconsistent, improbable, childish, naive, impostrous and silly. To mention only this mythical cruel voracious homicidal highly dangerous and destructive tribe which in reality hardly could survive at all, at least for more than a couple of weeks if its members behaved in a way they are doing in this movie. Whatever their aims are, it seems, they are always choosing the most idiotic way to achieve them as possible. When they are geekishly jumping from the bushes on point blank gun shooting - what we supposed to presume in such moments?  That they were hiding and waiting there for a long long time just to do... this? Why? Are they so hungry? They don't look emaciated however and maybe it worth for them to try something else besides humans?  Just for a change... Seriously, this and other peculiarities prevent the movie from being taking seriously but not make it enough stupid for all that, they just don't reach the hilarious level of stupidity. What a pity!"}, {"rating": "1", "text": "The movie is admirable for being an indie production, especially a Western/horror with an unusual sub-genre (a lost tribe of 'people').\r That said, I don't know what the director was trying to do, and I think it's bad regardless. Was he trying to make pulpy, tongue-in-cheek fare?  It fails at the sort of humorous winks that would make that work.\rWas he trying to play it gritty and straight-ahead? It's ham-fisted.\rWas he trying for a weird mix of these two things? ...probably, but that isn't what jars me.\r What jars me is that every element in the movie is a mix of sometimes good, sometimes competently shrug-able, and sometimes incompetent. I will say that the lighting is generally good (with some conspicuously forced lighting here and there), and that the flat characterization is acceptable in a film of this genre.\r BUT, the story logic, the dialogue, the acting, the shot/edit/sequence decisions, the sound design-- they're often sub-par or terrible. If these were all good to great, the weird tone of the picture wouldn't\rbother me. As it is, the tone is just another semi-competent choice at best.\r I believe that the fan support for the film exists because the fans of the genre are starved for content. For this, and for executing an indie Western at all for $1.8M, I will give the director credit. But on its own merits, this is not a good or even fully competent movie."}, {"rating": "8", "text": "Between its \"horror western\" billing and barely detectable presence at\rthe box office, Bone Tomahawk has \"cult film\" written all over it and\rthat's a shame because it certainly deserves a wider audience. The 10\ror so people I've asked about Bone Tomahawk had never heard of it and\rthat lack of awareness, due to little or no promotion, is an\runfortunate by-product of the film's independent nature (it cost less\rthan $2 million to make). Kurt Russell, the film's star, turns in a\rfirst-rate performance as Frank Hunt, the sheriff of a frontier town in\rthe American West in the 1800's. Russell hasn't acted much since\rstarring in Quentin Tarantino's Death Proof in 2007 and it's nice to\rsee him back in 2015 with some high profile and meaty roles (this\rsummer's Furious 7 and Tarantino's about-to-be-released The Hateful\rEight). Here, he's surrounded by a talented cast that includes Patrick\rWilson (Watchmen and the current season of TV's Fargo), Richard Jenkins\r(The Visitor and TV's Six Feet Under), and Matthew Fox (TV's Lost),\rwith additional support from David Arquette, Lili Simmons, and Sean\rYoung.\r First-time director S. Craig Zahler also wrote the character-driven\rscreenplay, which Russell called \"the best Western I've read since\rTombstone\". I was rather surprised to learn that 1993's Tombstone was\rthe last western Russell had appeared in, considering how memorable he\rwas in it as Wyatt Earp and how comfortable he seems in the genre\r(apparently he's making up for lost time - The Hateful Eight is also a\rWestern). The gruff Hunt, sporting a lite version of the full-on\rYosemite Sam-style facial hair Russell displays in Tarantino's upcoming\rfilm, heads up a four-man posse who represent the only hope for some\rlocals kidnapped by a tribe of cannibalistic cave-dwellers. Also\rincluded in the foursome are Jenkins' bumbling deputy (the film's go-to\rsource for comic relief), Fox's dandyish gunslinger, and Wilson as the\rbroken-legged distraught husband of one of the kidnapped townsfolk. The\rphysical limitations of Wilson's character impede the urgent nature of\rthe group's quest, who need to make a five day journey in three days.\rThat conveniently helps to extend the time available for the interplay\rbetween the four radically different characters and it's those lively\rexchanges that are Bone Tomahawk's core strength. Viewers looking for\rextended action sequences or buckets of blood will be sorely\rdisappointed - this is a slowly paced and talk-heavy film. That being\rsaid, Bone Tomahawk does contain some occasionally brutal visuals; one\rparticularly disturbing scene is likely to stay with you long after the\rcredits have finished rolling.\r One of the few faults I can find with Bone Tomahawk is that it does\rfeel a tad overstretched at 132 minutes. Otherwise, Zahler impresses\rmightily in a directorial debut that features excellent casting, sharp\rdialogue, and a beautiful look that shows no signs of the film's\rminuscule budget.\r mediaboymusings.blogspot.ca"}, {"rating": "5", "text": "There are aspects of this movie that are good, the acting being one of them, the costumes being another. The problems with this film are that there is no score to speak of which leaves the film feeling rather stagnant, the camera shots are very claustrophobic, and in many cases the sets just looked bad. It felt more like I was watching a well acted student film or a small stage play rather than a movie.  The cave scene was convincingly gruesome though so not a total waste of time."}, {"rating": "2", "text": "After a good start, the movie unravels in its last 30 minutes.  From a quality Western in the mold of THE SEARCHERS, it turns into a disgusting horror film that makes absolutely no sense.  Spoiler alert:  a human being is literally split apart before being devoured by cannibals."}, {"rating": "0", "text": "What absolutely baffles me is why anyone would recommend this sick trash, much less give it a high rating. If anyone you know recommends this B-movie, know that person no more. That should be a deal breaker for anyone. I've seen some disturbing death scenes in my time, but this movie seemed to just want to push the envelope for how disgusting they could make a scene and get away with it. Completely unnecessary and sick. Viewers be warned: once you watch this movie, it can't be unseen."}, {"rating": "8", "text": "Western done different, great cast, great story, unexpected & thoroughly enjoyable, is a bit on the graphic side so even the most ardent horror fans should be prepared but completely worth it"}, {"rating": "8", "text": "Guess they have to keep coming up with more imaginative story lines to sell movies.  We're in the old west, there is a band of Indians (?), zombies (?), aborigines (?) running around loose out there.  As civilization encroaches into their territory, they strike back.  Sounds like today's story of people getting closer into the territory of wild animals.  Kurt Russell seems to be doing a lot of this type of movie these days.  Took me a while to recognize the Doc from Lost.  A good thriller."}, {"rating": "9", "text": "Esta película es un soplo de aire fresco y necesario para el cine actual. Una película muy rara y muy buena. Magníficos diálogos con un guión cojonudo que construye grandes personajes y unas gotitas de terror. La parte final de la película es... de esas cosas por las que vemos cine."}, {"rating": "0", "text": "In all fairness, my husband was watching this & I happened to sit down, just at the scene of: SPOILER ALERT: The splitting of a human being. I am a grown woman, but I have to say that it was THE most disturbing scene ever created. I was literally nauseated all night, as it kept replaying in my mind. Silly me, I was not informed by my husband that it was a HORROR MOVIE! I wouldn't have even looked if I had that bit of info. Someone else wrote, \"You can't unsee it.\" Truer words were never typed. The writers should be smacked silly, for unconscionable envelope pushing...PURE DISGUST."}, {"rating": "3", "text": "I have created an account just for that movie as it has been a long time I haven't see such a bad movie. I feel sorry for the actors and all the good work that has been done to produce this movie. The story is bad, drag for hours and the overall experience is boring as hell. I still gave it a go as I saw positive reviews- they must be friends or worked in the movie- as no one normal would rate it as a good movie. The hook is \"cannibal and western\" and that's exhaustive- don't be fooled and save 2 hours of your lifetime."}, {"rating": "7", "text": "Pretty cool neo-spaghetti flavored western. I hesitate to say horror - though it is quite gory at times - because it is firmly within the confines of the western genre and it's tropes.It's a character driven adventure ride with a nasty shootout looming (and more) and for a genre exercise actually takes its time and enjoys the ride. It's a bit sub-Tarantino in that regard, especially with what it thinks is cute characterizations and dialogue (sometimes good, sometimes ok). But these are really good actors working with fleshed out and interesting characters and it knows when to unleash the catharsis. You actually care about these guys and the violence hurts. And it's wrapped in a genre package so it's not taken overly seriously, there's some good humor to be had too.I'm looking forward to more from S Craig Zahler."}, {"rating": "9", "text": "A brilliant re-exploration of the western, using the chase-the-bad-guys paradigm in a way never before imagined. Kurt Russell is provided the later-career role of his dreams and a worthy supporting cast as he . . . chases down the bad guys. Or should I say, beyond bad. Complete with lovely Victorian scripting and characterizations. Lengthy but if you’re on the same wavelength as first-time director S. Craig Zahler this movie flies by and is good for multiple re-viewings. Available currently (Feb. 2018) on Prime Video."}, {"rating": "9", "text": "50% western and 50% horror. This film is awesome. The story, acting, setting, scares and cinematography is almost perfect. The dialogue is sometimes Tarantinoesq. The picture side is plain beautiful, in a very haunting manner. The character development is great and the effects and how they stick with you, is just breathtaking. Cost approx 2 mill USD and they have made they most of this very low cost."}, {"rating": "7", "text": "Meet the most savage people of the American native.\r This was one of the three western films I've watched back to back recently. The other two were 'The Salvation' and 'The Homesman'. They all were totally different from each other and I enjoyed them a lot. I did not know what this title means, but I learnt it before going for it which means some kind of axe used by the American Indians. So I have waited for that moment to know why the film's called that and then, omg, I was very shocked, totally uncomfortable to watch that part. I felt like it was a western version of 'The Hills Have Eyes'.\r This was a road movie. A group of peoples' journey to rescue those who were abducted by some mountain tribes. The rescue was the third act and the rest of the film was about how they make into that remote place. Obviously a slow pace, makes you sit whatever position you want, but after the 90 minutes you will be more focused than before as the narration gets tense. The best part of the film in any western the audience were looking for finally arrives. It was a simple, but very strong and disturbing.\r The cast was the plus point, everyone did their part best. Even the music and the locations were very nice and appropriate. One of the rare western films I've seen, with a mix of horror-terror. This is the cheapest film and shot within a month of time, but a fine production and completely unexpected film. Possible for a sequel, but I think that's not a good idea unless it retains the same crew. If you're okay with a slow narration, then you will enjoy it. Compared to the opening, when it ends, you will feel satisfied. It is not a greatest western of all time, but still worth a watch.\r 7/10"}, {"rating": "9", "text": "A fantastically twisted western. Great performances by great actors portraying very interesting characters. Matthew Fox and Richard Jenkins are outstanding."}, {"rating": "8", "text": "+Great cast deliver excellent performances+Decent production quality+Excellent screenplay-Some pacing issuesMy expectations were exceeded in 2015's Bone Tomahawk... The film has a dark tone to it and you really get the impression the goal in making this film was to make a realistic horror story in a western setting without pulling the usual cheap tricks/tropes. Director S. Craig Zahler certainly achieves that goal however please note the gore is very explicit and shocking and the long scenes of 1800's colloquial dialogue are not kind to the pacing of the movie at the best of times."}, {"rating": "9", "text": "Wow. I don't even know where to begin with this one. Let me start out by saying: **** Hateful Eight, watch this instead. Both films came out around the same time, both Westerns with Kurt Russell as the star. Because of this Bone Tomahawk was completely swept under the rug. The cast is superb, (you will barely recognize Richard Jenkins) the acting top notch and the story unpredictable. Possibly a little too gory for mainstream audiences but a heartfelt, solid script regardless. A surprising gem. Kind of a mixture of Unforgiven and Cannibal Holocaust. Yeah. That good."}, {"rating": "9", "text": "I loved this film. So much quirky detail, great characters and a few total WTF moments. I found myself laughing quite often, hiding behind my hands at points and I really got drawn into the story throughout. Great script, great performances all round, and I think this is destined to become a bit of a cult classic. Full props to the director in pulling this off. Certainly not for everyone but if you like quirky westerns with a dash of horror gore then you probably love this. Kept me awake the night I saw it and stayed with me for a few days afterwards."}, {"rating": "10", "text": "Chilling, effective horror-western with a fine cast at the top of their game and a brilliantly frightening screenplay that will keep you glued to your seat until the end.  The horror-western is a virtually unexploited genre (easily understood when you consider attempts such as “Billy the Kid vs. Dracula” and “Jesse James Meets Frankenstein’s Daughter”), but “Bone Tomahawk” excels both as a western and as a horror film.  I can only think of two other successful attempts to marry the western with elements of the horror film:  “The Stalking Moon” (1968) and “The Missing” (2003), neither of which succeed on the level of this film.  Kurt Russell and Richard Jenkins are brilliant here, and Russell remains one of the finest, most underrated actors of our time."}, {"rating": "4", "text": "Savage Native Americans? Really? We're still not done with that? Oh, pardon - they were cannibalistic troglodytes! I know. The movie was solid otherwise. Not great mind you, just okay. It has the usual stupid character decisions that make no sense and are just there to drive the plot forward along with the usual magical healing abilities that many action heroes seem to have. Only when they need them of course. Everybody is willing to throw their lives away as well as is to be expected from these kinds of movies. The acting was sometimes decent and interesting and sometimes pretty cliche and shallow. I can't even single out one actor for that since each of them switched between those parameters. Only Simmons was especially unconvincing. Damsel in distress anyone? Not that she looked too desperate as a prisoner *wink*. The sound effects were a bit over the top. The gore was new for a Western movie (Yeah, it's labeled horror. I know.) but I was ok with that. What wasn't new though were the Western movie tropes."}, {"rating": "9", "text": "Increíble terror western que te mantiene pegado al asiento en tensión durante sus poco más de dos horas. Intensa, sublimemente dirigida, interpretada y guionizada, contentará a todos aquellos que busquen un señor western, y además, hará recorrer escalofríos por las espinas dorsales de aquellos amantes del terror. Ambientación y atmósfera excepcionales que no dan respiro al espectador y lo mantienen en alerta máxima durante todo el metraje.Como pega, el inicio quizás es muy lento, y podría ser resumido mucho más rápido.Muy recomendada."}, {"rating": "7", "text": "Very enjoyable western. Acting of everyone concerned great except Lili Simmons who is just awful. Luckily she is not featured much. Edge of your seat stuff and quite gory."}, {"rating": "10", "text": "Must see. Underrated. Shocking. Great ending. Funny. Endearing characters. Definitely a horror movie."}, {"rating": "9", "text": "The film is great: acting, writing, action, and cinematography. That's all a movie really needs."}, {"rating": "8", "text": "Just cowboys being dudes"}, {"rating": "8", "text": "Gritty and gruesome. Those are the two words I'd use to describe this western horror film. It pulls no punches in the gore on display as our main group headed by Kurt Russell and Patrick Wilson ventures to rescue some kidnappees. Unfortunately this isn't like other westerns and instead they wind up in a horrific, desperate situation. This film is great and is a memorable horror movie for the bleak and bloody events that transpire."}, {"rating": "9", "text": "Great characters, setting and acting. A welcome change to both the western and horror drama"}, {"rating": "4", "text": "After a thoroughly exciting beginning, the film drags and becomes extremely tough and boring to watch."}, {"rating": "8", "text": "A movie with a difference in that it combines strong horror elements with a traditional western story. And it works well."}, {"rating": "8", "text": "I loved the mashing of the western and horror genres. It resists the temptation to just be gore-porn; and the horror elements are sprinkled in sparingly and tastefully. The main cast is fantastic, especially Kurt Russell; and the cinematography, costume design etc is excellent. This is the kind of film where you just have to let the atmosphere and the journey wash over you. It's surprisingly light in action, but heavy on atmosphere and characters."}, {"rating": "8", "text": "One of the better western movies I've seen and it's not afraid to show the brutal nature of colonial settler life. Solid performances by all the actors involved, you almost get lulled into a false sense of security by their grit and proficiency until the last 30 minutes or so."}], "recommendations": ["the_harder_they_fall", "blackhat", "the_magnificent_seven", "cube", "the_fly", "body_of_lies", "upgrade", "blade_of_the_47_ronin", "drive", "the_equalizer_2", "color_out_of_space", "bad_times_at_the_el_royale", "us", "the_invasion", "eastern_promises", "a_most_violent_year", "reminiscence", "no_sudden_move", "a_walk_among_the_tombstones", "they_live", "django_unchained", "the_terminator", "hell_or_high_water", "indiana_jones_and_the_temple_of_doom", "moon"]}