{
  "id": 4862,
  "title": "Boogie",
  "starring": [
    "Taylor Takahashi",
    "Taylour Paige"
  ],
  "runtime": 89,
  "genre": [
    "Drama"
  ],
  "description": "Alfred “Boogie” Chin is a basketball phenom living in Queens, New York, who dreams of one day playing in the NBA. While his parents pressure him to focus on earning a scholarship to an elite college, Boogie must find a way to navigate a new girlfriend, high school, on-court rivals and the burden of expectation.",
  "releaseYear": "2021",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/n5xmNu7Lb4IqOahsE8K6W8xBTC7.jpg",
  "categories": {
    "plot": 8.0,
    "acting": 5.0,
    "ending": 5.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 5.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "5",
      "text": "Surprisingly, this is NOT a Rocky-style up-and-comer athlete story. This Chinese-American basketball player (Taylor Takahashi who’s actually Japanese) is already a stand out at his high school. This movie revolves around his hope for a college scholarship on his way to playing for the NBA. His greatest challenges are living up to his traditional parents’ expectations and winning the big game against a rival. This was written/directed by comic Eddie Huang (best known for Fresh off the Boat) and the lead is actually his teammate from a community league. Sadly, it shows. Although Takahashi is earnest (and too old to play a teen), his flatness belies his lack of experience, esp. against the actual actors. To make matters worse, the writing tackles all of the issues with a simplistic approach and the direction is flat. Overall, this feels like a bad TV drama."
    },
    {
      "rating": "1",
      "text": "(Mauro Lanari)Youthful ethnic minorities who, in the grip of a lacerating ambivalence, a \"mixture of covetousness and resentment\" (Alison Willmore of Vulture), aspire to integration with the goals of the American nightmare while despising it."
    },
    {
      "rating": "8",
      "text": "The sound effects are good. The presentation is good. But, the story lacks some tightness. but yes, it is worth watching."
    }
  ],
  "recommendations": [
    "42",
    "fighting_with_my_family",
    "samson",
    "hell_or_high_water",
    "news_of_the_world",
    "freedom_writers",
    "white_boy_rick",
    "eddie_the_eagle",
    "the_best_exotic_marigold_hotel",
    "moneyball",
    "a_family_man",
    "straight_outta_compton",
    "suburbicon",
    "green_book",
    "the_man_in_the_iron_mask",
    "hidden_figures",
    "victor_frankenstein",
    "the_hurricane",
    "the_kid_who_would_be_king",
    "conan_the_barbarian",
    "true_grit",
    "the_last_of_the_mohicans",
    "the_last_samurai",
    "moxie",
    "a_bronx_tale"
  ]
}