{"id": 4891, "title": "Book Club", "starring": ["Diane Keaton", "Jane Fonda"], "runtime": 104, "genre": ["Romance", "Comedy", "Drama"], "description": "Four lifelong friends decide that their lives could change by becoming nasty and reading Fifty Shades of Grey in their monthly book club to get inspiration on how to handle sexual pleasure at an elderly age.", "releaseYear": "2018", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/6ORGBbOA45pfKQXvntPf46NoFGO.jpg", "categories": {"plot": 4.166666666666667, "acting": 4.6, "ending": 5.0, "soundtrack": 5.0, "cinematography": 7.0, "familyFriendly": 6.0, "funny": 7.411764705882353, "action": 5.0}, "reviews": [{"rating": "2", "text": "Nothing could be worse than watching these four fine actors chew their way through the cliches and contrivances to their ultimately unrealistic happy endings."}, {"rating": "1", "text": "Don't see Book Club!Worst movie since Unmarried Woman. Four older actresses titter and mug through terrible cloying, unrealistic, patronizing, infuriating script. The book they read and that transforms their 60- to 70-year old lives is 50 Shades. In one iconic scene, Diane Keaton, with gorgeous face work, terrific body, and shiny hair, is sitting in a shopping mall rest area. She's surrounded by other \"old\" people, all gray and senile, sitting in wheel chairs or slumped down like night of the living dead. This is supposed to be a wake-up call for Diane, who is being courted by an adorable Andy Garcia, a commercial airline pilot. She has to decide if she will go out to dinner with him. You can see her thinking, \"Hey, I'm still Annie Hall, a bit clumsy but adorable and playful. I'll be cute till I die, wearing oversized shirts over a gorgeous body. But if I don't go out and have fabulous sex with fabulous Andy, I'll end up as one of these gray dying lumps.\"So, in summary this horrible movie:A. recognizes successful aging in women only if they are wealthy, well-worked, have lively sexual experiences with handsome older men, and drink expensive wine. B. assumes that wealthy, handsome older guys like pilot Andy Garcia and Don Johnson (the other male actor, who is courting Jane Fonda) will be so attracted to 70-ish women that they will obsessively and creatively pursue them instead of picking up gorgeous young women in bars. C. ignores the actual aging process going on under all those lifts and well-exercised joints, which causes chronic pain, progressive deterioration, and the inevitable losses of friends and loved ones. D. fails to acknowledge the olds who, like many I've met up here, aren't rich and who suffer chronic pain, but remain gallant and funny, while pushing through suffering to help other people, engage in the creative process, or both. E. pretends 50 Shades of Gray is a book.This movie stinks of elitism and perhaps illustrates one reason why Trump won."}, {"rating": "3", "text": "Disappointing film given the cast. Diane Keaton, come on she can do better and will she not do a movie if she can’t wear the same clothes? It was like she kept the same bad stuff from Hampstead. Unbelievable and poor character. Candice Bergen was a bit luckier with her character, but not much. Seriously underwhelming, save your money."}, {"rating": "4", "text": "Look, this is innocent enough of a film, made for women who grew up with these actresses to enjoy watching them share a screen. There are a few laughs to be had along the way but mostly this is a Frankenstein of a movie, with sketches masquerading as scenes stitched together and a script that gives the characters nothing to do. But the core demo likely won’t care, and more power to them."}, {"rating": "1", "text": "Very boring film. Plot is scattered, and seem like a generally pointless movie. writing is weak. certainly not worth the price of admission."}, {"rating": "7", "text": "There is no doubt that if you enjoy watching actors Jane Fonda, Candice Bergen, Mary Steenburgen and Diane Keaton, let alone Richard Dreyfuss, Andy Garcia, Don Johnson and Craig T. Nelson among others this is a picture for you. Check out the trailer and what you see is what you get. Hollywood seems to know only one way to deal with older stars in a picture of aging and that is using Viagra, raunchy lines, not to mention it being ‘shocking’ that ‘people of a certain age’ are still interested, and getting, in sex. You know how each will react to the situations they are put in but each brings that certain something that has made them a star to lines that would otherwise lay there flat.Jane Fonda as a hotelier, Candice Bergen as a divorced Federal Judge, along with long wedded Mary Steenburgen and Diane Keaton as a widow add their own recognized special talents to put a twist on a situation and a smile on your face. You know who will be aggressive, which lady will be awkward, who will be the ‘mother’ of the group and who will be practical and devious in her own way.The men really don’t stand a chance against these formidable women but it is fun to see Don Johnson and Andy Garcia play up the silver fox angle, Craig T. Nelson the ‘what is she up to’ regarding his wife while Richard Dryfuss will sip wine with Bergen and make it fun.  By the way, wine is the unnamed co-star in many of the scenes as it seems to have replaced martinis in the movies.“The Book Club” gives the audience a chance to relax with and enjoy old friends for an hour and 40 minutes. It is sort of a date movie for those over 50 who date though this was a pretty good crowd for a Friday audience, those who probably won’t go to see “Deadpool 2” until next week, like me and Allen.Diane Keaton was the best of the actresses while Jane Fonda’s haircut and color drove me to distraction and not in a good way. Between the actors Don Johnson surprised me the most as I wasn’t a fan of his before but he looked good and made his role interesting. Candice Bergan looks ready to revive her Murphy Brown role!I recommend “Book Club” for enjoying 104 minutes of fun, relaxation and seeing pros at work."}, {"rating": "3", "text": "This movie has a terrible issue when it comes to continuity and at times it feels like you are watching a film set in multiple parallel universes, it punishes the audience for watching it because it is impossible to understand what mistakes are and what are not by half way through. The whole experience ends up feeling like a terrible and long trailer to read 'Fifty shades of grey'. The reason for a three is because there are the odd moments that are fairly funny, but the problem is that this would still be a waste of money and time. In conclusion this movie feels like a waste of the actor's talent but also the audience's time and brain cells."}, {"rating": "8", "text": "What a treat it is to see a quartet of veteran performers doing their best and enjoying themselves at it! That's the stuff of \"Book Club,\" a light, frothy, albeit somewhat predictable chick flick for the mature set, but one that clearly has its heart in the right place and hits the right notes most of the time. Granted, some of the jokes don't land as solidly as they could, and some of the humor is a little on the trite side. But, all things considered, this is still one fine diversion, full of fun, full of spirit and full of life."}, {"rating": "8", "text": "What a fun movie!  I went with lots of ladies and we found the theater jam packed full.  It is one laugh after another in a very steady stream.  Jane Fonda, Candace Bergen, Mary Steenburgen and Diane Keaton are absolutely perfect and funny as four older ladies who find that reading “Fifty Shades of Gray” has kickstarted their love lives.  Each one of the men is wonderful in their role: Don Johnson, Andy Garcia, Craig T. Nelson and Richard Dreyfuss.  There are some hilarious one liners and sight gags, especially with Nelson’s character as his wife tries to spice things up a bit.  So much fun and fortunately, the trailer didn’t give it all away.  Plenty more laughs to be had.  Loved it!"}, {"rating": "8", "text": "I watched this film in an audience of mostly women and there were very few minutes during the film when someone wasn’t laughing.  I thought it was very entertaining and so did everyone else who saw it with me."}, {"rating": "9", "text": "8/10 Review, the film made me cry towards the end, beautiful Hollywood ending filled with Hope. Perhaps a film for the older crowd, but really a delightful film to watch. Plenty of good laughs, and solutions to real life struggles with dating! Fun. Wonderful performances."}, {"rating": "1", "text": "The only thing more excruciating than enduring 90 minutes of the script's inane, tiresome and cliche' gibberish is the disconcerting shock of seeing Hollywood glamour icons looking over 100 years old. That's notwithstanding Jane's bad facelift and processed hairdo. At least it makes her look like she's been professionally embalmed...which is something. If not quite time for a post mortem on the cast, the movie as a whole doesn't even deserve a decent burial. The fact it was produced in the first place is nothing but a commentary on where washed up, geriatric Hollywood stars go to die."}, {"rating": "10", "text": "Let me preface this by letting you know that I am 18 yr old who loves to party and drink. Watching the trailer on youtube made me think this movie would be lighthearted but only relatable to middle aged women. I was so wrong. This movie left me laughing and a feeling of wisdom which can only be imparted by someone who's lived their life. I found myself surprised that I could relate to the mother, who sacrifices her own life to care for other people, even if those people have outgrown their need for her care. The joy of laughing along with the women when they regale their dating adventures made me feel like i was having tea with a bunch of fun aunties.This movie is great because it does not depend on vulgarity for humour. The humour is so subtle and FUNNY because they come from moments that occur in real life. They do this in clever physical metaphors and some really clever banter, which left me impressed and thinking \"I need to steal these lines\". It was amazing to see strong female friendships with all support and no envy. Each personality was likeable and distinct.I recommend this movie for teenagers and above. Everyone will find something to relate to and laugh about. I found this funnier and therefore liked it more than the box-office record breaking Crazy Rich Asians."}, {"rating": "10", "text": "A very good comedy of older women's Friendship,sex and what it takes to attract the opt-set sex."}, {"rating": "3", "text": "Contrary to the film's position on the matter, the \"old people can be crude too!!\" theme remains as dead as these characters' sex lives. It's one step away from Rappin' Granny at most times, but there is a fairly well-done \"friendship among older ladies\" story under all of it.  But don't expect the Golden Girls, these ladies are pure tin."}, {"rating": "5", "text": "A quartet of our finest senior stars (Candice Bergen, Jane Fonda, Diane Keaton & Mary Steenburgen) plays friends who gather for the monthly meetups. When they decide to read \"50 Shades of Grey,\" it sparks questions about their romantic needs and erotic desires. Naturally, they all find men for amorous interactions. If it weren't for the natural appeal of these women, this film would be a total failure. They're not helped by the trite and preachy script, which does feature occassional moments of humor. Still, their spunk shines thru and makes this an amicable AARP approach to late-life sexuality."}, {"rating": "3", "text": "Bill Holderman, first-time director, must've fulfilled his fantasy of making a movie-length version of the Golden Girls series, because that's what this is. Of all the things to focus on in your golden years, Holderman decides these gals are undersexed and in need of a lay. Then the stupidity and predictability of the plot follows. The only \"fun\" I had watching it was guessing the ages of these has-beens and having Alexa tell me how close I was. Jane Fonda looks and moves great for an 80 yr old, though."}, {"rating": "5", "text": "I am glad there are romantic driven movies starring women in their 60s and 70s, I really think Hollywood needs to realize that women don't just stop needing love when they turn 40. This being said, Book Club isn't reinventing the wheel. It's a cheesy, cute movie with great leading women however overall not a great script, not that funny and a strange excessive use of terrible green screened backdrops and bad photoshop on many an old photo."}, {"rating": "1", "text": "Really, really bad. If you watch the trailer, you've seen all the film's laughs. Four very good actresses over-act like rookies. Embarrassing and unrealistic social and sexual scenarios, without any compensating humor. My wife and I kept saying to each other \"nobody would do that\". Not worth watching for free."}, {"rating": "5", "text": "If Book Club can honestly be more than what it brings, then I could honestly consider it okay to recommend. Of course I found the film to be pretty generic for what it brings since anyone can make a movie about a book club and it'll be tons better than what Book Club delivers. These longtime actresses deserved way more than just a generic film."}, {"rating": "7", "text": "'Book Club' was fun to watch and the set decoration was just AMAZE-balls.  Kinda hard to follow sometimes though."}, {"rating": "4", "text": "This is the kind of film that makes me hate my rules about finishing films regardless of their quality. To omit an opinion you must see the finished product, otherwise your opinion has no basis or validity.Why do I say this? It's not because this film is a monumental failure because I don't think it is one, but it simply because it doesn't offer anything for a person like me and I doubt that it will offer something substantial to anyone who already has a broad path in romantic comedies.The story is as empty as it is limited and it's only because of the aptitude of its veteran cast that achieves a certain degree of quality that doesn't help at all to avoid its inevitable and immediate oblivion."}, {"rating": "3", "text": "Don't know why I watched this movie, thought it may have some laughs but none for me whatsoever. I know I'm not the intended audience for the movie but I thought it would have been way better with all the veteran actors/actresses that were involved."}, {"rating": "7", "text": "This is a movie that leads you to think about your love life, especially if you already have an advanced age. It brings a slight comedy, sometimes without goal or without a great message, but it makes us laugh from beginning to end. The cast manages to build good characters, even with a difficult-to-approach topic. Empty and naïve, but still, it makes us laugh and believe. 7.0/10"}], "recommendations": ["13_going_on_30", "sex_and_the_city_2", "last_vegas", "sisters", "the_intern", "bridesmaids", "the_holiday", "magic_mikes_last_dance", "the_hustle", "no_strings_attached", "trainwreck", "spanglish", "easy_a", "don_jon", "the_40_year_old_virgin", "something_borrowed", "hall_pass", "bride_wars", "life_as_we_know_it", "friends_with_benefits", "booksmart", "the_first_time", "the_perfect_date", "27_dresses", "young_adult"]}