{"id": 2039, "title": "Booksmart", "starring": ["Kaitlyn Dever", "Beanie Feldstein"], "runtime": 102, "genre": ["Comedy"], "description": "Two academic teenage superstars realize, on the eve of their high school graduation, that they should have worked less and played more. Determined to never fall short of their peers, the girls set out on a mission to cram four years of fun into one night.", "releaseYear": "2019", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/micaVOa1UZsdzs4fKGA67ZMGOzc.jpg", "categories": {"plot": 4.583333333333333, "acting": 5.0, "ending": 4.666666666666667, "soundtrack": 9.0, "cinematography": 1.0, "familyFriendly": 3.0, "funny": 7.15, "action": 10.0}, "reviews": [{"rating": "4", "text": "This movie is a political correctness piece of trash. To have it compared to superbad is a disgrace. It's sad how the world has become so soft and oblivious to this trendy nonsense"}, {"rating": "1", "text": "This movie is just about pushing terrible political point of views. Just a sad let down."}, {"rating": "0", "text": "Very, very weak movie. Don't bother yourself. Cheap rip off of the Superbad."}, {"rating": "1", "text": "Every time I walk into a movie I have high expectations and every time I see a boring, stupid 'comedy' and don't even laugh once, the first thing I ask myself is \"Why didn't I walk out?\" and the second thing I do is tell myself \"At least I won't see anything worse the rest of the year!\"Sadly I didn't walk out of \"Booksmart\" and I hope it is the worst movie I will see this year! I really have nothing positive to say about the cast except to ask if today's teens are really this vulgar, this dumb or is it the screenplay by 4 writers and the director showing them to be this way?The worst part--and that is saying a lot--is the cringe-worthy performance and lines by Lisa Kudrow as a parent. We won't even talk about the 'father'!Trying to be positive--and not understanding why-- Meta Critic had a 84% rating by critics and 5.6 out of 10 by the audience.Please, please if you see it let me know what YOU think of \"Booksmart\" though you would be smart not to go!synopsisThe story follows Dever and Feldstein's characters, two academic superstars and best friends who, on the eve of their high school graduation, suddenly realize that they should have worked less and played more. Determined never to fall short of their peers, the girls set out on a mission to cram four years of fun into one night."}, {"rating": "0", "text": "This movie is unwatchable, irritating garbage. I had to stop watching after 10 minutes. It was making my eyes bleed. It thinks it's being clever and hip but there is no substance."}, {"rating": "1", "text": "After seeing the very high critic scores, I was expecting to like, and perhaps love, this movie. I love Olivia Wilde, especially her performance in Drinking Buddies.  I was really hopeful about her directorial debut.  This comedy is not funny.  There is no timing, no flow.  The base premise, that these nerds want to party when they realize everyone else in their high school also got into amazing colleges while partying and screwing off, is silly, of course.  But the flimsiness of it, especially because of no follow up, was sad.  We kept waiting to laugh, but every performance was so stilted and every character so stereotyped (the over-the-top, effeminate gay theater boys, come on), we chuckled mildly once.  After an hour, we walked out.  We don't do that.  It also made me think it may be a generational thing.  But I really don't think so. We love these coming-of-age stories, from Superbad, American Pie, Clueless, Fast Times at Ridgemont High, even American Graffiti.  This was just unfunny and bad.I hope Ms. Wilde gets another shot at directing.  But I really hope these ridiculous critic reviews don;t go to her head.  Look at the mixed viewer reviews.  When critic/viewer reviews are so misaligned, something is not right"}, {"rating": "10", "text": "I saw an advance screening of this movie and I thought it was very good.  I usually hate comedies but this movie is fresh, original and constantly funny throughout. Olivia Wilde did amazing for her directorial debut, there's  an underwater scene that is absolutely beautiful. Whenever I thought this movie was going to do something cliche, it flipped the script and took me by surprise.  This movie has a broad appeal and I highly recommend it."}, {"rating": "9", "text": "It's a really good movie, though totally different from any other \"classic\" teen movie - mostly due to the fact that almost nobody is mean to anyone else.  There are no a-holes.  The jocks and popular kids don't inflict physical and emotional pain on the sympathetic smart kids. All that being said, it does a great job exploring the main pair's friendship. And the casting of the supporting cast is right on."}, {"rating": "2", "text": "An annoying fat girl and a lesbian attend Happy, Happy Rainbow High School where everyone is tolerant of everything and everyone and a good 60% of the school's population are gay or transgender or a non-binary something or other. Anyway, teen stuff happens and none of it's particularly funny or original and by the end of it I just wanted to watch 'Fast Times at Ridgemont High' again."}, {"rating": "0", "text": "Trivial. Self-absorbed. Verbose. Superficial. And yet, this waste of film gets 84% critic score with a \"must see\"label. How presumptuous!The problem is not its promotion of lesbianism per se. It's just that this film is only about the navel gazing of two teenagers. You don't need to make a movie to \"send a message\": You write an essay. This has ZERO CINEMATOGRAPHIC VALUE.America is truly sinking right and now left."}, {"rating": "5", "text": "The producers of 'Booksmart' eagerly tried to associate it with 'Superbad' in what is now in retrospect a naked attempt at \"punching up.\"And before you say it, yes, we do know Beanie Feldstein is Jonah Hill's sister.The bottom line is that far too many developments in the story are illogical and far too many of the jokes land with a thud for it to be enjoyable."}, {"rating": "6", "text": "Si entretiene, pero es para viejas, las historias son bobas pero funcionan, y es una apologia a las lesbianas y gays"}, {"rating": "5", "text": "\"Here comes the 1%.\".( 57/100 ).La juventud que la actriz y directora Olivia Wilde presenta en \"Booksmart\" está llena de privilegios ignorantes y celebra los valores más incorrectos que justo la juventud necesita vencer y cambiar.La cultura Pop ha producido films sobre la rebeldía, energía y desenfreno juvenil que, junto a films como \"Superbad\" (2007) y \"Project X\" (2012), solo fortalecen el estereotipo que la juventud americana se ha ganado: una sociedad de derroche y consumismo irresponsable e innutil.Amy y Molly (Kaitlyn Dever y Beanie Feldstein), están a un día de graduarse de la preparatoria cuando se dan cuanta de lo tontas que fueron al estudiar y no salir de fiesta al mismo tiempo, por lo tanto deciden hacer de su última noche la más loca y aventurada de su preparatoria.No es difícil identificarse con esa juventud, todos lo hemos sido y, al menos un poco, hemos sentido los privilegios de pertenecer y los miedos de ser minoría. El problema es que el guión asume que \"pertenecer\" es diversión, alegría y festejo, y lanza a sus actrices a una aventura que, en vez de disfrutar, las convierte en patéticos intentos de retroceder a una actitud primitiva. Asimismo promueve la actitud del exceso, el ceder a los impulsos sexuales y mentales, la desconfianza social y \"soluciona\" la idea de \"comprar amigos\" con romance. Aunque hay una secuencia de animación (que se puede quitar sin daño alguno), la escena que le da valor a la película (e, irónicamente, se enmudece) es un conflicto verbal que muestra el talento actoral de las protagonistas.A pesar de que el film tiene la oportunidad de exponer un drama socio-cultural, prefiere optar por el camino cómico e inconsciente de su misma cultura. \"Booksmart\" es peligrosa y me causa pavor imaginar cuantos jóvenes pueden verla y querer crecer igualmente solo porque es \"cool\". No lo es, hay diferentes tipos de diversión, y entregarse a los impulsos es la forma más irresponsable de vivir.-The youth that the actress and director Olivia Wilde shows in \"Booksmart\" is full of ignorant privileges and celebrates the most incorrect values that the youth needs to overcome and change. The Pop culture has produced films about young rebellion, energy, and wildness that, along with films like \"Superbad\" (2007) and \"Project X\" (2012), just reinforces the american stereotype that youthhood has won: a society of waste and useless, irresponsible consumerism.  Amy and Molly (Kaitlyn Dever and Beanie Feldstein), are about to graduate from high school when they realize how foolish they were by studying and not going out to parties at the same time, therefore they decide to make their last night of high school, the most adventurous and crazy. It is not that hard to identify yourself with this youth, we all have been young and, at least a little, have felt the privileges of belonging and the fears of being an outcast. The problem is that the script assumes that \"belonging\" is fun, joy, and celebration, and throws their cast to an adventure that, instead of enjoying, it makes of them pathetic attempts of behaving in a primitive way. Likewise, it promotes excess behavior, giving in to the sexual and mental impulses, the social distrust and \"resolves\" the idea of \"buying friends\" with romance. Even though there’s an animation sequence (that can be taken out with no harm), the scene that gives some value to the movie (and, ironically, is muted) is a verbal conflict that shows the acting talent of the main cast. Despite the film has the opportunity of exposing a social-cultural drama, it prefers to take the comical and unconscious path of the same culture. \"Booksmart\" is dangerous and it makes me dread to imagine how many young people can see this and would want to grow up just like that because it's \"cool\". It's not, there are different types of fun and giving in to the impulses is the most irresponsible way of living."}, {"rating": "3", "text": "It is like a bland version of Superbad. Is not awful, the leads act very well, but it plays things safe. When you try so hard not to offend anyone with your comedy, is hard to be funny, so the movie falls flat ultimately"}, {"rating": "3", "text": "You think you are watching a movie that makes you laugh, live, love like other high school movies but sorry it won't. Not really so catchy and actually all the points are for Kaitlyn Dever and her extraordinary charm. She's great. I mean her score is 10/10 but other features of the movie should be considered too. So I guess watch it if you are also attracted to her then you won't blame the time you put for it :))"}, {"rating": "0", "text": "Bottom line is that this is not a good story.  Comedy? Well not even close. The actors are good but that does not make a movie good. This movie should not have been categorized as a comedy."}, {"rating": "6", "text": "Don't understand the hype. Mildly funny, maybe 1 or 2 lough out loud moments. Took bits and pieces from every teen comedy done in the past, sprinkled in a heavy dose of modern PC. Should have expanded on the theme it touched on briefly of the obsessiveness to get into elite colleges and whether success or happiness is really guaranteed."}, {"rating": "1", "text": "Thank GOD I didn't pay for this movie to watch it , Its very bad that I cannot stand how people would actually like it , I am aware people have different taste but I am also aware that not all positive FB are authentic some have to be paid for or people doing it as a favor as most messed up movies review lately I got fooled by high rating so many times because of that kind of people not helping out others and kept messing around with fake rating in purpose !!"}, {"rating": "5", "text": "It has some very sporadic chuckles in its first half, flashes of wit, and striking performances especially from the two leads. But other than that, It's neither funny nor original. I have seen quite few films with this theme, or that are classified under this sub-genre (I haven't even seen Superbad), but I already found everything here quite familiar. The plot itself is clichéd, insipid, formulaic, and oversimplified. And you can clearly notice that at every single turning point in the story. And there are a lot in the second half, for it's very overstuffed, messy, and muddled. And that, of course, caused a lot of tonal imbalances.I'm really frustrated because I thought I would see something like Lady Bird, Greta Gerwig's fantastic and highly auspicious directorial debut. But Booksmart seems to think it is much smarter then it actually is. I have to give Olivia Wilde points for making such an energetic and colorful film, though. Also, these flashes of wit I've mentioned above are all due to Wilde's direction. I do think she has a quite promising directorial career.(5.5/10)"}, {"rating": "0", "text": "This is truly an awful film. I can only imagine the writers concocting this story with one message in mind: make these characters quirky and also one dimensional. 'Quirky' is all they have going for them which makes them boring. Sure, there are messages of female empowerment yet it does nothing to propel a meaningful story. Tell a story. Come on. Here, each character broadcasts an over the top persona that is difficult to relate to. Initially, I liked that the one girl had a crush on a skater girl. Yet, we know nothing about her within the first forty minutes of the film. All we know of these highly educated outsiders is they are outsiders. That's it. Each scene only fosters a certain stereotype that is exagerated to the point of dullness. Slut girl acts like a slut. Dumb guy acts dumb. Rich kid acts rich. And the two friends are just two friends who find out the people they looked down on are actually goinst to prestigious schools. Wow, twist... So what is their motivation? To party. That's it? That's it. The whole wants vs. needs of screenplay writing 101 does not even happen here. They want to prove to people they don't care about that they can party as well. I mean, if the beginning of the film sets these two up as individuals who could care less about what others think of them, why would this matter? Their only character trait is they are indifferent to the opinions of others. And that is shattered because the movie needs to happen. These are screenplay ideas running around as supposed characters and nothing else. And on their journey they meet other purposelessy strange characters. There have been wonderful female friendship films with fleshed-out, wonderful and quirky characters. Think Romy and Michele's High School Reunion. If you want female empowerment and self-awareness, look no further than the seminal Thelma and Louise. I have loved three seasons of Glow on Netflix mainly because the writers care to build on the dynamics and relationship of the characters. But I could not make it through this forced and over the top film. I didn't laugh. I rolled my eyes as it felt like this film had the concept of something interesting and fun without actually following through on it."}, {"rating": "6", "text": "Booksmart tries it's best to be this generation's Fast Times and Ridgemont High or Super Bad, but ultimately fails in it's execution."}, {"rating": "6", "text": "I really looked forward to seeing this movie and really wanted to love it.  Unfortunately, I did not love it.  Can’t say exactly why.  But, it just felt so over the top at times and unrealistic.  I loved the relationship between the two girls.  Loved their chemistry, but felt a lot of the movie didn’t ring true for me.  It was very raunchy in parts and the kids behavior was so stereotypical in places, it was painful to watch.  Just didn’t ring true with me."}, {"rating": "4", "text": "I knew this film was a comedy, and it's got a few hilarious bits. Still, as a coming-of-age study of friendship, I thought it would  be more serious and thoughtful. Instead it's a mixture of Clueless, Animal House, and American Graffiti, only on speed and set to the beat of a jackhammer. That is, until the third act, when we learn everybody's really a nice person. Oh, and it ends at an airport, which I've never seen a movie do before. To call the story formulaic would be understating the case. Not a bad film, but nothing special at all, in my opinion."}, {"rating": "4", "text": "As it happened at the time with Get Out, then with Crazy Rich Asians and now with this film, it's quite clear to me that American critics are desperate to be inclusive.I comment this because after finishing this film I found myself quite confused because many of the opinions that I was reading and that I was finding about the story of this film made me ask again and again what those people saw that I didn't.Olivia Wilde basically made Superbad female version and that's not her fault. Well in a way it is because she chose that script to debut as a director but the rest is the fault of the writers because they were the ones who implemented this story but analyzing it, you will realize that you're practically watching the same film. The only difference is that the main characters in this case are women and they don't have a third character to finish the jokes like Fogell.Although what interested the guys in Superbad was to get laid, the only difference with these girls is that they try to have fun considering that they apparently think they wasted their time in high school studying to the fullest trying to enter a good college.Because apparently studying hard and not living at parties with drugs and alcohol is only a crime of the nerds. What a cliche isn't?But it doesn't stop there. Once the story makes clear where is going, the path that follows is saturated with clichés until the ending.I don't understand in what way anyone would tell me this is a fresh film, that it reinvents the genre, that it brings something new to the table because I didn't see it anywhere.Does that mean it's a bad film? Actually bad wouldn't be the word I would chose but irrelevant.I cannot deny in any way that more stories are needed with female characters, which obviously need more films directed by women.That the voices of these women should be delivering strong stories and in general terms Booksmart has some of those things I mention.The director is a woman, the main characters and screenwriters too and I applauded they have that opportunity and that they have the forum for people to see and hear their work but don't disguise the importance of that proposal with the results delivered because I personally think that Booksmart has nothing original or new and that isn't necessarily a bad thing because how many film exists that repeat thematics? However, most of the time that is stressed and criticized and I don't see why in this case it was different and it became acclamation."}, {"rating": "1", "text": "Ok, did Annapurna pay people to write good reviews about this film or am I in a twighlight zone where potty humor and over the top charecterizations of real humans is now the norm. This movie was bad in so many ways I don't know where to begin.I suppose I should be supporting this film cause of the lack of female driven stories and women directors getting their shot in the industry. But I just can't get behind blatantly bad material with obvious jokes and and wackadoodle cliche charecters. Movies like Lady Bird we're funny, compelling, and original. This is what you get when American Pie and not another teen movie had a baby in 2019."}, {"rating": "0", "text": "Felt very forced. Comedy can never have someone plugged in to check a woke box, and this was no different. Comedy is organic. Comedy is real. Woke is the antithesis of Joke."}, {"rating": "0", "text": "I hate this movie. If there was a number lower than 0, I would have chosen that instead. Yuck."}, {"rating": "1", "text": "Have lost confidence in the pro reviewers because of this poor excuse for a teen story. We left after 30 minutes - I went back the next day to finish (thank you Mr. Manager) the film and it went further down the drain. If this is an accurate view of our high school kids today, we are in trouble. I do not think it is accurate from what I see in schools. The two girls even look embarrassed using the f word so much. Add lousy camera work, and you get a 1 because the theater was comfortable, though the story could have been worthy of the effort. I suggest rating films by the number of f words from now on."}, {"rating": "3", "text": "Booksmart is a clinic in overacting to prop up cliched material instead of inventing something new. Nearly the entire supporting cast was a cringe-worthy caricature that blared the stereotype to obnoxious levels. I could not figure out why for all smart hype of the film did it take such predictable and worn-out paths using 2-3 braincell supporting characters.  The filmmaker may have updated the time period but really offered nothing new in terms of coming-of-age insights. It's sad because I was kind of excited to see this."}, {"rating": "3", "text": "This movie was supposed to be a female version of “Superbad” which I liked a lot.To be honest, there are few comedies that I really enjoy. But they do exist.“Booksmart” was not one of them. I could see artistic capabilities in protagonists’ performances but for the most part they were over-acting. Besides, they should not play high schoolers. They looked early thirty to me. Jokes were not that funny, and directing, though quite energetic was mediocre at best.Do not believe critics and do not waste your time and money."}, {"rating": "10", "text": "I absolutely loved this film. It had a banging, funky soundtrack like Superbad and it's basically that film with chicks but actually it's even deeper in terms of it's characters and manages to be politically progressive without being either patronising or daft about it. Put it this way, it's a bit better than 'The Hustle!' I found it so memorable and unique in tone. The girls have an awesome chemistry on screen and it's just a joy to watch."}, {"rating": "10", "text": "Pitch perfect in every way. The best high school film hands down and I’m a 34 yr old woman."}, {"rating": "8", "text": "In 2007, a little coming of age-high school comedy, with a very modest budget of $20 million took the coming of age, modern high-school comedy canon by storm, and has yet to be trumped in over a decade. That little movie that could was Superbad, a film that was written by real-life best friend Seth Rogen and Evan Goldberg, who, went on to becoming two of the most successful and prominent comedy writers of our generation. Generating real-life stories based on what happened to them, including the infamous period-blood dance scene, the cocaine-karaoke scene and other incredibly funny scenarios that we thought could ever happen in a million years, the two writers have a knack of garnering insatiable laughs with well-received, cortically and commercially successful films. Luckily for us, Superbad was a film that starred two breakout stars in Michael Cera and Jonah Hill, who would go on to becoming staples in the comedy world as well as the Seth Rogen’s comedy empire. But like all good things in this world, change is upon us. With the recent influx of female voices being heard and stories being told, we fast forward twelve years, and finally have our very own, female-centric Superbad with Booksmart. And as if destiny would have it, ironically enough, this kick-ass female story of missed opportunities and revelations delivers endless laughs, sometimes cries and funny enough, stars Jonah Hill’s little sister Beanie Feldstein. How’s that for a coincidence?Directed by OIivia Wilde; yup, the actress of Tron, her and Drinking Buddies tackles directing duties and nails her debut feature film with so much heart, love and authenticity that Booksmart feels like a veteran comedy with constant one/two punch laughs, confidence and endless emotion. Stylistically relevant, adapting much of the real-life comedy that made the Rogen/Apatow comedies of the 2000s so successful, Wilde directs a script that has been in development for over a decade to reflect so many of the many truths of high-school youth today. Making the film contemporary with scenes including Uber, social media and of course implementing characters that aren’t only heterosexual, allows the film’s fresh vibes to come naturally off the screen, even if Amy and Molly’s (Kaitlyn Dever and Beanie Feldstein) cool personalities don’t.Booksmart is a movie that we have been waiting for, for a long time. The film’s hook may be a completely authentic female take on the high school experience, produced by Annapurna Pictures, headed by Megan Ellison, directed by a woman, starring two promising young female actresses, written entirely by women and edited by a woman, but I can assure you, these highly feminine factors are not the only reason to visit your multiplex this summer. Aside from being a female-centric comedy, after everything is said and done, it is a comedy, and I am here to attest to the fact that, it is really funny. Aside from the star-making performances of actresses Feldstein and Kaitlyn Dever, writers Susanna Fogel, Emily Halpern, Sarah Haskins and Katie Silberman, deliver quippy, snappy and hilarious dialogue that highlights the very different, yet strikingly similar high school personalities of their characters, without making them caricatures of figures we have come to expect from the high school comedy genre. Each character depicted in Booksmart are culminations of so many different personalities; mixing gender, sexuality, religions, class and cultures into real life characters that not only become relatable, but also become memorable. Booksmart highlights that jocks JUST aren’t jocks, and the gay students JUST aren’t gay. Every person depicted in the film is a version of someone we all knew or currently know in real life.Although there is an array of comedy from supporting characters, the majority of the laughs stems from the bond and chemistry between our two amazing leads. While Dever and Feldstein bring true laughs to their characters Amy and Molly, unfortunately, both Amy and Molly feel like they have been missing out on their high school shenanigans. So, on the last day of high school before their graduation, Amy and Molly decide to go for it, and indulge in all the craziness that is high school, in one night. As expected, hilarity, craziness and debauchery ensues, and the two bets friends find themselves in very different places by the end of the night.Booksmart is easily the funniest and smartest comedy of 2019.Raunchy and totally inappropriate in so many scenes, Wilde’s Booksmart is a winning combination of American expectations for comedy films with many social expectations and commentary. Even though Amy and Molly got into their desired schools, working and studying their butts off for the whole course of high school, when Molly finds out that the slutty cheerleader archetype, the stoner and the jock all got into the same schools, becomes a little bit of a bittersweet realization."}, {"rating": "10", "text": "Best movie I have seen in years. Tender, hilarious and whip-smart. Olivia Wilde has proven herself to be a capable and visionary director. The two starts are charismatic and lovable. The jokes are laugh-out-loud funny. Just the right mix of raunchy and sweet!"}, {"rating": "9", "text": "Well developed characters in a hilarious counterpoint to Superbad, but you have to allow it license from the literal for it to work."}, {"rating": "10", "text": "Good highschool comedy, with good music and easy to follow comedy with the all everyday embarrassed, falling down getting up, quarrels with a wink to reality, choices made and not made, and the regret off never made choices. that all in a comedy, a comedy that need not a lot of humour to understand, easy watching, good mimic and the actors living in the role so that the comedy is on a silber scale presented,"}, {"rating": "2", "text": "i really don t get why this film is championed by critics, the characters were annoying , plot is weak as well as non sensible and we have seen this type of film a million times.   is it because it starring and directed by women ?give me a **** break"}, {"rating": "10", "text": "I personally love this film. This is very similar to Superbad and other coming of age comedies, but has it's own quirky sense of humor that really works fo the tone they're going for. Would highly recommend."}, {"rating": "10", "text": "One of the greatest comedies of 2019.  a vivid and imaginative hangout movie with great characters, AND a strong directorial debut by a great actress as well. Don't listen to haters. Loved this one so much - watched it twice in one day."}, {"rating": "8", "text": "Charming, amusing, and well-acted, \"Booksmart\" is a surprisingly solid entry in the coming-of-age genre. Olivia Wilde is confident in her directorial debut and the cast is excellent as well."}, {"rating": "7", "text": "Of course there's a lot going on here in Olivia Wilde's debut directorial Booksmart that just took me by surprise as I got mauled to hypnotic pleasure with the charming and raunchy soundtrack that this sweet little story about friendship and \"having fun\" is picturized on and I can't deny how much fun this would be if you were to catch it with your best buddy. TN."}, {"rating": "10", "text": "One of the greatest coming-of-age movies of the decade, truly understands the generation it's trying to speak to. I wish every movie about teenagers had that much RESPECT for its subject."}, {"rating": "9", "text": "As said Cindy Lauper: girls just want to have fun. The amusing one night adventure of two geeks who wants to spend the best before of the prom. The sequence of hallucinating dolls justify the ticket price."}, {"rating": "7", "text": "que puedo decir es una pelicula que retrata lo aburrida que es la juventud actual, no es una mala pelicula pero no esta al nivel de SUPER BAD, podria decir que esta hasta por debajo de AMERICAN PIE, su ritmo es lento, sus momento graciosos son forzados aunque si tiene algunos que valen la pena, pero en conjunto creo que esta bien para dominguear, pero no se me antoja volver a verla, el unico personaje que vale la pena es GIGI y acabando de verla preferi ver REVENGE OF THE NERDS"}, {"rating": "8", "text": "Had the potential to be just about the most leftist-driven “inclusive” comedy meant to push horrible political views, and there’s a bit of that, but ultimately it didn’t have a significant impact on the movie, so I didn’t mind. I thought it was pretty funny and about as original as a teen comedy can be nowadays. I like the two lead actresses, and the supporting cast is great too. One running joke about an insane girl at their school had me cracking up every single time it came up, it was hilarious. I looove the ending. Don’t immediately disregard it or degrade it because of its politics, like I almost did. You might miss a pretty entertaining movie."}, {"rating": "8", "text": "The story is realistic and unrealistic at the same time, and it's a damn good time at the theater. It improves upon recent entries into this sub-section of the genre and is one of the smarter comedies of the year."}, {"rating": "9", "text": "Raw and masterful comedy. (Plus points for the Apple commercials soundtrack.) I can't wait to see what Olivia Wilde does next."}, {"rating": "10", "text": "All of this worked for me. The characters are original and fresh, the action doesn't stop for a second. The performers are clearly having the time of their lives, there are jokes for days but it's also emotionally resonant and doesn't feel trivial. Super fun and great. If you haven't seen it yet, don't wait!"}, {"rating": "1", "text": "Just a lesser version of Superbad if we are all being honest. It's forgettable and is only gaining such praise due to today's push for feminist content."}, {"rating": "10", "text": "Fantastic coming of age movie. Very fun watch with compelling characters. Already feels like a classic."}], "recommendations": ["the_duff", "i_feel_pretty", "blockers", "moxie", "easy_a", "me_and_earl_and_the_dying_girl", "17_again", "the_perfect_date", "life_of_the_party", "how_to_be_single", "superbad", "sisters", "knocked_up", "dora_and_the_lost_city_of_gold", "the_cobbler", "palm_springs", "moonrise_kingdom", "good_boys", "10_things_i_hate_about_you", "the_40_year_old_virgin", "3_idiots", "juno", "burn_after_reading", "hall_pass", "no_strings_attached"]}