{
  "id": 4865,
  "title": "Borat: Cultural Learnings of America for Make Benefit Glorious Nation of Kazakhstan",
  "starring": [
    "Sacha Baron Cohen",
    "Ken Davitian"
  ],
  "runtime": 84,
  "genre": [
    "Comedy"
  ],
  "description": "Kazakh journalist Borat Sagdiyev travels to America to make a documentary. As he zigzags across the nation, Borat meets real people in real situations with hysterical consequences. His backwards behavior generates strong reactions around him exposing prejudices and hypocrisies in American culture.",
  "releaseYear": "2006",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/kfkyALfD4G1mlBJI1lOt2QCra4i.jpg",
  "categories": {
    "plot": 6.333333333333333,
    "acting": 4.666666666666667,
    "ending": 8.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 4.1525423728813555,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "10",
      "text": "A classic. If you have to ask, you will never know."
    },
    {
      "rating": "9",
      "text": "Not funny? insults a foreign country? insults people? are you really going to complain about these things now? The people that say all these things are people that really are not into movies, because that thing of insulting others has been the killing punch of all comic movies, all comic movies insult other people and other countries. Remember Charlie Chaplin making fun of Hitler? or Team America making fun of China? come on!!! and other dozen movies that come to my mind. Or how about the whole country making fun of their own elected president on national media (George W. Bush) because he was holding a book upside down! I say hypocrites. Leaving my aggravation aside, the movie it's just daring, very brave and smart. It's not perfect but it sure was one of the best comic movies of its time."
    },
    {
      "rating": "9",
      "text": "Great Film, very cringe but overall great. Find the 0's quite amusing, as it appears most bad reviews are from people angry at the world or offended very easily."
    },
    {
      "rating": "9",
      "text": "Raunchy, sick, and somewhat disturbed, Borat is full of laughs."
    },
    {
      "rating": "9",
      "text": "The most important aspect in the film is the way in which Cohen completely points out the stupidity and ignorance of some of, if not most of the genuine people throughout the film. He helps reveal that in the present in which we live there is still an alarming ammount of racists who still flaunt their completely brainless views."
    },
    {
      "rating": "10",
      "text": "I feel like a horrible person for enjoying this movie, but I can't help it! Borat is the funniest movie I've seen since Anchorman! It is niiiiice!!"
    },
    {
      "rating": "10",
      "text": "I don't understand why people are rating this movie at zeros. This movie is superb. It is a non stop laugh fest. If people are offended by the anti-jew-ness in the movie, then THEY HAVE NO SENSE OF HUMOR. Baron Cohen is jewish himself for crying out loud! There is no other movie like it, and once you see it you feel the need to see it again and again. What really surprises me about this movie it that it shows the true America. My friend was laughing so hard after just 10 or 15 minutes, she spilled her drink all ofer herself. Borat is truly Baron Cohen at his best."
    },
    {
      "rating": "10",
      "text": "Borat is the funniest movie ever made. I will, for the rest of my life, be quoting the hilarity that ensues in this unique and magically ingenious farce."
    },
    {
      "rating": "7",
      "text": "It started off so good and it is funny at parts but it just gets so stupid that you cant look past it. A lot of wasted potential in this film but its still solid."
    },
    {
      "rating": "8",
      "text": "A downright dark, disgusting and hilarious comedy from Sacha Baron Cohen. His humour has no boundaries and it is again one of my favourite kinds of humour in the world. The story needed to pick up at a few moments but in the end a very enjoyable comedy."
    },
    {
      "rating": "10",
      "text": "One of the best movies of all time, Borat: Cultural Learnings of American for make benefit glorious nation of Kazakhstan is a hilarious movie, while making many statements in terms of racism, sexism and more. I am happy that this movie is such a success and that it further made Sacha Baron Cohen the legend he is today! Great success! Very nice! I wouldn't recommend his film if you get easily offended though..."
    },
    {
      "rating": "10",
      "text": "Intelligent and open-minded people usually lough. Others feel offended    ."
    },
    {
      "rating": "9",
      "text": "Dang, that title's so long it can take up most of a review when you're done typing and it still requires you to enter the 150 character limit. With Borat, nothing can make America look incredibly great-looking towards Kazakhstan."
    },
    {
      "rating": "9",
      "text": "Borat is a different take on a comedy, and something that's never been done before. It's complete with tons of humor that had me rolling in tears from the film, a rare thing for me. Definitely see Borat if you want to experience a different take on a comedy!"
    },
    {
      "rating": "9",
      "text": "HAHAHAH yeah this movie is offensive , but if you don't get offended you whill die of laugh , its those comedies you will remember for many years!!!!!!!!!!!!!!!!!!!!!!!!!!!"
    },
    {
      "rating": "10",
      "text": "By Far One Of The Funniest Movies I've Ever SeenSacha Baron Cohen Nails Every Single Scene In This Film."
    },
    {
      "rating": "10",
      "text": "One of my favorite comedies ever! Sacha Baron Cohen's best comedic creation Borat, will make you laugh like no other. Definitely one of the best satirical comedies ever."
    },
    {
      "rating": "9",
      "text": "I absolutely love Borat.   It’s so thought out  that the humor lands perfect every time."
    },
    {
      "rating": "10",
      "text": "It's a little genius of a comic film with a genius comic behind him. Baron Cohen somehow mixes the ridiculous with the believeable to make people think he really is Borat and then makes the American people look stupid and foolish. But is there some dark, underlying, non-comic theme here? Maybe America isn't such a great nation as we all like to think."
    },
    {
      "rating": "8",
      "text": "Jagshemash! \"Borat: Cultural Learnings of...screw this\" is a offensive movie, thanks to the skillfully annoying 'clown' Sacha Baron Cohen, that will create massive haters for its extreme mock/satire. But, as a hater of the movie, I knew that the elusive film wasn't lying about their greedy, selfish, unfriendly portrayal of us; they were correct of our foolishness."
    },
    {
      "rating": "8",
      "text": "Like watching a clown getting into a car crash, \"Borat\" is hard to watch, yet impossible not to watch. In the end, it proves to be an unbelievably amusing mockumentary."
    },
    {
      "rating": "3",
      "text": "(Mauro Lanari)Scatological humor with some allusions to QAnon.Scatological humor with some allusions to QAnon."
    },
    {
      "rating": "0",
      "text": "I HATED the movie, and I laughed all through it. Interestingly, despite it is humorous, it is degrading. I hated it because it's low-grade humor: bodily function, bathroom humor; bigotry; shock-jock-type of appeal. It is reminiscent of Andrew Dice Clay and Howard Stern. It's cheap. We, as a society, can do much better, and we have in the past. I can appreciate the skill used in compiling the film for what it is, but the degrading status yet remains. There are higher forms of humor, more appropriate for humankind. Someone said it better than I can: \"A culture is only as great as its dreams, and its dreams are dreamed by artists. When the level of existence of the artist becomes impure, so becomes impure the art itself to the deterioration of the society.\""
    },
    {
      "rating": "0",
      "text": "Am I missing something? I understand that this was a sarcastic spoof of a very small country by an English Jewish actor who is using bathroom humor to make his point. Why pick on this tiny country and make all its citizens look like fools? He could have used a ficticious country but to denigrade this small country is wrong. The jokes were cute at first but then became painful to bear. For young males to hail Borat as a King is bad enough but to see the critics review this trash as if it were better than Gone With The Wind is a bit too much. This documentary-comedy is simply awful in my opinion and way too long. Very much forgotten after I left the theater."
    },
    {
      "rating": "0",
      "text": "Perhaps those of you giving it high marks don't understand that publicly insulting others is not funny at all. And yes I can laugh at myself. But extreme cruelty and then goading innocent people into making fools of themselves is not my cup of tea. If it's yours then fine but don't speak for others. Just not funny."
    },
    {
      "rating": "3",
      "text": "Mean-spirited beyond the bounds of necessity, this film incriminates itself as being part of what is least admirable in modern society."
    },
    {
      "rating": "3",
      "text": "A huge disappointment. The only laughter I had was in the re-telling to people who hadn't seen it yet. Watching it was uncomfortable."
    },
    {
      "rating": "1",
      "text": "This movie wasn't funny at all. I cant understand the high scores."
    },
    {
      "rating": "3",
      "text": "Want to see a movie that your mommy and the evil government doesn't want you to see? Then prepare to wet your diaper in glee because its Borat. Believe it or not, I actually saw this one with my parents. I remember that day it was at the cheap theatre just in case it sucked and we got our moneys worth $1 but I can never replace the time lost. To start off, the jokes weren't funny and repetitive a bad combination in my book. The running joke is that he is from Kazakhstan and doesn't know much about America which is totally ignorant because... the funny thing is.... people in Kazakhstan know more about America than Americans know about Kazakhstan. Sometimes, it seems that Ali G, pulls down his pants and shits on the culture which is as insensitive as the \"American\" culture Ali is trying to portray. After the movie I didn't even have to ask my parents what they thought, they straight up said,\" Maybe if you cut out all of the story you could have put it on a crappy version of SNL, Madtv perhaps, and spared everyone of the story.\" That was my dad... My mom,\"It seems like they put all the best jokes in the commercials, which could have been on MadTv as a fake commercial.\" And I said,\"Ya, the movie based itself on a joke that just sucked.\" And they both concluded, \"Ya, we kinda saw that, we knew it was going to suck, we just wanted to see the movie that was supposed to be revolutionary.\" (\"Ya that movie was pretty forgettable,\"... \"What movie?\" And we all laughed) that part didn't actually happen but it pretty much summed up how we felt. Its actually funny I wasn't going to see the movie until my parents took me because I didn't want to see the movie that spawned, \"High Five\", \"Great Success\", and \"Very Nice\" the phrases I heard everywhere too many times and I didn't think were funny at all. And it seemed like everyone was watching it because it was controversial. Why did I give it a 3? I think that the movie actually tried to make a good joke and completely failed in execution."
    },
    {
      "rating": "3",
      "text": "To the people who claim that Borat 'exposes racism and bigotry': Borat insults and ridicules everyone equally; yes, he plays off the racism of certain people, but he's just as rude and mean to people who are very kind to him. The fact is, Borat is an equal opportunity a**hole, and you cannot use his isolated attempts to goad racists as a backdrop for the whole movie, because it's not a focal point. This movie is repulsive and lowbrow-- in other words, typical American humor."
    },
    {
      "rating": "1",
      "text": "Parody aside, this movie is racist to the core. The humor is crass and humiliating--and purely there for shock value. There is nothing intelligent about this movie--and satire is supposed to be somewhat smart, at the very least."
    },
    {
      "rating": "5",
      "text": "Expected more from reading the reviews - still found a good few laughs in there - just not enough to recommend it to anyone else."
    },
    {
      "rating": "5",
      "text": "Weak. Dated and unoriginal. These are the same themes he's explored for 10 years now."
    },
    {
      "rating": "0",
      "text": "Horrendous, with glimpses of adolescent humor."
    },
    {
      "rating": "1",
      "text": "Horribly crude. Not funny, just stupidly crude."
    },
    {
      "rating": "3",
      "text": "I can laugh at gross humor along with the rest, but I did not laugh much at this. I even reflexively put my hands up over my eyes at one point, something I cannot ever recall doing in a movie. I just didn't appreciate it. Maybe I'm not as smart as the rest, or maybe it isn't as valuable as people are saying."
    },
    {
      "rating": "3",
      "text": "a cross culture JackAss clone. a little of the Emperor's New Clothes going on here because i think everybody has heard the hype and are afraid to be labeled not hip and admit they think it was stupid."
    },
    {
      "rating": "5",
      "text": "Shocked to say the least, not only at the risk this movie takes but at its reviews. OVERATED"
    },
    {
      "rating": "3",
      "text": "Obnoxious movie, only a few funny moments, I found myself more upset at the stupid comments Cohen made rather then laughing at the jokes he attempted to create out of the silly rascist, antisemtic comments. Also he is also speaking Hebrew, Beth C. In conclusion, a waste of money and time. They try too hard. watch the tv series though, it's very funny."
    },
    {
      "rating": "0",
      "text": "Anyone who thinks this movie is funny or good should seriously check into a facility. First this movie is crude, makes fun of every ethnic and minority in so many crude ways its not even funny but Borat seems to make more crude jokes and jesters about jews throughout this movie thats sickening. Aside from the large anti-semetic lines, fecal humor and defacation is obviously a huge draw for the sickos who called this trash a movie. But the country he is from, Kazakhstan, should truly hate this man. How this movie was a hit is beyond me."
    },
    {
      "rating": "0",
      "text": "Offensive and boring."
    },
    {
      "rating": "3",
      "text": "Perhaps I saw a different movie than the critics did. The movie I went to was in no way outrageous or funny or satiric. The movie I saw was mind-numbingly derivitive and only funny for a collective 7 minutes. I'll give this a three simply for the cringeability of the first part of the rodeo segment (the 'national anthem' wasn't funny at all) [1 point]; the gun purchase [1 point]; and the nude wrestling and ensuing nude chase [1 point]. That's it. Youtube those parts and you'll have seen the entirety of the movie's funny."
    },
    {
      "rating": "5",
      "text": "This movie was hard to watch, not only because of some of the more rather tastless scenes, but the exposure of some of the dark and disturbing happenings and attitudes in our own country. The film had an oppurtunity to be smarter, but in this day and age where simple-minded humor is depicted because Scary Movie/American Pie types dominate, it fell flat. However, it was still enjoyable, but only as a rental. The film runs only on shock value, and once you know when things are going to happen, the feeling is gone. However, despite several leud scenes and gags about bodily waste, the most disturbing parts of the film were most of the unsuspecting victims. Several scenes (A high class southern dinner party on \"Secession Ave\"; an antique shop that is pro-Confederate; a rodeo in which much of the audience is depicted as racist; a Senator and Supreme Court Justice at a Pentacostal gathering; several schovanistic college students and expressing their views) show a darker side to American society, as well as show that Americans do not truly have a centralized culture; many of the locations and their populations vary differently, as seen in the film. Unfortunately, the film does not focus on this the way it should, instead, as stated earlier, choosing to stir up some controversey. However, the best thing about works like this is that it can really help to point out people who are unable to grasp the concept. I am not saying everyone who hates this is an idiot, some of you have very good arguments on why the film is stupid (Ray K, Morgan G). However, a lot of you should sit out on this one. And for the record, and I am suprised there are acutally people who do not know this, but Sacha Baron Cohen, the actor that plays Borat, is in fact, Jewish. Also, this movie seems a little far-fetched. Unless this film was shot after each time he paid his bail, it was most certainly staged in order to broadcast Cohen's personal views."
    },
    {
      "rating": "5",
      "text": "Borat has some excellent moments, especially where it takes a moment to point out the ignorance and hypocrisy that permeates America. All in all, though, it is just a movie centered around bathroom humor and American's desperate desire to be on television. It was, to me, a painfully long and embarrassing film that was only moderately funny."
    },
    {
      "rating": "3",
      "text": "I smiled at some of the clever bits and chuckled at an occasional funny scene, but this is not a bring-tears-to-your-eyes. I go back to Brother Dave Gardener and Richard Pryor who did satire that made you laugh outloud."
    },
    {
      "rating": "3",
      "text": "I really disliked this movie a lot, but a couple of parts made me chuckle a bit!"
    },
    {
      "rating": "5",
      "text": "High expectations, big letdown. While it has its funny moments, it dragged at times. And dragged. And dragged. Surely Cohen could have come up with more funny stuff--or edited some of the lulls out--to fill the whole running time. If you're a fan of gross-out comedies, you'll like this."
    },
    {
      "rating": "3",
      "text": "Some funny moments but completely runs out of steam with about a third of the fim still to go. Very overrated unless you checked your brains at the door or had a lobotomy. This works as a short skit but not as a feature film. Avoid."
    },
    {
      "rating": "3",
      "text": "Not very good, I'm afraid. A few laughs arise from some of the absurd politically incorrect situations, but mostly it boils down to sub-frat boy humour about racism and fisting, or occasionally incest, with lots of dull interludes where people have pretty lame set-up jokes played on them apparently without their prior knowledge. Sacha Cohen can think on his feet as a comic actor (nothing great, but he improvises pretty well) and the character who played his Kazakhi sidekick was quite good as well. But overall the film is not that funny, and not that interesting to watch, if you want an assessment not imbued with hype. Middle America may not have seen this sort of humour before, but the rest of us have. Anyone interested to see how gauche comedy can be done with a good deal more wit and panache and genuine laughs should track down the videos of the Australian Norman Gunston shows of the 70's and 80's. There were more laughs in the ads for those shows than in the whole of Borat."
    },
    {
      "rating": "5",
      "text": "Definitely funny but a one time see for sure."
    }
  ]
}