{
  "id": 1109,
  "title": "Boss Level",
  "starring": [
    "Frank Grillo",
    "Mel Gibson"
  ],
  "runtime": 94,
  "genre": [
    "Action",
    "Science Fiction",
    "Thriller"
  ],
  "description": "A former special forces agent is trapped in a time loop and relives his death over and over again. To escape the terrible situation, he must track down those responsible and stop them.",
  "releaseYear": "2021",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/i6QFXv4lZyxRMknH0EDkCIz02XP.jpg",
  "categories": {
    "plot": 6.714285714285714,
    "acting": 6.9411764705882355,
    "ending": 6.333333333333333,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 7.4375,
    "action": 6.931034482758621
  },
  "reviews": [
    {
      "rating": "8",
      "text": "This movie was great!  It's pretty much Edge of Tomorrow, with a completely different setting and story.  Loved it.  The main character is a smooth dude with a great sense of humor.  Pretty good acting from a muscle bound stud whom I don't even know if I've seen in any other movies before, but he was perfect for the role.  Nonstop action and it is definitely not b rated film making."
    },
    {
      "rating": "9",
      "text": "Fun at the helm, Franck Grillo provides a maximum in this role.Does not take itself seriously and fully assumes its role of popular entertainment.A film that has unfortunately been too rare since the 80s . Good achievement by Joe Carnahan Let's go \"Level 2 Boss\""
    },
    {
      "rating": "7",
      "text": "I am a sucker for these Time loop movies. So when I heard there was an R rated action time loop movie, I was already sold. The premise is simple \"A retired military operative finds himself in a never-ending time loop on the day of his death\". So is this a fun entry in the genre or a loop you're going to forget?Firstly, I like the premise and idea behind it. Revenge stories aren't rare and stories, where the main character is hunted by assassins, isn't rare either. A time loop story containing both of these is relatively unique though and it makes you wonder why it wasn't done earlier. I also really like the video game motif of Boss Level (2021). Throughout, the movie it is frame like a video game with attempt numbers and him trying to memorize all the timings. It makes it quite fun as we go along with him as he learns more in each attempt. Although, the story isn't told linearly as when it begins he is already on over 100 attempts. There will be a lot of scenes referring to previous attempts before going back to the present attempt but this is never jarring in any way and is handled fine.Due to the R rating, we get some great violent scenes such as seeing our main character, Roy Pulver played magnificently by Frank Grillo, get decapitated or shot multiple times or even blown up. There are very fun deaths in Boss Level. There are also some high energy and cartoony action sequences from a pretty ridiculous car chase, shoot-outs and even a sword fight that are an absolute blast to watch. I also really enjoyed the dark humour such as our main lead getting annoyed with certain ways of dying since it takes too long. While there is a lot of chaotic fun throughout, there is also some heart in the story. Roy Pulver does get a character arc and there are some sweet moments between Roy and his family. The writer and director utilized the time loop idea effectively for a key part of the story and funny moments. However, for a movie that is only 100 minutes, it is baffling that there are so many parts where the pacing slows to a downhill. After an amazing 10 minute intro, it then decides to do the entire flashback right after and it lasts WAY too long. Every scene concerning Jemma Wells (Naomi Watts), Roy's wife, is just very boring to watch and this isn't down to Naomi's performance or anything. It's because the scene is meant to give one important info but is dragged by meaningless dialogue that is just padding the run time. Another example is a monologue from the villain Clive Ventor (Mel Gibson) about some snake just to amount to \"don't bring visitors Jemma okay?\". Going from high energy action scenes to these slow-paced talking scenes brings the movie to a standstill, especially if the talking scenes don't have enough significant or emotional impact. Unfortunately, the pacing doesn't just drop at the beginning but also drops at the ending which goes on for a bit too long as well.I'm also disappointed in how Mel Gibson and Michelle Yeoh are used in the movie. They are both amazing actors but are just not in the movie a lot. Mel Gibson plays the main villain but we don't see him do much apart from just monologuing for a long time. Michelle Yeoh is on the poster which seems to signify an important character but she is nothing more than a 1-minute cameo. I wish there was more conflict between the main character and the main villain but they won't interact that much. Some dialogue isn't that great eitherOverall, I had a lot of fun with Boss Level (2021). It doesn't blow you away in the action department or do something never seen before. However, it is very high octane energy and chaotic which honestly is incredibly satisfying to watch."
    },
    {
      "rating": "7",
      "text": "Boss Level is a new addition to the time loop genre, with a twist. Ex-special forces officer, Roy Pulver, played by Frank Grillo, relives the same day until he dies. Every day he is hunted by assassins and when killed, he wakes up back in his bed where he started, only to have to try and survive all over again. Roy has no idea why he is stuck in this infinite time loop but he must do what he can to survive, and the longer he survives, the more he uncovers about his particular situation. Unlike most action films that take time to build up, this film gets right into it and offers tons of non-stop combat sequences that would satisfy any lover of action films. Its erratic flow makes for some fun action scenes which come out of nowhere since Roy can expect the assassins to attack at any moment. If you play video games often and have ever been stuck on a level for hours or even days, you know the feeling of having to repeat the same thing over and over again until you finally figure out how to pass the level easily the next time. Boss Level pays homage to this as Roy moves further in time after many attempts to beat a person or try to gather more information on how to solve a dilemma. The assassins are a really fun part of the film and help add a nice range of action that constantly feels fresh. I can sense the enjoyment the creative team had when creating each assassin. Every one of them has a particular set of skills, represents a different style of fighting, and has a unique costume to fit their overall esthetic. They also each represent many tropes found in video games. For example, one of the bosses is a carbon copy of Roy played by actor Eric Etebari. Their encounters are hilarious as they both are constantly dressing alike and put up a consistent fight. One of my favorite assassins was named Guan Yin, played by Selina Lo. She is this bad-ass sword fighter who gives Roy a run for his money. I must add, she was equally funny and her signature catchphrase was a nice added touch that had me laughing each time. It made me think of many famous catchphrases like \"get over here\" from Street Fighter. Guan Yin wasn't the only funny character, the film also boasts the comedic power of Will Sasso and Ken Jeong and offers many hilarious bits in their unique style. The uniqueness doesn't stop there as the films acting range includes Mel Gibson, Naomi Watts, Michelle Yeoh, Rampage Jackson, and the double touchdown scoring Rob Gronkowski from this year's Super Bowl. I was pleasantly surprised for the film to have such a warm and enjoyable side plot that saw Roy rekindle his relationship with his son, Joe. As the two bonded over video games like Street Fighter and Defender, it gave the film a nice even buffer in between the action sequences, as Roy progressed through the game. Fun fact, Joe, played by Rio Grillo, is Frank Grillo's son. Many of these scenes show us the leading man that Frank Grillo is. and the dynamic range he has which is only starting to shine through in his latest roles.I was first introduced to Joe Carnahan's work from Smokin' Aces and have been following his work ever since. His balls to the wall action style and fast-paced filmmaking fit the time loop genre well. That is one of the reasons why Boss Level worked so well. He also has a great relationship with Frank Grillo after working on many projects together over the years. Boss Level is a really fun action flick that does not take itself too seriously and pays homage to action films and video games in really awesome ways.I am Stefano Bove, and I have written this! If this joke does not make sense, watch the film and come talk :)"
    },
    {
      "rating": "8",
      "text": "Any movie that is in the “groundhog day genre” gets a few bonus points in my book. The movie is just good entertainment and has a grwat dark humor to it"
    },
    {
      "rating": "9",
      "text": "A very good movie, with more depth than meet the eye. The redemption arc is far from being uninteresting, and the antagonists are pretty well played."
    },
    {
      "rating": "10",
      "text": "Massively entertaining take on the time loop trope, Groundhog Day meets GTA, Frank Grillo is perfect as the cynical wise cracking bad ass supported by an excellent cast, the violence is often original, balletic and hilarious and there's a good heart at the core of the movie. Unexpected delight. 10/10"
    },
    {
      "rating": "8",
      "text": "Overall, a really fun and enjoyable action movie. I'd definitely recommend it."
    },
    {
      "rating": "8",
      "text": "Superb sci-fi action film with a great sense of humour and very talented cast. A must watch for fans of the genre."
    },
    {
      "rating": "7",
      "text": "90 minutes of turn your brain off fun.Grillo is great in the lead.Gibson shines as the antagonist.Don't go into this expecting anything original, just enjoy it for what it is."
    },
    {
      "rating": "9",
      "text": "One of the best fun and action movies of late. Really enjoyed it, something new to the story and not the usual stuff, was interesting through out, had some jokes, I really liked it."
    },
    {
      "rating": "7",
      "text": "Encore le principe du « jour sans fin » mais décliné ici en version très vitaminée avec bastons, explosions et fusillades ! fort bien réalisées d’ailleurs au vu de la propension si désagréable des films d’action modernes au « cut, zoom & move » à outrance (c’est-à-dire de la merde…). On a donc de belles séquences avec hélas… du sans rajouté en post-production en images de synthèse (oui, c’est pourri comme procédé mais ça leur coûte nettement moins cher…).Cela étant, outre l’action, on a également quelques dialogues et commentaires bien sentis et très inspirés, car à force de recommencer la même putain de journée, notre tocard en a gros sur la patate et même plus que ça : il a les nerfs ! il voudrait déjeuner en paix… et pendant ce temps-là, qu’est-ce qu’elle fout la marmotte ?!… eh ben elle s’en bat les burnes et elle emballe toujours le chocolat dans le papier alu.Le ton drolatique et la réalisation de qualité suffisent à faire passer la pillule d’un scénar qui ne tient pas sur grand-chose et tient… à peu de choses, ma foi. Du coup, la guimauve stupide (pléonasme) s’invite ici et là un peu plus que nécessaire. En outre, on peut regretter cette autre tendance qui consiste à caser lors des scènes d’action de espèces de vieilles chansons de merde qui puent la merde !Mais on apprécie dans des rôles secondaires ce bon vieux Mel, la charmante Naomi… et plsu fugacement une certaine Michelle qui ne voit pas le temps passer ! Frank Grillo dans le rôle-titre reste une andouille mais ma foi, on a vu pire… Quoi qu’il en soit, cette petite comédie d’action est tout à fait divertissante… avec son humour pour le moins destructeur !"
    },
    {
      "rating": "7",
      "text": "I loved the dark comedy sci-fi twist to the overdone time loop plot. The writing especially the screenplay was superb. Frank Grillo's performance was just phenomenal, he was hilarious and I also loved the emotionally touching moments he gave. Selina Lo and Will Sasso gave very entertaining performances as well. The visual effects were stupendous. The makeup and hairstyling was excellent. This was a very entertaining movie."
    },
    {
      "rating": "10",
      "text": "Very good movie. Carnahan succeeded in making a kind of \"Edge of Tomorrow\" wich is not boring but, instead, entertaining for spectator."
    },
    {
      "rating": "9",
      "text": "An excellent take on the time loop film genre. Think Groundhog Day with people trying to kill you. Really enjoyed the film. Grillo is excellent as the lead and Gibson as the evil baddie is perfect.Great Sunday night viewing. Lots of action.9/10"
    },
    {
      "rating": "9",
      "text": "Very nice movie. I'm the usual geek sci fi fan and sure, this concept has been used before, but not in the exact same way.If you are looking for a good action movie following what's standard sci-fi concepts you'll have a good time, period.I don't think you need much more to pick this one up, just enjoy!"
    },
    {
      "rating": "8",
      "text": "Satisfying action film that is worth the time. One of those \"hmm, what's this?\" finds where we thought we'd watch a couple minutes of it and ended up watching the whole thing. Also registers about a 0.1 on the Wokeness scale, which was gratifying."
    },
    {
      "rating": "8",
      "text": "A decent time looper movie that accomplishes what it sets out to do.  Critics like to complain but I found nothing wrong (acting was very good, hero's journey executed properly, stunts were awesome and over the top, etc) with this movie and will probably watch it again..and again...and again."
    },
    {
      "rating": "10",
      "text": "Easily my favorite movie of the year. Tons of fun, Mel Gibson is becoming somewhat of a dark horse with the movies he is putting out"
    },
    {
      "rating": "10",
      "text": "It was like Ground Hogs day meets Dead Pool, Back to the Future, Edge of Tomorrow, Kill Bill,  and the Matrix all wrapped into one movie. The subtle not so subtle nods to Frank Grillo's diet and Captain America were on point. This has quickly become my second favorite movie next to Deadpool."
    },
    {
      "rating": "10",
      "text": "The best movie everrrrrrrrrrrrrrrrrrrttrrrtrrtrrrrrrrrrrrrrrrttrtttttttttttt"
    },
    {
      "rating": "8",
      "text": "Highly entertaining take on a concept previously done. Some surprising character development as well."
    },
    {
      "rating": "10",
      "text": "You critics and your scores just show you haven’t played a video game recently and you’re not a gamer at all. The voiceover you all mentioned so much was hilarious because it was explaining the gamers thoughts, the person playing the video game, in the character’s voice as we would think it. Did y’all ever think of that scenario being true if the movie that it is truly just a video game? If anyone noticed there is a game coming out called Death Loop and it’s the exact same premise basically, don’t know if it’s coincidence or what but the two need to get together quick and use each other. Because I would watch the movie while playing the game."
    },
    {
      "rating": "10",
      "text": "Of course the critics are stuck up and only want liberal promoting movies, but this movie is awesome!! Who cares if it has Mel Gibson, everyone screws up drunk 100%. This movie is action packed, funny, great story. Loosen up, sit back and just have a good time watching it!!"
    },
    {
      "rating": "1",
      "text": "pretty bad film, more of a relationship drama than an action film. only serves stupid stereotypes!"
    },
    {
      "rating": "5",
      "text": "Grillo did a great job as the lead with Gibson playing the perfect villain opposite of him. It's a fun, groundhog day style action film that will keep you entertained for the most part. It does get a bit repetitive in the final 1/3 of the film though but that's to be expected. Still, It's not a bad movie. It's a simple action film that knows it's a simple action film."
    },
    {
      "rating": "5",
      "text": "It's not going anywhere, but it has a much better level than expected.But understand that this seeks to justify its total lack of depth and narrative expertise with action that only wants to numb the viewer so that their attention does not wane.It's not subtle, nor really clever, but if you're looking to have fun without compromise, I don't think you'll have a bad time."
    },
    {
      "rating": "6",
      "text": "(Mauro Lanari)\"Groundhog Day\" meets \"John Wick\" or \"Crank\" as action movie, \"Scott Pilgrim vs. the World\" as apocalyptic movie, \"Edge of Tomorrow\" as sci-fi movie, 8-bit video games as playful experience vintage. In such multilevel speedrun the voice over overflows not only irony but reflective moments that, if they had been better developed, would have elevated the film to a completely different dimension (\"Every Day Is Exactly the Same\", Nine Inch Nails 2005)."
    },
    {
      "rating": "6",
      "text": "admirable[ ad-mer-uh-buhl ]adjectiveworthy of admiration; inspiring approval, reverence, or affection."
    },
    {
      "rating": "9",
      "text": "This is a pretty awesome movie that doesn't take itself too seriously and is a lot of fun."
    },
    {
      "rating": "10",
      "text": "Best action movie I've seen for some time. Funny, well written and directed. All actors were great but Mel Gibson added his special note and Frank Grillo was fantastic!"
    },
    {
      "rating": "6",
      "text": "Boss Level is a typical action B-movie. A classic movie that tries to copy Groundhog Day throughout. Only Boss Level is about something else, first it's for a younger audience and more violent. A good cast with 2 great actors who have almost no time. In general, although the very idea of    the film is not new, it is not poorly implemented. Do not get bored with repetitions of the same scenes, which are not poorly staged. Even the very idea of    destroying the whole world looks funny and cringe. So bad, it's even good. Great good movie to watch for one time. The only thing that can disappoint is the open ending."
    },
    {
      "rating": "5",
      "text": "Despite extreme orientalism and all kinds of set-up holes, the latter part was touching, but a more grave ending."
    }
  ]
}