{
  "id": 4308,
  "title": "Boyhood",
  "starring": [
    "Ellar Coltrane",
    "Patricia Arquette"
  ],
  "runtime": 166,
  "genre": [
    "Drama"
  ],
  "description": "The film tells a story of a divorced couple trying to raise their young son. The story follows the boy for twelve years, from first grade at age 6 through 12th grade at age 17-18, and examines his relationship with his parents as he grows.",
  "releaseYear": "2014",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/cQz2gp3Dcxq17Ip3Bq1qUQkDkFH.jpg",
  "categories": {
    "plot": 2.0303030303030303,
    "acting": 2.175,
    "ending": 2.1333333333333333,
    "soundtrack": 3.0,
    "cinematography": 2.0,
    "familyFriendly": 3.0,
    "funny": 5.0,
    "action": 1.0
  },
  "reviews": [
    {
      "rating": "3",
      "text": "I am convinced that all the critics are giving this bouquets because they are scared not to. I mean, it's Linklater and it's a 12 year project and it's so frightfully \"well observed\". But did we observe anything interesting, or insightful...really? Come on, really? The early promise that we'd see the boy grow through the emotional impact of divorce and domestic violence and being slightly unconventional, but it never eventuates and ultimately it all just leads to your common or garden teen's self indulgent prattling. There were some terribly clever things going on, especially the editing of the time jumps, and I was always curious to see how the actors had aged, including the next hairstyle choice.\rOn the positive Linklater didn't take us down conventional routes, there was no 'coming of age sex scene\" for example, or any 'teen makes bad judgement call and gets into trouble' scene. But neither has he built any significant conflict. I wouldn't call this film an utter waste of my time, but I've no idea what people are raving about."
    },
    {
      "rating": "3",
      "text": "Boyhood should never have been a feature film.\r Feeling wholly episodic, Boyhood fails to resonate as a story--its thematic through-line is unclear and each episode lacks the transitions necessary in drawing any sense of a story together. There are certain scenes that make me believe Boyhood would have worked really well as a 12-part miniseries, wherein every episode delves deeper into each year of the 12 years it took to film. Provided it contained more depth, better chemistry between the actors and a clearer focus to the tale being told (that a longer series could have afforded), this would have been a remarkable achievement.\r Instead, Boyhood succeeds as a gimmick. I fail to see how any positive review of this film isn't relying on exactly what the film relies on--the wonder that an entire cast & crew had the patience to take 12 years to film a \"passion project.\"\r And just a project it surely is."
    },
    {
      "rating": "3",
      "text": "The movie is complete and utter waste of time. I truly feel sorry for the actors that dedicated 12 years of their life filming such a **** and boring movie. However, they should also be commemorated because this movie may be the cure to insomnia,its that slow. Some may argue that slow and steady wins the race,and the only way that could be true for this movie was competing for the **** movie of all time. The fact that 'boyhood' has such good reviews blows my mind, but i figured out why this is so. Reviewers feel so terrible that this **** movie took 12 whole years to make they all decided to throw a pity party and hand out 10's.n"
    },
    {
      "rating": "7",
      "text": "I was expecting a sort of emotional roller coaster with moments of empathy, sadness, joy, etc. -- having gone through real-life boyhood myself -- but rarely did this film evoke that kind of personal attachment and investment for me.\rEsquire has a Q&A with Linklater and Hawk in their latest issue, and in it they claim to have made a conscious effort to avoid cliches, but somehow they landed on a bunch of them anyway.\rThere are a few great moments, and generally very few missteps, but ultimately this film does not reach the upper echelons of movie lore. It's good, not great.\rIn short, I was expecting to cry. I had the box of tissues ready. Never came close."
    },
    {
      "rating": "0",
      "text": "3 hours of inept, masturbatory navel-gazing. A one-trick-pony of a movie so intent on patting its own back over how much critics will be baited into loving its \"bold experimentation\" that it forgot to be a film ABOUT anything. I never imagined something that took so much time and energy to make could appear so lazy and ill-conceived on screen.\r Ignore the undeserved praise. Just because it took 12 years to make doesn't mean it's any good. Don't encourage these people and give this a pass."
    },
    {
      "rating": "3",
      "text": "Dull disjointed disparate nonsense that has none of the revelatory joy of a film like stand by me.it's overrated tripe that is memorable only for the method of its making. Aside of the domestic at dinner scene which is genuinely horrifying it's turgid lack lustre and banal . I remember watching the movie les 40 years ago and being terrified and stunned . Even Clint eastwards American sniper ( also overrated) left me in stunned silence at the end and left me thinking about it for days . Boyhood left me thinking I must be dum to have not appreciated this ghastly waste of celluloid."
    },
    {
      "rating": "2",
      "text": "You know what my favourite part of this film was besides some nice shots of Austin, a place I've visited?  The beginning of the ending credits!\r Am I the only to have seen this film as overlong and full of repeated after school special scenarios?  Two hours and forty-five minutes of shallow small talk mixed with one-liners one would likelier hear out of a pothead's mouth amounts to a combination of sitting in an Elizabethan torture chamber while watching the \"Wonder Years\".  Except the Wonder Years had more creative plot lines.\r Am I the only one to think how emotionally balanced and level-head those kids were despite having a father who's insufferably loquacious and a mother who's just a plain miserable cow less than apologetically putting her children second?  I like Patricia Arquette and Ethan Hawke.  I do not think they make the best sympathetic parents.\r Am I the only one to see the young Mason's lack of backbone and failure to stand up to the horrible adult role models his impressionable life?  I'd like to think that a lot of kids would rebel, rather virulently and understandably I should add, at basically being brow-beaten and spiritually abused to death.  It's just not real.\r No to Boyhood.  No to all the adulation the movie has undeservedly received."
    },
    {
      "rating": "3",
      "text": "Boyhood is a movie shot with the same cast over 12 years. As the main character grows from a kid in elementary school into a young adult, he understands himself and the world around him and gains more control over it. While the idea of growth is a fascinating subject, this movie fails to build an engaging story around it.\r In Boyhood, milestone moments in life are overshadowed by mundane events. High school graduation is overshadowed by a talk with a friend after graduation ceremony. Marriages and divorces are overshadowed by talks over dinner table. The movies seems to be very valuable for the director, Richard Linklater, and the cast who helped with the script and the mundane moments that are overemphasized seem to have personal connections with the cast.  If you similar connections with similar moments in life, you will love the movie, otherwise there is not much to love in Boyhood."
    },
    {
      "rating": "5",
      "text": "I'm utterly mystified by the unanimous raves for this movie by the professional critics. There are beats and performances to enjoy here, particularly those of the children cast in the roles of Mason Jr and his sister Samantha. And there is an innate fascination with watching a boy's face and body become that of a man that is captivating here. But the minute the adults around Mason Jr start speaking, I just felt like I wanted to leave the room. The parade of inappropriate (or downright terrifying) fathers that march through the story made me wonder at the miracle that young Mason would actually survive into adulthood at all. Had the brilliance of the concept been matched with a more invigorating and cliche-free screenplay, I too would have rewarded the movie with a 10. As is, it's hard to recommend even investing the 2 hours and 45 minutes it takes to wade through this particular boyhood."
    },
    {
      "rating": "10",
      "text": "A boy enjoying pictures of women in swimwear with his friends. A boy being devastated after having his mane cut off. A boy debating the necessity of Facebook with his high school girlfriend. In all honesty, Boyhood is a rather apt title for this film. But it could just as well hold the name of another picture currently running in cinemas: Life Itself. That simple yet profound thing is what lies at the core of Richard Linklater’s unique 12-year-spanning story and makes it relatable for everyone, regardless of sex, age group, descent, social status, or character. Linklater lets his audience live through the fun and the pain, the love and the misery, and the excitement and the disappointment of his protagonist Mason with yet another wonderful screenplay in his repertoire and an unspectacular but still extraordinary way of directing. Leaving the cinema, it’s hard to grasp one has just spent the better part of an evening in front of a screen, but at the same time, there’s also a feeling of having relived your own adolescence along with Mason."
    },
    {
      "rating": "0",
      "text": "I am absolutely shocked by all of the great reviews. Maybe my expectations were too high but I mean the critics loved it and praised it like it was the best movie of all time, when it really is a waste of time."
    },
    {
      "rating": "0",
      "text": "The worst movie I've ever seen. Complete B.S and completely unrelatable to the childhood of any boy. Messed up storyline, vague characters popping up at random points render this movie a very boring watch. The characters are very inconsistent (except Ethan Hawke) and the movie generally portrays a very bad image of American family values. Thus, the movie should've been named \"Mason's f**ked up boyhood (Boo Fri**in hoo)\". And I'm not even gonna bother writing about the ending scene."
    },
    {
      "rating": "0",
      "text": "1,869 fake reviews from reviewers on metacritic. Boyhood is 100% insipid and it is easily one of the worst movies. This movie is an hour too long, and it is impossible to sit through, grade F for feeble and failure."
    },
    {
      "rating": "0",
      "text": "I can not believe this high rating for this absolutely non-special film.I admit that the fact that I cannot bear Ethan Hawke influences this judgement a bit too."
    },
    {
      "rating": "4",
      "text": "Don't get me wrong. I like indie movies but this is just way over-hyped. A touch of mass hysteria for a movie that is really just a cool version of reality tv. All just too ordinary. Birdman has far more going for it. Boyhood is way too long and gives us very little to ponder other than we have all been there. There are so many better things to do with 2 hours and 45 minutes."
    },
    {
      "rating": "4",
      "text": "I really have to agree with I Hate Everything on this one. This is a film about a stereotypical boy's life, and his stereotypical dreams and his stereotypical aspirations, and his stereotypical friends and his stereotypical school life. And don't forget about his stereotypical family. I do admire and appreciate the actors and the crew for sticking with this movie for 12 years. There was a solid performance or two, but that's about how far the good stuff goes."
    },
    {
      "rating": "3",
      "text": "As ambitious as it is boring.  There is no central conflict in the story, or even a reason to care.  Just 165 minutes of an annoying child, and then it ends."
    },
    {
      "rating": "2",
      "text": "This film follows the life of a boy from age six to his entry into college at 18. The movie is filmed such that the main character is filmed at age six and is continuously filmed over a 12 year span until he is 18. A seemingly endearing concept however is ruined by the fact that him and his family are entirely unremarkable and they do absolutely nothing remarkable throughout the film. There is no engaging story arc, difficulty to overcome or goal to achieve. For anyone who has lived a life of their own, this film has nothing to offer, no insights or revelations and certainly no entertainment. Certainly there is a reason why films aren't normally made about normal people living normal lives, it's because we live those everyday and don't need a theater or disc to see it. The acting is poor as well. Ethan Hawke and Patricia Arquette do a fantastic job, but the acting roles especially from the children are inconsistent and forced. Much of the dialogue is awkward and out of touch with how youth used to talk as well. With one liner 90s clichés scattered throughout. It's a subtly racist film as well. Despite being set in Texas, the one and only Hispanic character is first seen doing manual labor. This movie does have one notable aspect: Because this movie is nearly three hours and nothing notable happens at any point, it begins to drag unrelentingly about an hour and a half in. This movie is however fascinating in one aspect: A movie can be made about unremarkable white people doing absolutely nothing remarkable for nearly three hours and still receive near unanimous praise, critical success and an Academy Award nomination. Bravo white people, even the most unexceptional of you are truly are amazing."
    },
    {
      "rating": "3",
      "text": "Good idea, bad execution.  I liked seeing the actors age and go through their various misfortunes and excitements, or at least the idea of it.  But the movie was frankly too long.  It makes us sit through unpleasant or awkward scenes, and then does nothing to reward us, often switching to uninteresting small-talk, such that my brain began to feel like mush after a while.  Even though real life is typically that way for many, that doesn't make it good film material.  The milestones and aspects of the boy's life should have been hit more concisely.  I would love for something like this to be done again, but better."
    },
    {
      "rating": "1",
      "text": "Man, I am a huge fan of indie films and maybe it is because I went into seeing this movie with high expectations that I was so disappointed. I get that it was filmed with the same cast over 12 years but there was no story-no suspense- no plot whatsoever. It was literally watching excerpts of a totally normal kids life as he grows up- total waste of my time. Not entertainment-maybe art.  Nothing happens in this movie. In summary it is a pointless movie about how pointless life is."
    },
    {
      "rating": "2",
      "text": "I watched boyhood and oh my... well, I don't know if I should share but the film makes you feel as though you SHOULD think it's a classic because you are watching these people age and develop, but in reality they definitely do age but develop very little. It's as disjointed a film as you would expect from the way it was filmed over such a long period, it doesn't struggle to be coherent because there's absolutely no challenge in that respect for it to do so. There's nothing artful about the way the film is put together, it's a sequence of moments, which makes sense if you think about the last scene, a scene which tries to make this profound link, like a series of moments with nothing really changing but it feels flat, and again maybe that is the point, that it should feel flat and banal because that's more realistic but the film also tries to be something else by having several linking scenes with sombre indie songs playing in the background, the songs are so tacked on and don't reflect the mood well at all. Whether it's his character or just bad acting, Mason is underwhelming, and so is his sister through most of the film, funnily enough they both seem to act better as young kids, but as they grow the cracks start to show in the performances, I get they have been directed to act as naturally and realistically as possible but it comes across as just awkward bad acting in some scenes, which should have been cut or edited better, the editing was the worst thing about the film, far too many pointless cuts and lingering shots that do nothing, one sweeping shot is so bad it sticks out like a sore thumb. The editing was poor in terms of the sequence of moments as well, it was a basic timeline, but it was put together with no flair. In my opinion the best thing about the film was Patricia Arquette and her character, she was a very realistic mother, and the nuance to her performance reminded me of my own mom, I thought her performance was the best in the film, Ethan Hawke was good as well, and he absolutely carries the scenes with the kids. I don't think it should be viewed as groundbreaking just because ageing happens to the characters, it should be judged as just another film, I was ready to enjoy this film, and I found it relatively enjoyable, and it wasn't that the pacing was too slow, just that it felt monotonous, the film gets better, it has peaks and troughs. Maybe i'm missing the profundity of the understated realism that is the films essence, but it would feel more profound for me if i looked through some of my own family photographs and reminisced, the sentiment was lost on me, I didn't feel it but maybe that's because i have a cold stone for a heart"
    },
    {
      "rating": "2",
      "text": "Imagine you have next door neighbors, who are nice, but want to show you their slide show and home movies of the last fifteen years of their life...  If you would enjoy that you might enjoy Boyhood...  I just jumped scene to scene to see what all the hype was about...  Just OK...  It's not much more than a gimmick..."
    },
    {
      "rating": "2",
      "text": "So this is one of the most boring movies ever made. No, I did not dislike it because it was long. I don't mind long movies. First, the cinematography is fine, the dad and the mom were great but that's pretty much it. The boy is the most unlikable character I've ever seen a movie be completely about, that wasn't trying to make the character unlikable. The early parts were fine, it had a sense of slow progression but looking back a mere 45 minutes you realize so much had happened since then.\r If anything, the idea behind the film is the best part: watching a boy grow up before our eyes. This is done well. But when the boy is a jaded **** for the majority of the movie (once he becomes a teenager) it's just bad. No matter how much work the crew did, or Richard Linklater, if the movie sucks then it **** sucks.\r I'm assuming people like this movie because of the obscenely high scores it gets and sort of a lemming effect, but I encourage you to look at the movie critically and objectively.\r I saw some people giving it a 10/10 because it had no melodrama, which is okay in some cases, but I would rather that this movie have a bunch of melodrama than the multiple flat scenes with awful writing. I think he was trying to be hip in a few scenes but it just fell flat. The movie has a clear aesthetic and tone, and it's pretty clear what he was trying to do. And I applaud the work he put into it. 12 years is a long time to work on a project. But that doesn't change the fact the kid is annoying, nothing interesting ever happens (even though multiple times it seems like it's going to).\r Another thing I find wrong with it is the fact that it's 3 hours long. Again, nothing wrong with 3 hour movies, in fact I enjoy them more because they usually have a longer and usually more wholesome story (which Boyhood had admittedly). But there were so many points that it could have ended on. There were multiple scenes where I actually thought \"and this is the end I guess, wow that was a great ending\" and then another scene starts. The actual ending itself was actually pretty bad too. They did LSD in a valley or something and then it cuts to black. The car ride to college was a much better place to end. Speaking of which, there were a lot of other things that seemed like they would lead to more interesting things but never did. I won't go into detail in case you still want to slog through it 15 months later.\r My final beef is that every side character that gets only one scene, or is only in it for a short time is intentionally unlikable, but in a manipulative sort of way. The drunk abusing father, the unencouraging teacher, the \"cool\" older kids that peer pressure, etc. Richard created these two dimensional characters to create the illusion of adversity. To make a sense of drama or progression. That he proved them wrong or something. But as I watched it I felt like he was just throwing cliches at me to try and get me to care. There were other side characters that weren't like that though. Imagine how everyone in a restaurant sees you as an extra in the story of their life. But they were also just two or one dimensional, and rarely got any development.\r The family (mother, father, kid and sister) were really the only ones with development. The sister was trash, and only there in the end because she had to be, and was probably just the lesser of the awfulness that is child actors at the beginning who auditioned. The kid was as I said before unlikable and annoying. But the parents actually had some depth and the actors did an incredible job with their material.\r I will end on a quote that I think sums up this movie perfectly:\r \"This is the most true to life movie that's ever been made when you think about it. When you get to the end you just want to die.\"\r-Jay from Half in the Bag"
    },
    {
      "rating": "3",
      "text": "Patricia Arquette is simply fantastic in a film where the child actor becomes the true embodiment of white, teenage male stereotype. Also, his acting gets worse and worse as he ages. How is this actually possible?"
    },
    {
      "rating": "1",
      "text": "the rave reviews are worthless - this concept was fine but the 'acting' left a lot to be desired - i expect the attempt was to emulate real life like a documentary but thru a script - what a complete failure!  i am sorry to say that i wasted nearly 3 hours of my life watching - please learn from my mistake at believing in the professional movie critics."
    },
    {
      "rating": "3",
      "text": "This movie has no storyline and no real point. It follows a malnourished poorly cared for low ambition boy as he shuffles along from age 6 to 18 where he officially becomes a young man. I wonder with such a poor mother how he survives. Spoiler alert, the mom ends up divorced three times and cared more about her schooling and job than either of her kids and it shows. It's no wonder she ends up at the end of the movie lacking 2 dimes to rub together alone and in an apartment in her fifties. I was waiting for over 2 hours for the movie to get to a point and it never did. Waste of 2 and one half hours of my life. The only upside was the music which was good if you liked top 40 songs from 2002 to 2013."
    },
    {
      "rating": "3",
      "text": "God help us, this was boring.  Saw it on TV.  If I'd paid theater prices, I'd really be po'd.  Two hours of whining about the meaning of life.  Just awful."
    },
    {
      "rating": "3",
      "text": "This is a great idea for a movie, very original. Its just not entertaining the kid they picked to play the role has no personality. This is just a long and boring movie that could of changed movie history but they just made it to boring."
    },
    {
      "rating": "3",
      "text": "Good effort. But, bad movie the plot didn´t go nowhere. The girl was simply the worst young actress i have seen since Sophia Coppola in The Godfather 3  and surprisingly Patricia Arquette couldn´t cry and made a louzy  patetic scene in the end that summarized the movie.\r #disappointed (read in Kevin Sorbo voice)"
    },
    {
      "rating": "1",
      "text": "J’étais très curieuse de voir ce film, le fait de voir les acteurs changer au fils des scenes est super mais par contre il ne se passe pas grand chose... on s'ennuie vite et le film est très long... dommage"
    },
    {
      "rating": "1",
      "text": "I fell victim to this movie as well seeing as how critics raved at how great this movie was, do not be fooled.. from a cinematic standpoint I could see the argument critics could make due to the unique idea put forth here, but the movie was awful.. I spent the entire time wanting to shut it off, by an hour in I didn't thinking \"It must get better\", but it never did.. I wish I could have my 2.5 hours back, this movie was absolutely painful on every level."
    },
    {
      "rating": "1",
      "text": "absolutely disappointing common no action i know that is what the movie is made up but [100] , [56] that is that is what i think should be the rating common i do not understand the whole idea of the movie boyhood uh, more like( lamehood) to me absolutely sucks"
    },
    {
      "rating": "3",
      "text": "This movie is too long. had the movie ended before the party with Tony and his friends, this movie may get a postive review. If the movie did not have the party with Tony, I may have finished the movie. The one good thing that came out of this movie was Linklater's daughter. But, 165 minutes? The concept is great but the execution is not very good at all."
    },
    {
      "rating": "2",
      "text": "I honestly don't understand what all the fuss is about regarding Linklater's films.  They all end up seeming like love letters to himself.   You don't get any insight into how the mother's second and third mates turn out to be failures as men and as husbands -- they're just \"bad guys.\"  I guess bad father figures are such a given in movies like this, that as a filmmaker you don't have to lift a finger to make them, what, motivated?  \"Look -- sensitive young boy.  Bad dad.  Mom's a jewel, always doing her best but kind of a screw-up herself.\"  Yawn."
    },
    {
      "rating": "1",
      "text": "It is interesting that this film was made over the course of 12 years but it is poorly executed. I know this film is about the life of a boy but it's so boring. Who wants to watch a 2 and a half hour movie about the life of a boy. There's one character who is a drunk and I thought he was more interesting than the main character. If you want to watch a more interesting film, watch snowpiercer or whiplash."
    },
    {
      "rating": "3",
      "text": "Aparte de lo diferente que puede ser grabar a las mismas personas durante varios años para mostrar su evolución física, no encontré ninguna trama interesante y después de 2 horas de esfuerzo me rendí ante el aburrimiento."
    },
    {
      "rating": "1",
      "text": "12 years of production have ultimate boredom in returnThroughoutly unengaging and I could only wish he grew up faster"
    },
    {
      "rating": "3",
      "text": "boyhood is a piece of ****\rthere is nothing interesting in it\rI don't know what is the reason they praise this!\rmaybe the fact that they stayed together for so many years made the critics to do that"
    },
    {
      "rating": "3",
      "text": "This movie was a huge waste of time.  Nothing happens for the entire duration and there is absolutely nothing impressive about the film.  I get it, it's supposed to reflect real life, but I'd rather experience my own boring life for three hours instead of watching someone else's boring life.  Acting was great and on point but I still could not figure out what the point was, as the point of the movie is that there is no point."
    },
    {
      "rating": "1",
      "text": "I don't understand why this movie has such a high rating. I knew it took time and effort to make but that doesn't necessarily make it good. It was basically just trivial conversations about food, money and other silly things that are the concerns of another specific family. I mean we might as well record our neighbors' everyday life and consider it a movie.\rIt's not thrilling. It's not interesting to watch. It doesn't have any moral. It leaves you with nothing, just maybe regret of the time you wasted watching it."
    },
    {
      "rating": "1",
      "text": "At the end of the 165 minute film, I started to cry. I cried for about 10 minutes at how bad this movie was. I could not believe that I had wasted 2 hours and 45 minutes on a film that has accurately represented American mediocrity. I wasn't just blown away by the mediocrity of the film, I was also blown away by the films portrayal of a mediocre family. Do not mistake the intent of this critique, I wanted to honestly and accurately portray what I felt after watching this film. There are way too many things that were decidedly unprofessional, and mind you, I am taking it lightly on the children's' acting. There was one very interesting dynamic of the film that goes far beyond the screen which merits the only point I have to offer this pathetic film. Let us begin this dreadful evaluation.There are many things that make this film disgustingly unappealing. The simple fact that it took 12 years to come up with mediocrity just shows lack of creativity. I did not enjoy watching a portrayal of a mediocre mother making extremely idiotic decisions whilst raising two children. Who still marks the doorframe to check up on height? Samantha using a phone during her elementary school years? That seems like bad parenting, just like the majority of this movie. Who pays money for cursing? While I grew up, if my parents heard cursing no matter where we were, someone was going to have it (I was an only child). Now don't get me wrong, my parents were never \"abusive\". They were aware of how to discipline in a controlled fashion and still manage to create a sense of respect and admiration from me. Next up, collecting rocks? Are you kidding? My parents made sure I never got into dirty habits such as collecting rocks or running around barefoot, or drinking at 15, or even having a cell phone. My parents never went on vacations without me during my developing years, my parents didn't allow me to say \"whatever\" as a response. My father never liked me playing video games, my father didn't drink until I was old enough to understand what occasion I should drink (age 20). Obviously I mention these things because the opposite of what happened to me happened in the film. All the things that you expect from an incredibly cliché family is included in the film, such as divorce (multiple). Drinking problems, high school problems, and college problems. If you name the ridiculous fad off the top of your head, it's probably here. Cliché divorced dad that give presents to make up for being a somewhat lousy father. Taking your kids to watch a game? Jesus, really? I can't take even remembering the film. Constant moving? Oh woe is me. Abuse? Woe is me. Don't worry I won't need to delve into the leftist stance this movie has, I would rather not stoop low enough as to talk about politics but this film shamelessly did so. Disappointed at father for a bad decision? Woe is me. The teachers advice in the darkroom was insightful at best. \"Seniors having fun\", that quote in my book is like a sin. Getting home late and ignoring advice? I did that once, lived outside for a week afterwards. This cast gave me a small tumor from rage.Finally the only redeeming quality of the film was the fact that they made the story so broad and mediocre that most critics could relate and feel empathy for the film. The only strategy that worked is making the story broad enough for people to relate to it, despite it being complete trash.Final Sentence: Boyhood is a good title because the kid never became a man."
    },
    {
      "rating": "1",
      "text": "This is the best example of a \"masterpiece\" that I do honestly consider a big pile of sh*t .... OVERRATED!!! Ok, you guys showed a kid becoming a weird teenager, but what else? Big stories inspire us, and this movie only helped me to remember (during almost 3 hours) that teenagers suck, and I already knew that :/"
    },
    {
      "rating": "1",
      "text": "Cool, a movie that took 12 years to make and lets the audience experience a boy's journey into adulthood. Terrific, except it isn't at all. Me and my family could only watch about 40 minutes of this movie before we shut it off out of absolute boredom. The story is weak, there were so many unnecessary moments, and some characters were literally unwatchable. Like many people here, I made a metacritic account just for this movie. Too many people judge this movie on the way it was made and the concept, not how good it actually was... Isn't judging a movie based on its overall quality the sole purpose of review sites???The vibe and idea this movie was going for could of been executed way better than this. Give me some decent actors and a good crew of technicians, editors, and directors; that's all I need to make a movie that trumps this one."
    },
    {
      "rating": "1",
      "text": "A film where the cinematographic force is as strong as that of a mouse. The dialogues are interesting ... but when putting it in place we put it next to where the mediocre movies are placed. Mediocre in the sense of wanting to evoke literature and not the cinema. A shameful movie."
    },
    {
      "rating": "2",
      "text": "Let's be honest, without the gimmick of being shot over 12 years this film is needlessly slow and borning. The only saving grace is that it was somewhat interesting seeing the actors age naturally over time but that doesn't save from the absolutely boring and cliche plot."
    },
    {
      "rating": "2",
      "text": "Why the heck is this considered such a great movie.  Very dull and lack luster performances."
    },
    {
      "rating": "0",
      "text": "This show is terrible, don't be fooled by the super high ratings. It's so bad I created an account here on metacritic just to warn you not to waste 3 hours of your life watching this show about nothing. NOTHING. There is no plot, no character development, no climax, NOTHING. It sucks. How it was filmed in 12 years does nothing for the **** plot"
    },
    {
      "rating": "10",
      "text": "You either simply love this movie or loathe it. Personally I loved it. Definitely 2014 movie of the year by far. I agree that sometimes it can be dull and its a little long, but such is life. You're watching a boy grow up and figure out what he wants to do with his life, especially after some of the experiences he's seen/lived through. The first 30 minutes are probably the worst part of the movie, after that it's really good. I suggest sticking with it. Lots of good quotes all throughout the movie and I feel like it's gotten a lot of praise for accuracy. I'm a little older than Mason but growing up, it was similar. I enjoyed some of the things he did/played when I was younger. Kinda the way Forrest Gump did to baby boomers back in the 90's. I feel it's relevant to call Boyhood \"This Generation's Forrest Gump.\" There's a lot to love in the movie. I'd give it more along the lines of an 8.7-8.8 but figured I'd bump the rating a bit. Deserves higher than an 8.1"
    },
    {
      "rating": "1",
      "text": "Everyone knows this is a film made over 12 years, with the same cast - shot one week or so every year.  Other than that,  what's the story?  The mom has bad taste in men, the son has the worst hair cuts in history, and that fake, \"nobody understands me\" angst  that should pass for drama.   This is what's happening to American film - even the alleged good movies are awful.  This is a great film like what - On the Waterfront, To Kill a Mockingbird?  Amadeus, Chinatown?   It's like every year was written a different writer, or by Linklater trying to figure out what to do.  There's no central theme/plot or problem:  a story line that challenges, tears them apart, shows a real portrait of a family in the midst of struggle.   Nothing.  Without the 12 year gimmick, this film has nothing going for it.   Four of us, all film fanatics,  could not wait for it  to end."
    },
    {
      "rating": "0",
      "text": "i realy really dislike this movie , 12 years of making really makes all critics blind, this movie really has no plot, those people suffering from insomnia are suggested to see this movie"
    }
  ]
}