{
  "id": 3292,
  "title": "Brahms: The Boy II",
  "starring": [
    "Katie Holmes",
    "Christopher Convery"
  ],
  "runtime": 86,
  "genre": [
    "Horror",
    "Mystery",
    "Thriller"
  ],
  "description": "After a family moves into the Heelshire Mansion, their young son soon makes friends with a life-like doll called Brahms.",
  "releaseYear": "2020",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/tIpGQ9uuII7QVFF0GHCFTJFfXve.jpg",
  "categories": {
    "plot": 4.166666666666667,
    "acting": 5.0,
    "ending": 4.666666666666667,
    "soundtrack": 5.0,
    "cinematography": 4.0,
    "familyFriendly": 4.333333333333333,
    "funny": 5.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "2",
      "text": "Eighty minutes of sheer disappointment. This sequel to one of my favorite horror movies of all time should have stayed on paper - although, even there, it wasn’t anything worth feasting your eyes on. Zero likable characters, zero-dollar budget, zero new aspects added to the horror genre, and zero reasons you should see it. What a waste."
    },
    {
      "rating": "4",
      "text": "In Brahms, a boy finds the titular creepy doll from the last installment and soon falls under its sway. The original The Boy was a decent suspense horror. This, however, is a very dissatisfying follow-up.It's been said by practically everyone who saw the first film, but it has to be said, that Brahms actively throws out the setup it was given. It's like if Friday the 13th Part 3 revealed that Jason Vorhees was an alien robot the entire time. They take the one element from the original that truly, really made it work and separated it from all the other haunted doll movies and completely disacknowledged that element. What makes this all really weird is that there wasn't a regime change. The original director and writer were heavily messing with their own work.This is a pretty dull film. The plot is mostly predictable so you aren't surprised much except for a couple moments. Things just drag on. The parents in this make a couple really dumb decisions in this. To the movie's credit, it does look nice. I liked the interior to all the houses. The cinematography is good. Also, there are a couple scares that work well.Still, as a whole there isn't much to recommend about this. I wouldn't say there is anything painfully bad about Brahms but there really isn't that much to entertain. Fans of the original will especially be disappointed."
    },
    {
      "rating": "6",
      "text": "It's a typical sequel. Its predecessor was a stunning horror masterpiece, with a complex, mind-boggling plot. However, it set the bar far too high for its sequel. Although \"Brahms\" successfully frames itself as an epilogue, the story winds up having little to no relevance to the first movie. Predictable and with an ending that will make you go \"that's it?\", the movie is not a bad choice for your next horror fix. In fact, all of the horror elements are THERE and are STRONG. But as a movie in and of itself, it is just lackluster in some regards."
    },
    {
      "rating": "5",
      "text": "A poor version of part 1. The film had no major shock moments and had a weak story."
    },
    {
      "rating": "5",
      "text": "Maybe it's the fact that I've never seen the first movie, but I thought this a serviceable -- if not completely predictable and cliche -- horror movie. It does nothing new. It's not particularly flashy in terms of plot, and I suppose some people might find it boring. In the end, it met the low expectations I came in with."
    },
    {
      "rating": "5",
      "text": "Never saw the first one, i think it was one of those \"theres a person living in the walls\" kind of movies that are popular nowadays. Don't have high hopes for this one. Oh how low Katie Holmes has fallen."
    },
    {
      "rating": "5",
      "text": "Its a shame because it couldve been so much better considering it was made by the same people as the 1st movie"
    },
    {
      "rating": "4",
      "text": "2016's The Boy was a rather uneventful movie that just so happened to have a great plot twist that made it a bit more memorable than your average possessed doll flick. See, the big reveal was that the doll wasn't actually possessed at all, which led to a nice expectation subverting finale. This follow-up completely contradicts all of that however by turning the porcelain little creep into a full-blown demonic entity with a will of its own. It feels like some cardinal rule of sequels has been broken as this betrays the one noteworthy aspect of its predecessor. Oh, it also makes NO FREAKING SENSE.There is really only one way they could have made this turn for the legitimately supernatural work. That was by having the ghost of Brahms inhabit the body of his doll after he died in the first movie. Yes, that would have been ridiculous and silly, but also acceptable given what was established in the previous film. Especially compared to what they actually went with instead.Writer Stacey Menear tries to convince us that the doll was always alive, seemingly unaware of all the resulting plot holes despite having penned the script for the original as well. For example, when the doll was smashed four years ago (my, how time flies) it shattered away into the shards of glass and hollow interior that were all it ever really was. When the shell is cracked here though there's some kind of gross meat puppet monster lurking underneath. Why wasn't that the case last time? I doubt anyone involved could cook up a reasonable answer to that question or any of the others you'd have after watching this.Brahms: The Boy II has a lot more working against it than just its logic and continuity errors however. As a horror it's bland, predictable, and flat. Offering little more than a few jump scares that don't amount to anything and a remarkable lack of atmosphere. Visually it also looks generic and stale like some straight-to-DVD effort, only shot through a higher quality camera lens. Then there's the story which once again features a protagonist that has been through some trauma, but uses her and her son's past victimization as a MacGuffin to trap them in their situation rather than adding anything meaningful to the conversation on things like PTSD.There's part of me that believes deep down that this was never meant to be a sequel. That Menear reunited with director William Brent Bell to make entirely different haunted doll movie, but because their last one made some money decided to make it a half-hearted and poorly thought-out continuation. Perhaps at the behest of the studio or something. When viewed as it's own thing it's entirely watchable if not particularly impressive whatsoever. However, it's impossible to recognize it as a standalone work because it's literally subtitled The Boy II. Which means the ties it shares by association will always be present in the minds of the audience. So the way this breaks the fiction while backpedaling on the one reason The Boy garnered any sort of following at all was never going to go unnoticed and doomed this low effort, incoherent cash grab from the start."
    },
    {
      "rating": "1",
      "text": "This is the worst and last blu ray i will ever buy really tried physically collecting but films like this could only ruin a collection"
    },
    {
      "rating": "3",
      "text": "“Brahms: The Boy II” rightly prioritizes creepy atmosphere over gore, but is otherwise a boring, predictable, and not-scary horror film that contradicts the plot of its direct predecessor."
    },
    {
      "rating": "4",
      "text": "No creo que sea tan pésima como dice la mayoría, pero tampoco es una buena película, como secuela es totalmente forzada e innecesaria ya que con la primera parte no había nada más que ofrecer y ahí debió quedarse, pero fue todo un éxito y era de esperar que quisieran sacarle partido.La historia es completamente genérica en todos los aspectos y carece completamente de sustos, eso sí, las actuaciones estuvieron buenas a mi parecer. No la encontré aburrida, pero es absolutamente prescindible y olvidable."
    },
    {
      "rating": "2",
      "text": "Another sad example of how **** up, unmotivated, lazy and dull mainstream horror is right now."
    },
    {
      "rating": "1",
      "text": "The sequel we've all been waiting for, \"Brahms: The Boy II\" manages to rival The Turning as the most offensively pointless horror movie of the year. Brahms may be one bad boy indeed, but his company would be preferable to another viewing of this sad cliche of a film."
    },
    {
      "rating": "4",
      "text": "The ending sucks! The rest of the movie is OK, not too scary. I would not recommend it unless you are dying to watch a horror movie."
    },
    {
      "rating": "2",
      "text": "It's scarier to see \"the exorcist\" for the tenth time. Brahms: The Boy II does not appear to be a sequel despite what the title says."
    },
    {
      "rating": "4",
      "text": "Couple with a mute son suffering from PTSD move into a house near the manor from the first film and dig up the Brahms dolls who then starts giving the family rules to follow through the son and flips over tables when they don't include him for dinner."
    }
  ]
}