{"id": 2606, "title": "Braven", "starring": ["Jason Momoa", "Stephen Lang"], "runtime": 94, "genre": ["Drama", "Action", "Thriller"], "description": "A logger defends his family from a group of dangerous drug runners.", "releaseYear": "2018", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/253Bw5I3Zj3e2thCThjO7byEUCL.jpg", "categories": {"plot": 6.0, "acting": 5.8, "ending": 5.0, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 3.0, "funny": 6.0, "action": 6.125}, "reviews": [{"rating": "6", "text": "This movie felt like it was made for a much better and much intense original artistic story. The elements of it: the music, the visuals the action scenes and every other detail was downright amazingly done. But the big bummer in all of it was  the cliche plot and the simplicity of it. Plus the non-existent script, and awful way the shot where filmed. The acting was rather really good with genuine acts. But sadly the predictable plot that has no message whatever and a happy ending, overall decreased the value of this movie. Overall it's an above average movie which was done in an amazing fashion but the plot was to narrow. With a better plot these actors and crew could work a masterpiece of a movie out."}, {"rating": "5", "text": "Looks like a poor Cliffhanger rip-off at first, but finally was packed with a more serious tone and solid acting skills. Not really well directed, with a blank cinematography and an original score you didn't even notice but surprisingly better than expected."}, {"rating": "6", "text": "Jason Momoma? Good. Jason Momoma fighting? Very good. The Plot? It was alright. The cinematography? Nice. Jason Momoa walking through the snow? Good but cold."}, {"rating": "7", "text": "A pebble and a coincidence can turn life upside down, even if you don't really deserve it. Watching Jason Momoa fights some basters like a strong man, protecting the family and also his wife, which showed strength and courage, was very satisfying to watch. It's action movie, but from those, you see as a real situation happening in front of your eyes and not based on effects action movie. Not cliché story, predictable, but decent."}, {"rating": "10", "text": "Jason Momoa = guuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuud"}, {"rating": "6", "text": "Braven is pretty much what you expect it to be. Jason Momoa beating a couple of bad guys in a nonsensical, cliché and predictable story. If you want to watch a mindless action flick where one guy takes on a group of stereotypical bad guys, then you'll likely enjoy this movie. If you want an intelligent and original home invasion story, then I'd recommend you watch something else."}, {"rating": "7", "text": "Good movie, albeit a bit unspectacular but still a good movie. Jason Momoa is a great lead"}, {"rating": "6", "text": "Braven Was not that good of a movie I was interested in what this was about all I knew there was action which there is and it is very slow at times Which makes the movie boring u are not interested in any other characters That is all that this movie is about I give Braven an  D-"}, {"rating": "4", "text": "Completely ordinary action thriller.Jason Momoa is basically another Dwayne Johnson, always playing the same role, interspersing simple films like this one and big blockbusters.Zero surprises though."}, {"rating": "6", "text": "could have been better the problem is all the characters does really nothing"}], "recommendations": ["wrath_of_man", "grudge", "contraband", "triple_frontier", "the_italian_job", "bloodshot", "hercules", "fantastic_four", "van_helsing", "the_last_witch_hunter", "project_power", "iron_man_2", "the_three_musketeers", "parker", "gemini_man", "clash_of_the_titans", "bullet_to_the_head", "jiu_jitsu", "16_blocks", "collide", "seeking_justice", "shazam_fury_of_the_gods", "lockout", "the_bank_job", "mechanic_resurrection"]}