{
  "id": 61,
  "title": "Braveheart",
  "starring": [
    "Mel Gibson",
    "Catherine McCormack"
  ],
  "runtime": 178,
  "genre": [
    "Action",
    "Drama",
    "History",
    "War"
  ],
  "description": "Enraged at the slaughter of Murron, his new bride and childhood love, Scottish warrior William Wallace slays a platoon of the local English lord's soldiers. This leads the village to revolt and, eventually, the entire country to rise up against English rule.",
  "releaseYear": "1995",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/or1gBugydmjToAEq7OZY0owwFk.jpg",
  "categories": {
    "plot": 8.695652173913043,
    "acting": 9.058823529411764,
    "ending": 9.142857142857142,
    "soundtrack": 8.25,
    "cinematography": 8.666666666666666,
    "familyFriendly": 9.0,
    "funny": 10.0,
    "action": 8.7
  },
  "reviews": [
    {
      "rating": "9",
      "text": "Brilliant back then brilliant now it's a must see for nearly everyone although it can slightly drag its does not for long."
    },
    {
      "rating": "10",
      "text": "Braveheart is a superb film, which goes under your skin and really fascinates. Great soundtrack and the battle sequences are among the best even today and the fact that the movie is actually 20 years old just shows how good they are."
    },
    {
      "rating": "10",
      "text": "best historical movie, glorious battle scenes, deep meaning and emotional music, love explanation in the best way, protesting and fighting against tyranny."
    },
    {
      "rating": "8",
      "text": "It's a movie about Scottish history, leadership, love, friendship and freedom. I had no expectations and enjoyed it very much. If you haven't seen it - do it now."
    },
    {
      "rating": "10",
      "text": "the best movie ever it was everthing good in a movie and if you give this movie lower than a 9 than you dont know good movies alright dont listen to those haters to this movie mel gibson was amazing in this movie and he is the best actor ever"
    },
    {
      "rating": "10",
      "text": "A Captivating story, set in the 13th century, of how the Scots fought their way to freedom against the English.\rEverything is great about this movie and I'd truly recommend this to anyone who loves history, swordfighting, action and a good story. 10/10"
    },
    {
      "rating": "10",
      "text": "A great heroes tale and celebration of Scottish history that is very loosely based on historical events.   It is the story of William Wallace (and with that also Robert the Bruce) in one of the most interesting and celebrated times in Scottish history. It is a battle for independence from England with schemes and lot of struggles. It is a nice Hollywood version with passion, emotion and glory. It is one of the most immersive movies of its time and deserved its praise by fans and critics. The real story behind it is not as black and white or glorious. It is from a historical standpoint really incorrect and awful (The list of errors would be longer than a summary of the movie). This does however not influence my rating as entertainment and documentation are separate genres. For itself it was Mel Gibson grand project as he was director, writer, producer and main actor. You can always feel the passion, heart and soul that was injected into this project. It uses clever techniques to build up the characters and story. Lets start with the actors. Mel Gibson is a great William Wallace and delivers a remarkable performance. Angus MacFadyen is a strong Robert the Bruce who struggles with his crown. Patrick McGoham as Edward I (Longshanks) is a magnificent bastard and one of the best villains I have seen. I shorten my praise here and say all actors deliver a good to great performance. Then there are the beautiful sets and locations in the movie. They filmed in Scotland and Ireland and it looks awesome. On a sidenote there are holiday trips for Scottish movie locations as many movies made them popular. Then there are the battles. They are intense, immersive and you always feel excited. The story and characters together create a great atmosphere. Also there is some good humor in the movie. While I have no complaints in general I think that the ending can be a bit of a downer. Overall this is an excellent movie that pushes all the right buttons. It rightfully deserves the Oscars and acclaim. It is a must see except for history buffs or historians."
    },
    {
      "rating": "10",
      "text": "Braveheart: \"Every man dies.  Not every man truly lives.\"  From beginning to end I found this to be a perfect movie.  This film is full of heart, violence, hope, loss, love and passion."
    },
    {
      "rating": "10",
      "text": "Saw this movie again and still love it, concidering all movies released nowdays so is this movie an even bigger masterpiece in comparison, a movie to watch when you either want a great movie or want to remember when creators still cared for the art in movies."
    },
    {
      "rating": "10",
      "text": "One of the best movies of all time! It's not a history documentary because of the lack of facts. But it catches the senses of revolution, honour and loyalty in a great way."
    },
    {
      "rating": "8",
      "text": "Mel Gibson's Braveheart continues to impress. Even though well over two decades have passed but everything from the film's battle scenes to the soundtrack are fresh in my memory. Braveheart builds slowly to its first gritty climax. Much of the early film concentrates on Wallace's love for Murron. Their courtship is unhurried, yet this is all preparation. The real meat of the story, which includes political betrayal, and dramatic battles, is yet to come. Braveheart is a brutal, bloody motion picture, but the violence is not gratuitous. The maiming, decapitations, and other assorted gruesome details make Wallace's world seem real and immediate. It is a testimony to the directorial skills of Mel Gibson that despite being three hours long this film never drags, in fact we the audience are transfixed. Braveheart is one of the best epics ever filmed and people would be talking about this movie fifty years from now.(Gibson's masterpiece)."
    },
    {
      "rating": "10",
      "text": "68? Critics are terribly wrong on this film. The story as well as the battle scenes are incredible. Mel Gibson is great in this film!"
    },
    {
      "rating": "10",
      "text": "A Destiny Written In A Battle For Honor-"
    },
    {
      "rating": "10",
      "text": "This is one of the greatest movies ever made. Anyone that says any different is a total muppet that should be shown the rack and hung for there treason!"
    },
    {
      "rating": "9",
      "text": "A very brutal and bloody movie, a movie I really enjoyed and the fight scenes throughout this movie are so amazing. I think all the fight scenes are very well done throughout this movie especially that one scene where William Wallace (Mel Gibson) comes into the room where that guy is sleeping and slams a mace to that guys face, its **** brutal but it's so well done. Also, the characters are pretty good and Mel Gibson trying to do a Scottish accent is honestly the funniest thing I've seen, it's still an amazing movie though. Overall, I really enjoyed this brutal blood bath of a movie from start to finish, it's worth the watch."
    },
    {
      "rating": "10",
      "text": "Braveheart was amazing. Not at all a waste of time, even coming from Mel Gibson, who stars and directs the film. He's definitely done his very best here."
    },
    {
      "rating": "7",
      "text": "'Braveheart' means well, provides a few emotionally wrenching segments, and won't disappoint gore fans, but the film's content will make historians feel sick to their stomachs."
    },
    {
      "rating": "10",
      "text": "as purely a movie made for entertainment - a masterpiece Imo.the acting, battle scenes, atmosphere, music, and overall feel makes this movie one of the greatest of all time. I've watched it countless times, and it's one of my absolute favorites."
    },
    {
      "rating": "10",
      "text": "William Wallace/ Braveheart\r The movie Brave heart is an epic story based on true historical events. In the late 1200 a boy named William Wallace was born. After the English takes his land kills his brother, father, and wife he begins a revolt. This revolution ends up taking on epic proportions. The reason this revolution becomes so powerful is mainly because of William Wallace. He just is a motivational leader and his undying belief in freedom is contagious. In fact before one of the bigger battles of the movie Wallace makes the quote, “Sure I’d love to settle down, have a farm, and raise a family. But I can’t do any of that, not without the English taking it. I’m willing to lay down my life for others so that they may live the dream that I have. ” It was his belief in freedom and a land of their own that helps him lead his troops so well.\rNot only is the plot amazing, but the actors who preform it are truly stunning. Throughout the movie you can feel it, as Mel Gibson (William Wallace) yearns for a better life.  Every time Wallace loses someone you care about you can feel the pain in your heart too. Also when Wallace was betrayed to the English you felt everything in you die a little bit. This movie and the actors within it really help you respect and treasure the freedom we have now. It was because of great men like William Wallace that anyone has any true freedom.\rThe impact of this movie is incredible. I can guarantee that anyone who sees this movie will have a hard time not screaming freedom randomly. Personally I felt that all the themes of this movie were life changing, and impacted the way I’ll think of day to day life forever. In my opinion the only place this movie fell short was it wasn’t long enough. I would advise anyone who wants to live life to its fullest to watch this movie.\r-Patrick Brooks"
    },
    {
      "rating": "10",
      "text": "Braveheart is an epic war film with fantastic performances, writing, direction, production design, music, and scale/choreography when it comes to the fight scenes. It makes you feel for the characters really well and leaves you off with a great message about courage and freedom."
    },
    {
      "rating": "10",
      "text": "One Of The Greatest Films Ever Made In The History Of Ciema.Braveheart Is Truly A Great Film,Action Sequences Were Superb So Was Music So Was The Film"
    },
    {
      "rating": "10",
      "text": "Objectively, possibly the greatest movie ever made. Cinematic perfection if there ever was one. 10/10 in every last category. While there are one or two films I personally would rank above it in my favorites list, if someone asked me to name the greatest film ever made, it will likely be Braveheart. This is what movies are all about."
    },
    {
      "rating": "5",
      "text": "As far as epics go, Mel Gibson aims for a sprawling vision in the likes of David Lean. However, by putting antics before aesthetics, 'Braveheart' is at its core not much more than a glorified melodrama - not necessarily a bad thing (it just makes the surplus of sentimental moments painful to sit through)"
    },
    {
      "rating": "8",
      "text": "Mel Gibson's great performance"
    },
    {
      "rating": "8",
      "text": "Great movie, despite all the historical inaccuracies. It is definitely Mel Gibson's best movie that he directed and was a part of, yes, it's better than Hacksaw Ridge. This movie really deserves more praise, it's too bad that the critic scores aren't higher, the audience score is definitely more spot on. This is one of those phenomenal movies that you need to see at least once in your lifetime. If you haven't seen it, please do yourself a favor and go watch it."
    },
    {
      "rating": "2",
      "text": "Battle scenes that cross the line from realism to pure comedy, plus more cheese then Wisconsin and more corn than Iowa. Music is good though."
    },
    {
      "rating": "1",
      "text": "1 for cheek. Ludicrous - Mel Gibson should not be allowed out with millions of dollars to spend without proper guidance."
    },
    {
      "rating": "5",
      "text": "Great music, and Cinematography. The irony of this film is that Mel Gibson preaches the importance of freedom, yet could care less if Jewish and homosexuals are denied theirs."
    },
    {
      "rating": "7",
      "text": "A complete masterpiece. A fantastic movie about honor and fighting for your freedom. This movie made me cry, laugh, and scream for joy. It is an incredible inspirational underdog story about fighting for freedom. Mel Gibson makes another fantastic movie and is amazing in it too. I was so moved by this movie and it will be in my favorites for a long long time. HIGHLY recmmend!"
    },
    {
      "rating": "7",
      "text": "Very good Gibson film with epic music and action, could probably have been edited a bit better."
    },
    {
      "rating": "9",
      "text": "Great movie! It really gives you a sense of history and what it was like to live in those days, even though the Scottish weren't wearing kilts until years after."
    },
    {
      "rating": "10",
      "text": "A masterpiece. Makes me feel an entire range of emotions. It made me laugh, cry and cheer on William Wallace and there resistance as they went into battle. It has everything a good film should contain and it's damn entertaining for 3 hour flick. One of the best film ever, a must see."
    },
    {
      "rating": "10",
      "text": "this movie, made me cry, it made me cry tears of joy. I'm a grown ass man, but this movie man, this movie just cant allow you to comprehend how amazingly brilliant it is. it makes me cry with such happiness because this movie made me feel, like i was Wallace himself. if anything, we need a movie with as much 'epicness' to make this world know, when we say movies, we mean business. FOR FAT PEOPLE RIGHTS!!!"
    },
    {
      "rating": "8",
      "text": "mel gibson gives the performance of his carrer in this unforgettable classic. The movie will give you goosebumps and man who wants a basic easy life ends up fighting against the english with his fello scots for scotland to be free"
    },
    {
      "rating": "7",
      "text": "The artistic medium of film is very subjective. Every audience member has a different set of criteria they use to measure their viewing experience. Not everyone shares the same set of criteria. If we did, what a bland and uninspired world this would be.\r What I Personally Liked About \"Braveheart\":\rLet's start off by addressing the fact that this film features some of the most spectacular locations ever caught on camera. The shooting locations found in both Scotland and Ireland fit the production perfectly and breathed life into the backdrop in a way most movies can only dream about. The stylish way the locations are presented from a visual standpoint seems highly influenced by the eighties' output of Akira Kurosawa, and let's be honest, there are certainly worse directors you could derive inspiration from. As for the acting, Mel Gibson has fairly decent chemistry with all of the cast members he plays off. This is an admirable trait considering the fact that the spotlight is on him so often in this film. Unlike other three hour ensemble pieces from the nineties (\"Short Cuts,\" \"Magnolia,\" etc.), \"Braveheart\" contains a straightforward narrative and much of that is fueled by Gibson alone. In addition, the battle sequences are well-framed and well-choreographed which creates an exciting sense of urgent realism. It also contains one of the finest, most memorable battle cries of its decade when William Wallace says \"They may take our lives, but they'll never take...our freedom!\"\r What I Personally Disliked About \"Braveheart\":\rFor as good an actor as Gibson is, this film would have benefitted from tighter direction. You can feel every ounce of weight in its length and that is not a complimentary statement. Often times, it moves at a snail's pace with patches that serve to bore the story into one's head instead of letting the moments unfold naturally. Basically, it is an epic for the sake of being an epic. Another drawback is that many of the movie's villains feel like generic knock-offs when compared to the fully fleshed heroes who oppose them. From a cinematic standpoint, as we have learned over the decades, a hero is only as strong and as righteous as his villain is evil and crafty. The forgettable villains in this film inadvertently weaken the accomplishments of our brave Scots.\r My Overall Impression of \"Braveheart\":\rWhile it is a bit long in the tooth and a bit one-sided in the characterization department, this is still a reasonable example of what Mel Gibson was capable of delivering when he wasn't portraying crazed cops or reimagined mavericks. This is his show all the way and you can tell he tried to make the best of it."
    },
    {
      "rating": "10",
      "text": "Braveheart is a man's movie, a brutal action epic that will satisfy any red-blooded man's desire for violence and carnage. The remarkable thing is that Braveheart is also a movie that moved me like few have before."
    },
    {
      "rating": "8",
      "text": "when I first saw this movie, I wasn't really interested in watching it because it felt boring. Then one day, I went back to watch this movie again, I was wrong about the movie. I really enjoy this film. The whole movie was good but mostly the music takes the spot. If you see this as a movie, you'll love it. If you see it as a history buff, then you might get disappointed. Even though most of the things in the movie never really happen, at the end of the day, it's just a entertainment film."
    },
    {
      "rating": "8",
      "text": "From its soulful score by James Horner, brilliant editing in the battle sequences, brisk pacing, and dazzling cinematography by John Toll, Braveheart is an epic in every sense of the word.The acting, the surprisingly brutal battle scenes, the speeches and monologues, etc, feels fresh and new to the genre even if they actually aren't. That's in large part due to Mel Gibson's remarkable and risk-taking direction, and the masterful editing.Long shots, wide camera angles, and quick cuts in the dialogue scenes as well as the battle sequences gave this movie a lively atmosphere, and therefore made it a unique experience that helped it to stand out from the other historical epic movies.That being said, I found the tonal shifts completely outputting. The movie kept moving from a somber to a lighter tone throughout its runtime to match the current situations and events. That made some important moments have less impact on me, such as; some dramatic moments didn't work as mush as it should, the climax of the plot felt sudden and not well prepared for it, etc. While it didn't take me a long time to adapt to the new tone, the episodic nature of the movie is quite annoying and distracting.The romantic relationship between Wallace and his wife was pretty fine and acceptable at first, but then it overstayed its welcome a little bit. Whilst the reason for that is quite understandable, I couldn't help but cringe for a while.The villain is very menacing and almost everything about him is great, except that he provided us with an exposition of his plans many times. But, fortunately, likewise some cheesy lines, these scenes were justified by Gibson's excellent direction that gave them an epic sense, and therefore made them more passable.Randall Wallace's screenplay is more than enough to make the movie match its ambition. From the way we witness our protagonist from his childhood to become the hero he is, to the miraculous narrative control on the abundance of side characters and their sub-plots. All that made Braveheart a larger-than-life historical tale, and I don't care about how historically accurate it is because it's a great movie!(8/10)"
    },
    {
      "rating": "10",
      "text": "Utterly stunning, a motion picture for the ages."
    },
    {
      "rating": "10",
      "text": "The best movie that i have ever seen."
    },
    {
      "rating": "10",
      "text": "Absolutly amazing!! a true patriotic film, every time i return to scotland and every hogmany festivle we watch this, iv never seen so many grown men cry at the end of a film!"
    },
    {
      "rating": "7",
      "text": "Oh man. The one thing about this movie that just rubbed me the wrong way was the [***SPOILERS***] one thing that spoiled the whole thing for me- the whole thing is about his obsessive love for his first love, and avenging her- then he goes and sleeps with someone else and STILL her ghost meets him at his demise? Sure it's human, and not a big thing in practical terms, but when the entire movie is about this unrelenting passion for one woman, then veering from that compromises the integrity of the story itself."
    },
    {
      "rating": "10",
      "text": "This movie offers it all: action, romance, intellect, suspense and drama. My favorite movie by far."
    },
    {
      "rating": "10",
      "text": "I was curious to see what this movie was ranked by critics and normal folk alike. I must say that I am shocked to see it only getting a 66 by critics. Wow! Shame on some of you. In addition, I certainly don't feel like I need to comment on this movie; the people with good taste have already done that for me."
    },
    {
      "rating": "10",
      "text": "This movie has it all, drama, action, romance....the best movie i have ever seen, and with the best soudtrack I have ever heard."
    },
    {
      "rating": "10",
      "text": "When I rate a movie, I try to imagine the best possible scenario for that movie. Everything from the acting (e.g. Tom Hanks) to the cinematography was spectacular. I could honestly not imagine it done differently. It's an inspirational and captivating film that everyone should watch in their lifetime. Pure gold!"
    },
    {
      "rating": "10",
      "text": "This movie is a spectacular representation of what actually happened and is awesome to watch. It is intruiging and gory.. I love it!!"
    },
    {
      "rating": "10",
      "text": "This is one of the best movies ever made. Gibson is a true genius. He not only does a magneficent job as William Wallace, he directs and guides the film with such beauty and passion."
    },
    {
      "rating": "8",
      "text": "The battles are suprisingly good, even without CGI, and the violence is satisfying. It's more about standing up for ideals, the difficulties of doing so, and how your ideals influence others, which is pretty interesting and refers to even today's situations. It doesn't always resonate as it should, though, and LOTR has bypassed this epic in almost every category, but Braveheart is still a strong entry in the genre."
    },
    {
      "rating": "8",
      "text": "Braveheart is a very nice tale of oppressed Scottish folk standing up to the tyrannical English. It works in all the right places and succeeds despite historical inaccuracies and slightly over-the-top sentimentality. Kudos for having bloody battle sequences that still shock a good 18 years after the film was made!"
    }
  ]
}