{
  "id": 856,
  "title": "Brave",
  "starring": [
    "Kelly Macdonald",
    "Billy Connolly"
  ],
  "runtime": 93,
  "genre": [
    "Animation",
    "Adventure",
    "Comedy",
    "Family",
    "Action",
    "Fantasy"
  ],
  "description": "Brave is set in the mystical Scottish Highlands, where Mérida is the princess of a kingdom ruled by King Fergus and Queen Elinor. An unruly daughter and an accomplished archer, Mérida one day defies a sacred custom of the land and inadvertently brings turmoil to the kingdom. In an attempt to set things right, Mérida seeks out an eccentric old Wise Woman and is granted an ill-fated wish. Also figuring into Mérida’s quest — and serving as comic relief — are the kingdom’s three lords: the enormous Lord MacGuffin, the surly Lord Macintosh, and the disagreeable Lord Dingwall.",
  "releaseYear": "2012",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/1XAuDtMWpL0sYSFK0R6EZate2Ux.jpg",
  "categories": {
    "plot": 6.586206896551724,
    "acting": 6.766666666666667,
    "ending": 4.0,
    "soundtrack": 6.0,
    "cinematography": 5.0,
    "familyFriendly": 7.2,
    "funny": 8.631578947368421,
    "action": 6.769230769230769
  },
  "reviews": [
    {
      "rating": "10",
      "text": "i think brave have a place with a pixars movies like the incredibles and monsters inc because of the story of brave is not brilliant like up and wall e but he is exciting and funny enough to be a pixar movie :)"
    },
    {
      "rating": "10",
      "text": "Brave is a simple story, but told with such depth and magic it is hard not to love this movie. It isn't the studios best but it sure is great. Wonderfully voice acted by Kelly McDonald and the rest of the cast. And it is expertly and beautifully animated with wonderful detail. It is funny, emotionally resonant, and altogether beautiful. I give this movie 95%."
    },
    {
      "rating": "3",
      "text": "This does not stand up to Pixar's other work. It's sloppy and poorly executed, in short. It's overstuffed with plot threads and conflict but fails to find resolution for any or find a reasonable way to tie them together. It ended up being thematically contradictory. And maybe worst of all, it ended up being way more boring than it needed to be; the plot was so totally without ambition or surprise, it lacked interest as well. Let's talk specifics.\r Who was the main villain? Was it the twisted witch who created the spell that turned the queen into a bear? I guess not, because she disappeared in the middle of the movie. Was it the other clan heads? I don't think so, since they all joined together with the protagonists in the end--after we were told (and never, ever shown) that they had actually been best friends the whole time. So I guess it was the big evil bear who serves as the final boss then, huh?\r What was up with that bear anyway? Okay, so he used to be a prince but he tried to change his fate and was inadvertently punished by becoming a bear. So he's like a symbol of how we shouldn't try to change our fate, I guess? And then he attacks the clansmen because of his lingering, ill-advised drive to overtake them and become supreme ruler, right? Well, no, because after he's killed we see his spirit, and his spirit is apparently relieved and thankful that he was freed from the bear. And if the queen is any example, he had long since been acting totally under bear impulses the whole time. So the main villain was basically a wild bear and only ever enters the film because he just happened to be around, we guess? And then we had to kill him? Was anything in the film resolved with his death, besides just one less bear in the forest?\r How DID they kill him? Did the main character get to use her archery skills which were pretty heavily established by the first act, and every trailer and poster and promotional artwork for the film? Nope! Did the father finally have his revenge on the evil bear, which is pretty much all he ever talked about doing? Nope! Oh, maybe the clansmen all joined together and showed their renewed unity by defeating the legendary bear monster! Nope, that wasn't it. The mother and daughter join forces kinda but are pretty useless against the final boss, and instead they end up killing him by pushing a stonehedge rock on him. Which is pretty confusing, thematically, since the stonehedge rocks _also_ represented changing of fate in some weird way. And then the traitorous prince spirit gets relief, so... what are we even saying here? That he deserved to go free? Seriously, what point is being made here? Is changing your destiny good or bad?\r And hey for that matter why does the heroine always talk about \"changing her fate\" like that's a real, concrete thing that people can just do? So much of this destiny-speak just honestly comes off sounding like gibberish. And also also what the HECK was up the unbearably cheesy montages over unbearably cheesy female vocals? Where you hear a musical number about reaching for the stars while the daughter rides around on her horse with her hair rushing in the breeze? It's just silly.\r There's just so much wrong and so little time to illuminate all of it. Somebody needed to spend more time thinking about this and tightening the script."
    },
    {
      "rating": "7",
      "text": "While Brave is certainly smarter than your average animated film, it nonetheless lacks the charm that permeates nearly every other Pixar film. It's still a very solid film that features some fantastic voice work, but Pixar has yet to return to its true form of masterful animation filmmaking."
    },
    {
      "rating": "1",
      "text": "The worst Disney movies I have seen. Why is this getting such high rating? This caters to PC police and feminazi's, both of which I cant stand. On top of this, it was dedicated to one of the most pretentious people on the planet. There is nothing right with this movie, the feminist overtones are way too high, the obvious hipster/hippy feel of the plot, just... screw this movie! Hell no, worst Disney movie I have seen."
    },
    {
      "rating": "7",
      "text": "An average movie by Pixar, not reaching as strong as some of their past works, but still managing to hold memorable characters and well delivered morals. The main fault of this film is that it moved far into the realm of cliché, and quite early on the audience became more suited for children, but that does not deduct from the overall standards of the films."
    },
    {
      "rating": "6",
      "text": "Gorgeous, but shallow. While visually stunning -- Pixar really outdid themselves with the animation -- the storyline is cliched and unremarkable. There are some great moments, but this film isn't nearly as moving as some of Pixar's other works. The voice acting is solid, the music is great, but they could have done so much more with the story."
    },
    {
      "rating": "3",
      "text": "BRAVE is nothing short of an EPIC FAIL.\rI gotta give it to Pixar: even when they screw up, they do it big time. There is no saving this movie, and I have a hard time understanding all the good comments when it's so evident it misses all but the most important spots. Though visually impressive, I've hated it in a way I never expected, even more so because I've loved most of the previous Pixar movies, and respected those I didn't. Why? Because time and again, Pixar has always managed to impress me not just with its technical excellency, but most of all with the profound originality of its plots, the charisma of its characters and the beautifully detailed and rich atmosphere of its movies. There is nothing of that here! The characters are completely flat, unbelievable cliches, and Merida itself is the worst of them all, I've stopped tolerating her after like 5 minutes. The movie, more or less, manages to hold itself together in the first part, but it literally commits suicide in the first ten minutes of the second part and from that moment it's a long and painful downfall to the worst Disney story templates. When the script should capitalize on dramatic moments, it trips over itself with several sequences of bad comedy which, other than not funny, are downright irritating. The villain is virtually non-existent and the whole point of the story resolves in a pesky, predictable mother-daughter relationship renewal. The movie also suffers a lot from the celtic atmosphere remaining largely unexploited. Long story short: weak story, nonexistent characters and predictable outcome made this movie a miserable product way under the expectations. It could have been a great movie if only it had been developed more seriously."
    },
    {
      "rating": "6",
      "text": "Remember when Disney announced a couple of years ago that \"Tangled\" would be their last Princess movie?  They lied, or Pixar didn't get the memo.  Here is yet another.  Even though I didn't care for the \"Cars\" sequel from last year, at least it was still original.  This movie worries me because there is nothing original about it, and originality is what I have always loved about Pixar.  This movie is a fairy tale and you get the feeling you've seen it a hundred times before as you watch it.  They even copied the Irish accents from \"How to Train Your Dragon\" and \"Shrek\".  It has some humor in it, but not much, and the overall look of the film was dark although I saw it in 3D which admittedly darkens the screen a little.  I would rank it higher than \"The Princess and the Frog\", but WAY lower than \"Tangled\" (a Disney Masterpiece) if comparing to other Princess movies.  If comparing to other Pixar films it would be the second worse right before Cars2.  This makes two mediocre films in a row for Pixar.  Hopefully they will rebound on the next film."
    },
    {
      "rating": "4",
      "text": "I've been dreading writing this down. Specially when it comes to Pixar. I have loved every single one of their movies. Even Cars. Not that it was their strongest suit. But everywhere else, I always walked out of the movie theater being thankful this company came together. It's one of those you know extra care goes in to make things abnormally special.\rNot with this one. I can't put my finger on it. The trailer was amazing. I knew I had to see this thing. I had my enormous popcorn and even larger soda. All was going according to plan. And then a bear showed up... Yes. A bear... interestingly enough the people I went to see this with loved the bear thing. I just couldn't wrap myself around it. What the heck does someone turning into bear have to do with being brave in life. Ok, so the girl needs to be less selfish and follow her mother's dictate. As most children should. I'm with you there. But in the story they seem to promote that when you go out of your way to change your future against the establishment things turn out for the worst. I gotta say, I'm not down with that. If anything, the girl was selfish for involving her mother in her own rebellious attitude, that about the only message I see here... But, a bear?\rI did feel a couple of emotional moments. These guys know how to get you. They've done it enough times. And there is no doubt that the graphics get better and better. Take a close look at that girl's red hair. I can't imagine animating and rendering that thing.\rTruth be told, I am yet to come across anyone that felt the movie was below par. Everyone is recommending it, and, actually, so do I. Go see it. You won't be disappointed... I will say, though, this is no Wally. Now, that one, is more like what I expect of Pixar."
    },
    {
      "rating": "9",
      "text": "Although with its uneven pacing and really, really terrible jokes, Pixar is still deliver its best. I found Brave is pure, heart-warming and beautiful. I can't stand to mother-daughter drama, I even cry when the battle scene. One of the best releases so far."
    },
    {
      "rating": "9",
      "text": "Brave is an odd one from Pixar, they have never made a movie quite like this one before. Which is strange as it is really rather traditional, but seeing as Pixar has never done traditional before it makes \"Brave\" really stand out. Due to this fact it is hard to rank Brave up along with the rest of Pixar's films, as it is just too different. Now, the film strongly reminds me of \"How To Train Your Dragon\", which is no bad thing, but the humour is much more in the veins of the \"Aardman cartoons\" in its style. Without giving anything away, Brave is about a girl and her mum, learning to love each other: another classic storyline. As per usual in Pixar films Brave's voice acting is top of the line, offering the best of Scottish talent in great and finely tuned characters. There is one problem really, we didn't really get enough time with many of the characters which is a bit of a wasted opportunity as they are all fantastic and many of them provide the comedy throughout the film (like one of the other tribe's son's voice is impossible to comprehend, a very funny recurring joke, as no one else in the film can understand him either). All in all I don't think it's one of Pixar's best, but it does oddly stand out if you know about Pixar films, it is a little too short however, which is a shame as an extra 15 minutes would have worked wonders. 87/100."
    },
    {
      "rating": "5",
      "text": "Brave is the new Pixar movie and unlike others as Toy Story, Monsters Inc., or Up; it did not surprise me very much, the story and characters are repeated. The original thing is the protagonist, the first female leading character of Pixar movies and it is also noticeable that the main conflict is the relationship with the mother. This is like our actual society, in which woman can fight for their rights, speak up for what they want, decide which path to follow, live well without a husband and be able to raise a family on their own.\rAnother interesting thing about this film is the title and the ironic situation that hides, because Merida is brave, she fights with weapons, climbs cliffs and waterfalls and fights against wild animals. Although in order to change from girl to woman, she must be brave, but of another kind, which means brave to take her own decisions knowing and accepting the consequences, to honor the will of her parents and to ensure the good of her people.\rThe problem in the plot is the relationship with the mother, which occurs because nor Merida or Elinor listen to what the other have to say. The queen does not trust the ability of her daughter and Merida is blind by her stubbornness. So Merida must change the fate, look inside, mend the bond torn by pride.\rFinally, the images of Brave are amazing, the characters, the landscapes, the animals and especially the hair of Merida which is astonishing, totally worth the creation of a new software."
    },
    {
      "rating": "8",
      "text": "Inadvertently I have watched this two Disney animations hand-in-hand (TANGLED is from the orthodox Disney branch while BRAVE is its flagship Pixar production), which seems to be a perfect paradigm to juxtapose them together and to dissect the state-of-the-art tendency of the mainstream genre (enormously profitable  since its chief target are zero in on family with children, so it has a much more important and instructive obligation other than merely an entertainment for the toddlers and above). Coincidentally both films' heroines are princess (Rapunzel in TANGLED and a Scottish Merida in BRAVE), adapted from Grimm Brothers' tale, TANGLED is supremely reminiscent of Disney's other established princess analogs trapped in a magic world, let's say Snow White, Sleeping Beauty and Cinderella, what's more, there will always be a prince-charming to deserve and requite her love. Wisely Rapunzel's Flynn Rider has been sizeably modernized as a reckless, self-mocking yet conservatively \"Disney\" prince with a thief background. But in BRAVE, Merida is a much more radical rebel by blood, she doesn't have or need a prince with white horse (the film doesn't care to proffer one since all her tribe suitors are one-of-a-kind wackos), she is fighting against her predestined life path which her mother has arranged for her and her status has requested her, a tad thread-bone notwithstanding, but chronicling with a single-linear arc, the mother-daughter predicament has slipped to the hanging-by-a-thread situation when a magic spell transfigures the Queen's appearance into a bear which cannot be recanted after the second sunrise, therefore, instigates an intimate bonding phase for the two, viscerally the mutual love only exudes when something unusual happens, while living in the mundane life, we are all suffering and grated by the love with a insurmountable generation gap.    Rapunzel, on the other hand, her main barrier is the ultimate breakthrough from her \"mother\" Gothel (a greatly overlooked Donna Murphy), who raises her and locks her up in the tower for 18 years, treats her as her own out of a selfish but very understandable motivation (to rejuvenate her youth), but out of any sequential transition, all of a sudden Rapunzel miraculously remember her princess identity (she was taken away when she was an infant, so I doubt there is any memory there, more like an implausible epiphany or actually a screenwriter's block), what's more unbelievably awkward is that she immediately snarls back to her \"mother\" as if all the recollections of Gothel's evil scheme has been replayed in front of her eyes and she has been tortured for all that year long (actually she is fairly happy and content alone with her cutesy chameleon) , which I deem as a child's play, very much panders to its core audience of pre-school demography.   So, from a vantage point under the contemporary context, BRAVE is far more daring and enthralling from its \"no guts no glory\" premise, it is able to identify with a way broader audience, which is also the main ingredient of the winsome recipe \"why Pixar can keep excelling all its peers (if not itself) on the top-tier of the hierarchy\", in spite of that on a technical level, all the major animation studios in Hollywood (DREAMWORKS, BLUE SKY STUDIOS, etc.) are almost equally cutting-edge. Music is Disney's strong suit, the first half of TANGLED is a conventional musical showcase, culminating the saccharine romance with the Oscar-nominated theme-song I SEE THE LIGHT, fusing with an intoxicating lanterns-all-over-the-sky spectacle,  this has always been the tactic to emit Disney's overblown sentimentality, I am certain it is no longer an all-age proof method now. In BRAVE, although Kelly Macdonald and Emma Thompson's heavy Scottish accents do not get along with my ears, the exotic score and tunes are generally agreeable, and what's more admirable, it doesn't steal the thunder of the film per se. Honestly speaking after the astonishingly-acclaimed WALL-E (2008, 9/10), UP (2009, 9/10) and TOY STORY 3 (2010, 9/10), I automatically skipped last years CAR 2 (2011), BRAVE is a left-field choice, the scale of the story has been slimmed down to a quite unimaginable mother-daughter clash, even grafting it on the most platitudinous soil of a princess's tale. But by good fortune, the film doesn't smear Pixar's paramount reputation, Merida goes through a well-deployed rite-of-passage and the sub-plots such as the blue wisps, the ancient lore of the discontent brother and the witch's hut are all positioned into the right niche to uplift the mythology and idiosyncrasy of the film. As for TANGLED, Disney will never relinquish its tradition (otherwise Walt Disney will definitely be jumping inside his tomb), and it is also an exquisitely-made piece of work, just unfortunately paled by comparison by BRAVE since there is no sparks glittering and all the chirpy happiness seems synthetic and a bit stale."
    },
    {
      "rating": "6",
      "text": "hmm, idk what about it, but i just didn't like it. i found the story a bit bland, and the adds advertise it as something else then it is. its told to be a fable-fantasy movie, but then it turns out to be one of those story's were someone finds out how important family is (and of course everything is the same in the end) however, the details in the graphics were inexpressive, however, i did not come to the movie to see graphics. i came for a story, however, i did not get that as much as it was promised. the add showed the funniest and most action filled moments. with kind of changed my expectations in the movie. so don't come into it expecting a comedy, or an action film. expect a Disney story."
    },
    {
      "rating": "8",
      "text": "It's a little late but I finally saw Brave with my 6 year old son. The animation is magnificent, and the storyline takes the fairy tale princess into some uncharted areas. Merida (voiced by Kelly MacDonald) is a ginger-haired princess in medieval Scotland. Her father, King Fergus (voiced by Billy Connolly), is a brute of a man who loses a leg in a fight with a bear called Mor'du. He has a soft heart for his daughter who is also his first-born. From the time she is a tiny girl, he insists on giving her bows and arrows for gifts instead of the usual \"girly\" gifts, much to the chagrin of her mother, Queen Elinor (voiced by Emma Thompson). The mother/daughter relationship plays a central role in the plot of this film. Queen Elinor is a complex character. She is at once strong, gentle, graceful, assertive, and very much a lady. She knows her place in this world and wants the same for her daughter. All of her parenting decisions are based on preparing Merida for her future as a princess.\r At first, it seems like it might be like all the other princess movies: the princess comes of age, the parents want to marry her off to an eligible suitor from a noble family, and she rebels against the tradition. At which point, trouble ensues. But in Brave, the story takes some unexpected turns. After she has trounced her suitors in an archery competition, she takes off on her own in search of her fate. There are some beautiful images in the middle section of the film, complete with airy, phosphorescent Will o' The Wisps and a cunning witch. Never was it more true that one should be careful what you wish for, as you might just get it and all of the unintended consequences that come with it. I want to be careful not to spoil the film for anyone who has not seen it, so if the next bit of the review feels vague, it is intentionally so. Merida wants so badly for her fate to be different than it is, some major changes occur for her and her mother. Being a daughter myself, I can attest to the complex nature of the relationship between a daughter and her mother. Invariably, the wishes of the mother clash with the wishes of the daughter and in a show of independence, a rift sometimes occurs. And sometimes it takes a crisis for both parties to grow and to come to know each other as equals. This must surely occur before a mother and a daughter can have a functional relationship. All of this is brought to life on the screen in Brave. But don't worry. There is plenty of action for the boys in your life. There are kilts and the usual kilt jokes that go along with them. The other clan members are quite funny as voiced by such talented Scots as Kevin McKidd and Craig Ferguson. As I mentioned before, there are bears in the film, and these scenes are quite frightening. They are short, but you might need to warn your little one that it is a Disney film and most things turn out ok. Be prepared for them to beg to leave the theater, though. But it is well worth staying to the end. Use  caution with kids under 5 or 6."
    },
    {
      "rating": "8",
      "text": "A great animated film that presents the incredible story of a redheaded girl and her magical adventures."
    },
    {
      "rating": "8",
      "text": "\"Brave\" is yet another beautiful masterpiece from Pixar Studios, telling the story of a Scottish princess who causes chaos in her efforts to be independent, and her gripping adventure to fix it. As can be expected from Pixar, the film is gorgeously animated and a pure joy to watch, and as a whole is one of their more entertaining and intelligent mixes of humor, zaniness, and heartfelt storytelling"
    },
    {
      "rating": "8",
      "text": "Of all the Pixar films, this one has me REALLY conflicted as to my opinion of it. The first 30 minutes set up a movie that looks to be something of legend. Then, it goes all Disney on me!? Totally changing the narrative to something else completely. A real shame. Had it continued the way it was going, it would have been phenomenal. But, that mild disappointment aside: It still manages to be very charming and delivers a movie worthy of Disney  Pixar. If anything this is the first Pixar film I can say is a perfect example of the two studios working together as one. Animation is spectacular. Voice acting is excellent. Writing is. Is! Is? A little disjointed but that aside still rather charming. Overall: A real shame that the movie wasn't \"Brave\" enough to be a bit more daring and take the leap that it looked like it was going to. Still, the Disney route was still allot of fun too."
    },
    {
      "rating": "10",
      "text": "Brave is new, is simple. Brave is a touching story about mother-daughter relationships."
    },
    {
      "rating": "5",
      "text": "The trailer made it look like it had a really good story but then goes of some random tangent, lost our interest.  Probably Pixar's worst movie! skip this one."
    },
    {
      "rating": "7",
      "text": "This should not have won best animation(Wreck-It Ralph was much better). While better than Cars 2, I think that the writing was a little weak. It kind of felt like Pirates of the Caribbean 3 when they turned into bears. Not to say I didn't like this movie, but there were better animations in 2012."
    },
    {
      "rating": "5",
      "text": "I don't know why this film rated PG. Bear violence? This should be given an R rating! Nah, just kidding. But however, boys won't like this film like me, and if you expect another masterwork from Pixar, you will be dissapointed."
    },
    {
      "rating": "7",
      "text": "Good, but not as good as other Disney/ Pixar collaborations. It ranks above Cars 2, but it's just about the bottom from there. With movies like Wall-E to live up to, that fact is not surprising. I'd say it's one of the greatest animated movies of the year however. The main character is spunky and fun to watch. As are the rest of the family. In fact, most of the characters were interesting. It had a few really good laughs and chuckles throughout. If you have seen the trailers, do not be fooled. It is not really an adventure across the land as advertised. the commercials did a terrible job of showing this movie. their are no hints as to the plot. which in some ways is good, but many would be surprised as to the plot. Interesting, but not the best. That is why I gave it a 7."
    },
    {
      "rating": "8",
      "text": "After a dissapointing Cars 2 from Pixar, I hoped Brave would make it up, and it kinda did. The story is simple and not the best thing of this movie. The characters are superb, there is like this girl named Marida who is in my eyes a badass. Than you have his dad who is like a cool dad, and than you have also other characters who are very nice. The animations are very beautiful with so many details. But some thing aren't very good: there isn't very much bow and arrow, especially in the second half of the movie, the worst part and the ending is meh. The movie is good but not as you would expect from a Pixar movie."
    },
    {
      "rating": "8",
      "text": "Not on par with your typical Pixar fare, but this is still incredibly well-animated and affecting as an interesting folklore.  Also, the development of new animation technology to add 3D layers to the characters should be noted."
    },
    {
      "rating": "3",
      "text": "Plot wise it is hard to believe it is a pixar movie. The story is flat and boring. While, other Pixar movies such as Up, Finding Nemo, Monsters Inc., and so many others were instant classics that anyone no matter their age could enjoy, this was a 1 character story that could be explained in 10 seconds. I get what they were trying to do by having a female princess who was tough and tomboyish but it felt like that was all the movie was and that simply isn't enough for it to be a great movie. Pixar isn't the only studio in town anymore, with rivals making masterpieces such as Rio and Bee Movie. I hope that this is only a 1 time hit and miss from Pixar because it would be a shame if this is when they start going downhill."
    },
    {
      "rating": "10",
      "text": "I didn;t think this sound like the best concept for a disney/pixar movie, but me and my friend went to see it because she legit looks like the main character Merida and it was all a bit of a joke really. However, this movie really surprised me, in fact I love it! I will watch it over and over! It's comical and has a great story line which is truly unique to anything else. The movie centres around a strained relationship between mother and daughter which most people can relate to, and how they decide to resolve their problems."
    },
    {
      "rating": "5",
      "text": "Unfortunately, Brave is too thinly plotted to be on the level of animated films like \"Up\" and \"Toy Story 3\". Sure, Cars 2 may not have the charm of previous pixar shows, but at least the plot knew where it was going. Brave is a risk that doesn't pay off because Merida doesn't get the narrative she deserves. Merida is a great character, but she deserves more than this."
    },
    {
      "rating": "10",
      "text": "Last year, Pixar gave us Cars 2. Critics and audience members alike were appalled at the product. It was no where near the masterpieces that Pixar had brought us previously. But while it wasn't perfect, I still enjoyed Cars 2. But I definitely didn't want Pixar to keep making movies like Cars 2. I wanted more masterpieces. So Brave comes along. The film that everyone is hoping will save the day and remind us all why we love Pixar.\r Unfortunately, many critics aren't all that impressed with Brave, and while MOST of the critics liked it, the reception has been a little disappointing, especially when you consider how well the rest of the Pixar films have done. Brave is being considered one of the worst Pixar films.\r But I think this is bizarre. I'm not quite sure why this is being met with such lukewarm reception. Brave is nothing short of a masterpiece. In fact, it's one of Pixar's BETTER films, in my opinion.\r Brave (originally titled The Bear and the Bow) is about a princess named Merida who wants to be an archer. Unfortunately for her, Merida's mother, Elinor, wants Merida to be a bit more ladylike. Merida puts up with her mother, but when she's being forced to marry before she's even ready. There's an argument between the Merida and Elinor, a witch, and next thing you know Elinor is a bear. So Merida must change her mother back to a human and at the same time, regain her bond with her mother.\r Brave has all the ingredients that every good movie needs. For one, the characters are very memorable. I doubt any of them will replace anyone's favorite Pixar character, but they're funny and well developed. Also, Brave is very funny. It's not as humorous as Up or the Toy Story films, but there's enough gags to entertain adults and kids. Admittedly, some of the humor feels a bit more tilted towards the Dreamworks canon, but I still found myself laughing often.\r The last main ingredient; heart. And Brave has heart to spare. Pixar has almost always managed to make me cry, I don't mind saying. But then came Cars 2. Sure it made me laugh, and the animation impressed, but I never felt any real emotional connection with anything going onscreen.\r But Brave reminded me why I look forward to Pixar films every year. I did cry at times, and there were times when I held back tears. Brave is one of the most moving pictures I've ever seen. Seeing Merida and Elinor's relationship grow as the film progresses, and the sacrifices they make for each other is particularly moving. Rarely do I feel so engaged with the characters.\r Some critics were complaining about the uneven tones. From soft mother-daughter scenes, to boy-ish humor. I actually LIKED the shifts in tone. There were times when things got a little tragic and humor really helped to lighten the mood.\r Patrick Doyle composed the score for Brave. This is his first time scoring a Pixar film, and having heard very little of Doyle's scores, I wasn't sure how I'd like his music. Well, Doyle has proved himself a hundred times over. I was extremely impressed with the score, and hope to see Doyle compose more Pixar films in the future.\r The voice acting is, as usual for a Pixar film, superb. The voices are a little more recognizable this time around, but in the end, I wouldn't have changed anything. Kelly MacDonald does a more than respectable job as Merida, while Emma Thompson does excellently as mother (though unfortunately, she spends most of the movie as a bear). And Billy Connoly does a hilarious job as Fergus, Merida's rambunctious father.\r And naturally, the animation is gorgeous. Easily outdoing any of Pixar's previous films. Trees, water, mist, hair, all of the above. Pixar does an eleven-out-of-ten job on their animation, making Brave the best looking animated film of the year thus far.\r Brave is being unfairly labeled as one of Pixar's weaker films, and a merely decent film. Brave is, in fact, a masterpiece and hopefully the so-so reviews and the female protagonist won't stop male audience members from seeing it. Cars 2 was decent, but left me nervous as to Pixar's future. Brave has put all those fears to rest. Pixar is back baby: Hopefully forever.\r Note: Brave was preceded by a short film entitled La Luna. This was both imaginative and magical. Don't come late or you'll miss it, and you will not want to miss this."
    },
    {
      "rating": "9",
      "text": "Pixar has made another great animated film! Pixar has come back after their worst reviewed movie, Cars 2. Even though it isn't flawless like Ratatouille and The Incredibles, it still delivers a very comedic and action packed movie. Pixar has definitely made a comeback."
    },
    {
      "rating": "10",
      "text": "Great movie.  Yes, it does not break new ground for the most part, following traditional disney fare.  But as a father of a five year old girl, I cringe every time my daughter wants to to see The Little Mermaid, or Beauty and the Beast.  Brave has a strong female lead, good story, stunning visuals, and breathtaking score."
    },
    {
      "rating": "10",
      "text": "People seem to be complaining about Pixar somehow letting themselves down by doing a formulaic Disney/fairytale Princess movie but I didn't see it that way at all. Yes, that's basically what it is. But first of all, what's wrong with that? And secondly, it's not as formulaic as I expected. There are many very familiar elements, as there are in all fairy tales, but what I loved was how Pixar found ways to put a fresh wrinkle on those elements.\r Primarily, I loved the fact that here, for once, is a princess movie that absolutely does NOT rely on the princess falling in love with or being rescued by a handsome prince. I've always wondered why fairy tales so consistently teach young girls that they need a man to solve their problems for them. Many modern retellings of fairy tales do take a more contemporary approach by presenting a spunkier, more independent princess who doesn't need the handsome prince, but Brave deviates much further by not having a prince at all. Merida doesn't fall in love, doesn't meet the man of her dreams, because that's not what she needs and it's not what the movie is about. The movie's love story is between the girl and her mother - and how often do you see that? The movie, like Merida, is emotionally independent and follows its own path despite the traditional expectations placed upon it.\r Other familiar elements are given fresh takes too. I love that the witch is not evil, she's simply just not very good at being a witch. Even though the movie is set in a romanticized fairy tale version of Scotland it felt very authentic to me. Certainly moreso than How To Train Your Dragon - which I also loved, but I couldn't get past the bizarre decision to have the faux-Nordic heroes speak like Scots, except for the hero who for some reason was American.\r The movie also has more than its fair share of hilarious Pixar sight gags and character moments. Oh, and can I just say that I love how Pixar consistently casts ACTORS rather than falling victim to the celebrity-casting trap that so many animation studios do. I need to see it again (just found out there is a Dolby Atmos cinema here in town) but I think it might actually be my favorite Pixar movie already. I could find nothing wrong with it."
    },
    {
      "rating": "10",
      "text": "Love Love Love this movie! this movie is Completely a pixar movie! Amazing story not one of the BRILLIANT pixars movie נוא Delivers the good of the summer and the pixars movie"
    },
    {
      "rating": "5",
      "text": "I was really disappointed with this film. I was looking forward to a great movie, but Brave is very bland. The main heroine is a very unlikeable character, because she's very selfish and even seeks harm to her own mother. All the male characters are bumbling idiots and can't even comprehend something that's being yelled in their face 5 times in a row. The main bear character, without giving away too much about the story, is very repetitive in its manerisms. All the main characters are very unlikeable... and when you reach the point where you are not cheering for anyone in the story, you don't care about anything that happens to them. The only positives I can say about this film is that the computer graphics were amazing to look at, and the witch and triplets were entertaining (but only had a combined 15 minutes of screen time). I'm sure kids will love this movie, especially little girls who want to see a strong female character. However, for the adult crowd that appreciates a family film that includes feeling and humor, this movie missed the mark by a mile."
    },
    {
      "rating": "8",
      "text": "The digital wizards at Pixar have an incredible dossier of Academy award-winning animated films. Their latest film"
    },
    {
      "rating": "10",
      "text": "Better than Cars 2 and Cars. The movie's special effects are new to Pixar but great nonetheless. A fantastic introduction to Future Female Pixar heroines."
    },
    {
      "rating": "9",
      "text": "Pixar has done it again. This movie is simply magical, and great for families. It's beautifully animated, has excellent voice acting, and a heart-warming story. I have to admit after watching Cars 2 I was a little worried that this movie might flop, but Pixar has once again struck gold."
    },
    {
      "rating": "7",
      "text": "Brave Is A Solid Good Movie. I Don't Like How This Can Be The Most Popular Childrens Movie Of 2012 And Then Studiuo Ghibli Is Stuck In The Ground. Watch A Studio Ghibli VS Pixar. GHIBLI ALLWAYS WINS IN MY BOOK!"
    },
    {
      "rating": "10",
      "text": "It was a great movie! This movie has a great levek of depth and magic. It is simply beautiful. There was great humour, intresting characters and most important of all showed great values of family, friendship and self belief. This movie reminds you of those simple things in lifethat make us who we are and sometimes we take forgranted. Its a perfect movie. I highly reccommend it! This movie deserves greater reviews and scores."
    },
    {
      "rating": "10",
      "text": "This is so far the  only movie I have ever been motivated to write a review for, it was a story that I totally got into and lost myself. Seeing the daughter and mother work through their two different life views in this magical world was totally exhilarating. Their transformation both literal, and figurative spreads freedom and the ability to define ones own destiny throughout their kingdom. Every young girl should see this movie, if only to realize that the inner strength she holds within is best used when selfishness and petty fears are pushed aside."
    },
    {
      "rating": "8",
      "text": "While this is not Pixar's greatest film. It looks incredible and the simple story allows the tension and depth of the characters show through. Every character is given room to breathe, and the story is more fun and scary (at times) because of it. Very enjoyable."
    },
    {
      "rating": "8",
      "text": "i liked brave, but ot as much as i'd hoped. granted, the last pixar movie i've seen is up, and that one is in my top 10 movies ever seen. brave played out like a sort of standard fantasy adventure movie, but as one of those, it's still a good movie."
    },
    {
      "rating": "8",
      "text": "Brave was a film set up to fail. During the time Disney was coming back from Cars 2 and John Carter so this wasn't looked at in the best light. Also its something entirely different for Pixar. But as soon as watch in awe the first act you are set up for a classic....you don't get a classic but you get a very very good movie. The visuals are spectacular....also one of the best examples for 3D.  The story is also very good...a nod to the mother-daughter relationship. As you can see this movie is set around the women...the men are well idiots to say the least, except for the triplets they are on a class of their own. The plot is great the only thing that it lacks is that edge. Even if its something new for Pixar its not entirely new for Disney."
    },
    {
      "rating": "8",
      "text": "I remember when Pixar creating good movies, Toy Story, Monsters Inc, The Incredibles, Up, Ratatouille, Wall*e. The last year we watch Cars 2, the ill-fated sequel of Cars. Now they try return with Brave... This new movie is really interesting in some parts but have some things wich appear more of a Disney movie, but the movie is really good. The trama is about Merida (the girl who looks like Shaun White) a girl who wan't reign, after she transforms her mother into a bear (yes like in Brother Bear), but the people of the kingdom hate the bears and her father try kill her mom, and appear a really bad bear and he was a man. Ok the trama it's same that the Bear Brother trama, but the development is funny and emotive, the animation is really excellent. The characters are amazing have cool moments along the movie. Brave obviusly is not the best Pixar movie, but is better than Cars 2, and with this demostrate that they can return to the throne."
    },
    {
      "rating": "8",
      "text": "After watching this movie in 3D, I said to myself what a great movie that I saw. Brave provide a great style of Pixar that can be watchable by everyone including adults and children. It's  the best animation movie that I have seen this year and it will be nominated for Oscar for sure."
    },
    {
      "rating": "6",
      "text": "Sure, 'Brave' has stunning animation. What else? By that I mean: What else is there that we haven't seen before, but have come to expect from Pixar? Exactly. This is a mild animation entry that certainly is worth your money, but maybe not your time. It's great to look at. Your kids will love it. But the majority of moviegoers have lived long enough to be able to demand more from a feature than something neatly packaged, while remaining hollow deep down. Admittedly, there are glimpses into the movie that could of been, or was at least imagined to be, but 'Brave' isn't it. In fact, while nowhere near as horrible as 'Cars 2', it stands as one of Pixar's laziest efforts."
    },
    {
      "rating": "9",
      "text": "A PERFECT MOVIE\r This may not be the greatest movie Pixar has ever made, but it's a gentle, funny, perfectly satisfying movie. I believe it's a classic. One thing I like is that there's no malice in it, anywhere. No bad guys or gals, just ordinary people making each day's ration of mistakes. Brave provides a model for girls, to be leaders, to be truly accomplished at something, and to expect to be recognized for it. This was the best movie experience I've had all year."
    },
    {
      "rating": "8",
      "text": "I absolutely loved this movie. Its one of my favorite Pixar movies and my second favorite movie of the summer (Sorry but The Avengers still reigns supreme). The animation is absolutely amazing and don't even get me started on how gorgeous the animation for Merida's hair is. Don't even bother with the ridiculously lukewarm reviews that the critics have been giving this movie. Go see Brave ASAP!"
    },
    {
      "rating": "7",
      "text": "This film which is animated is set in the olden times of Scotland, gives us a glimpse of what Disney/Pixar think about the old days, it"
    }
  ]
}