{
  "id": 2823,
  "title": "Breaking News in Yuba County",
  "starring": [
    "Allison Janney",
    "Mila Kunis"
  ],
  "runtime": 96,
  "genre": [
    "Comedy",
    "Drama",
    "Crime"
  ],
  "description": "An overlooked pencil-pusher catches her husband in bed with another woman, the shock of which causes him to die of a heart attack. So she buries his body and takes advantage of the growing celebrity status that comes from having a missing husband. But she quickly finds herself in over her head, dodging cops and criminals, all while trying to keep the truth from her sister, a local news anchor who’s desperate for a story.",
  "releaseYear": "2021",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/pMyCYtgfBmMisX3RFc5eH6zIV5Y.jpg",
  "categories": {
    "plot": 6.333333333333333,
    "acting": 6.0,
    "ending": 5.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 7.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "5",
      "text": "Allison Janney stars as an under-appreciated housewife who decides to get attention by exploiting her missing husband (Matthew Modine). Since he was indeed involved in nefarious activities, this spirals into a madcap string of events involving an assortment of rather bland characters played by Regina Hall, Awkwafina, Juliette Lewis, Mila Kunis, Ellen Barkin and Wanda Sykes (who manages the only laffs in the whole film playing herself). While all of these accomplished actors are doing their best, the rather bland script doesn't give them much opportunity to shine. Director Tate Taylor (The Help & The Girl on the Train) keeps the pace up and handles the few quick violent scenes with aplomb, but even with the jigsaw puzzle of predicaments, he can't overcome the lack of solid or amusing original writing."
    },
    {
      "rating": "7",
      "text": "I liked it. Don't know why so many disliked it, I think it was a quirky black comedy type movie. Not saying it doesn't have flaws and so on, but I did enjoy it"
    },
    {
      "rating": "2",
      "text": "Considering the cast, I don't know what the hell they wanted to do here.This is a total failure, in every single way."
    },
    {
      "rating": "7",
      "text": "Put this down as a guilty pleasure like a car accident you can't stop watching.  It's offbeat and over-the-top but somehow satisfying.  The cast is beyond the plot with memorable character portrayals by Awkwafina, Juliette Lewis, Wanda Sykes, Jimmi Simpson, Ellen Barkin, and Clifton Collins, Jr."
    },
    {
      "rating": "9",
      "text": "Cleverly done. You yell \"WTF\" so many times as you continue watching. A good comedy. Good and silly... I loved it. I totally get it"
    }
  ]
}