{
  "id": 4866,
  "title": "Breaking In",
  "starring": [
    "Gabrielle Union",
    "Billy Burke"
  ],
  "runtime": 88,
  "genre": [
    "Thriller",
    "Crime",
    "Action"
  ],
  "description": "Shaun Russell takes her son and daughter on a weekend getaway to her late father's secluded, high-tech vacation home in the countryside. The family soon gets an unwelcome surprise when four men break into the house to find hidden money. After managing to escape, Shaun must now figure out a way to turn the tables on the desperate thieves and save her captive children.",
  "releaseYear": "2018",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/nuCxJwcQOEKYoiHTgcf4em8TxWv.jpg",
  "categories": {
    "plot": 3.7058823529411766,
    "acting": 3.0833333333333335,
    "ending": 5.0,
    "soundtrack": 5.0,
    "cinematography": 4.0,
    "familyFriendly": 4.0,
    "funny": 4.0,
    "action": 2.1052631578947367
  },
  "reviews": [
    {
      "rating": "4",
      "text": "Breaking In is not a terrible movie, just a completely unnecessary one. It brings absolutely nothing new to the cinematic table and is a complete rehash of bits and pieces from older, better movies like Panic Room. If you can name a home-invasion thriller cliché, it's definitely present in this film in some form or another, and in abundance.I'll start with the positives here. For the most part, it's a well-directed movie. Much of the cinematography is nice to look at, providing a visual atmosphere that effectively sets a tension-filled tone. But that's about all the good I can say about it. Where the direction fails in its purpose entirely is in the action sequences. Every fight in Breaking In is ridiculous to watch. It doesn't look real, it's dragged out to unnecessarily long lengths, and the only reason the action carries on is because the characters make stupid decisions that, if avoided, could have ended the story in minutes. In addition to that, there are some parts that are shot in slow-motion for no reason whatsoever and I found myself laughing hysterically at the absurdity of it all. These flaws completely deflate any tension that was built up over the course of the story.The acting is far from awful, but certainly does not contain any stand-out performances. That's mostly due to the fact that the writing is often lazy, forced, and cheesy, and the characters are built in such a way that they just add to the list of clichés. You've got the level-headed thug who takes the lead, the brutal one who suggests that any violent action is justified, and the one who just wants the money and is too scared to resort to violence. The crew of antagonists is literally exactly the same as the ones in Panic Room and every other movie of this genre.It's clear that everyone involved in this production was trying to make a good film. There's a lot of talent present behind the camera and the actors really do their best, but it's a real shame that the premise and script inevitably result in a generic thriller that cannot overcome its tropes.Story: 2Acting: 7Script: 2Visuals/Sound: 6Entertainment Value: 4OVERALL SCORE: 4.2/10"
    },
    {
      "rating": "4",
      "text": "Shaun Russell takes her son and daughter on a weekend getaway to her late father's secluded, high-tech vacation home in the countryside. The family soon gets an unwelcome surprise when four men break into the house to find hidden money. After managing to escape, Shaun must now figure out a way to turn the tables on the desperate thieves and save her captive children. Breaking In is proof that Gabrielle Union deserves more leading roles -- particularly in films that offer more than this rote, disposable action thriller. Breaking In gets a C."
    },
    {
      "rating": "8",
      "text": "This film is about a mother trying to protect her children from a group of thieves who are after her father's hidden fortune. Yeah, it's a familiar concept. If you've seen Panic Room or similar home invasion or robbery thrillers you'll probably predict most of the film. The characters are all tropes as well. However, this is a very competently made film and I was entertained nonetheless.Interestingly, the quality increases as the film goes on. The beginning is the most the formulaic and least interesting. (There is one bit of over-the-phone exposition that is so forced, it's painful.) While the film is the most interesting and unpredictable at the very end.The movie makes the wise choice of keeping things interesting by individualizing the crooks and having them have differing,and at times conflicting ways of handling things, rather than having them being an indiscernible group of generally evil people. The highlight of the film hands down is Billy Burke as the cunning, understated leader of the gang.Though far from an original film, Breaking In is by no mean a waste of one's time."
    },
    {
      "rating": "1",
      "text": "The #MeToo movement is surely proving itself, showing quite the impact it has made and continues to make in Hollywood in 2018 so far. Thanks to a much-needed rise of female directors making feature films, as well as female-centric storylines including kick-ass heroines and action stars, Breaking In is contributing to an increasing canon and genre of films where girls can have as much fun as boys beating up the bad guys. Don’t get me wrong, audiences luckily have had some of the best female action heroes thanks to actresses like Uma Thurman in Kill Bill, Chloë Grace Moretz in the Kick Ass action film series and of course, Marvel’s own female protagonists with the likes of Scarlett Johansson as Black Widow, Evangeline Lilly as The Wasp, Elizabeth Olsen as Scarlet Witch, to the upcoming and anticipated Brie Larson as Captain Marvel. With Breaking In, Gabrielle Union joins a long list of strong women who never take no for an answer and fight back, even when the going gets tough. Aside from being added to a list of female action stars, Union joins the prestigious ranks of Taraji P. Henson, Pam Grier and other prolific African-American women who have placed their names in the history books of women who fight back. Yet, with Breaking In, one of the more interesting factors of Union’s hero is the fact that she is also a mother! While the film is programmed specifically for the Mother’s Day weekend in North America, Union’s character Shuan Russell, demands much attention, for the simple fact that, unlike many of the other names mentioned previously, Union’s Shuan is no hit-woman, super hero or spy. Instead, Breaking In is a film that showcases the great lengths a mother will go to protect her family in the face of danger and violence.What seems as a clichéd take on the home invasion action genre, quickly becomes a very meticulous and thought-out showcase on a very raw concept. Breaking In shows its strengths by being as embedded into reality as possible; an action film that really doesn’t over glamorize the conflict; never exploits the spectacle to Michael Bay heights, instead Breaking In shows the very talented ability to exercise its restraint in being a very realistic actioner.While Breaking In is not a perfect film by any means, suffering from various guilty continuity errors, as well as not really developing any of the antagonists and their motives and methods as well as criminal backgrounds, it does a very good job of allowing Union’s Russell to use her common skills and knowledge in defeating a very menacing and threatening group of evil men.Billy Burke, a face many would recognize in the Twilight trilogy as Bella’s loving father, plays the mastermind behind the robbery, Eddie. Elaborate and cunning, Eddie’s plan unfortunately doesn’t go as planned once Shuan and her children decide to spend the weekend at her father’s house after his death. Joining the sinister Eddie are Sam (Levi Meaden), Duncan (Richard Cabral), and Peter (Mark Furze), three criminals who agree to rob the old man’s home in search of a hidden fortune.While Shuan travels to the home with her two unwitting children Jasmine (Aijona Alexus) and Glover (Seth Carr), the children quickly get held hostage by Eddie and his gang, forcing Shuan to take desperate measures and actions that push the boundaries of fear to desperation, and challenge Eddie’s very strategic plan.Breaking In is a popcorn film in its entirety. With a brisk runtime, to very fundamental action set pieces to two-dimensional character development, along with some very surprising twists in the narrative, the film doesn’t offer too much new and fresh material to the genre, yet engages its audience with hurdles of thrills and suspense. Union shows her star-power as a desperate mother who is willing to give up everything and anything to ensure the safety of the people she loves the most.Breaking In may not be breaking any records or limitations, but does a masterful job of showcasing Union and her very physical action role with poise and elegance, truly allowing the audience to believe that when a mother has her back against the wall when it comes to her children, she is capable of anything; and in 2018, I really don’t think that there is a more relevant message to tell young woman and mothers all over the world right now than that. Breaking In really keeps its promise and pushes the film’s tagline that revenge really is a mother…"
    },
    {
      "rating": "4",
      "text": "Very nice movie. Good rhythm, I love the main character, the us Good! This is a king of a movie that the good guy wins against the bad guys. And I like it."
    },
    {
      "rating": "7",
      "text": "I thought this was a very good and well made film.  Gabrielle Union is good as a Mom trying to protect her children from some psychos who are after millions of dollars in a safe in her father’s home.  Ner father has been killed and now she has gone to his weekend home/mansion to meet a realtor and out it on the market.  She and Dad never got along.  Some elements are kind of contrived, for sure.  But, there is certainly enough suspense and tension to keep an audience entertained.  Billy Burke is effective as the head honcho of thieves and Richard Cabral is very creepy as a psycho partner in crime.  And, yes, it’s not anything new and the story is similar to others, but that doesn’t mean you can’t enjoy the ride.  We sure did."
    },
    {
      "rating": "3",
      "text": "Gabrielle Union shows she can get better roles, while the director James McTeigue shows he's still in the minor leagues and he still unable to upbest what he did in his best film: V for Vendetta."
    },
    {
      "rating": "1",
      "text": "While I desperately wanted to be impressed by a movie with a Black female lead playing a hero, I left the theater extremely disappointed. The movie was poorly written and constantly reminds you, in the dialogue, that she is a woman and a mother. No, seriously. It could probably make for a good drinking game. Every scene someone, either the intruders or Gabrielle Union made mention of the fact that she is a mother... and yep, you guessed it... she is also a woman. I'm sure you can imagine how frustrating that could be. The plot was extremely cliched, and the characters were very underdeveloped."
    },
    {
      "rating": "3",
      "text": "Breaking In, the movie's got a very basic plot and it's about this group of criminals who are invading this mother of two's house.The action sequences are very bland and very cheesy, there's no sort of thrill from them which makes them quite boring.The direction on which the cast have been put through for this movie isn't great, their characters can feel quite boring, cringy, lifeless and not very memorable at all.Also, the dialogue from the characters throughout this movie is honestly so cheesy and so cringy, it's so bad.Overall, it's not a great movie. It's got a very basic plot, bland and cheesy action sequences, characters feel very boring, cringy, lifeless and not very memorable. Also, the dialogue is honestly very cheesy and very cringy, it's not worth the watch."
    }
  ],
  "recommendations": [
    "the_rhythm_section",
    "the_marksman",
    "no_escape",
    "colombiana",
    "cold_pursuit",
    "3_days_to_kill",
    "hotel_artemis",
    "tracers",
    "taken",
    "the_commuter",
    "black_and_blue",
    "sas_red_notice",
    "those_who_wish_me_dead",
    "outbreak",
    "white_house_down",
    "son_of_a_gun",
    "beirut",
    "the_first_purge",
    "savages",
    "live_by_night",
    "allied",
    "the_purge_anarchy",
    "eden_lake",
    "flightplan",
    "the_equalizer"
  ]
}