{
  "id": 653,
  "title": "Breakthrough",
  "starring": [
    "Chrissy Metz",
    "Josh Lucas"
  ],
  "runtime": 116,
  "genre": [
    "Drama"
  ],
  "description": "Tragedy strikes when a woman named Joyce's son falls through the ice on a frozen lake and is trapped underwater for over 15 minutes. After being rushed to the hospital, the 14-year-old boy continues to fight for his life as Joyce, her husband and their pastor stay by his bedside and pray for a miracle.",
  "releaseYear": "2019",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/85BfZAYh4zC1U6NBz2ZkXb3y67v.jpg",
  "categories": {
    "plot": 7.2,
    "acting": 7.7894736842105265,
    "ending": 7.0,
    "soundtrack": 10.0,
    "cinematography": 7.0,
    "familyFriendly": 8.0,
    "funny": 5.0,
    "action": 8.0
  },
  "reviews": [
    {
      "rating": "9",
      "text": "I enjoyed \"I Can Only Imagine\" last year and now I  enjoyed Breakthrough.\" Sure, the the moral is VERY similar to every true story religious movie, and that's a given when you go into one of these movies, but the casting and story were phenomenal for me. I am a religious person though, so take my opinion with a grain of salt."
    },
    {
      "rating": "7",
      "text": "A great film to watch for Christians and a good film to watch if you want to see hope. A feel good movie that will leave you feeling alot of emotions. Some complaints could be the long ending but the first half of the film is great and gets the emotions going. Perfectly fine film for all ages."
    },
    {
      "rating": "10",
      "text": "You may be ashamed you cried at this movie but you willl not feel manipluted. A great story. Careful, it could inspire you."
    },
    {
      "rating": "10",
      "text": "Breakthrough is one of my favorite movies of 2019, one of my top 5 favorite drama movies of 2019, my favorite Christian movie of all time, one of my favorite drama movies of all time, and one of my favorite movies of all time. Chrissy Metz's performance as Joyce Smith was stupendous she put so much emotion and power into her performance, her performance was breathtaking. Josh Lucas, Topher Grace, Marcel Ruiz, and Dennis Haysbert also gave fantastic performances. This movie was inspirational, beautiful, heartbreaking, heartwarming, and the most emotional movie I have ever seen. I cried throughout the whole movie. The screenplay and writing were spectacular. Also the soundtrack and the music that was in the movie was beautiful and terrific. Breakthrough gets a A+ from me."
    },
    {
      "rating": "10",
      "text": "Seems like religious haters and atheists are quick to leave their undesirable opinions on a movie that us with faith don't need their criticisms. This is a very good movie so let them hate. We will love and believe."
    },
    {
      "rating": "0",
      "text": "Another Thumperfest disguised as a \"True Story\"  When the Lame Stands Tall wasn't enough, I Can Only Imagine wasn't enough, Woodlawn wasn't enough, no, Movie goers have to repeatedly be assaulted by these overblown phony pablum puke films trying to shove Jesus and the bible down out throats. The WORST is when they try and hide it, and you go to what looks to be an interesting story film and find yourself bludgeoned with BS.  This one is over the top with the hoaky baloney. Please, keep your religious crap in your church for the people who are truly looking to be propagandized, fooled, and BS'd"
    },
    {
      "rating": "7",
      "text": "An awesome true story played out on screen with a so-so rendition. Even with unknown actors portraying the roles, the story generates a lot of emotion on it's own."
    },
    {
      "rating": "3",
      "text": "Cute, emotional story that pushes too hard the Christian agenda. The acting was ok, but it left me feeling like I was being indoctrinated."
    },
    {
      "rating": "5",
      "text": "Faith-based film of an unbelievable story of survival, told through a religious lens, whether or not you believe in the power of prayers to raise the dead, we can look at the incident as an inspired story, how the mother (Chrissy) loved her son and believed that he will be recovered regardless of the doctor's opinion, I think sometimes we need to believe in something that has more power than science to save who we love even if it let us down.Solid performance by Chrissy Metz, she was perfect in the mother role. Actually, it's a good movie to watch for believers and maybe unlikable for non-believers, because \"Breakthrough\" focus a little more on the mother's faith and the prayers of the entire community."
    },
    {
      "rating": "7",
      "text": "Breakthrough is a faith-based movie based on the true story of a boy, John Smith (played by Marcel Ruiz) who fell through ice on a frozen lake in a city in the US State of Missouri. Having being underwater for about 15 minutes, not breathing and being without a pulse for up to one hour before being resuscitated, he was effectively given up on by Doctors. Not by his Adoptive Mother, however, who continued to trust God for a Miracle. The movie has outstanding performances by Chrissy Metz (well known for her role on the TV Series “This is Us”) who played John’s Mother and a good supporting cast including Josh Lucas as John’s Adoptive Father, Topher Grace, Sam Trammell, Dennis Haysbert and Mike Colter. This movie weaves issues of Faith, Adoption and Community into a good story."
    },
    {
      "rating": "9",
      "text": "This is a moving, beautiful true story. The story being true is what makes it special. The story has twists and unexpected moments. I liked the acting (a lot), and think it added to the story. I recommend it a lot."
    },
    {
      "rating": "2",
      "text": "Several places were overacted and easily predicted; this could be a better movie but the director made it too preaching-like and boring."
    },
    {
      "rating": "8",
      "text": "Prolific actor/director Roxann Dawson (Star Trek: Voyager) shows a good flair for being a first-class actor’s director in this beautifully produced, performed, and photographed production. A strong cast brings what some might call a predictable story to vivid life. Any story based on factual and relatively inexplicable occurrences --based on a strong faith premise – can’t help but feature a certain degree of predicable asides – for these are determined by the amazing factual outcomes at its core. There will always be doubters when it comes to incidents that involve supernatural intervention and this will vary with the degree of faith held by the viewer.  Thankfully, this production only features one or two scenes that perhaps begin to fall into the trap of over sentimentalising certain situations. But convincing performances and a generally powerful fact-based script lift it over and above any contrivances.  What comes across perfectly, is the always difficult to achieve embodiment of repaired relationships - especially in this case, involving a damaged adopted family member. Might be worth seeing by all in need of genuinely inspirational entertainment. Others, just stay away or go to a crowd pleasers comic-book action flick if you really want banality.Features Diane Warren’s 2019 Academy Award-nominated song “I’m Standing With You” as performed by Chrissy Metz."
    },
    {
      "rating": "7",
      "text": "Some of these user reviewers let their emotions get the best of them. Like seriously, how are these people allowed to make reviews? I mean, they clearly haven’t watched the movie and given a fair assessment. But whatever, I’ll keep my review short. The storyline is very good, Chrissy Metz and Topher Grace are fantastic and the cinematography is way better than any “faith based” film I’ve seen as of late."
    },
    {
      "rating": "9",
      "text": "'Breakthrough' is the best faith-based film I've seen, period. Great amounts of the film are leaving you laughing, crying hard, and feeling warm after seeing this. Chrissy Metz and Josh Lucas give seriously emotional performances that impact you most throughout the movie's runtime. It's a perfect movie to show to family and this is definitely so far in my top five films this year."
    },
    {
      "rating": "10",
      "text": "Loved the film had me and my girlfriend crying love the fun soundtrack is on Spotify"
    },
    {
      "rating": "2",
      "text": "(Mauro Lanari)Roxann Dawson's debut proposes the return to the fold of Christian theism as panacea against nihilism, and not the Nietzschean one but the one that in Western culture begins with the fatalistic epic of Homer. The resounding success of Kendrick's films guarantees her that she won't need much faith to be sure of the box office takings. And she eludes the age-old problem that thaumaturgy is taboritically ephemeral and sporadically widespread because, evangelically and factually, it is only a \"firstfruit of the Spirit\" (Romans 8:23) for proselytizing purpose."
    },
    {
      "rating": "10",
      "text": "A heart-warming message imbedded in a movie has never been a miss. Bravo to the cast and production team"
    },
    {
      "rating": "7",
      "text": "Breakthrough wants us to be with her and tells us a beautiful and captivating story, but some mistakes prevent her from floating."
    }
  ],
  "recommendations": [
    "my_name_is_khan",
    "i_can_only_imagine",
    "the_fault_in_our_stars",
    "collateral_beauty",
    "me_before_you",
    "hotel_rwanda",
    "revolutionary_road",
    "the_blind_side",
    "blood_diamond",
    "lovelace",
    "manchester_by_the_sea",
    "brokeback_mountain",
    "the_glass_castle",
    "a_beautiful_mind",
    "joy",
    "goodbye_christopher_robin",
    "the_theory_of_everything",
    "cinderella_man",
    "the_devil_all_the_time",
    "the_lovely_bones",
    "the_giver",
    "blue_valentine",
    "gifted",
    "heaven_is_for_real",
    "spotlight"
  ]
}