{
  "id": 1044,
  "title": "Brian Banks",
  "starring": [
    "Aldis Hodge",
    "Greg Kinnear"
  ],
  "runtime": 99,
  "genre": [
    "Drama"
  ],
  "description": "An All-American football player's dreams to play in the NFL are halted when he is falsely accused of rape and sent to prison.",
  "releaseYear": "2019",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/4MnCFcFHYAEMG4NBTUKvjhf5AhU.jpg",
  "categories": {
    "plot": 8.0,
    "acting": 8.0,
    "ending": 9.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 6.0,
    "funny": 5.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "9",
      "text": "What a fantastic story!  (A shame that the critics put it in the \"mixed reviews\" territory). Aldis Hodge is fantastic (love him on City on a Hill), and it's great to see Great Kinnear back on the big screen.  About a third of the way through (no spoilers), I was really pissed that the person responsible for putting Brian behind bars wasn't getting enough blame in the story.  It was truly an evil act that almost ruined Brian's life. And it was just that easy to do.  But by the end of the film, once you've gotten to know Brian's mentor (played by Morgan Freeman), you begin to accept things, and you realize that \"how you react to life\" is all you can control.  The movie received a warm round of applause in my theater - including from me - and it's something that most Americans should see.  Hope to see that happen."
    },
    {
      "rating": "8",
      "text": "Though somewhat formulaic in its presentation, director Tom Shadyac's genuinely earnest offering about an aspiring football player's 11-year struggle to clear his name for a sex crime he didn't commit hits many of the right notes emotionally and morally, an effort made valiant by the outstanding lead performance of Aldis Hodge. The story here may seem familiar to a number of other pictures, but this well-executed venture is worth the time and, like those other titles, should inspire those seeking reform to a criminal justice system that's unfortunately all too often broken. Sadly, this release slipped through the distribution cracks when it came out in late 2019, garnering virtually no attention, but one can only hope it makes up for that oversight now that the film is available for streaming and on home media."
    },
    {
      "rating": "6",
      "text": "Functional but endearing.  Not great, but pleasant-with-a-purpose.If you have a child in the house that you're wanting to watch a Social-Justice themed movie with, this is contemporary and acceptably entertaining."
    },
    {
      "rating": "5",
      "text": "(Mauro Lanari)I don't appreciate Shadyac's cinema, usually shamelessly inspirational. Even in this case he dares to try his hand at soteriology, but his idea of justice is once again human, too human."
    },
    {
      "rating": "8",
      "text": "Good movie with a great cast! It's crazy that Mr Banks has been accused of sexual assault twice. He's got a great story to tell and it came together very well."
    }
  ],
  "recommendations": [
    "the_founder",
    "spotlight",
    "a_bronx_tale",
    "snowden",
    "just_mercy",
    "hidden_figures",
    "the_mauritanian",
    "the_post",
    "collateral_beauty",
    "patriots_day",
    "the_big_short",
    "richard_jewell",
    "dallas_buyers_club",
    "the_white_tiger",
    "the_imitation_game",
    "ingrid_goes_west",
    "i_can_only_imagine",
    "judas_and_the_black_messiah",
    "the_social_network",
    "captain_fantastic",
    "hotel_rwanda",
    "fighting_with_my_family",
    "gold",
    "shot_caller",
    "heaven_is_for_real"
  ]
}