{
  "id": 4573,
  "title": "Bridget Jones: The Edge of Reason",
  "starring": [
    "Renée Zellweger",
    "Colin Firth"
  ],
  "runtime": 108,
  "genre": [
    "Comedy",
    "Romance"
  ],
  "description": "Bridget Jones is becoming uncomfortable in her relationship with Mark Darcy. Apart from discovering that he's a conservative voter, she has to deal with a new boss, a strange contractor and the worst vacation of her life.",
  "releaseYear": "2004",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/42v82AwTnhaL1JkNcQK8PRAh46P.jpg",
  "categories": {
    "plot": 3.888888888888889,
    "acting": 3.0,
    "ending": 8.0,
    "soundtrack": 6.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 7.333333333333333,
    "action": 7.0
  },
  "reviews": [
    {
      "rating": "0",
      "text": "Uttterly stupid! It was a real disappointment! ...so now, Bridget is the girl that everybody loves, hot, successful, smar guys and also  intelligent, gorgeous, successful lesbians? Really? I mean....should I say much more? I have no intentions to watch it never again! To me is a real  0 and not because it is a sequel- I am always tolerant with sequels-but because the whole story is silly, ridiculously boring, and feels forced! Bridget is worse than ever! Unfortunatley they have destroyed all the attractiveness that Hugh Grant's character used to have, they made him little less than evil...and he was the best character of  the first movie! If you can avoid watching it, but if you are curious watch it, and if you like it-I don't think you will- then good on you!"
    },
    {
      "rating": "8",
      "text": "Bridget Jones is back! The sequel to the 2001 hit. This sequel lacks the charm that its predecessor had, but Renee Zellweger as always charming and shines as the character, and this film still has a little bit of charm but under the charmingly uncharming direction by Beeban Kidron (Amy Foster and Used People). Based on Helen Fielding's second novel in the series, the three original writers including Ms. Fielding, Richard Curtis, Andrew Davies return to write the screenplay also they got another writer on board Adam Brooks. The story takes places four weeks after the first film Bridget Jones (played once again by the adorable Renèe Zellweger) is still working as a host and is dating Mark Darcy (Colin Firth). Bridget is jealous of the time that Mark spends with his co-worker Rebecca (Jacinda Barrett), Bridget thinks Mark is cheating on her, which causes their relationship to go down hill. Despite a vacation meant to smooth things over, ends their relationship. On an assignment in Thailand, she has a dalliance with her ex Daniel Cleaver (Hugh Grant) and is temporarily jailed for falsely accused for drug smuggling before Mark rescues her. Look I don't care for the predictability, I loved this movie is it perfect? No it's not perfect but it's a funny charming funny rom-com it's still cheerful and that's what I love about the Bridget Jones series, is it funny? Yes. Despite issues I found in the direction and some in the script. Zellweger saves this film, I still found this movie charming it's a good film with problems. 3.5 out of 4"
    },
    {
      "rating": "3",
      "text": "A failed attempt to recreate the fizz of 2000's charming and entertaining Bridget Jones' Diary that follows the all-too-typically-followed path also trodden by such sequels as Barbershop 2: Back in Business and Legally Blonde 2: Red, White and Blonde: let's give 'em More Of The Same, only to prove again that more is less. Unlike the Reese Witherspoon and Ice Cube second go-rounds, you can't totally make the criticism that Bridget Jones: The Edge of Reason is an UNNECESSARY sequel; Helen Fielding, the author of the book on which the original was baseddid indeed write a followup, but the adapters seemed about as interested in following Fielding's plotline as they were in following that of James Joyce's Ulysses. Even so, the original ended perfectly and organically with insecure-in-love-work-and-everything-else Bridget dumping Mr. Wrong, embracing Mr. Right and finding True Love At Last. As played so endearingly by Renee Zellweger in the original, Bridget (a British lass whose rough American equivalent is the comic strip character Cathy) was both hilariouly awkward AND tremendously empathy-inducing; you laughed at her multiple faux pas but also felt hugely protective of her and had a real rooting interest in her well-being. Well, good-bye to all that: it's not Renee's fault; she's still an excellent actress and terrific farceur who's doing what the script tells her to--but Bridget in the sequel has gone from appealingly vulnerable to so ridiculously insecure and needy, endlessly embarrassing and humiliating boyfriend Mark (Colin Firth) that I found myself constantly wondering something that was the furthest thing from my mind while watching the original: namely, \"Why in God's name doesn't he toss this shrill Looney Tune out on her ear and change all the locks?\""
    },
    {
      "rating": "6",
      "text": "Falls far short of the first BJ movie."
    },
    {
      "rating": "8",
      "text": "Cannot understand why the critics were so harsh with this. Just as good as the first one. There are some seriously classic scenes here and although Hugh Grant's limited screen time was unfortunate, it was still a very funny, romantic movie."
    },
    {
      "rating": "4",
      "text": "Its so sad that this wound up being the sequel to one of the best romantic comedies ever made. The Edge of Reason simply recycles the best bits of the original film and itself has no originality. The book it is based on is actually funnier than the original, which means this film should have been just as good if not better. For shame."
    },
    {
      "rating": "6",
      "text": "After the success of the first movie, the sequel was something we knew was going to happen, and it wasn't going to be as good or as fresh as it turned out. The film includes the core cast and crew of the first film and achieves an interesting and pleasing sense of narrative continuity, but the fun, freshness, lightness and creativity of the first film are largely absent from this sequel, which it is limited, in part, to following up on its story and reusing a formula that has worked well.In this movie, Bridget and Darcy are finally together and happy... until her doubts about his faithfulness (obviously fueled by her friends, who in these things are excellent for putting fuel to the fire) lead to successive conflicts. However, her career and her life are undergoing changes, with an approach to her ex-boyfriend, Daniel, who will try to seize the opportunity to get back into her relationship with her rival. It's a reasonably well-written story, if we discard the more imaginative elements, like the protagonist's passage through prison in a foreign country (for me, it was the most forgettable moment in the plot). The humor is still there, but it's not as effective and the film is lukewarm.As far as the cast is concerned, we have nothing new: again, Renee Zellwegger, Hugh Grant and Colin Firth are once again the stars of a cast full of familiar faces. The three are perfectly at ease with the characters and do a very good job, in an overall assessment, but I didn't notice much evolution in any of them. They limited themselves to re-editing what they had already done. More interesting is the way Gemma Jones handled the challenges her character brought her this time around, as she was the central figure in one of the film's most important sub-plots.Technically, the film has very similar production values and visual style to its direct predecessor. Very British in its style, it's visually unpretentious but elegant and has good editing and good filming locations, sets and costumes. The soundtrack is nothing particularly remarkable."
    },
    {
      "rating": "7",
      "text": "This is a fairly amusing film sequel. Its not as good as the follow up, Bridget Jones' Baby, which I saw recently but its still entertaining and amusing, in a cringe-y way, as all Bridget Jones films are. Its hardly the best film of its type but it could be worse - seeing Hugh Grant and Colin Firth fight like little boys is amusing enough and there are comical moments with Bridget skydiving and the like. I wouldn't necessarily recommend it but there are worse films around, though I'm not sure this is the best of the 3 films made to date, it could certainly be worse. A harmless bit of slapstick fun."
    }
  ],
  "recommendations": [
    "the_terminal",
    "daredevil",
    "suburbicon",
    "true_grit",
    "the_second_best_exotic_marigold_hotel",
    "midnight_in_paris",
    "burnt",
    "knives_out",
    "alice_in_wonderland",
    "american_hustle",
    "lucky_number_slevin",
    "logan_lucky",
    "the_godfather_part_iii",
    "the_dilemma",
    "legend",
    "victor_frankenstein",
    "charade",
    "charlie_and_the_chocolate_factory",
    "the_royal_tenenbaums",
    "notting_hill",
    "alice_through_the_looking_glass",
    "inkheart",
    "enola_holmes_2",
    "eddie_the_eagle",
    "odd_thomas"
  ]
}