{
  "id": 2105,
  "title": "Bridge to Terabithia",
  "starring": [
    "Josh Hutcherson",
    "AnnaSophia Robb"
  ],
  "runtime": 96,
  "genre": [
    "Adventure",
    "Drama",
    "Family"
  ],
  "description": "Jesse Aarons trained all summer to become the fastest runner in school, so he's very upset when newcomer Leslie Burke outruns him and everyone else. Despite this and other differences, including that she's rich, he's poor, and she's a city girl, he's a country boy, the two become fast friends. Together, they create Terabithia, a land of monsters, trolls, ogres, and giants and rule as king and queen.",
  "releaseYear": "2007",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/3xFxGodKPMFLheS8rujFSmLfcq4.jpg",
  "categories": {
    "plot": 6.178571428571429,
    "acting": 5.275862068965517,
    "ending": 5.25,
    "soundtrack": 6.0,
    "cinematography": 5.0,
    "familyFriendly": 7.333333333333333,
    "funny": 5.25,
    "action": 8.666666666666666
  },
  "reviews": [
    {
      "rating": "5",
      "text": "This film was just okay. I vaguely remember reading this book as a child, and so I couldn't quite remember a lot of the little details. Anna Sophia Robb was the greatest part of this film. She was incredibly engaging. It made me wish that the film was centered around her character instead of the boy and his complete and utter lack of a personality. The little girl that played his sister was cute, and added some nice touches to the movie. Zooey Deschanel was good, but there wasn't much for her to do in the part. The CG stuff in the film made me feel sometimes that I was watching two entirely different movies as it would switch between fantasy and reality. I think the film had the potential to be a lot more moving. There were many times where the dialogue made me cringe, and other times that the acting, by most of the cast, produced the same effect. T2 villain and David Duchovny replacement, Robert Patrick, played a father that was a little too over the top with his discouragement of his son's imagination. Every time Anna Sophia was not on the screen, I would lose interest. She was very good, despite having to deliver some ridiculous lines at times. I really was sad when her character died, even though I knew it was coming. If you like cheesy, family fare, then you'll love this movie. If that stuff bugs the s*** out of you, you'll hate the movie."
    },
    {
      "rating": "10",
      "text": "I love this movie. I think it is a great movie and I believe the right cast was chosen. Josh Hutcherson was a great Jess, Annasophia Robb was a perfect Leslie, Bailee Madison was a cute Maybel, Zooey Dushenel was an good teacher. I think the creativity and imagination put into this book and then film was inspiring and a great family film. The ending was very sad and I felt for Jess. The was Josh showed us how Jess was feeling was incredible and more than I expected! Overall a lovely film and perfect for a family get together!"
    },
    {
      "rating": "10",
      "text": "Perhaps the single most heart wrenching movie I have ever seen. Let me say this: Pan's Labyrinth was a masterpiece, and delved into the depths of a young child's heart and mind using an astounding mixture of connecting metaphors and a scary journey in juxtaposition to an even scarier world. It was truly saddening, because it had to be. It explained it's sadness in a way that can be traced through it's own tale. That said, Bridge to Terabithia manifests within the soul a more profound (indeed, THE most profound) sadness, one which I have only felt when those closest to me have passed on. Never in my life has art created something that saddens me and eludes an answer. Pan's Labyrinth's answer is traceable; Terabithia's lies beyond my mind's ability to explain, perhaps because it is so real, so alone, so transcendental. What I can say is that it is in one perspective ironic that I am saddened by those who cannot feel this way because they have forgotten what it was like to once possess an open mind, like a child's. A cynical layer of myself would say it's too childish and can be seen through. But the truth elicited in Terabithia shows that each layer is at once important and ridiculous, and underneath this lies what a true open mind is: one that is not afraid to admit that everyone must be right, that everyone must be wrong, that for now, this is all complete garbage. This is beautifully perfect."
    },
    {
      "rating": "10",
      "text": "Best family film of the year by far. Great acting by Hutcherson and Robb, especially Robb (stole every scene she's in) and Zoey was top notch like always. Quite sad in the end, but a great moral message is delivered which made this movie a classic fairytale/coming of age story that will be remembered for a long long time."
    },
    {
      "rating": "10",
      "text": "This was an excellent film. Without knowing much about the plot aside from the images shown in the trailer, I was surprised by what the movie had to offer. I will warn you though, it is a very sad movie, lite hearted in the beginning, but very serious towards the end. I wouldn't have my kids watch this one until they were a bit older. This movie literally left me feeling a bit depressed, which is a testament to the acting and scripting. If you are looking for a solid drama, with some fun thrown in that will most certainly stir some emotion, check this one out."
    },
    {
      "rating": "0",
      "text": "No child deserves Bridge to Terabithia. Honestly, if you're going to a place where all wishes can come true, why wish the wish everyone would've wanted and not make them cry till there's nothing left in them like  you did? Even the author didn't want this and the moviemakers ignored her statements."
    },
    {
      "rating": "4",
      "text": "\"Bridge to Terabithia\" is a preposterous movie. The book was absolutely sad, but the movie interprets the amazing story into a fluid one with eye candy visuals."
    },
    {
      "rating": "10",
      "text": "This is with no comment the best movie I ever saw.And this was the first movie which made me cry because the sad ending. This is the best movie ever made."
    },
    {
      "rating": "2",
      "text": "\"Best movie I ever saw?\" \"Heartbreaking?\" Honestly guys, who pays you for these 10/10 reviews? Yes I know, it is a movie about loss, guilt, the end of childhood and the cruelty of reality. But this movie is downright BORING, the first 30 minutes nothing happens and after that it is just two kids running through the woods and using their imagination. There is no plot, no relevant storyarc, no suspense. [Spoiler] It's just one hour of character-build-up and then they are killing one character off screen, so the other main character can grieve for the last half hour. I mean the story HAS some heartbreaking-potential, but this plot twist isn't worth the 90 minutes you need to sit through them."
    },
    {
      "rating": "1",
      "text": "I thought that this movie showed no emotion and the actors and actresses did not suit their part. I have read the book nearly 1000 times (not literally) and have strong feelings that it doesn't match at all. I really strongly do not recommend such an inappropriate chick flick."
    },
    {
      "rating": "4",
      "text": "If you're expecting anything like the trailer advertises, i.e. a The Lion the Witch and the Wardrobe takeoff, you'll be thoroughly disappointed. As a touching story, however, the movie shines. Unfortunately, this doesn't sell well, leaving you with a duped-by-Disney taste in your wallet."
    },
    {
      "rating": "3",
      "text": "I agree with the official newspaper views that this is a good moral movie but at the same time I was disappointed at the lack of special effects which seemed so promissing in the previews. I did not read the book therefore I was not aware that in the book the fact was stressed that Terabithia was really only a fantasy in the children's minds, Since I am a fairytale- and specialeffects lover I felt that the movie was promoted in a way that was misleading people for the sake of making them buy the tickets. I won't add it to my DVD collection!"
    },
    {
      "rating": "0",
      "text": "It was a good movie,that I would have rated 8. But the end RUINED it. It made the whole thing ruined. Like biting into a peice of WONDERFUL chocolate cake, then coming to the last 2 bites and finding A HAIR. Do you like that cake anymore? No.Do you still think that chocolate cake is good? No."
    },
    {
      "rating": "5",
      "text": "I saw a bunch of previews before watching this movie and in the previews they would show a bunch of computer animated scenes that really caught my eye. This was the main reason I decided to rent this movie and check it out. After watching it, I now can see that they used practically every animated scene from the movie and smashed it into the previews to make it seem like the whole movie was CGI enhanced. It turns out that this is just a kiddie sob story that ended up making me cry and had I known this before, I wouldn't have watched this movie."
    },
    {
      "rating": "3",
      "text": "This movie was advertised as a kind-of Narnia/Spiderwick chronicles-esque movie, with wonderful creatures, another world living within a forest, about two friends and their wonderful friendship in a (supposedly)uplifting tale Let me get this out of the way, I absolutely hate it when i'm misled by trailers, tv spots, advertisements and etcetera. I sit down to watch this on Disney Channel, expecting what i've described in the first paragraph, and what do I get? The magical world and its creatures are imaginary The depressing angst of Jess with bullies and his dad Leslie drowns The lighter parts with Jess and Leslie happily playing in Terabithia and their great friendship are a saving grace for this movie, but ultimately, the death of Leslie and all of the films depressingness just don't fit right with me"
    },
    {
      "rating": "10",
      "text": "This iphone app was aweosme. I gave it to me kids and tehy wouldn't stop playing. Dunnow how it intstalled - came w/ chaep ripoof iphoon, stuk to bottom of bar tabl w/ gum, makes phon smell like hops. tasttyyy phon thx yeah."
    },
    {
      "rating": "3",
      "text": "The snow glows white on the mountain tonightNot a footprint to be seenA kingdom of isolationAnd it looks like I'm the queenThe wind is howling like this swirling storm insideCouldn't keep it in, heaven knows I've triedDon't let them in, don't let them seeBe the good girl you always have to beConceal, don't feel, don't let them knowWell, now they knowLet it go, let it goCan't hold it back anymoreLet it go, let it goTurn away and slam the doorI don't care what they're going to sayLet the storm rage onThe cold never bothered me anywayIt's funny how some distance makes everything seem smallAnd the fears that once controlled me can't get to me at allIt's time to see what I can doTo test the limits and break throughNo right, no wrong, no rules for meI'm freeLet it go, let it goI am one with the wind and skyLet it go, let it goYou'll never see me cryHere I stand and here I stayLet the storm rage onMy power flurries through the air into the groundMy soul is spiraling in frozen fractals all aroundAnd one thought crystallizes like an icy blastI'm never going back, the past is in the pastLet it go, let it goWhen I'll rise like the break of dawnLet it go, let it goThat perfect girl is goneHere I stand in the light of dayLet the storm rage onThe cold never bothered me anyway"
    },
    {
      "rating": "9",
      "text": "The film was a fantastic adaptation of the novel. Sensitive, lovely, and touching, the movie used fantasy as a metaphor for tragedy and \"moving on,\" just like the novel. The people who complain about the movie's last third should--and please forgive me--grow up. Yes, it is SAD. Tragedy IS tragic. Why shouldn't a movie mirror life and show that growth--even happiness--can come from loss?! That's what art does; it reflects life in all its complexity. Well worth seeing and, with any luck, will become a classic touchstone film in the genre."
    },
    {
      "rating": "9",
      "text": "Incredible! It's a story that you don't see everyday. I don't know about you, but I love using my imagination. And the film was way better when I used my imagination to \"inhance\" the film. I loved it. Made me want to run into the forest and cry, but it was cold outside. Yeah the trailers had nothing to do with the film really, but i guess people who have read the book know better and the trailers were to apeal to an action loving audiance. I'm going to see it again, and I sugest you see it too!"
    },
    {
      "rating": "1",
      "text": "Poor semblance of a movie. Some emotional aspects, but overall a bore."
    },
    {
      "rating": "7",
      "text": "\"Bridge to Terabithia\" needed to be a period-piece. Why? Kids grow up faster these days. As Leslie, Anna Sophia Robbs is wonderful, but she's probably too pretty for the role. As you watch Leslie, so stylish and perky, you wonder why no middle school boy(including Jessie) is attracted to her. Robbs is like Winona Ryder in \"Welcome Home, Roxy Carmichael\", because a misfit; a true misfit, shouldn't be cute as a button. In 1978(the year Katherine Paterson won her Newberry Award), a teacher could still drive a lone male student to the museum for some extra-cirricular enrichment. But since the film is contemporary(all those teacher-student scandals), you have to wonder what the filmmakers were thinking. That said, \"Bridge to Terabithia\" still delivers an emotional punch. I remember the book well. I remember the shock. You feel Jessie's loss, but because it's a Disney production, the film ends on a false happy note. You just know that Jessie(Joss Hutcherson) will be in therapy for the rest of his natural life."
    },
    {
      "rating": "1",
      "text": "Watch this movie before showing it to your children or take my word for it and stay clear of it entirely. I am amazed that this movie has received so many positive reviews. This is not a heartwarming story where the cast of Monsters Inc. teaches us about the power of imagination. It plays out more like an incredibly grim After School Special. Bridge to Terabithia is apparently adapted from a well loved children"
    },
    {
      "rating": "9",
      "text": "The way Disney advertised this movie is so cruel. It shows that Disney thinks making money is more important than being truthful. If Disney didn't have faith in the movie, they shouldn't have made it. I can't belief the company that made this wonderful movie is the same company that advertised it in such a misleading way. This movie reveals what a greedy selfish company Disney is these days. I miss those days when Disney were happy to provide us wih quality movie. Now Disney's become one of those stupid major company that wants nothing but money! Anyway the movie was great. No part of it felt boring. The children's acting looked so real (unlike the girl from the Adventures of Sharkboy and Lavagirl, her acting was totally fake.) I wonder if AnnaSophie Robb is really anything like the character she plays. Anyway, when I went to watch the movie I had already read the book. I was kind of confused when I saw the trailers, but the movie did turn out to be loyal to the book. It even added a little to the book. When I took my older brother (who's kind of into fantasy stuff) to see this movie, I didn't tell him what the movie was about. His reaction was so funny. Anyway if you're sick of those fantasy movies that are all the same (eg. Narnia, The Never Ending Story) this is certainly the movie for you. The occastional action sequences are average, but the magical the story was told will blow you away. If you don't like this movie you clearly don't have the ability to feel love and pain. In other words go see this movie. If you can tink deeply about things you'll love it."
    },
    {
      "rating": "0",
      "text": "This is a horrible movie and certainly not one for children. While some of the difficulties faced by youngsters growing up is somewhat accurately portrayed, the never-ending doom is depressing beyond words. The main character, Jess, faces hardships througout most of the movie, he then gets to live with the belief that he was responsible for the death of his friend. I have never been so depressed after seeing a movie. I honestly went into this with high hopes, but came out feeling horrible. This is not a movie I would recommend to anyone."
    },
    {
      "rating": "8",
      "text": "A must see! For the individual that complained you never got to Terabithia until the end, go get an imagination or go back to your Playstation. To the individual who said the film was too depressing, get a therapist quick or go get a life."
    },
    {
      "rating": "0",
      "text": "Very misleading trailer. Never having read the book, like many others, I believed that this movie was about two children's journey to save the land of their imagination. Bull$#!#. This was a depressing and oppressive movie. I thought the acting was ok, and was blown out of the water when the main character died. And they essentially saved the \"visit\" to Taribithia for the last 10 seconds of the movie. We saw this movie after Ghost Rider of all things. IMHO - Ghost Rider was a MUCH better movie!!"
    },
    {
      "rating": "9",
      "text": "An excellent family film that never panders. It is not the Narnian fantasy the trailers make out but a very real story about a beautiful friendship, family tension, choices, standing up for oneself, and loss. I was concerned about the loss, but someone reminded me that Charlotte's Web has a similar heartache to it. That this loss is dealt with in tender yet realistic tones elevates it. My children loved the film. It has the air of a classic about it."
    },
    {
      "rating": "9",
      "text": "Though the movie was great, I think the book was slightly better. And I am shocked to see people who didn't bother to read the book (and even some who did) go on and on about how awful the ending to this movie was! Please. Either do some research, read more books, or maybe just accept the fact that life is not always kind. Please stop complaining that you were misled about the kind of story this is. The book is very well known and the movie kept the book's name. Also, maybe you should keep in mind that the author of this book wrote it to help her own young son deal with a very simular loss in his own life. Maybe that will help you keep an open mind."
    },
    {
      "rating": "9",
      "text": "Fantastic movie. The dimwits complaining that it was not like the trailer should similarly downgrade all movies. Here's a shocker for you folks, products are not always like the commercials they advertise them in either. Those who were bored were likely hoping for an insipid Tarantino-esque bloodbath or some other Hollywood schlock. I'm sorry the people with little or no imagination were befuddled by this. It's good to see Disney getting back to making family films, even dramatic ones."
    },
    {
      "rating": "8",
      "text": "A excellent adaption of an excellent novel that seems to suffer from a case of mediocre production values. It's a pain when good movies like this don't get all the money they need but utter garbage like Eragon is showered in cash. Definitely a good choice for 10, 11 year olds."
    },
    {
      "rating": "10",
      "text": "MA and Louis H are perfect examples of the problem with the movie industry in the US. It attempts to draw in the mass movie watcher, special effect junkie, no plot or characters needed. I was surprised at first to discover that the misleading trailer (a Narnia clone) was replaced in the theatre by a deep, dark tale encompassing the trials of childhood and adventures that some of us experience as we mature. Loved the story, loved the fact that the screenplay stayed true to the novel and was not sugar coated in any way. The best part of the movie experience was the shocked silence from the 6-7 10 y/o boys sitting behind us during the latter half of the movie, that had upto that point been yammering on about special effects and were probably of the mindset of our two critics mentioned above."
    },
    {
      "rating": "2",
      "text": "The acting was good. However, the film was generally inconclusive. Something like a jigsaw when you can't find half the pieces. My nine year old son didn't like it either. I felt angry and worse - out of pocket !"
    },
    {
      "rating": "9",
      "text": "I think this is very good film because it has a short and very interesting plot. It´s a very unpredictable film with a tragic and surpraising end.I was particularly impreased by the script.The only bad point of the movie is the special effects,the special effects which are unconvincing.All in all I recommend this movie to anyone who would like an intelligent love story with a hint of fantasy."
    },
    {
      "rating": "0",
      "text": "I am seven years old. Don't watch this movie because I watched it with my parents and I did not like it. If you want to be depressed with your children then watch it. It made me sad. This movie was not a good Disney movie. I want my money back."
    },
    {
      "rating": "1",
      "text": "What a horribly dissapointing movie. My entire family anticipated a wonderful film of fantasy and adventure, only to have our hearts torn out at the end. My five year old says he wants to break the DVD in two, and throw it away. That's exactly what we did. What a piece of ....."
    },
    {
      "rating": "8",
      "text": "Looking at some of these negative user reviews, it's clear that Disney's completely terrible marketing of this movie prevented it from finding its true audience. People watching it not expecting a Lord of the Rings ripoff, (Narnia, I'm looking at you) will find a pretty awesome movie. It was such a great story and so well told. The kid actors playing the 2 main characters do an amazing job and the music teacher, played by Zooey Deschanel, now officially the coolest actress around, is a cool character as well. The effects are used sparingly but they're pretty nice and imaginative, with some awesome creatures and a couple nice action scenes. Yeah, the ending's really sad, but it's really a great story, and the sad ending adds to it. Some issues I had with music and the occasionally slow pace don't do much to hurt this great movie."
    },
    {
      "rating": "4",
      "text": "It had it's good points and was a fairly imaginative movie, and I also appreciated the idea of not just being another LotR ripoff. The problem for me was the way the tear-jerker ending came about. It just didn't fit the pacing of the movie. It's like sprinting and hitting a wall suddenly. After that was all said and done, they didn't really feel like they finished out the story they had been building with through the movie. I'm not saying they couldn't do that ending, I just wish they'd taken the time to not have it feel so random. They could have used at least some sort of pacing in their or scenes to pre-lude such a sudden tragic moment. It could have been great, but falls flat because of bad directing in my oppinion."
    },
    {
      "rating": "10",
      "text": "Really amazing storie that touch ur heart, brain and soul. Now im writing again. Thanks Disney and Walden Media."
    },
    {
      "rating": "0",
      "text": "Two kids with no friends become friends and then one dies. Oh, and they imagine stuff, the stuff you see in the trailer. Oh, and by the way, when I say \"the stuff you see in the trailer\" I mean there is nothing else. You have seen all the imagined parts, the rest is just watching kids go to school, as boring as being there yourself. You have been warned. Somebody should report Disney to trading standards."
    },
    {
      "rating": "10",
      "text": "We were able to see the film at the premiere and it grabbed the entire audience from the opening scenes to the very end, putting us through an emotional rollercoaster. You can't help getting sucked up into this movie's world. The characters are completely believable and sympathetic: Josh Hutcherson and Anna Sophia Robb simply become Jess and Leslie. This movie is a must-see for all ages."
    },
    {
      "rating": "10",
      "text": "Outstanding film! I can't wait to see it again the day it opens. This is a movie my kids and their friends will see many times over...and I will probably be right behind them. You're crazy if you miss this one (ignore the trailers)."
    },
    {
      "rating": "10",
      "text": "Disney movie at it's best. If you don't walk out of this feeling good - what's the matter with you?!?"
    },
    {
      "rating": "8",
      "text": "Bridge To Terabithia gave a good try, but wasn't as good as the book. Josh Hutcherson was perfect for Jesse, but Anna Sophia Robb could have been replaced, though she was alright. Good effort. Derserves an eight. Not DVD buying worthy."
    },
    {
      "rating": "10",
      "text": "This movie was incredible. I sobbed, along with my friend. AnnaSophia and Josh totally get into thier characters, and have wonderful acting skills. A wonderful movie, worth seeing, love, love LOVE!"
    },
    {
      "rating": "2",
      "text": "Horrible storytelling. Very inefficient and cliche. The movie essentially recycled the same 4 scenes: Jesse's family is poor and it sucks at home, school sucks because kids pick on him, music class at school where Jesse is either really happy or really sad, and playtime with Leslie in the forest. A good script/director would have summed up the first hour of this film in 10 minutes. Then they would have had 50 minutes to add real character and story to this film before the climax, in which the movie hits a completely different note. To make things worse, when the movie did stray from the 4 kinds of scenes mentioned above, it was completely meaningless and unneeded: Jesse painting with Leslie's family, Leslie going to church with Jesse's family. This movie has a clear agenda and has no subtlety in sharing it with the audience. This is a horrible movie with a horrible script and horribly directed. I had no problems with the acting or CGI, but acting and CGI don't make a movie good or bad in themselves."
    },
    {
      "rating": "1",
      "text": "This movie was incredible. I sobbed, along with my friend. AnnaSophia and Josh totally get into thier characters, and have wonderful acting skills. A wonderful movie, worth seeing, love, love LOVE!"
    },
    {
      "rating": "5",
      "text": "Great movie for families and kids...Not so much for the rest of us. After seeing Pan's Lab, this was truly aweful. But I can see how 12 year olds and under could enjoy it."
    },
    {
      "rating": "10",
      "text": "This was a GREAT movie and I highly recommend it. Many people complain that it isn't like Narnia but I'm glad its not. Its different (which is good) and shouldn't be/not meant to be like Narnia. People are complaining that they aren't in Terabithia a lot when I'm glad they aren't, since it's only a made up world. I highly suggest this for familys."
    },
    {
      "rating": "8",
      "text": "An enjoyable movie, but not what I was expecting. Not really the fantasy you are lead to believe from the trailers."
    },
    {
      "rating": "9",
      "text": "I loved this movie. Aside from some technical aspects (dubbing) that was a bit distracting and some rushed scenes and dialogue, this is a classic family film that has something to say. The tragedy in the film is what makes it stand out from a typical fantasy/coming of age movie. I cried for the last 20 minutes, at first because I was sad, and soon enough, for the touching, heartwarming way in which it ended. I can't wait to see it again. (And I'm 39 years old!)"
    }
  ]
}