{
  "id": 99,
  "title": "Bride of Chucky",
  "starring": [
    "Jennifer Tilly",
    "Brad Dourif"
  ],
  "runtime": 89,
  "genre": [
    "Comedy",
    "Horror"
  ],
  "description": "Chucky hooks up with another murderous doll, the bridal gown-clad Tiffany, for a Route 66 murder spree with their unwitting hosts.",
  "releaseYear": "1998",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/mAGviFp1ufYM3EaZBSrjPiKPBt6.jpg",
  "categories": {
    "plot": 9.0,
    "acting": 7.75,
    "ending": 9.0,
    "soundtrack": 9.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 8.272727272727273,
    "action": 9.0
  },
  "reviews": [
    {
      "rating": "9",
      "text": "In the evidence room in the beginning of the movie, there is \"The Crate\" from Creepshow (1982)."
    },
    {
      "rating": "9",
      "text": "When John Ritter's character is killed, his face looks like Pinhead from Hellraiser (1987). Chucky exclaims \"Why Does That Look So Familliar?\", Andrew Robinson who played Sergeant Botnick in Child's Play 3 (1991) was in the first Hellraiser movie as Larry Cotton."
    },
    {
      "rating": "9",
      "text": "Crazy creditsAt one point during the credits, you can hear Tiffany say \"We belong dead\", and at the very end, after \"Human Disease - Slayer\" is played, Chucky says \"That's more like it\", followed by his evil laughter."
    },
    {
      "rating": "10",
      "text": "What gives the film its touch of grace is the black humor that incorporates and also makes it interesting the appearance of tiffany and that its plot takes a small turn."
    },
    {
      "rating": "9",
      "text": "Julia Stiles got the part of Jade, but later dropped out to play a role in 10 Things I Hate About You (1999)."
    },
    {
      "rating": "9",
      "text": "[first lines]Tiffany: [on phone] Hello.Bailey: Hey I'm on my way, and don't forget my money.Tiffany: See you soon, and Bailey, don't you forget.[Bailey nearly gets into a car accident from glancing at the bag]Tiffany: Curiosity killed the cat.[she laughs]"
    },
    {
      "rating": "9",
      "text": "In the opening scene Michael Myers and Jason's masks from the Halloween, Friday the 13th, Leatherface's chain saw from The Texas Chain Saw Massacre, and Freddy Kruger's glove from A Nightmare on Elm Street are all visible."
    },
    {
      "rating": "9",
      "text": "9/10 My Favorite ChuckyFilled to the brim with style and laughs, Bride of Chucky is a highlight of the Child's Play franchise. The addition of Jennifer Tilly as Tiffany, Chucky's bride, adds a delicious layer of camp to the film which makes it endlessly watchable. Katherine Heigl and Nick Stabile are great and likable as the teen lovers and Alexis Aquette gets a fun cameo as a Marilyn Manson-esque weirdo.Director Ronny Yu keeps the pace moving and a lot of his shot compositions are quite striking. For the 4th entry in a well worn franchise, it's nice to see there's still a little spark and creativity left."
    },
    {
      "rating": "9",
      "text": "$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,》●》●》●》●》●》●》●》●》●》■》■》■》■》■》■》■"
    },
    {
      "rating": "9",
      "text": "A- One of the best Chucky movies, it is a must see.***********************"
    },
    {
      "rating": "9",
      "text": "aqwertyyuioplksffdghjmnbvcxzklopiuhgtrewryojnjgfsvgyuhhgggfdrghjkiughhhhhguhgechim"
    },
    {
      "rating": "9",
      "text": "Plot holes (at around 33 mins) The Heart of Damballa that Charles Lee Ray was supposedly wearing on the night he was gunned down wasn't actually in the original Child's Play. The newspaper clipping Chucky shows to Tiffany is in the previous three movies but does not show the Heart of Damballa, and in the original where we see Ray gunned down, the amulet is nowhere to be found."
    },
    {
      "rating": "9",
      "text": "Jesse: You can't keep us from seeing each other.Chief Warren Kincaid: I'm the chief of police, sport. I can do whatever I want. Like for example if I were to run a blood test on you tonight and the results made you look like Christian Slater on New Year's Eve, do you think anyone would question me?Jesse: He's Bluffing Chief Warren Kincaid: Try me !"
    },
    {
      "rating": "9",
      "text": "Xmkxmckdmkdmdkmdkdkdkkdkdksd*,*,*,*,*,*,*,*,*,*,*,*,*,*,*,*,*,*,*,*,*,*,*,*,*,*,*,*,*,*,*,*,*,*,*,*,*,*,*,*,*,*,"
    },
    {
      "rating": "9",
      "text": "¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡"
    },
    {
      "rating": "9",
      "text": "{}{}{}{}{}{}{}{}{}{}[][][][][][][][][][]()()()())()()()¡!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!"
    },
    {
      "rating": "9",
      "text": "+++++++++++++++++++++++++++÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■"
    },
    {
      "rating": "9",
      "text": "Great SurpriseGreat movie. I thought it would never be as good as it was. Great special effects, great story, big laughs. It didn't take itself seriously, which is why I think it worked so well. Even the acting was surprisingly good. Overall a very funny and sometimes chilling story."
    },
    {
      "rating": "10",
      "text": "A Classic.One of the halloween movie of that time that merged 80'horror with comedy and lots of self-referential parody.This ia a must watch in Child's Play franchise for the introduction of Tiffany...but it is better if you have seen some of the older movie first"
    },
    {
      "rating": "9",
      "text": "♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》"
    },
    {
      "rating": "9",
      "text": "Streszczenie: Chucky, lalka o wyglądzie Johna-Grudena, opętana przez seryjnego mordercę, odkrywa idealnego partnera do zabicia i ożywienia w ciele innej lalki."
    },
    {
      "rating": "9",
      "text": "●°●°●°●°●°●°●°●°●°●°●°●°●°●°●°●°●°●°●°●°●°●■¡■¡■¡■¡■¡■¡■¡■¡■¡■¡■¡$*$*$*$*$*$*$*$*$*$*$*$*$*::"
    },
    {
      "rating": "9",
      "text": "Funny and scary simultaneouslyIf you love humor in your horror movies, then this one has it for you in spades. It is chock full of creativity. The two dolls, chucky and his bride, are very real like, and they make you think they are real people the way they express themselves in many scenes. The writing in this film, I thought was great. Brilliant script from the writers! This movie takes the cake for me, it is my second favorite next to the the 1st movie. The acting was served with aplomb by the entire cast This movie should be a classic, that all horror buffs should see, because it's funny, entertaining, surprising & gory all in one."
    },
    {
      "rating": "8",
      "text": "Love a good ol' classic - worth watching if you haven't seen it already. \"What's So Great About Being A Human?\""
    },
    {
      "rating": "9",
      "text": "Chucky Is Better, Funnier And More Terrifying Than Ever!\"Child's Play\" is one of my favorite horror movies of all time. I wasn't too crazy for parts 2 and 3, but after I saw \"Bride Of Chucky\" I was stunned by how good it was!!! I never expected it to be such of a great sequel. Chucky gets lucky as the indestructible boy-toy, possessed by a serial killer's soul, forges a match made in hell with his equally evil girlfriend Tiffany. Now, the two hitch a ride on a journey to find a voodoo amulet that will transfer their souls back into human form."
    },
    {
      "rating": "9",
      "text": "Bride of Chucky is so far my second fav is the whole series I thought I was not going to like it as much as an I first saw it I love this movie this movie is amazing I wish seed was like this I know it will be not be even close to good but anyway Bride of Chucky is about Tiffany is trying to get Chucky back to life which does happen Chucky lies about the marrying thing so Tiffany does not take good so Tiffany starts treating Chucky like **** so Chucky gets pissed off because of that and he escapes and he kills Tiffany but transfers her soul into a doll this movie has the funniest stuff in the whole series the comedy works so good in this movie Chucky looks amazing tiffany even in doll form does a great performance Jesse and Jade are trying to be a couple which they are but they are on the run because Chucky and Tiffany are killing people and Jesse and Jade start to question one another about these killings and start not to believe each other until Chucky points a pistil at both of them so it is opious that dolls were doing all the kills also the kills are the most unique I seen so far after child's play 2 which is saying something the whole thing I dislike is the ending drags a little bit after that movie is amazing I am glad I rewatched it before the tv series comes out so all round a great movie a great chucky movie with great performances with all the characters so I give Bride of Chucky an A-"
    },
    {
      "rating": "9",
      "text": "⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙☆☆☆☆☆☆☆☆☆●■●■●■●■●■●■$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$+÷+÷+÷+÷+÷+÷+÷+÷==+÷+÷+÷"
    },
    {
      "rating": "9",
      "text": "Hilarious This is one fun movie. This was a great installment after 'Child's Play 3'. It's 10 years later & Chucky is brought back to life by his old girlfriend, played by Jennifer Tilly. Great gags, jokes & effects keep this new Child's Play movie fresh & exciting. Jennifer Tilly does a great job in this movie. This is worth watching!"
    },
    {
      "rating": "9",
      "text": "+÷*:+÷*\"+÷*:+÷*:+÷*:+÷*:+÷*:+÷*:+÷*\"+÷*:+÷*:+=*:*$*$*$*$☆◇☆◇☆◇☆◇☆◇☆◇☆◇☆◇☆◇☆⊙☆⊙☆⊙☆⊙☆"
    },
    {
      "rating": "9",
      "text": "⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$"
    },
    {
      "rating": "9",
      "text": "____________________________________________________________________________"
    },
    {
      "rating": "9",
      "text": "$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.■》■》■》■》■》■》■》■》■》■》■》■》■》■》■》■》"
    },
    {
      "rating": "9",
      "text": "》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》********************************************************"
    },
    {
      "rating": "9",
      "text": "A great new dimension to the child's play series.Seeing this movie I was suspecting a typical slasher with no plot but Ronny Yu's new perspective on chucky brought back a whole new experience to the chucky saga. With the animatronic effects improved and the use of Tiffany Chuck's sidekick. This film puts in something to this film that was never there in previous sequels: personality. Apart from focusing on Andy the victim from the first film, this film portrays great chemistry between chucky and tiffany and with its stylish filming, clever humour and shocking death sequences this is the best of chucky yet."
    },
    {
      "rating": "8",
      "text": "Brilliant comedy horror! At the time of writing I haven't seen the original Chucky but I have seen the two previous dire sequels. This sequel is original, comic and very entertaining with brilliant catchphrases and Jennifer Tilly looking and acting stunningly sultry. The violence is entertaining and the story good. Sometimes the computer effects take over too much and the film is not scary but other than that this is a solid, well-directed, highly entertaining film which is a sequel but could happily stand on its own with a bit more back-story explanation."
    },
    {
      "rating": "8",
      "text": "this movie was a big step up in the series, we have a stitched up chucky, which i really like."
    },
    {
      "rating": "7",
      "text": "After a 7-year gap between movies, Bride of Chucky comes along during the sort of rebirth of horror (especially slasher horror) and for the most part, They do a good job. Adding Jennifer Tilly (as Tiffany) provided the Yin to Brad Dourif's Yang (as Chucky) and she has remained a huge part of the franchise ever since.The cast, for the most part, does a good job. There's plenty of entertaining kills and fun to be hard along the way as well. Bride of Chucky is a return to form and a highlight of the franchise."
    },
    {
      "rating": "7",
      "text": "Not BadBride Of Chucky may have a bland story, But it’s strengths outweigh the negative especially with the performances of Brad Dourif and Jennifer Tilly."
    },
    {
      "rating": "7",
      "text": "I like the meta tone, the inclusion of Jennifer Tilly's Tiffany Valentine, the kills, and the story.But Jesse and Jade are atrocious characters. They are so annoying, they frame each other for the murders, but then they're fine. I f**king hate them.Overall this movie is decent, though the protagonists are garbage."
    },
    {
      "rating": "0",
      "text": "Funny how?There are people who laughed their head off with this and the makers of this movie are really proud of it. Even the actors are excited if you watch them in interviews talking about the movie. But I didn't feel the excitement. It's not really horror, it's not really comedy, it's a mix of both.A mix that doesn't entirely work out for me, but maybe it's something for you. If you're a fan of the series, you'll obviously gonna like it a bit more than I do.It's no necessary to know the other parts to understand the movie, but if you do, you might get a few more laughs out of it!"
    },
    {
      "rating": "6",
      "text": "Bride of Chucky (Child's Play 4) had a different concept. The movie is not continuation of first three parts and it has a new storyline.After the last two sequels, I was expecting the worst but this actually was lots of fun. The movie doesn't take itself seriously for a second. Also there are a few gory murders thrown in to satisfy us horror fans and the film never stops moving.The acting was good. The direction was also good but could have been more better. The pacing was normal. What made this movie different from first three parts was that it was blend of horror, violence and humour. The special effects are also properly used.Overall, the movie is a fun ride which will satisfy those who love watching Child's Play franchise."
    },
    {
      "rating": "9",
      "text": "Lucky for everyoneBride Of Chucky is a great B horror film. The kind of horror films they don't make anymore. The reason why I say this is, the film understands itself. No one went to see this movie expecting a great film. Many people however want to see Chucky dispatch innocent vicms. The film makers knew they were making a fourth installment in a horror franchise and they had fun with it. Movies like this don't have to be good, they are just supposed to be fun. This film is very entertaining and I think horror fans will love the atmosphere and the tone of the film from start to finish."
    },
    {
      "rating": "9",
      "text": "Chucky's Chimeric ChucklesNormally by the moment a franchise has reached the fourth instalment most people involved from the paid script writers through to the paying public are beginning to lose heart. This is an excellent exception to that rule.The premise of the film is that the soul of the late Charles Lee Ray is trapped inside Chucky the doll. Charles's former girlfriend Tiffany plans to retrieve the doll and by use of magic, revive chucky. If only life (and death in this case) could be so simple! Once revived, Chucky would much rather occupy Mr Ray's body, which was buried with the amulet required to complete this transformation. By this segment of the film, due to the treacherous machinations of both Tiffany and Chucky, they are now both dolls. What follows is a road movie as the pair kill travel under the radar while implicating two naïve star-struck lovers Jesse and Jade who finally are connecting the dots as to what is transpiring.From the opening scene as corrupt cop Bailey makes his way through an evidence room to the Grand Guignol finale played out in a graveyard there are nods to various kindred films and characters from Michael Myers to The Exorcist, from Friday the 13th to Pinhead, throwing in clips from 'Bride of Frankenstein' and 'Murder, She Wrote' and a hilarious reference to Martha Stewart.The entertainment value comes largely from the relationship between 2 deadly dolls, their snappy one-liners, love-hate relationship and competitiveness in murderous invention.Director Ronny Yu and writer Don Mancini keep both action and dialogue pacey and ensure an excellent balance of comic moments and sanguinary shocks. At an hour and a half good editing ensures no outstaying of welcome and the accompanying music tracks from Rob Zombie, Slayer, et al is suitably heavy. Special and visual effects are extremely well done and almost seamless. Of the acting, most of the cast do what is necessary despite being upstaged by the deadly dolls. Special mention should go to Jennifer Tilly for her dangerously beguiling femme fatale.Interestingly, with only minimal references to previous films in this series, it is possible to treat this as a stand-alone item and derive just as much entertainment value from it."
    },
    {
      "rating": "9",
      "text": "Classic horror film you'll love which will leave you satisfied.BRIDE OF CHUCKY, in my opinion, is a great horror film you'll love which will leave you feeling good. The only thing about it that bothered me was some of the bloody stuff. You'll have to see the movie if you want to know why. Other than that, I liked this movie very much. Before I wrap this up, I'd like to say that everyone involved in this film did an outstanding job. In conclusion, to all you horror film lovers that have not seen this outstanding horror film you'll love which will leave you feeling good, I highly recommend it! You're in for a good time as well as some pure chills and thrills, so go to the video store, rent it or buy it, turn down the lights, lock all your doors and windows, and enjoy!"
    }
  ]
}