{
  "id": 639,
  "title": "Bride Wars",
  "starring": [
    "Kate Hudson",
    "Anne Hathaway"
  ],
  "runtime": 89,
  "genre": [
    "Comedy",
    "Romance"
  ],
  "description": "Two best friends become rivals when their respective weddings are accidentally booked for the same day.",
  "releaseYear": "2009",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/eyXT8tmUoyHrg7YX1UVjmecHCWP.jpg",
  "categories": {
    "plot": 4.0,
    "acting": 3.7857142857142856,
    "ending": 4.333333333333333,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.3333333333333335,
    "funny": 5.222222222222222,
    "action": 2.0
  },
  "reviews": [
    {
      "rating": "4",
      "text": "Besides the huge amount of cliches and the large lack of laughs, along with the self referential story; the film has a surprising amount of heart, and solid performances from Anne Hathaway and Kate Hudson. I give this movie 36%."
    },
    {
      "rating": "8",
      "text": "The movie was fairly entertaining but a little on the goofy side and with many parts unbelievable. Hathaway had drawn my attention into this one - and other than that the story was mildly interesting even though a bit ludicrous (not in a good way). I still have to give it above average though... not the worst or close to it."
    },
    {
      "rating": "10",
      "text": "I absolutely loved it. It was great. It had the right people to play each character. The acting was fantastic and the movie was very entertaining and hillariouse espesially the part were that one girl gets her hair died blue. When I first saw this movie I was like oh my gosh this is wonderful but not as great as twilight but I will say that all of the other reviews are way to mean and harsh. Do not be a devil."
    },
    {
      "rating": "0",
      "text": "I wonder how i even managed to sit through this. Once again Anne represents why she is horrible. This is a career killer along with that French musical trash she made"
    },
    {
      "rating": "1",
      "text": "With a friend like Liv(Kate Hudson), who needs enemies? With a friend like Emma(Anne Hathaway), who needs enemies? Therein lies the fundamental problem of \"Bride Wars\". Since this idiom applies to both women, the audience has no rooting interest. In a galaxy far, far away, women act irrationally towards each other to such an absurd degree, it's equally irrational, equally absurd that they should kiss and make up, without even the stopgap measure of a truce before the ironclad reconciliation. That galaxy is the prefabricated world of \"Bride Wars\", where weddings are a rite of passage for women with late-blooming arrested development, and short, very short memories. Women like Emma and Liz don't exist; they're not recognizably human(blue hair is not something any woman would forget, not even temporarily), therefore, not the least bit funny(utilizing a blouse as some turban to hide the blue hair is not a choice any sensible woman would make). \"Bride Wars\" plays like a chick flick with the DNA of a black comedy. The moment Emma decides against moving her wedding date for the more successful friend(Liv is a lawyer), \"Bride Wars\" circuitously references \"Beaches\" with the schoolteacher's refusal to be the wind beneath the other bride's wings, and beaches \"Beaches\" by being the anti-\"Beaches\", with its feel-bad hijinks. The audience should be on Emma's side, but she loses them, with this ugly putdown: \"Your wedding will be big, like your ass on prom night.\" In a mainstream comedy, it's probably a mistake that Emma should be this unsympathetic; the antithesis of the middle school teacher in Sarah Shun-lien Bynum's novel \"Ms. Hempel Chronicles\". When both women were adolescents, Liv probably started off as the smart one, while Emma was the pretty one; then Liz lost weight and the agency of their friendship switched hands. In the opening scene, the two girls play bride and groom, and Emma is the groom, the man in the relationship. Emma fattens Liv up with treats to reverse time, so the lawyer can be her fat wife again, and regain that long-lost agency in their adult selves. After all, this insulting, misogynistic film depicts both women as children, anyway."
    },
    {
      "rating": "2",
      "text": "Regarding the three weddings I served as best man for, all three couples eschewed a big, elaborate, expensive wedding. Two of them had small, private ceremonies at home for family and a few close friends; the third opted for a justice of the peace. In all three cases the logic was that the money would be better spent on: a.) starting a new life together; b.) a great honeymoon, or c.) both. Smart people, they. Leaving aside obvious questions about the wisdom of paying for a gargantuan ceremony in today's economy (since, in all fairness, this movie probably sat on the shelf long before things started going seriously downhill), you have to ask whether the two \"heroines\" of this unbearable, laugh-free chick flick possess between them both the emotional maturity to cross the street unaided much less embark on an endeavor as difficult, challenging and all-consuming as a marriage if, although they're so-called best friends, they can't come up with a viable solution to having both their weddings accidentally scheduled on the same day other than pulling unceasingly despicable (and worse, unimaginative and unfunny) dirty tricks on each other? (Another of this toxic puffball's many inadvertent messages, grooms-to-be, is that if you dare to express an honest opinion to your fiancee, you do so at the risk of having the wedding called off. Lucky you!) It's a measure of how completely clueless Bride Wars is that the heartless screenwriters not only obviously don't care about the poor woman whose scheduling glitch gets her fired, but since she's neither wealthy nor a \"hottie\" like Kate Hudson or Anne Hathaway, we're not expected to care either, but what the heck is a good director like Gary Winick (the lovely remake of Charlotte's Web) doing here? One theory may be that his previous effort 13 Going on 30 depicted a driven businesswoman regressing to early adolescence and here Winick wanted to outdo himself by having TWO career gals behave like kindergarteners, but this would be an insult to kindergarteners everywhere. Anne Hathaway (God bless her) is a fine actress who has heretofore proven her ability to make unsympathetic characters at least understandable if not likable (as in Rachel Getting Married and Brokeback Mountain) so even this junk can't COMPLETELY defeat her, but Kate Hudson (God help her) is rapidly squandering the goodwill she built up seemingly an eternity ago in Cameron Crowe's Almost Famous. So which group of movies is easier to sit through, Kate's past year's output of Fool's Gold, My Best Friend's Girl and this...or her mom, Goldie Hawn's 1970s and 80s throwaway flicks Protocol, Overboard and The Girl From Petrovka? Simply put, mother knows best."
    },
    {
      "rating": "5",
      "text": "Mildy entertaining and somewhat fun to watch but there's just not much there to make you want the movie to keep going. Perhaps a sequel, Honeymoon Wars would be more entertaining."
    },
    {
      "rating": "0",
      "text": "For every other bad chick flick, this makes any of those formulaic films I despised look like a genius. There was not a second I was not cringing, and there was not a second I was laughing."
    },
    {
      "rating": "0",
      "text": "The worst movie of 2009, so far. And I have a feeling, due to how bad this film is, that that title may stick for all the remaining months to come."
    },
    {
      "rating": "5",
      "text": "This movie was truly one of the dumbest entertaining movie I have ever seen. Let's see, first the stupidity: I was expected to believe that two women are so obsessed with the idea of marriage that they would basically end a life-long friendship over the possibility of getting married at the same place on the same day. I was expected to believe that Manhattan's \"best\" wedding planner would make a booking mistake to cause aforementioned situation to arise, and then would tell Kate/Anne that they have to change one of THEIR dates, even though they made their reservations before the other woman who caused said booking conflict to arise. Finally, the filmmakers thought I would buy two best friends pulling increasingly idiotic pranks on each other, like Anne dying Kate's hair blue or Kate spray-tanning Anne's skin orange. If they weren't talking to each other because of the conflict, how in the hell did one know where the other would be all of the time? Creepy. Nevertheless, I enjoyed this film more than I thought I would or even wanted to. As repulsive as the two main characters should have been, the likability of Anne and Kate made them somewhat, well, likeable. Or maybe bearable is a better word, but, whatever, these two actresses are cute and clever enough to deceive me into rooting for these two idiotic characters. Also, the guys were kind of cute and cool, especially Kate Hudson's brother, played by hunky, sexy, and all around sweep-me-off-my-feet gorgeous Bryan Greenberg (from the now defunct TV show \"October Sky\"). I appreciated the way Anne's and her fiance's relationship had realistic misunderstandings, with a realistic conclusion, too. Finally, I must say that the power of the two female dimwits friendship did shine through at the end, even causing me to get all misty-eyed. Overall, I don't recommend you go out of your way to see this, and if you do, PLEASE do not have high expectations. I'd say it is more dumb than entertaining. But, if you are surfing through the TV and this is on, or if you can't find anything better to rent from the DVD stores/sites, you may get some brief amusement and even be a little touched by this goofy flick."
    },
    {
      "rating": "10",
      "text": "I Absolutely Loved It!! It Was Funny And The Acting Is Great! The Other Reviews Are Too Harsh!"
    },
    {
      "rating": "7",
      "text": "Good for the happy entertainment value."
    },
    {
      "rating": "9",
      "text": "These reviews are far too harsh! I found the movie legitimately funny (Kristen Johnston was particularly hysterical) and definitely worth seeing. I left the theatre with a smile on my face."
    },
    {
      "rating": "2",
      "text": "This is torture.Ever since Sex and the City the movie I haven't seen something more stupid, sensless, numb and unfunny."
    },
    {
      "rating": "7",
      "text": "Well, it wasn't anything special, but I wouldn't call it bad. But yeah, chick flick haters, avoid. Casual chick flick fans (like me), rent it. Bigger chick flick/wedding movie/Kate Hudson/Anne Hathaway fans, see it any way you can. I think some of the bashing of this movie comes from bias and overexpectency due to Anne Hathaway's performance in \"Rachel Getting Married\". However, I'll admit, this is my first time seeing Anne Hathaway in a movie that I give below an 8 to (I've only seen her in The Princess Diaries 1 and 2, Get Smart, RGM, and The Devil Wears Prada)."
    },
    {
      "rating": "5",
      "text": "The film does have some amusing scenes, but overall it's a bit too abrasive and extreme. Anne Hathaway comes off better than Kate Hudson, but both do fine. Candice Bergen is very good in a supporting role."
    },
    {
      "rating": "6",
      "text": "Okay. It's not the best movie out there, but you could get a few laughs out of it. And that's what you want from a rented movie on a Friday night, isn't it?"
    },
    {
      "rating": "1",
      "text": "Bad. Re-he-he-healy bad. Story doesn't make sense, characters are unlikable and off putting, humor is tasteless and mean spirited and plot holes are a commonplace. Instead of the two brides fight, couldn't they just have a DOUBLE WEDDING!!?!!? They even mention it on the beginning of the film when they were children with the word \"double wedding\" completely and utterly mentioned. If that happened then the film would be finished straight away. Awful. Just awful"
    },
    {
      "rating": "3",
      "text": "There is something hateful about this movie. Sure, our leading ladies look good on the outside, but underneath they are vindictive and cut throat. I am sure that seriousness about weddings was the intention, but it always seems to go too far...it's almost unsettling. That and am I the only one who thought Kate Hudson looked good with blue hair?"
    },
    {
      "rating": "0",
      "text": "To spare you an experience that only I can only describe as being less preferable than colonic irrigation, let me describe to you Bride Wars in the best way I can: \"Two awful women who are best friends, because awful people stick to their own kind, discover that they are getting married on the same day. After they both rapidly change into a harder level of awful human beings, the kind that hate each other, they engage in 90 minutes of painfully unfunny sitcom set-ups, which we're supposed to enjoy because they are terrible people doing terrible things to each other. Then, contrivances arrive, patch everything up, and the movie ends with a BFF message, even though these two did horrible things to each other.\" Excuse, I'm going to ponder whether or not this job is worth it."
    },
    {
      "rating": "0",
      "text": "I just wanted to rate the most awful film I've ever seen, stuck on a plane whith nothing else to watch. This is absurd, the two actress must be ashame of that movie and never presente it in their curriculum vitae."
    },
    {
      "rating": "4",
      "text": "Don't' let the unfavorable reviews fool you. Bride Wars is a decent Rom-Com with heart that's surprisingly entertaining. Plus, I love Anne Hathaway and Kate Hudson."
    },
    {
      "rating": "4",
      "text": "Two bi-polar woman with far too much money and time on their hands seek to destroy each others weddings through a series of photo montages and Candice Bergen's blathering narration."
    },
    {
      "rating": "2",
      "text": "Bride Wars leaves me fighting for survival.\rThe movie isn't funny, rarely entertaining, and overall just bad. The acting is poor to average, and the concept is silly. The drama is overdone, and there is no substance whatsoever."
    },
    {
      "rating": "2",
      "text": "'Bride Wars' is a lousy, unfunny, sexist and uneven comedy that takes its two talented leads with a potentially funny premise, and wastes it in every way possible, leading to a very awkward experience, for me at least.\r The movie stars Kate Hudson and Anne Hathaway as friends; Liv and Emma, both girls who dream of getting married and planning their perfect, dream wedding. When they both find out that their boyfriends plan to propose to them, they head over to Marion St. Claire (Candice Bergen) to plan their wedding venue at the Plasa. Despite the fact that they promised to be each other's maid of honor, it turns out that both their weddings have been somewhat booked on the same day. This leads them to try and sabotage each other's weddings by committing a number of stunts including; making one gain weight by sending endless treats, making one's hair blue or messing up someone's tan by making them bright orange for weeks.\r Both Hudson and Hathaway do share good chemistry as two friends who become bitter rivals, but there is little pay-off to the comedy. The film is shockingly sexist in the way it portrays these two women and how they feel about weddings. Little screen-time is given to their future husbands (played by Steve Howey and Chris Pratt respectively), and we are expected to believe that all the girls care about are their weddings instead of the men they're marrying. The men just become the victims of not getting involved to what the girls are doing to each other.\r All in all, 'Bride Wars' is a wasted comedy that nobody should ever see, even as an ironic date movie."
    },
    {
      "rating": "9",
      "text": "Bride wars was directed by Gary Winick and has been released in may 2009. In this comedy there are several famous actors such as Anne Hathaway, Kate Hudson and Bryan Greenberg.\rThe story wich takes place in Manhattan is about two girls who are best friends. During all their lives, they have always have been together. The day they are engaged, they want to get married at the Plaza hotel in june. They get 2 dates, but after a mistake in the reservation, there's still just one date and only one of them will be able to get married there. After there is a rivalry between them which change into a war and they play dirty tricks on each over. All of these scenes are funny and very entertaining. In this film, there are a lot of action, so,we don't get bored. I really recommend this film to the people who love romantic comedy. You really should see this film."
    },
    {
      "rating": "8",
      "text": "Very nice, the ending was unexpected, which made it very exciting. Cute movie.\r Watch it online for free: https://www.primewire.ag/watch-127-Bride-Wars-online-free"
    },
    {
      "rating": "10",
      "text": "Simplemente Anne Hathaway es una gran actriz, sus películas son muy amadas en México, en especial está película, no entiendo porque tiene mala crítica."
    }
  ],
  "recommendations": [
    "something_borrowed",
    "you_again",
    "book_club",
    "ghosts_of_girlfriends_past",
    "cruel_intentions",
    "monte_carlo",
    "the_holiday",
    "home_again",
    "13_going_on_30",
    "sex_and_the_city_2",
    "the_hustle",
    "eat_pray_love",
    "tall_girl",
    "bridesmaids",
    "27_dresses",
    "good_on_paper",
    "no_strings_attached",
    "young_adult",
    "if_i_stay",
    "we_bought_a_zoo",
    "life_as_we_know_it",
    "tooth_fairy",
    "the_first_time",
    "bad_moms",
    "legally_blonde"
  ]
}