{
  "id": 2648,
  "title": "Brightburn",
  "starring": [
    "Jackson A. Dunn",
    "Elizabeth Banks"
  ],
  "runtime": 91,
  "genre": [
    "Horror",
    "Thriller",
    "Science Fiction"
  ],
  "description": "What if a child from another world crash-landed on Earth, but instead of becoming a hero to mankind, he proved to be something far more sinister?",
  "releaseYear": "2019",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/sJWwkYc9ajwnPRSkqj8Aue5JbKz.jpg",
  "categories": {
    "plot": 4.476190476190476,
    "acting": 5.28,
    "ending": 7.117647058823529,
    "soundtrack": 5.0,
    "cinematography": 7.0,
    "familyFriendly": 3.0,
    "funny": 7.5,
    "action": 7.5
  },
  "reviews": [
    {
      "rating": "10",
      "text": "As a comic book fan and a horror movie buff, this movie nailed it for me !I will definitely be watching Brightburn multiple times in the future."
    },
    {
      "rating": "9",
      "text": "Had very low expectations going into this with all the negative reviews but after watching it I can honestly say it was a blast! It’s Superman meets the Omen. It gets slowly creepier and darker as the movie goes on until you’re in full super psycho killer mode. Super gory too. Well worth the viewing! Great date movie!"
    },
    {
      "rating": "0",
      "text": "I seriously hated this movie so much. Everything from story to the costume design was 0/10."
    },
    {
      "rating": "0",
      "text": "A boy with super powers + short-sighted thought.  The film has no meaning at all.  The film is very silly"
    },
    {
      "rating": "0",
      "text": "ahahahahahahahahahhahahahaahhahahahahahahahahahahahhahahahahahaahhahaahhaha"
    },
    {
      "rating": "10",
      "text": "°》°》°》°》°》°》°》°》°》°》°》°》°》°》°》°》°¡°¡°¡°¡°¡°¡°》@@;@;@;@;@;@!!@;@@:@:@::@:@:@:@:°》°》°》°》°》°》°》°》°》°"
    },
    {
      "rating": "10",
      "text": "A great horror thriller where the villian wins at the end, the effects and the final twist are spectacular. Brightburn is a must see."
    },
    {
      "rating": "9",
      "text": "Damn, seeing this movie makes you really appreciate Clark Kent! This was more of a horror movie than a take on an evil Superman, but good non the less. If you are expecting a take on events that make a hero or a villian, don't. This alien being is just an evil entity, regardless that he was raised by a loving my mom and an ok dad. They are nothing the  Kents, but they weren't bad either. I still really liked this movie regardless of what my expectation were. In fact, it makes you really appreciate how Kal-El handles his incredible powers."
    },
    {
      "rating": "10",
      "text": "I liked the idea that horror is the genre where you can hide the secret meaning…Apparently, the film is about adoption issues. I think the idea about children or adult children from dysfunctional families and children with birth defects encrypted in the movie. There is a big problem with adopted children from dysfunctional families or children with birth defects. I think it’s hard to discuss it openly.Children of dysfunctional families and children with birth defects are a broad concept. Not all, but some of them may have brain damage, intellectual disability, behavioral and cognitive disorders, including difficulties with learning and memory, hyperactivity, lowered stress tolerance, autism and Asperger syndrome. Some of them have less severe forms of the condition – they just aren’t born in love.Suchlike children during puberty begin to show antisocial or deviant behavior. But antisocial behavior is manifested in different ways. Symptoms may be caused by stealing, torturing animals etc. Children like that can insert a chopstick into the eye and at the same time feel nothing. They don’t understand that they are hurting, that the other person or animal is suffering. Such individuals have schizotypal personality, characterized by difficulties with social interaction and communication, and by restricted behavior. The symptoms of the adopted child in this film were manifested by the killing people.Among other things the film offered options for addressing such issues, which is an even more difficult topic for public discussion of such issues in society. When the adoptive father realized that his adopted son was killing people – took him to the forest and shot him in the head.There is another aspect of this topic – adoptive parents and particularly the adoptive mother. The adoptive mother subconsciously knew that something about her child is wrong. But the adoptive mother continued to protect him to the end. And it’s a natural reaction for any mother. Adoptive parents get into a very difficult situation. They raised him from the cradle. They invested so much love into him. They have been through so much. After all they have to get thrown him to the mob or take him to the court.Adoptive parents may have a high social status and a well-paid job. May be they are high-ranking officials. And now they can lose their life work, they can lose everything if everyone finds out that their child is a murder. They have a reason to cover up a criminal. A similar situation is well described in the Russian TV series “The Method” (2015). Psychological thriller consists of 16 episodes and is considered as adaptation of the American TV series “Dexter” (2006-2013)."
    },
    {
      "rating": "10",
      "text": "This movie is amazing, I loved it. The way they made you view the movie as both the villain and the victim all while scaring you at the same time, and I didn't get scared of the jumpscares, I got scared at the fact of what he was doing, it also accurately displays what people would do in feat an  overall amazing movie"
    },
    {
      "rating": "10",
      "text": "What if Superman was born from a angry alien race who invade planets and finds himself on planet Earth? What happens when he discovers he is \"special\"? Brightburn considers these ideas and more. Really interesting take on super hero films, also really bloody. I really enjoyed it."
    },
    {
      "rating": "10",
      "text": "This movie managed to be exactly what I was hoping for and more with good horror and an interesting supervillain origin. The movie also offers something you won't see in most other superhero movies: the absolutely BRUTAL effects of someone with Superman level power attacking people. Gore serves a good purpose here."
    },
    {
      "rating": "10",
      "text": "Great fun watching a kid killing pretty much everyone he interacts with.. little gory but still great"
    },
    {
      "rating": "3",
      "text": "Horrific, irredeemable, outrageous. Those are the words I would use to describe this fundamentally flawed movie. Acting and special effects were okay."
    },
    {
      "rating": "10",
      "text": "Freshest movie i have seen this year, best super-villain movie an adult could ask. Very brutal movie, will watch again and look forward to pt2!!! (fingers crossed)"
    },
    {
      "rating": "10",
      "text": "Amazing movie! Hope they make more! Really enjoyed it! Think, evil Superman."
    },
    {
      "rating": "10",
      "text": "It's really good. And i liked it and it's really different. It shows us if superman was a villain what happeens."
    },
    {
      "rating": "7",
      "text": "Not enough stunning and brave moments so the shill access media critics can clap like seals even if something is badly written? Ok movie not great not bad just fine I was entertained. Evil super boy what more can you say? Kind of called the ending though and not one for the kiddies."
    },
    {
      "rating": "5",
      "text": "Superman origin story with a Twist. He turns out to be an angry murderous 10 year old super powers. 2 stars for a great original idea, 2 stars for innovative interesting kills and 1 star for good performances. Especially young actor Jackson Dunn. When I first heard the premise, I went oh yeah! I guess I'm suffering from Superhero burnout like a lot of people. But it didn't take long to see the flaws in the actual movie making. The first time  hour is disjointed and confusing. It should establish the gradual transformation of a normal child into a raging homicidal maniac. It does not do that. One minute he's throwing a lawn mower half a mile away with a flip of a wrist, the next minute he's killing someone slowly with quiet sadistic glee. This transformation is the single most important part of the story. We must be interested in this family and this child. It must break our heart when the warning signs begin to pile up. I'm not sure who to fault, first-time director David Yarovesky, or screenwriters Mark and Brian Gunn. Previous Works include Journey 2: the Mysterious Island and Bring it on again. Not an auspicious beginning for 3 people with such mild credentials. The young man's acting as the titular anti-hero is good. Expect a lot from him in the future. Elizabeth Banks and David Denman as his parents are adequate. And our bad boy anti-hero kills people in some interesting ways. I don't think I have seen  things down in this way before.  And it also points  to the fact  that the director may be good at horror movies. Or suspense movies. But even genre movies need  well thought-out  framework . This would have probably been a very really good 30 minute short film. If you must watch it, fast forward to the last half-hour."
    },
    {
      "rating": "10",
      "text": "One of the few movies I’ve enjoyed in a while with an ending that wasn’t too expected. Worth seeing."
    },
    {
      "rating": "5",
      "text": "This film was kinda disappointing to me but it was still a good experience. Here are the positives of the film. Elizabeth Banks and David Denman did an amazing job and have great chemistry together. There is a bunch of gore in this film that is incredibly brutal and works very well for what the film is going for. It makes your entire body cringe in a good way. The tone remains consistent throughout the film. The score for the film is really good also which surprised me. This film also knows how to build tension. It builds and builds and builds until it pays off most of the time. The concept for this film is one of the most interesting I have ever heard of. The Superman origin story but instead he turns evil instead of good. That what makes this movie so disappointing. Unfortunately, the film doesn’t do anything beyond the concept. It’s incredibly basic to the point where it can feel dull at times. Another problem is that you never seem to connect with the child actor. He does an okay job acting but you can’t connect with him. His only motivation is to destroy the world because his spaceship told him to. My main problem is that the last 25 minutes of the film is so dumb. Everything about it is just awful. The visual effects are terrible and it decides to end the film with Billie Eilish’s Bad Guy. Why end a film this dark and gritty with a pop song. The film then decides to show news montages of the Kid’s destruction. It made my score from 7.5 drop to 5.5. Overall, Brightburn has an amazing concept with great acting but does a bad job at execution with a terrible ending. I give Brightburn a 5.5/10."
    },
    {
      "rating": "0",
      "text": "As a comic lover and massive horror fan this movie could not be anymore of a let down. Don't buy it, stream it, or wait till you find a dvd that was thrown to the side of the road; there are better things you can do with the 90 minutes."
    },
    {
      "rating": "10",
      "text": "biyfguyfigufugtdwwtuojomolnknigugydrstfjfyhigighgufhgufugyfigugigugfghugryysyryhgugfyfugughh"
    },
    {
      "rating": "8",
      "text": "A really scary movie. I loved it. How they manage the tension is EXCELLENT. Having this child on earth must be very scary. The plot is \"what if Superman was bad\". Warner and DC Comics have nothing to do with this project, they just based on that character to create this one. If you do not know anything about Sups mythology it will seem like a good movie, but if you know even the actors who have played it and much more you will understand every tribute. 100% recommended."
    },
    {
      "rating": "8",
      "text": "A very entertaining film, but let down by the poor dialogue and lack of plot. It stays centered nicely around its premise though, with no excess rubbish. You get to enjoy what you set out to enjoy, which is just pure, gratuitous brutality. It's very amusing too, that's the best thing about it. It has a really dark sense of humour and I get the impression it's not trying to be anything spectacular. It kept me hooked until the end and I left happy, having seen something original. Good casting for the kid too, he looks like a psycho."
    },
    {
      "rating": "7",
      "text": "I had high expectations going into this movie. The trailer hooked me and I thought it would become one of my favorite movies. It didn't but its still a good movie. The killings are violent but there is little suspense. All the actors and actresses were good but there was just something missing from this movie that keeps it from being great."
    },
    {
      "rating": "7",
      "text": "TL;DR - A good one time watch in this current age of over saturation for the 'Good Guy Superhero' tales, though not perfect since the movie could have used some polish on the emotional side. Even so Expecting a Superhero movie is a big mistake and the viewer would benefit from a open minded approach or a Horror expectation since the latter is clearly what the Writer/Director's intended this film to be. And boy do we have Horror feels in spades. If you watched Slither and thought it was a good and or average watch this movie is definitely up your alley.The GoodI am pretty shocked at the rating for this movie, specially the critic side. I do not know if it was case of misplaced expectations although I don't know why considering the trailer was pretty straightforward, but for a 7 million budget this movie is quite a watch.Personally I was definitely not expecting a typical Superhero action flick, neither was I expecting a legitimate horror experience. For leaning towards the horror side I do believe this movie was on the right track considering Gunn's experience with Slither and good story telling in general.Even though Gunn did not direct the movie I still see his panache of good writing, great characterization and compacted story here. The VFX were thankfully sparring used since they were not the best but that being said they were effectively used fully taking that R rating into itself.The BadThere were a few things that would have benefited from streamlining. For example the child-mother relationship could have been better. The child seems to be distant from the start there by only giving us a one sided Maternal love to an unruly child over a more emotional Mother-Son relationship, especially considering how the film ends. The ending would have been more impactful if the Son really made us believe that he truly loved his parents before his turn rather than the aloof and already distanced feel that permeated the characters. A little bit more surprise and confusion on the part of the Son would have also helped in driving home the emotional side since the Horror aspects of the film were excellent."
    },
    {
      "rating": "5",
      "text": "To say the least, I was underwhelmed. What the movie promises is not what it is. Fortunately, that doesn't necessarily mean it's bad, but it's not as good as it could've been. It's predictable from the get-go and plays out exactly how I had assumed. The writing is lazy and the acting is terrible from the \"pro\"tagonist, however the rest of the cast carry him fairly well. The best part of the movie is the gory murder scenes, in which you'll see where the movie thrives. It's somewhat like a Final Destination movie, in that the excitement you get during the movie is in waiting to see the next death. This, like I mentioned, was not what I was expecting from the movie but certainly not how it is portrayed in its trailers either. Misleading ad campaigns really messed this one up. However, for shallow entertainment and a few creepy scenes, it's got what it needs. The director really went in a bold direction for the movie as well, which was a fresh twist that we don't usually get. Hopefully if it gets a sequel, the director will fix his shortcomings and continue on with what saved the movie from being terrible."
    },
    {
      "rating": "7",
      "text": "It was a good move. It kept me interested until the end. I would watch a sequal if they they continued the universe."
    },
    {
      "rating": "8",
      "text": "In the polluted super hero genre, it's refreshing to see a new take on it.  To see a movie that doesnt have a happy ending and potentially leading into a bigger universe of films, I look forward to see where this goes."
    },
    {
      "rating": "9",
      "text": "Love the end credits song. Pretty decent movie not as scary as you think. Hints: \"Soups\" gone bad... \"Homelander\" season."
    },
    {
      "rating": "10",
      "text": "A completely satisfying movie. It met all my expectations but did not exceed them. It's pretty much the story of Superman but if him hitting puberty went wrong."
    },
    {
      "rating": "9",
      "text": "A nice, well acted super villain/horror flim that pulls off some nice visual kills.Still can't believe this was pulled off with such a small budget. All future film makers should look see this to see how well they stretched the budget."
    },
    {
      "rating": "2",
      "text": "It burns, it literally, does, at least they have got that part right, this question reaping tale gets a questionable look. Brightburn Yarovesky is a practical filmmaker. His methods might fabricate the commercial cinema with a character driven approach but he actually craves for cheap shots. And I wish I could say that with it comes cheap thrills, but with not a single ounce of horrifying moment in the film, I would be shooting in the dark. I mean aside of the fact that the time won't pass by easily, plus it is not easy on the eyes too, with head scratching visuals to poor vfx, this is as low a horror could go. I wouldn't blame the director, David Yarovesky but the writers Gunn brothers who are just throwing stuff out and about in the storyline and claims it to be an arc or the pivotal point. The film is more \"Where is it going?\" then it is \"How is it going\" now, frankly that's not much of an issue, if there lies a spectacle to behold in the horizon. But just like those hide and seek game that Elizabeth Banks plays, it builds up the tension a lot only to disappoint you with a 12 year old hiding in a barn. The content itself doesn't have potential especially not the way it is treated. What amps you up for the world is curiosity that we have and it is not something the film earns along the way, if anything it sobers up from whatever interest we might have had before going into this loud farm. The dinner table conversation from which the idea was given birth too, stays right up there, alright, it may develop into a train of mockery. But, all of this was anticipated or at least was possible in a way, but what comes off as a shock is Banks as an overprotective mother, and yes her character is too dogmatic for her to account in her own opinions, but hey, it's Brightburn, even the Sheriff in this town is questionable."
    },
    {
      "rating": "9",
      "text": "Brightburn manages to deliver on its amazing premise and adds a few twists and turns that make the film even more disturbing. With great gore and psychological scares Brightburn is one of the best horror films of the year thus far."
    },
    {
      "rating": "3",
      "text": "Mhm no that, unfortunately, nothing. The idea is wiIt comes out quite well. There hasn't been an evil Superman so far. There is a strong lack of implementation. There are many lengths and the actors are miscast. The feeling just doesn't arrive."
    },
    {
      "rating": "7",
      "text": "What if Superman was evil sociopath and wanted to take over the world? Brightburn is basically this, it tells the same story as origins of our beloved superhero but makes him evil god of destruction. The movie suffers from lack of budget, and it shows but still its a very enjoyable twist from all good superheroes. I do hope this will get enough popularity to spark the sequel."
    },
    {
      "rating": "1",
      "text": "Para mi que está película la hicieron de un día para el otro, entretenida a ratos pero en general no tiene ni un brillo, típico cabro chico subnormal pseudo alienígena diabólico que fácilmente sale en cualquier película de niños malos y para rematar, un final tirado de las mechas, como ver escenas recicladas de películas de superhéroes (en el mal sentido) que desde la película muestran en la tele como si fueran noticias.No la recomiendo, al menos que no tengas nada mejor que hacer, al principio creí que podría llevarme alguna sorpresa, pero no, olvidable por completo, lo mas aburrido que he visto en el año."
    },
    {
      "rating": "8",
      "text": "Me gustó mucho está película, el niño q hace el papel principal lo hace super bien y es una excelente vuelta de roles a Superman"
    },
    {
      "rating": "8",
      "text": "Σε αυτήν την πειραγμένη βερσιόν της ιστορίας του Superman με αέρα «Προφητείας», στη θέση του Κλαρκ Κεντ έχουμε ένα 12χρονο αγόρι (Τζάκσον Α. Νταν), το οποίο μεγάλωσε υπό την προστασία δύο γονέων απεγνωσμένων να αποκτήσουν παιδί. Στο κατώφλι της εφηβείας, το αγόρι αρχίζει να βιώνει αλλαγές που παίρνουν τη μορφή σκοτεινών δυνάμεων, οι οποίες συνοδεύονται από μια δυσβάσταχτη υπαρξιακή κρίση. Όσο δεν παίρνει ικανοποιητικές απαντήσεις, αυξάνονται και τα δολοφονικά του ξεσπάσματα."
    },
    {
      "rating": "8",
      "text": "I was expecting a little more, but this is a great movie.  I can handle gore, and it definitely has its share, but I would have liked him to have a more bullied backstory.  I think it would play as more real if he was severely bullied...had more of a traditional psychopathic breakdown, instead of a possession level personality change at twelve. I think it would be more interesting if the bullied kid found out he had superpowers. It needed more exposition. I still find it hard to believe that both his parents try to kill him. I can’t imagine killing my son no matter what he did. But other than that, I think it is a far more realistic take on the superhero genre. It’s unsettling and fun for the main character to be a young looking twelve."
    },
    {
      "rating": "8",
      "text": "A rather fun and thrilling take on the satire and cliches of superhero origin movies. Brightburn takes what we love about Superman and turn it all on its head! Plenty of chills, thrills, and gore! But since this is also a \"horror\" movie, the movie kinda gets boggled down by its typical horror cliches. But the ending has a rather interesting twist, taking an even more twisted take on superhero/supervillain teams and cinematic shared universes!"
    },
    {
      "rating": "5",
      "text": "This is about an average movie as you can get. The script wasn't great and the actors here did the best they could with the material they had. But there was nothing memorable here except the extreme over-the-top gore that came with the various deaths. Seriously it's not for the squeamish. This feels like a very mediocre fan fiction for the start of Superman's story. I don't know that it deserves to have a sequel that it was setting up for."
    },
    {
      "rating": "2",
      "text": "Interesting premise but the characters and plot were predictable and shallow. It just didn't do enough to keep you entertained. You could predict a large amount of the plot within minutes. Heck, I did so before I even started."
    },
    {
      "rating": "0",
      "text": "james gunn asks his family to \"write\" a script... and it's a total mess... All the characters are stupid, the script is non sense (the boy discovers his powers... and gets ok with it.... wtf)... the only things to save is some gory effect... all the rest is trash."
    },
    {
      "rating": "0",
      "text": "Do you know the meme with the dog sitting in a burning building, drinking coffee and saying: \"This is fine\"? That's how litterally every character in the movie acts, when they see what's happening around them."
    },
    {
      "rating": "2",
      "text": "I'm as bored writing this review as I was watching the film so feel free to skip to the star rating and avoid this utter nonsense that is Brightburn. For anyone still reading all you need to know about this film is it takes the idea of Superman and flips it on it’s head. What if a child from another world crashlands on earth but instead of being here to save it, he’s here to take it. A great idea but the result is far from great, or even good because that’s all it is. A good idea stretched into a full length film. I didn’t have high hopes for Brightburn but I was expecting better.A film never comfortably fitting into one particular genre, it plays out very much like Smallville then takes a sharp detour into a horror genre, think predictable child possession movie and all that stuff we’ve seen before. Tori (Elizabeth Banks) and Kyle Breyer (David Denman) have been trying to have a baby for some time now and one night their prayers are answered when a baby crashlands in the woods and they decide to raise him as their own. Well as Brandon Breyer (Jackson A. Dunn) starts to grow up it becomes apparent he’s no ordinary child. If I can say one positive thing about Brightburn at least it wasn’t afraid to shy away from the violence. It doesn’t go overboard but it’s enough to make you squirm in your seat. It moves from set piece to set piece, there’s nothing surprising and at no point was there any atmosphere, and with only a 90 minute running time I found myself getting quite bored. Now I know there is an audience out there for this movie somewhere because it’s not suffering as much at the box office as I would have expected but if I stopped to ask the six other people in the screen after the credits rolled I’m presuming they were as unimpressed as I was.Brightburn also suffers from its very own trailer, how many times have I criticized a movie for that? Honestly someone tell me because I’ve lost count at this point. This is a particular problem for horror movies in general, and considering Brightburn fancies itself as a bit of horror it’s fallen into the exact same trap. The film’s scariest scenes have all been shoved into the trailer to bring in the target audience so when you’re sitting there watching it there’s no longer any shock value. You know how a majority of the “scary” scenes will play out because you’ve already seen them. They even managed to throw in a couple of cheap jump scares for good measure. To sum up if you’ve seen the trailer then you’ve seen the movie and you’re probably going to feel pretty annoyed if you paid a full price ticket to see a mediocre Superhero origin horror mashup that has a hard time keeping anyone’s attention. A great idea, poorly executed and not recommended."
    },
    {
      "rating": "8",
      "text": "This is a very interesting idea of other vision of popular hero's story. I like it, beacause this free improvisation could be true about childhood of Superman.Also, the ending is great - it has a dark tone and a possible chance for a sequel. But it never be"
    },
    {
      "rating": "7",
      "text": "Brightburn was known to be a movie that was about a boy who was the EVIL, DARK version of Superman with the same origin and powers. It is the directorial debut of David Yarovesky. It’s about a kid named Brandon Breyer with a Superman origin and raised by a couple in a farm and then when he grew up, he turned into something far more SINISTER. One surprising thing was James Gunn brought 2 members of his family to write the script while he’s producing the movie. Unfortunately, it was banned in my country but I had found an easy way to watch it in a free website. How lucky I was! The performances are okay, with Elizabeth Banks being Tori Breyer and David Denman as Kyle Breyer but I think the most impressive performance given here is Jackson A. Dunn being Brandon Breyer, the evil version of Superman. His role was actually one of the roles that are too mature for child actors like Kirsten Dunst being Claudia from Interview with A Vampire (1994), Linda Blair being Regan MacNeil from The Exorcist (1973), the cast of the Losers’ Club from IT (1990) (2017). However, Dunn could handle it and he was really good with being Brandon. He had this dark personality and character. Superman was good and Brandon was like “Now I’m gonna kill you all!”. He didn’t even give anyone a chance to survive, except for one but the others, they all die. I won’t spoil it.  The special effects made the movie looked really expensive but it was only $7 million and that means the movie was cheap and I was really impressed with the whole thing they did with just $7 million. They had good cinematography as well. It looked different from Slasher Films but when you watch it , you could feel that it was a Slasher Film. After killing someone, Brandon would be like “Hey I killed this guy, let’s add him into my kill count list to never forget about what I had done. I can draw his dead face as well!” and he did if you saw in the trailer. Many things made this movie really enjoyable and entertaining. The problem with the movie was the time, how long the movie was, 91 minutes which was really short. They could have add longer so that there would be more about Brandon like Kyle and Tori could’ve find out about Brandon’s identity or the purpose that Brandon had to fly here when he was a baby on a spaceship. It coul be more that just “take the world”. The ending was the most impressive of all things I liked about Brightburn. It was like many other horror movies where the bad guy wins. The kill counts are innummerable and the bad guy lived happily ever after. Horror movies suck when they have happy endings. This is not a bad movie. We had a new genre thanks to this, a horror superhero movie. I exclude R-Rated superhero movies like Watchmen or Blade because they are just bloody, not scary. I just hope they could lengthen the movie if they wanted it to be better but then it got mixed from Rotten Tomatoes being 56%, 46% in Metacritic and 6.6 in IMDb. Nevertheless, Brightburn is damn good to me!"
    },
    {
      "rating": "6",
      "text": "Not bad. Pretty predictable if you saw the trailer, otherwise the ending might surprise you. The biggest problems with this movie are continuity and pretty bad acting from the lead. Kids will be kids. The rest of the cast does a decent job of making him look at least sorta ok. However continuity from scene to scene is where the movie shows its low budget. One minute something terrible happens and everyone's in total and utter shock and a minute later it's as if nothing happened. It's as if they were going to shoot scenes in between those and those all got cut or edited out. I think it's probably just due to poor direction however. Yarovesky probably just hasn't quite gotten the hang of it yet. Not off to a terrible start, but he still has a way to go."
    }
  ],
  "recommendations": [
    "would_you_rather",
    "the_curse_of_la_llorona",
    "mama",
    "wish_upon",
    "dark_skies",
    "chernobyl_diaries",
    "splice",
    "unfriended",
    "i_am_number_four",
    "case_39",
    "devil",
    "the_purge",
    "happy_death_day",
    "happy_death_day_2u",
    "the_possession",
    "the_new_mutants",
    "ouija_origin_of_evil",
    "shut_in",
    "annabelle_comes_home",
    "unfriended_dark_web",
    "limitless",
    "the_conjuring_the_devil_made_me_do_it",
    "house_at_the_end_of_the_street",
    "better_watch_out",
    "paranormal_activity_the_marked_ones"
  ]
}