{
  "id": 2387,
  "title": "Bright",
  "starring": [
    "Will Smith",
    "Joel Edgerton"
  ],
  "runtime": 117,
  "genre": [
    "Fantasy",
    "Action",
    "Thriller"
  ],
  "description": "In an alternate present-day where magical creatures live among us, two L.A. cops become embroiled in a prophesied turf battle.",
  "releaseYear": "2017",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/whkT53Sv2vKAUiknQ13pqcWaPXB.jpg",
  "categories": {
    "plot": 8.241379310344827,
    "acting": 8.470588235294118,
    "ending": 7.5,
    "soundtrack": 5.0,
    "cinematography": 10.0,
    "familyFriendly": 3.0,
    "funny": 7.5,
    "action": 8.210526315789474
  },
  "reviews": [
    {
      "rating": "8",
      "text": "Bright really highlights the growing disconnect between 'professional critics' and the people who watch films for enjoyment.  It was never going to be a world beater or win an Oscar but what it does do is meld Will Smith's other buddy cop movies Bad Boys with Dungeons & Dragons.   Plenty of fun one liners, plenty of action and despite people trying their best to find some social commentary about the treatment of different races Bright is purely an action movie set in a fantasy world and newsflash to the reviewers out there fantasy worlds are often segregated.   If you are in to fantasy settings and movies like this then it's a fun way to spend 2 hours, if you are a stuck up movie critic then best you go watch Schindler's list again.   Even my wife liked Bright and she doesn't like anything."
    },
    {
      "rating": "8",
      "text": "I'm absolutely astonished by the poor reception this movie has gotten. So much so I actually registered just to write this. This movie never tries to be anything more than what it is. Alien Nation buddy cop movie in an alternative present world with Tolkien-like fantasy elements. And it's entertaining as hell! I have a feeling maybe a lot of people have chosen not to like it because it's a Netflix-production and potentially might upset the balance (and $$$) in Hollywood, but Netflix makes content for users, not critics. This is the rare action movie I might actually watch more than once."
    },
    {
      "rating": "10",
      "text": "I watched Bright and I loved it. It's very hard to take an old and beaten trope such as cop buddies and turn it into an original, clever and ultimately fun movie.I REALLY hope there is a sequel.So, how many \"professional\" critics were paid by mainstream studios to give this movie such a low rating? Are they that afraid of Netflix?"
    },
    {
      "rating": "8",
      "text": "I highly enjoyed this film.This movie gave me what i want from a action fantasy film.It was a great popcorn flick and i hope see Netflix run with a trilogy for Bright.I definitely want to see more of this fantasy world in Bright.I give it a 4/5"
    },
    {
      "rating": "8",
      "text": "I'll be honest this film isn't high art, but what it is is imo is a well done buddy cop action police procedural and if you just turn your brain off, sit back and enjoy the popcorn then you'll have great fun, and that is the biggest metric for me with films. Did I have fun or not?I rarely expect high art when I'm going to watch a Will Smith movie so I didn't expect one going into this. Also I am factoring price into this as effectively I consider the price of a netflix subscription to be a sunk cost already so it's effectively free imo. So a good fun cop movie but with orcs, elves and magic. Some good jokes, yeah some of the action scenes were a bit weak but after having seen how bad the action sequences were in iron fist I can forgive a lot. I do admit to REALLY loving the police procedural/buddy cop movie genres though so I will forgive a lot. So I'd say on a quiet night during the holidays when you're zoning out after too big of a Christmas dinner this is a good enough distraction for a couple of hours."
    },
    {
      "rating": "8",
      "text": "Not the best movie ever, but it has a refreshing universe, reminding me a lot of Shadowpunk, a universe many RPG fans know and love. I'm not sure where all the hate come from, I've had a lot of fun watching it, the plot isn't bad at all, the only problem would be the villains, who are a bit \"random\", without personality and just being evil without reason. Otherwise, the movie's pace is nice and it doesn't feel awkward to mix these very different universes. I hope there'll be more episodes !"
    },
    {
      "rating": "10",
      "text": "This is what good ideas looks like. Ambitious, yet astonishingly well-executed. Tons of bad language, violence in fantasy/cop movie mash-up. Bright offers a clever critique of racism from a world of spells and sorcery. 9/10"
    },
    {
      "rating": "6",
      "text": "I watched this movie because my brother insisted that it was the best movie of 2017, despite the negative reviews from critics. While many critics were too harsh on this film, I agree to some extent with the critiques on the bland scene framing and script writing. I also did not like the fast-paced sentimentality that tried too hard to appeal to pathos (no spoilers, ski-cap). Despite the mediocre aspects of the movie, I enjoyed watching it for fun. I wouldn't agree with my brother that this is one of the best movies of the year, but it doesn't deserve a zero. User sterge10 on metacritic commented that the movie, \"meld Will Smith's other buddy cop movies Bad Boys with Dungeons & Dragons.\" I think totally agree with him. This is one of the film's mighty orcish strengths, it's urban-fantasy uniqueness that people tend to find in comics, cartoons, video games, and tabletop roleplaying games. I'm glad such a genre is finding its way to, errrr, digital cinema through this movie. This unique, overly decent, and fun film should definitely have scored higher with the critics."
    },
    {
      "rating": "6",
      "text": "Probably a lot of people who will disagree with me on this judging by the user reviews but I was not thrilled with this movie. I liked the concept and I thought it was very ambitious but everything else fell short. The plot was very strange so it took me a while to wrap my head around it. No chemistry between Will and Joel at all for most of the movie. The action was fun but unfortunately that's one of the only positives here. This isn't a bad movie or a good one just mediocre."
    },
    {
      "rating": "5",
      "text": "An interesting idea executed in a very simplistic way, its protagonists do a good job, especially Joel Edgerton, but the film never provides something more substantial and ends up as an empty and forgettable entertainment experience.If the sequel arrives, I expect something much better."
    },
    {
      "rating": "8",
      "text": "They crammed a lot into a movie.  This would be fantastic as a series where they could really take the time to explain to emergence of all the races."
    },
    {
      "rating": "8",
      "text": "Cool concept and a new world to explore I hope they expand this story into new chapters. Has all the charm of an old school buddy cop movie in the context of an interesting universe. I do not understand the poor reviews of the critics the acting was good, directing was fine, had interesting plot twists, seemed more original than a lot of movies these days."
    },
    {
      "rating": "7",
      "text": "¿ que clase de señor de los anillos y ultravioleta es esto? un film entretenido para salir de la rutina de las peliculas taquilleras sobrevoloradas. Recomendada."
    },
    {
      "rating": "8",
      "text": "High concept fantasy mashup of swords and sorcery and buddy cop genre. Surprisingly good overall. Inventive, witty dialogue with strong characterizations and clear narrative. Excellent action. Critics rate this 29 and Last Jedi 85? The world is out of balance. This is a much more enjoyable and far more original. Ignore the professional critics and read the user reviews."
    },
    {
      "rating": "8",
      "text": "A great action movie that won't even cost you $15 at the theater. Bright is fun, funny, and full of heart. Ignore the critics, the film studios butter their bread and they don't want to see projects like this succeed. I'm looking forward to the sequel."
    },
    {
      "rating": "8",
      "text": "This is how it look like, when u make a great movie, but you forget to pay the critics'. :D 8/10"
    },
    {
      "rating": "8",
      "text": "Bright isn't terribly original or subtle, but it's much more entertaining than the average Hollywood blockbuster. It has an earnest sense of honesty that quickly won me over, which is rare. The characters felt so real I almost forgot I was watching sci-fi. Big props to the makeup artists!"
    },
    {
      "rating": "10",
      "text": "I really enjoyed this movie, it is the type of movie I wish was made more often. I thought it was a good story, solid action, funny and a concept I wish was in more high quality productions. I hope they make at least a couple more."
    },
    {
      "rating": "7",
      "text": "I’m not entirely sure why there is the level of animosity regarding this film.  Yes it borrows plot points from many previous films (Alien Nation, Leathal Weapon, LOTR) but honestly what doesn’t have a hint of other directors styles, other plots, other effects.  I liked it.  There were a few times that seemed strained until it got rolling. It succeeded in entertaining me - and sometimes that’s all I want in a movie."
    },
    {
      "rating": "5",
      "text": "A film that manages to take Will Smith's most compelling attributes his wit and charm and buries them. The film is competently made and has some interesting ideas, but most of the fantasy elements come across poorly developed. An okay movie that's watchable but not much else. C"
    },
    {
      "rating": "8",
      "text": "As you can see from the metascore and user score comparison, this is a great movie that just got in the way of big Studios.It's a pretty great movie with quality action, good leads and a Shadowrun-esque setting. Hope Netflix won't take the biased critics into consideration and goes for a sequel."
    },
    {
      "rating": "8",
      "text": "Pretty solid action movie. Fun and entertaining. Plot is predictable in places and some of the story is shallow, but I don't expect an oscar worthy writing from an action flick. It's nice to see a decent film like this that isn't ADAPTED from something else. Support original films people."
    },
    {
      "rating": "9",
      "text": "I’m not sure what movie the critics were watching but this movie was great. I thought for sure that taking the fantasy elements and putting them into this setting would be a disaster but it was actually done very well. I’m eager to see where this story goes. I have to agree with one person who put it’s a lord of the rings/lethal weapon perspective."
    },
    {
      "rating": "7",
      "text": "Mettre plus qu'un 6 ou 7 sur 10 à ce film, faut pas déconner non plus.. C'est l'équivalent d'un Big Mac cinématographique, on passe un bon moment, ça a un bon goût mais rien de plus. Par contre, les critiques payés pour et qui octroient à ce film un 0... on sent bien votre rage de Suicide Squad :)"
    },
    {
      "rating": "10",
      "text": "I really enjoyed this film. I can't understand the negative reviews from the critics. What movie were they watch? Because Bright is a fantastic blend of the \"Buddy Cop\" and \"Fantasy\" genre."
    },
    {
      "rating": "9",
      "text": "I really like how this film mixed ancient fantasy with a modern take on things with elves, orcs, fairies and humans in an alternate universe where magic exists. I felt like the crude language was a bit excessive at times, but I thought the overall story was good. I see the critics gave this show almost universally bad (and unfair) reviews, so this motivated me to leave my own review. I hope this becomes a series."
    },
    {
      "rating": "8",
      "text": "Don't believe the critics, this film is really good. True it's never going to win an oscar, but it is what it is & does it really well. It builds a universe i definitely want to see more of. One of the best popcorn movies i've seen in quite some time.End of watch meets lord of the rings"
    },
    {
      "rating": "10",
      "text": "This movie is Awesome ! Thank you Netflix for making a movie so unorthodox."
    },
    {
      "rating": "7",
      "text": "I had a difficult time seeing what was so bad about it as well- suicide squad was flawed in many ways, I didn't feel the same frustration watching this, actually I enjoyed it. The pacing and tone was on par with End Of Watch- I would have liked to have seen the Dragon come more into play, the portrayal of fairies as pests servedseems like a huge waste of potential, the dialogue was a bit dull and the villain character developement was weak, as well the usual buddy cop situations didn't feel earned. All that said I did enjoy it, I think the concept was well developed though the script and characters developement, as well as fully utilizing the more interesting aspects of the movie's universe could have been stronger."
    },
    {
      "rating": "9",
      "text": "A very fun movie to watch. There are some weird plots but does not follow overused movie tropes."
    },
    {
      "rating": "7",
      "text": "Is it a great movie? No. Is it a crappy movie? Hell no. Look, I went in without any expectations and got surprised by how good it was. It did take twenty or so minutes before I really got drawn into the movie. It definitely isn't the 2.8 like the critics want to make you believe it is."
    },
    {
      "rating": "7",
      "text": "I don't know what the critics were expecting out of Bright. I saw it with no particular expectation and I had a lot of fun watching it. It's an action flick setup in the future with fantasy elements. This film serve as an introduction to a world with many races, which remind me A LOT about Defiance TV show. The story is interesting as it brings a lot of lore into the table. Maybe the acting is not perfect but it serves the plot perfectly. I like the wand stuff, as it is compared to a nuclear weapon. I like the racist side of the story with the Orcs and even the Elves...and all the tribulations that goes with it. The Fx are pretty good...Maybe the point where the movie fails is the motivation of the FBI of magic in all this. It's never really clear on which side they stand. They announced a follow up and I hope it will be even better. I give it a 75%. Very entertaining and not deserving the critics unfair ranting."
    },
    {
      "rating": "9",
      "text": "It was creative and different. The acting was solid. The story was interesting enough to keep me entertained. My kid thought it was cool as hell. Ninja Elves."
    },
    {
      "rating": "8",
      "text": "My wife and I really enjoyed this movie, and it definitely left me hoping for a sequel, either in movie or multi-episode format.  Good job Netflix.  And while I know movies are very subjective, the astonishingly low average critic score for this movie feels to me like a bunch of movie critics concerned about their career prospects if Netflix succeeds in making Hollywood style blockbuster movies. I suspect they're worried their career won't be justified, or pay as well, if people can enjoy these kind of first-run movies without having to fork over the high cost associated with going to the movies. Which I get.  But still..."
    },
    {
      "rating": "7",
      "text": "I dont get why the critics are trashing the living hell out of this movie. It lacks a lot, the lore is used as a backdrop, never really explored, it does get repetitive at some points and cop buddy cliche templates are heavily used. But take a popcorn, put on a Netflix and watch this with your SO as your night movie and you gonna have some decent fun and you will see something weird and new. The movie never blew me out of the chair, but I didnt feel bored either. Above average with 7 is something that is fine for this movie.So, again, why did \"professional\" critics decide that this is the movie they must review to hell? Is it because its Netflix special? Would the reviews be different if it was in movies instead? I dont know, but sure looks like it."
    },
    {
      "rating": "10",
      "text": "Awesome movie, i really want to see more about this universe, if something is missing was that is short comared to the big gamma of posibilities for that universe, i really wanted to se more.Excelente pelicula espero que haíga más de este universo, si algo le falto fue que durara más para tomar en cuenta más áreas que ofrece ese mundo."
    },
    {
      "rating": "10",
      "text": "First off, I want to say this movie is a 7 out of 10. Why did I rank it 10 then? To counter several other reviews I saw that gave it a 0 with two lines that explain nothing about why they don't like the movie. I would rank this movie an 8 out of 10, but the beginning of the movie is rocky; and the racism angle can be a bit heavy handed at times. I truly believe the critics giving this movie awful reviews went into this movie wanting it to fail miserably.Now what was wrong with the beginning? Well right off the bat we are shown Will Smith getting blasted by an orc with a shotgun point blank, but wakes up completely fine. And are later told that he is going back to work just a few days after getting shot. That blast plate must have been made of dragon scales to block a shotgun that close with nary a broken rib. Smith is then told by his wife to get rid of a fairy in the front yard; which is equivalent to a squirrel in our word. Smith then beats the **** out of the faerie with the quip \"faerie lives don't matter today!\" I feel like this joke set a bad tone as probably the first joke of the movie, but nonetheless wasn't as bad as some of the other critics have claimed. Smith then goes and gets his daughter ready to go to grandmas. His daughter asked her how his new partner, Jakoby, is going to work out since orcs are mean and bad. Smith tries to teach her about tolerance and that orcs are no different from you or me. However just then Jakoby pulls into Smith's yard. Smith goes out and absolutely lambastes Jakoby and is pretty racist to him, which is a far cry from what he told his daughter literally 30 seconds ago.At the station some of the most painful dialogue happens, as the other officers talk about how Smith is putting up with an orc partner that is just... painful to me. The other officers then do various other semi-racist things to Jakoby such as ask him if a mug shot of a sexual predator is his uncle, which is fine. But at one point they staple a literal \"Kick Me\" sign to Jakoby's back and the contrast between that and the earlier insult is a little strange. Besides that, my only other complaint is too many factions are introduced in such a short time. There are the Inferni, the Crooked Cops, Good Cops (really just one guy but still plays a major role), Magical Task Force, Shield of Light, The Orc Gang, The Hispanic Gang and then Smith/Jakoby/Tikka combo. That's eight different groups and if you cut one or two out and focused more on the others (especially the Inferni or Shield of Light) it would have improved the experience. Of course there are also sequels coming out so this is only a minor complaint.So what does this movie do right? It has some good comedy, the **** gunfight and hospital scene especially. The characters are also well done and relatable, if a little over the top at the time. Edgerton pulled off a very hard character to play very well. The plot armor of the last fight where Smith and Edgerton take on 3 highly trained assassins wasn't highly unbelievable, especially since they were part of a literal prohpecy. However, Smith did get absolutely beat up and shot throughout the course of the film, I have no idea how he was even standing during the final scenes. Edgerton got healed by Tikka though so he wasn't as bad. The action scenes themselves were pretty awesome, my favorite was the slow-motion cop traitor scene with Bastille playing. Although some were a little strange like when an entire swat squad forgot they had rifles and went hand to hand with one Inferni. Overall, I think this was a great movie and if you have Netflix I would definitely give it a shot."
    },
    {
      "rating": "7",
      "text": "It seems that Netflix didn't pay some critics.I watched this movie wiht no expectations. And what i found was, an ok movie. Don't get me wrong. It's not an extraordinary movie, but it is not that bad as some critics are saying. It's a good mix between two genres, a story of a fantastic world with real life issues. It could be better? Yes, of course it could, but yet, it is enjoyable, it is fun, it has some stupid jokes and at some point this movie is a little predictable. But it's not bad or awfull."
    },
    {
      "rating": "7",
      "text": "Bright is not the greatest movie of all time, but it's a good action movie with an original settings (Sort of a contemporary Shadowrun). I can't understand the harsh critics, the realisation is ok, the actors too, the gunfight are better than in a lot of blockbuster, it's not that bad, seriously."
    },
    {
      "rating": "10",
      "text": "I've been looking forward to Bright for a while now and had some somewhat high expectations. Which isn't the best idea before watching any movie, but I'm guilty of it. With that being said, Bright met a lot of my expectations and missed a few. It also succeeded a few of my expectations as well.   The movie is set in modern times, but with a fantasy world overlaid on top of it. Giving it a feeling of Lord of the Rings in todays times. Which I can see being extremely difficult to pull off and the makers of Bright did it. They managed to give us a fantasy/modern world with good character building, explanations as to why things are the way they are, fun action scenes, great acting, believable political society issue and a well put together sci-fi.  Overall, Bright isn't the best movie of the year, but it sure the heck is far away from being the worst. I'm giving this movie a 10 out 10, because its innovative, it's fresh, it's original in a sense and it's bold. It dares to do something outside of the basic movie cookie cutter scenario that Hollywood keeps trying to push on people."
    },
    {
      "rating": "8",
      "text": "Not great but enjoyable. Couldn't help but feel that it could have benefited from being slightly longer to flesh out the alternative universe Earth rather than just expecting the audience to believe that this alternate reality is \"how it's always been\". Or, better yet, maybe developed as a limited-run episodic series like Netflix's Godless. Elves and the Magic Feds both got short shrift, they're kinda.. just there. Still, both my wife and I enjoyed it as a mindless popcorn sci-fi flick."
    },
    {
      "rating": "8",
      "text": "I had fun watching this. Don't get me wrong, there's some cringy moments in the movie but overall it was more than worth my time."
    },
    {
      "rating": "7",
      "text": "A very decent buddy cop movie with cool fantasy elements. Like Lethal Weapon but with orcs and eves. Wish it was longer - the world lore could definitely support a whole season of a TV series."
    },
    {
      "rating": "10",
      "text": "Are critics so out of touch with what people actually enjoy or is this Disney money trying to cut down any competitor to their underperforming 'blockbuster'? All I know is that Bright is a really cool, highly original take on two different genres. By mixing up the Fantasy and Buddy-cop cliches they came up with something altogether different and highly entertaining. With originality and a far more interesting world than the redone Star Wars there is at least one movie to give you some decent holiday escapism. The only weak-point is Ayre's directing (far too much blue lighting and shadows) but the writing, acting and action all gel well. Here's hoping for a franchise or having this set up a ShadowRun movie. Marks another solid piece of evidence why sites like RT and Metacritic need to start billing User Score first."
    },
    {
      "rating": "10",
      "text": "I liked the movie gorgeous all I advise to see. The bomb killer.  good Fantastika"
    },
    {
      "rating": "8",
      "text": "I enjoyed it, I thought the pacing was good, action was good, story was interesting.  The critics have their heads up their butts."
    },
    {
      "rating": "10",
      "text": "This is by no means a perfect movie. There is character development and development of the world around the cast of characters that leaves many questions unanswered. Some of these answers are thrown quickly into the dialogue but don't hold as much weight as they should. It leaves you wondering and asking questions about what is happening, but for a first movie trying to introduce you into the world Ward and Jakoby inhabit it does a good job of providing enough information to leave you wanting more. Bright has been much more than I expected."
    },
    {
      "rating": "5",
      "text": "It’s  not the apocalyptic piece of trash Twitter has led you to believe critics painted it as, but it’s pretty ugly-looking and dimly lit. Passable enough entertainment, but Will Smith deserves better."
    },
    {
      "rating": "8",
      "text": "I didn't know what I was getting myself into when I turned this on, but the trailer got me hooked. I must say that I was pleasantly surprised by Bright. Kudos to Netflix for trying something new.For starters, the movie gets major props for blending Tolkein-like creatures in a modern day big city -- a concept I'd never seen before. As such, there was a surprising amount of world-building that goes on which immerses you in this racial/class dynamic in between Elves, Humans and Orcs and the fallout of a magical war that happened prior to this movie taking place. The characters slowly explain the background plot to the audience in their dialogue with each other, giving you enough of a gist to follow along. There's still a lot more left to explained about this world, particularly the foreshadowing of an upcoming big bad, but it doesn't detract from the plot we see in front of us. If anything, it leaves me both satisfied and wanting more.The characters themselves are portrayed well, with Jakoby stealing the show hands down. Surprisingly, Will Smith's performance leaves more to be desired, but he doesn't necessarily hurt the story. Noomi Rapace was fierce and I found myself actually feeling tension when she and her posse came after our heroes.  All in all, I enjoyed Bright. I am definitely piqued by this realworld-Tolkein situation and I am eager to see more in the upcoming sequel."
    },
    {
      "rating": "10",
      "text": "Loved it Critics are just hate fantasy, get over yourselves already! It was fresh, it was engaging and left me wanting more."
    }
  ],
  "recommendations": [
    "the_a_team",
    "i_am_number_four",
    "tomorrowland",
    "pandorum",
    "gamer",
    "terminator_genisys",
    "eagle_eye",
    "gods_of_egypt",
    "riddick",
    "hancock",
    "surrogates",
    "national_treasure_book_of_secrets",
    "morbius",
    "jumper",
    "red_dawn",
    "the_book_of_eli",
    "the_purge_election_year",
    "glass",
    "edge_of_tomorrow",
    "the_tax_collector",
    "the_tomorrow_war",
    "chappie",
    "guardians_of_the_galaxy",
    "poseidon",
    "hercules"
  ]
}