{
  "id": 4015,
  "title": "Brimstone",
  "starring": [
    "Guy Pearce",
    "Dakota Fanning"
  ],
  "runtime": 148,
  "genre": [
    "Western",
    "Mystery",
    "Thriller",
    "Drama"
  ],
  "description": "In the menacing inferno of the old North-American West, Liz is a genuine survivor who is hunted by a vengeful preacher for a crime she didn’t commit.",
  "releaseYear": "2016",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/aNxU4eZrfiChOgCEtyKWSCExdEi.jpg",
  "categories": {
    "plot": 4.681818181818182,
    "acting": 5.0,
    "ending": 5.333333333333333,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 5.0,
    "action": 4.5
  },
  "reviews": [
    {
      "rating": "7",
      "text": "The first act was kind of boring and I was wondering where it was going to lead after the conflict gets sort of resolved but from the second act, you got a lot of answers although questions are left open too. I enjoyed it a lot."
    },
    {
      "rating": "7",
      "text": "I liked the fact that the movie was separated in to multiple acts, and that they were not in chronological order. It gave the movie a realistic vibe, and let on exactly just as much as the audience needed to know, not more. But in contrast with this, lies the big issue. The worst pacing issue Iv'e seen in a long time. Because irrelevant scenes take to much, and the real action happened to fast. Almost 80% of the movie was dragging, and it was too long as a whole. At least it wasn't try harding, it wasn't forcing, because the actors could deliver the feelings they where supposed to. So great job by the actors, and the director taking the greatest angles for the shots he needed to deliver the feeling to the big screen. The movie had this dark western vibe, the unfairness and the muddy, ugly part of it. The movie itself is not entertaining or fun to watch, it's hard most of the time. But I think this is the way it was supposed to be, so I can't discredit the movie here. Also the VFX and the SFX where great, the righting was just right on point and not to excessive. But because the plot was that simplified (focused only on one protagonist) it also lacked a life lesson. Which really hurts the movie as a whole. So overall it's a great movie, but barely. Mystery, drama and other stuff is all there so I couldn't give it a 6. The movie is good, but it's not for my taste or for general taste I guess. But because I'm objective and the movie was decent enough I had to give it a 7."
    },
    {
      "rating": "7",
      "text": "If you're looking for fun, you've come to the wrong place. If you've come looking for Snow, you've wasted your time. If you're looking for suspense, mystery and trouble, then come right in. Because this slowly slithering story will trouble you, shock you and will seep into your mind for many nights after."
    },
    {
      "rating": "7",
      "text": "The trouble that had never let her alone.A story about America, Hollywood cast, but produced and directed by outsiders. A powerful film. Kind of mix of 'No Country for Old Man' and 'Les Miserables'. The narration divided into four parts. The first episode called Revelation. An introduction life around Liz, but full of suspense after every unexpected turn in the story. Then in the second episode called Exodus, a young girl, Joanna introduced and following the third knows as Genesis, goes ever further back into Joanna's life, before returning to Liz's in the fourth known as Retribution.Maybe Dakota's best performance being an adult actress. As well as the young actress Emilia Jones. They both had played the same character, but in a different timeline. Interestingly, in real life, they share the same birth day and month as mine. From one of the film poster, I thought it was Michael Sheen. Only realised while watching the film that it was Guy Pearce. From writing to the making, it was a very good film. But the story could make some people uneasy. Because everything that's happened between the people and their relationship, not for soft guys. Yet it is a must see thriller, a must see western.7/10"
    },
    {
      "rating": "1",
      "text": "Uninteresting, boring movie with an unattractive storyline. Dialogues are not convincing. The behavior of the characters is not logical enough and awkward. In everything, artificiality is felt"
    },
    {
      "rating": "6",
      "text": "No popcorn movie for the wide audience.Stylistically, Brimstone is a bit like the movie \"Mother!\". Brimstone has less subtle mystical and psychological features. Also, he is less consistent in the visual language. Although the film plays in America at the beginning of the 19th century, it does not have the characteristics of a classic western. One can rather expect a drama / thriller with features of mysticism.The story is touching and exciting, in places and the end of the movie unfortunately trivial. Some pictures are uselessly violent and shocking. A little less would not have damaged the overall picture.The film invites discussion and can lead to controversy. Especially here is the value.Except for a few dropouts, the actors wear the solid film."
    },
    {
      "rating": "6",
      "text": "This is a hard one to categorize. It's a western/drama/thriller & suspense. I feel like people are gonna either really like it or really hate it. I did think the screenplay was superb and the acting was incredible. There were some pretty graphic scenes that could turn people off. Overall I really enjoyed it and I do hope people would at least give it a try."
    },
    {
      "rating": "2",
      "text": "A puberal attempt to fight against the very phantasy world invented by a puber. Zelots like portraited in the film indeed exist in Holland, but nowadays they are of another religion."
    },
    {
      "rating": "3",
      "text": "Relentlessly depressing, very weak attempt at religious allegory to excuse an incredibly bleak and miserable storyline"
    },
    {
      "rating": "6",
      "text": "Dakota ruined the film for me. some of the weird choice they make in the film made no sense at all. she slit her father throat n left for dead at brothel. how the **** he survived there. the way they killed Jon snow, it has no effect at all. we all know by now at that point something bad will happened to that character. i like those over the top violence. but why they r in the film! am i watching a slasher flick!? i really thought that father is a super natural vampire or some kind of a monster. thats how confusing that character really was. Only if they focus just on those crazy ass Christian people who live life like that. then the movie will be thousand time good for sure. What the hell with Joana character!, everywhere she goes innocent people die. She even emotionally push her mother to commit suicide. She killed that woman who helped her at the brothel. Her whole family dies because of her. when Dakota play that character it was so blend n cringe worthy. Younger version of that same character was thousand times better than Dakotas character. if the viewer of this film thought this movie is a super natural monster flick, middle of the movie u realize it isnt a monster flick. then u have that they failed horribly. the story n the message they try to send to the viewer failed horribly."
    },
    {
      "rating": "0",
      "text": "DO NOT WASTE YOUR $ A COMPLETE FEEL BAD MOVIE WITH NO MEANING OR ENDING. NOTHING MORE THAN A PHYSCO BLOOD BATH KILL FLICK WHERE THE BAD GUY IS WORSE THAN YOU CAN IMAGE AND JUST KEEPS WINNING! DON'T GO! WASTE!"
    },
    {
      "rating": "0",
      "text": "This is bad and really flimsy movie. Basically, all characters are nice and good except for one guy, the vicar who is an invincable ubermonster from hell.. Don't bother."
    },
    {
      "rating": "2",
      "text": "This movie is dark and disturbing. It is hard to follow and too much gore. Are we so desensitized to blood and murder and violence we actually need to see it in our leisure time as well. What has happened to the average human that needs to see the worst side of life, even in fiction, in order to unwind? Wake up people, get out of the satanic grip of Hollywood."
    },
    {
      "rating": "0",
      "text": "Uninteresting, boring movie with an unattractive storyline. Writing is not convincing, characters are not logical and plot is awkward. Way too long. Shameless cameo. Great cast but terrible writing"
    },
    {
      "rating": "5",
      "text": "I had high expectations for this western but in the end it turned out to be a disappointing and lackluster experience with performances that barely sustain the whole plot. Besides its lenght is incredibly excessive."
    },
    {
      "rating": "3",
      "text": "If I can say anything positive is that the movie looks good. But in the end, it is very repetitive on it's narrative. It's like a low-rent Von Trier film dressed up in a western genre. spoilers ahead:I didn't see the point of telling the story in that particular order other than being a gimmick. The reason it's repetitive is because you can take a drink anytime a nice character appears and dies a gruesome exaggerated death. I was hoping the movie would redeem itself and throw in a supernatural spin or reveal the Reverend to be not human (since he was introduced that way and all the other events seemed to be adapted straight out of a comic book). But alas the movie tries to make this into a metaphor of toxic masculinity or something. Well it isn’t really a metaphor when you beat the audience over their heads for two hours with a jackhammer. A better version of this movie already exists, it's called 'The Night of the Hunter'(1955)"
    },
    {
      "rating": "5",
      "text": "+Excellent cast+Decent production quality-Terrible 'movie logic' momentsBrimstone is an interesting drama/thriller spoiled by a meandering plot with sprinklings of sadomasochistic 'shock moments' spread through the majority of the middle and end chapters. There is an unnecessary 'out of sequence' chapter format here which feels wasteful and fails to create any benificial tension or find a deeper meaning. Overall it was a film the felt almost longer than its runtime and was spoiled by the ever frustrating teleporting psycho killer trope. If it had less kills and more authentic attention to logical reasoning and period accurate dialogue i might have felt more connected to the drama. Overall it felt like a missed opportunity to explore the darker spaces of the human psyche."
    },
    {
      "rating": "6",
      "text": "This is brilliant masterpiece of film but it's not one that will suit most audiences.It's a slow burn drama at the beginning, then turns into a kind of western /slasher film toward the end.Wholly original story and some great performances and cinematography. If you liked Mother you will probably enjoy this."
    }
  ]
}