{
  "id": 4385,
  "title": "Bringing Out the Dead",
  "starring": [
    "Nicolas Cage",
    "Patricia Arquette"
  ],
  "runtime": 121,
  "genre": [
    "Drama"
  ],
  "description": "Once called \"Father Frank\" for his efforts to rescue lives, Frank Pierce sees the ghosts of those he failed to save around every turn. He has tried everything he can to get fired, calling in sick, delaying taking calls where he might have to face one more victim he couldn't help, yet cannot quit the job on his own.",
  "releaseYear": "1999",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/aQfYOBZ6C40BP8ayIq4EMOdSKWi.jpg",
  "categories": {
    "plot": 8.0,
    "acting": 8.090909090909092,
    "ending": 5.0,
    "soundtrack": 5.0,
    "cinematography": 7.0,
    "familyFriendly": 3.0,
    "funny": 5.0,
    "action": 9.25
  },
  "reviews": [
    {
      "rating": "10",
      "text": "The people who I have suggested this film to and disliked it all had one thing in common: they were dissatisfied with a broken and hopeless environment, mental instability, and intense emotions to be the focus of movies. However, the ones that did like it agree with me that when one takes what is presented on the screen and looks beneath it, the film is now rife with inner conflicts and turmoil, so many different kinds that do not need to be expressed with extroverted antics. Cage's character was intense without having to do or say too much to pass that."
    },
    {
      "rating": "10",
      "text": "This movie is excellent.the acting is superb,and the story deep and full of humor,love,and spritual lessons.i loved the movie."
    },
    {
      "rating": "10",
      "text": "I thought that this might be maybe one of if not Scorsese's most overlooked film. I thought it had a powerful message, gripping direction, and standout performances, from Nicolas Cage, and Ving Rhames. Lookout for Scorsese's voice on the dispatch, and also Queen Latifah's."
    },
    {
      "rating": "8",
      "text": "The dark horse of Martin Scorsese films.A fever dream of high rush that strangely reminds you how alive you really are, but at the same time, a dim of insomnia that reminds you how lifeless you can feel. New York City, the city where everybody is either dead, dying, or somewhere between. You're in the middle. Robert Richardson and Scorsese captures New York streets, deserving it's title as 'the city that never sleeps'.I know a lot of people think Nicolas Cage isn't a great actor and he picks more bad than good roles. However, Cage is really excellent in this, which pains me to see him shy away from good material and becoming a stupid joke of himself. For the small screen these two had, John Goodman and Ving Rhames were also great. Lets not forget Paul Schrader fantastic script that keeps the film fresh at all times.Overall rating: Gives it a shot. Just me."
    },
    {
      "rating": "5",
      "text": "I did not love Bringing Out the Dead. A compelling character study, the film simply does not resolve enough about its premise to be a truly good film. The whole film builds up to something and the pay-off, if it is there, is so not worth it. It does not deserve the low audience score it has on Metacritic, though I would attribute that to some weird bot based on the amount of negativity compared to the positive reviews. It is really well done and the acting across the board, especially Ving Rhames, is very good. It is well-written and all that, minus the ending. Another problem I had here was with the editing. I typically love the editing in Scorsese's work, but here, it feels quite disjointed and downright odd at times. Overall, Bringing Out the Dead is an oddly put together and somewhat incomplete work from a master director."
    },
    {
      "rating": "5",
      "text": "When you hear \"a Scorsese film written by Paul Schrader about a man who slowly loses his mind as he spends his nights driving all over New York,\" you immediately think you're going to be in for more than just a treat. Well. There's \"Taxi Driver\" and then there's \"Bringing Out The Dead,\" which is by no means a particularly bad movie (I think we can all assume Scorsese is incapable of such things), but one with a crippling lack of direction and purpose. Is this a movie about the meaning of life and death? Is this a movie about existence and the meaning of life? Is this a drug trip movie? Well, yes to all three. The movie is all of these things, but unfortunately not at the same time. Things just aren't consistent enough for me to understand the end game here. It certainly looks cool and the aspect ratio grew on me after a while, but at the end of it all, it really just made me feel cold and confused."
    },
    {
      "rating": "7",
      "text": "Bringing Out the Dead does not remember when they talk about the career of Cage or Scorsese. This is not the most famous film as an actor or director and this is an omission. Firstly, this is the most realistic film I have seen about paramedics, and secondly, the chamber of action stung at 48 o'clock makes the film more of a thriller than a drama. A great picture about one of the most psychologically difficult professions, excellent acting Cage and at least somewhere shown the reality of American medicine."
    },
    {
      "rating": "10",
      "text": "There's either some kind of brigade of trolls spamming 0s or someone who's made a bunch of sock puppet accounts just to bring down the user score. Either way, there's no accounting for **** taste when it comes to brain dead Neanderthal, Metacritic user reviewers.This is absolutely one of Marty's most underrated masterpieces. A darkly nihilistic and unforgettable journey of a man being pushed to the brink of mental exhaustion and madness from his intense and harrowing job. I understand why some people might be put off by this film. This is easily Scorsese's darkest film. The glitz and glamour of Goodfellas and Casino is completely absent. Yet despite the heavy subject matter, the film is bursting with a vibrant sense of style and energy. It's one unforgettable scene that leads to another. Every single actor brings their A game to this. Nicolas Cage gives a career defining performance. Ving Rhames should've been nominated for best supporting actor. Pretty much every late nineties, early 2000s era television actor shows up in this. There are so many beautifully haunting and unforgettable scenes in this, even when stacked up against the rest of Scorsese's filmography.Ignore the mixed user score. This is an undisputed, criminally underrated masterpiece and one that you owe yourself to give it a shot, even if the tone and subject matter might be too depressing for you"
    },
    {
      "rating": "7",
      "text": "The acting is fun to witness,the plot is interesting, and the dream sequences are creative along with the rest of the cinematography"
    }
  ],
  "recommendations": [
    "the_master",
    "joker",
    "the_rover",
    "the_devil_all_the_time",
    "you_were_never_really_here",
    "magnolia",
    "a_most_violent_year",
    "the_walk",
    "whiplash",
    "sicario",
    "21_grams",
    "youth",
    "black_swan",
    "manchester_by_the_sea",
    "the_place_beyond_the_pines",
    "the_good_shepherd",
    "revolutionary_road",
    "drive",
    "man_on_fire",
    "good_time",
    "hereafter",
    "hell_or_high_water",
    "hotel_rwanda",
    "annette",
    "nocturnal_animals"
  ]
}