{
  "id": 2280,
  "title": "Brokeback Mountain",
  "starring": [
    "Heath Ledger",
    "Jake Gyllenhaal"
  ],
  "runtime": 134,
  "genre": [
    "Drama",
    "Romance"
  ],
  "description": "Rodeo cowboy Jack and ranch hand Ennis are hired as sheepherders in 1963 Wyoming. One night on Brokeback Mountain, they spark a physical relationship. Though Ennis marries his longtime sweetheart and Jack marries a fellow rodeo rider, they keep up their tortured, sporadic love affair for 20 years.",
  "releaseYear": "2005",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/fsbzfe9eLOEl5rJX04nPEr1eoAi.jpg",
  "categories": {
    "plot": 8.25925925925926,
    "acting": 8.5,
    "ending": 9.625,
    "soundtrack": 9.333333333333334,
    "cinematography": 10.0,
    "familyFriendly": 3.0,
    "funny": 10.0,
    "action": 8.0
  },
  "reviews": [
    {
      "rating": "10",
      "text": "Brokeback Mountain is one of the biggest classics of the 00´s decade. And Lee is a great director not afraid of doing such different films, and with this one, he is at his best. The pace is perfect to make you feel the loneliness people in the Mid West around the 60´s-70´s used to feel, and especially the characters here presented. Once the film ends, you can´t get out of your head this impactful movie. Cinematography is crazy good. And the acting... so real, perfect and raw. Jake Gyllenhaal does a great job, Anne Hathaway is great in her little role, Michelle Williams is all kinds of outstanding... but Heath Ledger... a performance that defines a career. I would have given the oscar to him that year. Incredible what he did with his character. I give the movie a 10 because there´s no flaw one can find. Crash winning over Brokeback and Munich was the biggest joke in the Academy´s history. At least it got 3 including best director."
    },
    {
      "rating": "10",
      "text": "I had no desire to see this movie! I went with my girlfriend to get out of the \"doghouse\" and I did not want any of my friends to know. We had all be joking about the movie for weeks. After going, and just minutes into the movie, I completely forgot it was a story about 2 guys. You get so caught up in the movie......and what is going on. When it was over, we were both so down. Actually down for a couple of days. This is the first movie that has ever had this kind of impact on me. She and I have had some of the best talks since this movie and it has brought us closer. You guys out there (including my friends) who think this is a joke of a movie......go see it with open eyes. And just because you find this movie is a 10, does not mean you are gay!"
    },
    {
      "rating": "8",
      "text": "If youâ"
    },
    {
      "rating": "8",
      "text": "i wish i knew how to quit you..Brokeback MountainIt works on a mild score like a musical theatre filled with drama, cheat and decisive that sets up these two flawed yet loved lead characters projected by the master Ang Lee."
    },
    {
      "rating": "9",
      "text": "Anyone who would give this movie a zero (Trish H.) because of its homosexual content missed the entire part about LOVE. You would do well to take some of your \"moral fiber\" and try to be a little more regular."
    },
    {
      "rating": "10",
      "text": "Fantastic-- strong, meaningful and so real. Perfect movie."
    },
    {
      "rating": "10",
      "text": "This film was a real eye opener, and timely, as humanity seeks to evolve and find our centre. This movie was all encompassing, surpassing what some may see as the main theme - gay love . It brought home the realisation that life is so short, that we do not stand in judgment of each other and that love in its purest form does not discriminate."
    },
    {
      "rating": "10",
      "text": "This movie has dug so far into my soul and touched me so deep that its haunting effect may never go away. never has a movie made me take a long look in the mirror at myself, the life i've led, wanted to lead, what i've had to let go and why., what and who fills my heart with unimaginable joy and how sometimes that joy has been turned into unimaginable sorrow. this film has taken me to places that terrify me and leave me speechless while at the same time makes me realize what a precious gift i have been given....the ability to give and receive love in all its graces and hearrtbreaks. i will never take that gift f or it sunkown outcome for granted.but pursue it and be thankful i was allowed the journey."
    },
    {
      "rating": "10",
      "text": "Two homosexual individuals struggle to be together, bound by the norms and rules of society. At first, I was confused to how fast the story was moving with the very short scenes; but then understood the movie has to be told like this as it takes place over somewhat 20years. Looking back, this method of story-telling was very effective. As a true horror, sci-fi and animie fanatic, even I found this movie breathtaking. Scenery, story and acting was spot on. I've seen alot of movies, and this is at the top of the pile. Everybody should see this movie!"
    },
    {
      "rating": "10",
      "text": "Brandi- It was good I liked it alot. Darren-Brandi actually cried! I did too. Stephanie was bawling! And Rick well I think he cried too.. Brandi says she was about to cry..But same difference.. Im kinda pissed at the fact that all gay romances end in tragedy..Why cant we win!?"
    },
    {
      "rating": "10",
      "text": "all of america should see this movie. and all the troops in iraq, too. it's about hatred as well as love and it's a very important film. well done ang lee."
    },
    {
      "rating": "10",
      "text": "Never before saw a movie that made me cry."
    },
    {
      "rating": "10",
      "text": "One of the most remarkable films I have ever seen. It is perfect. Heath Ledger is brilliant, and the fact that he is gone only makes this film that much more heart-wrenching. This movie belongs to Ledger, but you cannot deny the accomplishments of the rest of the cast - Jake Gyllenhaal, Michelle Williams and Anne Hathaway are fantastic, as is Kate Mara as Ledger's daughter. The final scene is one of excruciating emotion. What a truly incredible film. Also, one of the most important ever made."
    },
    {
      "rating": "10",
      "text": "I Loved Heath Ledger in this film, i cried three times with his performance. Heath and Jake were the right actors to cast in this film. Excellent film!"
    },
    {
      "rating": "10",
      "text": "i saw this film two days ago and have not been able to concentrate on anything else. i keep telling myself its just a film but it has moved me in a way like no other thing i have ever seen. it is the most beautiful masterpiece i have ever seen and probably will ever see. it broke my heart and i left the cinema wanting a different ending but knowing it would not have been the film it was without the ending it had. everyone should see this and i believe that jake and heath should win awards for these performances"
    },
    {
      "rating": "8",
      "text": "Overall a good movie.  For those with open minds, the movie offers a lot to think about.  As I read the reviews below, I couldn't help but think the following.....for those saying if the movie wasn't about \"gay\" cowboys it wouldn't be acclaimed is like saying if Titanic wasn't about a ship sinking it wouldn't have been such a success.    For the obvious Christians who slammed the movie because of its content (yes, I am a straight male Christian with a family), this movie offered great insight into those who are different than most of us and how those people are affected by the intolerence of the rest of us.  Before you praise Christians so much remember...the guys at the end who murdered Jack probably called themselves Christians.\r Good insightful movie.  If you keep an open mind you'll learn.  If you don't keep an open mind, don't bother seeing it and go see Hostel (you won't have a problem with that movie)."
    },
    {
      "rating": "10",
      "text": "This movie is a masterpiece and it is beautiful in every way."
    },
    {
      "rating": "10",
      "text": "I thought this movie was one of the most brilliant movies ever made. Everyone says \"if it had been a man and a woman no one would have cared\". That's the point! It's different. And beautiful."
    },
    {
      "rating": "10",
      "text": "Perfect in every literary aspect, superbly complemented by the musical score."
    },
    {
      "rating": "10",
      "text": "Brokeback mountain is the 4th best film i've ever seen. it's amazing that ang lee, who created the hulk,(the worst movie i've ever seen), could create such an untimely and beautiful masterpiece. it makes me proud to be gay!!!"
    },
    {
      "rating": "10",
      "text": "It's been over 24 hours, and I'm still feeling elated and devestated. Elated because I've been touched deeply by one of the most beautiful love stories I have ever known. Elated because of the raw courage and sensitivity and sheer brilliance that Gyllenhall and Ledger bring to this movie. Elated because I finally got to see one of my favorite writer's work *finally* done justice. But devastated. Just devastated. I won't say why, of course, because I don't want to give any spoilers. But all I can say is, if (and I do mean *if*) you think you can handle it without being a giggly child or a hung-up Christian conservative, please see this film. See it twice. Let it seep into your bones. Into your heart. Definitely the best movie of the year, and that's saying something."
    },
    {
      "rating": "10",
      "text": "A film in which more is said in the faces of the actors than in their dialogue. The pain in the film is cumulative and consequently profound. Ledger is a revelation and Gyllenhaal is impressive."
    },
    {
      "rating": "10",
      "text": "WOW!  The very best film I've seen since \"Powder\".  I felt as if I really knew these chracters... and that ain't easy these days.  I recently scolded myself in a way  that makes it difficult to get out and about...I'm glad I made it to this one!  It was a  lobster that burned my genitals and I  just purchased a laxtex fist for my friend Gary this Christmas season.  Be strong and enjoy this film."
    },
    {
      "rating": "10",
      "text": "BROKEBACK MOUNTAIN AN IMPOSIBLE LOVE\rBefore I saw the movie, I thought that homosexual people were weird and disgusting. When I heard about this movie and all the awards, I went to see it with my mom (AND I THOUGHT IT WOULD BE bad). This movie that only costed 11 million $ comparing to King Kong with 209 millon $ was great. From the cinematography...to the way they treat the story. Ang Lee is a Great Director (Crouching Tigger, Hidden Dragon), and after making a bad movie (Hulk), he continued the good road. Gylleenhaal used to be a bad actor (The day After Tomorrow) But in THIS movie...\rThe Simple and short story was simply wonderful and the rest of the cast LEDGER, WILLIAMS & HATHAWAY (used to be a bad actress to ''Princess Diaries 1&2). Even thow i havent seen Crash, Capote, Good Night and good luck or Munich yet, I hope this little BUT GREAT independent picture will win the top price, best director, best screenplay, actor (lead & Sup), Actress (sup), music (even thow I loved THE CONSTANT GARDENER'S music & The PRIDE & PREJUDICE piano pieces) & Cinematography"
    },
    {
      "rating": "9",
      "text": "Yes, the Movie is slow. It's supposed to be. My opinion is based on rembering that the movie takes place between 1963 and sometime in the 80's. Gay relationships were NOT welcome. I consider it a well written and well acted movie. \r\rThe movie is a sad one because the love of the main characters is forbidden and takes place outside their marriages. I would consider this a call to acceptance. If their relationship was accepted there would be no infidelity. As for the \"hate crime scene\" at the end... do you really think that life treats everyone fair. \r\rI would call this movie a fair depiction of LIFE. Not every stroy end \"happily ever after.\""
    },
    {
      "rating": "10",
      "text": "THIS MOVIE SHOULD HAVE ONE OF THE BEST MOVIE EVER MADE AND IT SHOULD HAD MADE A DIFFERENCE IN THIS WORLD....ONE DAY IT WILL LET THIS WORLD KNO ALL THIS HAS ALWAYS BEEN IN LIFE LIKE THE SAME AS HETEOSEXUAL PEOPLE RUNNING AROUND HERE CHEATING WIT ONE ANOTHER..... FUNNY HOW PEPOLPLE IN THIS WORLD LOVE TO WATCH EPISODES LIKE THAT AND WANT TO DISMISS SOMETHING THAT SHOULD ALSO BE APPROVAL TO THEM TOO IF THEY APPROVE OF THAT CONDUCT AS WELL......"
    },
    {
      "rating": "9",
      "text": "Beautiful, moving afull of remorseful sorrow. Not for everyone and not immediately encapturing but very, very insightful with a great cast."
    },
    {
      "rating": "10",
      "text": "Probably the most moving film that I have ever seen. As for the comments of any man rating this above a \"1\" needing to check himself in the mirror, I am happily married for 10 years and my wife and I have a number of gay friends. This film only highlighted the reality of gay relationships, men or women, in any time period or location. Perhaps its those that have such an issue with this film's content check themselves in the mirror, for as a gay or straight theme, I believe it teaches a message of tolerance....something that is severely lacking today!"
    },
    {
      "rating": "9",
      "text": "I'm pretty sure that most of the people on this website that are giving this film a \"0\" haven't even seen it. It's always \"ruining our country's morals\" or \"shoving the gay agenda down our\" throats. You know what? If you went to see the movie, you're shoving down your own damn throat. If you don't like the message, don't go see the movie. Simple as that. Additionally, if you truly wanted to protect the \"sanctity\" of marriage, you'd be making divorce illegal. Does gay marriage affect your life in any way? Didn't think so. As for those of you that argue with the well-developed \"God hates fags\" statement, I hear Westboro Baptist Church is taking supporters. I mean, really. You people are no better than parasites feeding off of the misery of other people. Doesn't God also preach love? Way to be arrogant, hypocritcal a**holes. Angry rant aside, this movie is absolutely stunning. Heartfelt and utterly heartbreaking, this movie truly captures the essence of what love is."
    },
    {
      "rating": "10",
      "text": "Although i couldn't get any of my friends to watch this with me (i told them we can buy beer and Kleenex because it's a weepy) I really enjoyed it by myself. The Kleenex came in handy."
    },
    {
      "rating": "10",
      "text": "Brokeback Mountain is quite possible the best movies of the last decade. It's beautiful, original, with extraordinary performances, and a pace that feels just perfect. It's a heartbreaking love story that moved me very much."
    },
    {
      "rating": "8",
      "text": "it's a requiem about old friendships and gone loves. the movie without its Controversial subject is a rare and beautiful romance, too. ang lee is a expert to show exciting moment of love and hate."
    },
    {
      "rating": "10",
      "text": "One of the greatest movies ever made, I simply love this movie and it's almost impossible not to cry with it, such a masterpiece, one of the greatest romance movie of ever"
    },
    {
      "rating": "10",
      "text": "A very, very beautiful movie! I was on the waves of the feeling, living the moments, truly. So nice chosen, cast&crew&music&places&storyy. I was so long seeking for this kinda...oww  Cristal!Finally a masterpiece illustrating natural love, unfair of  living not-being-yourself after repressing the love truly alive in your heart. The story, the actors, youu.. sweet  Ang Lee, I soo thank you! for these 'golden frames'!.. Heath Ledger.. wow. Astonishing..  Jake Gyllenhaal..gorgeous! And all the other ppl involved! Their work fascinates me. I'd rlly go on for some extraass..!  All in this moved me to tears..With some risks.. they could have been happy on their own. even letting their families broken..(moved me too, Michelle Williams is amazing!)\rOnly they.. and the Brokeback Mountains - the sacred place that brought them together- But..it' was a sacrifice the world would've never understand.. the world'd never let it be so.. This feeling will follow me for some time, I'd recommand with much warm this ever-best-ever drama movie I'vevr seen/lived.. Breeze. Love. Brockback Mountainn... for the natural/wild, simply/complex.. true lovers in you!"
    },
    {
      "rating": "10",
      "text": "In the summer of 1963, two cowboys, Ennis Del Mar and Jack Twist, are assigned the job of herding sheep on a mountainside in Wyoming. But amidst the grand beauty of Brokeback Mountain, the two men fall in love with one another. But when the job is done, they're forced to walk their separate ways. Ennis' father taught him to condemn homosexuality when he was a child, and so he began to condemn his own feelings. Both men are forced to deny the only passion either of them will ever feel. They pretend so as to fit in with the others. And in doing so they hurt themselves and carry great pain with each passing moment. Both Ennis and Jack marry and have children. But every once in while, they'd get to meet up on Brokeback Mountain where they can finally stop pretending and expose there vulnerability. This is where their hearts truly lie. Brokeback Mountain is powerful, beautiful and poetic. It hits you right on your chest like a bullet when you least expect it and steals away your heart. The cinematography is gorgeous, the score is elegant and all performances, particularly Ledger's as the restrained and distant Ennis Del Mar, are marvellous. This is Ang Lee's masterpiece. Brokeback Mountain was the best film of 2005 and the greatest / most important love story of this century."
    },
    {
      "rating": "10",
      "text": "This movie is really inspiring , soulful and realism. The performances of Jake Gyllenhaal and Heath Leadger are simply magnificent . It is practically impossible not to mourn seeing this movie, because the feeling that put each of the actors, beautiful scenery, great production , how impressive the script, its originality , its plot and its outcome , make this film a classic unforgettable film . As you experience each one of feelings posts in personajes.Los characters are memorable , besides being the film that has impacted me more . I never tire of seeing it , it is simply a masterpiece.\rThe best movie I've seen in my life."
    },
    {
      "rating": "9",
      "text": "Ang Lee returns to direct the emotional, peaceful, and friendly Brokeback Mountain and it was worth watching every single second it. Would watch it again."
    },
    {
      "rating": "10",
      "text": "This is honestly one of my favorite films. It is a classic that will sneak it's way into your heart. In a sentence, it is the ultimate forbidden love story. A fun fact: My username, The3AcademySins, refers to one of the three sins that I believe the Academy has committed. This sin was not giving Brokeback Mountain Best Picture. This movie is hands down the best performance that Heath Ledger and Jake Gyllenhal have ever given. Wow. The script is one of the realest, heartfelt, moving movies I have ever had the pleasure of viewing. In a way, this movie made me a better person after viewing it. I recommend this movie to everyone, even my friends who might not like gay movies, and everyone loves. Please, if you haven't seen Brokeback Mountain yet, do yourself a favor and go watch it!"
    },
    {
      "rating": "4",
      "text": "This film addresses a homosexual affair between two cowboys. Although the press and the gay-friendly publicity tried to sell the idea that it was a true homosexual romance, I was not convinced. Watching the film, I found that the script suggests something different: two lonely men whose unfulfilled emotional needs lead to a homosexual affair, despite their marriages and individual commitments. There is no love in this. The film is essentially about doubts, unfulfilled emotions, moral and emotional conflicts, the breaking of taboos and the consequences that it has afterwards, in the life of the one who did it. In any case, it is undeniably one of the most remarkable films of Heath Ledger's career. The actor deserves applause for his work in this film, where he dominated and stole the limelight from his own colleague Jake Gyllenhaal. This actor, for his part, has always been much more obliterated and the way he interpreted was not so interesting or consistent. Ang Lee did a decent job, but he seemed to be particularly focused on giving the film a good scenery and cinematography, with great success in that. Even so, the result of his work was a lukewarm, slow-paced film, and that makes it annoying, cutting off the connection between the audience and what they're watching."
    },
    {
      "rating": "8",
      "text": "Great performances all round in this heart breaking love story.Beautifully shot & gently paced with some great incidental music which adds to the whole setting."
    },
    {
      "rating": "10",
      "text": "Ang Lee is able to articulate the deep true feeling of 'Love' through the portrayal of two people who, no matter what the risks and dangers they could face in their society, cannot stand it when they are apart. The movie redefines the essence of love and the strength of its power, and also deals with the issue of the conformity of society's views are nearly as strong and dangerous if corrupt. Brokeback Mountain is in a way like R&J, both involve a couple that only see each other in secret because of the immoral views of their peers prevent them from being together."
    },
    {
      "rating": "10",
      "text": "I loved this movie, it makes me cry every time I watch it.  I have seen it about 5 times now.  Last weekend I ditched the guys and ruined our planned beer run just to watch this film again.  Some say it's just a film but for me it's been a real life changer and caused a lot of self reflection......I really think it's time I started being honest with myself.  Again, great film, one of the best!"
    },
    {
      "rating": "10",
      "text": "Brokeback Mountain is not only one of the best movies of the decade but also one of the greatest movies of all time! A stunning MASTERPIECE! You can't deny it! It's a great love story (almost platonic!) between two young men! Heath Ledger and Jake Gyllenhaal give two fantastic performances, making the movie realistic and heart-wrenching. Everyting in this movie is BEAUTIFUL, there are no words to describe It. I remember when I watched it for the first time, it was automatically my favourite movie ever, simply because you have to feel involved in the story. Though the movie describes an homossexual relationship, that's not the point. This movie is about LOVE, that's it! It's a story about TWO PERSONS THAT FELL IN LOVE FOREVER! In the final, if you thought the film would be a clichÃ©, you were wrong. GOD, in the final, Heath gives one of the most devastating scenes in the cinema, you can't help crying everytime you see it. Ang Lee knows how to put emotion into a movie. Gyllenhaal was amazing! LEDGER proved he was the BEST ACTOR OF HIS GENERATION!\rForever my favourite movie, a TRULY MASTERPIECE! 10.0!"
    },
    {
      "rating": "10",
      "text": "A rare picture in which I don't doubt for a second that it is a masterpiece. The movie has this unique quality in which everything feels so effortless. Ang Lee's direction for this film is among the best I have seen, and the performances are exceptional."
    },
    {
      "rating": "10",
      "text": "It's a great movie with great actioning. I'm not for the guy's love story line,that was just weird,but if you looking at the base storyline and the acting that came out of this movie. It was a great movie to reflex a different way of life and there struggles. I wouldn't pay for this movie in the theater,because of the storyline. I waiting to it came on the movie channels before I watched it."
    },
    {
      "rating": "10",
      "text": "I don't give many tens, but this deserves it. Aside from being beautifully directed, with great technical aspects, as well as great acting, this is one of the most beautiful scripts of the 21st century so far. It didn't surprise me when I found out Annie Proulx was a finalist for a Pulitzer for the short story, which is translated very well by the two screen writers. The movie starts out very innocent and sweet, and then it starts to turn into a gradual downward spiral of devastation until you're just left emotional knocked out by the end of the movie. The themes of society's influence on human behavior, the desire for happiness, and demise caused by obsession, are all subtly, yet powerfully, conveyed in this movie. Calling this a gay love story is like calling Lord Of The Rings a movie about hiking. This is one of the most torturous, psychological portrayals of two people's lives I've ever seen in a movie. It's so well calculated, without coming off the least bit unnatural. I've seen it several times, and I still pick up on things that I hadn't caught onto before. I heard it was a groundbreaking movie about a gay romance, and I didn't get how that was, since there had been many movies about gay romances before. I figured it was probably an overrated movie. When I saw it, I realized I couldn't have been more wrong. Your emotional connection will be irrelevant to your sexual orientation. What is really going to connect you to the movie are your ideas about the pressure to conform to society, compared to your desire to live a life of happiness. One man chooses conformity, and the other chooses happiness, and it doesn't necessarily end up how you might expect. I'm actually getting emotional writing this, thinking about the movie. I really hope everyone who watches it is able to pick up on the subtle themes, the hidden meanings behind specific lines, and the inner thoughts of particular characters who might not be ready to say those thoughts out loud, or even admit them to themselves. Those kind of things are extremely difficult to incorporate into a script without losing its realistic feel, but this movie does it. Of course, it might take a few views to pick up on everything. Whether you're judging this movie on its intelligent, calculated writing, its technical achievements, its performances, of which Heath Ledger's is one of the best of the 21st century, or its overall directing, or if you judge a movie on its emotional appeal, and its powerful, thought provoking themes, I can't see how you objectively give this movie anything less than a strong review."
    },
    {
      "rating": "6",
      "text": "First, let me say that I really hate it when the hero gets killed by a deus ex machina. \rIn many ways like Million Dollar Baby, another Hollywood tear-jerker where way too attractive actors & actresses pose as real people in a naturalistic world full of artifice.  I did feel a smidge sad when Heath found his shirt (though I saw it coming when the shirt went missing in reel 2), but mostly I felt that these two dudes were too mopey and existential to be real gay cowboys. I mean, unless I missed something, they're not supposed to be French, are they? They behaved like starry-eyed teenagers past the point (and age) of believability; as much as I could buy the first half hour of meet-cute and the last five minutes of human loss, the big fat middle was a dull TV message-movie. Did Matthew Shepherd really die for this? And brand me a stereo-typer, but (in my limited experience) of most of the gay couples I've met, at least one of the partners displays way more of a fey affect then either of these two stoic shepherds ever showed."
    },
    {
      "rating": "1",
      "text": "Je pensais à faire un jeu de mots en introduction avec back... mais en fait avec broke back, c'est déjà fait. En tout cas, le film atteint ses objectifs en matière de défense de la communauté LBGT ou LGBT (je ne sais jamais dans quel sens ça se met) avec ses allusions (pas trop appuyées cela dit) sur l'intolérance et l'homophobie.Il faut dire qu'au Wyoming ou au Texas, les cow-boys avec leurs chapeaux n'aiment visiblement pas faire des heures supp' dans les usines à Suchards ou du moins pas tous, voire très peu en fait à l'époque du film qui se passe dans les années 60 et après. Pour ça, il aurait fallu émigrer à Frisco mes mignons !Heureusement, il n'y a rien de trop frontal et en vérité, tout se passe comme dans un couple hétéro sauf qu'ils trompent leurs bonnes femmes respectives avec le copain cow-boy... d'ailleurs, la tronche quand l'une d'elles l'apprend -gazon maudit à l'envers- ça vaut son pesant de haricots en boîte ! Car nos homos ont femmes, enfants et bagages et en apparence une vie tout-à-fait normale...Ce serait en fait presque intéressant, ou au moins drôle, si le film d'Ang Lee n'était pas aussi mou du genou et endormi parce qu'on se fait chier plus mortellement que dans un épisode de Plus belle la vie. Les deux acteurs font ce qu'ils peuvent mais ont toujours l'air un peu ridicule quand ils... (ah non pas la rime) se voient. On y croit pas et on s'emmerde à fond...Il aurait fallu en faire une comédie, j'avais déjà une idée de titre en tête (la turbine maudite par exemple) parce que là on s'en branle de tout ça en fait."
    },
    {
      "rating": "2",
      "text": "Ang Lee's story on two gay loving cowboys is just a complete waste of my time. I never thought that after lee's blockbuster bust, \"Hulk\"  that he would create something completely worse. Sadly he does. First off, the story is just ridiculous. A lot of the movie is just sex, which had plenty of scenes that i've never want to see ever again. The acting may be decent, but when you put these characters in a story like this, it just doesn't work. Plain and Simple. Honestly, I think Lee can do much better than this crap. He somewhat did that with \"Life of Pi\", but I'm still waiting for that one movie of his that'll hopefully redeem him as one of the greatest directors of our time. But right now, this what we're stuck with. Overall, this movie is a terrible storyline to go off of."
    },
    {
      "rating": "6",
      "text": "My girlfriend dragged me out to see this: A movie about two male farmers that fall in love but hardly say anything  to each other throughout the whole movie, all while pretending to be straight even having female wives. An overrated movie, my girlfriend even apologized to me for taking me to see it because she didn't like it either since the gay couple hardly ever said anything to each other. It's an okay drama that also shows the dangers and hostile perceptions gay men experience in society, worth watching once, but doesn't live up to the hype. 6/10 for a mediocre movie."
    }
  ]
}