{
  "id": 3604,
  "title": "Broken Arrow",
  "starring": [
    "John Travolta",
    "Christian Slater"
  ],
  "runtime": 108,
  "genre": [
    "Action",
    "Thriller",
    "Adventure"
  ],
  "description": "When rogue stealth-fighter pilot Vic Deakins deliberately drops off the radar while on maneuvers, the Air Force ends up with two stolen nuclear warheads -- and Deakins's co-pilot, Riley Hale, is the military's only hope for getting them back. Traversing the deserted canyons of Utah, Hale teams with park ranger Terry Carmichael to put Deakins back in his box.",
  "releaseYear": "1996",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/2AlvHCeaZtFeR2H0IDoa2BmXOyK.jpg",
  "categories": {
    "plot": 2.6666666666666665,
    "acting": 3.25,
    "ending": 3.5,
    "soundtrack": 9.5,
    "cinematography": 3.0,
    "familyFriendly": 3.0,
    "funny": 5.0,
    "action": 7.294117647058823
  },
  "reviews": [
    {
      "rating": "7",
      "text": "Non stop action with great sequences which shows that John Woo is one of the best directors in the action genre. John Travolta puts on a funny, over the top and enjoyable performance that makes the film at times funny."
    },
    {
      "rating": "0",
      "text": "Very possibly the most cliché-filled movie I have seen since Airplane or Naked Gun -- but this isn't supposed to be a comedy.  Horrible acting synergizes with overused and predictable plot devices, and cheap, tawdry, slow-mo camera shots of pilots saluting as they walk into the hangar for a wretched, camp, inaccurate military \"thriller\" that fails to deliver.  Watch this movie if you want to see something pathetic and embarrassing."
    },
    {
      "rating": "4",
      "text": "Broken Arrow is a film directed by John Woo who made other films such as Face/Off, Hard Target, Paycheck and Hard Boiled... Broken Arrow is roughly a mid 1990's action movie, 1996 or somewhere near that period but anyway Broken Arrow stars John Travolta, Christian Slater and a beautiful Samantha Mathis as a park ranger. Samantha Mathis starred in many films but her role I remember the most was in the terrible film called Super Mario Bros with Dennis Hopper as the villain.....Anyway, moving on, BROKEN ARROW was about two pilots flying a stealth craft around with two live nukes. Major Vic Deakins (Travolta) ejects his friend pilot (Slater) out of the craft then ejects himself shortly after before the craft is destroyed and blows up. Then Deakins (Travolta) gangs up with some posse and hatches a plan to steal nukes and use them for dirty deeds.. Riley Hale (Christian Slater) teams up with a park ranger (Mathis) to stop Travolta using the deadly nukes possibly to Kill people but this isn't entirely explained in the movie. However they save the day and Travolta and Slater face off in an ultimate climax before the movie ends in an excellent fight scene. However this film I liked about 10+ years ago and looking at Broken Arrow now it's laughable and John Travolta and Slater looked pretty stupid in this film, a bit like dumb and Dumber to say the least. The story is ridiculous and some of the film is a bit unbelievable but great action scenes and is better than Travolta's effort in Face/Off which is even worse. However this film isn't great and the more you watch Broken Arrow the more tedious it gets and you stoop to Travolta's I.Q in this movie which isn't very high."
    },
    {
      "rating": "0",
      "text": "Quite possibly one of the worst movies I've ever seen (right up there with MI:2 - another John Woo movie). I can't seem to fathom how people can enjoy this guys movies. It's so absurd and the acting is horrible! (mainly the girl and Travolta's character)"
    },
    {
      "rating": "10",
      "text": "Broken Arrow is not an original movie, it's an action movie that's made to thrill audiences, not to leave them deep in thought. It manages to rise to the head of the pack thanks to great acting, directing and an excellent score.\r 2 U.S. army officers, Major Vic Deakins(John Travolta) and Captain Riley Hale(Christian Slater) are assigned to fly a jet plane carrying 2 live nukes to conduct a test. During the flight Deakins reveals his true intent, ejects the stunned Hale out of the plane, and releases the nukes before crashing it.\r This comes to the alert of park ranger Terry Charmical(Samantha Mathis) who immediatly sets out to find what is going on. Once the nukes are dropped Col. Max Wilkins(Delroy Lindo) is faced with bringing down Deakins and right hand man turncoat soldier Arvid Kelly(Howie Long) with the help of pencil pusher Giles Prentice(Frank Whaley).\r Travolta is great in an over the top but very entertaining role, and Slater does a good job as an action hero. Mathis is slightly miscast though, and should probably stick to her other hit films. Howie Long effectively plays Kelly with very little skill and no expierence, but his size helps give him on screen presence. Delroy Lindo is effective as the confident military officer, although Frank Whaley, despite being a good actor, is rather annoying in his role\r All in all if your looking for a great way to spend almost two hours, then sit down and watch this movie. It's definately a movie worth watching several times over **** 1/2 out of *****"
    },
    {
      "rating": "10",
      "text": "Superb movie - great setting, creative action, tough ass characters, great music. This movie takes it all to the max - classified experimental stealth bomber, hijacking 2 warheads, bad guy so power tripping he's more into winning the challenge than surviving the mission... and If you see it, it can be blown up - bomber, helis, hummers, mineshaft, train-car, train. This is a uniquely head-strong action movie, and it's awesome."
    },
    {
      "rating": "10",
      "text": "WOW, the people who rated it 0/10 are seriously sick.  You have NOT seen a 0/10 movie until you've seen some trash like Scary Movie 5.  Please rethink your lives.  This action film was AMAZING and John Travolta delivers as the bad guy as always.  This, Con Air, and Faceoff are highly regarded as the best 3 action movies of the 90's.  People are stupid today.  Oh yea, the music by Hans Zimmer is also incredible and in case these idiots didn't know, Hans Zimmer is the most popular film musician still going."
    },
    {
      "rating": "6",
      "text": "Typical 90's action flick. The acting was okay, the cinematography was good, the movie was filled with cheesy one-liners, it was predictable and the last half hour is filled with action. If you like 90's action flicks you will probably find this one at the very least entertaining."
    },
    {
      "rating": "3",
      "text": "for some reason i would call this one a good one for a T.V movie........compare the train end scene with the end scene from Selena..!!   LOL!!  i enjoyed the suspense of the mine scene i remember"
    },
    {
      "rating": "6",
      "text": "It meant to be a honest action thriller about nuclear weapons but is overblown by one or two lousy action sequences and Samantha Mathis is just a distraction."
    },
    {
      "rating": "7",
      "text": "So if I didn't know, John Woo was the one who directed Broken Arrow before Face/Off and after Hard Target. This is a generic action film by all means but it's enjoyable by any means necessary. Aside from that, it does have one scene that is just as awesome as the action scenes. I literally remember some parts of the film and the nuclear weapon explodes. Watch this! That is awesome! Aside from that, nothing really out about Broken Arrow. It's an enjoyable film for some viewers but they'd just manage it to be decent. Broken Arrow is not as good as I thought but it's decent. However, I still think his film, Face/Off is fantastic."
    },
    {
      "rating": "9",
      "text": "This is just a tall, tall tale about two friends, two nuclear warheads, a plane, a train, and a whole lot of chasing, fighting, and shooting.  It doesn't take itself seriously, and neither should anybody else.  If you accept it on those terms, as pure entertainment, which is all it intends to be, it's delightful!  This timeless tale of loose nukes, smirking heroes, and cheerful villains on the rampage could be told around a campfire by an old guy strumming a guitar, for a friendly audience who don't mind at all if it's a bit over-the-top.  We, the popcorn people, are that audience, and this movie is that campfire legend -- the legend of crazy Deke and the B83 nukes.  (And there actually is one hell of a guitarist on the soundtrack - the legendary Duane Eddy, who provides the perfect tall-tale gravitas at just the right places.)*** SEQUEL!!! ***Seriously, I want to see a sequel to this film! Yeah!!"
    }
  ],
  "recommendations": [
    "the_last_stand",
    "con_air",
    "the_expendables_2",
    "death_race",
    "angel_has_fallen",
    "xxx_return_of_xander_cage",
    "the_expendables",
    "6_underground",
    "transformers",
    "the_mechanic",
    "12_rounds",
    "mission_impossible_iii",
    "salt",
    "the_expendables_3",
    "shooter",
    "mission_impossible_ii",
    "furious_7",
    "transporter_2",
    "mechanic_resurrection",
    "armageddon",
    "ninja_assassin",
    "war",
    "mission_impossible_ghost_protocol",
    "mad_max",
    "live_free_or_die_hard"
  ]
}