{"id": 2119, "title": "Broken City", "starring": ["Mark Wahlberg", "Russell Crowe"], "runtime": 109, "genre": ["Thriller", "Crime", "Drama"], "description": "In a broken city rife with injustice, ex-cop Billy Taggart seeks redemption and revenge after being double-crossed and then framed by its most powerful figure, the mayor. Billy's relentless pursuit of justice, matched only by his streetwise toughness, makes him an unstoppable force - and the mayor's worst nightmare.", "releaseYear": "2013", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/hqa5FwNZC55zqSpdeGFtBDqw55y.jpg", "categories": {"plot": 4.592592592592593, "acting": 4.216216216216216, "ending": 4.9, "soundtrack": 4.0, "cinematography": 3.2222222222222223, "familyFriendly": 3.0, "funny": 5.0, "action": 4.0}, "reviews": [{"rating": "5", "text": "Broken City is worth watching if you like watching movies; however, you might set yourself up for disappointment if you have high expectations. No singular part of this movie is folly or apathetic, but the story and performances aren't the ones you will recommend when someone asks you, \"what's the best movie out right now?\""}, {"rating": "8", "text": "I thought this was a great movie. It is definitely one of those movies you have pay attention because there are a few plot twists. The one criticism I have is that there were a few slow parts and I thought there was going to be a little more action. But all in all a very good movie."}, {"rating": "4", "text": "It's just a very average movie - starting with the writing. The story is just not all that interesting, and the script isn't saved at all by the directing. An all-around forgettable film."}, {"rating": "5", "text": "I'm always baffled that Hollywood casts overexposed stars like Catherine Zeta Jones, who are constantly being exposed in magazines and tv, and then wonder why the audience is pulled out of the movie and don't like the movie. I'm just going to have to face the fact that anything with a Hollywood wife in it is not going to be a good movie (can you say Nicole Kidman)."}, {"rating": "5", "text": "The story was somewhat interesting and the acting was very good all around. My main issue is that the plot is difficult to follow at times and the motivations for some of the characters' actions (the mayor, the commissioner, the mayor's wife, etc) don't really get explained until the very end. It takes a long time to develop and as you sit there watching you get caught up thinking about why things are happening. The film could have been put together better because in the end it keeps throwing new \"twists\" making the plot overcomplicated."}, {"rating": "4", "text": "Just your average run of the mill January release. Broken City has good ideas, but they are badly executed, resulting in a dull experience. The actors are ok, but don't expect Oscar-worthy performances. Aside from the already messy story, there are some sub-plots that are less interesting than watching paint dry. Dialogue is cringe-worthy at times since it seems taken from a Ben Stiller comedy. It's the kind of film that you remember you saw, but after a couple of hours you can't tell anything about the plot because of how forgettable it is."}, {"rating": "1", "text": "I guess Hollywood thinks we'll watch any old piece of trash it throws up on the screen. They got my money. Congrats. Movie is devoid of original thinking and most of the acting is stale. The screenplay was as artfully written as furniture assembly instructions. I seriously question the critical thinking skills of anyone who thought this was a good movie.By the way, Zeta-Jones isn't hot anymore and since she never could act I was hoping to see her fade away. No such luck though."}, {"rating": "7", "text": "Storyline: This is the rather unimaginative story of police and political corruption in New York. Mayor Hostetler (Russell Crow) hires ex cop Billy Taggart (Mark Wahlberg) to follow his wife (Catherine Zeta-Jones) and take pictures of her being unfaithful. People start dying and Billy starts to realise that nothing is quite what it seems. While this is a good movie it never really strays from the formula which doesn't exactly make for riveting viewing.\r Acting: While this does have a great cast, there are no stand out performances by anyone. Everyone does a good job but little more and for a cast of this calibre it's a wasted opportunity. Mark Wahlberg is in my books a brilliant actor and can usually pull out touches of greatness but not here. Everyone really was good but I kind of hoped for more. Oh well.\r Direction: The films biggest problem is perhaps Allen Hughes who has missed a huge opportunity with this. A more seasoned director could have added some stylish touches to this humdrum script because he had the actors and budget to achieve something memorable but no. A real pity.\r Production: I have to admit the overall package is decent enough but almost feels like a TV movie. Almost. I remember seeing the trailer and thinking that it looked like a very good thriller but instead we get just plain good.\r Conclusion: This is enjoyable if somewhat predictable but it entertained and that is ultimately what counts. Recommended.\r Score: 7/10"}, {"rating": "10", "text": "Do not miss out on this movie! I thought Marky Mark would just be OK, but this movie will leave you breathless and Speachless at the same time. Should have been nominated for the Oscars."}, {"rating": "1", "text": "A contrived crime drama that feels like it was written by a first time screenwriter during a screenwriting 101 class. Expect the big name actors in this picture to make it a sure-fire hit on Redbox."}, {"rating": "5", "text": "I got exactly what I expected out of this film. A Russell Crowe fading in his career, Mark Walberg replaying the role of blue collar tough guy, a plot that is interesting but stitched together with no character or plot line fully developed, and story twists dropped in with no plausibility. It's called January in the theater. You have seen this story of the corrupt mayor and the inner city politics a thousand times so don't expect anything new and different. In a way, it is sort of sad, considering that much talent. That said, I actually enjoyed it versus sitting at home."}, {"rating": "8", "text": "Not as good as it intends to be, considering that Mark Wahlberg, Russell Crowe and Catherine Zeta-Jones are in it, but it is still a fun movie to watch."}, {"rating": "4", "text": "Mostly entertaining but nearly always stupid.  Persons in front of the camera and behind it seem to make a senseless (or nonsensical) decision at every turn.  It's hard to enjoy the film too much when you spend so much of your time rolling your eyes."}, {"rating": "5", "text": "Disappointing modern 'noir' has a great cast (Crowe, Wahlberg and Zeta Jones), but absolutely predictable plot that you can see from a mile off. Sure the basic concept was great, but they just needed a better screenplay.  This film shows that some of the best film makers have left this genre and moved on to blockbuster territory (i.e. Nolan, Bryan Singer and David Fincher).  The end result: films of such ho-hum quality as this one. A rental at best."}, {"rating": "4", "text": "I enjoy a really good, intelligent thriller. Unfortunately there are usually only one or two a year that end up fitting that criteria. Broken City is not one of them in 2013. There are many good actors in this film but all are wasted here. The films first half hour is not bad but quickly falls off the rails. Much of the story is predictable, and what isn't is put together for our protagonist in a boring unbelievable way."}, {"rating": "0", "text": "Predictable and strangly poorly acted as well. I expected a lot more from these two. Maybe an aspect of a terrible script, screenplay, direction, I can go on and on."}, {"rating": "4", "text": "After watching the movie Broken City, I wasn't really impressed. Im a huge advocate of Mark Whalberg and his films. Although recently this latest movie and most movies out there now are going over the top. These films in general are plain plot lines, with too much action, and not enough creativity. Almost anyone out there these days can simply right a mediocre action plot about a drug ring, mob members, or some time of crooked cops. I feel that the movie was entertaining, but it just falls into place with many of the same typical categories that have been all over the big screen in recent months"}, {"rating": "4", "text": "Your standard action/drama............well actually somewhat below standard.......the plot line is obvious......ex-cop gets hired by corrupt politician to do something.....cops finds out more than he should and starts asking questions.........the dialog is painfully dry and obvious and even the mock political debates are just ripoffs of last year's newspaper headlines...........the acting....directing is okay.....but nothing out of the ordinary......I'm quite shocked that actors like Russel Crowe and Barry Pepper would agree to do mediocre stuff like this...........to sum up.....it's not good....it's not interesting....it's barely even entertaining."}, {"rating": "8", "text": "Great thriller but not for everyone. It seems that some critics want to get surprised from something in a film, and that's why they always say bad things about them. Watch it!! That's my opinion."}, {"rating": "4", "text": "Broken City  is one of the worst films Mark Wahlberg has done in a while. I had no sympathy for him at all through the movie and Russell Crowe is fairly average as well. Wahlberg's motive is really not that well established and that makes the harder to watch as it goes along."}, {"rating": "3", "text": "Wow. One can picture the director turning to the producer and asking \"Should we go with cheese or cliche for this scene?\" and the answer invariably being \"Both\". The blackmail part was the only authentic scene in the whole Turd  I'm guessing because they had to extort these actors to get them to buy into this mess. There must have been a \"I will never have to watch this piece of garbage\" clause in their contracts....Actually, Wahlberg has probably seen it a few times."}, {"rating": "5", "text": "Mark Wahlberg plays a hardened NYC cop (is there any other kind?), who turns private detective after an on-duty controversy. He's hired by the city's sketchy mayor (Russell Crowe) to conduct a personal investigation. This results in the inevitable paranoid political complications. While nothing here is particularly original or surprising, it's well crafted and never drags or loses interest."}, {"rating": "5", "text": "Wahlberg sleepwalks through another feature role here. The movie drags and the plot becomes thin. Save yourself some time and watch an episode of Law  Order."}, {"rating": "5", "text": "Mark Wahlberg has made a career out of gritty crime dramas but ultimately all of them are lackluster. Broken City doesn't really break that trend although it does have enough good qualities to make it worth a watch. The film follows Billy Taggert (Wahlberg), an ex cop turned private eye who is employed by the mayor of New York City (Russel Crowe) to investigate his wife's infidelity but the case ultimately leads to a minefield of death, danger and corruption. Firstly it must be said that Broken City continues the career resurgence of Catherine Zeta Jones whose work in both this and Side Effects is exemplary despite the small nature of both roles. In fact the acting in Broken City is excellent, especially that of Wahlberg himself. The only problem is Crowe who has the tendency to play a scene straight and then suddenly turn camp, he is inconsistent throughout and therefore the film really doesn't have a convincing or reliable villain, something that makes the film suffer in its closing. Another flaw is that much like Killing Them Softly, it's political commentary is quite heavy handed and in places incredibly insulting. The central mystery feels more like economics 101 than a story in a thriller and to be honest its fairly hard to call the film a thriller with only a couple of action based sequences in the entire film. It's a decent redemption story but its buried beneath a simplistic mystery and a disappointing script which doesn't really reach the gritty levels it strides for but can impress in its politics and acting, just not its storytelling."}, {"rating": "7", "text": "Broken City is a very good movie but it's not the type of movie I thought it would be. That's not to say the trailers misrepresented the film in any way, only that Mark Wahlberg isn't known for his political thrillers. That being said, this was a very good political thriller with solid acting across the board, especially from Russell Crowe. The characters all developed well and the plot was great. The twists came about in a nice fashion, not out of left field where nobody could possibly see them coming, which has unfortunately become a trend in the increasingly uncreative Hollywood climate. The film did drag quite a bit and the ending felt a bit rushed when it happened but I'd say all-in-all this was a solid film that most people would enjoy."}, {"rating": "8", "text": "Having never seen the previews, I found myself immediately turned off by the cast/plot combo as described by my friends (who had only seen previews). Coming into the viewing with a negative outlook, I found myself very pleasantly surprised. While initially very slow and monotonous, the movie has decent twists and a fast pace when it comes to the fine details. I do believe, however, that some story elements were completely unnecessary (I'm referring to the relationship between Mark Wahlberg's character and his girlfriend.) While the movie is admittedly not perfect, overall I believe it is vastly underrated and I would definitely recommend it to intelligent and patient individuals. It is a political drama/thriller, for anyone wondering, but I found it to be true to reality with regards to how ruthless and insensitive people can be."}, {"rating": "3", "text": "Allen Hughes' intellectually vacant Broken City feels about as fake and pretentious as Russell Crowe's Kardashian-like spray tan and obnoxious blonde wig."}, {"rating": "5", "text": "Broken city digs into the broken politicians, so I give it points for that, but the movie is slow and forgettable. This movie sure disappointment me. It`s an average movie, even when things pick up here and there it`s just not enough to make up for the rest."}, {"rating": "5", "text": "\"Broken City\" quickly descends into a quicksand of clichés, and the results are meager and completely insubstantial. This is a story about power and its abuse in the city, and there are a countless amount of films that have covered this storyline already.Though it's runtime clocks in at a compact 109 minutes, it feels much longer than that. It's never outright boring, but it lacks an accumulative impact.\r Mark Wahlberg stars a Billy Taggart, a New York cop is forced to resign after a controversial shooting. But no worries, Mayor Nicholas Hostetler (Russell Crowe) has his back. He hires Billy, now a private investigator, to catch Mrs. Mayor (Catherine Zeta-Jones) screwing around. What seems like a simple adultery case opens a rat's nest of political corruption.\r The plot quite simply is little confusing. Several subplots wander off into oblivion never to return. It's occasionally hard to tell whether the Hughes brothers are winking at clichés, or merely adhering to the genre handbook. The script written by newcomer Brian Tucker is a bloody mess that has no sense of direction. Throughout the film, we're led to believe there will be some big \"shock\"  a twist or secret that will cause us to gasp in shock. When it comes, it's so muted and unsurprising that it completely diminishes the film's climax.\r The characters are poorly developed, but the overall performances are generally fine. In the right role, Mark Wahlberg can be a tremendous asset to any movie. Unfortunately, Billy is not the right role. Wahlberg is stiff and unconvincing and it quickly becomes apparent that the film would have benefitted from someone with a more volcanic temperament in the lead. As his adversary, Russell Crowe brings a little more to the part, but this isn't the New Zealand-born actor's finest hour. Catherine Zeta-Jones, continuing her comeback from obscurity, does a fine job.\r Although well-made, altogether the end result is an unremarkable thriller. \"Broken City\" fails to impress, largely in part because there is nothing here we haven't seen before.  That being said, \"Broken City\" isn't a terrible film, it's just not particularly memorable."}, {"rating": "7", "text": "It's one of those movies who you just have to watch it and decide for yourself and stop reading reviews about it, because the reviews are mixed and disturbing 50% are good and the other 50% are bad,\rand the reason for this is that the movie is so easily to misunderstood. some say it's a predictable plot, some say awful screenplay or awful directing and i say it's an enjoyable movie with a great message behind it.\rit's a crime/thriller movie, definitely not the best in the genre but it's good in so many levels that people tends to ignore.\rthe performances were solid, obviously (Mark,Russell and Zeta-Jones), the screening was beautiful and the music was very good, the plot is average but what do you expect from a movie about Corruption, i mean it might be a predictable but it have a great message behind it."}, {"rating": "6", "text": "Broken City is an enjoyable movie with some good performances.  Wahlberg and Crowd makes a middle of the road film a good one.  See it once and you won't be disappointed."}, {"rating": "5", "text": "Broken City is a film that can't really decide what it wants to be. From the beginnings of a story centred on Mark Wahlberg's character, Billy, it evolves into a standard conspiracy thriller, but never really gets going with either of them. There are vague stabs at joining the dots here and there, but without much success.\r The first forty-five minutes are largely a throwaway and only loosely connected to the much stronger second half, the tenuous link mostly going through the character of Billy. This poses a big problem. Due to the fact that the role is so flimsy, what little attempts there are at filling him out in the early stages are completely redundant once the plot finally kicks in. Wahlberg does his best to give the guy some personality, but it's a constant uphill struggle. This leaves any efforts at poignant references to his past that come later feeling not only forced, but also unnecessary.\r Once the movie begins to focus on the conspiracy, it becomes much more watchable, the dodgy character development holding less sway over the progression of the narrative. This isn't to say that it improves things hugely, just that it holds the attention much more effectively. It's tolerable and won't make you wish you'd defrosted the fridge rather than sit through it, but you've definitely seen it all before. There's no real sense of urgency about the whole thing and the mystery that is unraveled is positively trite and lacklustre. Having said that, the process of reaching the conclusion is executed reasonably well at times.\r Despite the distinctly average presentation, there are a few scenes worthy of note. Barry Pepper's range in the film caught my eye, particularly as there is unsurprisingly very little in the way of fleshing out his character. Russell Crowe too, manages to dig out some of the menace that marks his best performances, but these occasions are very few. Other than these sparse moments, it's a very dreary outing for all concerned.\r In addition to these issues, the resolution of the plot had a nasty habit of introducing new players into the mix that seemingly had not been mentioned previously. I'm not entirely sure if this was because I wasn't paying enough attention in the less agreeable sections of the picture, or if they were genuinely tacked on in wrapping things up. Either way, this should never be a complication in mainstream cinema and only confirms to me my opinion on the opening as uninteresting and superfluous, given where the film ends up.\r Overall, it's not terrible, but it's almost certainly not worth the time. More or less everything about it is wholly ordinary and I was ultimately left disappointed."}, {"rating": "4", "text": "A subpar movie from writing to directing. Drags on without obvious rewards.\rThe storyline is the age old cliche of \"Mayor sells out the city to developers for personal gain\"  ...\rAll the \"twists\" are really no surprise at all, and I agree with another commenter that with a cast of Catherine Zeta Jones and Russell Crowe, the movie could have been better."}, {"rating": "7", "text": "If you wish to see Russel Crowe speaking American and wearing a hair piece it is OK.  For men they added Catherine Zeta Jones and for us chicks there is the charismatic Marc Wahlberg and an actor called Pepper who does not even have salt and pepper.  However, I did not fall asleep - Admit Wahlberg does it for me."}, {"rating": "1", "text": "The only good thing about this film was the character played by Mark Wahlberg. The rest tries so hard to be deep and mysterious but is quite the opposite. Its thin and poorly tied together. The acting is mostly very poor, especially by the stars and it seems to be more of feature length advert for pro liberal agenda. Kinda weird really."}, {"rating": "5", "text": "\"Broken City\" 10 Scale Rating: 4.5 (Mediocre) ...\r The Good: I liked what they were trying to do. A hard boiled crime noir type of film set in modern times sounds like a good idea and was definitely a different way of going about this sort of film. I also can't complain about the acting. While no one was amazing, no one did a poor or mediocre job either.\r The Bad: It just doesn't work. While the idea was a good one, the pacing and tone felt out of place in a modern film. This means that either a. this sort of thing isn't possible or b. it was poorly written and directed. The plot also unravels towards the end and you're left with a pretty formulaic film overall."}, {"rating": "4", "text": "easily be underlined..Broken CityBroken City is a plot driven political thriller about the tricks and cheats between the cops and politicians of the city that is drunk in corruption. Amidst all the ramblings of the current society and political conditions, the essential husky bits somehow can easily be underlined, which takes away the mystery out of this raw dark tale. To manipulate these many characters on screen, is not a piece of cake and the makers in here fails to move them around like puppets and as it grows essential after a while to pull off such a heist as it fails to bind all these incidents together in one act, where the editing too is to be blamed. The hidden cards up the sleeves are neither impressive nor worth the amount of work and time it consumes. Wahlberg's character is too loud to read and isn't performed well enough to make it intriguing enough to keep the viewers invested. Crowe's reserved portrayal backfires and Jones fails to change even a dime. The script is brimmed with cliches with every benign twists and turns and familiar structure that is clearly off putting. The background score is non existent as in it fails to factor in effectively, whilst the camera work and theme doesn't demand attention at all, in fact if anything it even fails to convince the viewers for a second look. Armed with Tucker's narrow minded script, Hughes's hands are tied to visit newer territories on execution. Few tiny notions amongst all the fame and controversies, the practicality of the corrupted city and Wright's decent support are the only high points of this sunken feature. Broken City is a juvenile remake of those 70's political thriller, polished with none whatsoever finesse for it to create a long lasting impression or even a mediocre impact."}, {"rating": "3", "text": "This is a crime drama film, covering themes including justice and manipulation. First off, I felt from the start that this film was very much typical of its type - it seemed like a pretty typical traditional PI/detective film. I felt that, if anything, Russel Crowe over-acted in his role as the Mayor, given that he sounds quite distinctly not unsimilar to a no-nonsense Mafia or gangaser 'wise guy' type (more on the performances later). If anything, I wished he wouldn't be quite so softly spoken at times, as ocassionally I found myself wondering precisely what he'd said - the audio is ok but not perfect.I noticed that camera wise, the camera is nearly always moving about, with one scene toward the start of the film shot as if the camera were going slowly around a large circle around the two main characters at the time. I imagine this is done to try to (artificially or otherwise, although it did feel a little unnecessarily forced I think)  heighten the feeling that anything could happen at any moment, to try and increase the sense of a fast pace and so on. Also, as far as that is concerned, I couldn't help but notice a heavy use of incident style music throughout - sounds of a breeze brushing past metal and banging drum type pieces.I felt there was a strong feeling of artificiality present in this film - whether this was due to the somewhat over-use of incident music, camerawork and the like im not entirely sure but it probably didn't help. The characters seemed pretty basic - if anything, the females were slightly more memorable. Again im not entirely sure why but I did feel it to be the case never the less. I felt that Billy Taggart seemed to be a rather mediocre character, in terms of him seeming relatively apathetic in general, certainly during the first half of the film anyway. I felt there was a sense that the film was going through the motions, showing the usual characters - good guy, bad guy, person who may be good or bad, we're not sure, sexy lady (aka eye candy for men - not all men but some), the token plot twist scenes, chases and so on.Cast wise, Mark Wahlberg plays Billy Taggart. This is far from a stretch for him, in as much as he's well known for his action/thriller film roles in films such as Lone Survivors, 2 Guns and Shooter. Billy seems a fairly down-and-out type character (which makes sense given what we known of Billys past) but I can't say I felt any real interest or pretty much any emotional attachment to the character, which is never a good thing when your talking about the main character. He plays the role pretty blankly, if you know what I mean. Another main character is, of course, Mayor Hostetler, played by Russell Crowe. As I've mentioned, he is quite a softly spoken (aka really quite quiet) character, yet someone who seems both sneaky and reasonably clued-up. If you've seen Crowe in other similar films then you'll no doubt have a rough idea of what his character is like - somewhat stealthy, determined et al. In a sense, the two main cast members could be thought of as a good pairing, since they are quite similar in type and you could argue that its like fighting as twins but thats maybe simplifying things a bit. I wouldn't say Crowe was especially memorable in his role in this film but then I don't think this film was particularly memorable in general anyway - both of the main cast members have appeared in better films before and hopefully will do again.Some scenes in this film are relatively dark, lighting wise and it can seem somewhat sinister, with the camera moving slowly from one side, or part, of a room to another. At one or two points the music changed from more basic incident style music to a low-key operatic style music, as events started to 'come to a head'.Content wise, this film contains strong language, some moderate violence including people shown with bloody injuries. There are also sex references, plus one scene with brief nudity. Due to this content, the film carries a 15 rating. I'd also like to add that I felt that, on one or two ocassions, the use of strong language seemed a bit forced i.e. didn't seem entirely necessary. Honestly, I felt like I watched the film while feeling unsure quite what the whole plot was. In its favour, it isn't a completely dire watch, it is relatively watch-able as such but I just didn't feel like I was in any way immersed in it, rooting for any one particular character, dreading or desperate to find out what truths would be discovered and who may be proven right or wrong. All the same though, it was entertaining enough to pass the hour and 40 minutes or so that it runs for. It isn't entirely boring, due to the fairly constant moving camerawork (although this may distract and bother some people) - the effects were alright and so on but its most definitely not one of the better examples of its type."}, {"rating": "8", "text": "********************************************************》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》¡"}, {"rating": "10", "text": "□□□□□□□□□□□□□□□□■■■■■■■■■■■■■■■■■*******************************************************"}], "recommendations": ["no_sudden_move", "the_little_things", "bad_times_at_the_el_royale", "the_equalizer_2", "the_accountant", "widows", "knives_out", "the_gambler", "good_time", "the_snowman", "gone_girl", "a_walk_among_the_tombstones", "terminal", "triple_9", "a_most_wanted_man", "lucky_number_slevin", "man_on_a_ledge", "triple_frontier", "project_power", "cube", "beyond_the_reach", "solace", "suburbicon", "sicario_day_of_the_soldado", "the_gunman"]}