{
  "id": 314,
  "title": "Brothers by Blood",
  "starring": [
    "Matthias Schoenaerts",
    "Joel Kinnaman"
  ],
  "runtime": 90,
  "genre": [
    "Crime"
  ],
  "description": "Peter and Michael, raised on the streets of Philadelphia, are the children of Irish mob members, forever linked by the crimes of their fathers. 30 years later, Michael now runs the criminal organization and lusts for more power, his dangerous antics frequently held in check by his cautious cousin Peter. Haunted by the death of his sister, whose passing destroyed both his parents, Peter is caught between the dreams of childhood and the realities of his life as an enforcer. His only reprieve is a local boxing gym, a sanctuary that is quickly threatened as Michael’s desire for control escalates.",
  "releaseYear": "2021",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/2RKGUCbo2R6IDsufxApL6nRFL4j.jpg",
  "categories": {
    "plot": 4.0,
    "acting": 4.0,
    "ending": 5.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 5.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "4",
      "text": "With Matthias Schoenaerts and Joel Kinnaman doing the leading duo, I really hoped for something way more stimulating, but the script forgot to create an engaging story, and more than anything it forgot to create characters that have even the minimum of plot development.While the tone is focused on being implicit with the dense ambient, you should also keep in mind that such a vague tone can be a double-edged sword, especially when your narrative pulse becomes so tedious.It was a sad disappointment."
    }
  ],
  "recommendations": [
    "the_messenger_the_story_of_joan_of_arc",
    "edge_of_the_world",
    "the_thomas_crown_affair",
    "anna",
    "the_world_to_come",
    "ex_machina",
    "worth",
    "the_guilty",
    "thoroughbreds",
    "the_ballad_of_buster_scruggs",
    "stonehearst_asylum",
    "spy_game",
    "the_abyss",
    "unbreakable",
    "no_sudden_move",
    "what_lies_beneath",
    "the_dig",
    "paradise_hills",
    "nocturnal_animals",
    "thelma",
    "motherless_brooklyn",
    "the_killing_of_a_sacred_deer",
    "cliffhanger",
    "the_intruder",
    "the_starling"
  ]
}