{
  "id": 336,
  "title": "Brothers",
  "starring": [
    "Tobey Maguire",
    "Natalie Portman"
  ],
  "runtime": 105,
  "genre": [
    "Drama",
    "Thriller",
    "War"
  ],
  "description": "When his helicopter goes down during his fourth tour of duty in Afghanistan, Marine Sam Cahill is presumed dead. Back home, brother Tommy steps in to look over Sam’s wife, Grace, and two children. Sam’s surprise homecoming triggers domestic mayhem.",
  "releaseYear": "2009",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/ySXRgHCdelVtvUyHcKGpiQKb052.jpg",
  "categories": {
    "plot": 6.382352941176471,
    "acting": 7.0,
    "ending": 6.666666666666667,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 5.0,
    "action": 8.285714285714286
  },
  "reviews": [
    {
      "rating": "10",
      "text": "This is the most emotionally effective film I have thus far seen in my life. Superb acting all around, and incredibly tense situations throughout."
    },
    {
      "rating": "8",
      "text": "Films that depict a war environment have been coming out of Hollywood regularly in the past several years. Itâ"
    },
    {
      "rating": "9",
      "text": "De las mejores interpretaciones de Tobey Maguire, Natalie Portman y Jake Gyllenhaall. Desgarradora. Romántica. Familiar. Dura. Nos hace odiar la guerra. Jake Gyllenhaall está guapísimo."
    },
    {
      "rating": "5",
      "text": "In a time of bloodshed and war, Brothers attempts to become an instrumental film conveying the psychological effects of individuals in battle.  In order to do so, director Jim Sheriden employs drama within the film, but unfortunately falls flat until the conclusion occurs. This remake of the critically acclaimed 2004 Danish film, Brodre, is a story of two opposite brothers, Tommy Cahill (Jake Gyllenhaal) and Sam Cahill (Tobey Maguire).  Sam is a marine that is about to embark to Afghanistan leaving his two daughters and his wife Grace (Natalie Portman); While Tommy is on parole adjusting to his former life. When Sam is pronounced dead after a plane crash, Tommy attempts to relieve his brother's grieving wife and care for his two children.  When Sam is rescued from Afghanistan, he comes home truly affected by the war mentally. Confused, he is under the assumption that his brother and wife had a sexual relationship.  This causes bitterness within the family and ultimately showing how this war hero loses his inner self.While the premise possesses an immense amount of potential, it never really reaches a high point until the final moments of the film.  From the previews, I was expecting a love triangle-esque film that would enable many dramatic plot twists. But the relationship between Portman and Gyllenhaal remains neutral throughout the film, leaving the film to seem empty. While the plot does create drama, that simply is the problem, it only creates it.  The film never goes anywhere with it and by doing so exposes its own flaws. Although it does not follow the scheme I was under the assumption of, that does not necessarily mean it's a bad film.  As a melodrama movie, it passes as a sufficient source of entertainment.  While the acting sometimes is inconsistent and unreal, it is excellent for the most part.  Gyllenhaal performs with zeal while Mcguire really puts emotion into his character. Portman executes a cute performance, but does not in all actuality contribute to the film as a whole.  Once again referring to it as a melodrama, its plot moves smoothly and emptily creating tension that never really erupts.  The most thrilling part of the movie is the end where Maguire executes his most emotional performance to date.  This satisfied my want for a dramatic thriller, but sadly the journey to this moment was an entertaining soap opera.Brothers is ultimately an acceptable film, but the audience should expect something different than what the trailers promise.  It is not a romantic thriller that depicts a fierce rivalry between brothers, instead it is a full-length soap with a commendable acting cast and efficient commentary on the psychological state of soldiers."
    },
    {
      "rating": "0",
      "text": "The entire premise of the movie is totally bizarre to start out with. A marine hacking his fellow marine to death because some medieval Ali Baba's tell him to deserves absolutely no sympathy, and puts the military in a really bad light. I cannot imagine any soldier actually doing that. It leaves you with an empty feeling."
    },
    {
      "rating": "1",
      "text": "This movie left me feeling uneasy and awkward throughout. It felt pointless and left me wondering why I decided to watch Tobey Maguire try.."
    },
    {
      "rating": "5",
      "text": "Sympathetic characters, but it is just another anti-war movie that does not achieve to say anything that has not been said before. The plot is in a sense a variation on Michael Bay's \"Pearl Harbor\"."
    },
    {
      "rating": "6",
      "text": "I love the psychological side of warfare destroyer... how the mind and soul of those who back from the horror of the battlefield gets so hurt that it loses meaning, value, or family or life itself. So I loved the movie because it pulled me the drama suffered by American heroes. The performances are sensational, ALL, from the little girls that gave relief to the melancholy mood of the film, going by his father, stepmother, who took good care of their roles while supporting and especially the trio who gave a show of emotion Natalie Portman Jake Gyllenhaal and Tobey Maguire."
    },
    {
      "rating": "7",
      "text": "Brothers is an emotionally stirring film that really packs a punch when it comes to its examination of PTSD and war. Certainly not pro-military, Brothers thankfully does not go rah rah when it comes to America, instead showcasing how everyone is not necessarily a hero, because you never know what they went through. Even if you think they are, they may vehemently disagree. It's all relative. As someone who is very skeptical when it comes to the military, I greatly appreciated this element. That said, I am not sure I am buying Tobey Maguire as a tough as nails major with his whiny voice. Fortunately, Jake Gyllenhaal and Natalie Portman are good enough to overcome that miscasting and really do fit their roles, but the writing is never quite satisfying. Though the story is well told, the film feels too short and the characters not nearly well fleshed out enough, with very little in the way of character development. Gyllenhaal's character completes a 180 without reason and very little explanation as to how, which is problematic. That said, the film's power and sharp acting performances from Gyllenhaal and Portman elevate Brothers into a more than satisfactory look at the darkside of war."
    },
    {
      "rating": "4",
      "text": "Brothers was an interesting experience to say the least. From one angle it's a well acted family drama about a man coming home from war, but from another angle is a confused film with a story that's completely unfocused, it doesn't know which character it wants to highlight. This confusion makes the story lack the depth that the subject material required. I thought some elements of the story-line were forced without any cause or purpose."
    },
    {
      "rating": "5",
      "text": "Good acting performances by all with a tense atmosphere that keeps you on the edge of your seat."
    },
    {
      "rating": "6",
      "text": "While the subject of soldiers' post-traumatic stress is important, the overall story felt incomplete. i was surprised that it was not handled better considering the amount of talent that was a part of it. the problem is the script. it is so uneven. maguire's voice over in the beginning says he would do anything to go back to his family, but there are implications as the film goes on that he feels more comfortable being with his \"men\". did i miss something or did maguire's character kill a fellow soldier because he believed his captors would send him home, or did he do it to keep them from killing him? this was a sticky point for me because either way they would have killed him regardless. the performances on the other hand were very good. i think gyllenhaal gave one of his best performances, as did portman. maguire's nuanced performance of this affable, loving father at the start of the moving to a stoic, emotionless soldier while in captivity and then this quietly broken man once he returns home was truly heart wrenching. still i think what maguire's character went through would have worked better in dreams or flashbacks. it would have impacted me more, but i think how maguire inhabits the character is effective. you can see how his mind is working when he bluntly addresses gyllenhaal about whether he slept with portman. he's eerily pleasant in his tone but you can feel that he is steadily loosing control."
    },
    {
      "rating": "9",
      "text": "Powerful film, one of best of year - way better than the more critically praised ho hum, depressing Up in the Air."
    },
    {
      "rating": "8",
      "text": "Brothers: Toby Maguire plays a role that is so terrifilying convincing that he should win every oscar for the next ten years. The movie takes every emotion inside of you and tears them to shreds. Jake Gyllenhaal and Maguire's final confrontation is so emotionally traumatizing you dont know who to root for. In the end i...t was a succesfull war/drama movie, with some of the best acting I have ever seen. I give it an A-."
    },
    {
      "rating": "7",
      "text": "Very powerful performances from the leads really make this film work. Toby Maguire has the showy role but he handles it well, Natalie Portman is excellent as his wife and gives a very heartfelt performance, and Jake Gyllenhaal is subtle but effective as his brother. The story is very good, a bit overstated perhaps but it holds your interest throughout. Good score, fine supporting performances from Sam Shepard and Mare Winningham. I am getting a little weary of movies that deal with a wars effect on a person though, fortunately this one handles the subject matter sensitively."
    },
    {
      "rating": "0",
      "text": "Unwatchable dreck. Heavy handed, anti-military movie from Hollywood mooks with NO understanding of the military, human beings or the world, in general. Ebert thought it was great. Say no more."
    },
    {
      "rating": "10",
      "text": "Excellent film. one of the best of the year. storyline and acting are excellent. do not miss it!"
    },
    {
      "rating": "9",
      "text": "A really powerful movie with what I thought was incredible acting. Toby Mcquire I thought was almost silly at times in the Spiderman movies but he really carried this movie along with Jake Gyllenhaal. Great pacing, great writing, and great acting. Especially hit home for me and my gf because I'm leaving to basic training soon."
    },
    {
      "rating": "10",
      "text": "A beautiful drama movie !! Great actors for a movie extraordinary !! Oscar for Natalie Portman!!"
    },
    {
      "rating": "9",
      "text": "I loved this movie because of what the actors brought. You'll find some surprising things from the smallest places..i dont want to give anything away. Just enjoy the movie and try to take Natalie Portman seriously."
    },
    {
      "rating": "8",
      "text": "Emotionally wrenching, sometimes going over the top, uneven, raw, but still kudo's to Hollywood and Sheridan for dealing with this subject. Ensemble acting empowered the dramatic effect, with Gyllenhaall giving the most nuanced performance. You can begin to fathom the core of post traumatic stress to suicide and psychosis we are confronted with today."
    },
    {
      "rating": "10",
      "text": "The best film I've ever seen. Very touching. Brilliant actors."
    },
    {
      "rating": "7",
      "text": "This movie was good, bad, and the ugly all roled into one. It was kind of predictable, somewhat dark, but vey realistic. I would recommend the movie, but stop short of rating any higher."
    },
    {
      "rating": "8",
      "text": "This was a very good movie. The acting was truly amazing, by everybody involved."
    },
    {
      "rating": "10",
      "text": "I don't know what movie the critics watched because this movie was right on point with what our soldiers and their familiies are going through every day!"
    },
    {
      "rating": "9",
      "text": "Each actor gave their all for the characters. With a intense story and fantastic actors, this movie let you be a part of it's highs and lows."
    },
    {
      "rating": "7",
      "text": "The writing just failed this elite ensemble, only the children's roles are fully realized."
    },
    {
      "rating": "8",
      "text": "I thought this movie was fantastic. On the surface, it seemed to be too simple to be good. But I think it was meant to be taken on multiple levels. Look at the two brothers, and the crimes they both committed. Murder is worse than robbery. Since the movie leaves you with almost no back story to the younger brother, you have to wonder what made him try to rob the bank. I think it's meant to teach that you have to take life objectively. Everyone has a back story, whether you know it or not, and they must be treated that way. As that hoe the younger brother brought to the dinner table, we are all human. That being said, there was something about the characterization of the two brothers that made it too surreal. You just have to kind of take it that they have a history of friendship and love, even though the father would make you think that there was always turmoil in the family, and that the brothers would be far from best friends. The wife was just a drag, nothing more than an object used to represent family earned, anything outside of blood. She had no personality whatsoever. The father also wasn't fleshed out enough. I think if we saw more strategically placed back story, you could make a stronger statement. The acting was decent otherwise. It was a great movie, just short of magnificent."
    },
    {
      "rating": "10",
      "text": "It was an excellant ensemble cast production. You felt the intimacy, the emotions, the frustra- tions, and yearning for meaning and happiness of a modern day family during time of war. The mov- took you there and made you feel what the char- acters were feeling. You can't ask for much more."
    },
    {
      "rating": "9",
      "text": "Great movie, wonderful acting!"
    },
    {
      "rating": "6",
      "text": "Sadly, I think the lead role required a stronger actor than Tobey Maguire. Jake and Natalie do a fine job, and the child actors give an impressive performance, although by the end they are a bit cloying. I imagined the movie this could have been while watching it (and enjoyed it), but did not see it on the screen."
    },
    {
      "rating": "8",
      "text": "Very good movie but I feel it could of went on a little longer. I feel like the end of the movie left you hanging did not like the end."
    },
    {
      "rating": "8",
      "text": "The power and beauty of Brothers is its intense simplicity, like Sheridan's In America, there are no villans or saints in the story, just common everyday people coping with what life has dealt them and understanding family is the foundation that holds it all, and them together. Jim Sheridan shows the honesty in his characters and everyone in the cast plays them as if they were your neighbors 2 doors down. After years of being in that spider suit, Tobey Maguire confirms to the world that he is an actor to be reckoned with, he is simply devasting in Brothers, a brilliant performance like his pre-spidey days of The Wonder Boys and Pleasantville. Natalie Portman is simply the best actress of her generation, something we've all known since The Professional. Brothers is a great movie, great in its simplicity and honesty, in its writing and directing and in its powerful perfomances. Most of all, Brothers is well worth seeing."
    },
    {
      "rating": "8",
      "text": "Troubling, any one who would recommend military service for their child needs to watch this movie. Very realistic emotional ride."
    },
    {
      "rating": "8",
      "text": "A good start, a slo-mo middle and a breath-taking finale. Mix all of that with Maguire's surprisingly dark performance and you have a movie with one of the greatest after-effects you'll ever feel. Also, Natalie Portman is so hot!"
    },
    {
      "rating": "7",
      "text": "Three of our finest young actors and a strong supporting cast give excellent performances in this wise and thoughtful film. The open-ended conclusion indicates that there are filmmakers who believe that at least some of their audiences do not need everything spelled out for them."
    },
    {
      "rating": "8",
      "text": "Very sad, compelling and powerful movie with good performances from the three leads."
    },
    {
      "rating": "6",
      "text": "Just OK, and very well acted particularly by Gyllenhaal and Portman, but too melodramatic to hold much power for me. I'm not sure why Maguire is getting plaudits - he alternates between Peter Parker-style goofiness and anguished thousand-yard stare. He didn't convince me like the other two leads. Then there's the misjudged Afghan side story, which is populated by cartoon characters. It might have worked better had we been kept completely in the dark as to the soldier's fate as well, to be put in the same position as the wife and brother. As it is we are just sitting waiting for his inevitable (rather than hoped-for) return and we know any emotional investment during this buildup will be wasted. It feels almost tacked on - like Maguire demanded to be given more to do?"
    },
    {
      "rating": "5",
      "text": "The whole movie moved way to slow and you knew what was going to happend so waiting for it to happen to.ok forever. Tobey maguire did not play the role of the father well. in my opinion the roles should have been switched between him and jake gyllenhaal"
    },
    {
      "rating": "10",
      "text": "I loved it! Natalie Portman and Tobey both deserve an Oscar."
    },
    {
      "rating": "7",
      "text": "Having seen the Danish original in 2006, I have to say I prefer it over Sheridan's version. It's difficult for me to be objective. I give Susanne Bier's film a 9.5/possible 10...this remake was slightly disappointing. Tobey Maguire's acting was most convincing once he returned from Afghanistan. I wholeheartedly disagree with any rating lower than a 6. All in all, terrific story."
    },
    {
      "rating": "9",
      "text": "The raging bull has no proof, just a hunch, that Joey(Joe Pesci) is sleeping with Vickie(Cathy Moriarity) behind his back. Jack LaMotta(Robert DeNiro) may, or may not, be right, because Scorsese lets moviegoers decide for themselves if the boxer's paranoia about possible transgressions between his brother and wife are warranted. It's this same sort of ambiguity that \"Brothers\" needs, as Sam(Tobey Maguire), the feisty spider, notes how Tommy(Jake Gyllenhaal) and Grace(Natalie Portman) carry on like teenagers at the skating rink. But the filmmaker telegraphs their innocence, in a scene where the black sheep brother and wife of a \"dead\" G.I. smoke pot and kiss, but nothing more(even though their love would have been a foregone conclusion had fate not intervened). Since the moviegoer knows the limits to their relationship, Sam's point blank accusation of infidelity sounds like the ravings of a madman, and not the prescience of a dead man walking, who knows his existence is practically irrelevant. This tweak to the film's calibration, in which the intimations of a physical relationship looms like an aura, would have kicked the pathos up a notch, because the moviegoer sees how Sam's death was the best thing that ever happened to Tommy. The drama of \"Brothers\" is at the homefront, not an Afghanistanian hot zone, but Tobey Maguire is too big of a star to be kept in the filmic negative space. When Sam comes home a transformed man, for the worst, Grace doesn't know the root cause of this human alchemy, and neither should we. Sam's unpardonable act could have been taken care of with a simple flashback. \"Brothers\" is a domestic drama that's constantly interrupted by the war, but the moviegoer pardons the interruption. This remake of the 2005 Susanne Bier original(\"Brodre\") had me chained to my seat. The acting is, lights out terrific, perhaps, the best ensemble job in a major studio film this year, so far."
    },
    {
      "rating": "8",
      "text": "I think the critic's missed this one. The acting is 1st rate,especially the two young girls. It gets pretty intense and plays out very realistically."
    },
    {
      "rating": "7",
      "text": "Good movie but thought that Matt Damon and Kate Beckinsil would have been a better casting .I just didn't but Tobie and Natalie."
    },
    {
      "rating": "7",
      "text": "Although not quite as good as it could be, this is a powerful film with good performances."
    },
    {
      "rating": "8",
      "text": "It was a pretty good movie. It was well made, interesting, entertaining and the actors were all pretty good. Brothers is definitely a pleasant surprise and I highly recommend it."
    },
    {
      "rating": "10",
      "text": "Brothers is an incredible movie about the effects war can have on a man and how it will change them as a person. Sam (Tobey Maguire) leaves his family to go fight in Afghanistan where his helicopter crashes and he is captured by terrorists. Thought to be dead; his wife, daughters, and brother Tommy (Jake Gyllenhaal) move on without him. When Sam miraculously escapes and comes home alive, he is unable to reconnect with his family (due to what he experienced in Afghanistan and how his family has moved on). The performances are fantastic, especially Tobey Maguire. There are a few standout scenes that are absolutely riveting and heartbreaking all thanks to his performance. The overall story and message of the movie is very dark but relevant in regards to modern day war. It gave me a lot more respect for war veterans and what they fight for and have to go through."
    },
    {
      "rating": "5",
      "text": "C’est le petit militaire modèle qui s’en va en Afghanistan et qui revient… un peu moins bien qu’avant parce que les barbus là-bas, ils sont pas très sympas. Et pas très tolérants non plus : ils ne veulent aucun immigré américain chez eux ! ils veulent pas « vivre ensemble »… Ou plutôt si mais chez nous, pas chez eux, Monsieur le Commissaire. Ou bien chez nos amis amerloques bien sûr.M’enfin bref. C’est Tobey Maguire le soldat qui revient du front, un rôle plus difficile qu’il n’y paraît mais qu’il remporte haut la main ; très loin du super héros à collants ici, il donne une vraie humanité à son personnage sans trop en faire… Car s’il est un défaut plus ou moins récurrent dans ce film, c’est que l’on en fait trop ici, trop souvent et notamment dans le pathos…!On a bien compris qu’il s’agit d’un psychodrame, message reçu fort et clair, mon Capitaine mais si tout le monde pouvait un peu arrêter de chialer dans la chaumière (y compris les gamines évidemment) ce serait pas plus mal ! Y compris notre jolie Natalie, presque blonde ici en simili-veuve éplorée, et comme tous les autres soit en train de chialer, soit sur le point de chialer.Cela étant, le propos reste tout à fait digne d’intérêt dans cette famille de militaires, militaires de père en fils, sauf le frérot apparemment (Gyllenhaal un peu rebelle, faut dire) le seul qui n’a pas le petit doigt sur la couture, au garde-à-vous, prêt à saluer les couleurs…D’ailleurs, on ne s’ennuie étonnamment pas dans ce psychodrame, ce qui ne laisse pas d’étonner… mais on peut regretter le manque de remise en question de la chose militaire, comme s’ils venaient tout juste de se rendre compte que le revers de la médaille, des médailles, ça peut être le « body bag » ou bien le post-traumatique ! et il a eu du pot, le petit gars, il a eu du pot, il est encore entier !Bref, c’est pas mal comme film mais c’est pas terrible et pas toujours ça qu’est ça, comme disait mon Lieutenant qui avait du mal à faire à des phrases."
    },
    {
      "rating": "2",
      "text": "An unfortunate misfire. Brother's has an interesting story to tell but is unaware of how to tell it with the movie never really saying anything. It missed its emotional marossuch as how lukewarm his reception had been when discovered alive or the relationship between the wife and the brother. Truly disappointing"
    },
    {
      "rating": "9",
      "text": "Esse filme é bala demais nem sabia que em 2009 esses cara já atuavam tão bem, achei bem diferente a história o jeito que é tratada toda a questão de guerra e como se adaptam ou no caso não se adaptam quando voltam a ter uma vida normal. As cenas da mesa são muito boas."
    }
  ],
  "recommendations": [
    "gifted",
    "the_judge",
    "the_descendants",
    "marriage_story",
    "rain_man",
    "blue_valentine",
    "manchester_by_the_sea",
    "the_glass_castle",
    "fences",
    "joy",
    "only_the_brave",
    "still_alice",
    "legends_of_the_fall",
    "the_father",
    "the_impossible",
    "collateral_beauty",
    "lovelace",
    "scent_of_a_woman",
    "the_hunt",
    "silver_linings_playbook",
    "the_place_beyond_the_pines",
    "the_fighter",
    "as_good_as_it_gets",
    "stillwater",
    "cast_away"
  ]
}