{"id": 754, "title": "Brother Bear", "starring": ["Joaquin Phoenix", "Jeremy Suarez"], "runtime": 85, "genre": ["Adventure", "Animation", "Family"], "description": "When an impulsive boy named Kenai is magically transformed into a bear, he must literally walk in another's footsteps until he learns some valuable life lessons. His courageous and often zany journey introduces him to a forest full of wildlife, including the lovable bear cub Koda, hilarious moose Rutt and Tuke, woolly mammoths and rambunctious rams.", "releaseYear": "2003", "mpaaRating": "G", "imageUrl": "https://image.tmdb.org/t/p/w500/otptPbEY0vBostmo95xwiiumMJm.jpg", "categories": {"plot": 5.4375, "acting": 4.222222222222222, "ending": 5.125, "soundtrack": 8.0, "cinematography": 5.0, "familyFriendly": 6.416666666666667, "funny": 5.4, "action": 6.666666666666667}, "reviews": [{"rating": "3", "text": "This movie is hot garbage. After a strong opening, it devolves into a trashy baby movie with terrible jokes and annoying characters and never recovers. People like to rag on Hunchback of Notre Dame for having tonal issues, but this one's honestly even worse. All the terrible humor after the main character becomes a bear makes the second and third acts frustrating and unbearable (no pun intended) tonal nightmares. Why does this have a 7 when it's just not good?"}, {"rating": "8", "text": "The poor reviews are hard to understand. Brother Bear is a kid's movie, and as a kid's movie it is great. It's got endearing characters, lots of cute animals, and gorgeously animated scenery. The moose provide comic relief, and the moral of the story is a nice lesson about maturity. Just one caveat: the hunting scenes were a little too intense for the 27-month old who saw it with me, even though there is no actual gore. Oh, and the Phil Collins songs are skippable. I actually enjoyed this more than The Lion King, which to me seemed to be trying too hard to bring the adults in with a story that nevertheless remains kiddie-level. I also liked it better than Shrek, which just annoyed me with its precocious attempt at hipness. It was more heartwarming and aesthetically pleasing than Ice Age. It didn't have the clever charm of Lilo and Stitch, but I don't think kids really need that. There's plenty of time for cleverness and snark later in life. Let kids be kids - take them to see Brother Bear."}, {"rating": "5", "text": "The best Disney films are the anthropomorphic ones, in other words, the ones where the animals are the main focus of a story. We see this in such classics like; 'Bambi' (1942), 'Lady and the Tramp' (1955), and 'The Lion King' (1994), and in 2003, Disney decides to tackle it again in 'Brother Bear'.\r What the movie focuses on is a young man named Kenai (voiced by Joaquin Phoenix) who, along with his older brothers; Denahi (Jason Raize) and Sitka (D.B. Sweeny) try to achieve their goals and get their rewards. Kenai is hoping to receive his totem, a necklace that is shaped like an animal, and what the animal represents can differ. The bear, which is the one he receives, means love, and he is dismayed at this as his brother, Denahi, teases him constantly about getting such a non-masculine totem.\r Kenai wants to prove himself, but ends up coming across an incident with a vicious looking bear. The eldest brother, Sitka, decides to sacrifice himself to save his two brothers from the vicious animal. The bear escapes, and the leaves the two brothers to feel guilty. But Kenai isn't done yet, he decides to search for the bear, and kill it there and then so he can mourn for the death of his brother.\r Little does Kenai know that after he slaughters the bear, the lights that touch the mountain where he was standing on that contain the spirits of the dead, including his oldest brother, Sitka, decide to transform him into a bear as some form of punishment. It is one of those stories where we see our main hero attempting to learn his lesson the hard way, and realize that what he is doing, or what he has done, is wrong.\r Kenai, now transformed into a bear, ends up coming across a little bear cub named Koda (Jeremy Suarez), and they agree to help each other find the lights and head back up to the mountain. We learn about Koda's story and how he and his mother were separated, and now he must feel it is his time to find her. We also learn that, later, Kenai is the one responsible for Koda's mother's death which is what transformed him into a bear in the first place. This is an effective twist as it may catch the viewer off guard, but can also be a little predictable given how many times you have seen this story told in the past.\r At the end, Kenai does reach the mountain with Denahi present, as he believes that he is the bear that killed Kenai. The lights touch Kenai and transforms him back into human, however, he decides that it is best to become a bear as he has grown to become fond of little Koda.\r The ending here, for me, is extremely flawed and incredibly rushed, the fact that we were rooting for this character to become human within the first two acts of the movie, and then decides that he should stay as a bear due to the fact that he feels guilty for the mother Bear's death seemed odd.\r The music here is good though, it has that \"Lion King\" vibe to it which is nice to listen to on an adventure like this. The songs by Phil Collins are also good, though, given that this is supposed to be a musical, none of the characters sing, and it is mainly in the background which seems a little off. There is this one scene, in particular, where a guilty Kenai (as a bear) confesses to Koda about what happened to his mother, but all we get is the camera spiraling around the two characters as he tells the story, with Phil Collins singing in the background. I understand what Disney was trying to do there, crafting an emotional scene only through facial expressions and music, but it didn't quite work as well as expected.\r Overall, 'Brother Bear' is mediocre Disney fare, it isn't a great Disney film like; 'Beauty and the Beast' (1991) (my absolute favorite), 'The Lion King' (1994), or 'Mulan' (1998), but it's still something for the kids to enjoy. As a child however, I don't remember enjoying this movie as much as the others I listed, and even as an adult, it still doesn't agree with me. It's not that this is a bad film, it's just, the story could have been told more effectively without depending too much on the visuals and the music.\r Speaking of visuals, they are marvelous, the landscapes and colorful backgrounds do prove to be eye-candy, especially in 2D animation, since 3D animation was making its way into mainstream films with Pixar leading the way in innovation.\r 'Brother Bear' tells a good story, the execution needed some tweaking here and there, we could've been looking at the next 'Lion King'."}, {"rating": "6", "text": "it wasn't the best disney movie when it was overshadowed by Disney/Pixar's Finding Nemo, but this movie was pretty much worth a try."}, {"rating": "6", "text": "May hardcore sensitive or young viewers, but Brother Bear cannot avoid its flawed result and crappy animation. Disney's animated classics have been better than this one."}, {"rating": "10", "text": "Brother Bear is awesome movie! Why did get such bad reviews? I have no idea, but I know one thing. His story, music and message are so good!"}, {"rating": "10", "text": "I really can't understand the critics bad reception to this movie: The comedy is decent, all the characters are charismatic, the soundtrack is amazing, the animation is beautiful and the story is deeply touching.  In my opinion, it's one of Disney's best animations, alongside The Lion King, The Hunchback of Notre-Dame, Beauty and the Beast, and Aladdin."}, {"rating": "10", "text": "Don't pay attention to the Metascore, this movie is much better than it may seem at first glance. The OST is over the top, and the way the story develops is clever, entertaining and memorable. Not only my favourite Disney classic, but also my favourite movie of all time. MUST SEE!"}, {"rating": "10", "text": "This is the great movie whe i was child, but sometimes is simmilar to the other movies.\rBut is funny, beautiful the forest, and drama. Well is short than the others disney movies, but great."}, {"rating": "3", "text": "It has a great soundtrack, it is gentle and it means well, but sadly it is too predictable to pass as a good movie and it follows up on its bad voice acting and so and so animation. Brother Bear is a very weak Disney effort. I give this movie 28%."}, {"rating": "10", "text": "In terms of childhood favorites, this movie is certainly up there. Amazing visuals and soundtrack, excellent plot, and funny dialogue, this movie is one of the greats of Disney's creations. Excellent, worth the 10 stars, and a must-see for Disney Die-Hards."}, {"rating": "5", "text": "Brother Bear is sweet and heartwarming, but it's not that fun or entertaining. it's almost like a dramatic film for adults aimed for kids, not knowing its place."}, {"rating": "0", "text": "This animated movie is special, its unexpected, mysterious, and interesting. A very appealing movie with hysterical humor. But disappointing as it is, a too short of a film, and a little bit of a weirdo (because it doesn't ever try in anything to make a good movie), it just happens, the movie is the movie. But for my eye, it isn't good enough, I found it a huge letdown for I, myself, and its reputation."}, {"rating": "5", "text": "Not as good as for example, Toy Story but still for kids (aged 6-10), they'll probably enjoy it."}, {"rating": "2", "text": "This movie is delightful. So dark and gloomy. I hated this movie. I was confused throughout the film. It was a pleasure to the eyes, and my soul. This movie is faced paced, boring, idiotic, good, and wierd. I don't understand my review."}, {"rating": "5", "text": "I vaguely remember watching this movie when it came out. I remember sweetness, but also very cynical and now, after re-watching it, I could easily picture out how the film would finish and I even found the most tragic scenes hard not to fall asleep to."}, {"rating": "7", "text": "im giving it a 7 cuz of his **** brother who turned his brother into a bear over self defence wtf thats stupid but this movie is funny at times but it lacks allot of music"}, {"rating": "5", "text": "Was good movie.\r I have the DVD.\r I draw bears.\r I like Koda.\r I like the songs.\r People didn't understand this movie. They didn't  about the story."}, {"rating": "7", "text": "Decent In RetrospectWith the Joker himself (Joaquin Phoenix) as the lead character and other good casting, Brother Bear isn’t perfect, But it’s fun film."}, {"rating": "8", "text": "\"Brother Bear\" is a film with a delicate theme about forgiveness and family. Despite a story with a controversial plot twist (at least controversial enough for the following events) the film entertains and charms its audience. Perhaps one of Disney's most underretad films."}, {"rating": "10", "text": "I grew up with this movie. I love it with all my heart. The animation style, the characters, the colours, the Depiction of the Inuit culture... it’s wonderful!!!!"}, {"rating": "4", "text": "Outra fraca animação da Disney"}, {"rating": "8", "text": "Great tale of a boy learning the ways of the wild bear after he kills one, avenging his brother's death. He learns throughout the film about the bear's point of view, accompanied by a young bear named Koda."}, {"rating": "7", "text": "When a film company has made so many iconic films, anything less than \"spectacular\" has to feel a bit disappointing. And despite this, \"Brother Bear\" is still an entertaining film. It's funny, it's got some nice animation, some great characters, and some nice heart. It's not a new \"classic\" and it definitely feels more like a \"2000's Disney film\" as opposed to an amazing film, but it's good fun for kids and adults alike."}, {"rating": "8", "text": "I wasn't expecting to enjoy Brother Bear as much as I did. It is by far one of the better post-Tarzan Disney movies, along with Emperor's New Groove and Lilo and Stitch. I do think it is very underrated, apart from a couple of minor flaws there is hardly anything wrong with it. So what makes Brother Bear a delight? Well for one thing, the animation is simply gorgeous. Beautiful colours, stunning backgrounds and next to flawless character movement. Out of the post-Tarzan Disney movies, Brother Bear gets my vote as the most beautiful visually.Another pro was the awesome soundtrack. The orchestral music is lovely, and Phil Colins's songs are every bit as catchy, fun and memorable as the ones he did for Tarzan. The film also has a heartwarming story, concentrating on the friendship between Kenai and Koda and there is a nice moral. There is also a lot of symbolism, that was incorporated into the narrative very well. The characterisations are strong, with Joaquin Pheonix superb as the voice of Kenai, and Koda(voiced by Jeremy Suarez) is a simply adorable character. Plus the MacKenzie Moose, voiced by Dave Thomas and Rick Moranis were hilarious. There are some funny parts in the script, but quintessentially it is a heartwarming one, maybe even some tearjerkers.I have very little to complain about this movie. Though had this movie been a tad longer, we could have had some more development in the secondary characters. My only other qualm was although the songs in general were awesome, the song sung by Tina Turner at the beginning wasn't quite in the same league. Other than that, this is a great underrated movie, not Disney's best, but you know what, it is well worth the look. 8.5/10 Bethany Cox"}, {"rating": "7", "text": "Brother Bear is a fun bear movie that takes life changing events and uses them to make us feel sad. The important part about Brother Bear is every part in the movie."}, {"rating": "6", "text": "After the box-office failure of \"Treasure Planet,\" I wonder whether Brother Bear might not be the last traditional bit of Disney animation for a while."}, {"rating": "3", "text": "This is one of the examples of a \"forgettable, mediocre Disney flick\". Yes, I know it's for kids and the story needs to be kept simple, but that doesn't mean that you have to do a pretty by-the-numbers, formulaic, cookie-cutter story. The characters are underdeveloped and not fleshed out at all. The comedy was pretty bad and all because of the stupid moose characters. They are so unnecessary and added just for \"comedic\" relief. I didn't laugh once the entire movie. Did I cry at least? No, because the emotional moments felt pretty cheesy and didn't feel natural at all. Was I amazed by the music? Not at all. The score itself it's fine, I guess. It's pretty forgettable and just \"serviceable\". The songs are also pretty forgettable and just obnoxious. There was a moment in the movie were the characters were talking about something important that had the potential to be a powerful and devastating scene but then SAD PHIL COLINS SONG started playing. I was just like \"Turn it off I want to hear the damn conversation!!\". It is so obvious that they included Phil Colins songs to earn another Oscar nomination for Best Original Song (Well that didn't happen, so it was pointless. It's no coincidence that Phil Colins, as of 2020, hasn't composed songs for a Disney movie again). So this movie didn't make me feel anything. I'm not talking too much about the animation because at least the movie looks good and many backgrounds look great and highly detailed, but that doesn't make it a great movie or anything. Like I said, the story was fine, I guess, but the ending was so lame. I just didn't see why a certain character changed his motivation so easily. It felt so unrealistic and forced.Overall, this wasn't a terrible movie, but it's certainly one of Disney's weakest films. Don't be like \"Oh it's fine because it's for kids\" because there are better kids movies. Also I don't think children would enjoy this too much(? I personally didn't enjoy it as a kid but now that I see animation with different eyes I decided to give it a chance and I just watched it and I barely remember things about this movie. It's so forgettable and dull. It doesn't have relatable or charismatic characters, the comedy it's pretty lame, the emotional moments are lame, I don't know, I just don't see how can this movie be enjoyable for kids. I think they'll get bored too. Also I've seen that the people that, strangely, like this movie laud the \"message\" but I just don't see what this movie tried to say. Brotherhood? Maturity? How? None of those themes are communicated in a logical way or according to the character actions and the overall story. I don't know, this movie left me nothing."}, {"rating": "4", "text": "One of my childhood movies. Disney deals here with another different culture in human history. 'Brother Bear' is beautiful, inspiring, colorful and still a testament to the early days of 3D special effects (for better and for worse). Characters are as simple as the plot. Jokes are agreeable. Remarkable and iconic soundtrack, many thanks to Phil Collins. The credits scenes are just unforgettable. It's a shame they were compiled here because some of them just contained the best jokes of 'Brother Bear'.Unfortunately 'Brother Bear' is characterized by many flaws. There are too many moments where you wonder where this film wants to go. Many scenes are just useless despite this movie being surprisingly short. Characters are way too shallow: Kenai and his brothers have no parents, no family, no friends, no external social support, no other goal in life than revenge. And it goes the same way for Koda: no father, no friend, no depth. The only moments where the characters could have been deepened are skipped. In general the pace is really tricky. I realize that this movie has no real feminine powerful role which is rare for a Disney movie. Is it just because the movie title contains the word 'brother' and is about brotherhood? In the end all the plot is stuck between Kenai-Koda-Denahi without ever getting some fresh air until the end.I maintain that the morale (always search behind the appearances, respect nature, learn to forgive because the hate path only generates more violence and suffering, ...) is awesome, especially for kids. But wow, this movie could have done it in a way more simple and structured way."}, {"rating": "6", "text": "In a post-ice age Alaska, the local tribesmen believe all creatures are created through the Great Spirits, who are said to appear in the form of an aurora. A trio of brothers, Kenai, the youngest; Denahi, the middle; and Sitka, the eldest, return to their tribe in order to receive their totems, necklaces in the shapes of different animals. The particular animals they represent symbolize what they must achieve to call themselves men. Unlike Sitka, who gained the eagle of guidance, and Denahi, who gained the wolf of wisdom, Kenai receives the bear of love. He objects to his totem, stating that bears are thieves, and believes his point is made a fact when a Kodiak bear steals their basket of salmon. Kenai and his brothers pursue the bear, but a fight ends on top of a glacier, during which Sitka gives his life to save his brothers by dislodging the glacier, although the bear survives the fall. After Sitka's funeral, an enraged Kenai blames the bear for Sitka's death. He hunts down and chases the bear up onto a rocky cliff, fighting and eventually slaying it. The Spirits, represented by Sitka's spirit in the form of a bald eagle, show up and transform Kenai into a bear after the dead bear's body evaporates and joins them. Denahi arrives and, believing that Kenai was killed by the bear from earlier, vows to avenge Kenai by hunting it down.Kenai falls down some rapids, survives, and is healed by Tanana, the shaman of his tribe. She does not speak the bear language, but advises him to return to the mountain to find Sitka and be turned back to a human, but only when he atones for his actions; she vanishes without an explanation. Kenai quickly discovers that the wildlife can now speak to him, meeting a pair of moose brothers named Rutt and Tuke. He gets caught in a trap, but is freed by an outgoing bear cub named Koda. They make a deal: Kenai will escort Koda to an annual salmon run and then the cub will lead Kenai to the mountain. As the two eventually form a brother-like relationship, Koda reveals that his mother is missing. The two are hunted by Denahi, who is still determined to avenge Kenai, unaware that the bear he is pursuing is actually Kenai himself. Eventually, Kenai and Koda reach the salmon run, where a large number of bears live as a family, including the leader Tug. Kenai accepts his new surroundings and is comfortable living with the other bears. During a discussion among the bears, Koda tells a story about his mother recently fighting human hunters on a glacier, reminding Kenai of his and his brothers' fight with the bear that lead to Sitka's death and making him realize that the entire time, the bear he killed was Koda's mother herself.Horrified and traumatized at what he has done, Kenai runs away in a fit of guilt, but Koda soon follows him. Crestfallen, Kenai confesses the truth to Koda, who runs away, grief-stricken. An apologetic Kenai leaves to reach the mountain. Meanwhile, Rutt and Tuke, having had a falling-out, reform their brotherhood in front of Koda, encouraging him to forgive Kenai. On the mountain, Kenai is cornered by Denahi, but their battle is interrupted by Koda, who steals Denahi's spear. Kenai sacrifices himself for Koda, out of love, prompting Sitka to appear and turn him back into a human, much to Denahi and Koda's surprise. However, upon realizing that Koda needs him because of his own mistake, Kenai asks Sitka to transform him back into a bear with Denahi's support. Sitka complies, and Kenai is transformed back into a bear. Koda is reunited briefly with the spirit of his mother, before she and Sitka return to the Spirits. In the end, Kenai lives with the rest of the bears and gains his title as a man, through being a bear."}, {"rating": "0", "text": "This movie is extremely boring. It has boring characters and bland jokes. The songs are terrible and are very basic. Would never recommend."}, {"rating": "10", "text": "A wonderful movie for children and adults alike. I'm very impressed with the subject matter brought up here. Is 10/10 too high? Maybe, but I am trying to counteract the ridiculous \"0/10 THIS IS RACIST\" reviews."}, {"rating": "10", "text": "Le meilleur Disney de tous les temps, c'est évident !Une Histoire émouvante et touchante, d'un scénario original mais parfaitement réussi.Un 11/10 pr le coup"}], "recommendations": ["brave", "moana", "bambi", "finding_nemo", "the_secret_life_of_pets", "rise_of_the_guardians", "the_willoughbys", "the_good_dinosaur", "rio_2", "astro_boy", "the_land_before_time", "pocahontas", "the_boss_baby_christmas_bonus", "bolt", "the_iron_giant", "raya_and_the_last_dragon", "the_star", "onward", "big_hero_6", "shark_tale", "the_polar_express", "christopher_robin", "frozen_ii", "despicable_me", "the_road_to_el_dorado"]}