{
  "id": 2088,
  "title": "Bruce Almighty",
  "starring": [
    "Jim Carrey",
    "Morgan Freeman"
  ],
  "runtime": 101,
  "genre": [
    "Fantasy",
    "Comedy"
  ],
  "description": "Bruce Nolan toils as a 'human interest' television reporter in Buffalo, N.Y., but despite his high ratings and the love of his beautiful girlfriend, Bruce remains unfulfilled. At the end of the worst day in his life, he angrily ridicules God—and the Almighty responds, endowing Bruce with all of His divine powers.",
  "releaseYear": "2003",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/f0QqG14SZYYZcV4VWykVc5w13dz.jpg",
  "categories": {
    "plot": 5.6,
    "acting": 6.5,
    "ending": 6.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 6.0,
    "funny": 5.961538461538462,
    "action": 8.0
  },
  "reviews": [
    {
      "rating": "8",
      "text": "if you had all the power of god, what would you do with it? Jim Carrey is in his classic bag in this film. from cholos with monkeys in their asses, an asteroid coming to earth on command and the ability to walk on water. what can possibly go wrong? this was fun to watch."
    },
    {
      "rating": "7",
      "text": "This was a solid film. It was funny and kind of thought provoking. It is also a little bland though. Morgan Freeman is God as far as I am concerned, so he was cast perfectly."
    },
    {
      "rating": "7",
      "text": "----------------------------------7.4/10-----------------------------------"
    },
    {
      "rating": "10",
      "text": "This is one of the first Jim Carrey movies i watched! It will have a special place in my heart forever! One of the greatest movie experiences from my childhood!"
    },
    {
      "rating": "8",
      "text": "Like seriously this is one of his better films. These meh reviews over analysed this movie to hell. I'd give it a watch, its a fave int he movie comedy genre."
    },
    {
      "rating": "9",
      "text": "Finally someone remembered to do a movie that demonstrates what we all want when life does not go as we planned. It is a very successful film, both effects, histories and even comedy. I know there's a new movie, but I do not see as only the summary of the film could see how the film would be complete. But since now I'm talking about the Bruce Almighty, the story involves a little bit of everything, greed, anger, love, comedy, and it all mixed by a good director makes a beautiful piece like this."
    },
    {
      "rating": "7",
      "text": "This was a very funny movie, I watched it again recently and it still had its fun in it. The best part in the movie was when he used his powers to influence the news anchor into saying the wrong things and doing dumb things."
    },
    {
      "rating": "7",
      "text": "Bruce Almighty is a very funny movie. Of course any movie with Jim Carey is going to be hilarious. It mixes seriousness and humor pretty well. Well done."
    },
    {
      "rating": "9",
      "text": "A gem."
    },
    {
      "rating": "7",
      "text": "With great power, comes great power, especially when God is involved, with various theological accuracies and religious beliefs aside, 'Bruce Almighty' explores the power and responsibility that a higher being may possess, but in a comic manner of course, because Jim Carrey is leading the show in this supernatural comedy, where he plays a news reporter longing after the coveted anchor job, a job that goes to Evan (Steve Carell). Bruce has a breakdown and decides to take his anger out on the skies, namely God, who answers Bruce in the most unorthodox of ways, giving him all his powers and telling him to use them how he pleases. While the powers of God throughout the film bring excellent comedy and impressive visual gags like the part of the soup, clearly a direct reference to Moses, and others like pulling the moon closer or even the voice change for his rival Evan, it sometimes feels over-bearing when you realise a film is being made about powers that are truly limitless, so where do you even start with that. The true spark of the film rests on the  shoulders of Carrey and his energetic persona that he brings to most of his roles, it's difficult to imagine anyone else playing the role, and a deliberate pacing and subtle references to larger compromises in the film do make it a predictable in many parts, but strong performances from Carrey as the down on his luck news reporter, while is girlfriend Grace (Jennifer Aniston) is forever trying to keep Bruce grounded. Then we have God himself, played by none other than Morgan Freeman, who has many a philosophical tale to tell us and inspire the hoard as we watch, it's entertaining but also hold sentimental value, especially when the elegant and almighty voice of Freeman is saying it. The theme of it all really tries to test the selfishness of selflessness of the human psyche, how much would one person do before trying to help others if they has unlimited capabilities? Sure we might indulge a little but when it comes down to it, what would you do. But this is of course coming from a comedy angle, many will simply treat this has a quirky idea for a film, while others will see it as blasphemy for  treating the entity of God on such a comical way, but then again, laughter is the language of the soul, and while there are laughs to be had, it misses the mark when trying to be too serious and shifting its tone, while also focusing and relying to much on Jim Carrey's personality. But still an enjoyable and interesting idea all the same"
    },
    {
      "rating": "7",
      "text": "A funny little film that succeeds due to the combination of a manic Jim Carrey and a sweet and lovable Jen Aniston."
    },
    {
      "rating": "4",
      "text": "Bruce Almighty could very well be the one film where Jim Carrey gives everything he's got, making a character so over-the-top and goofy that it would go on to be one of his best performances. Not in my eyes. From the first few frames with Jim Carrey's character, I knew this endeavor may not go so well and, sure enough, I was correct. It has taken me a long time to warm to Carrey the same way I've warned to actors such as Jack Black, but his crazy personality is something that has left me quite annoyed in many of his films. Upon seeing it, I was a little disappointed by how bumbling and idiotic both him and Jeff Daniels were in Dumb and Dumber, yet the film now seems to be one of Carrey's stronger works when put under the same light as this film.\r To put it simply, this is a tired comedy exercise, unsuccessfully blending its religious premise with slapstick, and tacking on mawkish sentimentality making the last thirty minutes a gooey slog to watch. We follow Bruce Nolan (Jim Carrey), a second-rate reporter for a news station in Buffalo, New York, who has just lost an open anchoring positioning to Evan Baxter (Steve Carell), the conniving, smarmy man who loves one-upping Bruce. Frustrated and angry, Bruce throws a fit while interviewing people at Niagara Falls, costing him his job, which causes him to yell at his wife (Jennifer Aniston) and focus all his blame on God for shifting focus on him.\r Bruce then receives persistent pager messages from an unknown number, which he begins to ignore, until caving in and realizing that it requests him to go to a deserted warehouse to meet the one and only God (Morgan Freeman), who tells Bruce that keeping up with several pray requests and helping out so many in need is a difficult job that is often taken advantage of or underappreciated on the grandscale. He then gives Bruce his position, equipping him with all the divine powers (IE: walking on water and possessing the ability to accurately imitate people), and the unprecedented, unearthly responsibility of keeping those in touch with their faith happy and joyous.\r But before we get into the sentiment, let's explore the infinite comic possibilities of Jim Carrey being God. In the relative beginning of the film, to end off of Bruce's bad day at work, he is beaten up by a group of local thugs when he attempts to protect a harmless bum. When Bruce now possesses powers, he intimidates the thugs and the one thug makes some sort of comment involving \"monkeys flying out of his butt\" and you can bet your bottom dollar Bruce makes it happen in a ridiculously unfunny scene that channels the worst comic tendencies of a PG-13 screenplay. It too doesn't help that Bruce's character is an ungrateful man of little charm and so much zaniness that he induces a headache every time his mouth opens.\r There's Carrey's hyperactive tendencies, and just the obligatory fact that this story practically extracts every laugh and every tear (there will be audiences, quite possibly those who are religious, but not enough to where they can't laugh at the form of satire) with a premise that basically concocts this very anemic, tired tale of redemption and \"putting yourself in the shoes of the person you criticize.\"\r This is the third time director Tom Shadyac and Jim Carrey have collaborated on a film, with the first two being Ace Ventura: Pet Detective and Liar Liar. Both films expressed Carrey's style with the same rabble-rousing, uncontrolled behavior this one showcases, but with more of an emphasis on humor and spontaneous enjoyment rather than heavy-handed religious satire. I also learn it took three people to pen this story, Steve Koren, Mark O'Keefe, and Steve Oedekerk. One thing I could've guaranteed from the start, if I knew the writers, was a nice emotional third act, which Koren churned out to his advantage in Click but in a too little, too late fashion in A Thousand Words. Those films centered Adam Sandler and Eddie Murphy, respectively, in their madness, where this one victimizes Jim Carrey showing that he can be funny, if taken in smaller doses.\r Yet I can see devoted fans of Carrey's anarchic comedy embracing this film with an open mind and a willingness to laugh. There's a larger audience for this film than I can estimate, yet in the small world of satirical comedies with religion in their crosshairs, I can assume why studios aren't cranking out more of them, and I don't believe controversy is the prime reason.\r Starring: Jim Carrey, Morgan Freeman, Jennifer Aniston, and Philip Baker Hall. Directed by: Tom Shadyac."
    },
    {
      "rating": "6",
      "text": "why do you hate me..Bruce AlmightyFinally, Jim gets what he deserves; enough range for him to flex and flaunt his comic skills but unfortunately Bruce Almighty only feeds on its lead character."
    },
    {
      "rating": "5",
      "text": "It's not terrible but not amazing it's script is jumpy in certain places  ."
    },
    {
      "rating": "8",
      "text": "When I watch this I laugh all the time! It's really funny. I'm not too sure about Jennifer Aniston though but Jim Carrey is at his best. To me it's a classic."
    },
    {
      "rating": "4",
      "text": "The premise of Bruce Almighty is a notable one. There's plenty of potential here, especially with Jennifer Aniston at the top of her game. But the film would've succeeded much more with the loss of Jim Carrey entirely."
    },
    {
      "rating": "8",
      "text": "I'm a big Jim Carrey fan and this is up there as one of his very good films, and while not his best its still certainly very funny! As long as not taken too seriously you can kick back and really enjoy it, and it will obviously help if you're a Carrey fan yourself. It's also quite a clever concept never really tried before and while it could offend some I'm sure most wouldn't look into it too much and will see the lighter side to it, so if you haven't seen it check it out"
    },
    {
      "rating": "10",
      "text": "For some reason this is my favourite movie in the world  I watch it over and over again without getting bored. First of all there's the extremely talented Jim Carrey who never ceases to spread uncontrollable laughter. However  his collaboration with the legendary Morgan Freeman makes this a million times better than his other films. The choice of him as God is so convincing that i actually BELIEVE in Morgan Freeman now. If you want to have a good time with your friends this is the movie for you! One does not simply dislike the Carrey comedy..."
    },
    {
      "rating": "5",
      "text": "Jim Carrey and Morgan Freeman make a delightful-to-watch duo this comedic farce. Sad to say, without them, the movie would have fallen flat on the ground, as flat and dull as a sheet of white paper. The script is sloppy, as is the entire movie, when looking from the larger perspective. Carrey and Morgan save this movie from disaster, as evidenced by the box office success."
    },
    {
      "rating": "8",
      "text": "Jim Carrey is a really funny and good actor and he proves it in this amazing comedy.With Jim Carrey,Jennifer Aniston and Morgan Freeman,you can only have a great comedy.There is a lot of good moments and the acting from all the actors is pretty good.I highly recommend the movie."
    },
    {
      "rating": "6",
      "text": "Though Jim Carrey and Morgan Freeman are always welcome and the effects are impressive, \"Bruce Almighty\" is not nearly as satisfying as many comedy movies are."
    },
    {
      "rating": "10",
      "text": "This is great movie people search this movie in Hindi and Urdu here i found a website for this.\rhttp://www.mash.pk/bruce-almighty-in-hindi-full-movie-watch-online/"
    },
    {
      "rating": "4",
      "text": "It's not that I wanted to get flamed for this, but literally, everything you see in Bruce Almighty is either messed up, doesn't make sense at all, or a mix of both."
    },
    {
      "rating": "4",
      "text": "A funny movie that will get you laughing and is full of Jim Carrey antics and comedy. As a child, I enjoyed the movie but I didn't remember much beyond that I had watched it. Upon rewatching it as an adult, it was a good laugh but nothing amazing. Great for all ages and a good family movie."
    },
    {
      "rating": "8",
      "text": "This is one of the most iconic comedies of the turn of the century, and it's probably Jim Carrey's most notable work, along with \"Lyar Lyar\" and \"Ace Ventura\". The movie revolves around Bruce, an ordinary man who suddenly receives from God all the divine powers while the Creator himself is allegedly on vacation. It could only end in a great mess. Jim Carrey was at his best, and is truly the pillar of the film, with jokes of all kinds and for all tastes. I think his comic vein has had a great influence in the direction of the script, and I do not rule out the hypothesis that some of the jokes have come out on the spur of the moment. Veteran Morgan Freeman has played God, and it's delightful to see the laid-back, positive way he looks at Carrey with a great sense of humor. Both are great actors, but the truth is that we are so used to seeing Freeman in action movies or \"Seven\", just to give an example) that we are very pleasantly surprised whenever we see the actor in a more relaxed, As is the case with this film. The story, the script itself, is very good. It's that kind of movie that seeks to convey a positive message to you while it makes you laugh. It talks about how we can have a positive attitude towards the problems of our life, and that usually what comes easy is easily lost.Good movies with uplifting and truly human messages are increasingly a rarity nowadays. Therefore, I commend the work developed in this film, which educates besides amusing the whole family."
    },
    {
      "rating": "5",
      "text": "Jim Carey brilliantly stars in this likeable comedy about growth, but is unfortunately formulaic and the protagonist is at times unlikeable."
    },
    {
      "rating": "10",
      "text": "Another one of my favorite movies of all time. Jim Carey is one of my favorite actors. This movie is so funny. Who doesn't want to play God. I know would love to give it a shot if it was possible."
    },
    {
      "rating": "10",
      "text": "This will always be one of my top 10 favourite movies of all times. It has 2 legendary actors in it (Jim Carrey and Morgan Freeman) and one legendary actress, (Jennifer Aniston). You can't go wrong with that. Stories great and it's absolutely hilarious."
    }
  ]
}