{"id": 1131, "title": "Bumblebee", "starring": ["Hailee Steinfeld", "John Cena"], "runtime": 113, "genre": ["Action", "Adventure", "Science Fiction"], "description": "On the run in the year 1987, Bumblebee finds refuge in a junkyard in a small Californian beach town. Charlie, on the cusp of turning 18 and trying to find her place in the world, discovers Bumblebee, battle-scarred and broken.  When Charlie revives him, she quickly learns this is no ordinary yellow VW bug.", "releaseYear": "2018", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/fw02ONlDhrYjTSZV8XO6hhU3ds3.jpg", "categories": {"plot": 5.862745098039215, "acting": 6.5, "ending": 7.0, "soundtrack": 5.75, "cinematography": 7.0, "familyFriendly": 5.5, "funny": 5.75, "action": 6.4}, "reviews": [{"rating": "10", "text": "Bumblebee does the Transformers license a great justice as it brings the series back in a very different light, yet doesn't completely close itself off from creating an epic set of sequels to come. This was the perfect way for Knight to test the waters and sample this new look and feel to transformers and leaves all doors open for however they would wish to continue this series. It was a more personal story than any of the other movies in the series, but doesn't tie itself down with that. These producers and writers could even take the franchise in a more Marvel direction and make more films centered around one character, and bring them together in a major film, and based on the way that this film was presented, that style of presentation could really work for this franchise.    Overall, Bumblebee does everything that this series needed and tells a more down to earth story, while still carrying the epic proportions that Transformers always has. This may not be the most epic film in the series, but it is definitely the best and if they continue to run the series like this, Transformers fans have a lot of great films to look forward to."}, {"rating": "6", "text": "Good action scenes, a seventies feel, just not quite interesting enough story-wise and too predictable to really grab your attention."}, {"rating": "6", "text": "There are moments in here that shine as the Transformers movie fans of the cartoon series have been waiting for. And parts play out like “E.T.” or other 80s films. It’s pretty fun, pretty forgettable but a scent start if they’re rebooting the series..."}, {"rating": "5", "text": "Just kind of mehIt is not a bad film, but certainly not good. By far the best transformer film (although that is not saying much) If you see at the cinema then great, if you don't you haven't missed anything."}, {"rating": "6", "text": "Reminds us that yellow cars are the best cars, and that 80s music is the best music.  The gag at the end is a great ending, lol.Other than that... pretty silly stuff! As an adult I really shouldn't be wasting my time.  A kids movie."}, {"rating": "6", "text": "The story is nothing new and follows a pretty standard formula for origin/coming of age stories. It's predictable in every way, but I will admit that it's well done. The action is solid, and Hailee Steinfeld is great. Some of the comedy works, some of it doesn't, but even the jokes that don't land aren't as cringey as Michael Bay's Transformers films. I think that if they can build on what they've established in this film, Transformers may become the beloved franchise it was always meant to be."}, {"rating": "1", "text": "Terrible.  This was so boring and I feel like I got tricked into just another teen/pre-teen love story/drama.  Hardly any action and they might as well just change the title to the Girl's name and also featuring Herbie the Love Bee... Even my wife was bored throughout the entire movie.  Her movie taste ranges from both Michael Baysplosion movies and chick flicks which is all you need to know.  We stayed because we had ordered food at the Alamo Draft House but would have left if this was just a regular theater.  Wait for Netflix to foot the bill, you'll thank me later."}, {"rating": "5", "text": "Noticeably better than the Transformers movies that have recently released but it still ended up being forgettable in the end. I can't imagine why better direction couldn't be secured for this film and why John Cena has to be cast in a serious role. Love the guy but unless he has excellent direction I don't think he has much range of any kind outside of comedic-style roles."}, {"rating": "8", "text": "The best Transformer movie since the first one, the 80s throwback is a warm welcome.Everything is relatively as you'd expect, the story is nothing special but on a whole its a really enjoyable family friendly movie.The only downer was the generic Decepticons, they should've used more well known characters as the antagonists."}, {"rating": "9", "text": "Best since the first Transformers(2007)-simple,but interesting story,awesome action scenes on Cybertron and great main characters!Poorly that Decepticons still a cliche villains"}, {"rating": "8", "text": "Without Michael Bay as director, it makes a huge difference. The plot has the luxury of combining action with comedy and nostalgia for the 80s in a fluid way without overdoing it. As weekend entertainment, it works and very well."}, {"rating": "3", "text": "all the previous transformer movies were horrible, but they were filled with action filled scenes and CGI. this movie lacks everything. very boring story line. very predictable story line and everything else is also lackluster...even my kids said the movie is boring. not sure why it got some much hype, glad i did not waste money at the theater and waited for the DVD. even renting a DVD is waste."}, {"rating": "9", "text": "*Insert generic witty comment about this film being more than meets the eye*"}, {"rating": "3", "text": "If you are an adult, expecting a good spin-off, and not planning to watch with your family (especially kids), better stay away from this one, the only good things in this movie are Jon Cena and Hailee Steinfeld (the female lead), such a waste of talents"}, {"rating": "2", "text": "Pure garbage! Terrible character actors selections. The story, which should be bumblebee's backstory didnt really like one since it was not focused on him. The plot holes of this movie are also horrendous. One example is how did the trash bin where the MC is hiding didnt explode when it got hit by a MISSILE!! A **** missile and it only left a dent. HORRIBLE. The villains are also plain as a piece of paper without writing or anything. Didnt really feel like villains especially John Cena. His a dialogue and character are total joke. Ugh. Dont recommend this **** I bet all of us can make a better story than this one.2/10"}, {"rating": "2", "text": "Mediocre acting all around. When the CGi out acts you, you know you have a problem. Paint by numbers movie. Considered a soft reboot of Transformers 1. We already saw a semi Bumblebee origin story in TF1. Worth seeing only if you get it for free but not even worth picking up from the Bargain Bin."}, {"rating": "1", "text": "This is a movie for children or to be specific for girls. The plot makes no sense the whole movie feels like a bunch of random events. White men are bad of course and all white girls should go for color. Bumblebee behaves like some abused dog, hiding in the corner minding eye contact, needs to be petted by the girl. Its not funny or serious. I really think if they would include animated characters like Bugs Bunny or Donald Duck it would be better, funnier. Like Bugs and Donald would sit in the back of the Beetle and throw eggs and toilet paper together with the main characters. The girl was pretty so I give it a 1."}, {"rating": "9", "text": "It's not perfect, but it doesn't need to be. Bumblebee absolutely steels the show, his animation is the best anthropomorphization I've seen since WALL-E. The dialogue and pacing are the only detailed things that are lacking. Besides that this is a must see that even brought a tear or two to my eyes."}, {"rating": "5", "text": "This film does not deserve the rating its getting.  Its ordinary and it has no big surprises.  Provides almost enough entertainment and very forgettable."}, {"rating": "4", "text": "I've always found the Transformers franchise to be so mind-numbingly ridiculous, that I initially had no desire to see this once I found out about it. However, when it started receiving some of the best reviews of the franchise, I gave in and decided to give it a go... Ya I pretty much regret that. While it's nowhere near as over-the-top and ridiculous as the rest of the Transformers franchise, it's still pretty ridiculous, and like the rest of the films, it's attempts at humor are forced and cringeworthy at best. The story also felt lacking and uninspired. A kid or teen befriending an alien or robot that can do great things and trying to a hide it from the government... Ya like we haven't seen that before enough times already. The action is decent enough in some moments, but not enough to really make up for the rest of the film's clumsiness and weak story, and the acting just isn't that great, as expected from this franchise by now for me (not even Hailee Steinfeld or John Cena we're able to make it worthwhile.) Overall, while I will admit it does have a lot more heart than the previous Transformers films, at the end of the day, it's still loud and dumb in my book and fails in its handful of attempts to bring in some humor."}, {"rating": "5", "text": "This film started out really well with the transformer battle and setting up bumblebee's story of why  he went to earth. The earth part was ok as well in the beginning with the cliche angry teen girl's story with finding bumblebee although it made no sense that he would be sitting all dilapidated in a wrecking yard and why if the transformers just discovered earth would they pick a car to emulate at all? About a third of the way thru though the producers seemed to wake up and remember that they  were making a teen film though so he changes the tone completely by bringing in a bf for the girl and having a bunch of silly cliche bonding scenes of bumblebee and the girl/boy.The evil decepticons sent to kill bb were pretty fun and the scenes with the military were decent.This film would be really good for the 8-16 yr old crowd but not so much for adults."}, {"rating": "7", "text": "Bumblee was a breath of fresh air this franchise needed. Still not sure if this movie was great or just good because I'm comparing it to the last 4. Anyways I enjoyed it and hopefully, it's only up from here."}, {"rating": "6", "text": "Good try. It was good to see Bumblebee like this. I can see that this movie really tried to be like E.T. but I don't know it succeeded. Still, it's the best movie in the Transformers franchise."}, {"rating": "7", "text": "'Bumblebee' is probably the best 'Transformer' movie out there. That alone doesn't say much, but the film had probably some of the most heartfelt chemistry between an actor and a CGI character. Steinfeld measures up to the lead role, and all the supporting roles have a moment or two during this ride. No masterpiece, but that's not what we were looking for here. It's a warm sci-fi action comedy-drama and more worthy of a sequel than any other 'Transformers' film. At least I'm expecting something worth the ticket."}, {"rating": "7", "text": "After 5 equally jarring Transformers movies, Michael Bay (finally) passed the baton to Travis Knight. Bay's franchise had nowhere to go but up, yet Bumblebee comes in to reboot the franchise and inject it with a soul all of its own. Bumblebee is a heartwarming tale of growing up in an unfamiliar and hostile setting."}, {"rating": "6", "text": "6.4/10"}, {"rating": "3", "text": "A friend convinced me to see this because it steps outside of the Transformers formula. I applaud the creators for that but I was not expecting a teen-girl-getting-past-tragedy movie. I imagine that it might resonate with some people, teens perhaps, but it did not work for me. I was ready to leave about halfway through the movie.I was also bothered by the portrayal of Bumblebee as a bumbling half-wit pet throughout the film, when he is supposed to be an elite rebel fighter and a real \"person\" with intelligence."}, {"rating": "4", "text": "The plot and writing couldn't be any duller, no depth. This is a simple movie targeted to middle school schoolers who watch the Transformers series. Special effects are top notch, but that's not enough to make a great movie. For a kid movie, fine. But this wasn't the movie for me. Caveat: I don't think I've seen any other Transformer movie."}, {"rating": "2", "text": "What the movie did right was bring it back to basics and break the needlessly complicated story that Transformers was trying to create (especially with the Last Knight). What it did wrong was everything else.There were bits of humour throughout, a few typical fight scenes that didn't really bring any excitement and a rather weak origin story that lacks depth and a solid villain. It's essentially a rather bare soft reboot to a failing franchise and while it's not as terrible as previous entries, It doesn't do enough to warrant any praise. It doesn't even break the mediocrity that the franchise has been bringing for years and that is this film's biggest failure IMO. And while I feel odd saying this, John Cena was the best part of the movie despite barely being in it. I think it was a big mistake not to feature him more due to his natural charisma and popularity."}, {"rating": "6", "text": "It was pretty good, kinda corny. Need to bring back Megan Fox and others.I think some moviegoers aren't really into an interracial relationship. Nobody wants to see a kid vomiting in the car, that kinda gross. I love Transformers...  but the sequel is kinda running out of good ideas. About bad robots want to destroy the Earth. Sigh."}, {"rating": "1", "text": "Teen love story and robots basically, for the kids, brought my father to see a transformers for his first time ever, and his last. Maybe the 3D glasses ruined it, oh and the plot holes for instance- transformers are jets, dogs, boomboxes, semi trucks etc..on their home planet before ever hearing of earth"}, {"rating": "1", "text": "The expectation was to know Bumblebee, but this was hardly about him. The story story is centred around the Teenage girl and her personal issues. Minimal action and Bumblebee's dark side and warrior history is also not shown. Did not meet expectations at all."}, {"rating": "2", "text": "Man what a stinker. Like a cheesey lifetime original. Not at all what I was expecting and not enjoyable. Way too long."}, {"rating": "2", "text": "the music was great, best songs of the that period but the movie was uneven and often just stupid.  when the girl gets the VW, as a self gift on her birthday and the next morning her mom uses it to take their dog to the vet without asking her,  then i knew the movie was dumb. it was uneven with other scenes that didnt make sense or insulted intelligence. the lead girl was excellent and the transformer was also kind of good but at no point did the girl mention to B that excess and destroying things was a no no. a movie maybe for 12 year olds? or maybe 6 or 7 year olds? sorry, dont mean to insult these kids. i can watch and enjoy dumb movies too but this movie was not for me ."}, {"rating": "1", "text": "\"I like the way they pop.\".( 17/100 ).Con un indignante 66 en Metacritic, un grosero 94 en Rotten Tomatoes y mi ilusividad, me dirigí al cine a ver la peor película que he visto en el año. Ni siquiera superó a Early Man, a la que tenía peor calificada hasta ahorita.Bumblebee, que trata sobre el origen del héroe más adorado de la linea de Transformers, realmente habla sobre como se adapta al planeta tierra, un lugar en donde somos hostiles con las cosas que no conocemos.La película es demasiado melodramática, con un personaje central que respeta el estereotipo de una persona rebelde y deprimida, con una familia disfuncional y que llama la atención de chicos nerds que se convertirán, \"accidentalmente\", en sus mejores acompañantes. Hailee Steinfeld no actúa mal y es muy bonita, pero el guión con el que está trabajando simplemente me ha dado una muy mala impresión. La recuerdo un poco en True Grit, por Ethan Coen y Joel Coen y su actuación fue justa y prometedora, pero saltar de ahí a Bumblebee es un mal camino para estudiar su trayectoria.Bumblebee es melodramática, casi telenovelesca, tonta, absurda, exagerada, inútil, incoherente, ilógica y, sorprendentemente, también incómoda. El personaje principal está destinada, desde el principio, a ganar y aprender a vencer las excusas que la historia le interpone, asimismo se refleja en su complañero Autobot para enseñarle lo que ella misma tiene que aprender y, así, mostrarse como una mujer fuerte e independiente cuyo cabello se balancee al rimo del viento de la puesta del sol en el horizonte. Se necesitaría muy poca inteligencia emocional para disfrutarla plenamente, pues el sentimentalismo se fuerza demasiado en el público.Me aburrí demasiado rápido esperando una sorpresa cinematográfica, pero ni visualmente es sostenible. Las secuencias de pelea y acción no está justificadas la mayoría de las veces, los efectos visuales son una copia y pega del cine de Michael Bay y los efectos especiales no son dinámicos ni creativos, solo construyen escenas sin estética, atractivo o intriga.Lo que más me molestó fue la carga épica que le dan a John Cena. Se la pasa hablando con frases que lo tratan de hacer ver rudo, despiadado y fuerte, pero sin un contexto suficientemente solido como para enaltecerlo. Entonces solo se ve absurdo y en el momento dado se vuelve en amigo porque, pues, aquello que quería matar lo salvó.Bumblebee es un ejercicio que se anula a sí mismo y te impulsará a salir de la sala inmediatamente o a aplaudir las hazañas de un golpe mercadotécnico cuyo valor artístico, repito, es nulo. Hay gente a la que le ha agradado esta experiencia, pero considero que están realizando una mala comparación. Trasformers jamás ha sido un proyecto de valoración, sino una campaña de mercado, y no porque Bumblebee sea la campaña mejor realizada de la saga significa que merece ser reconocida. Separar el reciclaje industrial de Bumblebee de la saga es como decir que una Oreo sabe mejor que las demás solo porque es gratis. Lo dije en mi reseña de Aquaman: cualquier futuro film bajo cualquier estereotipo narrativo de acción, será una vergüenza. Y Bumblebee no solo es una vergüenza, sino una tristeza enorme. Entiendo que es cine infantil y que la acción y narrativa trata de apelar a aquellos cuya experiencia en el cine sea joven, sin embargo, esa juventud tiene la oportunidad de crecer con parámetros narrativos que apelen a la innovación, a lo inteligente y, mínimo, razonable. Pero si se continua promoviendo este cine, solo estamos promoviendo un vicio idiotico en el que la sociedad se puede estancar narrativamente con presupuestos que pueden ser usados para historias de mayor impacto.Mi mayor tristeza reside en el director, quien decidió participar en éste proyecto y manchar un poco su muy corta carrera. Travis Knight, quien fue el Lead Animator en películas de calidad indudable como Caroline (2009), ParaNorman (2012), The Boxtrolls (2014) y director de Kubo And The Two Strings ha provocado que me mantenga al margen de sus intenciones o aspiraciones.Perdón por extenderme demasiado, pasa a veces cuando me molesto."}, {"rating": "0", "text": "Empty, vapid movie that dumb people who watch Lifetime or Hallmark will love.  Nothing new here, full of cliches, full of borderline terrible acting, and it still has nothing transformers about it.  If you want to watch this movie for free, turn on Lifetime movie network or Nick Jr.  When they understand bumblebee isn't a mute insect they will have a start."}, {"rating": "10", "text": "An absolute spectacle and visual treat like no other! Bumblebee was a surprise hit and and a charming heartfelt adventure. Though it's a \"Transformers\" movie, it feels and looks nothing like the Michael Bay films we've known in the past. Bumblebee fixes and just about erases what Michael Bay did to the Transformers franchise, and does it justice properly. The action scenes and CGI are still incredible, the characters are actually likable, and it's a movie that appeals and entertains both kids and adults. This is the Transformers movie we all deserved and got, and enjoyed very much!"}, {"rating": "1", "text": "Um im Vorhinein festzulegen. Die Transformer Reihe war nie wirklich eine gute, aber mindestens hat sie unterhalten, zumindest wenn man mit den Gedanken hingeht nicht viel nachzudenken zu müssen und sich das Hirn wegblasen zu lassen durch die typischen Michael Bay Explosionen. Sie haben hauptsächlich viel falsch gemacht und dieser Film gesellt sich dazu als schlechtester Film der Reihe. Ich wurde leider nicht unterhalten. Im Gegenteil, ich bin sogar mit einem schlechten Gefühl herausgegangen von erzwungenen \"Momenten\" , die einfach nicht da waren. Von clichéhaften und nicht glaubwürdigen Charakteren, die , so scheint mir, bewusst karikiert wurden bis zu einer langweiligen Geschichte, die tatsächlich versucht sich ernst zu nehmen und scheitert.Sozialbehaftete  Kritikpunkte der letzten filmen waren die Glorifizierung alter männlicher \"Vorbilder\" und die Übersexualisierung der Frau, die Hand und Fuß hat und tatsächlich zu kritisieren sind. Dieses Mal wird das typische Narrativ der Aktualität, selbstbewusste starke Frau,schusseliger männlicher Sidekick bis aufs Äußerste gereizt und kommt ebenfalls nicht an. Die gleichen Fehler nur anders herum. Am Ende bleibt ein Film, der in Vergessenheit geraten wird und meine verschwendete Zeit, die ich nicht mehr zurückbekommen werde. Nicht empfehlenswert"}, {"rating": "7", "text": "This origin story details how the Transformers ended up on Earth. The first to arrive took the form of a yellow VW bug. Hailee Steinfeld plays the frustrated teen (with convenient mechanical skills) who repairs and befriends him. This approach feels more like \"The Love Bug\" than it does the previous more robotic iterations. The visual effects make him and the transitions seem much more convincingly real. He's scrappy (literally, you can see various car parts on his transformed body), but with a sweet personality. Director Travis Knight, who's had previous success with 3 animated films, has brought his skills to add humanity, humor and warmth to what feels more like Disney's version of the franchise. NOTE: Stay thru the short credits for one final bit."}, {"rating": "7", "text": "Bumblebee is a good film for the Transformer. It's up there with the first one. They limited the number of bots on screen and remove all those useless characters. The story is more emotional and more focused. The action are well controlled and quite frankly, a step forward to the M. Bay's explosions and debris festival. I give it a 72% because some of the acting weren't always sharp, but the rest of the film is surprisingly good."}, {"rating": "10", "text": "This movie is clearly better than the previous Transformers movies, honestly. Hailee Steinfeld plays so beautifully and John Cena was built like a brick house. The only thing I like about this film is the G1 Transformers robots that we all know and love. This movie is great, and I am definitely getting it on Blu-Ray!!"}, {"rating": "6", "text": "So I wasn't even planning on seeing this one, as \"Transformers: Age of Extinction\" left an extremely bad taste in my mouth, but since I was invited to watch this film and the reviews were mostly positive, I thought to myself: \"Uh, maybe it'll be fun\". And it is, but it's also not a particularly engaging movie, unfortunately. I'm not a Transformers fan. I didn't bother to watch the 1986 animated feature. Quite honestly, I never liked the idea of seeing talking robots in the big screen as it feels as though it's just a long toy commercial. No substance or anything. Plus, the Michael Bay movies only made matters worse, as those movies are incomprehensible, pointless and borderline offensive.With that being said, I still went into the theater expecting to see a good film. It wasn't directed by Bay, so it oughta be good. Good? No. Decent? Yes. I don't want to say I didn't have fun watching this movie. It certainly was entertaining for the most part. But it wasn't quite the game-changer it could have been. Mostly because of its unoriginal premise, some of the acting performances and cheesy plot elements. Now, the plot isn't exactly the most imaginative of all. Like critics and moviegoers have said, this film largely feels like an E.T. ripoff. This seems like something that would bring my score down a notch, but I honestly feel that although this movie was clichéd in some places, I think the characters' dynamic mostly made it up for it. There was solid chemistry between Charlie and Bumblebee and in fact, it might be the best thing this movie has to offer. Besides that, we have action sequences and while they are not especially memorable, I'm glad I can praise them simply because how much it differs from Bay's nonsensical directing style. There are no shaky cameras, no annoying lens flare or quick cuts. No disgusting yellowish color palette. The framing and shot composition are not extraordinary, but they are an improvement over the last 5 Transformers films' cinematography. While this movie boasts a more appealing look, it struggles a lot with narrative aspects. Without getting into spoiler-territory, the movie can sometimes make you question how and why things are happening. The military scenes are dumb and bear a resemblance to similar scenes in previous movies. Frankly, I couldn't take John Cena's character seriously and I feel like he was just there to provide another reason for people to see this movie. Another point that dragged me down was the humor. Maybe it's just me, but it seems that a lot of big blockbuster movies are trying very hard to make their audience laugh their asses off. I say this because the humorous scenes of the movie weren't exactly humorous, in my opinion. That happened because the jokes were very forced and poorly thought-out. Worse than that, they were unoriginal. Best case scenario, I chuckled a little bit. Worst case scenario, I cringed very hard. Another minor issue I had with the film is the main character's internal conflict (Charlie). Nothing wrong with the message itself, it's just that the writers could have found a better, more subtle way to show how Charlie goes from \"being scared **** of diving into the pool\" to \"splash!\".This movie is not bad. But for anyone who's looking for a substantial experience, you should lower your expectations.6/10."}, {"rating": "7", "text": "Bumblebee is the best Transformer movie ever made and while that's not saying much, director Travis Knight simplifies the story humanizes the Bumblebee just right and makes you care for the human characters. Not everything works in this film, but from the great 80's soundtrack to that terrific beginning scene, this is a solid piece of entertainment and sends a signal to keep Bay's hands away in the future. Overall a high 7 a B+."}, {"rating": "9", "text": "Best Transformers movie yet! Hoping for a sequel. PLEASE NO MORE MICHAEL BAY! KEEP HIM AWAY!"}, {"rating": "8", "text": "The rebirth of a franchise that finds gold in regression.I can say with absolute conviction that this is easily the best \"Transformers\" movie to date.Considering those responsible for such remarkable production, you could never picture the dazzling, moving end product. Bay, hated and loved equally, comes back, but just as a producer, which denotes a good, significant step up. An act of redemption by screenwriter Christina Hodson, guilty of shamefully careless screenplays such as \"Unforgettable\" by Denise Di Novi or \"Shut In\" by Farren Blackburn. Director Travis Knight is a wholly different story; nominated twice for the Academy Award for Best Animated Feature for the lyrical stop-motion feats \"Kubo and the Two Strings\" and \"The Boxtrolls.\" American singer Hailee Steinfeld has shaped an acting career brimming with victories, with an Oscar nomination for her practically flawless performance as Mattie Ross in Coen Brothers' \"True Grit\" and one Golden Globe for her unique Nadine in \"The Edge of Seventeen,\" my favorite coming of age film— Bo Burnham's highly praised \"Eighth Grade\" is still waiting in my bucket list. — These are the heterogeneous ingredients of a film that surprises not only for its tonal metamorphosis with respect to its predecessors, but the heart, vigor, and simplicity the film uses to weave its story. \"Bumblebee\" is a nostalgia-driven adventure of unsuspected narrative force, focusing on ever-present themes that movies don't get tired of digging into and, why not, mixing up such as friendship, adolescence and growing up with a doubtless 80s flavor, a time the film takes advantage of. Setting it somewhere between the most fantastic John Carpenter, \"Stripes,\" The Smiths and A-ha is the right time to get rid of any dispensable hassle, going back to basics and staying there, it's just Charlie and the 1967 Volkswagen Beetle in a survival race; zero Bayhem. The film takes its time to set up the underpinnings and to present our heroine's dramatic arch. She lives among abandoned vehicles, car relics, and teenager gloom; on her birthday, she ends up acquiring a beat-up, tiny yellow car, a vehicle that becomes her confidant, her bestie. We've already heard this story a thousand times, but let's face it: no one on planet Earth can resist clever, poignant feel-good movies, no matter time, place or mood, this always enjoyable sub-genre will get followers. Besides, due to Mr. Bay's pyrotechnic filmmaking, it was exciting to imagine such a story starring Bumblebee, in the 80s. The final result couldn't be better. Charlie receives a careful treatment, unfolding her wounds and trying to heal them so honestly that the most dramatic moments are painfully stabbing.  Bumblebee receives a dignified narrative background as well: he and his species are being hunted by a pair of Decepticons, which allows displaying the high-sounding, better-handled action sequences with finesse. The funniest, most emotional, tender character-driven moments take place in the first forty-five minutes of footage. The story points at the big finale alongside, via small doses of the trademark complicated, sometimes unintelligible terminology and chronology. The set-pieces, as opposed to those of its predecessors, like the film itself, are much more restrained and compelling, not so groovy or showy because of a realism beautifully rendered with impressive digital effects that, even without high-resolution IMAX screens, endows action sequences with humanizing character. There is a good lack of predictability threatening to eliminate core characters just mid-story through unexpectedly raw images that kids will struggle to bear, excluding PG-13 carnage, a handful of murders amusingly reduced to plasma. Certain continuity, pace and editing errors should be attributed to editor Paul Rubell, however, as a coherent whole, it is a resonant, overly enjoyable popcorn film.   Technically and artistically speaking, it's excellently made, the camera moves with finesse and puts special focus on the development scenes like this saga had never seen before, holding their feelings and tones and throwing them to the viewer; it's praiseworthy that every scene gets a precise treatment which justifies its place in the footage.  The '80s references and easter-eggs are juicy and countless both physically and spiritually.\"Bumblebee\" by Travis Knight gives life and hope to a franchise in its death throes through Steinfeld's charming, sincere performance, the heart of a script based on friendship and forgiveness, and the emotional narrative control that Travis stamps in all his movies. Without warning, the \"Transformers\" film franchise rises from the ashes, and despite its post-credits scene suggests a risky return formalized by Paramount Pictures' brand-new measures, it's better we rejoice now in the candor and simplicity of a film jam-packed with underlying shrewdness."}, {"rating": "8", "text": "This movie improves on what little positive attributes the Michael Bay-formers movies had, and completely scrap all that was bad.The music is nostalgic af, the robots distinguishable from one another, the camera steady during battles, and they completely ditched the inappropriate jokes. This means that for once, people actually laughed ~out loud~ at the cinema.It's not the best movie ever, but it's a solid foundation for possible sequels. And it brought back G1 toys, which I appreciate oh so much."}, {"rating": "8", "text": "This was a fun movie. I found there were some logistical story issues, but this is Transformers after all. Bumblebee and the main character were a joy to watch. They captured the 90's feel."}, {"rating": "8", "text": "This is the best Transformers movie so far! This movie feels like what the original cartoon was. It does not need any lame jokes to carry it, unlike the past movies needed. Action was fun, and you can tell they took some of that action from the 1984 show. The characters were fun, a huge improvement from the other films. They felt real. It is a film I would recommend to see!"}, {"rating": "8", "text": "Transformers found its allspark after all. With director Travis Knight and writer Christina Hodson, Bumblebee is the first Transformers film that has a tangible plot that’s not lost in the CGI shuffle. The film is grounded and greatly benefits form a more character driven approach versus the spectacle CGI rat salad from the previous films. It’s very remisicnent of classic Amblin films. There’s so much heart and passion in this film and it actually takes the time to develop the characters. That’s the key to great filmmaking."}, {"rating": "10", "text": "Wow! what a difference from the other transformer movies. Excellent Movie! I've been really tired of these movies being just about :Cool robots that transform, explosions, sex, and models from victoria's secret that serve no purpose in the film other than to look pretty and lust after.Drives me crazy!!!! Transformer movies should be a kids movie!!! That doesn't mean adults wont enjoy it (star wars for example is a kids movie- Not saying this is like star wars- I'm just saying its was designed to be a kids film and they finally went that route with Bumblebee). All ages can enjoy this movie.All my complaints that I had for the other transformer movies are taken care of in this movie- here's the break down:THE INTRO WAS AWESOME! I think its what we all wanted to see since the very beginning of the franchise! The intro should always in my opinion get you hooked into the story within the first 10-15 minutes. This does just that.Story: Story telling is better than the other movies. ( which tells you Michael Bay didn't direct it). It's family friendly and light hearted thanks to Travis Knight which I think is a very good thing. I think Christina Hodson did a good job writing this script.Plot: Great, doesn't feel too much cliche in my opinion.Character development: excellent! you actually care about the girl main character on her journey in this film. it even gets emotional in my opinion. You feel for the Charlie (Main character) in her ups and downs throughout the adventure as well for Bumblebee. The chemistry between these two characters is excellent. Tired of spoiled brats and stuck up jerks that no one respects in real life being the main characters from all the last transformer movies.Action: Even better with better fight choreography.Even the transformers themselves look better in my opinion.This movie has heart! Transformer movie!? I know but it's true for this one. None of the other transformer movies in my opinion had any heart.Humor felt natural and landed throughout the movie in my opinion.Hollywood only cares about money. So I hope that this movie does better at the box office than all the other transformer movies. They need to know that this is the kind of movie you make that is based off of toy action figures for kids! (and TV show) This I can honestly say is one of my favorite movies. Please support this movie!"}], "recommendations": ["incredibles_2", "super_8", "avengers_age_of_ultron", "ant_man_and_the_wasp_quantumania", "x_men_apocalypse", "thor_ragnarok", "guardians_of_the_galaxy", "kingsman_the_golden_circle", "pan", "poseidon", "transformers_dark_of_the_moon", "king_arthur_legend_of_the_sword", "terminator_genisys", "the_chronicles_of_narnia_the_voyage_of_the_dawn_treader", "tomorrowland", "creed_ii", "jumper", "turbo", "max_steel", "teenage_mutant_ninja_turtles", "how_to_train_your_dragon_2", "riddick", "the_last_witch_hunter", "jack_the_giant_slayer", "9"]}