{
  "id": 4341,
  "title": "Burnt",
  "starring": [
    "Bradley Cooper",
    "Sienna Miller"
  ],
  "runtime": 100,
  "genre": [
    "Drama"
  ],
  "description": "Adam Jones is a Chef who destroyed his career with drugs and diva behavior. He cleans up and returns to London, determined to redeem himself by spearheading a top restaurant that can gain three Michelin stars.",
  "releaseYear": "2015",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/iptu4zfvbeULkeuoVkTl2mOqTPS.jpg",
  "categories": {
    "plot": 4.514285714285714,
    "acting": 4.8,
    "ending": 5.0,
    "soundtrack": 5.0,
    "cinematography": 4.5,
    "familyFriendly": 3.0,
    "funny": 5.0,
    "action": 3.0
  },
  "reviews": [
    {
      "rating": "7",
      "text": "We've seen this story line before, young and brilliant, but the higher the star, the bigger the fall.  Only this time, it's a chef.  Well, cooking shows are big on TV right now so I see the catch.  Well done though, and I liked the cast of actors they put together."
    },
    {
      "rating": "5",
      "text": "A film that while mildly entertaining fails to get you to connect with its main characters.  Cooper's charisma is on display but his screaming, ranting, and even pushing gets in the way.  C+"
    },
    {
      "rating": "5",
      "text": "Burnt has some shades of greatness but unfortunately just as much disappointment. Bradley Cooper is pretty strong in this movie as he often is and that is one of the main factors that keeps this film afloat because his character is almost impossible to like. You may be drawn to him because of his reputation but you do not like him organically. Sienna Miller also reunites with Cooper after they were together in American Sniper and she's got a bit more of a significant role in the Burnt and you can see that she is a pretty decent actress. The cinematography is great and the food looks so beautiful on camera. One of the main problems with Burnt is that is hard to connect with and that makes it come across as pretentious. The ending is also really abrupt and convenient so it almost feels like the film is cut short."
    },
    {
      "rating": "5",
      "text": "Burnt, Bradley Cooper’s newest endeavor is a movie I believe his fans will enjoy, but not much more than that. After seeing last year’s “Chef” directed by Jon Favreau I realized that food related films can be great, they can show that cooking is an artform, and make you hungry at the same time. Burnt, however, borrows too many elements from the superior “Chef”, lacks good character development, and is sporadically paced. The one saving grace of the film was the great performances by it’s main cast.\rWatching Chef I was completely engrossed is a movie about food, that also had a story behind it. The difference between Chef and Burnt, is the fact that Burnt deals with the world of petite dishes, and psychotic chefs, not as much about the food. The film resembles last year’s Whiplash, with a psycho leading a group of talented pupils, Ratatouille, and Chef, but fails to reach their level of excellence.\rThroughout the film, characters come and go, most of which have next to no development. Bradley Cooper’s character has some development, and so does Sienna Miller’s but beyond that they are all flat and one dimensional. The acting, however, is excellent, for instance I struggled to even tell who Sienna Miller was until about halfway through the film, she totally transformed. Cooper as per usual was a reliable main cast member, but the film fell flat way too much.\rThat may be the film’s biggest problem, is that it failed to elevate way too often. For a two hour film, it often felt like two and half, dragging very seriously at times. The film had next to no humor, the food wasn’t very appetizing, and it all felt a little too familiar. The story is cliched, the conflict doesn’t always make sense, and the climax falls a little short.\rIn the end Bradley Cooper fans will likely enjoy Burnt, but besides that it lacks any real appeal. The acting is good, dare I say maybe even Oscar worthy, but way too many things go wrong for the film to elevate and be great, or even good. It may be a good idea to spend your money at another film."
    },
    {
      "rating": "5",
      "text": "I rather watch every single TV show out there that stars Gordon Ramsay then ever sitting through this again. Bradly Cooper really needs to pick better roles in better movies."
    },
    {
      "rating": "7",
      "text": "Burnt was so much better than I actually thought it would be. The cooking was so amazing, the acting was superb, and for once, a cooking movie that actually shows what it's like to be in a restaurant kitchen."
    },
    {
      "rating": "7",
      "text": "Really enjoyed this movie. It a season or over hyped and over rated movies this one was better than most and was compelling throughout. Worth taking the time to watch"
    },
    {
      "rating": "3",
      "text": "Anyone remember wanting a movie about an angry chef starring Bradley Cooper? Anyone ask for this? No? Didn't think so but here we are anyway. Cooper stars as Adam Jones a disgraced chef trying set up a restaurant in London and earn three Michelin stars. Settle down for nearly two hours of food, more food, Cooper having a tantrum, more food, and Cooper throwing plates of food at people. Of course there is a \"heart warming\" story amongst all this but you really don't care enough about the characters so it falls flat. I'm not saying don't watch this, but you'll regret paying money to see it."
    },
    {
      "rating": "0",
      "text": "Bradley Copper is horrible, the story is a disaster, directing is garbage and what you get is a total failure of a film on every level. Burnt is so poorly put together you have to wonder whether the people behind this film even cared."
    },
    {
      "rating": "2",
      "text": "There is nothing worth caring about in this movie, it's predictable, laughable, well-shot and fairly well acted tripe. Burnt looses all three Michelin stars. And it made me loose my sanity."
    },
    {
      "rating": "5",
      "text": "If you watched John Favreau’s delightful 2014 comedy/drama ‘Chef’ you’ll know that the beauty and love of food and its preparation is transferable to the big screen, given, pardon the pun, the right ingredients. With ‘Burnt’, director John Wells attempts to rework a winning formula for the world of “Gourmet” cuisine.\r Cooper’s central character “Adam Jones” is the familiar tortured but driven soul, stumbling over obstacles on the path to redemption. Anyone who’s a fan of celebrity “superchefs” like Gordon Ramsay and Marco Pierre White will recognize the many abrasive character traits of a culinary “Enfant terrible”, forged in the heat of the kitchen and pressure of the industry, but with Jones you can add an excessive rock ‘n’ roll lifestyle.\r But despite being billed a comedy and boasting a charming trailer, ‘Burnt’ is not particularly comedic and indeed lacks all the charm and heart that made ‘Chef’ so effective. Despite solid performances from Bradley Cooper and co-star Sienna Miller, ‘Burnt’ features often clichéd characters and a predictable narrative that lacks punch and lumbers along for what seems much longer than its 101 minute run time.\r As expected ‘Burnt’ is beautifully shot and the food preparation sequences are essentially stylishly cinematic food porn, but given the aspirational nature of Haute cuisine, even these visuals are not as appetizing as they should be and have a sterile unattainable quality.\r There isn’t much to surprise or grip an audience here, the most honest moment in the film is where Adam Jones nearly bursts the pompous bubble of high culinary art and its lucrative but pretentious nature. But ultimately ‘Burnt’ takes itself way too seriously just like the industry it depicts, and as Bradley Cooper’s character states, does so because it can.\r The Bottom Line…\rWhile disciples of Haute cuisine may enjoy something at time akin to food porn and despite solid lead performances, ‘Burnt’s’ predictable narrative and lack of charm result in an underwhelming experience that lacks in depth, arguably a fitting tribute to the subjective and detached industry it depicts."
    },
    {
      "rating": "5",
      "text": "Excellent movie ! There is nothing wrong about it, loved to watch the movie from beginning to the end. This is just an opinion, I don't provide any summary of the movie, you just have to see it."
    },
    {
      "rating": "4",
      "text": "Burnt is burning you by making your eyes burnt by watching this. You'll recognize how many flaws are in this movie while your eyes are getting burnt. Don't just sit there... stop, drop, and roll!"
    },
    {
      "rating": "6",
      "text": "Bradley Cooper plays a chef who's great at cooking, but a mess at personal and professional relationships. After a major flame out, he moves to London, where he enlists old friends to create a new restaurant. There's lots of kitchen prep that's interesting and serves up some beautiful dishes. There's also lots of him being a dictatorial **** but oh so committed to his craft. Performances are solid, but the story's focus is muddled, esp. in the beginning. Foodies into the high-pressure gourmet world will find lots to like. Cooper fans will enjoy him. Overall, an interesting, but forgettable film."
    },
    {
      "rating": "9",
      "text": "I guess I'm the only person that liked this film... I don't know why it got lower reviews, it was a great story and I thought it was interesting to peek into the uber top restaurant business. Well done :0)"
    },
    {
      "rating": "5",
      "text": "If Alicia Vikander had a bigger role in the movie, I might have stayed with it longer. But as she didn't and as I didn't find the plot interesting, I gave up on it early on.'"
    },
    {
      "rating": "5",
      "text": "Burnt has a few problems that really derail the proceedings. Though Bradley Cooper is a powerhouse in the lead role and the film features an insane supporting cast that includes Daniel Bruhl, Sienna Miller, Matthew Rhys, and Alicia Vikander, the film's writing simply does not meet the talent of its actors. Though Steven Knight is typically a good writer, Burnt's script is not quite there. Overly predictable, you can quite easily guess how things turn out and, even worse, the film never gets us to like the protagonist. An insufferable jerk from beginning to end, our antihero type character is solely anti and never hero. That said, it is well directed by John Wells. With good pacing, good acting, and good timing for dramatic and comedic moments, the film does entertain. Unfortunately, it is far too typical and presents an unappetizing look at the culinary industry."
    },
    {
      "rating": "4",
      "text": "Burnt has a pretty solid first half, but falls apart in the latter half. The second half attempts to juggle comedy, drama, and romance, and fails to do so. Big name stars are completely wasted, some only given one lazy scene. As a whole, \"Burnt\" is a poorly written mess of a film that wasted its great potential across the board."
    },
    {
      "rating": "7",
      "text": "It is not perfect, but delicious.\r Movies about foods and chefs are quite popular since the beginning of the cinema. Not only among the food lovers, but the movie fans, critics as well common people decides to book a table at a nearby best restaurant after watching a delicious film like this. At least one movie in every year makes us to talk about the foods for that entire week. Like the Jon Favreau's last year's 'Chef', this is 2015's.\r On this theme, movies are always quite similar, except subplots like family, friends and sometimes foods from the different part of the earth as well. This film was not that brilliant when it comes to innovation in the story. The same old chef who comes back strongly after losing everything to get a another star. So what makes this special is that the actors, everyone was awesome. Even in smaller parts, especially the lead one Bradley Cooper makes all the difference.\r There was a twist, but it does not make us say wow. Definitely it was a bit fun, filled with some dark humours. The slow, dull storytelling was almost like a soulless product, but anyway, kind of it worked well due to the style of film setting that created to narrate it. Feels like in the many scenes, characters were intensely dragged in like the cameos, otherwise it would have been very plain. Overall, it's not a best food/chef movie I've ever seen, but very much watchable and enjoyable.\r 7/10"
    },
    {
      "rating": "4",
      "text": "More culinary skills are put to the test as the film 'Burnt' tells the story about a chef named Adam Jones (Bradley Cooper) who tries to reverse everything he's done wrong in the past, and serve good food at his own restaurant and achieving that third star.\r The film, directed by John Wells is impressively detailed, the structure of seeing all the different fancy restaurants, and the constant close-up shots of different food and ingredients being cut and sliced can make one hungry for that food. In other words, this is essentially food-porn.\r But it seems that the food in this movie have better character development than the characters we see and are supposed to care about. While the film is attractive and lavish in terms of its direction and cinematography (by Adriano Goldman), the chefs that we meet are either ultimately bland, or they just don't have enough screen time for us to get really invested in them. Take one chef we meet named Michel (Omar Sy), who apparently used to work alongside Adam in a French restaurant, but that all went down after Adam, idiotically released rats into the kitchen causing health and safety to shut it down. They try to rebuild their friendship when Adam wants to redeem himself after being sober for some 2 years.\r Another one we meet named Helene (Sienna Miller) who lives at home with her daughter, we can see that the father is absent, and it seems that Helene cannot balance her work life and personal life. We get the idea that Helene is trying her best to provide for her daughter, but this is a cliche that we have seen in so many other movies.\r The person that Adam wants to take over his restaurant is Tony (Daniel Bruhl), but he doesn't trust him due to the fact that his behavior in Paris ruined everything. There seems to be a romantic story going on between these two since Tony seems to be in love with Adam, but this is never further emphasized, and the way it is introduced seemed out of the blue.\r The cast in this movie do a great job of fitting into their characters, and Bradley Cooper is good at channeling the Gordon Ramsay type attitude. But why should I care for any of these characters? Adam's backstory is glossed over so heavily, we do not get any flashbacks or some other form of development. Helene has a daughter, and it seems that she is struggling financially, like I said, this has been done in other films, why is this one so different? It's clear that director John Wells loves his food and shows it off beautifully in this film, but there is no sense of care and struggle for these characters. Brad Bird pulled this off extremely well in 'Ratatouille' (2007) combining well developed characters while showing off a love for food.\r There is even a scene where we see Adam getting into some trouble with drug thugs, as he owes them money, but this subplot is introduced three times, and, without spoiling too much, let's just say they also gloss over how that won't need to be revisited.\r This is an inspired film, but you come to gaze at the delicious food instead of getting invested with these characters, they are all either just angry chefs, nervous chefs, or just young chefs trying to make a name for themselves. The movie is 1 hour and 41 minutes long, I cannot help but feel that if this was a 2 hour movie, maybe more, then we could get some development."
    },
    {
      "rating": "9",
      "text": "Cooper delivers the goods right enough, with help from Daniel Bruhl as his business partner and Sienna Miller as his sous-chef-cum-love-interest.\r Watch it here for free http://www.watchfree.to/watch-2a46a6-Burnt-movie-online-free-putlocker.html"
    },
    {
      "rating": "3",
      "text": "Hamfisted writing, hamfisted dialogue, hamfisted story... you get the picture. The only decent thing is Cooper's acting, but we've seen it so many times by now it's nothing special and is absolutely not enough of a reason for anyone to watch this garbage."
    },
    {
      "rating": "9",
      "text": "This movie isn't perfect but i think it deserves a higher rating...In my opinion it is well-crafted and actors did their best...2 Awesome points are shown really well too:1- For doing things perfectly you always need others specially your friends!2- If you don't get what you really tried for you won't Die...You just need to try harder next time!"
    },
    {
      "rating": "3",
      "text": "Cooper isn't that bad but the narrative is very weak! I would have love more character development and not wasting Sienna Miller, Alicia Vikander and Daniel Brühl in such a disgraceful way."
    },
    {
      "rating": "3",
      "text": "Plenty of dressing, plenty of sauces to choose from, the main course, though, is undercooked.BurntJohn Wells has a troubling script in his hand. And it is supposed to be shocking. Steven Knight wrote the screenplay. You don't expect something like this from him. Although, every word of the film is subtexted with his signature all over it. The film takes odd turns and you'd go, \"Oh! Yeah. This makes sense.\" And that is all the sense you are going to get. The director John Wells' film is troubling for it never knows what it is. In present. What it breathes and feels. The film is well aware of the trajectory it has to follow. It is mapped out meticulously within the script. What it doesn't know, is how to behave.More importantly, express. Tons of action in the film, the decisions made by the characters or maybe even improvised by the actors are incongruent to.. well, anything. You need double checking on what it just chose to do or be. Is this the storyline are we supposed to follow? Predictable in its entirety and messy in its root. The only one coming off as a winner is Bradley Cooper. He is given one eccentric character to portray.And he oozes power exactly how it is written on the paper. That is, once again, not to say that he is perpetually giving his best. In fact, the first act of the film is driven by him and it is in safe hands by then. His name is a myth that anyone would gladly love to listen to and gossip about. And he lives up to his reputation. He uses his celebrity persona, various charming tactics and passionately rude behaviour to overpower others. Burnt is about one character and all they had to do was hold on to him, they took him for granted."
    }
  ]
}