{
  "id": 4265,
  "title": "Burn After Reading",
  "starring": [
    "George Clooney",
    "Frances McDormand"
  ],
  "runtime": 96,
  "genre": [
    "Comedy",
    "Drama"
  ],
  "description": "When a disc containing memoirs of a former CIA analyst falls into the hands of gym employees, Linda and Chad, they see a chance to make enough money for Linda to have life-changing cosmetic surgery. Predictably, events whirl out of control for the duo, and those in their orbit.",
  "releaseYear": "2008",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/eQfTetzb4DMoI4YnPEcNoUQD63U.jpg",
  "categories": {
    "plot": 5.884615384615385,
    "acting": 5.607142857142857,
    "ending": 6.875,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 6.0,
    "action": 8.0
  },
  "reviews": [
    {
      "rating": "9",
      "text": "Expertly Crafted story, with shocking twists. The humor is great, and the Cohen brothers have done it again!"
    },
    {
      "rating": "7",
      "text": "Very entertaining crime comedy with stand out performances from Brad Pitt and Frances McDormand. Funny, very well written and never a boring moment. Excellent."
    },
    {
      "rating": "8",
      "text": "\"Burn After Reading\" is all about stupidity and pointlessness, as we find out near the end of the film. Its characters are all idiots and rather stupid, and their moronic ways cross each other into violence, sex, and mishappenings throughout this strange **** that the Coen brothers. I will say that it never ceases to be funny or interesting, and that Malkovich is hilarious as the CIA operative with a wild temper and a very dirty mouth."
    },
    {
      "rating": "5",
      "text": "This is the epitome of mediocre movies. After watching it I seriously could not decide if I liked it or not. The acting is great. It has some funny moments. There are some small twists that I seriously did not see coming. But the story is lackluster, as are most of the characters. While the plot is resolved at the end, you're kind of left feeling like the entire movie was a waste of time."
    },
    {
      "rating": "9",
      "text": "i thought the film was very intelligent. the jokes are very smart, in a way hard to explain. the characters feel really natural. it is a movie that shows skill on the filmmakers' behalf. if it feels naturally good, it's a good film."
    },
    {
      "rating": "4",
      "text": "Frances McDormand and George Clooney lead this somewhat confusing and at times startlingly violent film about what happens when two people that put money (or possible larger breasts) over their safety. When two gym workers find a CD containing sensitive CIA information, they embark on a dangerous quest to receive their reward for being 'good samaritans'. Despite the label comedy, it is not a terribly funny movie, as the jokes are few and far between. It isn't worth the hype, however, if you like crime drama kinda stuff, you should at least try it."
    },
    {
      "rating": "9",
      "text": "Again a masterpiece by the Coen brothers. More bizarre than ever before and starring fantastic actors (every single one of them plays great!) and has a brilliant screenplay. A comedy film like it was meant to be. Everything's really good here, except some over-acting by McDormand and Pitt here and there."
    },
    {
      "rating": "8",
      "text": "Not quite at the level of films like Big Lebowski in terms on Coen Brothers comedies, but still a really fun movie with some really good actors acting like true idiots and having a blast in the process. Brad Pitt is a high point, but the show stealer for me was JK Simmons as the perpetually befuddled CIA superior attempting to follow all the ridiculousness."
    },
    {
      "rating": "7",
      "text": "Burn after reading blazes....\rThe plot is crafted with immense precision surrounded by amusing characters and incredible acting performances, a great film from the Cohen brothers."
    },
    {
      "rating": "9",
      "text": "Easily one of the Cohen Brother's most underrated films. This is a classic Cohen Brothers comedy about people arguing and scheming over something worthless. The ensemble cast is great. The laughs are great. It's very charming and enjoyable to watch. The twists and turns are perfect and will entertain and shock you!"
    },
    {
      "rating": "7",
      "text": "Haha that was such a fun. Great actors, great roles/characters and funny story. A lot of plot twists. Totally worth it."
    },
    {
      "rating": "10",
      "text": "It's deadpan comedy at its best, and who better to deliver it than Joel and Ethan Cohen, along with Brad Pitt, George Clooney, Frances McDormand and the fantastic John Malkovich.\rWhen a disc containing some of the CIAs most revealing secrets goes missing, it ends up in the gym of the most bumbling, simple minded individuals, who attempt blackmail but get in too far over their heads.\rIts an approach at showing just how overreacting individuals can be, but also just how bland or too seriously many Hollywood movies take themselves surrounding this incident, basically a parody.\rIts a very well written dark comedy with brilliant performances, particularly Brad Pitt as an extremely camp gym worker, and retied CIA analyst John Malkovich.\rIt has this large ensemble cast that go to extreme length to mock and amaze through sheer stupidity, all for our amusement, and they certainly do not fail."
    },
    {
      "rating": "4",
      "text": "you know how when a normal movie ends and you're like \"ok, that was ok\" while nodding your head.\rand when a great movie ends you're like HOLY waw, that was fantastic\rbut when burn after reading ends, i'm like \"WHAT, THAT'S IT  1:35 MINUTES, did i download the full movie or something went wrong?\"\rso yeah 1 hour 35 minutes are too short to figure out these 5 characters, and yeah the performances were great,\rbut one does not simply enjoy an unfinished movie with terrible ending."
    },
    {
      "rating": "3",
      "text": "Horrible waste of money. was mildly amusing at best. story could've been made into something neat but instead was a wash of nothing. You know those types of movies that just don't have any meaning or resolution. Boring, pointless waste of time and money. Do not see this movie."
    },
    {
      "rating": "0",
      "text": "A film that is proof positive that if film critics like it, it has to be bad. This film goes back to the time when US comedy did not travel. Actually from brain to mouth is usually to far for most alleged comedy. Frances McDormand great actress but in this I could have quite cheerfully beaten her to death as I found her incredibly irritating all the way through. Brad Pitt. Terrible. As to George Clooney. This actor has only made two decent films that I can recall, The Peacemaker and One Fine Day. He was so so in Three Kings, appalling in the dismal US version of Solaris and this was not much better. If you want to see a good spy spoof then watch the infinitely better \"Red\" with Bruce Willis. This film should be renamed Burn Before Viewing. But as I said it should be thanked for proving how abysmal the film critics are. To those that liked it, I presume they were doing another sale at Lobotomies 'R us!"
    },
    {
      "rating": "10",
      "text": "Awesome movie    ."
    },
    {
      "rating": "8",
      "text": "The Dynamics Of The Average Human Motivation Are Revealed and the construction of suburbia is the space of such motors. The social carpet unfolds black and popish resembling a report for those that watch from the sky"
    },
    {
      "rating": "9",
      "text": "Unfortunately most people haven't got the point. Coen brothers and all these amazing actors got together to show us how ridiculously, not only our country, but the whole world is approaching a catastrophe. The more stupid one is, the higher the rank s/he can get in the government/intelligence. Then Idiots make policies and decisions and everyone gets screwed up. Just think about the point of this movie again. Coens, Malkovich, Clooney, Pitt, Swinton, .... are all smart people and their time is very expensive, so they spend it on something that is worth watching and thinking about."
    },
    {
      "rating": "2",
      "text": "A few funny moments intertwined with a lot of cheaters. Brad Pitt was fantastic, but unfortunately the same cannot be said about this plot."
    },
    {
      "rating": "9",
      "text": "I dont understand why people didnt like this. In terms of entertainment value, I thought it was way better than No Country for old men. What can I say, I Loved it."
    },
    {
      "rating": "1",
      "text": "A few funny lines, other than that, thoughtless, pointless, the violence was senseless, the amount of cursing made it seem like the writers were in 7th grade and had just discovered the words shit and fuck. After seeing this, I spent about 40 minutes talking about how bad it was. I felt robbed of my time, and cheated. It was simply AWFUL."
    },
    {
      "rating": "10",
      "text": "One of the best films this year and tat s saying something!"
    },
    {
      "rating": "1",
      "text": "This movie was absolutely a waste of $16. The only parts of the movie that moved that audience at all were Brad Pitt's idiotic humor and when he was shot in the face. The character Linda was a joke. Not to mention Clooney fit the role of a psycho but that's about it. Don't even get me started on the ending. They briefly explain to you who got shot and who died while stumbling over words. I'm sorry but I highly doubt a person in such a position (the character who fired Malcovich) would studder while speaking to his superior. This movie was absolutely horrible and I'm pissed that I wasted my money."
    },
    {
      "rating": "7",
      "text": "Sonny Wortzik(Al Pacino) planned a bank heist in Sidney Lumet's \"Dog Day Afternoon\" so he could pay for his boyfriend's sex reassignment surgery. People do insane things for love. Echoes of the 1975 film can be gleamed in \"Burn After Reading\" when Linda Litzke(Frances McDormand) tries to unload a disc of CIA \"s***\" at the Russian embassy. The high cost of surgery is the root of Linda's ersatz attempt at espionage. In stark contrast to Sonny, though, the fitness center employee is having work done on herself. Welcome to \"The Me Century\". \"Burn After Reading\" savagely attacks a certain segment of the general public and their corresponding character; those Americans who are narcissistic, lazy(Linda opts for liposuction instead of working out), therefore fat, and ill-informed. More than ever, the 21st century is a throwback to the seventies(dubbed \"The Me Generation\"), a period in which people were apolitical and hedonistic(Linda has one-night stands with men she found surfing the Internet.). She and Chad(Brad Pitt) solicit the Russians without an understanding about our current political climate. For the record, The Cold War ended in 1991. When Osbourne Cox(John Malkovich), late in the film, says, \"You belong to a legion of morons,\" he's not really addressing Ted(Richard Jenkins); he's addressing the American people; the voting populace, at large. Ted doesn't belong to the \"idiotocracy\". Ted is a good man. What about you?"
    },
    {
      "rating": "7",
      "text": "The movie has a good premise, but it didn't seem to follow through on what it intended to do. The beginning is quite slow as it unfolds the characters and takes awhile to get to the meat of the plot. By then, you've already asked yourself \"where is this going?\" At times, it was witty and sardonic. Brad Pitt nailed the role as small-time gym trainer. He definitely highlights the movie. However, the rest of characters didn't blend well with the \"dark comedy-esque.\" I found them to be too serious and not whimsical enough. The tone of the movie at times didn't know when to be humorous or serious. In general, it's not too bad, but not too good. The great ending was the savior of the movie."
    },
    {
      "rating": "4",
      "text": "This was a horrible mess of a movie that strained too hard to pull out any sort of comedy. Extremely dry and simplistic humor dots the film as if the actors were forced to try and make it funny. The only moments that even cracked a laugh in the whole movie theater were perhaps the least clever, calling a man a, \"Jew\", a Hispanic worker repeating what he's saying, and two government officials trying to figure out whats going on, mark all three funny moments in the film. As well, the first quarter of the movie before the, \"Burn After Reading\" file is discovered is absolutely unneeded, it slowly, almost to the point of nauseatingly fleshes out the main characters, so much that I think I've seen soap operas wrap up character history faster. The entire movie was a failure at an attempt to entertain, but spot on when it comes to portraying how stupid the characters were, the last three minutes of the show are all you truly need to watch, as this movie is quite the head-snapper, as in I'm trying not to pass out from the sheer stupidity this film made me endure."
    },
    {
      "rating": "9",
      "text": "Every joke hit it's mark (rare thing for a comedy), and there were lots of jokes. This is my favorite Coen movie after No Country For Old Men. Clever, well acted, achieves everything it wants. One of the few movies where so many despicable characters are so watchable. I can understand that some people are left wanting a higher purpose, but they are either missing the point or just need a different point. I can understand that some folks won't get it or like it, but I'm gratefully not in that camp. Great, funny movie."
    },
    {
      "rating": "3",
      "text": "One of the most boring and useless film in this 2008. Stay away from it. it's a waste of money,time and patience."
    },
    {
      "rating": "2",
      "text": "Despite the fantastic cast, this was extraordinarily boring and bereft of laughs. I kept waiting for it to get funny, clever, entertaining . . . never happened."
    },
    {
      "rating": "9",
      "text": "Confirms what we've known all along: just about everyone in Washington is a lot dumber than they think they are...if only the real ones would get the poetic justice these clowns do!"
    },
    {
      "rating": "3",
      "text": "Truly dismal. A fim about nothing. It's like they got 3/4 of the way through and gave up any hopes of a story."
    },
    {
      "rating": "0",
      "text": "people giving \"burn after reading\" any score above zero are reading too much into the movie. you could give them a blank piece of paper and it would keep them entertained for hours, as they would find some 'hidden meaning' within it. they probably saw movie critics' ratings for \"no country for old men\" and thought that by giving a high rating to the coen brothers' next nonsensical movie they would appear 'smart' in movie critics' eyes. i watched this entire movie, constantly expecting something interesting to happen. it didn't. dreadful!"
    },
    {
      "rating": "9",
      "text": "Absolutely hysterical. Saw it on the movie channel. I'd never even heard of the movie before. My wife and I were howling throughout the movie. The cast was superb. Frances McDormand plays screwball better than anyone. Malkovich, Clooney, Pitt and the rest of the cast hit their marks ever time.Satire, black humour, screwball comedy. The writing was crisp and very very funny. Though my wife disagrees, I liked it better than Fargo."
    },
    {
      "rating": "0",
      "text": "This script should've been burnt after reading. I've never been this close to leaving the cinemas. I didn't hear one good word about it from other people who were watching the movie. During the break I couldn't help but speaking out loud what kind of $#!% I thought it was, and I didn't get else but confirmation from other people. I came here to expect that others somewhat shared the same opinion and I'm very surprised that it's currently rated at 6.3 / 6.5. I guess I'm more of an all rounder when it comes to watching movies. I think this movie only appeals to a specific group (hence the great differences in user ratings). I didn't see the trailer before I watched the movie, but upon watching it now I would think its a fair movie. I think the trailer is pretty misleading. Better wait for 007. Even if you have to wait 2 weeks before you can make a reservation."
    },
    {
      "rating": "7",
      "text": "Entertaining... but being a Coens borthers movie you expect to be blown away. This time they fall short."
    },
    {
      "rating": "4",
      "text": "Comparing and contrasting the careers of the last two Lifetime Achievement--er, Best Director Oscar winners: Martin Scorsese's lifetime output represents the work of someone who has seen a lot of movies and lived a lot of life. The Coen Brothers' lifetime output represents that of someone who has seen a lot of movies. Oh, don't get me wrong--their studiously composed clones-with-attitude of yesteryear's finest ,such as the unjustly underrated retro-noir The Man Who Wasn't There, can certainly yield many of their own rewards (and it should be no surprise whatsoever that the biggest laughs in their remake of The Ladykillers were lifted directly from the 1955 Alec Guinness original), but too much of their recent work--No Country For Old Men being an atypical blip on the radar, and therefore predictably the big winner of the Academy Award jackpot--emerges as heartless, soulless, and, especially given how often the word \"quirky\" is applied to these guys, oddly mechanical. Earlier comedies such as Raising Arizona and Fargo partially countermanded this with such a palpable underlying core of sweetness, especially in thdeir depictions of the central characters' marriages, that any fleeting suspicion that Joel and Ethan were treating their principals with the slightest whiff of condescension could be easily and happily dismissed. Not so with their espionage farce Burn After Reading, a farce as irriatingly tangled as a store selling Christmas tree lights in the aftermath of a firebombing and as distastefully acrid as a carton of milk left sitting on the radiator since Saddam shuffled off this mortal coil. If I wanted to watch one-joke comedies about nothing more than how selfish and stupid people are (with no compensating or justifying point of view as can at least be found in Kubrick's Dr. Strangelove or Altman's The Player), I'd sit at home with reruns of Married...With Children and America's Funniest Home Videos; at least those offerings wouldn't profoundly depress me with all-dressed-up-and-nowhere-to-go comic turns by a very lively Brad Pitt, John Malkovich, J.K. Simmons and Mrs. Coen herself. The rubber-faced Frances McDormand, whose brilliant but compassionate cop Marge Gunderson from Fargo will live past all vocal comparisons to a certain notorious political figure to remain one of ther most endearing movie characters in history, is especially poorly used as a moronic and (deservedly) unlucky-in-love health club employee. Admittedly, the fact that the Coens assembled such an elaborate , seemingly unending (though it's only slightly over 90 minutes) paean to utter obtuseness (with the one somewhat likable and reasonably intelligent character meeting a gory, disgusting fate) IS superficially impressive in the way that someone constructing a model of the Sistine Chapel entirely out of cheese might be, but in both instances the novelty wears off VERY quickly and the results turn putrid even more rapidly. Or, as Juno's dad asks at picture's end, what have we learned? Not a damned thing. Oh, brother, you said it."
    },
    {
      "rating": "2",
      "text": "This is one of the lowlights in the Coen canon; not funny (and desperately trying to be), not suspensful in any measure and laborious to endure. A waste of a first class cast and an uncharacteristic misfire in every respect."
    },
    {
      "rating": "7",
      "text": "Curious plot drew me deeper and deeper into the humor of the movie. Characters seemed shallow at first, but in the end viewers have no doubt that it is written and directed by the Cohen Bothers."
    },
    {
      "rating": "6",
      "text": "Lots of F words and a couple of surprisingly jarring violent scenes seemed out of synch with the humor and caper qualities of the film. A creative plot but not a movie I would recommend."
    },
    {
      "rating": "8",
      "text": "The movie is comprised of plot twists and dark humor. I would recommend this movie to anyone who liked Fargo and The Big Lebowski. I thought it was a good movie on the first watching, but it may get even better with subsequent viewings."
    },
    {
      "rating": "9",
      "text": "Funniest movie I've seen in a long, long, time. I am not a Coen Brothers fan but I was pleasantly surprised by the cleverness of this movie. A must see."
    },
    {
      "rating": "8",
      "text": "Hysterical. Can be a bit hard to follow at times but the characters are strong and the comedy is quick. Loved it."
    },
    {
      "rating": "9",
      "text": "Not as good as No Countr, but still one of the best films of 08'. Perfect mix of drama and comedy. Only complaint is the beginning is a little weak but ultimately it adds up to the middle and end which is grade A material. Not worthy of Best Picture but still a must see."
    },
    {
      "rating": "7",
      "text": "What Burn After Reading may lack in story and structure, it makes up for in (as all Coen movies do) great quirky characters, and lots of them. It may not be the Oscar juggernaut that we'd expect from the brilliant Coen brothers, but what a joy it is to watch their menagerie of off the wall people who inhabit this movie! Brad Pitt's Chad Feldheimer is a classic that could grab the Acedemy's attention and JK Simmons is deadpan hilarious!"
    },
    {
      "rating": "0",
      "text": "No Country made me want to kill the Coen brothers. Burn After Reading makes me want to kill them, revive them, and kill them again. I'm done with these idiots."
    },
    {
      "rating": "6",
      "text": "Oh boy. Hmm,...let's see now, I didn't necessarily \"dislike\" this typically polarizing of a Coen Brothers film, but I hardly \"loved\" it as well. Like their far superior \"No Country For Old Men\", this new film is rife with pessimism, misanthropy and palpable mean-spiritedness (despite it being an alleged \"comedy\"), but unlike \"NCFOM\", it hasn't a really compelling story (or rather a series of untypically cinematic \"things\" happening against formula) nor any interesting characters to \"care about\" (we're passively along for the \"let's mock these morons\" ride). It's chock full of unmitigated idiots and hapless dolts (Malkovich notwithstanding, despite his surface perceptions of idiocy all about him) running around oblivious of the likely consequences of their respective actions and the ramifications of other people's reactions. This movie and its mindbogglingly inept array of twits represent a contemporary microcosm of the idiocy that continues to stymie (for the most part) the actual (i.e., the \"mental/psychological progress\", and not the more popular and assumed \"technological sense\") progress of the human race. This is what the Coen Brothers are lamenting and responding to. To a certain extent, I definitely sympathise with them and their frustration with contemporary culture, but it's too bad they couldn't express it more entertainingly. J.K.Simmons' final lines of dialogue perfectly sum up the sad situation afflicting early 21st century humanity and the laisse faire attitude of \"doing our own thing\" unbeknownst to everyone else and the potential adverse consequences therein. How can anyone learn anything from populated events affecting you indirectly and beyond your control, even if siad events are perpetrated by idiots? God, help us all!....oh yeah, that's right too."
    },
    {
      "rating": "9",
      "text": "Darkly funny. One of the best things that the Cohens have done since Raising Arizona."
    },
    {
      "rating": "8",
      "text": "even funnier than Big Lebowski, i guffawed my way through it. Pitt is hilarious, so is Malkovich. McDormand and Clooney are also pretty good. Those who prefer the Coen's funnier stuff over their thrillers will absolutely lap this one up. Watch for the visible boom, apparently that's intentional."
    },
    {
      "rating": "9",
      "text": "Haha are you kidding me that movie was hilarious!"
    },
    {
      "rating": "4",
      "text": "Starts off ok but just gets stupid. I can't recommend this one."
    }
  ]
}