{
  "id": 3378,
  "title": "Burying the Ex",
  "starring": [
    "Anton Yelchin",
    "Ashley Greene"
  ],
  "runtime": 89,
  "genre": [
    "Comedy",
    "Horror"
  ],
  "description": "Before horror enthusiast Max can break things off with his girlfriend Evelyn she dies in a bus accident. In time, Max meets another woman only to have Evelyn resurface as a zombie ready to resume their relationship.",
  "releaseYear": "2014",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/jf3MWdCo8eM5AJeyy21xISRSyfe.jpg",
  "categories": {
    "plot": 5.8,
    "acting": 5.5,
    "ending": 3.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 4.571428571428571,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "5",
      "text": "There's a pretty good concept here and an overall B-movie feel that kind of makes you want to like it. Overall though it all just feels way too phoned in. For a horror-rom-com, it's surprisingly lacking in horror, romance, and comedy.\r That's not to say it's a readily unfunny movie. It's just that none of the laughs it does try really elicit any sort of reaction. So it's not like these jokes are particularly bad, they just aren't particularly funny.\r No, Burying the Ex's biggest problem is that there just isn't anything going on. It's pulse is flatter than Yelchin's undead girlfriend. The only gore comes in right at the end. The majority of the movie is just watching Yelchin talk to his brother about dumping his girl and then not doing it because he's got no spine. Every now and then Alexandra Daddario shows up to hit on him.\r The romance angle also falls flat as well. Daddario's character just sort of follows around our sad sack lead for no apparent reason other than they share some common interests and she hasn't had sex in a while (the movie explains that). There's no actual romance going on. It's also worth pointing out that the main character actually doesn't have things that bad with his \"ex\" in the first place. Yeah, she was controlling and there obviously wasn't any connection there, but she hardly the girlfriend from hell. At least not before she died that is.\r Burying the Ex is sort of a bumbling corpse of a movie. It just sort of shambles along with no real purpose other than to eat. Only it's food is our time rather than our brains. Given the lackluster results I'd say we're all better off not feeding this one. You can tell there wasn't much effort going into putting it together. As a result it's watchable, but there's no real point in doing so. This ex can stay buried."
    },
    {
      "rating": "3",
      "text": "There's like a split second where this film might be an interesting look at the dynamics of what makes relationships work or don't (I thought the film was going to present Ashley Greene's Evelyn as sympathetic), but this is not that at all. It's just a lowest common denominator type-A domineering girlfriend trying to make a man-child grow up instead of just letting him be him. Except this time the twist is that she comes back as a zombie and he still doesn't have the fortitude to tell her the truth (he would rather kill her, again).Broad, with a few horror film fan touches, and nothing remotely approaching the level of a Joe Dante film and what that normally entails."
    },
    {
      "rating": "5",
      "text": "Overly attached dead ex-girlfriend. Embracing the corny B-movie allure, Burying the Ex takes advantage of its modest yet mildly fun concept. It produces decent comedy with pop reference, fitting acting and smart script. The movie is still stuttering with odd plot development, but all things considered it's a fun popcorn flick worthy of a few giggles.\r Max (Anton Yelchin) has been bothered by his shifty relationship with Evelyn (Ashley Greene). Theire personalities almost always clash, not to mention Evelyn can be incredibly volatile. Things get worse as a shady curse of some sort bind them both forever, this includes afterlife. After a tragic accident Evelyn rises from the death to fulfill her eternal love. The premise is by all means average romcom, but it is delivered with adequate conviction and wit.\r Ashley Greene fully welcomes the quirky role. She's equally obnoxious as living eco-obsessed girlfriend and a creepy zombie lady. The change of tone and behavior is done realistic enough, despite the exaggerated set-up, to ensure their situation is oddly identifiable. The cast isn't large, only four main characters, and it keeps the pacing moving relatively well.\r The script is done with tongue-in-cheek approach. Dialogues are occasionally cringeworthy, though most of the times they contain enough modern pop references or silly puns, audience can't help but laughing at them. Plot can be shady and a bit forced, but if audience can overlook some of these obscurities, there's mild fun to be had here.\r Burying the Ex is a simple B-movie, yet it is presentably humorous in the scale it plays on."
    },
    {
      "rating": "0",
      "text": "What could have been an entertaining black horror zombie comedy turns out to be a slow, cliche boring film. Less then halfway through the movie you'll be wondering why it isn't already over. You'll get tired of the spineless, poor excuse of a boyfriend who refuses to bury his girlfriend.\r This one was better left dead."
    },
    {
      "rating": "7",
      "text": "The plot was silly, it wasn't particularly funny, the movie was cliché and predictable and there were a few plot holes, but it was entertaining, the acting was good and the movie was kind of entertaining. It's not the greatest horror comedy out there, but it's not bad at all."
    },
    {
      "rating": "0",
      "text": "*sigh*\r~a long, deep, audible exhalation expressing sadness, relief, tiredness, or a similar feeling.\r \"A review meant for people who wants to know if a movie is worth to watch. This is not.\""
    }
  ],
  "recommendations": [
    "splice",
    "knock_at_the_cabin",
    "ready_or_not",
    "cooties",
    "colossal",
    "the_cobbler",
    "countdown",
    "crawl",
    "case_39",
    "bad_moms",
    "happy_death_day_2u",
    "the_curse_of_la_llorona",
    "old",
    "frozen",
    "freaky",
    "happy_death_day",
    "a_perfect_getaway",
    "rough_night",
    "minions",
    "the_happytime_murders",
    "the_family",
    "army_of_the_dead",
    "leatherface",
    "bird_box",
    "shut_in"
  ]
}