{
  "id": 4559,
  "title": "Cabin Fever",
  "starring": [
    "Rider Strong",
    "Jordan Ladd"
  ],
  "runtime": 93,
  "genre": [
    "Horror"
  ],
  "description": "A group of five college graduates rent a cabin in the woods and begin to fall victim to a horrifying flesh-eating virus, which attracts the unwanted attention of the homicidal locals.",
  "releaseYear": "2003",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/vaUkSL7PbeeKfdFKOh9TYR9M1ds.jpg",
  "categories": {
    "plot": 4.555555555555555,
    "acting": 4.75,
    "ending": 5.555555555555555,
    "soundtrack": 7.0,
    "cinematography": 9.0,
    "familyFriendly": 3.0,
    "funny": 4.615384615384615,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "3",
      "text": "I don't know what was wrong with the director of this film, He must have used it to express his sadistic feelings or something. But if you make a film, why would you let every character die? Nothing in it makes sense. Some retarded kid on a swing turns out to be a kung fu master and bites an infected guy, and then his redneck friends decide to kill him for no reason. I expected at least 2 characters to survive, the blonde chick and the dude. But the director thought halfway making it: \"Nah man, I'm gonna kill all of these guys. Just because I'm a **** sadist.\" All of the characters were emotionless amateurs, btw."
    },
    {
      "rating": "0",
      "text": "This movie does not make any sense from the middle onwards, some things were so random and unconnected to the film. the producer must have a very....unique sense of humour to think that humour was involved in people having every part of their body eaten, ripped off or decayed. well done! films these days just get better and better!"
    },
    {
      "rating": "2",
      "text": "Just Painful to watch, what the hell was that about, one thing this movie teach me it's to watch the trailer or read the plot before watching a movie ever again, and not judge the movie only by it's poster (rookie mistake). It was horrible, no sense at all, just stupid. The acting 0/10 those people didn't know what they were doing at all, it was all just a big mess."
    },
    {
      "rating": "6",
      "text": "Cabin Fever is a weird movie that doesn't even know what it wants to be until its half over. I would like to be an atmospheric horror film, but its too cheesy and has too poor acting to pull it off. It degenerates into an uncomfortably funny horror romp, in the vein of Dead Alive/Braindead or Feast. Yet Cabin Fever is still it's own kind of beast, from it's disgusting decomposing characters, to the ludicrous character development, and an ending that should have any horror fan laughing. Imperfect, leaning towards stupid, but still an entertaining entry onto the fringe of Horror."
    },
    {
      "rating": "9",
      "text": "This movie is everything Eli Roth set out for it to be. A fun, gross, horror-comedy that is a throwback to the movies of this genre of the 70s' & 80s'."
    },
    {
      "rating": "1",
      "text": "OKay, this film is not smart, is not intentionally funny and lacks any kind of story worth commenting on. The casting is awful, the performances are a joke, the shock factor is pathetic. This is everything that is wong with the horrow genre today. What I will say is that you won't be bored for the time you watch it as long as you are not alone, because you will simply be in constant amazement at just how poor a film can be."
    },
    {
      "rating": "1",
      "text": "Ok it sucks thats just a given. some of the it was just funny as hell not becuase it was well-crafted or anything just because it was so bad i.e \"pancakes\" what was that about. my advice if its get some friends get stoned get this this movie just cuz its so lame."
    },
    {
      "rating": "5",
      "text": "It was fun to see Rider Strong in a serious (well somewhat serious) role but I kept waiting for something scary to happen. If you take this not as a scary movie rather a infection/survival story you will probably be able to enjoy it a bit more. The human lack of compassion element is not even close to believable which really makes the films selling point hard to buy. One of Cabin Fevers saving graces however is one of the funniest ending in recent memory (and I don't mean unintentionally funny). I guess if you like special effects the blood usage in this movie is pretty good but I had a hard time with the movie as I was expecting something completely different than killer tap-water."
    },
    {
      "rating": "9",
      "text": "Two years in a row, new horror classics were released to theaters. First, The Ring, and now Cabin Fever, a deviously delicious exploitation horror from newcomer Eli Roth, who has great potential as a director. This is also some of the best horror camerawork I've seen in a very long time."
    },
    {
      "rating": "10",
      "text": "I love this movie intensely, and no I'm not stupid. My taste ranges from classics to good mainstream movies to avant garde, and I appreciate this movie on many different levels. It's smart, hilarious, and even a bit scary. Eli roth is the only true genius of horror movies working today. Rent this movie for \"bad movie night\" with some friends and you'll be in for a pleasant surprise. Go ahead and buy the DVD to for the hilarious claymation shorts of \"The Rotten Fruit\" and Eli Roth's commentary track, which is one of the best I've heard. This movie isn't lame or boring or stupid, people just don't understand it."
    },
    {
      "rating": "3",
      "text": "The obviously stuffed dear going through the guys windshield was just about funniest thing I've ever seen in a movie. Lots of unintended laughs."
    },
    {
      "rating": "0",
      "text": "This movie was so bad, I was tempted to actually go to Africa, find a child with ebola, drink their blood, and suffer the intolerable endless pain rather than watch more than 5 minutes. Were it not for the fact that i live on a different continent, i would hunt down and kill every single actor and writer involved in this movie. I would rather witness the deathrattle of my firstborn than see this movie again."
    },
    {
      "rating": "6",
      "text": "Prett good for a horror film. Some disturbing (in a good way) parts in it and solid acting as well. No real plot to it though, Which sort of sucks. Also it went quite a bit of time between parts where anything actually happend. Decent horror film and enjoyable to watch"
    },
    {
      "rating": "5",
      "text": "This is one of those movies that are crazy and stupid at the same time. But Is it entertaining, I would say so. The characters are so bad, thankfully your wish for them to be dead is granted XD It's actually kinda crazy b/c I didn't expect too much of it b/c I thought it was a killer in a woods like a slasher film. But instead, it's a disease. I wasn't expecting that so much lol part of nature is what's killing people. But I will give it credit that its better than how \"The Happening\" explained how people. Even though, the characters are stupid, but the idea was well done and it's entertaining with the weird moments. Thankfully I bought this for only $2 at my video store. It's just worth for the entertainment and funny moments."
    },
    {
      "rating": "7",
      "text": "Eli Roth is known in the horror genre for making grotesque, brutal horror films like they did back in 70's and 80's. That all kind of got started with this movie. A body-horror about a flesh eating virus infecting a bunch of dumb college kids partying in a cabin in the woods, Cabin Fever slowly ups the dangers that are keeping the characters from getting help. They may have to contend with a savage dog, isolation, and even some gun-toting rednecks, but what really keeps them from getting help for their deadly new skin condition is just their own stupidity. It's hard to take the movie seriously in any regard as the numbskulls manage to muck up every opportunity to save themselves. Luckily, it's clear Roth doesn't really want us to. The movie has a lot of humor to go along with the blood. Some of it dark, most of it dumb.The tongue in cheek style is appreciated as too much gloom and doom to go alongside the gore would have just made for a monotonously dark movie. One I don't think Roth would have been capable of pulling off. No, it was better that he stuck to gross fun and callbacks to some of his favorite horror classics. The influences are clear and the nods are appreciated. Especially since it's a fairly original concept holding it all together instead of just straight up copying. As a result, Cabin Fever is pretty good. A solid, original, and ultimately brainless horror movie. Worth a watch for genre fans even if it's just to see where one of it's more prominent names in modern horror got his start."
    },
    {
      "rating": "5",
      "text": "Don't ask me why I decided to watch this movie. I expected a horror movie with funny moments. It was pretty much the opposite. Lots of fun, gore, teenage-type dialogue, sex, partying. If you take it for what it tries to do, it's a decent attempt at movie-making. But almost the entire plot is pointless, until the very end where we get introduced to the point of the pointlessness. In a way, it criticizes itself by exposing the danger of ignorance. The entire movie was one big exposition of that very ignorance! I don't know if that's brilliant or stupid. I guess it's both."
    },
    {
      "rating": "7",
      "text": "This was a really good horror movie with some dark comedy undertones.  Its weird, nonsensical at times, but the actors actually pulled it off. I know this isn't for everyone, but with all the generic horror crap that comes out, I keep thinking I'd rather just rewatch Cabin Fever.  It won't be for everyone so I can understand the hate, but I personally put it with favorites.  (We won't talk about the sequels or remake though...ugh)"
    },
    {
      "rating": "9",
      "text": "I was really surprised by this one! It was so fun to watch, gory as hell, and also hilarious. I liked how it paid some homage to stuff like The Texas Chain Saw Massacre, The Evil Dead, and The Shining, while also keeping a tongue-in-cheek tone. The gore effects were disgusting, the acting and cinematography were good, and the ending was absolutely hilarious. It seems like a love-it-or-hate-it type of movie, but if you like movies like The Evil Dead and Slither, you'll love this."
    },
    {
      "rating": "6",
      "text": "Cabin Fever es una película muy interesante, entretenida y directa, pero al mismo tiempo es bastante asquerosa, visceral y explícita. Todo el conjunto funciona bastante bien pese a que el ritmo de la historia es un poco disparejo y el humor negro aplicado en varias ocasiones no siempre funciona."
    },
    {
      "rating": "5",
      "text": "I didnt think it was funny or great. The gore was good and it had some nude, those things are all elements horror movies need. However i never get the need to watch it again . The movies so Inspired by other horror movies. Your better off watching those other movies."
    },
    {
      "rating": "8",
      "text": "I really want to see a second one made. I loved the first one and I love Rider Strong. He's an amazing actor and the second movie wouldn't be the same without him."
    },
    {
      "rating": "0",
      "text": "Jesus, that was a bad movie! I agree with some of you who said that a lot of it did not make any sense and it was random. I couldn't agree with you more!! How in the world can anyone, especially critics give this pos a good review, i have no idea!"
    },
    {
      "rating": "2",
      "text": "An incredibly bad movie that lacks enjoyment, suspense, thriller and the surprise factor of a horror    movie....."
    },
    {
      "rating": "6",
      "text": "It's enjoyable enough that I could watch it without issues if it were on TV or something of that nature. I like the cast and I thought Eli did a good job with the gore but the story makes little sense."
    },
    {
      "rating": "6",
      "text": "Cabin Fever is directed by Eli Roth. Is there anything special about this film directing wise? No, because it"
    },
    {
      "rating": "10",
      "text": "epic"
    },
    {
      "rating": "0",
      "text": "Bad from the start to the end. Not to mention the second part (Cabin Fever 2)."
    },
    {
      "rating": "8",
      "text": "Really fun and entertaining if you dont take it too serious. And the film has a really good editing job!"
    },
    {
      "rating": "6",
      "text": "Cabin Fever is disturbing and strange, but unfortunately the film is way to repetitive, and dull to withstand. If your really looking for one of the great films of Eli Roth, look in the direction of Hostel for something developed a bit better."
    },
    {
      "rating": "5",
      "text": "This film is within the basic teen horror and, despite being unoriginal and overloaded with clichés that we have seen a thousand times in cinema, it works and entertains the public. It even manages to be better than many similar films, and we've seen many! Here, the enemy can be everywhere and, ultimately it turns out to be isolation itself. In fact, the title of the film indicates that, given that \"cabin fever\", from the point of view of psychology, is a kind of psychosis that arises in groups of isolated individuals in the same place for too long.The story is simple: five friends go to a forest hut to enjoy themselves after the end of the school year. However, they find there a very sick man with marked red skin. Frightened and fearing that it would be contagious, they try to drive him away but end up killing him. From there, isolated in the middle of nowhere, fear overwhelms them as, one after another, they begin to show signs of the same disease.Although the script is rather weak and predictable, tension and suspense are skillfully built and, ultimately, this makes the film effective in its task. Unfortunately, I agree with the opinion of many expert critics who pointed the finger at the director, Eli Roth, and said that he sometimes did not know if he was trying to scare us or make us laugh. In fact, the film is both scary and cynical and there are some scenes, particularly closer to the end, where the film seems to accentuate its sarcastic streak. For me, the final part was very weak and showed that Roth (who is also partly responsible for the script) did not know how to end his story. The climax is predictable and conventional and the way all characters behave prevents us from wanting anything other than to see them die, and quickly.The cast is sufficiently capable for the characters, which are the usual clichés of teen films and do not require effort from the actors. Rider Strong and James DeBello receive two of the strongest and most interesting characters, but the remaining cast hardly deserves a positive note. Joey Kern is highly irritating with so much hypochondria and individualism; Jordan Ladd and Cerina Vincent are there for being sexy at the sex scenes; Giuseppe Andrews is the stupidest cop I've seen in years. The rest is forgettable and does only what it really needs to do.Technically, it is a film that has not particularly caught my attention. Cinematography is good and uses forest scenes and filming locations skillfully. The special effects are limited to corpses, blood and signs of illness in the cast's bodies, but they work well and are truly frightening."
    },
    {
      "rating": "7",
      "text": "A bunch of friends decide to rent a cabin in the woods. I would say besides a killer hunting you down in the woods, this wood be the 2nd most terrifying thing that can happen to you in the woods. Catching some unknown disease that eats you alive."
    },
    {
      "rating": "7",
      "text": "I watched this movie after knowing movie's cult status and that it's director the same who directed Hostel. The movie was creepy and it gave me feelings of Evil Dead.For a debut movie, director did good work. Performance by the cast was okay, not effective. You are unable to connect with them and don't even feel sad for them. The movie was also lacking some good background music that could have helped movie to become more spooky and creepy.Overall, you can give it a try. You may enjoy it especially if you are fan of low budget B grade horror-dark comedy movies."
    }
  ],
  "recommendations": [
    "drag_me_to_hell",
    "malignant",
    "the_possession",
    "the_green_inferno",
    "ouija",
    "hostel_part_ii",
    "devil",
    "the_bye_bye_man",
    "house_of_1000_corpses",
    "dead_silence",
    "the_hills_have_eyes",
    "dark_skies",
    "chernobyl_diaries",
    "the_curse_of_la_llorona",
    "cooties",
    "the_messengers",
    "hostel",
    "annabelle",
    "wrong_turn",
    "insidious",
    "countdown",
    "the_grudge",
    "the_host",
    "slender_man",
    "venom"
  ]
}