{
  "id": 356,
  "title": "Call Me by Your Name",
  "starring": [
    "Timothée Chalamet",
    "Armie Hammer"
  ],
  "runtime": 132,
  "genre": [
    "Romance",
    "Drama"
  ],
  "description": "In 1980s Italy, a relationship begins between seventeen-year-old teenage Elio and the older adult man hired as his father's research assistant.",
  "releaseYear": "2017",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/mZ4gBdfkhP9tvLH1DO4m4HYtiyi.jpg",
  "categories": {
    "plot": 9.296296296296296,
    "acting": 9.62962962962963,
    "ending": 9.631578947368421,
    "soundtrack": 10.0,
    "cinematography": 9.428571428571429,
    "familyFriendly": 3.0,
    "funny": 9.0,
    "action": 9.25
  },
  "reviews": [
    {
      "rating": "10",
      "text": "Where do I begin? The novel grabbed my heart in January and by July I was touring Italy, reading passages on the beach in the town where its set, strolling through the side street in Rome where Oliver and Elio share their final night together. It is the gay romance of my lifetime, having grown up in the era of its setting, asking the same questions of myself that Elio does (only failing the question, \"Is it better to speak or to die?\"). Elio doesn't fail - he speaks and it changes his life, for better or worse. The movie captures that turning point in his young adulthood and brings it to glorious life, replete with the inevitable pain. Hopefully without spoiling anything, the fire that is lit within him will burn for a lifetime and into the viewer's heart during a crushing final scene that glances over every possible emotion but ending on determination and hope. For the love of God, don't leave this movie when the credits start to roll. And be a good movie citizen and let everyone you know who will be seeing it to do the same.  Guadanigno, the director, is painterly but nothing without the astonishing performances, especially from Timothee Chalamet who brings Elio to life in a way I haven't seen a young actor do since Timothy Hutton broke through in \"Ordinary People\" almost forty years ago.  Armie Hammer crosses the Rubicon with his performance as Oliver, becoming the master of his creative domain and I can't wait to see what he does in the future.  Stuhlbarg as Elio's father is kind, compassionate, clear-eyed and so very wise and his final talk with his son is almost Shakespearean in word and delivery. While the words are never spoken, his monologue is the paternal 'to be or not to be' that every gay kid would cherish and every straight kid needs to hear.  The women are all highly memorable and its a shame that they're a bit lost in the shuffle with the acclaim for the film (that none of them are American actors might play a part).  Call Me By Your Name is a work of cinematic art, the kind that is rarely given and even more rarely appreciated.  But it exists and thanks to its creators, from page to screen, I feel like a wiser, less cynical person. When is the last time a movie had that sort of effect. 10/10"
    },
    {
      "rating": "1",
      "text": "It's an introduction to normalizing pedophilia. While the movie isn't terrible, it doesn't change the fact it's about an underaged boy. If it was about an underaged girl and an older man, people would flip out."
    },
    {
      "rating": "10",
      "text": "An instant modern classic. Beautiful perception of first love and queer sexual awakening, married perfectly to the sensual Mediterranean summer. Hope this gets all the awards it deserves."
    },
    {
      "rating": "10",
      "text": "I loved this movie it was the perfect blend of romance humour and joy. It emphasizes the very best things love has to offer us. The actors have amazing chemistry and were so natural and lived-in their roles. The compassion between the characters really helps to understand how 2 people could fall in love."
    },
    {
      "rating": "10",
      "text": "I came here to give an undoubtly +A to this masterpiece fulfilled of feelings, an incredible acting, script perfection, huge work on cinematography, and a mark that Luca is one of the strongest cinema directors of this year, reminded me so much to what I felt with Io sono l´amore with Tilda Swinton, a film Luca made like 7 years ago. But the reviews here are proof that this is not a film that Hollywood, Oscars, are ready to accept. 70% of the negative reviews are not even reviews, are comments alledging to pedophilia, and it´s quite obvious that this comes from the fact that is a queer film. On the other hand, I quote a Slate article: \"In trying to think through these issues in Call Me by Your Name, I called Joseph Fischel, a Yale scholar who has written on the messy politics of age and consent for Slate. He noted our society’s intense focus on age and sexuality is a relatively recent notion, not a long-settled one, and that while the law may have a legitimate need to be blunt and rigid, our art does not. In my view, it’s reasonable to be disturbed by the unconventional relationship in Call Me by Your Name, but it’s not reasonable to say the movie endorses pedophilia, or really any kind of power-based abuse, just because it depicts that relationship. If we go down that censorious and unnuanced path with our art, very little will survive the trip.\"There are films more related to pedophilia, or that \"age-gap\" argument, and they are not even pointed. Like... Idk, \"The reader\"? This is a film of love. I adore it, it´s perfectly made & if you are open minded enough, it will leave you thinking in that first time your heart crushed. It´s beyond 2:30 minutes."
    },
    {
      "rating": "9",
      "text": "Wildly realistic and mesmerising. The director went into this film thinking \"I'm not going to make a gay movie, I'm going to make a romance between two men.\" and it shows. This is not a film to draw attention or make statements, like a lot of current movies do with this type of story. It is just simply, a human story."
    },
    {
      "rating": "8",
      "text": "“Call Me By Your Name” is an emotionally-triggering work of art. It is very well-adapted, and very well-shot, with daring performances from Armie Hammer and Timothée Chalamet. The setting is beautiful, and will make you long for a summer love you never thought you wanted so bad. The whole movie has a melancholic feel to it, and its ending is just emotionally-wrecking but it serves as a very satisfying conclusion. With the story, however raw and sentimental, being slow and monotonous, this 2-hours-journey was more about the visuals, the aesthetics (Italy, summer, love, swimming pools, greenery...) and the all the feelings that are sparked by the story."
    },
    {
      "rating": "10",
      "text": "Bravo! Bravo! This movie was simply incredible. Prior to seeing the film, I was not familiar with Luca Guadagnino's work, but now I want to see more of his films, and I will keep an eye out for him in the future. Call Me by Your Name is about the son (Emilio) of an eccentric professor who develops feelings for his father's new resident, who's name is Oliver. There is immediate sexual tension between the two characters, even though Oliver is markedly older than Emilio, who is only 17. Emilio hasn't revealed his sexual preferences to anybody, but it's easy to notice his immediate attraction to Oliver. Oliver attempts to keep his distance because he knows that developing a relationship with the younger Emilio may be inappropriate, given the circumstances. However, despite his resistance, he eventually caves in to his desires and becomes sexually involved with Emilio. You can sense Emilio's conflicted conscience throughout the film, and it builds until he is forced to confront questions that he has been purposefully avoiding. The film ends with closure and sadness, but there is a silver-living that leaves you feeling good and optimistic. The best scene of the film is unquestionably the one that comes at the end when Emilio has the impending conversation with his father about his relationship with Oliver. Such a heartfelt moment, and the professor's words were absolutely moving. Everything about this film was incredible. It made you feel as if you were there in Italy, and I felt the urge to book a ticket the next day. This is easily one of the best films of the year, if not the best. I give it a 9.5/10."
    },
    {
      "rating": "10",
      "text": "call me by your name is a movie that changes lives I really love each of the scenes, especially the scene of elio in the final scene really heartbreaking"
    },
    {
      "rating": "9",
      "text": "A jarring love story. Both Armie Hammer and Timothee Chalamet do incredible jobs here that pull at your heartstrings. The way Chalamet is able to be both a troublemaker and innocent, naive young man conveys both sides of young adulthood. The cinematography is gorgeous compared to other romantic dramas, being set in the picturesque background of rural Italy."
    },
    {
      "rating": "8",
      "text": "Love is love ... it has no gender. Less 'content' than in the book. Book continuation - 'Find Me' - has a happy ending."
    },
    {
      "rating": "10",
      "text": "An extraordinarily sensitive and exquisite portrayal of first love. The movie is filled with gorgeous scenery, enduring melodies and sly humor. But above all it is filled with tenderness, so much tenderness, between lovers, family and friends. The kindness and beauty in the movie is an antidote to the toxic ugliness of our times (with some of that ugliness displayed in the \"reviews\" of people who bash the movie for their own twisted agenda without even seeing the film)."
    },
    {
      "rating": "10",
      "text": "Superb film with flawless acting all around, but especially a breathtaking performance from Timothee Chalamet. Chalamet gives what might be the best portrayal of a teenager male in film history."
    },
    {
      "rating": "10",
      "text": "Masterpiece. Script, Acting, photography, and love for cinema. You can feel the passion of the actors, director, and everyone involved in this project. This is cinema. All those hate critics are just a sympthom of a sick society. Nothing there is constructive or solid. Thank you Guadagnino."
    },
    {
      "rating": "10",
      "text": "Saw this movie at it's final showing at the Sundance Film Festival and it's final moments did something to me that only one other film has ever dared to do, with limited success. This movie drives home every buried emotion a human has ever had by daring to be unabashedly romantic, and so cheesy it becomes authentic. Never has a script enticed such an emotional response from my core. The last time I remember a film even approaching the emotional grandeur of Call Me By Your Name was The Place Beyond the Pines. Prepare to sit through the last moment of the credits, as the final shot of the film is the most powerful shot ever committed in a romance movie. Regardless of sexual preference, regardless of how emotionless you are, just give yourself over to the life-improving movie that is Call Me By Your Name and let every stifled emotion you didn't know existed inside you come to the surface."
    },
    {
      "rating": "10",
      "text": "Damn close to a perfect movie.  By far the most anticipated movie of my year, and it on no accounts disappointed.  Slow build up to such an impactful climax.  No spoilers meant, but I can't stop thinking about the end/credits scene with the beautifully constructed Sufjan Stevens song (buy the soundtrack!).  Can't wait to see this again, because I'm still wrapping my head around it."
    },
    {
      "rating": "10",
      "text": "The story will always be precious, moving and unforgettable. But being able to read the book for about three times, I was still wrecked emotionally, my heart temporarily expired after that last scene, and I'm pretty sure this would get stuck in my head again for a while. I believe this is because of the heartfelt performances of Chalamet, Hammer, and Stuhlbarg. The cinematography and screenplay reminds me of \"Maurice\" by James Ivory (which makes sense for he also had written this film). P.S. This is one of those films that you won't forget for a while, and if you do and remembered it all again, will make you feel it's more precious and timeless as before."
    },
    {
      "rating": "10",
      "text": "Worth your money. Absolutely beautiful. After reading the book, I went in with high expectations, and they were met. Guadagnino does an excellent job of bringing the Italian summer to life."
    },
    {
      "rating": "10",
      "text": "More than just a movie, Call Me By Your Name is an experience. It's immersive, inviting you into this gorgeous Italian summer and truly putting you in these characters' shoes, with an empathy not many movies are able to evoke. There is a perfect balance between realism and idealization. It plays like a memory you hold very dear and romanticize, which very much captures the book's feel. The performances are subtle and the characters feel incredibly real, but there's also a dream-like quality to the entire thing that makes it a truly delicious watch. Speaking of the performances, Armie Hammer is incredible Oliver, a character who could've easily been one-note. Oliver's a confident, sometimes borderline rude American grad student who is given no backstory or depth in the book, as we know him only from Elio's point of view, but Hammer's understated performance gives the character a vulnerability that makes you see right through him and understand him without being offered any information at all. Michael Stuhlbarg is also great as professor Perlman, delivering a speech that is in a way a more tender and intimate version of Spencer Tracy's in Guess Who's Coming To Dinner. But even though the entire ensamble delivers, it's Timothée Chalamet's performance that truly makes the movie. In his breakout role as Elio, he delivers what is without doubt one of the strongest performances of the year, if not the single best one. It's him who could make or break the movie, and his portrayal of this intelligent, strange, vulnerable young man is one that crackles with life and elevates this movie to a masterpiece. He's a joy to watch, and his Elio is a fully realized person you feel you truly know by the time the credits role -- or maybe even more *while* the credits are rolling, as a gorgeously haunting original song by Sufjan Stevens plays.All in all, this movie is deserving of every word of praise it's been getting, and it does an incredible job at portraying real people bringing a beloved book to life."
    },
    {
      "rating": "10",
      "text": "I left this movie with a knot in my stomach and a lump in my throat. It’s simply stunning. The acting, directing, music, it all just works. I left the theater feeling haunted. I will not post any spoilers, but bring tissues."
    },
    {
      "rating": "10",
      "text": "My heart was aching through most of it...aching for the longing the protagonist experienced, aching for the pain of the mixed signals between he and Oliver, aching for the anticipation for what he hoped might happen, aching for how things might all end up. Meanwhile, the cinematography literally had me crying that I never had the great fortune to grown up in such a beautiful, idyllic environment.    The amazing Michael Stuhlbarg almost managed to steal the whole movie in a late scene, and had me again wiping away joyful tears.    I'm currently relishing the audiobook version (narrated by Armie Hammer) and toying with the idea of seeing the movie a second time before it leaves theaters."
    },
    {
      "rating": "10",
      "text": "There is no doubt everyone has a story that mirrors the one shown in this movie.  For it to be done with such great actors, a gifted director and with such lovely scenery makes this a once in a lifetime film.  The movie follows the book quite closely. Timothee Chalamet is perfection.  Stole my heart.  Sufjan Stevens songs fit perfectly as well.  The final scene over the credits is magic."
    },
    {
      "rating": "7",
      "text": "At first, the film felt a bit like a modern version of Blame it on Rio, with the older guy, living with the under-aged kid on vacation, hooks up with him in the paradise setting.  Unlike Blame it on Rio, this hook-up is fully endorsed by the kid's parents, and it, therefore, obviously, doesn't have the same taboo feel to it.  It also lacks Rio's sense of humor.  The critical drawback of this film is how timid it is with respect to the gay sex scenes.  I mean, they show SO MUCH MORE of the kid hooking up with the local girl, yet when he hooks up with his older male lover, they pan away.  The director of this film should look to Greg Araki or the makers of Queer as Folk to see how it's done tastefully. What saves the film is the brilliant conversation between father and son, reflecting on what the son had in this particular relationship. A model for parents of gay children, I would guess."
    },
    {
      "rating": "10",
      "text": "This movie profoundly moved me and everyone around me in the theater. I think people are moved by the movie because it transports them to a time and place where people are kind and feeling are pure."
    },
    {
      "rating": "8",
      "text": "A beautifully shot, excellently acted and overall wonderful gay romance, and a faithful adaptation of the source material. But the novel is definitely better."
    },
    {
      "rating": "10",
      "text": "Una historia de amor diferente a la que estamos acostumbrados a ver, adicional a ello, la actuación de Timothée Chalamet es espectacular y la fotografía encantadora. Sin duda alguna una gran película."
    },
    {
      "rating": "10",
      "text": "Call Me by Your Name is an heartfelt and beautiful love story. Luca Guadagnino is an incredibly talented director (Italians are the best :) ). I really loved Sufjan Stevens songs as well and the closing credits' scene is really powerful. This story feels real and authentic. I would have loved just a little bit more of nudity. It was a bit too chaste"
    },
    {
      "rating": "10",
      "text": "Italy, 1983. To the villa of Professor Perlman (Michael Stuhlbarg), the father of 17-year-old Elio (Timothée Chalamet), arrives assistant Oliver (Armie Hammer) for the summer. Everyone loves him: from the maid Mafalda to local beauties. But most of all he is sympathetic to the young Elio, who can not fully determine his feelings for the guest. Italian director Luca Guadagnino presents the adaptation of the novel by André Asiman about the first love and its complexities.\"Call me by your name\" - like a long-awaited trip to a country house from a noisy megapolis. Here, the silence of a summer day is broken only by the call for lunch or a horn of a bicycle. Peaches are ripening on branches, pending until they are ripped off. The pool is always filled with water and waits for someone. Here you go out for breakfast, when everyone has already had lunch. And the nights are as hot as everyday life: discos, walking with friends, swimming in the lakes. And in this idyll he invades, americano, riotous and bright, like a wind on a rocky cliff, bringing confusion to Elio's plans for the summer. Oliver introduces the professor's son to new feelings and experiences, which are unknown to him. But Guadagnino does not go into tragedy, he adapts Asiman's novel brightly and sometimes funny. The filmmaker took the best of Asiman's novel and smoothed out the rough erotic edges, so the scenes of the intimate closeness of the characters were shot as decently as possible, and even the episode with peach can not be called very vulgar. Guadagnino removed from the adaptation the girl Vimini, who was sick with leukemia, he decided to concentrate on the feelings of the main characters, and not on the secondary lines. But also the director deliberately excluded Elio and Oliver's meeting 15 years later, so as not to turn the film into a complete statement, but leave a feeling of understatement, as well as between the characters themselves.During one of the dinners at the villa, one of the Perlman's guest says the phrase: \"Cinema is not a reflection of reality, but a filter for it.\" That Asiman in the novel and Guadagnino in the film created a partly fabulous story of the first love with its difficulties and delights. \"Call me by your name\" - a coming of age drama (magical in its atmosphere), a movie about growing up through the first experience and about what it means to be alive and free."
    },
    {
      "rating": "10",
      "text": "What a great film. Definitely the best of 2017 so far. The script is superb, the directing is on point and the cast was just flawless. Timothée Chalamet specially did a great job here. I really feel like rewatching it, to be honest."
    },
    {
      "rating": "9",
      "text": "It's not Pedophilia at all. The age of consent is 16 and Pedophilia is described as an illness where someone is attracted to a pre pubescent boy or girl. The boy in this is 17, well past puberty. The guy is in his early 20's. My friend (girl) was 17 and started dating a neighbour (guy) who was 33. They are happily married. It wasn't Pedophilia, it was love and those who claim this is any different are completely ignorant. Beautiful film. Simply beautiful. I suggest people grow up and stop being so overly sensitive. Bad stuff happens, and people need protecting, but not at age 17, I certainly felt mature enough, to make my own decisions, by then. Stop treating teenagers like they are not intelligent and can't make their own decisions, it's degrading and disrespectful."
    },
    {
      "rating": "4",
      "text": "Very pretty film. I'm sure the Italian Tourism Bureau loves it.  But the characters and their problems are almost unbelievable, and certainly not something I could sympathize with, much less empathize with.  And such unbelievable parents - really!The phrase \"white people's problems\" came to mind while I was watching it."
    },
    {
      "rating": "10",
      "text": "Call Me By Your Name is a flawless film that will stick with you long after the credits roll. This film is a long, slow-burning juggernaut that will hit you right in the feels. The acting across the cast is superb, with special shout-outs to Timothee Chalamet, Armie Hammer, and Michael Stuhlbarg. The characters are incredibly real and dynamic, and this film feels so intimate and private that you'll feel like you shouldn't be watching these really vulnerable people. Call Me By Your Name incorporates the best parts of timeless Italian Cinema. The visual motiffs of water, the flies on the wall, and the music matching perfectly to what is happening on screen all propel this film to greatness. The still moments dominate this film, but the acting is so brilliant you'll be able to read everyone's mind. This is a must see for art-film lovers!"
    },
    {
      "rating": "9",
      "text": "First Love and Sexual Awakening are some of the ripest, most universally resonant themes in any art-form, so we've all seen them handled before many times. Call Me by Your Name pulls off the neat trick of feeling simultaneously new and timeless: a story you've seen before yet, somehow, haven't. I keep turning this film over and over in my mind, looking for a flaw, and I can't find one. The performances - Timothee Chalamet and Michael Stuhlbarg in particular - are excellent. The script builds drama so incrementally you hardly notice it, in such a way that the final 20 minutes, despite resisting any melodramatic contrivance or hysteria, overwhelmed me emotionally. Kudos to director Luca Guadagnino for realizing this delicate tone with evocative but unfussy framing, bang-on casting, and marrying a modern perspective with a classical sense of pace and purpose. Call Me by Your Name is a gorgeous ode to the ecstasy and agony of growing up; to the sunshine of discovery and the shadow of wisdom; to the \"mystery of love\" we spend our whole lives puzzling over."
    },
    {
      "rating": "10",
      "text": "An ode to classic cinema, yet with a contemporary topic, Call Me By Your Name is one of the most spellbinding films to hit theaters in quite a long time. Telling the story of two young gay men in love in Italy in the 1980s, it almost has a cinema verite like quality to it. With a warm, Mediterranean color pallet, and a languid pace that gives it the feel of an everlasting summer, every frame of the film is captivating. It may take a while to build to its climax, but when it does, it is really something to behold. Starring Armie Hammer as Oliver, and Timothee Chalamet as Elio, these two young men completely sell their roles, and enrapture the audience in their heartbreaking performances in the process. Michael Stuhlbarg, who plays Elio's father, delivers a final speech to Chalamet that transcends anything I've seen in film this past year. You may feel the film's run time at points during the film (which clocking in at 2 hours and 12 minutes, isn't exactly brief), but you might just want to linger on those moments. You'll want to soak up every ounce of this treat before its all over. After all, there'll come a time when all of us can no longer experience the magic of movies. Let's just hope it doesn't come too soon, there's still so much left to learn."
    },
    {
      "rating": "10",
      "text": "Timothee Chalamet truly brings Elio to life with his beautiful performance, you will fall in love with both the actor and the character of this joyful and heart breaking master piece. Timothee's performance is further enhanced by the amazing Armie Hammer who gives a wonderful performance as Oliver, Elio's love interest and best friend. Luca Guadagnino did a truly amazing job of sticking to the book from which this movie comes from while leaving an opening to create a sequel and overall he did an amazing job of directing this once in a lifetime project."
    },
    {
      "rating": "10",
      "text": "This film was amazing, very emotional. A full-hearted romantic masterpiece. A movie that makes the audience can't stop crying, what a beautiful cinematography and best soundtrack ever. What a sad ending, just would like to see the sequel if Luca will make the sequel. The book and film are very consistent, Timothee Chalamet is perfect Elio and Armie Hammer is perfect Oliver. Although Armie said he hates the dancing scene, the dancing scene is my favorite scene."
    },
    {
      "rating": "10",
      "text": "CALL ME BY YOUR NAME is one of the most beautiful, truthful movies you will see. Its poetry; an ode to love, life and discovering who you are. Its ravishing from beginning to end. I wont go into details or the plot, thats something you should experience for yourself. I do have one thing to say. I've read on this site some negative reviews suggesting the glamorization of pedophilia. THIS IS COMPLETELY FALSE! Our society’s intense focus on age and sexuality is a relatively recent notion, not a long-settled one, and that while the law may have a legitimate need to be blunt and rigid, our art does not. In my view, it’s reasonable to have different opinions of the unconventional relationship in Call Me by Your Name, but it’s not reasonable to say the movie endorses pedophilia, or really any kind of power-based abuse, just because it depicts that relationship. (there is not ONE predatory moment between the two characters in the film.) If we go down that censorious and unnuanced path with our art, very little will survive the trip. Oh, and I also read a negative review that said if this was an older guy and a younger girl, people would freak out, well,  thats already happened. Its called DIRTY DANCING. Same age difference. Im done now."
    },
    {
      "rating": "10",
      "text": "Incredible and beautifully crafted film, it’s sensual without the need of being vulgar, and it’s so romantic and beautiful. Both Timothée and Armie did amazing jobs"
    },
    {
      "rating": "10",
      "text": "Luca Guadagnino's latest is beautiful to watch -a motion Caravaggio painting, and marvelous to ponder -a moving rumination on the bated joy of first love."
    },
    {
      "rating": "10",
      "text": "Amazing. That's the word i would use to describe this film, it is a beautiful story about the relationship between a 17 year old boy and a 24 year old, finally LGBT movies are getting the mainstream attention they deserve. Also all the people yelling about paedophilia clearly don't understand the message of this film. It isn't about normalising pedophilia it is about love and passion."
    },
    {
      "rating": "10",
      "text": "Beautifully acted, adapted and directed. This movie is a gem from start to finish, it deals with one of the most relatable things is live which is first love, and it manages to portray it in such an innocent and calmed way. Couldn't be any better."
    },
    {
      "rating": "10",
      "text": "\"La naturaleza tiene maneras extrañas de encontrar nuestros puntos débiles\"- Call Me By Your Name Solo diré que es PERFECTA."
    },
    {
      "rating": "10",
      "text": "Call Me by Your Name is directed by Luca Guadagnino and stars Armie Hammer and Timothée Chalamet. I first heard about this back in February, when it premiered at Sundance. I remember the reviews were near perfect. After finally having seen it last night, I can tell you that not only were the rumors true, but they fall short. I’ve thought long and hard about this before I made up my mind. Call Me by Your Name is one of the best films I have ever seen. I’m not kidding. This is a staggeringly good film. There isn’t a scene, even a moment that feels out of place. Every frame is absolutely perfect. Armie Hammer gives the performance of a lifetime. Somehow though, he doesn’t even give the best performance. Timothée Chalamet is insane. This IS the best performance of the year, and if he isn’t at least nominated, I will just leave the Oscars. The cinematography is stunning, the soundtrack is euphoric, and the dialogue is impeccably good. Unlike The Last Jedi or Dunkirk, or any other film I have given an A+ to this year (except maybe Blade Runner), I have no trouble saying that this is the best film of the year."
    },
    {
      "rating": "9",
      "text": "LIFF31 2017 #2\"Nature has cunning ways of finding our weakest spot.\"There is no doubt how incredibly beautiful \"Call Me By Your Name\" is. Putting aside your age and sexuality, the film offers more than romance. It's not sad or tragic, but a peaceful one. It's all about falling in love. What's been said by many will be repeated here, so none of this is gonna be new to you, because it's all true.Armie Hammer, Michael Stuhlbarg, and newcomer Timothée Chalamet all deliver terrific performances. Not a weak or unconvincing actor in sight. All of them were perfectly cast in the roles and there was no shred of doubt during the emotional parts. Especially Stuhlbarg monologue towards the end is as moving as anything I have ever seen.The way Luca Guadagnino manages to play on your emotions and present gay romances is really mesmerizing. The warm and summer spectacle of Italy makes you want to be there. With the scenery, sunny waters, and the food which look so good, all through Sayombhu Mukdeeprom brilliant cinematography. It's paradise.Even the sexual tension never once came across pornographic. I don't mind sex or nudity in movies and people seriously just need to stop being so sensitive about it. Ever thought that making little things a huge deal only makes it a huger deal. Or your sloppy description.The sexuality in this film is more of an emotional connection you personally experience through the characters. And you don't have to be gay to enjoy those scenes. It avoids the typical tropes you find in movies that isn't as perfectly presented as this.This is a truly special movie that I easily got lost in."
    },
    {
      "rating": "10",
      "text": "Saw this and Lady Bird within 2 days, and as much as I loved Lady Bird, Call Me by Your Name lingered in my brain days after. Coming from a similar situation to the movie's story (without the gorgeous Italian backdrop), I can relate to Chalamet's spot on performance. Even his most simplest reactions to various situations were insanely natural. What a performance out of this kid who I never heard of until Lady Bird! Not for a second did I feel like I was watching an actor do a job. It was like being there, feeling his every emotion. Armie Hammer has such screen appeal as well. I'm sure we'll be seeing a lot more of him. By far my favorite film in years. Oh folks, the reviews with zero? Those aren't opinions, that's just 100% pure ignorance and in some cases, hate. Must suck to go through life like that, but they don't know, which sucks even more."
    },
    {
      "rating": "7",
      "text": "Having partial Italian blood in my veins, I particularly enjoy when that culture gets some rare, overdue representation in cinema. Now, after the opening credits of Call Me by Your Name kick off the film’s wide survey of art history’s continual impact on Italy’s culture, temptation strongly urges me to book a flight to Italy! Director Luca Guadagnino (A Bigger Splash) succeeds at raising immediate love for Italy’s artful history with a masterful focus on the little details crafted to immerse you into the Jewish-American-Italian-French family over the summer.The production crew’s delicate artistry swells your eyes, thanks to Guadagnino’s relaxing artistic direction. The cinematography by Sayombhu Mukdeeprom overblows the sun’s highlights in the frame until the snow peacefully mellows out the inner chaos. The thin, loose fabric costumes designed by Giulia Piersanti practically weep while they turn their wearers into zombies decomposed by pain. To top it off, the calm dancing musical selection’s reflective piano tune juxtaposes the visualized teen angst.Those small enriched elements craft the protagonist of the story, Elio, a teenager who hunches over the piano, overcome by his insecure fervor, his space evaded by flies, supposedly awaiting someone like St. John the Baptist to pull him out of his hell hole. Then once Oliver, the family researcher, comes to stay over the summer, he spends extra time in the backyard pool alongside his new friend, a confusing curiosity in mind.With each performance fueled by the struggle against the anonymous, the two lead characters grow up over the painful season. The harsh summer weather outside seems to kill them both slowly in support to one of the feature’s many stated philosophies: “nature has a cunning way of finding our weakest spot.”Though unfortunately, some cultural issues outside the visual cues still taint the experience, including a couple of stereotypical old, angry comic relief Italians who disrupted the natural flow of the genre. Oliver’s story also lacks enough establishment: where does his romantic infatuation to a seventeen-year-old boy originate? The closest thing to a justification about his romantic spark is the Jewish background they both share, which still lacks needed prominence within the relationship.The two other female roles, Elio’s mother and girlfriend, seem to subsist just to comfort his pain, the mother in particular could have been written out completely without hurting the script. Yet European masculinity carries even greater problems in depiction. Oliver is the one representative of America, a country with a higher age of consent than Italy, so this film supposedly encourages pedophilia, as if the United Kingdom believes their legal system has a better understanding of existentialism than the United States.Although, the homosexual love still rings true in its natural approach. It starts innocent enough as Elio and Oliver just so happen to share a bathroom, the toilet in plain sight from the bed’s perspective. As time goes by, the connection they share turns into one of forbidden fruit. In one scene, passion between the two brims in the majesty of the mural of Adam’s creation, in another, Olio’s loneliness resorts him to ejaculate into a cored apricot. The chemistry between Armie Hammer (The Social Network) and Timothée Chalamet (Interstellar, Lady Bird) creates the impeccably heartful moments, tension set by emphasized distance in the framing.But most of all, the technicians’ subtle cues acutely capture the essence of being a teenager trying to figure out sexuality: the crew dresses Chalamet to look scrawny in his wardrobe, his hair messed up, his strut insecure, as editor Walter Fasano (A Bigger Splash) completes it by lingering on the star’s complexion to show a teen's dim psychology. These elements, when together, stick hard into your arteries a good long hour after the motion picture’s emotive final frame.Looking beyond the uneasy subject matter, a very plain application can be taken away: love hurts. Even I myself, a heterosexual, felt Elio’s heartbreak before, since an old desire to love a certain someone back in high school continues to hurt me today; I know loving somebody you cannot hold hurts more physically than emotionally. Despite those unpredictable moods, just remember: loved ones, including friends and family, not just romantical partners, are always there offer free hugs. These are the ones who most want to see the best come out of you and take action in your life to make sure you get to your highest point. This key takeaway of Call Me by Your Name reminds us all that whatever, however, you think, you deserve love."
    },
    {
      "rating": "10",
      "text": "The best film of 2017 it might be one of the greatest of all time love all the parts of the film and I want to read the book for get aprofunded on the history and I hope that had a part 2"
    },
    {
      "rating": "10",
      "text": "A masterpiece, spetacular, amazing, perfect! There're so many words that i could use to try to describe what I felt when I watched this movie, but none of them would trully describe the feeling. I wanted to see this film since sundance when it got great reviews, but i had to wait almost a year to watch, maybe that was good, because when the movie started I was so excited and this feeling continued until the end of it, actually even after it, because i had the feeling inside of me that i wanted to visit italy and study/read more about the 80's, the reason i felt this was because the whole movie it's well written and directed, probably James Ivory, the writer will win the oscar, and if it does, it will be deserved because the way he wrote I belevied in Elio and Oliver love and it made me feel like i was there with them the whole time, and talking about this two, Armie Hammer, who should have been nominated for best supporting actor and Timothée Chalamet is a star. Everyone should watch this movie"
    },
    {
      "rating": "10",
      "text": "The best movie of the year! A romantic ode to first love and heartbreak and an ending that is a master class in acting. The the latest from Luca Guadagnino (I Am Love, A Bigger Splash). Incredible acting by Timothy Chalamet."
    },
    {
      "rating": "10",
      "text": "Easily one of the best films of the year. Beautifully acted performance by the cast and wonderfully written script. Armie Hammer and Timothee Chalamet had an undeniable chemistry. It is more than just a love story and the joy of meeting that one person, it is about the pain and the heartache of that first love. What is even more excruciating, is when your fist love is of the same sex and you are just coming to terms of who you are."
    }
  ]
}