{
  "id": 4640,
  "title": "Candyman",
  "starring": [
    "Yahya Abdul-Mateen II",
    "Teyonah Parris"
  ],
  "runtime": 91,
  "genre": [
    "Horror",
    "Mystery",
    "Thriller"
  ],
  "description": "Anthony and his partner move into a loft in the now gentrified Cabrini-Green. After a chance encounter with an old-timer exposes Anthony to the true story behind Candyman, he unknowingly opens a door to a complex past that unravels his own sanity and unleashes a terrifying wave of violence.",
  "releaseYear": "2021",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/dqoshZPLNsXlC1qtz5n34raUyrE.jpg",
  "categories": {
    "plot": 8.1,
    "acting": 8.11111111111111,
    "ending": 7.0,
    "soundtrack": 9.0,
    "cinematography": 8.0,
    "familyFriendly": 3.0,
    "funny": 5.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "10",
      "text": ""
    },
    {
      "rating": "10",
      "text": "Candyman is one of the scariest movies ever. Candyman has brilliant acting from Tony Todd & Virginia Madsen. Candyman is a horror classic that's praised for its originality, eerieness and relentless intensity. He dares you to say his name in front of a mirror 5 times."
    },
    {
      "rating": "10",
      "text": "Candyman rules, one of the best of the 90's. ............................................."
    },
    {
      "rating": "8",
      "text": "You'd think perhaps from the title that the film wouldn't be as good as it turned out to be. Based on Clive Barker's excellent, intelligent and very chilling book, Candyman is a very good film.The production values are great and very stylish. The cinematography is beautiful, and the setting and lighting is suitably atmospheric. The atmosphere also really helps, and the more disturbing bits do not thankfully come across as laughable or fake, thanks to the atmosphere and other factors it is genuinely chilling. Phillip Glass's hypnotic and goosebump-inducing score is also very effective, Bernard Rose directs brilliantly, the story is always gripping with Candyman's origins especially well done the dialogue is thought-provoking, intelligent and fits each scene accordingly.The film is a good length and goes at a well-judged pace. The performances are impressive too, Virginia Madsen is simply terrific in a difficult role while Tony Todd is absolutely terrifying down from his posture to his voice. In fact, for me the only real downside was the ending, it was a sort of \"it's not over\" ending, and for me(I may be biased as I am not a fan of this type of ending) it felt tacky. In conclusion, an atmospheric horror film that delivers on pretty much every level. 8/10 Bethany Cox"
    },
    {
      "rating": "8",
      "text": "This is how film should look. Great balance between art shots and big shots. Not the most ambitious but it doesn't need it; it balances and works so well. The angles are beautiful. It has excellent sound. The tone, the characterisation, the plot development and the emotions are so well constructed that this is close to the perfect noir horror without obvious noir references. Stunning acting, awesome direction and well-constructed scary scenes with a serious foreboding tone make for a fantastic experience. One of the best horror movies of all time with a stunningly dark tone."
    },
    {
      "rating": "9",
      "text": "This isn't a perfect movie by any means. There are aspects of the plot that never get explained or just flat out don't make any sense. Like why exactly a black dude who had his hand cut off, a hook shoved into the stump, and was covered in honey to be stung to death by bees for impregnating a white woman is associated with candy. Wouldn't something like Hookman or Hiveman have been more fitting? Go along for the ride though and you'll be treated to a stomach churning nightmare with a sharp socio-political edge.The gore in this is phenomenal. Bernard Rose filled the picture with gnarly deaths and bloody sights galore that feel distinctly Clive Barker despite the author himself not being in the director's seat. Maybe even moreso than Nightbreed which he actually DID direct. So if you liked Hellraiser there's a good chance you'll enjoy this too. Kudos to them as well for managing to make the titular villain scary when unobscured in the broad daylight. As we've learned from the likes of Freddy Krueger, oftentimes seeing the monster in full view severely robs then of their fear factor. Not the case here. Now if only they had made it a little easier to understand what he's saying at times...A lot of effort went into crafting a legitimate narrative that goes beyond merely watching people get murdered and tackles socially conscious themes such as racial inequality. As I said at the start of this review, there are holes and illogical aspects, but it's almost easy to overlook them entirely in the face of how good it is at pulling you into the mystery, bloodshed, and terror. It takes a while for Candyman to show up, but the time without him is well spent as we watch the protagonist investigate urban legends which effectively builds the tension for his inevitable arrival. It also gives us a chance to really take in the rundown inner-city environments which along with the soundtrack that at points sounds like carnival music being played on a pipe organ makes for a very distinctive atmosphere.It would be remiss of me to not mention the acting. Normally in older horror flicks like this you get at least one or two lackluster to bad performances. Here though the cast is uniformly fantastic. The standout being Virginia Madsen in the lead role. She has to do most of the heavy lifting as her character's life is upended by the appearance of her supernatural foe. A task she proves more than up for as she carries us through the whole range of emotions allowing us to really grow attached to her character.This is a top-notch horror movie that pulls from real world issues to give its exquisite brutality some extra depth. As with Pinhead before, I got some strong A Nightmare on Elm Street vibes. Whether it's the dreamlike qualities of the encounters with Candyman or the memorable personality and backstory that bring the ghoulish killer to nonlife, the influence of Wes Craven's classic can be found throughout. Barker and Rose did their own original thing with the similar elements however, and that's what ultimately left me loving the film in spite of its bumps.9.3/10"
    },
    {
      "rating": "8",
      "text": "Honestly it turned out to be a pretty badass movie and sorta spooky, at the start it seemed a bit cheesy and lame, but it came good, and there's some pretty sick scenes in it aswell"
    },
    {
      "rating": "7",
      "text": "I watched Candyman when I came to know that it's sequel is coming after 29 years.I enjoyed watching Candyman. It is both, spooky and creepy. What I mainly enjoyed about the movie is the development of the plot at psychological level. The portrayal of urban legend by Tony Todd was great and acting by Virginia Madsen is also good. You can feel her in what she is going through.Film also had some problems. The gory scenes could have been better. The ending was little surprising but unnecessary.Overall, it's a fun to watch and you will enjoy it."
    },
    {
      "rating": "7",
      "text": "Graduate student researches the urban legend of a murderous spirit called \"Candyman\", who you can summon by saying his name five times in a mirror in a poor area of Chicago, gets hypnotised by him, kills some people, steals/saves a baby and is slow to realise her husband is obviously cheating on her."
    },
    {
      "rating": "8",
      "text": "Classic horror movie with an amazing performance by Tony Todd. Soundtrack is beautifully done and despite the classic plot of \"people doing dumb things in horror movies\" its still a well written film from start to finish."
    },
    {
      "rating": "8",
      "text": "Brilliant. 10 for movie, 6 for scare, leaving it with a solid 8.The acting was brilliant and it comes together so nicely, LEAVING NO ROOM FOR A 2020 REMAKE! Grrrr, how could they.."
    },
    {
      "rating": "8",
      "text": "This movie is so great! Compared to the recent sequel, it's sad the original still outshines the 2021 Candyman. It was scary, story is incredible, acting is incredible. Tony Todd is a great horror movie villain and Virginia Madsen is perfect in this film. Do yourself a favor, watch this and don't watch the recent sequel."
    },
    {
      "rating": "0",
      "text": "Interesting soundtrack, but the movie itself is pure trash. And more comic than scary."
    },
    {
      "rating": "6",
      "text": "I liked the mysterious tone with which it begins, but it began to fade as the plot progressed to accommodate the predictable horror.It works but not as I imagined."
    },
    {
      "rating": "8",
      "text": "A slasher film that turns darkly romantic near the end. What's not to respect about this film"
    }
  ]
}