{
  "id": 3630,
  "title": "Cannibal Holocaust",
  "starring": [
    "Robert Kerman",
    "Francesca Ciardi"
  ],
  "runtime": 96,
  "genre": [
    "Horror"
  ],
  "description": "A New York University professor returns from a rescue mission to the Amazon rainforest with the footage shot by a lost team of documentarians who were making a film about the area's local cannibal tribes.",
  "releaseYear": "1980",
  "mpaaRating": "NR",
  "imageUrl": "https://image.tmdb.org/t/p/w500/q8TR9TEePfYCFNvOo85Pwcd5pO5.jpg",
  "categories": {
    "plot": 6.0,
    "acting": 4.0,
    "ending": 8.0,
    "soundtrack": 8.0,
    "cinematography": 5.0,
    "familyFriendly": 4.0,
    "funny": 5.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "8",
      "text": "What can be display in a movie? What is the line that cannot be crossed? There are many different answer for these questions. If you think that there must be some sorth of morality in what can be display this is not a film for you. For me is pretty simple. We live in a society who has lost all sense of modesty and morality whatsoever so what's the point to censor something? Who can decide that something cannot be showed? There isn't a common sense of decency and there is no sense of shame. So for me there's no common line. The only line is the personal one. I don't wanna see extreme violence? I simply avoid that contents. After this necessary premise I can say that Cannibal Holocaust marked an era. It innovated and almost created the \"horror\" found footage genre and represent a milestone for the cannibal movies. It has influenced a large part of splatter/horror directors and its contribution to these genres it's incontestable.The film has been very successful and is certainly a cult thanks also to the stories that surrounded the production and the various charges to the director. The plot is simple but innovative for its era and the director's work and special effects are remarkable. Riz Ortolani's soundtrack is amazing and iconic. Inspired by Mondo's movie, Cannibal Holocaust is extreme, violent, graphic, hyperrealistic (SPOILER: six animal real deaths appear onscreen - killed by the actors- and these are indeed difficoult to watch, especially the turtle, the point of no return in the characters' story).It is one of those essential films, a must watch, everybody knows it, talks about it (even without seen it) but you have to watch it in order to appreciate it (or don't appreciate it) and really judge it. And in the end the viewers are nothing more than the characters of the executives producer in the movie. They found this film, they are orrified by it, by the extreme violence, by the cruelty they see on screen, by the unjustified brutality, but not once they stop looking. We are just like them. We watch this kind of movies as we watch everyday violence, we want to see how much they will show, how far they have gone, what lines they cross. And at the same time we test our limit, our endurance, what we are willing  to watch before we stop looking. Deodato made this movie as a commentary on ethics in journalism, in fact it was inspired by the italian media coverage of the Red Brigades. It's also real that this anti-exploitation critic it's done by using just the same technique. The movie and the same Ruggero Deodato can be accused of hypocrisy. But aren't journalists, critics and public opinion who accuse the film of being too violent so much more hypocritical?"
    },
    {
      "rating": "1",
      "text": "What in the hell. How could anyone go through this film? It's not real, but the horrors are... well, all too quite real in the eyes of its viewers. Cannibal Holocaust is probably the most disgusting film I have ever watched, to date, and that is saying a lot. Never did I ever feel the bile forming a bitter taste in my mouth on a film before. Many times was I tempted to shut this off, but I really had to see it for myself. The depravity is just for depravity's sake. At least \"A Serbian Film\" had a little narrative. This one takes the cake into one of the most unwatchable, vile, evil, and offensive films of all time. Please, do not watch this. I will certainly not, ever again. Nor will I recommend it. I wouldn't even let my enemy watch this horrendous piece of ****"
    },
    {
      "rating": "0",
      "text": "Once you look past the original uproar that it created, You'll realize that this film is one of the most overrated films of all time. The overreliance on shock value helped cover up the fact that there is very little plot, no character development and that it's just freaking boring to watch."
    },
    {
      "rating": "3",
      "text": "Cannibal Holocaust is a \"horror\" film in the exploitation genre of films. In it, four people go deep within the Amazon in order to study and research local cannibal tribes.After two months, when they don't come back, a rescue party is sent in order to find and save them, only to discover they are dead, but the rescue crew manages to recover their footage.Cannibal Holocaust is a slow, boring film. I imagine, at the time of it's release, the thing that stood out most was the controversy of the film, it's gore and it's real animal violence. Besides that, there's nothing outstanding about the film. And considering it's almost impossible to find a complete uncut version of the film, it's unlikely people will be able to experience what the original film actually was.Give this a hard pass."
    },
    {
      "rating": "10",
      "text": "Si eres amante del horror esto no te lo puedes perder, película de culto amigos"
    },
    {
      "rating": "2",
      "text": "I was intrigued by the film with some of its more brutal scenes, but that's it unfortunately. I like it when they aren't afraid to show some grittier scenes, but otherwise the film didn't impress me. On the contrary, apart from the aforementioned drastic scenes, I was bored. I was not amused. I had a feeling of emptiness when it was over. It didn't do much for me. In short, I wasn't entertained or interested. For me, it's a bad movie that I don't recommend. It was interesting with its bold scenes here and there, but otherwise not much. I mean, I would have watched such scenes separately and personally I wouldn't have missed anything. That's my opinion. I would only recommend this film to fans of the more brutal scenes, but even for those I wouldn't recommend this film that much, because I think they are much better."
    }
  ],
  "recommendations": [
    "apocalypto",
    "antichrist",
    "antebellum",
    "equilibrium",
    "titane",
    "a_clockwork_orange",
    "midsommar",
    "28_days_later",
    "they_live",
    "the_fourth_kind",
    "beowulf",
    "exorcist_the_beginning",
    "starship_troopers",
    "v_for_vendetta",
    "the_collection",
    "the_empty_man",
    "the_remaining",
    "300",
    "zero_dark_thirty",
    "night_of_the_living_dead",
    "the_girl_with_all_the_gifts",
    "the_medium",
    "the_lobster",
    "the_texas_chain_saw_massacre",
    "the_darkest_minds"
  ]
}