{"id": 893, "title": "Captain America: The Winter Soldier", "starring": ["Chris Evans", "Scarlett Johansson"], "runtime": 136, "genre": ["Action", "Adventure", "Science Fiction"], "description": "After the cataclysmic events in New York with The Avengers, Steve Rogers, aka Captain America is living quietly in Washington, D.C. and trying to adjust to the modern world. But when a S.H.I.E.L.D. colleague comes under attack, Steve becomes embroiled in a web of intrigue that threatens to put the world at risk. Joining forces with the Black Widow, Captain America struggles to expose the ever-widening conspiracy while fighting off professional assassins sent to silence him at every turn. When the full scope of the villainous plot is revealed, Captain America and the Black Widow enlist the help of a new ally, the Falcon. However, they soon find themselves up against an unexpected and formidable enemy—the Winter Soldier.", "releaseYear": "2014", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/tVFRpFw3xTedgPGqxW0AOI8Qhh0.jpg", "categories": {"plot": 8.678571428571429, "acting": 9.0, "ending": 5.375, "soundtrack": 10.0, "cinematography": 5.0, "familyFriendly": 6.0, "funny": 8.9, "action": 8.5}, "reviews": [{"rating": "10", "text": "Very good movie, best I've seen in a while. Comparable to Avengers really. Acting and Writing were both awesome. Could potentially be the movie of the year."}, {"rating": "2", "text": "'What's going on' asks Chris Evans of Scarlett Johansson at one point in this confused unstructured movie. This is the question that I would like to have had answered a lot earlier than is actually the case here. By the time some sort of resolution is offered one really couldn't care less. In fact this Marvel-less movie is a thorough going bore. Aside from a few sequences (involving a lift, and a climatic fight aboard an artillery carrier) most of the action is un excitingly derivative. In between these set pieces we have a lot of waffle spoken in an attempt to build character, but this only extends the agony of an already over long film. Visual effects are impressive, generally, although one static shot of the three artillery stations does look very fake.\rIt is good to see Robert Redford playing a villain for a change although he must obviously be doing it for the money. After all, didn't he set up Sundance as an alternative to this kind of movie regularly churned out by the Hollywood machine.\rFans of the first film, I'm sure, will love it and will stay (if in the know) for the two sequences that arrive during, and at the end of the final credits. Others, like myself, may wish they had left after the first 20 minutes."}, {"rating": "7", "text": "\"Captain America: The Winter Soldier\" was a sequel that certainly surprised me, as it exceeded all my expectations and definitely jumped over the quality of its prequel by miles. The plot, which looks to have drawn influences from exposing deceptive, blurred lines between the good and bad seen from cold war era spy movies, is very intricate and well-woven, and the action sequences are very satisfying to watch, all of this supported with good quality production. The Captain America series just gets better after each movie!"}, {"rating": "8", "text": "The future sure has been quite a time for Captain America (Chris Evans). His first encounter with the modern world saw him running through Times Square, confused and scared. Next, he assembled with some other Superheroes to save the world from the disgruntled brother of a fellow Avenger. In Captain America: The Winter Soldier, Cap faces off against an internal threat and an organization that is just as powerful as S.H.I.E.L.D, as well as a familiar face and new adversary from his past. Life is rough for Cap. On top of everything, he is still trying to find a way to successfully assimilate himself into present day society. You think saving the world is hard? Try figuring out the internet, getting back on the dating scene, and making new friends at the age of ninety-five. Thankfully, there are only a few things Cap needs to get through the day; his trusty vibranium shield and his handy notepad with a slew of suggestions for catching up with the last seventy years, and Cap is ready to take on the world–or corrupt government organizations. Either or, Cap is always ready to save the day, even if he has to take a beating while doing it.\r When I first became aware that the directing/producing brothers behind episodes of  ’Community’ and You, Me and Dupree were going to be responsible for  extending the Captain America canon, I may have gotten a little worried. Thinking that Joe and Anthony Russo were going to follow in the same footsteps as Captain America: The First Avenger director Joe Johnson, focusing more on the comedy and special effects of the Superhero genre and less with the complex, unflinching patriotic mentality of America’s greatest super soldier, the Russo brothers sure proved me wrong. It’s movies like these that make happy to swallow my words and stand corrected, knowing that audience members are able trust that the television medium is one that can be used as an adequate platform towards advancing characters in film as well.\r Substituting as much VFX work as possible for a very organic and old-school action approach, Captain America: The Winter Soldier is certainly the best Phase Two Marvel film so far, and may perhaps be the standard film to compete against in a post-Avengers film world, or at least up until the Avengers: Age of Ultron.\r Always on a mission, it seems that Cap lives to work, not works to live. Especially since he has been in deep sleep for the last little while. While the United States government is surely getting the most out of their ridiculously expensive investment, the government trusts that their super solider is never compromised and his dedication and hard work to his country is never skewed. When a secret organization with similar interests to those of S.H.I.E.L.D threaten to kill twenty million people, Cap is sent to fight at sea, on land, and in the air. Accompanied by his trusty sidekick Natasha Romanoff/Black Widow (Scarlett Johansson), the two seem to always be pitted within the same missions but always having ulterior motives. Commanded by their one-eyed superior Nick Fury (Samuel L. Jackson), S.H.I.E.L.D must face off against their most ruthless enemy yet.\r One of the biggest issues I will continue to have with Marvel’s stand-alone films from now on, is the fact that once conflict reaches a certain level of danger, like lets say a global level, I will always ask, “Where the heck are the Avengers? And if not the Avengers, where is Tony Stark? The Hulk? Someone? Anyone?” No problem could be too big for the super-powered team of freedom fighting Superheroes. This is one film where I questioned the presence of Tony Stark? Was he just waiting to see what Cap would do on the other side of the country while he sat at home on his couch?\r Essentially, Captain America: The Winter Soldier is a team effort in crime fighting, with Black Widow and Sam Wilson/The Falcon (Anthony Mackie) helping out are star-spangled Superhero this time around, Cap sure doesn’t seem to be without powerful friends. What was also refreshing was finally seeing Nick Fury get in on the action, providing the film with one of the best car chase scene Marvel ever assembled. One of the virtues of Captain America: The Winter Soldier stands by is the fact that, you don’t need to wear a mask to be a Superhero–which might explain why Cap always insists on removing his.\r At times, the film may seem like Marvel’s take on Minority Report anticipating danger before it even happens, and upholding the idea of ‘peace’ for the sake of the world. But as the Head of S.H.I.E.L.D operations ironically points out, “peace is not an achievement, its a responsibility”. So when S.H.I.E.L.D is corrupted from the inside, right under their noses and Cap is left to face-off against a super-soldier baddie, later known as the Winter Soldier (Sebastian Stan), the organization really has some explaining to do."}, {"rating": "8", "text": "Way better then the first movie which only seemed to be a vehicle to help promote the Avengers. This a stand alone movie and with a little background anyone could be caught up to speed even without seeing the first one. This one will be put into the blu ray collection as well as maybe buying the first one just to help my gf catch up a little more on the whole background of the Avengers and Capt America. This movie started to make me a fan I wont go out and start buying up the older comics like I have with Avengers but I am very excited for 2016 and Capt America 3."}, {"rating": "8", "text": "Best Phase II Marvel movie.  Shows what you can do with a Marvel movie, good script and some good ideas.  It has the feel of an old school 90s action movie as well a little bit of political thriller thrown on top.  The cgi is more disciplined here than in the first one.  I liked Robert Redford as the bad dude and he plays it great, like it was his character from the Candidate won a secretary of state position.  This is my favorite of the phase II Marvel movies, yes I liked it more than Gaurdians.  I believe it is the best Marvel movie since the first Iron Man."}, {"rating": "8", "text": "There’s no point in denying that the new Captain America movie is anything less than another instalment in the superhero saturation of the last ten years, but although the Captain himself has been considered the blandest of the bunch, at least as far as The Avengers (2012) is concerned. It’s still a fantastic world of unbelievable stunts and perfectly timed one-liners, but the new film offers a lot more depth than some of the weaker superhero fare on offer.\r In addition to the ambitious Marvel Cinematic Universe, the rich tapestry of interwoven stories that Disney’s Marvel Studios has been crafting at the rate of about two blockbusters a year since 2008’s Iron Man, we have seen everything from the unrelated narratives of Marvel’s Spiderman and X-men series, to the gritty reboots of rival DC classics like Superman and Batman. The Marvel Universe alone is an unprecedented shared universe multimedia franchise, extending from the silver screen to various short films, television series and tie-in comic books.\r Wanton American patriotism is far from internationally popular, and the challenge with Captain America as a character is to give this bastion of United States glory modern appeal. The first film took the character back to his roots, giving us a brilliant pulp action adventure, set during the character’s 1940s heyday.\r This was an easy place to be Captain America, but after being dragged into the twenty first century in time for The Avengers, Steve Rogers (Chris Evans) must work out what America stands for today, and decide what he represents. The temporal displacement is a rich vein to be mined for soul searching and character interpretation.\r As a pawn of SHIELD, the superhero intelligence organisation: our Nazi-punching hero has been reduced to a shady covert operative who is unsure if the missions he is sent on are aiding or abetting the forces of evil. This insecurity comes to a head when he learns of SHIELD’s Project Insight, a sinister initiative which operates under the twin axes of surveillance and pre-emptive strikes, undeniably referencing drone controversy and the concerns over US internal surveillance. Thus The Winter Soldier is an espionage thriller, firmly rooted in modern day concerns, but with a style heavily influenced, according to the directors, by cold war conspiracy thrillers from the 1970s.\r Events are still very much rooted in the events of the first film, mysterious forces have been working in the background since the end of the war, and the Captain finds himself battling enemies both old and new. Symbolically, he trades his brand new twenty first century black and navy blue uniform for his bright red, white and blue wartime clobber before the film is out.\r As is the case with many comic book movies, I am impressed to learn that much which transpires on screen, no matter how incredible or brief, is in fact distilled from the original comics over their seventy year history. I’m certainly not the one to personally notice all this detail, but it’s apparently crammed full of nods to various eras, arcs and character backgrounds.\r The characterisation of Falcon, real name Sam Wilson (Anthony Mackie), was strong. An Air Force veteran, he shares Rogers’ military background and helps him adjust to the modern world. Later, he demonstrates his loyalty when he is called upon once the Captain becomes a fugitive.\r Of course, the question having over every post-Avengers solo movie is why characters neglect to call in their superpowered chums to save the day in a fraction of the time. There is a slight aversion in that Captain America does spend the whole film working closely with fellow Avenger Black Widow (Scarlett Johansson), who has been largely sidelined in her previous appearances. The truth is that having fewer lead characters mean more attention can be given to others, and Johansson is finally given some significant screen time. Black Widow’s alluring presence is welcome throughout, her moral ambiguity and chequered past providing a stark contrast to the Captain’s clear cut integrity.\r Similarly, SHIELD director Nick Fury (Samuel L. Jackson) is much more important to the story than the cameo status he has held until now. By contrast, the eponymous Winter Soldier, a bionic badass bearing Soviet livery has little screen time, initially filling the role of unbeatable enforcer to the villains, and the only individual strong enough to challenge the Captain, but his tragic presence is vital to the overarching saga. Also noteworthy is Robert Redford’s appearance as a sinister SHIELD executive.\r Freedom, the most American of values, nevertheless carries a global relevance, and remains a major theme, but any overt patriotism is relatively, and wisely downplayed, despite the character’s name and apparent raison d’être. What’s left is a solid conspiracy blockbuster, with the superhero status incidental aside from enabling higher octane action sequences than a subtler spy movie."}, {"rating": "8", "text": "I never saw the first Capt America, but I did see the avengers and to be honest didnt like him there. However in this film I found him enjoyable. The film its self is enjoyable and just pure fun! the best of phase 2 for sure."}, {"rating": "8", "text": "Captain Is Back and he is kicking so much ass! The sequel to a mediacore original is surprisingly amazing! With good visual effects,Good Characters and a scary villain.It one of the most violent Marvel film to date.The movie has some many action and drama,it's basically not a superhero film it is a spy thriller but still qualifies as a superhero movie cause it;'s based on a comic book superhero.Captain America is enjoyable for all ages!"}, {"rating": "8", "text": "Very shocked at how much I enjoyed this movie! one of Marvel's best without a doubt, and the only sequel on an avengers solo that is good. Capt 2 delivers!"}, {"rating": "8", "text": "Captain America: The Winter Solider is the least Marvel-like film in the MCU. It's a real deal spy-thriller, and I really enjoyed it. There are some moments of unbelievability that a lot of Marvel films have that kind of annoy me, but to see Captain America really just beat some dudes up and for it to actually be pretty brutal, and not toned down like I'd kind of expect from Marvel, was cool to see. The story does seem a little convoluted at times but it's also setting up a lot of stuff for the MCU so it's understandable that there's a lot going on. One of the best films in the MCU, I think."}, {"rating": "9", "text": "good acting, action, and plot. the story is well written and executed, and has good characters. the action was great.the overall movie had some clichés, but was still very good. i wish that falcon played a bigger role than what he had, though."}, {"rating": "8", "text": "brilliant I could not help but enjoy the film great plot and a nice balance of the drama and action and doesn't over do the jokes and I've course great performances the director really has been careful when doing this film one of the best in the marvel cinematic universe"}, {"rating": "8", "text": "I was far from excited to see the movie because the first one was dull. Honestly. However, this sequel really gives me a new perspective to consider Captain America to be more than just a movie they did to make sense of The Avengers. Hands up to the directors and screenwriters, and shall I say, Scarlett Johansson, for being the hottest and bestest sidekick ever!"}, {"rating": "7", "text": "Better than expected. Actually, I didn´t expect a thing. Nevertheless it ends up being a really entertaining movie, much better than the first one, really good visuals, and it keeps your attention all the time"}, {"rating": "8", "text": "Winter Soldier was a step in the right direction. They finally started showing some of the reasons Captain America is so beloved. The story suffers though as they give too much spotlight on every major character in the movie. At times it seems everyone else is doing something more heroic than the captain. It's just odd that Captain America who is supposed to be one of the best martial artist and fighters in the Marvel universe seems just on par with your average Shield Agent. We have to remember though, it's a super hero movie, and in that area it delivers."}, {"rating": "8", "text": "This film features more action and better CGI than the first Captain America film. Although I find the plot a little bit confusing, its actually quite nice and has many twists to the plot. This is probably a better Captain America film compared to the first one in terms of actions and CGI. The directors should make the plot less confusing. Overall, this is an awesome film. Thumbs up for this film!"}, {"rating": "8", "text": "It is a funny action film, that does what is supposed to do, entertain. It's mock spy films, but it worked for me. Much better than the boring first part of captain America during the WW2"}, {"rating": "9", "text": "Although you may question some plot elements, this is easily the best stand-alone Marvel movie since Iron Man.  I was biting my nails throughout the film, the directing and action was spectacular, and it is helped by stellar acting performances.  There are also several twists you definitely will not see coming and likely didn't even think Marvel had the balls to do, let alone pull off."}, {"rating": "10", "text": "Fantastic movie by any means - only better because of it being an MCU movie. For me, this is a strong contender for the best Marvel movie yet. I rate it only behind Avengers and Thor 2 because I prefer the sci fi genre to political thrillers, which this movie was."}, {"rating": "9", "text": "I am not a comic book expert, but there is something I can guarantee: this film deserves our full attention. If \"Captain America: First Avenger\" turned out to be pleasant and full of quality, this film proved to be a worthy continuation. It will not be correct to say that I was surprised: Marvel has provided us with excellent productions, and it is difficult, therefore, to keep expectations low. However, in the end, I was satisfied.The plot goes back to Steve Rogers' past to reveal the existence of a rival to his height: the Winter Soldier, a super soldier, like Captain America, whose origins and past are closely related to Rogers. I don't know if this story is faithful to what is told in the comic books, but I also feel that, for me, it doesn't matter. The plot is developing well, with space for action and the fight scenes are good and seem real.Chris Evans returns to the role of Captain America, and he is skilled, heroic and energetic. Samuel L. Jackson and Robert Redford also do an excellent job, at the level of the best they have done so far in their long careers. Scarlett Johansson and Anthony Mackie seem to have received characters tailored to them, especially Johansson. Sebastian Stan is good, but he didn't get my attention much. Emily VanCamp is good, but her character is not very relevant and is not very interesting.But where this film really excelled was in the quality of production values, and the most technical aspects. Cinematography, for example, is sharp, elegant, with excellent filmmaking and an absolute command of color, movement, and shadows, which make the film visually extraordinary. Add to that the grandeur of the visual effects, the latest generation CGI and, of course, the action and fighting scenes, and the result is overwhelming. The sets and costumes also deserve a note of great praise: I especially liked the sets at the Avengers headquarters, a futuristic and elegant complex that seems to have been taken from an urban planning project in an Asian city. The aircraft also look magnificent and impress. The soundtrack, on the other hand, is quite good, it fits perfectly in the film, but I confess that it was not in my ear and that I did not find it particularly memorable."}, {"rating": "9", "text": "Probably the best MCUmovie, very good story, excellent action. And i loved the character of Falcon, what can i say about this movie that has not been said already. This movie is just F*cking great! 9/10"}, {"rating": "10", "text": "I think this movie was killer and is easily top 3 for mcu movies. It was just so satisfying to watch."}, {"rating": "10", "text": "Very interesting movie. I thought this was the best mcu film to this day. Absolutely amazing."}, {"rating": "10", "text": "Best MCU movie until Avengers Endgame came out. But still this movie really is a huge step up from The First Avenger."}, {"rating": "10", "text": "I absolutely love this film. The story telling is really good, the fight scenes, emotions and the acting is just absolutely spot on. I think this film is better than Infinity War."}, {"rating": "10", "text": "Movie was good had great action scnees. Great character relations. And did a good job deveoping cap in the 21st century."}, {"rating": "10", "text": "Easily one of the strongest MCU entries to date and one of the best superhero movies. I wouldn't quite call it a masterpiece as I do have a couple of subjective problems with it. However, the characters are very well developed and feel like 3-dimensional characters especially Captain America. The action and choreography are brilliant and hold up very well. And the story is just overall very good. I gave the movie a 10 but it is a light 10."}, {"rating": "10", "text": "More like The Dark Knight  than \"The Avengers\rCaptain America: The Winter Soldier manages to have the perfect balance of seriousness, humour and a complex plot that not only raises the stakes for the whole Marvel Cinematic Universe but also manages to keep intact who Captain America is and how the world should be more like him not the other way around.\rThe action is the best action in a Marvel movie and the soundtrack keeps you on the edge of your seat as the plot evolves. Acting wise everyone fits their role perfectly and special mention to newcomers Anthony Mackie who gets most of the more funny scenes as Falcon and Robert Redford who turned what could have been a boring character in Alexander Pierce into a truly well rounded character.\rOn par with The Avengers as the best Marvel film."}, {"rating": "10", "text": "Wow. This film takes the Avengers series to a new level. Not only is the story and action superb, but the events in this film have huge implications when it comes to the overall Avengers story. Keep them coming Marvel Studios!!! Top 3 along with Avengers and first Iron Man."}, {"rating": "9", "text": "Excellent movie, lots of action, great acting, story was pretty good. Well worth my time. Far better than the first movie.\r..........................."}, {"rating": "10", "text": "This is the best Marvel move to date. Tons of action, great story, great characters. Loved the addition of the Falcon. Definitely worth seeing, even if you aren't typically a Marvel movie fan. It really feels like a great spy/political thriller movie that just happens to have a super hero in it."}, {"rating": "10", "text": "Holy cow... what a ride!  So much better than the first one, though expected since Captain America didn't need to be born again, just on with the show. Awesome effects, great casting"}, {"rating": "10", "text": "One of the best Marvel movies and possibly one of the best action movies to come out in the past decade.  The stakes are real and this movie is a game changer for the Marvel universe without modern day gimmicks like shaky cam, slo-mo action shots or overuse of CGI.  An instant classic."}, {"rating": "9", "text": "Lately Marvel movies have been losing their touch and have really become a franchise with only one tone which eventually becomes quite tiresome. TWS is not only a great superhero movie/ sequel but also a great movie in general. All the cringe worthy jokes and fairly basic plot, which have been ruining marvel for me, have been replaced with an almost masterfully crafted story. From acting to the dialogue, this movie is great. Though I did have an issue with some of the choices they made, but overall a pretty solid movie that deserves all the love that its getting (unlike most marvel movies these days)."}, {"rating": "10", "text": "The success of 'The Avengers' back in 2012 was undoubtedly going to usher in another phase of films from the ever expanding Marvel Cinematic Universe. Robert Downey Jr. was the first to suit up for the third Iron Man outing and his fourth for the franchise overall. The third entry in the Iron Man franchise proved to be riding the wave of the massively successful Avengers, taking a huge haul at the box office. Next up was Chris Hemsworth as the muscle bound god of thunder Thor.\rBoth proved to be successes, the former continuing to impress while the latter was better than the first outing but still left plenty of room for improvement. But the first avenger to start it all was Steve Rogers as Captain America, his first film was good but not great, it had a wonderful retro feel to its first half until it took an explosive and predictable path for its final hour, each event leading into The Avengers. Cap was always difficult to put in front of an audience that nowadays demands darkness and gritty realism over charm and light-hearted antics. He stands for goodness and doing what's right, something that isn't very sought after in modern day heroics.\rBut in this sequel to the 2011 film, it's a different time and a much different film. Not only does it improve upon the last solo outing, but it could very well be the best film to come out of the Marvel franchise so far. The man who was frozen in time returns with Chris Evans again putting the famous shield on his arm, he now works for S.H.I.E.L.D. who continue to be a very secretive organisation which Cap is determined to get to the bottom of. He works closely alongside fellow operative Black Widow (Scarlett Johansson). The witty chemistry between these two is easily one of the highlights of the film, even in the stickiest of situations, the writers manage to infuse some comic relief that works every time. But the threat this time in the film is much closer to home as S.H.I.E.L.D. itself is the centre of attention for all the wrong reasons. Nick Fury (Samuel L. Jackson) is given a much larger and more pivotal role in the Winter Soldier, the more Sam Jackson the better if you ask me! The story plays out in thrilling fashion as a mole within headquarters has each of our good guys on their hit list. The great alliance is now in tatters and someone that Cap has never dealt with is hunting himself and his friends down. Who better to send after them than the mythical Winter Soldier, he may just seem like a master assassin with a metal arm and anger issues, but there is much more of a story going on behind the mask that plays a part in a film that finds balance between emotional repercussions while also entertaining the fans with explosive set pieces, thrilling fist fights and a fantastic car chase involving director Fury, it all packs a heavy punch while infusing the film with superior wit and charm, especially from supporting cast member Anthony Mackie who dons a familiar pair of wings as the plot unfolds. The story delves very deep into the history of the S.H.I.E.L.D organisation while also outlining the problems that face a company who is trying to do everything right by preventing crime before it happens, \"What about freedom?\" the Cap asks, always there to detail the line between right and wrong. Chris Evans himself is on fine form and he acts out a very emotional script that paints Steve Rodgers as a man who is unsure about what to do with his life after the secrets of the people he works for start to unravel. It pays homage to the first film while also solidifying itself as possibly the best Marvel film so far, it has everything that could possibly be imagined and just when you think that it can't get any better, Robert Redford shows his face along with several other strong characters, there are surprises at every turn but enough of the same characters we've come to know from previous films to add up an adventurous, pulsating and epic adventure that could be the best film of the year. Stay for not one but two credit scenes, one in the middle and one at the end, mind blowing!"}, {"rating": "8", "text": "Fantastic movie and by far the best of the MCU movies so far in my opinion. This is not just a superhero movie but is also equal parts action and thriller and has a well written story, action and fight scenes and some interesting new characters.\rWith out giving any spoilers Captain America The Winter Solider not only clearly furthers Steve Rogers story but also that of SHIELD and will no doubt have massive lasting effects on the MCU as a whole."}, {"rating": "9", "text": "Not only is this a great superhero movie, it's a great political thriller. The story was intriguing and the acting as well as action was good too. This is one of Marvel's best to date... easily the best of Phase 2 thus far."}, {"rating": "10", "text": "There is nothing to say except that this is the best marvel movie to date. Out of the nine, this movie is by far the most well put together and has the best told story. It connects with events from Captain America 1, the Avengers, and the TV show, MARVEL Agents of Shield. If you haven't seen this movie, go and see it now!"}, {"rating": "10", "text": "One of the best solo character movie by marvel since iron man. cant imagine the hype it has created and it has lived more than up to its expectations. The actions cant get better than this. Simply superb. Highly recommended for all MARVEL fans. ;) love it !"}, {"rating": "5", "text": "The soldier superhero (Chris Evans) is living quietly in DC, when an evil plot is discovered. He enlists Black Widow (Scarlett Johansson) and newbie The Falcon (Anthony Mackie) to help. This may be the most unoriginal screenplay yet for Marvel heroes: no surprises, no peril and no humor. It moves forward with momentum and some of the visuals are cool. Most of the fights are fast cut, hand held and hard to follow. While it's never dull, the predictability and unimaginative action don't render it special. NOTE: There's one additional clip after the closing titles and another after the final credits."}, {"rating": "8", "text": "What can I say about this movie other than to go see it ASAP?  It's everything that you come to expect from a Marvel film taken to a whole new level.  Again, go see it ASAP.  That is all."}, {"rating": "8", "text": "\"Captain America:The Winter Soldier\" is a really good movie that is leagues better than the initial first film, which I was not a fan of. This new story of The Cap is brought into the modern world and it’s fun seeing him deal with how much the world has changed, but at the same time how much it has stayed the same. The script is well written. It is filled with great relevant social commentary about our government and major organizations and how they preserve freedom by reistricting it. However, while the script is fairly heavy, it does manage to have enough fun Marvel humor that we’ve all come to love.\r One thing in particular that I love about this movie is that it gives a lot of respect to its characters. The Captain himself is show to be more than just a leader. He can hold his own, but is also a great human being. Chris Evans has finally owned the character and it’s hard seeing anyone else play him. We also get more backstory to Natasha a.k.a Black Widow. It allows the audience to connect with her on an emotional level. Same goes for Nick Fury. The Winter Soldier is a pretty awesome villain, who I believe to be the best villain from the Marvel Cinematic universe only behind Loki.\r Overall, “Captain America:The Winter Soldier” is a fairly entertaining and surprisingly thought provoking movie that is stepping up the quality of the modern superhero movie genre. It has everything from great characters, to an engaging and honest story, to some of the best action we’ll get this year. My only gripe with the film would be the heavy use of shaky cam during the action sequences. Other than that, it is a a movie that you go and see in theaters today. Also, stay after the credits there is a big reveal that will surely get everyone excited for The Avengers 2. I give 4/5"}, {"rating": "10", "text": "This is an amazing movie.  Fantastic action, special effects and character development.  My favorite Marvel flick so far.  ( You honestly cannot please a critic with anything other than the most cryptically boring or oddity of a movie.). Did a great job showing Caps strengths and weaknesses and making him a truly human character."}, {"rating": "6", "text": "I know people are going to hate me for saying this, but if I'm being honest, this movie was overrated. The pace was rushed, the story made little sense, it crammed WAY too much back story that should have ebeen in the first CA movie. Nonetheless, i did enjoy it a little, but it's definitely not Marvel's best movie, not by any means."}, {"rating": "7", "text": "Easily one of my favorite movies to come out of Marvel yet, the sequel for Captain America is a solid, enjoyable movie that really attempts to go above and beyond its genre, while also retaining elements that just make it another superhero movie. In terms of the political commentary, Captain America's sequel soars above most other superhero movies. It uses its position as a popular movie to try and bring up things  that it feels could occur in our world if we continue down the path we are going down. However, it then returns to stereotypical superhero nonsense and, generally, feels like a run-of-the-mill summer superhero movie. Sure, it is one, and is a good one at that, but that does not mean it could not step up in \"class\" a bit. On top of that, I felt the story was too much. The whole world is being threatened and all that it is being defended by is Captain America, The Black Widow, and Anthony Mackie? Really? Did Iron Man, Hulk, and Thor, call in sick that day or...? The plot was very interesting and really makes this movie what it is, but it felt more appropriate for the second Avengers movie, rather than the sequel for Captain America.\r In terms of acting, everyone did very well. Chris Evans, Scarlett Johansson, and Samuel L. Jackson, really led the way with that. Also, the character development was great and unexpected for this movie. The amount of development they did here, coupled with the ending and post credits scene, really set up the upcoming third film nicely."}, {"rating": "10", "text": "Wow. If the main problem about phase 2 up until this point was it's lack of connection to the MCU then this movie is exactly what was needed. The story is thrilling, the characters are great, the acting is top notch and the action is some of the best that I've ever seen. Plus there's all the huge game changing moments that'll be effecting the MCU for years to come."}, {"rating": "8", "text": "Though it may not abide religiously to its subtitle, \"Captain America: The Winter Soldier\" remains a spine-tinglingy well-staged, frighteningly relevant, and brilliantly monumental addition to the Marvel/Disney dynasty."}, {"rating": "10", "text": "Miles away better than The Amazing Spider-man 2. and could even rival films like The Avengers and The Dark Knight, the acting was fantastic, and the action scenes were some of the best I've ever seen. Brilliant film."}, {"rating": "10", "text": "I don't give 10's out lightly.  There is nothing wrong with this action film.  Great story.  Great action and cgi.  Funny.  Great characters.  The only thing I would have added would have been a last second cameo of Iron Man.  Marvel does a bad job when it comes to forgetting about other characters that still exist in this world.  If you don't want them in the movie, you better come up at least a mention as to why they are not here.  Remember when they kept referring to the Thor hammer in the desert in a few other Marvel movies?\r For an action movie this is a 10.  I would have given the first Avenger movie a 5."}], "recommendations": ["captain_america_civil_war", "x_men_days_of_future_past", "the_league_of_extraordinary_gentlemen", "black_widow", "mission_impossible_rogue_nation", "creed_ii", "captain_america_the_first_avenger", "you_only_live_twice", "conan_the_barbarian", "stargate", "master_and_commander_the_far_side_of_the_world", "the_eagle", "hellboy_ii_the_golden_army", "creed", "news_of_the_world", "the_martian", "valkyrie", "the_magnificent_seven", "spider_man_far_from_home", "american_made", "war_for_the_planet_of_the_apes", "wonder_woman", "iron_man", "12_strong", "jack_ryan_shadow_recruit"]}