{
  "id": 1836,
  "title": "Captain Underpants: The First Epic Movie",
  "starring": [
    "Kevin Hart",
    "Ed Helms"
  ],
  "runtime": 89,
  "genre": [
    "Action",
    "Animation",
    "Comedy",
    "Family"
  ],
  "description": "Two mischievous kids hypnotize their mean elementary school principal and turn him into their comic book creation, the kind-hearted and elastic-banded Captain Underpants.",
  "releaseYear": "2017",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/vVWwCv5WjDpddG2JsDPVPBmmP1e.jpg",
  "categories": {
    "plot": 6.909090909090909,
    "acting": 7.0,
    "ending": 8.5,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 7.875,
    "funny": 7.476190476190476,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "7",
      "text": "This movie is actually surprisingly decent. It has a lot of funny jokes, many of which work with both kids and adults. The characters are all enjoyable, if not very deep, and the plot moves along fast and the movie never lets up. And despite the movie being made on a lower budget (they even make jokes to that effect) but it was hilarious and the animation was still very good. Make no mistake, this is still a kids movie and some of the humor isn't going to land with the adults, but the movie has enough charm and jokes to keep it going. I will say that the main villain is kind of stupid and his jokes wear out fast, and some of the side characters are a bit boring though. But overall, not bad, very good for the whole family."
    },
    {
      "rating": "7",
      "text": "Very entertaining animation with great visuals and writing. Quite funny and clever."
    },
    {
      "rating": "8",
      "text": "I'm not a fan of potty humor just because, but with Captain Underpants the fast pace quick wit style hit and I had a blast.  Nicholas Stoller was the reason I wanted to see this and you could really see his writing style fit perfectly with this property.  Maybe sacrilege to say but I liked this film more than Wonder Woman.  A-"
    },
    {
      "rating": "9",
      "text": "A fantastic story, cast, art style and animation. It's way better than any movie with a hero named Captain Underpants deserves to be. The story says just as much about the school system as it does about an 8-year-old's sense of humor. Also, buried beneath the jokes & Professor Poopypants' giant monster toilet, is a story about best friends & how important it is to let kids be kids and laugh, and have fun."
    },
    {
      "rating": "7",
      "text": "While Captain Underpants: The First Epic Movie may feel unsatisfying for the ones who hadn't read Dav Pilkey's bestseller, it is still having a dazzling animation, cool storytelling, and a surprisingly familiar message."
    },
    {
      "rating": "7",
      "text": "Important messages and underlying themes surround Captain Underpants, a gorgeously animated film that is surprisingly effective and nostalgic for those who have grown up, and funny as hell for its target audience."
    },
    {
      "rating": "7",
      "text": "If you love the books that inspired this movie, then it's no matter for you as Captain Underpants manages to keep things true to the books. Just plain gross-out humor that actually works for once. What it feels like to exactly be a kid again in less than 2 hours and I'm not even kidding about that."
    },
    {
      "rating": "7",
      "text": "With LEGO Batman Movie and Despicable Me 3 in, Captain Underpants is another good movie for a mediocre year of animated films. The animation is great, the main characters are great, the humor is hilarious, the voice acting is good and it respects a lot what the books are. Even if is not perfect for his awful villains, some unfunny jokes and the character of Captain Underpants not appering much in the film, is still better than any animated movie like Cars 3 o LEGO Ninjago Movie."
    },
    {
      "rating": "10",
      "text": "im 27 me and my 23yr old cousin loved this movie. I never read the books. Great movie animation and voice work.  It's not deep, but it will make you laugh and keep your interest from beginning to end regardless of age."
    },
    {
      "rating": "3",
      "text": "I was a fan of the books when I was younger, so even though I'm in my mid-20s now I was somewhat looking forward to this. But it ended up being a boring, lazily animated romp (it only cost $38 million compared to the average animated cost of around $125 million), and even the big name voice cast seems to be phoning it in. Kids in my audience didn't even seem to loving it that much, which makes sense seeing as this movie is 15 years overdue..."
    },
    {
      "rating": "7",
      "text": "The long-running and highly enjoyable series of children's comics finally makes it's big-screen debut. Like most of DreamWorks recent movies, Captain Underpants is filled with wall-to-wall, nonstop humor. It's done in a style that is very befitting of the books they are based on and even manages to slip in a little story about friendship in the process. The whole is very cute, but feels overly long and offers little more than a sugar rush. It's certainly a good sugar rush. Just one that makes you realize how well the concept works as a quick read. There's only just enough material here to cover it's roughly hour-and-a-half running time and not all of it is lives up to the film's best and funniest moments. Still, what's here is entertaining for young fans of the books or those who grew up reading them. It's a nice bit of nostalgia back up by excellent voice acting from Ed Helms and Kevin Hart, as well as some top-notch animation. Just don't expect this to be at the top of the animated film pile."
    },
    {
      "rating": "9",
      "text": "I'll be completely honest here and say that I didn't read the \"Captain Underpants\" book that much when I was a kid. I read some of the first book, and a little bit of \"The Perilous Plot of Professor Poopypants,\" but otherwise, I went into this film not knowing much. Thankfully, I walked away extremely satisfied. \"Captain Underpants: The First Epic Movie\" is DreamWorks to the core, but in this case, it works: it's hilarious, it's well-written, the animation is great, and the characters are extremely memorable. Regardless of your personal enjoyment for the books, \"Captain Underpants: The First Epic Movie\" is a great film that's well worth watching."
    },
    {
      "rating": "4",
      "text": "Super meh. Kids will most likely enjoy it, but only about 1 in 4 jokes really land, the animation is bland, and the primary characters are sentimentally cute but far from dynamic. The way they talk about and perceive their friendship is more interesting than their actual friendship. \"Uranus\" humor is at the core of their friendship and, in large part the movie."
    },
    {
      "rating": "4",
      "text": "Books vs movie: I didn't like the film very much, but it had some good humor like in the great novels. Kids can laugh at this film, but adults will cringe a bit at this movie. This is a half and half film."
    },
    {
      "rating": "7",
      "text": "it is just a fun ride tghrough the world tghroug kids´ eyes it was funny had good humor a solid movie not a must watch but stil a good kids movie"
    },
    {
      "rating": "10",
      "text": "Good movie for to make watch movie of about when to of more watching comedy of movie is of nice on this movie very nice of watch entertain on myself"
    },
    {
      "rating": "5",
      "text": "I love animation in general, so I check out most releases.  Because of mediocre reviews I avoided seeing Captain Underpants in theaters when it came out.  I saw it on Blu Ray instead.  This is one of those children's animated films that doesn't cross over for adult enjoyment.  A lot of frantic, sophomoric low brow humor that annoyed me more than entertained me.  Children are way more sophisticated than the makers of this film think.  I think I laughed exactly once at a joke involving supermodels that was said so quickly you would miss it if you weren't paying close attention.  I rolled my eyes and cringed for much of the film.  The animation look is excellent, as is most animation made these days."
    },
    {
      "rating": "4",
      "text": "Ed Helms did a great job as Captain Underpants, He really brought the character to life. The rest of the cast doesn't really live up though. Kevin Hart felt really out of place and hearing Nick Kroll's attempt at a German accent is easily the funniest thing about this film. And that's saying something.Starting with the story, It's incredibly weak. Any adult is gonna know that by the long, needlessly drawn out filler scenes that were used to extend the run time of this film. The writers clearly had no idea where they were going or they realized they told a story that could have been told in an hour rather than an hour and a half so they had to draw it out somehow. And it doesn't help that this movie simply isn't funny. It's not. Didn't even get a chuckle out of me and I love animated movies.I'm not saying that the potential is there, They are doing a TV show about the series and I feel that is a better output for the book series rather than a movie. The movie was a good way to get the brand out there but it's the TV show that is gonna thrive because they could still tell those short, quality stories and not feel drawn out."
    },
    {
      "rating": "7",
      "text": "A new superhero has born.14 October 2017Based on the children's comic book. It might look silly for a film, but all the animations are. From the director of 'Turbo', it tells the story of two best friends and their little secret. The secret of keeping their school principal under their command, after a mysterious power gave them an opportunity to enjoy the life as they wanted. But when a mad scientist started wreck the school and the city, they have to come up with something to stop him. The remaining story is full of fun action-adventure.The concept of the superhero was funny. But sure kids would love it. At least would make them wear underwear. I still watched it knowing it is for children, and I liked it. But I watched mainly for Kevin Hart. Because his fantastic voice-over in 'Secret Life of Pets' saved the film, and so here. Little short film, the story too was very simple, though the animation was good. I don't know there will be a sequel, but it should be, or else I would like to see a television series like most of the feature films in the recent time transformed into.7/10"
    },
    {
      "rating": "7",
      "text": "I've never been one for immature and potty humor (which is part of why I hate the 'Shrek' and 'Despicable Me' movies with a passion for example). However, surprising as it may seem, I was actually really looking forward to checking this out, having grown up with and loved reading the books this is based on as a child. As for the inevitable potty humor I knew I would be walking straight into with this film, what can I say? It wasn't a problem for me at all with this film, in part because I was pretty much asking for it this time around, but also because that's what helped it stay true and close to the same style of humor from its equally crude source material. And besides, with a title like 'Captain Underpants', what else was I supposed to expect? In addition, the voice cast keeps things lively and fun, with members such as the always energetic and reliable Kevin Hart, and of course, Ed Helms in a perfect fit (pun intended) as the titular character. Overall, I will admit that the film was pretty hit or miss with a lot of the humor and jokes for me, but none of that ruined the fact that it was still a fun, colorful, and even quite nostalgic time for a fan of the books such as myself."
    },
    {
      "rating": "4",
      "text": "Even weirder than The Boss baby.    Ive never heard of the books before.   I think Kevin Hart does a solid job as a voice actor"
    },
    {
      "rating": "5",
      "text": "El Capitán Calzoncillos trata de una forma decente la temática del poder de la risa y la amistad. Por lo demás, no es una mala sátira del mundo de los cómics, el colegio y los adultos. Quizá uno de sus mayores problemas, es que rara vez es una historia sobre el Capitán Calzoncillos."
    },
    {
      "rating": "8",
      "text": "As someone that grew up reading the books as a kid, the movie did the source material justice! The decision to keep the animation look similar to the original drawings was brilliant, not only because it was faithful, but it looks so good. This is one of the most expressive animated movies I've seen in some time, especially from DreamWorks! This movie is gleefully juvinile and silly but it works so well with the movie rebelling in it's ridiculousness. From Ed Helms's brilliant performance as the titular hero to Nick Kroll's voice work as the maniacal Professor Poopypants, the voice cast is stellar. Especially with Kevin Hart voicing a third grader, which would have been off-putting in normal circumstances hearing an adult voice a kid, but it works in it's favor for the manic goofiness the movie brings. The humor is unfortunately the big problem with the movie, sadly. Not because it's bad, it certainly isn't, even if the toilet humor does run the line of being a bit obnoxious. However, much like the Lego Movie, the writers throw every joke they can think of and see if they stick. It's like an assault riffle of jokes. Which isn't bad, however it does become a bit too much. Plus the main conflict of the movie does not have a good payoff by the end with Harold and George realizing that they have a non-conflict at the end and just say \"Eh\" to not sharing classes.Still, this is a fun movie and I'm glad I live in a world where a movie about Captain Underpants is considered good!"
    },
    {
      "rating": "6",
      "text": "Since the movie is based on a children's book, children under 10 will be the only ones who will find it funny. It's not entirely bad, but it shows that both Dreamworks and Disney are in need of a new creative impulse, not a technological one."
    },
    {
      "rating": "8",
      "text": "I loved this movie! The story was simple, fun, and exciting. The animation was some of the best I have seen. It was simple, and didn't mess up once. The voice acting was great, they picked great voice actors. It is super funny, the jokes made me laugh every sigle time. It is for sure a great movie."
    },
    {
      "rating": "8",
      "text": "Some raunchy type PG jokes, mostly that kids will not get or laugh at, but overall a fun event. It stays true and fun to the books, with cute animation, and creative humor. Sometimes it wastes time using potty jokes or fart humor, but that can actually be funny, for some reason. Enjoyable!"
    },
    {
      "rating": "10",
      "text": "Underlying messages: learn to laugh at yourself and be kind. The movie makes you nostalgic for childhood. I think the people who write negative reviews have become jaded adults and this type of energy is definitely picked up by the children they have brought to the theater. The theater I went to was howling with laughter and excited parents. Makes a huge difference. It is a charming tribute to a child's imagination and creativity."
    },
    {
      "rating": "8",
      "text": "Captain underpants is a stylized film, that stays true to the comical, lighthearted source material. It provides enjoyment for kids and adults alike. For children it provides goofy, lovable characters and childish potty humor, while for adults it also offers meta jokes about modern society or of the film itself. Overall, the films animation is buttery smooth and very specifically stylized, which really sets it apart from similar child films. The film is also very self aware, and it makes sure to let you know that it is. Despite the present pacing issues and sometimes generic storytelling, captain underpants is a great children's film along with quality entertainment for adults as well. So far the best children's film of the year."
    },
    {
      "rating": "7",
      "text": "I dont have much to say.Its a great movie that is really funny and has a lot of fourth wall breaking and meta jokes.It was much better than what I expected.I recommend to fourth wall breaking lovers and fans of the captain underpants books."
    },
    {
      "rating": "6",
      "text": "This is clearly a kids movie, with all of the potty humor and other shenanigans, but it still can prove entertaining to people over 6"
    },
    {
      "rating": "7",
      "text": "While I had problems with the story, the voice cast, animation, and humor were awesome. Loved the lady on the phone, and I loved the kneel here sign in the office. I hope for more sequels."
    },
    {
      "rating": "8",
      "text": "Captain Underpants: The First Epic Movie knows exactly how to convert the widely beloved children's series into a well written film. Although there are some moments that seem like filler, this movie contains constant humor that's actually much more clever than you'd think, likable characters both protagonists and antagonists, and animation that's faithful to its predecessor."
    },
    {
      "rating": "9",
      "text": "I honestly thought Captain Underpants would suck. I thought it was a very stupid idea. But after watching this movie, I laughed my ass off. Pretty great, if you ask me."
    },
    {
      "rating": "6",
      "text": "Captain Underpants is such a masterpiece, it really breaks the glass ceiling for men wearing underpants. In all seriousness however, the movie is a good spin on the books and I didn't mind it. It knows what it is and it doesn't need to be more than that."
    },
    {
      "rating": "6",
      "text": "Was really good up until the 3rd act when it started to take itself too seriously. Really wish the ten year old boys weren't played by 30+ year old actors."
    },
    {
      "rating": "8",
      "text": "this movie was funny with good humor for kids and it had a good message, as well."
    },
    {
      "rating": "10",
      "text": "This Movie Is My Favourite Superheroes Movie Because It's Was Based Of An Book By Dav Pilkey (Even Dav Pilkey Was 52 Years old) The Voice Cast Was Amazing, The Animation Was Maded By Dreamworks Animation, And The Music Was Good! YOU SHOULD GET THIS MOVIE"
    },
    {
      "rating": "8",
      "text": "Well this was unexpected. Captain Underpants is a movie I didn't expect to like as much as I like it. At first I thought it would be another dumb kids movie with toilet humor every five seconds but it actually turned out to be something different, for the most part. There were things I didn't expect to like as much, like the animation and the visuals. This movie is colorful, energetic, full of style and looks nothing like other Dreamworks movies. It is pretty obvious that they went for a look that is accurate to the source material and I like it. I wonder how Shrek, How To Train Your Dragon or The Boss Baby would've look like if they went the same direction with those. The humor was surprisingly really good. This movie is very \"meta\" at some points and has some really good self-aware humor I did not see coming. Sure it has some toilet humor here and there. For example, there is a scene where they start making fart noises with numerous whoopee cushions and it is so annoying, but thank god that it doesn't last too long, and the movie actually makes fun of the fact that toilet humor is for the lowest common denominator (which is something I totally agree).The voice acting was also pretty good. Ed Helms as Principal Krupp/Captain Underpants was really good, so good that he even got a voice acting Annie nomination. I'm not a fan of Kevin Hart and his attempt to make the voice of a kid was a bit annoying at first but then I started to get used to his voice and it turned into an OK performance. Other than that, the acting for the most part was really good. The villain was pathetic. His motivation was so dumb and his actions and dialogue are even dumber, but okay, I get it, that is the point. He's supposed to be pathetic. He reminded me of the Joker from The LEGO Batman Movie, which was also a pathetic villain which you shouldn't take seriously. Really nothing in this movie wants to be taken seriously. It's a really entertaining, cleverly written at times and fun movie and not much else. It's not a great movie. Mainly because the source material isn't \"masterpiece material\", because even if it is self-aware of its dumb toilet humor, it still has toilet humor, and I'm not a big fan of that. Regardless you should give it a watch. It is definetely worth your time. I dare to say that this is one of the best animated movies of 2017, but to be honest, it doesn't have to much competition. 2017 s*cked in animated films."
    },
    {
      "rating": "10",
      "text": "It's a animation of comedy goodwith goods jokes (this movis it's based on the book of Dav Pilkey)."
    },
    {
      "rating": "7",
      "text": "Very funny with very nice animation story could be more relaxed though good attempt."
    },
    {
      "rating": "10",
      "text": "I love this movie is so funny it is so funny I swear to God I watch this every Monday Tuesday Friday and Saturday I swear to God this phone this is so funny I swear I swear I swear I swear I swear I swear I swear I swear it's so funny that I even pooped my pants I swear to God is so funny motherfuking play every"
    },
    {
      "rating": "7",
      "text": "I liked it. I want it to get a sequel, please. The potty humor actually works in this one."
    },
    {
      "rating": "4",
      "text": "It has some really good ideas but the execution isn’t great, making a forgettable movie."
    },
    {
      "rating": "9",
      "text": "esta pelicula esta injustamente infravalorada, es una adaptación bastante fiel de los geniales libros de Dav pilkey y es bastante entretenida.9.7/10"
    },
    {
      "rating": "7",
      "text": "This movie is just great to watch when you have nothing better to do it has some good laughs and the intro is one of cinemas finest I know it's stupid but it's great none the less"
    },
    {
      "rating": "8",
      "text": "Was fun creative and interesting had a lot of funny jokes basically just a funny movie and has an interesting story overall if you think it looks interesting you should watch it"
    },
    {
      "rating": "2",
      "text": "I hate this movie so much. It has too much potty humor especially when it comes to the villains name. If it weren't for it being a little violently funny or the cast I would give this a 0."
    }
  ]
}