{"id": 2792, "title": "Captain Fantastic", "starring": ["Viggo Mortensen", "Samantha Isler"], "runtime": 118, "genre": ["Adventure", "Drama"], "description": "A father living in the forests of the Pacific Northwest with his six young kids tries to assimilate back into society.", "releaseYear": "2016", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/2sFME73GaD8UsUxPUKe60cPdLif.jpg", "categories": {"plot": 7.142857142857143, "acting": 6.975609756097561, "ending": 6.625, "soundtrack": 8.5, "cinematography": 8.6, "familyFriendly": 3.0, "funny": 7.461538461538462, "action": 7.5}, "reviews": [{"rating": "9", "text": "With a stand-out performance from Viggo Mortensen, Captain Fantastic is an engaging story, and features wonderful cinematography, charm and humor, and brilliant performances."}, {"rating": "8", "text": "A summer sleeper that's somehow managed to sneak in under the radar, but thankfully so. This unconventional family drama addresses a host of poignant issues (some flattering, some critical) on both ends of the social and ideological spectra, raising valid points for consideration and debate (one can only hope, though, that a currently polarized America will have the patience to take the time to listen to each side). With gorgeous cinematography, an engaging script, subtle humor and a number of genuinely moving moments, this seasonal surprise is well worth a look."}, {"rating": "9", "text": "Captain Fantastic is a deeply moving film addressing a common subject in a non traditional context with an optimistic ending.\rWe admired the stunning acting of Viggo and the delightful kids, specially Saja, The grandfather’s role did not fall into the expected cliché of the firm rigid man, rather a mild portrayal of one who understands the specific type of life the family has chosen with a soft objection to it.\rThe comic dialogues and humorous scenes were ticklish and eyebrow-lifting sometimes (Saja’s shocking commentaries) and the sad moments (the father driving back alone) were aspects that highlights the moral and ethical values of the movie and render it close to the heart while engaging the mind in the constant comparison between two opposites worlds.\rMy objections are;  it should have a better title, Captain Fantastic sounds like a title for a comic book! and why it is listed at the bottom of the movies in the theatre?\rProbably the last scene should be the family dancing around their mother’s corpse and the eldest son going to the university.\rThis last scene of the children sitting around a table while their father telling them to get ready to school appears static and a normal.\rBut it is a movie that deserves to be watched and admired."}, {"rating": "8", "text": "Viggo Mortensen plays the free-thinking father of 6 kids who live in the woods. When their mother dies, they board their bus to pay their respects. While the kids are all intellectually accomplished and physically trained, their encounters with civilization (and their mother's relatives) prove challenging. This unique story is filled with moments that are charming and captivating, thanks partly to the sweet, sensitive performances of the children (and Mortensen, of course). There may be scenes that strain credibility, but the way the story is told provides a fascinating and ultimately engaging look at a very special family."}, {"rating": "8", "text": "Is there any effort in giving it a great score? I thought so because Captain Fantastic manages to be an actual fantastic movie for once in a lifetime. Watch it if you can."}, {"rating": "8", "text": "In “Captain Fantastic” Viggo Mortensen, as Ben Cash, is a shoo-in for an Oscar nomination and, possibly, winning the statute! Always an excellent actor here he is even one step better than other times. Besides holding your attention in every scene he is in, including, yes, his required full frontal nudity shot, there are two short scenes that will mesmerize you with one being the screen filled with his full face from the chin up that expresses pain, hurt and puzzlement so distinctively you won’t be able to miss what is going through his emotions. In the second scene, with his son, played by George Mackay, who should certainly get a supporting nomination, they are both so forceful in what they feel you won’t breathe until the camera moves on to the next scene.\rThe story is a simple one of a couple who raise their 6 kids, ranging in ages from about 5-18, in the mountains and forests of the upper Northwest away from civilization. They are taught survival, are home schooled and in the evening they read, eat, play music and talk politics, philosophy and whatever else is on their mind. The opening scene is one of the oldest son becoming a ‘man’ by killing a deer for food, which, thankfully, is over quickly.\rTheir mother has been away for 3 months in the hospital for a bipolar condition and they are all shocked, including dad, when his sister, Kathryn Hahn, calls to tell him that their wife/mother had committed suicide. Though his father-in-law, Frank Langella, doesn’t want him coming to the funeral he has all intentions of fulfilling his wife’s Last Will and Testament and so he piles the kids into their school bus camper and takes them into the outside world.\r“Captain Fantastic” is a roller coaster ride having you gasping by the deer, or other animal, killing followed by the laughing of the youngest asking “What is sexual intercourse?” or her older brother kissing a girl for the first time and then tears streaming down your face as you realize that as much as Ben loves his kids he may be hurting them more and could lose them.\rIn a cast of standouts, including all the kids and Steve Zahn along with Ann Dowd, the dominating figure is Viggo Mortensen followed closely by George MacKay’s performance. Each of the kids have a chance to shine whether it is using the ‘f’ word, in a funny way, or a teenage girl discussing “Lolita” and her feelings about the old man or a boy, not knowing how to deal with death, ‘turning’ on his father.\r“Captain Fantastic” just misses being an excellent film due to a bad musical soundtrack, being a few minutes too long and turning to a ‘Hollywood’ ending which wasn’t needed.\rThe film is rated R due to Mortensen’s full frontal nudity, language, adult themes and talk, the latter mainly by the kids dealing with mature subjects.\rYears ago I said I would stop going to the movies if Charlize Theron didn’t win the Oscar for “Monster” and at this point I feel the same way about Mortensen’s performance!."}, {"rating": "8", "text": "A very good adventure/drama movie about hippie outcasts. It has fun moments too, but not like in comedy, they are the type \"its funny because its true\"."}, {"rating": "7", "text": "A cute and overall worthwhile little indie flick. This much buzzed about Sundance hit works on many levels, thanks mainly to Viggo Mortensen's charming and often times gripping performance, as well as the performances from the actors who played his six children. The film's story however felt a little uneven at times and unsure of where to go or what to say. Granted however, there were also many times where it had its fair share of both funny and heartbreaking moments. Overall, it's a decent enough film worth seeing if you want to see Mortensen in another great dramatic turn that has some fun, quirky moments to spare."}, {"rating": "8", "text": "I would like to explain that this movie is rather smart, and not an easy family comedy at all. Certainly there are many comical scenes which would make laugh even a calm person. But the movie raises a lot of problems, and it ask a viewer to make his/her own opinion - it does not have good or bad characters. Probably, a viewer would determine each character by themselves according to his/her own preferences and beliefs. All in all, actors play their characters very well - even the smaller children. It is also interesting, how some dialogues which do not have much sense in the first half of film receive their own resemblance in the events of the film later, obtaining a rather serious meaning, if you watch the film carefully, of course. It is not the movie to relax and at certain points it should make you sad or even cry, if you are sentimental one. But you should stay aware that this movie is not about its plot - its about showing the situation, around which script is written. You should not expect much of the development - you mostly get to know different sides of characters and obtaining your own opinion about them.\rI would suggst this movie to almost anyone, but not when you want to relax and ave a lil'bit o'laughter with a couple of friends. Get ready to watch it closely, or you might just as well stay dissatisfied, because by watching casually you can't get it at all."}, {"rating": "8", "text": "This movie definitely flew in under the radar last year, but Captain Fantastic is an engaging, heartfelt, and humorous film that tactfully deals with issues on all ends of the political spectrum. The whole cast is incredible, and I really loved the optimistic script."}, {"rating": "8", "text": "In the first scene of music around the campfire I already knew that I would love this movie! What a beautiful story, which brings very important questions and reflections, questioning our way of living but also questioning the other extreme.The story was very well taken, the actors are great, charismatic and beautiful (what a beauty different from each one!) The landscapes are breathtaking and the soundtrack is the key point of this fantastic work, that seems to take us to Live with them in this light and natural way.\"When you have sex with a woman, be gentle and listen to her.Treat her with respect and dignity, even if you do not love her.Always tell the truth, always do the right thing.Live each day as if it were the last.Together, Be adventurous, daring, but enjoy."}, {"rating": "8", "text": "Captain Fantastic is such a poignant, original, and well executed family drama that I forgive them for breaking out into song around a fire place. Twice."}, {"rating": "9", "text": "Thoroughly enjoyed and laughed heartily throughout the movie. Not just Viggo, but all the supporting cast of children and adults were great.I get that it's not for everyone but I happen to be an old hippie so I just loved the politics.Remember, it's just a movie, go and enjoy !!"}, {"rating": "7", "text": "Captain Fantastic's first two acts are brilliant, but its final act fails to live up to their standards. Featuring a phenomenal leading turn from Viggo Mortensen, Captain Fantastic is a funny, charming, and moving little indie film from writer and director Matt Ross. A terrific calling card for future success, Ross has established himself as a man to watch with a nearly phenomenal work that is his most mainstream film to date. The entire cast is more than able in this little indie film about a man and his kids who live in the forests of the Pacific Northwest. An incredibly philosophical film about child rearing, acceptance, and balance, the film is incredibly well-written with its characters carrying a considerable amount of nuance. Nobody is all good and nobody is all bad, instead there is an incredible amount of things we will never understand about those we encounter. The film does a great job balancing these themes, while still telling a truly engaging story and building a world that we can really dive into and enjoy. Overall, Captain Fantastic is a sneaky little indie film that has flashes of brilliance, but its ending is a really let down."}, {"rating": "9", "text": "I think this is one of the most inspiring movies in 2016. It talks about the problems today's society, from media to education. It brings up a strong argument. Everyone thinks kids should take today's standard education. And the movie highlights the point that an average kid today knows jack **** ****\rI do not imply home school is better than school but there is a major flaw in our current education systems.\rKids know nothing. They might know something but most important, we do not teach them to think. Kids don't do enough exercise, do not know how to survive, do not know discipline.\rI like the movie to put that education to that extreme, to bring up the controversy. It is that to start a discussion. I would argue if the character is smart enough to incorporate both his home school with actual school. It will be too perfect and end the discussion.\rWhat it brings out is if you teach your kids 'properly' i.e. to read, to think critically, to understand, there are a lot the kids can get from it (and the current education fails to deliver, the so call education experts can shut up, I do not care about your statistic, the fact is kids have a problem). However, it also demonstrates the other extreme of  home school which is the lack of social interaction. I think this movie should spark a discussion on our current education system.\rI believe in the state, people need to declare.\rI declare I am working in a university. Teaching final year undergraduate and I can tell you how many useless undergraduates have been award a certificate and pumped into the society.\rNo offence, even the best universities in the world, (e.g. Oxford, Cambridge, Yale or Harvard, etc). These universities bring up great and smart graduates which will help to explore and develop knowledge. But in the meantime, there are a **** ton of dumb****s also graduate at the same time."}, {"rating": "0", "text": "Hmm.\r Initially one sees this idyllic rustic lifestyle.  Fantastic scenic shots and a family living off the land.  Kids obediently following dad in a cult like fashion.  Nice, fit and well read.  Experts on every subject from quantum physics to political systems.\r As the movie progresses we see the family have morals that I for one disagree with.\r Happy to steal and lie.\rSomehow the mothers Buddhist faith belief is to be defended to the hilt but Christians are to be made fun of and of course in this day of political correctness the Muslims are not even mentioned.\rFather is at least willing to kill someone else's sheep.\rWalk around naked in the caravan park.  (Do it at home if you like)\rDisrespecting the lifestyle of a family that they stay the night with.\r We also discover that all is not well in the family dynamic.  At the start of the movie we discover that mom is in hospital with bipolar or something and has been there for 3 months.  Then slits her wrists.  3 months and no visits from the family that she so loves?  Later we discover that mom has been going behind the not to be disobeyed dad and helping oldest son to enter university.\r So is he really a fantastic captain or a man with a utopian dream that is perverted by the power of being god of his own little kingdom."}, {"rating": "0", "text": "I totally agree with four most negative Critic Reviews for this film.....\"Captain Fantastic\" is sloppy and lazy and self-indulgent as hell.......and - much worse- it's MANIPULATIVE in ways that any Madison Avenue spin doctor would give his eyeteeth to emulate .....the script is almost laughable it makes so little sense...there is something seriously INFANTILIZED about the Ben character which is conveniently set aside with the cinematic equivalent of a shrug..... and the appeal of the entire film is basically one of romancing and above all infantilizing it's target audience....your review's reference to The Waltons is spot on....This film is a wannabe Waltons for arm-chair activists !……and \"enough already\" with being ga-ga for Glenn Gould’s Goldberg Variations."}, {"rating": "0", "text": "This is a tiresome, cliché-ridden, mess of a movie that pretends to be a radical critique of capitalism and modern life in America, but plays instead as a very bad case of political correctness. It just doesn't work, doesn't add up, and reminds me more of The Waltons than the Communist/Green Manifesto it seems to want to be. If the beginning is sickeningly strange and gory, the worst is yet to come in a happy ending that is treacly, yawn inducing, and just plain dumb. Skip it."}, {"rating": "6", "text": "I never bought into this film's world of a delusional isolationist utopia and the obese capitalist automatons filling the outside world they fled from. It's used as a joke (how dumb this country is!) and as a way of courting empathy through the shared sense of superiority the audience has following this family as the protagonist. It's also outrageously unbelievable -- the kids all know like 6 languages, have read all great works of literature, play instruments, are up to date on all monthly periodicals and science magazines, oh right and outrageously fit and well-fed and know how to hunt and farm and THERE'S NOT ENOUGH TIME IN THE DAY! And the hypocrisy of their lifestyle going mostly unchallenged...But that's not really what this film is about. It's about dealing with grief in the best way you can, however that may be, other people's beliefs and their customs be damned. You're allowed to feel how you want and deal with it as you please. Viggo is great as usual. Taken on those merits, the film works a little more than it doesn't."}, {"rating": "2", "text": "I'm just not impressed with the pot shots at average people being dismissed as fat, stupid, and deluded. The arrogance of the script is so loud it's deafening. I'd love to make a rebuttal but that's the nature of movies - you have to sit and watch. Captain Fantastic was torture."}, {"rating": "0", "text": "What isn't in this Liberal/Leftist mish mash of ideology preaching, ranging from Moaism. Socialism, Stalinism, Marxism, Leninism, etc. To me, it was just one long political diatribe of nausea-ism. And don't forget Hollywood's nod to pedophilia with an unnecessary scene of a young naked girl. No reason for it other than to be titillating and in your face child porno. Viggo Mortensen is too good of an actor to be in, and associated with, this piece of crap."}, {"rating": "5", "text": "Captain Fantastic it’s an uncommon movie, not by the style, but by the story. The idea of raising your children in the nature, free from consumerism and having a healthy life is what every teenager dreams and claims to their friends, that he or she will do it in the future. The thing is that just like those dreams die when the person grows up, the story fades as the film goes by. It never became clear what concept the protagonist was trying to avoid: capitalism, consumerism, occidental culture; just was choosing a healthier life form; all those things or none. The plot was to light for a whole movie, with too many inconsistencies that make difficult its understanding. Beside that, Viggo Mortensen gives a nice performance, even some of the kids did well too; the family issue with the grandparents is interesting and well developed and last but not least, it never turns boring, which surely required a lot of work considering all said."}, {"rating": "3", "text": "Good performances, but this movie is not for everyone.  It's slow and not uplifting.  You know the story.  There are no smiles in this movie.  i saw several viewers looking at their watches as the pace of the movie was tedious..  If this were being shown on my TV, I would have switched channels.  But i stuck it out.  It wasn't pleasant, but at least I enjoyed the AC on this very hot day."}, {"rating": "7", "text": "Good concept, good script, every actor on point (Vigo Mortensen is great in the role even though I feel he just plays himself again and again, but to be fair he gives really great restrained acting pieces towards the end of the film. I still was more captivated by some of the younger actors performances), cool cinematography and great job by the director. It had a few flaws (things that didn´t make sense)from the beginning to me, which did force me to not be crazy about the film for most part of it. However, being fair, it is a very emotinal journey where many pieces have to come together and it is done in a very well executed way. Recommendable in any case."}, {"rating": "9", "text": "This is not a message movie as much as it is a movie about family and knowing that families of all stripes are full of love but also full of mistakes.  In the end though this is just a really fantastic film.  A"}, {"rating": "10", "text": "Very enjoyable film. Story is not cliche. Good child acting. I really appreciate that sometimes you could find a jewel. For US cinematography its quite unique."}, {"rating": "9", "text": "And this one will go as the most beautiful family movie of 2016. So original, it portraits the pros and cons of following a different style of life than the one that society judges as \"standard\", a brilliand, smart, well written and acted drama / comedy."}, {"rating": "8", "text": "The movie was surprisingly very good and very though-provoking. Even though it has the typical family living together story it tells it in a unique and interesting way. All the performances were all fantastically realized especially Viggo Mortensen who continuously shows that he can play in any role you put him in."}, {"rating": "7", "text": "A fantastic idealist movie that neglects the immense potential for abuse and misguidance such choices can have.But still a lovable movie and characters."}, {"rating": "3", "text": "If this were 1968 this might be a good movie. You might even find yourself  saying \"right on\" at some of the lines. But people stop saying \"right on\" when...c. 1973-4?  And this movie is as dated as that for the same reasons. The counterculture isn't just over,  it almost seems quaint in today's harsher realities when good jobs are outsourced, employers who want to give their employees just enough to keep showing up, petroleum companies who spend their money on expensive print ads rather than actually doing the things they profess to do in the ads, ad nauseum. Sure.. all of the sentiments this family believe in are probably   more solid than  most of today's families..but so what? Who cares? And certain things about the film are almost laughably contrived...they travel in an old school bus(like the Merry Pranksters c. 1966) ...at a point of  giving up his  ideals, Mortenson CUTS HIS BEARD OFF, no I'm not kidding. The actually say \"stick it to the man\"..but who IS the man?  We knew that c.1967-1974 but who is the man now? The cops? The politicians? The main reason I saw this was the pretty good reviews and V. Mortensson's appearance. What  a waste.. I wish Vigo would lcontinue to make films like History of Violence, Eastern Promises, the January Man, Jauja instead of slop like this. Maybe it looked better on paper I dunno.  Skip this one, even on a free library dvd."}, {"rating": "1", "text": "Captain Fantastic was far from it.  Hippy father raises six kids, in the forest of course, to conform to his way of thinking. Home-schooled to be anti-business, anti-police, anti-Christian and anti-conservative.  (Sounds like Bernie Sanders was the film’s educational adviser.) I think the prop department must have run out of the standard Che Guevara t-shirts because this nut wore a “Jesse Jackson ‘88” shirt instead.  The kids seemed well-schooled in the leftist arts: they were very proficient at robbing a grocery store while the father diverted attention by pretending to have a heart attack. Take that, you capitalist pigs! I suppose there are people who approve of this film’s message; I just hope they don’t elect the next president!"}, {"rating": "9", "text": "Ben Cash and his six children live in a world beyond time, beyond modernity, beyond common American ideals. The questions this film raises are not deep, but they are very much of the moment, post-Bernie Sanders revolution. At a time when many question the capitalistic foundation upon which America is built, it is intriguing to see what plays out in lives where that foundation is seriously questioned, and none of the answers are definitive.\r In \"Captain Fantastic,\" a family lives what some may see as an idyllic life and others may see as a dangerous fantasy. Perhaps it is both. When a film gives you food for thought as well as entertainment for an afternoon, it is a most satisfying meal."}, {"rating": "6", "text": "The film is not perfect but the performances are top notch. Viggo is solid as the patriarch of this family which has been raised away from modern society. The children are all charming, and you get moments with each of them that connects. The ending lands perfect when the family finally gets to say goodbye to their mother."}, {"rating": "8", "text": "Is an amazing story. A great critic to modern social standards. Viggo Mortensen did an incredible performance in this one. Its movie full of touching and funny moments."}, {"rating": "10", "text": "I have NEVER felt so connected, emotional, inspired by a movie.What a great set of humans.Immediately replayed it after the first viewing.I even signed up just to give this 1 movie a 10"}, {"rating": "4", "text": "Solid acting but imbecilic story and extremely tedious screenplay. Disappointing for Mortensen fan."}, {"rating": "7", "text": "I think it could have been shortened a little bit to make it easier to sit through, That would be my only complaint. It was a very well done and satisfying enough movie. Certainly original plot wise and ended in a way that wrapped everything up nicely.Mortensen gave, at least from the many movies I've seen in 2016, the best performance of the year. He's a seriously underrated actor who totally knocked it out of the park. Come Oscar time, I am rooting for him to win."}, {"rating": "8", "text": "It might sound like another family drama film, but it is most certainly not. The plot is just genius, executed perfectly by a great cast (the kids almost outshone Viggo Mortensen). The themes of the movie are very thought-provoking, all while having funny moments here, and emotional add-ons there. Very nice film."}, {"rating": "7", "text": "Writer/director Matt Ross's Sundance darling is more than just your typical indie flick. Yes, it has the quirky characters, the offbeat humor, and the humble visuals littered throughout, but what separates \"Captain Fantastic\" from indie mediocrity is its thought-provoking thematics and inarguably breathtaking performances. Viggo Mortensen may carry the heart and soul of the film on his protagonistic shoulders, but make no mistake, this film is rounded out effortlessly by the six truly incredible performances surrounding him - the kids, of course. The film might be a little too oddball for some and definitely a bit too highfalutin for others, but I most certainly didn't mind. Here's hoping we get more from Matt Ross soon enough."}, {"rating": "8", "text": "Surviving isn't just a good education, but needs the physical training.This is from a supporting actor turned a director who is just one film old before this. So he wrote and directed this beautiful film. One of the best films of the years that should be in must see list. It was just like the film 'Alabama Moon', only the initial plot that extended for over the hundred minutes. The first thing is the cast, it was the best combination. Lots of future stars are here. It was more like a road movie, except in the opening few minutes.I did not like the entire film, I found a couple of things uncomfortable. Like the killing a deer in the opening scene and the end part. The conclusion was good, I thought it was the best solution for such a story, not for the theme. But then the final shot gave me an impression that they had got compromised. After all these years hard work, I felt they had given up. That did not stop me from enjoying it and recommending it to the others. Still, it is a very unique film that tried its best to avoid the usual cliché.This is the story of a father of six kids, raising them by his own outside the society in the wilderness. But the children are not left behind on the knowledge of the world, especially the philosophies theirs favourite topic. They are bright, as well as tough and can survive in any condition. One day when they get a message that their mother died, the journey begins to attend the funeral and during their way all the adventures are what we're going to witness.Due to the copyright issue the birthday song was altered. Surprisingly, the film was not based on any book. So my utmost appreciation goes to the creator of this wonderful product. Surely it will be a cult classic. It has lots of great dialogue, and bold revelations in a simple way about the facts of the world. Especially like related to the sex and other grown up stuffs clarifying the little kids' doubts.At some point I thought it was okay for the kids to watch with their parents, but it did not get better on that perspective. I mean having lots of main characters as children, the film is not good for their watch. Though the adults should not miss it, even though you are a religious person or any other kind. So highly recommended by me.8/10"}, {"rating": "9", "text": "De todos, o melhor aspecto sobre o cinema é a possibilidade de temas que nele podem ser abordados. O ato de contar uma história é mágico por si só, porém, quando a história que nos é contada vem em um belo filme, tudo se torna ainda melhor. Quando se trata de contar uma história, Matt Ross (que dirige e escreve o longa) sabe o que está fazendo. Capitão Fantástico nos trás a história de uma família que resolve fugir do que é considerado comum para a maior parte das pessoas. Ben cria seus seis filhos na floresta, longe de qualquer sinal da civilização. Ele e sua mulher os educam da forma que acham apropriadas, assim Bo, Vespyr, Kierly , Zaja, Rellian e Nai crescem já cientes das crueldades do mundo e são treinados desde criança pelo pai para o qualquer tipo de situação possível.  Entretanto, a história começa mesmo quando a mãe das crianças comete suicídio, e assim damos inicio a uma jornada primordialmente sobre a importância da família, percas e os principios da civilização em nossas vidas. Crianças lendo sobre Marxismo e manifesto comunista são uma das coisas que vemos com frequência aqui. O filme, no inicio, nos dá uma sensação de uma propaganda socialista que é totalmente desconstruída ao decorrer do filme. Vemos um tipo de sociedade estabelecia nesta pequena família que funciona perfeitamente dentro de seus próprios padrões. O roteiro trata com profundidade a relação de irmão para com irmão e de pai para com filhos. Ben é visto não somente como pai mas como capitão, do qual as crianças sentem enorme respeito.  Viggo Mortensen está em uma de suas melhores performances aqui. Sua atuação precisa nos dá toda a dimensão que o roteiro precisa passar para que o personagem funcione. O posto de líder é perfeitamente executado por Viggo  na pele de Ben. É difícil imaginar outro ator para esse papel.    Entre os filhos quem se destaca é George McKay como Bo. McKay soube dar profundidade ao personagem que oscila entre parecer confiante e inteligente e completamente vulnerável e inocente. Os dois personagens tem um dos melhores diálogos do filme, onde Bo finalmente diz o que está preso em sua garganta a muito tempo para seu pai.A direção suave de Matt Ross acompanha o roteiro. Durante o filme temos várias cenas abertas nos enfatizando a natureza e nos oferecendo com profundidade o ambiente em que aqueles personagens vivem. Ross nunca é ambicioso, sua câmera se move suavemente, sua direção é sensível e faz um contraste perfeito com o roteiro que nos oferece a mesma sensibilidade.  O filme nos proporciona um encontro perfeito entre dois mundos quando os personagens se deslocam de seu porto seguro para se aventurar no mundo considerado normal.  Ben e seus filhos parecem igualmente deslocados vivendo cercados por tudo aquilo que eles desprezam.  O filme também possui uma dose de humor negro que constantemente entra em contraste com a carga emocional que esses personagens carregam. Poucos filmes nos últimos anos trabalharam tão bem a relação entre seres humanos como Captain Fantastic. Os ensinamentos filosóficos de Ben para seus filhos nos inspira e o longa cumpre muito bem seu papel ao mostrar todos os lados de uma mesma situação e aprofundar seus próprios questionamentos filosóficos."}, {"rating": "1", "text": "You know a film is in trouble when you end up rooting for the wrong characters—a fact made worse if you take into consideration the fact that the only semi-likable characters appear until the last third. But, not just that, \"Captain Fantastic\" comes of as a supremely hypocritical sermon whose main ingredients are arrogance and an unpleasant sort of cynicism. I'll admit, though, there are some moments of arresting anarchic beauty every now and then."}, {"rating": "6", "text": "Oh, so that's how you get nominated, not once but twice by showing your dick for cinema.But in all seriousness, Viggo Mortensen was brilliant in this or just in anything he's in. Can't remember a time when he gave a bad performance."}, {"rating": "10", "text": "It is amazing how the film conveys the love of the family in the same way that the viewer clings to the film. Perhaps the main merit of the film is its clever script, which in addition to great fun, creates great dramatic scenes. But his effective direction, his beautiful cinematography and a great soundtrack make the movie something magical. It's a good drama, a good comedy, a good article of discussion. It is a human film and extremely well done, that surprises."}, {"rating": "9", "text": "Sin relación con el Captain Fantastic de Elton John, Viggo Mortensen fue la mejor opción para interpretar a un padre que hace lo mejor posible para demostrar que puede, a pesar de lo cuestionable de sus métodos, cumplir con su compromiso. Una buena opción para celebrar el día del padre."}, {"rating": "8", "text": "Captain Fantastic is about a seemingly well-educated family raised in a life outside the typical civilized life led by their father. However, when they are faced with a tragic incident, they travel back into the city mostly unprepared for life there.\rThis is another great indie film worth checking out. It definitely shows its dedication to its conflict by showing the reactions of people in the city in response to something that the father does. Furthermore, the movie features great characters and a great story.\rWithout giving too much away, the ending just didn't work for me and I didn't feel as if it were earned. Also, it doesn't spend as much energy on its conflict as it thinks it is. With that aside, I recommend seeing this film, especially in this rather disappointing blockbuster season, and will grant it a seal of acknowledgement."}, {"rating": "0", "text": "A la manière d’un Mosquito Coast, on suit dans cette chienlit de deux plombes le papa gaucho strict et sévère qui élève en pleine nature sa smala de 6 mômes… on dirait Mélenchon en Bolivie et sa vie de merde au milieu de nulle part, toujours en train de haranguer ses ouailles et de critiquer le « système »…Toutefois, sa femme étant décédée, il faut bien aller aux funérailles et se heurter aux réalités du monde moderne ainsi qu’à la belle-famille… et ceux-là ne portent pas forcément les méthodes de l’anarcho-gauchiste dans leur coeur !Mais qu’importe, car papa mao a réponse à tout sur l’éducation qu’il prodigue à sa descendance et ce, entre quelques séances de guimauve obligatoire particulièrement assommantes (la môman de la marmaille a clamsé -faut-il le rappeler- et en plus, elle était à moitié dingue).On s’étonne en tout cas qu’il forme ses moutards au « close combat » entre deux lectures des Frères Karamazov, des délires de Noam Chomsky et de quelques essais sur la mécanique quantique) et qu’il offre un couteau « Rambo » au plus jeune… (pour chasser le cerf sans doute) : ces écolos de mon cul restent donc de vrais Américains après tout, toujours la violence dans le sang !Ce ne sont évidemment pas les seules contradictions de ce foutoir « anti-tout » mais nous ne tenons pas à nous étendre plus que nécessaire sur ce merdier d’écolos-gauchiasses à côté de leurs pompes : le père n’est en définitive qu’un gourou et ses enfants sont une mini-secte de trous du cul complètement perdus. Les pauvres."}, {"rating": "9", "text": "I very much enjoyed this film. Viggo was stellar, and the whole cast was great. Great locations, set design, music, and story line. Important themes. Must watch for every American family, young and old."}, {"rating": "3", "text": "I have to admit this is an emotional review, I mean it is more about the content than the esthetics or filming quality of the movie which I did appreciate. First of all, I have no kids but I think the homeschooling a very appealing concept hence my interest in watching this movie. But when you start a movie by killing and eating a reindeer, and the best gift the father gives the 6 years old kid is a pocket knife then you have the impression the message is not what you expected. I believe the director wanted to share a lot of messages, healthy food, minimalism, natural life and character development. But I found the movie full of forced cliches and too exaggerated which left me most of the time with mixed feelings. At the end the kids go to a normal school? Really? Like if there is no middle ground. Again it is a beautiful film to watch in terms of nature, but I got a very confusing message. Would not recommend to anyone question homeschooling unless you want to live in the forest."}, {"rating": "8", "text": "and in his place..Captain FantasticDespite of having a potential head start on its brilliant concept the feature relies upon the usual issues and properties of its genre and still surprisingly reaches to the place where the viewers may have been before but never experienced it like this before. Matt Ross's work is plausible as a director but its writing skills overpowers it and feels a bit unsatisfactory as it itself fails to justify it whilst projecting the anticipated vision on screen. The young actors are supporting convincingly but at the heart of it lies a genuinely moving performance carried off by Viggo Mortensen as a single parent trying to befriend and teach his kids. Captain Fantastic is aware of its eerie bubble created on script and hence spends its first half on setting the characters through it after which it shows its bright and poetic colours that paints this stunning craft."}], "recommendations": ["moonrise_kingdom", "the_florida_project", "the_big_sick", "wonder", "instant_family", "the_help", "freedom_writers", "the_perks_of_being_a_wallflower", "the_glass_castle", "up_in_the_air", "the_intern", "me_before_you", "3_idiots", "lady_bird", "fighting_with_my_family", "the_hunt", "stand_by_me_doraemon_2", "ingrid_goes_west", "manchester_by_the_sea", "the_hate_u_give", "silver_linings_playbook", "young_adult", "the_descendants", "okja", "collateral_beauty"]}