{
  "id": 3119,
  "title": "Captain Phillips",
  "starring": [
    "Tom Hanks",
    "Catherine Keener"
  ],
  "runtime": 134,
  "genre": [
    "Action",
    "Drama",
    "Thriller"
  ],
  "description": "The true story of Captain Richard Phillips and the 2009 hijacking by Somali pirates of the US-flagged MV Maersk Alabama, the first American cargo ship to be hijacked in two hundred years.",
  "releaseYear": "2013",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/vjsEi2JytAT76qrtUHPIhXExZAm.jpg",
  "categories": {
    "plot": 8.658536585365853,
    "acting": 9.0,
    "ending": 8.583333333333334,
    "soundtrack": 8.0,
    "cinematography": 8.285714285714286,
    "familyFriendly": 6.0,
    "funny": 9.75,
    "action": 9.1
  },
  "reviews": [
    {
      "rating": "10",
      "text": "Captain Philips keeps you on the edge of your seat! You think it's intense when the pirates board the ship, but it takes you to a whole new level later on.  I could not look away for a second.  Tom Hanks delivers a breathtaking performance worthy of an Oscar nomination and possibly an Oscar.  One of the best films I've seen this year.  Captain Philips will make you rethink your ratings for other movies!"
    },
    {
      "rating": "8",
      "text": "CAPTAIN PHILLIPS is a perfect film. There is not one extraneous moment, one shot that is not needed, no scene too long or short, and every performance is insightful. Running over 2 hours, CAPTAIN PHILLIPS never feels long and director Paul Greengrass keeps you on the edge of your seat without ever exploiting the situation or going for easy thrills. This is adult Hollywood filmmaking at its finest. And the ending is sublime. The best moment in a very very good film. But is it possible to be too perfect? Yes! CAPTAIN PHILLIPS lacks the insight, depth or commentary that would really take it into the stratosphere."
    },
    {
      "rating": "8",
      "text": "\"Maybe in America, maybe in America\", says Somalian pirate leader Muse; when Captain Phillips asks if there isn’t more to their lives than fishing and kidnapping people. Such an exchange highlights the desperation of the underdeveloped, but does that make their actions justifiable? Such nuances are key in 'Captain Phillips', Paul Greengrass' new film about a group of Somalian pirates who hijack a container ship off the horn of Africa and hold the ship's captain hostage. I must commend screenwriter, Billy Ray, for not only blueprinting the details of this docu-drama but also creating a great character in Capt. Richard Phillips and giving humanity to the four antagonists; who were far more than just \"The Pirates\". With this, Tom Hanks is able to give his finest performance in over a decade as the genuine Capt. Phillips; and newcomer Barkhad Abdi is able to stand toe-to-toe with him; as Muse. This movie kept me on the edge of my seat the entire time. Paul Greengrass has built his career around procedural film making; relying on blunt realism and sharp kinetic thrills. He's in very fine form this time around, doing his best work since 'United 93'. Being ripped straight from the headlines; many may already know how it will all end (albeit, not in such grimy details); but that doesn't seem to matter. Greengrass and his usual editor of choice, Christopher Rouse, know how to construct the adrenaline induced action, the poignancy of the drama and the intensity of the thrills to great effect! “Captain Phillips” was a smart, effective and riveting film; and what else can I say, it was very well made."
    },
    {
      "rating": "9",
      "text": "A terrific film that is well paced with many edge of your seat moments.  Tom Hanks gives a fantastic performance that allows you to feel what a real life situation for a captain is like. A"
    },
    {
      "rating": "10",
      "text": "One of the best of the year with great performance by Tom Hanks, particularly the last few minutes of the film, and by the Somolian actor who played \"muse.\"  The technical details of a large cargo ship, the work of the Navy, including the Seals, and the rescue operations were well and realistically done.  A few critics complained about the opening 5 minutes when Hanks leaves his Vermont home and with wife goes to board his ship.  This small bit added nicely to the film, rather than detracted."
    },
    {
      "rating": "10",
      "text": "Captain Phillips is brilliantly acted and incredibly tense. It features one of Tom Hanks' finest performances and Paul Greengrass at his best behind the camera."
    },
    {
      "rating": "9",
      "text": "The movie was extremely well done with fantastic acting, solid pacing, and very engaging story. Tom Hanks is amazing as usual. No complaints. It is long but does not drag and there are some cool military scenes near the end. Highly recommend."
    },
    {
      "rating": "10",
      "text": "Finally, a truly great movie with perhaps \"The Prisoner\" the only other drama worth seeing in a year of stunning failures.    \"Captain Phillips\" is brilliant, and based on a true story I remember from 2009.    Of course, Tom Hanks is the catalyst here, and once again shows the movie world why he is the greatest living actor today, although Joseph Gordon-Levitt will be a major force to reckon with  if he isn't already, and the great Jennifer Lawrence, probably the best actress out there, will be out in the \"Hunger Games\" sequel \"Catching Fire\" and a new movie with Bradley Cooper later.\rThe key to Hanks' greatness is his believability.    Regardless of his role, he can assimilate anything, making us really think he is what his role says he is.    Nobody could possibly have pulled off \"Forrest Gump\" or \"Saving Private Ryan\" except him.    Now, as a captain of a cargo vessel bound from Oman to Somalia, his ship is taken over by a bunch of unbelievably scraggly pirates, who all deserve praise for their authentic portrayals as well.\rI must ask  is the lead pirate called \"Mule\" an authentic Somalian who Hollywood rescued for this role?    If not, it's shocking how well they did making him especially gruesome and emaciated, almost making the viewer understand how starvation and the brutal regimes controlling that part of the world force people into desperate situations.\rWithout giving up the plot, which is predictable because it was a well covered news story, we see the workings of a cargo ship, the Navy SEALS and the plight of Phillips with alarming accuracy and not a shred of doubt.\rIt is my favorite movie of the year, and perhaps the most moving part is at the end of the film, with Phillips safely in sick bay, and suffering the hysteria of the ordeal as a Navy Corpswoman looks him over.    No silly ass tough guy theatrics here  his reaction is just what normal people would do, not make lame jokes like a Mark Wahlberg film.    In that briefest of times, Hanks puts himself in the top running for an Oscar, and makes you almost cry.    All hail Tom Hanks and the crew who put this masterpiece together."
    },
    {
      "rating": "10",
      "text": "Captain Phillips is a riveting, gripping, edge-of-your-seat thriller that doesn't let up on any level of suspense or emotion. Tom Hanks delivers one of his best performances in recent years, maybe ever, and definitely deserves an Oscar nod for it. The Somali pirates don't have a long filmography, but still delivered realistic and accurate performances. If you think what you've seen all of the what the movie has to offer in the trailers, you've got another thing coming. One of the best films of the year."
    },
    {
      "rating": "9",
      "text": "Not for nothing are Americans accused of being \"isolationists\", men and women who willfully choose to live out of context with a world they deem insignificant and beside the point. Even in this post-9/11 era, stubbornly, Americans still believe they can live in a bubble, despite the pop heard around the world. Captain Phillips, however, serves as a sort of reorientation to the lessons we learned, albeit briefly, and then forgot, in regard to our blow-by-blow synchronous apposition with other nations as always having been a persistent reality, independent of public cognizance or lack thereof. Days after Islamic fundamentalists irrevocably transformed the Manhattan landscape, we asked ourselves aloud, \"Why do they hate us?\" The short answer: colonialism. And our collective forgetting. A film such as The Life Aquatic with Steve Zissou makes no apologies, or even, mention, about our bloody past. In the 2003 Wes Anderson film, the pirates who attack the Belafonte are Filipino, marauders with a century-old grievance, but because the narrative is ideologically naive, the specificity of their ethnicity is treated as a post-colonial joke. The fact that the American occupation set the Philippine Islands on a path towards catastrophic poverty, in which over 200,000 natives died(mostly from cholera) is not important. Nobody mourns the murdered southeastern pirate that Zissou guns down. The captain's revenge against the jaguar shark takes precedence over the more justifiable revenge. Interestingly enough, genre differences aside, the Danish import, A Hijacking, like the Anderson film, also sees the pirates purely as villains. We either laugh at them, or hate them, but we never understand these Third World ruffians.That's not fair. That's not telling the whole story. Captain Phillips, on the other hand, to its credit, shows both sides. At the outset, the filmmaker juxtaposes Muse's struggle for survival in arid Somalia with the captain's whiny middle-class Boston angst. The pirates, for some, become less villains than anti-heroes. According to Muse, the hijacking is just business, differentiating his organization's agenda from Al-Qaeda, when he first threatens Phillips at gunpoint. Muslim or no Muslim, it makes no difference. He doesn't understand that many Americans, even a decent man such as Richard Phillips, see dark-skinned foreigners as one monolithic race, especially to the navy that kills them all. Muse is simply the \"other\", not Somalian. Because thirteen years after the World Trade Center came crumbling down, reduced to rubble by Taliban anti-pilots, many people still live in a vacuum, still possess a blind faith towards our government, who propagandizes the very nature of its tyrannical foreign policy with doublespeak sugarcoating, using catchwords such as \"liberation\" and \"freedom\". Very subtly, the filmmaker evokes the history of Africa's colonization, in which Captain Phillips, presides over a map of the \"dark continent\"; his hands draped over the shipping route, connoting a sense of entitlement, as the co-captain plots their course from Salalah to the Somali Basin. Unilateral to the main narrative, through its subtext, the film concedes that Muse's people, as well as the whole world, have a case to express their anger with militant force against the United States. Ironically, like the Filipino restaurant workers gathered around the kitchen television, learning about the international currency that Zissou stores away on-board his ship, the Somalian pirates too are only thinking about the money, not the historical circumstances that landed them in the third world ghetto. But in the lifeboat, Muse's cohort, Bilal, despite his limited grasp of the English language, senses the captain's arrogance, as America's colonial past rolls off Phillips' tongue, when he tells Muse how Somalian waters are \"international waters\", which is analogous to saying that Liberia, albeit populated with Liberians, once belonged to the United States, who colonized the West African country in the 19th century. Phillips is silent, indifferent to the pirate's remonstrative explanation that \"the big ships\" leave nothing left for them to fish. Whereas the filmmaker understands that the pirate attack on a cargo vessel like the Maersk serves as a last resort to stave off poverty, the captain, as well as the audience, disregards the underlying causes of the conflict at hand.\"You're not a fisherman,\" hisses Phillips, when Muse points a gun at his temple. He, alas, forgets that his country plays a hand in hurting the local economy. Once again, the U.S. plays the innocent victim. As if 9/11 never happened, the captain, with appalling ignorance, ask Muse, \"There's got to be something other than being a fisherman and kidnapping people?\" Maybe, in the final scene, the captain recognizes that the collateral blood on him isn't merely literal. After all, there are no heroes in Captain Phillips."
    },
    {
      "rating": "8",
      "text": "So overall I enjoyed Captain Phillips and it is one of the better films of the year. Good acting, engaging film, and nice cinematography. If you can get past its somewhat lengthy running time and shaky cam & close-ups I think you’ll enjoy the film."
    },
    {
      "rating": "10",
      "text": "Captain Phillips takes you into the emotional breakdown, playing well with the stress of a wonderful script, Tom Hanks deserves Oscar nomination for this role, you should also consider sound, editing, photography, script, editing, direction, and without doubt award for best film."
    },
    {
      "rating": "9",
      "text": "It starts off incredibly slow, but when things pick up shortly later the movie does not let up. It is constantly one of the most intense movies I have ever seen. I was always on the edge of my seat and constantly unsure of how things would turn out next. Tom Hanks is amazing here, but honestly it's Tom Hanks so that's what you would expect of him. The rest of the cast is also astounding. Just the way the main villain is interpreted made me feel sort of sorry for him. The movie feels real and human, which is made extra important because this is based off of a true story. This is an absolutely amazing movie and one that I HIGHLY recommend you watch ASAP. I give it a score of 9/10-Amazing."
    },
    {
      "rating": "9",
      "text": "This movie was both entertaining and thought provoking. My family was talking about it well after the movie was over and that is almost always a sign it was very good. Even the most critical eye theoretically would call this movie good or very good. The few going negative on it either didn't actually see it or might be trolling."
    },
    {
      "rating": "8",
      "text": "With a director like Paul Greengrass and a leading actor like Tom Hanks you can expect some action and drama. And it is delivered as expected.\r This movie is based on real events, the hijacking of a huge cargo ship Maersk Alabama by Somali pirates in 2009.\r Many people question the historical accuracy of the script. I am not going to comment on it. The movie itself is extremely tense and well made.\rMaybe the music is at times a bit too \"dramatic\" to my liking. But performance is solid across the board, and Tom Hanks once again demonstrated that he is one of the very best. I am confident he will be nominated for Oscar and very well may win it (for the third time)."
    },
    {
      "rating": "9",
      "text": "Captain Phillips is an absolute must see film! A stellar performance by the acting god that is Tom Hanks under the direction of the ever dependable Paul Greengrass makes for a highly watchable film. One of the best films you will see for sure. It doesn't disappoint! Based on a true story, Captain Phillips (Hanks) takes command of the MV Alabama under orders to sail it's cargo through the Gulf of Aden to Mumbasa. However, during their journey, Somali pirates board the ship and take him hostage. From their Greengrass excels in doing what he does best. Delivering a suspensful and incredibly tense experience  that will have on the edge of your seats wondering what waits round every corner. Barkhad Abdi's portrayal as the pirate leader Abduwali Muse was wonderful. But as the film heralds towards it's conclusions it's all about Tom Hanks. His performance is undoubtedly an Oscar worthy and he excels and steers the film over the finish line. The film exceeded all expectations I had, but then again it shouldn't have. Paul Greengrass has an impeccable track-record and Tom Hanks never lets you down, he's Hollywood gold! One of the films of the year. Definitely a must see!"
    },
    {
      "rating": "8",
      "text": "Excellent and uncomfortably enjoyable. An initial sketch (not gratuitous as Salon.com claimed) gives a brief insight into who Phillips is, that he has regular domestic anxieties: in short, that he is not a hero, or even a hero in the making. Similarly, the introduction to the Somalis helps us see that they are not villains, but victims of the shocking inequalities in the world.\r Hanks, cast as Everyman once again, comes under increasing pressure as the ordeal unfolds, yet whilst you want him to be freed, you have more sympathy for the pirates than you might have anticipated. When the might of the US war machine swings into action, the ruthlessness of the resolution is neither admirable nor triumphant. Relief is tinged with regret, that we live in a world where the weak cannot survive against such odds."
    },
    {
      "rating": "8",
      "text": "I've wanted to see this movie since i first saw the trailer and I thought it was going to be the best of the year. While I can't honestly say i was disappointed I'd be lying if I said I wasn't expecting more. The main problem comes from the fact that it's just too long and drawn out and Tom Hanks spends the entire movie talking like Mayor Quimby. Still, the acting is solid and there are enough thrills to keep you engaged until the end."
    },
    {
      "rating": "9",
      "text": "The biggest praise I have for \"Captain Phillips\" is that it tells a very dramatic true life story in a very honest fashion.  It doesn't feel exaggerated  the action and drama plays out in a very straightforward manner. Tom Hanks gives a tremendous performance, with enough hints of the Captain's ego to fight off claims he is being canonized in the film.  If you see an ad for this film and it appeals to you, then the film will deliver.  The acting is terrific, the action sequences tight and exciting, and as usual, Greengrass uses a \"documentary feel\" to his directing that makes it feel  as I said as the beginning  honest. And that is a great compliment to everyone involved."
    },
    {
      "rating": "8",
      "text": "With crisp, invigorating direction, a sizable array of engrossing performances, a pulse-pounding score, and subtly profound thematic intrigue, Greengrass strikes thriller gold once again with \"Captain Phillips.\""
    },
    {
      "rating": "10",
      "text": "Outstanding acting! This movie is just must watch for everyone! Based on a true story, it delivers so much pain and pressure that it was hard to believe that this was just a movie! 10/10 For this masterpiece!"
    },
    {
      "rating": "10",
      "text": "This movie is a Paul Greengrass classic! It's an outstanding movie with fantastic acting, especially Tom Hanks. I haven't seen him this good in such a long time. The thrills are there and the adventure based on the true story is unbelievable. This is worth learning about. Overall, it's another Paul Greengrass hit. Be sure to check out my YouTube channel \"TheMovieManLife\" for all things movies."
    },
    {
      "rating": "8",
      "text": "Superbly directed by Greengrass and led by Hanks and Abdi's powerful performances, 'Captain Phillips' is a tense and exhilarating film experience, that may lose its way in its second act, but is compensated for in it outstanding first and second."
    },
    {
      "rating": "7",
      "text": "The film is presented with a rather impressive hand-held camera style, and the plot engages the audience with a balanced pacing of thrills. Tom Hanks is somewhat banal, and his character is oddly superfluous, though not absolutely. The real force is Barkhad Abdi, an amazing new talent. His character is both contemptible and sympathetic, and he brings a raw experience having grown up in Somalia. And I must add that his improvised line \"Look at me, I'm the captain now\", shows his capabilities. I support his Oscar buzz."
    },
    {
      "rating": "8",
      "text": "Captain Phillips is brilliant, captivating and \"direct hit.\" The film was a little bit slow in the beginning but picks up and leaves you holding tight on your seat. There are moments where you just want to turn away and holding your hands to your mouth. Tom Hanks shows time and time again why he is one of the best in the business. He played the character with so much depth it makes you think what would you do in his situation. The last few minutes of the movie is sure to earn him his award nominations for Best Actor."
    },
    {
      "rating": "9",
      "text": "I have to admit that this movie was absolutely stunning! I had absolutely no expectations what so ever before watching this movie. I have seen the Danish movie \"The Hijacking (Kapringen)\", which is about the same (Story loosely based on true events).\rCaptain Phillips was great! I know you should take the story with a pinch of salt and I did.  The movie by it self was so exciting and the last 30 minutes of the game my Heart was literally beating nonstop, faster and faster! Great performance by Tom Hanks. This movie is a must see!"
    },
    {
      "rating": "8",
      "text": "Being held hostage by a dangerous group of modern-day pirates as they wield automatic weapons is something nobody wants to experience, but Captain Phillips will probably be the closest you’ll get to knowing what it's like.  The film is based on the true story of the brave commander of the U.S. container ship Maersk Alabama, which was seized in 2009 by a crew of Somali pirates.  The gritty cinematography and the realism of the characters make Captain Phillips one of the best films of the year.\rDirector Paul Greengrass, who's works include the Bourne sequels and United 93,  once again used his infamous shaky-cam techniques to effectively give the feeling of disorientation and boost the intensity of the film.   The cinematographer was Barry Ackroyd, who chose to shoot with different film depending on which characters were in the shot. If Hanks or his crew members were in frame, they were shot on 35mm, which produced a higher quality picture with more vivid colors and less of a grainy look.  On the other hand, the pirates were shot with 16mm film, giving off a more grainy look with slightly duller color.  These contrasts, along with the hand-held camera look and close-up face shots all accumulated to intensify the already horrific situation.  Greengrass' cast consisted of almost all no-name actors besides Tom Hanks, who gave a possible oscar-nominating performance as he displayed the bravery of being Richard Phillips, captain of the Maersk Alabama. In order to add to the realism, Greengrass didn't let the pirates and Hanks meet each other until they were on set and about to film.  The fear expressed on Hank's face may have also been natural.\rThe first 20 minutes of the movie was the calm before the storm.  Hanks is packing his bags, getting ready to leave his house in Vermont.  His wife drives him to the airport, and you can't help but notice how worried and visibly scared she is.  Her tears and feelings of uncertainty foreshadow the horrific events that follow.  Viewers become emotionally invested knowing the captain has a loving wife back home.  Meanwhile, back on the shores of Somalia, a dream-team of pirates is being assembled.  Similar to the drafting process of a schoolyard football game,  about 8 men are selected from the group, based on strength and determination.  The Somalians grab their AK-47s, and climb into their motorized skiffs as they head to sea with only one objective  to bring home money. Even though the Somalians are embarking on a journey of crime, all they want is a better life.  The contrast of Phillips home-life versus life in Somalia is nothing but saddening.  A part of you almost roots for the pirates to return home with their ransom money.\rWhen Hanks first steps foot on the ship, he goes right into captain mode.  He immediately starts safety procedures and bosses around his lazy group crew workers. After finishing up his last safety drill, he spots 2 skiffs on his radar, headed his way quickly.  One skiff ends up turning around, but the inevitable happens, and the Maersk Alabama is boarded by 4 Somali pirates.  As Hanks sends the crew to hide out in the engine room, he does his best to distract the impatient pirates by offering them water and melon slices to snack on. But the leader of the hijackers, Muse (Barkhad Abdi), has had enough, and eventually takes the captain hostage on a small covered lifeboat, while demanding a ransom of millions in exchange for his return.\rThe claustrophobic lifeboat consisted of Captain Phillips, Muse, and his 3 other helpers  the right-hand man, the hothead, and the rookie.  While in the lifeboat, Hanks begins to form a relationship with the rookie pirate, who's only 16 years of age and displayed just as much fear as Hanks.  Hanks helps the youngster bandage his cut foot and tries to speak with him. He tells the Somalian that he is too young to be hijacking ships.  The dynamics of their relationship was interesting.  They both secretly helped each other, trying to avoid being caught by the hothead, who never hesitated to scream at Hanks and deliver a pistol-whip to his forehead. As the movie progresses, your concern for the safety and future of the young pirate is right there with your concerns for the captain.\rWhat follows is an intense cat-and-mouse game with the U.S. Navy and the little orange lifeboat, full of failed negotiations and uncertainties.  Once the lifeboat is surrounded, it is clear that all 5 men are unsure if they will make it out of there alive.  All 130 minutes accumulate to what is one of the most intense movie climaxes you'll see.  And Hank's brilliant acting in the last 4 minutes caps the movie with a real, heartfelt ending that everyone must see themselves."
    },
    {
      "rating": "9",
      "text": "The plot is very amazing. Climax keeps getting higher and higher! Very intense at very point of the movie. Tom Hank did a fantastic job in playing the role, to be honest it could get him an Oscar for this!"
    },
    {
      "rating": "10",
      "text": "Captain Phillips is brilliantly acted and incredibly tense. It features one of Tom Hanks' finest performances and Paul Greengrass at his best behind the camera."
    },
    {
      "rating": "10",
      "text": "For the first time in a while, I completely forgot I was in the cinema while watching this. An immersing plot that keeps you on the edge of your seat with a faultless performance from Hanks."
    },
    {
      "rating": "7",
      "text": "Paul Greengrass is a director who always focuses his attention on depicting on screen events as realistically as possible. He also knows how to deftly build momentum and a sense of impending urgency and doom, which makes his films always riveting and thrilling. \"Captain Phillips\" is no exception  the film accompanies the process of the hijacking of the ship, and the ultimate kidnapping of the Captain almost in real time. The audience accompanies those individuals and is asked to embark on that little lifeboat and partake of the feeling of claustrophobia and fear that is created. The menace is presented in a very realistic way, as is the final part of the film, where the director stages the rescue attempts by the group of experts that are deployed. Tom Hanks is solid as the stoic and resourceful Captain, and the overall supporting group of actors depicting his kidnappers are equally strong in their performances. An overall entertaining film worth watching."
    },
    {
      "rating": "9",
      "text": "Tom Hanks single-handedly pulled off a realistic and touching real-life story. Such rescue operations is simply flirting with death. One missed shot from the snipers and your hostage's dead. I hope there'll be more security forces in the waters and in the air protecting our merchant ships from pirates. This will prevent exhausting, resource-wasting and life-threatening situations as in Captain Phillips. I cried watching the shock portrayed by Tom Hanks at the end of the movie."
    },
    {
      "rating": "7",
      "text": "I'd been looking forward to CP since the trailer, love adventure stories and this was a good one. I'm not a fan of jittery camera films, however, and this one was 90 percent on the jitter  even when it didn't need to be. So I have a little headache now.\rThe tactical dilemma that's at the core of the story is fascinating and I'm sure has led to a lot of second-guessing as to how the rescue should have been handled.\rThe pirates were really scary dudes, despite not having eye-patches or parrots or peglegs.\rClearly men wrote and directed this movie as they totally ditched the wife after the opening scene. It would have added another dramatic element to have her following the news and getting updates from the military. No doubt their sons also would have come home to support her. This would have been a good balance to Phillips thinking about his family. A massive military rescue at sea is great, but the old ball and chain clinging to the Kleenex would have been a nice, effective emotional touch."
    },
    {
      "rating": "9",
      "text": "Captain Phillips 2013\r Director: Paul Greengrass\r Tom Hanks brings another spectacular, emotional, well presented, and inspirational movie to the big screen. The movie introduced new characters but all of them did their individual roles with excellence. The content of the movie is very new to viewers and successfully introduces  the life of pirates.\r When Captain Phillips leads this massive cargo ship from Jordan to Kenya, it was all supposed be a normal route. But, after several hours in the sea, Captain Philips and his crew faced the unexpected reality of pirates. The fear portrayed by Captain Phillips and his crew and the emotional rollercoaster and dramatic environment makes the movie very interesting to watch and enjoyable at the same time.\r As American, watching the Navy Seals plan and execute a successful mission to save a single American's life is a very inspiring moment and makes viewers proud. The last minutes of the rescue, the intense exchange between the pirates and the American rescue team and the situation inside the lifeboat was very dramatic and all characters performed their part with excellence.\r The movie is a masterpiece in all aspects and is a movie worth watching and a movie that will be remembered.\r Source:\r Captain Philips Movie 2013"
    },
    {
      "rating": "8",
      "text": "Directed, written and pictures are not the only advantages of the film. Delight also raises impersonator title role of Tom Hanks. I can not imagine the upcoming Oscar ceremony without his name on the list of nominees for the statue's role."
    },
    {
      "rating": "9",
      "text": "Captain Phillips doesn't give its audience one moment to relax. The debate over how accurately the film depicts the events of April 2009 has not lessened the film's impact. With another stunning performance from Hanks, a clever screenplay and a gripping soundtrack, I guarantee you that throughout its runtime of over two hours, you will not be bored."
    },
    {
      "rating": "7",
      "text": "Starring in the title role of “Captain Phillips” Tom hanks will undoubtedly receive a well earned sixth nomination and possibly his third Oscar. For two hours he plays the Tom Hanks the audience knows and loves but in the last thirteen minutes tears your heart out as he once did in the AIDS movie “Philadelphia”.\r“Captain Phillips” is based on a true story that made worldwide news headlines in 2009 when 4 Somali pirates boarded the huge maritime container ship the Maersk Alabama  with Captain Richard Phillips in command of a crew of 20. The pirates are lead by Muse, played powerfully by newcomer Barkhad Abdi, who should come in for a lot of mentions during award season, consisting of Bilal (Barkhad Abdirahman) a 19 year old who has no idea what he is doing, Najee (Faysal Ahmed) seeing millions of dollars coming his way when he boards the ship and Elmi (Mahat M. Ali) perpetually frozen with fear. The four live in poverty, sometimes earning money as fishermen and all living on khat, a plant also known as jaad, that provides excitement and euphoria but most of all a loss of appetite that keeps them going for days keeping their mainly thin bodies on edge..\rThe first hour of the film sets up a cat and mouse game, mainly between the captain, crew and pirates, while the second half is the captain and the four pirates encased in an enclosed lifeboat and the attempt by Navy destroyers, helicopters and the Navy seals to rescue the captain without his being armed. This was a time when no one, captain, commercial ships or crew, carried arms of any kind so the pirates with their rifles and guns have the upper hand even against hundreds of men who want to get them.\rThe director, Paul Greengrass, and his cinematographer Barry Ackroyd, along with film editor Christopher Rouse make you feel the claustrophobia of the 5 men in the lifeboat and the power of the waves that an ocean can make.\rAs with most films today, except for the recent “Gravity”, this film, running at 2 hours and 14 minutes, is about 15 minutes too long with a few scenes that could easily been cut by the screenwriter Billy Ray which leisurely sets up the raid both by the pirates and the Navy.\rThe cast is uniformly fine but it is watching the two men, Abdi making his film debut, and the complete turnaround  of stoic, upright Hanks, facing off on tight screenshots that makes this a worthwhile movie to see."
    },
    {
      "rating": "10",
      "text": "Emotions run high in this piracy adventure which is gripping from beginning to end. It is also a much better film than the trailer marketing it suggests. I have always been rather irritated by the Tom Hanks' movie star persona, all saccharine and beaming smiles, and his choice of films are invariably of a very conventional or commercial nature (or both!) adding weight to one's off screen impression of him. In his roles, though, he is usually totally believable and rarely gives a bad performance. His Captain Phillips must rank as one of his best. For the most part it is understated and, unusually for a Hanks turn, he blends in to the ensemble rather than standing out as the obvious star.\rDirector Paul Greengrass keeps the action up close for the most part creating an atmosphere of claustrophobic desperation. He is aided no end by some stunning hand held camera shots with positioning and angles that truly add to the tension. Even when scenes are in darkness or low light the events happening on screen are clearly depicted, unlike in similar situations in many films where you just don't know what's going on because the cinematography is so poor. The editing too is just dazzlingly brilliant and provides the movie with its rapid heart beat.\r The screenplay raises issues on the age of the hijackers and the fac that these 'terrorists' are in fact  fishermen who have had to resort to piracy due to the fact that the western world have over fished the seas. However, it counter balances this particular comment by having Tom Hanks' character state at one point 'You're not a fisherman!' when one of the hijackers violently holds a gun to his forehead. The screenplay may have wanted to appear balanced but I personally know which side I'm on. In the end it is the responsibility of  individual governments to combat piracy. As they say prevention is better than cure. It is incredible to me that governments will do anything in any other situation to prevent acts of terrorism these days. However, in this known problematic area where the evil flourishes man made laws, I believe, don't allow ships to have the proper security and weaponry to defend themselves against such acts. This is not only costly in all ways, but demonstrates stupidity in an extreme form. Stupidity that should be curtailed now!"
    },
    {
      "rating": "10",
      "text": "Captain Phillips is an astounding biopic that is executed with delicate precision to show the true human side of every character involved in the film, evoking pathos, joy and numerous other thoughts and emotions as the tension is expertly built throughout the film. Without a doubt, this is one of Tom Hanks's best performances of his entire career."
    },
    {
      "rating": "9",
      "text": "Captain Phillips is one of the best films I've seen this year with a all round great performance by Tom Hanks it kept me on the edge of my seat the same way Paul Greengrass did with United 93 suspenseful the moment the pirates get on the ship and take over I was thinking  this is good enough but then it gets even better as the movie plays out. Tom Hanks will get an oscar nomination for his performance in this movie or even an Oscar which I think he should overall great movie. Acting A, Music A, Writing A, Movie 10 out of 10"
    },
    {
      "rating": "10",
      "text": "Finally a good movie and maybe the best of 2013. Tom Hanks deserves an Oscar. The rest of the cast was excellent also. It's a must see movie if you love suspence."
    },
    {
      "rating": "9",
      "text": "“Captain Phillips” is the true story of Captain Richard Phillips and his cargo ship Maersk Alabama which, in 2009,  became the first American cargo ship to be hijacked by pirates in over 200 years. The film stars Tom Hanks in the title role with Barkhad Abdi and Barkhard Addirahman playing 2 of the 4 Somalian pirates. Written by Billy Ray and based on the book by the Captain,, this is an intense, armchair gripping story of one man’s drive and ability to deal with his captors while at the same time seeking to protect his crew and his ship. Tom Hanks was never better and he proves here, as he has done so many times in the past,, that he is a versatile and extremely talented actor. This is action and drama at its best and rightfully deserves a 9.. 134 minutes of viewing time was never better spent."
    },
    {
      "rating": "8",
      "text": "This film is based on a true story about a cargo ship that's overtaken by Somali pirates. Tom Hanks plays the captain, who smartly handles the invasion, then bravely endures what comes next. His final scene is the most moving. The tension holds steadily throughout and builds to an effective climax, although it does run a bit long."
    },
    {
      "rating": "10",
      "text": "People will be talking about Tom Hanks' masterpiece for a long time!!! Absolutely stunning and well acted. A thriller that will never be forgotten!!! Awesome!!!"
    },
    {
      "rating": "10",
      "text": "The most intense, atmospheric movie of 2013 so far (year I've seen Gravity and Prisoners). This is an outstanding adaptation of real story with top notch acting and great directing. \"Captain Phillips\" shoul be nominated for Best Picture at Oscar's, Tom Hanks should be nominated for Best Lead Actor"
    },
    {
      "rating": "10",
      "text": "It's a funny and great movie. the best is that i was happy when i looked at it! Like when i was siting and looking at it in the cinema. i eated popcorn!"
    },
    {
      "rating": "10",
      "text": "According to Richard Phillips' \"A Captain Duty: Somali Pirates, Navy SEALS, And Dangerous Days At Sea,\" he tells his true story about a brave commander was kidnapped by pirates. Director, Paul Greengrass (The Bourne Supremacy, The Bourne Ultimatum, and United 93) adapts Mr. Phillips' latest feature \"Captain Phillips\" about a naval officer who has been hijacked by four Somali pirates in a MV Maersk Alabama in 2009. Tom Hanks delivers a great performance who plays a strong captain and he acts very well to become a lost tragic person who was caught up by those nasty pirates. Mr. Greengrass had done  very well to make a realistic event with great suspense, very chilling, and tense of seriousness. This movie is unbelievable with terrific story, wonderful performances, and fascinate moments. I definitely enjoy watching \"Captain Phillips\" a strong commander who held hostage by Somali pirates and it's a marvelous film."
    },
    {
      "rating": "10",
      "text": "I saw Captain Phillips in a packed theater during Sneak Preview week. Let me start by saying the movie is outstanding.  But many of you are reporting this based on a true story?  It depends on your definition of the truth?  The NY Post has reported, that 11 of his crew sued the ship company.  They blamed Captain Phillips for putting them in harms way and described him as aloof, not in touch with reality, and  not a good Captain.  So Hollywood gave us their spin which sounds much better just to sell tickets.  If you can accept that the truth lies somewhere in between, then this is a very good film; albeit, truthful or fiction.  The accolades this film has been receiving are richly deserved. Tom Hanks gives yet another outstanding performance. Even when Tom has nothing to say his acting chops are so brilliant, that his facial expression, says it all. Just about everyone sat on their edge of their seat as the tension during the hostage crisis is so thick, you can literally cut it with a knife. It's the last 15 minutes of this flick when Tom shows his best acting as he releases all the emotions the real Captain Phillips must have felt.   Without question, Mr. Hanks will be nominated for another Oscar. This is a must see movie for 2013.  Enjoy"
    },
    {
      "rating": "8",
      "text": "An excellent movie with a good script, good screenplay, excellent direction and well-acted.  There is plenty of drama with Tom Hanks doing a terrific job.  Plenty to see about container ships, pirates, and the workings of the U.S. Navy.  All in all, one of the better films of the year to date."
    },
    {
      "rating": "10",
      "text": "Captain Philips keeps you on the edge of your seat! You think it's intense when the pirates board the ship, but it takes you to a whole new level later on. I could not look away for a second. Tom Hanks delivers a breathtaking performance worthy of an Oscar nomination and possibly an Oscar. One of the best films I've seen this year."
    }
  ]
}