{
  "id": 3137,
  "title": "Captive State",
  "starring": [
    "John Goodman",
    "Ashton Sanders"
  ],
  "runtime": 110,
  "genre": [
    "Science Fiction",
    "Action",
    "Horror",
    "Thriller"
  ],
  "description": "Nearly a decade after occupation by an extraterrestrial force, the lives of a Chicago neighborhood on both sides of the conflict are explored. In a working-class Chicago neighborhood occupied by an alien force for nine years, increased surveillance and the restriction of civil rights have given rise to an authoritarian system -- and dissent among the populace.",
  "releaseYear": "2019",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/cVo7lylXAUDGuvDZBUYaP8Zjbku.jpg",
  "categories": {
    "plot": 6.333333333333333,
    "acting": 6.266666666666667,
    "ending": 5.615384615384615,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.8333333333333335,
    "funny": 5.0,
    "action": 6.545454545454546
  },
  "reviews": [
    {
      "rating": "9",
      "text": "Really good. I don’t want to spoil anything, so I’ll leave it at that. I highly recommend it."
    },
    {
      "rating": "8",
      "text": "A much better movie than given credit for. There is so much that is very good but so much that is incomplete and rushed. Still, because it’s better and smarter than a lot of crap that’s out there I give it an 8."
    },
    {
      "rating": "5",
      "text": "well, this is a hard one, not as good as District 9, but keeps you interested, a bit slow at times. the id is ok. story ok film just ok."
    },
    {
      "rating": "3",
      "text": "It’s pretty bad. Horrible pacing, suspect special effects and no character development make this feel like the kind of movie Netflix would have put out four years ago..."
    },
    {
      "rating": "5",
      "text": "A well-intentioned but regrettably poorly constructed alien invasion story riddled with relevant but all too obvious and heavy-handed sociopolitical symbolism. In a film that's part \"War of the Worlds,\" part \"District 9\" and part \"Divergent,\" along with other all-too-familiar sci-fi allusions thrown in. we're handed a story that's a little too crammed with ideas, characters, technologies and events to adequately keep track of things given the blistering pace of the story (a quality that, ironically, makes the picture somewhat tedious to watch). This could have been a lot better with some retooling -- and maybe a few more drafts of the screenplay."
    },
    {
      "rating": "5",
      "text": "Pretty much have to go along with the average score here. Seen many worse sci-fi's and I've seen much better. Never got completely bored with it but came close a couple of times. Save your money & watch on DVD or other media"
    },
    {
      "rating": "8",
      "text": "This is a good movie. It has a broad mix of sci-fi, mystery, suspense, action, and clever twists. It is not an action movie or a CGI-fest. Don't go in expecting super-heroes, spectacular explosions, choreographed battles or thrilling chase scenes.This is a thought-provoking story about a dystopian future when humans live under the subjugation of aliens. Think of the French Resistance operating in the shadows of the German occupation during World War II.The movie focuses on the life of a person who is working to escape to the wilderness. He has minor interactions with the rebels in the beginning, but unknowingly becomes an important part of their plan."
    },
    {
      "rating": "10",
      "text": "A well-intentioned alien invasion story riddled with relevant but all too obvious and heavy-handed sociopolitical symbolism. In a film that's part \"War of the Worlds,\" part \"District 9\" and part \"Divergent,\" along with other all-too-familiar sci-fi allusions thrown in. we're handed a story that's a little too crammed with ideas, characters, technologies and events to adequately keep track of things given the blistering pace of the story (a quality that, ironically, makes the picture somewhat tedious to watch). This could have been a lot better with some retooling -- and maybe a few more drafts of the screenplay."
    },
    {
      "rating": "9",
      "text": "One hell of a movie! I'm a little shocked that the critics weren't more on board with this one.  Elegantly-told, it feels like 3 slow-moving seasons of USA's \"Colony\" supercharged into a bite-sized two hour chunk.  Love the story, the effects are incredible, and the acting is perfect - not at all over done like so many sci-fi films of its ilk."
    },
    {
      "rating": "8",
      "text": "Usually when a movie is released without much fanfare and a lack of critic reviews, it's a sign of a stinker.    However, despite some negative reviews, \"Captive State\" is anything but a stinker.    We get tired sure of dystopian futuristic societies, and alien movies any more are almost as abundant as super hero movies.    It's admittedly a tempting subject to portray an alien civilization however the studio wants, either ugly and benevolent, cutesy, or pure malevolent evil.    This movie doesn't show too much of the aliens who have made humans on earth their subjects, but it's much more a believable pitch on the order of \"District 9\" as opposed to the insultingly stupid \"Independence Day\" films.    We are made to draw conclusions, only to have them proven wrong.    The pace is riveting and the film centers around two types of the captive world population:    thoroughly ass kissing and pandering, including corrupt law enforcement in Chicago where this story takes place who take their orders from the \"legislators\", aka the hideous aliens, and brave people who are determined to fight back against both the aliens and the humans who choose a fate as captives, involving turncoats and spies everywhere, making the main thrust of the movie, an attack against their captors and people unwilling to rise up to regain their planet back.    John Goodman is a great actor - totally believable and an ultimately sympathetic character.    If there is one minor gripe, it's the short role by Vera Farmiga, one of the best actresses out there.    Her talent is not utilized to its potential, but even the small role she plays is a critical one.    Most of any possible plot loopholes are closed up in the final part of the movie, and the dramatic feel is top notch for a movie of this genre.    Those panning \"Captive State\" are frankly, unfair.    The pace doesn't allow for the massive \"character development\" they ask for.    Then again, none is really needed that doesn't already present itself.    The film is articulate, dynamic and nothing of the confusing or disappointing descriptions some reviewers have determined it to be.    Just pay close attention."
    },
    {
      "rating": "8",
      "text": "Excellent, tense sci-fi thriller. The best sci-fi, IMO, is allegorical as Captive State certainly is. The alien invasion could just as well be, say, the Nazis occupying Poland, but the suspense is enhanced by the mysteriousness of the aliens -- the unknown is always more frightening. The tension starts within minutes of the movie's beginning, and it slowly escalates over the next 1.5 hours till a climactic scene (which I won't divulge); things subsequently calm down in what seems a sort of epilogue... until there's a surprise (which I won't divulge :-) ). The direction style felt a lot like District 9.I understand some of the criticism about character development, but it's not really a character-driven story. It's about the human desire for freedom and the lengths to which some people will go to obtain that freedom. It's conceptually similar to the tv series Colony: people make choices about the kind of life they want to live and whether it's worth giving up that life for a greater good. It's certainly not surprising to know that some people will always choose to fight for freedom, and we go into Captive State knowing this, but we can still enjoy the ride.The movie doesn't spell everything out for you, which I appreciate, but some might find it frustrating at certain moments where you have to fill in the blanks. It's an intelligent thriller with excellent performances (wish Vera Farmiga were featured more) and an ending which most will find satisfying."
    },
    {
      "rating": "2",
      "text": "Instead of an aliens attack, this film takes place 9 years after they've taken control of Earth. Their presence is largely unseen, but they exert a demanding power over humans. Naturally, a group of rebels plots to destroy them. Anyone expecting lots of cool sci-fi stuff will be massively disappointed. There are a few glimpses, but it's mostly a paranoid drama with lots of ominous threats and little payoff. The filmmakers have also chosen to keep us in the dark: Literally, a lot of scenes are in shadow that don't reveal much of the creatures and figuratively, it's often confusing to figure out what's happening. A plodding, dull disappointment"
    },
    {
      "rating": "4",
      "text": "Captive State is one of the biggest disappointment for me in 2019 so far. The trailer hooked me completely: an image of a stadium singing the Star Spangled banner while an ominous shadow, presumably a spaceship, laying across it.  What you have instead is a pedestrian flick that is reminiscent of any 'police state' type of film or heck..even TV series as a matter of fact. The era of 'peak TV' as we know it now has created series with the production values of 'middle range movies': be it 'The Handmaid's Tale', 'A Man from High Castle' among the meaty offering available today.  Captive State took a similar route but in a completely rushed way: a certain world building is rushed in the first 10 minutes.  Characters are unappealing and just being skimmed through.  The titular aliens? Well, for a race that was so advanced, they actually behaved like the xenomorphs from the Alien series. They are designed to give you a jump scare.  As it is, this is a poor attempt in modernizing a more superior series: 'V', with a seemingly 'menacing / benevolent' alien race taking over the world and instilling a 'Nazi' like state.  If it was made as a TV series in a streaming service, it would have been passable.  As a movie however, a completely forgettable experience."
    },
    {
      "rating": "7",
      "text": "I'm with the Variety review rated 90.  I'm also with the reviews who say it's a mess and very likely was a nightmare to edit.  Still, John Goodman holds the thing together masterfully.  The title is useless.  The real title is Endgame, where one game is played and then the endgame reveals itself.  This pays off handsomely in the third act.  Up to then tho too hard to identify with anyone.  What I suspect is this movie was not story boarded nor pre-vized end to end.  If it had been, the messiness would have been greatly reduced.  It's problems are not lack of talent or good ideas.  It's problems are messy cinematic storytelling.  I also do honor this director's Planet of the Apes contribution."
    },
    {
      "rating": "0",
      "text": "This movie is literally UNWATCHABLE. It makes no sense - it's all over the place.John Goodman, sporting a fresh dye job... cannot pass for 55 yrs of age. Period. He's 66 and there's a big difference. All that aside. It's a jumbled flat mess that you won't be able to.. or want to follow. SAVE YOUR MONEY"
    },
    {
      "rating": "3",
      "text": "This movie was so boring that I had a hard time staying awake. I went into it thinking it was going to be a cool sci-fi alien action movie and it turned out to have like no action and barely showed the aliens. The acting was good it wasn't anything overly amazing but John Goodman did do a good job. This is probably my least favorite movie I have ever seen and I would never watch it again."
    },
    {
      "rating": "9",
      "text": "a brilliant movie! a whirlwind of scifi suggestion. turn off your mind and watch with instinct. it is refreshing and original, i did not get bored once. special effects are minimal yet the story carries the  reader across the finish line and does it with the idea that less is best, and it works so well!"
    },
    {
      "rating": "5",
      "text": "Interesting, but a little too messy to really be good. Ending is a bit weak. Nice try, just falls a bit short of the good stuff. Good for DVD, not really something you'd be happy to have seen in a theatre."
    },
    {
      "rating": "0",
      "text": "So bad.It seems that some kid wrote the script, in that case it`s ok. Otherwise it is just stupid."
    },
    {
      "rating": "3",
      "text": "What a frustrating movie to watch. It had so many good elements: great production and music, great effects, cool aliens. But the story was completely muddled, unclear and lacked any arc at all. What were the protagonists trying to do? They were some kind of insurgency against the (cliched) human-backed alien overlords, but we don't know if they were trying to blow up the aliens or what. To top it off, the ending was weak as hell."
    },
    {
      "rating": "5",
      "text": "An extremely interesting idea with a very uneven pay off. It's well made for the most part, but it's also somewhat forgettable and nowhere near as good as it should have been."
    },
    {
      "rating": "3",
      "text": "Waste of time. Most of the film has people you don’t know running around to places you don’t know for reasons unknown. Could have been filmed in a parking lot. The big reveal is anything but. Goodman must have been desperate, though to be paid fir one expression - a scowl - maybe isn’t that bad. At least Farmiga didn’t waste much screen time on it."
    },
    {
      "rating": "5",
      "text": "Kind of boring.Their clever reveal was \"ok, so what?\" but really I had already checked out."
    },
    {
      "rating": "9",
      "text": "Seriously underrated sci fi. Found it enthralling til the end and wish there was a sequel"
    },
    {
      "rating": "4",
      "text": "It felt quite bad and boring, which is not good for movie that seems like a mix of thriller, action movie and alien/apocalyptic type of movie. Maybe the plot and twist at the end was nice in itself, but the movie depicted it so badly and boringly that the end part I just skipped through which is rare for me. There are much better ones out there about this topic."
    },
    {
      "rating": "5",
      "text": "At the start of the movie, you will expect to see a great movie, then you will just waiting for something interesting, but you will not find it. I was expecting to watch an enjoyable movie, unfortunately, it was boring, slow, no action, the aliens just appear in a few scenes, and unrealistic, also the twist part wasn't surprised, you can expect John motivation since the beginning of the movie, beside the end wasn't satisfied. The only good thing in the movie is giving you some suspense until you get disappointed."
    },
    {
      "rating": "0",
      "text": "You don't need alien invasion for Chicago to be in captive state; the violence there is enough to keep anyone away. Oh, the movie sucked bad."
    },
    {
      "rating": "5",
      "text": "Captive State is an interesting movie. However, It was hard to follow. The ending was kind strange. I didn't understand what happened. Is Hollywood going to make sequence? I don't think so . It is enough."
    },
    {
      "rating": "7",
      "text": "Captive state it´s not a bad movie, but it´s not a good one too.it´s just an average movie with average visual efects and an average scrip, it could be better, it was the essencial idea but it doesn´t really grab you to the seat, the soudtrack was one of the best things along with the acting of the cast, but the rest is just meh,  I usualy rate the movies from 1 to 100 and i would give it 66, it doens´t go really far on what the aliens want and why earth, why some caracther´s really do that...it just passes the time when you got nothing to do."
    },
    {
      "rating": "5",
      "text": "Nicely photographed, good premise.  Looks way more expensive than $25m.  The first act could have used more news clips instead of tweets for exposition.  This movie is very concerned with looking smart, more than being smart.  I quit due to boredom at 2/3."
    },
    {
      "rating": "4",
      "text": "It lacks perspective and feels too much like a deja vu for the obvious lack of originality of its argument.It gets frustrating because I think this could have been more interesting but obviously for the script was enough to settle for a simplistic story and nobody else involved didn't seem interested in going further with extra steps of commitment."
    },
    {
      "rating": "1",
      "text": "Awful movie. Deeply boring. No story, no character development, no action, no tension, no sci-fi. Just watch any film about the Resistance in WW2. It will be much much better. Don't waste your time on this empty, pointless movie. ZERO entertainement"
    },
    {
      "rating": "8",
      "text": "The marketing for this film was quite deceiving and I think hurt it quite a bit with general audiences, but I enjoyed it a lot. The first 20 minutes or so feel a little unfocused, but once it reaches the second act it starts to put things together and inches towards a climax that I found to be highly satisfying. Do not go into this film expecting a ton of action and aliens. The presence of the aliens is felt, but they are hardly ever seen. This is a low budget sci-fi thriller, and a damn good one at that."
    },
    {
      "rating": "3",
      "text": "Αλληγορική sci-fi περιπέτεια με θολή πλοκή, άτονη δράση και ελάχιστη κινηματογραφική φαντασία σε οπτικό, σεναριακό και αφηγηματικό επίπεδο."
    },
    {
      "rating": "3",
      "text": "Qual o ponto desse filme?Até 50m de duração, haja paciência para continuar. O diretor aposta tudo que tem num climax que acontece na metade do filme, cujo todo suspense é direcionado. Nós não entendemos quase nada, pois há pouquíssimos diálogos, o que logo nos leva a crer que haverá um plot na trama. Plot esse houve e foi muito mal desenvolvido, o que automaticamente faz com que todo o filme seja uma perda de tempo, visto que tudo dependia dele. As atuações são mediocres, os efeitos especiais tal como, e quase toda OST do filme é direcionada a uma musica de suspense irritante."
    },
    {
      "rating": "6",
      "text": "Good movie overall with solid performances from the cast. Could have used a little more information and/or backstory for the first hour of the film but stick with it and you will be rewarded with good ending. If you are looking for tons of action and alien battles this is not your film, it is however a good drama with some sci-fi elements."
    },
    {
      "rating": "7",
      "text": "This movie surprised me because it's a Netflix original production that isn't absolute **** Maybe the whole setting could've been better explained, since the movie's length is very limiting, even the characters are mostly shallow. Sure, there are some special moments here and there, but ultimately you won't care if someone dies.Still, it was very entertaining, the setting is realistic, the design of the aliens original, and I had fun, despite its shortcomings."
    },
    {
      "rating": "10",
      "text": "Captive State is a film that is not only entertaining, but also thought-provoking, tackling themes of resistance, government control and power, and the cost of freedom. The story is expertly crafted, with twists and turns that keep the audience on the edge of their seats. The film's atmosphere is palpable, with the gritty and oppressive nature of the alien-controlled Chicago adding to the tension and making the audience feel as though they are right there in the middle of the action. The performances from the cast, particularly John Goodman and Ashton Sanders, are fantastic, adding depth and complexity to their characters. The film also does a great job of creating a believable and terrifying alien threat. Special effects are used sparingly, but to great effect, making the aliens feel like a real and looming presence throughout the film.Captive State is a film that should not be missed. It's a masterful blend of science fiction, action, and political commentary, that will leave audiences thinking long after the credits have rolled. It's a film that will resonate with audiences, and one that will be remembered as a classic in the genre."
    }
  ],
  "recommendations": [
    "sunshine",
    "annihilation",
    "what_happened_to_monday",
    "arrival",
    "mortal_engines",
    "the_cloverfield_paradox",
    "monsters",
    "spectral",
    "anon",
    "coherence",
    "the_tomorrow_war",
    "elysium",
    "reign_of_fire",
    "i_am_mother",
    "eo",
    "chaos_walking",
    "surrogates",
    "source_code",
    "sicario_day_of_the_soldado",
    "the_matrix_reloaded",
    "jupiter_ascending",
    "the_midnight_sky",
    "lucy",
    "valerian_and_the_city_of_a_thousand_planets",
    "the_last_days_on_mars"
  ]
}