{"id": 576, "title": "Captain Marvel", "starring": ["Brie Larson", "Samuel L. Jackson"], "runtime": 124, "genre": ["Action", "Adventure", "Science Fiction"], "description": "The story follows Carol Danvers as she becomes one of the universe’s most powerful heroes when Earth is caught in the middle of a galactic war between two alien races. Set in the 1990s, Captain Marvel is an all-new adventure from a previously unseen period in the history of the Marvel Cinematic Universe.", "releaseYear": "2019", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/AtsgWhDnHTq68L0lLsUrCnM7TjG.jpg", "categories": {"plot": 1.5714285714285714, "acting": 1.6829268292682926, "ending": 1.8333333333333333, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 3.5, "funny": 3.0, "action": 2.0}, "reviews": [{"rating": "0", "text": "Imagine being so powerful you destroy an entire franchise with a single choice."}, {"rating": "4", "text": "I came here because RT is editing and manipulating audience reviews at the moment we speak, I think ppls deserved an fair honest review.Captain Marvel is a average movie, nothing really stand out and nothing really bad, definitely nothing marvellous at all. It a decent stand alone movie but as the major key role of MCU next phrase this movie is a failure, lazy script, soulless acting and funny 10 years old logic, one the worst MCU introduction movie so far."}, {"rating": "4", "text": "A bit of a mixed bag really, this doesn't seem like an MCU film, the tone of it was out of whack, something reminiscent of Green Lantern but better. There seems to be some inconsistencies with the rest of the MCU films but will have to check them out to confirm. I struggled to enjoy this film even the jokes were misplaced as evident by the rest of the cinema not engaging either. I love any fantasy, sci fi spectacle but this fell short and couldn't keep me engaged. I think Brie Larson was miss cast in this role, I know she's a great actor but I think she does better in more dramatic roles, she was totally unconvincing as Captain Marvel and I struggled to invest in the character. Carol's relationship with Maria was difficult to accept or believe, there seemed to be no chemistry or emotional investment between them. I think Charlize Theron would have made a better Captain Marvel, she has the stature and gravitas that is required to bring the character to life.Sam l Jackson was great as Nick Fury but what is the MCU without him, he seems to carry most of the film for me. However, the digital de-ageing was a bit hit and miss, sometimes it looked good but at other times it didn't even look like him at all which took me out of the moment on a few occasions.Ben Mendelsohn was another highlight, he played the antagonist beautifully with a great menacing quality, the depth and believability of his character showed in spades.The CGI again was also hit and miss, for the most part it was OK, not great. At times it was like watching a well rendered cut scene for a AAA PC game and other times, cartoon like, as I mentioned earlier it reminded me of Green Lantern.This film was marketed as a feminist film fighting sexism (and Aliens), did this reflect the sexism of the 90's? At the time I was at UNI studying \"Social Theory and Communications\", basically a liberal left viewpoint and a big part of the course involved media manipulation, prejudice, sexism and critical theory so I was quite sensitive to any form of sexism. This film was more like sexism from the 80's where the older generation were still living in the world influenced by the 50's and 60's and were still using the phrases like \"Smile, it may never happen\" or \"Cheer up\". In essence Carol throwing off the shackles of patriarchy actually belonged in that time as by the end of the 90's, in the UK at least, equality was ingrained into society so status, rights, and opportunities between the sexes was on a level playing field."}, {"rating": "4", "text": "Weakest Marvel film since pre Iron man. Waste of money and time and has made me completely disinterested in End game. Lord I hope they don't follow through with having Captain Marvel finishing Thanos or I'm done with the MCU and they can say goodbye to my money. I'm the lead up to release I thought the haters were just trying to get back at the actress for her comments but they were correct  her character is uninteresting, her acting is abysmal, she has zero charisma and is extremely unlikable on screen. The film might have worked if The casting cerew had gotten the role right. If they want to continue with this character and have her effect the MCU going forward she needs to be recast or cut entirely."}, {"rating": "0", "text": "The movie is boring and mundane. Using the same old formula. No character arch or growth for Captain Marvel. If you miss this movie, you won't be missing anything at all."}, {"rating": "0", "text": "Long, boring, pointless and Brie Larson was miscast. A lot of potential but disappointing"}, {"rating": "1", "text": "This movie beats all my expectations in cringe, stupidity and boredom. LOL. Complete garbage. Fury losing his eye by a cat was the icing on the cake. Im not a white dude btw."}, {"rating": "0", "text": "Never a good idea to force an agenda with a movie. Especially in this genre. Especially when the character representing this agenda is going to front line the whole franchise for the foreseeable future. And especially when the lead is such a toxic feminist."}, {"rating": "0", "text": "Lo unico rescatable de esta película es Samuel Jackson y la escena post créditos, como película de origen deja mucho que desear, muy decepcionado, no recomiendo verla."}, {"rating": "5", "text": "How can the so-called critics all give this film great reviews? It is such a mediocre film. I feel like they must be getting paid well to rate it well.Save your money guys and girls, I wasted an evening in this snoozefest of a film. Such a shame as i am a massive marvel fan."}, {"rating": "4", "text": "This movie was not entirely feminist propaganda but still had light touches to it. The things that bothered me was that Captain Marvel felt more like a Phase 1 film and didn't meet my expectation especially after the incident of Infinity War. This movie felt like it should have been released 10 years ago rather than now. Brie Larson as Captain Marvel didn't show much emotion or expression making me feel distant from her as a person and not easily likeable. Captain Marvel also reached the level of invinciblity at the end of the movie and I was not quite able to relate to the character. Other superheroes like Ironman and Captain America had flaws which every regular human can relate to but not with Captain Marvel.Overall, it was a pretty average movie making this movie the third worst Marvel movie after Thor the Dark World and The Incredible Hulk."}, {"rating": "2", "text": "It was very plain sometimes boring even. And is it me but the villains were so bad in story and acting was not good from villains and form Brie Larson she was to plain and the back story was horrible basically none."}, {"rating": "0", "text": "I would have rather had explosive diarrhea then watch this movie again. It was really boring and felt like it was nothing but bad acting from Brie. I feel as though they could have cast just about any other female lead and it would have been better. The plot was pretty predictable as well"}, {"rating": "1", "text": "Katee Sackhoff would have been a better castin choise for Captain Marvel. Brie Larson acts like a Cardbord cutout, and the Character has no arc. It is not interesting to see an orgin story with not seeing the Character grow. Iron Man had his learning time, Captain America was a sick Man who wanted to serve his people, Black Phanter  had to fight for his Place, Ant Man was a criminal who stood up to fight for the right cause. Every Character from the MCU had a struggle, and anyone had to grow up.Not a good thing to do because you want to inject a new player into a full established universe, and i am worried about Avengers: Endgame now."}, {"rating": "5", "text": "Captain Marvel is a hot mess narratively and never really knows what kind of movie it wants to be. Brie Larson is constantly fighting direction and poor writing and losing the battle in the end. The last thing the MCU needs right now is a Mary Sue with no life. The one thing this movie misses more than anything else though is heart. Without a reason or purpose for existing one is left asking...other than explaining pointless MCU plot points and creating a plethora of fresh plot holes...why was this movie made and who was it made for? Kudos must be given to the make-up artists and a lot of the tech guys behind the scenes. C-"}, {"rating": "1", "text": "This is what happens when you see your childhood stories get used for propaganda of a minority of individuals that think they are right. Not how Cpt Marvel was originally written at all. +1 star for the cat and flashy lights on screen."}, {"rating": "2", "text": "I was excited and emotional during WW and I came out of that cinema looking forward to Captain Marvel. I am a woman who grew up with Monica Rambeau, this movie disappointed me. Brie Larson was monotonous, she was out shined by her co stars notably Samuel and Ben. I don't understand the \"Girl Power\" narrative they tried to shove and I'm female. Especially the \"I'm Just A Girl\" playing in the back during the fight I wanted to hide under my seat because I was cringing. It lacks so much of the emotional context that WW had. Marvel and Disney can do better."}, {"rating": "1", "text": "Poor script that seems to follow a cookie cutter approach that result in a movie struggling to live up the hype, not helped by the wooden acting from larson, one would imagine the amazing samuel l jackson could atleast balance the movie out but he is not given much to work with.Action scenes are hard to follow and most of the movie you are spent wondering what is going on, to only have it be revealed by exposition.Given the highs of the series such as captain america the first avenger it feels as if this movie has fallen flat by attempted political commentary over substance, while marketing itself as a landmark moment for feminism (sorry did these people claiming this not see wonder woman?).Given this movie could have worked if elements were toned down, better editing was placed in to make it flow better and larson given acting lessons.But we all know this will be ignored and blamed on trolls and males."}, {"rating": "1", "text": "Dissapointing bs, cat is funny, CM is annoying. So sorry for the character of Samuel L. Jackson, they ruined him."}, {"rating": "3", "text": "Hi, Russian Troll here. All this fuss was about THIS? The movie is just SO blad and forgettable! I can't believe that MCU undermined an entire decade of build-up just to force feed Endgame with such an underwritten, cliche Mary Sue-ich character. And Camembert Larson... man is she unlikeable! And implying that this movie is somehow groundbreaking? Uhmmm... ever heard about a small phenomenal movie called Wonder Woman?"}, {"rating": "2", "text": "The films is nothing that special tbh, well besides that cat, best part so cute."}, {"rating": "2", "text": "This is just a bland movie with an emotionless actor in the lead role. Marvel needs to be careful if it doesn't want to die after Endgame if this is a sign of future movies."}, {"rating": "2", "text": "Really excellent Stan Lee cameo but not much else. Brie Larson is utterly bland in the role. No real setup for Endgame."}, {"rating": "1", "text": "Once again, the \"hype\" inversely proportional to the type of quality needed in the MCU. Has everyone forgotten that the movies are entertainment, NOT a class room. This won't sway me from Endgame since we've made it this far. I did not leave, nor jeered at the screen with ALL those \"I'm Better than you!\" , smirks. Talk with the antagonistic, taunt them, take a few of there best shots then craft a well thought out, gut-wrench come back. But when the protagonist is just a shell, with no depth, there is no where to reach from...so all answers are there for you in the first place. Don't waist you time or money. Don't take your poor kids, so you don't have to answer their innocent honest questions.  Maybe some of this hated fan base (Why are movie execs, media and some actors portraying the loyal fan bases  of a series of genre as bad? Why, that completely boggles my mind. They have every right to make a film, song, post, blog, etc the way they personally want it. And as the public, we can agree or disagree...enjoy or not. It's our responsibility to check people just like we are checked every day. Sorry, I went off on a tangent.) honest opinions will make sense to them. Make something with pride, quality and care, and that's a pretty good idea to start from. No agendas any more...please. Thank you."}, {"rating": "2", "text": "What a mess of a movie, I don't even know where to start. Jackson and the cat were great, Larson was just a bad casting call or very poorly directed. CGI was decent, but for the MCU it was a bit on the lame side. I did not find the movie over politicized and the boycott stuff was just non-sense. BUT, if like me, you wanted to see this to not miss anything before ENDGAME, save your money and find the post-credit scene online.  That's all you need to know for ENDGAME.  Further, if you're a fan of the comics, there is a lot in this movie to piss off purist.  Hint: Fury's eye.  Over all a very uninspired, boring filler of a movie.  The cat was cool, tho..."}, {"rating": "2", "text": "It was exactly what I expected it to be.  +1 point for the CGI which was ok."}, {"rating": "0", "text": "After this movie my only hope for the MCU as a whole is the inclusion of the x-men so Rogue can put Danvers in a coma..."}, {"rating": "0", "text": "Worst MCU movie, including Ang Lee’s Hulk. It was and absolute chore to sit thru.  If you must see it, wait until it comes on Netflix."}, {"rating": "0", "text": "I wonder what all the \"you're anti-women\" complainers would have said if MCU had made a standalone Black Widow movie, which would almost certainly have gotten a 10 from everyone who gave this a 0 or 1. Scarlett Johansson has conveyed more personality in one side-ways glance than Brie did in this whole movie."}, {"rating": "0", "text": "As Marvel Universe fan I must say that the tittle for this film should be \"Captain Emotionless\"."}, {"rating": "0", "text": "Sad to say but this was the first marvel movie I would tell you to stay away from. The actress has the range of a wooden board and is extremely overpowered and overcomes NOTHING. Hopefully this movie does not ruin Endgame and the MCU."}, {"rating": "0", "text": "A truly boring, dismal movie. The superhero genre may be in a rut, but this one just goes through the motions."}, {"rating": "0", "text": "It kinda makes me sick to my stomach that Marvel pandered to leftists instead of making a good movie...."}, {"rating": "0", "text": "Worst! marvel movie ive seen, what a waste of time and money, Go see Alita! she is a strong female that plays an excellent role the plot and story are amazing"}, {"rating": "0", "text": "Went with a friend to see some good action but slept for at least 1 hour. The rest was mediocre at best but for me the entire movie was built upon Brie Larson's real life agenda, not on the Captain Marvel character. Boring, bland, political and insulting towards real MCU fans. Will go watch Alita instead and I suggest you all do the same."}, {"rating": "0", "text": "Boring, uninspired, slow. Keep your politics OUT of movies, games, and TV shows. It's really getting ridiculous."}, {"rating": "0", "text": "They've made a Marvel blockbuster that, like its central character and actress Brie Larson, is entirely free of personality."}, {"rating": "0", "text": "Marvel/Disney, please, save the MCU from Brie Larsen.  Let us leave her politics out of it, like she should have while promoting this movie, she is a poor actress and this movie suffered because of it.  I know there is a lot of hate going on surrounding this movie because of comments she made but I went in with an open mind to see this movie.  It just wasn’t good.  Sam Jackson was top notch as always but he alone couldn’t save the film.  The story and acting, on brie’s behalf, just weren’t up to the MCU standards all the previous films have set.  People go to movies to escape the bs going on in the ‘real world’ every day, be it politics, society clashes, blah blah.  Just make good films and stop hiring people who for one can not act and secondly care more about promoting their own agenda instead of the actual movie they starred in. I hope End Game follows tradition for the MCU and doesn’t set captain marvel up for a huge role in the future of the MCU or else everyone will suffer; the fans and your bottom line."}, {"rating": "0", "text": "This is by far the most boring and bland movie in all the Marvell Comic Universe. The feminist tone feels forced and the main character doesn't have any flaws, it's ridiculous. If they use her for endgame, I feel like she's going to defeat Thanos without sweating a drop, why wouldn't she?"}, {"rating": "0", "text": "I rue the day when the MCU falls into abject mediocrity; but this is that day. Uninspired characters, contrived plot, and boring action means this film will only satisfy the most fanboy of fanboys. Even as a standalone film, this is preposterously bad - but I fear this will be hard linked into the conclusion of the Avengers arch. I genuinely wish this film would have much, much more."}, {"rating": "0", "text": "Brie Larson may be a brilliant actress, but you'd never know it from this movie. She has to play a Mary Sue, so there's no compelling tension to her character. She's a total bore. Watching her character arc is like watching paint dry. With a few exceptions, Nick Fury (Samuel L Jackson) is the only real entertainment in the movie, but this movie isn't about Nick Fury.  It's about how Captain Marvel is about to ruin Avengers: Endgame, more's the pity. Oh, and don't waste your time writing a review on Rotten Tomatoes.  They are publishing some negative audience reviews, but they're filtering out a good percentage of them in order to keep the score from plummeting too low. For shame, RT. You are rotten."}, {"rating": "0", "text": "I thought Brie Larson would be the worst part of the movie based upon her acting in the movie clips and trailers. But I think the writing out stunk her performance. Yes, Larson was terrible. She has no unique style or charisma and is quite bland and not worthy to headline a big budget movie that needs the audience to actually care about her character. The combination of misguided, amateur writing, and Larson's bizarre acting, made the Carol Danvers/Captain Marvel character seem like a hollow, impossible to relate to robot. And that's saying something when it took Anthony Daniels like 2 minutes to make C3P0 interesting in Star Wars A New Hope. Even the radio controlled R2D2 was a more sympathetic character than Captain Marvel.Yeah, I know Larson is getting bashed harshly, but I'm not going easy on the critique because of that. She was playing a heroine, but came across like Sean Young's Blade Runner replicant or Kristanna Loken's T-X from Terminator: Rise Of The Machines. As I watched the movie, I couldn't stop looking at Larson like I would a car wreck. It was surreal and creepy. I'm not familiar with her acting but surely she does not act like that in every movie. But as I said, the story and all of it's many bad ideas was the worst thing about the movie. Marvel & the writers made their first misstep by setting it in the 90s all so they could retcon the MCU's past and make Danvers the first Avenger. The movie seemed to drag forever and contrary to reports...NO ONE SHINED IN THIS MOVIE!! Sam Jackson's Nick Fury was supposed to be younger but he seemed like a tired old man. Clark Gregg should have been used better. The bits with the cat were one of the worst things in any movie, EVER! The finale was like watching Superman VS The Riddler. I can't even call that a final fight. I am amazed that Marvel would make such a bad movie, even though Doctor Strange, Spider-Man Homecoming and both Ant-Man movies were flat lined bores. Infinity War was vastly overrated. But Captain Marvel....so bad it's possibly worse than Iron Man 2 and Thor 2."}, {"rating": "2", "text": "Boooring.  The lead actor, Brie Larson is a terrible, uncharismatic super-hero.  This is actually the first female superhero, from Marvel that I would prefer to never see again."}, {"rating": "3", "text": "They made a character with no real weakness who spends the entire movie as an expressionless hero with no charisma.  I was so bored during this movie.  By the time the pace FINALLY picked back up near the end, it was too little too late.   This entirely forgettable entry into this massive film franchise is completely skippable.  You won't need to see this to understand what's going on in Endgame.  Yes, there will be this new Captain Marvel character in Endgame, but all you really need to know is that she existed back in the 90's and finds her way back to the action \"in the nick of time\" once Endgame rolls around.  One thing to note:  Your experience of the MCU as a whole may be lessened if you see this movie or accept this movie as canon.  They literally retconned Captain Marvel as the BEGINNING of the Avengers, as well as the battle for control of a certain macguffin that was central to phase 1 marvel's climax.  They also introduce a plotline where there's little reason for the Kree to have largely ignored Earth all this time since the 90's.  This is a pretty big plothole.How does this rank compared to the rest of the MCU?  It's right at the bottom; near but below Thor the Dark World and Iron Man 2. If Thor 2 and Iron Man 2 are both 2/5 stars, this one is 1.5/5 stars."}, {"rating": "2", "text": "The worst Marvel movie (so far). Bland, painfully cheesy and predictable. Just wait for the post credit scenes to be uploaded to youtube and skip the rest. Also, the cat has a wider acting range than the main actress. She had the same \"I am soooo tough\" facial expression throughout the entire movie."}, {"rating": "2", "text": "Went and saw this movie this morning with my two nieces. We left the theater kinda disappointed. It's a movie I think I would have rather waited for until it came out to rent on DVD (for a lot cheaper).The Good: I really liked the Stan Lee tribute and cameo at the beginning of the movie. The Captain Marvel origin story is pretty good. Some of the acting was good. The special effects were good. The cat was great.The Bad: The pacing of the movie is off (especially at the beginning). Too much story crammed into only a 2h 4m movie. Tons of expositions. The forced puns and jokes aren't funny (no one in the theater laughed at the obvious attempt). Bre Larsen's acting is mediocre and her range is lack-luster. The writing is kinda sketchy and bad in places (especially on WHY Captain Marvel is so over-powered and nigh God-like). The plot seems oddly familiar -- certain scenes are exceptionally reminiscent of Captain America. Captain Marvel has ZERO weaknesses -- at no point during the film do you feel or sense that Captain Marvel/Carol Danvers is in any danger. The \"secrete\" end credit clip honestly kind of turned me off from wanting to see Avengers Endgame. The way they portrayed it made it seem like Captain Marvel is completely taking over and will come to the Avenger's rescue and defeat Thanos all by herself."}, {"rating": "1", "text": "I regret wasting my money.  Very sad.  It is boring and insulting to the watcher.  I think we are now seeing the beginning of the end of Super Hero Movies.  Anything the House of Mouse touches has that reverse Midas Touch."}, {"rating": "1", "text": "Captain Marvel is a one dimensional character portrayed as the heroine of feminism.  When a character embodies the self worth of a whole group, the character most be infallible, all powerful as to not offend said group.  This leads to a very boring movie!  Say your money and pass on this one"}, {"rating": "1", "text": "What in God's name happened!? I was totally looking forward to this...I'm not even sure what I just watched. This was supposed to be a solid entry. The script is horrible! Dude, no one should've cleared this through Marvel and Disney."}, {"rating": "1", "text": "I'm giving a 1 just for the cat. The main character was a bland Mary Sue, the CG was **** the dialogues cringy... And I'm not even talking about the feminist agenda pandering."}], "recommendations": ["x_men_apocalypse", "suicide_squad", "dark_phoenix", "jumper", "black_panther_wakanda_forever", "men_in_black_international", "terminator_genisys", "elektra", "seventh_son", "after_earth", "poseidon", "the_old_guard", "the_many_saints_of_newark", "thor_love_and_thunder", "next", "a_wrinkle_in_time", "the_new_mutants", "the_guardian", "wonder_woman", "the_departed", "shazam_fury_of_the_gods", "the_gambler", "ant_man_and_the_wasp_quantumania", "x_men_origins_wolverine", "fantastic_beasts_the_secrets_of_dumbledore"]}