{
  "id": 510,
  "title": "Captain America: The First Avenger",
  "starring": [
    "Chris Evans",
    "Tommy Lee Jones"
  ],
  "runtime": 124,
  "genre": [
    "Action",
    "Adventure",
    "Science Fiction"
  ],
  "description": "During World War II, Steve Rogers is a sickly man from Brooklyn who's transformed into super-soldier Captain America to aid in the war effort. Rogers must stop the Red Skull – Adolf Hitler's ruthless head of weaponry, and the leader of an organization that intends to use a mysterious device of untold powers for world domination.",
  "releaseYear": "2011",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/vSNxAJTlD0r02V9sPYpOjqDZXUK.jpg",
  "categories": {
    "plot": 7.928571428571429,
    "acting": 8.586206896551724,
    "ending": 8.384615384615385,
    "soundtrack": 6.0,
    "cinematography": 9.0,
    "familyFriendly": 6.0,
    "funny": 8.5,
    "action": 8.217391304347826
  },
  "reviews": [
    {
      "rating": "10",
      "text": "I go to the movies almost every week, some weeks I go more than once. I must say this summer has been full of disappointments. I was getting so upset at all the big summer movies being ok at best, but then Captain America comes along and blew me away! The movie moves at a fantastic pace with the right mix of action, comedy, drama and romance to interest  almost everyone. This is one of 4 movies this summer that is movie perfection. With Super 8 and X-Men out of theaters and since everyone has seen Harry Potter then this is the movie to see. I couldn't have liked it more!"
    },
    {
      "rating": "6",
      "text": "A pleasant surprise, easy cheesey fun and I say that as someone who has never read a Captain America comic book and probably never will, I'm not even American. The standard movie flag waving 'USA is awesome'  even felt less hackneyed here than in many others of its ilk. It's not going to inspire many deep thoughts, but it will take you for a fun frivolous ride for an hour or so."
    },
    {
      "rating": "4",
      "text": "Okay, it's kid's movie.  At a certain point that undeniable and disappointing.  Not much in it for us sober adults.  Stoned or buzzed should be the appropriate counter weight to all the corn ball simple mindedness.  It starts off with just a sprinkling of mozzarella on top but then quickly gets cheezier and cheezier, until it'oozing all over everything and turning into a sloppy bland mess."
    },
    {
      "rating": "6",
      "text": "A period piece set in the second World War! What magic is this? Actually, It's a movie known as \"Captain America: The First Avenger\" and it actually holds up rather well against some other recent dreadful comic book films *cough* Iron Man 2 *cough*. It a small way it could almost be likened to \"Inglourious Basterds\" in that it follows fictional characters in a made up scenario, but in a very REAL war. The action scenes and soundtrack are fantastic yet I couldn't help but feel that the script and direction were too overly simplified."
    },
    {
      "rating": "6",
      "text": "Like the latest X-men movie, Captain America add a new edge to the superhero formula, by pitting the said hero in world war 2. The director keeps the movie light throughout and does not go into the dark area that Dark Knight brought forward. This is surely not a bad thing especially in the beginning where the scenes are ace and a move in such a pacing that they are a complete fun experience. It all looks great especially Evan's transformation to the little guy is impeccable. After that it kind of goes down hill, the set pieces aren't that great and Cap is no Batman, he's just not that interesting. None of this is all that bad except for the fact that the ending is a huge anti-climax which kind of makes the whole movie pointless."
    },
    {
      "rating": "6",
      "text": "Not as good as I expected it to be. Maybe because I saw the Avengers first and it spoiled me. It's not bad for a one time watch but I can't see myself wanting to ever see it again. I'd rather read the comics."
    },
    {
      "rating": "6",
      "text": "Captain America is the typical Marvel film-with one exception. The superpowers aren't terribly evident. Sure, he's muscled and strong, but there aren't any real powers given to him- except for maybe increased agility and strength, but not by much. And that's what saves the film- the audience can relate to Rogers' struggle without having to imagine themselves as a superhero in the first place. He's just like you and me- with a badass shield."
    },
    {
      "rating": "6",
      "text": "Although overall this film was entertaining it at many times  seemed to  drag. The  film however  did serve as a good introduction to captain America."
    },
    {
      "rating": "6",
      "text": "What is there to say, really? This film contains good acting, an at times shallow script, and off pacing. It's fun to watch once, but I can't see it being especially remembered in the future."
    },
    {
      "rating": "1",
      "text": "No need to poke the history of creating films of this type of hostility. In my opinion, a very cheap imitation of BATMAN. Pretty much to not enter a category."
    },
    {
      "rating": "4",
      "text": "This was surprisingly uninteresting and irritating. A bunch of friends who saw this with me all found it disappointing. We watched the Avengers a couple of days later and all loved it so we aren't all negative."
    },
    {
      "rating": "6",
      "text": "The first installment of the Captain America franchise! The First Avenger was a very interesting film as it has a very compellig storyline of Steve Rogers forming into Captain America. It's directed by the director of the god-awful Jurassic Park 3. In this film, he manages to learn from his mistakes and create something that actually makes sense; as well as Chris Evans. He learned from his performance as the Human Torch in Fantastic Four and also created something that makes sense. He basically owns the role of Captain America as I can't imagine any one else that can replace him.\r The problems I have with the film are simple. The way they portrayed the World War II era was a little less horrifying than it actually was -- even though this is historical fiction. In addition, the antagonist, The Red Skull, was kind-of a noticable cliché.  He didn't seem to have any moments that were off the charts; they were just... basic!\r Rating: 6/10\r A+ = 10\rA = 9\rA- = 8\rB+ = 7\rB = 6\rB- = 5\rC+ = 4\rC = 3\rC- = 2.5\rD+ = 2\rD = 1.5\rD- = 1\rF = 0"
    },
    {
      "rating": "6",
      "text": "There's neat ideas all over the shop but they ultimately don't amount to nearly as much as they could. This is ultimately a inconsequential film that has a neat aesthetic but it could have been so much better."
    },
    {
      "rating": "7",
      "text": "Captain America was a decent origin story movie but lacked a great villain just like a lot of the Marvel movies to date. A lot of the characters are important and make multiple appearances in the future whether it be a Captain America or Avenger movie..."
    },
    {
      "rating": "7",
      "text": "it was very cool to see a MARVELmovie that was set in WW2.the developement for the character of steve rogers was excellent, it has some good action sequences. i did not like how they montaged true the movie it was lazy in my opinion7/10"
    },
    {
      "rating": "7",
      "text": "A very underrated character study of Steve Rogers. This film is very important in Marvel lore and its a character study filled with fun action movie stuff. Steve Rogers motives really feel true and Chris Evans makes him such an honest and well written character its amazing. The first half is flawless and fits together perfectly. The writing is superb, the wit and humor, and the 40's setting was really nice to see. However later in the film it feels very montage like and everything feels kind of rushed. Red Skull and Zola where entertaining but flat. However that ending scene was so well done it might almost bring you to tears. The first half is a masterfully written heartfelt story and the second half is an action packed cheesy blockbuster with some fun moments. Overall a very good film."
    },
    {
      "rating": "8",
      "text": "This movie is very underrated as the first 75 minutes were amazing as it did a really good job telling Steve Rogers orgin story. I thought the action scenes were decent. Red skull was about a B-tier villain as he was a decent villain but he could have been better. ALso another problem is they rushed the final battle a little to much, but other than that great movie."
    },
    {
      "rating": "2",
      "text": "It's just another mindless and soulless action movie with appeals of a pizza box. It's just another 2 hour movie prologue for the awaited The Avengers. I know this movie is important, but the movie has to play like it's important. The first Captain America movie isn't bad like it's forgettable."
    },
    {
      "rating": "7",
      "text": "Starts off extremely strong in the first half, building up the MCU's most interesting character yet, pairing him with good side characters, and preparing for a great and thematically rich conclusions, but is stumped in the second half and loses a lot of its steam. The last hour is very much generic superhero action, pulled together by the incredible ending."
    },
    {
      "rating": "8",
      "text": "When I first watched this movie I actually hated this movie as I thought it was very bland and just overall bad. But upon rewatching it the movie has aged pretty good as it is a movie that has been made better and more relevant with the release of movies such as The Winter Soldier, Civil War, Infinity War, and Endgame. The first 75 minutes of the movie are fantastic as Chris Evans did a great job as Captain America but it does a great job really developing Steve Rogers as a character. And the ending where he was like \"I had a date\" was fantastic and is one of the best endings in the MCU. It was sad and very emotional. The fight scenes in this movie are not great but are still pretty good and fun to watch. Now red Skull was kind of a meh villain Hugo Weaving did do a great job but the Red Skull was just ok. And when Steve sacrificed himself at the end It was very powerful and again was made better in Endgame. Captain America is one of my favorite Marvel heroes and I really enjoyed this movie."
    },
    {
      "rating": "10",
      "text": "Never was a huge Captain America fan, but since 2008, starting with Iron Man leading up to Cap's movie, the quality of the movies have gotten better and better - with an exception of Thor - and Captain America is the pinnacle of Marvel Studios' movies' quality. The whole time, you're immersed in the 1940's. I only say \"1940's\" because I'm trying to use as little spoilers as possible. But the movie is a blend of a WWII movie, a Superhero movie and a Sci-fi movie. It explains the origin of Captain America and really brings you into his shoes and makes the viewers understand his views. The movie is loaded with action, supporting cast - Nick Fury's father, Tony Stark's father Howard, Bucky  and even Stan Lee which is a fun little thing to throw in - and interesting, intense story. The movie definitely made you realize that Captain America IS a hero and the world would be different without him. Bottom line, see the movie. It will make you laugh, it will make you want to punch Nazis and it might even bring about a tear."
    },
    {
      "rating": "10",
      "text": "They really did good for once. You cheered you laughed some kids behind me cried and tried to be brave and cover it up. Unlike the abortion that was Thor this was a movie I did not regret paying to see. Don't bother with 3d. There are about 15 seconds of footage that is crap flying at the camera but the rest is just as good in 2d. Only other Marvel film that was this good was Iron Man 1. I loved the 1940s backdrops that were so exaggerated it was great. It should be fine to take your kids to. A couple people get shot and one guy turns into red mist after getting thrown through a propeller but not so much as a swear or boob. There isn't a nerd alive who Steve Rogers doesn't remind of their childhood. Take kids and elderly if you are a 20 something hipster you will like it to you just won't admit it in public cause it's so dorky. They even worked the punching Hitler in the jaw scene in. Oh and the preview of the new Spiderman? It looks like crap."
    },
    {
      "rating": "10",
      "text": "What can i say? This is Captain America! The best way to put it, they did him justice! I am sooooo looking forward to the Avengers!! You quickly grew to root on Captain America, the graphics were amazing, and the plot was strong. A++!\r P.S. Stay till after the credits!!!!!!!!!!!!"
    },
    {
      "rating": "8",
      "text": "Since my last time that the new Captain America movie could be the lamest superhero ever, and I'm saying \"Come on that's not gonna be good for best superheroes like The Dark Knight, Spider-Man, or Iron Man.\" So I take a chance to watch this movie, and I have to say that this movie was very good with huge CG effects with lots of pulp descent action film. The CG effects are pretty amazing that sometimes it could be handy like creating worlds with atmosphere, instead watching CGI in people on their faces. The actor who played Captain America (Chris Evans) was very good and that's a perfect choice for the superhero. The characters are well acted and I enjoy watching that villain named Red Skull (Hugo Weaving) was dark and very cruelty that he did best villain as Agent Smith in The Matrix Trilogy. The background is neat and the visual looks amazing, of course that I didn't see it in 3D, but I recommend that see it in 2D if you can. Captain America is a solid summer blockbuster hit for the best comic book movie that could attach to my top of X-Men: First Class and more changeling than Transformers 3 that it didn't look too good (of course it stinks!), but very good."
    },
    {
      "rating": "7",
      "text": "This movie will not wow you but all in all a solid entertaining movie. The main problem I found with the movie is that the story does not develop well and some parts are told in a sloppy manner. However the characters are well developed and genuine witch will cause the movie goer to care about the characters and ultimately be attached to the story. Captain America turns out to be an average but fun super hero movie that's worth your time."
    },
    {
      "rating": "10",
      "text": "Five Stars. Yep, that's right. Because I cannot be objective about Captain America one single bit. My first comic book (when I started collecting) was The Avengers. Through years of reading many comics, The Avengers was always my favorite and Captain America was always my favorite hero. Yes, I know they did a really bad movie in the early 90s of Cap, but given the budget and the plan to make the Avengers movie happen in continuity, I EXPECTED perfection out of this movie. They would NOT have been able to pull off any Avengers movie without a solid Captain America foundation. While Chris Evans definitely had the LOOK, I was initially concerned since he had very recently played Human Torch in the Fantastic Four movies. And, in my mind, him playing the immature Johnny Storm was much different than the responsible, mature Steve Rogers. Chris was absolutely perfect. The story was absolutely perfect. The cheese was minimal. The setup for the Avengers movie was perfect. People who have no emotional connection to the characters may find some of it cheesy, but Marvel, while not churning out dark masterpieces like DC is doing with Batman, this was everything I could have possibly wanted in a Captain America film. The Avengers trailer at the end put me over the top. My childhood coming to life on screen is mesmerizing. Excelsior!"
    },
    {
      "rating": "7",
      "text": "Finally...an action hero that emblematizes more than an unwanted web-dweller, an opulent ecolocator, or fancied scrap metal; 'America' is the real deal! This latest film of the Star-Spangled Avenger is one that embodies a perceptible outpouring of nationalistic spirit and ardor, that draws from you, a rallying cry worthy of a few U-S-A-'s. The result, is a fanboy's dream, a new, improved look, and a comic-franchise-to-be, that just might become Marvel's next biggest thing. Think about it...What other comic film, after viewing, could you say made you feel proud to be an American? Zilch. Hey, and who knows, maybe with this country's ever-falling history test scores, a movie--this movie--of all things might be the cure; with Cap on your side, WWII might again be discussed and remembered. But, let's move on. So, you may be wondering: \"Besides the 'feel-good' affect of a potential franchise, and the revival of academic decadence, how was the actual movie?\" And I would tell you...\"Captain America: The First Avenger\" is the first of the historic 2011 summer blockbusters that aims to deliver on a textual basis, in lieu, of on a visual level; granted the visuals are far from peripheral. Farther, the 40's setting is a real delight to rivet in, as well. As for the acting...Chris Evans does a serviceable job as Captain Rogers, although, the 90 pound version is even more refined, and spectacular than the advanced CGI seen on Benjamin Button (2008). Hayley Atwell (Peggy Carter) also does a fine job, albeit, her presence is most known in the form of tightly-fit dress, showcasing her impeccable figure---she fits very well into the 40's dame picturesque. To my own surprise, is the real treasure in 'The First Avenger:' Tommy Lee Jones as Colonel Chester Phillips. Jones' stern, dead-set demeanor was to be expected, but his character brandishes more wit and charisma than other roles. More than anything, and what propels this film past all of the other of its genre---slightly more than X-First Stand---is its element of aptness of tradition; the feeling is conditioned within us. Captain America 'Wants YOU' to come to the theater!"
    },
    {
      "rating": "10",
      "text": "just saw captain america the first avengers and it takes the place of iron man in my eyes as the most dominating marvel comics movie ever made....and iron man set a high bar to reach..."
    },
    {
      "rating": "6",
      "text": "The movie is similar to Thor; the movie's background is heavily limited, the actions are similar to stealth missions in games, and the dialogue is uninspired. However, this is better than Thor because of its capability to bring the morale of the movie and a bad-ass trailer for a upcoming movie in 2012."
    },
    {
      "rating": "6",
      "text": "It is basically an above average film. However, I just personally do not like the ending - The ending is not proper enough - It does not respond back to the exposition of the film. It is just a fake cliffhanger which tries to attract us to watch \"The Avengers\" in the coming year. Pfff..."
    },
    {
      "rating": "8",
      "text": "'' Captain America: The First Avenger '' gives you that pleasant experience of watching a movie. I like these '' serious '' type of superhero movies, like '' The Dark Knight '' (2008). You know, the ones with an intriguing plot, with great action, with realistic situations, with cool villains. That kind of movie when it takes itself seriously. It's like if you took a superhero cartoon series for kids, and making it for an older audience (teenagers, adults and old people). Well this movie offers that special maturity, yet still awesome. Also, Hugo Weaving was so good as the Red Skull. He was believable and bad-ass. This actor deserves more credit. I must say that the cinematography was quite a success. What I mean by that is the ambiance, the lights, everything was perfect to fit the time of World War II (since the story occurs at that moment). I was also impressed how skinny looked Steve Rogers (played by Chris Evans). The special effects were really well done. If you're one of those who were waiting to see this movie, with high expectations, you won't be disappointed."
    },
    {
      "rating": "9",
      "text": "While some I did find some of the action to be a bit too \"montage\" like, Captain America: The First Avenger is the best comic book movie of the summer thanks to it's excellent cast, thrilling action, and appealing script."
    },
    {
      "rating": "10",
      "text": "This movie is awesome. 2011 turned out to be maybe the best year ever for the comic book movie adaptation. Marvel knows exactly what they are doing,"
    },
    {
      "rating": "10",
      "text": "Joe Johnston knocked this film out of the park. Captain America: The First Avenger was awesome. The action was thrilling, the acting was superb. Chris Evans had an award worthy performance and Tommy Lee Jones was Tommy Lee Jones, great as always and funny. They balanced the comedy, action, and story perfectly. The effects were excellent. Few minor flaws here and there but overall a superb film and Marvel really saved their best for last before the Avengers, which btw make sure you stay till the end of the creditz because there is the first trailer for the hyped up film and it looks amazing. I was going to give this film a nine but because of the ending im giving it a ten, go see this film, you wont be disappointed"
    },
    {
      "rating": "10",
      "text": "I saw this movie the day it came out (the first time I've seen a movie the day it came out since Toy Story 3)  and it was AWESOME!!! Thor and Green Lantern were great movies, but this overshadows those two in every way. It's by far the best of the three.(I haven't seen X-Men: First Class). Great acting, great storytelling, and great fight scenes. It's PERFECT!!!\rNot only is it better than Thor and Green Lantern, it's better than Superman, X-Men, and every other superhero movie I've seen except for The Dark Knight and Iron Man. It's one of the best superhero movies ever.\rChris Evans is excellent as Steve Rogers/Captain America. He was the best thing about the Fantastic Four movie. He did the role of Captain America much better than I expected. The rest of the cast did their roles well-especially Hugo Weaving as the Red Skull.\rThe film stays true to the comics. Well, it mostly stays true to the Earth 616 Marvel Universe, but Bucky and Steve being childhood friends and Bucky protecting Steve from bullies stems from Ultimate Marvel, and so does Steve being found by S.H.I.E.L.D instead of the Avengers. Oh well.\rI do like how the film is set during WW2, because Captain America first appeared during WW2, and was frozen in ice near the end of the war and wasn't revived until decades later. I'm glad that Captain America didn't end up like Green Lantern: with reviews it didn't deserve. It's one of the best movies of the summer. I guarantee it. If you go see this movie, you will most likely NOT be disappointed. You won't regret seeing it.  I'm looking forward to the sequel, and I hope Bucky appears as the Winter Soilder."
    },
    {
      "rating": "10",
      "text": "This is, from what I can tell, almost perfectly accurate to marvel lore. It is funny, it is suspenseful, it has romance and loss and heroism and men rising to the challenge. Don't listen to the negative reviews, this deserves nothing less than a 10."
    },
    {
      "rating": "10",
      "text": "This summer has had a lot of lackluster blockbusters, including transformers 3 and Green Lantern, but Captain America is probably one of the best movies to arrive all year long. It has a very good story, and the acting is actually very well done compared to Thor and Green Lantern. It also has it's funny moments which are actually funny, unlike Transformers 3, which were stupid and repulsive. Definitely my favorite movie this summer and probably one of the best Super Hero Movies I've seen to date."
    },
    {
      "rating": "9",
      "text": "Captain America was a great movie, stayed very true to the comics (from my knowledge at least) was not to over the top and it tied in with the rest of the marvel universe quite well. In short 9 out of 10. MERICA!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!"
    },
    {
      "rating": "10",
      "text": "This is by far the best superhero movie of the summer. A satisfying blend of action and humor that while not directly take from the comics keeps most of the spirit of the modern interpretation of the character to heart. The film has plenty of nods to various Captain America characters and objects that should keep fans of the book entertained. This feels much more like a complete film than something like Iron Man 2 did with only a pair of bookends tacked on to smooth the transition to the Avengers. As usual make sure to stay after the credits for something extra."
    },
    {
      "rating": "10",
      "text": "Captain America: The First Avenger is the last of the four characters in The Avengers movie that will have a stand alone movie (at least before The Avengers comes out).  It follows the fantastic Iron Man, a surprisingly decent Incredible Hulk, a decidedly meh Iron Man 2, and an amazing Thor.  So, how did it live up to those?  Pretty frakkin well\r The rest of my review can be found here:\r http://joawmeens.hubpages.com/hub/Captain-America-The-First-Avenger-movie-review"
    },
    {
      "rating": "10",
      "text": "I liked this movie much more than Thor"
    },
    {
      "rating": "10",
      "text": "Briefly, this movie shows enormous to the comics of the era and tat the same time appreciates the the more realistic trend of comic book movies that Marvel supports.  Most importantly it downplays the hokey quality of the era as seen by men and women of the modern era.  It also shows respect to the men and women who made the actual sacrifices that let the Allies win the war.  Chris Evans deserves a lot of credit for not falling into his more comfortable joke-ster persona and taking on the sheer weight of being a human super-weapon, and he does it wonderfully."
    },
    {
      "rating": "10",
      "text": "Just a good old fashioned action movie. Entertaining and fun. don't think to much into it and you'll enjoy the cool special effects, awesome fight scenes, and corny jokes."
    },
    {
      "rating": "10",
      "text": "Ignore all the negitive reviewers they dont know a good film if it smacked them in the face!. This film has everything, humor, action, story, fun, fight scenes, and above all ITS TRUE TO MARVEL LORE! THIS is without a doubt the best marvel movie to date. Marvel studios with every production seem to get better and better and this film has everything. You will enjoy it more if your a marvel fan, but there are some fantasic performances from actors in this movie, Tommy Lee Jones is amazing, Chris evans as Captain America is also amazing, and there is a fantasic support cast making this movie one of the most thrilling, enjoyable experiences in cinema released in cinema this year. Highly Recommend you see this movie. Will be buying this as soon as its out. Oh and btw make sure you stay behind after the credits for a little treat ;)"
    },
    {
      "rating": "0",
      "text": "Although overall this film was entertaining it at many times seemed to drag. The film however did serve as an ok introduction to captain America."
    },
    {
      "rating": "7",
      "text": "Well done action movie, with likeable characters, more or less consistent plot and conservative usage of special effects. Movie with a soul, which Transformers 3 did not have at all. In visual department this movie  borrows heavily from WW2 fantasy action games, such as Wolfenstein. Blue glowing stuff with almost magical properties, desintegrator guns, enemies, environments - definitely not new or original. But copied with taste.\rDon't expect masterpiece, but for a mainstream comic book film this is as good as you can get."
    },
    {
      "rating": "10",
      "text": "This movie was magnificent! A lot of action and the acting was incredible. It completely blew me away!Ranking:1. Captain America- 10/102. Iron Man-8/103. The Incredible Hulk-7/104. Thor-7/105. Iron Man 2-7/10"
    },
    {
      "rating": "7",
      "text": "The action kept the interest, but the plot was an average Marvel film. It was was a good film with good video content and a must watch for Marvel fans."
    },
    {
      "rating": "10",
      "text": "When I saw this movie, all I could think about was how it instantly stacks up to the all-time great films in its category. What I said about classics like Iron Man, Spider-Man 2, X2 or X-Men First Class holds true for Captain America.I love the range of emotions and development you experience following Steve Rogers from beginning to end of the film. He grows in to the hero role and you grow to like and admire him as you watch, maybe more so than any other Marvel hero. I know, that's saying a lot since that's what truly makes Marvel great. It's not superpowers but relate-able pathos and depth of character. Well, Cap delivers all that and more. It all works remarkably well as they humanize Steve and draw you in to the story. First Avenger is not just a good comic book movie. It's a great movie period.The complexity, depth, heart, emotion and action are off the charts. I honestly can't believe we're going to see a better movie this summer and, for that matter the rest of the year. I totally agree with most of the film critics who are raving about it. The complexities of a man dressed in a flag are more then anyone could have been expecting. The evolution and growth of the characters is also something you rarely see in a summer film. I loved the supporting cast a lot, how many summer films can you say you've seen that flesh out supporting characters? I'm so glad this movie turned out as good as it did and that most people are finding it and loving it as well."
    },
    {
      "rating": "10",
      "text": "To be completely honest, all i can do is adlib the trailer. Where are the best heroes made? IN UHMERICUH........\r Seriously though, this is completely the best film i've ever seen. And i've seen alot of films......"
    }
  ],
  "recommendations": [
    "man_of_steel",
    "black_widow",
    "thor_ragnarok",
    "thor",
    "superman",
    "thor_the_dark_world",
    "indiana_jones_and_the_temple_of_doom",
    "spider_man_far_from_home",
    "x_men_days_of_future_past",
    "edge_of_tomorrow",
    "avengers_age_of_ultron",
    "top_gun_maverick",
    "rocky_balboa",
    "green_lantern",
    "hercules",
    "the_scorpion_king",
    "superman_ii",
    "the_suicide_squad",
    "guardians_of_the_galaxy",
    "dredd",
    "shazam",
    "john_carter",
    "the_forbidden_kingdom",
    "solo_a_star_wars_story",
    "bumblebee"
  ]
}