{
  "id": 4057,
  "title": "Carol",
  "starring": [
    "Rooney Mara",
    "Cate Blanchett"
  ],
  "runtime": 118,
  "genre": [
    "Romance",
    "Drama"
  ],
  "description": "In 1950s New York, a department-store clerk who dreams of a better life falls for an older, married woman.",
  "releaseYear": "2015",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/A8JV3ockAvWOXmcNZyAGqlyTTBw.jpg",
  "categories": {
    "plot": 7.961538461538462,
    "acting": 8.661764705882353,
    "ending": 7.9,
    "soundtrack": 9.0,
    "cinematography": 9.444444444444445,
    "familyFriendly": 3.0,
    "funny": 8.0,
    "action": 8.5
  },
  "reviews": [
    {
      "rating": "10",
      "text": "Breathtaking—every bit emotionally brilliant as it is visually stunning. Todd Haynes has crafted a masterpiece with the very capable help of Phyllis Nagy’s script - and two career-best performances from Cate Blanchett and Rooney Mara. With its against-the-grain subject matter and a sweetly, compelling love story, CAROL will go on to be one of the greatest romances."
    },
    {
      "rating": "10",
      "text": "Carol, writes Patricia Highsmith, “would be in a thousand cities, a thousand houses, in foreign lands where they would go together, in heaven and in hell.” Carol, the latest film by Todd Haynes is starting to cause a rousing stir in cinemas around the world. Breath after breath, she will find home in many cities, countries and eventually our homes. She’s a ripple whose reach grows stronger with each pulse. An embrace between lovers, reunited — ever tighter. A spark set to a fire cracker. A slow burn. She invites us — cineastes, casual movie goers, humans from all walks of life — to see her, to feel her, to be absorbed, enveloped and be reminded of how movies used to move us, shake us in our cores and make our hearts flutter. In a World where we find ourselves more connected to one another than ever before, and yet even further removed from each other, we can still experience and share the gift of Carol.\r Today we are flooded with content, especially an endless stream of movies. We consume films differently than we used to. A trip to the cinema is a rare occurrence. However, we still remember films from another time. We may or may not have seen them, but we would at least know what they are. At least someone would have told us at one point or another that it is a masterpiece. It becomes one when the talent, the means and the circumstances involved in the production all fall into place. There are no shortcomings. The acting, the writing, the directing, the production values, music…everything works in concert to achieve a perfect balance. It’s a rarity to see this achieved today. We can easily pick up on the shortcomings of most movies. The storytelling can be lazy. An over-reliance on CGI attempts to cover plot holes. The acting is wooden…But Carol makes me want to revisit her as soon as the credits have rolled, and I am about to see her for the fifth time.\r It is not just Blanchett and Mara who are luminous, sumptuously playing off each other like partners engaged in committing the perfect crime. The supporting players are excellent. Kyle Chandler welcomes sympathy as Carol’s husband Harge who, despite and air of selfishness and concern for his own reputation, tries his utmost to keep his family unit together. Sarah Paulson is unforgettable as Abby, Carol’s childhood friend and ex, who chooses to remain in Carol’s orbit, to be there as her best friend, at all times, be they joyful or devastating. The rest of the cast, appearing in minor roles or as extras, many from Cincinnati, shed artifice and appear as real people, blending perfectly into the world of the film. Judy Becker’s production design supplies post-war austerity, livid colors and authentic detail while Sandy Powell’s costumes feel unique, stunning but also timely and lived-in.\r Shot on Super 16mm and lensed by Ed Lachman, Carol pays homage to great photography of the 50s. Shots through windows, condensation, reflection, light- and shadow-play evoke the work of Saul Leiter. Photographers like Ruth Orkin, Vivian Maier and Helen Levitt, among others, were also major influences. Lachman and Haynes also referenced Michelangelo Antonioni’s L’Avventura, L’Eclisse and La Notte for their use of abstract and spatial relationships to enter their characters’ minds. George Stevens’ A Place in the Sun and David Lean’s A Brief Encounter informed the point of view of the most vulnerable lover. Even Carol’s editor Affonso Gonçalves shows restraint, lingering on silences, stoking our desire to witness a declaration of love between the heroines, just as Carter Burwell’s sublime score swirls around them. It is as if Carol is a revelatory time capsule, drawing us deeper into her mystery and secrets, where a simple act of love comes at a staggering cost."
    },
    {
      "rating": "10",
      "text": "Carol is absolutely stunning in all senses of the word. A masterclass of powerful restraint. Both Blanchett & Mara are exquisite; their sensual connection is overwhelming. Support from Paulson & Chandler is solid, sympathetic. Cinematography uses street photography images to conjure up post-WWII New York. Sandy Powell's costumes are spot-on as always. Carter Burwell's score mixes well with off-beat standards of the period. We are transported back to the early 1950s - gritty & anxious - not the rose-colored memories of our Disney-fied youth. Nagy's script strips the sometimes-plodding Highsmith novel to its basic elements & events move very quickly with all the extraneous material purged. As a film it works better than the best-seller on which it is based. Oscar voters will have a hard time figuring out which actress to honor. Of course, if this were a straight romance, both would be nominated in non-competing gender-separated lead categories & both would likely win. This is an embarrassment of riches, as they say, since both Blanchett & Mara are giving career-best performances. This is the peak of director Haynes' career, focusing on the strong emotions evoked when one first falls in love. No political agenda. No cynicism. The only cinematic \"trick\" is the use of a structural formula lifted from \"Brief Encounter\"; it works, adding an element of mystery to the proceedings. He has left his ego at the door and put all his skills to the service of the story. Blanchett & husband Andrew Upton are listed as producers on the film. She has been attached to this project for almost ten years, since she first discovered Highsmith's work while working on \"The Talented Mr Ripley.\" She stuck with it through cast & director changes & we should all thank her for her perseverance, along with the folks at Killer Films. For just under $12 million they have delivered a masterpiece that rivals any $150 million extravaganza, and will probably last longer in the hearts of its viewers. [Note: as of 28 Dec 2015, \"Carol\" has grossed over $8 million in limited release.]"
    },
    {
      "rating": "8",
      "text": "'Carol' is a classy, old-school love story that never shoves the idea that it's a \"lesbian love story\" down the audience's throat. Cate Blanchett and Rooney Mara are wonderful here, as is Todd Haynes' direction."
    },
    {
      "rating": "10",
      "text": "It's films like Carol that take one back to love, the love that hurts and you feel through the characters of something everyone wishes for.  The moment. The moment in your heart where you can't stand being from who you are and where nothing else exists but true, heart wrenching love.   It is beautiful, and I certainly do miss that feeling."
    },
    {
      "rating": "9",
      "text": "Therese Belivet: \"I don't know what I want. How could I know what I want if I say yes to everything?\".\r Carol is set in 1950s New York, a department-store clerk dreams of a better life for himself and finds himself falling for an older, married woman.\r Before Carol was even release, it had a lot of Oscar talk with the two main leads and the story itself. It's one of those period piece movies that people start talking about how many awards it's going to win (It's mostly Gold Derby predictions) and not actually talking about the movie itself, only the awards and it's quite sad when I think about it. But all that a side, I've been anticipating Carol for awhile now, just because of the two main stars and the beautiful teaser trailer that got me interested in seeing it. And after seeing Carol I am lost with words right now, I mean wow. It's without a doubt the best movie of the year.\r Cate Blanchett continues to amaze me and I don't think it's going to stop anytime soon. Shes tremendous in everything movie I've seen her in and in Carol she amazed me even more. Blanchett was absolutely phenomenal in this movie as she delivered such a powerful performance. It's by far her best performance and movie (In my personal opinion). I basically ran out of things to say about her, since I always say the same good things about her performance. I think sometimes things are too brilliant to be put into words and it's best to be watched.\r Rooney Mara has come along way, because if you look at her track record of all the movies shes been in. She can star in a bad movie like the 2010 remake of A Nightmare on Elm Street and then later appear in The Social Network. Same thing can be said this year as she was in \"Pan\" which was a massive piece of crap and she was so bad in that movie, but not here, because Mara gives a stunning and brilliant performance. Mara and Blanchett both deliver a stellar performance and both of them had great chemistry, I mean it was really touching and quite beautiful to watch.\r With a movie like this you would think the romance between the two would be overly sloppy or repetitive like some romantic movies, but not this one. There's only a few scenes in this movie where one of them say \"I love you\" but that's it and it's never repeated. The thing I love about this movie is that the romance didn't feel force or cliche. The one thing I can't stand in romance movies is where the two lovers talk about how much they love each other and why they love each other, I mean screenwriting like that is just the worse, but Carol avoids all that and goes for a creative way of showing the romance that's best to be seen and felt. There's a scene in this movie that's personally my favorite scene of this year so far, and that's when the two of them are in the car going through a highway tunnel. Then we get to see Rooney Mara character (Therese) point of view as she looks at Carol and you as an audience member get to see what makes Carol so special in Therese's eyes. The scene itself has no dialogue, it was beautifully shot and it's short but wonderful. It may not mean a lot to some people but to me it dose and I wish we had more film making like this, because it's an original and brilliant way of showing human connection, I mean it's much better than the character's repeatedly saying \"I love you\" to each other.\r Todd Haynes did an excellent job directing this movie. Everything that a good director should do in movies is what Todd Haynes dose here. He's the glue to all of this and he brilliantly crafted such a powerful film.\r The cinematography in the movie was magnificent as it had the perfect shots that fitted the story really well. The art direction, the costumes, and the writing were flawless.\r Now for the flaws: My only flaw in this movie has to be that some of the supporting characters were pretty forgettable and could have easily be cut out of the movie.\r Overall Carol is a beautifully crafted movie that tells an emotional story that's so nailed down to reality. It's a movie worth seeing if you haven't checked it out yet."
    },
    {
      "rating": "10",
      "text": "\"Carol\" is a exquisitely filmed, beautifully acted masterpiece. It is based on the 1952 Patricia Highsmith novel \"The Price of Salt\". She is also known for such works at \"The Talented Mr Ripley\". Cate Blanchett stars as Carol Aird and Rooney Mara as Therese Belivet. Kyle Chandler is Carol's soon to be ex-husband Harge. Sarah Paulson rounds out the cast as Carol's BFF Abby.\r Everything about this movie is gorgeous The score is compelling. The cinematography is stunning. We see many shots of the characters through windows, windshields, etc. The colors are crisp. The color palette is all pinks and greens. The sets and costuming are beautiful. Everything is quite proper (as it was during that time). Everything except for Carol who can't bear to spend the rest of her life pretending to be a dutiful wife.\r We see the budding relationship between the two woman as Carol visits a toy store in New York and (accidentally on purpose) leaves her gloves. Therese of course goes out of her way to return them. Carol takes Therese to lunch as a way to thank her... and they fall in love at first sight. Carol is divorcing her husband. He knows she favors the ladies and is going to make her pay by keeping their daughter from her. Carol decides to leave town for a while and asks Therese to join her. And just like that, Therese quits her job and travels cross country with a woman she barely knows. Much is said without words. There are long yearning stares.\r I won't give away the rest of the story since you really need to see it. Suffice to say, when Carol returns home she tries to lead a \"normal\" life in order to see Rindy. Will she conform or face the consequences?\r Finally a movie (spoiler alert) that doesnt involve lesbians dying, being carted off to an insane asylum, or being \"cured\". Hallelujah! Phyllis Nagy does an excellent job with the screenplay. She apparently wrote the first draft some 20 years ago. Todd Haynes as the director handles everything to perfection. \"Carol\" deserves all the awards this year."
    },
    {
      "rating": "10",
      "text": "Il film più bello del 2015 (best movie of 2015 imo).\rLa colonna sonora oltre ad essere molto bella è ben integrata, non invade eppure colpisce e resta.\rNon riesco a immaginare si sarebbe pototo meglio interpretare.\rGreat soundtrack perfectly integrated, you'll love and remember it. About the actress...well I just cannot imagine a better interpretation...\rIn italiano è ben doppiato ma perde comunque qualcosa, se potete vedetelo in lingua originale."
    },
    {
      "rating": "8",
      "text": "Cate Blanchett plays a lesbian housewife in a marriage of convenience. She meets a store clerk (Rooney Mara) and a relationship slowly develops.Set the story in the conservative 50s and things get even more complex. Both women superbly capture their characters: Blanchett is seductively alluring and richly conflicted, while Mara displays an innocence and longing that’s rich yet subtle. Director Todd Haynes has beautifully crafted a period world, while masterfully capturing the longing and frustration of their relationship. The entire mood is genteel and subdued, but the film is thoroughly compelling."
    },
    {
      "rating": "9",
      "text": "Carol is undeniably a revelation. A subtle romantic film, Carol's power is exquisitely defined in the expression on Therese Belivet's (Rooney Mara) face upon seeing Carol Aird (Cate Blanchett) for the first time. The look of love at first sight, as if Carol were the answer to questions Therese had been subconsciously asking her whole life, the film's beauty and elegance is defined in that look. This film is the answer to the question: What is the most authentic romance film in years? Though I may not be gay or a woman, the romance here transcends any false boundary between humanity. In this, director Todd Haynes crafts a truly universal romance film that is for the entire world to behold in awe.\r The same look on Therese's face is shared by Carol at the very end. As Therese walks slowly over to her and Haynes expertly uses slow motion to emphasize the moment, the look of subtle peace and joy highlights what this film does so well. It is not a teenage romance in any way. It is not excessive. It is not over-the-top. It is not cinematic love. Rather, it has a raw authenticity that is truly impossible to ignore. Instead, it consumes you and absorbs the viewer into this lush world that makes you experience the same love and pain as the characters.\r This authenticity is translated into the screenplay, which is a thoroughly poetic and moving experience. The characters of Therese and Carol are so well defined, it is as if they are real human beings and this is merely their tale. The real emotions of love, pain, joy, and hurt, demonstrated by these women is impactful to the very core. However, its real success comes in the dialogue. Therese constantly shooting down Richard (Jake Lacy) and his offers to go away to Europe with him, while immediately accepting an offer to go away with Carol. The encounter between Carol and Harge (Kyle Chandler), in which Carol explains how having her daughter only for a short amount of time and being true to herself is better for her daughter than having her all the time and \"living against her own grain\". Carol not only is a revelation for its power in terms of LGBT romance, but also in its communication of its character's feelings. Instead of explicitly telling you how they feel, it leaves it open for you to pick up on their intentions. Above all of other elements, this is what makes the film feel so authentic. They act and speak like real human beings who express their feelings, but not directly. These women leave bread crumbs for the viewer to figure out what really makes them tick. Not only does this indicate incredible trust given to the audience by Haynes, but it also highlights his trust in the writing and the actors to convey meaning.\r Visually, the film is equally as stunning. Cinematographer Edward Lachman's camera is a magnet for beautiful shots. The heavy reliance upon reflections and mirrors is what truly caught my attention the most, especially when considering when they are utilized and the overall meaning of the film. Carol, above all, is a film about being true to one's self. Carol could have stayed with Harge and kept her daughter. Therese could have married Richard. Yet, neither felt truly satisfied in that life when without one another. Lachman captures this in his use of reflections. In one particular sequence, Therese goes with Carol to visit her home, with Richard bidding Therese goodbye before she leaves. As they drive, reflections abound. Symbolically, this most closely represents the double life being led by these women. A mirror merely reflects who you are, but is not you true self. It is other. This reflection is Therese's life with Richard. The camera then juxtaposes these shots with her in the car with Carol, highlighting how that is her true self. She is meant to be with Carol and it is her path to happiness.\r Lachman and Haynes also use a notable color scheme for the entire film, with many shots being covered with an apparent green filter. These shots are accented by the heavy use of brown, red, and yellow. Interestingly, when Carol first visits with Therese, she is wearing red. However, after her daughter is taken from her and the two women see each other once more, it is Therese wearing red. As red often represents passion, one must assume that this is foreshadowing. Initially, Carol was the one pursuing this relationship. Therese knew she was infatuated with her, but was not confident enough to pursue her. Carol, meanwhile, had experience in the area and did pursue her. However, once her daughter leaves, she is more concerned with being reunited with her daughter, not being with Therese. The opposite is true for Therese, who has blossomed and is filled with passion and wonderous feelings for Carol.\r Finally, the cherry on top of the film is score. Carter Burwell's score hits all the right notes and truly highlights the setting and feelings of the film. This is a very cozy and warm film. The colors certainly highlight this as well, as does the setting"
    },
    {
      "rating": "10",
      "text": "2015 was the year when i watch one of the worst Romance of all time...Fifty Shades of Grey.\rHowever,Director Todd Haynes bring us one of the deepest romance of the decade.\rwhy? Because he made us care about the two protagonist played by Rooney Mara and Cate Blanchett.\rBut the best aspects of this film are the music,the art direction and the cinematography,it really convice you that you are in the 50s and it´s so engaging and memorable. Carol,at the end,it´s the best film of 2015. I hope it could win a lot of academy awards,it deserves them."
    },
    {
      "rating": "8",
      "text": "Let me first start off by saying that this is a beautiful film all around! It's gorgeously shot, has great, expertly-crafted production, costume designs, etc, and of course has wonderful performances from Cate Blanchett and Rooney Mara. However, with that being said, I found myself a bit underwhelmed in terms of the story and its development as the film went on. I felt as though it could've found a slightly better balance between the plot point of Carol fighting for her daughter and the main plot point of the romance between the two leads. It works very well emotionally but lacks any true emotional punch. However, I will say that the best scenes in the film were the ones between Blanchett and Mara, who work wonderfully together and their on-screen relationship felt genuine and beautiful. All credit goes to them for making the slightly uneven story a little more intriguing and emotional to watch. Overall, despite a sometimes unsure and uneven story, the film is beautifully set up and Blanchett and Mara's performances are easy the film's strongest aspects."
    },
    {
      "rating": "7",
      "text": "Carol is a well crafted film. Both Rooney Mara and Cate Blanchett are well cast and both deserved their Oscar nominations. Your eye is just drawn to Blanchett throughout the movie and I think that she is the real star of the film even though Mara may actually get more screen time overall. Todd Haynes direction is great as well and although the time the film is based in is the 1950's it doesn't take over the story. It looks great and you feel like you are in the 50's but you far more drawn to the two actresses. I thought that the music was Oscar worthy also. It is a bit of a boring film though and there are some points where I had a difficult time paying attention. The only other small problem I had with Carol was Kyle Chandler's role was almost supposed to be villainous but he really wasn't that bad of a person. There can still be some enjoyment in this as well."
    },
    {
      "rating": "10",
      "text": "As powerful as David Lean's Brief Encounter, as luscious as Douglas Sirk's films without ever stepping into melodrama territory, Carol might be one of the most romantic films you'll see in your life. A masterclass in acting the 'unsaid' words, with a brilliant and sure direction by Haynes. What a feast!"
    },
    {
      "rating": "8",
      "text": "Carol is a well told lesbian romance. The romance between the two leads works with Mara especially shining.  What’s notable isn’t just what is said but what isn’t said. How while Mara doesn’t say much the camera speaks for her both the diegetic one she holds and the non-diegetic one. It is the construction of the various shots to the tell the story that almost make this something special. Had the film just clarified the various relationships it could’ve been great. Nonetheless, it is still a well made film and the fact that exists shows how far we’ve come. While such a romance may have happened in an earlier time period it is only recently that we are at a point where we can show it."
    },
    {
      "rating": "7",
      "text": "A department store salesgirl in the New York of the early 1950s notices an attractive older woman, a customer, who notices her in return.  Thus is lit a long slow fuse whose detonation is accordingly all the more cathartic.  This is not to say, though, that the love affair does not get started until well into the movie.  It is to Haynes’s credit, and that of his actresses, that the depth of feeling within the pair is throughout the film clearly conveyed, but by actions and words denoting no more than a subtle regard.   In fact, though it requires some patience for much of its length, this may be one of the better screen portrayals of an intense affair that I can remember.  Fans of this film should check out Haynes’s huge critical hit from 2002, \"Far from Heaven.\"  (Personally, I like the current film better, though.)"
    },
    {
      "rating": "7",
      "text": "This a well made, nicely acted movie. Blanchett & Mara are captivating on screen, and the movie is visually appealing. It is wonderfully accurate to the time period."
    },
    {
      "rating": "8",
      "text": "I can't imagine a better way to show how its absolutely normal to be who you are. Adorable story and great acting make this movie a must watch for everyone, so you'll see that there is nothing wrong when someone is homosexual."
    },
    {
      "rating": "7",
      "text": "Carol is a romantic-drama film that's directed by Todd Haynes.The two main stars of the movie are Cate Blanchett as Carol and Rooney Mara as Therese Belivet.\rThis movie is set in 1950s and it follows Carol and Therese who form a bond,after meeting in a department store,and they soon begin to fall in love with each other but that is followed by complicated consequences.\rI really did not think much of this movie,the stars do a pretty fine job especially Cate Blanchett but unfortunately I did not find Rooney Mara's performance to be nowhere near as good as some have suggested.Overall I would say this is an overrated movie that got a lot of buzz,which in my opinion came with the leading stars being female and the subject touching on the lesbian matter (and consequences of the time period that the movie takes place).\rThe story became predictable by the end,the direction was not very good either simply because the way that the director chose to display this movie out has already been done before many times.\rHowever, I did love the score though,as it made some not-so-well made scenes have more weight to them and also gave the dialogue a little much needed punch.Also, the cinematography and the scenery is beautiful throughout as the 1950s come to life on the big screen in an amazing way.\rI was bored in some parts and also had quite a few issues but all in all this is a well made and good looking/well acted movie enough to get a pass as a GOOD movie (but not much else)."
    },
    {
      "rating": "10",
      "text": "A rare gem.  This is one of the most exquisitely written, acted, filmed and directed movies in the history of cinema.  It will outlive the insecurities of critics and pundits alike and be studied for many years to come.\rCourageously produced, it was and is a pleasure to see and behold. Thank you to all involved with this masterpiece of film, I am so pleased to have experienced it.\rCate Blanchett's performance was beyond words.... stunning!  The subtlety of the acting, the ever present nuances are the predominant features that sets this movie apart from any other I have seen, and may ever see again.  The juxtaposition of the ever present menace from society and even family against a sublimely enacted love story creates both tension and passion.  The film ebbs and flows, it is seemingly fluid... engulfing and enveloping one with a myriad of emotions.  This film is quite simply a masterpiece.  Bravo Todd Haynes and encore."
    },
    {
      "rating": "8",
      "text": "A beautiful, well-crafted move. Carefully made.But why make the ending somewhat ambiguous when the book had a happy ending when it was released-a first for lesbians?"
    },
    {
      "rating": "10",
      "text": "It’s not often that a film like Carol comes along. A film so beautifully shot, about such important subject matter, so flawlessly acted; leaving one in a state of shock after the first time they have seen it. Such an important film, Carol is one that will restore your faith in the current state of cinema. In the age of Hollywood blockbusters, simply trying to fill seats with copious amounts of action, it is reassuring that a work of true film art, such as Carol, is still being so exceptionally made.\r To pose the claim that Carol is one-dimensional could not be farther from the truth. Love, self, society, and sacrifice are explored in the film Carol; issues which affect each individual. Passively observing her life unfold, Therese Belivet (Rooney Mara) exists as an unfulfilled being in all aspects of her life. Living in a shabby New York apartment which she cannot even afford to adequately heat, Therese stumbles through her daily existence. Riding on the handlebars of her insipid “boyfriend” to her daily work at a department store where she is reduced to just another holiday hat wearing drone, it is clear to see that Therese is unhappy with the dull ache that has become her life. Finding refuge in her photographs, Therese escapes her unhappiness and finds fulfillment in honing her photography talents. One magical day changes the course of Therese’s mundane existence. A stunningly classic beauty exuding wealth named Carol (Cate Blanchett) happens upon Therese’s display at the department store. There is moving art in their exchange, as one can soon pick up on the discontent Carol projects ever so subtlety.  Carol Aird is a prisoner of her own life; stuck in a loveless marriage, mother to a child she adores, Carol is living proof that even when one enjoys great wealth, as she does, happiness can still only be an illusion. Sharing a mutual distaste for their own lives and harboring feelings they themselves were often too afraid to feel, Carol and Therese set out on to travel; to escape their glum realities, even temporarily. As the two continue their quest, protected by isolation, their inhibitions dissipate, and they begin to explore the loving reality that is their relationship. The internal struggle of being a married lesbian mother in the early 1950’s proves too much for Carol to bear, as she abandons the trip and returns home to fight for custody of her daughter against her imposing husband Harge (Kyle Chandler) Devastated at the seeming end to the purposeful existence she has so longed for, Therese finds it impossible to return to her normal work at the department store. Invigorated by a new sense of purpose, Therese channels her pain in her pictures, taking a job at a newspaper where she can explore photography full-time. Carol also finds it intolerable to return to her prior life; renewed with strength, Carol finally stands up to Harge, vowing to never again go against her grain. Carol is what she is, whether society approves or not, and after she realizes that, there may be hope yet for true love.\r Based on the novel The Price of Salt, by Patricia Highsmith, Carol is beautifully photographed against the seminal images of life in the 1950’s. Edward Lachman’s cinematography work on this film is nothing short of poetic, as the audience is guided deeper and deeper into the crux of forbidden love in the “good ole’ days”. Cate Blanchett turns out a career best performance as the titular character defined by the society she is a part of, yet wants nothing to do with. Rooney Mara’s performance of a young girl learning about even the suppressed facets of her own self was stellar. The direction of Todd Haynes was extraordinary in delivering such a raw, relentless love, told almost exclusively through subtlety. Powerfully shot with a heavy reliance on filming through windows or opposite mirrors, Haynes allows the audience to explore how much of their selves can only be viewed from within, and how much of a distorted display our true self is when exposed to those around us. Accompanied by a powerful score, Carol is a masterpiece to be viewed the world over for its brilliance in capturing feelings so relatable to everyday life within the human condition.\r Brilliantly written, with remarkable production design and costumes, Carol is the most beautiful film I’ve seen in years. A truly intoxicating experience; if given the chance, Carol transforms the viewer to a place where it is not ok to be who you are meant to be, and on some level, everyone can relate to this feeling. A rare form of near perfection is captured on screen through Todd Haynes’ masterwork. Carol is a film that should be enjoyed by masses for years to come."
    },
    {
      "rating": "10",
      "text": "Help! I could not leave the movie! What an impressive, wonderful film! Thanks a lot, all of you...actors, director, screenplay, MUSIC!, producers ......"
    },
    {
      "rating": "9",
      "text": "The most beautiful and visually stunning film you will see all year. Brilliant screenplay and acting performances from the two leads. Everything about this film is beautiful especially the divine Cate Blanchett. Her nuanced performance is absolutely breathtaking while Rooney's portrayal is terrific and heartbreaking. Special mention for Sarah Paulson's scene stealing acting."
    },
    {
      "rating": "10",
      "text": "\"Flung out of space\"\rThis is the most beautiful film of the year. Visually stunning masterpiece, very atmospheric, and this movie is about love, no matter what happens or even exists. We really DID see on-screen Love.\r Fulfilled with deep and emotional performances by Cate Blanchett and Rooney Mara (probably even their best performances to date) and composition softly directed by Todd Haynes, Carol is emotionally overwhelming, really. A beautiful score by Carter Burwell is like the third main character as it complements the whole composition with its beauty and richness. Costumes and cinematography are Oscar-worthy as well, and the ending is very emotional in its own way.\r The movie is not about lesbianism, it's all about love. The real one.\r It's a shame that Carol wasn't nominated for Best Picture, but it's complicated for Academy."
    },
    {
      "rating": "10",
      "text": "This is the movie that changes my life.Seriously. It is beautiful in every different way.I am so touched by people's performances in it. Carol is definitely one of the greatest love stories. It is no gushing melodrama, but powerful in a more definitive way."
    },
    {
      "rating": "8",
      "text": "Real love, out of fairy tales and limits, stereotypes and one-way human understanding. Cate Blanchett - stunning and  elegant like always."
    },
    {
      "rating": "10",
      "text": "Gorgeous jewel box of a movie.  It's very atmospheric--I saw it yesterday in Manhattan, and when I came out of the movie with friends, the modern world was a jolt.  Both leads are fantastic (as was Sarah Paulsen), and the story was quite moving."
    },
    {
      "rating": "10",
      "text": "The performance are just in the right place, the photography is superb, the story\rtold through reflections visually and metaphorical.\rAll silences and gestures make the viewer participate reading between the lines about what is happening internally with the characters. The characters are a rich complexity. What a such piece of art."
    },
    {
      "rating": "8",
      "text": "This was honestly a movie i didn't think would catch my attention at the slightest. However, I found myself emotionally invested in this movie, and its all thanks to the tremendous performances. I bought into the chemistry between Rooney Mara and Cate Blanchett 100%. It never felt forced but rather genuine. Even Sarah Paulson and Kyle Chandler were great and served vital parts in the story. I liked the setting and the fact that it didn't tell a story about homosexuality in a time when it wasn't acceptable, but rather a love story that completely altered the lives of our two leads. This may not be something I found to be groundbreaking, but i'm definitely glad I watched it. Overall, it's a great love story. I give it an A-!"
    },
    {
      "rating": "8",
      "text": "Carol takes a very interesting take on a loved story and creates enough drama to    keep the story entertaining, Add to that the brilliant performances led by Cate Blanchett and Rooney Mara that keep the story engaging . Overall, Carol is a good lesbian loved story."
    },
    {
      "rating": "10",
      "text": "Why do we go to the cinema instead of staying home and playing video games? It's to enjoy a lush visual experience that has been carefully crafted, that's why. Fight-shoot-chase movies bore me to tears, which is one reason I loved the slow, subtle intensity of Carol."
    },
    {
      "rating": "10",
      "text": "Amazing film. Gorgeously shot, the acting is great and authentic (though not too high on Mara's performance, but she and Blanchett have great chemistry), the recreation of the real early '50s, the production design, the costumes, all exquisite. A compelling, inspired, and authentic depiction of Patricia Highsmith's book. I love that they balanced out the two main characters, as the book is told entirely from Therese's (Mara) POV and Carol is only (and narrowly) experienced through her prism. Here we fully experience both characters in their context, their experiences separately and together, and Carol remains the intriguing figure she is but we also get to understand better, her situation, her drive, vulnerability, the choice she has make - the person behind the image Therese is enamored with. I commend Nagy (screenwriter), Haynes, and Blanchett for what they accomplished in conveying the arch of this complex, enigmatic character.\rThe film puts you in a bit of a trance, and you sort of feel like you've been holding your breath until that wonderful ending. It's definitely one to be experienced by everyone, and especially on the big screen. It might be for me the best film really about romance and falling in love, ironically based in such a repressive era."
    },
    {
      "rating": "10",
      "text": "Amazing movie and along with Spotlight my favorite movies of 2015.  Todd Haynes is brilliant at recreting 1950's NY. Cate Blanchett another Oscar nomination. Art direction is gorgeous."
    },
    {
      "rating": "10",
      "text": "What a beautifully directed film. Todd Haynes does not put a foot wrong, and he also elicits fantastic performances from all his actors and enormous sympathy for his characters, male and female. This may be Cate Blanchett’s best performance in film, and Roonie Mara was astonishing – and so different from her performance as Lisbeth Salander in The Girl with the Dragon Tattoo. I have a few more films I’d like to see, but right now it is going to be very difficult to replace this film as my best of the year."
    },
    {
      "rating": "10",
      "text": "After a long period of time we have been able to watch such passionately tender romance.Absolutely stunning performance by Cate and Rooney.Hoping Academy awards for both of them and the picture altogether."
    },
    {
      "rating": "7",
      "text": "Yes, this picture is beautiful. Cate Blanchett does a miraculous job of channeling a suburban woman from 1950 who finds herself in love with another woman. But in its exactness, it's also boring. The characters have no chemistry. The depiction of passion here is reduced to a matter of aesthetics. In fact, the precision and affected tone of the work, overshadows anything real between the characters."
    },
    {
      "rating": "8",
      "text": "In the new film 'Carol', Rooney Mara and Cate Blanchette play two women who fall in love in a time when it was not accepted and actually frowned upon.\r Director Todd Haynes, in his first film since 2007's 'I'm Not There,' has crafted this movie in a style and theme that he's used before. In 'Far From Heaven' Julianne Moore's housewife faces a marital crisis - her husband is caught kissing another man so she takes comfort in the arms of a black man. Whereas in 'Carol' Cate Blanchette's unhappy housewife falls into the arms of another woman. Both of these films take place in the 1950's where it's all dewey and lush and beautiful. And the attention to detail in both films is amazing, capturing the fashion and essence that was the norm of it's time, where everyone made an effort to dress up, especially the women, even just to go shopping.\r Blanchett's character, Carol Aird, is in a loveless marriage but it's not because her husband is cheating on her with another man, it's because Carol is cheating on her husband with another woman. It's not a mid life crisis that Carol is going through, she's been linked to Abby Gerhard (Sarah Paulson) in the past, and Abby has always been in the shadows throughout Carol's marriage to Harge (Kyle Chandler). Harge still loves Carol, he wants to stay married, but Carol insists that the divorce still go ahead, which is very difficult for the both of them because of their young daughter. But one day Carol goes into a department store and is eyed by employee Therese Belivet (Rooney Mara), who suggests to Carol to buy a train set for her daughter. Carol and Therese have chemistry, and the next day Carol invites Therese out for lunch to thank her for helping her out with her purchase. Eventually they start seeing each other more and more, and they fall headstrong into a relationship. Carol, who has the perfect husband and the perfect house, pursues a relationship with Therese, at the risk of losing custody of her daughter. Harge, in utter frustration over Carol's new found relationship, seeks full custody of their daughter using a morality clause as the reason. And Therese risks her impending marriage to her boyfriend Richard (Jake Lacy) to be with Carol, and her and Carol embark on several trips together. It's not until New Year's Eve where they consummate their relationship in a full on one minute lip lock, which leads to a sexual act, again full on, there's almost nothing left to the imagination. But will Carol's impending divorce and the threat of losing her daughter and Therese's burgeoning career as a photographer get in the way of their relationship?\r Blanchett is magnificent as Carol, who risks losing her daughter yet has strong feelings for a much younger woman. Mara is even more superb as Therese, her innocence and naivete in full display. Both actresses are excellent, yet it's Mara who ups Blanchette in the acting arena. The movie basically revolves around Therese and her coming of age not just with her career but with her sexuality as well. It would be a shame if Mara is reduced to supporting actress level as Blanchett does get top billing, they both deserve Best Actress Academy Award nominations but it's Mara who should be on the podium. Chandler is also excellent as Carols' husband - he's got an ideal 1950's look about him. 'Carol,' Based on the novel 'The Price of Salt' by Patricia Highsmith, was written at a time when it's subject was considered scandalous, which Haynes truly captures. 'Carol' was filmed with Super 16mm to produce the muted hues of glamour magazines of the era, it's romantic and dramatic and lovely to watch."
    },
    {
      "rating": "10",
      "text": "The story of \"Carol\" was told deliberately.  I enjoyed the pace.  Cate Blanchett once again showed why she is the greatest actress of her generation.  This isn't her best performance, but it is still worthy of an Oscar nomination.  Rooney Mara's character was a little confusing.  I never understood WHY she was attracted to Blanchett's character.  Her performance is decent, but nothing special.  In all, \"Carol\" is a nice, mature telling of an interesting story.  What makes \"Carol\" special is the production and the sets. The 50s set pieces were spectacular.  You really got the feeling that you were watching life during that era."
    },
    {
      "rating": "10",
      "text": "Todd Haynes pulls it off again with a small budget film.  All the CGI in the world can not capture the essence of the early 50's, as Todd has done.   Since, the cinematography tells half the story, I couldn't imagine what it would have been with another person directing.   My only complaint  with him is that he doesn't do enough movies.  We are missing out on a great creative minds of our time.\r The era of the movie  was an  example of how less had to be more.  Some might not understand how people were in the 50's.  It was a simpler time.  People were not loud and abrasive.  They didn't talk about their feelings.  Being homosexual was not only frown upon, but against the law.  So, it was important for the story to be told without a lot of dialogue.   Since, there was no narrator spoon feeding us the story, we were able to feel what they were feeling through the superb acting of both Cate and Rooney."
    },
    {
      "rating": "7",
      "text": "It's a beautifully shot film, and Cate Blanchette is amazing, as usual.  But Mara is inert - she brings very little to the table, and the story itself is not extraordinarily compelling.  A good solid little film, but nothing revolutionary, and nothing to justify such  extraordinary critical acclaim.  The road trip in the middle of the film saps much of the energy from the proceedings, in my mind.  If you'd like a peek into the late 50's mood, this film does it, but it could have been much more."
    },
    {
      "rating": "10",
      "text": "This could just as easily be titled ‘Close to Heaven’ as this is an absolutely brilliant adaptation of Patricia Highsmith’s book ‘The Price of Salt’.\rAn incandescently beautiful Cate Blanchett is hypnotically stunning in the title role. Unhappily married to Harge (Kyle Chandler) she suddenly finds herself attracted to (and then involved with) a much younger shop girl, Therese, exquisitely played by Rooney Mara. Both actresses hold centre stage for two hours and mesmerise throughout. Mara has never been better and understates to perfection, whilst Blanchett once again surpasses her own indelible standards with her aura, elegance and class. She is without equal at the moment, undoubtedly the best actress currently working in films. If she doesn’t nab a third Academy Award for this dream of a performance then the Oscars should finally call it a day.\rCredit for this gem must also be given to Todd Haynes whose direction is a master class in precision and restraint. He has an uncanny knack for knowing how to get the most from every moment in every scene, and he has an amazing eye for detail. He is complimented in this by the superb screenplay by Phyllis Nagy. Her outstanding writing is full of subtlety and context. To this the actors bring the added nuances that enables them to completely realise these thrillingly flesh and blood characters. Between them they pull off an ending that is cinema heaven, as unexpected as it is wanted. An ending that hits all the right notes to perfection.\rPast collaborators also bring their skills. Ed Lachman’s cinematography has a deliberately more subdued and grainy look than his lush work on ‘Far From Heaven’, and the colour palette is also far less vibrant. However, it is all in keeping with the period and the unfolding drama. Sandy Powell’s costumes are again gorgeous and her dressing of Mara contributes to the feeling that one is watching a young Audrey Hepburn. Carter Burwell riffs Elmer Bernstein’s astonishingly beautiful score from the earlier film, but his music is lovely in its own right. All other production values are of the highest order, as are the supporting performances of Kyle Chandler and Sarah Paulson.\rA fitting and complimentary companion piece to ‘Far From Heaven’, and like that one this is a sublime film. One to see again and again."
    },
    {
      "rating": "10",
      "text": "Carol is one of the best films of the year, is also the most romantic and beautiful movie of recent years. The costumes, photography, soundtrack, it draws attention. Todd Haynes made a beautiful film that not only the critics loved who was touched loved the movie too, deserves the highest rating. It's a love story of the 50s, so the romance between Therese and Carol is subtended, until such time that they connect, it makes the most beautiful film."
    },
    {
      "rating": "1",
      "text": "Technically well crafted, but completely misses the mark. The cast is given very little to do but to stare at each other. We have no clue what motivates the characters, and have to wonder why are they attracted to each other in the first place. We see no real development of a relationship between the two women. And to cap things off, when Ms. Blanchett get some to show us her acting chops, the director cuts away to another character staring.........big letdown!!  Don't be fooled the by the hype."
    },
    {
      "rating": "5",
      "text": "I don't get critics' universal adulation for this film. Sure, it's a very pretty movie - the cinematography, makeup, etc. - but it is dreadfully boring. The film lives and dies by whether or not you find two hours of furtive glances between illicit lovers stimulating or not - I did not. I felt like I was watching two mannequins play at being in love. Thank goodness for Sarah Paulson's and Kyle Chandler's scenes, whose performances were based on what actual human beings act and sound like, otherwise I might have fallen asleep."
    },
    {
      "rating": "6",
      "text": "I am prepared for the amount of dislikes this review is going to get, and I do agree this is a very well made movie with outstanding performances, but I really didn't get the ending. Don't take my opinion into consideration %100 if you do plan on watching it, because regardless of my take on it this is definitely a movie worth watching and forming your own opinion about. So here we go. The movie tells a love story focusing on the young and romantically inexperienced Rooney Mara and the older and very romantically experienced Kate Blanchett who is divorced from a jealous man and has a daughter whom she loves very much. They go back and forth visiting each other randomly, getting each other gifts, you know, like lovers do. Then they randomly go on a road trip together, which is also fine, I'm still enjoying the movie. Then they sleep together which seems to be the climax of the movie. Then Carol (Blanchett) finds out her husband has been spying on her and will not let Carol see her daughter anymore because of her less-than-wholesome lifestyle. A few nights later Carol sneaks out of the room she is staying in with her lover and leaves. Rooney (I don't remember her name but it's not important for the sake of my rant) wakes up to find Carol is gone and has somehow magically arranged for a friend to pick up Rooney who is hundreds of miles away from home and drive her back to New York. Carol leaves her a letter that basically says \"I really like you but I have this whole crazy thing with my daughter going on right now so don't call me.\" Rooney is heartbroken, she tries to call Carol over the next few months but Carol ignores her. Then Carol straightens out the issues with her daughter and out of the blue contacts Rooney and invites her to dinner. She says she's sorry for everything and wants everything to go back to normal. Rooney's like \"Idk you were kind of really mean to me,\" and Carol responds, \"Well I'm gonna eat dinner with some friends so stop by if you're still in love with me.\" Rooney leaves Carol and goes to a party and can't stop thinking about her so she ends up going to Carol's dinner and the movie ends with them staring at each other with fresh love in their eyes. WHAT THE HELL TODD HAYNES?! Carol treats Rooney like a tissue (or whatever the female equivalent of a tissue would be) then all is forgiven? It's that easy? What's to stop Carol from changing her mind again and leaving Rooney all alone forever? How are critics okay with that super simplistic Disney ending? Actually it's not fair to compare it to Disney because when someone like Aladdin F#$%'s up he has to prove to Jasmine how great he is before the movie's over. I understand there's a lot to like about this movie, and maybe I am missing a few things but based on what I've seen I cannot give it more than a 3 out of 5 for the awful taste in my mouth Carol has left."
    },
    {
      "rating": "5",
      "text": "A \"love story\"? Really?\r I saw an unequal relationship of convenience; the older woman in transition and looking/susceptible to a diversion and the younger ingenue exploring an expanding world. There was a considerable power imbalance right to the end and I didn't see any blossoming or character growth/development associated with the \"power of love\" in either. I couldn't see a successful future going forward nor a terrible shame if it didn't work out. Actually, I'm assuming that it didn't work out, that each got bored or restricted by the obvious mis-match, turning the story into a pretty pedestrian life event.\r Great acting, great filming. Minor characters were merely one-dimensional devices.\r Disappointed that it wasn't a bit more socially poignant, as I felt that the societal context was underdone.\r I'm guessing that the story is getting more credit than it deserves (for PC reasons) due to it's \"controversial\" subject.\r While the acting and filming are certainly first rate, the story isn't."
    },
    {
      "rating": "4",
      "text": "I was so looking forward to seeing this film.  I thought it would be a remarkable and tender love story.  It was neither.  Carol's character seemed to be far more emotionally involved and available to Abby, not Terese.  I kept waiting for the two main characters to have something in common, something meaningful, some form of true intimacy.  It never happened.  \"Carol\" was a disappointment and not a movie I would recommend.  The book was far more believable."
    },
    {
      "rating": "0",
      "text": "Ah encore un film sur l'amitié féminine et beaucul, beaucoup plus pardon,  si affinités... malheureusement, c'est pas drôle du tout (à l'inverse de Gazon maudit !) et en ce qui concerne la question de se rincer l'oeil, on reste sur sa faim ! (à l'inverse de La vie d'Adèle... dont c'était le seul intérêt, certes...).\"Carol\" perd donc sur les deux tableaux mais fait carton plein sur l'ennui... et quel ennui ! quelle platitude, que c'est amorphe et chiant... ma télécommande en trépignait d'impatience : \"accélère, accélèèère cette meeerde...\" me sussurait-elle... et cela malgré Rooney Mara, la belle se dévoilant tout de même un tantinet (ou une tantinette plutôt... pour l'inclusivité) un minimum syndical qui ne suffit pas, hélas...Blanchett est assez consternante en tout cas, presque aussi consternante que ce film consternant à la mise en scène consternante : je suis consterné et aux trois quarts endormi... y compris et même en avance rapide."
    },
    {
      "rating": "5",
      "text": "I really can't understand the hyperbolic praise for this film. It's really beautifully made and on the whole is well performed, but there is a fundamental flaw…there is no chemistry between the two leads. I didn't buy into the relationship at all, it felt unrealistic and the film failed to fully show any real spark of romance.\r I applaud the idea to feature a lesbian romantic story and the most interest for me lay in the forbidden nature of that kind of relationship in that period. Its period detail did seem to drip off the screen and it has some really well crafted scenes, I especially liked the last scene.\r But, for me, because the relationship lacked chemistry I found myself left cold, even bored at times hence why I started noticing the period detail rather than being lost in the romantic story. I wasn't the only one to think this, my girlfriend felt the same as did some others who were in the cinema I overheard as we left. I think Rooney Mara wasn't the best cast here and I think if I had to blame anyone I'd blame her, she just failed to sparkle."
    }
  ],
  "recommendations": [
    "american_beauty",
    "spencer",
    "belfast",
    "call_me_by_your_name",
    "the_light_between_oceans",
    "the_bridges_of_madison_county",
    "the_danish_girl",
    "phantom_thread",
    "lion",
    "legends_of_the_fall",
    "anna_karenina",
    "blue_valentine",
    "finding_neverland",
    "marriage_story",
    "the_father",
    "jackie",
    "20th_century_women",
    "minari",
    "joy",
    "melancholia",
    "the_electrical_life_of_louis_wain",
    "youth",
    "the_glass_castle",
    "the_longest_ride",
    "gifted"
  ]
}