{
  "id": 3627,
  "title": "Carrie",
  "starring": [
    "Angela Bettis",
    "Patricia Clarkson"
  ],
  "runtime": 132,
  "genre": [
    "Drama",
    "Horror",
    "TV Movie"
  ],
  "description": "Carrie White is a lonely and painfully shy teenage girl with telekinetic powers who is slowly pushed to the edge of insanity by frequent bullying from both classmates at her school, and her own religious, but abusive, mother.",
  "releaseYear": "2002",
  "mpaaRating": null,
  "imageUrl": "https://image.tmdb.org/t/p/w500/knjeEeeyIwDkUtZwDfJOcUIuNdB.jpg",
  "categories": {
    "plot": 5.575757575757576,
    "acting": 5.944444444444445,
    "ending": 7.7272727272727275,
    "soundtrack": 5.0,
    "cinematography": 8.0,
    "familyFriendly": 6.333333333333333,
    "funny": 4.125,
    "action": 6.222222222222222
  },
  "reviews": [
    {
      "rating": "7",
      "text": "Based on Stephen King's novel, \"Carrie\" and the same name as the original in 1976, the new version of \"Carrie\" is about a poor innocent girl who has telekinesis and she went to a prom until those mean bullies are making a prank to her and she controls her power to destruct the entire high school into a disaster. Chloe Grace-Moretz is playing a main character as Carrie White and she did a pretty good job for portraying an emotional teenage girl, and she also gets the top that is near to the original Carrie. Julianne Moore plays Carrie's mother and she also did great for becoming an insane widow who wants to get rid of Carrie White's life, not as bad as the original, but the original mother stays the top. The story stays very close to the book and it goes different ways like the original movie, but I've seen Carrie White becomes an interesting character that we seen her back problems. She controls her telekinesis powers, she gets comfortable to her new friend, and she becomes insane for destroying everything in the prom for her bullies and to entire school that makes her prank. Even though the new version of Carrie is pretty decent and not as close to the original, but it's a good horror movie to enjoy with teenagers and to other Stephen King fans as well. Carrie is a good old fashion flick with great scares and some chilling moments that I've seen in Halloween, but a good one."
    },
    {
      "rating": "9",
      "text": "I like both the original and this newest version. The acting is actually pretty good and updated. The effects notwithstanding the story remains the best part of course. I would be curious as to what Mr. King feels but I can tell you that I enjoyed the entire film. Chloe Moretz does a very good job as does Julianne Moore in bringing us the emotion of the characters."
    },
    {
      "rating": "5",
      "text": "An average movie for a great novel. Carrie is entertaining in its first half hour, but once the action starts, it becomes laughable. The cast disappoints, not even Julianne Moore could bring a nice performance."
    },
    {
      "rating": "5",
      "text": "This movie was ok until the prom scene. The part where everyone was supposed to laugh at Carrie and her mother saying in her head over and over, 'they're all gonna laugh at you' was completely left out. This was a HUGE mistake. Whomever is responsible for this stupidass mistake should be ostracized from the film industry."
    },
    {
      "rating": "10",
      "text": "Perfect. For the sake of a review for a 'remake' I believe you should forget that it is one, and focus on how good this film is on it's own two feet. Carrie is an unbelievably good film; tense, gripping with brilliant acting and great rampant destruction... What more could you want?"
    },
    {
      "rating": "7",
      "text": "Loved the original and when I heard that this movie was being done, I had mixed emotions rushing all over me. After watching the movie, I knew that I have just watched a decent movie but if you think about it more, you will think that it was a bit pointless on making the movie. I considered the movie to be a remake and a bit of a re-imagined version. Remakes are made to fix problems that it's original had and to add something new that wasn't part of the original or it's source material. The only thing new added to this movie that wasn't part of the movie was the involvement of recording a bullying that was happening at the moment, with the use of cellular phones and making it viral. The other one was the rampage scene but if you have read the source material or the book, then you probably know that this was going to happen. The movie didn't fix anything that the original had and nothing memorable or new, was added that wasn't part of the original or the source material. So if nothing new happened in this film then what was the point of making this flick. Remakes should be new and fresh and should not entirely be the same as the original and source material. The movie was not terrible because it had excellent acting from Chloe Moretz and Julianne Moore. The CGI was decent but at least it wasn't horrible. Overall, this Carrie didn't beat the original but it was a decent movie, I still had a lot of fun watching the movie but it still gives me the feeling that sometimes the movie feels pointless. Carrie gets a 7/10."
    },
    {
      "rating": "0",
      "text": "People who enjoyed this piece of c3ap are just out of their minds. Such a clichee and blank story, horrible acting and absolutely zero scary scenes make this one of the worst movies i've ever seen. What a waste of time."
    },
    {
      "rating": "5",
      "text": "\"Carrie\" was a good movie, but with irregularities, the performances were good, the story was regular, and the special effects were regular as well, but that does not concern the adaptations, worry about the re-adaptations since the first of all Was in 1976, and generated many scares this re-adaptation did not generate them, but we enjoyed Chloe Grace Moretz and her very good role."
    },
    {
      "rating": "5",
      "text": "I have to say that I really like the original movie and I think it needn't have been made again. I can't say that I actually dislike the reboot. It had it's moments and I did like the fact that it came off more as a human tragedy story than a horror flick. I must also say that it was a lot easier on the eye to watch pretty Chloe Grace Moretz than it was to watch Sissy Spacek, but the movie just somehow fell flat for me."
    },
    {
      "rating": "4",
      "text": "We are facing a remake of a horror classic, 1976. I have not read the Stephen King's book in which both films were based, but I saw both movies and I recognize that this film is no more than an \"update\" of the story. One has copied the other, simple. The bad part is that this movie does not add anything new. The good part is renewing interest in the story itself, attracting a new generation which otherwise would hardly have access to the 1976 original film (nowadays, ancient movies are a rarity in theater or on television).Since the film copies most of its predecessor, the script is not new. The provision of the actors is reasonable. The main role was in charge of the young Chloë Grace Moretz, an actress who fulfilled his character without surprise or do something remarkable. Julianne Moore got the role of Carrie's mother, a woman blinded by religious fanaticism and fear of sin. The experienced actress did a great job and made this film a much more enjoyable experience. The prom scene is the climax, but leaves a lot of questions. In her anger, Carrie shows a great control of her skills but, at the same time, she appears to lose control of them, and the situation itself. This contradiction makes no sense. Visual, special and sound effects are several, but not very impressive. Which leaves us impressed is the situation itself.In short, this movie is a nice revisiting of an old success. It doesn't bring anything new, but it's still nice to see."
    },
    {
      "rating": "6",
      "text": "Not a bad movie  but nothing amazing. This is the same Carrie you've seen or read before, but made with more modern effects and with a bit of a twist to make room for Carrie 2. I see a lot of low scores, and I see a lot of high scores by people with 1 review under their belt. This movie is average, an acceptable depiction of a story you already know, or a good way for youngsters to see the Carrie story  because no one wants to watch a movie from the 70's anymore."
    },
    {
      "rating": "9",
      "text": "I LOVED IT! As a huge fan of the book I was very satisfied with how it was brought to life. It's a little derivative of DePalma's film but has a few touches of its own, enough that I found it enough to stand on its own. Although Pierce largely misses the chance to show the destruction Carrie brings to the whole town in the book (budget concerns perhaps?) and the ending doesn't match DePalma's, special effects elevate the prom and Chris and Billy's comeuppance (which is truly inspired and my favorite scene) past DePalma's, plus she found a good way to incorporate the book's meteor shower. Pierce also reinvents the film as drama that effectively builds tension more effectively than a simple horror film from the get go, plus Carrie's development of her power (which is well known to be a metaphor for burgeoning womanhood) progresses much more organically. Chloë Grace Moretz crushes it; it's been a common criticism that she's too pretty to be Carrie but upon seeing it, I'm letting it slide, because she not only pulls it off by bringing a heartbreaking frailty, it kind of makes things even more shocking, because you wonder just how messed up her life had to be to make her the kind of person she is at the start of the film. Not that anyone should hope for tragedy, but I found myself really praying that things would work out better despite the fact that we all know what's going to happen. Gabriella Wilde was also very good as Sue Snell, she make the sense of regret that leads to her ill-fated benevolence believable (it aways seemed far-fetched to me). The always reliable Judy Greer is in fine form as Miss Dejarden, and Julianne Moore chews the scenery as the part of Carrie's mom calls for (recreated by Pierce as a paranoid schizophrenic). The novel Carrie is one of my favorite books, so I wouldn't give it my seal of approval if I wasn't genuinely impressed. Tip of the hat to all involved."
    },
    {
      "rating": "7",
      "text": "Filmgoers who are not interested in seeing a modern remake of Carrie are equally unlikely to be won-over by Peirce’s effort  since it tells (mostly) the same story without dramatically improving anything but the onscreen visuals. Nevertheless, for viewers who are open to the remake, the assembled cast and crew manage to accomplish their goal of updating the still timely Carrie storyline with a more intense (and gory) retelling of events for the contemporary movie market. While it might not have been necessary, the Carrie remake is still an adept, entertaining, and at times downright haunting, piece of filmmaking."
    },
    {
      "rating": "5",
      "text": "It's a movie of two parts  the first, which includes everything up to the prom \"bucket\" sequence, is really pretty good.  The only weak element for me was Julianne Moore's character.  I generally love Moore, but this role is one dimensional and weak.  But again, the first part is similar to so many other movies of this type  Some Kind of Wonderful, etc. But the revenge sequence at the prom and following was just entirely crappy, boring, and stupid. Sure, she had to get some kind of revenge, but it could have been SO much more creative."
    },
    {
      "rating": "6",
      "text": "This movie has definitely gotten some mixed reactions from everyone whose seen it so far. While I did not see the original \"Carrie\" movie, this version still felt pretty predictable. But honestly, I enjoyed this movie. There are definitely good parts and there are definitely some bad parts. Chloe Moretz and Julianne Moore definitely make this movie work for sure, and there are some really gruesome and gory shots that I thought looked really cool. Yet at the same time, it felt like some of it really just grossed me out rather than really try to give me that true horror appeal. Plus, there are some very cheesy moments in this movie. Other than that, it's a pretty good movie overall. Some might like it, some might not, but don't take my word for it, see it yourself."
    },
    {
      "rating": "10",
      "text": "I already knew that critics would be bashing this since it's a remake but this movie was great! Your feel the emotion and pain of Carrie throughout the movie and then she snaps and when she does it is intense I loved it! The only thing negative was that by the end I loved the intensity so much that I was craving for more! All in all a 10 out of 10!"
    },
    {
      "rating": "6",
      "text": "Obviously Hollywood has never been amazing at portraying high schools, but this one however is the most realistic I have seen (still not realistic, just the least fake) the fake parts, like students snickering when someone mentions her name, or she walks by them... like come on. Another thing they should have done was to see Carrie from their POV, show us why they all think she's a freak... at most high schools, shy, quiet girls don't usually get made fun of this much... unless of course the real bullying started after the shower scene... But the performances were awesome, Julianne Moore can play so many different things and she was definitely pretty freaky in this. The movie is not that scary in anyway at all, but it is a fun ride while in it, and it gets the audience into it. I honestly feel like this has potential to be a halloween time classic. But I hated the pig scene. Screw that."
    },
    {
      "rating": "7",
      "text": "I think Carrie is one of my favorite underrated remakes of 2013 because I felt that the original version is way better than the new version of Carrie. Although I was a little worried that Sony and MGM were hoping to shed some light of Carrie after a unsuccessful yet unsatisfied 1999 sequel and a disappointing TV movie in 2003. The remake is good, but I don't know if director Kimberly Pierce (best known for the cult classic \"Boys Don't Cry\") haven't even saw or what the original Carrie is about. Carrie White (originally played by Sissy Spacek, now Chloe Grace Moretz) is a teenager who is scared and frightened (and sorta freaky), she lives with her abusive mother, everyone's laughing at her at school, learning psychic powers, she and Tommy were named prom queen and king until one bucket of blood changes everything (one of the scariest scenes I've ever saw). Since that bucket killed Tommy, you know what happens next and trust me, it's full of gore. Carrie turns from prom queen to a psychotic mentally-stabled zombie (sorta). I won't tell any spoilers, but the remake is incredible. Although it may not be as good as the original, but I gotta give credit to Chloe Grace Moretz (one of the best underrated child stars since Dakota Fanning), she did a great job portraying a sick and demented teenager who has a hard time dealing with all the emotions she has gone through at school and her devilish mom as we speak. I know the reviews were mixed, so hopefully we could see a future cult classic on this remake. But I still wanna check it out before Halloween. Not great, but still a good remake."
    },
    {
      "rating": "4",
      "text": "The new CARRIE is in essence a shot by shot remake utilizing much of the exact same dialogue and plot points. They needed a new screenwriter for this? Director Kimberly Peirce, BOYS DON'T CRY, adds some grit, makes it all more realistic but in the process loses depth and emotion. And then someone tampered with the ending, tagging on a quick silly series of denouements with no rhyme or reason other than a 2nd rate sequel. This all sounds really bad but actually, the story still has major bite and the two leads are wonderful but nowhere near Sissy Spacek or Piper Laurie from the original. There's really no reason for this remake."
    },
    {
      "rating": "8",
      "text": "Carrie is a magical horror movie, not only it contains most of the\rscary things a good horror movie needs but it also spices it up with\rsome moral. In fact, it shows what does bullying lead to. There isn't a\rlot of nudity which is rare these days so I recommend you to watch this\rbeast. The whole movie is not that scary but it contains a lot of\rdisturbing bloody scenes and cruel killing ways, that won't make you\runcomfortable if you're a true horror/thriller fan. The script is\rwritten well enough. The directors did a good job. It could be so easy\rto make a  Carrie two  because of the magical ending of the movie. I\rgave the film 8/10 because it wasn't too scary and I never give more\rthan 9/10 so 8/10 in considered very good! Now go and watch it."
    },
    {
      "rating": "10",
      "text": "The remake makes justice to the original film and to the novel. Well done!. The cast is perfect. We have the talented Chloe Moretz and the professionally Julianne Moore"
    },
    {
      "rating": "7",
      "text": "Better than the monotonous dragged out original. This remake actually moves swiftly and has a bigger more exciting climax. All the filler story in between was funny and suspenseful at times."
    },
    {
      "rating": "8",
      "text": "This remake or reboot or re-imagining or re-adaptation or whatever the hell you want to call it is one of the better remakes I've seen. Strong performances, a satisfying prom scene and a story that benefits from being set in modern day all lead to a fun and well made remake."
    },
    {
      "rating": "0",
      "text": "We should pray God for this stupid mania of some directors without new ideas to stop making mind-boggling bad bad baaaaad remakes!! BULLSHI* ! What is this? Full joke! I fell somehow insulted by such terrible movies.. Haven't seen the original 1976 film, but I'm sure that even in the early years of cinema, it is much better. Both movies are based on Stephen King's novel. I will allow myself to say, that Stephen King's idea is rather poor, chaotic and unfinished. I guess a lot of adjustments, changes and additions are needed to make a good film out of this story. But this is his first novel, so he is justified.The new 2017 'It' was also **** but this.. This goes through all the limits of dullness. Bad acting, actually terrible, bad storyline, bad effects. Can't see something good in this movie. Doesn't deserves even 1/10."
    },
    {
      "rating": "10",
      "text": "this movie is amazing one of the best remakes q is an fact as it has a great performance moretz julian moore and a great special effects, great direction and modern twist King's novel needed"
    },
    {
      "rating": "10",
      "text": "Moore is terrifying as a guilt-addled true believer, and Moretz caresses her role when she gets the chance. And the hot topics do indeed remain hot..."
    },
    {
      "rating": "6",
      "text": "The characters were to pretty difficult to relate to and the story was far less entertaining then what I was expecting it to be. I came into the theater with a lot of hype and was extremely disappointed, this movie had so much more potential but in the end it was kind of a let down, still a decent movie to watch if you are bored  interested in telekinesis though."
    },
    {
      "rating": "2",
      "text": "in my opinion what i seen in Carrie 2013 ,it as too much action and special effects but why a remake of Carrie Sissy Spacek and Piper were nominated for the oscar for Carrie 1976 The Exorcist (1973) ,The Texas Chain Saw Massacre (1974) Jaws (1975) ,The Omen (1976) ,Carrie (1976) ,Halloween (1978) ,Alien (1979) the best horror movies of the 70's"
    },
    {
      "rating": "2",
      "text": "In Julie Taymor's Across the Universe(the 2008 musical that recounts the late-sixties by making narrative use of the Beatles' songbook), a high school girl expresses an unrequited love for, presumably, the golden boy, the star quarterback, in a languorous version of \"I Want to Hold Your Hand\", as she walks away from her thronged colleagues, the football players and cheerleaders. Because the audience is well-versed in the symbiotic relationship between these teenage kings and queens, it comes as a shock when Taymor cuts to the comely blonde decked out with school spirit, a P.O.V shot from the Asian brunette's perspective, sitting in the grandstands, making her erotic longings known through Paul McCartney's rock and roll poetry. When football practice starts, the lovesick cheerleader proceeds to walk through the busy field, untouched by a collision of male bodies who display complete indifference to the female presence, a set-piece in which the sports arena is juxtaposed against musical art that recalls the \"Is There Anybody Here for Love\" sequence in Gentlemen Prefer Blondes, when a similarly ignored(but straight) Jane Russell maneuvers her way through all those kinetic and self-involved Olympians going about their training. The intertextuality between these filmic texts posits that the closeted teen would have longed for Marilyn(not a swimmer or a gymnast); she prefers blondes, too. A lesbian cheerleader, of course, upsets the whole prep sports ecosystem. Sue Snell knows this. The filmmaker, a woman, who helmed Boys Don't Cry, remakes Sue, or rather, appraises the Amy Irving character's true nature, since she would understand the interior lives of girls better than the source material's male creators. Sadly, the filmmaker, barely strays from the narrative template laid down by Brian DePalma in the 1976 original(adapted from the Stephen King novel). Still, arguably, the filmmaker manages to resolve a plot point involving Sue and her boyfriend Tommy Ross that, to this day, leaves, for some, an aftertaste of contrivance; the plot point in which the \"nice\" girl, as atonement for helping corner Carrie against the shower wall with pelted tampons, asks her prom date to accompany the school misfit instead. Miss Collins is suspicious, and so are we, because no high school girl alive could possibly be that altruistic. Rightly so, the gym teacher tells Tommy, \"Don't you think you're just gonna look a little ridiculous when you walk into the prom with Carrie White?\" Now with the remake, Sue's charitable gesture makes sense. Not willing to put her image at risk, she sends Tommy as her surrogate. On a subtextual level, the filmmaker outs Sue, even though, in all likelihood, it never crossed King's mind that he was creating an ambiguous girl. The writer, however, has no control over how a story will be interpreted by the reader after its deliverance. As a commodity, a novel to be sold on the marketplace, the artist knows that it now belongs to the people, with a life of its own. Naturally, an aggressively straight male like DePalma would have a different take on the King novel than a lesbian, who, perhaps, knowing what it was like to be different at such an unformed age, wouldn't want Carrie to self-immolate in a fire, alone and unloved. But this production isn't an indie like her auspicious debut. Expected to meet the commercial expectations of profitability demanded by a major studio, she keeps the film in the closet, too, and goes through the motions of shooting a routine horror flick. You have to look closer for the movie that could have been. Right away, the filmmaker establishes a connection between the clandestine possibles, during P.E. class, when Carrie errantly serves the volleyball straight into Sue's back, whereas in the original, Carrie is isolated in the back row, unable to dig the incoming kill. Instead of raising her voice in anger, Sue just looks back at Carrie, a look that transcends physical pain. This time around, in the ensuing lock room melee, Sue is more of an onlooker than an instigator, considerably less pro-active; she doesn't tear off the tampon dispensary cover like her 70s-era counterpart. Later, in the backseat of Tommy's car, Sue looks distracted during intercourse, as if she's undergoing an epiphany about her sexual orientation, akin to Lana(in Boys Don't Cry), who knows Brandon is a girl when they have sex near her spinach-canning factory jobsite, because in a P.O.V. shot, she sees \"his\" clevage. Just before Chris dumps pig's blood on the prom queen, she texts Sue, and refers to Carrie as \"your girl\". Conspicuously, Sue doesn't clamor her way back into the flaming gymnasium to check on Tommy. In retrospect, we now realize that she doesn't love him enough to risk her life. This misplaced love, after 37 years, finds purchase in a burning house, where Sue, quite pointedly, bravely treads with the goal of saving her secret love."
    },
    {
      "rating": "5",
      "text": "I have been looking forward to seeing this remake of Carrie for months now. Went to the 1st showing with my daughter as we are both horror buffs. My daughter is 15 years old and have been watching horror movies for 8 years. My daughter has not seen the 1st Carrie movie and she thought is was pretty good, like maybe a 7 out of 10 score. I saw the 1st Carrie when it came out long ago. I am giving the 1st Carrie an 8 out of 10 and the new Carrie a 5 out of 10 and here is why. It was as close to a remake as possible but lacks the suspense and horror compared to the 1st Carrie. What you see on the trailer is what you see in the movie which left no thrill. Watch the trailer and that is the movie all summed up in 2.5 minutes. Altho the acting is good, there was nothing new to bring to the table. The prom dance in the school was shorter than the first Carrie movie and not as good or exciting. Altho not near as exciting as the 1st Carrie movie, I did enjoy it but could have been just as satisfied watching it on TV. I was a little bit disappointed as I feel they could have made this movie much more exciting. The best part of the movie was spending time with my daughter. By the looks of what is coming to theatres for this spooky time of the season, its not looking good for us horror buffs. Its a sad sad year for good movies. I can say there were only about 5 good flicks for the year 1013 to date. Bring back the SAW movies. Pitch the Paranormal Activity movies as they are as fake as a 3.00 bill. Gravity sucked and I,m still scratching my head why that movie got good reviews. People who gave that movie a good review must ha been under a strong over dose of drugs or tripping. Captain Phillips was an awesome movie, 10 times better than Gravity. Who can rate a movie with a high score just to hear Sandra Bullock screaming 3/4 of the movie. And I love Sandra Bullock and George Clooney but not in the movie Gravity. Somebody must have needed some pocket change.I have been looking forward to seeing this remake of Carrie for months now. Went to the 1st showing with my daughter as we are both horror buffs. My daughter is 15 years old and have been watching horror movies for 8 years. My daughter has not seen the 1st Carrie movie and she thought is was pretty good, like maybe a 7 out of 10 score. I saw the 1st Carrie when it came out long ago. I am giving the 1st Carrie an 8 out of 10 and the new Carrie a 5 out of 10 and here is why. It was as close to a remake as possible but lacks the suspense and horror compared to the 1st Carrie. What you see on the trailer is what you see in the movie which left no thrill. Watch the trailer and that is the movie all summed up in 2.5 minutes. Altho the acting is good, there was nothing new to bring to the table. The prom dance in the school was shorter than the first Carrie movie and not as good or exciting. Altho not near as exciting as the 1st Carrie movie, I did enjoy it but could have been just as satisfied watching it on TV. I was a little bit disappointed as I feel they could have made this movie much more exciting. The best part of the movie was spending time with my daughter. By the looks of what is coming to theatres for this spooky time of the season, its not looking good for us horror buffs. Its a sad sad year for good movies. I can say there were only about 5 good flicks for the year 1013 to date. Bring back the SAW movies. Pitch the Paranormal Activity movies as they are as fake as a 3.00 bill. Gravity sucked and I,m still scratching my head why that movie got good reviews. People who gave that movie must ha been under a strong over dose of drugs or tripping. Captain Phillips was an awesome movie, 10 times better than Gravity. Who can rate a movie with a high score just to hear Sandra Bullock screaming 3/4 of the movie. And I love Sandra Bullock and George Clooney but not in the movie Gravity. Somebody must have needed some pocket change."
    },
    {
      "rating": "5",
      "text": "Chloe Moretz is the new age-appropriate teenager with telekinetic powers and Julianne Moore plays her deeply disturbed, uber-religious mother. The plot pretty much follows the original DePalma classic with the addition of cell phones and the internet. What it lacks is any soul. Everything leading up to the big prom scene is uninteresting and even her blood-soaked reprisal lacks originality or flash (despite the fire). The performances are all uninspired…as a matter of fact, the whole bloody movie is anemic and downright dull."
    },
    {
      "rating": "0",
      "text": "Any movie starring Julianne Moore is a disaster waiting to happen. This one is particularly bad. Horrid acting, a lead character that is just too weird to feel any sympathy for, the question is: why the remake, if the original is just so much better ?"
    },
    {
      "rating": "7",
      "text": "Probably the biggest change in this remake is that it's set in modern times. The movie does a fairly good job of taking advantage of this. For example part of the torment Carrie's classmates put her through involves cyberbullying. It's a small new addition that is only mentioned in one or two scenes because the era source material fits in doesn't really make much room for new additions. Some of the book and original movie's dialog can still be found here and not all of it fits in well with the new time period. 2013's Carrie attempts to add some new elements do fall short here and there because of how closely it sticks to the original's formula, which was a fairly faithful adaption of the book in the first place.\r Those of us who experienced the original movie will notice the many similarities. The remake does a better job of following that movie than it does the book itself. Although it does add some scenes from the book that the original movie did not, while simultaneously missing out on some of the original's inclusions. While still pretty identical to the first Carrie, director Kimberly Peirce does add her own twists to the familiar scenes. Not all of which are all that great.\r At times it feels too modern and too aimed at todays youthful demographic. It's pretty, flashy, and filled with attractive young actors and actresses. Then there's that soundtrack. Even Carrie White herself is not the awkward little duckling we all remember. That's without a doubt the movie's biggest issue.\r Chloë Grace Moretz is without a doubt a fantastic young actress. She's just not really the right choice for Carrie. Despite her best efforts to look as socially awkward and sheltered, she comes off as way too natural and confident. Perhaps it's believable that she wouldn't be the high-school's most popular student, but she's nowhere near backwards enough to be the most hated and bullied girl in the halls. There are moments where she's just awkward enough to come off as believable, but that's only when they are sticking to the original movie's scenes precisely.\r Yet, when the fateful prom scene finally hits, something about Moretz blood soaked appearance that's just menacing and deranged. The violent, flashy, and perhaps excessive final prom scene suits her well. When she washes off that blood though, we're back to not so believable Carrie.\r So how about the famous prom scene? While it doesn't have the original's restraint and (broken) heart, it makes up for it in flash and some satisfyingly brutal revenge. Peirce does a great job of making sure we see Carrie's demons laid to rest as the she dishes back out the cruelty her bullies unfairly placed upon her. Things get really violent and over-the-top. It's incredibly satisfying to watch even if it does go too big.\r While nowhere near as good as the 1976 adaption and especially not the book itself, 2013's Carrie still succeeds. That's more a testament to Stephen King's writing than a praise to Peirce's take on the classic. To be brutally honest most of her changes just aren't very good. Carrie is just an inherently excellent story to begin with.\r That's not to say all the changes are bad. If there's one thing I will give this new adaption credit for it's on the way it portrays Carrie's relationship with her mother. There's actually some love there. Yes, the themes of religious intolerance and abuse still ooze from the Margaret White character, but you can see in this version she actually does love her daughter. An element missing from the book and previous adaption where she was just cruel to Carrie all the way through. It makes for a more believable dynamic, even if it makes the story as a whole less heartbreaking.\r The tale of Carrie White is still better experienced by reading the book or watching the 1976 classic, but this is still a good adaption. Carrie should have been better cast and it's missing out on some the gut punch from the book and the original that made them so emotionally effective. It's a little too modernized to be as effective, especially where the horror is concerned. Yet, Stephen King knocked it out of the park when he wrote this one. That brilliance still shines through in this take on the story. Not too mention, that prom scene is more exciting than ever. So yeah, it's not the best way to experience Carrie, but it's better than not experiencing her at all.\r 7.9/10"
    },
    {
      "rating": "8",
      "text": "After over 150 viewings Brian De Palma's 1976 version of 'Carrie' remains my favourite film of all time. Therefore, if anyone was going to take issue with this remake it was going to be me. The first thing to be said about this new version is that as a film in its own right it does work. Kimberly Peirce is to be commended for doing a credible job in attempting to put a fresh slant on the material. The big question hanging over the whole enterprise, though, is whether a remake was really necessary. The answer to that has to be a resounding NO. However good Peirce's version is it compares unfavourably, in every aspect, to the sublime master class of De Palma's film. I have always viewed the original as more of a social commentary than an out and out horror movie and De Palma effortlessly switched gears between the comedy, horror and romance. This combination made his vision a very satisfying experience\rPerformance wise, Chloe Grace Moretz is actually better than I think she has been given critical credit for in the title role, but let's face it she was never going to come close to topping Sissy Spacek's iconic playing of the character. Likewise Julianne Moore, an actress whom I greatly admire, grounds her Margaret White in a more believable reality than did Piper Laurie. However, I still prefer Laurie's over the top loon. Also one misses Nancy Allen, Amy Irving, John Travolta, Betty Buckley and PJ Soles. Their replacements do not come close to the incarnations of those original actors. In fact Ansel Elgort (Tommy Ross) and Barry Shebaka Henley (Principle Morton) are noticeably inferior to their original counterparts.\rEven though Peirce has stated that she was returning to the book for this new version, it does feel at times as if she is cherry picking from the novel as well as plagiarising De Palma's film. For older viewers the new version suffers also from audience expectation as scenes and lines of dialogue are anticipated and compared, even if unwittingly, to the superior original. The prom scene 2013 totally lacks the magic and romanticism of De Palma's version and the blood falling on the hapless Carrie, shot from three angles, is totally mis-judged. Similarly, Moretz's playing of the all encompassing revenge that follows is interpreted here as being enjoyable, where as Spacek plays the scene as cathartic, with eyes staring blankly in shock. On the plus side Peirce does handle well the scenes of Carrie's experimentation and discovery of her telekinetic powers. Where her version fails most is with the style. Brian De Palma is all about style, and his set pieces are just jaw droppingly brilliant. He incorporates split screen and slow motion amazingly and to great romantic and nail biting effect. Aided no end by his talented leading lady and her vulnerable and achingly believable portrayal, De Palma's take on the story WILL never be bettered. Also in his corner is that great Pino Donnagio score; The moving relationship that is seen to develop between Spacek and Buckley (which is totally redundant in the new version) and THAT ending. Peirces's last scene was never going to recapture what De Palma achieved. Her ending is somewhat lame and superfluous, underlining the fact that whilst her 'Carrie' is enjoyable entertainment, De Palma's 'Carrie' is a justifiably revered classic."
    },
    {
      "rating": "6",
      "text": "La versión dirigida por Brian De Palma en 1976 fue un éxito total, que inició con la avalancha de las muchas películas (y algunas series) de Stephen King. Ésta versión es no del todo acertada, pero es entretenimiento para los que han leído los libros de dicho escritor. Recomendaría la película a personas que sufren de mucho estrés o quiere asesinar a alguien, ya que la película funciona muy bien en éste ámbito, pero sigue siendo una más del montón de películas de lo que va del año; nada que valga la pena recordar; solamente entretenimiento momentario"
    },
    {
      "rating": "0",
      "text": "this remake is crap this remake is crap this remake is crap this remake is crap this remake is crap this remake is crap this remake is crap this remake is crap"
    },
    {
      "rating": "8",
      "text": "If you look at what the majority of what most critics were saying about this movie, I would say the majority of them called this movie a \"needless remake/reboot.\" Well if you look at this that way, most remakes/reboots are needless because how many of them actually reach the heights of the originals? Thats right, few don't. I never got to see the original Carrie so I don't have the classic version to compare this one to but for the sake of remakes, I found this Carrie to be surprisingly well done led by a very astute performance by Chloe Grace-Moretz who nails the innocent, sympathetic, shy girl with the psychotic religious zealot of a mother played by Julianne Moore. The movie isn't as scary as it is sympathetic as you really feel sorry for Carrie as a victim by the end of the film as she's driven to insanity by sadistic high school bullies and thats the only problem that I seemed to have with it at a whole. It seems more like a high school revenge flick than a pure horror/scare fest."
    },
    {
      "rating": "2",
      "text": "Horrible and a total waste of time and money ,this should have never been remade ,Everytime I watch it  gets worse and worse, and The originals usually surpass the remakes ,this is the only moved i ever walked out of in a theater"
    },
    {
      "rating": "0",
      "text": "Terrible Movie!! , Chloë Grace Moretz which I believe she wasn't right for the role , julianne moore as margaret white she looks like she was in a comedy movie of scary movies ,and all the cast very bad acting"
    },
    {
      "rating": "2",
      "text": "Worst Unnecessary Remakes I Seen In My Life ,Psycho (1998). Carrie (2013). Planet Of The Apes (2001). The Fog (2005).  A Nightmare On Elm Street (2010).  Prom Night (2008).  The Day The Earth Stood Still (2008). Flubber (1997). The Stepfather (2009). Clash Of The Titans (2010). The Wicker Man (2006)"
    },
    {
      "rating": "3",
      "text": "Another pointless remake of a classic, ruined , it has nothing new to say and works with an original that didn't need remaking , The writing is awful bad acting and it is funny"
    },
    {
      "rating": "3",
      "text": "i'm sure if chloe moretz is not in this movie the people want like it , Imagine if  the role of Carrie White was unknown actress would you like this movie ? , in my poor opinion i think that  Kimberly Peirce ruined the movie."
    },
    {
      "rating": "3",
      "text": "Awful acting,  i prefer watching Wicker Man (2006),  The Wicker Man remake is one the worst acting of Nicolas Cage but it is better than Carrie 2013,  Carrie 2013 wasn't scary it is a funny movie  ,and Wicker Man (2006) is a funny movie too , OH, NO! NOT THE BEES! NOT THE BEES! AAAAAHHHHH! OH, THEY'RE IN MY EYES! MY EYES! AAAAHHHHH! AAAAAGGHHH!"
    },
    {
      "rating": "3",
      "text": "Seriously, Carrie 2013 is not a horror movie it is X-Men movies ,why Carrie White  fly in this movie and moves her arms she  looks like  her dad is Magneto , one of the worst remakes  I have ever seen."
    },
    {
      "rating": "3",
      "text": "Firstly I hated that she used her hands to move things as opposed to just looking at them ! It looked far too Harry potter for my liking, really annoyed me,  and yes this Carrie can fly has Superman and she can break the road as The Incredible Hulk  , this movie is not horror it is a  kid's movie."
    },
    {
      "rating": "2",
      "text": "The worst remake i seen in 2013,  The 70's version was so much better....to me, it had more emotion....was much more touching....much better acting...Piper Laurie was great as a religious nut. Sissy Spacek was an excellent Carrie White."
    },
    {
      "rating": "5",
      "text": "El problema con Carrie no es Chloe Moretz, a mi gusto fue encantadora y muy tierna, tampoco lo es Julianne Moore que es lo mejor de la película, el problema es el resto de los personajes, se ven totalmente estereotipados a mas no poder y son molestos de ver; la escena del baile que se supone debería ser el punto mas alto, en este caso es todo lo contrario, todo ocurre en un par de parpadeos y parece estar hecha con prisa y sin ningún encanto. No mas entregas de Carrie por favor!!!"
    },
    {
      "rating": "6",
      "text": "Honestly, this movie is alright, but it got cut down, which made it less original unfortunately.https://www.change.org/p/metro-goldwyn-mayer-make-the-extended-cut-of-carrie-2013"
    },
    {
      "rating": "5",
      "text": "Carrie is a competent horror remake that, predictably, misses out on some of the essence that makes the original such a masterpiece. Although fine, this remade version pushes the horror elements in your face all the time, where as the original was more subtle. Still... The climax is still fun."
    },
    {
      "rating": "8",
      "text": "As a true fan of the original, I pretty much expected this to be trash, but here is a big \"Good Job Team!\" to the production staff on Carrie 2013.\r Chloë Grace Moretz does an incredible job channeling the modern Carrie and bringing the character to life in a way that is genuine and thoughtful. For such an attractive young woman to play a high school pariah is nothing new.  Moretz  radiates an aura of introversion, even as the camera is focusing in on her you can feel her very spirit trying to hide and not be noticed by the world that is so strange and cruel to her.\r Who could play Ms White today and terrify me as much as Piper Laurie had in the 70's;  Julianne Moore.\rAll I will say is that he gasping ragged prayers still make my skin crawl. Thank you Ms Moore for a fantastic job.\r I do have one small complaint: This film had an amazing opportunity within it to show people the intense pain of bullying, both online and at school. I feel if they had embraced that  issue  this film would have been a 10; as is it feels like they glossed over it."
    }
  ],
  "recommendations": [
    "the_witches",
    "the_twilight_saga_new_moon",
    "let_me_in",
    "the_omen",
    "the_conjuring_the_devil_made_me_do_it",
    "poltergeist",
    "ghostbusters_ii",
    "sin_city_a_dame_to_kill_for",
    "i_am_legend",
    "i_am_number_four",
    "the_twilight_saga_eclipse",
    "the_chronicles_of_narnia_the_voyage_of_the_dawn_treader",
    "seventh_son",
    "the_invasion",
    "red_riding_hood",
    "ouija_origin_of_evil",
    "it_chapter_two",
    "percy_jackson_sea_of_monsters",
    "jumper",
    "pan",
    "dreamcatcher",
    "it",
    "the_last_witch_hunter",
    "green_lantern",
    "the_chronicles_of_narnia_prince_caspian"
  ]
}