{
  "id": 1094,
  "title": "Cars",
  "starring": [
    "Owen Wilson",
    "Larry the Cable Guy"
  ],
  "runtime": 117,
  "genre": [
    "Animation",
    "Adventure",
    "Comedy",
    "Family"
  ],
  "description": "Lightning McQueen, a hotshot rookie race car driven to succeed, discovers that life is about the journey, not the finish line, when he finds himself unexpectedly detoured in the sleepy Route 66 town of Radiator Springs. On route across the country to the big Piston Cup Championship in California to compete against two seasoned pros, McQueen gets to know the town's offbeat characters.",
  "releaseYear": "2006",
  "mpaaRating": "G",
  "imageUrl": "https://image.tmdb.org/t/p/w500/u4G8EkiIBZYx0wEg2xDlXZigTOZ.jpg",
  "categories": {
    "plot": 7.512195121951219,
    "acting": 7.96,
    "ending": 7.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 8.375,
    "funny": 6.909090909090909,
    "action": 8.0
  },
  "reviews": [
    {
      "rating": "10",
      "text": "In this movie, the protagonist from the city is emotionally unbalanced and has lessons to learn. The supporting characters from a small town are wise and help teach him those lessons. If you feel that cities are good and small towns are bad, then you won't like this movie."
    },
    {
      "rating": "9",
      "text": "A really underappreciated movie, ranked as one of Pixar's worst. I disagree completely, thinking that it is one of Pixar's best. Cars is very creative and quite often very funny."
    },
    {
      "rating": "7",
      "text": "Another good for PIXAR . In case you speak but have to live adventures and races to go , the great fun and well-remembered movie , an adventure of speed, braking and accidents, just an adventure on wheels."
    },
    {
      "rating": "8",
      "text": "I've always felt that this movie was underappreciated relative to Pixar's other efforts; it is a quality film. The protagonist is a bit of a jerk, but the movie works with that, and Doc Hudson is a great character who gives the film its heart. Mater is not the best thing in the world, but the other characters come together to create a rather fun environment for a film. It wasn't their best piece, but it was a solid effort which was enjoyable to watch, and there are a number of great moments throughout the film and strong echoes that reinforce the themes of the piece."
    },
    {
      "rating": "8",
      "text": "The movie shows that life is not about fame and fortune, but about true happiness and friendship; not only living on the fast lane, but to slow down every once in a while. Furthermore, this is a beautiful film about the love for cars and the countryside."
    },
    {
      "rating": "7",
      "text": "Maybe not as good as the \"Toy Story\" series or not as good as \"Ratatouille\", but this is a very good film. The graphics are very good. The plot is just \"so-so\". The characters are great especially Lightning McQueen, who has great personality. Despite these positive features in the movie, the movie didn't meet with my expectations, especially the fact that this is a Pixar film..............."
    },
    {
      "rating": "9",
      "text": "Cars is another great Pixar film. I don't know why critics are giving it such bad reviews. sure, it is't on par with the Toy Story series or Finding Nemo, but it is still a great movie."
    },
    {
      "rating": "9",
      "text": "Could be the best Pixar film?\r Well in my eyes it is, im a child at heart and i love this film. I am looking forward to number 2 despite the mixed reviews it has had."
    },
    {
      "rating": "9",
      "text": "An underrated, character driven Pixar effort that has all the right aspects to stand up to the rest of their movies. It has a great retro and hometown theme with two very impressive race sequences, beautiful visuals and automobile characters as relatable and real as any live-action ones"
    },
    {
      "rating": "10",
      "text": "Don't think of it as a below average Pixar film. Think of it as a fun standalone experience because that is what it truly is. Lightning McQueen and Mater are some of the best characters to come from a computer-animated movie, and thats what makes it entertaining: The characters."
    },
    {
      "rating": "7",
      "text": "Cars gets a bad rap from some people. It's not nearly as good as films like WALL-E and The Incredibles, but it's still a solid movie with some really nice emotional touches. It also has the distinction of being one of the most absolutely gorgeous films Pixar has ever made."
    },
    {
      "rating": "10",
      "text": "A great animated film that causes children to experience the action experience and tenderness."
    },
    {
      "rating": "9",
      "text": "A perfect film for children that has a strong story and likable characters. The first time I saw this film, I was not impressed, but after one more viewing, I changed my mind completely."
    },
    {
      "rating": "10",
      "text": "Whether the movie will make you believe a shocking-orange stock car has a future with a lavender Carrera, it's more fun to follow than a televised freeway chase."
    },
    {
      "rating": "8",
      "text": "Was Pixar's Cars their finest  no. But was it a good film  yes.\rMuch flack has been given on \"Cars\", but in no way would I give it nearly much negative response. There are a few that bump it down, as Lightning McQueen lacked much charm and appealed to several kids rather than adults, and while the story is slow pacing, the message behind it is powerful. The town of Radiator Springs is believable; it is a visual wonder and realistic, and the characters are charming,... well almost. Tow Mater was one of the only characters that I though could use less emphasis on, as he was basically comic relief. Other characters like Doc and Sally had sad stories to tell, and brought emotion to the film. The story of Radiator Springs and the freeway is truly saddening, and the song \"Our Town\" in the movie is wonderful. Since this movie is also about cars, alot of spectacle is put on a car's vision of things, and its truly hilarious to watch. Despite this, \"Cars\" does lack some of the elements of Pixar's finest (too much cheap humor, slow plot, mostly to appeal to kids), but it's no way bad. \"Cars\" is far from the worst in anything and is truly a delight."
    },
    {
      "rating": "8",
      "text": "Up until this film's release, the concept of anthropomorphism in animation seemed tepidly dated. 'Cars' changes that, with a heartwarming tale of a selfish ego's self-realization with his lifestyle. only in \"car-form\", and with amazing voice acting from the Cable Guy, it makes the whole film a laughing riot. A great Pixar comedy."
    },
    {
      "rating": "9",
      "text": "\"Cars\" is often seen as one of Pixar's lesser films and, while I can certainly see why, I actually really like it. It's beautifully designed, solidly written, has a few decent characters and a lot of charming and meaningful moments. It may not live up to the high standard Pixar has set for itself (it's not as wholly original as other Pixar films), but it's an enjoyable film that should please people of all ages."
    },
    {
      "rating": "7",
      "text": "I guess from 2006 till now is a long way, but even now, I find this animation fabulous ( after years and years of several minutes sequences and never seen the full animation ).\r Pros:\r- Enchanting animation\r- Humour\r- Story\r- Back Story\r Cons:\r- Lenght\r- Slow Start\r- Gets boring\r I like a lot the idea of replacing EVERY MOVEMENT THING with CARS. This is a great idea, amongst other Pixar's. But this is one of those movies that you will see and hardly remember about it, maybe forget it exists. Looking forward to see the sequels."
    },
    {
      "rating": "9",
      "text": "Cars is a really fun movie. The movie is really well written and the characters have so much personality it seems like they are so much more than just cars. Owen Wilson is always great at playing a role in a family film and Larry the Cable Guy get his most notable role as Mater, what a funny voice to have in an animated film."
    },
    {
      "rating": "9",
      "text": "A lot of people consider this to be Pixar's weakest film, but I really enjoyed it. The film definitely takes me back to my childhood and my love of vehicles. The story is pretty simple but I would give it a pass because it doesn't distract the film at all. I thought Mater was going to be annoying, but he was actually alright. But other than that the characters are memorable, the racing is fabulous, and it has a lot of heart-warming moments."
    },
    {
      "rating": "8",
      "text": "This is a fast-paced comedy adventure set inside the world of cars. Fueled with plenty of humor, action, heartfelt drama and amazing new technical feats, Cars is a high octane delight for moviegoers of all ages."
    },
    {
      "rating": "7",
      "text": "Cars is a great adventure that pales in comparison to the Pixar movies like Toy Story and Monsters Inc. but Cars is still a good movie. Sure the story may cater to kids more than any other Pixar but that is not a bad thing. It had a simple plot that's a hit or miss for some people and it's dead shot in the middle for me. I think this movie is underrated but it still is a pretty bland movie compared to Pixar's other work. At the end of the day Cars is a solid movie that is just ok not great but not bad. Sometimes a simple movie is good and Cars is one of the good ones."
    },
    {
      "rating": "8",
      "text": "Cars, while not quite as an intriguing idea as the other films in the Pixar canon, was pulled off very imaginatively. The storytelling is brilliant, as well as the animation techniques. The only thing that sets this film behind the other Pixar films is the less interesting idea compared to looking at the hidden going-on of toys, bugs, monsters, and fish. Yet, however, you look at it, it almost seems that the people over at Pixar Studios just can't make a stinker."
    },
    {
      "rating": "10",
      "text": "Cars was my favourite movie as a kid. This rating is more based on nostalgia, but i still think its a great movie even without loving it at first sight. 10/10 is a good score in my opinion"
    },
    {
      "rating": "7",
      "text": "Cars may not finish the race to become the best of the Pixar movies, but Cars still race to become a decent and loving movie for your kids and family."
    },
    {
      "rating": "7",
      "text": "While it isn't as good as the other pixar movies and doesn't have as a good storyline as the others, it still remains a solid movie with a story worth checking out."
    },
    {
      "rating": "8",
      "text": "Many would consider this film to be one of Pixar's weakest. However, I find that this movie is actually one of the better animated movies. In this movie, its protagonist is emotional unbalanced. With the help of the cars from the small town, he finally gets his emotional state back on track.\r One great movie with great animations and visuals. However, if you are not a fan of racing, then you better avoid this movie."
    },
    {
      "rating": "7",
      "text": "This film gives us a storyline which can work, but executed pretty poorly, giving us an average, dull and overly long film with little to no emotion that a Pixar film usually boasts. Still a good film for the kids with fantastic animation but for Pixar's standards, pretty poor. If around 15-20 minutes of the film were cut out maybe the film could've been a bit better."
    },
    {
      "rating": "7",
      "text": "Though not the kind of animated classic expected from Pixar, Cars is a solid film with impressive visuals and unique characters, even with its long run-time, lack of plot and humor, and a heavy handed message for viewers."
    },
    {
      "rating": "7",
      "text": "Some parts of the film were dull and felt too long, and the story lacked real emotion and was executed pretty badly. It was still a pretty funny movie and it's visuals are great. Overall, Cars is a solid but not a stellar animated flick."
    },
    {
      "rating": "7",
      "text": "One of the standards of animation. An excellent story that the hunt is to watch several times. But I would like more serious topics and dialogues. In all ostpnym I liked it, Pixar pleasantly surprised"
    },
    {
      "rating": "7",
      "text": "This was a pretty great start for a decent series. It was simple, but enjoyable. Had funny moments and some emotional, but not too emotional. Yes, it's a movie about talking vehicles, but it's good."
    },
    {
      "rating": "10",
      "text": "My favorite Pixar movie ever. The characters have the charm and comedy needed to make this great. I could watch it again and again. Truly a great movie, it impacted me in a big way, and I truly loved it."
    },
    {
      "rating": "9",
      "text": "Wonderful movie with great character growth. Surprisingly, the sequels are extremely subpar when compared to the original. i have nothing more to ad. good night!"
    },
    {
      "rating": "10",
      "text": "Biggest part of my childhood was this movie. I was opsessed with Lightning Mcqueen. This movie was loved and still is by many people. Definitely my favorite animated movie. The movie has an beautiful story. A rookie race car Lightning Mcqueen finds himself in a small town called Radiator Springs. There he meets Mater,Sally,Doc Hudson,etc. They show him that friendship matters more then trophies and fame.Pixar did a amaizing job with this movie. Thank you for making my childhood great."
    },
    {
      "rating": "7",
      "text": "Pixar's \"Cars\" is a visual masterpiece with a good morale planted within the movie. However, if I am correct that this company was the creator of \"Toy Story\" and \"WALL-E\", I expect more."
    },
    {
      "rating": "9",
      "text": "In my local paper, they used a review that put Cars at 2.5 stars. From my perspective, it was 4 out of 5. Not on par with Toy Story II or The Incredibles, but the attention to detail and the absolute love and care that is obvious in every rendered frame of this film shows through constantly. The story teaches lessons that are missing in too many films directed at children, like cultivating relationships instead of attention and glory, and remembering that life is more about the cruise than the destination. One last thing... Unlike the review mentioned above, I found the humor plentiful and lush, not barren and dry."
    },
    {
      "rating": "9",
      "text": "Run, don't walk. Okay, speed out and go see Cars. This is almost unbelievably Pixar's best film - it's amazing that they actually could top themselves again. There are only a couple of plot points where you think, \"okay, they did that because it's a kid's film.\" Beyond the phenomenal graphics and the amazing storytelling ability, the movie excels in two unexpected ways: * the cameos are hilarious... more than any other Pixar movie, and very appropriate to the subject matter. You'll get them if you're a fan of NASCAR, NBC (sports) or NPR. * they had the most amazing opportunity to sell out... you're doing a NASCAR-styled film... so you could have literally tens of thousands of product placement opportunities on in to the merchandising opportunities... but they don't. Not a single brand in the film is real. And, if you're a fan of Pixar films (or of a certain Cheers star,) be sure you stay into the credits. Self-referential was never so funny."
    },
    {
      "rating": "2",
      "text": "Yikes. Something went horribly wrong here. The CG scenery is pretty, but that can't compensate for the rest: forced voice acting, eye-roll-inducing moralizing, lame jokes, a predictable story arc (gosh, do you suppose the hot-shot protagonist will make friends with the small town residents and learn some obvious Life Lessons?) and characters that all have personalities lifted straight from templates in the Big Book of Cartoon Stereotypes. Pixar's The Incredibles, by contrast, proved truly engaging to watch - all that attention to the characters' eccentricities and subliminal tics - and that screenplay was smarter than the spy-thriller/superhero genres it parodied. Where has that smartness gone? If you saw the trailer for Cars and had a negative gut reaction, trust your reaction and steer clear, despite what you know of Pixar. In aiming for the mainstream here, Pixar has sacrificed a large part of what makes its movies magical and unique, and the strange thing is that nobody much seems to have noticed the problem. As for me, I winced a lot and tried as best I could to just enjoy the visuals."
    },
    {
      "rating": "7",
      "text": "I thought that \"Cars\", even at 117 minutes, is slightly overlong. The film is quite dull in places where nothing exciting is happening. The film also lacks a script with some emotion, however, the animation is fabulous. Prepare yourself for some exciting car-racing scenes!"
    },
    {
      "rating": "9",
      "text": "Not quite up to the perfect 10 of the Incredibles, and Toy Story II, but definitly the first great movie of the summer and 10 X better than any of the other animated movies of the last few years. A huge reminder why Pixar is in a class of itself."
    },
    {
      "rating": "5",
      "text": "Pixar finally delivers a mediocre product. The story was slow and 100% predictable. If cars and racing aren't your thing, there's not much for you in this movie. My daughters were bored. The visuals were great."
    },
    {
      "rating": "5",
      "text": "Lame, predictable plot and flat characters, but awesome animation and action. As pretty as Incredibles and Finding Nemo, but not nearly as emotionally engaging. You just don't care about the main character."
    },
    {
      "rating": "8",
      "text": "Good, fun, simple... Dont have so much to say, just a good movie to watch and laugh.\rThe script is a criticism to fame and arrogance. Is a right choice to watch with your children."
    },
    {
      "rating": "3",
      "text": "Cars tries desperately to be funny, but most of the jokes tend to fall flat. Also, I'm not quite sure how talking cars would be able to build the ragtag Radiator Springs anyway."
    },
    {
      "rating": "7",
      "text": "Look Pixar's Cars is hard to love because you know they are cars, but the film is packed with so much heart it fills you up inside. I give this movie a strong 68%."
    },
    {
      "rating": "1",
      "text": "American Drivel at it's worst ... I think it's one of the only movies where not only myself but my children wanted to leave the cinema. Boring to say the least and might only appeal to the americans. As others have pointed out, if this is indicitave of what pixar are going to be churning out post-disney buyout then im thinking there is no hope for them."
    },
    {
      "rating": "3",
      "text": "Wow, what a disappointing bore! There was nothing clever, interesting, new or funny about this movie. (For adults - I'm sure kids will love it, however.)"
    },
    {
      "rating": "4",
      "text": "Pixar are known for intelligence and among the best in there field so it's mystifying why they made this. It's not awful but it doesn't even come close to the standard which they've set and normally achieve. Fart jokes don't belong in a Pixar film and that alone should deter you from this quite depressing film, also the charachters are far below standard as is the story. Pixar have completely redeemed themselves and have created some of the best films ever made but while I've forgiven them, I will never forget this slip up"
    },
    {
      "rating": "5",
      "text": "I know why it's considered Pixar's weakest flick. The animation is beautiful as always and like the design of the vehicles, the big drawback is that the plot is unoriginal as it takes plot threads from Doc Hollywood and Days of Thunder. Another thing is that the characters are underdeveloped not even the voices of Owen Wilson, Paul Newman, George Carlin and the stereotypical redneck Larry the Cable Guy can save this from being a snooze fest. What really killed it from winning an Oscar for Best Animated Feature was the soundtrack (which includes Rascal Flatt's butchering rendition of Tom Cochrane's Life Is A Highway) and the merchandise including video games, toys books and those Mater shorts including the one where he battles against Japanese drifters which was shown before Bolt. It's almost as though Pixar thought made so many good films and need a weak one to even it out.\rThose who loved Pixar from the beginning may have to skip it or give it a rental. It may entertain kids, but anybody over 12 might feel alienated."
    }
  ]
}