{
  "id": 587,
  "title": "Cars 3",
  "starring": [
    "Owen Wilson",
    "Cristela Alonzo"
  ],
  "runtime": 102,
  "genre": [
    "Animation",
    "Adventure",
    "Comedy",
    "Family"
  ],
  "description": "Blindsided by a new generation of blazing-fast racers, the legendary Lightning McQueen is suddenly pushed out of the sport he loves. To get back in the game, he will need the help of an eager young race technician with her own plan to win, inspiration from the late Fabulous Hudson Hornet, and a few unexpected turns. Proving that #95 isn't through yet will test the heart of a champion on Piston Cup Racing’s biggest stage!",
  "releaseYear": "2017",
  "mpaaRating": "G",
  "imageUrl": "https://image.tmdb.org/t/p/w500/jJ8TnHvWHaVadW5JJjGYsM07j9i.jpg",
  "categories": {
    "plot": 6.617021276595745,
    "acting": 7.038461538461538,
    "ending": 6.888888888888889,
    "soundtrack": 9.0,
    "cinematography": 9.0,
    "familyFriendly": 4.75,
    "funny": 6.25,
    "action": 5.25
  },
  "reviews": [
    {
      "rating": "6",
      "text": "Cars 3 is a great film, don't get me wrong, but with all the trailers it really made it seem like it would be all about McQueen. However, while watching the film I definitely knew what was coming next. The film didn't even try to be unpredictable. Having Cruz Ramirez race at the end is touching and shows change for McQueen from the first Cars movie, as he doesn't only think about himself. But me being a huge Lighting fan, it is a little disappointing to not have him win his last race, it almost seemed like he gave up. Still, it is a great film for kids."
    },
    {
      "rating": "4",
      "text": "Beautiful visuals cant save this film from its own lack of imagination.... Unfortunately this movie shows the limits of its own world setting by rehashing the Cars 1 plot (with a predictable twist) and somehow the pacing in this world of Cars really drags its feet. Maybe its talking cars, but I felt really conscious of the fact I was listening to voice talent in a recording booth such was the lack of drama or character. Overall sub par for pixar."
    },
    {
      "rating": "3",
      "text": "They felt as if he should retire and did something with Cruz Ramirez then she won the race... that is all i can remember, but this movie gave me the thoughts of.. WHAT!??!"
    },
    {
      "rating": "9",
      "text": "This is a one maravilous movie Mi intern children is so very exitatedI love cars 3"
    },
    {
      "rating": "10",
      "text": "The best animation movie of my childhood, I have no words, impressive, incredible and ... FANTASTIC !!!"
    },
    {
      "rating": "10",
      "text": "this movie is my favorite movie from 2017 along with transformers the last knight!"
    },
    {
      "rating": "5",
      "text": "Old cars and new cars. McQueen is an old car. Storm is a new car. Mcqueen is mad for a moment.The animation is solid, but other than that, this ain't that great."
    },
    {
      "rating": "6",
      "text": "\"Cars 3\" feels like a spiritual successor to the original \"Cars\" by adding heart and a message to the story. However, the story itself is predictable and uneven."
    },
    {
      "rating": "10",
      "text": "This is what Cars 2 should have been. Cars is a great franchise and I really enjoyed the first film, but I was very disappointed in the second one. This entry has taken what was great about Cars 1, and only improved upon it. Many people that grew up with Cars, myself included, will enjoy going back and seeing a proper ending to the franchise. I was hoping that Cars 2 is not how the series would go out, and my hope paid off with this movie. If you are a fan of the first film, you will surely enjoy this one."
    },
    {
      "rating": "9",
      "text": "2017 was so far a surprising year for movies,especially for animation. But now,watching Pixar come back to Cars (AKA my least favourite Pixar franchise) almost made me want to puke. But then,trailer after trailer,my interest grew up and up,becoming one of my Most Anticipated of this Summer. And it turned out that i didn't regret it at all (like Cars 2 back in 2011). The story was great (you'll probably get some Rocky III/IV vibes at some point),with messages about never giving up and dealing with becoming old. The animation almost reminded me of The Good Dinosaur (another Pixar flick),because of the beautifully crafted landscapes and the well-detailed cars (that kinda made me think that those cars came out straight from a Gran Turismo game). This time,we have some new additions to the movie,like Cruz Ramirez (probably the funniest charachter in the movie) and Jackson Storm,the main villain of the movie (and probably one of the charachters to have a short screen-time). And the rest was fine,like the charachter development,or the groundbreaking soundtrack by Randy Newman. In the end,this is not another Toy Story 3 or another Finding Dory,but it's still well-made. It's funny,it's poignant,it's Pixar at its best. Cars 3 may not be the best Pixar movie,but it sure is the best installment in the trilogy. And yes,it's better than Cars 2 and all those 'Furious' movies."
    },
    {
      "rating": "10",
      "text": "Cars was one of my favorite movies ever, and this ties it. This added great new characters full of emotion (unlike Cars 2), and the story is great. The story follows Lightning McQueen as he struggles while trying to beat new top tier racers. During the story he visits many new places for help, and it can be surprisingly emotional. The ending is also the best the Cars series has had. It isn't predictable which is nice, it has great voice actors, and the animation is almost perfect. The only downside is that they didn't show enough of the original Cars characters, but maybe that was for the best. It is way better than most people are saying, so go see it, you won't be disappointed."
    },
    {
      "rating": "10",
      "text": "Cars was one of my favourite movies from my childhood. So , I decided that I have to see this movie. I really liked this movie , it was very funny and for me , the last part of the movie was unexpected. They did a great job and I really wait to see it again at home."
    },
    {
      "rating": "10",
      "text": "i admit i give the cars franchise to munch slack. and yea cars 2 was awfulbut i enjoyed this movie. a ton pixar makes amazing animated films and in my opinoin cars 3 is no exeption"
    },
    {
      "rating": "7",
      "text": "Spoilers: While the film had great potential with a good plot line, ultimately, it was poorly executed. I like the idea of 'retired racer finds new life as a trainer', but I found it hard to like Cruz Ramirez and I was left more interested in Smokey and the storyline around the Hudson Hornet. I also think the storyline went a little wonky. I would have rather seen Lighting crash, then try a comeback, fail, then go see Smokey and discover the potential for a new life as a trainer where he discovers a new racer with the potential to beat Storm. Then, he/she wins in the final race at the end with the help of Lightning who taps into the advice from the Hudson Hornet."
    },
    {
      "rating": "8",
      "text": "Cars 3 was pretty good, not as great as the first and better than the 2nd. Cars 2 was trash. But C3 did live up to my expectations and had an unexpected story line that I enjoyed. The ending was also a major twist.....but I didn't like it. I really wanted McQueen to win that race but he didn't....."
    },
    {
      "rating": "7",
      "text": "\"Cars 3\" was a good movie, the recent characters and the old characters were acceptable, and the new characters are good, but the protagonists were outstanding, the story very interesting, but as I did not like the semi-dark tone of the movie, but I have enjoyed."
    },
    {
      "rating": "5",
      "text": "Eh, it's better than Cars 2, but it doesn't make it better for being 50% a funneral dedicated to Paul Newman and the weakest and idiotic villian Jackson Storm. But at least it has funny moments, the characters are ok and the animation is great. I never been a fan of the Cars framchise, but this movie represent what Pixar is going now. They used to be the best of the best like McQueen but now they're old and there's new animated studios to replace him. Anyway, I like Despicable Me 3 more than this."
    },
    {
      "rating": "8",
      "text": "Although Cars 2 was not at all great, Cars was. Cars 3 brings back what the first film was special for... the actual racing. This is what Cars 2 should've beem."
    },
    {
      "rating": "7",
      "text": "This Movie is kind of an OK/Good movie.I know that McQueen has to come out of retirement because he needs one more race but however other racers (the older ones) retire. So much futuristic cars come in and so, Jackson Storm is the most advanced and McQueen couldn't beat him and blah blah blah. He is defeated and has to train because he wants to go and beat Jackson Storm. This final installment gave me shock, depression and happiness also giving funny jokes to everyone. The prediction is like you know how it is. I predicted pretty easily from the trailers and also it was kind of predictable like when McQueen manages to stop Miss Fritter but tries to defeat her but she stand up successfully. That's all for this review and so I call it 7/10 also OK/Good. Plus, I was a Cars fan."
    },
    {
      "rating": "8",
      "text": "I enjoyed watching it just fine with my 3 year old son and I'm perfectly happy for him to see a world made up of two genders. And to those people saying feminists ruined this movie and that some \"message\" was being rubbed in their face? You are sexist, deep, I mean deep in your core, I really hope you don't have daughters.... OR sons for that matter."
    },
    {
      "rating": "10",
      "text": "Where can I start?I went to see the movie with a very big hype, afraid to be like the second one that is pretty bad. And I wasn't disappointed. The story is very well thought out and makes you see another side of Lightning McQueen, which is very good. They chose not to be a hero vs. villain story but rather a self-maturing one, it was a cool touch, at least for me.Lightning McQueen is amazing in the movie, showing his willingness to run and also his side of a very experienced guy. I can see that the film focuses on only 3 characters, which doesn't mean that it choked others, quite the opposite. I was also able to see that after the \"failure\" of Cars 2, they chose to shorten the screen time of Mater, which really (and unfortunately) seems to be his place as a secondary character. Cruz Ramirez is a very good character with a possibility for many cool things (maybe even a movie, who knows?), also innovating being a main woman pilot, since in the second there was also one, but it was not highlighted at all. Jackson Storm is a good rival that motivates the public to cheer even more for the protagonist, but would not say that it is memorable, it is just what it is: a rival.The film doesn't go wrong in practically anything, being able to hit forward with many good Pixar films. He is better than the first and EVEN better than the second. By the way, let's forget the second. You can very well see the first one and jump right into the third, since Cars 2 didn't add practically nothing to the trilogy. To make it clear, I don't hate Cars 2, but after seeing this new movie, I could see how inferior it is, even to the first. If it's still on, go to the movies and draw your own conclusions, but I'll tell you: You will not regret it."
    },
    {
      "rating": "5",
      "text": "I didn't thought this scenario for this movie. I think there's more attractive things on here. I don't very satisfied with this movie. If the scenario is more attractive (like Mcqueen don't resign), I would give 10 stars."
    },
    {
      "rating": "2",
      "text": "A huge disappointment. The trailers really looked awesome and like the movie would be about Lightning McQueen making a triumphant comeback after suffering a huge loss. But no..... The movie starts out with 10 year racing veteran McQueen at the top of his game and having fun. Then come in all the more technologicaly advanced cars who go 210+ mph and everyone but McQueen goes into retirement or is fired, and he has a huge crash from pushing himself too hard. It then cuts to him back home and nothing of his crash or trauma are mention again. Encourage by his girlfriend to get back out there, Lightning goes to retrain at the training center of his new boss. Now Stirling was an interesting character but not really used much other than as a sort of antagonist who was more interested in money than taking care of Lightning himself or racing. Lightning gets this new trainer, Cruz, who is supposed to be able to get athletes into proper racing form but she spends more time making fun of Lightning for being over 30 and old, like a lot, embarrassing him or treating him like a grandpa. Seriously, she never listens to him or ask him if he’s happy she just annoys him. Frustration leads Lightning to mess up a racing simulator and having to make a deal to stay in the racing game if he wins a big race in a few weeks time. So he goes to train outdoors because y’know over 30’s don’t like technology and stuff. But he has to take Cruz with him and here it becomes obvious that she really is just nothing more than a fitness coach because she is hopeless out side and can’t race. So Lightning has to waste time training her because cruz is the 20 something year old who only works with tech and the outside is a foreign, scary place for her.This goes on for a bit, Lightning looking after Cruz and she in no way helps him train or anything for his big race. A few days away from it we learn that oh no she wanted to be a racer but was to afraid to be one and wimped out. It’s here we’re supposed to feel sorry for her but I didn’t. At all. She doesn’t seem to realise that this means a lot to Lightning, it’s his life and income but no, her failure as a racer is what’s going to be important.Lightning then goes to the home of his old mentors  teacher, and him and all the old cars from the 1940’s to 1950’s also make fun of Lightning and call him old, excessively. They try to train lightning but it’s clear by now that the focus of the movie is Cruz and her life not Lightning making a come back as the trailers portrayed. Lightning goes to his race and out of the 43 racers he’s the last. He still makes it to number 14 in the 250th lap (there’s 500) but quits mid race to let Cruz have a shot at being a racer and start her career. It feels cheap. The ending was a huge disappointment and some people got up and left the cinema around me. I mean the jokes were bad, the movie was Ames’s of plots and characters and it all feels forced. Cruz feels like a cheap knockoff McQueen who never really works for her racing career, she has to be given it whilst all the other cars worked for it. She can do things no one else can with little training and taking over from some one half way through a race is cheating. Yes you can switch drivers in a race but the car is the same. This is more like if a runner switched with another to finish a race whilst all the other runners had to do the full thing. She’s not a good character for girls or women empowerment by being annoying, half-assed at her job, or having to get her career given to her because she can’t work for it herself. There is some hope though as Lightning said he would continue racing after he trained Cruz for the season so maybe, just maybe we will get to see Lightning be a champion like Pixar are always telling us he is. It would be nice to see him work through a movie, fight for his place at the top and win, spectaculary. This is something he has never done in any of the movies. He either gives it up to be kind or give someone something ( this plot is used here like in the first movie, so it’s got rehashed plot lines) or mater was the main lead. Pixar show us champion Lightning. He’s been nice, a good friend and nice again. Show us this winner you keep telling us about. That would be a really good movie unlike this one."
    },
    {
      "rating": "9",
      "text": "After \"Cars 2\" was much weaker than the first film, so much so that it was Pixar's first rotten-rated film on Rotten Tomatoes (even though I still enjoyed it), many of us scratched our heads and wondered why Pixar was going to make a third film. Oddly enough, though, I actually find it to be my favorite of the \"Cars\" films. Beyond the typically beautiful animation, I appreciate that Pixar actually took the series back to the racetrack, focused on Lightning more, and made the film a bit more mature, kept the film from feeling like too much of a retread, and actually adding some legitimately emotional and tense moments in the film. Is it one of Pixar's best? No, definitely not. Is it still an enjoyable film? I think so! And even if you aren't too interested in the series, it's worth checking out to see what side of the fence you sit on here."
    },
    {
      "rating": "10",
      "text": "This Film better better better than Cars 2. Not better then Cars 1. But Cars 3 İt's awosome. Story. Characters. Legend movie is comeback. Metacritic r"
    },
    {
      "rating": "3",
      "text": "WOW. This movie is really BAD. The rotten tomatoes score for this lifeless movie is really generous, and hard to understand. The script is really, really not good. Most of the movie's jokes fail really badly, and the plot is a bad repeat of the first Cars movie (which I really like). This is a comedy that is not funny, and the dramatic parts feel fake and artificial. I really disliked this movie."
    },
    {
      "rating": "9",
      "text": "Cars 3 is one of the Pixar movies I was excited about watching mainly because I really like the first one and the second one is alright I know right crazy I said alright well oh well anyway this movie really hit me this is one of those Pixar movies I have seen that is really emotional to watch like finding dory is up their toy story 3 and finding Nemo and wall-e are the ones are the saddest out of those but to me Cars 3 tops all that of course at first what I heard about this movie was not good so I was still really worried about mainly because I heard that lighting Mcqueen does not even race at the end is why it took that many years to see because of just that because mainly people are just picky but I am glad I picked this up today because i wanted to see what is this about and i am very glad i saw this and i really liked it and this is for sure of my fav pixar movies here is why mainly because of lighting Mcqueen as an character is the best he has ever been in the other movies he was not that good he really only cared about his fans in the first which bothered me a lot when rewatching that movie in cars 2 all round his character he once again only cared about the race and that is why we focus on mater but in this movie he is awesome in he actually improves his character a lot cruise is good also at first i am like this character is gonna be a waste nope the beginning of the movie is the best i know that people don't think that but i do the best part of these three movies are the races that is why cars 2 is still solid for me mainly because of that the very first race and Mcqueen crashes really hurt and it sad even watching stuff like that happen but having character like that is tuff to see might just be me idk Storm as an villain is a nice addition nothing to hard to focus on him in the movie to take away from McQueen side the race at the end is good not the best mainly because of Cruise but it's ok for this movie i am not too happy on it but i can be fine with it so all round this movie is a big surprise did not aspect this movie to be this good for me so I give Cars 3 an A-"
    },
    {
      "rating": "7",
      "text": "If you were disappointed by the many outcomes of Cars 2, then it's no doubt that you are actually looking for the real Cars 2 everyone was waiting for. In quite terms however, Cars 3 could barely reach the original's position, but even if so, it's still a well-worth movie to watch for the heavy benefits of being very glad that this isn't a Cars 2 wannabe."
    },
    {
      "rating": "2",
      "text": "The trailer was promising to me & I expected it to be a really good movie, but instead it was \"meh\". I didn't really like Cruz & it was heartwarming how Lightning McQueen made a tribute to Doc at the end, but the trailer made it seem action packed & it wasn't as good as I expected."
    },
    {
      "rating": "10",
      "text": "Personally, I loved the movie more than the original which was previously my favourite pixar movie. I love the characters and the story, maybe I'm biased but I definitely recommend at least 1 viewing."
    },
    {
      "rating": "10",
      "text": "Sometimes I think adults forget that these movies are written for kids.  My 8 year old son, 9 year old daughter, along with mom and dad loved it.  The story had great heart, wonderful life lessons, and was very funny in parts.  The comments on feminism were from other reviewers are ridiculous.  Neither my wife and I felt there was anything along those lines except that a racer was female.  I am not sure why that is an issue.I think the critics are way off on this one.  The movie was outstanding!  I thought it was great for adults and kids."
    },
    {
      "rating": "1",
      "text": "And yet another film in a series that's sole reason is to sell toys! But hey this time you'll get a nice message about retirement because hey it's for kids! Cars is and always been the worst of the worst from Disney and Pixar! Do youreself a huge favor and don't buy any more Cars branded toys and don't go out and watch this! You will be doing a great service to the community by stopping Disney from making this crap!"
    },
    {
      "rating": "7",
      "text": "\"Cars 3\" wasn't tuned enough to get out from the garageThe anthropomorphic Cars universe returns to the race after a criticized pit stop called \"Cars 2\". On this occasion, emblematic Lightning McQueen retakes the wheel to run into the crude law of reality: the retirement. His components don't evolve, his environment does, therefore, while the beloved car stands up against a new horde of technological newbies, must choose which direction he will take for his future: he decides when he's done.Although it's difficult and paradoxical to say, keeping in mind the elaboration dimensions of the near magnanimous Pixar, the \"Cars\" franchise, despite being one of the most profitable animated proposals for the company via films and merchandising, is the lightest and less prodigious in the history of the American computer animation film studio.  Have you ever wondered why Pixar releases one more installment on the family of automobiles, considering the results of its spoiled predecessor? Well, the answer is John Lasseter. With over 20 years as animator, director, producer and, in short, Pixar leader, this man is the main promoter of the saga, because, in addition to advising the different fields of making feature films, he has directed the two car films, provoking he keep a deep affection towards his universe, and who does not like it? It's such the faith in his speed world that has put his hands on fire by Brian Fee and Lightning McQueen, in the directorial debut of one and in the emotional \"retirement\" of the other.Fee accepted the big vote of confidence of Pixar to appropriate the third entry into the motorized universe. The filmmaker increases the mileage of the saga, converting it into the best easygoing proposal among its predecessors, balancing doses of nostalgia with realistic and sensitive skids, basing on a mature message, which, although it does not make muddy dealing with questions of delicate importance, it inserts misogynist missives, of course, relegating the special emotional and comic impact placed on the characters and the story.Although it falters keeping a constant pace and proposing attractive novelties in any of the narrative points, Pixar is characterized by producing ecstatic wonders in technical and/or animation fields, and this is not the exception. They don't infest exotic settings with which to profit, otherwise, exhibit once again, they return to the roots one way or another, however, get stuck neither in plain beauty of the deserts adjacent to Radiator Springs  nor in the traditional race track; the feature film goes from a sumptuous training complex to a speedy journey with Mack, where landscapes are interspersed majestically. The script overtakes the flaws of the second one by far, in this movie is appealing to sentimentalism through a dramatic effect, which is led by inescapable acceptance of age, an irreparable beginning for novice new generations. It's pertinent, but the incorporation of technology feels like an excess, and although cinema is lately motivated by this, it's not a necessarily leading element. Precisely, the theme of legacy is the one that raises the final twist and the corresponding gestation from the second act, since the first half hour is decaffeinated, slow and tiring, a stretching of the daring opening monologue that emulates the portent of the first film: \"I'm faster than fast\", but in fact, there's a shortage of gasoline. In consideration of characters, it was thrilling to know what the screenwriters would do with the car #95, in order to he resumes the leading role after, incomprehensibly, the main attention was concentrated in the comic relief of the saga: Mate, in the same way, inexplicably, they give him a tight participation with few effective jokes but a big futility, perhaps, so that the audience would not disperse their attention from the true star. McQueen and his new flock of characters, in which is Cruz Ramirez, a coach sport car with aborted dreams about being a pro driver, they possess charisma and spark required to raise the level towards the end of the footage, their motivations and actions are more prudent, revealing a pure and human story, without decorations or possibilities of questioning perception, an undeniable feature that makes Pixar, Pixar.\"Cars 3\" by Brian Fee turns on the engines of a franchise that was already parked in the garage, generating real opportunities to roar the car, textually, in upcoming years with the help of new—fixed— ideas. With regard to the (hi)story of McQueen, he has an ending as nostalgic as uncomfortable, the trouble is that doesn't succeed it with the melancholy that \"Toy Story 3\" achieved, reducing everything to a childlike thing, a car journey lacking impact, and although, in small extent, it's thankful, on the other hand, placed it as one of the less interesting Pixar films, as this world-class company is not only characterized by its visuals, but also by heart of its stories."
    },
    {
      "rating": "8",
      "text": "Good movie. It´s for kids.(boys), my daughter was bored, even if the co´star is a female car... they are still cars. But all the boys around the cinema were super hyped!  So if you were a kid when Cars 1 got out, this move is going to rock!    Personally, I´m a grown up (37 years) Loved Inside Out. Loved Wall-e Loved Up, Loved Ratatouille... Cars 1 not so much. Cars 3... MmmmThe Technical aspect is OUTSTANDING. Pixar almost nailed the realistic render. The sea, the mud, the \"past videos\" they are like... A MUST SEE!"
    },
    {
      "rating": "9",
      "text": "I saw this movie with my two kids, in a theater full of children that looked to be from ages 5 - 10.  They (all the kids there) loved this movie, laughing and even clapping at times.  It has everything that kids are going to enjoy, great visuals, action, suspense, humor and a story.  It wasn't perfect, but it washed the taste of Cars 2 out of my mouth forever.  This movie doesn't even address the 2nd movie, and personally I like to think of Cars 2 as one of Maters Tall Tales and leave it at that."
    },
    {
      "rating": "8",
      "text": "The first Cars film gets way too much slander for being a cash grab that nobody really asked for, but I would argue that it is one of Pixar's best because of its landscapes, character developments and visual storytelling. While Cars 2 felt a lot more like a made-for-TV movie and is passable at best, it didn't capture what made the first film so great. Thankfully, Cars 3 does all of that, possibly even more so."
    },
    {
      "rating": "9",
      "text": "This is Pixar's latest attempt in reviving its least likable film franchise to date. However, \"Cars 3\" is touching, energetic and extremely fun. I went in with extremely low expectations, and I was pleasantly surprised! I loved \"Cars 3\" from start to finish."
    },
    {
      "rating": "10",
      "text": "Benim için gerçekten harika bir filmdi mizahi yönü daha az olsa bile filmin gidişatı gayet iyiydi animasyon yönünden de daha çok uğraşılan bir film olmuş tek kelimeyle HARİKA!"
    },
    {
      "rating": "9",
      "text": "I was very much excited for this movie and the trailer absolutely caught my eye onto it.This movie's graphics was one of the best Pixar ever had and I saw this movie's potential as a great movie, but they executed it not in the way Mcqueen's fans (such as myself)would be glad to see, as the time we saw Mcqueen actually racing with rivals was the least from the Cars Trilogy, even the villain of this movie rarely appear in this movie. The characters in my opinion are fantastic, Cruz was a terrific addon onto this franchise and the mention of Doc in this movie made it even better. The best moments that i had from this movie when unpredictable things happen like letting Cruz finish the race for Mcqueen,it was fun and enjoyable. I gotta say Cars 3 is a great movie compared to Cars 2, but the original Cars would always be the best. Overall it sums up to be a good 'Thursday' night out with friends."
    },
    {
      "rating": "9",
      "text": "Oh, YEAH! Oh, YEAH! Oh, YEAH! Now THIS is the movie that we fans of the Cars franchise have been looking for! They did it, didn't they? Pixar just made Cars great again, and BOY, did they EVER do that! This film took everything great about the original Cars in 2006, and it just made it go full max speed, and fire on all pistons!"
    },
    {
      "rating": "0",
      "text": "An absolute disappointment. The trailers looked awesome, as did some of the artwork for the movie but instead we get this messy let-down movie that contradicts itself, is full of bad jokes, gender stereotypes ( you damn millennial and gen z kids), age-shaming ( constantly. the never let up on calling Lightning this throughout the movie) and basically retires Lightning McQueen for this Scrappy-do/Mary sue like character Cruz (who looks like a big mouthed house-car, has to be given everything, y'know confidence, training, her wins and half-asses her way to stardom), who is to be the new face of the franchise. Well sorry Pixar but I highly doubt you'll have much of an audience for the next Cars movie after this one. The movies beginning had McQueen lose out to all these digital cars (who never would have been in a NASCAR race) and crash (this is pretty horrific looking). He then decides to give racing a go again but his new trainer, Cruz, is so goddamn useless that it's almost painful to watch all the constant embarrassment and humiliation Lightning has to suffer from her. He eventually has to make a deal that will let him continue to race, if he wins, but has to take cruz with him. Big mistake! The movie goes from being a comeback movie to CREED....you lied Pixar....you lied. The rest of the movie is predictable plot lines/montages of Lightning training but actually training cruz as well and at the final race, where he does really good, puts her in to give her a chance at racing because women can't do it themselves y'know ( I am being sarcastic here). They can only get their chance if a guy gives it to them. Plus Cruz, who is not a pro racer or expert or anything, wins the other half of the race and everyone's like \"Yay! a girl won! look look look!!!!! \"Yes Pixar, we are very much aware we can race and win at things, thank you. Blah...it's all just message after message and disappointment. I really cannot see kids going out and asking for Cruz toys (girls as well as boys) after this movie. Oh! And it earned Pixar back, after production costs, 134 million less than Cars and 154 million less than Cars 2. That says something alright about this."
    },
    {
      "rating": "0",
      "text": "I had very low expectations for this POS movie but it was still so much worse than I thought it would be.  They made 3 of these horrible toy commercials but only one Incredibles."
    },
    {
      "rating": "6",
      "text": "Although I found it to be an ever-so slight improvement over the second film that we'd all love to forget even happened, unfortunately, that isn't saying much for the case of this third outing. Granted, the film does bring a few decent aspects to the table that keep it from just barely not sinking to the level of the second film. For one, it doesn't even mention the second film or contain a single character from that one at all (thankfully). Second, it does something that truly surprised me in a rather good way. Paul Newman, who voiced Doc Hudson in the first film back in 2006, and also sadly passed away two years later in 2008, had his voice featured in this film from recorded dialogue from the first film that went unused. Therefore, one of my favorite aspects from the first film was focused on more, which was Newman's voice talent and Doc Hudson's relationship with Lighting McQueen. That was truly a pleasant surprise for me that I so wish would've been enough to redeem the rest of this film for me, because aside from these positive standouts that I've mentioned, the rest of the film felt very uninspired and lazy, especially story-wise (if you've seen Rocky 3, you've basically kind of already seen this too). Overall, its few positive aspects, as well as the endearing and final return of Newman's voice talent made this a decent comeback effort from Pixar on behalf of the embarrassing second film, but it simply wasn't enough to save the rest of the film and its story unfortunately."
    },
    {
      "rating": "7",
      "text": "Тачки 3- добрый, красочный мультфильм студии Pixar. Этот мультфильм нужен был для продажа игрушек, которые приносят много денег студии. Главные персонажи не вызывали у меня каких-то эмоций(спасибо, что Метра убрали на второй план, он всегда всех бесил). Сюжет прост и прямолинейный нет ничего выдающегося. Юмора почти нет, только один раз за весь фильм. Самое лучшее, что в это  мультфильме есть это графика, вот она реально красиво и выглядит, как-будто настоящая. На фильм можно сходить с детьми, им мультфильм понравится, а взрослые будут скучать на фильме."
    },
    {
      "rating": "2",
      "text": "This movie is for soccer moms that think global warming is propaganda. I don't even think children are interested in this series anymore because not only was it never great, but now that we are three movies in the abysmal writing and horrible jokes are becoming ever so apparent."
    },
    {
      "rating": "7",
      "text": "Cars 2 is my least favorite Pixar film of all time and I'm happy to say that this recent feature of the Cars franchise is a vast improvement.  It isn't as good as the first film, however.  Thankfully we do get to see Radiator Springs again, if briefly.  The movie doesn't have a true Villain, just a snotty newcomer who we only see during the races.  Speaking of the races, they are thankfully short and not drawn out.  The movie is mainly about Lightning McQueen facing retirement and passing the baton to another racer.  It is also refreshing to see an animated film that is geared towards boys.  75% of animated films are made for little girls these days.  Not to say that both genders won't enjoy it, just relieved it's not another Princess movie."
    },
    {
      "rating": "7",
      "text": "The movie is technically well made and a pleasure to look at, but the story isn't quite up to par with the original Cars movie. It's sorta better than Cars 2, but not a lot. What bothers me most about the movie is the ending, which is frankly so unbelievable it hurts. Spoileralert......McQueen retiring and his new trainer, who always wanted to be a racer but couldn't handle the pressure, is now suddenly better than an entire new generation of racers, due to what exactly? Stealing McQueen's spark? I'm sure the message they wanted to bring is valuable, but when even the kids are a bit down because Lightning will never race again they could have done things differently for a better movie experience."
    },
    {
      "rating": "5",
      "text": "Better than \"Cars 2\", but that's not much of an endorsement. This series peaked at the first film, which I consider to be lower-tier Pixar itself. I was pretty bored with this one, save for the somewhat-exciting final act."
    },
    {
      "rating": "7",
      "text": "Si bien es cliché y es predecible, la película me sorprendió con una historia excelente y una gran animación."
    },
    {
      "rating": "10",
      "text": "In the wake of the noisy misfire that was 2011’s Cars 2, the Pixar pit crew ran the diagnostics and were able to pinpoint the winning formula of humor, heart and action (along with an added dose of Route 66-informed nostalgia) that made the 2006 original such a sweet ride.They all make a welcome return in Cars 3, but, while visually dynamic, Lightning McQueen’s newest challenge still feels out of alignment with a languid end result that lacks sufficient forward momentum.Given the enduring good will generated by the first installment, the franchise, which has to date grossed well over $1 billion and sold countless billions more in four-wheeled merchandise, should expect similarly strong, school’s-out business, even with the picture’s less-than-zippy performance."
    }
  ]
}