{
  "id": 772,
  "title": "Cars 2",
  "starring": [
    "Larry the Cable Guy",
    "Owen Wilson"
  ],
  "runtime": 106,
  "genre": [
    "Animation",
    "Family",
    "Adventure",
    "Comedy"
  ],
  "description": "Star race car Lightning McQueen and his pal Mater head overseas to compete in the World Grand Prix race. But the road to the championship becomes rocky as Mater gets caught up in an intriguing adventure of his own: international espionage.",
  "releaseYear": "2011",
  "mpaaRating": "G",
  "imageUrl": "https://image.tmdb.org/t/p/w500/okIz1HyxeVOMzYwwHUjH2pHi74I.jpg",
  "categories": {
    "plot": 8.0,
    "acting": 8.434782608695652,
    "ending": 7.0,
    "soundtrack": 8.333333333333334,
    "cinematography": 7.0,
    "familyFriendly": 7.4,
    "funny": 8.272727272727273,
    "action": 8.523809523809524
  },
  "reviews": [
    {
      "rating": "5",
      "text": "Lets start of with the good things. The action sequences are well done and there are a lot of them. And the visuals are top notch. It really does feel like youâ"
    },
    {
      "rating": "7",
      "text": "This was a heck of a lot better than what people make it out to be. I can see why people don't like this one as much as the first, but I was able to enjoy it. It does feel like it should've been a spin-off movie, rather than calling it \"cars 2\" but it's still enjoyable."
    },
    {
      "rating": "10",
      "text": "My 3.5 year old boy loves all Pixar movies, as do I. Cars 2 should be rated PG, not G, as it IS very violent. Guns, explosions, and killing/death are what the entire movie consists of, oh yeah and racing. We are trying to limit the amount of violence/weapons our son intakes. If you remember, even in Toy Story, Woody never had a gun in his holster, always empty. I don't necesarily mind that Pixar went this route cause it's not there job to cater to young children. I am however disapointed that the MPAA approved a G rating for this film when it CLEARLY should be PG"
    },
    {
      "rating": "8",
      "text": "A good exciting cool car action movie with gadgets and guns,exciting chases,spy action and Big explosions,better than the original.I bet they are going to make a third cars movie for a secret villian.My favorite part is when mater says dad-gum and then the computer activates the terminator guns and shoots crazlily, it was funny.and my other part is the beginning thats the most start for a spy named Finn Mcmissle,who does gadgets,guns and car-fu.that was like my favorite action scene in the movie.My other funny scene is that mater tastes the wassabi and his tongue was burning off-screen."
    },
    {
      "rating": "9",
      "text": "I read the reviews here before I decided on going for the movie. Judging by the low score here, I assumed it would be a pretty flat movie but I was pleasantly surprised! Not only is this movie as good as the first, in some respects its even better. The only reason I would suspect that this movie got a low score here is that its a bit too involved to be a pure kiddy movie. Its actually got all the pizazz of a James Bond flick and plenty of laughs thrown in as well. Sure the dialog could be better in some places, but its really not all that bad a film overall."
    },
    {
      "rating": "10",
      "text": "Cars 2 is basically the first Cars with a sprinkle of The Fast and the Furious. This was an experiment that Pixar has never done before and I respect that. Just because Cars 2 isn't a heartwarming Toy Story 3 doesn't mean that it is bad. Cars 2 breaks the overused tradition of other Pixar films and thats why I don't think it is as bad as the critics say it is."
    },
    {
      "rating": "10",
      "text": "Why do people hate this movie, I mean sure its not Pixar's best but it's still great, its a funny spy movie with likeable characters, I mean how could people not like the characters. What's wrong with a spy car, a race car, and a tow truck. This movie is not Pixar's worst movie"
    },
    {
      "rating": "7",
      "text": "Okay, it was a fairly decent movie. But the dream company, Pixar, didn't add the warmth and feeling. The first I didn't care for much, but it had that love in it. Cars 2 was aesthetically marvelous, but it felt like a small glove. The move didn't feel right. It did not have the Pixas shimmer and secret ingredient, love."
    },
    {
      "rating": "9",
      "text": "I love First Cars and Second Cars and I hard to say that the cooler , but both games I put 9/10 . In Cars 2 there is a good storyline and this movie is a good sequel for Cars . I am waiting Cars 3 . I watched this movie in 2013 and it was very interesting to me . In this game a lot of cool characters . 9/10 . Very good and amazing cartoon ."
    },
    {
      "rating": "6",
      "text": "Overall, it is a good animated movie. But this is not what I expect from Pixar. Complicated plot, occasionally cheesy voice acting and surprisingly basic presentation. The animation as always is fantastic. But still, I am very disappointed with Pixar. I expect a lot more from them. I hope they will redeem themselves in their next films................."
    },
    {
      "rating": "10",
      "text": "Wij vonden de film hartstikke leuk! De hele klas heeft ervan genoten! We hopen op een Cars 3!! De verhaallijn had misschien iets simpeler gekund, maar Cars blijft Cars! We zijn 3 keer naar de bioscoop geweest, en zodra de film op dvd uit komt rennen mijn kinderen meteen naar de winkel!Jammer dat Cars 3 door sommige wordt afgekraakt!Zijn gewoon jaloers!Cars blijft speelgoed verkopen al 5 jaar lang, wie doet jullie dat na??!!Be proud!!And good job!!"
    },
    {
      "rating": "8",
      "text": "Lightning McQueen (Owen Wilson) is offered a placement  to race in a new international race circuit involving the greatest style of race cars. However, there is one specific race car McQueen desires to beat, the Italian Francesco Bernoilli  The hardly see eye to eye on the race track. The International races are located at Tokyo, Italy and London. Sadly, Mater has a problem. He must take part in a mission to stop the evil villains destroying the best cars with their lasers.Mater appears to have the spotlight throughout, unlike McQueen in the first installment. We see the rusty truck as a sidekick to McQueen as he sets out to be the hero and becoming a spy along with Holley Shiftwell (Emily Mortimer) and Finn McMissile (Michael Caine) whose voice acting is superb. A few action scenes reminiscent of James Bond films appear in the film which are very enjoyable and keep the older audience from getting bored. The moral message to this film is â"
    },
    {
      "rating": "7",
      "text": "Okay, let me re-explain what you probably know; Cars 2 is widely being considered as Pixar's worst. This is true. It's also being widely considered as a bad film. This is not true. I personally believe this is another great film from Pixar, it just plunges a little more into the Dreamworks tub. The story revolves around Mater, rather than Lightning McQueen, a mixed decision in my opinion. On one hand, Lightning McQueen is a bland character, with little personality. And Mater, while much more interesting and defined, is also extremely one dimensional, and that really shows when he becomes the star of the show. Mater is mistaken as an American spy by two secret agents, Flinn McMissile and Holly Shiftwell. Mater then takes part in many missions, while the two secret agents have no idea he's just a regular tow truck. In the meantime, Lightning McQueen is on a World Grand Prix in hopes of beating the **** Francesco. There's a bit more to the plot than this, but that's the gist of it. The film certainly looks like a Pixar film. The animation is easily Pixar's best; appearing more detailed than that of Toy Story 3, and the various race/spy scenes give the movie a chance to show what it can do. Some things look impeccably real (in the last 20 minutes of the film, take a look at the trees). The film sounds like a Pixar movie too. The musical soundtrack is performed masterfully by Michael Giacchino. Also, the voice talents have been selected carefully, just as in all Pixar films. The original voice actors are back (though due to the death of two characters, Fillmore's voice has been replaced and Doc is deceased), though most of them get few appearances. Also, John Ratzenberger (who gets a role in every Pixar film) has an infestimal role in this film: only two lines. So, the film sounds and looks like a Pixar, but it doesn't feel like one. Compared to the other Pixars, the story is weak and disappointing. Also, there is none of the heart and emotion that made the other Pixars so lovable. There's little adult-kid balance, so most parents won't be watching with their kids, which is completely opposite of other Pixars, where parents may enjoy the film more than the kids. I said earlier that this film is more like a Dreamworks movie. This is because of the lack of emotion, the shallow story, and the kid appeal. Even the humor is a little more Dreamworks oriented, a lot of it being roll-your-eyes kind of humor, and there's even some potty humor. That's not to say you won't laugh; there are plenty of amusing bits, but overall, it pales in comparison to Pixar's previous efforts. Concluding, this is Pixar's worst film, hands down. However, it's still a great film, although flawed. It's certainly not a must see like the other Pixars, but it's good enough. Just don't do this to us again, Pixar: I won't be quite as forgiving."
    },
    {
      "rating": "6",
      "text": "Star racecar Lightning McQueen and the incomparable tow truck Mater take their friendship to exciting new places in \"Cars 2\" when they head overseas to compete in the first-ever World Grand Prix to determine the world's fastest car. But the road to the championship is filled with plenty of potholes, detours and hilarious surprises when Mater gets caught up in an intriguing adventure of his own: international espionage. Torn between assisting Lightning McQueen in the high-profile race and towing the line in a top-secret spy mission, Mater’s action-packed journey leads him on an explosive chase through the streets of Japan and Europe, trailed by his friends and watched by the whole world. Adding to the fast-paced fun is a colorful new all-car cast that includes secret agents, menacing villains and international racing competitors."
    },
    {
      "rating": "6",
      "text": "I stayed there until fame Lightning McQueen , and Mater the star is wearing, but hey, the scripts change, for me the movie is very good , but say it is the worst pelicua PIXAR That being so I do not more you put a 5."
    },
    {
      "rating": "6",
      "text": "Like the first, this was not great but not very bad either. The transition from the \"Hot-shot comes to small town and learns life lessons\" theme of the first to a spy movie was a bit odd but there were still some entertaining gags. Mater was a great part of the first so it was nice to see him get more screen time. And it was clever to have the James Bond parody be an Aston Martin but it was a bit weak in parts. Perhaps this wouldn't be a problem if we hadn't come to expect so much from Pixar but we have. Who knows-maybe Cars 3 will be better. Maybe it'll be a third time lucky situation. But the movie does have it's charms, it's by no means bad. Just a bit disappointing compared to most Pixar films."
    },
    {
      "rating": "7",
      "text": "I enjoyed this film more than the first. I love that spy story where Mater involves. It's a funny film! Why too many dislikers... anyway I'm not a huge fan and I'm not really waiting for the 3 because I don't think it's necessary."
    },
    {
      "rating": "10",
      "text": "Pixar is the standard bearer for animated movies that appeal equally to children and adults, and this is no exception. There has yet to be a Pixar film that doesn't make more than $100 million or score a devoted following from both critics and audiences. The animation is gorgeous, the action sequences crisp, the voice acting impeccable, and the inside jokes funny. Cars 2 is not a masterpiece when stacked up against the Toy Story sequels, but it's a fun summer spectacle that will make kids think about what it means to really be yourself, even when there's pressure to change.Mater is now the protagonist, and the world is the setting; while that expands the action and the automobile humor (geisha cars, the Queen as a vintage Rolls, and Prince Wheeliam as a Bentley), it does limit the amount of time that we spend with our old friends from Radiator Springs. Caine and Emily Mortimer are perfectly cast as the British intelligence agents who mistake Mater for an American spy, but in the end, this is Larry the Cable Guy's shining moment."
    },
    {
      "rating": "10",
      "text": "Ratatouille, Wall.E, The Incredibles, Finding Nemo, Monsters Inc, Up: the list of beloved Pixar movies is long. One of the few that’s almost never cited is Cars. But John Lasseter’s one-dimensional and visually sub-stellar 2006 tribute to American auto culture did rake in an awful lot of merchandise money. Its reboot, Cars 2 – is equally so-so.The last film was a tribute to Route 66, the American west and a 1951 Hudson Hornet. It was set in Radiator Springs, a place that its hero Lightning McQueen (voiced by Owen Wilson) dismissed at first as “hillbilly hell” before learning to love its decent, old-school ways. In Cars 2, Lasseter and co-director Brad Lewis have gone down the export route, relocating the action to Italy, Japan and swinging London.McQueen heads to these cities to compete in a World Grand Prix organised by oil tycoon Miles Axlerod (Eddie Izzard) as a showcase for his alternative energy business. He’s accompanied by pal Mater (Larry the Cable Guy), a rusty pick-up truck, who initially embarrasses him, but later, when it turns out that a plan has been hatched to blow up the champ, saves him with feats of bravery and ingenuity."
    },
    {
      "rating": "7",
      "text": "I kind of like it. It's not that bad. The plot sucks but once you look past that ..yeah. Pretty fun."
    },
    {
      "rating": "8",
      "text": "Now this movies had (still gets)some pretty bad press and reviews, and I can see why but it's really not all that bad. Pretty good movie actually with beautiful animation, good music, interesting scenes and places, international race cars, Lightning McQueen and the it showed more of the Car world.The spy stuff and the plots involving oil, new fuel types, car discrimination and friendship might go over some kids heads but it is also rather interesting if you study it more. The only real issue that I have is with the character, Mater, himself. I am not a big Mater fan, of his personality type or humour but I can see why he appeals to kids and others, so maybe that's why he's the real star of this film.Basically the film revolves around a plot to turn people (the cars) towards a new fuel type that's supposed to be better for them, and an international race is there to promote the fuel. However, the new fuel is really just gasoline and by making the new fuel look bad, by hurting the racers using the fuel, the cars behind all this hope to turn people back to oil ( there's a huge new secret oil field discovered by these guys early o in the film)and get rich and powerful. The cars doing this are 'lemon' cars or ones who are not well made and break down frequently and get made fun of.So they feel rather angry at the world for their poor treatment.There are also spies (the good guys) from Britain, America, etc ( A rather James bond like one and a pretty purple Jaguar type)and Mater basically gets mixed up in all this whilst Lightning races against a heap of other racers, though this really isn't paid as much attention to as it should have been. It all ends with mater uncovering the lead villain, making up with McQueen after an argument and has messages like be yourself and accept others. Good messages for children I suppose. The movie made me smile and laugh with it's over the top nonsense and beautiful animation, as well as amusing my nephew and nieces. The main issue though (with many people) is still Mater and his bumbling ways, the lack of attention to the races and Lightning, plus there was some violence like the American spy getting blown up and the racers engines blowing out from a lazer but I have seen worse. Anyone remember Littlefoot's mother being injured and dying? Now that's painful and scary cartoon violence. There was also the fact that Lightning doesn't win in any major races and the other characters from Radiator Springs felt like they were put in just to fill space.plus for a movie promoting international race scenes they only went to 3 places, whilst if you look at the Cars 2 artbook you can see that various other types of races (endurance, outback and ice) were planned, in a variety of places like Russia and Germany. Why Pixar didn't focus more on or include these is beyond me. It would have appealed to many to see more races, race types and countries I think and less of the Mater/spy stuff.Still I do like the film and it isn't a depressing disappointment like Cars 3 is, so 8/10 for me. 2 of for Mater I'm afraid though."
    },
    {
      "rating": "6",
      "text": "This is not a bad movie, but it may be the first misfire from Pixar. Its effects are dazzling as ever, but unfortunately, it's not enough to conceal the weak and questionable plot."
    },
    {
      "rating": "10",
      "text": "Clear, concise, intelligent and humorous - such is Cars 2. Cars was never my favorite Pixar, but coming out of the theater after seeing the sequel, I found myself smiling over a clever, well-thought, simply entertaining film. There is no deep, emotional story, but for entertainment this is by far extremely enjoyable. The humor is intelligent (not crude, suggestive or shallow like so many other animated films), the story moves at a solid, easy to understand pace and the characters are engaging. Mater is a character that is easy to root for with his positive outlook on life and his compassion toward everyone around him. When it comes to giving a good example of a nonjudgmental attitude, Mater is hard to beat. Finn McMissile has many of the typical spy characteristics, but goes beyond what we stereotypically think of the \"James Bond\" character by showing kindness and respect toward others. He openly admits his own shortcomings/need for help, while remaining debonair through it all. He doesn't even show the womanizing side so easily associated with the \"spy world\" and instead shows his female counterpart a great deal of respect.  Kudos to Pixar for their work on these characters. There is lots of \"eye candy\" in the depth of animation and the creative little touches to background motifs that make this world truly and mechanically unique. After seeing the film numerous times on various screens, I am still catching the little details placed in the film - all of which have never been of any suggestive nature inappropriate for a general viewing audience. This film also allows us a chance to look at some of our little idiosyncrasies in a fun way and gives positive messages such as friendship, compassion and honesty. While not for everyone - a caution to families with young children due to intense action sequences and suggested deaths - for older children through adults, Pixar's continued show of intelligent film making sets it apart from all other animation companies regardless of where the awards land.  As for what I witnessed during my various visits to the theater for this film, everyone was fully engaged - laughing, cheering and generally having a good time. We all left with smiles, which I think says a lot for the film. My money will remain on Pixar."
    },
    {
      "rating": "8",
      "text": "I honestly don't understand why this movie has taken such a beating. Personally, it's my least favorite Pixar movie, and it does have its share of problems, but I still enjoyed it. Why? Because I knew it wasn't meant be a tear-jerking masterpiece like Up or Toy Story 3 - it was meant to be a simple, fun, summer comedy. And it succeeds at that. It doesn't have to be emotional or profound in order to be good. It's nice to take a break from all that crying for a change! (Not that there's anything wrong with Pixar movies making you cry.) Sure, it's not Pixar's best by a long shot, but just because it isn't the next WALL-E or Toy Story or Finding Nemo doesn't mean that it isn't good. Kudos to Pixar for branching out, trying something different, and proving that they still don't know how to make a bad movie! 8/10."
    },
    {
      "rating": "10",
      "text": "I don't understand why this has low scores?  The movie was great, watched it in 3D with my daughter and we both loved it!  The locations, cars & story was great!"
    },
    {
      "rating": "10",
      "text": "Loved it, found it the best out of all of the other films. It has a lot of action and is just plain wonderful. I really really hope they make a new one, Cars 3."
    },
    {
      "rating": "6",
      "text": "Cars 2 is Pixar's worst film to date, but that doesn't mean it's bad. It is a good film, but not a lot more, as some of the comedy isn't very funny and the plot isn't exactly top of the line. My main complaint of the film however is that it feels disjointed, giving you no time to get adjusted to \"Lightning's\" storyline, while also at times not giving you enough time to really get into \"Mater's\" storyline. It's odd that they shifted the focus of the main protagonist to Mater, which, while isn't necessarily bad, some will find it very off-putting. The film is fun, and this is where it holds up, making it a 6/10, also it has a good plot twist that I did not see happening at all. All in all, it's a fun film that shouldn't be overlooked, but it should really be called something like \"Cars: it's Materin' Time!\" as the story revolves around Mater, giving a fun Spy based film with explosions and everything, but certainly no Pixar masterpiece like we should be getting given their track record."
    },
    {
      "rating": "10",
      "text": "Ok this movie was hilarious, stop hating on Larry the cable guy. he maybe low brow but he's funny ok? stop trying to be so sophisticated and laugh you stuck up jerks. as for the violence and death of CARS!!!! its rated PG for a reason morons, it stands for Parental Guidance, which mean you guide your child into the theater and if they don't understand something you do your best to it explain to them when the movie is over. it is your responsibility to screen what your children watch NOT DISNEY/PIXAR. they have done their part by saying. \"HEY, GUESS WHAT? THIS MOVIE IS ABOUT SPIES. SPIES SOMETIMES KILL PEOPLE. THAT'S WHY WERE PUTTING A PG RATING ON THIS MOVIE\" just get over your selves you jerks."
    },
    {
      "rating": "6",
      "text": "While Cars 2 is visually stunning, it is the first Pixar film to feel a bit empty at its shiny center.  Mater dominates the proceedings (a major part of the film's problem since he works better as a supporting player) unwittingly working as a spy while Lightning McQueen races in the World Grand Prix.   This is the first Pixar film that seems geared almost entirely for kids which is a bit of a disappointment.  Still, there is enough inventiveness and chuckles to makes it a tolerable vieweing experience."
    },
    {
      "rating": "8",
      "text": "While not the best Pixar film, still better than most animated films, and thourghly enjoyable\rThe haters rating it a 0 just because they want to see pixar fall is pathetic, nothing should deserve a 0"
    },
    {
      "rating": "8",
      "text": "\"Cars 2\" does not meet the normal standards of other Pixar films, like \"Toy Story 3\" or \"Wall-E\". However, \"Cars 2\" is a major improvement from the first one. The soundtracks are awesome and resemble those of real spy movies. Overall, \"Cars 2\" is packed with action, but contains jokes that are lame and few boring, tedious scenes. Although \"Cars 2\" does not meet Pixar standards, it does a better job than other animated films. Yes, \"Cars 2\" is not the best movie, but it is a wonderful movie to watch during the summer and blow away your heat and sweat. The extra price for 3D is worth it and the visual effects are stunning! \"Cars 2\" is a disappointment, compared to films like \"Toy Story 3\" and \"Up\", but still manages to make the audience packed with action."
    },
    {
      "rating": "10",
      "text": "i loved this movie it was so beautiful in the lesson it taught that friends are friends and you cant expect them to change and i cant believe the critics hated it so much saying ooh it ventured from lighting mcqueen well i thought that cars 2 was great the way it was matter is the character most kids love not because he was a main character  but because hes funny over all i would give it a 90 out of 100"
    },
    {
      "rating": "8",
      "text": "\"FINALLY! IT HAPPENED! A PIXAR FILM HAS RECEIVED A \"ROTTEN\" ON ROTTEN TOMATOES!!! WE CAN FINALLY CELEBRATE!!!\"Okay, fine, you can have your moment, guys (don't worry, that's the last time I'll bring them into this, because I don't want the joke to stale out). After years upon years of critical success, Pixar's first true \"misstep\" arrived in 2011 in the form of \"Cars 2,\" the sequel that not many were really craving in the first place, but it was made nonetheless and it became the first Pixar film to earn a \"rotten\" score on Rotten Tomatoes. Harsh, I know. All things considered, though, I personally enjoyed the film. I get why people didn't really like it (it wasn't the most poignant of Pixar films, nor was it the film with the most heart), but all in all, it was a really fun ride with some brilliant animation, exciting action scenes and good voice acting. Sure, it's silly, it's kiddy and it's not what we're used to out of Pixar, but \"Cars 2\" is still a pretty entertaining romp for the whole family."
    },
    {
      "rating": "10",
      "text": "This film had a very compelling story, a relatable cast of characters, and beautiful settings. The spy plot complemented the story very well, I thought the shift of focus from McQueen to Mater was done perfectly. I really liked characters like Francesco and Finn. The film begins with an exciting and suspenseful scene on an oil rig, letting us know the character Finn will be, and giving us a taste of what the movie will be like. I also like the scene with the \"Lemon Party\" It was a very crucial and important scene that was very intense serious and suspenseful, this was complemented by Maters happy-go-lucky attitude. The film ends with Mater getting knighted in honor of his efforts to save London. This had to be one of the most beautiful moments in film history. After that, Mater and the gang went back to Radiator Springs, completing the hero's journey. In my words, Cars 2 has to be one of the best films is Cinema History"
    },
    {
      "rating": "8",
      "text": "There are some thoughts that people will think that they gonna hate the sequel, and so does the original that the audience won't like the premise of Cars. I know people likes it or hates it, but I have to say that Cars 2 was really fun to watch and it's very exciting adventure better than the first one. The only thing that I really like in this sequel is secret agents, countries, action, adventure, and new fancy places. That's all I really enjoy myself watching this. Anyways, the story is more better developed that they make a new idea for the sequel that Lighting McQueen and Mater are going to the international world cup to win the race and then there are two secret agent spies that are facing with the bad villain who wants to destroy the cars who filled with oil. The voice acting did great and I really enjoy the new characters that they can bring more fun and more exciting to be decent and cool. The animation is pretty cool and the action scenes were awesome. I really like when the cars are chasing around with guns, explosions, and high-tech gadgets in everywhere that they race. But for my opinion, that I take it back when this movie will not be exciting as now and there's more that they came from where people think it's gonna be suck, so it's nice to make a better sequel once again for making a better cars animation. They know exactly what they can do for it and those animators are having fun for it. So that case, see this movie and see how fun that this movie will take more advantage for better animation, if you think so."
    },
    {
      "rating": "4",
      "text": "My 3.5 year old boy loves all Pixar movies, as do I. Cars 2 should be rated PG, not G, as it IS very violent. Guns, explosions, and killing/death are what the entire movie consists of, oh yeah and racing. We are trying to limit the amount of violence/weapons our son intakes. If you remember, even in Toy Story, Woody never had a gun in his holster, always empty.  I don't necesarily mind that Pixar went this route cause it's not there job to cater to young children. I am however disapointed that the MPAA approved a G rating for this film when it CLEARLY should be PG."
    },
    {
      "rating": "10",
      "text": "Read some of the reviews and I'm suprised by the responses.  The movie was great in my opinion.  My young son loved it.  The audience, including myself, laughed out loud continually throughout the movie.  Overall it was at least just as good as the first movie, if not better.  As usual pixar runs away with superior animation.  There were lots of humor designed for kids and adults.  This time around the movie was more centered around Mator rather than Mcqueen.  I am going to go against the grain here and say that the plot and storyline were well laid out and put together quite well.  If you like Pixar and the first cars movie, there is no reason you will not like this movie."
    },
    {
      "rating": "10",
      "text": "I don't understand where all the hate comes from. This movie rocks! It's hilariously funny, it has a powerfully deep message, the characters are so lovable and relatable, and the movie is just so much fun! I thought the first Cars was better, but still loved Cars 2. Ignore the losers on Rotten Tomatoes! Cars 2 is definitely worth seeing (maybe even twice)!"
    },
    {
      "rating": "9",
      "text": "Very good sequel to a great animated film."
    },
    {
      "rating": "10",
      "text": "I saw Cars 2 expecting it to be amazing since Cars was my favourite childhood movie and it was amazing. It was the best Pixar, has the best soundtrack for a pixar and one of the best movies I've ever seen. This was the sequal to my favourite childhood film and it was amazing!"
    },
    {
      "rating": "4",
      "text": "Truly the weakest pixar movie.It emphasised on random subplots,it was entertatining but i expected alot more!!! plus there is no racing this time so...yeah"
    },
    {
      "rating": "4",
      "text": "I thought Pixar was better than this. I thought they were above doing cashgrabs. Well, looks like they've been corupted. Cars 2 is a movie that's made only for the money, and it shows. Yes, it's got great animation, good voice acting, and fun action, but everything else is so below Pixar's and even Dreamworks's level. It's very unfunny, Mater was so annoying, the story was so boring, thrown together, and hollow, and the whole movie is just a very mediocre and boring animated movie. C'mon Pixar. You're better than this crap."
    },
    {
      "rating": "6",
      "text": "The movie is overly creative with a complex story-telling that is not quite for the kids to understand. I know that Pixar can do better, and I hope they will."
    },
    {
      "rating": "5",
      "text": "There is absolutely NO way this film is a zero. Yes, it lacks the heart of the first one, yes Mater is the main character, and yes Larry the Cable Guy is an awful comedian, but this movie is still somewhat entertaining. For the record, if you hate Larry the Cable Guy, you probably will hate the movie as he gets about 80% of the screen time. There are a lot of things that kids will not get, but both of my daughters, 7 and 4, enjoyed it. It got a few chuckles out of me, and parts of it were pretty good. I actually really enjoyed how Pixar poked a little good natured fun at the James Bond franchise while trying to weave a story kids will enjoy. Still, rent it on DVD when it comes out, don't spend your money at a theatre to see this. As to the people who say the animation is terrible, I think you might have seen a different movie. I saw it in IMAX 3D and was blown away by the animation. The street scenes, racing scenes, and backgrounds are amazing."
    },
    {
      "rating": "7",
      "text": "Cars 2 does not have the same flare or attachment to the story and characters as you would expect for a Pixar movie although the solid spy story and well used car puns keep this movie enjoyable. The mane problem I found with this movie is that it was so focused on it's story telling it forgot about the characters in it. While one watches this movie they will feel very distant from the characters but they will recognize the good story and it's complexities."
    },
    {
      "rating": "9",
      "text": "To all of you bashing this movie...REALLY!? Lighten up a bit, ok! Take a moment and think about who this movie is made for. It's not made for you, it's made for your kids. Pixar has set the bar very high, no doubt, but when it comes down to it, they're movies are made for children. I just have to laugh at how people can be angry over a movie that is about talking CARS. Are you also going to tell me that movie is just too unrealistic!? When you see this movie, you should judge it by your children's faces afterwards and not by your issues with the plot or anything else. My 5-1/2 and 4 year old boys LOVED this movie and SO DID I! We will go see it again and I have no doubt it will be even better the second time."
    },
    {
      "rating": "6",
      "text": "This isn't bad, it's just not that good. Way different feel to the first, and pretty much feels like a cash grab. Not for younger kids, but not really sure who would enjoy it!"
    },
    {
      "rating": "9",
      "text": "I actually enjoyed it. It brought back memories of the first, one of my favorite movies. I enjoyed the story, voice acting, action, and humor. It was great."
    },
    {
      "rating": "4",
      "text": "A VHS copy of the musical \"Hello, Dolly\" is the robot's most-prized possession. \"WALL-E\", a lonely earthbound portable garbage compactor, makes a recording of the duet \"It Only Takes a Moment\" because the song moves him, inspiring the machine to hold his own hand, in imitation of the characters who have fallen for each other, from a long-ago past when the planet was habitable. Nothing green grows on earth anymore. The detritus of human civilization, bearing a color scheme that's nearly monochromatic in its brownness, is all that's left. Overrun by trash, entire populations boarded vast spaceships, leaving WALL-E behind with the endless job of minimizing waste into stacked cubes, while the planetary refugees floated around space in what are, essentially, movable countries, displaced indefinitely from their homes. But what does hardware know about love? How can something made out of microprocessors and integrated circuits develop a consciousness? At what point in time did \"it\" evolve and become a \"he\"? It's only a matter of time before robots like Eve(as in Adam &) supplant a human race made morbidly obese by generation upon generation of insentient living. Whereas \"WALL-E\" presents a dystopian take on our extrapolated planet that's easily identifiable, \"Cars 2\"(and \"Cars\"), obscures the nightmarish elements of a four-wheeled society through the audience's supposition that this largely inorganic world is an alternate one. Under closer scrutiny, \"Cars\" starts to look more and more Cronenberg-ian, in which the pornography of auto fetishism in \"Crash\" actually gets put into practice. Let's meet the Flintstones again. Similar to the animated series, with its parodic names like Rock Quarry and Cary Granite to corroborate the Jurassic Period setting, both films use car-centric names(Bob Cutlass, Brent Mustangburger) as a means of harmonizing its metal beings with this variant earth. But when it comes to places, in which Bedford becomes Bedrock,  the conversion process stalls in \"Cars 2\" stalls, leaving the names of Paris, Tokyo, and London in its original incarnation, and furthermore, the landmarks of the cities(for instance, the Eiffel Tower) remain unaltered. Where are we, exactly? In \"Planet of the Apes\", the astronaut learns that he traveled across time, not space, when he discovers Lady Liberty in ruins, decapitated and rusting, along the shoreline of what turns out to be the Atlantic Ocean. Dr. Zaius' best efforts to perpetuate the long-standing notion of simian superiority is undermined by a chimpanzee, the archaeologist Cornelius, who unearths artifacts which proves that apes evolved from man during his cave excavations in the forbidden zone. \"Cars\" shares with \"Planet of the Apes\" the same conspiracy: the suppression of evolution. While remaining silent on the subject of man, despite the cars' admission that dinosaurs existed, they give themselves away, therefore deeming full disclosure of the timeline a moot point. Unlike Dreamworks, whose \"Shrek\" films employ a lot of pop culture references, Pixar avoids such anachronisms(the post-modernism of pastiche) yet in \"Cars\", Kenny G.'s \"Songbird\" scores a cheap laugh when a car gang puts Mack to sleep with the easy-listening jazz, causing the truck to lose his precious cargo(Lightning McQueen). This instrumental, like the videotape in \"Wall-E\", proves that man existed. Quite possibly, he's the missing link. Bolstering this theory, a VW bus, an auto-hippie, without any spoofing appellation, names Hendrix, after a military jeep voices his displeasure with the metalized version of \"The Star-Spangled Banner\". This is our earth, not some near-identical equivalent, like the one in the Tim Burton remake, where the film ends with a man staring aghast at the Lincoln Memorial, augmented with ape-like features. These cars are partly human. Vestiges of their humanity can be glimpsed in their faces. In addition to the eyes, Lightning has a tongue, while Mater sports buckteeth like a hayseed. And somewhere in the recesses of their \"brains\", these evolved vehicles remember sex. In \"Cars\", Mater throws Lightning into a homosexual panic as the tow-truck uses his hook on the auto racing car's undercarriage(read; sodomy). Likewise, the spy in \"Cars 2\", as suggested by the double entendre inherent in the name Holly Shiftswell, denotes a woman who was mustard in the sack. Unlike \"Planet of the Apes\", perhaps the conspiracy is an extra-diegetic one. In \"Cars\", Sally waxes nostalgic about Radiator Springs in the fifties. This history runs concurrently with the our timeline. What if she's lying? What if the conspiracy is the film itself, in which the narrators, both omniscient and first-person are fallible? In the climactic race for the coveted Piston Cup(\"Cars\"), a blimp hanging over the stadium reads \"Light Year\". It's a clue. Exactly what year is it in this planet of the cars? Maybe these aren't Anno Domini times."
    },
    {
      "rating": "9",
      "text": "Amazing film Amazing film  Amazing film Amazing film Amazing film Amazing film Amazing film Amazing film Amazing film Amazing film Amazing film Amazing film Amazing film Amazing film Amazing film"
    }
  ],
  "recommendations": [
    "cars_3",
    "planes",
    "need_for_speed",
    "cars",
    "turbo",
    "the_fate_of_the_furious",
    "real_steel",
    "bumblebee",
    "the_good_dinosaur",
    "the_angry_birds_movie",
    "penguins_of_madagascar",
    "incredibles_2",
    "the_angry_birds_movie_2",
    "mad_max_fury_road",
    "the_lego_movie",
    "transformers",
    "pacific_rim",
    "jurassic_world_fallen_kingdom",
    "kingsman_the_golden_circle",
    "cloudy_with_a_chance_of_meatballs_2",
    "teenage_mutant_ninja_turtles",
    "next_gen",
    "the_croods",
    "death_race",
    "skyscraper"
  ]
}