{
  "id": 4798,
  "title": "Cartel Land",
  "starring": [
    "Robert Hetrick",
    "José Manuel Mireles Valverde"
  ],
  "runtime": 100,
  "genre": [
    "Drama",
    "Documentary"
  ],
  "description": "In the Mexican state of Michoacán, Dr. Jose Mireles, a small-town physician known as \"El Doctor,\" shepherds a citizen uprising against the Knights Templar, the violent drug cartel that has wreaked havoc on the region for years. Meanwhile, in Arizona's Altar Valley—a narrow, 52-mile-long desert corridor known as Cocaine Alley—Tim \"Nailer\" Foley, an American veteran, heads a small paramilitary group called Arizona Border Recon, whose goal is to halt Mexico’s drug wars from seeping across our border.",
  "releaseYear": "2015",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/bNNP8IYV1VZKsS5CRavRpRDWV06.jpg",
  "categories": {
    "plot": 8.0,
    "acting": 8.0,
    "ending": 7.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 5.0,
    "action": 7.4
  },
  "reviews": [
    {
      "rating": "8",
      "text": "Two men stood against on the different side of the border for the same cause.\r I was not sure what to expect from this film. By seeing its poster, my mind was very clear that it definitely some serious subject. I'm kind of a person who's not okay with the lions killing a zebra on the animal planet, so I was worried about the clips they might show would be too violence. You know, in the movies everything's fake, and this isn't a movie, but a documentary. That's why I simply disliked 'The Act of Killing'.\r The opening scene was something like 'Breaking Bad', so I thought it might told from the bad guy's perspective about how their network and business would work. But everything drastically changed after the 5-10 minutes of the film. It's where the original story commence.\r The two main characters were introduced who are fighting for a same cause, but separated by the international line. Across the border, under the different society and government, how these two sacrifice their lives in battle against the dangerous networks that threatens the peace is the story.\r In a small town on the southern border of the US, a small paramilitary team headed by Tim has taken such a measure to prevent the all kinds of trafficking. In the same line, Dr. Mireles from the Michoacan, Mexico, goes a bit bigger and stronger by forming a force with the volunteered people with arms to fight for the same mission.\r The film had many the phases, not like the chapters or the episodes, but like a split in the narration to cover the other side of the story. The stories of two men and their undertaking was the prime focus. That's what I thought, you know I felt it was a modern day 'The Magnificent Seven', but in the larger scale of everything. Only until a twist that surprised me, because I was not thought a tale would turn like this.\r \"I believe what I'm doing is good.\rAnd I believe what I'm standing up against is evil.\"\r So what's the twist? I tell you, you know, one man was doing his task all by himself with the help of a few other buddies. On the other side, the man's contribution becomes the nation and international news and publicity. In such circumstance, a fame can turn the destiny of a man on whatever side. It's not like why he did what he had done, but a default human nature.\r I thought 'Heli' was a fictional work. After seeing this documentary I'm not sure how to judge any country by what they depict in their films. Every nation has its flaws, but I wondered why Mexican government was so blind over drug trafficking as shown in this film, if the information was correct. The absence of the federal law enforcement agencies on those disputed places is really a humiliation for the government after this film officially entered the Oscars race.\r I don't think taking action again them won't collapse the nation or the economy. And again, I'm not the right person here to analyse and predict the nation's fate. I've never been to Mexico and I know little about Mexico, but all this only because of the curious to know the truth, that's all. When it comes to the filmmaking, I don't know how it was made.\r Documentaries usually follows with the series of interviews and the recorded clips, in this it was a live shot like any entertainment film. Maybe I must look for director's Q&A for the answers. But something was sure, that production happened at the right place at the right time.\r This a very good documentary film, very gripping and interesting storyline with the characters. I don't watch documentaries on the regular basis and to be honest, I saw it for the Oscars nod, to know what its special. I don't think it is going to win, certainly I can't either rule out the chances as it made this far. Anything might happen, so wait and see.\r It had a few dull moments, lot like a pause in the narration or took a wrong diversion after the first half. But during the conclusion, brought back to the track and clarified many doubts, yet leave a few unanswered. Not for the sake of the Academy Awards nominee, you can give it a try if you feel you're interested to know why the people are taking arms in their hands to fight the evil force that corrupting our society.\r 8/10"
    },
    {
      "rating": "5",
      "text": "I would say about 40% of this movie is relevant, and the rest is 60% of staged scenes, the further I got into the movie even while still interested in the story, I could not help but keep wondering how many scenes were set up, I mean you can tell on a lot of them they were staged and directed, the tell tale signs of people giggling and so on because it's funny to them. It is also very one sided, there is no attempt to interview police, army or local politicians etc. In the end it just paints everyone as looking a little stupid. And as for the Arizona Border brigade, there was nothing exciting or even real looking about the scenes with them in it, hey we are on a hill again, and saying we are not racist but then saying racist things like you wouldn't put two Rottweilers together so why put two races together? So dumb. Feel like I have been conned watching this movie, but I have information from it to go on and learn more about the areas and the people that are suffering. Surprised there is a lack of negative critique from the so called pro's, it's an important subject but a poorly made shockumentary?"
    },
    {
      "rating": "8",
      "text": "No matter what people think about the political correctness of these vigilantes on both sides of the border having to take the drug war into their own hands, this is a valid doc that will make all of us think about how NAFTA shredded Mexican society, and how the drug dealers and gov't leaders moved into the vacuum to produce the drug economy and violence against the people there."
    },
    {
      "rating": "10",
      "text": "I thought this documentary was absolutely amazing.   I have told everybody that I know that they have to see this.   How this thing is not getting tens from every critic in the nation I have no idea.   I kept asking myself while watching the film,  if I was in their shoes what would I have done differently?   I wish I had answers but I don't ."
    },
    {
      "rating": "8",
      "text": "The story in a documentary makes me keep wanting more but then you know movies shouldn't last more than 4 hours so we need a sequel to this or rather watch it more than 4 hours a day."
    },
    {
      "rating": "8",
      "text": "Fascinating movie. This documentary nearly follows the formula of an epic adventure. Common citizens rise up and take arms against their oppressors, led by a normal guy who has just enough charisma to make it all happen. You will witness a wide range of plot twists typically reserved for Hollywood blockbusters. I found myself constantly bewildered that what I was watching could really still happen these days. The end will leave you staring blankly at the credits muttering \"wtf??\" to yourself. This film is eye-opening and will not leave you bored long. High recommended."
    },
    {
      "rating": "6",
      "text": "For a subject that has had plenty of movies, series & doco's made about in recent years, this is one of the duller efforts.Well researched, but doesn't really add anything."
    }
  ]
}