{
  "id": 2322,
  "title": "Case 39",
  "starring": [
    "Renée Zellweger",
    "Jodelle Ferland"
  ],
  "runtime": 109,
  "genre": [
    "Horror",
    "Mystery",
    "Thriller"
  ],
  "description": "In her many years as a social worker, Emily Jenkins believes she has seen it all, until she meets 10-year-old Lilith and the girl's cruel parents. Emily's worst fears are confirmed when the parents try to harm the child, and so Emily assumes custody of Lilith while she looks for a foster family. However, Emily soon finds that dark forces surround the seemingly innocent girl, and the more she tries to protect Lilith, the more horrors she encounters.",
  "releaseYear": "2009",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/b16EjFeHd2AwoYXWUne7DA346pU.jpg",
  "categories": {
    "plot": 5.733333333333333,
    "acting": 4.636363636363637,
    "ending": 5.714285714285714,
    "soundtrack": 7.0,
    "cinematography": 8.0,
    "familyFriendly": 3.0,
    "funny": 2.5,
    "action": 3.0
  },
  "reviews": [
    {
      "rating": "7",
      "text": "Needs little critical thinking.  Just a thriller with horrifying undertones.  Watch this movie when you want a pure and interesting distraction.  Recommended."
    },
    {
      "rating": "8",
      "text": "Case 39 is not scary but has a great Story which will definitely keep you hooked. The acting is great, especially Renee Zellweger has done a great Job but Case 39 isn't better then other Horror Movies out there. If you are looking for a good Horror Movie you should pass but otherwise... I really recommend this one."
    },
    {
      "rating": "10",
      "text": "We've watched a few stinkers lately but this one is a great movie.  The plot had enough twists and turns to keep you guessing and I think we all know a kid with the potential..."
    },
    {
      "rating": "3",
      "text": "The masturbation scene from William Freidkin's \"The Exorcist\" will always be shocking. In a sense, the saying, \"Now I've seen it all,\" should have been retired after 1973 when twelve-year-old Regan MacNeil(Linda Blair) jammed a crucifix in her vagina, while burning moviegoers' ears with a scatological mix of sex and religion that not even Prince would ever dare approach. The projectile vomiting, however, so often parodied, and more importantly, smiled upon, since the bodily function plays a big part in the modern comedy aesthetic, as a result, seems to have lost a lot of its initial shock value because moviegoers don't see the devil's bile anymore, they see pea soup. Lilith Sullivan(Jodele Ferland) eats peas, but that's as far as it goes; she masticates and digests; she holds her vegetables down. In \"Case 39\", it's harder to see the devil inside. As Lilith methodically cuts each pea with a knife and fork, Emily Jenkins(Renee Zelwegger), her foster mother, thinks nothing of it, chalking up the girl's idiosyncratic eating habits as a symptom of her abused past. The devil inside Lilith also knows how to keep its sexual appetite in check; the devil keeps things discreet. Adorning those walls of the girl's old house, the domicile where Lilith was almost cooked alive, trapped inside the oven, put there by her parents, as if the whole family were characters out of a modern-day Brothers Grimm fairytale, are crucifixes, that, as Sheena Easton would put it, never \"spend[s] a night in [her] sugar walls,\" but nevertheless, carries a certain sexual latency, being that the devil would distort the Christian relic's holy significance the first chance he'd get. Naturally, the carefully sliced peas has nothing to do with persnicketiness; it's a warning sign, unbeknownst to Emily, that her charge, the devil incarnate, perceives Doug(Bradley Cooper), a child psychiatrist, as a rival for the dim-witted woman's attention(but to be fair, all horror movie heroines are programmed this way), and an affront to the foster parent's boyfriend's prowess as a satisfactory lover, in which the peas denote small balls, and its smashing, denotes further that small balls is no match for big balls. Not only does Doug die, but the girl's father, Edward Sullivan(Callum Keith Rennie), too, whom the girl's mother, Margaret(Kerry O'Malley) chose over Lilith/the devil after she rejects her/his overture to, perhaps, engender devil spawn. The audience gets to see this scenario play out for themselves. When Emily, finally, at long last, realizes the mess she's in, the devil turns on the charm, utilizing its proxy to play the lolita, by tweaking the girl's feminine voice to flirtatious and persuasive heights, as a means to coax her guardian from under the bed. Since this is the devil we're talking about, Lilith probably wants to do more than talk."
    },
    {
      "rating": "2",
      "text": "\"Case 39 has potential to be scary but with a predictable plot , bad acting , and terrible script , you may jump here and there , the film will probably loose your attention after about the first 30mins, it fails on all levels & we have seen it all before\" .. D+"
    },
    {
      "rating": "4",
      "text": "I've been watching a lot of movies with young girls being used for the scare effect. I've seen many that utilize the overdone demonic-psychosis debate. If this movie was compared to the exorcism movies (Last Exorcism and Exorcism of Emily Rose) this movie is not worth watching. It seems to be along the same lines though. I didn't find this horrifying and it didn't keep me thrilled either."
    },
    {
      "rating": "10",
      "text": "I loved this movie.. the first movie I've actually gotten into in a long while!  Even though it was a little predictable, It was still wonderful.. Definitely one of the best movies in a while. There was one part that looked cheesy... But..  Overall it was a GREAT movie!"
    },
    {
      "rating": "2",
      "text": "It should come as an immediate indictment of Case 39 that I have begun writing this review before it even ends. The reason? The film just isn't that interesting.As far as demonic child horror flicks go, this is probably one of the worst. I have thought hard and cannot seem to find any redeemable qualities. The two biggest scares of the movie: a dog barking and an alarm clock going off. Wow. Scary stuff right there. Except, it isn't. Instead Case 39 offers up cheap thrills, horribly melodramatic acting and a storyline so cliche that you'll swear you've seen this somewhere before. Not to give away too much (in case you're just bored enough to actually watch this) but when a possibly-demonic child in the film is named Lilith, it kind of tips the hand.Now the film has ended so I can say with complete confidence, it never gets any better. It takes a pretty lame psychological horror thriller to make me laugh more than jump, but that's exactly what Case 39 does. I'm so excited that it is over, I may very well go celebrate. I can think of 39 reasons you shouldn't watch this film. If you choose to anyway, you were warned, and don't blame me."
    },
    {
      "rating": "8",
      "text": "I found Case 39 to be a very interesting and compelling movie.  Pardon me if I don't spend half of my review hyper-focusing on the pea eating scene and aggressively trying to fabricate a series of sexual metaphors from it.  It was simply a marker, a fastidiousness that might, normally, seem perfectly natural for a child but was conveyed, through the use of careful camera work, as yet another manifestation of control by the child, of the tempo of even an ordinary dinner.The most remarkable scene was when the child/demon, after battering down the blocked door and slamming a screwdriver hilt-deep into the floor, slowly crawled to within a few feet of where Emily was hiding and entreated in a silky voice charged with menace: \"You don't want me to crawl in there and pull you out, do you?\"I find the negative reviews of this movie to be short on detail and vague.  Fails on all levels?  We've seen it all before?  I disagree.   In a genre stuffed with prior efforts, there will be similar elements.  What I expect from a movie such as this is to keep me along for the ride and make it interesting and compelling.  Case 39 certainly manages it and doesn't set up the kind of glaring contradictions and indecipherable twists of, say, After Life."
    },
    {
      "rating": "5",
      "text": "No mantiene al que la ve en suspenso y miedo todo el tiempo, tiene un desarrollo interesante, misterioso y entretenido, lo malo es un predecible final."
    },
    {
      "rating": "3",
      "text": "As most horrors, or wanna be horrors, usually go, \"Case 39\" is typical. It sucks. The story is plain not scary. It could be potentially a really bad thriller, if it weren't trying (very badly and mildly) to be a horror. There are no scares, and there are very few thrills what-so-ever. While the idea seemed interesting at first with the girl's situation, it fast evolves into the typical \"demon child\" routine, which is overdone and just plain boring/stupid. Renee Zellweger is darn awful in this, since all she seems to be able to pull off when it comes to acting (at least nowadays) seems to be a \"lemon-face\" (aka. her pouting her lips as if she is sucking on a lemon - aka, lemon-face). It is extremely distracting and annoying. Jodelle Ferland, who plays the little girl Lilith, is at first  irritating, but then turns out to be rather decent in her role as the Satanistic-child. The rest of the cast is rather unmemorable, as is usual in films like this. Technically, the film was decent, nothing really to point out that was particularly bad or good. Overall, though, the film was disappointing with a worsening plot, bad acting by Zellweger, and boring dialogue and story. Needless to say, it is a rather typical horror flick."
    },
    {
      "rating": "9",
      "text": "Horror movies all seem kinda lame lately these days.  But, this one had me pretty freaked out. I give it a solid 9.  There's not much more scary than a young girl possessed by demons, doing freaky ****  I liked this movie and not sure why it's gotten such negative reviews.  If you're in my same boat that horror movies don't cut it anymore, I would strongly recommend this one.  Give it a try, it freaked me out."
    },
    {
      "rating": "7",
      "text": "Wasn't anything like I thought it was going to be. The story line was ok,but could have been more thought out. It doesn't really keep you on edge unless your someone who really doesn't like scary movies. It was ok, not the worst or the best I've seen."
    },
    {
      "rating": "7",
      "text": "I thought the movie was good and pretty suspenseful.  I think the writer and director did a good job of letting the audience think the little girls' parents where evil but then suddenly it hits you that she is one who is really evil/possessed.  The only negative thing I have to say is that when nobody believes  that the girl is evil and everyone thinks she is the crazy one is quite cliche."
    },
    {
      "rating": "3",
      "text": "There's not one scene in this flick that won't remind you of other (and better) horror films. If in some points it manages to creep, there's no doubting the heavy cliche it bears that would make it easily the most forgettable horror film of 2010."
    },
    {
      "rating": "6",
      "text": "This film will not be remembered as a great film, but is doing very well! At the end of a good thriller fate that, despite some errors, succeeds in its intent. I love how he was treated the theme of fear in the film. This is one of my favorite topics. And then there's also the value of child-devil, even if outside it looks like a good person, innocent and pretty, is evil inside. Do not trust appearances. This argument, however, has already been seen countless times and is a disadvantage in point of the film. Jodelle Ferland is an actress who absolutely need to watch out because he is demonstrating a skill that few have."
    },
    {
      "rating": "3",
      "text": "With Case 39 we have another uninteresting psychological horror movie that follows the same formula as many movies of its genre before it. Renée Zellweger’s kindhearted social worker discovers a 10-year-old-girl named Lilith that seems to be heavily mistreated by her parents, yet her superiors don’t let our protagonist interfere  until the parents attempt to make dinner out of their offspring. But as it turns out, just because little Lily is freed from her parents, the movie isn’t over. Mysterious things start to happen and Bridget Jones starts to get into real trouble.\r I was quite skeptic about this movie because after the film was shot, it took three whole years to get it into cinemas. I’m unsure what the reasons for the numerous delays of the release date were, but I suppose it’s got something to do with how bad the movie is. Admittedly, it’s not one of the worst horror movies in any time period and even though it’s about ten minutes too long, I was entertained by it most of the time. However, the movie totally fails at what it’s aiming to be and is just another unrememberable and unsatisfying horror flick. Plus, it contains one of the most ridiculous movie death scenes OF ALL TIME (no exaggeration here, I’m telling you) that seriously dilutes the credibility of the actor in it. And not to forget, its jump scares are even more predictable than the storyline and the ending is a chaotically idiotic water catastrophe similar, yet even less fulfilling, to the one in 2009’s Orphan.\r Case 39 is not a most outrageous failure and I understood and liked some of the ideas that German director Christian Alvart had. The casting of Lilith was also well done since the girl who plays her manages to bounce likeability and craziness surprisingly good. In fact, she is even better than some of her adult colleagues, *cough* Ian McShane *cough*. This can’t prevent the movie from becoming a stereotypical, overlong, and not really frightening misstep that won’t be remembered by anyone in a couple of weeks, however."
    },
    {
      "rating": "3",
      "text": "The little girl looked creepy, which is the only good thing about this boring, tried horror formula. Aside of the good casting of the \"child\", there was no tension, or scary atmosphere in the movie, which is the basic requirement of a good horror/psychological thriller. Everything happened as we have already seen it before in other horror movies, so it lacked originality also. The ending was absolutely BAD! Not recommended."
    },
    {
      "rating": "7",
      "text": "Just do your job! Don't think above that like you can be a saviour!\r It looked like some kind of thriller, that's what anybody would say if they read the title correctly. The story was suspense, well developed to keep that for a very long time. Though it had no major twist, just a revelation like clarifying our doubts. Because most of the storyline seems alike 'Orphan', the film that came just months before this one. But this is a horror theme, I mean real horror, not a terror-horror like 'Orphan'. The overall story relied on one big secret that revealed at some time in the final act.\r I have seen many films about the child abuse, and this one set in as a same kind of theme, but takes a turn during the end of the first act. So when a social worker, Emily, finds a ten year old Lilith was abused by her own parents, she takes her away from them, followed by theirs arrest. Later, Emily adopts Lilith, but soon finds some strange events around her circle. That leads to suspect Lilith, but could not prove anything. Finding the truth becomes her first priority, but how she's going to solve it is what leads us to the conclusion part.\r I haven't seen Renee Zellweger in any recent films, she looked so good in this. Jodelle Ferland too was good as a little girl, the most important role in the film. But Bradley Cooper was in a small part. I think it was a decent film, but not a fresh theme, except developed differently with a new cast. If you are a big horror film fan, you might disappoint with it. Because those parts were minimised and the suspense was maximised. Yet surely most of us can easily predict many scenes, event the ending. So I conclude my review saying it is a decent watch.\r 6.5/10"
    },
    {
      "rating": "7",
      "text": "The acting was good enough to seem realistic even though the plot and the CGI effects were pretty unbelievable and the movie was interesting enough to keep the viewer watching the movie entertained.It wasn't a bad movie but, it wasn't a masterpiece either."
    },
    {
      "rating": "7",
      "text": "A surprisingly fun and entertaining supernatural thriller. While it's not scary in the slightest, Case 39 does put a unique twist on the killer child trope."
    },
    {
      "rating": "8",
      "text": "Reviews vary widely on horror movies.  I really liked this movie.  All the key elements of horror are contained in 'Case 39.'"
    },
    {
      "rating": "7",
      "text": "In this film, a dedicated social worker who works to protect minors will come across a case that initially appears to be violence and domestic abuse. She is not sure what is really going on in that family, but her instinct and experience tell her that there is something very wrong with those parents. And the suspicions are confirmed when, alerted by the girl, she finds her parents ready to kill her in the oven. Months later, she obtains the girl's provisional custody, but just a few weeks of living together will be enough for her to begin to see that this girl may not be as innocent as she looks, and that something truly sinister is going on with her.Horror films in which children are the central element of the plot are nothing new. We had classics like \"Village of the Damned\", \"The Omen\" and the entire \"Children of the Corn\" franchise, not to mention the more recent films like \"The Orphan\". However, they are still delicious and appealing, when they are really well done. The film has an interesting story, which unfolds at a good pace, without twists, subterfuges or stratagems to amplify the suspense, and everything suffers from a certain degree of predictability. However, the film benefits from the good construction of the characters, especially the protagonist, a social worker who soon conquers us with her dedication and good intentions, and holds our attention until the end.In fact, the excellent performances of Renee Zellweger and young Jodelle Ferland are essential for the quality and strength of the final product. Zellweger had already shown us, in several previous works, to be an actress of great talent and versatility, but she manages to take the film on her back, while Ferland was able to overcome her inexperience and youth to give us a colossal job. For a child actress, she even looks like an adult, as threatening and calculating as she can be. The film also features the work of Ian McShane and Bradley Cooper, safe bets on the supporting characters.The film is not particularly remarkable in terms of production values and technical issues. Cinematography is standard, but it works quite well and is effective, adapting well and helping to build the light tension felt during the film. Some scenes in particular (such as the sinking car scene or the fire) were brilliantly shot, but there is a greater sense of danger. The sets and costumes are everything we could hope for, without surprises or major problems. The editing and the soundtrack do their job discreetly."
    },
    {
      "rating": "7",
      "text": "Parents try to cook their daughter in an oven, social worker takes her into her home, girl turns out to be a demon so, social worker drives her into a lake."
    },
    {
      "rating": "8",
      "text": "Great plot, the movie itself is is a good thriller, i don't understand why the press rated it so bad, the only thing i have to say about it is that it's not really scary, besides that the plot twists are awesome, better than most horror movies today."
    }
  ]
}