{
  "id": 3862,
  "title": "Cashback",
  "starring": [
    "Sean Biggerstaff",
    "Emilia Fox"
  ],
  "runtime": 102,
  "genre": [
    "Drama",
    "Comedy",
    "Romance"
  ],
  "description": "After a painful breakup, Ben develops insomnia. To kill time, he starts working the late night shift at the local supermarket, where his artistic imagination runs wild.",
  "releaseYear": "2006",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/f77hydXxqGirGEvJdWpETfMdAg2.jpg",
  "categories": {
    "plot": 9.0,
    "acting": 10.0,
    "ending": 6.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 7.666666666666667,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "9",
      "text": "Scott Brown (Entertainment Weekly), doesn't distinguish porn and erotic innocence. The objective of this movie is showing on this scenes the beauty of a human body, and nothing seems to be obscene, because it has a story behind, that arranges everything. It's a very beautiful and funny storyline, and every detail is fascinating."
    },
    {
      "rating": "9",
      "text": "This movie was a breath of fresh air. Very original storyline, well acted and directed. It was both funny and romantic, in a way that would entertain guys and girls alike."
    },
    {
      "rating": "6",
      "text": "I can completely relate to a lot of things in this movie from the hardships of losing your first love to enjoying beauty in almost everything. Quite a few times I found myself laughing out loud which is some good relief from the inner thoughts of the main character. There are a few truly great moments in this movie. But on the other hand I was totally caught off guard when Ben started to freeze time and drawing the girls in the grocery store. I think the idea could've been gotten across with less cleavage and more dialogue or narration. This is still a really solid movie to watch on a date or something of the sorts because both male and female can enjoy it."
    },
    {
      "rating": "6",
      "text": "The problem with cashback is that it too hard to be so many things: an artsy film, an insightful drama, and a stupid brit comedy. Ok in parts, but overall leaves a bad taste in your mouth, like a can of beans that has been sitting far too long on the shelf."
    },
    {
      "rating": "10",
      "text": "GREAT FILM. This will probably be the only movie i will ever give a 10 to. Words can't really describe this movie. I first watched this streaming through netflix at 3 in the morning and it blew me away."
    },
    {
      "rating": "0",
      "text": "This is so boooooring! No plot, no acting, nothing takes off or goes anywhere. Ending is so out of reality, it's almost laughable. Maybe if you're a young teen, you might enjoy. Otherwise, you'd waste almost 2h of your time. Go rent something else."
    },
    {
      "rating": "10",
      "text": "Greatest movie ever made.Awesome writing and humor ,nudity and tragedy all were presented well.Acting and dialogues are very admirable.Should have won least 7 oscars."
    },
    {
      "rating": "10",
      "text": "One of the greatest movie I've seen in my life. Sean Ellis described human emotional in the way never been before. Naturally and naked, the main character's emotion take you back when you first experience love. Beautifully and intelligently filmed but not everyone would understand the artistic of this movie. I'm sure those of us who appreciate the beauty of life will definitely love this movie. See it for yourself, see it through the eyes of artists, of nature lovers."
    },
    {
      "rating": "8",
      "text": "I don't know why a majority of reviews were so harsh on a rookies first major film- sure it was a tad sophomoric but it reminded me of all kinds of people I grew up with so I was able to suspend my perception of the film. I say a majority of film reviewers are jaded the average joe will dig this picture!"
    },
    {
      "rating": "6",
      "text": "Unfortunately some inspired, delicate scenes and cute ideas are mixed right in with heavy-handed caricature that adds very little to the movie (soccer game, getting ready for the party, etc). The story's twists are also quite cliche"
    },
    {
      "rating": "8",
      "text": "Innovative and imaginative, cleverly presented. I liked the stylish direction of Sean Ellis. It flowed well and was consistent. Beautiful story, filled with wonderful images. The creativity is just marvelous. Rich and good characters."
    },
    {
      "rating": "6",
      "text": "Cashback is a romantic comedy for cynical people, especially for those that got a mediocre education or have ever worked a mind-numbing job.  The happy ending was cliched and unsatisfying."
    },
    {
      "rating": "10",
      "text": "A wonderful film with many hidden truths. I related strongly to the dream of freezing time to experience my life slower. I personally struggle with the fear that my life is slipping away, and all too often I look at the big picture and ignore the details. The movie spoke to me, and gave me words of encouragement. Very beautiful."
    },
    {
      "rating": "10",
      "text": "Cashback is probably the first romantic film ever intended for a predominantly male rather than female audience. Unlike pretty much every other romantic film, this film looks at love, sex and relationships from a male perspective rather than the usually corny and uninteresting (for males anyway) female perspective. As a heterosexual male, I must say I really enjoyed this film because it gives a very recognisable view of the male psyche and the different kind of feelings males experience in male-female relationships, varying from superficial attraction to deep passion and love.\r I'd recommend it to every heterosexual male :-)"
    },
    {
      "rating": "10",
      "text": "Went into this with low expectations but quite frankly left feeling that it was well done.  It is quirky, silly, downright corny at times but having worked graveyard shift most of my life I could relate.  Instantly one of my favorite little hidden gems."
    },
    {
      "rating": "7",
      "text": "----------------------------------7.3/10-----------------------------------"
    },
    {
      "rating": "9",
      "text": "Great movie, there is something to think about. I watched it with pleasure, not wasted time."
    }
  ],
  "recommendations": [
    "lost_in_translation",
    "her",
    "five_feet_apart",
    "me_before_you",
    "moonrise_kingdom",
    "closer",
    "magic_mikes_last_dance",
    "the_fault_in_our_stars",
    "i_feel_pretty",
    "the_notebook",
    "how_to_be_single",
    "the_big_sick",
    "a_walk_to_remember",
    "secretary",
    "me_and_earl_and_the_dying_girl",
    "black_swan",
    "the_edge_of_seventeen",
    "to_the_bone",
    "brokeback_mountain",
    "okja",
    "jojo_rabbit",
    "about_time",
    "the_curious_case_of_benjamin_button",
    "chappie",
    "the_lobster"
  ]
}