{
  "id": 3839,
  "title": "Casino Royale",
  "starring": [
    "Daniel Craig",
    "Eva Green"
  ],
  "runtime": 144,
  "genre": [
    "Adventure",
    "Action",
    "Thriller"
  ],
  "description": "Le Chiffre, a banker to the world's terrorists, is scheduled to participate in a high-stakes poker game in Montenegro, where he intends to use his winnings to establish his financial grip on the terrorist market. M sends Bond—on his maiden mission as a 00 Agent—to attend this game and prevent Le Chiffre from winning. With the help of Vesper Lynd and Felix Leiter, Bond enters the most important poker game in his already dangerous career.",
  "releaseYear": "2006",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/lMrxYKKhd4lqRzwUHAy5gcx9PSO.jpg",
  "categories": {
    "plot": 5.425,
    "acting": 7.090909090909091,
    "ending": 5.8,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.25,
    "funny": 6.25,
    "action": 6.730769230769231
  },
  "reviews": [
    {
      "rating": "10",
      "text": "Easily one of the best, is not the best, Bond films since the days of Connery.  The dark and gritty tones are a welcome change of pace, and the story still manages to infuse humor in the right places, and in my opinion also in the right quantity. Easy 10."
    },
    {
      "rating": "8",
      "text": "I enjoyed it and it's pretty much a given that every Bond film staring the new Bond is gonna be good. The huge problems the film had is that it took quite a bit to get into and to get interesting. Also it did a poor job going from action to drama. Besides that, It was still a good action film and Daniel Craig is one of the best Bonds yet."
    },
    {
      "rating": "9",
      "text": "Casino Royale rejuvenates the Bond franchise with a beautifully crafted film complete with wit, emotion, plot and of course, enthralling action sequences."
    },
    {
      "rating": "9",
      "text": "i really enjoyed this bond film i wasn't sure about Daniel Craig as bond at first but he actually performed very well in this film. the plot of the film was also well written better then a lot of other bond films"
    },
    {
      "rating": "7",
      "text": "I was actually really surprised. Daniel Craig was an amazing Bond and Eva Green to me was one of the best Bond girls. The plot was actually really good and believable. The acting was great. The only problems I have with the movie is that its a prequil but the technoligy was far better then the other films and M looks older. But once you get past those details this movie was great."
    },
    {
      "rating": "9",
      "text": "Simply the best Bond of all times. Also if Daniel Craig isn't the best actor I could imagine for this role, this is subordinate because of the great supporting actors. Eva Green is fetchingly good and Mads Mikkelsen as the antagonist is also very well played. The whole film consists of so much rememberable action scenes, every single one is just awesome! The long break between this and the last Bond was essential, with the new techniques there are better visual and audio effects, that improve the whole movie quite much. 'Casino Royale' is a legendary story, the ending is absolutely great and I also enjoyed the poker game. It's a little step away from being a perfect action movie, but is surely one of the best I've seen in years and everything just works in this film. Simply awesome!"
    },
    {
      "rating": "10",
      "text": "Casino Royale is by far the best of the newest Bonds, with an exciting premise, masterful execution, and an overall Bond feel to it that is mesmerizingly good."
    },
    {
      "rating": "9",
      "text": "Perhaps the best Bond film ever, and one of the best action films I've ever seen. It's grittier and more violent than the previous films, but it is purely entertaining."
    },
    {
      "rating": "10",
      "text": "OK Better than Sky fall. You can see this movie. this is one of my first movies with torture. First bond movie with a longest poker game in the movie."
    },
    {
      "rating": "9",
      "text": "I saw this at a cast and crew screening in London last weekend: I'm not a huge Bond fan, but I do enjoy them on a purely popcorn level and this was definitely one of the best in recent memory. The tone is much edgier and nastier than the Brosnan movies, harking back more to Dr. No or For Your Eyes Only. The action sequences are brilliantly shot and edited for maximum impact and are some of the best out of any Bond movie. Martin Campbell, who also made 'Goldeneye', was an excellent choice and, for me, is one of the best Bond directors. What gives this the lead over recent Bonds is the more realistic feel: the exotic locales, fast cars, spectacular action, beautiful women and many other Bond hallmarks are all here but gone is the campy tone that marred, say, Die Another Day. Yes, the whole franchise is based on an entirely ridiculous and cartoonish notion but the more serious and harder-edged tone works really well here. In this context, Daniel Craig gives an excellent performance as Bond. I'll be the first to admit that I raised an eyebrow when I heard he was cast but he really makes it his own. It's hard to say whether he's better than any of the other Bonds: Connery and Brosnan felt right for the style of Bond movies they were in. Here, as suits the overall tone of the film, Bond is much more of a sadist, a cold-hearted killer with very little sense of empathy and Craig, with his piercing eyes, suits the role very well. He's charming and funny when required and totally convincing in the action sequences. The violence is less cartoon-like and flippant, too, with every punch, kick and shooting looking like they really hurt. Also, the story is just much more engaging than many a Bond film; the script's not going to win awards but it's consistently inventive and intriguing. Whilst the film has enough of it's fair share of action, the emphasis is equally on character and storyline and less on gadgets and sheer implausibility. When there isn't a huge action sequence happening, you don't miss it: the film's longest set-piece, the poker game at the Casino Royale, is as (or not more) gripping and entertaining than any of the chases and shoot-outs. The only minor gripes that I have are a slightly too long running time: the film drags a wee bit towards the end and, although it helps the tone of the film, we don't hear enough of the Bond theme tune! However, great directing and performances from everyone involved, along with Phil Meheux's excellent cinematography, Peter Lamont's as ever superb production design and all the other top-notch craft and technical departments make 'Casino Royale' a classy and very enjoyable night out at the movies."
    },
    {
      "rating": "8",
      "text": "The movie is a revolution to the Bond franchise. Mark Campbell presents to the audience that James Bond is not a hero who kills the bad guys and gets laid with girls using his gadgets and slick words. Using Daniel Craig, he presents a Bond that actually gets hurt and looses the ones he love. Through this change of portrayal, Bond has become a stronger character and a worthy franchise to watch. Kudos Campbell (and you too Craig)!!!"
    },
    {
      "rating": "7",
      "text": "I've never been a fan of James Bond. Probably, because I grew up with Pierce Brosnan as 007 and he sucked. I decide to give the series another shot, not because of Bond, but rather Daniel Craig. I have been a fan of Craig's for some time, having seen several of the films from overseas. I knew then that he would be a huge action star and now he's 007. As for my first Bond movie, it was pretty good. Craig was fantastic and avoided much of the cliché Bond moments that most of us have come to loath. The film was entertaining, but also pretty predictable and much longer than it needed to be. I was also very unimpressed by the bad guys. I thought Bond villains were supposed to be classic, but these guys were rather forgettable. I'm not in love with the Bond character, but this film did open my eyes a little bit and I probably will check out Quantum of Solace in the near future."
    },
    {
      "rating": "3",
      "text": "I did not like this movie at all.  The action scenes are waaaaaaaaaaaay too long, so long that you'll forget how and why they're even happening.  Bond jumps all over the place, so much so that he reminds me more of Super Mario than anything else.  The plot is difficult to appreciate, there's just nothing the viewer is able to relate to in this movie.  The only bright spot is Judy Dench, who is wonderful in any role she plays.  Maybe this movie is worth watching just for her scenes.  Daniel Craig is good, too, but the movie doesn't take advantage of his strong screen presence.  Hopefully Skyfall will be better?"
    },
    {
      "rating": "9",
      "text": "Casino Royale rejuvenates the Bond franchise with a beautifully crafted film complete with wit, emotion, plot and of course, enthralling action sequences."
    },
    {
      "rating": "10",
      "text": "I remember when this movie was first released and that Daniel Craig was going to play Bond, there was controversy and backlash due to the fact that Craig did not meet everybody's needs as he looked nothing like the Bond we all imagined.\r I had very low expectations with this movie, thinking that it was just going to be a routine Bond film with dumb action, endless gadgets and gimmicks, just like the Pierce Brosnan Bonds were becoming shortly after his debut in 'Goldeneye' (1995).\r It seems my disappointment was non-existent, 'Casino Royale' is easily the best Bond movie since 'Goldeneye' (1995), which was also directed by Martin Campbell. This is a much grittier movie with a more vulnerable and human Bond. A character who was once two-dimensional, a character who had nothing but a fancy car, gadgets and women now has personality. This is thanks to Craig's performance mixed with a smart screenplay written by Neal Purvis, Robert Wade and Paul Haggis.\r Mads Mikkelsen plays LeChiffre, the main villain in the movie who also has a slice of vulnerability unlike most Bond villains. He is sadistic, but he is also hurt. You have Eva Green as Vesper, James' associate throughout the movie, as a Bond girl, she is one of the best. There is also some vulnerability there as well. All of these characters are human, they are not stereotypes, they are not weighed down by cliches, this movie and the characters are all fresh.\r 'Casino Royale' is also the first Bond novel written by Ian Fleming and the movie is seen as a reboot for the character and franchise. It makes sense to go back to the drawing board and use the first ever book to re-invent the franchise. The only thing missing in this movie are the characters Q and Moneypenny, but it seems that you can make a Bond movie without them, as long as you add some more depth and dimension to the characters you are focusing on.\r 'Casino Royale' is great, one of the best Bonds ever. Darker, more personal and more tense than previous outings. The only movie after this that lived up to expectations is 'Skyfall' (2012) which I already reviewed. 'Casino Royale' deserves its 10/10 score."
    },
    {
      "rating": "3",
      "text": "The new Bond is a humorless stiff. One long pointless chase is followed by a long pointless fistfight followed by a long pointless card game followed by a long pointless shootout. We know who is going to win the poker tournament just get on with it. The movie just goes on and on and on. Other than Die Another Day this is the worst Bond ever. The thrill is gone."
    },
    {
      "rating": "5",
      "text": "Great action sequences WITHOUT the use of CGI (psst, Die Another Day) and Craig is an excellent James Bond, but the plot was very sub-par."
    },
    {
      "rating": "0",
      "text": "A James Bond film is a classy spy movie with a lot of action and story, but not too much of either to make it unbalanced. Casino Royale is a poker movie. Think about it. It starts with some talking, then there's a (very cool) action scene, then...poker. And more poker. And even more poker. Then there's that scene when bond gets poisoned and nearly dies, and then more poker. The over involved plot doesn't have to do with bond taking out the bad guy as normal, instead he has to make him bankrupt in a, no joke here, game of high stakes poker. I think what really does it for me is seeing bond striped naked, tied to a chair, and whipped repeatedly in the area a man does not want to be whipped in. And he doesn't use his whits or cunning to escape, but instead he has to be rescued. Its just insulting. Also, no Q means no cool gadgets. Bond, the franchise that first had the idea of equipping spys with ultra high tech gadgets, suddenly has no gadgets. Personally, when i think bond, two of the first things that come to mind are the laser watch and the Aston with missiles under the head lights and now both of these icons are gone. Its just sad. This movie left me with a hollow, empty feeling that made me go back and watch one of the twenty superior bond films. No charm. No heart. No soul. 0 out of 10."
    },
    {
      "rating": "0",
      "text": "One of the absolute worst films I've sat through in a very long time. It was painful to say the least."
    },
    {
      "rating": "0",
      "text": "This movie was as laughable as they come. They un-naturally included all the present trends at the time i.e. par-core and texas hold em (in which they in detail had to explain through script what was going on to heighten the atmosphere of the anti-climatic card game for those watching who didn't know even the basics of texas hold em.) And the scene where it's supposed to portray Bond as a sex symbol women love and men want to be is a slow mow of him emerging from the ocean looking like a **** old man will get an audible hardy bellow every time. For the older generation Connery will always be untouchable, for mine its Bronson. And that's it/ This movie truly is hilarious. Best Comedy of 2006."
    },
    {
      "rating": "10",
      "text": "Best Bond movie ever, those who don't agree obviously don't know a good movie. To all of those guys who hate this movie ( luckily there aren't many, u mad brooooooo?)"
    },
    {
      "rating": "4",
      "text": "Loved the stunts, loved the theme song, but did not love the overall scenario of the movie itself. A long boring card game in the middle of the movie and the action scenes are mostly dealt with chasing one enemy at a time. I expect more excitement and the gadgets this time but there's nothing more than just some pointless scenes."
    },
    {
      "rating": "0",
      "text": "An absolute complete waste of time. This film is terrible anybody who has rated this film as good is more than likely drunk on drugs or just plan retarded. Its the worst film I have ever seen. The director want to be shot as soon as possible Daniel Craig is just a joke (His acting is that of a 15 year old yob) and the rest is just a fail. I feel that strongly about this film that I have created an account just to slate it. Destroyed the bong legacy, and replace it with rubbish!!!! I am disgusted"
    },
    {
      "rating": "1",
      "text": "Stupid. Boring. Sadistic. Implausible. Charmless. Illogical. Cheesy. Lame. Impossible, etc etc Personally i think we should nuke the earth, maybe a better species than humans will evolve, and movies like this never get past the moronic script stage."
    },
    {
      "rating": "0",
      "text": "The positive reviews of this picture reflects how shallow and frankly stupid people in general are creatively. First, Craig is all wrong for Bond. Since a lot of people are nothing but criminals, no wonder he appeals to them. And he's a poor actor, mumbling his lines. Violent movie from start to finish. The original story by the way has little resemblance to this mess. Should be titled \"JAMES BOMB\" Casino Royale is a Royale FLOP! Bond is supposed to be a gentleman GQ type. Suave yet physical. Roger Moore was perfect. Good-bye Cubby, too bad your kid drove Bond into the ground in just one movie. If you want to change everything-MAKE ANOTHER FILM! Sasino Royale was not the box-office success it hoped for, and the above reasons are why. Next time, hire the right actor for Bond, and stck with the story that has worked! Oh, the torture scenes-just great to watch, huh! Violent, sleazy movie with Bond an anti-hero criminal. Hmmm, how hip."
    },
    {
      "rating": "3",
      "text": "Worst Bond ever!!! Ok this is before Sean Connery and everything, how come he's using cellular phones and driving 2006 Aston martins? The movie is horrible. Craig's input is spending six months in the gym the dialogue is nothing. The humor is completely gone I mean Bond used to be fun and unrealistic that was the whole point of it. It is one long commercial for Sony and Aston martin. I mean they must have showed off the complete line of Sony Ericsson cellphones and all the wonderful things they have in them. And what kind of pussyass Bond has a defibrillator in his car incredible. Come on Bond doesn't play poker he plays Baccarat every f.cking person in the universe knows that. It's just so sold out Sony controlling Ok we need someone who has spent his life in the gym next to out cellphones. Bond doesn't concern himself with tells. This is the worst movie ever. Anyone would have made a better Bond. Bond is not boring. Homer Simpson would have made a better bond. George bush would have made a better Bond. Any one with intelligence would have made a better Bond. Even Madonna. And I'm guessing the average of people in here is 7."
    },
    {
      "rating": "0",
      "text": "Terrible. I felt as if I was channel surfing, first a dark and cold blooded assasination, then an action packed areobatic scene, quick onto explosions, oil tankers and aeroplanes no wait switch to a dramatic aka boring casino scene. Time for a sadistic and disturbing torture scene and finally the death of the villian, was he the villain? Who shot him? It wasn't Bond. Oh well but wait there's more an abrupt and unexplainable change to a story of romance and betrayl. Culminating in the death of the bond girl. The plot seemed thrown together from several different ideas none of which came together. Visually unappealing, lacking anything cinematic in the form of special effects. What little I noticed of the musical score grated on the ears. As for the main character Bond was not reinvented or grittier he was just less. Less charming, less intelligent, less talkative. In fact everyone else did the talking for him, they all talked at him while he responded with bored stares. When Daniel Craig did talk as many others have mentioned he mumbled, making a discontinuous plot even more disjointed. Definately yet another example of current movie makers ruining a long standing franchise, ie. Star Trek, Star Wars, Indianna Jones, etc etc."
    },
    {
      "rating": "5",
      "text": "I am sorry but I was really disappointed...not much of a love story and a long poker game...lacking real bond action."
    },
    {
      "rating": "2",
      "text": "This movie is a load of crap. Most bond films weren't killing everyone so violently. He is made out to be a vicious killer. Nothing against violence in movies, But James Bond When you compare the older classic Bond movies This guy doesn't have the Carisma of Either a Roger Moore or a Sean Connery. I'm truly disappointed. I want my money back. Pierce Brosnan did a better job even. Maybe it was the story But I didn't buy in to his character. Truly not my bag baby."
    },
    {
      "rating": "3",
      "text": "In an effort to reinvent the Bond franchise the filmmakers succeeded only in burying it. The best part of this movie ends at the 11 minute mark the ensuing 2+ hours are completely and utterly forgettable. Daniel Craig, an otherwise fine actor, is comically miscast. His pug face and squat muscular body are totally inappropriate for the role. In fact, apart from Caterina Murino, Casino Royale will be remembered as the Bond film featuring the most unattractive cast ever assembled. My advice; pickup Mission Impossible 3 and leave this waste of time on the shelf."
    },
    {
      "rating": "3",
      "text": "This is not bond the icon.... this is a very supid bond movie... i don't care about the good ratings of the movie critics... we the public viewer make it a big hits... make it an invincible bond just like the old days... daniel? is not invincible in looks, style, and humor as well... that is how an icon is created... by the way he is bond... make him a global icon... u better check out the box office world wide... it is not the same james bond movie that still showing in cinema in almost a month.. but one week maybe... and to the producer... does it concern you?"
    },
    {
      "rating": "3",
      "text": "I did enjoy the first 5 minutes and the inital chase but it deteriated quickly. The Casino scenes were laughable and but the time it reached the climax I'd reached my limit also. How is this considered a good movie by critics I'll never know. Daniel Craig was dreadful, this movie should never have been made as the story of Casino Royale is substandard."
    },
    {
      "rating": "4",
      "text": "In my opinion, James Bond has risen to the rank of comic book superhero. By this I mean: nobody is smarter, nobody has skill, and like Batman, nobody can beat all of his gadgets. This said, I love James Bond. Everytime you walk inot 1 of these movies, you know that you are going to get a completely unbelievealbe thrill ride as some villian seeks to take over the world...that is until \"Casino Royale\". In this movie, they attempted to make James real & fragile. If I want to see a real & fragile spy movie, I go rent \"Spy Game\". To me, they robbed James of his gadgets & swagger which essentially killed the character. Yes, I know that this was Flemmings first story, but \"first\" doesn't always mean \"best\". Some writers really struggle with their characters in the beginning while they try to figure them out. To me, this is the version on James Bond that Flemming left on the cutting room floor for a reason."
    },
    {
      "rating": "3",
      "text": "Run away. I read a review saying this was a post Bourne Supremacy Bond fim- a film I liked. This film was pants. I had high hopes- such high hopes. Danny-boy is alright, don't get me wrong. Have you not see it yet? You decide."
    },
    {
      "rating": "3",
      "text": "Ok. so... this movie kinda sux. new and different doesn't mean better when the plot sux and there is no character development whatsoever. i challenge anyone to tell me who the bad guys actually were. and the guy with one sunglass! uhoh! he looks scary! and he really wants that briefcase! retarded. i was soooo disappointed, especially with all those good reviews, saying this reinvents Bond. i like the feel of the movie, the aura, bond's character, and nothing else. and what was with that ending? i suppose if there's no plot there can't really be an ending, huh."
    },
    {
      "rating": "3",
      "text": "Bond is the bad guy in this movie. He's just an as.hole picking on this guy in a poker game. Plot made no sense. Action was few and far in between. And the story made no sense."
    },
    {
      "rating": "3",
      "text": "Casino Royale was meant to be a more down to earth bond film. Too bad it sucked. If the directors really wanted to make a more realistic bond, they should have made a more From Russia with Love type realistic. A bond movie shouldn't be totally fake and stupid, (cough Die Another Day cough!) but it shouldn't be so realistic that bond goes through cardiac arrest. Also, Craig just plain sucks! If they wanted a more \"realistic\" bond, anybody would have been better! (Clive Owen anybody?) The movie is way to long. It is the first time I was actually bored during a bond film. Mads Mikkelsen is simply unimposing and anti-climatic. I think that my 8-year-old-brother could have beat the crap out of him. Also, the casino scene is SOOOOOOO LOOOONG! Bond plays Baccarat, not poker, but that's not important. Daniel Craig mumbles for the whole movie. Also, if they wanted a more plausible film, why then, put in some jamacan guy who has been bitten by a radioactive spider! I know this review is very inconsistent, but the film is so bad that i don't know where to start! Oh, yeah, the only good part was when Bond met Mr. White. Hopefully the next one will be better."
    },
    {
      "rating": "0",
      "text": "Im not sure where all these \"A\" reviews came from...it truly baffles me! If anyone out there is a true Bond fan, there is no way in hell that this movie could be appreciated. Daniel Craig is the worst Bond I have ever seen...I think the people that casted him were on crack. Everyone knows 007 is a tall, dark hair, sophisticated, sauve gentlemen. Daniel Craig looks like a beaten up english pauper. This movie was absolutely rubbish. The storyline did not make sense, nor did it flow well at all. Even the opening song was lousy. From the very get go, it was straight up action, with very little dialogue, and feeble storyline. This is an insult to Mr. Sean Connery...the greatest, and only true Bond..."
    },
    {
      "rating": "5",
      "text": "I am a James Bond fan and this was the lamest Bond I have ever seen!!! Where were the gadgets, the cars, the suspense. Wait for the DVD, better yet, tv. I could have saved my 9.50."
    },
    {
      "rating": "5",
      "text": "Hats off to Daniel Craig for brining the right amount of (much needed) grit to the role. However his achievements, coupled with some great set pieces, are runied by a ridiculous running time, and a terribly hammy final quarter. Drop the drawn out ending, shave 40 minutes off the films length and you'd have a great film. Sadly, this is only average."
    },
    {
      "rating": "10",
      "text": "Casino Royale is the best Bond film ever and Daniel Craig, as Bond, was awsome. I only wish we can see more of him as Bond in remakes."
    },
    {
      "rating": "9",
      "text": "Best Bond movie by far. Comparisons to Bourne Supremacy are right. Finally a Bond that's not a wimp, but a killer. Craig is the right actor for the role. Great casting. Hope the next Bond movie keeps with this new approach to Bond."
    },
    {
      "rating": "10",
      "text": "I enjoyed the action in this movie to make him more of a human event instead of a computer role. Thanks Daniel for your energy throughout the movie."
    },
    {
      "rating": "7",
      "text": "A different kind of Bond...more real. Great action sequences but I think the Eva Green lacks the umph to catch Bond. They should have used the married woman in the movie as the lead female. Movie moves along nicely until 2/3 of the way in when we take a pause to watch Bond fall in love...not so believable especially knowing what he was recovering from. Good vein on the re-styling of Bond movies."
    },
    {
      "rating": "8",
      "text": "I defnitely much prefer the intense, engaging and more personal Daniel Craig to the previous pretty boy Bond. The storyline is fine. (but the self help defibrillator bit is ludicrously unbelievable though). A good and refreshing facelift for the franchise."
    },
    {
      "rating": "9",
      "text": "Best Bond film since \"The Living Daylights\" (So that's nearly 20 years!) I admit to being less then enthused when i first heard that Daniel Craig was selected to be the new Bond. I revoke ANY negativity i previously expressed. This guy is easily the best Bond since Sean Connery. Film has some sparkling banter between Bond and M, and Bond and Vesper. Movie starts off with one of the most exciting action sequences that the series has ever seen. Great performance by Mads Mikkelsen as the most believable and sympathetic Bond villain to come along in awhile. Great entry in the series."
    },
    {
      "rating": "10",
      "text": "More realistic than the previous Bond movies which have been too much like cartoons. Daniel Craig does a great job as Bond and the story and intro are great."
    },
    {
      "rating": "8",
      "text": "Brilliant! Absolutely loved it! Loved Daniel Craig's Bond - and that after I had been such a firm Pierce Brosnan-Bond fan. The opening scene was great and the action in Uganda was so tense. The Madagascar action was also brilliant! The only thing I really found extremely irritating and tedious were the initial \"bickering\" scenes with the accountant - she came across immature, too young and the age gap between them was just too big. The blond girl was also very forgettable."
    },
    {
      "rating": "10",
      "text": "The best James Bond movie ever made. It is a great fresh movie. It shows the series by doing something something i would not have ever thought of in my whole life and that is creating Daniel Craig into the best Bond ever and making it a great movie."
    },
    {
      "rating": "10",
      "text": "Waiting for this movie to come out on DVD is my mistake. I wish I saw this one on the large theatre screen. The most impresive Bond Movie in decades. Daniel Craig brings 007 back to someone we respect & love. This change in style was exactly what the Bond franchise needed to save itself. I can't wait to see the next one, this time at the Theatre ."
    }
  ],
  "recommendations": [
    "no_time_to_die",
    "spectre",
    "die_another_day",
    "quantum_of_solace",
    "the_world_is_not_enough",
    "skyfall",
    "diamonds_are_forever",
    "tomorrow_never_dies",
    "thunderball",
    "the_spy_who_loved_me",
    "you_only_live_twice",
    "man_of_steel",
    "xxx",
    "lara_croft_tomb_raider",
    "goldeneye",
    "the_man_with_the_golden_gun",
    "mission_impossible_rogue_nation",
    "creed_ii",
    "true_lies",
    "spider_man_far_from_home",
    "x_men_days_of_future_past",
    "thor",
    "the_amazing_spider_man",
    "x_men_apocalypse",
    "boss_level"
  ]
}