{
  "id": 1127,
  "title": "Casper",
  "starring": [
    "Christina Ricci",
    "Bill Pullman"
  ],
  "runtime": 100,
  "genre": [
    "Fantasy",
    "Comedy",
    "Family"
  ],
  "description": "Casper is a kind young ghost who peacefully haunts a mansion in Maine. When specialist James Harvey arrives to communicate with Casper and his fellow spirits, he brings along his teenage daughter, Kat. Casper quickly falls in love with Kat, but their budding relationship is complicated not only by his transparent state, but also by his troublemaking apparition uncles and their mischievous antics.",
  "releaseYear": "1995",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/f8EuycdmuqMjlxFPm7awNJ9gLO8.jpg",
  "categories": {
    "plot": 8.833333333333334,
    "acting": 9.333333333333334,
    "ending": 9.0,
    "soundtrack": 10.0,
    "cinematography": 5.0,
    "familyFriendly": 8.0,
    "funny": 7.0,
    "action": 10.0
  },
  "reviews": [
    {
      "rating": "6",
      "text": "The movie is cute, the principal characters are pleasant and the plot, although simple, it's enough entertaining for all family."
    },
    {
      "rating": "10",
      "text": "Certain films earn our affection for the quality they have, others for the visual beauty and the grandeur of the technical means used… others, like this film, conquer their place by the way they touch us. I may not be the only one who saw this movie as a child and now feels some nostalgia and affection to see it again.The film hardly needs any introduction, telling us the story of Casper, a ghost who settled in the land after dying very young, and haunts his old house in the company of three uncles, who are the real terror of the region. The house's fate seems sealed when it ends up in the hands of an ambitious heiress, eager to demolish it and get hold of a treasure she thinks is hidden there. Unable to make it thanks to the ghosts' efforts, she decides to call an expert, Dr. Harvey, to get them out of there. It's precisely what Casper wanted most, as the academic travels with a teenage daughter he fell in love with when he saw her on television.The film isn't brilliant, it's not meant to be. It is not an award winner, nor will it give us the dramatic life performance of any of the actors involved. It is simply a family film, aimed at younger people, but which also knows how to please adults, and which, despite its age, remains fresh and current today. For me, who saw it as a child, it will always have a corner in my video library.The film was the first to make live actors act opposite characters entirely made by computer graphics, and from that point of view it was a pioneering film. However, Casper, Stretch, Stinkie and Fatso are characters in their own right and their voices were lent by a group of good actors: Joe Nipote, Joe Alaskey, Brad Garrett and Malachi Pearson. They are the soul of the film and steal our attention whenever they are present. The young Christina Ricci, in one of the early career jobs, also shows unmistakable signs of talent. Bill Pullman is effective, convincing and entertaining in his role, Eric Idle is very funny, and Cathy Moriarty is very good as a villain.Technically, it's an effective movie. As I said before, it excels in its pioneering use of fully CGI characters, and the visual, special and sound effects used are really good, and they seem convincing even after twenty years. Cinematography doesn't surprise us, but it doesn't disappoint either. The pace of the film is regular, fast and fun, as it should be, and all the sets and costumes are very good, in particular the magnificent Whipstaff mansion, which would become iconic thanks to its Art Nouveau design, worthy of the best ideas of Antoni Gaudí. The film's music is ensured by the ever-reliable James Horner."
    },
    {
      "rating": "10",
      "text": "Casper marcó mi infancia por completo, simplemente adoro esta película desde y para siempre."
    },
    {
      "rating": "8",
      "text": "I love this movie. When talking about bad movies based on a cartoon....Casper should not be mentioned. It's definitely one of the best. I just always found the ending rushed."
    },
    {
      "rating": "7",
      "text": "I've watched this a little late...in 2021 on Netflix.,,,and i liked it.Enjoyable movie 4 teens and adults alike, very 90's in style, humorous and a little gothic.You don't have to be at home with Casper Franchise (like the old Casper Cartoon Show ) to enjoy or understand this."
    },
    {
      "rating": "7",
      "text": "Casper salio en 1995 y fue de las primeras películas en tener CGI, y si bien se nota que los años le pasan factura, para su tiempo diría que estuvo mas que acertado. Ahora bien, si hablamos de la historia en general y de los personajes... esta bastante bien! Aunque debo decir que solo Casper y Kat fueron realmente carismáticos, el resto de personajes si que son bastante genericos, en especial Carrigan que puedo decir que es practicamente igual a todos los personajes malvados que llevan de nombre \"Medusa\", incluso muriendo de una forma super forzada. Y hablando de cosas forzadas o poco explicadas, la película no hace ningún intento a la hora de contar un poco sobre los \"deberes\" que debe de hacer un fantasma antes de poder ir a \"la otra vida\", y así varias cosas que no quedan tan claras, aun así, es una película que recomiendo bastante y que entiendo porque para algunos es un clásico."
    },
    {
      "rating": "7",
      "text": "I remembered so much of this, and yet absolutely nothing of the plot.’Casper’ is a film I must’ve watched so much as a young kid on video, the opening few scenes are very nostalgic. As noted though, I didn’t recall anything serious from this 1995 flick though. It’s a little deeper than I remember, with some adult themes touched on - the concluding scenes stand out in that regard.I did remember the cast, however. Malachi Pearson is perfect as the voice of the titular character, while Christina Ricci is good in the lead live-action role. Bill Pullman spearheads the rest of the onscreen talent well. One casting note: A young Devon Sawa has a part, I recently watched him in television’s 'Chucky' - which I’d recommend, fwiw. Another: Clint Eastwood makes a small cameo, as does a certain ghost hunter.Just the *checks notes* four follow-ups have spawned from this release. Off we go..."
    },
    {
      "rating": "10",
      "text": "I was unsure about it at first, how could they possibly redo Casper in a live action and make it seem like the childhood Casper people grew up with, but they did it.  Loved it, recommend this for Casper fans everywhere."
    },
    {
      "rating": "6",
      "text": "----------------------------------6.0/10-----------------------------------"
    }
  ]
}