{
  "id": 4073,
  "title": "Cats",
  "starring": [
    "Francesca Hayward",
    "Judi Dench"
  ],
  "runtime": 110,
  "genre": [
    "Fantasy",
    "Comedy",
    "Drama"
  ],
  "description": "A tribe of cats called the Jellicles must decide yearly which one will ascend to the Heaviside Layer and come back to a new Jellicle life.",
  "releaseYear": "2019",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/aCNch5FmzT2WaUcY44925owIZXY.jpg",
  "categories": {
    "plot": 8.25,
    "acting": 7.043478260869565,
    "ending": 10.0,
    "soundtrack": 5.2,
    "cinematography": 10.0,
    "familyFriendly": 8.0,
    "funny": 6.125,
    "action": 8.125
  },
  "reviews": [
    {
      "rating": "0",
      "text": "bad bad bad bad bad bad bad bad bad bad bad bad bad bad bad bad bad bad bad"
    },
    {
      "rating": "6",
      "text": "I love cats the musical. I gave it a high score cause the cast was perfect. The music was great the numbers were good but! If I see another sleeve of awkward animated moment where u can tell it’s fake! I will scream oh god picture wise it was terrible. It’s so bad you watch it to laugh or to look for the bad animation moments one can’t even focus on the actors or story line cause ur focused on why the fur and body are going the opposite way of the character lol. Definitely not a must see but you will get emotional with Jennifer Hudson and amazing voice!"
    },
    {
      "rating": "2",
      "text": "It's a big disappointment how this film can ruin one of the best musicals ever made in theatre. The new arrengements  are a chemical mess, the acting is poor, can't believe Dench & McKellen are involve in this."
    },
    {
      "rating": "5",
      "text": "The CGI is off-putting as is the menacing tone of much of the movie, but the latter at least has a basis in the Broadway musical. Ian McKellen’s part was outstanding, everyone I went with agreed it was the best part. The choreography could have been better, but was done no favors by the editing. All in all, it’s not as bad as critics are making it out to be."
    },
    {
      "rating": "1",
      "text": "Spoiler alert! This movie sucks. Id have rather smelled your fart.  id have rather had monkeys throw poop at me"
    },
    {
      "rating": "3",
      "text": "I have to admit that I enjoyed the dancing and much of the singing, BUT Andrew Lloyd Webber's show just doesn't translate to the big screen. When I saw it the audience kept laughing when the characters made feline gestures."
    },
    {
      "rating": "1",
      "text": "The visuals were awful throughout the entire movie.  The writing and thematics were \"meh\" at best, and I didn't enjoy looking at the characters."
    },
    {
      "rating": "6",
      "text": "Cats is not as bad as the critics say it is, but it has obvious issues. While yes in the beginning I did not think this thing was gonna go well, I was at the verge of tears because of how much laughter I was trying to hold back when I first saw the CGI fur. Every actor in this movie thought they were in a different movie. Jennifer Hudson/Francesca Hayward played it too seriously while Rebel Wilson/James Corden were just too comedic and light hearted. While the first two I mentioned did great, the ladder not so much. Rebel Wilson's song was so humiliating and overly sexual that I was laughing AT the film. The mice were so creepy and the roaches were revolting. James Corden did ok but his comedy was a little bit off. Idris Elba was very strong and seemed like an effective \"villain.\" Just leave on the coat Macavity. Taylor Swift had the best performance of the movie visually. Her song was dazzling and so visually pleasing. Her light British accent was nice and her voice was angelic yet strong. I just think that her and Macavity lacked chemistry, Their relationship (maybe???) should've been explored much more. Memory was so vocally amazing and JHud was a powerhouse. Francesca Hayward's Beautiful Ghosts (Taylor Swift penned) was well \"beautiful\" and helped furthered the story better than any song in the film. Overall this film was solid but character development was sparse and some of the cats were severely under used (Taylor Swift.)"
    },
    {
      "rating": "0",
      "text": "Horrible, parece una pelicula de furris. Horror una mala decision recurrir a esos graficos"
    },
    {
      "rating": "7",
      "text": "This movie is great... if you know what you are watching. This movie is intended for fans of the musical, and not for critics and film reviewers alike who have not seen the musical, or read the poems. Yes, I’ll admit the CGI is very choppy in some areas, particularly towards the end, which is not something you want in a movie, to say the least. The controversial CGI design, however, can be easily overlooked and even ignored if you’re able to get into the story and experience of Cats. As a fan of the musical and the poems, I greatly enjoyed the film, and had a lot of fun with it. The only other criticisms I have about the film are nerdy nitpicks which I don’t want to get into (E.g: Skimbleshanks should not have a moustache!), or casting decisions that I also don’t want to get into (E.g: Rebel Wilson as Jennyanydots). Overall, the film is wonderful enjoyable if screened to the right audience, but unwise casting decisions and unfinished CGI work pull it down. I would give the film three and a half stars, but Google doesn’t let you do that here."
    },
    {
      "rating": "7",
      "text": "It took me about thirty minutes to get into this movie. I love the beautiful dancing by the cat Victoria. And I loved hearing Jennifer Hudson singing Memories. Also I loved the humor of James Cordon and Rebel Wilson. Also Judy Dench was great. I loved the tapdancer. This movie is not for everyone, but if you understand that it is a musical with singing and dancing, you should be satisfied."
    },
    {
      "rating": "0",
      "text": "Fãs de divas pop passam muita vergonha. O filmeco é horroroso sim, e não há argumento que justifique o contrário."
    },
    {
      "rating": "9",
      "text": "I know the critics have mostly canned this film, and I went along with my wife, not expecting much, but I’m happy to say that I was surprised at its pure entertainment value. I never saw Cats when it was a musical stage sensation, but I understand that this movie stays true to its theatrical roots. TS Eliot’s work was probably not written with a theatrical adaptation in mind, so the writers have done well to spin this book of poems into a loosely knit plot. There is also a touch of Eliot’s mysticism. The characters, played by a Who’s Who of actors, convey a great deal of warmth and heart, and the production values are top notch.  Don’t go expecting a complex plot. Just go to let the experience wash over you."
    },
    {
      "rating": "10",
      "text": "I absolutely loved this movie and so did my daughters (age 23 and 26). We've seen the play though and loved the play but we liked the movie even more! I believe those who appreciate dance and music (actual talent) will enjoy it."
    },
    {
      "rating": "0",
      "text": "The most horrible movie I've seen in a long time. Trash. Old Cats like 100x better."
    },
    {
      "rating": "0",
      "text": "The most horrible movie I've ever seen. It sucks. Why did they dare to do such crap? And all the reviews that are in green, that chance that they are all fans of the singer Taylor swift hahaha, ridiculous all of them who don't  accept that it is a very bad movie."
    },
    {
      "rating": "10",
      "text": "I loved the movie!The critics and reviews suggesting it is too sexual... clearly have their mind in the gutter. It is an entertaining adaptation of a Broadway MUSICAL- something that most seem to be forgetting.If you appreciate great dancing, singing, and fun- this movie is for you! If you love to jump on the bandwagon and hate whats popular to hate, might as well just save your money."
    },
    {
      "rating": "0",
      "text": "Worst movie of the decade! A mess! The soundtrack flopped brought to us by Taylor Swift. Tayvodoo strikes so bad. Swifties aren't streaming and paying to watch this montrosity."
    },
    {
      "rating": "10",
      "text": "What an experience! Cats overflows with creativity and ardor and spirit and energy that comes from the cast onscreen and the people behind the scenes. The sets are mysteriously beautiful. But I think I was most impressed with the dancing choreographed by Andy Blankenbuehler and the dancers especially Francesca Hayward and Les Twins. But IMO all the Jellicle dancers put on an amazing show, so much so that there were moments in the film when I kind of wished director Tom Hooper had followed some of the full-cast dances a bit slower. But then again there is something to be said for Hooper's infectuous whirling effect. The singers are as good as the classic songs. Taylor Swift is a flirtatious Bombalurina who sings the nasty Macavity's (good job, Idris Elba) theme song as well as parts of \"Beautiful Ghosts\" & the full version over the end credits. . Jennifer Hudson's tortured, emotional version of \"Memory\" works wonderfully most of the time, especially at the end. This \"Cats\" casts Victoria in the starring role of an innocent homeless kitten rescued by some of the Jellicle tribe. I don't want to be a spoiler so I'll just say Victoria has some adventures as she gets to know individual Jellicles, some more than others. She follows one of Grizbella's \"Memory\" preludes with a sweet and touching version of \"Beautiful Ghosts\". If I try to comment on everyone and everything that makes Cats Cats this would be a very very long review! So just a few more. The comic relief provided by various cast members was uneven, some good, some \"meh\" but these short scenes do make Cats more entertaining and give audience members a chance to catch their collective breath. The most marvelous \"performances by an actor\" were  Judi Dench as Old Deuteronomy and Ian McKellen as Gus the Theatre Cat.  There is something so warm and inviting about Dame Judi's facial expressions; she was covered with just the right amount of digital fur so that the audience could be moved by them. Sir McKellen is a treasure.He plays an old, seen-it-all actor reminicing about his long theatrical career with a sense of pride and joy in his craft that is genuinely moving. Thank you, Andrew Lloyd Webber and everyone who brought this feline magical mystery tour to the P.S. A quick comment on the \"trailers\" ~ having seen the complete movie, I feel sorry for those whose jobs were to create 3-minute trailers to communicate the merits of this movie. The film contains so much more than can be squeezed into a trailer."
    },
    {
      "rating": "4",
      "text": "T. S. Eliot had written a book of verses regarding cats and wrote his publisher the following:\"....there might be a part that children wouldn’t like and part that adults wouldn’t like and part that nobody would like. The mise-en-scène may not please. There seem to be many more ways of going wrong than of going right    (to Geoffrey Faber, 6 March 1936)   \"Cats\", the Broadway musical, ran for 18 years and 7,485 performances opening in 1982. The previous year it opened London and now, 83 years later, it is on the silver screen. (Do people still call it that?)The first time I saw it on stage I went to the Winter Garden theatre and was interested how they changed the whole theatre into an alley and additionally  sparked my interest when you could see the 'cats' roam all over including the back of customer's seats. I didn't really pay attention to the story because there really wasn't any but watching the actors being cats was a joy of its own. It was more of an audition for some individual cats of which one would be chosen for the 'Heaviside Layer' and come back to a new life.The musical score by Andrew Lloyd Webber, using the verses of T.S.Eliot plus some help from Trevor Nunn and Richard Stilgoe, giving the world the song \"Memory\".Many people hated the show but more, specifically parents, their kids and tourists loved the show eventually making billions of dollars.The movie opened this week and will, too, have some loving it and others hating it but I think the latter will win. I don't fall into either category as I didn't feel one way or the other. Being a huge Jennifer Hudson fan I was anxious to hear/see her deliver \"Memory\" and she more than makes the song her own. Judi Dench, who was to be in the original production but who had to leave due to a Archilles tendon snapping a week before the show was to open, is here to decide who will go to the Heaviside Layer and Ian McKellen as Asaragus, Gus for short, is a once famous actor and now is old, has cerebral palsy and hopes to 'win' the chance for a new life.Various other cats are played by Idris Elba, Rebel Wilson and James Cordon while Francesca Hayward makes her film debut as Victoria a new cat abandoned by her human owners. There is also an excellent ensemble of professional dancers, many from the Royal Ballet, with choreography by Andy Blankenbuehler.The cat 'outfits' along with the disconcerting CGI effects and the direction by Tom Hopper lacks the charm of the stage productions. Though I am glad I went to see this version of \"Cats\" I won't recommend it as it is one of the many of less successful Broadway to Hollywood musicals.The movie runs an hour and 50 minutes and is rated R but I didn't hear/see anything that would be offensive for young kids who would probably get involved watched the cats."
    },
    {
      "rating": "7",
      "text": "See this movie, and decide for yourself. CATS does not deserve the scathingly negative reviews that many critics gave it. With all musicals, stage or screen, the theatre goer must first knowingly suspend disbelief in order to allow themselves to be swept away, and drawn into that world. This is T.S. Elliott’s poetry, written in 1939 and combined with modern day glitz, technology, spectacle, song and dance. This creative crew did a fine job brining it all to life, and I was very entertained! Critics are just that... critics!"
    },
    {
      "rating": "9",
      "text": "My husband and I really enjoyed the film. Despite all of the negative reviews, it is pretty true to the stage production with some slight changes. Francesca Hayward was an enchanting Victoria, Dame Judi Dench was charming, and the CGI really wasn’t the disaster critics claim. Cats has always been a whimsical, idiosyncratic musical without a hefty plot line. The joy of Cats is in the wonderful music, dancing, and the unique feline characters. If you have no sense of fun or appreciation for the arts and can’t suspend your disbelief long enough to simply enjoy some great singers and actors who happen to be in Cat costumes, skip this film. I’m sure there will be another dull, formulaic and unoriginal film you can watch instead. Maybe another Fast and Furious sequel is more your speed ?!?!"
    },
    {
      "rating": "7",
      "text": "This movie is weird, but I loved its weirdness. I was mesmerized by Francesca Hayward as Victoria. Idris Elba and Judi Dench were fantastic. I liked the music. I liked the weird visuals. I liked it."
    },
    {
      "rating": "0",
      "text": "I hate this movie, seriously is the worst movie and the song beautiful flops is only a joke for the true music"
    },
    {
      "rating": "9",
      "text": "Great reworking of a classic. Perhaps the songs are a bit dated now, but the plot is better than the stage show ever was, and the CGI effects are good too."
    },
    {
      "rating": "9",
      "text": "I can't really wrap my mind around how unfair people are to this movie. I loved it. The actors really are giving their all, the songs are great, the choreography is also very good. As someone who seen the original play it's my favorite version of it."
    },
    {
      "rating": "2",
      "text": "It is just stupid cringe fest. Waste of time. Thank god i got ticket for free."
    },
    {
      "rating": "0",
      "text": "About as magical as santa losing rudolph to stage 4 nose cancer on christmas eve, its a no from me"
    },
    {
      "rating": "9",
      "text": "There are so many critics about this movie, but surprisingly, I disagreed with the most. The songs, in general, are pretty good. The editing, tho, should be better. Bombalurina's part was the best and they should've definitely worked out more on her and Macavity."
    },
    {
      "rating": "10",
      "text": "What did you expect? Oh. Do the you think the humans pretending to be magical singing cats look weird? I tell you, if someone was going to make an adaptation of ALW's Cats, i WANTED it to look weird! I wanted it to strange, fantastical, sometimes silly, sometimes oddly serious, and always unlike any other movie out there. In those terms, this film is a wild success. You can argue that you don't like the show on which it is based (I had actually never seen it, nor was I familiar with most of the music,) and that you might have never had any interest in seeing any adaptation of it period, but I feel like most people are merely reviewing the film's existence and not the film itself. If you don't like the look of the film and the performers, what WOULD have satisfied you? It was always going to be humans pretending to be cats. Yes, the CGI fur and make-up looks odd, but I was totally fine with it. I was thoroughly entertained for the entire film. I went to an early press screening, and then took my wife a few days later. Unlike me, she is very familiar with the show and she absolutely loved this film. Even more than I. Are there so rough edges to this film? Definitely. But that's certainly true with similarly toned recent musicals like Moulin Rouge or The Greatest Showman, and I like this film considerably more than those. The cast here is excellent. Ian McKellen is a notable standout. Many of the non-star dancers are exceptional. I think Hooper did an excellent job with the film. A Cats movie was always going to be weird. This is gloriously weird. The more people who hate on it now, the bigger the cult status it will achieve later. This film has its fans. They just need to find each other. This one will be watched for years to come. Just not by everyone."
    },
    {
      "rating": "9",
      "text": "Give me a break- there has never been a plot to cats. This is a fabulous and imaginative production- great fun and  Ian McKellen was amazing. We loved it but know what to expect!"
    },
    {
      "rating": "10",
      "text": "This screams cult classic. Just wait, this will be a beloved fav for many critics in about 20 years."
    },
    {
      "rating": "10",
      "text": "I know this is getting a lot of bad review, but I really enjoyed Cats. This is such a wildly imaginative movie in both story and appearance.In order to help explain the plot, it helps to look at this film's origins. At first, there were a bunch of poems about cats written by T.S. Elliott in the 1930s. Then came the crazy idea to turn them into songs for an eighties musical. It really didn't have any spoken words. A loose story was added to tie the songs together. Now we've got a film trying to to sell this loose concept to a general audience. I don't think it did too bad a job.The movie takes the basic musical and adds some dialogue and a little more to flesh things out. The story is this: a bunch of cats compete in order to win the honor of cat reincarnation. The story still isn't big; a lot of this is just the contestants introducing themselves through song. (You can go through multiple numbers without dialogue.) Still, I feel it works well enough. Don't get me wrong, the whole thing is kind of nuts. We've got a whole bunch of humanoid felines doing a bunch of random stuff. (Also, some of them are magic apparently.) But that's what I like about this. It's basically creative pageantry that is just trying to have fun. (Although, there is this really dark turn in the Jenny Anydots song, which wasn't in the previous works. It left a bad taste.)Director Tom Hooper really tried to keep the highlights of the musical: the songs and the dancing. A lot of musical movie adaptations have to cut stuff for time, but this one is surprisingly intact. The movie manages to keep all but one song I believe. Fans of the original be prepared that they change up the lyrics or musical tempo or style for some of the numbers. (I think the movie was trying to update these to appeal to the mainstream.) Personally, I didn't find any of the changes too outrageous.As for the songs, well Memory, which the musical is best known for, is an excellent piece. The other numbers, though... Well, these contain thirties lyrics and peculiar feel to a lot of them. I think the songs are decent, but they don't compete with a bunch of other musicals. They're a bit of a selective taste. The new song Beautiful Ghosts (the one they usually create for films in order to get a best original song Oscar nomination) is okay. The lyrics are very poetic, but the music can't live up to them.One of the things I like best about this is that it brings back what is missing in a lot of modern musicals: the extended dance sections. The choreography is really good the cinematography does a fluid job of displaying the action. There is a real distinctiveness to people dancing like cats.This movie is eye-candy personified. All the sets are huge, dreamlike, and colorful in a dark neon sort of way (as confusing as that sounds.) There are these big fantastic-looking set pieces and so many of them.The cats are created using computer graphics on mo-cap actors. The people-cats are definitely distinctive looking. The animation for the faces never quite feel natural, but it I didn't find it to be a deal breaker either.For a movie where people act like cats, I'm impressed that almost the entire cast really committed to this. Idris Elba seems to be having a hell of a time eating up the scenery. It's rather fascinating seeing how veteran actors Judi Dench and Ian McKellan take such goofy actions as rubbing heads together or scratching themselves so seriously. McKellan puts so much work into his character's mannerisms that I think this is one of his best roles. The lead Francesca Haywood, a ballerina, does a fine job as the newbie to the group.Remember when I said \"almost?\" Well, Rebel Wilson as Jennyanydots is the only actor who doesn't feel like they're trying to play a character. She's just doing Rebel Wilson stuff and throwing jokes. The character Jennyanydots as she plays her doesn't really match the character as described in her introductory song.This movie, especially the songs may not be for everyone. It's kinda artsy, but I found this to be a truly unique and creative ride. I say give it a shot."
    },
    {
      "rating": "10",
      "text": "I love Cats, although Bombalurina's character appears shortly is the performance that I liked the most. Swift gave everything he had as a cat lover."
    },
    {
      "rating": "0",
      "text": "Sem surpreender ninguém, crítica especializada massacra \"Cats\" e filme estreia no Rotten Tomatoes com míseros 9% e um whiskas podre. Segundo os principais sites, o filme megalomaníaco de Tom Hooper se perde em um CGI preguiçoso e roteiro mal construído que não destaca a atuação de nenhum dos grandes atores envolvidos no projeto, nem mesmo o trabalho de Jennifer Hudson, responsável por cantar a canção mais marcante do musical, \"Memory\"."
    },
    {
      "rating": "7",
      "text": "Brilliant! Surreal and engaging! Wonderful characters, amazing choreography and sets.. Both amusing and touching."
    },
    {
      "rating": "10",
      "text": "Great movie! Great themes and lessons of compassion, love, community, friendship, good over evil, redemption, kindness. Instead of taking your kids to a blood-and-weaponry movie, take them to this one. Memorable music, breathtaking dancing, and wonderful characters to relate to. Too bad the stupid critics wouldn't know a great movie if they saw one. With growing violence in this world, isn't it time to teach the lessons of this movie? I vote for it!"
    },
    {
      "rating": "10",
      "text": "The Best musical movie, I Love that Congratulations Hopper, Your film is amazing"
    },
    {
      "rating": "3",
      "text": "CreepyThere are some things that should stay as drawings like anthro animals, Even if the designs weren’t creepy, Cats would still not be good because of a badly written script."
    },
    {
      "rating": "0",
      "text": "Essa porcaria deveria nem entrar em exibição!que coisa mais ridícula, meu Deus! Eu q não vou gastar 1 centavo com essa merda kkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkk"
    },
    {
      "rating": "1",
      "text": "Cats is poor, Stranger, confused, with performances wtffff. And the Soundtrack daaaahhh"
    },
    {
      "rating": "10",
      "text": "I love it. Quem não gostou, não entendeu o conceito. Conceito quase mata taylor Swift."
    },
    {
      "rating": "10",
      "text": "The magical essence of this movie is the one of the best, rarest and different things we ever see. Is amazing could see something out of the boring same industry. Congratulations."
    },
    {
      "rating": "10",
      "text": "The musical is so good and actually really interesting. I'm surprised that James is actually really good!"
    },
    {
      "rating": "10",
      "text": "Wow, I didn’t think Taylor Swift could look and sound anymore moronic than she already does on a daily basis"
    },
    {
      "rating": "0",
      "text": "Filme bizarro , bem esquisito, a Taylor e a Jennifer hudson são boas , mas o filme é enjoativo , chata e bizarro"
    },
    {
      "rating": "0",
      "text": "Tremenda basura 4squerosa y nula como la carrera actoral de tayjuepvta.El diseño del personaje de Tays1d4 y la pelicula en general  se ven de la Reputation y a pesar de que taych4ncrosa solo aparecio 8 min aprox fueron suficiente para darse cuenta que de actriz se muere de hambre esta m4ldita c0nchuda des4lentada.Por eso ASIB y lady diosa patrones de esta C4Gada de pelicula."
    },
    {
      "rating": "3",
      "text": "It is as creepy as all reviewers claimed it to be. Heed the warnings are true!"
    },
    {
      "rating": "1",
      "text": "Judhaezktsktstfsjts6tesoydyedglsktzegkgxuraktsutsirsotsitskgirdirsoyfe hckhsc shochlcskh slh sk ehk elh elh el"
    },
    {
      "rating": "10",
      "text": "Ignore the critics and make up your own mind. I have see the live show 3 times since 1985, I loved it every time, the film is exactly what I expected, I got it, shame the critics expected something different, I got it, I loved it J Hud was stunning"
    }
  ],
  "recommendations": [
    "sweeney_todd_the_demon_barber_of_fleet_street",
    "hairspray",
    "mamma_mia_here_we_go_again",
    "the_greatest_showman",
    "vivo",
    "burlesque",
    "trolls",
    "into_the_woods",
    "mary_poppins_returns",
    "moulin_rouge",
    "jingle_jangle_a_christmas_journey",
    "begin_again",
    "yesterday",
    "sing_2",
    "cruella",
    "strange_magic",
    "sing",
    "my_little_pony_equestria_girls_rainbow_rocks",
    "over_the_moon",
    "grease",
    "bohemian_rhapsody",
    "in_the_heights",
    "rio",
    "peter_pan",
    "happy_feet_two"
  ]
}