{"id": 3854, "title": "Cell", "starring": ["John Cusack", "Samuel L. Jackson"], "runtime": 98, "genre": ["Horror", "Science Fiction", "Thriller"], "description": "When a strange signal pulsates through all cell phone networks worldwide, it starts a murderous epidemic of epic proportions when users become bloodthirsty creatures, and a group of people in New England are among the survivors to deal with the ensuing chaos after.", "releaseYear": "2016", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/c5N6Pw3P6TqQnGcqiVkhO9u85KB.jpg", "categories": {"plot": 4.571428571428571, "acting": 4.0, "ending": 2.25, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 3.0, "funny": 1.7777777777777777, "action": 5.0}, "reviews": [{"rating": "1", "text": "I'm stunned by how awful this film was made.  The green screen in this film was the worst I've seen in a long time. Snow's never looked so fake.  Finally the stories no much better as it goes from ridiculous to boring to absurd.  F"}, {"rating": "4", "text": "Feels lazy and bored with its very existence. It's clear the original King story it's based on has some interesting takes on the zombie genre (and at the time of its writing was timely in regards to cell phones zombifying our culture) but this film cannot muster any energy towards exploring those or doing anything but marching heedlessly forward towards a \"conclusion\"."}, {"rating": "2", "text": "They took a best-selling novel, added big-name actors to the project, and made what comes off as a B movie.  It just looks shoddily made and the \"zombies\" look plain silly. Comical, actually. I love the zombie genre but the most poignant criticism I read of this film is that it \"lacks a pulse.\"  Making a play on words about the cell phone pulse that makes people killer maniacs.  Because this one doesn't give much of a thrill.  It's pretty bad when they make a movie that is supposed to scare people and they laugh at it."}, {"rating": "2", "text": "Cell completely fails on almost every level. It's poorly directed, it looks bad, has phoned in performances (save for Samuel L. Jackson and Stacey Keach) it's a shockingly bad script from Stephen King, and it's just confusing and poorly paced. Where the movie excels, however, is at being an unintentional laugh-out-loud comedy hit. Seriously, this movie is hilarious! I can't say I hated watching it at all."}, {"rating": "4", "text": "C'est d'après un bouquin de Stephen King cette épidémie de zombis qui se propage via les téléphones portables ! incroyable, faut croire que le célèbre écrivain est à court d'idées ou bien qu'il est devenu sénile...En tout cas, des **** malins (?) en ont démoulé vite fait mal fait un nanar qui ne paie pas de mine et se repose principalement sur les règles passablement usées du genre... à savoir le film de zombis lambda. Néanmoins, l'Appel des Zombis (le titre français de Cell Phone) se révèle assez efficace dans sa première moitié, voire carrément hilarant par endroits (le genre est d'ailleurs propice à ces moments d'hilarité sporadiques à l'insu de son plein gré ou non).Cusack et Jackson font en tout cas le boulot sans forcer alors que le réalisateur se laisse trop souvent aller à la caméra à l'épaule. Et la caméra à l'épaule, c'est le mal, le mal incarné en caméra : ça file la migraine. Stephen King oblige, l'histoire prend un vague tournant fantastique, puis se perd en incohérences surtout à la fin, incroyablement bâclée. J'ignore si le scénario a pris des libertés ou si le bouquin est vraiment de la merde, cela dit.Un nanar parfois drôle donc mais décidément trop mal foutu pour espérer convaincre qui que ce soit, même en étant gentil. Heureusement, on ne s'y ennuie (presque) pas."}, {"rating": "1", "text": "What a mess! The beginning can also be pleasant, but after just ten minutes the film begins to give the viewer a disappointment after another. Characters developed superficially, explanations poorly provided and with one of the ugliest endings in the history of cinema, which tries to give a sort of '' triple twist '' that only annoy the spectator.A scorching disappointment."}, {"rating": "0", "text": "amazing **** incredibly stupid plot. King untalented playwright. This is not his first fiasco.\rIs it a comedy? then why I wanted to laugh already in the sixth minute."}, {"rating": "4", "text": "Not sure what went wrong on this one here !  This movie has a pretty good director and based on the novel by  Stephen King with a stars like John Cusack and Samuel L. Jackson  it suppose to be categorize as a Horror, Sci-Fi, Thriller but in I thinks its more of a comedy is some case something just went the other way with this movie might be a bad cgi and some bad idea with those indicted people that it could be much better movie what a waste !"}, {"rating": "1", "text": "The Stephen King had so much promise when it came out. It was a little tough screening it when the folks watching with you end up laughing at the first 10 minutes of the movie.  I always thought that John Cusack chose really good projects.  I guess I should stop thinking that about now because he's close to achieving Nick Cage status."}, {"rating": "2", "text": "Im suprised cell is not a comedy bc i was laughing my ass off throughout the entire movie. Im not going to spoil the movie but the ending is so damn terrible that it made me laugh how terrible it was. The zombies are laughable bad and not scary but they are funny. Cusack and jackson are the only good in this movie but there not good enough to save this crap. Dont waist your time and money trust me. Overall i feel bad for Stephen King."}, {"rating": "4", "text": "Another bad Stephen King adaptation, even worse when you realise Mr King wrote the screenplay.  Though it's the direction of the film which makes this dull and boring.  It's too short to do the book justice... and the novel wasn't that good.  Only Samuel L Jackson and Stacy Keach put any emotion into their characters.  Nice idea badly produced."}, {"rating": "1", "text": "The \"trolololol\" song is played extensively during a scene in this movie. Not sure if it's coincidence, or if it's the filmmakers laughing hysterically at their audience, who were hopeful they'd be getting a good Stephen King movie. Either way, this movie belongs in a cell."}, {"rating": "5", "text": "Stephen King is quoted as saying that cell phones are \"21st-century slave bracelets,\" and frankly I guessed this might be so while watching \"Cell,\" based on his novel. If you like anything that hints of a zombie apocalypse then you might regard the film as passably OK.  It has some problems.  It's about non-zombie-type zombies.  They do certain things that seem impossible.  Admittedly, zombie flicks are all about the impossible but \"Cell\" provides no real explanation for how the impossible is achieved or what's really going on and in the end it all seems kind of half-assed.  The acting is OK but even Samuel L. Jackson, John Cusack, and Stacy Keach aren't enough to make this tepid production particularly watchable.  Frankly, I'd suggest trying out \"The Signal\" (2007) instead, a very low-budget non-zombie zombie indie that makes characters stand out."}, {"rating": "7", "text": "It started off pretty well but quickly went downhill. The acting was decent and the movie was overall kind of entertaining but the movie was very stupid, filled with horrible CGI and had a pretty bad ending. It's not that bad of a movie, it's just not very good.If you're looking for a movie to watch on a friday night with your brain turned off, you should give it a chance. Otherwise, I would recommend something else."}, {"rating": "6", "text": "OK movie but very disappointing!\rCould had been far better film instead!\rIt had all the potentials to be phenomenal horror movie but it just failed big time sadly."}, {"rating": "4", "text": "The problem with the movie isn't it's cast (Most of whom give pretty good performances), the low budget, or even it's rather derivative zombie movie formula. It's the writing. This is a very unsatisfying adaptation of the book. The movie is at it's best when it's using scenes straight from the source material. This just doesn't happen very much at all. We see familiar bits and pieces along the way, but for the most part the movie largely does it's own thing, and poorly at that.Those who have read the book will know that it wasn't your average zombie story. King infused the apocalyptic scenario with his unique sense of imagination. The \"Phoners\" were gifted psychic powers, connected by a hive mind, and led by a menacing Phoner of higher intelligence and a thirst for vengeance. The movie touches on those elements, but fails to use them to any satisfying results. They're just sort of there and only serve to confuse those who didn't read the book and tick off those who did with how ineptly they are handled. The plot itself is also only a hollow imitation of the real thing. I understand the obvious budgetary restraints would have prevented an entirely faithful adaptation, but they certainly could have done better than this. It follows the overall outline of the book's plot to a degree, but it's filled in with original moments. None of which are good. All the original stuff is just badly written, particularly where the dialog is concerned. It's all a mad rush to a crappy conclusion. The interesting and important bits are skipped over in favor of a whole lot of nothing. You want to know the really shocking part about all of this? It was written by Stephen King himself. He butchered his own book onscreen! Stick to the books King, because you just proved that you can't write a good movie. Now, I could have dealt with the less than faithful adaptation of the book provided the original stuff was good, but it's not. For my fellow fans of the book, I highly recommend skipping this one. It doesn't do the source material justice at all. As for those without knowledge of the book, but are hoping for a solid zombie flick, also look elsewhere. It's just a bad movie.4.5/10"}, {"rating": "7", "text": "An original story line, the use of cell phones to make people \"crazy\" or \"zombies\" or something.  The normal people are on the run since most everyone has been \"taken over\" by the rampant use of cell phones.  What to do?  Typical \"survivor\" type movie but I gave it extra points for the new story line.  Great ending."}, {"rating": "3", "text": "Poop! With a really s****y ending. Shame to see John Cusak have to stoop so low as to make this film. As for Samuel L, he must be one of the busiest actors in Hollywood as the guy seems to have been in more movies (good and bad) than I've had hot dinners."}, {"rating": "4", "text": "Very poor, despite the presence of John Cusack and Samuel L. Jackson.'Cell' is basically 'Land of the Dead' without the proper zombies, at least that's what this 2016 flick kept reminding me of. That George A. Romero film is good, this Tod Williams release is not. It's a mess throughout and lacks any tension, freshness or uniqueness.Cusack and Jackson should be a good pairing, yet I don't even recall anything from their respective performances just minutes after watching. Both are capable of a lot better than this, especially Jackson. No-one sticks out behind that duo, though it's neat to see 'Prison Break' actor Stacy Keach involved.One to avoid, I'd say."}, {"rating": "4", "text": "Using your phone turns you into a zombie but a group of \"normals\" are walking up North to do...something."}], "recommendations": ["dreamcatcher", "the_mist", "ghost_rider_spirit_of_vengeance", "the_thing", "i_am_legend", "the_day_the_earth_stood_still", "indiana_jones_and_the_kingdom_of_the_crystal_skull", "hellbound_hellraiser_ii", "halloween_iii_season_of_the_witch", "book_of_shadows_blair_witch_2", "eragon", "see_no_evil", "doctor_strange_in_the_multiverse_of_madness", "from_dusk_till_dawn", "the_grudge_2", "world_war_z", "percy_jackson_sea_of_monsters", "the_twilight_saga_eclipse", "army_of_the_dead", "van_helsing", "the_happening", "the_amityville_horror", "jonah_hex", "poltergeist", "suicide_squad"]}