{
  "id": 1087,
  "title": "Central Intelligence",
  "starring": [
    "Kevin Hart",
    "Dwayne Johnson"
  ],
  "runtime": 107,
  "genre": [
    "Action",
    "Comedy",
    "Crime",
    "Mystery"
  ],
  "description": "After he reunites with an old pal through Facebook, a mild-mannered accountant is lured into the world of international espionage.",
  "releaseYear": "2016",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/7irCMBIivXAqjZ7MgZoGVLrgACR.jpg",
  "categories": {
    "plot": 6.1521739130434785,
    "acting": 5.95,
    "ending": 6.111111111111111,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 6.0,
    "funny": 6.674157303370786,
    "action": 6.066666666666666
  },
  "reviews": [
    {
      "rating": "7",
      "text": "No, it's not high art, but it's pretty damned funny, and most of it lies at the feet of Kevin Hart.  He's hilarious, and Dwayne Johnson is GREAT with him.  Love the cameos, too.  The material is not inspired, but if you think this is the sort of movie you'd like, you'll probably end up having a great time with it."
    },
    {
      "rating": "6",
      "text": "Central Intelligence is a buddy cop comedy that aims low and succeeds. The chemistry between Kevin Hart and Dwayne Johnson is what carries the film and elevates it from the predictability of its recycled plot."
    },
    {
      "rating": "6",
      "text": "The bloopers reel after the movie ended was funnier than anything in the movie. Most of the movie people were giggling at serious scenes because everyone came in with the mindset that its supposed to be a comedy. Kevin Hart is overly serious all the time and Dwayne is forcefully goofy. The chemistry works at times but the plot doesn't. Its like a really bad buddy cop movie where you have no clue who is the good cop and who is the bad cop. Just wait for it come out on Netflix or downloads, not worth a theater visit."
    },
    {
      "rating": "6",
      "text": "Another Comedy Does Not Fulfill What Promises\r Dwayne Johnson and Kevin Hart join forces in a predictable comedy and not as extraordinary as its grosses at the box office.\r \"Central Intelligence\" is a classic buddy cop film (CIA agents and everything else) starring two of the personalities most influential and striking of North America, Johnson and Hart -  MTV Awards 2016 was presented by them and will be together in the remake of \"Jumanji\" next year - must save the world of a corrupt cartel that threatens the global economy. It doesn't seem a very original plot, nevertheless, it is the impact of its protagonists that makes spectators buy one ticket to see it. I did it and discovered the truth.\r Directed and partly written by Rawson Marshall Thurber, the story saturates a cliche argument with predictable and ridiculous plot twists, but which undeniably is fun. Chemistry of the pair is not brilliant nor funny like Poehler and Fey, nevertheless, they successfully establish their connection and dazzle talent and joy. Well made jokes and a few unexpected cameos molded the surprises of the film, but it is not enough to hide the doubtful development. Accept it, Hart and \"The Rock\" do not have enough material to keep a comedy that abuses its duration (1 hour and 47 minutes), that only manages McCarthy, maybe, it would have been better a lenght lighter and shorter.\r 20 years ago, Calvin Joyner (Hart) -nicknamed \"The Golden Jet\" - was the star student and champion of guys, therefore, he is commemorated by the sycophant director in front of school, such attention is diverted by an atrocious action, an psychological aggression on the personality of Bob (Johnson), overweight boy is victim of school bullying and he is thrown naked in front of hundreds of teenagers; that's where Calvin gives him his jacket so that covers up himself, the guy comes out as grateful as sadden by the event, the first encounter of a disorting friendship. Currently, the boy with the future more promising, works as an accountant, has a humble house and lives with his wife Maggie (Danielle Nicolet). The guys at school have organized a meeting for all students of that period, which do not like Calvin on account of his drastic change of life and his abrupt change of thought. Social networks are a viable link to meet people, Calvin knows it and decides to accept an invitation from Facebook, having a night of drinks with his renewed friend from high school. Starting from there, it unfolds the meet of their lives, what do you do, where do you live, with whom; Stone manages to stay in the house of his friend, he realizing that it CIA would come to the following day claiming that his friend of the last night is a dangerous criminal.\r Thurber carried out an acceptable work, a comedy that we've already seen before full of unnecessary twists and a few funny jokes starring  by the real stars, \"The Rock\" a brawny with much, much talent and Hart a little guy with much, much inventiveness. It was not a disappointment, but the pieces did not fit together in the filmic puzzle."
    },
    {
      "rating": "8",
      "text": "In metascore I would rate this an 84. This movie is 100% HILARIOUS and the plot is funny and unique. The characters are funny and the things that they go through is also 100% funny. Well it is still flawed but it is still 100% funny."
    },
    {
      "rating": "7",
      "text": "Central Intelligence is funny yet quite predictable. This action comedy film portrays two things. First, about a man, who has been bullied  and Second about a  famous and respected in their high school lives. These guys after almost 20 years finally met. The movie tells the viewers that we are changing. We are progressing through the years. However, the sad part is the scars that brought of bullying. Letting go became the highlight of their school reunion at the end of the film."
    },
    {
      "rating": "6",
      "text": "Hart and Johnson have solid chemistry and there are enough belly chuckles to make it worth your while. But what holds it back is being great is a lazy script and narrative and Johnson's man-child persona (he talks like a 13-year-old the entire film, and it gets annoying after a while). Overall it's solid, but given the talent involved it should have been better."
    },
    {
      "rating": "10",
      "text": "Four of us saw this together and we were laughing through the whole movie.  I can't remember the last time I saw a movie that was this funny.  Dwayne Johnson and Kevin Hart together were reminiscent of some of the comedy teams of old.  If you want funny, then this was funny."
    },
    {
      "rating": "0",
      "text": "This film is not funny. It is actually really confusing and makes no sense in the end. Do not waste any of your time or money on this movie. 2 hours of my life that I will never get back."
    },
    {
      "rating": "6",
      "text": "Though the plot is thin, Central Intelligence uses the hysterical chemistry between Dwayne Johnson and Kevin Hart to deliver a solidly crafted comedy."
    },
    {
      "rating": "4",
      "text": "The problem is that who's even going to care about a film like this when another major movie is being released today? No, this isn't as major as it feels like. It might fell more like minor, but that's the only thing Central Intelligence is going to be when it automatically hit theaters. Kevin Hart and Dwayne Johnson did not save the world from making them watch their film in theaters. Okay, maybe some might watch it and love it, but not everyone's going to be see this a lot."
    },
    {
      "rating": "6",
      "text": "Dwayne Johnson and Kevin Hart team up to solve a confusing case of national security. Johnson's character was bullied in high school, where Hart's was a star. 20 years later, the tables have turned and Johnson is a pumped CIA agent, while Hart is an accountant. Johnson creates a sweet character, as he continues to develop his considerable comic skills. Hart does more panic reacting than launching the jokes, but his manic style is usually entertaining. There are a few quick action scenes, but most of the time is spent with the starts interacting. The movie moves with an energetic pace and the duo has enjoyable chemistry. On the other hand, much of the dialogue isn't very witty (and re-hashes the same themes) and there aren't enuff really funny bits. It's amusing, but doesn't live up to the comic potential."
    },
    {
      "rating": "7",
      "text": "Hart and Johnson prove to be a great comedic duo. The Rock in particular provides what is one of the most unique and memorable performances of his career. Kevin Hart provides his standard motor-mouthed brand of humor even in the straight man role.\r So the results here aren't exactly going to blow you away. That being said, there are still plenty of laughs here. It's just that some land with a dud. Johnson's character can be a little too over-the-top at times. No fault of the actor, it's the material he's given. His ability to go all out with it is appreciated. There are also some really great and hilarious cameos.\r The plot is very familiar in a lot of ways. The movie tries a little too hard to keep you guessing whether or not Johnson's \"Bob\" is really a good guy or actually the villain. It does succeed at making you think twice on more than one occasion. That's partially due to how oddly the plot is handled. It's ultimately not a big deal, but a touch irritating nonetheless. On the upside it leads to some funny gags and an interesting message about bullying.\r There is also a slightly cheap feel to this. The action is a touch awkward to watch and the visuals of the world have a very studio set feel to them. You can tell the money went towards the talent.\r There are plenty of laughs to be found here. Maybe it won't keep you rolling on the floor, but it does introduce us to a great new comedy duo. I can't wait to see more of Johnson and Hart onscreen together. They are a blast. They also manage to elevate the movie above it's flaws and make more laughs come from the material than anybody else could have. I consider that a success."
    },
    {
      "rating": "5",
      "text": "Don't get me wrong by reading the giant \"5\" next to the review. Read what I have to say first! This movie is very funny. VERY funny. Kevin Hart delivers a great performance and had us all laughing. However, The Rock could've been a bit better. He seemed to act like he did in all of his other films, pulling off a bit of a \"macho man\" which doesn't really fit this film.\r While there were funny moments, this movie was EXTREMELY cheesy, with predictable actions such as Hart's character turning Johnson's in but then coming in to save him after realizing what he shouldn't have turned him in-because friends, even if you don't know each other much, stick together, right? The implement of \"feel-good\" moments just sorta made the movie not as fun as it would've been had there been more tension and more of what the audience wanted. Plus, at the end when The Rock took his clothes off was way too corny. This movie is the personification of a stereotypical Hollywood feel-good comedy."
    },
    {
      "rating": "8",
      "text": "This was definitely one of those movies where you will be laughing from pretty much the beginning until the end. This was probably one of the more funny movies I have watched in a while. The chemistry between Kevin Hart, and his typical humor and Dwayne Johnson' more buddy buddy, strange, someone has dropped him as a baby humor is hilarious. There are plenty of laughs in this movie, and for the most part the humor is pretty clean overall. Yes there are cursing, but not all that much.\r Some things I didn't like about the movie was I felt the plot was a bit too far fetched, I mean come on. At the end they just go on hunky dory and let Kev and Bob go to the reunion even though Kev shot at one of them (by accident) and Bob basically almost killed everyone.\r Overall, you aren't coming into this movie to watch the plot be crystal perfect, instead you are coming for comedy. This movie does that extremely well."
    },
    {
      "rating": "0",
      "text": "The writer and Jason Bateman take license to bash Scientology in distasteful humor.  I don't know much about Scientology but I feel they have a right to their religion without it being trashed by a 3rd rate actor and writer.  #bigots"
    },
    {
      "rating": "5",
      "text": "کمدی اما جنایی ...\r این فیلم دو ژانر ناسازگار اکشن و کمدی را که این روزها در هالیوود رواج دارد، با هم ترکیب کرده است .\rاطلاعات مرکزی حس نوستالژی فیلم های ماجراجویی دو نفره را دارد که یک ماجرای هیجانی - احساسی غیر قابل باور و رابطه ی نزدیک و احمقانه ی دو نفر را به نمایش میگذارد .\rفیلم آنگونه که به نظر میرسد از هم گسیخته نیست و در هر سه داستانی که تعریف میکند ، داستان آن بر اساس کم اعتمادی و احساس ناامنی مردانه شکل میگیرد .\rاما به جای آنکه در این احساسات مردانه و به طبع آن این محتوای ضد زنانه ای که از فیلم برداشت میشود غرق شود ، به فیلم جلوه ی شیرینی بخشیده است .\r کمدی - جنایی زیبایی است و دو ژانر ناسازگار را با کارگردانی و بازیگران خوب تبدیل به فیلمی خوب کرده است ..."
    },
    {
      "rating": "4",
      "text": "Central Intelligence is an action-comedy, but succeeds at neither aspect. Dwayne Johnson & Kevin Hart play off each other well, but the story and characters are too poorly written to ask the audience to invest in the film. Ultimately forgettable, it never accepts its lowbrow humor wholeheartedly."
    },
    {
      "rating": "6",
      "text": "More enjoyable than it has any right to be, Central Intelligence is broadest of the broad and safest of the safe, but with an appealing cast and a goofy good nature it skirts by just fine."
    },
    {
      "rating": "7",
      "text": "Kevin Hart plays his type-cast role of average guy thrown into a crazy situation (like Ride Along). The real star is Dwayne \"The Rock\" Johnson, He's priceless and truly shines as the surprisingly chill CIA agent. On the whole, It's a pretty predictable but still very enjoyable. Plenty of laughs too, Which is what you want in a comedy. Wouldn't be surprised to see them turn out a quick sequel if it does good at the box office."
    },
    {
      "rating": "6",
      "text": "Twenty years is a big gap for a big change to happen in anybody's life.\r This film had the potential to be the best comedy of the year, it opened so well, but did not conclude on high. Like everything suddenly halted, the story came to an end with giving clichéd reason. Though the actors were amazing, and many jokes were awesome. The lead two combination was among the best Kevin Hart worked so far like in the recently with Ice Cube and Will Ferrell.\r The opening scenes set off the tone for the rest of the film. Twenty years later, an adventure begins, but that part was so familiar, except the influence of the opening part that carried till the final scene. Even though slightly unpredictable scenes, because the diversions were neatly done against what viewers could expect. The focus was largely on the lead pair, so theirs undertaking was kind of faded away.\r There's a guest role at the end, also some behind the scene clips during the end credit cheers us. I think it is a good comedy than it looks, but definitely not the best. Its not the narration, but the actors that makes worth a watch. The stunt sequences were just okay, but utilised according to what the story required. Overall, an enjoyable, time pass film.\r 6/10"
    },
    {
      "rating": "6",
      "text": "A buddy comedy that has its laughs, but is extremely predictable and never really hits consistently.  The Rock and Kevin Hart work very well together, and I would be interested in seeing these two in a better movie.  This one is just a little above average.  B-"
    },
    {
      "rating": "7",
      "text": "This movie is pretty fun and quite funny. Dwayne is not the best actor. But if you enjoy Kevin hart then you will certainly like this movie. Otherwise it's probably not worth seeing. But I enjoyed it, had some very good moments."
    },
    {
      "rating": "7",
      "text": "I felt like everyone in the theater was very confused to the storyline in this movie, but I think the movie was supposed to be that way. In the film Kevin Hart is put into a ton of hilarious and crazy situations that lead to some really funny jokes in the movie. The jokes in the film were all really good, I feared that the trailers had revealed all of the funny bits of the movie but I was way wrong, Dwayne Johnson and Kevin Hart are a hilarious duo and should consider doing more films together.\r Overall, the movie has kind of a confusing who do you trust? storyline, but the jokes and stellar cast make the movie really enjoyable and a fun watch."
    },
    {
      "rating": "7",
      "text": "despite  my disdain for Kevin Hart, I have to admit this was a surprisingly decent comedy and that is mainly aided by his chemistry with The Rock, who also gets some incredibly funny moments in the film.  The only time it fails is when it tries to have too much of a plot which doesn’t quite work, but they could have done a hell of a lot worse and it’s one of the biggest surprises of the year for me, because I also wrote this film off on it’s trailers"
    },
    {
      "rating": "8",
      "text": "Forget about the formulaic spies plot and its flaws, the film does not look silly for the wise decision of making it into a comedy and it sparks thanks to the strong rapport between Johnson and Hart. The thriller may seems to be dumb and lack of inventiveness in all the right ways but it is also a bit smarter than what audiences could have expected. The hilarious but not nonsense actions, sweet high-school buddies friendships, comedy about bullies and inspiration to transform a better oneself however are all blended well into this lack-of-originality thriller; though insufficient to generate big humors, it is still able to keep your smile till the end. The film centralises on the delightful chemistry between the two actors, both Hart and Johnson deliver a cheerful bromantic, especially the latter who takes his character and silliness seriously other than just knowing to flex muscles. It might lack in depth to explain about the quest of the mission but it is overall entertaining due to the commitment of the cast to bring us laughter."
    },
    {
      "rating": "5",
      "text": "As a comedy,this movie is a failure.The pasting is bad,the story make no sense at all.Kevin feels overreacted to everything.I like the ending,it is very thought-provoking.Rock is ok,not many amazing moments.My biggest problem with this movie is that Kevin's joke sometimes feels unfunny and lame.The final fight feels cheap and unexplained.And a lot a lot of WTF moments.Too many plots feels unnecessary."
    },
    {
      "rating": "5",
      "text": "Dwayne Johnson and Kevin Hart have impeccable chemistry and there are some good laughs to be had. However, because of how dumb and nonsensical the plot is, the film isn't as funny or as smart as it thinks it is."
    },
    {
      "rating": "0",
      "text": "Dwayne Johnson should stay in the \"ring\" and try to be funny while wrestling. This certainly did not measure up to his other \"comedies.\" And Kevin needs a muzzle. His imitation of Eddie Murphy fell flat. I recall snickering (briefly) four times during the movie, and rolling my eyes at the over-used \"death\" scenario of the former partner. Truly a movie that one can see--not recommended--and then going to see something that will take the horrible taste out of memory."
    },
    {
      "rating": "10",
      "text": "Central Intelligence is probably the best comedy movie of the year so far that I have seen. Kevin Hart and Dwayne Johnson take this PG-13 action comedy way over the top and made me laughing so hard that my stomach started hurting. The action sequences were great and just the film itself is so humorous. Central Intelligence also had many surprising and hilarious cameos (no spoilers) and I thought that was very clever. Kevin Hart and Dwayne Johnson formed an outstanding team and this film actually reminded me of The Heat. This buddy cop comedy was like a male version of The Heat and it also has a strong message. The trailer doesn't give out what I think are the best scenes, which I am so grateful for. The length of the film was just perfect and I thought the plot was very well constructed. This is like the one movie that Kevin Hart doesn't get too over-the-top annoying, which I loved. If you need a good laugh to make your day better, definitely go check out Central Intelligence as I think this is way better than both Ride Alongs. (100/100)"
    },
    {
      "rating": "7",
      "text": "Even though if you watch Kevin Hart movies most of them are kind of similar, this had some fun twists and Rock was really funny here. Nothing too impressive though"
    },
    {
      "rating": "6",
      "text": "The strongest part of the movie was Kevin and Dwayne had great chemistry. There were a couple laughs but I didn't laugh as much as I wanted to. The story was a bit interesting too. Keeps you guessing til the end."
    },
    {
      "rating": "8",
      "text": "Very good movie was way better than i thought it would have been. Dwayne Johnson and Kevin Hart were pretty funny together, great story, good ending, highly recommend."
    },
    {
      "rating": "6",
      "text": "Its a better comedy, than it is an action movie... The storyline is obvious and the action scenes are a bit boring... Nevertheless , Hart is a very good comedian and Johnson continues proving that is acting is getting better as the Years pass, with his Innocent(or not) and funny character..."
    },
    {
      "rating": "3",
      "text": "Starring Dwayne The Toothfairy Johnson and Kevin The New Adam Sandler Hart in a movie that's too boring to be an action movie and not funny enough to be a comedy. Someone told Kevin Hart he was funny and someone told Dwayne Johnson he could act and now we get this. Predictable, bland and a waste of time. Not recommended."
    },
    {
      "rating": "7",
      "text": "An interesting movie on so many levels.  Bullying kids in school, the pressure of being the kid most likely to succeed, spying by the CIA, stolen secrets, and how much people change from teenager to mid-life adult.  Dwayne and Kevin are a miss-matched pair in these rolls and it makes the movie more hilarious."
    },
    {
      "rating": "7",
      "text": "Central Intelligence was an enjoyable movie, and I look forward to seeing it again on DVD, however, some of the plot points really didn’t work or were just plain overdone."
    },
    {
      "rating": "3",
      "text": "I was expecting to enjoy this movie a little more than I thought I would. The comedy was sort of there but fell flat 90% of the time. The action sequences were ok but the villain was utterly forgettable. In addition you could see that the rock and Kevin hart were trying to have chemistry together but it just was not there. I would pass on this movie"
    },
    {
      "rating": "8",
      "text": "I will give this a solid 8/10. In my opinion, I think its the best on screen chemistry between K. Hart and anyone he has done a movie with. The Rock and Hart are an excellent combination. There are a lot of laughs to be had here.  A part of me wishes for an unrated version which I know would be even funnier but its pretty funny for a PG-13 movie.  Its nice to see a change of pace here. Kevin Hart is playing the \"serious\" role while the Rock is playing the funny \"wierd\" character. The movie also has a great message to it when it comes to bullying.  Its a fun movie. Go see it if you are a fan of either one or both."
    },
    {
      "rating": "7",
      "text": "Para ser una película de la roca esta bastante bien, tiene sus momentos graciosos y emotivos y hasta deja un lindo mensaje."
    },
    {
      "rating": "6",
      "text": "This movie was a bit conbaluted with a lot of stuff that was very boring the whole government secret spy story was a bore, the best thing about this movie was the rock and kevin hart together they where great and very funny its just too bad the plot was boring"
    },
    {
      "rating": "6",
      "text": "Central Intelligence visits the world of Calvin Joyner (Kevin Hart)- the most-popular-guy-in-school turned accountant who is struggling to cope with the regrets he adopted since high school, especially since his reunion is coming up. But all that changes when he reunites with Bob Stone (Dwayne Johnson), a bullied boy he helped once during high school and who still admires Calvin. By no choice of his own, Calvin is thrown into a world of espionage and danger to help Bob save the world and stop the bad guys, all while being hunted by the CIA. But is Bob really the good guy? Hilarity ensues as friendships are tested, people are put in danger, and Calvin has the most exhilarating experience of his life as the world learns what happens when you bully someone...\r Alright, raise your hand if you DON'T want to see a comedy movie starring Kevin Hart and Dwayne Johnson. Yeah, I didn't think so. After seeing the trailer, I couldn't wait for this movie! What a pairing! And they, of course, performed to standard with fantastic chemistry between them! Their main source of comedy was Hart's character explicitly expressing several dozen times during the movie that he does NOT want to be a part of Johnson's character's secret mission, with Johnson's character just ignoring him and getting him involved anyway. I probably don't do it justice, but they are a great comedy duo.  For some, the humour will fall below par, but that's a personal preference. That's definitely the best part of the movie. You probably see most of the highlights in the trailers if you watched them, but there is still some new humour to be found. But don't be fooled, this is also a spy/mystery movie.\r The audience, like Hart's character, is unsure of how much trust should be placed in Johnson's character. Is he CIA? Is he bad? Why is he wanted? And without any spoilers, evidence for both sides pop up which makes Bob Stone an enigma! This was an element that I really enjoyed. This movie had its downfalls in its plot conveniences and use of cliches. Sure, the actual storyline is original, but the formatting and style with which its executed has been done to death. And do you really expect us to believe that a small black man completely overwhelmed by the situation he is in can fight trained gunmen and handle firearms himself with his only experience being from limited observation? No. And Dwayne Johnson is a big target, he cannot dodge every bullet.\r The cast includes Kevin Hart, Dwayne Johnson, Amy Ryan, Danielle Nicolet, Jason Bateman, Aaron Paul, Ryan Hansen, and Tim Griffin. Some impressive comedic stars here, but make no mistake, its the Hart-Johnson duo that's front and centre here, and as I've already said, their relationship is great! The other characters are barely more than extras and they weren't at all memorable. The themes include friendship, karma, revenge, trauma, and sacrifice among others. The special effects could be mediocre at times, but I was kept engaged through the balanced blend of comedy, action, adventure, and the intriguing characters. The atmosphere fluctuated along with Johnson's character's tone- serious to weirdly excited and cavalier. I'm not sure how much I liked this, but it only widened the demographics of this movie so that more people can enjoy it.\r Director Marshall Thurber has had plenty of experience with Comedy films- through the likes of Dodgeball and We're the Millers, he delivers up to standard. You can trust this guy's credibility. To improve however, he could've strayed from the cliches and poor plot conveniences, and maybe varied the humour a little more. Did I mention this whole storyline was finished within a day?\r To conclude, this movie did well as a buddy cop movie. It definitely isn't the best movie I've ever seen, but the combination of humour and action will engage. It's another guilty pleasure movie and so the rewatchability level is HIGH.\r Rating: 6.5/10\r *Stick around during the credits for a look at the Blooper Reel*"
    },
    {
      "rating": "10",
      "text": "This movie is the best movie ever. So awesome and funny. I just love this movie cause kevin hart is one of the best actor ever and the rock is my favorite wwe player and when they come together it turn to a awesome movie. I give this movie a 10/10 this movie is awesome"
    },
    {
      "rating": "6",
      "text": "Whilst the chemistry and humour between Dwayne Johnson & Kevin Hart is brilliant, the lazy action sequences and monotonous story isn't quite as appealing. It is far better as a comedy than it is an action film."
    },
    {
      "rating": "7",
      "text": "After watching Central Intelligence in the cinema i came out laughing with joy.\rKey points:\rC.I was very entertaining and properly the best acting done by Dwayne Johnson and a lot of other points that made the movie interesting\rUnfortunately the movie lacked story line and that really let me down as i really enjoyed the movie\rToday my score is 7/10"
    },
    {
      "rating": "5",
      "text": "This movie is yawning in every way the start was to the middle was really good in my opinion but the end was confusing you can expect some funny scenes but also some boring scenes aswell in my opinion this movie is good (bad good....)"
    },
    {
      "rating": "10",
      "text": "The movie unexpectedly flows smoothly from one scenario to the next, and their unique comedy styles work very well with each other.   I thought this movie was going to be stupid, but it is brilliantly smart, in a dumb way, so good that I watched it twice!   This is one movie to rent if you have a bunch of friends over, have BBQ, beer, good times."
    },
    {
      "rating": "4",
      "text": "Central Intelligence is intended to be a comedic action/spy film starring two of Hollywood's greatest male stars Dwayne Johnson and Kevin Hart and directed by the mastermind behind We're the Millers...oh wait.\rActually, this movie wasn't that great to begin with. Except for the bloopers at the end, which are actually hilarious, I wasn't laughing while watching this movie. It's enjoyable enough because like many Hollywood blockbusters, it was made to be a movie that largely relied on entertainment value. However, entertainment value does not equal a great movie, the equation Hollywood forgets when it does the math.\rThe characters are standard action heroes that try hammering in an anti-bullying message that is noble, but feels so forced in the movie's narrative that desperately tries to be significant at the last minute. This movie should have been like Kingsman (2015) in the sense that it is self aware. The plot is very cliché and predictable as well. For me, it just doesn't warrant a second viewing and it wasn't very humorous. My disappointment with this movie will be commemorated with a seal of expendability."
    },
    {
      "rating": "5",
      "text": "A movie that is full of flawsKevin hart is maby the only thing that carries this movie, dwayne johnson a little bit, but this is the first time i found his acting to be awkward. Let's be honest he is best in his serious state, not when he needs to act like a child. That's what the movie feels like, childish jokes that aren't even funny to kids. I actually found the plot to be solid for a comedy movie, but it doesn't get excecuted that well.Just ok enough to watch all the way through but still a very meh movie and maby the worst movie i saw dwayne johnson in."
    },
    {
      "rating": "0",
      "text": "What a waste of time. Lousy screenwriting. Non-entertaining and tasteless. Immature \"yuk-yuk.\" Dwayne Johnson and Kevin Hart just farted a lousy movie. Jason Bateman's \"performance\"...makes one wonder just how desperate he is to make such a cheesy movie. I guess he'll say anything on screen to make a buck."
    }
  ],
  "recommendations": [
    "spy",
    "the_wedding_ringer",
    "tower_heist",
    "chips",
    "stuber",
    "identity_thief",
    "ride_along",
    "this_means_war",
    "horrible_bosses_2",
    "the_dilemma",
    "that_awkward_moment",
    "the_nice_guys",
    "dodgeball_a_true_underdog_story",
    "zoolander",
    "grudge_match",
    "the_longest_yard",
    "friends_with_benefits",
    "forgetting_sarah_marshall",
    "the_spy_who_dumped_me",
    "horrible_bosses",
    "the_break_up",
    "tag",
    "logan_lucky",
    "pitch_perfect_2",
    "the_heat"
  ]
}