{
  "id": 2883,
  "title": "Changeling",
  "starring": [
    "Angelina Jolie",
    "John Malkovich"
  ],
  "runtime": 141,
  "genre": [
    "Crime",
    "Drama",
    "Mystery"
  ],
  "description": "Christine Collins is overjoyed when her kidnapped son is brought back home. But when Christine suspects that the boy returned to her isn't her child, the police captain has her committed to an asylum.",
  "releaseYear": "2008",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/dsCAryPlgLlpZu80hhLTwQHRIpU.jpg",
  "categories": {
    "plot": 6.625,
    "acting": 6.512820512820513,
    "ending": 4.666666666666667,
    "soundtrack": 8.333333333333334,
    "cinematography": 4.5,
    "familyFriendly": 3.0,
    "funny": 6.666666666666667,
    "action": 1.0
  },
  "reviews": [
    {
      "rating": "10",
      "text": "Excellent and very well made. Angelina Jolie definitely deserves and Oscar nomination, and the screenplay and set design are very authentic. There are several excellent acting performances."
    },
    {
      "rating": "10",
      "text": "Finally, a movie worth seeing. Jolie should be a contender for best actress for her performance in this excellent Clint Eastwood directed thriller. Also John Malkovich would be my choice, hands down, for best supporting actor. He is so great in every movie he has been in. The movie runs 2 hours 20 minutes and holds your interest from beginning to end. A thriller/drama based on a true story from a happening in L.A. California in 1929-30. (Where do they find so many of the automobiles from that period). The directing, the flash backs, the dialog...the story holds your total interest for the entire length of this movie. Time and money well worth spent."
    },
    {
      "rating": "9",
      "text": "Ignore the bad reviews by critics just pulling at the strings to try and critique Eastwood's masterful direction. I'd like any one of them to get behind the camera and direct this film as well as he did. Angelina's performance is unforgettable, and the film itself is as well. You will be drawn in, you will walk away astonished that anything like what you've just witnessed could possibly even happen... And you will think about the film, and talk about the film days after you see it."
    },
    {
      "rating": "9",
      "text": "A Marvelous engrossing film with exceptional performances and a beautiful quiet soundtrack composed by Clint Eastwood. Some second grade critics have given this film mixed reviews but it is a solid film that will have you from the first to the last scene. Highly recommend it for adult viewing. A don't miss."
    },
    {
      "rating": "6",
      "text": "I was pleasantly surprised by this movie. Well directed, as you would expect from Eastwood, but I was mostly endeared by Jolies performance. Not quite Oscar standard but impressive none the less. The rest of the cast are adequate but, John Malkovich aside, there are no strong characters.\r Overall, weak in parts but well worth a watch."
    },
    {
      "rating": "5",
      "text": "Solid performances by the cast but the thing about the movie is that it never really gets interesting. It doesnt capture you the way it should have and that is disapointing."
    },
    {
      "rating": "7",
      "text": "A heart wrenching movie based off a true story. Angelina Jolie was excellent in her role as Christine Collins a distraught mother who's son is missing. Changeling is truly a heartbreaking film."
    },
    {
      "rating": "9",
      "text": "Kind of hilarious to read the 0 point reviews. One complain about the dialogue, which mostly was taken 100 % from reality. Others complain about the name, without looking up what it actually mean. Just wow, the last retard is yet to be born. Of course this movie dont work for everyone, some people cant watch a movie without someone being shot every 3 minute. Its a slow movie and I love every second of it. Its so hard to watch because the story is heartbreaking.Clint directed this to perfection, Ron Howard suggested a perfect cast and the cast were amazing."
    },
    {
      "rating": "10",
      "text": "Changeling is directed by Clint Eastwood (Great Director) and Angelina Jolie (Great Actress) which follows the story of Christine Collins (Great Story) whose son went missing on March 10th 1928, she reported her missing son to the police department (Great Department that is corrupt and would do whatever to keep their heads up, even by being corrupt) and the went searching for him. Three months later, they thought that they \"found him\" but as it turns out it is not her son, so the police department won't handle the truth (will give them great shame) so they decide to send  to a   The movie is actually very realistic and moving in a riveting way, with the first rate art direction (Great Direction) and great performances but heartbreaking story. When you watch Changeling, it sends you to the 1928, as if you feel that you are really someone in the movie, you get involved in everything Christine is involved in, it is truly amazing who you feel in the movie, you get disturbed and sad, but you would never want it to end, you still wanna live in the town to see what will happen next, it is really amusing and spectacular with photography and soundtrack that you will never ever forget. Everything above is greatness, which shows that Changeling is a true masterpiece and one of the best movies of all time."
    },
    {
      "rating": "6",
      "text": "Not as good as I thought it would be. The story is very compelling, but there is no way Jolie's performance should have been nominated for an Oscar."
    },
    {
      "rating": "9",
      "text": "A very strong drama with little to complain about. It combines two of my favorite genres of film: Drama and Thriller. I adore it to every minute. Never a boring part. Yes, some useless parts, but people with a heart will enjoy it."
    },
    {
      "rating": "0",
      "text": "I feel compelled to cast my first ever viewer vote here at metacritic.com because this is absolutely one of the worst movies I've seen in my entire life. Interestingly, I knew little about the film and did not know who had directed it while watching, and was mildly shocked at the end to see Clint Eastwood's name roll through the credit as director. As much as I loved \"Unforgiven\", you, Clint, are unforgiven for this horrible mess of a film. Grossly overwritten, every line tries it's damnedest to impart extreme gravitas or pith. And every one of these horribly cheesy lines is delivered by a walking piece of cardboard character. Jolie, cue the tears, nominated for best actress? Please, maybe a nomination for best weight-loss not required by a role. The only engaging character of the movie was the killer himself, who imbued his part with the appropriate creepiness that this movie fully deserved. I honestly, honestly have never seen a movie with this level of budget, actors and director be so miserably overwritten, consequently overacted, with an enraging attempt at sentimentality as it desperately tries to salvage itself through emotional manipulation strangely in bed with pure shock value."
    },
    {
      "rating": "3",
      "text": "This is a movie that cannot make up its mind. One minute it focuses on the distraught mother of a missing child, the next it turns its befuddled eye onto a corrupt police system and a crusading priest, then shifts to the horrors of a mental institution where the main character is hailed a conquering hero for her stand against the injustices imposed on its patients, and finally the movie becomes a courtroom drama. The story is adapted from a true story, but the film awkwardly changes the chronology so that civil and criminal case are tried simultaneously. Obviously this was done for dramatic emphasis but it just doesn't work. In fact, very little in this movie does, which may be a good thing because I left feeling totally detached from the horrors of the narrative. Save your money. This is not one of Clint Eastwood's better movies."
    },
    {
      "rating": "1",
      "text": "Where to start? Jolie was miscast, but maybe they wanted to make an action flick when the project started, had her sign up, and by mistake started working of a script for a totally different movie. It might explain the title. Or what about the irritating self awareness of John Malkovich who'd you, at any point in the movie, expect to break the rule of the 'fourth wall', look smugly into a camera and tell the audience that he's really pleased with his performance so far. Story wise: horrible, unbelievable plot turns, starting right of the bat when a seemingly intelligent woman is given the wrong boy back, her supposed son, who disappeared a few months earlier. The boy is not her son, she takes him home anyway...Â¤Â¤ Really? Â¤Â¤ The story continuous with Jolie trying to explain to the world that the boy is an impostor who doesn't even match her son's height to which a dentist and a school teacher are willing to testify. Why family members, neighbors, school chums, the family physician, the baby sitter and E.T. the Extraterrestrial weren't asked to help resolve the obvious misconception on the part of the police, was conveniently left out of the tale completely. No, in stead of taking the boy into custody and resuming the search for the real son, the police keep pushing her into believing it actually is her son after which the woman finds herself in a poorly copied tale by Kafka. From this point on the movie reveals itself for what it was intended to be. An endless string of manipulative scenes drenched in an Oscar vinaigrette in both the melodramatic writing and the obnoxiously polished cinematography with a fetish-like attention to props. Some movies get Oscar nods, but this one actually nods back."
    },
    {
      "rating": "0",
      "text": "I'm talking bad. If Angelina Jolie is in a movie I would think people expect her to be naked. She was nominated, thrown a bone if you ask me, for her breathy method acting. Jeffrey Donovan is unable to do a Southern accent, among others. His acting is sub-par. Although I knew prior to seeing the movie what it was about the title \"Changeling\" led me to believe it was about aliens. The economy had tanked or was tanking and the real estate plunged so no one wanted to see a depressing movie. If it were not for all the aforementioned...it still would have bombed."
    },
    {
      "rating": "4",
      "text": "Eastwood doesn't know the meaning of the word \"subtle\". He always makes sure the dimmest person in the audience is never in doubt of which characters are 100% good and which ones are 100% evil. Every single employee at the psych hospital acts like they're villians in a Superman comic book. With the exception of Jolie, the film was filled with MOVIE characters, not real people. The irony is that this is a true story, yet I never believed a minute of Eastwood's film. He had a fascinating story to work with, and I'm glad to know the story, but as a film it was little better than a made-for-TV movie. He seems to be afraid of challenging his audience, so he ends up insulting our intelligence. At the end he spoon-feeds us even our emotional response, making it clear that we're supposed to feel good about the outcome, even though, when you think about it, it's really not a happy ending."
    },
    {
      "rating": "3",
      "text": "Clint Eastwood could crap on something and it would get rave reviews so it should come as no surprise that a lot of critics eat this up. Its not as big a disaster as 1 Dollar Baby which dragged and dragged, but then again this hasn't received as good of reviews. Well I give credit to Jolie its a different role so thats a positive."
    },
    {
      "rating": "0",
      "text": "Awful and boring."
    },
    {
      "rating": "10",
      "text": "the story was more emotional....the are movies what you don't sleep ... because you wait an answer... the best of best.............................................................."
    },
    {
      "rating": "5",
      "text": "The movie start great very great , and after the middle the things just get more and more worst , to a disappointing final , but even when its not so great there is one women that handle us Angelina Jolie with his almost perfect actuation and his beaut"
    },
    {
      "rating": "4",
      "text": "I felt like Eastwood missed an opportunity to emotionally include viewers. Albeit an unbelievable story, I never felt convinced that Jolie's character was distraught over losing her son, beyond the occasional outburst, \"I WANT MY SON BACK!\" I never felt like I understood what it must have felt like to lose a child. The film spent too much time on the details of mother vs LAPD and lacked development of the emotionality of the situation. For example, in Million Dollar Baby, when Hilary Swank's character gets sucker-punched, we all felt sucker-punched.I felt like I was watching this story take place from the bleachers, which was unexpected coming from Eastwood. And BTW John Malcovich gave the only award-deserving performance."
    },
    {
      "rating": "9",
      "text": "A very good movie. Jolie and Jason Butler Harner knock it out of the park. The plot that starts simple, and then branches out in numerous directions - because the true story that it is based on did the same. Although a long movie, I was intrigued throughout it."
    },
    {
      "rating": "6",
      "text": "So when I sat down to this movie, I was expecting something great since it was directed by Clint Eastwood, even though I really wasn't that impressed by Gran Torino(aside from Clint, bad acting surrounded him). So as I start Changeling, I found myseld getting frustrated and very annoyed by the movie. I was just waiting for Angelina to start yelling at the police, but she talks so softly, I couldn't relate to how she was acting, so passive and non insistent, OH that annoyed me. Her performance is so overrated in this film. Interesting story, but I was frustrated throughout the film so I have to give it a 6, I would give Gran Torino a 5."
    },
    {
      "rating": "8",
      "text": "Changeling is everything you'd expect from a director as meticulous as Clint Eastwood. His eye has captured the look and feel of Los Angeles circa 1930 perfectly and his score sets the mood beautifully. Angelina Jolie proves that she was indeed robbed of an Oscar nomination last year for her performance in A Mighty Heart, because here, while she is again very good, she really just has to deliver about 12 versions of a line with \"My Son\" in it, but because of the prestige of Mr. Eastwood, she's more likely to get her nod this year for Changeling as a pay back for last year. The rest of the cast are all good but the story turns it focus a few times too many to make this the next Eastwood Oscar juggernaut, but what do I know, I still believe A Perfect World was Clint's Best!!"
    },
    {
      "rating": "7",
      "text": "Clint Eastwood has become one of Hollywood's best directors. He takes a subject matter that he could have knocked out of the park and somehow manages to bog it down with sterotyping. 30 minutes into the film we know where this movie is going. He captures the late 1920's on camera perfectly but yet does not take us into the character's development for doing what they did. It is almost surreal as the audience craves more depth but yet it is sorely lacking. AJ meanders along searching for her lost son but yet we know nothing about the woman. The LA Police are corrupt but we don't understand why they take the stance they did in the Court of Public Opinion. At the very end of the move (spoilers omitted) the one eyewitness who could place closure on the matter by simply asking was anyone recaptured is never asked. You leave the theater wanting more."
    },
    {
      "rating": "6",
      "text": "Angelina being sooooooooo skinny, took away from the film for me. Her boney legs, arms and hands. God, and the makeup. None of the other women characters looked like vampires. Even after a week in a psych ward, she had vampire eyes. Not one of his best movies. John M was amazing in his small roll. The kids were truly great to watch."
    },
    {
      "rating": "6",
      "text": "I think Eastwood's direction and pace was marvelous. Spot on details about early 20th century life. I simply cannot get excited about Jolie's performance. I was not moved. Malcovich was tremendous, and the villain was oh so eerie. Ending didn't wrap up for me - and the story was not true...based on truth. Lastly, Clint - all of your music sounds the same...and it's old."
    },
    {
      "rating": "10",
      "text": "Changeling is the best film of the year and one of the best films of all times.Changeling is a piece of arte and a truly masterpiece.Angelina Jolie is suberb and in my opinion Changeling must win the best film, best director and best actress academy awards.Clint Eastwood Is the best director and Changeling one of his best films."
    },
    {
      "rating": "9",
      "text": "Excellent movie,best picture, director,actors Angelina jolie,John Malkovich,jeffrey donovan and other actors.All drama movie is boring, but are good."
    },
    {
      "rating": "10",
      "text": "Brilliant. It was great seeing AJ acting instead of shooting weapons while she's wearing a bikini. She really can act."
    },
    {
      "rating": "7",
      "text": "Real life trumps fiction, and Eastwood's film serves us a cautionary tale drawn from actual events. When, it asks, can we ever be safe, when human malice (or evil) lurks around us? Surprisingly good."
    },
    {
      "rating": "1",
      "text": "A rating of 0 belongs to movies like Cabin Boy, Meet the Spartans and Battlefield Earth. But I am quite comfortable giving this agonizing film a 1. God forbid that Clint could be blamed for poor directing (and I love that guy!) but this film just seems to struggle and make the viewer inject fluidity by proxy (for those willing to do so). Changeling seems to not so much drown in sorrow but feel dazed and confused in its storytelling. What a sad, sorrowful and agonizing bit of filmmaking."
    },
    {
      "rating": "8",
      "text": "Well worth seeing on the big screen. Remarkable how Clint was able to recreate 1920's Los Angeles. Superb acting by all ( well maybe average acting by the LA Police Captain with the forced Irish brogue). Angelina was excellent although the red lipstick on her oversized lips was a little much. Go see it... the story is worth experiencing."
    },
    {
      "rating": "9",
      "text": "I can overlook the few minor flaws in this. It is a good example of bureaucracy run amok."
    },
    {
      "rating": "9",
      "text": "One of the best movies of the year. It will have you sitting on the edge of your seat right until the very end. Based on a true story. Excellent acting, writing and directing by the master Mr. Clint Eastwood. Worthy of an Oscar."
    },
    {
      "rating": "9",
      "text": "This is a movie about perseverance, and it nails the concept on the head. [***SPOILER WARNING***] In the end, Jolie gains hope, and so did I. I stayed until the last credit rolled hoping to see in subtitles that the boy was found. However, there was none. [***END OF SPOILERS***] I haven't been that connected to a movie since Schindler's List. Truthfully, i would put this movie second to only Schindler's List. Changelings should be seen by everyone regardless."
    },
    {
      "rating": "8",
      "text": "Excellent movie that works as a drama and also as a period piece. As The New Yorker says, it \"congratulates you for feeling what you already felt.\" But that's not a bad thing. This movie will not change your life, but it will leave you impressed in every way. Jolie was perfectly cast and played the role ideally. The only real flaw, in my opinion, is that one of the child actors was allowed/asked to grossly overact."
    },
    {
      "rating": "9",
      "text": "Good drama movie ! Oscar for Jolie !"
    },
    {
      "rating": "7",
      "text": "I enjoyed the film, but it really could stand to be 15 minutes shorter. The look of the film was great, as was the overall sense of the period. However, I didn't need to see another shot of Jolie crying, and Jeffrey Donovan played his character with no humor & no redeeming qualities. As Eastwood is a better director than that, I have to put that fault directly on the actor."
    },
    {
      "rating": "10",
      "text": "An amazing movie with a lot of spirit and amazing acting from Angelina Jolie"
    },
    {
      "rating": "10",
      "text": "Excelent! This real life drama is stranger than fiction and shakes you from the beginning to the end."
    },
    {
      "rating": "10",
      "text": "Jolie is stunning as a distraught mother, and Eastwood has given an authenticity to the story by meticulous costuming and sets that bring the viewers back to 1928/1935. The story may be difficult for some viewers."
    },
    {
      "rating": "8",
      "text": "Better than the critics say though it did feel long. In the end you understand why Eastwood wanted to finish the story."
    },
    {
      "rating": "10",
      "text": "Easily the best film I've seen this year, Changeling is Eastwood at the top of his game."
    },
    {
      "rating": "7",
      "text": "Beautifully made, a real effort was made towards the period detail. Angelina Jolie is indeed great. It's biggest flaw was it being too long, there were a few stretches that dragged a bit that should have been edited out. Fine costumes and art direction."
    },
    {
      "rating": "9",
      "text": "Call me naive, but If it wasn't true, I would not have believed that people could be so inconsiderate, so uncaring, so ruthless, and that LA could have been that corrupt. This film belongs to Ms. Jolie who was magnificent, Mr. Eastwood, I was engrossed from the beginning, and all those behind the scenes who made me feel like I was in the 20's and 30's. It is important for all to see: men to realize how their forefathers treated women and for women to know how brave those who paved the way were. I reserve a 10 for the greatest of all time, this is a 9.9!"
    },
    {
      "rating": "3",
      "text": "Well its a sad story, but I was subjective to the length of it. 2 and a half hours is a little unreasonable. One of the child actors grossly overacted one of the roles. The real crime of this movie though is that it was allowed to slip through the cracks and into a theatre instead of remaining in an afternoon spot on the lifetime channel. I am not sure who labeled this movie as a suspense/thriller, but maybe they should actually watch the movie instead of falling asleep within the first 20 minutes of the movie, and label it a drama. And where did the title \"the changling\" come into play? In short, I would wait till it comes out on bravo."
    },
    {
      "rating": "8",
      "text": "The fact that most characters in this movie are purely and completely evil or good, without almost anyone being more complicated than that seems unrealistic. But Angelina Jolie's performance stands out so profoundly that she alone more suffices to carry the audience on an emotional roller coaster ride."
    },
    {
      "rating": "10",
      "text": "Big budget  predictable Hollywood seen it all before average distraction. Recommended for those who want obvious cinema that presses all the buttons for you. Good old fashioned over the top professional pizza and a movie on a Sunday night entertainment. I give it a six out of ten cos I am a generous chap. The wife enjoyed it more than I did."
    },
    {
      "rating": "6",
      "text": "Pretty good. A touching story. I like the the heart in this movie. I like movies with a nice story. They did a good job with the screen writing for this movie. This movie could have been a bad movie just as easy as it was a good one. Jolie did a fine job in this movie. One of her best performance ever. Jolie is an excellent actress."
    }
  ],
  "recommendations": [
    "mystic_river",
    "american_gangster",
    "a_most_wanted_man",
    "million_dollar_baby",
    "breach",
    "man_on_fire",
    "gone_baby_gone",
    "the_departed",
    "gran_torino",
    "the_irishman",
    "joker",
    "hereafter",
    "the_prestige",
    "hustlers",
    "body_of_lies",
    "the_next_three_days",
    "the_illusionist",
    "american_hustle",
    "inside_man",
    "the_place_beyond_the_pines",
    "the_devil_all_the_time",
    "revolutionary_road",
    "magnolia",
    "prisoners",
    "the_godfather_part_iii"
  ]
}