{
  "id": 270,
  "title": "Chaos Walking",
  "starring": [
    "Daisy Ridley",
    "Tom Holland"
  ],
  "runtime": 109,
  "genre": [
    "Science Fiction"
  ],
  "description": "Two unlikely companions embark on a perilous adventure through the badlands of an unexplored planet as they try to escape a dangerous and disorienting reality, where all inner thoughts are seen and heard by everyone.",
  "releaseYear": "2021",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/xAYGdGBGptNkisXRpmhZSry6SPF.jpg",
  "categories": {
    "plot": 5.531914893617022,
    "acting": 4.6875,
    "ending": 3.909090909090909,
    "soundtrack": 8.0,
    "cinematography": 3.0,
    "familyFriendly": 5.625,
    "funny": 6.5,
    "action": 6.166666666666667
  },
  "reviews": [
    {
      "rating": "2",
      "text": "Chaos Walking is hampered by extremely erratic writing, poor editing, and an overly complicated plot that the director was unable to weave into cohesion. Daisy Ridley and Mads Mikkelson try desperately to pull this movie out of a deeply convoluted canyon of contrived and pretentious takes on sci-fi tropes, but weren't able to lift the finished product up from being bland and cringey. Tom Holland falls flat yet again, delivering another complete dud of a performance, after being nearly unwatchable in Cherry, which also came out recently. Tom should really stick to Spider-Man, and leave the serious acting to people who have range. The plot of Chaos Walking is so poorly executed that it doesn't even seem believable by any human standard. The actions taken by the tribe of men Holland's character belongs to are completely devoid of logic and practicality, serving only to demonize and ostracize themselves with no real benefit. After that, the film tries to pay off on story beats based on the plight of the male characters, that their thoughts are projected for all to see, but this idea is crippled by Tom Holland's abysmal performance. Don't watch this movie. It's an embarrassing mess."
    },
    {
      "rating": "1",
      "text": "It's in the title.  Choas Walking is a chaotic but above all irritating film. The visible thoughts are inconsistent and get very nerve-wracking because of the additional visual effects.  Unfortunately, the star cast couldn't save the the weak script and poorly developed theme."
    },
    {
      "rating": "5",
      "text": "I would rate this a 52%it had lots of un needed and boring clips and is a un fish story because it seems like they want to do a part 2 but the story is alright it is just drag out and short story but there is some could clips and the fighting scene where engaging."
    },
    {
      "rating": "2",
      "text": "The SF part is extremely incoherent.The character construction is a calamity and only the main hero goes from a place to another.Daisy Riley -and I would like to like her- plays like a potato. And clearly her dialogues (or lack of) does not help.The extra layer of reading about men and women is nauseating.**** movie, worse than Black Widow, stain movie with which it shares many traits."
    },
    {
      "rating": "0",
      "text": "Even for a 'sci-fi' movie this has no logic whatsoever. The only reason anyone would waste the time on it is for the stars but for all three of them this is an easy career low. Just painful."
    },
    {
      "rating": "0",
      "text": "Even the expensive reshoots couldn't fix the problems that this movie had. Incredibly slow, uninteresting story. There is pretty much no character development at all, and it feels like it ran 20-30 minutes too long when it could have been much quicker than what it was. I think we have a problem where something is successful so we automatically have to adapt it into a film or tv show. We can't just admit that just because it is successful in one form, it won't be as successful in another. Read books, Ignore this awful film."
    },
    {
      "rating": "3",
      "text": "It was an interesting movie, with a unique take on visualizing thought.  It had some strong actors in it, but the unrelenting feminist nods made this film feel more like an liberal arts film-making case study rather than a film.Seriously, hollywood, just make good movies.  Stop with the ideological crap."
    },
    {
      "rating": "4",
      "text": "Film was okay-ish.. having thoughts on display is an interesting idea but in practice it was ridiculously annoying. Overall the film didn’t work for me, the idea sucked."
    },
    {
      "rating": "3",
      "text": "Taking such a stupendous premise and whittling it down to nothing more than an Avatar-ish story didn't only diminish its message completely, but also squandered a huge potential that could've been put into creating one of the most unique dystopian Sci-fi movies of late. The Noise gimmick serves as a fairly effective comedic tool as Todd proves awkward around Viola. Other than that, it is nothing but a constant nuisance that made this cliché-loaded Sci-fi actioner an unbearable watch. Tom Holland deserves so much better.(3.5/10)"
    },
    {
      "rating": "5",
      "text": "(Mauro Lanari)It is true that the Young Adult dystopia has been an established formula for a decade now, with a teenage couple bound by an ambiguous and often conflicted relationship but still united in resisting the social system and ready to fight against the established power. Equally true that these stories represent a way to overturn unlikely youthful eversions into safe consumerist evasions. It is also true that this film has a meaningless script, contains a brutal anti-animalist scene, threatens one or two sequels and was a box office flop. Yet Tom Holland's candor and his being such a credible \"sui generis\" hero in his clumsiness and vulnerability gets the miracle of making the aforementioned flaws forget for wide moments."
    },
    {
      "rating": "4",
      "text": "With book to big screen adaptations there are always elements from the source material that will be changed to suit the screen or be edited out. In the case of this adaptation of the best-selling book series by novelist Patrick Ness everything gripping was inherently missing.The ideas were there, and so much could have been done with it, who wouldn't want to watch a movie about men's inability to hide their thoughts. So much could be deeply explored; from the questionable thoughts which dart in and out of a person's mind with no meaning, to heartbreak or the relatively comical.Unfortunately, what was delivered were mere touches of these possibly engaging plots points almost to the point you would assume any exploration was taboo and forbidden.I kept watching in the hopes the dribs and drabs of 'what could have been' would manifest eventually. But, alas, boredom set in and the entire movie melded into one long thought of \"Is anything good actually going to happen?\".This is disappointing considering the level of, both young and seasoned, talent in the film. But a great performance from Mads Mikkelsen, as the story's antagonist, couldn't save me from the poor script writing being a repetition of short lines; most of which are the main protagonist reciting his own name over and over into oblivion. Or enough to overlook the repeated references to an \"aggressive\" alien species native to the planet, which in actuality is only shown once in a brief scene and never seen or referenced again.Coupled with the lack of engagement from Tom Holland and Daisy Ridley who, despite being talented in their own rights, had next to no chemistry at all and who's possibility of any love interest forming, despite the script hinting at the possibility of moving towards it, was more akin to someone finding and feeling sorry for an injured puppy. Or, more accurately, someone getting bluntly friend-zoned repeatedly which continuing to make frequent subtle hints at interest throughout.There is certainly some merit to be had. But, for me, where it failed and what was lacking was too obvious to overlook for me to find the film enjoyable."
    },
    {
      "rating": "0",
      "text": "Time waste movie don't watch full boring"
    },
    {
      "rating": "0",
      "text": "no reason to watch it. best u can do with this movie is rate it 0 but never watch it. empty and non-memorable characters. none of them has any kind of motivation to do what they are trying to achieve. dull movie with unnecessary scenes to make you as empathize certain story points as watcher but there is no reason to do so.dog is the best character and actor in whole movie. he should receive salary of whole cast and triple the amount. for real."
    },
    {
      "rating": "3",
      "text": "Just one of those “nothing” of a movies. Even $15 million of reshoots couldn’t save it. Only real plus was returning to the theaters..."
    },
    {
      "rating": "4",
      "text": "It's revealed very soon why this film was delayed so many times, and in the midst of this pandemic where movie theaters are not releasing great films, it finally gets released, and it comes to die on infamy.Chaos Walking is precisely that, a walking chaos.A film that obviously had good ideas, but is unfortunately such a disorganized disaster that even with a solid cast and certainly a capable director, it never goes the right way, and mostly fails to find a way to be a more entertaining film.Because I can certainly say that I could've overlooked the narrative clutter, but the lack of emotion is fundamental and ultimately fatal to the devastatingly cheapened aspirations of this story.The delays made it look like a film destined for failure and oblivion, but its quality is what ended up burying it for good."
    },
    {
      "rating": "3",
      "text": "A very pretentious film but one that is not developed in the best way, and it gets boring."
    },
    {
      "rating": "0",
      "text": "This movie makes 3 important mistakes, all of them spoilers.1. The two main antagonists die offscreen. This may preserve them for a sequel, but viewers get no closure in the end. The movie asks viewers to endure a terrible scene in order to build the priest as a villain. Really awful movie making. And in the end there's no justice for him. And no catharsis for us.2. The alien world is entirely unexplored. The mysteries around the noise and the aliens compelled us through two acts. There is no payoff on these. It's a classic Chekhov's gun and it never goes off.3. We get no closure on what happens to the people of Farbranch. The ending is so abrupt that there's hardly time for a single goodbye. Fade to black. These characters don't matter to the writers or director. They certainly shouldn't matter to us.This is student filmmaking. Skip it."
    },
    {
      "rating": "0",
      "text": "Not my cup of tea. Neither my wife's cup of tea.Cannot recommend this movie.Holland and Ridley usually good actors however this movie is beyond salvation, starting with the sexist idea on which the film is based."
    },
    {
      "rating": "3",
      "text": "bad[ bad ]adjective, worse, worst;(Slang) bad·der, bad·dest for 36.not good in any manner or degree."
    },
    {
      "rating": "3",
      "text": "The trailer promises something better.The film is weak on all levels. The biggest construction site is actors. Here you have thrown together a group that does not work together."
    },
    {
      "rating": "6",
      "text": "Interesante.El reparto es muy bueno, Tom Holland y Daisy Ridley son maravillosos, quizás los personajes como tal no les hagan justicia a sus interpretaciones.La narración es algo trabada, cuentan más los caminos que las zonas importantes, es algo raro.Pensé que \"el ruido\" iba a molestar más, pero está muy bien medido, la verdad.El cierre de la trama no me convenció mucho, algo apurado, podrían haberlo contado más pausados, no sé.Cosas buenas: los efectos especiales, las interpretaciones, y la adaptación de el ruidoCosas malas: Planteamiento de la narración, el ritmo, es demasiado caótica, en el sentido malo, y parece que tiene miedo al espectador, a que no entiendan lo que está ocurriendo.Conclusión: Es bastante disfrutable, las críticas no le hacen justicia, quizás si nos fijásemos en un aspecto más técnico o más perspicaz, me parecería peor, pero está bien pa echar la tarde. Espero que salgan las siguientes de la trilogía."
    },
    {
      "rating": "8",
      "text": "I am writing this review because I was deeply disappointed by the way the critics had underrated this movie. 'Chaos walking' may not be a perfectly made movie as we knew how this movie's works had been going on but still it's a must watch. The concept of 'Noise' (where one can express his inner thoughts as a projection to others) is something new to the movie world and this concept is well crafted in this movie despite the flaws in it's storyline. The story takes place in fantasy world named \"The New World\" (which is of course not earth) where a woman named Viola(Daisy Ridley) crash lands due to a malfunction in their spaceship killing all the other crew members. She soon learns the truth that she was in a planet where all the women had been killed by the men. But a man named Todd(Tom Holland) agrees to help her escape \"The New World\" and also from the evil Mayor Prentiss(Mads Mikkelsen) [a war hero and the leader of Prentisstown who spreads the message to kill all the women because they do not have The Noise in them]. This film may be a slow fantasy survival thriller which lefts many questions unanswered (like for a sequel) but the top notch visuals and beautiful soundtracks and outstanding acting outweighs them all. Maybe due to the pandemic this film failed to make it to the box office,an hybrid release would have been better. I know most of you who read this review have not seen this movie but please ignore the critics and watch it at least once even though you may feel this film is a bit slow(not for me) the concept of The Noise would never leave your mind and that will make you feel how much this movie had been underrated. This movie is a very great weekend journey which will surely make an impact if you don't get your hopes so high and watch it simply as a movie."
    },
    {
      "rating": "7",
      "text": "It's okay by Covid standards. My expectations were for a fun popcorn movie, not a serious sci-fi movie, and it lived up to that. The story falls short in many ways, but it is not inherently flawed or stupid. Good enough for Covid year!"
    },
    {
      "rating": "8",
      "text": "It has its flaws, but I very much enjoyed this movie. Here on metacritic I think the user score is a bit more accurate than the critics. I do agree with some of the critiques about the lack of confrontation this movie chooses and how strange that is given its hard driving plot that is the power of \"thoughts on full display.\" I have my own complaints about the climax of the film, but in the end  neither of these things bothed me. The movie really drew me in and I was totally blown away by the subtle acting that had to be done to make all of the thought outbursts feel real to me and not like an afterthought done in effects. I really liked the tone of the movie and how it didn't feel like anything I've seen in a while. I have to say that I didn't entirely see where this was going at all times and that was really nice. For the most part this is an on the slow side popcorn action flick, but if you are into sci-fi this is a solid entry that has left me intrigued enough to want to watch it again."
    },
    {
      "rating": "10",
      "text": "Great story and great acting. Great movie! I love it! Tom Holland is fantastic on this film."
    },
    {
      "rating": "9",
      "text": "Tom Holland plays a young man living in New World, a colony on a remote planet with settlers from Earth. There are only men left and their thoughts are broadcast for all to hear. When a woman (Daisy Ridley) crash lands, it launches the duo’s expedition to save her and her fellow space travelers. Considering director Doug Liman is known for action films, this trek has its share of encounters, some of which are mildly exciting. The story is at times absorbing and other times a bit dumb, but Holland’s appealing character makes it enjoyable. This is another take on an altered future that develops into an enjoyable, but inconsequential sci-fi adventure."
    },
    {
      "rating": "7",
      "text": "Like any Doug Liman's films, his frenetic film making style often leads to reshoots and heaps of drama behind the scenes.  Chaos Walking literally describes his style ironically, but its actual result is nothing but. It is a surprisingly well acted, sci fi Young Adult film, starring two of the most \"in\" young actors of its time i.e. Tom Holland and Daisy Ridley, along with a surprisingly strong supporting cast. It also has a very unique concept behind it that intrigues.  Again, I mention this analogy time and time again, if released on a streaming platform, I believe critics will be more receptive of it."
    },
    {
      "rating": "9",
      "text": "Fans of Doug Liman's psychological approach to characters and character arcs will love this. Live Die Repeat fans (Edge of Tomorrow) fans will like it.  Based on pro critic reviews, the idea of men's thoughts unmasked--and male thoughts unmasking guilty sins they can no longer keep hidden--did not interest critics.  I laughed outloud several times; yet, I was the only one int eh theater enjoying it this much.  Heck, I liked Impulse too."
    },
    {
      "rating": "10",
      "text": "Can't belive that idiots left low ratings. Watched it just for curiosity, and it ended up with a pretty good plot."
    },
    {
      "rating": "10",
      "text": "I like the movie and I LOVE this story and this apocalyptic scenario. the actors are between my favorites of all time as well. not their best job tho, but I think it's worth the time so that why I rate it a 10"
    },
    {
      "rating": "10",
      "text": "I thought this movie was a really good time, definitely worth your money and time."
    },
    {
      "rating": "10",
      "text": "Awesome! I thought it was very different then any other film but in a good way. Hoping for another!"
    },
    {
      "rating": "10",
      "text": "happy about how they portrayed the story, it was easy going and fun to watch during the hard times we are in. tom holland was really suited to the role,as was daisy ridley. cute, easygoing movie. i liked it"
    },
    {
      "rating": "10",
      "text": "it’s such an amazing story and i remember being so in love with the story and all of the characters, it’s a story of courage and bravery and love. it is one of my favorite stories ever and i’m beyond thankful that this movie came to life"
    },
    {
      "rating": "10",
      "text": "I don't know what the eff all these critics are whining about. Honestly, for my sci fi peeps out there, this is a pretty easy win. It's not like you know, SO:2001, interstellar, Ridley Scott's Alien, yeah cool, but those are the greats, the movies that set trends for decades. It is stupid a little I think to hold all movies to that standard. Even Shakespeare had some downright stupid plays. Sometimes you just want some popcorn munching fun, which this movie totally is! Pretty sure the problem here is that critics get recognition and thereby more money, basically in proportion the more they shoot things down, the more savagely they rip apart someone's art.  Anyway, I'm straying from the review a little, so; Chaos Walking is pretty sweet, pretty straightforward sci fi. Surprisingly I DIDN'T find it to be overly indulgent in  teen / YA style tropes. The core setting is really interesting, the CGI is great, the writing and acting is great. Honestly ya'll, F**k the haters. Amiright?"
    },
    {
      "rating": "9",
      "text": "Great acting, unique storyline, would love to see more from this universe there’s still so much more to tell. Really enjoyed it, saw it by myself. It is thought provoking."
    },
    {
      "rating": "10",
      "text": "While nowhere near a 10/10 this film deserves praise for just how intriguingly it harnesses the brilliant source material. Hope they make a sequel."
    },
    {
      "rating": "8",
      "text": "Tom Holland is likely the most endearing and charming actor I've ever come across and had the privilege of watching. The truly childlike innocence he brings to his characters is beautiful and deeply touching. It is no doubt he is the best part of Chaos Walking. It is an absolutely fun movie with a delightfully simple, yet uncommon premise that puts its cast in awkward situations, while entertaining the audience; causing us to pause, question, think and laugh. However, with a hugely talented and experienced cast, you would expect their talent to shine through but unfortunately, the movie does not give its supporting cast room to shine. In fact we only get to see them in passing and there's a whole lot more detail in the movie that's sadly left unexplored. By end of the movie, Chaos Walking musters a lot of excitement that leaves you wanting more of the movie and more of its story besides its straightforward plot. All in all, it offers a wholesome & interesting take on its reality and - the chaos walking."
    },
    {
      "rating": "7",
      "text": "Adapting a series of books into a movie is often a daunting task. As anyone who has seen many Stephen King adaptations can attest; plot complexity, characters, and depth are removed in order to condense the story into a two-hour or less run time.The rise of streaming services has allowed many books to be adapted into series without having to cut much of the adult content in the books which would make it difficult for network television.As such it makes adaptations such as “Chaos Walking” a delicate undertaking. The film is based on a series of books and stars Tom Holland as Todd; a young ma living on a distant world where there are no women and people can hear and see each other’s thoughts by a process known as “Noise”.Their rustic colony is run with a firm hand by their Mayor (Mads Mikkelsen); who keeps those around him from seeing his thoughts which gives him a big advantage over those who rule.When a landing craft from a mothership filled with a new wave of colonists crashes on the planet; Todd is shocked to find that the only survivor is a woman named Viola (Daisy Ridley) whose arrival disrupts the community.The Mayor wishes to keep her from contacting her ship so they can seize it when it lands to maintain control of his empire as he sees the arrival of new individuals as a threat to his power.Todd and Viola escape trying to reach a distant colony where she hopes to find a way to warn her ship about the danger the Mayor and his men present and they pursue the duo to keep this from happening.The film lightly touches on the native race that Todd believes killed all the women of their colony but they are not visited save for a brief appearance. It is clear that the Mayor is hiding something and the reveal of what and why is fairly underwhelming which reduces him and most of his followers as thinly developed stock characters.There is also the mystery as to why the Mothership does not bother to do any sort of follow up when they did not hear from their lander and like many aspects of the film; require the audience to simply go along with things and not ask too many questions to make things work.Thankfully the two leads are interesting enough and they hold attention even when the story is slowly moving along with scene after scene of rivers, woods, and a little conversation.One big issue with the film is the Noise as the visualization of thoughts as well as hearing them mixed in with verbal communication can get very confusing as it is like multiple voices in a crowded room.Despite the issues, the potential is there and I found myself wondering what was next for the characters and hope that they do adapt future books in the series.  While the film on its own does not work as a fully developed story’ as an introduction to the series it does enough to peak the interests for more.3.5 out of 5Skewed and Reviewed"
    },
    {
      "rating": "5",
      "text": "Meh  !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!"
    },
    {
      "rating": "4",
      "text": "While I like the cast here and acting, I found the plot a bit dumb. At first it seemed like an interesting idea that people can see others thoughts but in the end I still didn't get why men there were so against women and all that - story didn't make much sense, action in it was boring and ending was predictable."
    },
    {
      "rating": "4",
      "text": "Director Doug Liman’s latest film is an escapade into the realm of the highly popular teenage sci-fi gender, an adaption of Patrick Ness’ book series Chaos Walking (2021). The film stars  Daisey Ridley (Rey of recent Star Wars franchise fame), and Mads Mikkelsen in a juicy bad guy role. The entire film seems to be a grand ‘ole trek into an alien planet that oddly seems to resemble the forests of the American Northwest (before all the forest fires devoured the landscape). This alien planet is populated by settles, cowboys and aliens (well, it’s actually one alien and the spectator is briefly treated to a glimpse of an alien village in the distance for a few seconds) who are battling it out for existence on this Earth like planet. The film is beautiful to watch and the acting is superb, but it falls short in the category of plot and story. It is not quite clear or logical why these settles are so dead set against each other. The planet seems to have an otherworldly affect on humans in that it changes males so that their thoughts are constantly floating around their heads and open to interpretation by anyone who is within close vicinity; but for some unexplainable reason, females are not affected by the planetary phenomenon. And for some further strange reason, this phenomenon is what caused the males of one community to murder all the females. This feel that one has to read the book in order to properly understand the plot of this film. Overall great acting by Ridley and the other actors and the film is well paced and flows smoothly, apart from the confusing story line."
    },
    {
      "rating": "2",
      "text": "Une idée intéressante au départ et certainement intrigante : sur une planète à peine colonisée, des hommes sont devenus télépathes à l’insu de leur plein gré et les femmes y ont disparu… jusqu’à ce qu’une cocotte se pose en catastrophe !La jolie cocotte, c’est Daisy, la très charmante Daisy Ridley, blonde ici (pour changer) et qui a déjà démontré un talent certain dans son rôle-clé sur les Star Vases de chez Disniais. L’excellent Mikkelsen est aussi de la fête pour un rôle plus secondaire et pas toujours très gentil…Mais si la curiosité l’emporte pendant un certain temps, on se rend bien compte que le scénario a été bricolé par deux stagiaires qui ne savaient plus quoi faire… on avance alors jusqu’à la ‘fin’ et on constate à quel point, c’est vraiment pourri. En outre, la réalisation de Doug Liman est typique du gars, à savoir très agitée dans l’action, une tremblote de caméra de Parkinson avec zooms désordonnés.Certes, on peut avoir vu pire par ailleurs en la matière mais ça reste de la daube standard ! donc, le seul intérêt de ce merdier de film merdique, c’est surtout Daisy et… un début intrigant qui a fait pschiiit."
    },
    {
      "rating": "3",
      "text": "This is the definition of a mixed bag.On the one hand this film is what it is. Prototypical mindless YA style sci fi fun you waste an evening on, typically in the theaters on \"date night\" as a comprimise. Has sci fi trapings to appeal one direction and in essence is a love story to appeal another. Resulting in a film you would end up stop paying attention to mid flick and start fooling around with SO in a theater. That is not exactly a bad thing, but in the middle of a PANINI?!All joking aside, that is what the film basically sets its self out to be and that is a perfectly fine vehicle for producers to ride like they have so many times before.There are some serious problems with it though.First off, Tom Holland. While he looks like he exists for no other reason than to play Spiderman, his transition into actual roles is doomed for failure. The kid tries but hes not really that good of an actor. Its also hard to take seriously with the baby face. Even if he is determined to make it long term the best he could hope for is the DiCaprio curse. Decades of being passed over and not taken seriously for how he looks. DiCaprio had the acting chops to brute force his way to an Oscar. Tom Holland never will. His best hope is to ride his spiderman fame to a few middling roles like this one, bank up enough money to live off of, maybe do a few tv series along the way before ultimately fading out of memory.....but I digress. As for this film Holland is mostly a color by numbers warm body to fill the role.A similar problem comes from his mouseketter counterpart in the form of Ridley. She has no acting skill. This film really highlights how she is like the second coming of Kristen Stewart but her schtick is smiling. Her range runs from Shouting to glaring to \"I smile, I cute\".Mads is the highlight of the film and ultimately his talent is squandered on a moustache twirling basic villain. Now if that were the whole criteria the flick would generate maybe as high as a 7.5. It is mechanically put together well. The sound work is solid, the visuals are vibrant. Choreographed scenes like those with animals are a particular strong point for the film. All in all it would be a passable summer popcorn muncher type film.The nosedive comes from the absolutely toxic and sexist premise of the film. The short of it amounts to \"men are bad, Just see how bad they are when women can hear their REAL thoughts.\" This is absolute paranoid sexist feminist claptrap. The unfounded fears that every man is just a violent animal that either wants to hurt them, subjugate them or turn them into their personal broodmare. The actors are not really at fault for their performances as they are delivering the lines written. The fault comes from the sexists who wrote this pandering to toxic feminist ideology. It promotes the paranoid delusional false narrative women are increasingly developing that makes them look at men as either their ultimate threat lurking around every corner, or they are useless, emasculated men that are too bumbling to be useful for anything. This garbage HAS to stop.Dont get me wrong, they do a good job packaging this hateful message into a palatable meal. The overall production is not bad at all. You however cannot remove the quality of this film from the propaganda it is built around. That eats off 4 points in my book and tbh it SHOULD remove 6, but again the overall production is solid. 3/10 Incredibly begrudgingly"
    },
    {
      "rating": "6",
      "text": "Chaos Walking has some good ideas but the story is a mess. The way they justify all the women killing is just bad.They had a possibility with the priest's religion but they focused on a dubious villain that has blurry motivations instead. You have aliens on the planet but they are not exploited correctly. They are an accessory. Why a ship with 4000 peoples take so much time to investigate their scout ship crash, is beyond me! You had good concepts like the noise, the religion and it would have been fun to see the alien relation to the noise. Still the movie had good acting, some action and great visuals. I give it 62%. An ok movie that missed a lot of opportunities."
    },
    {
      "rating": "3",
      "text": "The premise sounds interesting, but in fact turned out to be annoying and distracting.  To be honest, it took me most of the movie to get the hang of hearing the words and picking out the images in the \"chaos\".  And even then, I missed much of it.  I have some hearing loss and extremely loud tinnitus."
    },
    {
      "rating": "3",
      "text": "Cool concept, really interesting characters. Instead of splitting on a sexist line which is actually quite stupid, they should have done it to random people. Unfortunately the crescendo ending the film was building towards fizzled out. Strong characters became weak, In the age of magic, space ships and lasers swinging a small stick (it was tiny) was enough to scare the big bad into falling backwards to his death."
    },
    {
      "rating": "5",
      "text": "There are quite a few things to like in Chaos Walking, but ultimately, the movie feels like a missed chance to adapt an intriguing idea to the big screen and the end result is a less memorable entry in this particular genre."
    },
    {
      "rating": "6",
      "text": "Tom Holland and Daisy Ridley were the movie's attraction for me, thus I was drawn in. Charm, though, was unable to win the day in this situation. The narrative is dull. The settings are lovely. Apparently, the movie doesn't follow the novels at all. The entire project lacked depth. The strength of the casting decisions and performance will account for the majority of my assessment."
    },
    {
      "rating": "2",
      "text": "Mads Mikkelson is the best thing about this movie. Everything else is very bad."
    }
  ]
}