{
  "id": 390,
  "title": "Chappie",
  "starring": [
    "Sharlto Copley",
    "Dev Patel"
  ],
  "runtime": 120,
  "genre": [
    "Crime",
    "Action",
    "Science Fiction"
  ],
  "description": "Every child comes into the world full of promise, and none more so than Chappie: he is gifted, special, a prodigy. Like any child, Chappie will come under the influence of his surroundings—some good, some bad—and he will rely on his heart and soul to find his way in the world and become his own man. But there's one thing that makes Chappie different from any one else: he is a robot.",
  "releaseYear": "2015",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/hpnuXlKKWznTgbheGe4iQXzkuwJ.jpg",
  "categories": {
    "plot": 7.476190476190476,
    "acting": 7.159090909090909,
    "ending": 6.928571428571429,
    "soundtrack": 10.0,
    "cinematography": 8.0,
    "familyFriendly": 3.0,
    "funny": 8.153846153846153,
    "action": 8.52
  },
  "reviews": [
    {
      "rating": "10",
      "text": "This movie was the best movie of 2015 in my opinion so far it was really fun to go see and I love the idea of how Chappie is like a kid and has to learn just like a human"
    },
    {
      "rating": "9",
      "text": "As a fellow South African I had quite a few laughs. It is true that there is no new concepts in this film, but I still find it awesomely executed. Living in South Africa this would actually be a dream come true, and I think that is  why it hit a soft spot. The movie isn't quite inaccurate either , except for the robots of course :P, Two thumbs up."
    },
    {
      "rating": "9",
      "text": "The humor is so fresh, fun and simple, it's free of bitter irony\r Watch it here http://www.watchfree.to/watch-2a1ad1-Chappie-movie-online-free-putlocker.html"
    },
    {
      "rating": "8",
      "text": "Chappie seemed disorganized at first but ends up with compelling sci-fi ideas. Blonkamp needs to package his concepts out of his South African roots and culture if he can get more exposure worldwide.  On par with District 9, but unappreciated in the box office. Too bad."
    },
    {
      "rating": "5",
      "text": "One of those movies that can get incredibly right some parts, a perfect 10, and screws so badly other themes and scenes that make you cringe in disbelief,  \"wtf have I watched?\". My score could not be other than 5.The movie has Blomkamp signature: fast yet clever, good characters with enough development, that forces you to ride with the movie to get the whole scenario, and this was incredibly awesome. I think this was the first movie this year i cared about the characters, \"good and evil\", if there are any. But at the same time it gets so cheesy and vain that you can't believe it's the same movie."
    },
    {
      "rating": "8",
      "text": "I was greatly anticipating the new Blomkamp offering, and this didn't disappoint. Beautiful character design, eclectic performances and a thoroughly engaging storyline made for an excellent experience. Knowing Die Antwoord prior to this really helped, and I'd anticipate that audiences unfamiliar with them may find them, and the South African subtext, unsettling and somewhat difficult stylistically. Some truly poignant moments are interspersed with a delightful humour and, though some of the themic content needed more care, this is another unique exploration of the nature of humanity and the soul dealt with in a playful, rather than sombre, fashion. The dialogue was occasionally weak, bordering on charicature, and the cinematography was generally well executed. Overall this was a fast paced, sometimes poignant and always engaging experience. 8.11/10"
    },
    {
      "rating": "1",
      "text": "What on earth were Sigourney Weaver and Hugh Jackman doing wasting their time in this drivel? What could have been an entertaining story was ruined by abysmal acting and an unbelievably bad script."
    },
    {
      "rating": "8",
      "text": "I don't get the negative press, I really don't. This movie's take on AI isn't exactly the most scientifically accurate portrayal, but as a fun popcorn movie, Chappie takes a little bit of cerebral, a larger bit of Neill Blomkamp action, and a lot of South African weirdness. If you're expecting just a cameo from South African rappers Die Antwoord, you're wrong. They're surprisingly in focus.\r There are more than a few plot holes and writing mistakes, but it's largely made up for by how compelling the on-screen reality is. Neill Blomkamp directed the heck out of this movie. If he ever gets a really brilliant script, he'll make a great movie. As a writer, he's too eager to please a crowd and not eager enough to answer its questions.\r Given how hard it reportedly was to make a film with non-actors, this may be the only Die Antwoord sci-fi action thriller we ever see. However, they are impossible to duplicate, and the sheer absurdity of watching them prance around unironically in skimpy Americana, juxtaposed against an entirely convincing emancipated police robot learning to think, makes the movie work. It isn't quite as exciting as District 9, but it's far less ponderous and heavy-handed than Elysium. Go watch it and have some fun."
    },
    {
      "rating": "8",
      "text": "I Massively disagree with the \"critics\" that are reviewing this film. I for one massively enjoyed it and thought it was great fun. it was interesting to see Chappie grow and the mannerisms and personality that he develops is brilliant.  there are many \"critics\" who say there wasnt enough character development for Hugh Jackmans character or any of the others, but there is plenty time given to developing Chappies character and thats really all you need.\rsee the film for yourself and dont trust the \"critics\""
    },
    {
      "rating": "8",
      "text": "Let's face it.  The critics are often wrong.  I read reviews before I saw this film and it was like they were talking about a different movie.  Frankly, they just didn't get it.  There's some shoot 'em up stuff, of course but at it's heart Chappie is a story about family.  Dysfunctional but caring.  There's comedy and pathos and a really interesting twist on the \"what is consciousness, what is human\" theme.  It's a freaking character study of Chappie and his found family."
    },
    {
      "rating": "10",
      "text": "Truly beautiful movie about what makes us human. I enjoyed it a lot and I can't understand why Chappie wasn't more succesful. The action sequences were also pretty thrilling. I do like the actors too, although everyone seems to dislike them. Interesting lead roles who play their parts very convincing. I love it ! 10 out of 10."
    },
    {
      "rating": "10",
      "text": "No other movie in years has entertained me, moved me and made me laugh like Chappie did. This movie really spoke to me. It's definitely not your typical robots, action and explosions movie, like I first suspected based on the trailer, which sucked. It has some great action, effects and cool music, but that's definitely not all it has to offer. First time in my life I'm going to see the same movie twice in cinema. It's a good movie, no bullsh*t, so do yourself a favor and go see it right now, I'm not lying, it's even better than District 9 and Elysium! 10/10 :)"
    },
    {
      "rating": "0",
      "text": "Bad acting and gratuitous, fringe pop-culture(violence & profanity). Watkins leads the ham with Dev Patel and Jason Cope adding the cringe for the male roles, Sigourney looked tired and old in female support to a Capetonian Zef star, Yo-Landi. The characters tried too hard and the story remained predictable making the ending an anti-climax. Blomkamp needs to progress beyond local talent or suffer the consequences."
    },
    {
      "rating": "10",
      "text": "Best unintentionally hilariously brilliant movie of the year!\r Me and my friends had some time to kill so we decided to see a random movie that's we'd never heard of, it'd likely be bad but it'd be a good laugh. We were SO! happy we picked this one."
    },
    {
      "rating": "8",
      "text": "Neill Blomkamp successfully blends the aural & visual wizardry of Elysium with the scrappy charm & smart storytelling of District 9 in his third feature-length film, \"Chappie\", which starts off like a South African spin on 1980's sci-fi, but then diverts from the pack and becomes its own thinking and feeling beast. Blomkamp's signature blend of raw violence and human sentiment is still on display throughout, but is more potent here since the director (and his wife Terri Tatchell) focus purely on the struggle between children and adults, and the hardships that come with growing up. The film also doubles as a tight, compelling meditation on what it really means to be alive. I think the critics missed the ball here.\r The title character, voiced and performed by Sharlto Copley, is fully realized. He gives the film a beating heart, and brings real-world human qualities and actual depth to an otherwise mechanical figure. I'd like to see Copley get some more quality roles in the movies. His maker, played by Dev Patel, isn't as well developed, but is no less compelling. Hugh Jackman from the X-Men films relishes the opportunity to play the villain, a roboticist skeptical of artificial intelligence. He is a hoot to watch, partially because of his mullet and the fact he's completely over-the-top. The real surprise here is rap group Die Antwoord as a pair of criminals who fight with Patel's character over how to raise Chappie. While their acting is rough around the edges, they help give the film a unique charm, adding wit and flavor to the gritty proceedings. Their scenes together provide commentary on dysfunctional families. The only weak link in this ensemble is Sigourney Weaver, sadly (as the CEO of the robot factory), since her role is basically a glorified cameo.\r Overall, \"Chappie\" is fresh, ballsy, confident and very entertaining (sorry, Divergent!). Blomkamp, with three winners in a row now, is at the top of the modern action movie throne. He is one of the very few people I trust when it comes to blockbusters, and his films are definitive evidence."
    },
    {
      "rating": "9",
      "text": "Blomkamp did it again, wow what a movie. Enjoyed it immensely and so did my friends. It is as touching as it funny and believable, can't believe how I didn't watch it in theaters just because of low critics score, well that's a lesson I learned, critics have a weird taste in a movies, so from now on their opinion is to be avoided. Watch it and you won't regret it"
    },
    {
      "rating": "7",
      "text": "I did not have high expectations for Chappie when I tuned in. Neil Blomkamp didn't impress me with Elysium and I had heard similar things about Chappie. I enjoyed watching Chappie develop as a character throughout the movie and its hard not to be interested in him as such an innocent form of artificial intelligence. I thought there were some pretty good performances in here. Dev Patel is pretty good and its pretty hard to criticise Hugh Jackman either, its a nice change to see him as the villain. Still Sigourney Weaver was very underused and Ninja the South African rapper hogged a lot of the screen time acting like an idiot and trying to promote his band Die Antwood. I found Ninja incredibly annoying at points and I hope we don't see him again in any major role. Other than that I enjoyed the action that Chappie had to offer and I think that if you are a fan of Blomkamp's other films you will likely enjoy this one."
    },
    {
      "rating": "9",
      "text": "Very good fun to watch. Chappie is a generally loveable film with an interesting plot, good characters and even though Die Antwoord don't act, they did it pretty well. Recommended to watch."
    },
    {
      "rating": "0",
      "text": "This is one movie I should have went with my instincts, and that was to pass it by!  What a mess of a movie, never holding it together at all.  The acting was horrible and you could tell even some of the main actors such as Hugh Jackman were thinking what was I doing when I agreed to be in this movie!  The bad guys and robbers were idiotic and uninteresting and way overdone, and to add to insult looked like they come straight out of a comic book with tats and funny hairdo's.  They acted like they had IQ's under 50, and made the movie even worse than it already was.  Overall the movie was a mess and I would never recommend this to anyone!"
    },
    {
      "rating": "9",
      "text": "Chappie is a clever story line that rides the fringes of current futurist discussions on AI yet keeping a compelling story. Great acting, culturally unique, great CGI and thrills me to no end the public and professional critics have such a diverse rating, disruption for the win, black swan if you will. The people have spoken. Chappie keep that swag up."
    },
    {
      "rating": "9",
      "text": "A heartwarming R-rated sci-fi action flick about what it really means to be human.  That should have been the tagline for this film.  I honestly feel that this was a great movie.  Every bit as good as any action film made in the last few years, including the Avengers.  But I take it for what it is.  It isn't supposed to be the next AI.  It is meant to be an engaging movie more along the lines of a cross between Robocop and Short Circuit.  Too many film critics have compare-it-itis.  They want every film to be better than the last.  They want deep thought-provoking transcendent films and anything that takes the risk of just being enjoyable gets hammered for it.  Chappie is not brilliant  but it is a mix of adulthood and childhood and innocence and violence that allows it to stand on its own as an honestly enjoyable film."
    },
    {
      "rating": "10",
      "text": "es una gran película la cual te mantiene muy entretenido en todo momento por la gran actuación de chappie y la creatividad de poder inventar un software para darle sentimientos humanos a un robot por eso se merece un 10 esta pelicula"
    },
    {
      "rating": "10",
      "text": "Entertaining! I like it a lot, I am confused as to why critics are giving such negative reviews. Some parts are a tear-jerker and some are fun to watch."
    },
    {
      "rating": "10",
      "text": "the people who rate this 6 or below what are u thinking this movie is great in all the ways possible.It may be a bit gruesome but it is still one of the best movies ever."
    },
    {
      "rating": "8",
      "text": "If you go into \"Chappie\" expecting an even more profound retake of \"District 9,\" you will be disappointed. If you go in hoping to see a fun (and funny) popcorn movie with fantastic visuals, entertaining performances and some softly-delivered social messaging, then this is a perfectly good way to spend two hours. I'm really bothered by the criticism of Neil Blomkamp for supposedly becoming \"M. Night Shyamalan 2.0\". Just let the man make his weird movies. His vision is fresh and his movies are well crafted. Giving  rappers Die Antwoord (Ninja and Yo-Landi) major roles was a big risk that mostly paid off in the final scenes (and reinforced the distinctly South African feel of the movie). My advice? Ignore the haters and relax. \"Chappie\" might be a spiritual successor to \"Short Circuit,\" but it actually has a soul. That's no small feat in today's studio scene."
    },
    {
      "rating": "6",
      "text": "As I think, a movie becomes best when the viewers find something unexpected at the end of the movie. But, this movie ends with a normal ending. when Deon got hurts, Chappie, as a robot shows humanity and try to save him while his battery was going to over. By my opinion, the end of the movie can be better if the director presents that Deon stay wounded and when polices enters into the hall Chappie's battery would down and it would be dead. Because, the human brain can never be transmitted, i believe, death can never be ignored. But, the movie shows that with the  neurotransmitter helmet human consciousness can be transferred to a new body which is totally impossible and unbelievable.\rOver all, the movie grows up very well. One can learn bad sides of arrogance, not to stop in front of your dream from the movie. Deon's perseverance is quite impressive. But seriously speaking, It could be my most favorite movie if it ends in an unexpected way not showing that with science one can ignore death.\rThank you, Neill Blomkamp for a beautiful movie."
    },
    {
      "rating": "9",
      "text": "An iconic Sci-Fi movie. I liked the storyline, but felt it's true worth was in the cinematography, graphic art, and sets. The conclusion left me on a high note. I liked the relationships depicted in the movie. I also liked Hugh Jackman as a bad guy. I think he is naturally good at this."
    },
    {
      "rating": "9",
      "text": "It's hard for me to comprehend the amount of rather medium good feedback on this movie, which I'd still count to one of my favorites. What I like so much about CHAPPIE is that the movie is a take on a precise vision on artificial intelligence and what massive dangers go along. Maybe my personal interests, hopes and worries are distracting me but what can be seen at this piece of cinematic creation should not just be handled without care, as machines can potentially become a real thread to humans one day, so this movie moral currently seems quite underated. However the philosophy, even the movie itself is interesting and exciting most the time. I dislike the main conflict, as it is nothing new and especially not exciting at all, but for me following the story of an inhuman child was very fascinating. The story has certain points giving you a feeling of unsafety and other where the viewer will be asured for something good to happen soon, as he/she will learn to somehow get in touch with CHAPPIE himself/herself and after being done watching this movie it will stay in your thoughts for a long amount of time, at least that happened to me. The general elaboration is very actionish, basically this film is shootings, violence and some plot in between. Even though I am usually opposed to that themes, it didn't quite disturb me as for CHAPPIE, where the situation of some kind of mental war was enforced to that showing of direct power. Overall I really enjoyed CHAPPIE and I can not say often enough that this movie was to rule my thoughts and still has influence on how I think about robotic technology, as how I see it the backgrounds of the movie are not as groundless as they might think at first and the visual content appears quite dystopic, but yet somewhat plausible and that's what fascinated me the most about that movie, I do really recommend to fans of Science fiction."
    },
    {
      "rating": "7",
      "text": "Chappie isn’t a failed mission more than it is a missed opportunity. Because despite the many, many critics firing at it to its post-apocalyptic hell and back—specifically targeting director Neill Blomkamp’s 2009 commercial and critical breakthrough District 9, calling his success a “fluke” after 2013’s disappointing Elysium and considering him a “one-hit wonder” among the sci-fi genre—I, however, found Chappie to be both conceptually and visually involving when it wasn’t balancing on a tightrope between Chappie’s Short Circuit’s innocence-meets-Iron Giant’s naivety and the “gangsta” glorification or glamorization of their respective stereotypes. It’s one of the rare occasions where the R rating felt quite restrictive and main protagonist Chappie’s awe-inspiring lightheartedness and the supporting characters’ vulgarity and ugliness and the film’s gritty nature crossover in what appears to be Blomkamp’s identity crisis of whether he wants his ‘80s sci-fi influences to tug audiences at the heartstrings or the attention span.\r As you can tell from the “awe-inspiring” comment, maybe I’m of the minority that found Chappie’s childlike nature both charming and, dare I say, cute as a former police bot could be. It’s a bit frustrating when I hear film critics call adolescent characters in any film “annoying” based on, let’s say in Chappie’s case, their immature, inquisitive, or at certain scenes, whiny qualities. Because aren’t all children annoying because of their wondrous behavior? I could’ve understood these criticisms if I didn’t let out so many damn ‘awe’s at Chappie’s dialogue; from Chappie’s use of “mommy” and “daddy”—both [spoiler]    referring to the South African rave-rap duo Die Antwoord, ok—to the take-it-or-leave-it “f***-mother!” to the questions that even bask in the back of our minds from time to time regarding our own existence (“Why did you make me so I would die?”). The supporting characters—Chappie’s good-natured AI creator and the oppositely-natured Die Antwoord respectively—are all there, ready to adopt the bot for their own selfish moral desires, which is engaging entertainment in its own right once you see Chappie’s rapid character growth due to their influences all-in-one. But it’s as if the human characters themselves experience frequent and unusual personality malfunctions throughout Chappie’s two-hour duration, where DA’s Yo-Landi even becomes more nurturing than the creator.\r Besides the narrative shortcomings, philosophical and political undertones also make their way into Chappie in typical Blomkamp style, where we are not once explicitly aware of what he’s actually trying to say outside of obvious topics—such as the state of consciousness and how far it may or may not expand beyond that of current common knowledge, not that 2013’s Her didn’t already quite commendably confront that—and AI—already. Because let’s face it, Blomkamp just can’t take a breather when it comes to the film’s overabundance of action sequences. The $50 million budget definitely results in some visually striking imagery and the South African setting feels original in an era where everything in cinema is happening in either America or Europe nowadays. But couldn’t we get at least a hint that the storyline can progress itself without the need of guns, explosions, ultraviolence toward the third act, and more and more explosions. As if its identity crisis couldn’t have been distracting enough regarding its moral stance and aforementioned change in tone.\r But as much as I could nitpick Chappie for simply not being District 9’s much, much more successful storytelling, I’d be a damned liar if I said I didn’t feel enchanted or engulfed at least once throughout its desperation of wondering what Short Circuit would be like if it existed in the RoboCop universe. If I was ambivalent at certain moments, I began to see the inspiration start to sneak through the tiniest bits of dialogue or visual sequences, particularly those involving Chappie himself. It’s an excellent concept that merely needed a longer lifespan during the developmental process, perhaps if Blomkamp wasn’t so anxious to direct the next Alien sequel—but, I mean, who wouldn’t be? After reading online into many professional’s reportedly slim expectations regarding its fulfillment of its half-of-a-hundred million dollar budget, I’ll be even more disappointed if Chappie doesn’t at least garner a cult following just so I can hope for the slightest chance that Blomkamp—or another director, if so many others don’t find him fit enough—to reintroduce us into this universe, whether it’s in the form of a sequel or perhaps even a reboot in the distant, distance future. Please!\r Overall rating: 7.1\r P.S., without revealing any major SPOILERS, one of the scenes has Chappie in his childlike form receiving quite a bit of physical and emotional abuse and has received negative reactions from former victims of child abuse, saying it triggered painful memories. A warning, I suppose."
    },
    {
      "rating": "8",
      "text": "This is a movie not just entertaining but also refreshingly create a very solid and foreseeable future. Though it might have peppered with some unreasonable moments and few screenwriting drawbacks, it's still an awesome action-packed movie (and heart-wrenching sometimes) in a way that as well enables me to wonder if we are more human or robot if conscience could be transferred from human to a robotic body comparing to a self learning sentient android that could develop its own \"conscience\"...\rP.S. This could also be a good lesson to how one should bring up a kid by setting good example and using the right language in front of them..."
    },
    {
      "rating": "8",
      "text": "This movie was great! The Wife and I really enjoyed it. Very well done and they did an amazing job of helping us the viewers connect to Chappie. Being a parent it was quite an experience seeing Chappie behave as a child and grow as a being. Really well done, fun movie!!"
    },
    {
      "rating": "10",
      "text": "The critics are snobs, dont read them. Amazing movie, I never post here or any review sites but seeing the harsh critics I had to.\r Great plot, some minor annoyance there, but all payed for by the chappie character who you grow with and love."
    },
    {
      "rating": "8",
      "text": "If you're a fan of Die Antwoord, you're not going to want to miss this film. It has a huge heart, and I really enjoyed it. Perhaps my super-low expectations based on the critical reception laid the groundwork for my warming up to it, but I had a huge smile on my face for most of the film. Dev Patel as \"The Creator\" and Yo-Landi Visser as \"Mommy\" are both terrific. The action is brilliant, and the direction is solid. This movie is SO much better than Blomkamp's previous film Elysium, which was so bogged down in social politics that it forgot to make a living, breathing, feeling story. One critic suggested that Chappie might have been better suited for cinemas 20 years ago, and I can't disagree. Maybe even 30 years ago - E.T. style. But I greatly enjoyed this in the here and now. Especially given how BAD movies have been lately."
    },
    {
      "rating": "8",
      "text": "The Critics seem to have taken an offence to this film and have literally badgered the ratings in Rotten Tomatoes and Metacritic. They feel this film is worse than Elysium and it’s Neill Blomkamp’s worst film. “Robocopy”, “Jar Jar wept..”, etc. were the exact comments critics came out with. One of them has even quoted “I haven't been as happy to see a movie end since the third Transformers.”\r Are you kidding me? It was a blast and this film keeps you engaged throughout the film. There’s never a boring moment. I’ve read most of the reviews and they only have a very few valid points. There are things like how Jackman pins Dev Patel with a gun in office without anyone saying anything or how gangsters let their kidnapping victim come and go. Yes, these are some screenwriting concerns which makes the experience unreasonable at times. But it’s still a breezy script and the action moves along without having a dull moment. Trust me, most of the reviews are just wild rants and people conforming to peer pressure. I’ll take down their points one by one.\r This film has been heavily criticized for its derivativeness, especially with its links to Robocop. But hey, there’s nothing original in art, and art is all about referencing other art forms. Also, original may be uninteresting and boring. On the contrary, this film is refreshing new especially the way he combined old references to create something unique. Much like Tarantino, he took it to a whole new level of existential philosophy and action. In fact, it’s way better than any Robocop sequels ever made.\r Now, an annoying Chappie seems to have bothered many. But hey, wasn’t Chappie was just as fun like being with a child. And, making it behave like a child must include a little annoyance. It makes it cute and realistic. No wonder Yolandi’s motherly instincts kicked in so well. If anyone thinks that an annoying child is a bad thing then they should check with their psychiatrist immediately.\r Yes, the acting wasn’t great like Birdman but it wasn’t a distraction either. If people are upset because the actors look odd and aren’t as good looking then they should think again. Nothing is noticeably bad, rather it’s realistic. And, if Birdman hasn’t bagged any Oscars for acting then what acting are we talking about? Sharlto Copley was awesome and how he brings Chappie to life from an inanimate is commendable.\rBlomkamp has expanded big time on philosophical content in films and he really provides us with something to think about. What is consciousness and how can it pass on? Does it itself make someone exist or we only exist when others believe that we do? It’s a classical existential film which tells us how important it is for us to attach meaning and purpose to a cause. It’s also a statement on how the world is a bad place for an outcast or someone who is different, and expands on his earlier xenophobic themes in films.\r I must add that there are some missed opportunities in this film as well. The sense of style in District 9 was there but not as good and because of this the film lacked unity in style. Secondly, they could have done better with some strong actors even though the acting wasn’t so bad. Third, some of the characters were really not necessary for e.g. Dev Patel could have had a minor role. They draw attention away from our main character i.e. Chappie. Also, the antagonists could have definitely been stronger and more intimidating. Lastly, it needed to be a little darker and going by D9 it fell a little short.\r However, saying all that doesn’t take away from the fact that this is still a very emotional film and gets you to choke every now and then. At the same time it is filled with some tense action scenes. It’s delivered on its ideas too and is subtle enough to scratch your head when you think about those existential questions. But, above all it’s a fun ride with Chappie who’s thrown into this world with no knowledge of things around him. Definitely could have done better with a little more fun and humor, but either way it was still a great watch. I loved it and I have my own reasons no matter what the others say, especially the recognized critics. So, I suggest to go and find it out for yourself because, “I am consciousness, I’m Chappie”"
    },
    {
      "rating": "10",
      "text": "You wouldn't know it from the ads, but Die Antwoord definitely makes this movie. I couldn't believe what I had just seen. Wow. Must see for any Die Antwoord fan."
    },
    {
      "rating": "8",
      "text": "Chappie has gotten mixed reviews, but I think it is mostly because people come in expecting it to be some action robot fighting movie or a super realistic robot movie. Instead of being a pure robot action movie, they try to take on the when does something become truly alive. If a mechanical device becomes self aware and has the ability to learn in its own, should it be thought of like a human.\r The concept is not be all that new. Everything from Blade Runner to Ghose In The Shell has hit the same basic concepts.\r If can except some of the stretches in science used in the movie and do not mind some pacing issues with for the most part predictable characters and story lines, this should be a good movie to watch. It is much better than movies like Lawnmower Man and Transcendence which take on the idea of transferring a soul or mind from one body to another. The acting was good on average. It was nice to see Hugh Jackman take on a bad guy role. It is just to bad it was a very common bad guy role. Sigourney Weaver also delivered a very cliche character. I think both Jackman and Weaver could have been pushed to make their characters more unique.\r If you are looking for a mindless action movie, this is not it. If you liked Blade Runner or you love all things SCi-Fi, then this is worth seeing in theaters."
    },
    {
      "rating": "9",
      "text": "What do all the haters want from this movie.?This is basically an adult version of short  Circuit... With an awesome central performance from sharlto copley. .. That is both humerous and touching."
    },
    {
      "rating": "10",
      "text": "I don't get what all of the negative press is one about this movie is up  there for one for my favorite movies this year. I the AI is pretty accurate and Blompkamp still makes the most realistic robot vs human fights ever!"
    },
    {
      "rating": "10",
      "text": "Apparently this is just a movie everyone needs to see and judge for themselves. I am SERIOUSLY baffled by the negative reception from critics! I loved this movie, and I thought it was a very well done analysis of consciousness and self/self-identity. A beautiful coming-of-age film.\r What impressed me most about this film was that I didn't feel like I was watching a smart robot come to self awareness, but, rather, I was watching a consciousness come to self realization. Chappie's development in the film was impressively organic. Often robot movies like this one suffer from too many eureka moments and light-bulb-above-the-head cliches: the problem with these cliches, is they don't reflect how living consciousness grows as we experience it in humans (our only reference point). Chappie really feels like a human consciousness, just trying to learn how to live the best he can. Chappie does not feel like a robot learning that he is alive, which is appropriate since, as a consciousness, his \"alive-ness\" is taken for granted from birth.\r The film really moved me, and I was in tears several times. The action was also great, as was ALL the acting. The narrative was, in fact, solid, even if it wasn't revolutionary. It told the story it needed to. Directing was also well done.\r I would give this film a 9, but it moved me so much, that I feel I owe it a 10. Can't wait to see it again!\r Really underrated. I am confident that in time this movie will be more well liked. This may be a case of expectations ruin the movie? I really don't know."
    },
    {
      "rating": "10",
      "text": "I am a twenty-year-old male cinephile. Films like \"Life is Beautiful\" and \"All Quiet on the Western Front\" have brought a tear to my eye, but \"Chappie\" is the first movie to ever make me break down and cry. It's a truly brilliant film; even its action sequences affirm the humanity of the movie's title character. Its refreshing, idealistic (and ultimately proper) view of human nature is something we sorely need in an era where nihilism dominates our culture. It's a hopeful film and a wonderful one. It's also brilliantly written, acted, and shot. Don't believe the critics on this one. The cerebral could broadside them with a club and they'd still cast their bids for Oscar-bait trash. \"Chappie\" is a magnificent exploration on what it means to grow as a human person. If you've even an inkling of hope or creativity in you, then this movie is for you."
    },
    {
      "rating": "10",
      "text": "We came out of the movie raving about it. There are plenty of other movies out there already that have tackled the subject of AI, consciousness, etc, but: this one did it much, much better.\r I'm surprised to see such negative reviews, but the best parts of the movie were subtle. This is a movie where paying attention is rewarded immensely, whether it comes to Chappie's animations or the small moments that affect Chappie's character development.\r I laughed hard, I teared up, I came away satisfied."
    },
    {
      "rating": "10",
      "text": "Chappie is such a great movie. Shame the critics don't like it. IGN gave it like a 75 which I thought for them was way low. I'm into the sci-fi stuff so if ur not u may not like it I'll say that about it. Although its not a homerun for everyone, The ones who do like movies like pacific rim and district 9 this movie is a 10. Go see it don't believe the hate. Its def a ride worth taking."
    },
    {
      "rating": "10",
      "text": "I've been shocked by reviews before, but I have never been more blown away than by the critical response of Chappie. This movie is damn near perfect. I think it might be the South African sensibility of the whole movie. This is one of the most fundamentally sound films I've seen in a very long time. It's an action-comedy love letter to the musical duo Die Antwoord. I'm a Die Antwoord fan but even if I wasn't I would understand what Blomkamp was trying to do. This was like a modern day Yellow Submarine with more movie than music and Die Antwoord doesn't suck at acting like the Beatles did. Ninja and Yolandi were actually very solid actors for this being their first film. The rest of the cast crushed it because they're all incredibly talented especially Patel. I hear a lot about Jackman's two dimensional villain and how bad it was, but that's what kind of movie this is. It's a serious movie that never takes itself too seriously. I swear to Science that film critics these days are so far up their own a***s that they wouldn't know a good movie if it puked in their face. Chappie is a solid flick and deserves praise. I think Die Antwoord should be praised for how solid they were in this movie."
    },
    {
      "rating": "8",
      "text": "There's something here for everyone, except stuck up film snobs apparently. It's a fun movie, just adjust your expectations. Far more human and interesting than Ex Machina"
    },
    {
      "rating": "10",
      "text": "I had high expectations from this movie, since I absolutely love District 9 (same director in case you didn't know) and thought Elysium was very decent as well, but... Chappie exceeded my expectations by far. Such a fantastic film."
    },
    {
      "rating": "8",
      "text": "The reviewers totally misunderstood this film. It's not about Artificial Intelligence, Die Antwood, Robocop or South Africa. This is the quintessential 'outsider' film. Everyone character is alone, from Sigourney Weaver to Hugh Jackman. Even the gang members aren't united. Blomkamp hands it to us on a platter with the 'Black Sheep' story but the critics overlooked it. It's a film about trying to find your identity. It's about bullies. Its about how cruel and selfish  people can be. 'You all lie!' A couple of plot holes, yes, but hopefully, in time, this film will find it's way into acceptance. A shame for all involved as there's much to discover, not all so obvious."
    },
    {
      "rating": "8",
      "text": "(spoilers ahead) So I'm a pretty big fan of these critical thinking movies, and there's a lot of thinking and philosophy to be gained from this movie and the movie does a great job with the whole theme of god, humanity, immortality, and loss of innocence as we watch our main character Chappie come to terms with the world. But here's the thing that personally got me and that's the ending, it wasn't terrible but int the whole build up of Chappie essentially dying and with this looming death overhead he tries to find other means to try and live even breaking his promise with Dion saying he will do no crime so there's the loss of innocence as he ignores Dion and get's tempted by everyone else to do commit crime, and in the end it should of been a confrontation with him and Dion (his maker) who is kinda portraying god who at the end of the movie is dying from a fight but Chappie believes he can save him by transferring his consciousness into another robot essentially letting him live forever, but this is successful and Chappie does come to terms with his death happy to sacrifice himself so that his maker is alive and well but Dion then say he can save Chappie too and this is successful. I am saying that a sadder ending would of been miles better in delivering a message about humanity and all but in the end the overall movie is visually stunning with his robotics and does provide a look on someone growing up and facing hardships making him stronger for it (even though the movie is being held within the spam of a week). I was actually sort of thinking the story would of been different like the police were abusing their power and a guy who made the robots get's another point of view and decides to help by trying to create a robot that will help rise against the oppressors and this goes with the theme of Chappie growing up and is being pulled by two sides as both argue a somewhat valid point like one guy suggest going against the robots and that'll take the power for the corrupted another suggest go for the head of the snake and kill the corrupted so they can instead have the power."
    },
    {
      "rating": "10",
      "text": "Great movie, really fresh and also love the way they use the Die Antword's world, I don't understand why such a bad review with this movie, critics as alway doing their jobs.\rGreat movie and really fund to watch!"
    },
    {
      "rating": "8",
      "text": "Awesome movie was a bit of a letdown from Elysium. I was surprised how many people were in my theater when it was over halfway empty. The robot was very funny and I actually had feelings for the gang members."
    },
    {
      "rating": "10",
      "text": "This was great. I don't usually laugh at the endless forced jokes in America/British/Canadian movies but this had me cracking up. Think of this as Sci-Fi Comedy, the trailers don't really do it justice and you go in expecting grim misery."
    }
  ],
  "recommendations": [
    "equilibrium",
    "v_for_vendetta",
    "tomorrowland",
    "the_13th_warrior",
    "okja",
    "the_darkest_minds",
    "morbius",
    "lucy",
    "they_live",
    "run_hide_fight",
    "antebellum",
    "colossal",
    "fight_club",
    "the_lobster",
    "sucker_punch",
    "what_happened_to_monday",
    "bright",
    "the_butterfly_effect",
    "elysium",
    "apocalypto",
    "code_8",
    "chaos_walking",
    "her",
    "cloud_atlas",
    "the_adjustment_bureau"
  ]
}