{"id": 3841, "title": "Charade", "starring": ["Cary Grant", "Audrey Hepburn"], "runtime": 113, "genre": ["Comedy", "Mystery", "Romance"], "description": "After Regina Lampert falls for the dashing Peter Joshua on a skiing holiday in the French Alps, she discovers upon her return to Paris that her husband has been murdered. Soon, she and Peter are giving chase to three of her late husband's World War II cronies, Tex, Scobie and Gideon, who are after a quarter of a million dollars the quartet stole while behind enemy lines. But why does Peter keep changing his name?", "releaseYear": "1963", "mpaaRating": null, "imageUrl": "https://image.tmdb.org/t/p/w500/ijJ73UgR6nOqjSP8MO0Z7hawCdm.jpg", "categories": {"plot": 7.25, "acting": 7.25, "ending": 7.0, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 7.0, "funny": 5.0, "action": 5.0}, "reviews": [{"rating": "7", "text": "Here we have a movie that, as a simple pitch, wouldn't grab me at all. You're trying to do Hitchcock and Wilder at the same time? In the same movie? With screwball elements added on top? Get real. Remarkably though, \"Charade\" manages fairly well for itself, juggling murder scenes (some of which are pretty graphic for the time, by the way), snappy dialogue passages, and characters goofing off with a noted amount of skill. And, although the final product may not be entirely even all around, it's an absolutely valid effort from a tonal standpoint. Let's not kid ourselves here, however. You came here for the all-star cast, but you're going to stay for the bendy, twisty, and malleable caper narrative in play. I love it when movies get cute with the plot like this. Sure, some of it is predictable, but I'll always feel better when a writer or director feels they have to escalate what they're doing from scene to scene, whether that's with the action, the visuals, or -- in this case -- the plot elements. No character is who they seem to be and the audience's understandings of these characters are constantly pushed, pulled, and poked at, always giving us something to doubt, consider, or simply think about. It's a damn fun time and I'm glad I finally got around to seeing it."}, {"rating": "10", "text": "What could be more delightful than the lovely Audrey Hepburn and the humorous, handsome and charming Carey Grant? Charade is the perfect vehicle to enjoy them. It has a fascinating thriller plot, which is presented quite seriously with convincing bad guys, while the stars keep the romance light and funny. It's the Hitchcock movie that he didn't make, but anyone who loves those movies simply must see Charade. There's a noticeable age difference between these blockbuster stars, and I love how it is handled directly with humor. One of my all-time favorite movies."}, {"rating": "2", "text": "Film d’espionnage ou film policier… on ne sait pas trop. Simplement une petite comédie qui mélange les genres et se fout de nous avec ses rebondissements tout droit sortis d’une blague carambar. Ouais, faudrait pas nous prendre pour des canards sauvages non plus, car au énième retournement de situation, on pourrait bien prendre la mouche !Il n’y a donc pas grand-chose qui tienne debout dans cette pantalonnade et son parterre de stars, à part le sémillant Cary Grant et les James Coburn, George Kennedy et Walter Matthau, excusez du peu… Quant à la cruche anorexique (la cruchette endimanchée) aux yeux de Bambi, elle tape carrément sur les nerfs : tais-toi un peu et va plutôt manger un gâteau, histoire de te remplumer un peu.On a tout de même (aussi) la jolie musique d’Henri Mancini et un passage comique -le seul du film- dans lequel on peut constater un jeu apparemment très prisé à l’époque, le jeu de l’orange. C’est quelque chose !Notons tout de même la duplicité très appréciable (si elle n’était aussi surexploitée, la pauvre) de ce bon vieux Cary qui passe d’un registre à l’autre avec une aisance déconcertante. Cela ne sauve pas le film pour autant, ni ce Paris d’antan dans lequel s’éparpille ce scénario abracadabrantesque… et grotesque !"}, {"rating": "8", "text": "When I saw the poster for this I really thought it was a Hitchcock film, and then the comparisons started, so I definitely had to see it.The script is light but the mix of drama, romance and mystery is effective, fast paced and above all entertaining.The chemistry between Cary Grant and Audrey Hepburn is great and when your lead characters work so well with the story you're telling, you get a film that doesn't seek anything extraordinary, but more importantly, seeks and succeeds in being a good one."}], "recommendations": ["midnight_in_paris", "notting_hill", "the_royal_tenenbaums", "jackie_brown", "the_nice_guys", "lucky_number_slevin", "fargo", "catch_me_if_you_can", "logan_lucky", "in_bruges", "american_hustle", "american_ultra", "blood_ties", "sleeping_with_other_people", "the_grand_budapest_hotel", "casino", "eddie_the_eagle", "spenser_confidential", "the_fifth_element", "seven_psychopaths", "kingsman_the_secret_service", "true_grit", "legend", "murder_on_the_orient_express", "the_tourist"]}