{
  "id": 2014,
  "title": "Charm City Kings",
  "starring": [
    "Jahi Di'Allo Winston",
    "Meek Mill"
  ],
  "runtime": 125,
  "genre": [
    "Drama"
  ],
  "description": "Mouse desperately wants to join The Midnight Clique, the infamous Baltimore dirt bike riders who rule the summertime streets. When Midnight’s leader, Blax, takes 14-year-old Mouse under his wing, Mouse soon finds himself torn between the straight-and-narrow and a road filled with fast money and violence.",
  "releaseYear": "2020",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/8oiMFMarbRpcusASIX4cjVXoZKI.jpg",
  "categories": {
    "plot": 8.272727272727273,
    "acting": 8.3,
    "ending": 8.5,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 7.0,
    "action": 10.0
  },
  "reviews": [
    {
      "rating": "8",
      "text": "The documentary 12 O'Clock Boys revolved around dirt bike riders in urban Baltimore and the young boy who aspired to join them. This fictionalized version of that film stars Jahi Di'Allo Winston, who’s simply spectacular as the 14-year-old. As a matter of fact, the entire cast is chocked with real, compelling performances (Teyonah Parris, as his mom, is especially heartbreaking). The Black culture and characters are portrayed with verve and verisimilitude. It’s a hard story with dramatic turns and sometimes contrived situations. Even when it rambles (could use some cutting), the characters keep it interesting and the ultimate outcome (although somewhat expected) is effective. There have been stories about disadvantaged youth coming of age before, but this one has a raw energy and exceptional acting that make it distinctive. NOTE: The credits feature footage of the real riders performing some of their amazing stunts."
    },
    {
      "rating": "10",
      "text": "This is beautiful  good movie and realy is wonderful casting is good and directing good"
    },
    {
      "rating": "10",
      "text": "The clash of childhood innocence vs an environment that is relentless and unforgiving... a coming of age story that is very relevant and real. Loved every moment in this emotional ride of a movie... even when I didn’t want to accept where the story was inevitably heading."
    },
    {
      "rating": "7",
      "text": "Streamers! We've been getting pretty lucky with the recent streaming content produced and released. Over the weekend, HBO Max continued this trend by releasing a movie I personally have been waiting for this Sundance Festival darling, Charm City Kings. Charm City Kings is about a teenager named Mouse and his friends as they try to be a part of the most popular motorcycle crew in Baltimore. We follow the kids during this unforgettable summer that will forever change their lives. Let's see if Charm City Kings is worth the hype.First, I must talk about the cast. I didn't love the performances of the individual cast members, but I have to admit the heavy B-more accents were on point. Jahi Winston does a good job and so do his other lackies but it wasn't awe-inspiring. However, as a group of kids, I felt them. They give the viewer nostalgia over what it was like to \"run\" the streets wherever they grew up with their buddies. Chasing that girl you're crushing on and doing anything to impress her and others, even though it's clearly the wrong move. But there was one cast member that truly stood out, Meek Mill's Blax. Meek Mill, yes there is no \"s\" or \"z\" on his stage name, has a really strong performance in this film. In fact, Meek Mill does so well in this role that I'd actually enjoy seeing him in other, non-\"hood\" parts. I know people might get turned off once they hear he's in the movie but quietly he shines. As do the motorcycles and tricks throughout the movie.Now, the movie as a whole is predictable but the story still feels so real. The cast and director really do a good job of highlighting and portraying what life can be like for some of our young black men not only in Baltimore, but also across the country and world in underserved communities, cities, and populations. There is a profound need for resources and opportunities in the inner cities. There is similarly a profound need for good role models and mentors to step up to the plate. One thing that wasn't highlighted in this move was the lack of parental figures, especially of Mouse's friends. But by assumption, this movie does show how important it is to have a male role model in a young man's life to teach, guide, and protect them. Either way, the storyline in this movie is moving and worth promoting.With that said, Charm City Kings is just that, charming. The movie might not be perfect, but it is worth watching as the story and ending are powerful. Grab a big bowl of popcorn and try not to spill the kernels while watching all the tricks."
    },
    {
      "rating": "10",
      "text": "Best movie of the year. Great performance by main character and the writing is phenomenal. The action scenes leave you wanting to hop on a bike even if you end up in a hospital ."
    }
  ]
}