{
  "id": 375,
  "title": "Charlie and the Chocolate Factory",
  "starring": [
    "Johnny Depp",
    "Freddie Highmore"
  ],
  "runtime": 115,
  "genre": [
    "Adventure",
    "Comedy",
    "Family",
    "Fantasy"
  ],
  "description": "A young boy wins a tour through the most magnificent chocolate factory in the world, led by the world's most unusual candy maker.",
  "releaseYear": "2005",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/wfGfxtBkhBzQfOZw4S8IQZgrH0a.jpg",
  "categories": {
    "plot": 6.0,
    "acting": 5.777777777777778,
    "ending": 8.333333333333334,
    "soundtrack": 5.833333333333333,
    "cinematography": 4.333333333333333,
    "familyFriendly": 6.125,
    "funny": 6.076923076923077,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "0",
      "text": "A shocking and unnecessary remake. What a complete and utter piece of tripe. Tim Burton and Johnny Depp should be ashamed of themselves."
    },
    {
      "rating": "3",
      "text": "Depp aint no Gene Wilder. What a pile of tripe."
    },
    {
      "rating": "2",
      "text": "This movie is still horrendous. I would call it \"scum,\" but I'm too nice of a person. In my earlier review, I pointed out positive aspects of the movie. Well, really, I pointed out aspects of the movie that weren't as devastatingly horrible as Depp's performance. The Oompa Loompas are bad, the writing is bad, the acting is bad, and the aesthetic elements are only enough to entertain those who aren't yet old enough to understand that movies aren't all about pretty pictures and sing alongs. The only reason I give it a 2 now is to appease Nick R. And I do **think about [my] score**."
    },
    {
      "rating": "8",
      "text": "Before I start, let me say that I never read the original book nor have I ever watched the old Willy Wonka movie, and frankly, I have no intention of doing either. So without any expectations, I ended up enjoying this fun movie. However, I have to be honest in this review by saying Johnny Depp's performance in this movie was disappointing, becuase it just didn't feel like it was him, which is really unfortunate since I am a huge fan of him, especially in the Pirates of the Caribbean movies. But ignoring that, everything else in the movie is good."
    },
    {
      "rating": "6",
      "text": "I am fond of this film more so than the 1971 willy Wonka and the chocolate factory, for it's similarity to the book it's great visual effects and it's better story."
    },
    {
      "rating": "10",
      "text": "I love charlie and the chocolate factory because i enjoy watching the kids and their parents explore the factory where lessons are taught.the only thing i hated was Wonka's backstory"
    },
    {
      "rating": "9",
      "text": "This Movie was Still **** Great!! Even the Songs from this Movie!! I Still got that on the **** DVD!"
    },
    {
      "rating": "10",
      "text": "Tim Burton is a master at constructing brilliant and unique films that boggle the mind and defy all beliefs there films that deliver a bold new twist each time but what makes Burton a master is his attention and devotion to his story. The detail and meticulous design of the sets, the costumes, the atmosphere of his films and how they all in some  strange way  impart a certain message of sorts   that  has a  bizarre connection to real life.  Tim Burton's 2005 adaptation of Roald Dahl's   beloved children book \"Charlie and the Chocolate Factory\" has a method to its madness and a meaning to its story. \"Charlie and the Chocolate Factory\" is one of Burton's best films since Big Fish and Sleepy Hollow.  Tim Burton's take on the legendary tale of  eccentric chocolate maker  Willy Wonka and  young dreamer Charlie Bucket  is a  film of meticulous   design, it is meant to be a children movie but  \"Charlie and the Chocolate Factory\" plays out better as a quirky adult  fantasy adventure  with a PG rating. Burton doesn't spare any detail  he uses all his style  and energy  to create the bleak world of Charlie Bucket  and all his imagination and  light hearted enthusiasm to make the  beautiful chocolate factory of Willy Wonka,  it's astounding how it works, how it moves along flawlessly  telling it's story and just wowing the audience in each and every scene. It is not a cheap exploitation flick with a famous name slapped on it it is a story about a person, a place and a situation that comes to be fall that person (Freddie Highmore). Burton has not only updated a classic story for a modern generation he has effectively made a film that is both true to his quirky style and   mainstream enough for modern audiences, It's one of the best films of the last decade and also one of Burton's very best.  The film only works   whether you believe in what you are seeing; it succeeds on   how you look at it if you look at it with a cynical point of view than this film will be a terrible time and a complete waste of money to you. However, if you keep your eyes open and your mind clear of any doubt than this film will work wonders on your soul, your imagination and your imagination.  Tim Burton's \"Charlie and the Chocolate Factoryâ"
    },
    {
      "rating": "8",
      "text": "Johnny Depp realises Tim Burton's strange adaptation of Roald Dahl's classic in one of his finest acting performances. He brings the bizarre to a character who was originally enigmatic, a bold and successful move. Not to mention the funky Umpa Lumpa songs, much better than 'Doo pa dee doo'. I don't care what the parents say, I prefer this version!"
    },
    {
      "rating": "3",
      "text": "This movie sucked. It completely changed from the original movie which I love, and the books. I have no idea why this movie was even made. WHY!? WHY DID THEY MAKE IT?!!"
    },
    {
      "rating": "9",
      "text": "Tim Burton is the master of darkness. every movie he makes kicks a**. including this one. the cast was very supporting, the songs were enjoyable, the visuals were brilliant, and the cinematography was awesome. with Burton around, Charlie and the Chocolate Factory is the best movie ever made."
    },
    {
      "rating": "5",
      "text": "Unlike the 1971 film 'Willy Wonka and the Chocolate Factory', this movie manages to stray closer to the original book that Roald Dahl penned. The result creates a more weird and quirky atmosphere that even Tim Burton fanboys are used to. Whilst the soundtrack was orchestrated beautifully by longtime collaborator Danny Elfman, it was another fellow confederate in Johnny Depp who was puzzling. His portrayal of Willy Wonka was so random in his mannerisms you couldn't help but scream out for Gene Wilder."
    },
    {
      "rating": "4",
      "text": "As a big fan of the original I may be unfairly critical, but when you remake a classic you should be held to a high standard which this film fails to deliver."
    },
    {
      "rating": "6",
      "text": "The acting is okay and the special effects are better. I like the original better but this one follows the book almost all the time. But I find the characters much more better in the book than the movie."
    },
    {
      "rating": "10",
      "text": "Charlie and the chocolate factory was a great movie. Charlie was a good kid, the parents were cool, and the bad kids were upgraded. Augustus was ruder and greedier, Violet was competitive, Veruca was a completely selfish, and Mike was addicted to video games and tv. I liked this film more than the 1971 film."
    },
    {
      "rating": "5",
      "text": "\"Charlie and the Chocolate Factory\" adds up overwhelming creativity into the book based movie. The result is that the movie got drunk with chocolate."
    },
    {
      "rating": "3",
      "text": "I held higher hopes for Tim Burton on the reigns for this remake.  Johnny Depp also gives a disappointingly creepy turn as Willy Wonka. Yes, there are some tasteful visuals but not much more."
    },
    {
      "rating": "3",
      "text": "I simply can't wrap my mind around how this movie has such high critical scores. Personally, I think Tim Burton is a visionary genius, but he can only work with stories that his type of directing specializes in: outcasts. In this movie, Wonka isn't an outcast, he's just weird and even creepy at times. All this balanced out by not-so-great songs and a cast that simply can't beat the original. Not the worst film, but overrated at the very least."
    },
    {
      "rating": "0",
      "text": "Tim Burton takes the original mediocre movie and makes it worse, the acting sucks and the characters and acting is crap there is no reason to see this movie at all."
    },
    {
      "rating": "10",
      "text": "I loved the film as soon as i watched it the umpa lumpas are my fav because i loved thier song chewing chewing they should make a cd from thier songs. johnny depp was really great for the part of willy wonka."
    },
    {
      "rating": "5",
      "text": "It was a decent movie, but if your like me, and have watched the original, this comes nowhere even close. The oompa loompas were horrible, Johnny Depp, didnt do a bad job, but his character (willy wonka) was annoying, silly, and sometimes boring. The one cool thing about this movie, was that we got to see into Wonka's past and how he became a chocolate maker. The young kid, playing Charlie, did an excellent job, but overall, this movie was a huge letdown. Alot of the humor fell short, and Gene Wilder is a much better fit for Willy Wonka, both as an actor and in the script. This was definately a remake of sorts, mainly aimed towards the younger audience. I was hoping it was like the original, but with Tim Burton's amazing talent. But it wasnt."
    },
    {
      "rating": "10",
      "text": "I think it awsome. JONNY YOU ROCK and yer i want the golden ticket =p"
    },
    {
      "rating": "10",
      "text": "I loved this movie. Tim Burton is the best no matter whta people think. The movie was NOT a remake or a sequel..It was what tim thought it should be so he expressed it how he saw it, U go tim burton. Work ur magic!!!"
    },
    {
      "rating": "3",
      "text": "Johnny Depp's characterization of Willy Wonka looked bad to me in the previews, so I just saw this on video. Be warned: if you didn't like Depp's Wonka in the trailers, you likely won't like him anymore after seeing the movie. I've heard Depp's Wonka compared to Michael Jackson in his mannerisms, and that's an apt comparison. They both seem very odd, and like someone you wouldn't want to have your children around- even supervised. Aside from Wonka, the Oompa Loompas aren't fun, the songs are forgettable, the adults are brainless, the children are pretty decent and so are the squirrels, but not enough to make this even an average movie-going experience."
    },
    {
      "rating": "6",
      "text": "Charlie and the Chocolate Factory is an amusing adaptation from Tim Burton. His style is stamped all over this movie in everything from ethos to characters to design. The film is not successful 100% of the time but it's a more than adequate re-interpretation."
    },
    {
      "rating": "9",
      "text": "There was never really anybody else who could have been up to the task of reinventing such an iconic and unique character as Willy Wonka, Tim Burton knows how to make every part of the screen count, whether it is a shadowed corner or the clothing of a bizarre character, in this case, he re-imagines not only a classic children's tale, but also a very successful film that many will still argue is better than Burton's vision, wither way one cannot argue at the scope and imagine of this very different tale.\rThe film is told in a dreamy sort of sense, with a mans gentle yet deep voice narrating, he explains the situation of how Wonka became a worldwide phenomenon, but faltered due to spies within his factory, but how he decides to send out five golden tickets to hold a very special tour for those lucky recipients. Charlie (Freddie Highmore) is not the most well-off of children, living with his four grandparents and his mother and father, and dreams of being one of the lucky ticket finders. Across the world, four tickets are find, and Charlie cannot believe his luck when he is the fifth and final finder, and so he begins his whirlwind journey of songs, greedy children and of course, chocolate.\rThe man in the top hat is played by none other than the most versatile actor of his generation, Johnny Depp, who creates one of the strangest and yet most awe-inspiring performances of his career, showing a genius we don't fully understand, a man with his own emotional grievances and family issues, a relatable man. His tour of the factory combines some beautiful scenes and even some funny sing-alongs from the Oompa-Loompas, this time played by one person in the form of Deep Roy. The film has big ideas and leaves plenty of room for some very interesting characters, and it is the child actors who are on top form in the film throughout, the confident Mike Teevee (Jordan Fry), the spoilt yet cunning Veruca Salt (Julia Winter) and the athletic and cheeky Violet Beauregarde (AnnaSophia Robb). These characters have a commanding and often funny presence on screen as they explore the many wonders of the factory, a place brimming with excitement and imaginative moments at every turn, its easy to get lost in the marvel of creation at play here, and its a true delight to see such effort going into giving the film a decent story.\rCloser to the source and certainly different from the original, whatever personal thoughts may go into each film, there is no denying the wonderful scope and imagination of Burton and Depp's Wonka, a crackpot genius with a juvenile personality and a flamboyant dress sense, as only a larger than life character can have, the film is much darker and tone but is definitely more suited to the current generation and style of film,  definitely a creative piece through and through."
    },
    {
      "rating": "5",
      "text": "Charlie and the Chocolate Factory is a pretty average for very weird movie. There's a distance, a detachment to this film. It lacks passion. But its has some very funny scenes with Jonny Depp."
    },
    {
      "rating": "6",
      "text": "This is the perfect example of a film that never needed to be made. It adds nothing to the original film and if anything it takes away from the original. This Burton remake has none of the charm of the original and what it lacks in charm it makes up in the creepy Burton style. That said the film is more faithful to the book but that doesn't make it any more enjoyable. If you like the book go and see it. If you love the original film you might just want to skip this remake."
    },
    {
      "rating": "5",
      "text": "Tim Burton's weird adaption of Roald Dahl's novel is a partly hilarious movie that stars a fantastic Johnny Depp as the maverick chocolatier and Freddie Highmore as the eponymous boy who is allowed to pay a visit to the former's mysterious chocolate factory. While the funny, yet not at all musically complex musical numbers are a welcome and amusing gimmick and Depp provides all-ages-entertainment at its best, very little of this movie stays in memory. The production design and the costumes are impressive, but it's the 21st century and a creative director like Mr. Burton could've really made more out of the source material. Furthermore, most of the movie's cast is miserable and extremely overacts their parts. The bad performances are also bred by the utterly silly screenplay that may contain good laughs for pre-school kids, however, is oftentimes boring and really cheaply written. I can't help myself but think that Mr. Burton didn't even utilize half of the potential that the original story has. But besides that, it's a very enjoyable family movie that has truly humorous scenes for both kids and adults."
    },
    {
      "rating": "6",
      "text": "This movie was okay and I really enjoyed Johnny Depp's Michael Jackson-esque version of WIlly Wonka (although he's stated on the Ellen show that his inspiration was imagining what a stoned George W. Bush would act like lol). But I prefer the original over this version. The one thing that really annoyed me in this movie was how bad the Oompa Loompa scenes were, the music was way too fast to understand what they were saying. In the original movie what they were saying was the focus of the movie, that got lost in translation in this remake."
    },
    {
      "rating": "6",
      "text": "In its quirky and fun ways, Chocolate Factory succeeds, especially with Depp as its leading man. Playing his usual kooky but fun character, Depp amazes you as Willy Wonka."
    },
    {
      "rating": "6",
      "text": "I know that the 1971 musical was unfaithful to the book, but I did much prefer that version to this well-intentioned but somewhat disappointing effort from Tim Burton, the director of Batman and Edward Scissorhands, and this adaptation was in some way more unfaithful in spirit than the 1971 film. The film does have some lovely sets and inventive visuals, the boat scene is fun if not as much as in the Wilder version, a great job is done with the Veruca Salt/squirrel scene and I liked the performances of Helena Bonham Carter, David Kelly and Freddie Highmore. But I was disappointed with Johnny Depp as Willy Wonka. He just lacked the charm and grace Gene Wilder brought to the character, and I don't think Roald Dahl intended a characterisation that was more Michael Jackson than Willy Wonka. Some of the cast overact, especially the girl who plays Veruca Salt, even for the character the spiteful spoilt brat act was way overdone. I liked the music score by Danny Elfman which is filled with whimsy and appealing oddballness(I much prefer his Edward Scissorhands and Nightmare Before Christmas scores however), but the Oompa Loompa songs were rather annoying with none of the noisy melodies memorable and were shot like a music video. Tim Burton evidently tried to make the story darker, and in some respects to the book, it didn't quite work. A good example was the case of the additional character of Dr Wonka, as much as I like Christopher Lee, and he did perform well, but his character was unnecessary, and the script with some over-explanatory narration lacked the sparkle of the 1971 film consequently. The grandparents did bring some comedy, and the movie does start off well. But the unfaithfulness of the last half, meant that the whole film felt rushed and lacking in charm and magic which the Wilder had aplenty. 6/10 Bethany Cox."
    },
    {
      "rating": "10",
      "text": "Wonderful movie. Great acting (Depp plays an intriguing Wonka, Highmore is a truly expressive Charlie), stunning visuals, usual great music by Elfman, great humour, the Oompa-Loompas... Highly recommended."
    },
    {
      "rating": "9",
      "text": "Delightfully creepy."
    },
    {
      "rating": "2",
      "text": "If you love Tim Burton flicks and haven't read the book or seen the Wilder movie, you will probably like or even love this movie. If you've read the Dahl book, seen the original movie with Wilder, and or dislike Burton flicks (as I do), you will probably be disappointed or outright disgusted. Burton's perverse rendition is a disjointed freak show that relies on quirkiness and cinematography over character development and plot. The movie does nothing to distinguish itself and pales in comparison to the original. It also assininely changes important storylines from the book and the Wilder flick to it's detriment. The movie left me thinking, \"Hmmmm... some of the lines were funny, the sets were neat, and some of the acting was okay, but overall this really sucks\". I gave a 2 rating only because of the quirkiness and cinematography (both Burton staples). If you dislike Burton, love Wilder, and/or Dahl, this movie will piss you off and leave you puzzled and empty. Otherwise, rent it and it may amuse you."
    },
    {
      "rating": "9",
      "text": "A true family film, technically masterfull, brilliantly directed, and Depp once more prooves himself an excellent actor. The art direction, fantastic. The score, superb...and the fun never stops."
    },
    {
      "rating": "1",
      "text": "This movie was disgusting!!! A shameful attempt of a remake! This movie has nothing catchy about and no interesting songs. The old movie is a million times better. This movie was just plain stupid. Don't waste your money."
    },
    {
      "rating": "7",
      "text": "Has much of the fun-house entertaining quality of \"Beetlejuice\". Depp's edgy, ambiguous, emotionally alienated character is well done, and the awful children are very well played. Is it for children or adults? The reviewers' manifold disagreements are amusing. Certainly it won't be played over and over on the VCR, as the Wilder version is. But it's more dramatically satisfying."
    },
    {
      "rating": "10",
      "text": "I really loved this movie. In the original Charlie and the Chocolate factory, the producers captured all of Roald Dahl's goofiness but did not reallly have a point or a plot. To be frank, the book was one of my least favorites of Dahl's for these exact reasons. However, in this new movie, Tim Burton gave life to a formerly dull and uninspiring movie. Also, he did something that I have onlly ever seen before in I, Robot. I liked this movie in spite of all its flaws because the director, instead of following the lead of countless other book-inspired producers, took the general spirit of the book, and then built the sory around this, leaving much of the original story behind. Though Burton stuck more to the original plot, he changed it just enough to make it better. This truly is a masterpiece of a movie."
    },
    {
      "rating": "3",
      "text": "It's no secret that Roald Dahl despised the original book-to-film adaptation of his classic children's novel of the same name, but this rehash of that popular classic would surely make him turn in his grave. Johnny Depp certainly makes the character of Wonka his own, which turns out to be a bizarre and often irritating abomination lacking any of Gene Wilder's aimiable charm. Helena Bonham Carter, however, plays a very lovely mum, and the majority of the film's laughs are gained from Violet Beauregarde's mum's face - every expression is comedy gold! The film's plot seems stunted and wayward, with classic scenes from the original (the bubble room) omitted in favour of visiting a room full of killer CGI squirrels. The film is also littered with unnecessary insights into Wonka's childhood, all of which failing to draw the wacky chocolateer out of being 1-dimensional. On top of all this, the conclusion is extremely poor and overly sugar-sweet. See it if you love Mr Depp; otherwise buy a box of Milk Tray and stay at home."
    },
    {
      "rating": "9",
      "text": "Nothing against Gene Wilder, but this is light years ahead of the treacly original in terms of visuals, overall acting, and sticking to the original intent of Roald Dahl's book. It's also worth noting that this version is officially sanctioned by the Dahl family. And why do some critics bash Depp's portrayal? Perhaps they were expecting the second coming of Gene Wilder... I think he did a great job."
    },
    {
      "rating": "6",
      "text": "The plot is entirely linear with no sub-plots at all. The ending comes about abruptly and is excessivly 'happy ever after'. --New Paragraph-- Johnny Depp was superb and to my mind his performance was inspired/influenced by a combinaton of Mike Myers in Austin Powers, Jim Carrey, and Depp's own originality. --New Paragraph-- However, the character himself is another matter. Wonka's flashbacks were unnecessary and intrusive, taking up time in the movie that could've been better spent developing other characters or spent on wondrous scenes inside the chocolate factory (the Bubble Room would've been nice). --New Paragraph-- And despite the fact 'there is so much to see' inside the factory, we didn't see very much at all. --New Paragraph-- It was slightly jarring to hear English characters referring to chocolate as 'candy' and to their currency as 'dollars' (don't Americans know what sweets and pounds are?). --New Paragraph-- All in all quite an enjoyable film with a very simple plot and a disappointing ending. If you can laugh along with the movie while it laughs with and at itself, you'll enjoy it. If you're expecting a sincere, morality tale with a feel-good chocolate factory that evokes a child-like sense of awe, you won't get your money's worth."
    },
    {
      "rating": "7",
      "text": "Not a great movie, but not horrible. It was entertaining enough. I just need to post in response to the resident genius 'Pooch'. Okay, Willy Wonka and the Chocolate Factory probably should have been left pristine. The idea here was to make it more similar to the book. And, this is for you Pooch, the book was titled Charlie and the Chocolate Factory. Get a clue!"
    },
    {
      "rating": "5",
      "text": "Johnny depp amazing as always however i think that he's version of willy wonka is ott. My favourite scene in the old film is where he pretends to fall over and does a forward roll which isen't in the film instead it's replaced by a very tacky song that lets u know wat the rest of the film is going to be like. A dissapointing film and should only be seen by those who haven't read the book or seen the original film."
    },
    {
      "rating": "9",
      "text": "Tim Burton has done a great job in adapting Roald Dahl's classic BOOK. \"Wily Wonka and the Chocolate Factory\" is not a concern here. This is not a remake of the movie. It's an adaptation of the book. Johnny Depp and Freddie Highmore play a wonderful Wily Wonka and Charlie respectively. A must see for all."
    },
    {
      "rating": "2",
      "text": "This movie was possibly the worst idea to come out of Tim Burtons hatfull of worst ideas. Remaking the classic movie, WIlly Wonka and the Chocolate Facotry, and giving it a new name, trying to knock it off as being different, what a horrible idea. They tried to make it a little darker by including Wonka's childhood, but that ended up sucking a big one. It was a bad idea to make this movie. Period. The classic movie has now been ruined for me, since I have seen these new cheap knock-offs for Oompa Loompas. The Oompa Loompas used to be my favorite part, and now I just want to slice my wrists open everytime I hear their name mentioned. The music sucked too."
    },
    {
      "rating": "3",
      "text": "It just didn't have the same fun factor as the first one. Also, Depp seemed like he was just trying way to hard to be wierd. The movie was just not as good as the orginal."
    },
    {
      "rating": "10",
      "text": "I loved this movie! Tim Burton is my favorite director and this was wonderfully creepy and fun!"
    },
    {
      "rating": "10",
      "text": "This was the best movie of many i sawe this summer...IT ROX MY SOX. I just love those oopa loompas. I coould listen to that Agustus Gloop song over and over again!!!"
    },
    {
      "rating": "10",
      "text": "It's great entertainment! for younger kids and adults. go see it!"
    }
  ],
  "recommendations": [
    "alice_in_wonderland",
    "dumbo",
    "dark_shadows",
    "edward_scissorhands",
    "beetlejuice",
    "the_witches",
    "frankenweenie",
    "a_christmas_carol",
    "corpse_bride",
    "cruella",
    "101_dalmatians",
    "the_grinch",
    "pan",
    "oz_the_great_and_powerful",
    "alice_through_the_looking_glass",
    "harry_potter_and_the_prisoner_of_azkaban",
    "doctor_sleep",
    "inkheart",
    "sin_city_a_dame_to_kill_for",
    "the_flintstones",
    "how_the_grinch_stole_christmas",
    "ghostbusters_ii",
    "the_lego_movie_2_the_second_part",
    "ghostbusters",
    "paddington_2"
  ]
}