{
  "id": 3022,
  "title": "Chef",
  "starring": [
    "Jon Favreau",
    "Sofía Vergara"
  ],
  "runtime": 114,
  "genre": [
    "Comedy"
  ],
  "description": "When Chef Carl Casper suddenly quits his job at a prominent Los Angeles restaurant after refusing to compromise his creative integrity for its controlling owner, he is left to figure out what's next. Finding himself in Miami, he teams up with his ex-wife, his friend and his son to launch a food truck. Taking to the road, Chef Carl goes back to his roots to reignite his passion for the kitchen -- and zest for life and love.",
  "releaseYear": "2014",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/yMtKHR6VG1Yagvv5F7IFpsGBm66.jpg",
  "categories": {
    "plot": 7.181818181818182,
    "acting": 7.033333333333333,
    "ending": 7.714285714285714,
    "soundtrack": 7.666666666666667,
    "cinematography": 9.75,
    "familyFriendly": 3.0,
    "funny": 7.75,
    "action": 8.0
  },
  "reviews": [
    {
      "rating": "8",
      "text": "CHEF is a total delight!  I was expecting a forced attempt by Hollywood veterans to make a \"charming\" and \"heartfelt\" indie. Instead, I discovered a truly genuine film that is both charming and heartfelt for real with no unnecessary plot points (OK, the end is a bit rushed and tagged on). This is the best film since SINGIN IN THE RAIN to depict the pleasure and fun of hard work, friendship, and camaraderie. CHEF has a great spirit that is never forced and every performance is truly perfect. Just spot on in every way. Favreau really shows what a great director of actors he is in the direction of Emjay Anthony. This is a real kid, not a movie kid.\r CHEF will surprise you in the best way! Work hard, appreciate what you've got. A great message."
    },
    {
      "rating": "8",
      "text": "It's a heartwarming flick that struck me as a cross between HBO's Treme and Kramer vs. Kramer.  Great supporting cast, and the kid is surprisingly talented.  Favreau is just excellent as the everyman type of character.  Now that he's done Chef, and Sandler's done Spanglish, they should have a cook-off.  What film has the hotter Latina leading lady?  Paz Vega vs. Sophia Vergara....  (Incidentally, Sophia is great in this movie in more of a toned down, realistic performance....)"
    },
    {
      "rating": "2",
      "text": "Chef uses the same tired out story lines I've seen a hundred times in movies. So you would think the comedy would make up for it, not a chance. Chef is overlong and extremely boring, with a main character that i wanted to fail. Not a good recipe for a film."
    },
    {
      "rating": "10",
      "text": "Pure delight.  Funny, heartwarming, true to life.  It helps to know a little about the difference between chef's food and street food, but the movie has something for everyone.   I wasn't a Favreau fan, but I am now.  Vergara proves she doesn't need to be a Latin bombshell to make you love her, and Leguizamo and Cannavale are perfection--my only complaint is that the latter doesn't get enough screen time.  A gem."
    },
    {
      "rating": "10",
      "text": "I really love this movie primarily for the food but secondarily for the cast which was just so much fun and it made you want to be a part of their crew. The local color in both Austin and New Orleans was taken advantage of beautifully. I don't know exactly what kind of meat was being cooked in Austin maybe brisket but I have to have that immediately. I thought the whole Twitter thing was going to be more annoying than it turned out to be but in reality the convergence of Twitter and the food truck revolution in LA was historically important I think Favreau portrayed and represented it in fine fashion."
    },
    {
      "rating": "8",
      "text": "Don't see this movie if you are hungry!  There are many closeups of delicious food being prepared and sometimes eaten that will head you to the nearest four star restaurant.  But this is much more than a foodie movie.  Rather it is a story of human relationships, primarily that between writer-director-actor Jon Favreau, who plays an ultra chef, and his growing relationship with his 10 year old son who is seen only occasionally because of a divorce.  Fate intervenes, father and son are together for a protracted period during a trip from Miami to California in a food truck, and excellent acting by Favreau and the boy will warm one's heart as father and son bond . The ending is a bit contrived, but leaves the audience in an upbeat mood--people applauded at the end.  One caveat.  The film is rated R because the grown-ups all seem addicted to the F word.  An occasional use would have been sufficient and allowed a PG-13 rating.  A pity but something that Hollywood does all too often under the mistaken impression that the vast majority of Americans are using the word in everyday conversation."
    },
    {
      "rating": "10",
      "text": "I love this film, it is the most accurate portrayal of how things really work in a commercial kitchen I have seen in the cinema. I love the food, the colours and the atmosphere in each town. It was cast really well and the supporting cast really brought it together. Fantastic! I will definitely watch it again :)\r The passion behind the line is just awesome to watch!"
    },
    {
      "rating": "7",
      "text": "A man returning to his love, a father getting to know his son, a sweet, leisurely told story, the power of social media, a road trip, mouth watering food, an excellent child actor along with a first class cast equals a film that should get your attention.\r “Chef” is a touching film that really should be seen without expectations and will having you walking out of the theatre with a smile on your face and might even cause out loud laughter at points along with, possibly, a tear here and there because of the tenderness between father and son.\r Jon Favreau stars as the chef and father , wrote the screenplay and directed the high wattage cast, who quits his job when his boss, Dustin Hoffman, tells him to cook and serve the menu as is not what he wants to cook to get even with a food blogger, Oliver Platt, who writes a scathing review of him and his cooking. With some prodding from his ex, Sofia Vergara,  rich (not really clear how she got rich or what she does for a living) wife who is also the ex of Robert Downey, Jr.\r Favreau and Vergara share custody of a son, played by Emjay Anthony, without a self conscious bone in his body, who happens to be a whiz at, and with, the social media from posting videos to getting attention by tweeting and has to teach his father how thinks work.\r There is no spoiler in saying that the chef buys and remakes a food truck with the help of former co-worker, played by John Leguizamo, though another co-worker, Bobby Cannavale, stays at the restaurant taking over the chef’s job. Scarlett Johansson, as the hostess of Hoffman’s restaurant and a sometime lover of Favreau, with Amy Sedaris as a publicist, add some unnecessary spice to the film. (Heck when you are the star, writer and director of the film why not have Vergara and Johansson as lovers?!)\r Favreau’s relationship with Anthony is believable and just on this side of being too sweet. Adding to this the father’s search for who he really is also realistic.\r “Chef” is not an award winning movie that is a must see but in this season of loud, special effects, comic book movies, it certainly is worth seeing even, as with most movies today, if it is about 10-15 minutes too long at 115 minutes. By the way there is a dare you to stay still in your seat soundtrack!"
    },
    {
      "rating": "9",
      "text": "This is really a fantastic movie, however the one thing I absolutely must say (and if only one person benefits from it, it will be enough) is DO NOT WATCH THE MOVIE TRAILER! Even moreso than most movie trailers in general, this one gives away the entire plot and leaves 0 surprise. While knowing all of that before seeing it doesn't exactly ruin the movie, you already know everything that's going to happen so when it does it really has no weight at all."
    },
    {
      "rating": "10",
      "text": "What a surprise!! I figured it would be something along the lines of a Food Network style production and boy was I wrong.This was an absolutely charming film filled with warmth, humour and characters I cared about. Jon Favreau wrote, directed and acted brilliantly along with an amazing supporting cast. So nice to see a movie that's about people and the trails and tribulations of their lives. It was also an interesting look at the power of social media. Definitely my favourite movie of the year and one of my favorite movies ever. An absolute delight!!"
    },
    {
      "rating": "4",
      "text": "This was a movie that desperately needed edited down. Scenes and sequences that were way too long. Repetition and indulgence. It takes forever for the film to get going and then when it does, it's so flabby, it's boring. Inexplicably, he yells at son. Inexpiicably, his ex-wife remarries him (what does she do, exactly, to live that lifestyle and wear those dresses constantly?) After being fired, he inexplicably goes home and cooks enough food for a banquet . . . that he eats? that goes to waste? Why didn't he call the critic to his house and have him enjoy what looked like an amazing meal? Oh, because he inexplicably knows nothing about social media even though he's one of the hippest chefs in LA. In LA! How do you not know about social media in LA? Inexplicable . . . I wanted to give this film to one of my classes and have them edit it down to less than 90 minutes.  It could be easily done, and it would be a better movie."
    },
    {
      "rating": "9",
      "text": "It often seems to lose focus, and there is a noticeable tone change halfway through, but Chef is too well directed and acted to not love. Jon Favreau gives such a powerful performance, that you can't help but get sucked into Carl Casper's life.\rDeliciously enjoyable 9/10"
    },
    {
      "rating": "4",
      "text": "Don't expect great cinema here. Lame, cheesy, boring at times.  A movie about Twitter, etc, first of all. And about someone rising from defeat and failure to do what he Really Loves to do, and connects with his son, and, oh yeah, a road trip movie. Feel-good?, yes, but again, done in such a poor manner."
    },
    {
      "rating": "9",
      "text": "Chef is a highly watchable, warm, genuinely funny movie with a very positive spirit. It's not your typical Hollywood slick silliness (doesn't insult your intelligence) but, instead, a film made by smart people who care about the story and the characters. I came in with very low expectations (Favreau throwing out a slick, by-the-numbers, self-serving lightweight home movie between blockbusters). Instead, I (along with a packed Austin movie theatre crowd), watched this funny foodie movie with a big time smile on my face throughout. I kept waiting for the other melodramatic shoe to drop which would bring down the pure spirit of fun. At the end, the audience burst into applause. What a kick! Key tip -- do not go on an empty stomach (killer food scenes)."
    },
    {
      "rating": "7",
      "text": "Funny, smart, interesting, full of Latin music but too long and sometimes unemotional. The portrayal of Favreau is good and the simplest interpretation of Vergara was enjoyable. I was a little lost in the Robert Downey Jr scene, for me, totally unnecessary. But, I had a good time seeing this movie. I recommend it."
    },
    {
      "rating": "9",
      "text": "This movie is clearly food porn. Only I don't have to turn off my brain for this movie.\r This feel-good indie movie is a nice change for the director Jon Favreau who also wrote and stared the movie after directing a couple of blockbusters including Iron Man and Iron Man 2.\r The food in this movie are yummy. Oh my god. Don't watch this movie with an empty stomach. I wish there is something that if you pay extra money to see this movie, one of the foods shown in the movie will be given to you to eat. I would pay extra money for that perk to happen.\r The cinematography is excellent, especially the food parts. lol.\r The direction is also great. Jon Favreau seemed to really care about this movie that even small details in this movie is something he should focus on.\r Speaking of care, I liked how he cared this movie that he is also dedicated in his role as a chef. He took tips from an consultant producer to replicate a chef's dish. That is dedication right there.\r The cast seems to be a very A-list-y for an indie movie. Maybe because Jon Favreau has connections with so many big stars that they won't mind being in a production like this especially they are offered free food! The cast did a good job especially Sofia Vergara and Emjay Anthony (the kid in the movie). I can sense they had a very good time making the movie in the set.\r The script and the plot is really good and well-organized. I liked how this movie isn't just about food but it's also about a father-son relationship as well as being happy for something you love the most.\r The soundtrack in this movie fits the entire movie especially on the food parts. lol. I can't stop saying food all the time. lol.\r Don't see this movie with an empty stomach."
    },
    {
      "rating": "9",
      "text": "This is a great warmhearted film that is written,directed,stars Jon Favreau﻿ and a huge list of major actors/actresses. It follows a chef (Jon Favreau) and how he leaves his job at a classy restaurant to start a food trunk and cook what he loves. They journey across part of the US stopping at cities on the way. Acting in this film is amazing, nothing feels forced/phoned in, It makes everything feel more natural almost like you where watching a documentary. But the main topic in this movie is the food and oh my does it look good, lots of reviews say this but it's true \"Don't See Chef On A Empty Stomach\" doing so is pure torture to yourself.\rIf your looking for a lighthearted movie that's going to make you laugh I suggest you watch Chef."
    },
    {
      "rating": "5",
      "text": "This movie requires 2 major leaps of faith.\rFirst, that a chef who wanted to be creative and design a variety of new dishes devotes his venture to creating one dish over and over again.\rSecond, that there would be someone who just happens to have a food truck sitting around and is willing to give it away.\rThe other problem for me was the way he told his son he could never help him on the truck in the future. Why not ?\rAlso, the abrupt ending was lame.\rThis movie only shows me that someone has great connections in Hollywood."
    },
    {
      "rating": "10",
      "text": "Who knew a movie about a food truck could turn into one of the best movies of the year? Of course, that's a rudimentary plot synapsis, but it is the heart and soul of the film. It's sometimes sweet, but sometimes serious. It has a nice blend of wit and humor, and features an amazing script that just feels like everyday conversation. The best part of the movie is what many directors strive for but never fully achieve: it shows how skilled professionals work, and how they feel when they do what they love (or hate for that matter). The food shown in the movie makes you lick your lips and just want to eat all the gourmet dishes Chef Casper prepares. And in some ways, the movie resembles the food he prepares: fresh, irresistible, and easily taken in. I could go on and on about what a good movie this was."
    },
    {
      "rating": "9",
      "text": "This is absolutely one of the better movies of the year and I think John Favreau deserves a hell of a lot of credit for putting it altogether. Probably the biggest joke of this movie's release is the fact that it has achieved an R rating simply because it has one too many F bombs in it.  The last time a great family movie with virtually no adult aspect to it got an R rating was the classic win-win. I think the MPAA or whoever does these ratings needs to pull its head out of his own ass and start reading movies appropriately. One final mention of John Leguizamo. He is outstanding in this film and pretty much makes every movie he's in better. Casting directors get this guy in more movies."
    },
    {
      "rating": "6",
      "text": "An occasionally amusing though often-episodic offering that can never quite make up its mind what kind of film it wants to be -- a feel good flick, a road trip story, an edgy comedy -- thanks to its loosely strung-together collection of bits that are sometimes funny in themselves but lack a general overall cohesiveness. Its endless references to various social media sites gets tedious after a while, too, looking more like a Twitter commercial than a motion picture. Wait for this one to come to DVD."
    },
    {
      "rating": "10",
      "text": "I didn't know what to expect going into this movie, except that I've wanted to see a food truck movie for quite a while.  And Jon Favreau gave us a masterpiece."
    },
    {
      "rating": "0",
      "text": "Pointless, boring waste of time. Never struck an emotional chord at all. I'd rather do dishes than watch this movie. As a matter of fact, at one point I did. I had to. The movie was killing me!"
    },
    {
      "rating": "2",
      "text": "This movie was not good. A long road back to your ex and reconcilement with your kid is a personally soulful and revealing journey. In Chef, it's used the same as typical Thursday night tv plot fodder. I don't care how many hugs you load the cannon with, I do not give a **** Also, hooray for food. We've all had slow-cooked meat before. Stop rolling your eyes with enjoyment. It doesn't take us there. Finally, I don't think whoever made this realized what a shameless Twitter commercial this movie was. People, there were animated tweeting Twitter birds when someone sent a tweet in this film. Hooray for popularity and two extra big cheers for social media. Dumb. I mean dumb."
    },
    {
      "rating": "2",
      "text": "C'mon, why are people giving this movie good reviews? I was bored throughout.\rThere was only one good thing: The food in the movie looked excellent. Really tasty. I got hungry when I saw the dishes. But, that is it.\rEverything else was boring. There were very lame jokes, that were not funny. The movie is supposed to be a comedy, but I never laughed.\rThe acting is terrible or worse. The \"actress\" playing the chef's ex-wife, did not even try acting. She was like she was reading down from the script. It looks like she never acted before and never practised her role. Same with the boy.\rThe whole movie was predictable. With a plot that could be told to someone in 1 minute.\rI was waiting for the whole movie for anything interesting to happen, anything unexpected, but nothing. It is like a happy-family-good-life-everything-perfect-movie or something.\rAnd even more bottering, lots of well known actors having some minor role just for the sake of getting their name in the credits.\rDon't waste your time and money on this movie."
    },
    {
      "rating": "8",
      "text": "This is probably best film that Jon Favreau has ever directed.\rIt moved and the performances are stellar. Getting Bobby Cannivale\rand John Leguizamo to support him was genius. \"Johnny Legs\" as\rLeguizamo was finally given some material that he could sink his teeth into.\rDustin Hoffman and Robert Downey Jr. was great in their short stints.\rI like Sofia Vergara, but I had a hard time believing the two were involved.\rScarlett Johanssen was sexy and smart. What really sells the movie is\rthe music. New Orleans brass music as well as Salsa were big as stars\ras were the food and the actors. One minor hitch for me was the ending was too\rformulaic. Otherwise bravo!! Maybe Vince Vaughn can find something just as good\rto revive his dying career."
    },
    {
      "rating": "10",
      "text": "Chef sin duda esta sazonada con mucho positivismo, humor y entusiasmo, el reparto parece divertirse con sus personajes, se les nota espontáneos de principio a fin y la química que tienen es muy amigable. Siento que tuvo calificación R por el lenguaje obsceno, pero fuera de eso es muy apta para todo público."
    },
    {
      "rating": "3",
      "text": "Neither charming nor funny enough to be as forgettable as it is. Beyond pointless."
    },
    {
      "rating": "0",
      "text": "I love the concept of this movie, but there's just too much language, even a 10 year old saying the S word! I mean come one!"
    },
    {
      "rating": "8",
      "text": "“Chef” is the brainchild and creation of the very talented Jon Favreau who produced, directed, wrote and stars in this film about a chef, his relationship with his son, his ex-wife and the food he loves to cook. In addition to Mr. Favreau, the film also stars Sofia Vergara, Scarlett Johansson, Bobby Cannavale, Dustin Hoffman, John Leguizamo, Robert Downey Jr., and a soundtrack that will make the viewer truly enjoy the intensity of this salsa musical journey. Almost 2 hours in length the film speeds along on its merry way through the spirited and improvisational style of its director who quickly shows us that simple uncomplicated themes well written and performed can make for more than adequate entertainment. This is a film where you simply sit back in your chair, relax and watch this feel good story turn out as predicted but with humor, pathos and culinary delights filling the screen in between. I give the film an 8 and urge that it be seen by vegans and meat lovers alike for food, comedy and music make this film truly an enjoyable experience."
    },
    {
      "rating": "4",
      "text": "A fluffy fairy tale of a movie that benefits from having a slew of competent, likable actors and a fun soundtrack. The rotund chef somehow has a lot of capital with which to rebuild his career, a loyal friend who'll work for nothing, a loyal, adorable son who's a social media genius, and a gorgeous ex-wife who still loves him. It's impossible to hate, but feels like a Lifetime movie with an A-list cast. The food looks delicious, though!"
    },
    {
      "rating": "10",
      "text": "I had pretty high expectations for this film, and they were met, I really enjoyed this film from start to finish. Its a believable, down-to-earth, and heartwarming feel-good movie, but it isn't at all cheesy or overly sentimental. The acting is superb, the pacing and length just right and it has some really funny moments. The characters are all very endearing and all very well scripted and acted. The cinematography is superb and the food looks sumptuous. I don't have anything bad to say about this movie, I thoroughly enjoyed it and would definitely watch it a second time."
    },
    {
      "rating": "8",
      "text": "Jon Favreau (who also wrote/directed) plays an innovative chef whose confrontation with a critic devastates his career, so he ends up on a food truck to reestablish his love for cooking (and his relationship with his son, winningly played by Emjay Anthony). John Leguizamo joins the trip to add some enjoyable spice. The first half spends too much time with Favreau's character blustering and **** but once he hits the road, the story takes on a sweet charm. This is the kind of small personal film that started Favreau's career (before he became director of blockbusters like \"Iron Man\") and it's a welcome return to a heart-felt, charming little gem. The music's great fun too. NOTE: Stay thru the credits to see the real chef giving Favreau some technique tips."
    },
    {
      "rating": "8",
      "text": "Chef was an unexpected pleasure.  I have to admit, even though I attend movies all the time, I had no idea who Jon Favreau was.  Turns out he's both a talented actor and director.  The movie is about the relationship between a father and son, and choosing to live a life that makes you happy.  There are a few moments of unbelievability, such as his ex wife and girlfriend are two of the most beautiful women working in Hollywood (Scarlett Johansson and Sofía Vergara), and just when you think he finally realizes his relationship with his son is the most important thing in his life he nearly blows it yet again.  But that is nitpicking.  It's well written and acted and funny throughout.  Especially the road trip.  Really enjoyed it."
    },
    {
      "rating": "8",
      "text": "A very delicious and entertaining feelgood movie. The acting from the entire cast is superb, thanks in no small part to its dialogue which makes the conversations sound so natural.\r The directing is excellent, as it showcases the details of cooking, the extraordinary meals that can water your mouth just by looking at it, and the occasional floating windows of social media interactions.\r Perhaps the things that keep the movie from being a masterpiece are the rushed ending and the slight lack of character development. Nonetheless, they don't ruin the film in any major way.\r It's a joyous, funny, and delightful movie. I'm very glad to have seen it."
    },
    {
      "rating": "7",
      "text": "Such a heartwarming movie.\rJon Favreau really shines in this one, as an actor and as Director!\r I just downloaded it because of RDJ and Scarlett, little did i know they only have (along with dustin Hoffman) around 20 mins of screenplay between them.\r little nice feel good movie, altho a bit predictable, maybe the best of the year in its category.."
    },
    {
      "rating": "5",
      "text": "Gee, I have to weigh in here, since I think  that the viewer's rating is skewed by real Favreau fans. Although there are a bunch of good ingredients here...  they never produce a tasty dish. There are long, cranky, un-funny dialogs, rattled off at high speed with little credible passion. It takes a long time before the story leaves the character's collapse and starts to progress to a resolution. The idea of a high cuisine chef going into street food has possibilities either comic or as a serious story, but this weak, improvised-seeming fare ries to walk somewhere in-between and largely bored me."
    },
    {
      "rating": "8",
      "text": "The film is funny, creative and inspirational.  Without giving away too much, it does fall to some common cliche pitfalls -- namely that the child in the film is far more tech savvy than the average person meanwhile, the adult is completely ignorant about the expensive devices he owns.  While we get that this reversal may be founded to a degree, the movie's portrayal of the subject was nothing less than hyperbole.  That aside, it is refreshing to watch a down to earth movie about not compromising your values and picking up the pieces of your life without having had to watch everything burn to the ground first.  Accurate portrayals of life and living make this a great film."
    },
    {
      "rating": "7",
      "text": "There's a lot to like in Chef besides the fact that it's a summer movie without any monsters in it.  Certainly the relationship between the dad, Jon Favreau, and his son was well done, as was the portrayal of our current obsession with food, celebrity chefs, and the power of the media.\r But I really do not know how I'm supposed to believe that beautiful women like Scarlett Johanssen and Sofia Vergara, the girlfriend and ex-wife of the Favreau character, are in love with or attracted to a guy who is a lot older, heavier, and, well, at best average looking.  No way.  It was really a distraction every time they were on the screen.\r I think it's a screenwriter/director's conceit or maybe just wish fulfillment.  Not reality."
    },
    {
      "rating": "8",
      "text": "We all know Jon as this big action film director and it was cool to see him go back to his roots and deliver one of the most underestimated films in recent years. Chef has everything you could want - A great cast, A solid plot and great directing. That alone doesn't make it good though. What makes it so good is that so much heart was put into it. You can tell this was a big passion project and that shows through out the film.I also think that it's pretty much a big F You to the critics who view him as a one trick pony and a talent-less director. There's one scene where the Chef, played by Jon, brutally breaks down what makes a molten lava cake a molten lava cake to a critic who bashed him in a review. You can definitely see this as throwing shade at the critics who probably wouldn't even know the smallest thing about directing and how to set up these complex shots and yet they are calling him out for his \"lack of ability\".But all that aside, It is a really good film and really worth watching."
    },
    {
      "rating": "8",
      "text": "Chef is exactly the type of film movie we have been longing for. An impressive take on today's food world--and what a fun ride. Jon Favreau makes a wonderful addition to his often hit-or-miss career. Bon appetite!"
    },
    {
      "rating": "5",
      "text": "It was one cliché after another. The movie was not that irritating, but there was just nothing that surprised or interested me. Not sure how a movie like this attracted a big named cast."
    },
    {
      "rating": "7",
      "text": "Overall, this effort from Jon Favreau is a heart warming, touching, and loaded with charm. For the most part, Chef is a relatively straightforward film with good comedic elements blended with good dramatic elements, which combine to produce a pretty good film. Not world beating by any means, but it is undoubtedly endlessly enjoyable and fun for the whole family. In terms of acting, John Leguizamo has a great charismatic performance in support here and really is the bright star in this bunch. For a child actor, EmJay Anthony is also good and never really sticks out like a sore thumb. The kid was entirely convincing. Jon Favreau was fine in the lead role as well, he made you like him right away and while he may not be my first choice, it worked well overall. Scarlett Johansson and Robert Downey Jr. also had good, though small, roles here. Now, I do not know if I can buy that Favreau dates Johansson and used to be married to Sofia Vergara here, but since the guy wrote, directed, and acted in this one, I can appreciate the dream, haha."
    },
    {
      "rating": "8",
      "text": "A delightful film if somewhat predictable.  Favreau is clearly in his element relating this clever discovery story wrapped in a Cuban sandwich and garnished with a couple hot peppers."
    },
    {
      "rating": "9",
      "text": "Chef is a film about a battle we all face to reconnect with our passions when the flame has burned out. Jon Favreau, a jack-of-all-trades in Hollywood who has hidden behind his passions for the last decade or so, has stuck to his guns on this one and delivered an indie film that not only delivers a tasty slice of one’s person’s struggle to keep their passion alive, but also shows the consequences when one follows their passion too closely. Carl Casper (Favreau) is a phenomenal chef but a lousy father to his son Percy (Emjay Anthony). Carl tries hard to entertain his son with artificial activities that he thinks would allow them to bond by taking him on roller coasters, to town fairs and the beach, while failing to realize that all Percy wants to do is just hang out with his dad. In an early scene, Carl and Percy connect over a homemade grilled cheese sandwich, discussing twitter, social media and the effects of the Internet on youth and an older generation of users. Percy smiles and the art of subtly is established. Chef could then best be described as the perfect grilled cheese sandwich; familiar and fattening, yet, when cooked right, its gooey, cheesy deliciousness and soft center always finds a place in your heart. Chef may be cheesy and formulaic at times, but at its core it’s just plain comfort food that is perfect for the soul. Simply put, Chef is mm-mmm satisfying filmmaking in the shape of a surprisingly delicious film.\r It’s not hard to see the comparison Favreau is making between his career in Hollywood and his love for independent filmmaking. There is no denying that Favreau is a modern-day pioneer when it comes to directors and writers with humble beginnings. Favreau, who started off his career scripting Swingers as well as writing/directing/producing his 2001 smash Made, has set a trend for Hollywood studios who snatch up promising young directors to spearhead big-budget blockbuster film franchises. After all, Favreau was the first director for Marvel to successfully launch the Marvel universe on the big screen and reignited good friend Robert Downey Jr.’s career after his stint in rehab. Favreau is undoubtedly a man of wonders and shows off his skills here behind the burner.\r With Chef, it is not hard to see that Favreau is a lover, not a fighter; a lover of culture; of beautiful women; of fine filmmaking and most of all, a lover of good food. Through Chef, Favreau serves up his signature dish: real-world comedy that doesn’t sugarcoat what real-relationships actually look like.\r Carl Casper is surely a representation of everything Favreau has been feeling for a very long time. Lost and unhappy behind the scenes of a posh Venice Californian restaurant owned by the business oriented Riva (Dustin Hoffman), Carl is given a little hint of hope when he gets wind that the critic who helped launch his career from culinary obscurity in Miami is coming back to review him. Last time Ramsey Michel (Oliver Platt) and he met, Ramsey was a small time food critic, doing it for the love of food. This time, Ramsey, backed by AOL and nearly ten million followers, challenges Carl to cook something special. As he gets his kitchen staff ready, namely his sous-chef Tony (Bobby Cannavale), his line chef Martin (John Leguizamo) and his hostess and gorgeous Sommelier Molly (Scarlett Johansson), Carl begins to prepare a menu that will knock Ramsey’s socks off. Despite his best efforts, the restaurant’s owner Riva thwarts Carl’s plans, forcing him to prepare the same, tired menu that he’s been doing for a decade. As tempers flare and egos parade, the events of Ramsey’s return find Carl without a job, forcing him to seek refuge in his ex-wife Inez (Sofia Vergara) and her eccentric ex-boyfriend Marvin (Robert Downey Jr.). On a surprise trip back to Miami, Carl allows the spice and sizzle of the Latin culture to take hold, and while enjoying a simple Cubano sandwich [basically a ham and cheese sandwich], Carl finds inspiration in owning a food truck.\r It’s no surprise that Favreau, who has made excellent relations with A-list actors during his time in the big leagues, likes to surround himself with the best. Chef may not look like your typical independent film feature courtesy of the generic polished coating and a star-studded cast that would make the night sky jealous, but the film uses its high-profile cast to its advantage. From Dustin Hoffman, who plays a the perfect, grumpy restaurateur, to Scarlett Johansson, who captivates with subtle sounds during a seductively sexy food foreplay scene, to the mega superstar Robert Downey Jr., who in only mere minutes, finds a way to convince audiences that he is able to create a more outrageous character than Tony Stark, the film showcases the organic talent of a cast who have spent a little too much time in the bright Hollywood spotlight."
    },
    {
      "rating": "8",
      "text": "Family friendly without too much 'cringe sauce', but  don't hold the cheddar as it is a tad cheesy. Apart from this, it is pure food pornography at it's finest. I'd go as far to say this is a new genre of movie. Food and Cinema, eat something nice whilst watching the movie, you're gonna get hungry."
    },
    {
      "rating": "6",
      "text": "I was positevely impressed by Chef: I originally thought it was going to be worthless, by looking at the trailer - that same trailer that lets you think Scarlett Johansson and Downey Jr. are actually acting in this movie. Rather, and especially for the latter, I think their appearance should be counted as just a cameo.\r Chef, helped by Latin music and food imagery, is a handsome comedy without too many pretences and one good script - not good because it's epic or intelligent, good because the dialogues sound natural, for once. Good performances by the supporting cast, in my opinion, but I'm not too fond of the kid and the model.\r Good fun watch. Nothing to wrap your brain around, but still."
    },
    {
      "rating": "8",
      "text": "This is a wonderful heartfelt comedy and one of Favreau's best films.  The acting is well done especially the food make sure your ready to eat after this movie.  A-"
    },
    {
      "rating": "8",
      "text": "Yummy film...!!!!!!!!!!!!!! sweet,tasteful & good feel family film, loved it by my belly , nice timing acting by all actors, sweet screen play make it wonderful ,R D J shines in his little cameo , a perfect film for family's and kid's . i love this chef very much, go for  it"
    },
    {
      "rating": "9",
      "text": "An all-around fun film which doesn't bore all of time or go overboard on the comedy. The jokes are correctly deployed while leaving room for what films are meant to do: Tell stories."
    }
  ],
  "recommendations": [
    "hustlers",
    "we_bought_a_zoo",
    "the_king_of_staten_island",
    "the_intern",
    "moonrise_kingdom",
    "silver_linings_playbook",
    "burnt",
    "instant_family",
    "eddie_the_eagle",
    "morning_glory",
    "logan_lucky",
    "uncut_gems",
    "black_snake_moan",
    "groundhog_day",
    "17_again",
    "wanderlust",
    "palm_springs",
    "yesterday",
    "3_idiots",
    "the_upside",
    "little_miss_sunshine",
    "going_in_style",
    "friends_with_benefits",
    "inherent_vice",
    "midnight_sun"
  ]
}