{
  "id": 1609,
  "title": "Chernobyl Diaries",
  "starring": [
    "Jesse McCartney",
    "Devin Kelley"
  ],
  "runtime": 88,
  "genre": [
    "Horror",
    "Thriller"
  ],
  "description": "A group of six tourists looking to go off the beaten path, hire an 'extreme tour guide' who, ignoring warnings, takes them into the city of Pripyat, the former home to the workers of the Chernobyl nuclear reactor, but now a deserted town since the disaster more than 25 years earlier. After a brief exploration of the abandoned city, the group members find themselves stranded, only to discover that they are not alone.",
  "releaseYear": "2012",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/9AKhThGA8IATBy3gR7I4dw9SEc4.jpg",
  "categories": {
    "plot": 4.0,
    "acting": 3.0384615384615383,
    "ending": 5.416666666666667,
    "soundtrack": 5.0,
    "cinematography": 6.5,
    "familyFriendly": 3.0,
    "funny": 2.5,
    "action": 4.666666666666667
  },
  "reviews": [
    {
      "rating": "0",
      "text": "Besides the point of it taking a controversial stance of actually daring to touch the already sensitive subject of Chernobyl, it doesn't give any love or care into it at all. We've been on this ride before hundreds of times. The ninety minutes of this was the longest two years of my life. With zombies and vampires on the rise and flooding the markets in the movie and game section I thought it would be different, I actually miss not and going seeing a zombie or vampire film that's barely passed as B-Movie now. If people want to explore Chernobyl and go to Pripyat, my advice would be to actually go there or stop by and pick up S.T.A.L.K.E.R.: Shadow of Chernobyl for PC from 2007 or S.T.A.L.K.E.R.: Call of Pripyat for PC from 2010. They offer more entertainment and actual scares then this does while actually getting to see real time mapped landscapes and scenery from their current time."
    },
    {
      "rating": "9",
      "text": "Chernobyl is scary as hell"
    },
    {
      "rating": "7",
      "text": "\"Terror in Chernobyl\" is not a perfect film, but it has its quasi-found-footage charm terrifying. This is due to the simplicity of fictional suspense, and perhaps the film disappoint Hollywood fans, but it fits well and leads to a curious adventure where terror is not just a pompous CGI monster. It's like a little walk of skewed insinuation becomes in darkness radioactive danger."
    },
    {
      "rating": "3",
      "text": "I really wanted to like this movie, I did. This story had potential. But I feel like very minimal effort was put into this film. There were some interesting ideas and tense scenes that hinted at a decent movie, but most of it was poorly done. There where times in which I did not feel like I was watching a movie at all, and that I was just watching a fake one, and I was waiting for the real one to begin. And the ending (my God, that ENDING!) was so obviously written last minute. Do not spend $10 like me and see this in theatres.  If you feel like you need to see this movie asap, resist the urge, I beg you, and at least wait until it's rent-able."
    },
    {
      "rating": "7",
      "text": "Honestly i believe this to vastly underrated. While it doesn't deliver a fantastic story, it works as an atmospheric and bizarre horror film that utilizes its setting with frightening imagery. I'd give it a 6.6/10 definitely not a 4.6."
    },
    {
      "rating": "4",
      "text": "I did not think this was a great film its pretty low-budget to be fair so it's not  got much to work with so taking that in to consideration its worth a watch Hills Have Eyes comes to Russia."
    },
    {
      "rating": "10",
      "text": "\"Chernobyl Diaries\" is like being in the world of Silent Hill which is 100% scary, no, terrifying to be honest.\r\"Chernobyl Diaries\" delivers good scares, good scenes, and a great horrific-adventurous plot, with a great movie twist, expected somehow that they will get stick in Chernobyl, but great!"
    },
    {
      "rating": "1",
      "text": "Dumb. Stupid. **** The Chernobyl Diaries is a completely unspecial and trite film that has been made 600 times in 600 other forms. This is a factory movie with **** CGI, **** camerawork, **** directing, **** everything."
    },
    {
      "rating": "4",
      "text": "In order to fairly review this movie, I really have to look at the first and second half almost as completely different movies.   The first half was pretty good. It was fairly well-done, and the tension slowly builds. I've always had a minor fascination with Chernobyl, and the movie did a good job of reproducing the look and feel of the place (well, early in the movie that is).  Unfortunately, the second half of the movie is so ridiculously over-the-top, drawn-out, implausible, and repetitious, that I left the movie hating this movie (even though 45 minutes in to it I'd liked it).  I don't want to give any ay spoilers, but I think that if they'd made a movie about wild dogs (ala Cujo) or a dangerous gang of hoodlums (something akin to \"The Strangers\" perhaps) living in Chernobyl, they'd have had a winner... but by instead going the horror route, they ruined a great setup."
    },
    {
      "rating": "2",
      "text": "The concept of this film first off, was just ridiculous and impossible, but obviously we don't go into every movie looking for realism, so it did have potential to be scary, but boy did this film fall flat. From the acting, to the script, to everything. There was just flaw after flaw after flaw. It had its tense moments where you feel as though somethings going to jump out and scare you...but then nothing happened. It was nothing but a big fakeout. This film is dumb, weak, and extremely predictable. 2/10 don't see this pile of junk!"
    },
    {
      "rating": "4",
      "text": "OK so let's clear some things up. 1. Chernobyl Diaries is NOT a found footage film. 2. Chernobyl Diaries does not deserve to be in the green on Metacritic. With all of that said, Chernobyl Diaries is a bad movie but it certainly had potential. The cast is pretty stupid when it comes to making logical, life saving decisions and do everything a typical human in a horror film would do. While the situation does deem itself to be damn creepy, and at times what does happen on screen is very creepy, it's enough to really get you. The ending, while predictable and very messed up, does its job and closes the door on any potential of a sequel."
    },
    {
      "rating": "7",
      "text": "Unlike most people, I enjoyed this movie. It was terrifying, but in a good way. Jesse McCartney did a good job in the film, and I can definitely see him appearing in some more over the next few years. My only real reservation is how the ending was orchestrated. I would have done it differently. However, I was definitely not expecting it to end that way, so I give a kudos to the makers of this film on that."
    },
    {
      "rating": "9",
      "text": "It's one of the scary movies I have been afraid. This movie has a little of what happened after the Chernobyl disaster, and I personally find very interesting topic. The film is highly recommended and entertaining."
    },
    {
      "rating": "10",
      "text": "Very awesome! I would like to see pewdiepie on this movie and hearing him screaming like a little girl.\r I don't know why this movie has low ratings, I enjoyed a lot."
    },
    {
      "rating": "7",
      "text": "Chernobyl Diaries has a few flaws and horror cliches, but nothing you wont forgive after watching it. It relies more on what you don't see vs what you do. There are no points where it lags or drags, very intense. You wont fall in love with the characters but you will find yourself trying to turn around to see what that noise was.  For horror buffs and date nighters, you wont go wrong. For everyone else, if you've seen the other summer blockbusters add this one to this list and enjoy."
    },
    {
      "rating": "3",
      "text": "Oren Peli is best known for the Paranormal Activity series and last year's favorite \"Insidious.\" \"Chernobyl Diaries\" is not one of them. This could be a big misfire for a critical indie favorite. The actors are kinda boring to me and I don't see any horror monsters, just a dose of radiant heatwaves and a rip-off of last year's Matt Damon film \"Contagion.\" All I see is a couple of 90 minutes of wasted memories of the 2002 disaster. Get on with the \"Insidious\" sequel already. Chernobyl Diaries is a mess and I hope Oren Peli learned a lesson today: We don't even care what Chernobyl means."
    },
    {
      "rating": "4",
      "text": "Chernobyl Diaries continues in the vein of many recent horror flicks, relying on an overabundance of jump scenes -- replete with the often-favored loud noises -- to suggest that the audience should be scared. Uh, huh. The movie opens as three American friends meet a fourth in Kiev. Paul and Chris are brothers, Natalie is Chris's girlfriend, and Amanda is their single friend. Mostly these traits define the characters, who are otherwise easily startled. Paul decides to take the others to see the Chernobyl reactors and nearby town. The four are led by local tour guide Uri and joined by two other tourists. When the military denies the group access, they should take it as a warning sign. As in most horror movies, they don't. Uri utilizes a little-known entryway, and soon the group has found its way into the eerie, deserted town of Prypiat. These scenes are certainly among the best in the movie, providing what's certainly the most haunting imagery. Of course the horror aspects wait just around the corner to negate some of the goodwill earned here. After an odd encounter with some wildlife, the group returns to the van to find various engine parts missing. Eventually someone wanders off, and then someone else, and so on. Though plausible character motivation is not a hallmark of the horror genre, it would be nice if there were, say, some. This is the sort of movie where audiences will want to shout at the screen while characters make the wrong decisions. The handheld camerawork does the action no favors, and a number of scenes are just too dark to see. Some thrills do pay off -- namely a well-advertized jump sequence -- but most are negated by the fact that the characters are too often too stupid to care about. The movie does not fare well in the wake of the excellent genre commentary The Cabin in the Woods. In addition to this, the use of an actual tragedy to masquerade as a horror plot comes off as crass and shameless. In comparison to Paranormal Activity -- a connection incessantly boasted in the ads -- Chernobyl Diaries is perhaps less dull though no more remarkable. Undiscerning horror fans and those looking for a few jumps may well enjoy the movie, but anyone hoping for something more will only be in for a disappointment."
    },
    {
      "rating": "1",
      "text": "It's the worst movie I've seen in '12, and by far the worst horror flick I've seen in a 2 - 3 years. It's as if someone thought - \"Hey, I'd bet Chernobyl would be a killer setting for a movie.  Maybe a horror movie!  Yeah, and you know, I've seen video games dealing with radiation that have dogs in them, and bald dudes, and running down corridors.\"  It's simply awful.  The acting is abyssal.  They waste the one interesting character - the Russian Special Forces extreme tour guide.  He doesn't do a damned thing!   The film is boring, there is no strategic thinking to it, you don't care about any of the characters (the younger brother is putrid - who cast that kid?), and the ending is a joke.  Don't bother - it's not fun, it's not scary.  It's a check swing third strike."
    },
    {
      "rating": "2",
      "text": "I realize I have nothing much too say about this movie, probably because nothing much happened. If you had told me, before my screening, that someone could make a boring mutant zombie movie, I wouldnâ"
    },
    {
      "rating": "8",
      "text": "This movie was amazingly good...Oren did an amazing job at building the suspense.  There were scene we're the jumpy camera sorta throws you off but still Chernobyl Diaries was completely worth the money."
    },
    {
      "rating": "0",
      "text": "The problem with Chernobyl Diaries is that the way the characters behave isn't true to human nature. The characters act not according to human nature, but according to the necessities of the plot. I use the term \"characters\" loosely. Most are one dimensional at best. They exist merely to supply the film with the necessary bodies for a body count. When characters struggle, it looks like the setup to a joke, and we laugh at them, making Chernobyl Diaries unintentionally funny in parts. There was, in fact, a fair amount of laughter from the audience at a midnight screening I attended. The largely unknown cast of actors struggle with the material, unable to flesh out thinly drawn characters. An audience member gave a forced clap at Chernobyl Diaries' end. His sarcasm was not missed; it was finally over. +1 to this sir"
    },
    {
      "rating": "0",
      "text": "This is ONE of the worst movies I have ever seen. Its not even worthy of  watching for free on T.V.....Jumpy filming, bad acting, to many mistakes. If I tell you all that was wrong with this movie, I would have to check the box for spoilers."
    },
    {
      "rating": "8",
      "text": "I thought this movie was actually quite well done.  Sure, there was a dissapointing ending, but I've studies Chernobyl and Pripyat before and this really brings the horror to life.  Sure there's no mutant victims running around eating people, but i think the scenes were well laid out and really got my heart rate going and had great suspense.  i would go see it!"
    },
    {
      "rating": "0",
      "text": "It felt like a low-budget, direct-to-video movie. How on Earth did this get a theatrical release? Also, why is it rated R? It had no on-screen violence, no gore, and no nudity. Really?! It should have been PG-13 at most. If you want to see this movie, do yourself a favor and just watch the trailer. Guess what. The trailer shows almost every scary thing about the movie. Surprise! What a disappointment."
    },
    {
      "rating": "7",
      "text": "Ok, we have again other movie that use the found footage (yes like Cloverfield and Paranormal Activity), and what happen? yes have some cool moment in that you jump, and you put a scare face, but the big problem of the movies is the next: Is same that the rest of the found footage movies. Good movie, but we watch all of this movies."
    },
    {
      "rating": "10",
      "text": "To Be 100% Honest..\rThis Movie Scared The Crap Out Of Me! Great Cast, The Story Line B+...\rOverall A A+ I Have NEVER Been So Scared In My Life (The Strangers Is Really Scary)\rGreat Movie!"
    },
    {
      "rating": "6",
      "text": "First things first, this is NOT another found footage movie, even though the trailer made it seem that way. Instead, it is a pretty atmospheric, creepy and in some spots genuinely frightening piece of modern horror.  I enjoyed the film for its creepy atmosphere and mood. However, my only qualms about it concern the fact that at times it seems the filmmakers are trying to make some money off the worst nuclear disaster in history. Also, venturing into the highly radioactive Prypiat doesn't really sound like a fun day out, especially if at night you'll be dragged off screaming by a bunch of zombie-mutants that want to rip your intestines out and feast on your flesh. Overall, its good for an adrenaline rush of fast-paced horror with no intelligence behind it."
    },
    {
      "rating": "0",
      "text": "This movies is not for real fans of horror movies. This movie is mix of all real horror movies. This movie does  have some suspenseful parts but only near the end ,I do not recommend this to anybody,"
    },
    {
      "rating": "9",
      "text": "I don't see what the problem was with this movie the acting was good and there was no dumb moments and I really enjoyed myself. But the ending suked"
    },
    {
      "rating": "0",
      "text": "I didn't see it.  I won't see it, ever.  Why?  Over 350,000 people were evacuated from their homes after this catastrophe. Deaths and birth defects and cancer still occur to this day.  How would we feel if some B-list Russian director made a cheesy film about September 11?  Would you support him by seeing it?"
    },
    {
      "rating": "8",
      "text": "While much of Chernobyl Diaries is all-too-reminiscent of other horror movies -- there's a small group of good looking, overly-confident twenty-somethings who are hunted by people or things in a place they don't know --  it's nonetheless done really well for most of the film.  I'll admit, we went into the theater with low expectations.  The reviews we had read were almost all negative.  The low expectations probably helped us enjoy it.  But the movie is genuinely fun, with several unexpected thrills and there's a fairly believable sense of dread.  And particularly for moviegoers who remember the Chernobyl disaster, the location makes it all the more creepy.  If you're looking for an entertaining way to spend 90 minutes, give Chernobyl Diaries a shot.  For what it lacks in originality and execution, it makes up in fun."
    },
    {
      "rating": "6",
      "text": "I understand where all the hate comes from, yes, but for me the film was not as bad as it was said to be. It had its moments, sure, that were pretty dumb to say the least, but in the end it was much better than A Devil Inside and Paranormal Activity. This movie did have potential, and it would have had a perfect rating for me if they had of wrote it differently. I did enjoy the set up they did for the city near Chernobyl, I just wish they had of moved around a little more in the movie, it was all in one general area I found."
    },
    {
      "rating": "10",
      "text": "I don't know why Chernobyl Diaries isn't liked much; maybe it has to do with the movie Cabin in the Woods (That I never saw). That movie might by good, but Chernobyl Diaries is my favourite horror movie of all time! The setting is a big bowl of yay, being set in the title's location and now not your sister's diary. The plot is a group of tourists, some family and friends, others now, going to Chernobyl with an ex-Spetsnaz. Obviously  goes down, but in a very well paced manner. Many horror movies annoy me with either the paranormal or psycho killer threat, Chernobyl Diaries is like The Tunnel and makes the threat neither truly human, nor truly fictitious, but instead-REALLY CREEPY. The plot may not be the most focused, but there are two huge awesome parts, 1. There is like no music, so when there is tension rising, it is on screen and also, the camera angles work to give a good angle of what we need to be scared. Also; the ending is perfect, rather than be ambiguous, sequel bait or happy time; this movie goes \"This is how this ends\" and gives the most respectful horror movie ending ever-GO. WATCH. IT."
    },
    {
      "rating": "7",
      "text": "Considering the amount of hate this film has received, it's surprisingly good. At least, good in the sense that it builds tension, isolation, and futility perfectly. The story and acting is nothing to applaud, but the way the film is constructed is. The ending, however, is nothing short of stupid."
    },
    {
      "rating": "5",
      "text": "All I can say is it's not scary. It has a creepy setting and could have been downright terrifying had they relied on something other than predictable jump scares that you can see coming from a mile away. There's no real atmosphere and they spent to long in the beginning of the movie trying to get you to like the characters by giving us their story before going into this ordeal, and I've never been a big fan of that kind of thing. In my opinion they should just throw the people into the middle of the horror ASAP and sprinkle their story throughout. It's never gruesome enough, never smart enough, and certainly never scary enough to be considered a good horror movie. Which is sad because there are some true hints of genius hidden throughout that show potential for an outstanding horror movie, but I have to review the movie based on what it is and not what it could be."
    },
    {
      "rating": "2",
      "text": "Nothing. Nothing for 90 minutes. Characters completely stupid, half movie is useless and the other half is irritating. What a waste of a beautiful set as can be Chernobyl was. Annoyng."
    },
    {
      "rating": "5",
      "text": "I was expecting a LOT more of what it could be . The setting is what maintains this movie alive because it's interesting but  what drags CD is that is so predictable all around it that makes you yell your TV not by how scary it is ( that it really isn't ) but by how stupid the script is . While the acting was admirably fine and the atmosphere really accomplished what you deserved in the last minutes everything collapse and breaks the   pace."
    },
    {
      "rating": "0",
      "text": "Well i know that Metacritic is giving us the 5000 maximum character to write our reviews. But for this movie i think i don't need 1000-5000 characters to write the review of this movie. This movie is a total crap, didn't live up to it's expectation. Bad acting, really not scary at all, and stupid execution. And i think this movie gives all of us a very valuable lesson, and that is: TO NOT GET EXCITED VERY QUICKLY WHEN YOU SEE THE TRAILER OF THE FILM."
    },
    {
      "rating": "4",
      "text": "I found the first half of the movie good. If it would have stuck with the first half, and continued as a documentary, this movie would have been a 9 or a 10, easily. The second half of this movie is frustrating, with bad camera angles, and constant sprinting from zombies, something which is being overused. The idea was great, even with the zombies, and this movie had a lot of potential. How the movie was presented was close to pathetic, and it was just frustrating seeing the wasted potential of this movie."
    },
    {
      "rating": "3",
      "text": "What I enjoyed the most, was the complete lack of logic, no plot, bad acting and less brain then Paris Hilton has"
    },
    {
      "rating": "6",
      "text": "Chernobyl Diaries is the Directorial debut from Bradley Parker and Written by the man who brought us four installments of Paranormal Activity, Oren Peli, but the only thing original about this film is it's location. A group of friends are traveling through Europe in what looks like a shot for shot remake of Hostel, when they meet a man who gives tours of the abandon city near Chernobyl. After being rejected entry into the city, the group sneaks in and runs into a whole mess of trouble. This is your very basic zombie film, with nothing extraordinary about it. You've seen this story a hundred times, but what makes Chernobyl Diaries different is that it takes place in Russia and features a talent cast. What's interesting about this cast is that none of them have any background in horror. Jesse McCartney is a singer who does mostly voice over work, and Devin Kelley is almost strictly a TV actress. Taking these role was something new for them and they really put all they had into it. I feel like it was wasted effort though, as this film really is nothing different. Friends on vacation go to a unique location and run into something supernatural that tries to kill them, it's been done over and over again. The unique location made for a great start to something, unfortunately the writers didn't know what to do with that, and the result is another ordinary film that gets an average rating."
    },
    {
      "rating": "4",
      "text": "This movie, is bad and good. But, mostly bad. What really pissed me off about this movie was how it ended.. It didn't leave me extremely disappointed, but extremely pissed. You find out that Chernobyl is pretty much controlled by these people. The movie went too fast. It was one thing after the other. The acting was pretty awful. But, I was somewhat entertained."
    },
    {
      "rating": "5",
      "text": "I had a rather good time watching this. It is the kind of low budget movie you know will get made over and over. Simple idea. Simple execution. Simple to follow. And easy to enjoy. In fact there's not even a need for real name actors of any kind... If you are an independent filmmaker and your uncle has a bag full of money, make this movie. It will work. Guaranteed.\rI found the script to be well crafted. It didn't ask much from the audience. The problem upon which the horror theme is built is quite simple. It revolves around a nuclear disaster with enough notoriety to gain instant credibility. What of the small towns that surround the Chernobyl nuclear meltdown? Specially when we have in current news the nuclear disaster in Japan? Perhaps we should repeat this formula in its Japanese version? I'm in!\rThe scares come mostly from what we don't see. A job well done by the filmmakers. They keep us wondering what the hell is out there? And they actually hold out long enough to show us and stay interested. Also, the Russian guide does a great job hinting at the fact that he knows more than he is telling these kids. And the kids themselves make good use of their roles. Believable all the way through.\rI don't want to give away the surprises. But if there was a small shortcoming, and I do insists on short, it was their practical effects budget. You'll see what I mean.\rI would have rewritten the ending slightly different. A couple of choices didn't need to overdo it, but it is believable where it is. I liked it, and I'm sure you won't be disappointed when you watch it."
    },
    {
      "rating": "3",
      "text": "While this was filmed really well, it was an awful movie.  I felt guilty later since so many people suffered from that incident, and here I just paid $$ to watch basically a spoof on a tragic event - - wished I would have donated the money to a charity instead."
    },
    {
      "rating": "3",
      "text": "An interesting concept with flaws with the actors as they unravel to become the most annoying and dumb characters ever to be in modern day films. I found myself in tense situations because of some of the interesting choices of \"freaks\" and \"creatures\". But overall vastly flawed."
    },
    {
      "rating": "3",
      "text": "There is no denying the set pieces are amazing. I will give the film one point for that. Another point comes from the creative writing and conversations the characters have towards the start of the movie. And the third and  final point comes from the fact that this is not a found footage film. I'm sick of those. Other than that this is a scare-deprived, cop out ending, recycled piece of garbage."
    },
    {
      "rating": "4",
      "text": "Whilst there are a few moments where tension is built nicely, the fact that the only interesting thing about the film atall is the setting says a lot. A forgettable breeze of a horror movie that packs a few moments of brief tension, but no actual scares to back it up."
    },
    {
      "rating": "4",
      "text": "\"Chernobyl Diaries\" has a promising setup, but ultimately gives you nothing you haven't seen before in countless other horror films. When a group of American teenagers accepts an offer from a Russian extreme tourist guide to an abandoned town just outside Chernobyl, they quickly discover they're not alone and find themselves in a grim fight for survival . . . only, really, there's less fighting in this movie than just vaguely incoherent running, chasing and split-second scary images. It honestly plays and feels like a found-footage movie, despite not actually being one, and although the acting is decent, it's only at its best in the first act, when it's relying on the atmosphere of the abandoned town itself to build suspense. After that, you just get some dogs, a bunch of people you never see clearly, a series of moronic decisions to continue further and further into the high-radiation zones (they actually end up right outside the friggin' Chernobyl reactor), and a conclusion that is as unsurprising as it is unoriginal. I'll give the film credit for its characters, as they are much more believable and likeable than most other horror flick teenagers, but they're only slightly less idiotic in their decisions and, of course, all die (the last one counts, I say). The result? A rather messy and underdeveloped film that wastes an engaging context on cliches, tropes and a thorough lack of authentic tension or excitement."
    },
    {
      "rating": "1",
      "text": "This movie stinks, just another terrible horror movie.  How fun would it be to visit Chernobyl?  That is a serious question that this movie asks.  Chernobyl Diaries is one of the worst of 2012."
    },
    {
      "rating": "3",
      "text": "I honestly can't believe all the negative reviews, In my opinion from so-called horror movies like Paranormal Activity, Saw, Psycho, etc. This has been the mos entertaining sure the characters were bad, excluding. the girl who made it to the end, She was actually the only real one and good one and smart one. Sure I didn't get scared my girlfriend jumped a few times, but eh. But the atmosphere was creepy. I liked the idea a good mutant/zombie film better then 28 Days Later. Were ever Chernobyl actually happened this better not be shown there or America will have another war going on, unless there reasonable enouh to realize its just a movie. The only part of the film tha literally felt the most unrealistic didnt include any mutants, it envovled a bear in some building. My point is watch it."
    }
  ]
}