{"id": 505, "title": "Cherry", "starring": ["Tom Holland", "Ciara Bravo"], "runtime": 140, "genre": ["Drama", "Crime"], "description": "Cherry drifts from college dropout to army medic in Iraq - anchored only by his true love, Emily. But after returning from the war with PTSD, his life spirals into drugs and crime as he struggles to find his place in the world.", "releaseYear": "2021", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/pwDvkDyaHEU9V7cApQhbcSJMG1w.jpg", "categories": {"plot": 8.0, "acting": 8.0, "ending": 8.0, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 3.0, "funny": 5.0, "action": 5.0}, "reviews": [{"rating": "10", "text": "Cherry is one of those little films that sneaks up on you and grabs your attention because you think you're being drawn into a conventional comedy, and then you find out that it's much, much more. Kyle Gallner, a 2010 PNR Rising Star, stars as Aaron, a 17-year-old engineering student thrust into college life maybe a little sooner than he should be. Once there, he has to deal with an obnoxious roommate and the fact that he'd rather be an artist. In one of his art classes, he meets Linda, a 35 year old trying to get her life back on track. Aaron finds himself attracted to Linda, and thinks she's attracted to him as well when she offers to make dinner for him one evening. Once at Linda's place, he meets Beth, her 14-year-old daughter, who's filled with anger and rage from having to deal with Linda's problems. And she falls for Aaron in the same way Aaron is falling for her mother. And this unique triangle and the unusual relationships that develop therein are the heart and soul of the movie. Gallner is a winner all the way around as Aaron - excited at college life, frustrated at how much he's in over his head, and with a heart that just wants everyone to be happy.  Laura Allen shines as Linda, the ne'er do well with the old soul and a heart of gold. But Britt Robertson steals this movie all the way around - as Beth, she's tough as nails, and yet turns out to be as vulnerable as a 14 year old girl should be. With veteran Esai Morales rounding out the cast as Wes, Linda's sometime boyfriend, Cherry is a true winner all the way around. We first saw it at the Boston Film Festival, and then again when it opened in Boston a month later, and had the pleasure of meeting director Jeffrey Fine, who has crafted a loving comedy-drama that will get under the skin of anyone who sees it. If it comes to your town, do NOT walk...RUN to see Cherry! You will not regret it!"}, {"rating": "7", "text": "great movie guys man down rated sooooooooo many times it was great i mean mani loved this movie at times and sometimes it slipped down to bad"}, {"rating": "8", "text": "Cherry is a surprising film in that its budget is awful, its filmed hastily but all of that doesn't detract from the fact the film itself, the writing, the acting and the overall feel of the film, is fantastic. Cherry tells the story of a 17 year old boy Aaron (Kyle Gallner) who goes to an Ivy League college on an engineering scholarship despite the fact he loves to draw. In a sketch class he meets Linda (Laura Allen), an older woman who offers to cook him dinner. He goes back to hers and meets her daughter Beth (Britt Robertson) a troubled but clever 14 year old girl. Aaron begins to learn different things from both of them while also becoming a part of their family. Sure the film offers up some cliches (the inappropriate roommate) but it more than makes up for it in heart with a great ending offering up a kind of hope for a family that started out so frayed and a boy that was not yet a man."}, {"rating": "8", "text": "A wonderful surprise. I was not expecting this movie to be the quality it was. When I first read the premise Cherry seemed like it was going to be one of those college sex movies (e.i American Pie Beta house), but it took a very charming turn. This movie is a good one and I recommend it to anybody looking for one of those small movies that go unnoticed and underrated."}], "recommendations": ["home_again", "13_going_on_30", "my_girl", "young_adult", "endless_love", "big", "bride_wars", "the_princess_diaries", "something_borrowed", "eat_pray_love", "monte_carlo", "sabrina", "about_a_boy", "you_again", "the_craft", "the_first_time", "the_spectacular_now", "crazy_rich_asians", "cruel_intentions", "labyrinth", "adore", "ghosts_of_girlfriends_past", "tall_girl", "letters_to_juliet", "the_perks_of_being_a_wallflower"]}