{
  "id": 1613,
  "title": "Chicken Run",
  "starring": [
    "Mel Gibson",
    "Julia Sawalha"
  ],
  "runtime": 84,
  "genre": [
    "Animation",
    "Comedy",
    "Family"
  ],
  "description": "The creators of Wallace & Gromit bring you an exciting and original story about a group of chickens determined to fly the coop–even if they can’t fly! It’s hardly poultry in motion when Rocky (Mel Gibson) attempts to teach Ginger and her feathered friends to fly…but, with teamwork, determination and a little bit o’ cluck, the fearless flock plots one last attempt in a spectacular bid for freedom.",
  "releaseYear": "2000",
  "mpaaRating": "G",
  "imageUrl": "https://image.tmdb.org/t/p/w500/sKr9uEqQ0NWQhb29XIJvpT43khk.jpg",
  "categories": {
    "plot": 9.066666666666666,
    "acting": 8.444444444444445,
    "ending": 6.0,
    "soundtrack": 6.0,
    "cinematography": 8.5,
    "familyFriendly": 8.8,
    "funny": 8.6,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "9",
      "text": "Simply one of the greatest, daring claymation movies of all time."
    },
    {
      "rating": "10",
      "text": "Wow, what a movie. So much references and ideas many people can relate to. Dreaming of freedom. What more can you ask than freedom? The story is about chickens who want to get out of the prison of their own, the Tweedy's Chicken farm. Soon after, a rooster comes to give them hope and establish a dream to leave the torture and fear behind, by flying. The movie is so inspirational and gives a nice message: Don't give up. Besides the serious message, there are some funny lines like when Ginger asked the old rooster: 'You mean you never actually flew the plane?' and he was like 'God heaven's no, I'm a chicken'. He was a chicken as an animal and as a scared little douche bag. Also the funniest one: 'Mi life flashed before mi eyes ....... It was really boring'. There are also some scares that little children wouldn't stomach. But otherwise, it has some harmless jokes and fun. I can't describe how much I love this movie. It's beyond amazing and entertaining."
    },
    {
      "rating": "10",
      "text": "The best movie made by Aardman Animations ever! You have to admire the work that went to making this stop-motion movie, which don't exist anymore these days, unfortunately."
    },
    {
      "rating": "8",
      "text": "Chicken Run is a smart, funny, intelligent, movie full of pure entertainment for the entire family. Oh the irony! How a civilized adult and a child can be amused by this at the same time. That basically sums it up."
    },
    {
      "rating": "10",
      "text": "Chicken run is a hilarious movie made by DreamWorks just like Shrek, the chickens tries to get away from tweedy's farm with the plans they tried but failed. However, Ginger has a flying plan to escape from Mrs. Tweedy who plans to turned chickens into chicken pies. It's extreme. Extreme. See it. See it. See it. See it."
    },
    {
      "rating": "10",
      "text": "I ate a sandwich this morning and I was reminded of Chicken Run...what a spectacular film that was. It seems so far away now. Everything was simpler then."
    },
    {
      "rating": "4",
      "text": "The joke only works for about 10 of the 84 minutes."
    },
    {
      "rating": "9",
      "text": "A fun, entertaining film with plenty of uniquely English humor."
    },
    {
      "rating": "7",
      "text": "It's a bit overrated as a kids movie, but Chicken Run will do for family entertainment. It has many ideas it wants to share, but not the right audience to share them with."
    },
    {
      "rating": "9",
      "text": "A guilty pleasure for me personally, as I love both 'The Great Escape' and most of the works I have seen, over the years, from this rightfully-esteemed British animation company. Highly recommended both for children and for adults who enjoy animation."
    },
    {
      "rating": "10",
      "text": "Chicken run is hilarious movie made by Dream Works just like Shrek, the chickens tries to get away from tweedy's farm with the plans they tried but failed, however ginger has a flying plan to escape from Mrs. Tweedy who plans to turned chickens into chicken pies. It's extreme. Extreme. See it."
    },
    {
      "rating": "5",
      "text": "Just like most other Aardman Animation movies, Chickun Run has no shortage of charm, wit or amazing animation, but as usual, the plot is a little too lackluster and a little too repetitive"
    },
    {
      "rating": "6",
      "text": "I remember this being one of the animations I always used to watch over and over as a kid. Wallace and Gromit style with witty humor and hilarious actions these chickens are supported by fantastic voice acting and cute, and memorable characters. Even now I still love to watch this film now and then. A"
    },
    {
      "rating": "8",
      "text": "A great movie."
    },
    {
      "rating": "8",
      "text": "A very good movie that contains jokes and interesting scenes for kids and adults alike. Sure, there are things that could be done in other ways, but it is certainly entertaining, funny and clever enough as it is."
    },
    {
      "rating": "7",
      "text": "While it may be slow and have a lot of talking Chicken Run is an entertaining film with its somewhat sophisticated story, likeable characters, and great stop motion animation"
    },
    {
      "rating": "7",
      "text": "not my favorite, but perfect performances make this movie so good for kids."
    },
    {
      "rating": "9",
      "text": "Certainly not the best animated film of all time, but this is a great movie. I love the suspense, the excitement, the diversity of the characters and everything......."
    },
    {
      "rating": "10",
      "text": "I hadn't seen Chicken Run for a few years and had honestly forgotten how much there is to it - it's far more than a film for kids about rebellious poultry! It's like a weird hybrid of The Great Escape, The Shawshank Redemption and Spartacus, but with animated chickens. It really shouldn't work, but thanks to the genius of co-writers/directors Nick Park and Peter Lord it somehow does. The premise is truly fantastic, after all what animal would dream more of freedom than a farmed chicken? The film has a great cast of interesting characters - Ginger the hyper-intelligent idealist (Julia Sawalha), Bunty the cynical and bad-tempered pragmatist (Imelda Staunton), Babs the constantly knitting, rather dim eternal optimist (Jane Horrocks), Rocky the charming con-artist (Mel Gibson), Mrs Tweedy the wealth-hungry social climber (Miranda Richardson) and the farmer Mr Tweedy, who is convinced he is losing his mind for suspecting that \"those chickens are up to something\" (Tony Haygarth). Though the stop-motion animation quality is such that you can tell what each character is thinking without the need for dialogue, the whole cast give great vocal performances, particularly Sawalha, who gives the story its dramatic weight, Horrocks who is hilarious as always and Richardson who is just plain terrifying. The film has some pretty big themes for an animation about talking chickens - liberty vs. slavery, mechanisation of agriculture, American vs. British politics and the shallowness of modern celebrity culture. Chicken Run is also incredibly funny, with humour ranging from visual gags (an Aardman speciality), puns (\"the lone free ranger\"), pop culture references (Braveheart, Indiana Jones, Star Trek) and quintessentially British comic sensibilities. There's also an exhilarating and visually clever set piece that takes place inside a pie-making machine and a few particularly affecting and surprisingly dark moments such as when the chickens contemplate their own mortality and Babs starts to knit herself a noose. Finally, Chicken Run is an affectionate love-letter to the North of England. Looking at the characters' accents and mannerisms, and especially the beautifully re-created landscapes of the film, you could say that if Wallace and Gromit is Aardman's tribute to the county of Lancashire, then Chicken Run is the studio's tribute to the county of Yorkshire.  We've seen so much brilliant examples of animation from all over the world in the last two decades, but even so, I would suggest Chicken Run is not only the best film Aardman have produced, but that it is also one of the finest examples of British animation the world has ever seen. It's a tragically rare occasion in this day and age that live-action filmmaking is this entertaining, smart, well-balanced and emotionally rewarding. Chicken Run ticks all the boxes, and does so using funny-looking plasticine chickens, a real achievement indeed."
    },
    {
      "rating": "9",
      "text": "Certainly one of the best animated films ever. Wonderfully based on 'The Great Escape' and I think it was easily as good as 'Wallace and Gromit'. A fabulous family movie, Nick Park is a genius."
    },
    {
      "rating": "7",
      "text": "Very funny and brilliant visuals, also great voice cast. Some of the humour misses the mark."
    },
    {
      "rating": "5",
      "text": "A bit more somber than you may anticipate for a animated film--it runs deep and will move you. Don't be fooled by the claymation, it's well-written and well-voiced."
    },
    {
      "rating": "10",
      "text": "This is too good. Excellent voices, suspense, hilarious.. A must watch to anyone of any age... you will never get bored by it's Plot twists... etc...."
    },
    {
      "rating": "9",
      "text": "This movie just oozes creativity and humor. There's nothing quite like it. It takes a rather simple idea, that of a slaughterhouse, and turns it into an awesome and funny claymation. Chicken Run is just classic."
    },
    {
      "rating": "8",
      "text": "Witty, whimsical, wacky, and in short, plain fun, 'Chicken Run' will leave you with laughter long after the movie theatre, unless you don't like British accents. With a clever parody of escape films, it becomes all the more hysterical."
    },
    {
      "rating": "10",
      "text": "Awesome. And it isn't a Pixar's animation, although having elements in common with producer's films, funny, intelligent, well animated. But Chicken Run is even more daring, raw and dark than Pixar's movies and its animation is done through very well done stop-motion."
    },
    {
      "rating": "9",
      "text": "Leave it to Aardman to create something truly fantastic that can resonate in many ways. \"Chicken Run\" is charming, well-crafted and extremely entertaining. It's one of those animated movies that children and adults can both come to appreciate. If you consider yourself a fan of animated films, this film is an absolute must-watch. And even if you don't enjoy animation, it's still worth checking out."
    },
    {
      "rating": "8",
      "text": "Chicken Run greatly appreciate a movie that specialize lively movement , plot and comedy arrasante see and live , such vezno have lost their childhood , you better not miss it."
    },
    {
      "rating": "9",
      "text": "If you want the best stop-motion movie to enjoy, this movie should be it. Chicken Run isn't a chick flick and it won't ever be. Enjoyable for all ages."
    },
    {
      "rating": "8",
      "text": "Chicken Run show how big barefooted dreams are, showing an inventive plot, great characters that passed form animals to humanizine process truly, full of fun and interesting story-telling, Chicken Run is almost another stop-motion masterpiece."
    },
    {
      "rating": "10",
      "text": "Chicken run is hilarious movie made by dreamworks, the chickens tries to get away from tweedy's farm with the plans they tried but failed, however ginger has a flying plan to escape from mrs.tweedy who plans to turned chickens into chicken pies, watch chicken run."
    },
    {
      "rating": "10",
      "text": "Based lightly upon The great escape and Animal farm from George Orwell, the first long feature of Aardman is a egg-cting, eggs-plosive eggs-perience in animation supported by smart stop motion and a strong cast of voices. A mandatory."
    },
    {
      "rating": "7",
      "text": "Nick Park, originally known for Wallace & Gromit shorts turned of the best animators of all time. Chicken Run isn't just the film for kids, as long as they turn 10, they understand slower on how they have done it with just clay but some different material models to build the background green hills and close-up sets. Great camerawork if people hasn't noticed if it was still an on-going footage instead of a frame-shot."
    },
    {
      "rating": "10",
      "text": "Chicken run is hilarious movie made by Dream Works just like Shrek, the chickens tries to get away from tweedy's farm with the plans they tried but failed, however ginger has a flying plan to escape from Mrs. Tweedy who plans to turned chickens into chicken pies. It's extreme. Extreme. See it."
    },
    {
      "rating": "10",
      "text": "Chicken run is a hilarious movie made by DreamWorks just like Shrek, the chickens tries to get away from tweedy's farm with the plans they tried but failed. However, Ginger has a flying plan to escape from Mrs. Tweedy who plans to turned chickens into chicken pies. It's extreme. Extreme."
    },
    {
      "rating": "10",
      "text": "Very CleverWith a neat original story and interesting characters, Chicken Run is another hit from the creators of Wallace And Gromit."
    },
    {
      "rating": "8",
      "text": "Very fun film, re-watchable and charismatic. Mel Gibson's character oozes with charisma with a side of self-loathing, very well-rounded for an animated film. Strong supporting cast as well who compliment Gibson and help to make the universe around him feel more real, but also very isolated."
    },
    {
      "rating": "10",
      "text": "Chicken Run is a intelligent and stop motion animation with super charismatic characters.."
    },
    {
      "rating": "7",
      "text": "Has it's flaws, but pretty good. Colourful and the stop-motion is fantastic."
    },
    {
      "rating": "6",
      "text": "Mrs. Tweedy's farm produces eggs, and the greedy landlord demands her chickens a good share of the day's production, or they end up in the pot. Therefore, the chickens face decided to organize and escape. Ginger is one of the ringleaders, already has many punishments for her rebellion, and the countless failed escape attempts have demoralized the whole hen house. When they all began to settle for their fate, there arises Rocky, an American cock that seems to be able to fly and that breathes new life into the prisoners' dreams of freedom.It's decidedly a remarkable film in every respect. Reminds me of the movie \"The Great Escape\". Personally, I think the creators were inspired a lot in this film to idealize the whole plot. The scenarios are quite detailed and the soundtrack is very good. Technically, stop-motion animation (it's an Aardman Studios movie, and stop-motion is almost a studio tradition) is very good. It's not as good as in newer movies, where other materials were used, but it's positively realistic."
    },
    {
      "rating": "8",
      "text": "I was very common and popular in the years when I saw an animation stop motion technique that I watched in my childhood and I was very afraid of the owners of the chicken farm.it's a film that changes my life partly because I've never had a eat chicken in my life, and I'm so disgusted, and I think this film is effective in this. Has a beautiful story.an animation in which we can always be monitored.just so far i didn't get to enjoy it until i was a little bored old years.but the story of chickens never give up for the freedom of escape is a lesson for everyone. I think it is a film that needs to be watched all the time."
    },
    {
      "rating": "10",
      "text": "Pretty much my favorite stop motion movie ever. The parallels to Orwell's Animal Farm and real life tragedies like the holocaust are apparent but the story still feels so original and creative. The characters are well developed and fun to watch. There isn't a single weak or unnecessary character. The villains are genuinely hilarious yet intimidating, well written and a true threat to our characters. The scenes Mr. and Mrs. Tweedy are togheter can be its own comedic short film because they are just hilarious. The sets look great. The stop motion animation is genuinely fantastic. The cinematography makes this movie look great and interesting and the score is just amazing."
    },
    {
      "rating": "8",
      "text": "Chicken Run's fantastic stop motion animation is more than enough to make this a movie I'd recommend to any fan of family animations. Also it has smart writing, I love me dry British humor, the voice acting is spot on, and the creativity and effort in all aspects of the film just can't be overstated. Apparently Aardman is working on a sequel, and while a part of me is curious why we are getting one almost 20 years later, the other part of me is happy to see this team produce a stop motion film to compete with CG animated films. I highly recommend Chicken Run for the whole family"
    },
    {
      "rating": "10",
      "text": "This has absolutely loads of humor and a lot of real emotion. At no point are you ever in doubt over what's going to happen, but are no point do you care. Because you're enjoying it so much."
    },
    {
      "rating": "9",
      "text": "Chicken Run is new and indifferent, but is a revolutionary way to craft a comedy out of its animation."
    },
    {
      "rating": "10",
      "text": "Best Animated Feature Oscar winner of 2000...if the award existed any year earlier.This is a flick that is not manufacturing the analogy of chickens, but with their nature to escape their owners who are on the verge of making blood money."
    },
    {
      "rating": "10",
      "text": "This Movie. Such A Classic. Chicken Run Is Easily The Best Dreamworks & Aardman Movie Ever Made. Also, Mr. Tweedy Murders His Own Wife At The End."
    },
    {
      "rating": "8",
      "text": "The most underrated movie of all time. And holy **** those people are **** horrifying"
    }
  ]
}