{
  "id": 4580,
  "title": "Chicago",
  "starring": [
    "Renée Zellweger",
    "Catherine Zeta-Jones"
  ],
  "runtime": 113,
  "genre": [
    "Comedy",
    "Crime",
    "Drama"
  ],
  "description": "Murderesses Velma Kelly and Roxie Hart find themselves on death row together and fight for the fame that will keep them from the gallows in 1920s Chicago.",
  "releaseYear": "2002",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/v1Sg3GuHDz9uhrKqYozOeCMLSpj.jpg",
  "categories": {
    "plot": 8.6,
    "acting": 8.555555555555555,
    "ending": 7.75,
    "soundtrack": 8.0,
    "cinematography": 8.0,
    "familyFriendly": 6.0,
    "funny": 8.4,
    "action": 9.2
  },
  "reviews": [
    {
      "rating": "7",
      "text": "\"Chicago\" shouldn't have been a good movie if it wasn't for the stylish direction of Rob Marshall and his cleverness of portraying the correct scenes matching with the song and setting. It isn't great, but a good movie with some light-jazz music you'll love to listen."
    },
    {
      "rating": "5",
      "text": "Perhaps Chicago is meant to be self-analytical in commentary on shallowness in nearly everything, but that doesn't forgive the fact that it is indeed shallow. While it's flashy and pretty funny when it needs to be, in the end, Chicago is still a miraculously vapid movie underneath it all, and that, in the end, makes it boring when it's not belting."
    },
    {
      "rating": "8",
      "text": "Chicago is by far on one of the greatest musicals to hit the stage. The songs are sung with such strength by actors whom I never expected to have that skill. The choreography is beautifully orchestrated and the use of parallel montage between the songs and the actual story is what truly takes this film from the stage and makes it great for the screen. The only fault is that despite great performances, the songs sometimes get in the way of evoking true emotion from the actual plot."
    },
    {
      "rating": "10",
      "text": "One of the best films in history, i loved it  i was never into musicals until i saw this movie, absolutely brilliant performances and beautiful songs  this is truly an Oscar worthy film"
    },
    {
      "rating": "6",
      "text": "The ambition and devotion to 'Chicago' is blindsided by a contempt for all the protagonists (the exception being John C. Reily, whose Mr. Cellophane is truly heartbreaking) and a certain modernization of an era that was not nearly so \"razzle-dazzle\" as the film portrays it to be. I still can't get by the self-obsession of Renee Zellweger and Catherine Zeta-Jones. That's really why I can't give the movie higher than an 8. A 6 is because it wasn't 20's to me."
    },
    {
      "rating": "3",
      "text": "The ladies are pleasant, the leading man replacable, the story forgettable and the musical \"numbers\" add up to zero. In other words, what we quite rightly expect from a contemporary musical."
    },
    {
      "rating": "0",
      "text": "HOW CAN ANYONE SAY THAT THIS MOVIE IS GOOD. Perhaps the worst musical of all time. Richard Gere puts in his worst performance. And the songs suck."
    },
    {
      "rating": "0",
      "text": "Chicago is the worst movie I have ever seen. Nothing was good about the movie. If I could I would give it 3 zeros. Disgraceful, Horrific, Disgusting, Stupid, and a total mess of a film. You couldn't pay me to watch this film. Worst movie of the year, worst movie of all time."
    },
    {
      "rating": "9",
      "text": "Yes, you may be sceptical of the casting if you saw it, but Chicago is a great movie, honestly it is. There is a sharp and witty script, wonderful performances from Catherine Zeta Jones, Renee Zellwegger and Richard Gere and brilliant song and dance routines. The film is stunningly-photographed, and it is not only that the song and dance numbers were great, but also how cleverly they were incorporated into the story, which was a fantastic idea. The costumes are also fabulous, and I thought Catherine Zeta Jones was hot as Velma. Richard Gere is his usual charming self, and Renee Zellwegger lights up the screen even if her character is rather dim-witted. The film is a little long, but I think this is a witty and naughty movie, that is absolutely fantastic in every meaning of the word, and I don't get the negative criticisms. 9.5/10 Bethany Cox"
    },
    {
      "rating": "7",
      "text": "It razzle-dazzled me."
    },
    {
      "rating": "10",
      "text": "One of the best musicals I've ever seen! Acting and singing so great, brilliant story and screenplay. This is one of that films that i never get tired of watching over and over again."
    },
    {
      "rating": "10",
      "text": "This movie is one of the best musical ever made! High energy from the cast to crew makes this sizzle and makes the audience under the Chicago Fever."
    },
    {
      "rating": "9",
      "text": "I like this musical a lot more than I thought I would. The world has been due for some updated ones. I was surprised to see how well Rene Zellweger could sing. Also even more surprised that Richard Gere could sing even at all. Loved his tap dancing court scene. The cast was just about perfect for the movie and all the songs I'd love to own for my music library. Reminds me a bit of Madonna in Dick Tracy. I was also impressed at not only the choreography but also the lighting. *WARNING SPOILER* The Jones and Zellweger duo in the end with great with the tommy guns and popping lights. It was all so flashy with piazza. Chicago comes highly recommended in my book. It's one of these movies you can see ever so often and still be entertained."
    },
    {
      "rating": "8",
      "text": "A very funny, very entertaining film with an interesting plot."
    },
    {
      "rating": "10",
      "text": "Brilliant musical, one of the best ever made. The cast is amazing, the choreography is impressive, the cinematography, score, art direction - everything is incredible. Mesmerizing and magnificent."
    },
    {
      "rating": "8",
      "text": "Chicago is a very original movie. And that's what people are looking for these days. Every award they received, including Best Picture, was well given from the Academy. Catherine-Zeta Jones was an excellent supporting actress, and she did earn her Best Supporting Actress award, but truly, I think Renee Zellweger did a better job as an actress. The cinematography was simply amazing. The transitions between reality and stage were definitely enjoyable. The way the audience saw the stage performances was excellent, and the way they saw reality was interesting as well. And at that fact, the stage performances is what made this film extravagant. No breaking into song in reality. All of the singing was as if they were feeling it, and we were witnessing their feelings. The the songs were real catchy, and definitely masterpieces to listen to. But there were a few flaws in Chicago. One was some of the speech. It was hard to understand without subtitles or going back a few times to hear it again, but not all of it was like that, only some. Then the fact that one of the characters (the innocent and \"invisible\" one) never got what he deserved. This was the sad point in the film. But I guess that's reality, folks. And the best part of Chicago was... That it was better than the musical. I saw the musical, and it was boring and dull compared to the film. But there is one last flaw. The 1 hour 57 minute film left out a bit from the 3 hour musical. You got to know the characters more in the musical. All in all, I give Chicago an 8 out of 10."
    },
    {
      "rating": "8",
      "text": "Chicago is a pretty unique film creation. An adaptation of the satirical musical of the same name, it's energetic and flawlessly choreographed, with well-performed songs and a decent helping of tongue-in-cheek humour. It's not all glitz and glamour though, and it's satisfying to see a bit more going on below the surface than in other musicals - it addresses everything from gender stereotypes to the fragility of celebrity and the fickle nature of a media-consuming public. The cast are strong across the board, but Renee Zellweger and Richard Gere are the real highlights, the former perfectly expressing Roxie Hart's journey from naive and unfulfilled housewife to calculating, image-cultivating celebrity, and the latter stealing every scene he's in with good old-fashioned showmanship. Unfortunately the film does lose a little momentum, and packs a bit less punch in the final twenty minutes or so, but this is more a testament to the knock-out near-perfection of the rest of the film rather than any particular flaw in this part of the film. Perhaps it was inevitable that shining so brightly early on would result in a certain loss of sparkle in the latter parts of the film. Overall, though, Chicago is a joy to behold, and the experience will stay with you long after the credits roll."
    },
    {
      "rating": "8",
      "text": "Bottom Line: Two murderesses and a lawyer run away with six Oscars in this flamboyant musical.\r Ostentatious musical takes a sarcastic look at the story of two murderesses and their rise (or rises, one could say) to fame on the stage. This was the first musical in 33 years to win Best Picture, the previous being OLIVER! in 1969, and I can now honestly say that this didnâ"
    },
    {
      "rating": "10",
      "text": "Chicago has all the trappings of a great musical while also working as a truly great film. The main draw of Chicago has to be the way Rob Marshalls direction allows for an exhilarating viewing experience that flows brilliantly. The idea that there are two different worlds, the real and the musical, was one of pure genius because it allows for not only some thrilling musical numbers but also character development without the loss of momentum with Cell Block Tango introducing the prisoner brilliantly while also injecting some much needed theatricality. The cast works well because they accept the preposterous nature of the story and act as if on stage which sounds ludicrous but it works. Renee Zellwegger shows the evolution of a performer with both flair and naivety with Catherine Zeta-Jones playing off her with equal parts spunk and cynicism. However the real star is Richard Gere who demonstrates different relationships between the two and really manages to infuse some undeniable fun into the proceedings as the larger than life lawyer Billy Flynn.\rChicago is really a story of how a star is born through less ordinary means and thanks to some great music, acting and directing it works brilliantly"
    },
    {
      "rating": "10",
      "text": "Between Rob Marshall and Bill Condon, there was no stopping this adaptation of Bob Fosse's hit Broadway musical. Amongst the cast and amongst the staggering musical numbers, Chicago is one of the best musicals of our time."
    },
    {
      "rating": "10",
      "text": "An absolute knockout! I can't claim to know much about musicals, but this one is easily the best one I have seen. Every performance, song, and dance were so spot on. Thoroughly engaging and visionary."
    },
    {
      "rating": "7",
      "text": "Chicago is a pretty simplistic film narratively and though the acting from Renee Zellweger, Richard Gere, and Catherine Zeta-Jones, is good, it is certainly nothing revolutionary. However, what is revolutionary here is the direction from Rob Marshall. The transition from stage to screen is brilliant here and the film simultaneously feels as though it were a play and a film at times. The set pieces and production value here are fantastic as this film feels like a spectacle throughout and it honestly feels like you are watching something quite special at times as a result. The costume design is authentic and, along with the production design, capture the look and feel of old Chicago very well. Finally, the music here is pitch perfect and a true joy to listen to and watch be performed. Overall, Chicago is not outstanding on the whole, but is quite a good film that is incredibly entertaining."
    },
    {
      "rating": "7",
      "text": "Musical numbers are great and the film is very stylish. My biggest problem with it, though, is that ALL the characters are terrible, unlikable human beings who use others and destroys their lives without any real comeuppance or learning a lesson by the end. Maybe if Roxy at the very least grew to be a less selfish individual by the end I may have cared, but in the end her sentencing outcome meant nothing to me whether she was found guilt or no. I just care what happened to anyone and I'm not sure if that was the intent."
    },
    {
      "rating": "8",
      "text": "Yet another great movie that I regret not seeing sooner. Rob Marshall's \"Chicago\" is as refreshingly glitzy and nostalgic as it is delightfully slimy and debauched. Featuring a satirically charged narrative, well-rounded performances in every corner, and an incredibly unique, well-structured musical concept at the heart of it all, this film has very quickly stacked itself up in my list of absolute favorites in the musical genre."
    },
    {
      "rating": "10",
      "text": "Easily one of the best musicals out there, if not the best. Captivating musical performances and outstanding acting from the three leads made this a very enjoyable film to watch and one of my personal favs. The toe-tapping songs are just great and it really does the Broadway production justice! It's also hard to pick a favourite song as they are all fantastic! Overall a thoroughly enjoyable film and one I would strongly recommend. It certainly deserved that Best Picture Oscar as well!"
    },
    {
      "rating": "9",
      "text": "A perfect remastering of the Broadway musical. The movie has an excellent cast, characters, sets, songs, and writing. Being the essential rebirth of the \"movie musical\", Chicago is a delightful motion picture worth your time and money."
    },
    {
      "rating": "9",
      "text": "\"Chicago\" is actually one of the memorable movies ever made. It has great acting, characters, dark humor and one of the best screenplays. I love the way the film is presented, it has its unique style, great musical score and different musical numbers. \"Chicago\" is a must see film. It is a masterpiece."
    },
    {
      "rating": "6",
      "text": "As far as I know, Chicago is the worst movie of the movies that have won Best Picture. It is completely overrated, more overrated than most bad best pictures...and Frozen."
    },
    {
      "rating": "10",
      "text": "As a fan of musicals, this is another of my favourite movies. I love the songs and sing them all the time, they are all really catchy. Renee and Catherine are perfect in their roles, couldn't imagine anyone else playing them. Richard Gere, Queen Latifah and John C Reilly (who now when I watch all I hear is Wreck-it-Ralph) are also amazing at their roles. The story is unique to any other I've seen, and is different in the fact it's a slightly darker theme to a musical about murder and death. However, it manages to uphold a light hearted spirit with lots of comedic moments. Overall, I just love it!"
    },
    {
      "rating": "8",
      "text": "\"Chicago\" based on a play, that leaps deservedly to the cinema, the performances (among the outstanding Zellweger, Zeta-Jones, Gere and Latifah), the script, the scenes, the music, the songs and the atmosphere of The 1920s were the big stars."
    },
    {
      "rating": "10",
      "text": "Never have I been so wowd at a movie production of such a beloved musical. Now I like musicals and musical movies. There have been some bad, mamma mia rent high school musical and a few others. Man I went into this movie so cold mr. freeze wouldn't have been able to survive in the arctic and this movie lifted me off of my feet. This movie however has no flaws and the director is brilliantly able create a bunch of fantastic flashy show stopping numbers while simultaneously pairing  a duo of Oscar winning performances by the two main characters  and a bunch of songs that will be stuck in your head from the begging to the moment you finish this movie makes this a perfect 10 in every way. Now i just need to see this on broadway"
    },
    {
      "rating": "9",
      "text": "pop.. six.. squish.. unh uh.. cicero.. ****ChicagoIt basically defines the excellence in music tracks, production design, costume design and choreography that is so rich and visually aesthetic to view that it upbeats the audience on the seat to a point where one can't defy that it is entertainment at its best. It is finely detailed when it comes to create the high pitched musical sequences where each and every beat, lyric and tempo serves the right amount of taste that has been missing in musical features. The plot does not only lifts up from eerie perspective but stays true to its nature throughout the course of it that has gripping screenplay, stellar performances, perfect editing and execution, amusing characters and stunning visuals. Rob Marshall is in his A game in here being aware of the opportunity and the potential that this script has, he draws out the best from each and every frame. A smart adaptation by Bill Condon; the screenplay writer, that offers enough space and range for the character and actors to factor in. Renee Zellweger and Richard Gere are brilliant in it but the real game changer is Catherine Zeta Jones as a supporting artist. Chicago is a rare art that touches the craft and hardwork at its peak and radiates the deep down emotion and communicates with the audience from the first frame and doesn't leave until the curtain drops."
    },
    {
      "rating": "4",
      "text": "If I’d realised Bob Fosse had had some involvement with this material (I should have picked that from the main song title) I could have saved myself some headache-inducing choreography. This has everything you could expect from a Harvey Weinstein movie, bosoms, bums, boobs and brainless glorification of sleazy murderesses. All done in a grotty, sensationalistic burlesque style – complete with a black lesbian prison boss! Some shots looked like the editor threw the footage in the air then randomly cut it together. Now add a bunch of songs with the majority that can’t be hummed, whistled, or remembered and voila!  you’ve got an Oscar-worthy mega-hit, what else.Yes, a few of the stars do some interesting slick star turns but only between,  or after, much stomach-churning, frenetic ugliness has turned your head into a pit of aching mulch. If you haven’t felt like throwing up by the halfway point, then you deserve this movie!  Or, if you liked Fosse’s sleazy “All that Jazz” you could also get sucked in by this mess. To each, their own but leave me at home."
    },
    {
      "rating": "8",
      "text": "It's really sad the unique storytelling Rob Marshall perfected here has never been duplicated in any Musical film, as far as I know, since this day, even Marshall himself approached it a second time in Nine and it's safe to say that he failed miserably. I'm talking about le montage parallèle that keeps the songs separated from the on-going actions in the actual story, and play simultaneously in order to express what the characters feel at a certain point in the story. Such a technique is rarely used in musicals, let alone used in a way that really shows that the director is in total command of his craft. That really could have been something revolutionary for the musical film genre if it was accompanied with a very simple thing.I feel that the main reason the risks Marshall has taken in Chicago paid off brilliantly is that the film is simply has a decent plot; one that we seldom see in a musical film that tells its story primarily relying on dance numbers, which are here, by the way, elaborately choreographed. I'm a fan of musical films already, but I reckon even those who are not very fond of watching two hours of people dancing and singing would be easily engaged in a film that rather has an actual, intricate story. Even if the dance numbers don't seem to add to much to the story ـــfor, yes, I think there are some redundant ones and others overlong hereـــ it would be easy to tolerate with them as long as there is a story, a clever one, you're engrossed in from the get-go. Did I mention that Chicago has what quite possibly be the best opening dance number I've seen in any musical since I've seen La La Land's Another Day of Sun? That what made Chicago an excellent film, but what really made it extremely fun to watch is the sleek camerawork and polished lighting, the skilful and slick direction that treated the film as a breezy crime flick and the magnificent performances by all the cast, including, of course, Catherine Zeta-Jones's Oscar-winning performance. Chicago really took me by surprise since I didn't even like any of the three Rob Marshall films I've seen so far. This one I did love it!(8.5/10)"
    },
    {
      "rating": "0",
      "text": "I don't like this movie, and I don't know how people say that it is good..."
    },
    {
      "rating": "10",
      "text": "Far and away my favorite musical movie. It works as a story, the songs are perfect updated period-style pieces, the casting was brilliant -- like most musicals, it requires some suspension of disbelief, but this viewer is more than willing to do so in order to enter this fantasy-Chicago again and again."
    }
  ]
}