{"id": 2538, "title": "Children of the Corn", "starring": ["Elena Kampouris", "Kate Moyer"], "runtime": 93, "genre": ["Horror", "Thriller"], "description": "A psychopathic twelve-year-old girl in a small town in Nebraska recruits all the other children and goes on a bloody rampage, killing the corrupt adults and anyone else who opposes her. A bright high schooler who won't go along with the plan is the town's only hope of survival.", "releaseYear": "2023", "mpaaRating": null, "imageUrl": "https://image.tmdb.org/t/p/w500/9vYJfuYcCrN1GWW8x3MS7To4A3T.jpg", "categories": {"plot": 5.6, "acting": 4.714285714285714, "ending": 6.0, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 6.2, "funny": 8.0, "action": 7.0}, "reviews": [{"rating": "7", "text": "Kids go bad in this Stephen King adaptation. The themes are potent here. The events serve as a parable about how religion is often used for cruelty in the hands of certain people who prefer doom and damnation as opposed to forgiveness. That, along with the usual brand of Stephen King imagination, make for an entertaining movie. Just keep in mind that it's not without it's flaws.The idea about killer kids hiding out in a town ridden of grown ups has a pretty creepy quality to it. Unfortunately, it's just not very scary. This has less to do with the budgetary constraints and more with the fact that it's hard to make a bunch of kids and teenagers truly threatening to the adult protagonists, no matter how many sharp weapons they are carrying. Every confrontation ends pretty easily with the adults on top as they are just much stronger than their pre-pubescent adversaries. There's still some potential for slasher film style fun, but it's not capitalized on as the story doesn't allow for much killing to happen.Despite a lack of frights it is still possible to enjoy the movie as it is remarkably well-executed, minimal budget or not. The cast is also very good. Sure the youngest of actors can't, well, act with much skill, and the child leader Isaac's voice is problematic in it's going through puberty scratchiness, but everyone is game and the older people on board are great. Particularly Courtney Gains as Malachai. He's a great villain.Aged though it may be, Children of the Corn still has some thrills to offer. It's unique concept is alone enough of a reason to check it out. Especially if you're a fan of Stephen King and/or the short story. Personally, I have never read the short story this movie is based on so I cannot attest to it's faithfulness to the source material. I can say though that this stands as a pretty good movie. It's a cool idea that was brought to life on a low budget with surprising effectiveness. It definitely won't scare your pants off, but it will provide some solid entertainment."}, {"rating": "5", "text": "+Fascinating concept+Excellent cinematography+Decent haunting soundtrack-Awful screenplay-Some terrible child actor performances-Akward pacing in the edit, poor structureChildren of the corn is an interesting horror concept that never quite bore fruit in this production. Its a shame as you can tell there were some talented folks involved but somehow the heart of the project never makes it onto the screen.Enough pieces are missing from the story that nothing ever quite connects the characters to the story to enable me to really feel anything for them. It ends up just passing as a serviceable watch but with the exception of the opening cafe sequence, failed to really shock or suprose - too many projects have done Stephen king better since this one."}, {"rating": "8", "text": "You need to take my 8 out of 10 rating with a pinch of salt here. Having grown up watching this film, and being obsessed with horror, I suppose I am a little biased when reviewing Children of the Corn. Yes, the script is flimsy. Yes, the special effects are dire. Yes, the story doesn't make a great deal of sense, particularly towards the end. But somehow, there is just something cool about this film that secures its place in my collection as a cult classic.First of all, it's pretty chilling. Linda Hamilton's great to watch, and John Franklin and Courtney gains creep you out like they're supposed to. The opening massacre in the coffee shop of all adults carried out by children is possibly the most disturbing of all. The first two acts of the film, in spite of the daftness, keep you with it.But in the third act of the move, this is where things start to get a little messy, and its high concept deviates into silly religious hokum. The plot deviates greatly from its source material, the original short story by Stephen King, and the movie ends with what seems to be a hastily thrown together action-sequence, where our heroes battle 'He Who Walks Behind The Rows', the demon that inspired the children to slaughter their parents. Complete with very questionable special effects, poor dialogue and nonsensical biblical passages, it brings what has been a fairly fun and chilling ride to a less than interesting conclusion.This is the best one of the lot. Just give it a go, laugh at its badness, and call it a night."}, {"rating": "4", "text": "I saw this movie recently and I was unimpressed. I have seen many adaptations of Stephen King's short stories, and this film is not among the best. However, it also didn't seem as bad as many people say. It has some redeeming qualities that must be taken into account. Perhaps it contributed to becoming a film with some notoriety, even after several disastrous sequels.The film is based on a short story by King about a small rural town, where everything revolves around growing corn. One day, in 1980, inspired by the fiery preaching of a teenager recently arrived in the city called Isaac, the local children unite and massacre the adults, their parents and family members, in order to please an evil and diabolical deity they call \"The One Who Walks Behind the Rows\". And from there, the city dies, and so do those who get there. It was what would happen to a young couple who gets lost and finds the city by chance, but they will have the help of two children from the city, unhappy with the direction of the situation.Well, I don't know if it's really worth saying that logic isn't the film's strong point. It does not make sense for a city, however small, to suffer such a calamity and that is not front-page news, with an invasion of police, armed to the teeth, to hunt down the sect. It is best to accept the film as it is and not think too much about the story or everything will fall apart. One of the things that pleased me most is the way the film begins: through the voice of one of the children, we witnessed the horror of the massacre, with the refinement of cruelty. It is one of the most striking scenes in the film, and it introduces very well what will follow. The film is effective in the task of creating an atmosphere of tension and surrounding suspense, but it spoils it as it progresses and the film becomes more exaggerated. The ending is histrionic and uninteresting.The film has a cast that we can divide into adults and children. The overall performance is average, but there is no actor who truly shines or stands out for his good work. This is largely due to the poor direction of Fritz Kiersch and the fact that the characters are basic, without any development. Most children did not have much to do. John Franklin is greasy and slippery, but never truly threatening, Courtney Gains is more effective at this task; Robby Kiger and Anne Marie McEvoy are sweet, pleasant and easy to like; Jonas Marlowe and Julie Maddalena do nothing more than is essential. When it comes to adults, Linda Hamilton steals the spotlight whenever she appears and the reason is clear: she is beautiful and convincing in the role of the lady in danger, but she does nothing but be in danger, appear scared and run away. R. G. Armstrong did a good job on a character that comes up briefly, and it gives us perhaps the closest thing to a well-done dramatic interpretation. Peter Horton has not convinced me and has scenes that are absolutely inconceivable.Technically it is a rather poor film, and it should certainly not be the fault of the time it was made. There were already better features and special effects than those used here. Really, the film has horrible special effects, the best and most creative being that pile of earth that runs from side to side and, supposedly, is the evil creature that lives in the corn and the children deified. There is little blood in the film (in certain scenes there should be more to make it more credible) and the deaths are not graphic, but they shock more by what is implied than by what is actually seen."}, {"rating": "5", "text": "Couple run over a kid who was escaping from a town taken over by a cult of children, who happen to enjoy killing adults."}, {"rating": "6", "text": "A nice little gritty horror movie from the eighties. It relies on the suspense built up from effectively menacing kids of the cult. There are some laughable bits like the corn parting to make a path and the occult effects at the end but I forgive these as they were just trying to make the film more supernatural. The only thing I didn't like was the religious and moral overtones. I got the impression that this was a Christian film warning of the dangers of other religions. That aside this is an enjoyable and occasionally scary horror film with two really evil characters."}], "recommendations": ["scary_stories_to_tell_in_the_dark", "the_prodigy", "ouija_origin_of_evil", "pet_sematary", "annabelle_comes_home", "the_kid_who_would_be_king", "the_house_with_a_clock_in_its_walls", "annabelle_creation", "sinister_2", "winchester", "the_conjuring_2", "lights_out", "the_girl_with_all_the_gifts", "case_39", "insidious_chapter_3", "it", "insidious_the_last_key", "the_ritual", "eden_lake", "color_out_of_space", "the_conjuring_the_devil_made_me_do_it", "the_spiderwick_chronicles", "the_nutcracker_and_the_four_realms", "brightburn", "us"]}