{
  "id": 2061,
  "title": "Children of Men",
  "starring": [
    "Clive Owen",
    "Julianne Moore"
  ],
  "runtime": 109,
  "genre": [
    "Drama",
    "Action",
    "Thriller",
    "Science Fiction"
  ],
  "description": "In 2027, in a chaotic world in which humans can no longer procreate, a former activist agrees to help transport a miraculously pregnant woman to a sanctuary at sea, where her child's birth may help scientists save the future of humankind.",
  "releaseYear": "2006",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/k9IAS4TehZFcKi4HVByxZNPfqex.jpg",
  "categories": {
    "plot": 5.484848484848484,
    "acting": 5.4,
    "ending": 6.333333333333333,
    "soundtrack": 1.0,
    "cinematography": 6.571428571428571,
    "familyFriendly": 2.7142857142857144,
    "funny": 7.0,
    "action": 6.181818181818182
  },
  "reviews": [
    {
      "rating": "5",
      "text": "I'm really torn on this movie. The underground hype has really blossomed and I was very excited to see it. Maybe that worked against me. Perhaps if I'd gone in with mediocre expectations, I would have been pleasantly surprised. I gave this movie a five because it does propose a plausable future in a realistic manner. But, like so may other viewers, I was left with more questions than answers. I didn't expect every question to be answered, but so many are left resolved. What is the Human Project? Why is NO ONE questioning how this girl got pregnant?!!! Arrgghhhh... Still, probably worth the admission just to say I saw it."
    },
    {
      "rating": "10",
      "text": "One of those movies you wish would never end. The sets are wonderful. The characters are likable and believable. An excellent anti-utopia with tense action scenes."
    },
    {
      "rating": "9",
      "text": "An excellent and deeply disturbing film, that ended five minutes early."
    },
    {
      "rating": "10",
      "text": "The best movie I've seen from 2006. Everything is not all wrapped up at the end - and that's a great thing as it allows our imagination be a part of the story. I purposefully did not read any reviews or plot synopsis's going in, and was duly rewarded. Thus, I'm not going to say anything about the plot. I'll just say this: This is what a movie is supposed to feel like. Brilliant."
    },
    {
      "rating": "10",
      "text": "Without question, the best film of 2006 and, for me, the best film of the last ten years. Superb!!"
    },
    {
      "rating": "9",
      "text": "I am honestly shocked to see that so many people gave this brilliant film such low scores. There's always one or two people that just do not GET a movie and give it low scores, but this is astounding. There is no possible way this movie deserves a 2 or less. Ridiculous. If you have not seen it, this is one time you should listen to the pro reviews above and ignore the commenting idiots down here. (sure, me too, that's fine)."
    },
    {
      "rating": "9",
      "text": "Forget about zombie-apocalypse. \"Children of Men\" shows we don't need monsters to make our society collapses. The dark creatures responsible for our doom live inside the humans themselves."
    },
    {
      "rating": "9",
      "text": "As it has been said, you'll either love or hate this movie. Personally, as I enjoyed it, it's hard to understand why others dislike it. There's talk of poor character development, unanswered questions, etc. The problem is, with character development, if the protagonist goes on the traditional route (naive to weary to underdog to champion to victim etc.) it's completely cliche and it has been done thousands of times. You can go into a movie and you already know exactly how the character is going to react to every plot twist and curve that comes along, and it's boring! You know \"well obviously, this every day regular guy is clearly going to reject the ludicrous things he is being told. Then slowly he is going to accept them, then embrace them, then champion them, and then get burned by them, and then redeem them\".So I'm happy when there's this character who comes along, and we don't need to spend an hour watching him reject the plot of the film, only to then embrace it. Not to mention, actually, there is quite a good amount of character development in this movie. I can't be bothered to explain it all, and if you missed it, obviously you weren't paying close enough attention, and that's not the directors or actors fault.Regarding \"unanswered questions\". That was one of the themes of the entire movie (besides \"hope\"). No one knows what's going on. No one knows what the next day will bring. The rest of the civilised world has collapsed. What, did you want some scientist in a doctors coat and big classes, while holding some test tubes, to explain in the last 30 seconds of the movie what caused the sterility of the world, and what caused the female protagonist to become pregnant? These questions were left unanswered because, as is the theme of the movie, no one knows why. Basically, if you go into a movie wanting it to do something, you will always be disappointed, because it won't do what you want. If you go into a movie and strap yourself in and enjoy the ride, you're going to enjoy it. You can't blame a movie for not doing something you want it to do, especially if doing such a thing would destroy the entire theme of the movie. Great movie, 9/10, the cinematography was beautiful, some really professional and inspired work there."
    },
    {
      "rating": "10",
      "text": "This movie is brilliant and the cinematography is astounding!"
    },
    {
      "rating": "9",
      "text": "Although it leaves you wondering what happened, this is a movie that sticks in your brain. Like a good meal, you will think about it afterward. Disturbing and entertaining."
    },
    {
      "rating": "10",
      "text": "Alright, I thought the film pushed too hard on immigration politics as a couple of critics noted but aside from that I don't have a problem with it, at all. The charachters are superb and in the beginning and middle we're given a chance to know about them, but then at the end the film literally explodes and throws you in the middle of a war with the most intense action scenes since saving private ryan. It does this very smoothly aswell to the point where you don't mind that it's really become a different film. I don't really use this word a lot because I think it's shamefully overused in the metacritic user reviews and critics themselves overuse it, but this film is quite simply a Masterpiece."
    },
    {
      "rating": "9",
      "text": "I feel that Children of Men is an electric motion picture that is both original and evocative of early cinema, where the skilled manipulation of the viewer is carried out to evoke raw, visceral feelings that are primeval within us."
    },
    {
      "rating": "9",
      "text": "The one long, one-shot scene alone was enough to make anyone realize that the cinematography is above the rest. The plot is interesting, and I do like where the director goes with it. I liked this movie, and was under the impression that most thought it was just okay, until I saw this page. I'm glad more people agree with me, because this one was impressive."
    },
    {
      "rating": "8",
      "text": "Children of Men is a thunderously exciting film, featuring amazing performances and fantastic action scenes. The sci-fi flavored world the movie creates is also utterly convincing. Children of Men is brilliant from start to finish."
    },
    {
      "rating": "10",
      "text": "I'd have to say this is one of the best science fiction movies ever made. The cinematography, the performances, the music, the story, everything about it excels. The director convincingly presents a bleak near-future where humanity has gone infertile and is slowly dying out. Add in gut-wrenching action scenes, a particularly wonderful performance by Michael Caine, and an anti-fascist subtext, and you have a brilliant humanistic tale."
    },
    {
      "rating": "9",
      "text": "The film succeeds because of it's dramatic power. this is a result of the great camera work and great acting. However I found the films themes to be a bit week but this is a really weak criticism."
    },
    {
      "rating": "10",
      "text": "Children of Men is the best film of 2006. Hands down. It's so good, it easily makes my top 5 films of all time. Alfonso Cuaron has crafted the most important film of the year, and one that will be remembered for generations to come. Clive Owen brings quiet anger and desperation as Theo, an ex-activist who, like everyone else on Earth, is mourning the loss of Baby Diego, an 18-year-old who is the last born person on the planet. The year is 2027, and everyone has been mysteriously infertile since 2009. Terrorism is rampant, and the country (the film takes place in Great Britain) is in lockdown. However, small rebel groups are sill trying to figure this mystery out on their own. Among them are the Fishes, lead by Julian (Julianne Moore), an activist, and ex-lover of Theo, with the passion of having lost a child. Julian is a woman who finds answers at any cost, and due to his pull, she needs Theo. Once he's pulled into her plan (he initially does it for money, but you get the sense that there's still some spark left in their romance), he can't get out. Theo is a man who has lost hope, but he is reminded that hope exists when he's introduced to Kee (Claire-Hope Ashitey), a young woman who is pregnant and desperately needs the aid of sources outside of Britain. Using all of his resources, including his stoner compadre Jasper (a wonderful Michael Caine), Theo vows to help Kee, a living miracle who brings hope back to a man who believed it was lost forever. Cuaron's directing is top-notch, and he was robbed of an Oscar nomination. And the performances; some of the best of the year. Owen is a force to be reckoned with. He perfectly captures the sadness, the menace, and the compassion lurking beneath Theo's rough exterior. Caine is a hoot and a heart-breaker as Jasper, a man who has faith in a world that has lost their's. As Julian, Moore is fierce as a one-woman army of integrity and force. And as Kee, new comer Claire-Hope Ashitey makes Kee a young girl forced to become a woman, and one of strong will. With no one to use as a reference for pregnancy, she's a scared girl that is going through something that is not only life changing, but history making. Children of Men is fantastic film making, and brings about a message of hope in desperate and challenging times. It really couldn't have come at a better time."
    },
    {
      "rating": "3",
      "text": "A dystopic, boring, depressing, confusing vision of the future, and very politicized for our present state of affairs. The \"immigrant rights\" angle is one case in point. Lots of logical inconsistencies, unsympathetic, poorly-developed characters, melancholy cinematography, gratuitous violence. I would not recommend this piece of left-wing propaganda to anyone remotely optimistic about the future. And the \"music\" stunk. Thumbs down!"
    },
    {
      "rating": "3",
      "text": "This one was a major disappointment for me. I will start off with the few positives before moving into the negatives. Firstly, the acting was good, especially from Clive Owen, Julianne Moore, and then Chiwetel Ejiofor and Charlie Hunnam is smaller roles. In addition, the cinematography here is great, especially during action sequences. The whole film has this really cool video game esque feel to what unfolds that is just missing the prompts for what you are supposed to do next. In addition, the colors here are great, as the gray everywhere really sums up the despair. Now, for the negatives. There are not a ton, but they are big enough to really hamper this one. Firstly, the story sucks. In premise, it sounds good, but in practice it is boring and uninteresting. In addition, there needs to be some kind of introduction to this world. Many things are occuring in this film and it never really explains why. I know that Cuaron hates backstory, but it is needed in this type of film to allow the audience to understand this futuristic setting. Without it, the audience is left guessing as to why the events are happening. Another major issue surrounds one of the deaths in this film, as it is hinted that it was a specific reason, but the reason is murky at best and really needed better explaining. It is a very important sequence, yet the reasoning behind is left largely unanswered. The script is also pretty bad in most parts as the dialogue had me cringing quite frequently. It all felt very unnatural and poorly worded. Finally, Clara-Hope **** is quite annoying and since she had a large role, it really subtracted from the overall film. Many find this film to be thought-provoking and cautionary. I cannot help but agree, as it left me wondering how it got so much praise and a warning to not trust the general consensus all the time."
    },
    {
      "rating": "5",
      "text": "Children of Men for the most part is extremely boring and only by the end kicks into another gear that started to grab my attention. Barely anything is explained and nothing is answered."
    },
    {
      "rating": "1",
      "text": "I sort of enjoyed the movie for a while until the nonsense about refuge camps and when it started to look like all this film brought up was questions with no cohession. Specifically if you think the characters developed and evolved throughout the movie and that all the different ideas were stuck together well then you are nuts. Yes the music may have been good or the photos, I dont know and dont really care. I disagree that the ending was crap in that if the director was trying to convey how nuts people hand gone by believeing in some mythical humainity project and that it was just an ordinary boat then yes it was actually quite a good ending, if.... I thought thats what it might have been about how he just failed at the finish line and that the woman was saved by fishermen. The camp thing was nuts, if the regime was so oppresive they would have just killed them all and it seemed to morp from an anti fuji thing at start of movie into an anti muslim thing and there were also causcasians in there, very bizare.  Plus the fact he was only hit in the arms(v.unlikely) and that being hit in the arms twice killed him(not so likely). Never explaine why infertility was there and what difference one baby could have made. If they had made this about scientists rushing to understand say a cure for a disease and their being a fascist regime only using it on non-illegal immigrants it would have been a much better movie.  Or they could have gone down the whole chase route more throughtly and made human project a peacful orginization protecting the baby from the fishies. Or even the \"terrorits\" could have been **** who created a disease through gene technology by accident,  who were hated but were also required to solve the same issue they created, all of these different scenarios would have been much deeper than what was presented -nothing."
    },
    {
      "rating": "3",
      "text": "This movie was terrible. There were just too many plot problems. Children of Men takes place in Britain in a futuristic age where humans can no longer reproduce. The only thing keeping my attention was the hope that the cause of the infertility would be revealed. However, the only provided explanation is that about 20 years earlier, there was a disease going around, causing the change. Since this phenomenon drives the whole plot of the film, I would have preferred to have been given an explanation lasting more than 20 seconds. Also, I don't want to give too much away, but the ending isn't much of a conclusion. Rather, the camera just zooms out and no questions have been answered and the protagonist is still in the middle of his journey. I'm not saying that I wanted everything to be wrapped up neatly; I just want to see at least some form of finality. Another problem of mine was the characterization. In the middle of the film, people try to kill a woman because she's pregnant, yet, as soon as the baby's born, everybody suddenly becomes nice and peaceful. I understand that the director was trying to show the innocence of children, but going from murderous to crying and hugging in a matter of seconds is just too ridiculous. In addition, I had some problems with the filming. There were a couple of times when vision was distracted because of blood from the scene that splattered onto the camera. As a result, there's a whole scene in which the characters are running around, but I was fixated on the drops of liquid that were dripping down the screen. (Trust me, the blood was not there for a symbolic purpose.) In short, the idea of a futuristic world without fertility may have been a good idea, but the execution was dreadful."
    },
    {
      "rating": "6",
      "text": "I think that this movie is pushing things a little to much. I'm not expecting that a SF movie to be realistic, but is neither a SF nor a realistic movie. I consider this the major defect of the movie. The actors are not impressing much. A part of the idea of having the humanity saved by a birth of a child nothing is notable. Is anyone asking how Kee became pregnant in that circumstances?"
    },
    {
      "rating": "3",
      "text": "Great filming.. but poorly developed characters, a complete lack of direction, point or cohesion and heaps of mindless violence and ugliness add up to equal the same old crap we've been shoveled for the last 30 years."
    },
    {
      "rating": "1",
      "text": "The only thing half way interesting is that the child is born to a young black girl as it should be considering the black women is the mother of earth."
    },
    {
      "rating": "5",
      "text": "There's no \"there\" there. Some action scenes, some sadness, no moral of the story. Huge plot holes and unrealistic escapes, etc. Doesn't make you think."
    },
    {
      "rating": "5",
      "text": "It seemed to me as if this movie was one large indecision. It couldn't decide what movie it wanted to be because sometimes it felt like it was an action-thriller and then it throws in waaaay to much unbelievable humor followed by a hint of a biblical allusion and then a political jab all suggesting that I shouldnt have bothered. Rent it."
    },
    {
      "rating": "1",
      "text": "Truly lousy movie. This is one of the worst movies I've seen in years. I consider myself able to appreciate good, thoughtful, movies... but this was utter dreck. Uninspired, lacking a coherent plot, this movie was just mediocre. The attempts to draw parallels to the current US administration, their policies, and the Iraq war were painful (department of homeland security, illegal immigrants, Iraq, etc), and felt like they were thrown in to make a point rather than add meaning to the movie. Overall plot and character development were weak, with absolutely no explanation of precipitating or tangential factors (why the infertility, what is the human project, etc). Unmoving, uncaptivating, uninspiring, unbelievable, unimaginative, unfortunate waste of $9.50."
    },
    {
      "rating": "3",
      "text": "Pathetic! Tries hard to be something it can never be, which is classy."
    },
    {
      "rating": "0",
      "text": "I recently rented this movie, and i though it was one of the worst movies i've ever seen. So much more could of been with the plot,. The director failed to keep the movie interesting, everything happened too quick and some of the scenes were pointless and kind of cheesy.\rI expected so much more from this film and whoever thinks this movie was good obviosly does not know anything about films"
    },
    {
      "rating": "2",
      "text": "This is one of the most boring and awful blockbusters with horrible acting, decorations, plot, and SFX, I've ever seen. It Definetely doesn't deserve 8 out of 10. Clive Owen plays a legal citizen in the post-apocalyptic world of NWO of the near future. He has to smuggle the last pregnant woman on Earth past the all seeing eyes of NWO spies in the city of London under marshall law."
    },
    {
      "rating": "2",
      "text": "Boring mindless chase movie. Who's side are we supposed to root for? Problem is you tend not to care. The only thing I was rooting for were the closing credits."
    },
    {
      "rating": "0",
      "text": "Obviously marketing for this movie deserves a TEN, but the actual content, the actual story, message, moral? ZERO... there IS NO MESSAGE TO THIS FILM. IT IS A CIPHER, it's just a rollercoaster with guns and violence, and the acting comes from being shot at and watching a woman have a baby... there's NO CHARACTER DEVELOPMENT. All bang, no substance, so why are people giving this film a TOP rating? I smell a HUGE RAT."
    },
    {
      "rating": "2",
      "text": "Hardly original, Children of Men"
    },
    {
      "rating": "3",
      "text": "This movie has the same feel as \"28 days later\" yet fails to bring the audience in and allow them to care what's happening to the characters. Storyline had great potential but is filled with meaningless and uninteresting dialog as well as an over-abundance of violence which adds nothing to the story or the progression of the characters themselves. A 2-hour waste of time."
    },
    {
      "rating": "2",
      "text": "A stinker...Pop a chewable Prozac before you see this one, because it's bleeping depressing. The world falls completely apart in the next 20 years?? Must be global warming's fault. Underground rebels, fascist soldiers, more chase scenes, cliche here, cliche there. So many unanswered questions that I stopped caring about anything this movie tried to convey, namely that dogs can reproduce, but humans can't (shouldn't?) :0) Maybe Part II will be Puppies of Dogs. Seriously, there are so many people giving this mediocre movie a 9 or 10 that I think maybe our world might look like this in 20 years (me? I'll be in the 'Fugee' section begging for my $9 back)."
    },
    {
      "rating": "3",
      "text": "Indeed the world HAS gone bonkers when film academics give rave reviews to this kind of trite rubbish. Children of Men's meandering plotline is in no way helped by the film's confused allegory. Clive Owen is his usual turgid self. The film's social commentary is by equal measure myopic and simplistic. Action sequences, especially the finale, smack of similarities to films such as Downfall and the Pianist, the visuals throughout the film are tiresomely familiar to anyone accustomed to other sci-fi releases such as Blade Runner, Brazil, A.I and Minority Report. To top it all off, the drama is thin, exhibiting not a single memorable character. Shame, the editing is suberb."
    },
    {
      "rating": "1",
      "text": "What a piece of crap. The set design came directly from the computer game Half Life 2. The story was so thin as to be unbelievable. The premise of a new pregnancy as meaty enough to carry an entire film is laughable. As for the so-called critics- they just use movies as a vehicle for little essays that show their own clever use of words but show no insight into the film itself. Sign me disgusted."
    },
    {
      "rating": "3",
      "text": "Could have been MUCH better than what the trailers lead us to believe. Standard chase film, nothing new or special and actually pretty tedious. I didn't give a hoot about Clive Owen's character or relationship with Julianne Moore. Michael was was especially annoying as his mentor. I found the most interesting characters to be either mute (the teen playing a futuristic video game at the breakfast table) or catatonic (Michael Caine's wife). Someone recently said, \"Why is it that all storylines (with few exceptions) that take place in the future have a distinctly black/blue/grey look to them? What futiristic despot banned technincolor?"
    },
    {
      "rating": "1",
      "text": "I read many reviews before deciding to go see this movie. Every critic said there was a \"clear message of hope\" to be found in the movie. However, I found no message of hope. The political message was so painfully blunt and forced that it made me cringe. Unfortunately, that political message is the only part of this movie with any substance. I still wish I had walked out of the theater when I first thought about it (about 30 minutes into it)."
    },
    {
      "rating": "2",
      "text": "I assume the high rating from people is more a political statement instead a true evaluation of the movie. I was very disapointed. The movie was slow and boring. The political message was beaten into us. I expected much better."
    },
    {
      "rating": "1",
      "text": "After reading all these reviews, maybe I saw the wrong movie. But it was horrible and pointless. Don't waste your time."
    },
    {
      "rating": "0",
      "text": "Reminds me of those bad 1980s doomsday scifi action flicks, only with a less interesting plot, and even more lacking in character development."
    },
    {
      "rating": "2",
      "text": "Well shot, simplistic, clumsily acted B movie."
    },
    {
      "rating": "3",
      "text": "Shot VERY Well...Which is Half the Battle BUT a VERY Bad Story Line! Very Anit-Climatic!!!"
    },
    {
      "rating": "2",
      "text": "What a waste! So much could have been made of this plot: why was she the only woman to get pregnant? How did it happen? Who's the father? Instead, it was just one long, dreary, chase."
    },
    {
      "rating": "2",
      "text": "Thoroughly depressing - not enough story, too much unintelligable dialogue, drawn out action scene where basically anyone you grow any affection for is violently eradicated (why couldn't they have got rid off the guy with the blonde dreadlocks wayyyy earlier - and him finding them in Bexhill like that? Annoyingly improbable)."
    },
    {
      "rating": "3",
      "text": "When I ready all of the reviews for this movie I could not wait to see it. The storyline looked awesome in retrospect. I was so disappointed that this turned into some kind of future concentration camp movie. I know the premise of this movie was unrealistic to being with, but I was looking for something a little more believeable..."
    },
    {
      "rating": "2",
      "text": "Liberal fear mongering. Keep your politics out of the plot and perhaps this movie would have been better. Characters were boring, the case boring, the action scenes boring. I don't mind having to think through a movie, but you can be more clever than this drivel."
    },
    {
      "rating": "3",
      "text": "The cinematography, the art direction, are interesting, the cast is good except for Miriam and Kee (not so much), but all have been put to the service of a bogus vision. What the heck is the point? Infertility is hardly a problem in the real world. Overpopulation is more of a problem. In"
    }
  ]
}