{"id": 1542, "title": "Child 44", "starring": ["Tom Hardy", "Gary Oldman"], "runtime": 137, "genre": ["Crime", "Thriller"], "description": "Set in Stalin-era Soviet Union, a disgraced MGB agent is dispatched to investigate a series of child murders -- a case that begins to connect with the very top of party leadership.", "releaseYear": "2015", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/qqGhMt31HVUN3WnH0L2r0OWq38E.jpg", "categories": {"plot": 5.934782608695652, "acting": 5.771428571428571, "ending": 5.222222222222222, "soundtrack": 3.0, "cinematography": 5.0, "familyFriendly": 3.0, "funny": 7.0, "action": 5.833333333333333}, "reviews": [{"rating": "4", "text": "I know this is a really late review as this movie came out in April, and the reason for that is that too be honest I forgot about this one until I was looking through what I've seen to review and I came across this and I thought to myself \"Oh I remember that the movie, well I should just get my thoughts out since I got nothing else to review until tomorrow\".\r The movie is not very good. Pretty disappointing, it had such a big name cast to it but they did nothing really special in the movie. I'm going to forget about this movie and so will you at the end of year so I'm not going to waste my time or your time taking about this movie as do you really care about me going into detail about a film that's not good, nobody cares about and just forgettable."}, {"rating": "5", "text": "Very poorly put together film. Great setting and acting, but the story is just completely scatter plotted. I realised I was an hour in to the film and didn't really have a clue what was going on in it... Such a shame, if it was a little bit more pragmatic it could of been excellent."}, {"rating": "3", "text": "CHILD 44 is basically an incomprehensible mess of a movie. Tom Hardy and Noomi Rapace do their best to save it but it's ultimately a sinking Russion ship of espionage hooey."}, {"rating": "4", "text": "Child 44 is directed by Daniel Espinosa (Safe House) and stars Tom Hardy, Gary Oldman, Noomi Rapace and Joel Kinnaman. The film also features famous director Ridley Scott (Alien, Gladiator) as a producer. The film is based on the novel of the same name written by Tom Robert Smith from 2008. The film revolves around Leo Demidov, a troubled military police officer who investigates several child murders around Russia during the Josef Stalin era. I was interested in Child 44 after the trailer was released. It seemed to promise a mysterious film about child murders and began to resemble Prisoners from 2013 which was one of the favorite movies of the last few years. Tom Hardy also appears to be reaching the peak of his career where has done a very good job of choosing his roles at it seems like there are no roles that he can't play. Gary Oldman and Noomi Rapace have both appeared in films with Hardy before, Oldman in The Dark Knight Rises and Tinker Tailor Solider Spy and Rapace in The Drop. The performances are almost the only reason that you would want to watch this movie. Tom Hardy does an excellent job and he does the best he can to try to keep this movie afloat and Noomi Rapace shows that she can hang with the big boys as she does very well also. Gary Oldman was the second billed actor in the film but he does not have a constant presence in this movie, his first appearance is almost an hour into the movie and even after he gets underway he only appears in spots so he and Hardy share very little screen time. Hardy and Rapace get most of the screen time and Oldman seems to take a bit of a back seat. Kinnaman even seems to have more of a presence in this film. The trailer displayed a totally different film than we got here. The serial killer component is just a sub-plot in this movie and it is really about Tom Hardy's character searching for some sort of redemption after he refuses to turn his wife (Rapace) into the authorities who believe she is a traitor. The plot gets even more clogged up when an unnecessary rivalry between Hardy and Joel Kinnaman as the two do not see eye to eye and it is obvious almost from the outset, but the rivalry just makes the movie more complicated and takes us away from the content that we are really interested in. There is nothing wrong with Kinnaman's performance here I would even say he does pretty well but there is no need for his character to have such a prominent role in this movie. Then the biggest problem with Child 44 is the pacing. This film is really never very exciting and since the plot is so stuffed the movie runs way to long and there are some extremely boring spots. I would really not recommend this film because you are really not getting what you're expecting and I must say that Child 44 may be my biggest disappointment so far this year."}, {"rating": "6", "text": "this film may not be truthful about soviet union but is not a bad movie. there are good characters played by good actors/actresses. not a perfect crime movie but OK."}, {"rating": "4", "text": "This movie was a very disappointing watch for me. The pacing didn't have me at the edge of my seat at all, there was no joy or exploration of the detective work, and the story is simply bogged down by way too many subplots. The performances, however, are very good, and Tom Hardy especially shines and stands out."}, {"rating": "4", "text": "Child 44 is well acted that's all. i'll give credit to Tom Hardy he gives a brilliant performance but it's in aid of a film that's too long with a plot that is unfocussed. there's way too much going on and none of it's fleshed out enough and i suspect it's due to many aspects of the Book not making it into the film though that is pure speculation on my part as i haven't read the book. it's well shot and most of the amazing cast are trying there hardest but they can't make up for the script issues and I came out of this film feeling nothing and that will make the film ultimately forgettable"}, {"rating": "10", "text": "What a refreshment in the age of blockbusters and animated movies....yes, for this movie one should be older than 13 and should be concentrated a lil' longer than usual 5 seconds...Tom Hardy is excellent while Naomi is a perfect choice for the role of Raisa....a must see !"}, {"rating": "8", "text": "I didn't expect much from this movie, but as an American movie about the UdSSR it was pretty good. The story, the characters and the dialogs are all right. In the end the movie became a little bit to long, but overall it was a nice experience. The action scenes are caught well and at all stages of the movie you have the feeling, that the actions of the actors actually do make sense. I enjoyed this movie, it is told pretty slowly but finds the right pace to be quite thrilling."}, {"rating": "3", "text": "Despite a good performance from Tom Hardy this is a confused and unconvincing drama based on a popular novel by Tom Rob Smith. Juggling with rather too many story strands it fails to maintain focus and the end result is a sprawling mess. The premise promises much dealing as it does with the search for a child serial killer (based on true facts) circa 1954 in Russia, but anyone expecting a movie in the vein of Zodiac or Seven will be really disappointed as this aspect of the film is given short shrift. More time is spent dealing with the power play between MGB officers bent on keeping its citizens under control at all costs. The film has a few standout scenes most of which involve murder or violence and the final confrontation with the child killer is effective at first instance, but is disappointingly played out. Technically the film is just so so. The cinematography is dark and dingy and the music adds little to the mood. The ending is predictable if quite moving, but such calculated manipulation is in no way a reason to forgive or forget the struggle one has endured in the preceding two hours."}, {"rating": "9", "text": "I don’t understand why this film got such mediocre reviews. It is beautifully made (ok, it’s a tad long) with wonderful performances from everyone. I was not bored (and I am easily bored), and all this talk about the critics not being able to understand the accents is absurd. Are they playing their earbuds too loud? Or maybe you have to have lived through the years before the Berlin Wall fell (or didn’t sleep through modern history class in college) to understand the Russian society that is faithfully portrayed. It is so sad when such a beautifully made film is so little appreciated."}, {"rating": "5", "text": "I am very disappointed to say that Child 44 isn’t the movie I was expecting going into. Tom Hardy is absolutely fantastic leading the movie and Gary Oldman has a few great moments sprinkled in there. After a nearly flawless first act to the movie, the second act starts to turn the story nearly tedious and it is a thriller that lacks many thrills."}, {"rating": "4", "text": "Rhetorical Child, history; concepts of history put together with a poor chosen story line. To begin, the story arc is not really viewed, it is nothing but unstable with the vision of the director. Secondly, if they are going to depict a Soviet era placed film then they should have put more depth into the layering of the scenery as well as the characters. There are countless errors and with that the presentation approaches throughout the movie. The director Daniel Espinosa seems to have average rated movies, which is irrelevant since it is just the opinions of everyone other than the visionary. We shall never see the true form what this manifestation could have become. Now we enter this movie, what is this movie? Is this movie good or bad?\rThis movie is exactly what it is, it is a movie. If you want to kill a time hours of your time instead of sitting around doing something else, you could watch this."}, {"rating": "6", "text": "Although it's set in the paranoid nightmare of 50's Russia, this is basically a murder mystery. Tom Hardy plays a secret police agent who sets out to track down a serial killer, but since \"there is no murder in paradise, he encounters barriers from the political regime. It obviously adapted from a novel, because there's a sprawl and scope to the story that veers away from the primary plot. Sometimes these detours confuse matters and muddy the focus. At other times, the convenient coincidences strain believability. While the creation of the era's mistrustful denouncements and grim conditions is captivating, the rambling narrative dilutes the dramatic power."}, {"rating": "9", "text": "Child 44 is brutal, refreshing and nail biting entertainment, that does justice to the book. Tom Hardy gives a solid perfromance as Leo Demidov and Gary Oldman was great in his place as well. Daniel Espinosa, known for Ryan Reynolds's spy thriller- Safe House, brings his creative mindset along with the ride. It is long though, and yawns could be heard in the last 30 minutes of the film in the theatre, but it is beautifuly crafted and made. This is one of the best cold war flicks, and captures the human nature of revenge and drama quite well. Child 44 should have a definate spot on your week's list of things to watch."}, {"rating": "7", "text": "Yes the story is a bit flawed, but the ride is enjoyable. The most annoying thing is the made-up Russian accent that doesn't work, but the performances are strong and overall it's not a bad movie."}, {"rating": "0", "text": "I have never seen more lying movie about soviet era than this ! Stalin here described as an cruel tyrant. Yes, there was The great purge, but it was against the party leaders and general. Ordinary people mostly feel safety at Stalin's time, particularly in economy's course"}, {"rating": "8", "text": "Child 44 has an intriguing plot and takes place in such an interesting era in soviet history. The film's not very straight forward because they really set it up, the era, the back stories, the relationship between the characters are all set up before they hit the ground running with the selling point of story. So you sort of know your characters - who they are, how they see themselves, and how other people see them - when you get in the thick of it.\r The set up in Child 44 makes for a lot of tense relationships and subplots in the film that only adds to the realistic feel of the situation. The sheer fear, paranoia, and despair is palpable. The cast did a great job as to giving us an insight of what’s going on in these character’s heads. There is a lot more going on than just the investigation, Agent Leo Demidov (Tom Hardy) has all these hurdles that he has to overcome to reach his goal, to potentially catch this serial killer.\r As interesting as the investigation is, the relationship between the characters is as captivating, but Raissa (Noomi Rapace) and Leo’s is quite the unconventional love story. A great attention to details was put in the film but I gotta say, the contacts on some of the actors looked cheap as hell and sort of threw me off whenever I looked at them. And as good as I think the movie is, there is no doubt in my mind that the book is infinitely better because the film lacks a certain finesse that experiencing a book has.\r Child 44 is a dark thriller with an intriguing and riveting plot with great dramatic tension. @wornoutspines"}, {"rating": "0", "text": "Rather than adequately show the negative features of the Stalinist regime (his true nature), this film shows us the primitive and delusional set of propaganda cliches, which many directors in Hollywood would have refused to use even during the Cold War. The plot is so crazy and uninteresting that even such actors like Gary Oldman and Vincent Cassel can not save this film."}, {"rating": "8", "text": "This film is another example of why I ignore critic scores and make my own mind up about the films I go to see.\r I think the critics must have been watching a different film to me, it was very well acted, has great cinematography, is an interesting story and gives you a dramatised insight into how life might have been in Russia after WW2. I thought the first 10 minutes weren't a very good introduction to the plot and it did slow in places, and was particularly brutal in a few scenes, but was very watchable, interesting, and definately worth seeing."}, {"rating": "8", "text": "The story is confused if you haven't read the book yet. Because the story is complicated and at the same time so well composed. But if you have read the book actually it's one of the best adapted film versions of a book. Well acted, all important parts of the book are in the film, and even the relation between the protagonist (Demidov) and his wife is well done in between the stories."}, {"rating": "4", "text": "Tom Rob Smith's best selling novel should have made thrilling cinema, but this tale of a Russian secret police officer hunting a child killer in 1953 suffers from being overly complicated, over long and too pompous for its own good. Having a selection of great British actors using varying Russian accents is also very off-putting, but what is most unforgivable is that a best selling thriller has become a very boring movie"}, {"rating": "7", "text": "The few good ones on a wintry harsh time.\r Child 44 is a crime investigation with the backdrop of treason and espionage in post-World War II Russia. It's a bizarre take on detective flick and leaning more towards social commentary and the psychological repercussion of the time. It may be a bit slow as subplots are overlapping, but the great acting from the leading actors present an engaging spectacle.\r Leo Demidova (Tom Hardy) is an upstanding officer of Russia. During the cold era of Stalin, he presides over many investigations to uproot treachery. His life and carrier would change drastically as a serial child killer emerges. He's soon demoted for chasing the truth, and with only his estranged wife Raisa (Noomi Rapace) at his side, he adamantly pursues the killer.\r This is a complex setting for crime thriller, and it still works mostly due to the actors' capable performance. Tom Hardy and Noomi Rapace are both splendid on creating the human drama, audience would root for his character who is idealistic almost to a fault and in expense of personal relationship. Tom Hardy looks believable as an officer, more importantly a man, trying to do right despite the oppressive nature he must deal with.\r Noomi Rapace looks confident as a survivor, she wears a tough front and confidently strong yet has a fragile side as well. These two are not the usual spouse as their issues are pretty dysfunctional and sadly deep-rooted, occasionally they might even resemble partners than husband and wife. Gary Oldman is versatile and certainly impressive here, he pulls off the magnetic general in stoic manner, yet still seemingly combative at times.\r The narrative covers a great deal of subjects. This in turn creates a longer runtime as well as more subplots. Granted, it may be too slow for some audience. Its mix on the crime and social aspects take time to bear fruit. It is rewarding in the end, although the first half might feel plodding and not every angles work. The action could be better too, since the camera shakes violently in a few of the action sequences.\r This is a different kind of thriller, it traverses through not only one but many touchy subjects. However, the acting prowess and adequate material present a fascinating look on the time and the cruelty it harbors."}, {"rating": "5", "text": "A war hero who turned a police officer struggles with his departmental feud.\r It is a strange title. In the narration as well it does not properly reveals, more like an approximate count of something. It is a Russian story, I mean the Russian characters and the locations. It begins after the world war two, in Moscow, a top police officer caught between the departmental politics and a case. After the his investigation ended without a result, the sacked officer gets a lifeline to begin again life in another town. But the trouble follows him when he started to investigate the children's deaths. The result of the case brings the end to the tale with a tiny small twist.\r The actors were decent, not very impressive. Especially I understand since it was internationally produced, they preferred English language, but I would have liked it in the original language to get best appeal. It was too long film, the first half was very boring. Because it was most unrelated to what comes in the later part of the film. When the narration shifts its base out of the Moscow, that's where it really gets very interesting. So after first 60 minutes, the real story begins.\r This where the actors got better. Noomi Rapace and Tom Hardy, both were like the kicked off with full of energy. So the second half of the film makes it watchable. Directed by a 'Easy Money' filmmaker who also brought in his Swedish actors to play the smaller roles. It was not good as I expected, but ended well. I don't think it is worth a watch, but who knows what you like. So I neither recommend nor reject it. But it was an average film to me.\r 5/10"}, {"rating": "6", "text": "Pretty underrated film with two of the best working actors we have today: Tom Hardy and Noomi Rapace. It´s also a nice change seeing a story unfold in Russia and not the usual States or West Europe. The film is not a masterpiece of any kind but develops the characters enough to make you care, and the story despite taking weird turns is still enjoyable the whole time."}, {"rating": "5", "text": "There is one thing for sure - the acting was superb! Even the kids in this movie were acting like pros! The movie itself was intense but had flaws and i don't know if you'll like it or not!"}, {"rating": "5", "text": "The film benefits when it focuses on the child murders instead of rapidly introducing and resolving new characters and subplots without allowing them to develop. Tom Hardy is fantastic, and so is the Soviet-era setting. The plot, which was so much better conceived in the novel, falls short in this adaptation."}, {"rating": "8", "text": "In my opinion it was a really good movie and it did show quite good many parts of how it was in USSR around the war time. Of course, maybe in reality they would not get such a happy ending and also some things were a bit different, but I still think this movie had a good story in it"}, {"rating": "7", "text": "It sure was a long movie but i wasn't bored at all cause i think there was just enough time for the characters to develop , so i felt really close to them and i shared their feelings, especially tom hardys.He gave an exceptional performance . Even if i liked it overall, in the end something was  missing about the plot and left me with unanswered questions. Maybe it is not a very well adapted book into the big screen."}, {"rating": "9", "text": "A dark thriller that would let you get off your seat when watching.\r Watch the film here http://www.watchfree.to/watch-2a3622-Child-44-movie-online-free-putlocker.html"}, {"rating": "8", "text": "We see Tom Hardy during WW2, he's a hero, a leader.  He just wants to do the right thing.  And yet, post-war, he's caught up in a world of the absurd, whatever Joseph Stalin says \"there is no murder in (worker's) paradise\" everyone obeys.  So when his best bud from the war says his son was murdered, what can he do?  He's a policeman and wants to solve the murder but is ordered to obey.  Some other reviewers find this off putting; guess they don't believe this is how it is under a dictator.  My wife left China when she was 40 so I asked her if that is what it was like under Chairman Mao.  She said yes.  Must be hard for Americans to relate to living like that.  As such, I thought the movie was great depicting his struggle using guile and cunning to catch the killer without getting caught by his own \"secret\" police."}, {"rating": "6", "text": "Starts as a Political Thriller. 2nd act as: Horror Thriller. 3rd Act: Hollywood happy ending Action Thriller?Yeap. Its THAT WEIRD.But even if that \"makes it bad\" by definition, all the scenes and segments and sequences are well done, in my opinion. Some better than others, of course.Maybe I just like Tom Hardy that much, but I though it was a good movie, overall, if you can forgive the fact that it jumps from genre to genre (quite clearly, actually). I can do that, do you?"}, {"rating": "4", "text": "Once again I declare myself a follower of the genre but here it is not exploited properly due to the political inference of its plot and also the time in which the events ocurr, so it is not very clear what the purpose of its plot is, if it is a thriller about a murderer or a kind of old-fashioned and antiquated criticism of the Soviet Union, which is more than obvious today no longer exists.Otherwise, the film is not merely a disposable work, there are several elements that rescue it and it is mainly the work of its cast."}, {"rating": "10", "text": "Пока кремлёвские пропагандоны снимют дичь для скрепоносных имбицилов, американцы снимают отличные фильмы про сралинский режим."}], "recommendations": ["the_accountant", "beirut", "donnie_brasco", "the_experiment", "valkyrie", "the_devil_all_the_time", "the_girl_with_the_dragon_tattoo", "stillwater", "prisoners", "knives_out", "the_good_shepherd", "argo", "allied", "predestination", "white_boy_rick", "morgan", "zodiac", "the_little_things", "widows", "a_most_wanted_man", "odd_thomas", "what_happened_to_monday", "arbitrage", "hereafter", "closed_circuit"]}