{
  "id": 2509,
  "title": "CHiPS",
  "starring": [
    "Michael Peña",
    "Dax Shepard"
  ],
  "runtime": 100,
  "genre": [
    "Action",
    "Comedy",
    "Crime"
  ],
  "description": "The adventures of two California Highway Patrol motorcycle officers as they make their rounds on the freeways of Los Angeles.",
  "releaseYear": "2017",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/mIHA8Xf6WmxbS83ia4vQ5ojvxV8.jpg",
  "categories": {
    "plot": 5.111111111111111,
    "acting": 5.555555555555555,
    "ending": 7.25,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 5.521739130434782,
    "action": 6.333333333333333
  },
  "reviews": [
    {
      "rating": "0",
      "text": "Not really related to the old tv show except in name just as Mission Impossible films have nothing to do with the original shows.Stupid and unfunny. CHIPS the tv show wasn't a dumb  lewd jokefest. I'm sure there are people out there who like this kind of idiocy though."
    },
    {
      "rating": "3",
      "text": "Whatever CHiPs is, it fails to be a lovable adaption based on a TV show from back in 1977. Fans waited years (especially 24 years of pain and impatience) for this to happen, but all they could just react is that they should be hoping for another adaption any time soon."
    },
    {
      "rating": "9",
      "text": "I was having a bad day and this movie made me feel better! Stop over thinking things guys. This was a fun movie. Great action, good laughs. It doesnt take itself too seriously and no one else should either. Just enjoy it...the world is serious enough as it is!"
    },
    {
      "rating": "3",
      "text": "Failing miserably at capturing the funny atmosphere and style of the original show, CHiPs' wildly inappropriate gags and hilariously stupid plot-points don't provide any laughable humor whatsoever."
    },
    {
      "rating": "3",
      "text": "It's lazy, it's cookie-cutter and I'm the farthest thing from a SJW but so many of the jokes are pointlessly homophobic and sexist. Dax Shepard is funny in supporting roles but his directorial efforts (this, \"Hit and Run\" and \"Brothers Justice\") are all awful films. Skip this. There are way better comedies, cop films, buddy flicks..."
    },
    {
      "rating": "7",
      "text": "Comedian Dax Shepard has been acting onscreen for years without making it big. He is perhaps best known as Kristen Bell’s husband and being part of the main cast in drama series „Parenthood“ which doesn’t actually say a whole lot either. But he is one of those actors who is willing to write, produce and even direct his own stuff if satisfying offers don’t come his way. And „CHIPS“ must be one of these pet projects, because he fills all four jobs mentioned above, sharing the screen with co-star Michael Peña. There are actually bunch of other cool faces around in smaller roles, including – of course – Kristen Bell. But it’s mostly about Shepard and Peña offering a buddy action comedy, so if you feel like you could like them, it’s half a win for the movie already. (Sadly, there’s smaller number of famous friends on screen than in Shepard’s previous projects, 2010’s „Brother’s Justice“ and 2012’s „Hit and Run“. I guess Bradley Cooper and Tom Arnold felt that they have done enough for him and let him sink or swim alone now.)Shepard is convincing in the sensitive/wise doofus role that he has chosen to himself, although his acting range seems limited in general. So he has surrounded himself with some rock solid players, starting with Peña who has the coveted ability to make every movie a bit more better just by appearing there. In this regard, he’s like a young-ish Latin version of Morgan Freeman, or something. What is more important here: Peña can effortlessly do action, drama and comedy and there’s need for all three here, Shepard couldn’t hold the fort alone. And speaking of solid, we also have Vincent D’Onofrio who is every inch as imposing and magnetic as we have come to expect from this veteran thespian.Based on the classic TV series of the same name (1977-83), it’s about the adventures of two California Highway Patrol cops. But it’s not the eighties anymore, so we get currently widespread type of raunchy mainstream comedy with some action. If you want to measure the general style of the story and also the nastiness of the dialogue, you should check out the Red Band trailer, for example. It is not able to effectively share the quite enjoyable buddy comedy vibe „CHIPS“ has during most of its running time, but you do get an idea if you would like to see some more of it.The result is probably most enjoyable for the little teenage boy in all of us, with plenty of cursing, light violence and sex- or body-related jokes. If you can’t catch their wave, you will probably be a little tired when the end comes. I actually enjoyed most of this raunchy silliness although I felt that the ending felt a bit rushed and half-hearted.It’s easy to imagine that the success of „21 Jump Street“ movies made pitching the project and gathering the money for „CHIPS“ easier for Shepard & Co. The projects are quite similar: old and loved TV series turned into modern American comedy, two likable guys in the middle of it all, verbally sparring, punching and shooting their way to glory."
    },
    {
      "rating": "0",
      "text": "I think Dax Shepard may be my least favorite person in Hollywood today.  His movies are offensive not for laughter but just because. I would rather rewatch that Dukes of Hazard filth.  This movie is atrocious. F"
    },
    {
      "rating": "2",
      "text": "A Dull, pompous, uninspiring and unfunny by every stretch of the imagination. Written, directed and starring Dax Shepard, this potential star-making vehicle only shows Shepard's ineptitude to make a competent comedy nonetheless star in one."
    },
    {
      "rating": "2",
      "text": "They just didnt write any jokes, the script is boring. Weird that someone financed this project.    Shepard & Pena are better as side actors than main"
    },
    {
      "rating": "9",
      "text": "Much better movie than the ratings suggest. It's definitely a formula buddy-cop movie, lots of action and crude jokes for sure, but I thought it was pretty funny and the cast had a lot of chemistry. Honestly, if this had been completely true to the family-friendly original series, it would've been boring. I think most of the negativity is related to the sex jokes, some being homophobic and some just being pervy-gross, but at the end of the day it's a funny \"bros before hos\" type of buddy movie and this is 2017 not 1977."
    },
    {
      "rating": "0",
      "text": "It is not surprise that CHiPs bombed. People are getting tired of turning every old show into a parody. Fans like me are offended and new audiences don't care. It is about time that Hollywood would finally wake up and create something new cause we will not pay to see this crap anymore."
    },
    {
      "rating": "2",
      "text": "Actor Dax Shepard can take most of the credit for this wretched remake…he also wrote and directed it. He and Michael Peña play the cop duo who follow a hackneyed scheme about internal corruption. The typically trite mismatched coupling suffers from dumb exchanges, especially lots of sex-related banter (guess he's trying to push the shock factor…another common trait to current R-rated comedies). The plot and characters are often confusing, not sure who's on which side and what's even happening. The only good thing about the whole mess is that the pace is snappy and the running time is only 100 minutes."
    },
    {
      "rating": "5",
      "text": "Dax Shepard tries to do for ChiPS what Phil Lord and Christopher Miller did for 21 Jump Street by turning the late '70s, early '80s TV show into a raunchy R-rated comedy. While a better effort than the Dwayne \"The Rock\" Johnson led Baywatch, I'm disappointed to say that it didn't succeed. On top of being woefully generic, the movie has a pretty big flaw that stems from Shepard and Peña not having much chemistry. Their individual scenes are fine, but when they are together the laughs aren't as frequent thanks to their banal conversations and irritating bickering. Their eventual acceptance of each other as partners and blossoming friendship feels forced. This makes for a buddy cop flick where you don't want the leads to be buddies.Shepard also tries way too hard to mine laughs from the character's bizarre and decidedly unfunny personality traits. I failed to find anything funny about Poncho's sexual addiction or Baker's tendency to get nauseous in other people's houses. I did get the some laughs from the dialog every now and then or the occasional physical gag. The action and chase scenes are also well done, if a little too heavy on the explosions. It's also the first R-rated comedy I've seen in quite some time that put boobs onscreen as opposed to dicks. Something that will give it some teenager appeal. Ultimately though, it's another example of why people should stop trying to cop Miller and Lord. It not only fails to do the original show justice, but the material isn't strong enough to allow it to stand out as a successful comedy in it's own right.5.8/10"
    },
    {
      "rating": "2",
      "text": "The highlight was Erik Estrada's cameo.  That should tell you everything you need to know about the movie."
    },
    {
      "rating": "6",
      "text": "A tale of two motorcycle cops!I haven't seen the 70s series from where this film got inspired by. But before that, I had in my mind that it could be a remake of 'Electra Glide in Blue'. Anyway, it was directed and starred in one of the main roles by Dax Shepard. His direction job is not going anywhere. Though all his so far attempts are appreciable. In this film, it was Michael Pena, who led the rest of the characters. He'd done similar roles in other films like 'End of Watch'. But literally, he ruled it by sidelining everybody else in the film, including Dax.Two motorcycle highway patrol cops team up. They are not an ideal match for the job, but they are assigned in that way by their superior. One of them was an ex-motorcycle stuntman and the other one who had lost his partner recently. They begin to investigate a highway robbery that leads them in the right direction. But can they handle those gangmen who have overpowered them in many ways is what brings twist, before ending with a big action sequence.A stylish cop flick and a quality presentation, but messed up by its screenplay. The story had a purpose, but the film scenes looked not arranged properly in order. There are many unnecessary scenes, just to bring some comedies. Yeah, some of them were really fun, but the film overwhelmed by bad jokes and random action sequences. The actors were good, though it was only the lead two who were the bright spot in the narration. If you forget all the logics, you could enjoy it. It serves a decent entertainment. Yet when it comes to rating, it won't deserve any big number.6/10"
    },
    {
      "rating": "7",
      "text": "Call me crazy, but I actually enjoyed this film. If you go into it for what it is, an action-comedy written by Dax Shepard, you may enjoy it too. Entertaining and likable leads and a sometimes funny script. Also, a clear love of moto riding and speed in this film, which I appreciate. Hope this guy makes more movies."
    },
    {
      "rating": "5",
      "text": "The charismatic cast do their best within the limited screenplay which seems to be geared towards comedy. Overall the action beats kept me watching. Overall the direction and production value was good but the plot felt undercooked and despite the great cast, failed to cash in on the potential for drama within the action."
    },
    {
      "rating": "2",
      "text": "This movie is only fun if you plan on doing a drinking game with it. As a movie, it has no purpose and makes no sense. Acting is pitiful and I can't find any comedy sober."
    },
    {
      "rating": "5",
      "text": "Is it a great film? Nah, but I definitely had more fun than I expected. What helped was that there were multiple bike chases which were pretty nice to break up the action. The plot is pretty predictable but as a sunday afternoon movie to watch with your buddies it's got a nice mix of action, chases and the good kind of terrible jokes."
    },
    {
      "rating": "7",
      "text": "Not trying to win an Oscar.  Just a fun, buddy cop movie made for humor.  Just enjoy the escapism."
    },
    {
      "rating": "10",
      "text": "very funny...............!!!!!!!!!!!!!!!!!!!!!!!!$$$$$$$$$$$$$$$$$!!!!!!!!!!!!#############!!!!"
    },
    {
      "rating": "10",
      "text": "Funny and lighthearted. I had a lot of laugh out loud moments. The jokes won’t be for everyone. Dax and Michael have amazing chemistry."
    }
  ]
}