{"id": 4397, "title": "Chocolat", "starring": ["Juliette Binoche", "Alfred Molina"], "runtime": 121, "genre": ["Comedy", "Drama", "Romance"], "description": "A mother and daughter move to a small French town where they open a chocolate shop. The town, religious and morally strict, is against them, as they represent free-thinking and indulgence. When a group of Boat Gypsies float down the river, the prejudice of the Mayor leads to a crisis.", "releaseYear": "2000", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/jPNmQq23eNbKFVPZnY5Kxc63MvW.jpg", "categories": {"plot": 7.214285714285714, "acting": 6.857142857142857, "ending": 6.0, "soundtrack": 8.0, "cinematography": 9.0, "familyFriendly": 6.0, "funny": 8.333333333333334, "action": 8.0}, "reviews": [{"rating": "10", "text": "Fantastic movie. Absolutely fantastic. But, have to agree, it's not for all, as some say that it's an acquired, has a bitter kick, or is a little vapid. The film uses these characteristics as tools, and, when allowed, is a marvelous, beautiful, and mesmerizing in its plot, acting, and setting. Love it."}, {"rating": "8", "text": "Much like the chilli flavoured chocolate of the film, this effort from director Lasse Hallström is an acquired taste, not everyone will appreciate it.\rSet in a small village in 1950's France, Chocolat tells the story of Vianne Rocher, played by the impressive Juliette Binoche, who was \"blown in\" to this small village along with her small daughter Anouk. Everybody does what is expected of them in this place, which in this instance is going to church and being greeted at the threshold by the fluid charm of Alfred Molina\"s Comte de Reynaud, who maintains the routine and predictability of the residents. When the new visitors decide to open a Chocolaterie entitled \"La Chocolaterie Maya\" much to the dismay of Molina. Not quite as sinister as we would later see him in Ron Howards \"Da Vinci Code\" but certainly a man with a saddled heart who normally gets what he wants.\rWhat ensues can only be described as Mary Poppins and Willy Wonka's lovechild, as Rocher has the charm and sophistication of Poppins but the unpredictable whims of Wonka. Was this an independant attempt at showing real life heroes? Who knows, but the almost supernatural persona of Rocher certainly leaves us to ponder what exactly she intends to do in this not so special French town.. there is the familiar tale of the village people being transformed from tradition by a mysterious outsider, but an uplifting and throughly enjoyable one that.   One cannot review this film without mentioning the roles of Judi Dench and Johnny Depp in support, Dench playing a miserable and pessimistic landlady and Depp a charming, Irish (yes, Irish) \"river rat\". For their limited screen time, they create magical scenes that only stars of their caliber can muster.   So were the Oscar nominations necessary? Yes, this films plays on emotions that people only feel in the simplest of occurrences, for instance, eating chocolate, and must films strike the chords of millions through violence or what not? Chocolat proves that light hearted humour and simple happy gestures can create a heartfelt film with an excellent cast and a beautiful landscape. Much like how the film plays out, eat up this delight of a film and don't regret it, don't think for once that the temptation is too much, it never is."}, {"rating": "7", "text": "Sweet, sentimental, and easy to digest, Chocolat is a thoroughly charming film with a fantastic starring performance from Juliette Binoche. Though the film's villain can be a little much at times and thoroughly over-the-top, the film's mythical and whimsical foundation allows me to write this off. While the film does not present much in terms of uniqueness or challenge to viewers, Chocolat is a thoroughly pleasant experiences that is good, but not my favorite. That said, the acting really does elevate it as Binoche does quite well and Johnny Deep turns in a typical young Johnny Depp charismatic role. Overall, Chocolat is sweet and sentimental, but may prove a little rich to those expecting something more grounded in realism."}, {"rating": "7", "text": "Bom"}, {"rating": "2", "text": "The only effect that this movie has on me is that it makes me hungry... No action, no nothing just Chocolat but a sour Chocolat.........................."}, {"rating": "7", "text": "While a little corny and a little dated, I found myself enjoying Chocolat quite a bit! The strong performances from the ensemble cast, a really clever script, and an unwavering directorial vision from Lasse Halstrom really make this film an enjoyable watch. It's sentimental, thought-provoking, and endlessly charming.The themes of Chocolat are actually surprisingly deep. The themes about being an outsider and how the word of God is interpreted by man really resonated with me. The way chocolate is presented is also incredibly fascinating and aesthetically pleasing!A lot of Chocolat, however, tends to drag a lot. The soundtrack is also incredibly uninspired and lackluster. It sometimes leans into the sentimentality a little too much, which tends to slow the action down even more. However, I definitely do not regret watching this movie at all, and I will most likely watch it again!"}, {"rating": "10", "text": "It is a magic movie. It is well done and the story in interesting, original and make you continue to watch. It is a movie not in Hollywood style, but magical and much recommended."}, {"rating": "6", "text": "This film is a kind of modern tale and speaks essentially of the right to be different and of the injustice we can commit when judging a person we do not know simply because it is different from us. The story, set in a small French conservative village in the sixties, shows the difficulties a woman feels in integrating and thriving a factory of handmade chocolates. The problem is that this woman does not fit into that society, outdated by nature and led by a deeply backward aristocrat, clinging to the ancient privileges of her lineage. She is modern, single mom and her sweet ones have the ability to awaken the most secret desires of those who eat them. It gets worse later, with the arrival of a group of gypsies, which the village initially faces as dangerous rioters. For those who are inattentive, the film may seem like a harsh criticism of the Catholic Church and conservatism, but it is not. It uses religion as a vehicle for criticizing hypocrisy, those people who speak one thing and act in a totally opposite way for convenience, shyness or fear of criticism.The film has excellent scenarios and everything fits very well in context and historical time. The connection between Vianne and the ancient Amerindian people seems a bit forced but ends up being digestible with the unfolding of the film. The actors generally did a great job, but there are three that deserve a special mention, on merit: Juliette Binoche, who plays Vianne in a very pleasant and convincing way, Alfred Molina, in the role of the ultra-conservative Count and Judi Dench, who gave life to the eccentric Armande. The film also features Johnny Depp as the gypsy boss, but he is clearly lefting in this film. His character does not fit well and he lacks chemistry with the cast, particularly Binoche. It was a mistake to conceive his character the way it was conceived."}, {"rating": "10", "text": "A movie as delicious as its namesake - I want to eat it up over and over again.  The message is also one with which I couldn't agree more: give in to temptation - there's no such thing as sin.  In moderation, of course."}, {"rating": "4", "text": "This movie does not deserve a Best Picture nomination. One of Lasse Hallstrom's weaker directing efforts. Why does everyone supposedly love this? Oh yeah. Because Miramax is telling them that they do."}, {"rating": "4", "text": "A lovable film about chocolate and attraction however it lacks to go into depths of how hard the Comte guy wil actually go for this to stop. It shows us lovable characters like Armande(Judi Dench) and Vianne(Juliette Binoche). Alfred Molina did extremely well for his character even though he didn't take charge and put this \"sin\" to a stop. Sweet-Hearted film but nothing more and nothing less."}, {"rating": "9", "text": "There were a few reasons why I wanted to see Chocolat. I am all for sweet, heart-warming stories and I love Johnny Depp and Judi Dench. Upon viewing, Chocolat doesn't disappoint. The pacing sags slightly in the middle, but Chocolat is overall delightful and quite simply for me a delicious experience. The production values are exquisite- the cinematography is lovely, the scenery is breathtaking and the costumes are gorgeous. The music is also lovingly lyrical, and the script is both funny and touching and thankfully manages not to become too mushy or treacly. And the story is very heart-warming and compelling, with crisp direction from Lasse Hallstrom. Chocolat does also have a fine cast, Juliette Binoche is typically fine and Johnny Depp looking so handsome by the way is charming. Alfred Molina is great too, and while Judi Dench was very good I personally think her performances for Notes on a Scandal, Iris and Mrs Brown were better. In conclusion, excellent film. 9/10 Bethany Cox"}, {"rating": "9", "text": "What a great film. It was light and mysterious and warming. It does what a movie like this should do, wrap you up in entertainment on a ill-weathered day. Drinking hot cocoa is a must!"}, {"rating": "5", "text": "Meio entediante, Mas também eu espera bastante de um filme com nome de chocolate,só assisti por causa de Johnny Depp,os filmes de Lasse Hallström são centrado em situações comuns do cotidiano e da convivência humana mas o filme não tem um foco, é chato sem acrescentar nada pro gênero"}, {"rating": "8", "text": "Chocolat is a gooey religious morality piece set in the beautiful French countryside. It's theme shine bright, and at times the movie can be an allegory for indulgence and human decency. It may get too soft for it's own good at times, but the movie knows when to pick itself back up."}, {"rating": "9", "text": "Chocolat is charming, enchanted fable with a wonderful perfomance gived by the Academy-Award winning french actress from The English Patient, Juliette Binoche; Chocolat is a touching masterpiece by the swedish film director Lasse Hallstrom. A great cast, a great work, a great film! Chocolat is full of love and charm!"}, {"rating": "8", "text": "well you have never had it, then..ChocolatThe origin of the bonding between the consumer and a businessman is depicted with practicality and addition to that is kept alive with genuine chemistry that is visible among these pragmatic characters. A smart adaptation by Robert Jacob Nelson allows enough range and room to each individual characters that values the stake and tension among them. Lasse Hallstrom has done a great work on executing this eerie world as anticipated by the writer. And on performance level, Juliette Benoit carries it off all on her shoulder with a great supporting cast like Johnny Depp, Judi Dench, Carrie Ann Moss and Alfred Molina. Chocolat takes its time on setting the stage but still feels like of appropriate pace that communicates with the audience through stellar performance."}, {"rating": "7", "text": "It tastes so familiar, it's rough around the edges and it's stuffed with sugar rather than being coated with it. That said, its pure dark chocolate coating and vintage cover made it an irresistible treat.Seriously though, I thought this is going to be an overly-sentimental romance film but it turned out to be a heart-warming, whimsical and charming fairy-tale like story that has something of Oscar Wilde about it. And on top of that, Juliette Binoche delivered a fantastic performance here.(7/10)"}, {"rating": "6", "text": "A quaint movie that at times does slip into the corny and sickly sweet. Okay."}], "recommendations": ["belfast", "finding_neverland", "the_electrical_life_of_louis_wain", "carol", "the_best_exotic_marigold_hotel", "american_beauty", "legends_of_the_fall", "while_you_were_sleeping", "thoroughbreds", "spencer", "phantom_thread", "eddie_the_eagle", "20th_century_women", "the_grand_budapest_hotel", "youth", "the_favourite", "paddington_2", "notting_hill", "anna_karenina", "dances_with_wolves", "a_star_is_born", "the_danish_girl", "scent_of_a_woman", "casablanca", "the_devil_wears_prada"]}