{"id": 3283, "title": "Christopher Robin", "starring": ["Ewan McGregor", "Hayley Atwell"], "runtime": 104, "genre": ["Adventure", "Comedy", "Family", "Fantasy"], "description": "Christopher Robin, the boy who had countless adventures in the Hundred Acre Wood, has grown up and lost his way. Now it’s up to his spirited and loveable stuffed animals, Winnie The Pooh, Tigger, Piglet, and the rest of the gang, to rekindle their friendship and remind him of endless days of childlike wonder and make-believe, when doing nothing was the very best something.", "releaseYear": "2018", "mpaaRating": "PG", "imageUrl": "https://image.tmdb.org/t/p/w500/i6Ytex4d3CdfIKJFxB5v5vh24vb.jpg", "categories": {"plot": 7.2592592592592595, "acting": 7.4186046511627906, "ending": 8.0, "soundtrack": 8.0, "cinematography": 7.0, "familyFriendly": 6.0, "funny": 8.0, "action": 7.0}, "reviews": [{"rating": "10", "text": "loved the movie one of ewan https://www.imdb.com/list/ls024772241/ best movies a laugh we all had a good time love this movie"}, {"rating": "10", "text": "A truly magical charming story for both old and young audience members. Christopher Robins bring back all the fun, charm, and nostalgia we've grown up remembering from the Disney classics and adds a modern day touch of life lessons and the importance of family and childhood. This movie is truly a wonderful adventure and story back through your childhood once again."}, {"rating": "8", "text": "\"Finding Neverland\" director Marc Forster returns to the realm of families and fantasy with \"Christopher Robin,\" a Disney/Winnie The Pooh adventure that's about as delightful, honest, and earnest as the silly old bear at the center of it all. It might not gallop as fast or soar as high as I'm sure the younger kids would prefer, but for those kids that grew up with Pooh who now find themselves in the very Christopher-Robin-esque doldrums of adulthood, it doesn't take much to be catapulted back to those magical memories of the Hundred Acre Wood. This is a refreshingly post-modern take on something so dear to us all, yet it's also a post-modern take that -- thankfully -- features none of the trademark moodiness of post-modernism. It's fun, funny, and fantastically realized, featuring a splendid showcase of the talents of both Jim Cummings and Ewan McGregor."}, {"rating": "10", "text": "A beautiful movie. As a child I used to watch the old shows and tv series all the time. With my own children we have read the stories, watched the series and movies, and now this entry has coming along and touched me more than I expected it to. I took my kids to see it, and while they didn't fully understand every single element of the movie, they absolutely loved it all the way from the 4 year old to the 14 year old. My oldest daughter and I have been quoting lines from the movie at each other for days and frequently laughing over things the characters did.Be prepared for Eeyore to absolutely steal the show on several occasions, and Pooh is his usual simplistic, and yet shockingly profound, self. I can't say for certain if I laughed or cried more during this movie, but I am certain it's my favorite film of the year so far. I'll definitely be back to see it again, and can't recommend it highly enough."}, {"rating": "10", "text": "Beautiful, charming, it serves as a wake up call to all those workaholics out there."}, {"rating": "9", "text": "This movie grabs you right in the feel-goods. Anyone voting below a 5 on this film is clearly a Heffalump or worse (Woozle). Enjoy a slow-paced visit to your childhood for a little bit."}, {"rating": "7", "text": "Christopher Robin in a nutshell is nostalgia steeped in melancholy. Unlike the cartoon iterations of Winnie the Pooh, where Pooh or Piglet or Tigger or Eeyore are the protagonist, the hero's mantle falls squarely on the shoulder's of Christopher Robin, the titular character and the reason the Hundred Acre Wood exists. In this films we see an older Christopher Robin, a Christopher who has been beaten down by the world, a Christopher Robin who has lost sight of what is important. The story's message that sometimes we need to take a step back and take a vacation really works well with the Christopher Robin that has been portrayed.While the CGI and effects are good, the movie's strongest point is Ewan McGregor's performance. He is charming, has good comic timing, great seriousness at moments, and he knows how to portray a dreamer who has lost his spark. His acting is really excellent. The script is a little hokey, but you'll kind of expect that from Winnie the Pooh. The comedy is very good, and definitely balances out the \"Hallmark Movie\" elements. Some of the supporting characters (particularly Rabbit and Owl) are a little iffy, but others really shine, such as Matt Berry in a little cameo as a policeman. The nostalgia factor is quite a big sell, and my audience consisted mostly of elderly people, who did tear up. There are some truly melancholic moments, particularly how the movie portrays the death of childhood and how people change over the years. All in all, this is a great product from Disney, and go see it for Ewan McGregor, if nothing else."}, {"rating": "8", "text": "I watched the one is kindnest and cutenest movie for all time. This movie can touch your feelings with great character's graphics and sounds. When I saw a Pooh, Eeyore, Piglet and etc - I saw the soft toys that had in my childhood and had personal child stories with them.Wonderful work - brilliant family movie that could teach every elder men one little thing."}, {"rating": "7", "text": "It's a charming movie, and Ewan MacGregor is a delight to watch in it. Hayley Atwell is also quite good as the wife. It may not be the best of its genre (I'd give that award to \"Paddington Bear\" #1 with Colin Firth and #2 with Hugh Grant), but it's still a worthwhile way to spend two pleasant hours, whether or not you bring kids."}, {"rating": "9", "text": "With it's whimsical nature and unexpected emotional depth this not only continues Winnie-the-Pooh's trend of being delightful fun for children, but also makes an effort to connect with those who grew up watching the silly old bear. More than just an attempt to play off nostalgia, this is a surprisingly solemn tale about growing up, ditching childhood things, and losing yourself to the harsh realities of adulthood. Of course only the older viewers will be able to pick up on the underlying melancholy. Kids on the other hand will be enchanted by the lovable characters and their hilarious misadventures alone.The movie can be quite haunting and not just because seeing Pooh standing in a foggy forest with a red balloon calls to mind Stephen King's Pennywise. The opening moments are a real gut punch with Christopher Robin's life taking some dark turns after being forced to bid the Hundred Acre Wood farewell for boarding school. It was actually pretty tough for me to watch as the franchise was a big part of my childhood. The start of the movie is meant to tear people like me apart. That's okay though as the rest of it is designed to build us back up.Admittedly, it is just another one of those stories about a father who works too much at the cost of his relationship with his wife and daughter. While such a generic setup would doom a lesser film to a sort of comfortable mediocrity, Christopher Robin manages to avoid this fate thanks to the charm of it's classic characters and the undeniable warmth running throughout that offsets the sadder elements.The inhabitants of the Hundred Acre Wood are just as wonderful as ever. Always making you laugh while stealing your heart with their adorable appearances and kind natures. The way they've been brought to life is stunning. As much as I hated Ted, I have to give it credit for at least making the titular teddy look like a stuffed animal come alive. That same sort of thing is what has happened here. Only in an infinitely more charming manner.With Pooh and friends serving as the means of amusing escapism, Ewan McGregor acts as the counterbalance by delivering the more serious material with his performance the older, out of touch version of the title character. What makes the film so brilliant is that it strikes the perfect balance between fun and pensive. It's essentially a children's movie with a strong dramatic edge. Something that makes it perfect for all ages and particularly effective for longtime fans. Pooh's unconventional wisdom has also never felt more poignant.9.5/10"}, {"rating": "8", "text": "Excellent movie.An all round good movie, excellent acting, good animation and an enjoyable storyline that can be appreciated by all ages. A stand out performance by Ewan McGregor.Very minor pacing issues. But apart from that it is a very enjoyable experience."}, {"rating": "10", "text": "This one caught me by surprise — I took my daughter to see it this weekend with limited expectations. But it was a charming, moving, near-perfect movie. On a surface level, kids can follow the basic plot and challenges for Christopher Robin, but on a deeper level, this movie is about middle age and staying true to one's self. A beautiful movie, filled with a great mix of humor and wisdom."}, {"rating": "9", "text": "I was far more touched and impressed with this movie than I had originally expected to be. It was by no means a perfect movie, but I came away quite satisfied after watching it."}, {"rating": "7", "text": "Sweet, heartfelt, and boasting great visual effects, \"Christopher Robin\" is a successful nostalgia ride from Disney."}, {"rating": "7", "text": "Christopher Robin was sweet honey but it's stickiness was a small problem. The characters were so well designed. Except for Pooh, he bordered the line of being cute and creepy. This movie made me laugh, made me almost cry, and reminded me that life is better when it's simple."}, {"rating": "7", "text": "When I heard that there was going to be a Christopher Robin movie I honestly couldn't of cared less. I wasn't huge fan of Winnie the Pooh or any the properties related to it. But after seeing this film that opinion might just change. Almost everything this movie tries to accomplish, from making you feel wonder of childhood ignorance to making you laugh uncontrollably at the stuff the residence of the Hundred Acre Wood say, it succeeds in doing. However, that doesn't mean the movie is perfect. The story is generic and it gets of to a slow start, but the good does outweigh the bad in this case. When Pooh finally enters the story the film begins to fire on all cylinders. there is so much good thing that to explain all to you in this review would be an injustice. So all I can say is that if you are looking for good film that the entire family can enjoy than this film is the perfect one for you"}, {"rating": "7", "text": "While Christopher Robin is a sweet film; it as at times very slow and somewhat a forgettable affair. Ewan McGregor as Christopher Robin and the character of Pooh provide a charming chemistry which is hard to ignore however."}, {"rating": "8", "text": "The message that is conveyed, and the story structure and form are by no means new or fresh. Yet, the distillation of Pooh's philosophy is nothing short of ingenious!The primary strength of the movie is how the plot reflects the message of the story by making an astonishing use of almost every element in it. Every line, character, and story line deepens and enriches the message, while expanding the imaginary world of innocence.Without the slightest exaggeration, the allegories and images that were used in this movie are some of the best ever put to a children film. Honestly, sometimes I was about to shed some tears, not just because how the faithful representations of the beloved characters brought back my childhood memories, but also because how some of the dialogue, especially some of Pooh's lines, are both poignantly heartwarming and surprisingly witty.Speaking of the faithfulness of the characters' depiction, every fan of these sweet characters would be more than satisfied. For all of the characters here differ from how they are in the books and the classic animated movies only by the use of CGI. So, expect to see Eeyore with his depression and gloominess, Piglet's tenderness and anxiety, Pooh's brainless wisdom, and Tigger's vanity and energy. Needless to say, both Ewan McGregor and Hayley Atwell gave great performances that suit their incredible acting abilities, and gave this silly children movie some weight that was enough to make it more convincing. As for Jim Cummings, he simply delivered one of, if not the best vocal performance of 2018!The setup for the story was rushed, and also too cheesy for its own good, that it squandered a great deal of potential for making the movie feels more original, and also more appealing to adult audience. In a similar way, the resolution of the plot is nothing but a cheap and corny ending of a kids movie. But this time the silly nature of the movie served it, and therefore made ending, ironically, sounds less cringeworthy than it could have been.Marc Forster is not stranger for bringing nostalgia, and balancing sweet and bitter tones. And that's exactly what he did in Christopher Robin, which is equal parts silly and saccharine, all without the stickiness of Pooh's \"HUNNY\". As he definitely has replaced it with a considerable amount of wit.(8/10)"}, {"rating": "9", "text": "el factor esencial de esta película es la nostalgia, recordar la infancia con una historia sencilla y unos personajes entrañables. No pudo negar que las lágrimas salieron de mis ojos al final."}, {"rating": "8", "text": "A fantastic live action adaption of the Winnie The Pooh characters, with Ewan McGregor performing as a grown up Christopher Robin. A lovely, charming, at times emotional story and goes far deeper than honey and Tiger."}, {"rating": "9", "text": "This is a pointless movie, however it poignantly hits all the right parts.  Perhaps, that is the point of such a pointlessly good movie."}, {"rating": "9", "text": "Your kids will enjoy Winnie the Pooh and the rest of the gang. If you love Ewan McGregor or the TV show/books, then you will love this film. I adore every moment that Pooh Bear is on the screen. Eeyore also speaks to the younger mid teen generation so well. He steals the spotlight with amazingly dark one liners that will go over kids heads but adults can catch and really crack up. IGN gave this a four which I think just shows how you can get burnt out of movies. Truly if you came to this with an open mind and really let yourself get carried into the hundred-acre woods then I cannot see how one would not enjoy this film thoroughly. My sister and I cherished this movie. We both cried, her a couple more times than me. There is one moment where I literally uttered damn out loud because the feels are just too real. Some Toy Story 3 vibes came into play here. If that helps draw a picture of this film."}, {"rating": "7", "text": "Entretenida, tierna, muy bien hecho los efectos especiales, parecen muy reales los peluches, el final esta adaptado para que sea complaciente con todos, es su único problema. Si está mejor Hook."}, {"rating": "7", "text": "Una película dulce como la miel. No sorprende en ningún aspecto pero es muy bonita y tierna y nos enseña grandes lecciones de vida como la importancia de la familia y los amigos y el nunca olvidar el niño que todos tenemos dentro.Cabe destacar algunos de los escenarios, entornos y paisajes del Bosque de los Cien Acres que son simplemente espectaculares. Recomendada."}, {"rating": "7", "text": "Some of my earliest memories are of watching old episodes of \"Winnie the Pooh\" on VHS. This movie helped recapture that child-like wonder and joy I felt over two decades ago. Though, it does feel like it's over too soon. The first half is a lot of build up and then it feels like it's just rushing to get to the climax. Still, an enjoyable, sweet film for children and their parents."}, {"rating": "7", "text": "Christopher Robin was a refreshing re-life rendering of the beloved cartoon most of us grew up on. And although at times the plot was a bit meh, you are quickly reminded this movie wasn't made with you in mind but children and thus doesn't need a Tarantino like complexity. But overall the light-hearted feel and pooh-isms truly capture what it is like to see the world through the lens of a child, with a reminder to the adults not to get caught up too much in providing for our family that we forget what truly matters in life."}, {"rating": "10", "text": "I'm not sure how this is getting such a low Critic Score, then again yes I do. Critics have no idea what a good movie is. I'm 22 so to that one critic who said only 65 year old's will enjoy I guess that's out the window, my whole theater was full of ranging ages and all laughed and had a great time the entire length of the movie. The plot is a fantastic one ranging in emotions, even teared up in a few parts of the movie. It's a very heartfelt and beautiful return for Winnie the Pooh and friends."}, {"rating": "10", "text": "Spoiler-Free Thoughts on Disney’s #ChristopherRobin:I have been waiting for this movie since Disney started their live-action adaptations. I had a bit of hope, that when most critics saw it, that they said while it has flaws and at some points is a bit long, they say it’s delightful and MUCH better than “A Wrinkle in Time” (which I thought sucked, sorry Ava). And, I went in with a bit of caution, and coming out of the film now, I really came out happy. I really loved this movie. Yes, I may be a bit biased since I’m a Winnie the Pooh fan since I was a kid, but I really enjoyed this movie. I feel it’s the special Disney film I’ve been waiting for my WHOLE life and I’m happy to say the wait for it payed off. The visual effects on Pooh and his friends are really great and should get this movie a VFX nomination. I really enjoy the relationship between Winnie the Pooh and Christopher Robin (who is well-acted by Ewan McGregor). Also, Jim Cummings never lost his touch as Pooh and Tigger, the latter who I think has two great moments in this movie, and I really think the wonderful Mr. Cummings should have a pat on the back for returning, cuz he was dearly missed and I’m glad he came back to voice Pooh. (Seriously, can Disney give him an honors award at D23 next summer? He deserves one.) Also, the stuffed animals also really are still lovable, too. Nick Mohammed makes a fitting Piglet, personality-wise. Brad Garrett steals the show as Eeyore and I think, while I still like Pooh as my favorite character, the gloomy donkey steals the show. Toby Jones and Peter Capaldi have good chemistry as Owl and Rabbit. And, Roo is still cute. Kanga is STILL the mother figure, so that’ll do. Also, I really think the first 15 minutes of the movie is very well shot and well told, without spoiling anything. Now as far as flaws, here’s what I will say I wish we saw more of, more time with the other stuffed animals, beyond Pooh, Tigger, Piglet and Eeyore but I can forgive that. Also, I think both Evelyn and Madeline Robin could’ve gotten more screentime, even though I think they played the part they needed to play in the final act of the film, which I think made sense. Also, yes I can understand the film dragging on a bit long, but, at the same time, people complained that the 2011 “Winnie the Pooh” film was too short, so, guess people should know that they always are going to end up regretting what they wish for in a movie. Anyways, in closing, flaws aside, this is my favorite Disney Live-Action adaptation they’ve done in a while. I won’t say it’s the best, since that honor goes to Pete’s Dragon. But, I really will treasure this movie for a long time, so thank you, Disney, for making this movie. I will be happy to see it again a few more times. My rating: ⭐️⭐️⭐️⭐️⭐️. 5 starsP.S. Stay for the end credits, because since legendary Disney composer Richard Sherman did three new songs in this movie, one of which is sung in the beginning of the film, the end credits are worth staying if you want to hear his other two songs, and I’ll leave it at that."}, {"rating": "10", "text": "Una película llena de ternura, inocencia y valores, es de aquellas que te dejan una gran enseñanza de vida que definitivamente vale la pena ver, con breves, pero acertados toques de humor, una película que tocará y emocionará tu alma de principio a fin :)"}, {"rating": "10", "text": "I was pleasantly surprised by this film. I give it 10 out of 10 for story and heart. With a lot of nostalgia at play with the Pooh Bear franchise, this film does not disappoint. Some very feel-good moments through the film, his old stuffed animal buddies teach Robin how to have fun and play again thanks to Pooh and Eeyore. Pooh reminds us that when we are doing nothing, we are really doing something important. Play is so underutilized and downplayed as unimportant in our society focused on work. Pooh reminds us also of something that is important: Honey. The story is somewhere up there along the lines of Pattington 2 level of positive story and feel good effect after watching. The character journey is nothing foreign however the journey is so important to those who have focused for a time primarily on work."}, {"rating": "10", "text": "I honestly loved Christopher Robin. Granted, we've seen this story before, but I feel like this movie does it in such a heartfelt and different way that it FEELS new.The visual effects are shockingly incredible. The CGI stuffed animals seamlessly blend into their environment.And of course, Jim Cummings is just fantastic as Winnie the Pooh. This rivals his performance as Tigger in The Tigger Movie as his two best performances he's ever given."}, {"rating": "9", "text": "This movie is not deserving of that critic score. It is a delightful movie with important lessons for not just children but adults too. This movie was quite an emotional roller coaster for me, I laughed some moments and felt sad the next. It is at heart a WINNIE THE POOH movie."}, {"rating": "7", "text": "As a fan of these characters Marc Forster does a pretty good job capturing the mood and love for this world. While the film is a slow build I never found myself uninterested just hoping for a little more. Overall a middle 7 a B+."}, {"rating": "3", "text": "Unfortunately, the overly predictable story and the CGI misuse made me feel this film more like if Christopher Robin was suffering some schizophrenic collapse (and I worked at a psychiatric hospital, I know what I’m talking about). Trying hardly to be some kind of metaphor of the transitioning to adulthood though rereading our childhood memories, it fails completely."}, {"rating": "6", "text": "Nostalgia over quality, but by saying that I don't mean this film is bad but is far from being something prominent or remarkable.There is quality, the Disney magic that many people love is also there but the film relies a lot on that knowing that the feeling, the longing and melancholy are the strongest components of the story.After all, kids can go to see Christopher Robin, but as what happened with Toy Story 3 and Incredibles 2, this film is aimed at those who grew up with the characters, as I said the nostalgia factor is indispensable.I recommend it with reservations because it probably will not be to everyone's liking, it depends on the mentality with which you want to enjoy a film like this, definitely cynicism and bitterness will only ruin the experience, so you're warned."}, {"rating": "1", "text": "Ever since Kindergarten, a guardian angel figure has been watching over me, and no, it was not the Winnie-the-Pooh VHS tapes I rented and replayed every day, like I thought at the time. Despite always yearning to play with toys on my own again, today, I must take on responsibility, as that’s what grownups do, naturally. What/who was that figure then? I will answer as I discuss Disney’s own modern live-action take on that bear of very little brain.​Just sitting through Christopher Robin proved to me that I need to grow past my old guardian angel assumptions, as it pains me to say this now joins A Wrinkle In Time as the most unbearable 2018 movie I’ve undergone thus far. After this torturous money-maker first glosses past Christopher’s childhood memories, Disney proceeds to tells kids whatever they enjoy hearing so that they beg for more toys from dad’s wallet. The low effort shows, mainly by how off Piglet’s voice sounds compared to his cartoon counterpart, and how Rabbit’s voice sounds way too Pooh-ish.If the CGI plushies weren’t strange enough, fake news also disgraces the real Christopher Robin Milne, starting with the names of his wife and daughter. In real life, his wife’s name was Lesley de Selincourt, not Evelyn, whom he married in 1948, not 1944 like this movie states. During brief flashbacks of Christopher in class, he doodles Pooh and friends in his notebook, something the true Mr. Milne would never have done, since he in truth hated the books his father wrote about him. “Entering boarding school at age 9, Christopher Robin had a full-fledged ‘love-hate relationship with my fictional namesake’ that continued into adulthood, he wrote in his 1974 memoir The Enchanted Places.” (Country Living) Overall, Disney shows greater loyalty to A.A. Milne’s books that he wrote to take advantage of his son, turning him into a victim of fame at a disturbingly young age. Having learned more about the real Christopher Robin, I now feel ashamed for ever loving the Disneyfied Winnie-the-Pooh, as if I was a part of face-slapping Christopher Milne’s memory hard.On top of this motion picture’s skewing of reality, Ewan McGregor plays his inconsistent role inconsistently off a nonsensible script that relies  on coincidences. Sure, there might be great costumes with fun details, including Madeline’s classic Mary Janes that look like Christopher Robin’s, yet the film’s editor allows nary a good chance for you to spot them. Besides the countless unfinished staging of elements, several of them feel out of place, particularly an underwater dream sequence of a heffalump (which is really just a plain old regular elephant head).Most of the blame goes to the messy directing; director Marc Forster crops way too close to human faces with a handheld motion sickness camera. Even worse, the entire image always looks gloomy throughout cheery scenes with an odd magenta hue. Not even the directed humor works, for certain jokes, particularly one about lipreading from behind noise-proof glass, reaches no punchline. It’s just a setup, anticipation built up, then... nothing. The joke is forgotten. Forget anything unique about anything having to do with this film either, as it essentially steals Hook’s plot scenario, complete with the line from that movie, “I lost my marbles.”If you crave a nice personal experience, run away, for the Robin family’s communication here feature absolutely cringeworthy dialogue. Essentially, the overworked man spends too little quality family time, although hardly any information comes across about details of his bond with his wife or daughter before he took his job. It basically makes the wife comes across too much as a servant to her husband, just to make more room for Pooh’s bothersome antics to command your focus. Consequently, it turns its World War II backdrop into a cheap plot device, because apparently those millions of lives lost are less important than a red balloon. I don’t think that’s what Disney intended to say, but their carelessness certainly made it come off that we must never anticipate tragedy, but instead a problem-free life.Unlike this mindset, love blooms from small shared moments. As a child, it’s a red balloon. As an adult, it’s buying your friend’s lunch. Depend on whoever can bring out your best self, not the smooth-talking of the Mouse House that exploits the susceptible child inside each of us. I hence take these new lessons on old ideas to improve larger times; no guardian angel is stuff and fluff, but flesh and blood beings.Therefore, my guardian angel comes from those loved ones who can nurture me using our mutual need: sweet shared memories. Christopher Robin does the complete opposite."}, {"rating": "3", "text": "this movie is overly simple. it never varies from the baseline or grows in complexity, it just stays simple. it was painful to sit through.  if i had a family with young kids then this is a movie i would take them to. i do not. i saw this movie because i like animation and Disney usually delivers yet this movie was, simply put, terrible. a thinking person may want to leave after a few minutes and i urge them to."}, {"rating": "5", "text": "I love Disney.  I love Winnie the Pooh.  I love (the SUPERIOR) Paddington Bear movies.  Though Christopher Robin has no heart, a choppy story (that defies logic...Pooh can travel to CR's house through his tree though at times, everyone needs to take a train?)  I wanted to love this movie.  Instead it left me snoring in the theater."}, {"rating": "6", "text": "Not to be confused with \"Goodbye Christopher Robin\" from last year, this Disney film images the titular character as a grown man with wife, daughter and a serious job. His myopic focus on work is disrupted with the appearance of Winnie the Pooh and several others from the imaginary menagerie. This is a sweet story told with gentle style and subdued pacing, which makes it a bit precious (it is British, after all). Still, the youngsters should enjoy seeing the popular characters come to life, even if their adventure is not as exciting as most Disney animations."}, {"rating": "2", "text": "If you want to take your kids to a movie that will entertain them, look elsewhere, they will be bored to tears."}, {"rating": "6", "text": "This movie is disappointingly okay. There is an idea here to make it really good, even great! The groundwork is there. However Disney plays it super safe with a same-old story without much subversion, and blatant emotional manipulation.So what does work about the movie? Well it has heart, that's for one. There certainly is a warm and fuzzy center to the film that doesn't feel like blatant tugs at the heart-string. A large portion of this does come with Pooh and the gang. The designs are great and they do animate well. Sure they do look weird being worn down toys, but it makes sense in the movie and they do look as realistic as they can without feeling out of place, like Pooh, Piglet, Eeyore, Tigger, and everyone else of the 100 Acre Woods feel like real things. And the voice cast also do a solid job, with Jim Cummings returning as the voices of Pooh and Tigger. Unfortunately a lot of the usual cast for the rest of the characters do not return, which is pretty obvious with Nich Mohammond as Piglet and Peter Capaldi as Rabbit being very obvious and does make you ask why they didn't just get the voice cast from 2011's Winnie the Pooh, but they do a good job regardless. Major props to Brad Garrett as Eeyore, who does a spot on job that I was surprised to know this was his first time voicing the character. Ewan McGregor does make for a great lead as the titular character. It's not like an Oscar-worthy performance, but he does bring his usual charm and charisma as an actor. McGregor is also really the only great live-action actor of the film. He has no chemistry with Hayley Atwell, who is just too stiff in this, Bronte Carmichael doesn't do a terrible child actor performance, but she does fall into a lot of child actor performances where she acts more like an adult than a kid (I blame that on the writing and directing), and Mark Gatiss chews the scenery as the closet thing to an antagonist of the film. Marc Forster, who directs this, and has a weird filmography (Monster's Ball, Finding Neverland, Stay, Stranger than Fiction, Quantum of Solace, and World War Z!) does an alright job outside of the acting, it's shot competently and doesn't rely too much on the 180 degree shot reverse shot style. Although it is weird because it feels like an arthouse film! Like the camera work is done with a handheld like style, not exactly going too much of shaky cam like the first Hunger Games movie, but it is clear that it's not film with tripods. It feels weird seeing Pooh shot in a style reminiscent of someone like Terrence Malick. It's not bad, but it can be distracting at times.The biggest problem with the movie is the story. I don't mind that the movie is low-key and doesn't have much at stake. Like anything that is bigger for a Winnie the Pooh story would feel totally out of place! The general plot is fine, but it feels SO obvious with the emotional manipulation. So many of the dialogue and even the scenes that play out, including a pot of honey falling off the table and smashing, is such blatant appeals to the heart that it is obnoxious and groan worthy. Which just makes the overall story line of Christopher Robin working too hard and not being there for his family feel all the more tired and trite. The general idea isn't terrible, but instead of playing the movie with a little bit more artistic risk, take a few chances and subversion of the story, try for more subtly, and make work on a greater theme overall, instead of a played out \"father learns to be a family man\" that you have seen so much in family movies before. I'm not saying they needed to go full on Hook, but at least something with more tact.I can't in good faith say this movie is bad, the movie did it's job bringing nostalgic memories to the adult audience while providing something harmless but not pandering for kids. But there was so much potential that was not reached here, unfortunately. What could have been great, just came out average."}, {"rating": "8", "text": "Yes, the whole Hook-ish \"work-oriented, joyless man rediscovers his inner child\" schtick is pretty predictable in this. However, Pooh and friends are done so well that it doesn't matter that much. (Also, it's a lot better attempt than Hook.)The film does a great job of capturing Pooh and company. The dialogue and Pooh's longtime voice actor perfectly capture his way of being unintentionally wise and likable. Eeyore, voiced by Everybody Loves Raymond's Brad Garrett, is the second best part as he is hilarious in here. The other occupants of the Hundred Acre Wood don't appear as much but they stay true to the characters.Ewan McGregor does a great job as Christopher Robin, which is especially impressive seeing as the actor was speaking to no real people half the time. The movie is quite funny. The scenes of CH trying to be a good man in a misguided way and his eventual awakening all surprisingly work more than they should have. The movie manages to balance childhood innocence while not talking down to adults. In fact, they insert a couple osurprisingly dark moments into the events that lead to adult CH's adult personality. However, the reason I didn't give this a higher rating is the conclusion, or rather the conclusion to the workplace side of CH's story. Basically, he spends the movie trying to reduce costs so his business doesn't have to lay people off. The resolution to this crisis comes out of a lesser-made children's film. It is completely trite, forced, and way too saccharine.The movie looks great. The combination of the character designs of the cartoon and the original book work surprisingly well. The cinematography in the 100 Acre Wood is quite eye-catching. Although filmed on location, the scenes have manage to have a magical quality to them. The background music is also effective. Unfortunately you never hear the Winnie-the-Pooh song sung. I recommend you wait till the second song in the end credits. It's a nostalgic little number  from classic Disney composer Roger Sherman (Mary Poppins, Jungle Book)."}, {"rating": "6", "text": "\"Christopher Robin\" may be cute, but the expectation was too big. Too mature, portraying little about the back of these classic characters, keeping a main focus on Pooh. Other characters had a simple impression, without much producers concern, but the film has a good message, that the focus can never be 100% in our responsibilities, in view of the people who care about you. 6.8/10"}, {"rating": "4", "text": "Everyone is this movie is trying their hardest but Christopher Robin fails to connect.  Just about everything is underplayed or underdone, mostly by McGregor, and what should be a fun and nostalgic romp feels hollow and lifeless."}, {"rating": "3", "text": "A very sad and disappointing experience! Too dark story for a Winnie Pooh movie! The end is very cute tho"}, {"rating": "5", "text": "Visually arresting and sometimes funny but otherwise poorly written and perhaps miscast."}, {"rating": "6", "text": "There's only one word to describe Christopher Robin as a film and that is idealistic. The movie starts out good enough, showing Christopher Robin's childhood and his growth into an adult man, with a family to care and love for and a demanding job that pulls him away from them. Along the way, his old friend's from the Thousand Acre Woods show up to save the day and teach him about what is really important. The reality is, as a Disney movie, it preaches a lot of wishy-washy idealistic drivel that falls flat on it's face as soon as reality rears it's ugly head. Perhaps I am a bitter adult, but people have to work to survive and sometimes that means neglecting the most important things. It's just an unfortunate part of life most of us have grown to accept. The biggest issue I have with the movie is the fact Winnie the Pooh and friends are represented in the movie as real, living creatures that everyone can see, while the source material implies that they were always imaginary friends of a loney and isolated child. I rather think that if the movie had went into a different direction, a darker one, perhaps presenting some sort of psychotic break for Christopher Robin, the movie could have been a much more interesting concept. At the end of the day, it's not a bad film by any means, but that doesn't mean it couldn't have been better."}, {"rating": "5", "text": "I can see that the writers tried really hard to capture the whimsy of Winnie the Pooh and friends, especially with a story about returning to you childhood and working out what's important in life (shh... it's you family). Somehow, however, Christopher Robin fails, both in whimsy and in a sweet story. Somehow, there is too much of Pooh, the story is predictable and corny. I am a fan of Ewan MacGregor, and even enjoyed his Alec Guinness impression, but his posh English accent seems strained at times, as was his acting. I am also a fan of Hayley Atwell, but she had very little to do in this film, and sadly, the show wasn't stolen by young Bronte Carmichael. Sadly, this film didn't do it for me."}, {"rating": "7", "text": "A cute movie with a good message, though honestly there is nothing new or inventive here, the plot really is reminiscent of the Robin Williams film 'Hook'."}, {"rating": "6", "text": "Many critics and general movie-going audiences have compared Disney's 'Christopher Robin' to Steven Spielberg's 'Hook' (1991), the idea that the concept is about a certain main character, that we're used to seeing as a child, is now all grown up and goes on more adventures despite their maturing in age. In this film, Ewan McGregor plays the title character, who, after his childhood days of playing with friends including; Winnie the Pooh (voiced by Jim Cummings) and co. he heads off to London where we see him meet a kind and beautiful woman named Evelyn (Hayley Atwell), gets married, and has a daughter with her. His job is constantly keeping him busy from spending time with his family. He stays in London for the sake of his job, while his wife and daughter go away for the weekend. A lonely Pooh seems unable to find his friends and wanders along the Hundred Acre Wood, which seems to embody a dull, foggy and almost de-saturated look to it. He stumbles along and finds himself in London where a now grown-up Christopher Robin finds him. Shocked and confused as to how Pooh got there, Robin tries everything he can to get Pooh back without anyone else seeing them, and trying his best to concentrate on work. It's a stressful juggle. I enjoyed this movie for its warm heart and sentimentality. The actors and voice actors do an incredible job to showcase their loneliness and common chemistry. McGregor is likeable and sympathetic as a grown man, struggling to balance his family and work life, while at the same time, forgetting to remember what it was like to be a child. There were times where the movie's pace does drag, considering it is under 2 hours long, and there were also moments where it would fall emotionally flat. I expected more of an emotional punch, but there were moments that felt forced. Director Marc Forster does do a good job to show how much he knows these characters, and respects the material created by A.A. Milne. McGregor and Atwell are wonderful to watch, and don't get the credit they deserve, I just think the movie should have been more lively, instead of plodding around. Your children may be frustrated at the slow pace, but hopefully, the colorful characters should hold their attention. It's a fine and well made movie... that's all."}], "recommendations": ["onward", "nanny_mcphee", "finding_dory", "rise_of_the_guardians", "brave", "bolt", "goodbye_christopher_robin", "paddington", "the_kid_who_would_be_king", "moonrise_kingdom", "dora_and_the_lost_city_of_gold", "we_bought_a_zoo", "finding_nemo", "the_secret_life_of_pets", "paddington_2", "ella_enchanted", "instant_family", "up", "the_polar_express", "last_christmas", "the_willoughbys", "the_glass_castle", "ferdinand", "me_and_earl_and_the_dying_girl", "enchanted"]}