{"id": 2625, "title": "Christmas with the Kranks", "starring": ["Tim Allen", "Jamie Lee Curtis"], "runtime": 99, "genre": ["Comedy", "Family"], "description": "When their only daughter Blair leaves the family nest, Luther and Nora Krank decide to book an island cruise to beat the yuletide blues and just skip the holidays. But their decision to boycott tradition has the whole neighborhood in an uproar, and when Blair calls on Christmas Eve to announce a surprise visit with her new fiancée, the Kranks have just twelve hours to perform a miracle and pull themselves and their neighbors together to throw the best celebration ever!", "releaseYear": "2004", "mpaaRating": "PG", "imageUrl": "https://image.tmdb.org/t/p/w500/q866vL3KhAjbkZH1enT7AoxmRHx.jpg", "categories": {"plot": 6.333333333333333, "acting": 4.0, "ending": 7.333333333333333, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 7.571428571428571, "funny": 5.9523809523809526, "action": 5.0}, "reviews": [{"rating": "7", "text": "With their daughter away in the peace core, Nora and Luther Krank have decided to skip Christmas this year, and take a cruise to the Caribbean. There is only one problem, their Christmas Eve party and elaborate decorations are a staple of their neighborhood, and when the neighbors find out that the family is skipping Christmas this year, they go out of their way to change their minds. This film is your typical goof ball, family, holiday film, except with a much better cast then these things typically have. The chemistry between Tim Allen and Jamie Lee Curtis was terrific, and in my opinion make the whole thing work. Besides the big named cast, producers also included a ton of cameos from the likes of Cheech Marin, Dan Akyrod, and Felicity Huffman, just to name a few. Seeing a big name you really like, who is not listed in the credits, show up even for a small role, it always adds to the enjoyment of the film. This is not the kind of movie that is going to win any awards. It might not even be the kind of holiday film that is remembered ten years from now, but it's certainly entertaining, with some heartfelt moments, and it's good for a few cheap laughs. Christmas With The Kranks delivers everything you expect from a holiday movie, as it is something you can watch with the whole family and it will put you in the holiday spirit."}, {"rating": "7", "text": "I actually thought it was a great Christmas story. I thought it was very funny, with jokes every couple minutes. I find it hard to believe some of these things would happen though. It was very enjoyable anyways."}, {"rating": "6", "text": "Come on! its not the worst movie ever, thats waaay overdramatic, but hey, that's ur opinion, and mine is that this was an ok movie with SOME, yes, some funny parts."}, {"rating": "8", "text": "I thought that this was really funny. There were a lot of funny moments in it, such as the part with the holiday ham. To me, it is an unforgetably funny Christmas movie."}, {"rating": "0", "text": "Stupid, silly and not funny. Great cast that have no chemistry together and it is easily one of the most uncreative experiences I have faced. I give this movie 2%."}, {"rating": "2", "text": "Okay, in exactly how many Christmas movies has Tim Allen been casted in? Too many for me to count. Either Allen really likes Christmas or he just thinks he does well in a holiday movies. Either way, quite frankly, I am getting weary of the \"Tim Allen/Christmas\" connection. Granted there are some funny parts, but I think I speak for most when I say that Allen should give the Christmas gig a break."}, {"rating": "6", "text": "As far as Christmas comedies the Kranks leave us a little disappointed. It's a perfectly acceptable watch, but when so many of it's jokes land with a thud it's not hard to notice the better alternatives out there. Some more laughs would have gone a long way to give it the extra needed Christmas magic.\r For starters the biggest problem is Tim Allen himself. He's just not playing a likable character. His crotchety demeanor gives a sour tone to the film. Perhaps that was intentional, but it does nothing to bolster the laughs or plot so I don't see the point. The rest of the cast is talented and fairly amusing. It's just a shame they aren't given some genuinely good comedic gags.\r Long story short if you enjoyed Tim Allen as Santa and are hoping he will deliver more holiday entertainment then you'll be left wanting. It's missing the charm and sweetness of that movie. That's not to say this movie is all \"Bah humbug!\" In fact near the end it throws out some of the old Christmas spirit by dishing out some of what the holiday is actually about. It's not a real heart-warmer, but it's enough to let you know that this movie's heart isn't made of ice.\r As far as the actual humor goes it could have been a lot funnier. So much of it seems subdued. Things only really start to pick up in the final third of the film. As things get crazier for the characters it gets more amusing. Up until then we are left with a few noteworthy gags scattered around. It makes the movie feels longer than it actually is.\r It's slow paced with it's laughs and ultimately I was left wanting more. Yet, this is far from the most offensive movie to watch during the Christmas season. In fact I wouldn't really say it's bad. A perfectly acceptable if not completely worthwhile holiday flick to catch on TV while you're wrapping presents or something. It's watchable and has some good bits, but it's not one I'd gather the gather the family around the TV to watch on Christmas Eve.\r I give my stay with the Kranks this Christmas a 6.6/10"}, {"rating": "4", "text": "Read the book. It will take you the same amount of time as the movie, and it's definitely more enjoyable."}, {"rating": "0", "text": "This movie was a worthless piece of sh*t."}, {"rating": "0", "text": "There's nothing funny about Christmas with the Jerks. It's plain too boring."}, {"rating": "0", "text": "Tim Allen's unic-looking-part-shaved-brow made me eat a baby."}, {"rating": "0", "text": "Utter crap. Tim Allen should retire."}, {"rating": "2", "text": "2 points for one genuinley funny moment that last two seconds. The rest is utter poop."}, {"rating": "0", "text": "This movie is a piece of trash."}, {"rating": "0", "text": "This movie is a worthless piece of sh*t."}, {"rating": "0", "text": "Painful. I saw this in the theatre with my family after thanksgiving dinner. I remember feeling overjoyed that the movie appeared to be over ... only to discover that there was another half-hour of this drivel to suffer through. The worst thing about it was the fact that I couldn't walk out."}, {"rating": "0", "text": "Definitely the worst Christmas movie I've seen, this movie didn't only bored me, it annoyed me."}, {"rating": "5", "text": "A stinker, never has Christmas been so annoying and rotten, it's boring and so unfunny that when a joke works (which is almost never) we yell Halleluia. Allen and Curtis dissapointed me profoundly."}, {"rating": "1", "text": "Only cause Blair was pretty!"}, {"rating": "4", "text": "Far from anything spectacular, Tim Allen gives his next best Christmas performance after his stint as Santa. It's all very familiar - but sometimes that's all you need at Christmastime."}, {"rating": "2", "text": "Christmas with the Kranks is a treacherous family farce. It's undeveloped characters are was thwarting its plan to be entertaining."}, {"rating": "8", "text": "All these bad reviews and yet every year people watch this Christmas movie.  It has become a standard, fund holiday treat.   I have found that when the critics hate a movie I should watch it.  Because it is probably fun and enjoyable.  This movie is fun and very enjoyable and will be watched at the holiday season for years to come.  I don't rely on the critics.  If they love a movie it probably sucks.  If they hate a movie it is probably very enjoyable.  And this movie is a great holiday treat."}, {"rating": "7", "text": "Christmas with the Kranks isn't an acclaimed film, but I always thoroughly enjoying watching it every holiday season. It has some decent comedy, nice casting choices, and overall is just a feel good family Christmas movie."}, {"rating": "4", "text": "Phony, disingenuous family entertainment, suffocated by its green bean casserole approach to Middle America, spineless cardboard characters and paper-thin plot \"twists.\""}, {"rating": "1", "text": "If you want to get depressed, watch this movie. It will kill any Christmas spirit in you and make you hate Christmas so much that the Grinch would be proud of you."}, {"rating": "0", "text": "This movie is just bad and unrealistic in every possible way. Poor humor and annoying characters. This is what happens when actors are scrambling for a paycheck."}, {"rating": "8", "text": "I really found this quite an amusing movie, when I caught it on TV the other day. I do like Tim Allen, at least I was quite a big Home Improvement fan and I also enjoyed Jame Lee Curtis in the remake of Freaky Friday (alongside Lindsay Lohan, that movie remake I thought wasn't bad at all, much unlike the Herbie remake which I've just recently done a review on as well), plus it was nice to see Dan Akroyd pop up in this movie too as the somewhat overly 'Christmas-sy' Vic Frohmeyer, who seems to control alot of things in the Kranks' neighbourhood. I was a massive Ghostbusters (the cartoon show and the movies) fan as a child and whenever I see him in a movie, I immediately think back to those movies fondly, so anyway I was quite happy with the cast in this movie, apart from the story and every other aspect of the movie.So anyway, apart from the actors present and not meaning to seem totally biased about the movie based solely on who appeared on it, I really did think it was quite amusing. The comedy is fairly slapstick at points and it is quite silly but I think its not so much so that adults should be overly bored or think its entirely stupid and it would, or should, also entertain a younger audience to a certain extent to, so its got a fairly wide appeal to it, which is always good with a Christmas movie. I thought (perhaps this says more about my sense of humour but all the same) one scene or part of the movie that was particularly amusing was when this large choir of Christmas carol singers surrounded the Kranks' house and sung very loudly, with Nora and Luther inside trying to ignore them, until Nora turned around and saw someone right at the window next to her, giving her a fright! Yes it is rather silly but then again, its a Christmas movie and its an American Christmas movie, so, that says it all really, right? lol...I thought the story was quite interesting. I think that given the financial crisis and everything, some people may well be able to relate to the Kranks' this year, perhaps some families really are attempting to boycott Christmas(?) (boooo! lol), who knows but it did feel a little poignant when I thought about it. I sometimes think that there are too many American (or of any origin) Christmas movies that are too similar, with far too sugary sweet obvious storylines and although this movie is a bit predictable and the ending may disappoint some to an extent, the main idea or story behind it, is a bit different and I didn't feel that it was a story that had been done to death really, unlike some others, as I say.I think that this movie does well to illustrate just how over the top some people (particularly Americans - as if we had no idea already - hah, anyone seen Home Alone with the lights/decorations on the houses in that street? that says it all!) take Christmas, the reaction of the local community and how they communicated with the Kranks' was quite funny and somewhat interesting as well, though its not really meant to be taken too seriously of course.It may not be totally without cheese but it is, for the most part (until closer to the end of the movie), a different take for a Christmas movie and it is quite funny and so im giving it quite a high rating.Yes I'd recommend this. I enjoyed it, I thought it was quite amusing, like I say the story/concept was somewhat slightly different, I didn't think it was a story that had been done to death too much (apart from at the end perhaps) and I enjoyed it and found it funny and entertaining.It is a bit predictable as it comes to the end but otherwise its amusing enough and its inoffensive enough to work well as a family movie, suitable for children of about 10 years and up as a rough estimate. It doesn't go on and on for hours, at just under one hour and 40 minutes, I didn't feel that it got at all boring at any point in the movie and it didn't feel too predictable or cheesy until after mid way into the movie, if that acts as an advantage/positive. Hey its an American Christmas movie, its not perfect and of course it has to be a little cheesy but for what it is, its quite good and again yes, I would recommend it. Both kids and adults should get at least a few laughs from this."}, {"rating": "8", "text": "Really don’t get the hate on this one. Straight up classic. I think this is truly one of the best Christmas films out there."}, {"rating": "10", "text": "This movie is so great! Before this movie I didn’t believe in anything. This renewed my faith in all things Christmas. By freeing Frosty, I was freed. Thank you, Tim Allen."}], "recommendations": ["fred_claus", "night_at_the_museum", "deck_the_halls", "elf", "blended", "bedtime_stories", "alvin_and_the_chipmunks_the_squeakquel", "night_at_the_museum_battle_of_the_smithsonian", "diary_of_a_wimpy_kid_dog_days", "yes_man", "night_at_the_museum_secret_of_the_tomb", "bad_santa", "american_pie_2", "the_three_stooges", "hotel_transylvania_2", "goosebumps", "ted_2", "meet_the_fockers", "the_croods_a_new_age", "alvin_and_the_chipmunks", "neighbors_2_sorority_rising", "little_fockers", "american_reunion", "hubie_halloween", "the_boss_baby_family_business"]}