{"id": 4824, "title": "Cinderella Man", "starring": ["Russell Crowe", "Renée Zellweger"], "runtime": 144, "genre": ["Romance", "Drama", "History"], "description": "The true story of boxer Jim Braddock who, in the 1920s following his retirement, makes a surprise comeback in order to get him and his family out of a socially poor state.", "releaseYear": "2005", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/wkeOjIcpuqLMW4GnVowlM9VI0JE.jpg", "categories": {"plot": 9.3125, "acting": 8.818181818181818, "ending": 8.5, "soundtrack": 10.0, "cinematography": 5.0, "familyFriendly": 5.0, "funny": 5.0, "action": 9.2}, "reviews": [{"rating": "10", "text": "Excellent movie! Russell Crowe is the best."}, {"rating": "10", "text": "One of the best movies I have ever seen, and by a long shot the most UNDERRATED movie I have ever seen, and I am not a fan of boxing or sports in general. I'm a sci-fi nerd. Did you hear that? A sci-fi nerd. And yet this movie about BOXING blew my mind. See it!"}, {"rating": "10", "text": "Gripping, rousing, and redolent of a much harder time, \"Cinderella Man\" is a purely endearing masterpiece of a sports drama."}, {"rating": "1", "text": "Ron Howard should be executed and Renee Zellweger burned at the stake. Justice! Justice be made!"}, {"rating": "9", "text": "You can enjoy Cinderella man even if you don`t like Boxing. It gets much deeper than boxing by touching on his life during the great depression.He struggles in life witch makes it more amazing when he wins fights on an empty stomach."}, {"rating": "10", "text": "This movie is very moving! It is my all time favorite boxing movie. I relate to the characters so much. I honestly cry a couple times while watching this movie EVERY TiME!!!!! I highly recommend!"}, {"rating": "9", "text": "Fantastice! The best movie out this year! So inspiring and Renee and Russell did an awesome job at playing their characters. I never cry in movies but this time i did! It really touched me."}, {"rating": "10", "text": "Awesome Movie....it touched me in so many ways."}, {"rating": "10", "text": "As any Aficionado of inspiring movies would feel, this is an uplifting story not only for those who were the beneficiaries of the real James Braddock's experiences but also those who have come to enjoy and love the cinematic representation of the story of his life. Uplifting, inspiring and truly heartwrenching are the moments of risk and achievement of this man's great story. Great job by all who were involved in this production."}, {"rating": "9", "text": "Russell Crowe may be a lousy hotel guest but he's one hell of an actor, as he shows again in one of the best films of the year. Well supported by Renee Zellweger, Paul Giametti and an excellent cast, he creates an indelible portrait of an American hero. The film's cinematography, editing and production design should be remembered at Oscar time."}, {"rating": "8", "text": "Entertaining movie with a good story and excellent acting & directing."}, {"rating": "9", "text": "Post 9/11 American needed a movie revealing the strength of the human spirit when pushed against the wall. It is obvious Ron Howard and Russell Crowe know the strengths and weaknesses of the other. Together they have made one of the few movies that makes one want to stand and cheer the leading character. The only issue that made watching this movie difficult is the knowledge of Crowe's \"off screne\" persona. Though we hypothetically are to leave such info outside the door, nevertheless, watching him reach deep as Braddock to fight for his family's survival only conjurs up his real-life tempermental outbursts. If someone could have exercised these images from my head I would have become enraputred by this film's story. A-list stars must realize that with such an instrusive papparazi, their public behaviors can easily snake their way into their roles, in a distracting manner. God! I reallly wanted to adore this movie! Russell, please learn some anger-management."}, {"rating": "10", "text": "The best movie of the year."}, {"rating": "10", "text": "A marvellous film, one of the best films i have ever seen. The music adds to the beauty, the tight screenplay, excellent cinematography, Russel's wonderful acting, & the best part direction, a salute to the maker Ron Howard. All the time you are mesmorized in the movie. The depression era stands before you lively. A brilliant film. A salute to the efforts and intelligence of the maker & his team. We expect more Cinderella Men from you sir."}, {"rating": "10", "text": "What Can you say about this movie? Ron Howard and Russel Crowe together again. Fantastic!! This film is nothing short of excellence. Crowe gives us another great performance. and i can even swallow Rene's pressence in the whole thing. Paul Giamati deserves and oscar nod for his performance. And Howard for directing. It is sad that this movie did not find an audience in the big screen. This is movie magic GOLD!"}, {"rating": "9", "text": "Excellent!"}, {"rating": "10", "text": "The best movie of the year. More proof that the oscars don't mean shit. (except for Paul Giamatti's nom., which they only gave to him because they screwed him on sideways). A great story, well-executed and superbly acted. It's a pity that the folks handing out accolades are too obsessed with controversial films to appreciate a truly great, yet down to earth movie."}, {"rating": "10", "text": "Totally ignored by the Oscars, this is the best movie of 2005 as far as I'm concerned. Very entertaining, suspenseful, and pro-family, so not eligible for serious Oscar recognition."}, {"rating": "10", "text": "One of the best movies I have seen so far this year. A very touching family story as well. Howard does a excellent job making you care about what happens at the end... And still manages to keep you on the edge of your seat during the fight scenes."}, {"rating": "10", "text": "10, 10, 10 - no 20! IF you missed this movie, you missed the best one to pass you in years! I found myself wishing I had seen the depression scenes in high school, to ensure a life of savings would better benefit me during retirement. Renee and Russell lived this movie, they did not act it. Bravo!"}, {"rating": "9", "text": "Having been disappointed with many of Ron Howard's films in the past, I was most pleasantly surprised by this film. I thought it was wonderful. I think Mr. Howard has matured - this film and \"Beautiful Minds\" is an indication of how good he has become as a director. Not only is the direction good, but so is the story, the editing and the acting; especially the finely nuanced performances of Russell Crowe and Paul Giamatti, who shines whenever he's on screen. I came into this film, not thinking the subject or the movie would interest me. I came out thinking that it is among one of the best movies I've seen in the last several years."}, {"rating": "10", "text": "I'm stunned: 3 actors that I've never cared for have given 3 of the most powerful performances seen in a movie this year (by this I mean Russell Crowe, Renee Zellweger and Paul Giamatti). Do NOT pass this off as another boring boxing film! Do yourself a favor and go rent this one today."}, {"rating": "10", "text": "One of the best movies of the year. The performances are unforgettable, the directing is stunning and the story is superb. It cheered me and it moved me deeply, its tremendously touching in many ways, definetly worth a watch."}, {"rating": "9", "text": "Beautifully made film that shows the struggles and prospects of being an American."}, {"rating": "9", "text": "A great movie. It stands as one of the best depression era movies and boxing movies of all time at the same time. That isnt easy."}, {"rating": "9", "text": "Certainly one of the most flat-entertaining movies in recent memory. The acting performance was solid all around with Giamatti's captivating to the verge of scene-stealing, but most of us have known bigger-than-life type characters and I thought it worked. It's intriguing that reviews here are so polarized -- mainly very high versus \"0\" scores and little in between. More than just movie-reviewing it's a glimpse at opposing world-views or perspectives on what type of story entertains or deserves glamorization. I join the majority here in enjoying this one."}, {"rating": "10", "text": "Excelent movie, you can feel it every moment. Best Russells acting!."}, {"rating": "10", "text": "I thought Cinderella Man was one of the best movies of the year and it is a true travisty that it was not nominated in many of the awards programs. With its true story and gripping tale during the depression, it is a story that America should watch."}, {"rating": "10", "text": "Outstanding, hits the heart hard."}, {"rating": "9", "text": "I love period films and I am a big fan of Russell Crowe's. Ron Howard is a genius at directing. This was a fantastic film that kept you routing for James Braddock to the very end."}, {"rating": "9", "text": "Briallant, wonderful, well acted, sooooo realistic, but too long."}, {"rating": "9", "text": "What an incredible movie! Russell Crowe and Renee Zellweger did a fantastic job getting into the roles and portraying the emotions from that time period. You're touched from the very beginning."}, {"rating": "10", "text": "I was surprised how terrific this movie was; too bad Crowe got bad press for the phone-throwing incident when the movie opened! I saw it in L.A. and the audience clapped at the end... that never happens!!"}, {"rating": "8", "text": "Well done and engaging."}, {"rating": "10", "text": "I saw this film by accident on a flight returning from Germany on November 3. Normally I would not have devoted the time to watch this movie. Additionally, the film that was scheduled had problems and they shitfted this film over to economy class. After being picked up by wife I could hardly stop talking about this film - and comparing the type of story to the Seabiscuit film with the exception I actually remembered the Seabiscuit races. I wish I remembered Braddock - I only remembered the person who was a boxer. Now I'll never forget him, his family and his associates. Stephen Cole"}, {"rating": "9", "text": "There are alot of good messages in this movie. Heart, integrity and honesty to name a few."}, {"rating": "10", "text": "People who demand their theater for their money back after seeing this movie (and they do, to the extent of AMC theaters offering full refunds) can be classified as insane. Crowe digs deep into the roll of Braddock and Howard once again shows the genuis he revealed in Appolo 13 and used again in A Beautiful Mind."}, {"rating": "8", "text": "Really enjoyed this flick. I did not find it boring for over done, i like the way the fights were shot and i always love the film score by thomas newman:0). However i do agree with people saying Renee Zellweger is weak, whenever i saw her on screen it bugged me."}, {"rating": "9", "text": "This Movie was undouptedly one of the top favorite films from the amazing Russell Crowe. It portrays the struggle of living in America during the Great Depression and reveals the triumphant live of boxer James Braddock. Russell Crowe plays the roll of a compassionate husband and father so well that I wish I had him as an uncle. despite being a feirce boxing champion he does not give off the impression of being a meat-head, testosterone driven bulldog. His ethical and tranquil character is what makes the film which totally contradicts the stereotypical boxer. Another twist that i loved about the film is when he goes broke and goes the to boxing confederation to beg for enough money to get his kids back. that was a really moving scene. although i loved the movie i thought the actress playing James Braddock's wife could of been a little more attractive, boxers usually have HOT wives and they are always enjoyable to watch, especially when they play the roll of a faithful and caring wife."}, {"rating": "7", "text": "Another pretty darn good boxing film with very good performances and good direction."}, {"rating": "10", "text": "This is one of the all time most underrated movies ever made. Great story and great acting by Russell Crowe. There has been a lot of great boxing movies, but this is my favorite."}, {"rating": "8", "text": "This one had all the trappings of your regular old boxing film, but swiftly avoids all of them by making it almost more of a Great Depression film than a boxing film. Now, the film is certainly familiar at times, but thanks to a powerhouse performance from Russell Crowe and great direction from Ron Howard, it still feels fresh and new. In addition, the set design for 1930s New York/New Jersey is great and feels very authentic. Ultimately, the film is incredibly inspirational, touching, moving, and will have you rooting for Braddock from your couch, even if you know what the end result will be. Thus, in that way, this one reminds you of the magic of film, as even though it may not be the most technically brilliant film or the best one ever, it makes you care and feel something even when you know what is coming next due to the type of film it is. For that, Cinderella Man is a good film that will undoubtedly leave you feeling entertained."}, {"rating": "7", "text": "Misleading title, great movie. Howard delivers an excellent film that is sure to inspire us all. Crowe's portrayal of boxer Jimmy Braddock is great, and luckily the movie forgoes the usual boxing cliches, albeit a bit long."}, {"rating": "9", "text": "With a talented acting ensemble and a historically accurate script, 'Cinderella Man' is an uplifting story that will appeal to viewers of all ages and interests due to its combination of action, drama, romance, and humor."}, {"rating": "10", "text": "Despite a plagued screenplay, Cinderella Man is a powerful underdog film that captures the power of fighting for your family. The movie is fueled by the strong performances of Crowe and Giamatti."}, {"rating": "8", "text": "Nothing you have´nt seen before. The crushing story of a knight and his comeback for become an hero for his family, and the forlorn. The battle sequences are emotive and makes it worth."}, {"rating": "7", "text": "This is a tale of a somewhat down and out boxer (Jim Braddock) struggling to maintain a semi-decent home life for his family in the late 1920s onwards. Its undoubtedly a bleak watch at times but I liked seeing how James Braddock reacted to things, criticism by others and how he clearly loved his children and did all he could to provide for his family.The film title refers to the nickname he was given, as he managed to regain his former glory but the question is, of course, at what cost?. I remember one character also made the point that (in relation to his nickname) \"people die in fairy tales all the time\".Certainly this film highlights that the serious effects of concussion were at least starting to be noticed back in the time its set in, with other competitors knocking people out, who didn't recover. That made me think of the more recent film 'Concussion' with Will Smith, which goes into this subject more deeply, although in that film its directly related to American Football, rather than boxing.I felt Renee Zellweger gave a particularly good performance in this film, as Mae Braddock, who clearly was deeply concerned for the health and future of her husband and father to her children. I doubt many people couldn't feel her concern and frustration for him through Renee's performance.Overall this is an interesting sport related biopic/drama film. I wouldn't say its especially memorable but Russell Crowe is on good form and I'd say its certainly worth a watch, so yes, I would recommend it."}], "recommendations": ["forrest_gump", "my_name_is_khan", "raging_bull", "rush", "the_shawshank_redemption", "eddie_the_eagle", "a_beautiful_mind", "goodfellas", "the_secret_life_of_walter_mitty", "coach_carter", "million_dollar_baby", "eternal_sunshine_of_the_spotless_mind", "joker", "catch_me_if_you_can", "casablanca", "breakthrough", "the_green_mile", "good_will_hunting", "mystic_river", "lincoln", "eternals", "changeling", "creed", "whiplash", "revolutionary_road"]}