{
  "id": 39,
  "title": "Cinema Paradiso",
  "starring": [
    "Philippe Noiret",
    "Jacques Perrin"
  ],
  "runtime": 124,
  "genre": [
    "Drama",
    "Romance"
  ],
  "description": "A filmmaker recalls his childhood, when he fell in love with the movies at his village's theater and formed a deep friendship with the theater's projectionist.",
  "releaseYear": "1988",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/8SRUfRUi6x4O68n0VCbDNRa6iGL.jpg",
  "categories": {
    "plot": 9.76923076923077,
    "acting": 9.5,
    "ending": 9.0,
    "soundtrack": 9.6,
    "cinematography": 10.0,
    "familyFriendly": 8.0,
    "funny": 8.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "10",
      "text": "A beautiful movie! That is the word: Beautiful. Great storyline, performances, photography! WOW! At times, however, the pace is slow, but even then it makes sense! Just perfect!  Ennio Morricone's music deserves special mention!. Cinema Paradiso is classic! One of my top 10 favourite movies!...and I have it here at home in my collection! A MASTERPIECE...back then, and now! yes, it certainly is and will always be!"
    },
    {
      "rating": "10",
      "text": "Truely one of the greatest films of all time. A magnificent script complemented my Ennio Morricone's soaring masterpiece - can it get any better?"
    },
    {
      "rating": "10",
      "text": "As long as the movie was, it was amazing such a classic movie that I believe many might like. All thow it was in a faren language not my favorite it was amazing and a tell you all to watch it."
    },
    {
      "rating": "10",
      "text": "Cinema Paradiso is an amazing movie about the passion for early cinema. It has beautiful direction, performances, music, and writing. It is a must watch movie for anyone that appreciates film."
    },
    {
      "rating": "10",
      "text": "【scolazo.com】【scolazo.com】33카지노아시안카지노바카라사이트카지노사이트에프원카지노슈퍼카지노/a>트럼프카지노/a>베가스카지노/a>우리카지노/a>월드카지노/a>엠카지노/a>M카지노/a>"
    },
    {
      "rating": "8",
      "text": "Man hears of the death of a projectionist at a local cinema who he grew up with, has flashbacks, returns to the village after 30 years.Really sweet Italian film with the beautiful setting of Sicily as the backdrop. Genuinely funny dialogue throughout but I have to say I enjoyed the first half with the young Toto more than the second but nevertheless, still very enjoyable. Ennio Morricone does the score so superb as to be expected."
    },
    {
      "rating": "10",
      "text": "As a big lover of film, I am still kicking myself for not seeing this masterpiece any sooner. To me, Cinema Paadiso is one of the best films of the 80s and also the most moving, particularly in the final hour.I have seen many visually stunning films, and Cinema Paradiso is up there as one of the most visually ravishing films I've seen. The cinematography and editing are outstanding, and the scenery still looks gorgeous with an epic feel to it. Cinema Paradiso, alongside The Good, The Bad and the Ugly and Once Upon a Time in the West, also contains one of Ennio Morricone's most haunting scores and it is also one of my favourites of his.Cinema Paradiso is immaculately directed, has an touching, beautifully-written and honest script and a rich, compelling story that while it has an elegiac feel moves swiftly by draws you right in until the ending, which breaks my heart still after 5 times of seeing it.The characters are very well defined, particularly Alfredo, and the acting is outstanding with Salvatore Cascio, Enzo Cannavale, Marco Leonardi and especially Phillippe Noiret particularly impressive. All in all, a masterpiece. 10/10 Bethany Cox"
    },
    {
      "rating": "10",
      "text": "Una fantabulosa carta de amor y pasión del Séptimo Arte hacia los corazones de todos los amantes del cine y viceversa."
    },
    {
      "rating": "10",
      "text": "This is a beautiful movie that makes me cry every time I watch. The music is fantastic and the story is terrific. It deserved the Oscar."
    },
    {
      "rating": "10",
      "text": "This is my favourite film ever, mainly because I can identify with it. It is like the little town I goto every summer to visit my grandparents. Love it."
    },
    {
      "rating": "9",
      "text": "This edited version has some jagged transitions but is about the right length. In all other respects this is a perfect movie. The music is powerful but restrained. The story is for those who like their entertainment ringing true with their actual experiences. Alfredo's understanding of a young man's needs is such a precise blinding flash of the obvious that none of the other content can be interpreted to detract from the movie's achievement, and the montage of clips cut from the reels over the years is a bonus."
    },
    {
      "rating": "10",
      "text": "Surprised to not see this film rated 90 or better. This film is a masterpiece. It not only tells you a story that shows life's inevitable changes, it sets you up for one of the most moving endings in cinematic history. Don't bother to see it if among others who distract you. This movie demands attention from beginning to end. SHHH.... no talking!"
    },
    {
      "rating": "10",
      "text": "This is my second favorite movie of all time. If you do rent it consider renting the one with subtitles. This very moving tribute to cinema with a spice of history has several moments that will completely take your breath away."
    },
    {
      "rating": "10",
      "text": "If I want to express my opinion let's just say it is TERRIFIC!!"
    },
    {
      "rating": "10",
      "text": "A classic movie for movie lovers---a young boy meets an old projectionist in a small Italian village and learns life lessons.  This is a must-see movie."
    },
    {
      "rating": "10",
      "text": "One of the greatest films of all time, Cinema Paradiso (taken to new heights with Ennio Morricone's beautiful soundtrack) is as much a film about nostalgia as it is about the sheer love of the cinema."
    },
    {
      "rating": "9",
      "text": "A film about love in all of its forms, especially a love of the cinema, Cinema Paradiso is a phenomenal film that really pulls the heart strings and is a great visual representation of what movies mean to people and how they can truly touch you. All of the actors who portray Salvatore at the various stages of his life are great, as is Phillippe Noiret. The direction and writing are great as well. I really liked the way the story was told with hints towards the future and the multiple stages of Salvatore's life. The production design is also great, as is the score. My one complaint is the lack of depth to Salvatore's love of a girl named Elena. Symbolically, it makes sense, but I'd still like to see more, but regardless, it doesn't detract from the overall quality of the film. A brilliant work, Cinema Paradiso is a love letter to love and movies."
    },
    {
      "rating": "8",
      "text": "Uma das mais belas declarações de amor ao cinema, isso  Cinema Paradiso.........................................................................................."
    },
    {
      "rating": "9",
      "text": "Cinema Paradiso is not perfect but its closeness with this aspect is about its unquestionable beauty, result of an emotional and organic plot. It's almost impossible not seeing Salvatori - or Salva - as a relative or at least a 2 and a half hour - or full lifetime - friend."
    },
    {
      "rating": "10",
      "text": "Finally got around too seeing the Italian classic that is Cinema Paradiso and I must say that I was completely blown away by how the film traded a big and significant plot for a nostalgic and detailed portrayal of a man's life. The film starts with successful filmmaker, Salvatore Di Vita, receiving the news that his former hometown's old biograph-projectionist has passed away. After receiving the news, he takes a nostagic look back at his youth. Remebering his childhood in Sicilly, his early fascination with cinema, his bond with the projectionist Alfredo and his first love with a young woman named Elena.\r It's kind of difficult to decide what I should start praising this film for. The film is simply perfect and I can't wait to see the original directors cut which adds about an hour. The soundtrack contains some of Ennio Morricone's best work and the filming locations paint an even more beautiful picture of Sicilly than The Godfather films. Non-linear storytelling is quite common, but I can't think of any film that have utilized it in quite this fashion and jumps back and forth between different points of a man's life in this manner. We get to follow the character Salvatore in three different points of his life, as a child, as an adolescent and as an adult. Salvatore as a child is brought to life by Salvatore Cassio, I recently stated that I consider Judith Vittet's performance in City of Lost Children to be the best child actor's performance I've seen, but after watching Cinema Paradiso I'm torn between Cassio and Vittet. The adolescent Salvatore is played by Marco Leonardi and the adult Salvatore is played by Jacques Perrin. These three actors bring an incredible consistency to the character with some very fine acting and also brings the same consistency to the dynamic between them and the astonishingly gifted veteran actor, Philippe Noiret, who plays Alfredo the charismatic projectionist of Cinema Paradiso and Salvatore's only father figure.\r How director Guiseppe Tornatore is able to create the feeling of nostalgia when portraying a time I wasn't a part of and a place I never visited escapes me, but a big factor might be that he uses every movie-lover's nostalgia towards cinema and fascination with movies to create this heartfelt Italian masterpiece. Cinema Paradiso is an unforgettable feat which incorporates a broad variety of the emotions a person might go through in their life into the story and from Salvatore's perspective the viewer gets to experience joy, friendship, passion and love, but also sorrow, loneliness, longing and heartbreak. Undoubtedly this is one of the grandest and most sentimental coming of age films ever created."
    },
    {
      "rating": "8",
      "text": "A cinema within cinema. Cinema Paradiso is a charmingly old-fashioned movie set in Italy right before the popularization of television and therefore the end of the censorship of Alfredo's theater. But the star of the film is not the movies, but rather the little altar boy that grows up into be an actual star, forgetting where he came from. Alfredo, his mentor and role model, of course told him to go and never look back – but heeding such advice can only bring heartbreak to his mother. A fine line between finding your own greatness and remembering where you came from is important to remember."
    },
    {
      "rating": "10",
      "text": "1974's Badlands will go down in the history books as one of the best first feature films by a director, alongside Citizen Kane, Reservoir Dogs, District 9, Dances with Wolves, The Maltese Falcon, etc, etc. This movie is made with such precision and confidence, it's impeccable\rOne word summarizes the whole movie. Simple. Simple characters, although messed up. Simple dialogue, Simple incidents. Kinda reminds me of Fargo. Also Kit is one of the most interesting characters ever, how he's portrayed by newcomer Martin Sheen, is brilliant. This movie put Sheen on the map, Apocalypse Now made him a star, although this performance is superior."
    },
    {
      "rating": "10",
      "text": "This is a quintessential movie about life. Life in a small village in Italy after WWII, growing up without a father, the magic of cinema, progress, finding a father figure, first love, searching for what to do with one's life. Musical score is superb. Wonderful performances. It is a must-see for cinema lovers."
    },
    {
      "rating": "8",
      "text": "The movie could have been benefited way better from the sweet and nostalgic friendship between young Totò and Alfredo, instead  Giuseppe Tornatore focused more than he should have on what is going on inside Cinema Paradiso. That being said, The earliest parts of the movie are the most magical, and you won't appreciate the first act unless you watch the reach the end of the movie.The second and the third act are less magical, and not very original, but they are narratively stronger than the first, and have wonderful messages presented by fantastic performances from Marco Leonardi, as Teenager Totò, and Jacques Perrin, as Adult Totò. Also, Philippe Noiret's performance as Alfredo is one of the most poignant, and iconic performances in film! Ennio Morricone's score will hit you right in the feels, it's his best, IMO.You'll get nostalgic feeling only from the movie. Simply, because Cinema Paradiso isn't like any movie I've ever seen, because it's like life!(8.5/10)"
    },
    {
      "rating": "10",
      "text": "Cinema Paradiso [1988, 173 min, Director's Cut]Like it or not, the edited version misses out the end of the story and, thus, the entire point of the film! The hacked version may be more palatable or enjoyable, but that's not the point - the 'New Version' is the true story. The full length, 173 minute, 'Director's Cut' reveals an 'English Patient'-like morbid tale, whereas the edited film must be like a version of The English Patient where Fiennes & Scott-Thomas never have the affair!It's a dark film, but I fail to see where the R rating comes from, the only nudity is shown on the censored clippings film (which, admittedly, is unnecessary).The point of the film is that the projectionist deliberately sabotaged the youngster's affair so that it'd be romanticised in his mind forever and never spoilt - like the perfect love depicted in the movies. I don't think you'd appreciate this from the watered-down cut.The 173 min Director's Cut is the definitive version (and actually the originally shown version) and the greatest foreign language film ever made - it was finally released on Blu-ray with the 25th anniversary edition.NB: The film was released in 1988, not '1990'."
    },
    {
      "rating": "9",
      "text": "This film surprised me and has become one of my favorite movies.This film should be seen at least once in your lifetime. This film has great drama and romance."
    },
    {
      "rating": "10",
      "text": "if you people just know,if you people just could have seen what sicily is,this film reminds me of my birthplace,and it does so good that it makes me wanna take a flight and get back there,i rate it in my top 5 best films ever,if i could give an 11 i would have give it,in one word masterpiece"
    },
    {
      "rating": "10",
      "text": "Cinema Paradiso is definitely one of the bests. The director's cut is a little too romantic though"
    },
    {
      "rating": "10",
      "text": "One of my favourites movies. Hay que verla sí o sí. La banda sonora es increíble"
    },
    {
      "rating": "9",
      "text": "Now that autobiographical \"i-love-cinema\" biopics are in fashion, you won't find a single one that tops Cinema Paradiso. Acting, score, ending... a genuine love letter to cinema."
    },
    {
      "rating": "9",
      "text": "Has to be the most sentimental and nostalgic film of all time, even if you didn't befriend the local projectionist as a child and miss out on the love of your life. One of the best film endings ever and is another absolutely essential soundtrack for the goat Morricone."
    }
  ]
}