{
  "id": 4814,
  "title": "City of Ember",
  "starring": [
    "Saoirse Ronan",
    "Harry Treadaway"
  ],
  "runtime": 90,
  "genre": [
    "Adventure",
    "Family",
    "Fantasy"
  ],
  "description": "For generations, the people of the City of Ember have flourished in an amazing world of glittering lights. But Ember's once powerful generator is failing and the great lamps that illuminate the city are starting to flicker. Now, two teenagers, in a race against time, must search Ember for clues that will unlock the ancient mystery of the city's existence, before the the lights go out forever.",
  "releaseYear": "2008",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/eCdLMQMVk0SZlsfnDu43AOhbCJL.jpg",
  "categories": {
    "plot": 6.466666666666667,
    "acting": 6.153846153846154,
    "ending": 4.0,
    "soundtrack": 9.0,
    "cinematography": 5.0,
    "familyFriendly": 5.0,
    "funny": 0.0,
    "action": 8.0
  },
  "reviews": [
    {
      "rating": "5",
      "text": "If I had to compare this movie to one thing I'd say its like a Disney World log-flume ride gone amok. Lots of absurd and pointless over-the-top mechanisms round out an end-of-the-world story filled with so many obvious plot holes that it leaves the viewer with a \"Huh?\" as the movie reaches its conclusion. So where did the 5 rating come from? The adventure/mystery style of this movie reminds me of old puzzle/adventure video games [Myst,etc] that I liked as a kid and since its a kid's movie I can overlook the implausibility of the plot line enough to give it a 5. A young kid probably wouldn't mind all the plot holes so for them maybe this movie is a 7 or 8. Final word though to the builders: Elevator!"
    },
    {
      "rating": "10",
      "text": "City of Ember is a fine thrilling film."
    },
    {
      "rating": "6",
      "text": "Although it isn't much of an adventurous film but it is entertaining even though the part we want to go see is the adventurous part and it is just a mystery.  It does have an extremely talented cast and some cool visual effects enough to compensate. I give this film a 61% of a good movie."
    },
    {
      "rating": "3",
      "text": "Premise is okay but eventually more plot holes than you could reliably poke a stick at - you will ultimately be left disappointed by the potential and its eventual loss. Set design is nice, acting adequate but lacks a good film to tie it all together."
    },
    {
      "rating": "10",
      "text": "Awesome movie! I loved it! I especially like Lina Mayfleet!"
    },
    {
      "rating": "0",
      "text": "This movie is a complete joke to all film making. Like it went way too fast so it left a whole bunch of plot holes and terrible special effects for 2008. But thats just the beginning the movie had terrible acting. The two main characters sucked on screen. The best part of the movie was Bill Murray and even he was bad. Now that right there is almost impossible. I actually applaud the director for making Bill Murray look bad. Bill Murray is a legend and he was terrible in that movie. For one he should have been in it a lot more. Two he should have been a LOT funnier. I didn't laugh once when he was on screen. Three they fattened him up terribly to fit the fat mayor character. I mean they like put a pillow in his shirt and started taping. They could have done a little better because of the fact it was an adaption of an amazing childrens book. I read it and loved it. But this movie is up next to Battlefield Earth and Transformers 2. It didn't make sense and i could make a better movie in my sleep."
    },
    {
      "rating": "9",
      "text": "Haven't seen a good family movie like this since the 80's. The only problems I felt it had, is that it all happened a bit fast creating plot holes. But for what it was, and something we have not seen for a while, it was well done, all you credits are to damn picky."
    },
    {
      "rating": "3",
      "text": "An utter waste. Three points for the cast, which does what it can with one of the weakest screenplays ever adapted from a very good children's book. The special effects towards the end were laughable. The spirit and tone and themes of the book were completely lost or ignored. Skip the movie, read the book."
    },
    {
      "rating": "8",
      "text": "Cant say that i have ever heard of the book over here in the real world(Europe) but i will say that it was a very entertaining movie Im not going to give it a 10 because it is not a showstopping blockbuster like Gladiator or A New Hope. but i will content on giving this a positive 8."
    },
    {
      "rating": "8",
      "text": "a visually impressive kids movie that forgoes the patronizing, condescending tone most hollywood movies aimed at children take. instead, it delivers an interesting story and it even manages to provide food for thought for kids you might hope grow up to be aware of the fallacies of authority gone unchecked and unquestioned, and dangers of complacency. the story is in the form of a fable, so if you're looking for logical consistency then i'd suggest looking elsewhere (but really, if that's what you care about in a kids movie i'd suggest rethinking your priorities...) the plot is indeed a little bigger than the movie has room for, but it still succeeds, overall, in telling a compelling, entertaining story. unfortunately, this movie was a flop, but i have the feeling it'll be a cult classic in 10 years."
    },
    {
      "rating": "9",
      "text": "The book is perfectly realized with a wonderful set design, tight plot, and fine acting in the character roles, especially, though the principals are strong also. The focus of the film, as it was in the book, is on the courage and ingenuity of the young heroine and hero. Adults can't fail to notice the metaphoric theme of a world overused and wearing out, with most everyone in denial or taking advantage of the situation. Bill Murray as the politician grown fat on what he steals from the people while buoying up their confidence with patriotic songs and insincere piety - an almost terrifying-good performance, especially because we see our leader making his little performance on TV almost every day now - as the economy fall apart around our ears."
    },
    {
      "rating": "5",
      "text": "\"Cities need a powersource/More than the elements provide/Since we built the generator/Power's been supplied.\" How apropos than an underground band should contribute lyrics(back in 1988) that explicates the allegorical religiosity of this underground city's belief system. Jeff Davis of the Los Angeles-based band The Balancing Act(former labelmates with R.E.M. when both bands were signed to the defunct I.R.S. imprint), wrote a song called \"Generator\"(from their swansong album \"Curtains\"), which expresses the predominant opinion of the townsfolk that the generator is a mechanical deity made by man. Every year, Mayor Cole(Bill Murray) holds a ceremony so the masses can pay tribute to the Ember City founders, in the form of ritualized singing that's unmistakably gospel, sans the Judeo-Christian content. To us, their celebration looks like something out of a pagan cult, but since this society is disconnected from the civilized world that preceeded the catastrophic event which sent the whole of humanity underground, this collective exaltation of a machine, a god machine(or what is commonly called, deus ex machina), is the closest approximation to organized religion they have. \"City of Ember\", unfortunately, soft-pedals its most intriguing story element. Lina Mayfleet(Saoirse Ronan) won't be participating this year in the festivities, not since she found the metal box, an artifact, akin to Pandora's box(or maybe The Holy Grail), which would agitate the veracity singers, if only they knew what the \"goonies\" were up to. \"City of Ember\" neglects to dramatize this ideological conflict in favor of an action-filled final act that depressingly regurgitates Spielbergian tropes from the mid-to-late eighties. Too bad. In an earlier scene, before Lina even discovers the metal box, she poses a real threat to the hegemonic values of the ruling class in her artwork, when the pint-sized heretic envisions the physical world as we know it, by guessing the sky, and guessing it's blue. How does she know this? If \"City of Ember\" made much ado about its deux ex machina, it could've intrigued like Tarsem's mind-blowing video for R.E.M.'s \"Losing My Religion\"."
    },
    {
      "rating": "8",
      "text": "Great movie for pretty much any age - looking forward to reading the book to drink in even more of the details."
    },
    {
      "rating": "7",
      "text": "If you go to see a kids movie, then expect to be entertained, drop your expectations for a super fantastic film. Some films exceed childish expectations and give you more than you paid for, others don't. I expected the film to immerse my childish mind into a world that I saw in the trailers. I thought the film did a great job of creating a world that was totally dependant on the light the generator was made for. It had enough suspense for an eight year old to forget the obvious plot holes and shortcomings. But most children don't look for faults, they look for peril, action and adventure. And for that goal alone, it was achieved. Were there plot holes, of course there were. Why would mankind put enough idiots in the city and hope that two kids were born to solve all the problems? How could a box that was in every mayors portrait be able to be lost and fogotten. Or that one person alone would only know what his one dial would be for and not the rest? For the good of mankind we'll have a bunch of idiots kept safe. I don't think that was the plan, but thats what they seemed to film. Overall, I enjoyed the film. I got lost in the city, and the fresh idea that mankind came up with a solution to the disaster that would come; rather than have the US come up with some plan to save the day and be all heroic."
    },
    {
      "rating": "6",
      "text": "Imaginative, but I was not enthralled with the special effects, although they aren't bad. Good performances, interesting story, creative art direction. The score was quite good."
    },
    {
      "rating": "8",
      "text": "The movie was just good. The theme is very well made & you will feel creepy but pleasure with it. Although the plot &is a little bit letdown, but still a good movie to watch. I recommend this for family movies, not for mile high club."
    },
    {
      "rating": "0",
      "text": "Walked out after the first 15 minutes. Could tell from the \"get-go\" this movie was going to be another Hollywood \"craper\". Got a pass for my next time movie outing. Note: If you leave a theater and your only into less then 20-30 minutes of the movie..most theaters will give you a refund in the form of a \"Pass\" to another movie of your choice at that time or another day."
    },
    {
      "rating": "7",
      "text": "The plot has potential meaning and mostly fulfilled this. But yes, empty spots in this movie, a few, it feels like. A bit too scary for PG... I am 20 and for someone as aiming as I am, that sewer rat, that had the face of some species of sea creature, had me closing my eyes or looking away; it made the movie much more explanatory, by far- but it would give quite a fright to even a good-hearted 8 year old. I gave this a decent, hard rating. Definitely a keeper at some point."
    },
    {
      "rating": "6",
      "text": "As far as film adaptations go this one gets a pass. The film more or less has everything from the book staying true to the original source material. The film has the look and feel of Ember done right. What bogs it down are some cliché story, dialogue, and characters along with some rushed plot elements and underdeveloped characters, which is common when adapting a book to film. If you are a fan of the book check it out but make sure you keep an open mind as there are some changes made and some scenes cut out, which while they don’t ruin the movie they do detract from it slightly. Overall, this film gets a pass."
    },
    {
      "rating": "7",
      "text": "when it first came out, people enjoyed watching this movie. after that, it didn't even became one of the highest grossing movies of 2008 since it got overshadowed by another movie The Chronicles of Narnia: Prince Caspian.\r so, what about this movie? well, it lacks on both action and adventure, but as a fan of movies based on books like Harry Potter, Narnia, and The Lord of the Rings, I say it is a good one and its sticks to the source material from the book.\r Rating: 7/10"
    },
    {
      "rating": "6",
      "text": "I caught this film on HBO and had never heard of it.  I did not read the book so I can't comment on the adaptation, but I thought the look of the underground world alone was enough to recommend the movie.  The acting throughout is good, but the characters did seem underdeveloped.  There are a lot of big name stars in the film but they are not used to their potential, most of them getting little screen time.  Bill Murray was the best part of the movie (other than the look and sets).  If they would have made us care more about the characters this could have been a special film."
    },
    {
      "rating": "10",
      "text": "Beautiful mysterious movie with great aesthetics, should have been give more budget but did amazingly anyway, loveable characters and a great puzzle to solve."
    },
    {
      "rating": "6",
      "text": "Enjoyable movie, I was expecting something better from the end, good acting, I didn't get it what was the relationship between the headlines characters. The script could be better but for the public is good."
    },
    {
      "rating": "8",
      "text": "Follows the book pretty well. Started off slow but it turned out to be a cute family film, worth at least a one time watch.\r Watch it online for free: https://www.primewire.ag/watch-26-City-of-Ember-online-free"
    },
    {
      "rating": "9",
      "text": "A great film set withing a very interesting setting with a brilliant soundtrack that really helps set the mood of the film. There are some differences from the book however the core plot line is followed and there are plenty of references in the film that  readers of the book will get. The film does rush some parts and I feel that it would have benefited with a longer run time with more development of the characters and location. The film does contain what appears to be some plot holes however most of these can be explained away. It is a shame that it is unlikely there will be a sequel."
    },
    {
      "rating": "7",
      "text": "A very enjoyable movie that you can blame for one thing: it is too short! Another hour of runtime with more character and story development and this would have been a hit in the Fantasy genre"
    },
    {
      "rating": "5",
      "text": "For generations, the people of the City of Ember have flourished in an amazing world of glittering lights. But Ember's once powerful generator is failing and the great lamps that illuminate the city are starting to flicker. (5)"
    },
    {
      "rating": "0",
      "text": "City of ember is a very bad movie with horrible acting and even worse cgi. “The sand” has better acting. And the concept of the movie was completely stolen from the hit movie Wall-e. Very bad movie"
    }
  ]
}