{"id": 4372, "title": "Clash of the Titans", "starring": ["Sam Worthington", "Gemma Arterton"], "runtime": 106, "genre": ["Adventure", "Fantasy", "Action"], "description": "Born of a god but raised as a man, Perseus is helpless to save his family from Hades, vengeful god of the underworld. With nothing to lose, Perseus volunteers to lead a dangerous mission to defeat Hades before he can seize power from Zeus and unleash hell on earth. Battling unholy demons and fearsome beasts, Perseus and his warriors will only survive if Perseus accepts his power as a god, defies fate and creates his own destiny.", "releaseYear": "2010", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/6iHYLipwEyZUPNO8MM3l1yHDaFE.jpg", "categories": {"plot": 5.444444444444445, "acting": 5.035714285714286, "ending": 5.6, "soundtrack": 2.5, "cinematography": 7.0, "familyFriendly": 5.75, "funny": 3.0, "action": 5.344827586206897}, "reviews": [{"rating": "7", "text": "Entertaining movie, with great action and special effects."}, {"rating": "0", "text": "My friend fell SOUND asleep and was snoring in 10 minutes. Unfortunately, I said awake and watched this mess of a movie. Do NOT waste your time to see this movie unless you are homeless and seeking shelter and a good sleep. As my friend said, this movie was \"better than midol\". ABSOLUTELY a WASTE of time and money. I saw it for FREE and almost got up and walked out (in hindsight I should have). Cheesy story, fair acting, no eye candy, no real focused fighting scenes, and NO 3D. Don't WASTE your money or time."}, {"rating": "4", "text": "How does Metacritic work??? Roger Ebert gave the movie 3 stars (shows how good a critic he is...) and somehow metacritic turned this into a score of 73. Whoever is doing the math for you guys should be fired. I flunked my maths exam at college and even I can work this one out!!!!!"}, {"rating": "7", "text": "The original was better in the cheesy way and they did have the correct mythology. The new one lacked the heroes journey concept. although the cameo of BoBo was appreciated bby fans of the original. animation was a little crappy too."}, {"rating": "10", "text": "I almost didn't see this movie. The critics were pretty harsh and some idiots think you have to keep mythology true to some standard. Mythology is just a made up story to have fun with and no one with the license to make sure it fits into some Greek or Roman perspective from thousands of years ago. Get over yourself. This was one of the best movies I've ever seen. Everyone I know liked it so I finally conceded to go and I'm glad I did. The original did horribly with the critics too. It was actually only appreciated when it came to TV many years later. Looks like history is repeating itself."}, {"rating": "7", "text": "The original 1981 Ray Harryhausen special effects designed and produced  fantasy adventure is a film of magic wonder, excitement, adventure and mysticism. The 2010 remake or re-imaging if you prefer  \"Clash of the Titans\" is centered around a young  fisherman named Perseus  who  after a personal loss  sets  out  to the city of Argos to  take up the task of saving the whole city from the brink of destruction by the hands of the Kraken.  With a small group of brave soldiers Perseus seeks to take on some of the most foul and feared creatures in Greek mythology and save Argos from there fate.  While at sometimes, you may feel this film is a little too underwhelming and heavy-handed Louis Leterrierâ"}, {"rating": "7", "text": "clash of the titans has a simple script. gods and humans are fighting against each other. humans are taking revenge against gods. but the thing is that , a demi god is there perseus .... who fights for humansthe ultimate clash is missing here. so execution is failed. direction and screenplay is very good. dialogs are strong enough in 2nd half. narration is well told in the beginning and 1st half. camera angling is perfect during the final battle . casting is good by 3-4 persons . rest did not get their job done well. background score is average. the kraken sequence has worthy background score. editing is fast in the climax battle. things go very quickly.  cinematography is perfect. it captures the mountains ,.,, volcanic steeps the forts of the zeus and haydes. production values are awesome. but looks too much expensiveentertainment value is good in 2nd half. during the 1st half ,, only scorpio attack is entertaining. final verdict: the movie is a decent entertainer. in 2D    avoid 3D."}, {"rating": "6", "text": "The new, so-called \"up-dated\", version of \"The Clash of the Titans\" does not go very in-depth and into very much detail about the vast universe of the subject matter it is attempting to tackle. I'm speaking, of course, about Greek Mythology and the tales surrounding the hero Perseus. The overall pace of the movie seems very rushed, as if the filmmakers were trying to squeeze as much of the storyline as possible into a picture meant solely as a summer blockbuster. The acting is terrible, aside from a few of the minor characters throughout the film. Sam Worthington's acting is about as good as it's going to get, which is completely stale and uninteresting. The scenes involving the slaying of Medusa were the only somewhat enjoyable moments of the entire film, to me anyway. I say somewhat because the computer-generated animation of Medusa was difficult to stomach, as it seemed too \"cartoon-like\" to be considered realistic in movement as well as appearance. If they had used a real actress to portray at least the upper-half of Medusa's body then I would have enjoyed the segment much more. Overall, this movie was a waste of my time. I give it a 6 out of 10."}, {"rating": "7", "text": "People crack me up.  This movie was roasted when it came out.  So much so, that I didn't go see it in the theater.  As a die-hard fan of the original, I couldn't bear to see them make it too serious, which would eliminate the beauty of the original's adventurous cheese, or make it too cheesy as well, thus insulting the original. Well, I finally decided to watch it on DirecTV.  Granted, my expectations may have been low, but after watching Louis Letterier's directorial follow-up to a superb reboot of The Incredible Hulk, I am convinced people are absolutely crazy.  This movie was fantastic!  I read that it was cheesy.  Yes, it had some cheesy elements to it, but have you seen the original?  It DEFINES cheese!  I read that the Kraken was disappointing because it was too octopus-like.  Uhm...do you KNOW what a Kraken is?  It is based on a GIANT SQUID.  If anything, the original movie's Kraken was wrong!  Louis Letterier did as good of a job remaking this classic than anyone could have done.  He didn't insult it and wasn't so serious to make the original look cheesier than it already is.  It was absolutely fantastic.  The action, the CGI, even the elements of the story they changed.  Yes, the acting was very bad in parts, but knowing the bad acting and effects from the original, can one really be THAT critical of this one?  No, Gone With the Wind it was not, but it wasn't meant to be either.  I question who could have expected more."}, {"rating": "6", "text": "Based on the 1981 movie of the same name, this remake tells the re-imagining of the Greek mythology and also tells the story about Perseus, who learns that he is the demigod of Zeus and the only one who can stop Hades from summoning the Kraken that would wipe out the Titans and cause chaos to the world forever while being aided by Argos finest soldiers.\r I am going to make my opinion to make this review pretty much shorter.\r This remake isn't really bad, but its just wasn't groundbreaking. The CGI was good and sometimes the action scenes were a lot of fun, but the plot and characters were undeveloped and the storytelling was weak.\r Clash of the Titans suffers from its thin plot and lack of character, but has great amount of action scenes and very cool-looking CGI effects.\r 6/10"}, {"rating": "8", "text": "If you like action movies or movies about Greek mythology than this is a movie you will highly enjoy, an ultimately enjoyable movie with likable characters and a great story, some stale moments and one or two plot holes are the only things holding it back, a great movie from beginning to end."}, {"rating": "7", "text": "Thiz movie is remake from the original version in 1981 which still using stop-motion techniques. Now on CGI era, CLASH OF THE TITANS resurrects back to live. Perseus used to play by Harry Hamlin, now replaced by Sam Worthington. The Director is Louis Leterrier, the creator of THE TRANSPORTER (2002) and INCREDIBLE HULK (2008). I noted there were three enormous actions in thiz movie: Giant Scorpions Battle, Medusa Hunt and Furious Kraken scene. The special effects worked well. But in the close-up fight scenes, the camera did not focus and too fast, we did not really see what was really going on. The dialogues were a little bit lame and lack of interlude jokes. However, I like The Gods Gathering on Olympus as describe on thiz film. It is better and way beyond of what we saw earlier thiz year on PERCY JACKSON AND THE OLYMPIANS which also based on Greek mythology. My school teacher used to say, Sometimes what we saw in movie-trailer is what we saw in entire movie. It really happened on thiz movie. Worthington was not on his best, compare to his latest performances in TERMINATOR SALVATION (2009) and ground-breaking AVATAR (2009). There is emptiness during his appearance on thiz movie. Anyhow, I think we will see many of upcoming Worthington appearances. Thiz man could be new Schwarzenegger. It looks like we got a new Titan in Hollywood.\r Visit My Blog on JONNY'S MOVEE : http://jonnyfendi.blogspot.com"}, {"rating": "10", "text": "I agree on the script. The writers need to shoot themselves in the head. but the movie is AWESOME!!!! Also the actors are good in the movie too. But when hes fighting the guy whom kills the chick guide he jumps dramatically for no reason."}, {"rating": "0", "text": "With terrible acting, a pathetic script, miserable 3D, a tedious plot and derivative elements, Clash of the Titans hits rock bottom in showing what a movie can be."}, {"rating": "4", "text": "Pretty good visual effects don't make up for it's cruddy story and writing."}, {"rating": "1", "text": "It's a shame that Sam Worthington comes across as so terribly humourless in this movie. Ultimately distinguished from the other warriors only by his incongruous buzz cut and beardless aspect, Sam's Perseus grimaces his way through every scene; his accent (now Australian, now American, now - gasp! - English) was the only unpredictable thing about his performance. Had he appeared to be enjoying himself, perhaps we would have too. As it was, the movie seemed like a randomly strung-together sequence of tenuously related events overseen by Perseus' perpetually frowning visage, culminating in a not-terribly-engaging monster battle."}, {"rating": "9", "text": "I seriously liked the movie, It was a good family film, and decent plot for something so preposterous. Highly enjoyable, but you should go into it knowing it's an action film."}, {"rating": "8", "text": "The biggest problem with this film is the acting, but it didn't stopped it from being a very good film.The special effects are outstanding and this is a big plus because if you don't like the film you can still be amazed by the realisticnes of this special effects and computer animation. But i didn't liked the film because of that but because it tells you about the Greek mythology, witch to me is all I need. Sure, it has got bad acting, and is a little cheesy but it is still a good film. Not great but also not bad movie. Solid"}, {"rating": "10", "text": "This movie rocks!! It's far from perfect, with bad writing and acting, but its still awesome!! It's full of nonstop action, adventure, CGI effects, and fantasy. A great tribute to the films of Ray Harrihaussen. The critics and the haters don't understand that its just a big, dumb, epic action spectacular!!"}, {"rating": "5", "text": "COTT was underwhelming, and I expected more out of it.  With such problems as one-note characters, some very dull dialogue, an anti-climatic plot, and an ending with no pay-off whatsoever, COTT cements its place for this year's biggest dissapointment.  Thankfully, it features some enjoyable fight scenes, and of course, a great turn by Ralph Fiennes as Hades.  Which by far, is easily the best thing about this film.  I give it a 5/10."}, {"rating": "8", "text": "I've wanted to see this movie since November. My father told me all about it and the old movie back in 1981. I got so interested that I watched the trailers of this movie countless times. Well, I'm going to watch it today and I'm excited! Thank you."}, {"rating": "3", "text": "This is one of those films that you go into not expecting to be funny, but then you laugh so hard because it is so bad!!!Well, to start with the story: it is totally ridiculous and not according to the myths. Well, the basic story is, but it's been so Hollywoodised and twisted that it just makes no sense.The dialogue is soooo thin that you can see through it and the plot more wholes than Swiss cheese. It's just a plain stupid film, but it definitely has interesting action scenes and some impressive visual effects. Surely, it will entertain (hence the 5), but it will give you nothing else. It's a film you watch and are entertained during it, but afterwards you just don't care to ever think about it again."}, {"rating": "2", "text": "Clash of the Titans takes Greek mythology, Ralph Fiennes, Liam Neeson, giant scorpions and Medusa and manages to make them all boring. There was almost nothing to enjoy in this movie, even the action felt largely dull. An underwhelming disappointment and I sincerely hope that the proposed sequel is much, much better than this mess."}, {"rating": "2", "text": "If you look at the two latest Hollywood takes on Greek mythology (Percy Jackson and this snorefest built around epic cliches), Clash of the Titans may be set closer to the period. The wonderful talent carrying it were wasted by a script that's obviously trying too hard. It has nothing to boast but spectacular visual flash. But what I discovered here is that there is range in Sam Worthington's acting. If he wants to keep up the claims that he'll become the next Russell Crowe, he should go more to dramas than in epics that give no damn to mood and character."}, {"rating": "4", "text": "The movie was so obvious, I just retreated to my house from the theaters."}, {"rating": "10", "text": "THIS MOVIE TOPS THE F*****G LIST-IT BYPASSES THE LAME ORIGINAL BY A LONG SHOT. I SAW IT 2 TIMES BECAUSE I LOVED IT SO MUCH. IT WAS ONE OF THE BEST 2010 MOVIES"}, {"rating": "10", "text": "I really enjoyed this movie. Hades was awesome, and so was much of the rest, especially Medusa. The CGI was incredible. There was not a boring second in the entire movie. Simply fantastic."}, {"rating": "6", "text": "a very shallow film that is action packed with some nice visuals . the original was better as it usaully goes with remakes . they basically trimmed out more story for more CGI. its a ok film but forgettable ."}, {"rating": "2", "text": "Bad movie. I wasn't expecting more than a plotless, full of random action movie and still, i was disappointed. The characters are poorly made, the plot, well, there is none, and the fight scenes (the only thing I actually hoped to have had some quality) were simple and unrealistic."}, {"rating": "3", "text": "Clash of the Titans is probably the worst movie of the year with a pretty bad script that doesn't even relate with Greek Gods as it should. Not only that but the acting of Sam Worthington is pretty bland for a hero that we must suppose to like and support. The movie definitely has the high productions of visuals and sound, but that's just not enough to ignore the fact the movie never seems to have a truly exciting moment or an emotional one. You just simply wait for something interesting to happen, and when you think it will, it fails to make an impact on you. And in terms of its mythology that is based on, it frankly uses it badly by re-creating visually the gods badly with pathetic costumes and situations that just don't seem to fit very well."}, {"rating": "5", "text": "This movie has really entertaining action, really good CGI, and somewhat good lines. The acting is meh, Sam Worthington and Liam Neeson definitely stand out. And the ending, with the kraken, It was good, but way too short. It took maybe 5 minutes to rise from the depths of the ocean, and 3 minutes to die. But it's an entertaining movie."}, {"rating": "0", "text": "Clash of the Titans : Clash of the writings, Clash of the actings, Clash of the actions, Clash of the 3D 's, Clash of the critics, Clash of the lovers, Clash of the haters. Clash of the reviews."}, {"rating": "8", "text": "While the 3D was poorly done, I still thought the movie was decent, and that means a lot coming from someone who's not a big fan of movies based on Greek mythology."}, {"rating": "4", "text": "The tone of the film is inconsistent and bothersome. At times it takes itself far too seriously, and then the next scene will have over-the-top scenery chewing. Thankfully I saw it in 2D because everyone I know who saw it in 3D said it was unwatchable. And I'm not really on board the Sam Worthington train having not been terribly impressed with his performance here or in \"Avatar.\""}, {"rating": "5", "text": "Alright, I haven't seen the original, so I can't compare the two versions, but heres my review It wasn't that good Things are a bit rushed throughout. We see Perseus with his family for barely 5 minutes and then they're dead. Pegasus appears only twice: once to introduce him and the second for Perseus to ride him. Theres no bond signifyed between the two, so we can't believe in their companionship like we would Ash and Pikachu Gemma Artertons character is basically summed up as \"Appear, dispense wisdom, dissapeer, repeat above until tedioum sets in, make googley eyes with Sam Worthington, flee from scorpions, die, resurrection\" and shes Perseus' love interest. Andromeda shared less scenes with Perseus, and I felt more of a connection between their characters. And Andromeda and Perseus are meant to be together! Ignoring that is like having Guenivere go with Merlin instead of King Arthur. The Djinn. Unimpressive. They were cool characters, but seriously, they reminded me of Seamus from Family Guy. They were tree men! Scorpions. Pretty cool, and I liked the Djinn riding them and the two guys fashioning a scorpion shield for Perseus. Medusa. I liked how her snake physicallities extended from just her hair to her being part snake. But thats all I liked about her, really. The rest, her firing arrows, toying with prey, just meh for me. The Kraken! Talk about unimpressive. I watched an episode of Better Off Ted the day before, where they named a piece of meat they were growing Blobby. When I saw the Kraken, the name Blobby just stuck in my mind. Zeus' armour. Seriously? Sparkly like Edward Cullen? Boo! Ralph Fiennes is brilliant as always, as the evil Hades (thats who he was, right?) but the black tornado look when he first appears in Argos is crap The robot owl was a nice throwaway gag. The guy who convinced citizens of Argos to sacrifice Andromeda, he gets my award for \"Biggest **** of the film\" simply for being annoying and having the ugliest look since, well, ugly All in all, Good in places, but the bad points outweigh the good."}, {"rating": "5", "text": "Big budget fantasy adventure let down by a poor script, poor acting and a waste of the talents of Liam Neeson and Ralph Fiennes. Will appeal to anybody who like the action thick and CGI heavy but it's predictable nonsense that get monotonous about half way through, prepare for the inevitable sequel."}, {"rating": "4", "text": "There is so much potential in Greek mythology for a great movie but this is boring and the action lame. I never cared for any of the characters or events in this film and ended up rolling my eyes through most of the drama. Sam Worthington is only one step above a horrible actor. Clash of the Titans is disappointing and a missed opportunity."}, {"rating": "4", "text": "This is what happens when a film depends too much on CGI.  Mediocre acting, a mediocre plot, and too many deviations from the actual mythology makes Clash of the Titans and utterly underwhelming hour and a half."}, {"rating": "1", "text": "Just awful. Terrible acting, poor script and story. I like the Desmond Davis film so was looking forward to this but it failed on every level. Even actors you can normally rely upon struggle to lift this dire excuse for a film (Leeson, Postlethwaite, Fiennes). The only positive thing I can think of is that Gemma Arterton is stunning in this movie. I guess the effects are OK too but nothing special."}, {"rating": "10", "text": "This movie may not of had the best story but the action sequences kicked ass!!! there were moments were you literally feel like jumping into the movie to punch the hell out of the monsters LMAO and just one thing is this movie totally eclipses 90% of other movie climaxes THE KRAKEN!! Big Budget Blockbusters FTW!!!"}, {"rating": "3", "text": "terribly stupid badbadbadbbbbbbbbbbbbbbbbbbbbbbbbaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddd. nver seen such a stupid corny movie"}, {"rating": "3", "text": "The film benefits from cool action and great special effects but there aren't enough of those things to actually save the film because it lacks adventure and strong performances. I give this movie 33%."}, {"rating": "3", "text": "It was ok. The acting was far below what I expected, Especially from their A-list cast. Also everyone seemed really out of place, It didnt feel like a movie taking place in ancient times. The only person who really fit perfectly was Mads Mikkelsen, He stood out to me for some reason. The action was average and is never good nor bad.\r Overall it was just a pointless remake that does nothing but prove just because its newer doesnt mean its better."}, {"rating": "1", "text": "How dare they? I don't understand who allows these things into the theaters. Am I the only one that was tricked by the awesome trailer with the excellent music and exciting STABBING scorpions? Shame on me, right?Sam Worthington was the champion for this movie. Coming off of Avatar, and from his (the only good) performance in Terminator: Salvation, I was ready to believe he was a rising star. But no, this was just a paycheck for him. For us, it was a series of poor edits, miscellaneous adventurous montages, sub-par set design, and the highest build-up for the least satisfying \"Release the Kraken\" line I have ever heard. Liam Neison, how could you?The sole, sparkling moment in that 106 minute tale of darkness is when a strange, crystalline creature (...what?) explodes, predator style. Unfortunately, he explodes to no avail, but that is beside the point. It was hilarious. He removes himself from the generic tale the best way any of us could, the self destruct button. He alone sustains this movies 1 rating....How dare they?"}, {"rating": "7", "text": "Clash of the Titans is definitely enjoyable, and has exiting action, but too much of that \"exiting action\", the director's gotta just calm down and slow the film down to create a more relaxing and emotional do, the action can be kept, but not all of it. The director concentrated too much on the action and special effects, which made those parts great, but everything else is dumbly acted and scripted, this doesn't stop the film from being enjoyable, far from that, but all you see is awesome action, special effects, and filming, everything else is dumb and fairly poorly done. If it was less fast-paced, had actually good acting, a main character that's not too generic, and a well written script, I'd be giving it a 9/10, but no, it's too in your face with constant action and cheese, so I give it... 6.7/10 (rounded up to 7)."}, {"rating": "0", "text": "Horrible movie, is really boring, the screenplay terrible, have good effects, but a terrible 3D, I think that Wrath of the Titans is better than this part."}, {"rating": "2", "text": "To put it simply Clash of the Titan is horrible film. Acting was so bad people on sci fi movies would have done better. Visuals are disgraceful and story is nonexistent. Why would anybody make a film like this, oh is it because of the money. FYI the movie was a flop at the box office. RELEASE THE KRACKEN. HOW STUPID."}, {"rating": "7", "text": "I thought it was decent. The CGI didn't look that great at times though (the giant scorpions). I'd say it's slightly more enjoyable than the Percy Jackson series, and IMO way better than the similar Hercules movie with The Rock."}, {"rating": "2", "text": "I've never felt so betrayed the trailer was so epic i thought they were going to give us what the original missed on but no. The ending is a miss it has many problems. But fun to watch it was entertaining."}, {"rating": "4", "text": "Despite its flaws(the uneven acting and the episodic storybook-like structure) I really like the original Clash of the Titans, especially for the set design and the Harryhousen effects. In short, it is flawed but good nostalgic fun. This 2010 remake is very well done in the costume and set design and some of the effects are truly incredible, but emotionally it is ultimately hollow.While I do agree the effects were incredible, especially the Kraken, some of the scenes could have been better done. In particular with the gorgon Medussa. A scene that terrified me when I was little in the original and still does to some extent, but as has been pointed out once or twice before there was more emphasis on too much action not enough suspense which diminished that scene's appeal in this.The music comes across as rather generic. It strived to be rousing, energetic and bombastic, something you would find with Erich Korngold and Bernard Hermann, but sadly it came across as generic and boring. Pacing was an issue as well, it was very uneven here. It felt as though the not-so-important scenes dragged and the important bits felt rushed and skimmed over. The direction was disappointingly lethargic too.My main complaints though are with the acting, story and script. As I have said, the story and acting weren't the strongest points of the original, but both elements had their moments. However, the story has a very uneven structure, it is quite episodic, but it is also rather unexciting. On the whole the dialogue is awful and very banal, and there were some scenes where it came across as cheesy or forced. The acting wasn't much to go on either. Sam Worthington was merely alright, he has the heroism and charm, but then there is the accent that comes and goes and I got the sense that the delivery of some of the lines and the action sequences didn't come naturally to him. I was more disappointed in the bigger names. Ralph Fiennes doesn't seem to have a clue what he is doing here, and Liam Neeson looks lost and embarrassed. Gemma Arterton can be good(BBC's Tess of the D'Urbevilles) but while she is very pretty, her character is rather vapid.Overall, it had its moments, but it was unengaging and disappointing. 4/10 for the production values. Bethany Cox"}], "recommendations": ["pacific_rim_uprising", "the_three_musketeers", "hercules", "bloodshot", "poseidon", "immortals", "aquaman", "the_last_witch_hunter", "independence_day_resurgence", "transformers_the_last_knight", "valerian_and_the_city_of_a_thousand_planets", "jupiter_ascending", "into_the_storm", "gods_of_egypt", "gemini_man", "battleship", "volcano", "avengers_age_of_ultron", "san_andreas", "seventh_son", "teenage_mutant_ninja_turtles", "van_helsing", "guardians_of_the_galaxy", "transformers_dark_of_the_moon", "riddick"]}