{"id": 2526, "title": "Click", "starring": ["Adam Sandler", "Kate Beckinsale"], "runtime": 107, "genre": ["Comedy", "Drama", "Fantasy"], "description": "A married workaholic, Michael Newman doesn't have time for his wife and children, not if he's to impress his ungrateful boss and earn a well-deserved promotion. So when he meets Morty, a loopy sales clerk, he gets the answer to his prayers: a magical remote that allows him to bypass life's little distractions with increasingly hysterical results.", "releaseYear": "2006", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/oL0k5JA53PyoHSZqKb3cNkhwBCE.jpg", "categories": {"plot": 6.2, "acting": 6.083333333333333, "ending": 6.833333333333333, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 6.0, "funny": 7.545454545454546, "action": 5.0}, "reviews": [{"rating": "2", "text": "The premise was promising, however, the execution was dim-witted."}, {"rating": "10", "text": "Best movie I ever seen."}, {"rating": "3", "text": "Adam Sandler is somewhat talented comedian who approaches his incredibly successful films in the most annoying manner of combining unfunny, mean-spirited humor with cloyingly schmaltzy sentimentality. This is especially true in Click, a film that would have been just another unfunny Adam Sandler movie, but instead becomes a cloyingly bad drama, rife with histrionic and sophomoric moments of tearjerking and bookended by ridiculous cop-outs."}, {"rating": "0", "text": "First off, It was far too long for my taste. It felt rather dragged on imo. Second, A lot of wasted potential here. It started off interesting but it just became straight up trash. The last 2/3 of the film werent even funny, It was just depressing. I didnt like this film."}, {"rating": "5", "text": "This is....a piece of- well, you know what? It's not the worst movie ever. If you're bored one Sunday night, just watch this movie. Sure, it's bad, but you know what? It's got its moments. I'm highly critical, but you know what? Sandler isn't a genius. Don't ever expect his movies to be amazing."}, {"rating": "6", "text": "Click might have been the last acceptable Sandler movie.  At least this film has a decent story and has a good look to it.  Along with Sandler, Kate Beckinsale is very likeable."}, {"rating": "10", "text": "Click fools us by starting off as a mediocre slapstick when in fact it is the tale of a man discovering himself. By traveling through the different time periods of his life, and seeing how his choices have affected himself and the people he loves, Sandler learns an invaluable lesson. Click is a great American movie."}, {"rating": "10", "text": "A fantastic movie that made me and my brother cry! One of the best Adam Sandler movies ever made!This movie made me like Adam Sandler as an actor! coool!"}, {"rating": "3", "text": "A movie staring Sandler and Walken should be one of the funniest films ever. But this movie is such a downer. There are times when you actually want to cry. Normally if a movie evokes that strong of an emotional response, it's great, but this is supposed to be a comedy! Not a drama! The film does have funny moments early on, but most of them were in the trailer. If you want to cry though, go ahead and watch this movie."}, {"rating": "10", "text": "My boyfriend and I went to see it at the cinema. He's just like the guy.. never grasping those happy times, thinking everything is about his job. Whilst watching it, I couldn't help but cry near the end. It was beautifully breath taking. Maybe some people could learn from his mistakes & change their life. Realize the importance of family & their relationship, rather than a promotion at work. Simply amazing...I will definately be buying it."}, {"rating": "9", "text": "A surprising Sandler comedy that has a lot of emotion to go with the laughs. The morals it tries to teach can lead to some tear-jerking scenes and it's got plenty of laughs to offer provided you're a fan of Sandler's comedy. Even if you're not typically you might find yourself impressed at what is a more mature work than you might expect from the man. All I know is it brought me a lot of laughs and enjoyment, and I find it to be a top-notch comedy."}, {"rating": "2", "text": "Uneven, juvenile, base, simple-minded. It's the perfect product aimed at the sweet succulent money paying midpoint on the bell curve of America. That's why this guy is box-office gold. It's like sloppin' the hogs. Just throw it out there and watch 'em feed."}, {"rating": "1", "text": "Trite, banal, predictable. Represents Hollywood moviemaking for the masses, if the masses are asses. Full of product placement also. Gotta make that money! Ka ching!"}, {"rating": "3", "text": "I thought this movie was embarrassingly bad. The concept itself was interesting, and it could of been a cool movie I think; but the script, and especially the acting was just all totally awkward. It was hard to watch how bad Sandler was in those emotional scenes. I like the guy, but this movie was pure crapola to the highest degree."}, {"rating": "5", "text": "Abomination? no. It's just another mediocre, averagely funny adam sandler movie that uses alot of imagination, but still adding his mixture of crude, adolecent humor."}, {"rating": "9", "text": "Click is a very good Adam Sandler movie about life and the problems of adulthood.Though sometimes it's pacing goes off and becomes a little bit too complicated for its own good,overall the movie is very interesting and smart.Jokes are funny and they hit most of the times.Add there some touching scenes by the end and it makes for a complete movie."}, {"rating": "2", "text": "Don't let this user score fool you. There's basically like a whole load of people who just created a whole load of accounts just to give it a 10. You got to be either one troll or just a plain scrub who doesn't know what movies are. Let's just borrow 3 quarters of that positive ratings and turn them into negative ratings so we can easily explain why Adam Sandler's not good in movies anymore."}, {"rating": "0", "text": "Of course a great idea it was going to be wasted on Adam Sandler's hands. And its INSANE that this movie has a 6.6 score. INSANE.He has a simple message (oh boy, not really original). \"Life is great, even those little moments that you take for granted\".Ok. Now lets fill the movie with bad jokes, sappy mediocre dramatic moments, unearned emotional grow, etc. What a piece of c...p"}, {"rating": "8", "text": "It probably should have left off the coda in which everything worked out all right. Then it would have had the nerve to be a \"10.\" As it is, it's a mildly Jewish \"It's a Wonderful Life,\" and it's nice to see Kate Beckinsale as a Jewish mom."}, {"rating": "0", "text": "Save your time and your money. Everything funny was in the trailers."}, {"rating": "9", "text": "This movie was great, I wont elaborate and go on and on, because its already been done. All I know is, when this movie was over, everyone gave a standing ovation and loud round of applause. Thumbs up."}, {"rating": "9", "text": "One of the best movies I've seen in a long time. I definitely didnt expect this from an Adam Sandler movie. The film probably targets the younger generation, which may answer why many find the film to be \"stupid\" or not funny. Personally, the film includes just the right mixtures of jokes and emotional touches. 2 thumbs up."}, {"rating": "9", "text": "While this wasn't some amazing movie, it was a good movie. It had it's laughs, but it was a more meaningful movie overall. I think all the critics were pissed because it played on emotional strings and we all know they don't have any...they hate everything."}, {"rating": "10", "text": "The best film I have ever seen. It made me laugh out loud, giggle and cry all in one film. It was amazing. Adam Sandler is good in it but backed up by many famous actor who are all amazing. I reccomend everyone goes and sees this. A truely perfect film."}, {"rating": "10", "text": "This movie was spectacular! Before i saw this movie I thought Adam Sandler, i'm going to be laughing during the whole movie. But I was wrong. It was hilarious in the beginning but then it took a dramatic twist. It got very depressing and almost made me cry, and it amazed me how they could still fit in hilarious jokes through the sad parts. It was very creative and made me laugh alot!"}, {"rating": "8", "text": "You'll laugh and you'll cry! Typical Sandler flick. But this one adds a little more meaning to the word \"family\" and it's a nice little add-on quite unexpected and genuine. And my girlfriend loved it!"}, {"rating": "9", "text": "Loved this movie. Although the humor was somewhat vulgar at times, the emotional turns of the movie hit close to home and were extremely well done. Adam Sandler steps up his game for this movie and I was highly impressed. Great message; I would recommend this movie to everyone."}, {"rating": "7", "text": "Touching storyline (similar in tone to \"Its a Wonderful Life\" and Thorton Wilder's play \"Our Town\") but nearly ruined by endless sex and bathroom humor. Could've been a classic otherwise."}, {"rating": "9", "text": "One of the best Sandler films I have seen in years. It did feel like the film was cut in to two parts, you could see where the film was going and how it would end but it was well put together and the effects in the later half of the film was stunning. Supporting cast put on a great show and this film could bring a tear to your eye if it wasn't Sandler."}, {"rating": "10", "text": "This was the best film I have EVER seen! It made me cry, laugh and smile- all together. I absolutely love this movie, go watch it! 10/10"}, {"rating": "6", "text": "It had it's moments, but not one of Adam Sandler"}, {"rating": "5", "text": "An enjoyable movie, with poignant details that seldom spring out of the lake. Perhaps Adam Sandler has been maturing, for his last few films, Spanglish & Punch Drunk Love, have been treasures. This statement does not mean that Adam Sandler is a fine actor, only that he has gained respect for his audience. What better style, than this, to get your message across to the children/youth of contemporary North America? For some that believe they live a dolorous life, this movie will cheer them up. As in any LA movie, it is superficial, but warm. This is a good movie for a family to watch, and possibly to further discuss. Adam Sandler & his team know precisely their audience, not the critics, but the families."}, {"rating": "4", "text": "'Click' seemingly starts out will with it's cutesy family wisecracks. And the first couple instances where Michael uses the remote for his own personal kicks is somewhat funny. After that, there really are no laughs to be had. Its just the same joke exhibited over and over again with different alterations. Even the dog Sundance's incessant humping of a stuffed duck gets old real quick as the film advances. This is tragic because 'Click' is being passed off as a comedy but unmistakably isn't funny. Another fault the film bears is the main character Micheal is nowhere as entertaining as Morty. Not only did Walken do a better job of acting, he is overall more enjoyable to watch. Truth be told, Morty is actually the only thing that holds this mess together. And only slightly better than average direction by Frank Caraci who also did two of Sandler's other films ('The Waterboy' and 'The Wedding Singer') only contributes dullness to this already colorless movie. There are however a few heartfelt moments displayed throughout the extent of the film. But in the final scenes there's supposed to be a big profound moment when Michael desperately tries to tell his son how family comes first with his last breaths but Sandler just doesn't deliver. Who honestly expected splendid acting from him though? But despite all the downsides 'Click' presents, many people will still enjoy it. What can I say, fart and sex jokes sell."}, {"rating": "10", "text": "It's fantastic."}, {"rating": "5", "text": "This had some laughs, but the plot device to move the story forward was too obvious and cliche, which ruined it for me."}, {"rating": "4", "text": "The first half is typical Sandler humor. The second half is depressing, then overly sappy. I called the ending after about ten minutes."}, {"rating": "9", "text": "This is clasic Adam Sandler, very funny. What I like best, however, is the dramatic turn it takes and the very real side of society it shows. Kate looks amazing!"}, {"rating": "9", "text": "This was a really really good movie! I'm surprised it wasn't 100% comedy like usual Adam Sandler movies...I mean, near the end I was forcing back tears! Maybe I'm an idiot for almost crying during an Adam Sandler film, but if you have a somewhat open mind you will like this movie. And it has a really good moral."}, {"rating": "1", "text": "A couple of chuckles but this is a weak, lazy film with a pathetically tear-jerking ending. If you must put yourself through it, don't eat before viewing."}, {"rating": "9", "text": "This is an Adam Sandler comedy at its best. This is one of the funniest and most touching comedies of the year. I don't understand why the critics didn't give Click a better overall score, I found this movie to have a very positive message to it and it is an instant classic."}, {"rating": "9", "text": "Loved it, the best of Sandler plus new Sandler, you laugh and cry! What's not to like?!"}, {"rating": "6", "text": "With less reliance on the scatalogical, \"Click\" had the makings of a solid middle-brow effort. The metaphor at the heart of this movie is an odd fit for farting and amorous dogs. The finale breaks like the wind. But the dramatic moments leading up to Michael's personal abyss is oddly moving, which makes one wistful that \"Click\" didn't pander to a demographic who is happy with a lowest common denominator brand of humor. If \"Spanglish\" received better reviews, maybe Adam Sandler would've been encouraged to use this premise as his next project in which to alienate the fan base."}, {"rating": "10", "text": "\"One of the best American films of the year so far. \" San Francisco Chronicle says everything. This movie is funny, has a little bit of drama and sounds so original ! Doesn't you like? so you're a unfun dude."}, {"rating": "7", "text": "Not my favorite Sandler movie, but it is still definitely worth watching, because it is quite funny! Christopher Walken steals the show though!"}, {"rating": "9", "text": "It's the complexity of simplicity that creates confusion. This movie is so incredibly detailed that you just may miss its best points. That is what it's intented for. Enjoy."}, {"rating": "9", "text": "This was easily one of Adam Sandler's funniest movies. For an hour and fifteen minutes, I did nothing but laugh at this pitiful schlub. However, this movie could have done without it's overly sentimental finale. This movie proved one thing to me: David Hasselhoff CAN act after all. If you can sit through the last fifteen minutes without getting bored, I strongly recommend this otherwise hilarious movie"}, {"rating": "2", "text": "This move was painful. I mean that in the purest sense...it was truly painful to watch a corny director parade Adam Sandler around in his fleeting loose-ended adaptation of It's A Wonderful Life."}, {"rating": "7", "text": "A few hilarious scenes, a film in the regular comedic fashion of Adam Sandler; but also some surprisingly moving, tear-jerking moments, quite unexpected from Sandler."}, {"rating": "8", "text": "This was a very imaginative and fascinating premise for a movie. At first I thought it was going to be a bunch of silly jokes (some funny and some not), but it turned into quite an interesting and moving commentary on modern life. Be careful what you wish for, you might get it."}, {"rating": "10", "text": "That movie was by far an inspiring movie of how when you skip bad parts in life you tend to miss the good things in life as well. It was like the movie family man. It wasn"}], "recommendations": ["funny_people", "blended", "sandy_wexler", "50_first_dates", "the_break_up", "yes_man", "this_is_the_end", "dinner_for_schmucks", "zack_and_miri_make_a_porno", "knocked_up", "step_brothers", "grown_ups", "the_cobbler", "ted_2", "friends_with_benefits", "jexi", "neighbors", "the_wedding_ringer", "identity_thief", "just_go_with_it", "a_million_ways_to_die_in_the_west", "wild_hogs", "delivery_man", "ted", "forgetting_sarah_marshall"]}