{"id": 3766, "title": "Cliffhanger", "starring": ["Sylvester Stallone", "John Lithgow"], "runtime": 112, "genre": ["Action", "Adventure", "Thriller"], "description": "A year after losing his friend in a tragic 4,000-foot fall, former ranger Gabe Walker and his partner, Hal, are called to return to the same peak to rescue a group of stranded climbers, only to learn the climbers are actually thieving hijackers who are looking for boxes full of money.", "releaseYear": "1993", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/8v2nPPLvhEVlfXu08UZ0djK31be.jpg", "categories": {"plot": 5.2727272727272725, "acting": 4.666666666666667, "ending": 5.0, "soundtrack": 4.0, "cinematography": 6.0, "familyFriendly": 3.0, "funny": 1.0, "action": 6.083333333333333}, "reviews": [{"rating": "9", "text": "Amazing stunts, very beautiful landscapes and great actions. In addition the tempo is high. The setting in the mountains and the theme rock climbing are unusual and that makes this movie interesting. Only the characters could be more detailed and convincing.In result I like the movie, it is a very good entertaining action movie."}, {"rating": "4", "text": "+Excellent setting with great cinematography+Memorable soundtrack from Trevor Jones-Weak screenplay-Fantastic cast feel wasted here-Tonal pacing is a messThe film starts well yet soon becomes yet another Hollywood attempt to cash in on the success of the die hard series. Unfortunately the script sucks and for a film so focused on action it is just poorly directed with no sense of where anyone is on this mountain range where people can seemingly appear from nowhere when the plot suits thus wasting what could be its great source of tension (i.e actually allow difficulty with characters scaling a mountainous terrain in pursuit of the mcguffin). The cast are fantastic and given some entertainingly corny lines. Overall I feel like this is one for the hardcore fans only!"}, {"rating": "10", "text": "Um dos melhores filmes de Sylvester Stallone,um suspense de ação genial,com cenas de grande tensão,comédia e ação. Uma Excelente atuação de Stallone.Um Excelente filme de ação!!!!!!!!"}, {"rating": "8", "text": "Even if Cliffhanger's action sequences are easily comparable to other thrillers, Michael France and Sylvester Stallone's script offers enough action and tension to satisfy the audience."}, {"rating": "6", "text": "and at best pure fun..CliffhangerCliffhanger is a plot driven action thriller about a group of mountain climbers that are cornered in a crisis after a heist goes wrong for the antagonist. Such action feature often relies upon the merit of screenplay and it is exhilarating, gripping and sensible in here. The trail that each sub-plot and character and dramatic sequence leads to, is not only well constructed but is passionately projected with keen sense of awareness about the palpable surrounding offered. It may be flawed, but is undeniably entertaining in its own beats with nail-biting action and chase sequences. The writing offers few hints of maturity which latter unfortunately is mutilated or piled upon by the commercial aspect of the feature. Harlin's world runs on \"hard work\" as it doesn't offer any help to the characters, just the wittiness and boldness that makes them cross the line. It is shot beautifully with stunning visuals and appealing live locations as it wanders through mountain valleys offering the promised thrilling ride to the audience. The background score is a bit daft at certain points and so is short on cinematography but is rich on delivering sharp sound effects. The feature is well polished around the edges unlike such genre where it goes wrong, which is what keeps the audience tangled in its cold world; literally. Stallone; the screenwriter and protagonist, is in his A game on both the job that he has attempted to pull off and is supported well by Lithgow, Rooker and Turner. Harlin; the director, has done a decent work on executing the feature but is undermined by its mature screenplay. Gripping script, stunning locations that makes it pleasing encounter and hardcore choreographed action are the high points of the feature. Cliffhanger leaves the audience with a satisfying and expected experience that is at worst cliched and at best pure fun."}, {"rating": "10", "text": "A heist gone bad, bad guys searching for their lost loot, taking US Park Rangers hostage to lead them through the mountains to get it.  Of course, the Rangers have personal issues which make them enemies, but the bad guys become the bigger foes.  This movie is perfect for Stallone, not a lot of dialogue, not a lot of emoting, just muscling up mountains to save his buds.  I don't have many DVDs but this one is in my collection."}, {"rating": "4", "text": "So fkg stupid. I tried to like it but the production quality is cheap studio crap."}, {"rating": "1", "text": "Cliffhanger is possibly one of the most laughable, awful, embarrassing and rubbish movies ever made with action scenes that make you laugh and aren't that impressive or characters who seem like the three Stooges or are totally unconvincing. Stallone in this movie is unlikeable, Michael Rooker needs knocking out, the woman who hangs around with Stallone is probably the only likeable character besides Ralph Waite who plays Frank.... Craig Fairbrass is ridiculous as one of the villains and John Lithgow is laughable too and ridiculously pathetic. Terrible film."}, {"rating": "10", "text": "My dad and I are huge fans of Stallone and Cliffhanger is one of his finest. 2 thumbs up."}, {"rating": "7", "text": "This is possibly the most 90s film ever made, every single person that pops up on screen is a 'that guy'. Lithgow is giving such a wild in and out accent performance I was floored by the it."}], "recommendations": ["survivor", "mission_impossible", "jiu_jitsu", "mission_impossible_ii", "upgrade", "haywire", "the_bourne_supremacy", "atomic_blonde", "mission_impossible_ghost_protocol", "no_sudden_move", "kate", "copshop", "spy_game", "bone_tomahawk", "wrath_of_man", "the_harder_they_fall", "hellboy", "heat", "triple_frontier", "the_terminator", "jackie_brown", "lethal_weapon_2", "blade_ii", "speed", "hunter_killer"]}