{"id": 553, "title": "Clifford the Big Red Dog", "starring": ["Darby Camp", "Jack Whitehall"], "runtime": 97, "genre": ["Family", "Adventure", "Comedy", "Fantasy"], "description": "As Emily struggles to fit in at home and at school, she discovers a small red puppy who is destined to become her best friend. When Clifford magically undergoes one heck of a growth spurt, becomes a gigantic dog and attracts the attention of a genetics company, Emily and her Uncle Casey have to fight the forces of greed as they go on the run across New York City. Along the way, Clifford affects the lives of everyone around him and teaches Emily and her uncle the true meaning of acceptance and unconditional love.", "releaseYear": "2021", "mpaaRating": "PG", "imageUrl": "https://image.tmdb.org/t/p/w500/oifhfVhUcuDjE61V5bS5dfShQrm.jpg", "categories": {"plot": 9.0, "acting": 8.0, "ending": 7.0, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 7.285714285714286, "funny": 7.428571428571429, "action": 5.0}, "reviews": [{"rating": "4", "text": "More than enough for kids, but just too lazy for anyone over the age of 10."}, {"rating": "6", "text": "Set in the same CGI-hybrid adaptation cinematic universe as Alvin and the Chipmunks and Tom & Jerry, this should amuse kids and at least keep adults from falling asleep."}, {"rating": "3", "text": "bad[ bad ]adjective, worse, worst;(Slang) bad·der, bad·dest for 36.not good in any manner or degree."}, {"rating": "7", "text": "The original Clifford show on PBS was a personal favorite of mine growing up. So naturally there was some excitement on my part to see it getting a live-action adaptation after all these years. I figured the format of the cartoon would be difficult to translate into a standalone movie aimed at wider audience, so I was anticipating something entirely original. I must say though, I wasn't expecting anything this strange.The film starts off normally enough with a young, out of place Emily Elizabeth learning the difficulties of owning a ginormous puppy, but quickly gets weird when the megalomaniacal owner of a genetics/biotechnology company wants to experiment on the supersized pooch to unlock the secret of creating giant food and ending the world's hunger crisis. Then there's the stuff going in with John Cleese as some kind of magical pet rescuer who goes around giving people preternatural animals that's honestly a bit creepy if you look too closely at it.Odd though it may be, it at least gets the humor right. Admittedly most of the gags are of the \"haha big doggy make big pee and drool\" variety, but there are still plenty of less juvenile sources of laughter as well as some genuinely heartfelt moments between the young lead and her CGI canine costar. Truthfully the only thing that bothered me were a couple of jokes that teased adding some profanity to the mix. There's a point where a man is faced with a psychotically aggressive lamb (did I mention this was odd?) and yells \"holy sheep,\" and another where a guy is about to tell someone who doubted him in the past to kiss a certain orifice of his on national television before promptly having the mic ripped away. Both of which are in poor taste for a property designed with children in mind.However, the source material was always a bunch of cute, wholesome fun and for the most part this is too. It loses the educational element and the message about embracing being different falls by the wayside somewhere along the way. Yet, this will definitely entertain the kids while not proving too tortuous for older viewers provided they aren't too jaded, cynical, snobbish, or edgy.7.5/10"}, {"rating": "8", "text": "Muy tierna y divertida, la trama es genérica y el villano lo es aún más típico de este tipo de películas, pero cumple con entretener sin ser pretenciosa y Clifford luce de maravilla."}, {"rating": "5", "text": "should have had a cartoon dog using real red dog looks terrible. should have had a cartoon dog using real red dog looks terrible. should have had a cartoon dog using real red dog looks terrible. should have had a cartoon dog using real red dog looks terrible. should have had a cartoon dog using real red dog looks terrible."}, {"rating": "10", "text": "the best movie ever would see it grew up on the book and the tv series dont see other moies till you see it"}, {"rating": "6", "text": "Cute but the villain reminded me of other villains in family films. Pretty similar to the one from the Garfield movie for instance. It also didn’t need a scene of a normal sized dog picked up by a kid so he could smell Clifford’s butt."}, {"rating": "10", "text": "I have watched Clifford the Big Red Dog and it will be released in China soon!"}, {"rating": "5", "text": "The movie was simply below average. It's great for kids tho. Quite nostalgic, sort of, if you used to watch the show as a kid. They weirdly changed some parts. Also, I'm still confused why the mother has a British accent, but the brother doesn't. LOL! Also, when Clifford was a CGI \"puppy,\" it looked like it was just an adult dog whom they shrunk LOL"}, {"rating": "5", "text": "Cliffdog the movie will be like: Ruff ruff I am duggy, this movie is decent."}, {"rating": "10", "text": ""}, {"rating": "10", "text": "This movie was absolutely terrific.  The one-liners just kept on coming, and they were hilarious  Yes it was hokey and fantastical, but I'm surprised that seemed to bother so many reviewers.  I guess they're just too jaded to know a positive message and uplifting entertaining even when it hits them in the face.  Perhaps I was a tabula rosa because I never had any contact with prior versions of Clifford, and maybe that's why I was so moved by this movie.  It was delightful, an unexpected treat.  A movie for the young at heart."}, {"rating": "10", "text": "Best movie I’ve ever seen based on Clifford the big red dog since I was a little kid"}, {"rating": "9", "text": "Maybe the relatable uncle joke was too much. The movie tries to capture the old generations who watched this in cartoon show who are too older and can't watch a cheesy \"Mary Sue\" character and just made an adult version of it.The movie was great and it never breaks anyone's attention on the movie, but if they have removed the \"relatable uncle habits\" maybe the movie would rise over the flop and would have redeemed the remake that they changed from the cartoon show."}, {"rating": "9", "text": "Clifford the big red dog, not in space so better than star wars, should still have the rock in it, but I like dogs"}, {"rating": "6", "text": "The movie is very, very bad in a pretty watchable way. It's got a surprisingly stacked cast, even if none of them are trying too hard. If nothing else, tune in for the worst attempt at an American accent ever committed to the silver screen. I don't know if the decision to have Jack Whitehall do an American accent was intended to torture the audience or Whitehall himself. Whatever the case, it was impressively cruel."}, {"rating": "7", "text": "This movie best for family viewing. It's funny and fine. Children like it ."}, {"rating": "10", "text": "This is a very entertaining movie. Clifford is just so cute especially when he's with Emily-Elizabeth. I actually enjoyed this movie so much I think it brought me back to when I was watching young-kid-friendly television shows and all that stuff."}, {"rating": "7", "text": "You can see that Clifford is CGI, which is obvious for a big red dog. But that doesn't bother me. The behavior of him seems familiar to me. It is a nice family film, with a lot of humor for adults. There are many emotional moments and nice massages. The villain is cliché, but that doesn't bother me. Besides Clifford, I like Uncle Casey best, who provides many funny moments. I have never seen the books and the series, so I can't compare them. I would have liked to see more of Clifford doing typical \"dog stuff\" when he grew up. Overall, an entertaining movie for in between.7,5/10"}], "recommendations": ["beverly_hills_chihuahua", "the_angry_birds_movie_2", "the_ant_bully", "the_angry_birds_movie", "cloudy_with_a_chance_of_meatballs", "the_boss_baby_christmas_bonus", "alvin_and_the_chipmunks_the_road_chip", "the_smurfs", "ice_age_the_meltdown", "ice_age_dawn_of_the_dinosaurs", "marmaduke", "hotel_transylvania", "ice_age_continental_drift", "cloudy_with_a_chance_of_meatballs_2", "despicable_me", "chicken_little", "mars_needs_moms", "yogi_bear", "scooby_doo", "stuart_little", "antz", "my_little_pony_equestria_girls_forgotten_friendship", "hotel_transylvania_2", "dora_and_the_lost_city_of_gold", "igor"]}