{"id": 3337, "title": "Climax", "starring": ["Sofia Boutella", "Romain Guillermic"], "runtime": 97, "genre": ["Horror", "Music"], "description": "Young dancers gather in a remote and empty school building to rehearse on a cold and wintry night. The all-night celebration soon turns into a hallucinatory nightmare when they learn that their sangria is laced with LSD.", "releaseYear": "2018", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/47IXH2iEWwX0F7vIyGXaKQ0psBG.jpg", "categories": {"plot": 7.636363636363637, "acting": 8.294117647058824, "ending": 5.0, "soundtrack": 8.75, "cinematography": 8.083333333333334, "familyFriendly": 3.0, "funny": 5.0, "action": 9.0}, "reviews": [{"rating": "8", "text": "Gaspar Noé's 'Climax' is labelled as a \"trippy drama horror musical.\" Not a lot of people read \"trippy drama horror musical\" and think \"Now that's my kind of movie!\" Indeed, most people will find the movie to be quite objectionable, but that certainly doesn't mean 'Climax' is devoid of artistic merit or accomplishment.The film is a menagerie of dance, neon lighting, long takes, and astounding camera work, propelled forward by a pulsing EDM soundtrack that fills every scene with a frenetic energy. It may best be described as Kubrick's 'Eyes Wide Shut' ceremonial gathering scenes on bath salts. If 'Climax' were a painting, it'd belong in the Modern Museum of Art.We're not quite sure which drug one should be on to see the film, but some drug is definitely recommended."}, {"rating": "3", "text": "Difficult to watch, both because of the subject matter and the nauseating, gyroscopic camerawork, and offers little reward for persevering. It is difficult to empathize with characters too numerous to properly develop, and the horror aspect offered little that was original or unexpected."}, {"rating": "9", "text": "Not for the faint of heartVisually mind blowing and mentally disturbing.Great movie!"}, {"rating": "10", "text": "Damn! This could be Noe's best. Such an amazing film, the dance sequences are great, photography and art direction. Incredible performances too."}, {"rating": "1", "text": "I will not say \"Climax\" is the worst movie of the year because as much as I go to the movies I won't see every movie but I can say right now in March that it is the worst movie of the year that I will see!The movie opens with a girl, bloody, struggling through the snow and then we go to the end credits!  I think, maybe, the director/screenwriter felt people wouldn't stay to the end. We then get to meet the very diverse, in every way, cast mostly young dancers who are wildly exuberant, possibly triple-jointed, twisting turning, popping, locking, doing moves you and I could never even imagine. I was set for a really amazing dance film.Forty minutes later, for the second or third time, I told Allen I was ready to leave whenever he wanted. but he wanted to stay to see where it went. Where did it go? To crazy, bloody, violent scenes, many filmed upside down, a body set on fire and you never know what happens to her let alone be able to distinguish who is who. The film is 96 minutes and I suggest, if you don't walk out at the 30-minute point, you drop some acid and, maybe, just maybe, you will get through the next 68 minutes of the movie.I am not familiar with the previous films of Gaspar Noe but he is one of the very few directors I will avoid in the future."}, {"rating": "9", "text": "To Gaspar Noe: You made one of this decades most disturbing, sickening, disgusting, uncomfortable, horrid films of the decade... And I absolutely loved it."}, {"rating": "10", "text": "\"I'm not fake, you're bore.\"( 100/100 ).Siento que no quiero escatimar palabras, reducir textos y construir frases breves, pero realmente el resultado de toda ésta producción se puede reducir a una sola expresión: Esto es perfección. Sí, yo sé que es una oración que no se debe de usar de cualquier manera y que su valor es tan poderoso como para que solo los dioses se la merezcan, pero si Aglaya me diera la oportunidad de conquistarla le invitaría una crepa dulce y la llevaría al cine a ver ésta muestra de creatividad, ingenio y humanidad pura.El Jazz es un género meramente musical que se identifica por su veracidad y capacidad de generar estructuras de dialogo instrumental a través de la improvisación. Pero hoy me atrevo a estipular al Jazz como un género visual y cinemático también. Éste es el primer acercamiento que tengo al cine de Gaspar Noé y ya con la obligación de estudiarlo en su totalidad declaro que él y su propuesta visual es totalmente Jazzista. Como si la construcción y posterior descomposición de la imagen fuera el tema principal en Climax, Noé entra al estudio con un guión de 5 páginas y la presurosa intención de grabar en solo 2 semanas para mostrarnos una puesta en escena construida en su 80% con improvisaciones. Los diálogos, los bailes y la expresiones del elenco se van adaptando a las situaciones que se han establecido para que, a través de largos y grandiosos planos secuencias, la brocha de la cámara pinte con los actores toda la cinematografía.La actuación, por lo tanto, es una muestra de drama carnal interpretado por cuerpos y almas apasionados por la misma improvisación. Con la intención de querer mencionar a los 24 respetables y excelsos miembros del Cast, solo remarcaré a la merecedora de un Academy Award por su actuación en Climax, Sofia Boutella, quien es, literalmente, la única en el cast que tiene una carrera cinematográfica. Aparte de ella, repito, todos merecen al menos una nominación en los festivales más refinados como mejor elenco o mejor actuación de soporte. El merito está en la capacidad de todos de encarnar una propia versión de una situación que construye personas conscientes y las resume en únicamente impulsos y reacciones epilépticas. El dinamismo emocional que la historia le exige a sus talentos y la creatividad de razonamiento que ellos mismos se crean para generar el arco narrativo, le da ganas al público de aplaudir el nivel de resolución psico-motriz que los actores tienen.En la cuestión visual, existe una poética magistral tanto en la forma técnica de crear la visión como en el contenido de la imagen, pues el uso de la colorimetría apoya la semiótica de la narrativa. Ésta semiotica no es estricta, lo cual hace de toda la película una gran oportunidad para que el público cree una interpretación propia y personal del viaje narrativo. Independientemente de la interpretación que le demos, la cámara y la fotografía, soportadas por el mismo Gaspar Noé, funcionan como las vías de una montaña rusa que jugará con nuestras emociones de la forma más espontanea y brusca posible, dejándonos sorprendidos por la intrusión íntima que logra con su sola estructura dramática visual. Sin darnos tiempo de indignarnos por esa intrusión, simplemente nos queda reflexionar y lentamente regresar a una vida real cuyo sabor no es tan dulce y tampoco tan amargo como lo que se acaba de ver. Ese es el éxito principal de Climax, pues nos levanta del suelo y nos sacude con tanto fervor que una vez terminada la experiencia, la vida real se siente tan diferente y sin la misma chispa de energía que las ganas de volver a sentir ese golpe de adrenalina no faltarán.Hay una gran cantidad de elementos que fluyen y sorprenden al público de diferentes maneras. El ingenio, la innovación y la creatividad que surge en la sala de edición de Noé se siente muy viva a través de la música que usa durante toda la narrativa y los diferentes cortes y elementos gráficos que aglomera en una fiesta de destellos visuales. Las letras, los mensajes, los negros, los blancos, los ángulos, les letreros, etc, todo se intercala para consolar a los ojos y almas de los que deseamos del cine una experiencia intima y espectacular. Tan cerca de ser un desastre que anonada con su osadía.Climax, sin querer hacer el cuento aún más bello, es simplemente una sorpresa, una intrusión, una liberación y una experiencia única en el cine que te puede hacer llorar, vomitar y sonreír."}, {"rating": "9", "text": "This movie is pretty fantastic. Thats all! I was able to get a copy of the french version before this came out in the states but that doesnt really change my opinion to much. Its gorgeously shot, the acting was great, the setting and music were perfect. The choreography and dance scenes were outstanding! Its a movie that feels so real and it excels in almost every department! If u want a better review, i highly recommend checking out YMS' review on youtube. He did a great job explaining what makes this movie amazing. Im giving it a 9 because i wish i understood the dialogue, but if i did watch the english version i would probably rate it a 10! This movie is an incredible journey that i still think about days after watching."}, {"rating": "8", "text": "Fantastic camera work, great dancing, great soundtrack,  which is a precursor to a downward spiral of insanity. When I read the overview of the movie I was intrigued, and this exceeded my expectations. This needs to be appreciated and watched twice to catch every nuance. Great movie."}, {"rating": "8", "text": "Amazing movie which in the beginning may doesn't look too interesting. Choreography in dances was amazing, every actor played their roles in great way and the idea of the plot was really solid. Music is also on point. Totally worth watching!"}, {"rating": "10", "text": "Em termos técnicos é o melhor trabalho do Noe, a direção de atores é muito boa, eles se sentem a vontade mesmo não sendo atores profissionais, conseguem comunicar o que são seus personagens através da dança e da coreografia. A fotografia e a trilha sonora são brilhantes, Noe evoluiu seu trabalho para entregar uma experiencia sensorial forte e marcante. O roteiro é bem simples e isso pode irritar alguns mas quem está acostumado com filmes com essa proposta vai amar esse. Eu diria q esse filme está acima de Irréversibe e abaixo de Enter the Void, quem gostou desses se sentirá em casa."}, {"rating": "6", "text": "Gaspar Noé (Irreversible, Enter the Void) is known for creating trippy cinema…in this case, literally. A group of dancers gathers to…uh…dance and a wild, cool, edgy dance it is! That's followed by a long, rather dull sequence of them talking in small groups. After they drink punch laced with LSD, everything goes crazy. People react in different ways from making love to violence to pure anarchy. Noé continues his unique visual style using extreme lighting, unusual angles and over-the-top performances. This film is not in any way traditional (even the credits are interspersed throughout the film), but those looking for something edgy and experimental may find this appealing."}, {"rating": "8", "text": "A frenetic dance film in which the dancers are consumed by the dance. They don’t quite know what is going on, nor does the audience, as the wild dancing spirals out of control, not only because of the dance itself but also because the punch has been spiked with LSD. A wildly fascinating film without a dull moment."}, {"rating": "10", "text": "One of the best films that i ever watched. Although it is a bad trip from the characters, the film is technically perfect: long shots, beautiful dancing choreographies, solid cast (most of them are not actors/actresses) and directing.Congrats, señor Noé!!! A masterpiece!!!"}, {"rating": "8", "text": "Gaspar Noé again shows us how much sharp is his pen when he writes a plot and how his camera accompanies it when keeps dirty, obscenely realist and sometimes unconfortable but always necessary."}, {"rating": "8", "text": "This is a film from a French filmmaker named Gaspar Noe, and he's infamous among indie and arthouse film buffs for making highly provocative and shocking films. This film follows a French dance troupe dancing inside a deserted school one night and celebrating by drinking lots of sangria. However, tensions rise and things take a turn for the worse when they begin feeling sick and realize that someone has spiked the sangria with LSD. From here, things become increasingly chaotic throughout the film, but the first half also has some cool moments, with some incredible dance sequences and cinematography throughout. However, once the LSD trip really starts kicking in in the second half, it really got a lot more random and aimless, not to say that this is a bad thing, as it fit well with the ensuing chaos. The camera even began filming upside down for much of the second half, which was obviously very disorienting but also kinda cool. Overall, it's definitely full of shocking and grotesque moments. However, it was all so bizarre and unique in a way that I can't quite explain, as it's definitely an acquired taste for most, that I found it hard to turn away from it all!"}, {"rating": "10", "text": "Absolutely insane, 2 words that describes this film. I am not a fan of arthouse and overly experimental movies but this one caught me off guard and made me feel stuff I never thought I'll experience from a movie.The one-shots here are mesmerizing, the improve acting is superb. Easily one of my top 10."}, {"rating": "2", "text": "A dance group are gathered after a practice session they decide to get drunk, the punch is spiked, they pair up and gossip about sex, then everyone goes mental and i don't think anyone could enjoy watching their various bad trips. There's no moral to the story, no reason given. A few end up dead. Save yourself some time and watch a dance track on you tube for three minutes."}, {"rating": "0", "text": "La nouvelle daube de Gaspar Noé suit une bande de jeunes trous du cul au cours d'une \"mégateuf\" qui dérape sensiblement voire tout-à-fait et bien plus si affinités... On a ici des échantillons très (a)variés d'une brochette de divers trous de balle qui \"dansent\"... ou qui gesticulent en tout cas, défoncés ou pas (avant ou après, on ne voit pas trop la différence). Notez que la parité semble respectée et qu'on a autant de connards que de connasses et autant de comportements pathétiques que pitoyables.On est plus proche d'un sale documentaire que d'un vrai film même si on retrouve les manies de Noé comme ses plans-séquences ronflants (et inutiles) ou ses vues aériennes obsessionnelles. Vers la fin cependant, je sais pas ce qu'il a foutu mais il a tout mis à l'envers et tout éclairé en rouge.On ne sait pas trop quoi penser de cette heure et demi au cours de laquelle des débiles font n'importe quoi sur un fond assourdissant de techno boum-boum : ce n'est ni intéressant, ni instructif et les acteurs (?) et actrices (?) sont aussi consternants que ce concentré de connerie filmée. Si son objectif était de montrer que les jeunes sont super débiles, c'est ma foi plutôt réussi... mais un court-métrage aurait suffi dans ce cas !En l'état, son truc est juste super chiant, en plus d'enfoncer des portes ouvertes avec une prétention bien mal venue et lourdingue ad nauseam."}, {"rating": "7", "text": "I liked it. I don't deny it. It's probably Gaspar Noé's film that I liked the most about his entire filmography.I find it hard to call it a more mature job but it's definitely more concise.But I still think he's a pretty overrated director."}, {"rating": "9", "text": "By the last 15 or so minutes of the movie, I started feeling dizzying and motionless at all the chaos and horror unfolding - mainly from the pounding music, the upside down camera, the obscure lighting and everything that happened earlier.Truly immersive experience."}, {"rating": "8", "text": "Climax is not a joy to watch. A bunch of dancers are having a party after rehearsal, but someone has spiked the punch with LSD. The first half of the film is filled with dread as it's obvious everything is about to go wrong at some point. It feels like you're coming up with everyone, but you don't actually want to come up and would rather leave. Then the anxiety sets in as chaos erupts. Bad decisions are made, people are taken advantage of, and aggression becomes common place. The second half of this film is pure terror, both for the characters and the viewer. The relief I felt after the film came to an end was real, and I don't really know the last time a viewing experience stressed me out like this. It's not the most re-watchable film, but it is a memorable one.Oh, also the cinematography is great."}, {"rating": "0", "text": "It's bad enough to watch other people tripping out on LSD, but it's even worse watching them on a \"bad trip.\"  All the credits were rolled first, and what seemed like  the ending was shown too....Noe obviously anticipated losing at least some of his audience.  I walked out once the carnage started.  (The review posted by Bertaut1 is way more interesting than that horrible movie.)  I got my money back."}, {"rating": "9", "text": "A disgusting, morally reprehensible piece of insane geniusClimax, the latest film from Argentinian-French provocateur Gaspar Noé, is a disturbing, depraved, disgusting, and debauched piece of absolute insane genius that I thoroughly adored from beginning to end, and which I never, ever, want to see again. Set in the winter of 1996, and allegedly based on a real incident in France that year, the film focuses on a dance troupe putting the finishing touches to a performance before embarking on a national tour. Upon finishing rehearsals, the troupe starts to party. As the night wears on, it becomes apparent that one of their number has spiked the sangria with powerful LSD, with each member descending into their own personal Hades of paranoia, violence, and/or wild sexuality.In lieu of any kind of title card or opening credits, Climax begins with an abstract and non-descript shot of pure white. It is only as a girl staggers into shot from the top of the frame that it becomes apparent we are looking directly downwards onto a snowfield. After a moment, the girl collapses, and the camera revolves upwards along the vertical-axis through 360 degrees. Revealing the bare branches of a few nearby threadbare trees, the shot immediately establishes that we are in an isolated location in the dead of winter. Theoretically, this could be the clichéd opening scene to any generic slasher movie. However, the economy with which the shot conveys so much information serves to betray the fact that this is the meticulously composed opening salvo of an auteur who knows precisely what he's doing.A moment later, the entire closing credits roll (upwards, obviously), right to the copyright information, and because there are no closing credits at the end of the film, the audience is allowed no transition back to reality. As the film ended, the lights immediately popped on, with no music to play us out, no darkened theatre to recompose ourselves. Indeed, to enhance the sense of discombobulation for which Noé is obviously striving, the last 15 minutes or so of the film are literally upside-down, with the absence of closing credits and the inverted image creating a sense of confusion and discomfort, just as the film is depicting the surviving dancers coming out of their drug-induced mania and back to the real world.After the opening scene, the film shows the dancers' audition interviews, followed by the dance number. The second section is the dancers engaged in conversation with one another after rehearsals. The third section sees them realise the sangria is spiked, attempt to find out who did it, and the chaos that ensues when the drugs take hold. These three sections (dance, conversations, and drugs) roughly correspond to the three books of the Divina Commedia - Paradiso, Purgatorio, and Inferno. However, in the poem, the order is Inferno, Purgatorio, and Paradiso. The film moves in the opposite direction, as the Paradiso of the dance sequence gives way to the calm Purgatorio, before the descent into the Inferno.We then witness a girl's head being set on fire, a pregnant girl being kicked repeatedly in the stomach, a girl slashing her own arm and face, a contortionist contorting to the point where he literally splinters his own bones, a child locked in a room full of cockroaches, a man scratching his chest to the point that it starts bleeding, public urination, lesbian rape, incest, and suicide. It's all very Disney!But is there any kind of theme underpinning the whole thing, or is it shocking for the sake of being shocking? It would certainly be easy to dismiss Climax as thematically empty, but there is a political point buried beneath the carnage; the dance sequence takes place in front of a massive French flag, whilst the credits declare, \"A French Film. And proud of it.\" Perhaps related to this, the troupe is made up of a cross-section of Europeans, and in the explosion of excess hedonism and hysterical mayhem, does this cross-section of ethnicities, genders, and sexual orientations come to represent European multiculturalism tearing itself apart? In relation to this, Omar (Adrien Sissoko), the person who is initially blamed for spiking the sangria, is Muslim. Is Noé saying that in such a multicultural milieu, it's very easy to blame everything on the Islamic \"Other\"?The fact is, I don't have a clue what Climax is about. Nor do I care. I take it for what it appears on the surface; an incredibly technically proficient depiction of a contemporary Inferno, as aesthetically impressive as it is morally disturbing, a film of unparalleled barbarism, that also stands as one of the most extraordinary cinematic achievements in recent years. It's a work of genius. Twisted, sick, depraved genius, but genius nonetheless. It disturbed me like no film in at least a decade, and I couldn't get it out of my head for days afterwards. I absolutely loved every single crazy minute of it. And I never wish to see it again."}, {"rating": "0", "text": "WTF??????? Le film le plus horrible est nul que j’ai vu!!! Aucun intérêt !!! Ah si , juste retourner la caméra à l’envers pour qu’on sorte du film en train de vomir!!! Film sans aucun intérêt, juste pour nous dégoûter !!!!!! Vraiment quel daube et j’insiste bien! Tant mieux pour ceux qui ont aimé, mais ce n’est pas du tt mon avis et je n’es sais même pas pourquoi j’ai regardé ce film!!!!!! :("}, {"rating": "6", "text": "2018 french horror movie. The movie begins with a delightful version of eric satie - trois gymnopedies. Here is that musictrois gymnopediesa crying woman crawling in the snow and a legendary piece of music.Then the introductory interview of the dancers and then another great dance show and music.SupernatureThen, who is interested in whom for a long time, their conversation passes and the first half ends.The second part begins with the understanding that LSD is added to the beverage that everyone drinks and the nation takes flight. As it progresses, the drug effect turns brutal. It also creates a drug effect in the mind of the viewer. But all this does not save the movie from being boring. Sexuality and brutality as much as possible."}, {"rating": "6", "text": "Súper rara, no es para cualquiera, como las de este director. Varias pelis en una sola, empieza con un tipo documental, continua a un musical, pasa a ser tipo KIDS, y termina como una de terror suspenso, y siempre con erotismo."}, {"rating": "9", "text": "Genuinely thrilling and unique film as expected from Gaspar Noé. Even just the dancing alone by the troup is impressive. A great reminder that horror isn't really about monsters, ghouls or demonic nuns or whatever."}, {"rating": "8", "text": "most of the people around me like oh why you like this movie...but damn .i love it..camera movements.. colors(red  green blue) .. charecters acting,,even the concept of the dancers each were killed me.. try it! again and again.. and you will got me!"}, {"rating": "7", "text": "This movie is one of the most uncomfortable movies I have seen in a long time and The movie grasps you in at the very beginning. You watch the consequences unfold as these people slowly start killing themselves as they go deeper down the hole of insanity. The movie has a lot of style and it is different from any other dance movies, and I dont usually like dance movies. A fun but terrifying experiience"}, {"rating": "8", "text": "Love it or hate it, this film is technically astonishing and whatever it's trying to do, it's doing it very well. It's almost like they've trapped the true essence of French Extremism, set it on fire, and followed it with a steady cam.The camera work in this is surreal and its movements, along with the actors' choreography, are surprisingly well coordinated for a \"write-as-we-go\" film.Climax will make you feel a lot of things and I don't think you're going to like how most of those things feel, but that's exactly what makes Climax a very well executed horrifying experience."}, {"rating": "9", "text": "Realism is all we need .Every actor is doing their job so well that this movie is close to real life as far as you can see .The last time i saw a movie like this is Revenge , almost a year ago .Most actors act for money , those actors act for movie .Story and directing are also pretty good !"}, {"rating": "7", "text": "Dance scene at the beginning is wonderful, but the rest of the movie - not so much. I've expected a little bit more from Gaspar Noe, as a fan I know he is capable of doing something more. I am not saying that it was a not interesting watch - I'd lie - but tempo is not good, as I have mentioned before, the opening scene was GODLIKE to left the audience with jaws wide-opened, but what then? Neverthless, still a solid movie to watch, but not with family during weekend dinner. ;)"}, {"rating": "9", "text": "This is one that I’ve been wanting to rewatch since I finished it the first time. Just an incredible achievement in terms of the filmmaking applied. The performances are so believable and the horror is so genuine. The camera movement and the way it flows with the music and alongside the performers is nothing short of jaw-dropping. Climax is such an effective film and one of 2019’s best. This slow decent into madness is one that I will probably take often.\u2028Grade: A-"}, {"rating": "0", "text": "Hipster garbage. Spends the first 20 mins just doing hip **** (showing credits, people talking through tv, people dancing forever). Couldn't take it anymore and turned it off."}, {"rating": "10", "text": "One of the most intense cinematic experiences out there. It's hell. You're gonna want it to stop, but your eyes will stay glued to the screen."}, {"rating": "7", "text": "An uncomfortable and disturbing with a deep buried message about the barriers that the barriers we put on to protect ourselves, the fear of chasing dreams and how we get carried away by stupid things"}, {"rating": "6", "text": "colors, shades, emotions, dance, personalities, combined in a disturbing experiment. it's needs to be watched just to be appreciated for what it brings although the whole movie concept is questionable."}, {"rating": "9", "text": "Impressively disturbing and technically, undeniable Tread carefully, horror fans. This one's not for everyone."}, {"rating": "8", "text": "This is definitely one of the most bizarre movies i've seen ever, but that doesn't mean it's not good. Visually it looks stunning, and sometimes the camera movements on some scenes are very interesting. But let's be clear, the first third of the movie is REALLY SLOW, but it helps to makes us see how's every character from the movie. And then the second third, it's where the interesitng part begins, everything start's so nicely, but as the movie goes on, the situation goes on a stronger way and more deeply into the characters, and finally the final third it's the peak of the madness of this movie, everything that happens it's very messed up, and i liked it. Definitely worthy to watch."}, {"rating": "0", "text": "Um dos piores filmes que já assisti. Roteiro fraco, diálogos péssimos, e o filme deixa muito a desejar em vários aspectos, não dando nenhuma explicação completa para o telespectador."}, {"rating": "7", "text": "Sad story, clearly, but Gaspar is always \"right\" in marking how low and how miserable human beings become. He show us the differents ways to a psicodelic trip."}, {"rating": "6", "text": "The film is concerning and somewhat scary. It is a bit acerbate but the meaning is great and the camerawork sequences mindblowing. Soundtrack could have been improved though, sometimes it overwhelms the audience."}, {"rating": "7", "text": "Very, very good. The reason this doesn't receive a higher score is because it drifted a bit far into depravity, showcasing a lot of truly unlikeable people with repugnant views of the world. It portrays the \"dancer scene\" as being hedonistic, nihilistic, and, ultimately, a group of abject losers.That aside, what made the movie so good was the improvisation, the stakes, how it all fit together, and the filmography. The long shots were incredible, the improvisation made it very fluid. This did not come across as a try hard, high school teenage drama movie. The conversations weren't written by a bored intern. The improvisation was striking. This felt like being a fly on the wall in the midst of a party consisting purely of low life gypsies.The stakes continuously elevate and meander, so the things that come up can be intensely mind-blowing and unexpected. Once you start experiencing the feelings the movie is conveying, those feelings take hold of you and grow. The story takes you along a series of paths, yet those paths don't feel disjointed. They all connect and fit correctly by the end, like multiple hardly used paths in a forest. They all seem adventurous and arbitrary, damning and daunting, yet they all end up in the same place, and in doing so, reveal the calculated chaos of the paths.An enthralling movie, through and through."}, {"rating": "9", "text": "A nightmare of a film that feels awful to watch yet you can't keep your eyes away from the screen."}], "recommendations": ["the_neon_demon", "mandy", "under_the_skin", "you_were_never_really_here", "titane", "enemy", "127_hours", "a_ghost_story", "eyes_wide_shut", "drive", "black_swan", "a_cure_for_wellness", "annette", "the_green_knight", "us", "hanna", "roma", "antichrist", "last_night_in_soho", "hugo", "the_grey", "the_american", "a_history_of_violence", "dunkirk", "bad_times_at_the_el_royale"]}