{
  "id": 3368,
  "title": "Close",
  "starring": [
    "Eden Dambrine",
    "Gustav De Waele"
  ],
  "runtime": 104,
  "genre": [
    "Drama"
  ],
  "description": "Two thirteen year-olds have always been incredibly close but they drift apart after the intimacy of their relationship is questioned by schoolmates.  An emotionally transformative and unforgettable portrait of the intersection of friendship and love, identity and independence, and heartbreak and healing.",
  "releaseYear": "2022",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/nTtKyaaeQhcwiGg8sYcr3XyPdQZ.jpg",
  "categories": {
    "plot": 3.0,
    "acting": 3.0,
    "ending": 5.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 5.0,
    "funny": 5.0,
    "action": 4.0
  },
  "reviews": [
    {
      "rating": "0",
      "text": "Incredibly poor start to 2019 by Netflix. I haven't hated a movie this much since Dog Days. There's a mountain of plotholes, poor cinematography, horribly non-linear and confusing editing, often abysmal direction, trashy acting and poor writing, including dialogue. I didn't want my first review to be a 0 but it is. Watch Bandersnatch instead or something. How this was an English-language release confounds me. Even the intro is a rip-off of James Bond. The plot is also really bad, and sometimes the editing is so choppy it just jumps time mid-scene."
    },
    {
      "rating": "6",
      "text": "\"Close\" (a Netflix original) is a decent actioner with Noomi Rapace starring as a military operative cum close protection officer for a bratty heiress who's in jeopardy of those closest to her. Yes, there are plausibility issues to be found but they're not egregious. One of the key bits of direction I did appreciate was when the young heiress broke down and cried during hostilities - now, that was a nod to plausibility that you just don't find in many current actioners. However, the denouement was hasty and unsatisfying. Director/writer/producer Vicky Jewson could've and should've done much better with it. This film had the potential to be an \"8\" or \"9\" but instead it performs at a \"6\", maybe \"7\" if you're a Noomi superfan."
    },
    {
      "rating": "6",
      "text": "More great work from Noomi Rapace but not a lot else. Not usually a comment I would make about anything on Netflix but it felt like the story needed to be longer. The transitions a little more filled out and the story-end less abrupt."
    },
    {
      "rating": "6",
      "text": "5.5/10 ⚠️Extremely bland and boring, although it is entertaining. Not a good movie but still one of the best of 2019"
    },
    {
      "rating": "0",
      "text": "J'aime beaucoup la (super) petite Suédoise Noomi Rapace et du coup, je guette et me tape presque tous ses films, y compris les plus mauvais qu'elle ne manque pas de tourner à une cadence de plus en plus élevée, essayant (avec succès sans doute) de faire concurrence à ce blaireau de Statham !Je n'espérais pas grand-chose mais c'est hélas une daube de plus à son palmarès ou plutôt son palmerdès. Alors, contrairement à ce qu'on pourrait croire, ce n'est pas une bessonnerie d'Europa Corp mais ça pourrait l'être sur presque tous les plans... presque, car ce n'est pas aussi mal filmé que les conneries du gros.En tout cas, tous les poncifs sont réunis dans ce film d'action écervelé au cours duquel Noomi fait la (super) garde du corps pour une petite bourge de blondasse et jeune héritière que des malfaisants veulent kidnapper à tout prix. On s'ennuie vite, puis on zappe presque aussi vite, car ce navet reste dans l'incapacité de distraire en quoi que ce soit... même avec Noomi."
    },
    {
      "rating": "4",
      "text": "Noomi Rapace does her job, even if her role was hard to be credible.The rest is completely forgettable. An action film made to become lost.Its full direct-to-DVD equivalent just in streaming."
    }
  ]
}