{
  "id": 3635,
  "title": "Closed Circuit",
  "starring": [
    "Eric Bana",
    "Rebecca Hall"
  ],
  "runtime": 96,
  "genre": [
    "Mystery",
    "Drama",
    "Crime",
    "Thriller"
  ],
  "description": "A terrorist attack in London results in the capture of suspect, and the attorney general appoints Claudia Simmons-Howe as special advocate on his defence team. On the eve of the trial, the accused's attorney dies and a new one, Martin Rose, steps in. Martin and Claudia are former lovers—a fact which must remain hidden—and, as Martin assembles his case, he uncovers a sinister conspiracy that places him and Claudia in danger.",
  "releaseYear": "2013",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/keW2sLB9yJbdkRy9yHQjqUjmzbB.jpg",
  "categories": {
    "plot": 6.782608695652174,
    "acting": 6.333333333333333,
    "ending": 5.4,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 5.0,
    "action": 6.666666666666667
  },
  "reviews": [
    {
      "rating": "8",
      "text": "I can't for the life of me figure out why this movie rated to poorly with so many professional critics.  I'm seeing that some think the leads have no chemistry.  I don't buy that at all.  I think their chemistry is palpable..  I also heard the plot would be tough to follow  similar to Tinker, Tailor, Soldier, Spy.  Not even close. Absolutely accessible and thrilling.  Recommended."
    },
    {
      "rating": "8",
      "text": "“Closed Circuit” stars Eric Bana, Rebecca Hall and Jim Broadbent in this British courtroom drama involving terrorism, Britain’s MI 5, and a horrendous crime that is the subject of the film. Well written by Steven Knight (“Eastern Promises”, “Dirty Pretty Things”) and ably directed by John Crowley, this film will keep the viewer on the edge of the theater seat from the very first frame as the story unwinds into the intricacies of espionage, terrorism and the legal system under which all of the parties are operating.  One of the more positive things about this film is that, although the plot is complicated and extremely involved, excellent writing and editing help make the most difficult of legal concepts and problems easy to understand and follow. This is no small task to accomplish given the intricacies and rules of law being applied. I give this film an 8 for above average acting, writing, editing and directing, all of which make for a very exciting theatrical experience."
    },
    {
      "rating": "6",
      "text": "With a title like this, you'd expect closed circuit TV would play strongly in the narrative…and you'd be wrong. The title could have been \"Paranoia,\" but that movie's already in town. Eric Bana and Rebecca Hall play the attorneys for a man who's been accused of a terrorist bombing in London, but there's more to his defense that it seems. Unfortunately, it's nothing we haven't seen before. While it's interesting to watch it unfold and the performances are good, the suspense is not existent. Adding a few angles shot from surveillance cameras doesn't make it original enough to be memorable."
    },
    {
      "rating": "7",
      "text": "I found this to be a rather compelling story and good acting although you must pay attention as it is a some what complex.  All and all a good movie to spend my time and money on."
    },
    {
      "rating": "8",
      "text": "An entertaining reminder that legal affairs are rarely black and white.\r Watch this movie online http://www.watchfree.to/watch-29d64e-Closed-Circuit-movie-online-free-putlocker.html"
    },
    {
      "rating": "5",
      "text": "Moviegoers looking for a moody political drama will find Closed Circuit provides some engaging character beats and interesting (albeit not exceptionally deep) thoughts on government oversight. Strong performances from Bana and Hall help elevate Crowley’s film above similarly predictable thrillers and it’s hard not to admire the director for some risky choices (in both the story and the actual filmmaking). That said, plot holes as well as underdeveloped characters undercut the power of the final film and many moviegoers who are attracted to the thought-provoking political thriller genre will, as a result, find Closed Circuit is too divided, between creativity and commentary, to be particularly exciting or insightful."
    },
    {
      "rating": "10",
      "text": "A refreshing change from your over-the-top, absurd dramas, Closed Circuit was Gripping, Conceivable, required the audience to actually think, featured a constantly and subtly twisting plot and had a firm foundation in the world we live in, and how far people in positions of power will go.\rWhen I came home after watching it, I actually expected to see a news story about the British Justice system."
    },
    {
      "rating": "5",
      "text": "Another paranoid, conspiracy theory, bad government movie, and a rather dim witted one. If we're going to keep resurrecting this theme let's make it somewhat believable, and vet the plot holes. Bana and McAdams play two attorneys on opposite sides in a terrorist bombing case, which has been deemed too sensitive for open court. Bana figures out why, how we never know, and he and ex girlfriend McAdams go rogue with MI5/6 in hot pursuit to stop them revealing the \"secret which would (of course) bring down the government.\" It's \"State of Play\" lite and the intrigue barely simmers at best, and the bad guys win, and the good guys slink off sadder but no wiser."
    },
    {
      "rating": "8",
      "text": "Like most British films, Closed Circuit is a refreshing alternative to the extremely loud and bombastic American fare. This was an interesting movie from the point of view that \"who is doing what to whom\" is never completely obvious. This is a story driven plot held up by competent acting. Is this film brilliant? No. But it does deliver genuine tension and suspense. It is a worthwhile investment of your time."
    },
    {
      "rating": "5",
      "text": "The film is not too long and is an entertaining watch. People who like thrillers will enjoy it. I had a good time watching it. However, my rate can not be higher because it is not too original, nothing truly stands out and it feels like we have already seen something similar before. Still, it is ok to have a good time, not every serious films is made to captivate and be praised. You can definitely stream it."
    },
    {
      "rating": "5",
      "text": "There were some things I liked about this movies and there were others that I didn't like, but in the end, it's satisfying to, but never attempts to amaze. Be sure to check out my YouTube channel \"TheMovieManLife\" for all things movies."
    },
    {
      "rating": "5",
      "text": "Lame, predictable ending... Interesting premise but not very well executed... low energy for a supposed thriller... just ok if you don't have anything better to watch..."
    },
    {
      "rating": "4",
      "text": "After a bomb blows away Borough Market and dozens of human lives, Farrouk Erdogan is arrested. He is the only survivor of the terrorist group that allegedly planned the attack, and he is now at the center of what promises to be the biggest terrorism trial in British history. Forget the John Grisham-style legal thrillers from overseas, though, and expect no “Law & Order” either. This is boring London, with barristers, solicitors, and a lot of technicalities. But there is a catch: in terrorism cases, for reasons ascribed to so-called national security, the Crown Prosecution Service can use classified evidence. Its content can be disclosed neither to the defendant nor to their lawyer, let alone to the general public. This is when a Special Advocate comes into play: a barrister appointed by the State to ensure a fair trial, the sole person authorised to examine the secret evidence and represent the defendant during “closed sessions”. It’s as complicated as it sounds, and given the key role it plays in the film, dialogues are full of ad-hoc explanations, grossly inserted and repeated to ease the audience’s understanding. To make “Closed Circuit” at least a little interesting, the Special Advocate and the barrister, who in theory can’t even talk to each other, are lovers. And they will break all rules to solve the case and defend Erdogan.\r “Closed Circuit” stars Eric Bana as Martin, the defense barrister who likes to go canoeing on the Thames (a perfect excuse to get a shot of Westminster and other characteristic landmarks), and Rebecca Hall as Claudia, in the supporting role of the Special Advocate. The cast also includes the all-but-talented Hasancan Cifci as Erdogan's son, Ciarán Hinds as Martin's mate Devlin, and the great Jim Broadbent as the Attorney General. Broadbent plays the powerful man that loves to blab about how “transparent and fair” the judiciary process is, even if he’s just a tool of the powers that be, who doesn’t hesitate to sacrificy his integrity. His role as Chief Inspector in “Hot Fuzz” immediately comes to mind: looking at him, wide-eyed, always minimising the worst atrocities, it’s impossible not to giggle.\r As the Big Brother is always watching through CCTV, Martin and Claudia’s investigative journey becomes more and more dangerous. Although the trailer warns that “Everyone is being watched” and “every moment is being recorded”, promising psychologically and even politically relevant twists, everything actually dissolves into banal conspiracies and chases through the dark streets of London. But what’s the role of secret services in all this? What does Erdogan's son know that can’t be revealed? Watching “Closed Circuit”’s trailer is enough to answer all these important questions; the film itself doesn’t amount to much. Beyond the first twenty minutes, it’s nothing but an unoriginal collection of the genre’s trademarks. Martin and Claudia’s rush towards the resolution adds very little to a story that already struggles to achieve the right pace and consistency. You find yourself expecting a twist that never comes, and before you notice it, the film reaches the most anticlimactic possible ending. Maybe because real life is boring, and certain things only happen in films. Is this what director John Crowley and talented screenwriter Steven Knight (“Eastern Promises”, “Dirty Pretty Things”) are trying to tell us? If this is the case, I really wonder why someone would choose to watch “Closed Circuit” instead of enjoying real life."
    },
    {
      "rating": "5",
      "text": "This movie is boring, dumb and poorly acted. There is no chemistry between Hall and Bana, when there is supposed to be a lot. Nothing in this movie makes sense, including why it was ever made. It's a no-go."
    },
    {
      "rating": "7",
      "text": "Revealing the truth or sparing the lives with a deal.\r This is from the director of 'Brooklyn' and that's the obvious reason for I'm here. Looks like many haven't liked it, but for me it was an okay film. Seen plenty of similar themes, so I did not find anything special from this. That means easily predictable story, but I just went through till the end to learn how it all ends. Apparently that's how the narration goes, without a twist. You will know right from the beginning who's behind the bomb blast that takes place at the opening.\r Well written screenplay, but that was not enough for the film buffs or the critics, it might work for people who watch films occasionally. Looks like based on the real, but there's nothing in the opening or in the end of the film about it. Eric Bana and Rebbeca Hall as the ex and lawyers, takes up a high profile case which will be a secret trial. So theirs every move will be watched. Until one day they discover the truth which threatens their lives. The rest of the film reveals whether they successfully accomplish the undertaking or not.\r In some parts, it was mild thrilling, but the developments were ordinary. Especially it never clears us the motive, just leaves some understandable terms. This is a dramatised thriller than a cinematised crime-mystery with powerful dialogues and stunts. They tried it to be a quite realistic, but was not successful. So there was not any extraordinary performance, both the leads were pretty decent. Had potential to be a great film may be in addition of a few action sequences. Overall, not a bad film, just one time watchable.\r 6.5/10"
    },
    {
      "rating": "10",
      "text": "The movie was ok to watch.  No real substance.  B acting.   Never really caught my attention. I just was really hoping for something with a little drama but it was really bland. Next time I think I'll do a little more research before spending 13$ on a movie."
    },
    {
      "rating": "10",
      "text": "Well,, it is obvious that MI5, the CIA, et. al. go to the reviewers. The similarities to 7/7, 9/11 are toooo close. Don't want the General public going and start seeing this! Might get them to think! Therefore a few well placed Dollars or threats, some agents writing bad Reviews as users, and let it slide into oblivion."
    },
    {
      "rating": "7",
      "text": "This movie has all the current topics, terrorist bombing, a trial, and behind it all, the British CIA pulling the strings.  Interesting story, a little far-fetched (maybe?) but nicely done."
    },
    {
      "rating": "6",
      "text": "Closed Circuit is a paint by the numbers thriller with few thrills. Despite the exceptional cast of that would please the stodgiest of Anglophiles, there's no tension between any of the characters. In fact, the reason for this is Steven Knight's script, which \"tells\" more than it shows. What we get is characters basically knocking down individual domino plot points with little or no effort or conflict, then scene after scene of the character's exposition of those discoveries. Yawn.\r Worth watching for the set piece of London and an insider look into the British justice system, but not worth first run ticket price.\r Worth a slot on your Netflix / Redbox queue."
    },
    {
      "rating": "7",
      "text": "This is a convoluted conspiracy theory thriller based around a terrorist attack in London.  Though as time goes on, the lawyers prosecuting and defending realise there's more at play than just the facts they're allowed to have.  This puts them in mortal danger.  Sounds good, but the director doesn't do a great job of setting a pace for the film and it seems haphazard in it's flow."
    }
  ],
  "recommendations": [
    "zero_dark_thirty",
    "patriots_day",
    "argo",
    "valkyrie",
    "beirut",
    "child_44",
    "searching",
    "sicario_day_of_the_soldado",
    "snowden",
    "13_hours_the_secret_soldiers_of_benghazi",
    "the_sum_of_all_fears",
    "the_kingdom",
    "knives_out",
    "predestination",
    "allied",
    "source_code",
    "trance",
    "minority_report",
    "blackhat",
    "green_zone",
    "the_accountant",
    "dark_waters",
    "morgan",
    "zodiac",
    "the_good_shepherd"
  ]
}