{
  "id": 3803,
  "title": "Close Encounters of the Third Kind",
  "starring": [
    "Richard Dreyfuss",
    "François Truffaut"
  ],
  "runtime": 137,
  "genre": [
    "Science Fiction",
    "Drama"
  ],
  "description": "After an encounter with UFOs, an electricity linesman feels undeniably drawn to an isolated area in the wilderness where something spectacular is about to happen.",
  "releaseYear": "1977",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/4zfedS25uMAhgm6YQhc9bhKHbLl.jpg",
  "categories": {
    "plot": 6.620689655172414,
    "acting": 7.476190476190476,
    "ending": 7.8,
    "soundtrack": 5.0,
    "cinematography": 7.666666666666667,
    "familyFriendly": 8.0,
    "funny": 5.0,
    "action": 8.333333333333334
  },
  "reviews": [
    {
      "rating": "1",
      "text": "The film was technically ahead of its time but Spielberg's story writing not better than an amateur. It could have been an interesting film if Spielberg didn't fill the plot with unnecessary scenes. He should have  tried to create better connections between the events and characters. Some scene  goes one forever and then story jumps into a completely different scene. Spielberg doesn't want to answer many question about the aliens ,thing it would make the film sophisticates.However it fails  that intellectual touch in 2001:Space Odyssey."
    },
    {
      "rating": "6",
      "text": "Interesting Spielberg film with good acting and music, though the ending is a bit too obscure."
    },
    {
      "rating": "6",
      "text": "This was decent. Is not my favorite, I hate one of sons, who was so terrible."
    },
    {
      "rating": "1",
      "text": "Close Encouters of the Third Kind's biggest selling point is its visual effects. Even today , they look good.however the whole movie is plotless. Rory's argument with his wife takes a lot of screen time yet it never developes story how the other characters and effected UFO's visiting the Earth ."
    },
    {
      "rating": "0",
      "text": "WTF am I missing with this movie? Visually, It still lives up and it is a well-directed film but the plot could have been wrapped up in an hour at the most. It's so slow paced and uninteresting, Not to mention you could predict most of what is gonna happen before it even takes place."
    },
    {
      "rating": "4",
      "text": "Bonne nouvelle : c'est moins gnangnan que E.T. Téléphone-Maison... Mauvaise nouvelle : ça reste niais, tellement niiiiiais que t'en renverses ton lait-grenadine ; ça doit être l'émotion, la même lorsque Casimir se barre de l'île aux enfants.Bien sûr, Spielberg a mis les moyens et sa mise en scène est d'une belle rigueur, on ne s'ennuie pas, sauf à la fin. Même les effets spéciaux ont assez bien supporté les outrages du temps. Chapeau également aux acteurs pour avoir l'air béat aussi longtemps à l'écran, la bouche bée comme les gosses qui écoutent Casimir leur expliquer la recette du gloubi-boulga pour la première fois.Et puis il y a Dorothée, enfin son avatar en plus grand limite cougar, une ex-femen qui a brûlé son soutif depuis belle lurette. Emouvant !Et bien entendu les extra-terrestres avec leurs gyrophares qui sont venus faire la circulation. Les **** Roswells, les proctologues de l'espace et leurs tests très invasifs sur un lot d'humains sélectionnés au hasard (\"tu as été choisi pour participer à une étude clinique très approfondie, merci d'avancer vers la lumière !\".)Enfin, les 5 petites notes de musique parce qu'on communique avec un Bontempi ! vous me direz, on est pas à ça près : on envoit bien un 33 tours dans l'espace, nous autres, alors camembert hein, on ne se moque pas.Non, loin de nous l'idée de se moquer. Mais c'est à partir de ce film que Spielberg a négocié son virage (qu'il n'a jamais totalement quitté depuis) vers le cinéma infantile. Sic transit gloria. Et sa gloire fut courte."
    },
    {
      "rating": "8",
      "text": "A truly great achievement. The special effects are absolutely stunning, they are extravagent and perfectly executed. It is amazing to think this film came out in 1977 with effects like these. In terms of special effects, it is hard to think of too many films that have better ones than Close Encounters of the Third Kind does. On top of that, the film is extremely fun and thrilling to watch. Around every turn is another thrill ride that does not stop until the film is over. The sense of wonder as you watch what unfolds and then the sense of wonder in all of the characters makes this a truly magical experience. With this one, Spielberg truly proves his skill when it comes to science fiction, as well as making his films a ton of fun. His direction of this one is impeccable and I am still struggling to wrap my head around the fact that this film is almost 40 years old with effects like these. A true cinematic achievement."
    },
    {
      "rating": "9",
      "text": "Close Enncounters is one of the most ambitious science fiction films ever done.  It's special effects were years ahead of their time, the characters react believably to their situations, and Spielberg's direction is perfect."
    },
    {
      "rating": "8",
      "text": "In this age of \"special editions,\" it can be a maddening ordeal to sort out precisely what people mean when they say they've seen Blade Runner (narrator or no narrator? director's cut or final cut?) or The 40-Year-Old Virgin. (The 116-minute theatrical cut, or the 133-minute \"unrated\" version?) Sometimes the changes are substantial, other times merely cosmetic, but nowadays, no cuts are final, and hammering out the differences between one version and the next is just another part of the discussion. Credit Steven Spielberg and the producers of the new 30th-anniversary DVD edition of Close Encounters Of The Third Kind for at least giving viewers a choice; unlike with, say, George Lucas' hideous Star Wars trilogy facelifts, no one version has been banished for the sake of another. Even though Spielberg rightly disavows the tacked-on sequence inside the spaceship, which he included on the 1980 \"Special Edition\" reissue, it's still there for those who would prefer their imagination be supplanted by a laser-light spectacular.\r The new DVD includes all three cuts of Close Encounters—the original 1977 theatrical cut, the \"Special Edition,\" and the 1998 \"Director's Cut\"—and better still, a mini-poster-sized map detailing what scene are changed, extended, or missing from each version. Of those, the one that plays best is the most recent cut, which includes the amped-up family melodrama added to the 1980 version, while removing all those insidious shots inside the ship. The film now seems just as awe-inspiring for its scenes of domestic turmoil as it does for its wholehearted embrace of the idea that we aren't alone in the universe. Does Richard Dreyfuss' Everyman hero obsess about UFOs because of a shared psychic vision, or because he can't stand to be around his family any more?\r At the time, Spielberg insisted the film wasn't science fiction, but \"science speculation,\" and he believed that unexplained cosmic phenomena had occurred in the 20th century, and that the government was perhaps active in covering it up. Though he's since retreated into skepticism, Close Encounters benefits from the awestruck vision of a true believer; the pie-eyed reaction shots alone suggest depths of curiosity and wonder that no special effect could ever muster."
    },
    {
      "rating": "10",
      "text": "This was one of the first high budget sci-fi movies from way back.  Well done and well acted, a good story line, many twists and turns along the way to keep you interested, especially the government cover-ups so popular in the 70's.  There are a lot of different versions of this movie, the Director's cut is the best one and the one I have in my collection."
    },
    {
      "rating": "9",
      "text": "Close Encounters of the Third Kind shows how we should be able to take something related to the UFOs and their side of the story and make it sound so realistic and epic."
    },
    {
      "rating": "8",
      "text": "De las mejores películas de Spielberg y una de las mayores obras maestras de la ciencia ficción. Claramente inspiró a películas como 'The Arrival'. Este es el Spielberg que me gusta ver."
    },
    {
      "rating": "9",
      "text": "Spielberg showed how he is good making a clever and at the same time accessible film, pleasing the geeks and casual watchers. Music as a hook and a kid as an emotional vector can really tell it."
    },
    {
      "rating": "7",
      "text": "A wonderful charmed piece of cinematic history. Spielbergs Close Encounters blends the drama of a family afflicted by a traumatized marriage and combine it with a fully effects budgeted mysterious sci fi global phenomena. The biggest innovation here remain its informed depictions of the alien encounters. Fascinating stuff that led the groundwork to some of my favourite movies and tv shows especially x-files."
    },
    {
      "rating": "10",
      "text": "(Labor Day 40th anniversary re-release)What \"Jaws\" did to the water or the unknown terror lurking beneath it, Spielberg's follow up did for the skies or the unknown mysteries traveling above them.  Not only does this hold up forty years later, but its hot at the time UFO and government conspiracy topics seem more intelligent and adult now and are compared to today's juvenile genre blockbusters."
    },
    {
      "rating": "9",
      "text": "I like a lot of Steven Spielberg films, such as Schindler's List, Raiders of the Lost Ark, ET, Jaws and Jurassic Park and Close Encounters of the Third Kind is no exception. Although I have given it a very high score, I do not think this film is perfect. The script isn't the best in a Steven Spielberg movie, but it is serviceable enough. Also Close Encounters of the Third Kind starts off a little slow, but once it gets going, it is exciting and it never stops being exciting.So why have I given it a high score? Well when I was a kid, it was a personal favourite of mine. I especially loved it for the special effects and score. Years later at 18, I dug my old video out and those memories came back. It isn't quite as good now, but I still consider it one of Spielberg's best. The special effects are absolutely spectacular, the cinematography is excellent and John Williams' score is outstanding and one of his better works(Jaws and Star Wars being his best). The story is also quite engrossing, there is a great mixture of mundane everyday life and of course the extraordinary events such as the kidnap of the young child which I still find quite terrifying to this day and Dreyfuss' slip into apparent insanity.Spielberg's direction hits all the right buttons, and while protracted for me the climax is impossible to not get caught up in. The acting is fine, Richard Dreyfuss is perfect as Roy, particularly with the childlike inquisitiveness he brings to the role and Francois Truffant makes for an elegant UFO expert. Overall, this is a fine film and one of my personal favourite films from Spielberg. 9/10 Bethany Cox"
    },
    {
      "rating": "9",
      "text": "There it is guys, Close encounters of the third kind. Everybody loves it, but to me, I don't get it. There are some weird scenes in it for me. One, Richard Dreyfuss is not wearing a moustache.And two, he's watching Looney Tunes. But look on the bright side, I still liked it. I guess this is a wonderful classic."
    },
    {
      "rating": "8",
      "text": "Close Encounters of the Third Kind is an enjoyable film with a very magical and beautiful ending, I just wish the rest of the movie was just as good. The plot and characters weren't as interesting and well developed as some of Spielberg's other films, which was a bit of a disappointment. But overall the movie was still very good and the grand payoff of the ending is definitely worth it. John Williams score is magical and the special effects still hold up pretty good. Definitely give it a watch."
    },
    {
      "rating": "9",
      "text": "One of the early achievements of Spielberg. Another focusing of the alien encounter event, mixed with a universal message of peace, with impressing special effects, considering the production year. Good choice for a weekend."
    },
    {
      "rating": "10",
      "text": "The movie that made everyone fall in love with space and aliens. Amazing and beautiful story telling makes this movie one of the best the ever was. A legendary classic"
    },
    {
      "rating": "10",
      "text": "Close Encounters of the Third Kind is a great film from Steven Spielberg. One of the best UFO movies. A very rare case when contact with UFOs is not invasion or aggression. A great good story about contact with another intelligent being. Classics that will be relevant for a very long time."
    },
    {
      "rating": "7",
      "text": "Classic sci-fi film for sure that show Aliens in a more cooperative light. Not saying the Aliens don't do some really messed up stuff to humans from history if you really think about it for one minute at the end. At least the military and government played it logical. What was they really going to be able to do against all that even if it turned out bad. It would be like a throwing a spear at nuke to stop it probably? This is a film that doesn't answer questions, but asks more questions. I got the sense of the who, but not the why or the how. Seriously what they going to tell Roys' wife and kids? Bad dad went out for a pack of smokes and didn't come back story?"
    },
    {
      "rating": "8",
      "text": "this drama deserves the emotions it goes through..Close Encounters Of The Third KindSpielberg's head scratching sci-fi milestone accounts in the most humane emotion over this two hours of Williams's symphony. Driven by an obsessive vision, the characters float around an honest mundane life in this Spielberg's sci-fi. Not for a split second, he gives away his true intentions of the tone of the feature. It is as much as a family movie, as it is about mankind exploring beyond the boundaries. Your usual household activities, government policies, the means of communication, thirst for knowledge and a self driven persona that it brings out, all these elements polishes this drama into an honest one. The ingenious procedure of Spielberg's fiddling with the props and utilizing the entire frame for the narration, amps up this visual galore that makes you think more than twice.The stunning background score of Williams, meticulous art designing and decent visual effects decorates the tale into an alluring one. Dreyfuss is at charge in here. His obsession communicates widely but what you will take away the most, is his equation with his family and the emotions he goes through in that house. Truffant is literally the supporter and Dillion is a survivor. Tagging each other the plot tracks, this character driven tale passes on the torch with nothing kept prior than the storyline itself.Personally, I'd prefer Dreyfuss obsessing over the uncertainty and the horror that he goes through in its initial stages over the latter stages. Just as he asks for Truffant for some answers, Spielberg makes sure that you too will leave the screen with that amount of thirst. Despite of raising general life changing questions, it delivers a much more personal bold tale of confrontation. Close Encounters Of The Third Kind is a real deal on terms of the maturity it contains, this drama deserves the emotions it goes through."
    },
    {
      "rating": "7",
      "text": "Steven Spielberg is considered, in an almost consensual way, as one of the best film directors of the 20th century, one of the introducers of CGI and one of the main responsible for the great popularization of sci-fi cinema. His record is vast, his list of successes is well known, and his talent and creativity are recognized and acclaimed. This film was one of the biggest hits of his career and is one of the most important alien films ever made. Critically acclaimed, it was a huge box office success and received several awards: in addition to a special Oscar, it won the Oscar for Best Cinematography and was nominated for seven other statuettes, also winning a BAFTA for Art Direction and two Saturn Awards.Personally, I am not an ardent admirer of Spielberg, nor a believer in the idea of UFOs and life outside our planet. It is not for me, and I think it is beside the point, to discuss whether it exists, or whether Spielberg is as good as some say. To me, he's a good director, but he's also made bad movies. In this film, he manages himself quite well, with great personal commitment and great attention to detail. His direction, methodical and attentive, knows how to get the best out of each one involved and guide the cast in the best way to obtain everything they want. Still, I felt at various points that the film suffers from a nagging sense of self-importance, and that it feels more aimed at believers in extraterrestrial life than at a more neutral audience or with more mixed opinions on the matter.The strongest point of the film is, without a doubt, the technical aspects: the cinematography was used with great skill and intelligence and the filming is so well executed that this film seems more actual than it really is. The colors are vibrant, vivid, and not washed out like many other films from this epoch. The special effects and CGI used, although in relatively primitive formats when compared to what we can do today, look incredible and authentic. The melody used to communicate with the alien spaceship has probably become one of the most recognizable in sci-fi, and the entire soundtrack, composed by John Williams, is extraordinary and memorable.The cast is led by Richard Dreyfuss, who offers us, here, one of his most relevant and well-achieved performances. François Truffaut is also impeccable in his role, and his difficulty with the English language made his character and his role in the ongoing plot even more believable. Melinda Dillon was also up to her challenge. Unfortunately, everything else is sketchy, underdeveloped characters for actors who really have little to do or add.The script writing is the weakest part of the film and the one that I was least satisfied with. Instead of inserting the visit of the aliens, and all the associated phenomena, in a well-written and coherent plot, the film does the opposite, drawing around the extraterrestrial visit a series of sub-plots of poor quality, sometimes pulling too much to cheap sentimentality. The movie is very slow and takes a while to gain our attention, and I felt like it didn't really need to have almost two and a half hours with so little story to tell. One of the most surreal moments of the film, for me, is the way that the mother reacts so calmly to the abduction of her young son, but the protagonist himself seems to lose his mind at several moments, and doesn't even get the sympathy and solidarity of his mother. Own family."
    },
    {
      "rating": "10",
      "text": "(96/100)Steven Spielberg has made one of the most intriguing, sometimes slow, sci-fi movie of all time. This is definitely in my top 20 favorite movies!"
    },
    {
      "rating": "8",
      "text": "Uma atmosfera que só o Spielberg sabe criar.A trama trabalha em torno do mistério. Diversas coisas estranhas vem acontecendo e cada vez mais a tensão fica maior. O inicio do filme, lento na minha opinião, faz seu trabalho ao servir de alicerce a conclusão. A atmosfera ao chegar no todo da montanha vale toda a experiencia, e ainda fico me perguntando como seria assistir isso no cinema em 1977.O conceito de Aliens aqui é bem aproveitado. Não sei se o conceito foi criado ou adaptado aqui, mas tenho certeza que funcionou bem, já que mesmo entendendo alguns mistérios por conhecimento próprio, ainda sim me adentrei a trama.Os efeitos visuais são fantásticos para época. A OST deixa a experiencia muito melhor, enriquecendo a atmosfera e criando uma tensão muito distinta do que estamos acostumados. Uma sensação mista de curiosidade e medo de uma forma que só os próprios personagens poderiam sentir nos é passada da melhor maneira até então possível."
    },
    {
      "rating": "6",
      "text": "I'd classify this as an easy watch, not a great film. While the film is both visually and auditorily appealing, by any reasonable standards, not much happens, and there's almost no human interaction in the film. Why Lacombe was portrayed as a non-English speaker I will never know, as it added nothing to the plot and extended the movie."
    },
    {
      "rating": "9",
      "text": "One of the best from 1977 and one of Spielberg's more cereberal movies.A slow burn sci-fi drama, that has a refreshingly positive take on UFO's and life beyond our own planet."
    },
    {
      "rating": "7",
      "text": "7.5/10Close Encounters Of The Third Kind is failed to make me interested on what's going on for 2 hours and 15 minutes, but it still fills with great performance and amazing visual effects, the movie is adventuring himself without thinking to invite the audience, and that's cause me lost interested sometimes and just follow wherever they go, overall Close Encounters Of The Third Kind is still a fun and cool sci-fi movie, it might be not Spielberg's best but it still worth watching."
    },
    {
      "rating": "8",
      "text": "This felt like the most Spielbergy of all the films I've seen by him. Just people endlessly staring at something with the Spielberg wonder expression. Pretty astonishing how well this has held up visually."
    }
  ],
  "recommendations": [
    "blade_runner_2049",
    "the_martian",
    "arrival",
    "interstellar",
    "master_and_commander_the_far_side_of_the_world",
    "dune",
    "avatar",
    "the_bfg",
    "in_the_heart_of_the_sea",
    "inception",
    "blade_runner",
    "the_matrix",
    "moon",
    "minority_report",
    "1917",
    "mortal_engines",
    "europa_report",
    "kingdom_of_heaven",
    "the_social_network",
    "oblivion",
    "ex_machina",
    "war_for_the_planet_of_the_apes",
    "cloud_atlas",
    "2001_a_space_odyssey",
    "hugo"
  ]
}