{"id": 4833, "title": "Closer", "starring": ["Julia Roberts", "Jude Law"], "runtime": 104, "genre": ["Drama", "Romance"], "description": "Two couples disintegrate when they begin destructive adulterous affairs with each other.", "releaseYear": "2004", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/fGGaokx4k00S0J603VG53Qlr9jz.jpg", "categories": {"plot": 6.732142857142857, "acting": 6.8493150684931505, "ending": 6.428571428571429, "soundtrack": 7.5, "cinematography": 5.0, "familyFriendly": 3.0, "funny": 8.0, "action": 6.8}, "reviews": [{"rating": "10", "text": "The acting was great and very believable. It has some amusing moments, and it was very heart-felt. The love square was artfully portrayed. Overall an enjoyable film with great actors."}, {"rating": "9", "text": "Sorry, machine translation. Thanks. The fig leaf and sex of Michelangelo's David Crowded sidewalk in a gray London afternoon of a cloudy and undated. And 'here, that the meeting between Alice, a stripper by profession and Dan, crime reporter, takes place. The song \"The Blower's Daugheter\" Danien of Rice and images, soft and caressing, we hand them over as they approach each other at a slow pace. People do not cover their eyes. Penetrating. Both hint at a smile. Exciting. Screech of brakes for a moment, and ... she is there, on the ground, motionless. Dan is approaching the race, fears the worst, but ... a smiling and reassuring \"Hello, stranger\" gave him the certainty of an important meeting that will forever change both their lives. Anna and Larry form the other pair disruptive. Professional photographer, her dermatologist him with a taste for hard chat. It is in one of the many \"online chat\" with short questions and short answers from erotic tall, Dan \"knows\" Larry. The doctor was immediately taken by the strong sensuality of a journalist who thinks a woman. E 'catharsis. Dan gives Larry, seduced by now, an appointment at the London Aquarium. Who will meet Larry? This meeting is expected that high erotic couples will create new dynamics in the sentimental? The film, for those who are vulgar, restores its centrality to human. The man just because a thinking being, is a dynamic element of the universe, despite the many contradictions that accompany it. Numerous works of art have been, over the centuries, censored, destroyed, ghettoized, declared it obscene. Michelangelo's David was hidden sex with a fig leaf to avoid the redness to Queen Victoria. Well done the cast, a superb interpretation of Clive Owen. \"Good ciak!.\""}, {"rating": "9", "text": "Really good movie! Remind me of Match Point. Natalie Portman is absolutely wonderful, but all the acting is amazing. The best point of this movie is that it's really unpredictable. Worth the view."}, {"rating": "10", "text": "This movie captures something about love that most romantic dramas do not - the unpredictability. The only flaw I can find in this movie is the way it clumsily skips through years without warning. Natalie Portman was slightly underused also despite out-shining the rest of the actors and having the most interesting and relatable character by far. Owen also displayed a tremendous amount of talent, however."}, {"rating": "10", "text": "one of the better movies ive seen and i watch it alot, cos it so real about relationships in todays age, love it everytime i see it, clive owne owned all the others in thsi film :)"}, {"rating": "10", "text": "one of the best movies I've seen, visually stunning and great acting.Portmans performance was brilliant, and because she played the most interesting character. Roberts character was also interesting and she played her self well in this role."}, {"rating": "8", "text": "Closer is a movie about fear and maturity. It is about lonely people seeking lovers capable of fulfilling themselves and saving them in a certain way. People looking for strangers to entertain them in a childish attempt to find their own happiness. And they cover their fears with lies until the very end of the movie.\r Dan lies to Alice for a year not telling her that he is dating Anna. Anna hides her feelings for Dan from Larry and Alice lies about his real identity to everyone the whole movie (except in the scene in which Larry asks her real name in the strip club, because she knew he was not going to believe it anyway).\r Ironically, the only character that always tells the truth is Larry, what does not redeem him from his rudeness against people. Attitude which equals him to the others in the maturity level.\r Each of the four characters idealize people, fall in love and start relationships when they are actually not ready for them. They never try to figure out why the relationships are not working, they simply jump to another crush when they are bored or face the other person imperfections, showing immaturity to deal with problems. Dan falls in love with the beautiful red-haired foreigner and then suddenly goes after the pretty photographer in a demonstration of unstable emotions.\r The movie is full of smart dialogues and outstanding quotes. Most of them performed by the characters of Portman and Owen, which received some nominations and won a few awards for their supporting roles. I guess Alice most memorable quote defines the movie accurately. In the strip scene she says to Larry \"Lying is the most fun a girl can have without taking her clothes off - but it's better if you do.\" And this is what the movie brings us: an intricate and fascinating plot of individuals living a world of lies to fill their empty lives with fleeting pleasures. The director allows us viewers to be closer enough so we can see the dynamics of this relationships that reflect perfectly well the complex nature of our interactions in the world as human beings and the masks we use to hide ourselves and live as strangers."}, {"rating": "9", "text": "Strange, weird. beautiful, endearing, funny and one of the great play adaptations. Closer features all the actors in their best form and the direction is great. I give this movie 88%."}, {"rating": "8", "text": "What on earth was Morgenstern watching or was it the fact he had to be different to the generally favourable reviews. This is a film which as a man made me uncomfortable because the character played by Law was such a complete ass. But then none of the characters are what one would call loveable. I think this movie would be ideal for someone who was trying to decide whether they wanted to enter the damage zone which relationships open everyone up too. Anyone who makes a claim that the film characters do not exist is really very deluded. Where do you think divorce, adultery and the other unpleasant forms of betrayal come from?  Some of it was very funny. In these \"girl power\" times I would recommend it to men and women equally because in this movie neither gender comes out too well."}, {"rating": "5", "text": "Based on an award winning play Closer tells the story of four lovers across a four year period. The movies theatre origins are apparent throughout with its small cast and succession of two person scenes. While this is not necessarily a bad thing, most scenes are certainly well written and performed admirably by the cast, it can make their story seem very isolated from the outside world on occasions.\r Despite these excellent performances however the biggest problem I had with Closer is that, with the possible exception of Alice (Portman), it is very difficult to feel any sympathy for any of the characters and their predicaments. Throughout the film their behavior makes them continually come across as totally unlikable to the point that by the films conclusion the ongoing drama between them becomes closer to irritating than interesting."}, {"rating": "7", "text": "Maybe it's Natalie Portman... maybe it's Clive Owen... or Julia Roberts or Jude Law. Closer keeps you fascinated with these dynamic performances. Mike Nichols proves his career did not diminish long ago following The Graduate."}, {"rating": "6", "text": "There is something about Closer than is entirely off-putting. It is not the fact that it is a film about four people that are, well, unsavory characters. I can handle films about people I do not care for. The problem with Closer is it feels like a 2000s drama that is soulless. I have seen this a few times before (The Reader by Stephen Daldry comes to mind immediately) and there was something about this film that made me feel as though it would not be my cup of tea. This was ultimately the case, even though I did keep an open mind while watching this film. The experience, however, is just far too hollow and director Mike Nichols' cynical look at love just feels surface deep. We all get that love is challenging and messy, but Closer is mostly unengaging and just seems to float by and offer obvious insight into the messy nature of love. That said, there are positives to Closer. As always, it is marvelously well-written for the most part and the acting is terrific. In particular, Natalie Portman steals the show, though Clive Owen turns in a good performance as well.Showing the romantic lives of Anna (Julia Roberts), Daniel (Jude Law), Alice (Natalie Portman), and Larry (Clive Owen), the film shows the four characters swapping dates pretty consistently. Alice and Daniel sleep together. Daniel and Anna sleep together. Anna and Larry sleep together. Larry and Alice sleep together. Everybody is sleeping with each other in this film. Complementing these scenes are the people finding out their significant other slept with somebody else. Everybody cheats here and the film does have a lot to say about infidelity. For Nichols, infidelity is clearly a common act, but one that needs to be admitted to immediately. Though common, it is still disgusting, but only if you do not admit to it immediately. Case in point, Larry cheats on Anna with a hooker but tells her immediately. Meanwhile, Anna is heavily criticized for sleeping with Daniel for over a year, but never telling Larry until he brought up his infidelity. Moral of the story: cheat on your significant other, but be upfront about it and things will be alright. This is a constant thread as the people consistently want confirmation that their significant others slept with somebody else and then only get mad when they do not admit to it immediately. Other than this, Closer offers insight into how sex can be used as a weapon to hurt others, people's insatiable desire to cheat on their significant other, and how love hurts and can never be enough to keep somebody. Insightful stuff.Closer is also plagued by its timeline. Jumping forward by years upon years at the drop of a hat, Closer lost me more than once in its timeline. All of a sudden, Daniel and Alice had just met and then, immediately afterward, it was a year later. This is where a large portion of the soullessness I mentioned previously derives from. This desire to speed things along comes at the expense of developing a connection between us and the characters. Yes, there is a lot revealed in the scenes shown, but the process of them falling in and out of love would be a lot more emotional and rewarding if we got to see more than just a highlight reel of their relationship.This said, Closer has great dialogue. I may mock its relationship insights, but it is hard to deny that its relationships are well created in the moments we are given with them. Here, they can be powerful at times, in particular when Alice and Daniel embrace after he admits to cheating on her with Anna. This scene is very emotional and highlights the tremendous performance by Portman. Throughout, she steals the show and really puts in an emotionally raw performance. No matter the scene, she is the highlight of this film. Similarly, Owen - as a scorned lover and pervert - is brilliant. He has a natural charisma and it really shows here as he able to play such a chilly character with a cool, laid back demeanor throughout. However, he is equally adept at turning it up a notch, such as when he confronts Julia Roberts' Anna about her infidelity. An intense scene, Owen wins the scene by capturing both the anger and the pain that Larry feels in this moment as he presses her for intimate details about Anna and Daniel.Though disappointing, Closer affords a great opportunity to watch great actors do their thing. Other than a few scenes that were noted above though, Closer lacks the emotion and insight needed to actually pull off a film of this type. None of its takes are revolutionary and instead feel entirely derivative and cliche takes on love, rather than an examination into the lives of these characters."}, {"rating": "7", "text": "Beautifully acted and directed movie from the legendary Mike Nichols, this movie avoids cliches and is a very sweet romantic drama that just follows your head for days. Great work from Owen, Law, Roberts and Portman"}, {"rating": "6", "text": "Dörtlü ilişkiyi çok güzel bir şekilde işleyen ve günümüzde ki ilişkileri gözler önüne seren bir yapım. Ne istediğini bilmeyen ve gönlü iki farklı kızda olan ve kıskanç olan bir adamın ilk önce striptizciyle çıkıp onu beğenmemesi ardından fotoğrafçı anna ile birlikte olup kendisinin ortaya çıkarttığı kıskanç olmayan bir adama iki sevgilisini de kaptırmasını anlatan, izlerken insanı gerçeklere dair üzen ve düşündüren bir film."}, {"rating": "7", "text": "Natalie Portman is too attractive for anyone's good."}, {"rating": "0", "text": "Many there really are people who are cynical enough - or stupid enough - to find merit in a movie about four such self-destructive imbeciles. The artsy types (such as many so-called movie critics) love to embrace the \"honesty\" of psychologic pathology. This moive has no shortage of that. Fact is, only people who derive some form of perverse joy in watching idiotic people engage in idiotic dialogue for idiotic reasons might find merit in this movie. The rest of us would do better to spend the money at McDonalds."}, {"rating": "9", "text": "Well written. Well crafted. Well acted. If you didn't like this movie, it is because you didn't understand it. Anybody expecting to see pretty woman deserves to be disappointed."}, {"rating": "8", "text": "An honest and compeliing, if perhaps somewhat contrived film, about male emotion when applied to relationships. The dialogue is tough, but real, and well written, as it not only conveys the emotions of the characters, but also show wit and intelligence. The characters all have flaws, and all become conniving and unlikable to some degree (maybe too much), and yet it all seems understandable, though not always agreeable. All the actors perform well, though Natalie Portman and Jude Law were cast to their strengths, while Julia Roberts plays against character and does a fine job. Clive Owen, to me, provides the best performace. I wanted to like him and dislike at the same time. I liked his character's honesty, and disliked him for his brutal truth attitude toward sex and realtionships. Those who who fear frank discussions about sex and realtionships should skip it."}, {"rating": "3", "text": "Pseudointellectual writing and great performances. Dialogue is mediocre and contrived. Not grounded in reality."}, {"rating": "2", "text": "\"Closer\" is a very well-acted, well-directed and well-edited piece of junk. Unlikeable characters I can take; an unlikeable film is something else."}, {"rating": "0", "text": "Nothing is more pathetic than cinema and amateur critics who rave over a movie's \"honesty\" just because the characters portrayed within it are psychological and spiritually corrupt. Sad commentary. Unless you're 1000% cynical (or terminally stupid) avoid this movie at all costs."}, {"rating": "9", "text": "I adore it I hated it the first time because I was slightly disturbed......at its honesty I suppose. Here is the thing it is honest truthful of breaking down people.....are all people cheaters and decievers? NO but everyone keeps some kind of secrets and has weaknesses and some let go of inabitions and some live by them until the day they die. but in the end is anyone really happy with the life they have? or what they have? There are a very few who can say yes. the majority say they are unhappy. The acting was brilliant and the plot was fantastic. Anyone who gives a low rating (no offense) but they probably treat life as a fairy tale this shows just a little piece of people inside and out.(Again dont take offence(I am dating a person who acts as life is a fairy tale) :O)"}, {"rating": "8", "text": "Rather sad - but honest."}, {"rating": "9", "text": "The best film i've ever seen."}, {"rating": "3", "text": "Great to look at. Nothing more. Critics loved it because it's provocative and controversial. Washington Post got it right. Highbrow s..t."}, {"rating": "1", "text": "I have a profound loathing of this film. Real people do not talk like this. It asks hard questions like \"Why do rich, beautiful, vain, self centered, urbanites treat love as a commodity and sex as a form of power politics\". The film looks great as do the actors but it is presented as an authentic look at modern relationships, but this is as divorced from reality as any fantasy. The characters are emotional children, real people do not act or talk like the people in this film, it is a rich coffee table intellectuals view of humanity. This is a world view that has not been informed by genuine hardship. It is an A Level students view of modern love. I like a bleak film as much as anyone, the bleaker and more pessimistic the better, but this film lacked a key ingredient: RELEVANCE. This film explores the sexual politics of a metro-sexual elite, it is not a genuine universal exploration of love and the damage it does."}, {"rating": "3", "text": "Mildly entertaining but unltimately empty and lacking in so many areas. Cannot remember another film where ALL of the main characters are so unsmpathetic and unlike able. At the end of the day I didn't care what happend to any of them, just hope I never meet people like them in my personal life."}, {"rating": "10", "text": "I just had to react to some of the coments left here. First time I do, but I think this movie is worth it. Some people here have obviously never seen a bad movie and should go to the cinema more before they drop comments. calling this movie \" the worst [they] have ever seen\" is either admitting they have very little to compare to or conceiding they were shocked/felt insulted by the movie (which in itself doesn't mean the movie is bad). Some may never have lived such situations or felt such feelings, and/or find them to be the expression of a pervers nature. This just isn't a movie on the way human beings sometimes cooperate to make a better world. Deal with it. As for the dialogue's they may not be realistic when removed from the scenes to which they belong, but who cares ? cinema isn't about writing everyday life exactly like it is, it's about giving the illusion of everyday life. If you watch this movie with an open mind, you'll get sucked in. If you're just waiting for an occasion to rate julia roberts acting, or if you came because the big names printed on the big posters reminded you of sweet love stories (be it in a galaxy far far away or in a nearby brothel), go chat on the forums, write to your favourite magazine, yell out your anger, but don't give this film a 0, your deception has nothing to do with its value. Every word, every sentence, especially in the breaking-up/fighting scenes came when and how I wanted them to come. Maybe noone in real life would be so crude (and I honestly don't see why not) but we've all deeply wanted to ! (I actually came to admire Clive Owen's character for his raw honesty) And since when do the characters have to be likeable to make a good film ? You may hate these people after seing the movie... but how is that bad ? you've felt strongly against them : this movie has brought you strong feelings ! Now you know who you definetly are not (although I dare think that whoever says he/she is not even a little bit concerned is either a liar or has lived his/her entire life in a box, alone). Now to the \"honest but shallow/hollow exploration of the human nature\". I am French and have lived in France many years. I was culturally brought up by french cinema and I therefore know what a hollow movie on human nature is, I have seen many failed attempts, (Just think that only the \"good\" ones make it abroad, and even they have a hard time), watched everlasting minutes of raw rape scenes, bared crying men on stools in empty rooms for half an hour, and heard endless, pointlessly intellectualized dialogs. This is not one of them, this movie goes to the point and it gets there fast. Sure, it doesn't explore every aspect of the characters' lives but that just makes it more universal. Most people agreed on the fantastic acting (Owen, Law, Portman AND Roberts) and the beautiful score, so I'll just skip that. Actually I'll stop here all together, I'm growing tired of English grammar and I've made my point. Closer is a great movie. Period."}, {"rating": "2", "text": "This movie tries to do a lot. It tries to be thought provoking, it tries to be raw, it tries to be deep and it tries to be brutally honest. It was not truly any of things. The dialogue was forced and contrived, attempts to be profound merely come off as beautiful, spoilt people displaying their idiotic and warped notions of life, formularized to the last drop. The film is so horribly self conscious it made me grimace to watch it, it was as though the only thought given to the film was that raw automatically equals artistic quality. I hate to say it, but it does not. A soulless and sterile movie that is void of any depth, despite far too obvious attempts to the contrary. It is the Da Vinci Code of films; garbage that is made to appeal to the pseudo intellectuals."}, {"rating": "2", "text": "Cloying, affected and tiresomely self-important. Performances are lacklustre, from the insufferably dull Clive Owen to the overemployed Julia Roberts and the altogether useless Natalie Portman. Even the usually impressive Jude Law doesn't do this a lot of favours. Not that it's an easy task to be asked to spew out such trite, pretentious dialogue at the behest of a pretentious director."}, {"rating": "10", "text": "This is a film so complex and clever that it is bound to go over the heads of most of the viewing audience. Every word that is spoken has a double meaning to it, and if viewed with the understanding of this ironic level, the experience is far richer."}, {"rating": "9", "text": "I can understand where moviegoers looking for an escape may be turned off by this movie. However, for those of us whether we are sentimentalists, cynics, heartbreakers or heartbroken this movie speaks to you. In an age where knowing people exists via chatrooms and notions of true love are scoffed at by those who have actually loved, this movie encapsulates what many of us go through. For those who have loved, who cant love, or who want to.....check this out."}, {"rating": "9", "text": "This is definitely a movie that will be either loved or hated. The acting is really outstanding, not hollywood cliche, but powerful and gritty with so much substance that it is easy to relate to each character as they develop through the film. The story contains an overwhelming amount of raw emotion and honesty, and unfortunately I think this turns alot of viewers away, but the reality of the story is what I really appreciate about this film. If you have ever known love and heartache, this is a must see."}, {"rating": "7", "text": "Problematically, Closer feels exactly like a play. Then in the credits I had my suspicions confirmed. The 4-person cast, ostentatious time lapses,and perpetually heady dialogue make a great play but a mediocre film. If only those like the paralleled opening and closing sequences occured more frequently, Closer could truely be called a film."}, {"rating": "0", "text": "Insufferably pretentious plot, insufferably contrived dialogue, insufferably self-important film. In short: insufferable. A hollow and disappointing offering from Nichols. And Natalie Portman may be purty, but she's a soulless phony. I don't think that piece of driftwood could act her way out of a paper bag if it had a hole cut it in. Don't get what all the fuss is about over her performance."}, {"rating": "7", "text": "Closer was a surprising twist on love. Those who claim it is 'the worst' movie they have ever seen, have obviously never viewed the movies Norbit and Epic Movie. The characters were involved, the only disappointing part was that this movie was borderline pornography, not in the visual sense."}, {"rating": "10", "text": "One of the very few movies showing true relations - with uniquely truthful direct speech between the characters, and amazing music selection!"}, {"rating": "10", "text": "One of the best movies I have ever seen."}, {"rating": "7", "text": "I think this movie is not too bad, and I guess there is no joy in this movie but overall the cast in this movie is very good in the act it. This movie is stated about the honesty"}, {"rating": "0", "text": "I don't think I've ever watched a worse movie except for Spawn.  I understand the desire to write a movie full of adults who behave the way a high schooler might imagine adults behave, but you spend most of the movie embarrassed for the writer wondering \"at what age did they realize how vacuous their notion of social interaction was when they wrote this\".  I highly recommend it for people who are constantly baffled by a growing distance between friends and family as they are socially marooned by their own social inadequacy."}, {"rating": "8", "text": "Closer is a great film. Jude Law, Natalie Portman and Clive Owen were amazing. Julia roberts was good too. The plot was smart and I have to say that it is a funny drama romantic film. It is not like all the american kind of these films. Closer is a masterpiece of its kind and i have to admit that I didn't expect it to be such a good film. The screenplay is smart and it has a \"twist\" which i liked a lot. Thumbs up! The actors should have won the Oscar  8,5/10"}, {"rating": "6", "text": "In the end I found there was too much drama and changed feelings. Also the characters changed too drastically, Dan for example was an Alpha in the beginning, he did everything right and in the end he was such a loser, its very unrealistic. The actors were great."}, {"rating": "9", "text": "The sublime performances of four acclaimed actors tell a story about loneliness and fear of loneliness as all the characters desperately look for \"love\", but \"love\" is a feeling that they will never have for each other. \"Closer\" is a good movie, most notable for Portman's acting,  that will leave the audience with anger and delusion."}, {"rating": "8", "text": "They say that in love and war all's fair, right? A point in favor of this film is that it shows some freshness when it comes to love relationships, with accidental encounters and infidelities. Those who are looking for something different from the typical formulas, already know where to ask."}, {"rating": "9", "text": "Is one of the best movies I have ever seen. It's that good. Great acting by everyone really. This movie has incredible dialogue. This is a must watch movie for adults."}, {"rating": "6", "text": "it's because she doesn't need me..CloserThe relationship is dissected and diagnosed in all aspects which comes off intriguing at first but too much of anything isn't good and in here the writer chews it off way too much to even create an impact on any character let along connect with the the audience. Mike Nichols is brilliant on executing a dramatic scene just as it was anticipated on screen which factors in a lot here. The feature shines on performance level and utterly completes it objective through Natalie Portman, Jude Law, Clive Owen and Julia Robert's who are in their A game. Closer has a gripping screenplay that is filled with witty conversation and competitive arguments that upbeats the score which is carried off by electrifying performances."}, {"rating": "5", "text": "This romantic drama is one of those movies that leaves us truly at a loss for what to write. I don't think the movie is bad, it has a lot of qualities, but it's tiring because it never gets beyond the conflicts and unresolved issues between the two main couples. It's like an ongoing relationship discussion.The film features two couples: on one side we have the ex-American stripper Alice and Daniel, an obituary writer and potential writer; on the other we have the photographer Anna and the doctor Larry. The two couples know each other, by different casualties, and they develop cross-relationships in which the conflict and divergence are permanent. It's a complex story, in which couples switch, separate, mix, fight. It's a smart story, very well written and with excellent premises, even though there is a good deal of improbability in it all: in fact, I can't conceive of anything like this happening in real life.The best part of this film is the excellent performance of the four main actors: Julia Roberts, Natalie Portman, Jude Law and Clive Owen. We can't say anything bad about any of them, they were up to the challenge put to them, they incorporated their characters wonderfully, and they did a truly remarkable job of dramatic interpretation. They are the ones who make the movie really worthwhile. Of course, they benefited from the good material they received and the really good dialogues they were given. About this, a note of warning: these are dialogues that often use and abuse heavy slang, and this should be taken into account by more sensitive audiences and young people before seeing the film.Technically, the film has ups and downs... I really liked the cinematography, which looks somewhat ethereal and liquid thanks to a good use of color and contrast, shooting angles and London's low sunlight. The choice of filming locations also seemed happy, and the construction of sets and costumes is within what I expected. However, Mike Nicolls failed when he wasn't able to give more dynamism to the film, which is always lukewarm, slowly cooked, with a tiresome, drowsy rhythm that numbs the audience. The soundtrack doesn't help to overcome the feeling of tiredness and drowsiness, with the choice of the song \"Blower's Daughter\", in the monotone voice of Damien Rice, proving particularly unhappy."}, {"rating": "6", "text": "This is a drama film with romantic elements and it covers themes including trust and deceit. I thought it seemed relatively well thought out, with interesting characters and a decent cast (more on that later). It is a little slow to build, plot pace wise but I found it overall a relatively easy watch. I felt there was a sense of oneupmanship (or oneup-woman-ship perhaps may be more to the point) present not long after the film started.This is very much a 21st century film, with the internet playing a part in the plot. Its quite saucy, as you might imagine. Some scenes were quite amusing - I found myself giggling at times. Some of the scenarios, or plot details, are a bit ludicrous but also quite cringey - if your very much a prude then this film may well not be for you, I'll say that much. The characters all seem to be of an aspirational type - that is, middle class but seemingly keen to climb up to upper class status or higher/upper middle class types, which may put some people off. There is a definite sense of some of the characters seeming brazenly quite selfish but then things don't go as easily as they may hope. I won't elaborate so as not to spoil the film for potential viewers.  Its one of those films where the viewer finds themselves trying to guess what will happen next, what someone will do and whether or not others will realise and in which we potentially ponder the ending quite far ahead of time. If your not at all keen on character driven dramas, then, as I've said numerous times before, this may not be for you, as it does consist of a lot of dialogue and not especially exciting scene settings.Cast wise, the film stars Julia Roberts as Anna, a professional photographer who is a little jaded perhaps. Jude Law plays Dan, a far too casual yet somewhat sharp witted guy, while Natalie Portman plays Alice and Clive Owen plays Larry. There is definitely a meeting of minds, type battle of the wits situation between Dan and Larry, which is quite well portrayed, while Alice comes across as a more sensitive type.Content wise, the film contains constant, quite strong sex references, some nudity but no full frontal. There is also strong language present and some violence, although nothing especially graphic. Characters are shown both smoking and drinking alcohol at times. The film has been given a 15 rating to reflect this content.The plot seemed very insular, to a point by which it may feel a bit nauseatingly claustrophobic. I suppose it depends on your personal preferences, what type of films you enjoy and so on, as to whether this would appeal to you. It is definitely unsettling at points, although its hard to explain precisely why.Its hard to say whether I'd recommend this film or not. It features a good cast and has a few amusing moments, although it isn't for very prudish people and neither will some plot aspects appeal to some, such as the selfish nature of some of the characters and the social class aspect present too perhaps. I thought it was ok - its a decent character driven drama I suppose but I'll leave it up to yourself to decide if its one for you or not."}, {"rating": "6", "text": "I think the phrase emotional rollercoaster was created to describe this movie. The amount of melodrama packed in is quite frankly exhausting. You definitely need to be in touch with your emotions or maybe female to get the most out of this film. However it does highlight two things. The acting ability of the cast and the fact that Natalie Portman is one of the most beautiful women to have ever walked this plant."}, {"rating": "10", "text": "Closer is a brilliant ensemble drama with four award worthy performances. ::::::"}], "recommendations": ["blue_valentine", "secretary", "20th_century_women", "her", "me_before_you", "manchester_by_the_sea", "the_fault_in_our_stars", "thoroughbreds", "the_good_shepherd", "elle", "the_hunt", "marriage_story", "the_reader", "collateral_beauty", "revolutionary_road", "all_the_bright_places", "the_perks_of_being_a_wallflower", "legends_of_the_fall", "lady_bird", "the_descendants", "the_intern", "lovelace", "up_in_the_air", "crash", "the_book_of_henry"]}