{
  "id": 1576,
  "title": "Cloudy with a Chance of Meatballs 2",
  "starring": [
    "Bill Hader",
    "Anna Faris"
  ],
  "runtime": 95,
  "genre": [
    "Animation",
    "Family",
    "Comedy"
  ],
  "description": "After the disastrous food storm in the first film, Flint and his friends are forced to leave the town. Flint accepts the invitation from his idol Chester V to join The Live Corp Company, which has been tasked to clean the island, and where the best inventors in the world create technologies for the betterment of mankind. When Flint discovers that his machine still operates and now creates mutant food beasts like living pickles, hungry tacodiles, shrimpanzees and apple pie-thons, he and his friends must return to save the world.",
  "releaseYear": "2013",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/tT2DN1tWk1zpCxqvaaNY8yP8Awn.jpg",
  "categories": {
    "plot": 5.6521739130434785,
    "acting": 6.16,
    "ending": 6.5,
    "soundtrack": 5.0,
    "cinematography": 8.0,
    "familyFriendly": 6.571428571428571,
    "funny": 6.627906976744186,
    "action": 6.0
  },
  "reviews": [
    {
      "rating": "9",
      "text": "Cloudy with a Chance of Meatballs 2 maybe is one of the most ridiculous and exaggerated ideas of this year, but... don't care, is an extremely funny sequel, with a cool animation, much funny moments, I could no ask for anything more, Cloudy with a Chance of Meatballs 2 is one of my favorite movies of this year!"
    },
    {
      "rating": "8",
      "text": "While Cloudy with a Chance of Meatballs 2 might not deliver the same cross-generational appeal as the first film, it’s a worthy sequel that smartly iterates on the core storyline with a new and entertaining direction. The foodimals will keep members of the film’s kid-friendly demographic entertained and tongue-in-cheek social satire provide some decent chuckles for parents (as well as older fans of the prior installment). In general, Cloudy with a Chance of Meatballs 2 doesn’t taste quite as fresh as the original recipe but the film offers more than just re-heated leftovers  with another funny and entertaining adventure that justifies a second helping of Flint Lockwood and friends."
    },
    {
      "rating": "3",
      "text": "what happened to the first \"cloudy with a chance of meatballs\" movie! This movie seems like its a clone of the original! The animations seems to be not as good! The story is forgettable, not as funny, seems like they did a sequel just for the money! :-("
    },
    {
      "rating": "7",
      "text": "While not as intellegent as the previous movie, Cloudy with a Chance of Meatballs 2 is funnier with its food puns and more action-packed that channeled a Pixar movie."
    },
    {
      "rating": "7",
      "text": "Being a fan of the first Cloudy, I was excited to check out the sequel.  While the original is better, mostly because it has more heart, there's lots to keep adults and kids entertained here.  It starts off a bit slow, giving a short review of what happened in the first film for those who didn't watch it (which was definitely thoughtful), but once the story unfolds it pulls the viewer in. It's not a spectacular story; the twists are pretty predictable, but it has a good flow and there are no dull moments. Sony did a fantastic job with the visuals  very colorful, vibrant, and the living food really come to life.  Humor was in good supply, and the food-related puns were actually quite clever.  My only real problems with the movie were the somewhat lacking story line and the protagonist Flint, who didn't seem nearly as endearing as I remember him from the first movie.  They made him too wacky and all over the place, and it's hard to imagine kids relating to him or remembering him as a character they'd like to emulate.  Still, Cloudy 2 will keep you entertained enough, and it's worth watching it at least once, especially if you craved more after watching the original."
    },
    {
      "rating": "9",
      "text": "I love the first movie--it became my favorite animated movie of all time--and I found I really enjoyed this one, too!  Once again, the movie is just plain fun.  The animation looks fantastic, the food animals are creative and amusing, the voice acting is great and, like the first one, it's just hysterical.  While I didn't think it was as gut-busting as the first one, I still laughed a lot and I really want to add this to my \"repeat viewing\" list (come on, Blu-Ray release date...hurry up and get here!).  However, the one thing that I loved the most had to have been the background designs.  The way they created the landscapes into food-based locations was very creative and pretty cool to witness.  Overall, it's a decent and fun follow-up to a epic first film!"
    },
    {
      "rating": "10",
      "text": "Cloudy with a Chance  of Meatballs 2, was AMAZING!! If you liked the first one you will love this one too!! :D\rIt was so so CUTE!! I love all the cuteness of the mutated  foods!! I died from cuteness over load! I even teared up a little because of how cute and happy everything was. XD(I just love how cute everything was)\rBut I enjoyed the movie very very much and I am sure you and your kids will as well!!   it's worth the money spent! Enjoy!!"
    },
    {
      "rating": "6",
      "text": "Decent film, slightly above average, the film is full of food puns and is very light heated yet while the first film is full of greater messages and comes off as enjoyable for all ages Cloudy with a Chance of Meatballs 2 has been crafted to entertin younger chilren which for someone of my age is very slow and boring, it doesnt have that impact that over family films such as Frozen has over all views.\r Cloudy With A Chance of Meatballs 2 is a 6/10 for ages 15+ and a 8/10 for Children below the ages of 10"
    },
    {
      "rating": "10",
      "text": "i don't know why people didn't like if this is such a cute movie, i'm a  big fan of this and i really liked the first one and this one..hope we'll get a new one soon"
    },
    {
      "rating": "6",
      "text": "It's a \"good\", and funny film for the kids, but the jokes are really not that funny at all. The story went smooth through the first half of the film, but then it kind of just went down hill, from there. The first Cloudy, was funny, and  had a lot of creative  ideas pitch in there, however I felt like the squeal was to predicable, and the scenes just went too fast. I felt like they could've done better, with the music, and whatnot, but the kids well absolutely enjoy it. I'm ranking this a 6.9, or a D+"
    },
    {
      "rating": "4",
      "text": "I understand that people find this film enjoyable. But as a followup to the first CWACOM, the sequel fails at every turn.\r The story all but ignores what Flint learned previously and makes him learn it again, but with less clarity and focus. The only saving grace is that Flint and his friends were so well designed and characterized in the first film that some amount of charm has carried over. But considering these are some of the funniest and brightest animated characters of the last several years, they really missed the mark with each one of them. Additionally, the new characters stick out like sore thumbs because they were created with less care and attention that Phil Lord & Chris Miller gave their characters in the beginning.\r Watch the sequel and then immediately put on the original... The former might not hold up as well anymore as you start to see just how much better the original was at telling a story and making you laugh."
    },
    {
      "rating": "6",
      "text": "I couldn't really think of a plot to add to the first movie and apparently neither could the writers. I absolutely loved the first movie so I was destined for disappointment. All of the story lines had been resolved and the world was safe again from food. Little did we know that Jurassic Park had been resurrected. Actually one of the best scenes recreates the first time in that original movie that we see the reanimated dinosaurs. Only this time they are animated and made of food. What a total ripoff! That is another movie series that should never have gone on. Of course in Hollywood if something works, then you need to keep doing it until you get it wrong. Flints relationships with his not really girlfriend deteriorates to the point of co-worker and the father son turns more into man and his dog. There are some fabulous scenes and humor as well but not enough meat on the bone even for our seven year old. After 20 minutes the kids were bored and the adults just wished it wouldn't degrade into potty humor. It did and that was unfortunately the only real laughs the rest of the way. The morals and lessons weren't too bad except they were just rehashed from the first movie and rather than expanded more like contracted. The funny food animals and especially their combined names were a bright spot in an overwhelmingly dull afternoon. Please do not make a number 3. We all know what happens to leftovers the second reheating."
    },
    {
      "rating": "2",
      "text": "To start off I love animated movies, those geared for children and adults.  I've been watching Pixar movies long before my children were born.  Understand my love of these types of movies before you read my critique.\r The visuals were very creative, and stunning, but that is all the positive things I can say about this movie.  I took my 9 year old twins with two of their friends, who seemed entertained, but nothing in the writing held my attention.  Very weak story and the jokes meant for the adults were very bland.  I fell asleep two times during this movie."
    },
    {
      "rating": "5",
      "text": "While it's not as bad as some might expect, it's no where close to the first movie. Overall, did they really need to make a sequel, plus this movie is more for kids than teens or adults. Be sure to check out my YouTube channel, \"TheMovieManLife\" for all things movies."
    },
    {
      "rating": "6",
      "text": "Positives: Witty and fun, this movie is full of both imagination and humor. The food puns will get you every time with their sharp and witty nature, and the story is simple enough for even the smallest of children to understand and enjoy. The CWACOM series has kept true to the style they had in the original, which is both fun and funny within every moment of the film.\r Negatives:Though this movie wasn't really in need of it, depth was a lacking part. The plot line was beyond ridiculous and much of the older audience with become fed up and bored with it's fast paced nature. No connection to the characters was present, and the animation was only mediocre. All of these aspects were obviously secondary on the directors priority list."
    },
    {
      "rating": "3",
      "text": "What a disappointment! The first movie was fantastic, but this one was mediocre. Hardly funny and the animation was a bit iffy, not smooth. If it wasn't for my cineworld pass I would demand my money back!"
    },
    {
      "rating": "9",
      "text": "Honestly I liked this movie better then the original. I mean Flint Lockwood trying to be his idol.But the thing that makes it better is the foodimals."
    },
    {
      "rating": "8",
      "text": "Solid pun-heavy amusing animation aimed primarily at kids.It was refreshing to see a genuine fun movie for kids with my daughters, they don't like most new movie animations since they try to be too serious about things, they're just kids that like to watch a movie with funny characters doing funny things in cute places. Personally I liked that the movie had a nice \"lesson\" in it too, it's brief and clear, it doesn't come off as preachy at any point.The movie also doesn't have all those forced long emotional scenes every movie for kids has been forcing in since Toy Story (which actually did it well), the emotional moments are short, sweet and genuine.If you're an adult watching this movie for yourself you'll be wrong to expect this one to be as good as the first, it's definitely not a bad movie, but I didn't feel as engaged with it as I did with the first one. Many of the original's characters return and some of them have sub-plots that get resolved in just one scene and no arc, they feel like they're just along for the ride because they were there in the first one. It isn't quite as good as the first, but it's definitely one of the good ones for kids."
    },
    {
      "rating": "4",
      "text": "Cloudy with a Chance of Meatballs 2 is one of those cashgrab sequels in that it was only made to make money and cash in the success of the first one and it clearly shows. The story is nothing special it is generic, cliché, rehashes the first one and rips off the plots of other animated films, and honestly feels like it was written in one draft made in one hour. I don’t care for the characters and any attempts at humor mostly fall flat. Even the animation isn’t that great, for reasons I cannot put my finger on the animation is painful to look at and some of the character models are painful to look at. That being said I can’t entirely bash this film as it is geared towards kid and as far as kids movies go its not awful I have seen far worse. There are films such as Planes were it was painful all the way through and I just wanted to stop watching. Then there are movies like The Wild were they makers were like **** it and then there is Foodfight, which makes me ask why. This movie will most certainly provide some joy for the kiddies but unfortunately that’s about it. Everyone else don’t feel obligated to watch this movie. Skip it and watch something better. There isn’t enough good in this movie to make it worth watching."
    },
    {
      "rating": "6",
      "text": "A perfectly acceptable and harmless animated comedy. It will delight it's younger viewers with it's bright and colorful animation, adorable food critters, and tons of food puns. Older audiences won't be as entertained, but they can still appreciate the film for it's goofy quirks and for the fact that it will totally entrance their kids. So if you are looking for a something to watch on family movie night this is a good pick. It might not be as enjoyable for adults as it is for their kids the way a lot of Pixar and DreamWorks movies are, but they won't be completely irritated by it."
    },
    {
      "rating": "6",
      "text": "The original film was a humorous and original masterpiece. This film on the other hand falls short in that regard.\rWhile there is still an indisputably long list of jokes, the humour for the sequel is more childish and weak, with the exception of some classic puns. However, on a pun note, a large majority of the film’s dialogue is solely puns, with some even being repeated, not allowing any powerful story-line or morals to develop, resulting in this – a predictable (and frankly, dry) plotline from which you can know the outcome of the film within the first 20 minutes, such as with blatant foreshadowing and the villain; as soon as you see this certain character, you know he will be the villain without a doubt of hesitation, making the character very bland and uninteresting. Additionally, the story is very confusing at times, as quite often the scenes are very fast-paced with events happening too quickly for the audience to understand. It almost seemed the creators were really trying to squeeze as much in as they could, but quality is always better than quantity.\rOn positive notes, the animation was certainly fluid – with one character’s animation being truly original with quirky elements that were very humorous and imaginative. The creativity of some ‘foodimals’ was remarkable, and the world itself was truly colourful. Seeing some of the returning characters was also very joyful, but I will note that some obvious cameos seemed very forced.\rIn terms of the original, this film also seemed to disregard its own lore created in the original, going against a lot of the reasoning to the first film’s story and creating an entirely new reasoning, such as: why Flint wanted to become an inventor.\rConcluding, it is an enjoyable film targeted for kids, but if you were hoping for the same originality as the first film, you might want to stick with the first meal and not go back for seconds."
    },
    {
      "rating": "7",
      "text": "This year's animated films seem to have been somewhat below par so this sequel is refreshingly welcome even if it's not quite as good as the original. Story wise there isn't much to shout about it's just the good guys vs the bad. Visually, however, this is jaw droppingly amazing stuff. Beautiful colouring and some real imagination is on display here and this is enough to cement over the cracks of a screenplay that is at its best when batting out funny one liners. There are loads of jokes about the food characters on show. I particularly liked the 'leek on the boat  gag, and the one about cutting the cheese is proof positive that toons are no longer positioning themselves just for kids (Para Norman made that perfectly clear). The animal/food names are very inventive what with shrimpanzees, flamangos, tacodiles and melophants, and if  the humour at times is a bit corny (pun intended) it non the less raises a smile and is often very funny. Even the requisite cute character, a strawberry with the oh so original name of Berry!, is more tolerable than usual. Good fun."
    },
    {
      "rating": "6",
      "text": "The title itself is not suitable for this sequel. I guess 'Jungle with a Vicious Foodimals' or something like that would have been fair to be called. Unlike the first part I just found this movie more kiddish. The last decade was the beginning of 3D animations, so it captivated large group of audience with awesome movies. But its time now people to understand animations too would have such low movies like this.\r Whatever you thought might be, but in my view and for my age, it did not please me like other animation features. I don't know about teenagers, but children will enjoy it for sure more than anybody else. I have not denoted the movie had flaws in the technical aspect, but the theme divides the audience as per age differece.\r The dialogues were what kept me alive. Many of them were very hilarious. One of it was 'It's enough to make a grown man cry. But not this man. Get back in there, tear'. In some portion the character Chester V annoyed me, I think that is what they wanted from a villain character.\r This movie itself an unnecessary follow-up so I don't want another sequel unless they initiate back the first movie concept of what title is represented. I don't understand what Lockwood and Co gonna eat if all the vegetables and foods get a life who become their friends. Forget it, it goes on and on and on..."
    },
    {
      "rating": "3",
      "text": "The first one was not just a story about inventions and food - it was also about people, and had characters with content, that developed throughout the plot. The humor evolved naturally from their personalities.The sequel has none of the above, replacing them with flashy animations, too much food puns, and a contrived plot that climaxes with yet another \"Nature Vs. Industry\" conflict that doesn't make sense - and not in a good way."
    },
    {
      "rating": "5",
      "text": "The sequel for Cloudy With a Chance of Meatballs fails to deliver the same kind of rush the first one did. In that respect, it rings short in its message and doesn't provide as many laughs."
    },
    {
      "rating": "7",
      "text": "After \"Cloudy with a Chance of Meatballs\" became a box-office success in 2009, Sony Pictures Animation jumped at the idea of making a sequel, as one would expect them to do. After the first film turned out to be a pretty inventive and fun film, I was pretty excited for this one. And while it doesn't hold a candle to the first film, \"Cloudy with a Chance of Meatballs 2\" is still a solid animated film. The animation is pretty good overall, the film itself is pretty funny, and the characters are not bad either. Sure, it can't help but feel like a little bit of a retread of the first film, but \"Cloudy with a Chance of Meatballs 2\" is still a good animated film that's fun for the whole family."
    },
    {
      "rating": "7",
      "text": "The main course is better than the opener as Cloudy With a Chance of Meatballs 2 is filled with countless hilarious food puns and some very dazzling visuals despite its shaky start and predictability."
    },
    {
      "rating": "5",
      "text": "I loved the first movie. It turned tired cliches into hilarity, gave Mr. T his first animated role since himself and was one heck of a lot of fun. While directors and writers Phil Lord and Chris Miller were busy on The LEGO Movie, Sony whipped up a sequel, hiring the writer of The Incredible Burt Wonderstone and the director of Open Season 2, and while the critics seem to like it quite a bit, I felt that Sony Pictures Animation disappointed me yet again.\r Cloudy With a Chance of Meatballs 2 has potential with its inventive designs, environmentalism and sweetness, but unfortunately it is only half the wit of the first, most of its attempts at comedy being food puns that start to get boring, repeats of whatever was funny in the first or even itself, none of them succeeding, and typical Hollywood poop jokes to make sure it doesn't get a G rating, the worst thing that can ever happen to a movie!\r The new voice actors lack charisma; Terry Crewes is even less Mr. T than Quinton Jackson and Kristen Schaal is far from Mabel Pines or Louise Belcher. Not to mention the theme of the plot twist has been discussed before in animation history. This is exactly the kind of movie the first one was poking fun at.\r Without Lord and Miller, or even Aardman, Sony Animation seems to be style-over-substance. They have some very talented animators who provide the cartooniest CG animation since the first Madagascar, but the output should be more than eye candy. A year ago, Hotel Transylvania paid more attention to unique animation than an inspired script; the rest was a sponge bathing itself in urine. In this movie, Chicken Brent comes along with the gang just to repeat his catchphrase and fall over repeatedly because FAT PEOPLE ARE COMPLETE DOPES.\r It doesn't help that Sony's big return in 2015 will consist of sequels to that and The Smurfs - as if 2013 wasn't lousy enough."
    },
    {
      "rating": "4",
      "text": "Of course the film is original and filled with amazing animation and vivid views, but that doesn't make up for the silly script and acting. Kids will enjoy the film, but the rest of just stand thee awkwardly which unlike the first film, didn't happen."
    },
    {
      "rating": "5",
      "text": "cloudy with a chance of meatballs is a whole other world it does get cool at times but  i did not enjoy the sequel as i thought . the first one is much better"
    },
    {
      "rating": "9",
      "text": "As good as the first movie.  The characters are all back and just as funny.  Apart from Mr T being replaced by Terry Crews this movie is Fantastic! I love it, my kids love it and so should you."
    },
    {
      "rating": "7",
      "text": "The main course is better than the opener as Cloudy With a Chance of Meatballs 2 is filled with countless hilarious food puns and some very dazzling visuals despite its shaky start and predictability."
    },
    {
      "rating": "6",
      "text": "3/5★ Fantastic animation, creative world building and nonstop action aside, the film is not as clever as the prequel. I know its a kids movie, but kids movies today have to cross the high bar Pixar films have set. We have seen what is possible and wont settle for less.\rVerdict: Keeps the kids entertained"
    },
    {
      "rating": "6",
      "text": "Cloudy With A Chance Of Meatballs 2 is cute and dazzling movie but suffers with it's annoying characters some of them are underdeveloped and it's plot.But It still has potential to be good movie with it's silly animations and cute foods walking around helping the gang to stop the evil corporation.The Sequel isn't really better than the first movie but it's still a fun kid's movie that anyone,well not everyone can enjoy."
    },
    {
      "rating": "7",
      "text": ". Cloudy with a Chance of Meatballs 2 dives in deeper in its appetizing-utopian realm, and it's a bit unnecessary at times, but it's still able to provide hilarity, colorful personalities and heartfelt vibes, that though it isn't as striking as its predecessor, it's still solid."
    },
    {
      "rating": "6",
      "text": "\"Cloudy with a Chance of Meatballs\" was a respectable sequel to what we saw a long time in the animated genre, another story of Flint Lockwood and his friends, with new characters, and the unbearable look, and attitude of the living food of the island."
    },
    {
      "rating": "8",
      "text": "Bottom line: Cloudy with a Chance of Meatballs 2 is the best children’s movie I’ve seen in a long time; I'd highly recommend it to anyone and especially those with children.\r I remember reading Cloudy with a Chance of Meatballs, or at least having it read to me, when I was little. I was apprehensive when the first CwaCoM film came out. I thought the animation was too wiggly and I didn’t like the idea that they changed around the story. I didn’t even see it. Flash forward to last night, at her request, my fiancée and I watched the recently released sequel. It was such a good decision.\r Just like any sequel, the movie begins with a plot refreshment but it was short and sweet. It brought me up to speed and smoothly transitioned into the new movie. From a young age, Flint Lockwood has dreamed of becoming a world changing scientist/inventor like his hero, the CEO of Live Corp, Chester V. Flint eventually makes a device that changes water into food. The machine malfunctions causing the island on which Flint, his family and friends live to overflow with food. Flint destroys the device to prevent a global catastrophe. He and his friends decide to make a lab together to invent and change the world. Chester V (well, a hologram of Chester V) arrives to the food covered island and invites the islanders to live in San Franjose, CA. Flint is given a job at Live Corp, a science company whose flagship product is the Live Bar.\r Live Corp, and Chester V, is a source of constant, funny jabs at Apple and Steve Jobs. The Live Corp logo, a light bulb, is everywhere in the sleek, white design of the company headquarters: the building is a giant light bulb and it has a fancy light bulb shaped water feature. The entry-level inventors work in a cube farm in the basement of the building, tirelessly inventing for the biannual induction ceremony where one inventor becomes an Inventronaut, the upper echelon of Live Corp employees who have proven their scientific prowess. Numerous “caffeine stations” provide free coffee while videos of Chester V speaking play at “Motivation Stations”. Meanwhile, back on the island, Flint’s invention wasn’t destroyed. It has continued to create food but the food has evolved to the point that the fruits and vegetables are now food-animal hybrids like Flamangos and Cucumbirds. I am a fan of puns and, if you have seen the trailer, this movie is full of them. Chester V orders Flint to shutdown the machine to save the world from the food-animals.\r I mentioned, previously, that I thought the animation was a little too wiggly. After watching the movie, I can say that I was incorrect; it's colorful and energetic. The same can be said about the humor. It was light, pleasant, and consistent. One of my pet peeves about children’s movies relates to the poor attempts at humor. There are fart jokes, poop jokes, or slapstick. They make me uncomfortable because I don’t think they are funny and I don’t think they should be such a source of humor. Then there are the jokes geared towards the parents because they go over the heads of the children. When I was little, this was a source of frustration. I was aware that there was a joke but I didn’t understand it. I felt like the movie was banishing me to the children's’ table. CwaCoM 2 doesn’t have many of these two types of jokes. It is an accessible movie. “Ah! There’s a leek in the boat,” yells Lockwood. The camera cuts over to a vegetable sitting in the boat which returns an equally startled yell. If a child didn’t know what a leek was the jokes would not be lost and it would give the parent/s the opportunity to explain the joke.\r In terms of characters, they are all were pleasant. I loved the relationship between Sam and Flint the most. It is clear that they are a couple but the end goal isn’t to get married and live happily ever after but to make a laboratory and invent. They want to change the world together. Sam is a capable scientist who isn’t relegated to the position of damsel in distress.\r I don’t know how I feel about attitude towards the food-animals. At one point, Sam says, “You can’t eat them, they are alive!” What are they supposed to eat!? Sam’s objection, of course, is an common reason for becoming a vegetarian but now what are they going to do for food in general? If they shut off the machine, the food-animals will die, but it is stays on, the machine will keep making more. Does this mean people will just have to make sure the food they eat is home grown, or at least, not sentient? Perhaps this is can be interpreted as a statement about responsible food production practices. It isn’t a question the movie directly raises or address, it was just something that came to mind. The main message of the movie is about friendship.\r The sense of humor is refreshing and the animation is bright and happy and so is the story and characters. If I had children, I'd have them watch this movie and would recommend it to anyone looking for a happy movie."
    },
    {
      "rating": "7",
      "text": "Well... I believe you can live up the first few minutes of not being starved by this movie. The comedy doesn't work here, but after a few minutes... it'll just be like the first movie all over again."
    },
    {
      "rating": "8",
      "text": "\"Cloudy with a Chance of Meatballs\" is the kind of movie that needed a sequel. In part two of Flint and his wonderful/monstrous machine, the entire town in now being transported to California while a new character name Chester V. and his crew clean up Swallow Falls. But as Flint and the gang sneak their way back to Swallow Falls after a month, they realized that Flint's machine had created an entire forest with the food being alive and representing animals. Such as Shrimpanzees, Watermelephants, and tomatoes! The movie features the same protagonists from the first film, so nobody was missed out. And all the jokes are pretty much low humor comedy that you'd typically see in your average animated movie, but CWaCoM2 does it in such a way that it is 10 times more hilarious. The only real issue with this movie is the moral. Or should I say, the ridiculously obvious moral. Unless your really into animals and nature, I wouldn't look so much into the moral of the story. But overall, a hilarious and charming movie."
    },
    {
      "rating": "5",
      "text": "A good movie, colorful and very cheerful.I don't really like to see the sequels before I saw the movie that gave rise to them, but this movie aired on television today and I decided to see it. To write this review I first had to read something about the first movie, which I haven't seen yet but will see. So I won't say if this movie fits in well with the movie that precedes it ... maybe later I have a clearer idea. I will look only at this movie.The script is interesting: In the first movie, after an accident, a weird machine starts making live food to the point where the city needs to be evacuated. Its inventor, Flint Lockwood, eventually destroys the machine, saves the world, and is eventually called to work with Chester V, a world famous scientist he idolizes. In this movie, however, everyone finds that the island is still populated with animals made of food, the machine is still active and needs to be turned off. However, as Flint gets closer to his idol, he becomes detached from his friends and unknowingly enters a sinister and mysterious scheme set up by Chester V, which is not quite as innocent as it seems.Okay ... I confess this movie sounds surrealistic. Animals made from food and live food is something we don't see every day and it sounds pretty childish and boring for adults. It was one of the reasons why the movie didn't catch my eye when it circulated in theaters. I think I made a mistake. The film is not childish, and has a lot of material that will please or at least entertain a more adult audience that accompanies children to the cinema. The plot involves some more adult themes, such as betrayal and falsehood, the importance of friendships and the role of parents in the lives of their children, even suggests a romance between the protagonist and his best friend. There is also an environmental message implicit in the film. The characters are interesting and appealing, the villain oscillates between the sinister and the hilarious ...Technically, there is little to say. The work of the voice actors is impeccable, as expected, and the quality of the animation is superb, the state of the art today. Vivid, colorful, vibrant and imaginative, this film is a visual spectacle. Of course, there are strong appeals to sentimentality and the construction of animals has been designed for it. The soundtrack also sounds pretty good, with one or two songs that can be easily heard.Far from perfect or remarkable, this is a good animated movie. Not being too childish, it has enough material to please children, adults and teenagers. I don't waste the time watching this movie, even though I've seen it a lot better."
    },
    {
      "rating": "7",
      "text": "This movie is the same as the first one but slightly better. The only problem is the villain. Basically the first movie expanded upon."
    },
    {
      "rating": "6",
      "text": "With it's slick, soft-hearted characters, it may not have the first movie's food-raining extravagance, but it will certainly leave the audiences' appetite quenched."
    },
    {
      "rating": "7",
      "text": "I think this movie is pretty good but what holds it back from being a great film is that the story is rehashed the character designs are lazy and the villain is the same as the villain of the first cloudy film"
    },
    {
      "rating": "6",
      "text": "Flint Lockwood now works at The Live Corp Company for his idol Chester V. But he's forced to leave his post when he learns that his most infamous machine is still operational, and is churning out menacing food-animal hybrids. (6)"
    }
  ]
}