{
  "id": 1799,
  "title": "Cloud Atlas",
  "starring": [
    "Tom Hanks",
    "Halle Berry"
  ],
  "runtime": 172,
  "genre": [
    "Drama",
    "Science Fiction"
  ],
  "description": "A set of six nested stories spanning time between the 19th century and a distant post-apocalyptic future. Cloud Atlas explores how the actions and consequences of individual lives impact one another throughout the past, the present and the future. Action, mystery and romance weave through the story as one soul is shaped from a killer into a hero and a single act of kindness ripples across centuries to inspire a revolution in the distant future.  Based on the award winning novel by David Mitchell. Directed by Tom Tykwer and the Wachowskis.",
  "releaseYear": "2012",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/8naVv2Xu3rWI5JKHz0vCujx6GaJ.jpg",
  "categories": {
    "plot": 8.75,
    "acting": 8.541666666666666,
    "ending": 7.0,
    "soundtrack": 9.666666666666666,
    "cinematography": 9.0,
    "familyFriendly": 3.0,
    "funny": 8.0,
    "action": 9.4
  },
  "reviews": [
    {
      "rating": "10",
      "text": "This was a remarkable movie, and I enjoyed every minute of it. I did not read the book but now I intend to. I understand that this is not a movie for everybody, but it's a movie for adults. The music and editing was so well done and that is just a cherry on top of this homage to film, love,  life, freedom and what it all means to us. Brilliant!!!"
    },
    {
      "rating": "10",
      "text": "Cloud Atlas is a unique movie, and that should be enough to go see it. You want more? It's also emotionally powerful, funny in the right places, exciting on more than one occasion and it has a message it wants to deliver"
    },
    {
      "rating": "10",
      "text": "Never while watching a film, have I been so utterly perplexed. Even as the credits began to roll, my jaw was dropped, my eyes glued to the screen. What had I just witnessed? At that point, I wasn"
    },
    {
      "rating": "10",
      "text": "Cloud Atlas places you in the lives of six individuals, separated by race, gender, time and culture, and establishes a feeling akin to walking into a library, filled with timeless books of the past, present and future, with no intent to leave. Each story is intelligently edited and narrated, as common themes and plot progressions flow into one another. The acting, makeup and imagery are also excellent. This is a movie about love, institution, freedom, power and the amazing simplicity of the human nature. I do believe this philosophical dreadnought could not be steered by any other than the Wachowskis, and is most aptly described by many viewers as ambitious for its scope and diversity. As one of the characters describes, \"A half-finished book is a half-finished love affair\", I would, too, feel truly incomplete if the stories met no conclusion and were stopped short. I am not disappointed in the book-movie incongruities, as these two items establish themselves with different goals and visions of the same plane. While I understand this type of movie is not everyone's cup of tea, you will most definitely leave the movie theater acknowledging that it was a few dollars well-spent."
    },
    {
      "rating": "10",
      "text": "Very unique movie. I was thoroughly entertained throughout! The scope and performances are exceptional. This is a MUST SEE. Ignore the critics! The public rates this movie above an 8 everywhere and believe me, it deserves it. One of my favorite movies of the decade."
    },
    {
      "rating": "0",
      "text": "Incoherent. Had about 40 places where it could have ended. Worst movie of the year. Just lost 3 hours of my life never to retrieve. Beware the same fate."
    },
    {
      "rating": "9",
      "text": "It isn't hard to understand just why this movie didn't do itself justice at the box office. Given that dumbing down is so prevalent and the average consumer attention span struggles to come to grips with any script containing substance or integrity. This is not a movie, it is a masterpiece, a work of art, a peephole into the soul of humanity. The continuity alone is beautifully orchestrated. Colourful, rich, vibrant, affecting all emotional responses. A rare standout movie in a time of shallow plagiarism. Six stories entwined in one, offering sci-fi / love / suspense / action / drama / thriller. Conceptually majestic, daring production, quality performances and captivating stories provide an exquisite palate."
    },
    {
      "rating": "10",
      "text": "Cloud Atlas is an epic film dealing with different aspects of society and the human condition. It may take one viewing and a bit of extra reading to understand the plot, particularly for those who have not had the pleasure of reading the novel beforehand but once that is out of the way viewers will find an infinitely re-watchable adventure spanning thousands of years. A true classic and my personal favourite film of all time."
    },
    {
      "rating": "10",
      "text": "Perfect. This movie had me laughing, crying, excited, scared. And also aroused. But most of all, it got me thinking. It emcompasses history, space and time. A space opera with the galaxy as scope, somehow managing to stay at the human level."
    },
    {
      "rating": "9",
      "text": "Usually I'm not one for epic fantasy dramas such as this, but this one kept me fascinated the whole time. Each story told within is just as captivating, powerful and intriguing as the next. If you can forgive the sometimes questionable prosthetics, Cloud Atlas is a gorgeous-looking, intelligent little (or actually gigantic) gem. It may require a couple of viewings to fully comprehend a film of this magnitude, but I don't mind one bit."
    },
    {
      "rating": "10",
      "text": "I simply do not understand why some critics didn't enjoy this. A truly unique and ambitious film with an ensemble cast and great story. I personally think the film did well at mixing all eras instead of doing it all chronologically.\r Think I might have to buy the book now....."
    },
    {
      "rating": "10",
      "text": "Going into the movie, I didn't expect much.  Hell, I didn't even think I would hit the 3 hour mark but I wanted something to watch while playing video games.  40 minutes in, and the storyline just felt confusing...but then, at the hour and a half mark, everything began to come together and this curious film started to take on a disordered order, and I found myself completely disinterested in my game and staring intently as the plot became to take shape and form before my very eyes.  I am a critical person of works, and I usually am quickly annoyed by small flaws but this movie didn't feel like a movie....it felt like 5 movies playing at once, all interconnected in different and strange details.\r Now, I absolutely know that this isn't a movie for everyone.  I didn't think much of the movie at all until an hour into the movie and I understand that for most people that's usually unacceptable.  I get that people also just want something entertaining because I myself was looking for a cheap movie to casually watch.  However, if you do want a good, interesting movie that goes against the grain, and if you don't mind the long time that the movie takes to setup it's plot, it's a very cool and interesting movie which as a result of it's design poses some very interesting and relevant questions to the viewer.  Perhaps not everyone will find it posed as a question or summation like I did, but nonetheless the movie is wholly different from the standard cookie-cutter films you see pumped out."
    },
    {
      "rating": "7",
      "text": "Simply, I thought it rocked.  It was incredibly entertaining, with some pretty strong performances and great special effects.  It's obvious while watching it that it is a movie that will polarize audiences.  Personally, I want to watch it again to put more pieces together."
    },
    {
      "rating": "8",
      "text": "Sprawling, and incredibly cast, Cloud Atlas is a film that surely has divided everyone who has seen it.  Is it another self indulgent effort from the Watchowski Siblings, or a Masterpiece?  Based on what is considered as an unfilmable novel, Cloud Atlas starts of as a project of such high risk, that the Watchowskis have difficulties finding the right investors.  Why not? It is an Art Film with a Blockbuster budget. At its heart though, it is one of the more contemplative film that they have made since the Matrix, using every trick in the book a film that pushes the envelope so far, that it flops miserably.  Only time will tell whether it joins the pantheon of 'visionary', 'much beyond its time' film making such as 'Blade Runner'.  The question is will anyone give the Watchowskis', one of the most daring visionary film makers of their generation, another set of budgets after two flops in succession?"
    },
    {
      "rating": "8",
      "text": "This is a difficult movie to place a score on. The message of the film, I think, is an eternally important one. The only people who would say it is \"cheesy\" or \"cliche'\" are the most jaded of us. It's cliche' because it's true. It's a vulnerable message that Cloud Atlas tries to bring home, and I think it is a message that is disturbing to the American mainstream mindset. Cloud Atlas wants you to know that you aren't safe from other people... for better and for worse. It succeeds in doing that and it feels satisfying. What drags the film down though is the length and the multiple storylines. I appreciated the purpose they served, but felt I could have done without so many. There were several characters I simply wanted \"more\" of, but didn't really get. It left me wanting more development for individual stories, but then again, maybe that's just another way Cloud Atlas drives home its central message.  It's a good movie. See it with someone you care about."
    },
    {
      "rating": "10",
      "text": "I was skeptical at first with this movie. I dind't get many good review from my friends and great part of the internet was telling me not to give it a chance, but... I gave it a shot. And, hell, man, it showed me things I would never expect finding in any 3 hours of my day. All the storys are evolving. I laughed, I got excited, and, sometimes, even bro tears almost appeared. I cannot give less than a 10 to such wonderful piece of art. I'm going to give a chance to the book, and if I find something half as good as the movie, I'll be more than satisfied. Don't listen to the haters. Do it as me: Give it a shot. You won't get dissapointed."
    },
    {
      "rating": "10",
      "text": "This movie is AMAZING. I don't know why there's a meta score of 55, but it doesn't matter. Cloud Atlas is a masterpiece, even if after reading the book, it could have been better, but the movie itself is pleasant, great to watch, and far better than the others at the same time in theaters, for example.\rWatch it, and like it."
    },
    {
      "rating": "9",
      "text": "After deciding to watch this film with little to no expectations I can truly say that I was blown away. Every story in the film was extremely interesting and the idea of interlocking lives was great. The cinematography was stellar and the soundtrack went extremely well with how beautiful the imagery on screen was. The film is ambiguous but in a way that allows for you to really think about what you watched and not in an infuriating way. I will bet that years from now critics will reevaluate Cloud Atlas and it will become a classic just like other films, such as Blade Runner, that at the time were snubbed by film critics but revered now."
    },
    {
      "rating": "10",
      "text": "Visually brilliant and outstanding, Cloud Atlas is one of the most unique and well done movies I've ever seen. I was quite shocked and surprised when I first heard the nominations for the 2012 Oscars and didn't hear 1 category for Cloud Atlas. Particularly make up, visual effects, or original score. I've watched this movie three times now and still havn't quite figured out how each time difference is connected. But that's what is so great about this movie. Is that you really don't have to get or understand it. It's still just amazing to watch."
    },
    {
      "rating": "10",
      "text": "Many movies bore at times and seem predictable at times. Cloud Atlas has its story telling in a buzz and the storylines of each individual time should of been a little longer and more in-depth. But don't judge its quality by the complex plot, the movie blended in beautiful themes. Its mystery, romance, comical relief, dramatic, and actiony si-fi themes fit perfectly in one and I would probably never find a movie that did this again."
    },
    {
      "rating": "9",
      "text": "It might take a capable mind to fully understand its endless swath of challenging structural nuances, but, with that trained mindset, one should clearly be able to ascertain that \"Cloud Atlas\"   with its great performances, cinematography, script, and editing  is truly quite a sight to behold."
    },
    {
      "rating": "6",
      "text": "I wanted this movie to have more, and I waited until the credits, disappointed. The idea is smart, but I felt that it just needed a better edit (maybe a year or two from now?) that would make it more seamless and the ideas presented stronger."
    },
    {
      "rating": "9",
      "text": "What an amazing experience. Not unlike the one I had upon reading the book the first time. In the beginning I was skeptical, and it took a while to get used to the narrative structure, but at a certain point I was sucked in and completely enveloped in the story. I have to say it was masterfully edited to keep my rapt attention throughout. The way they conceived it for the screen was brilliant."
    },
    {
      "rating": "9",
      "text": "Easily one of the top 10 films of 2012! I was worried after all the mixed reviews. In fact I waited until 2013 to see it. I totally regret it. I would have loved giving my money to see this in theaters. The film is like 2 hours and a half long and I never got bored, in fact, without even noticing it, I was more and more into it as the film progressed. By the last hour I was absolutely surprised at how much I was loving the experience. Only bad thing I can say is some of the make-up doesn´t look good, but even that was probably done on purpose. Each one of the stories adds something different and are totally enjoyable. I felt like the futuristic ones could have been a film on its own, with great and innovative special effects. The film is truly memorable, I plan on watching it several times in the future. My favorite story was the boy who was a musical genius, that was the one with more heart and with the best acting in my opinion. But really, all the actors are on point, and it´s absolutely incredible to think how they even managed to put all this together and make it work. Outstanding body of work, emotive, epic, funny, sad and everything in between. What an experience. One of those very few cases when I strongly disagree with the critics rating. But time puts things in its place, and I´ve already seen several of them taking back their negative opinions. Memorable."
    },
    {
      "rating": "6",
      "text": "Cloud Atlas is a hot mess. There is about half a good movie here. The themes presented are relevant: love, dignity, freedom. Unfortunately they are sometimes presented in such a way as to seem trite or even cliched. There are also some strange and baffling elements that just don't work.\r I'm also going to get this out of the way right now: I was not a fan of the use of yellowface and whiteface on non-Asian and non-Caucasian actors, but not for the politically correct reasons a lot of people were. I didn't feel that the characterizations were racist or offensive. My main problem was that with a few exceptions, it looked really unconvincing.\r Of the six stories, I was most fond of the tale of Sonmi-451 (Neo Seoul, 2144). Her story was dark and tragic yet hopeful at the same time. The world she inhabits is a glitzy dystopia built upon the worst excesses of contemporary corporate culture. Of all the sequences, this one and the story of Robert Frobisher (Cambridge and Edinburgh, 1936) would have made enjoyable full-length films in their own right.\r I liked the sequence set in the UK, 2012, starring Jim Broadbent as Timothy Cavendish in what was essentially a dark comedy vignette about an aging publisher and his gangster client (Tom Hanks). Even a throwaway joke about soylent green being people actually relates to a disturbing element in the Neo Seoul sequence.\r The story set in the South Pacific in 1849 about a young lawyer who falls sick during a voyage and is under the care of a doctor who it emerges is poisoning him in order to steal his belongings but is saved by a runaway slave fell flat. Tom Hanks as Doctor Goose had a false nose and prosthetic buck teeth which made him look like a character from League of Gentlemen (the British comedy series, not the crappy adaptation of a good Alan Moore comic book). Predictably the lawyer, who is helping the slave by hiding him and then later gets him work as a sailor on the ship, become friends. When the lawyer returns home he declares to his slave-owning father-in-law that he and his wife will go east to aid with the abolition efforts. It should be powerful but it just feels cliched and somewhat cheesy.\r I don't have too much to say about the sequence in which Halle Berry plays the main role. It was neither good nor bad and felt like an homage to movies of the era in which it was set, namely the early 1970s, featuring a tough, independent black journalist whistle-blower uncovering a conspiracy at a nuclear power plant run by an unscrupulous business man. Taken on its own, it could have made a rather average thriller with a few good moments of tension.\r The sequence set on a post-apocalyptic Hawaii in the year 2321, just stank. It reminded me of Battlefield Earth, but with better production values and no use of dutch angles that I can remember. Tom Hanks plays a superstitious coward belonging to a tribe of people with vaguely Maori-like tattoos on their faces. He is plagued by hallucinations of Hugo Weaving as a character that can best be described as a goblin with a top hat, who I think is supposed to represent his fear and religious hang-ups. Tom Hanks' people live in constant fear of cannibals on horseback with fearsome facepaint. Halle Berry plays a character from some nice,shiny utopia where they have pretty, shiny vehicles and fusion power. She's on the island looking for some ancient secret which she tells Tom Hanks is \"The true true.\" or some such childish baby-talk. It's all very confusing and stupid and ends with Tom Hanks and Halle Berry living happily ever after on some distant planet with two dozen grandchildren sitting around a campfire listening to Grampy Tom Hanks tell stories.\r I haven't read the book, so I can't really compare it the source material. The principal cast appears throughout the movie in multiple roles because they're reincarnations of characters from earlier time periods, but it's not presented in chronological order. Some of it is intriguing. Some of it is hard to care about. Other parts are just plain weird and not always in a good or compelling way."
    },
    {
      "rating": "10",
      "text": "Humanidad, rebelacion  y amor. No puedo pensar que en un solo segundo pudiera captar la esencia de una vida entera y la realidad de un hombre como es valiente en todos sus ambitos. La mejor pelicula que he visto en mi vida y una obra de arte que merece ser llamada la verdad. Somos el reflejo de lo que creemos y producto de lo que preservamos."
    },
    {
      "rating": "10",
      "text": "For now this is my favorite movie of all times. I asked everyone I know to watch it. It's about love, about eternal souls and about the idea that not only our souls but what if our love can survive our death? What if we can meet each other the next time and feel, know and fall in love again? I saw it three times and every time I had tears by the end. It's... it's unbelievable."
    },
    {
      "rating": "10",
      "text": "Clever writing, most unique film I have ever seen in a long time. I loved the Cinematography done by Frank Griebe & John Toll. Of course you're thinking it's the Wachowski's... but they do have Matrix under their belt along with Jupiter Ascending coming soon, and Sense8 a new tv/netflix show.  The Wachowski's have never disappointed me ever! I've enjoyed all their films including this one, probably their most weirdest, trippy, original, and mind-blowing visual movie to date!!! Although you got to sacrifice about 2 and a half hours. I think it was worth it!"
    },
    {
      "rating": "10",
      "text": "I realize people throw 10s out for movies that they kinda sorta liked because they're trying to balance all of the 1s that a-holes throw out just to be jerks, but I am not one of those people. This movie truly deserves a 10, it is nothing short of a masterpiece.\rI put off seeing this movie because of the mixed and negative critic reviews, but after seeing it today, I regret not seeing it sooner. The story is very ambitious, and yet somehow the filmmakers pull it off. I haven't read the book, and I think that's a good thing, as many of the people who did read the book first seem to not like the film.\r\"This movie has everything\" is an old cliche, but Cloud Atlas truly does have everything. It is sad, funny, uplifting, and entertaining. There are moments of visual wonder, and breathtaking action. It is so unique, its amazing they were able to keep it cohesive and engrossing. Everything, from the acting to the writing, the special effect, the cinematography, and the music are all top notch, and the directors succeed at bringing it all together to make a movie that is greater than the sum of its parts.\rIf you haven't yet seen Cloud Atlas, do yourself a favor and watch it now."
    },
    {
      "rating": "9",
      "text": "Cloud Atlas is one of those movie which try something new. Sometimes it works, sometimes you just want to cry because you spend to much money to watch this movie in cinema.\rIn this case, I have no regret because this six stories are like six little movies melting together. Some are maybe more interesting than other, but they all have their place.\rI spend a really good time seeing this six lives character, and I recommend to everyone to see this \"ovni\" at least once."
    },
    {
      "rating": "9",
      "text": "To kick off let's talk about the first impression you can have, if you are not focused in the film since it starts you could probably have some problems on understanding the film but, surprisingly, you can an overall idea of what's happening because the film is at the same time hard and easy to understand, it seems like a contradiction but it's not:\rFirst of all there's a link between the stories of the films, that's easy to see, there's also a huge philosophy behind the film which is frequently ignored by the people that just want to see another sci-fi movie without stopping to see what's the meaning of the film and just basing their critics on \"How good are the special effects and how much there are\" \"Could be the message of the film told directly or I have to use my brain?\"\rSecondly, to be honest, the make-up not always does its job properly so sometimes the characters cannot hide their own facial features trying to be like another race, and sometimes it can be obvious.\rFinally I'd like to recommend this, it won't leave you indifferent for sure. Very very good story, really."
    },
    {
      "rating": "9",
      "text": "I really liked this movie. Yes, it was long. Yes, it was hard to follow, but it was an intelligent film with a profound message of perseverance and continuity of the human spirit  soul with aspiring to all that is good in this universe. It contains within its core an explanation for the very reasons why we should do good for ourselves and others, how the consequences of our actions really do have a tremendous impact on not only our lives but the lives of all we touch, and how the only truly lasting and meaningful lessons we can derive from our existences are the ones shared interpersonally. I appreciate the message that through all our lifetimes together, the only thing of significance we are really doing with each other is learning how to transcend from the carnal, savage and selfish to the giving, loving and joyful which is the true essence of the universe."
    },
    {
      "rating": "8",
      "text": "Probably a beat to death opinion but its a movie that you probably have to watch twice if you weren't able to keep up.  I got the chance to watch this film with a few friends and I gotta say it was definitely a trip."
    },
    {
      "rating": "8",
      "text": "One of my favourite books now on the screen. David Mitchell's book is engaging, extremely clever, and ambitious. While the film is quite different in its structure and the way in which it flags the labyrinthine interconnections, it is equally ambitious  and for that alone it is worth the ticket price. In fact, this is the sort of film that gets better with multiple viewings. Once you get past Tom Hanks, almost everything else works extremely well. The few clunky bits are completely overwhelmed by some breathtaking action, laugh out loud comedy (courtesy of Jim Broadbent and Hugo Weaving in story 4), and sprawling and tragic love stories. After reading reviews I didn't expect to like this movie near as much as I did. Forget the naysayers, this it top cinema."
    },
    {
      "rating": "8",
      "text": "While not without its flaws, Cloud Atlas is an ambitious, thrilling, and emotionally gripping film that explores the interconnectedness of human lives throughout time. Despite its long run-time, I was engaged in the movie throughout and felt compelled to keep watching until its exhilarating finale. Its unique style of interweaving multiple stories throughout (but to my relief, still giving a lot of screen time to Tom Hanks' multiple roles) was unlike anything I have seen before. Stay focused through all 172 minutes and you will be delightfully rewarded."
    },
    {
      "rating": "9",
      "text": "The 3 hours passed quickly and I wanted it to keep on going, though at the same time it ended each of the story lines in a today and reasonable fashion.\r The multiple stories cover a wide range of issues such as: slavery, corruption, big oil, the industrial food chain, elitism, conspiracies, aging, music, sexuality and above all else freedom. It doesn't get too preachy at any point it just lays idea a wide range of serious concerns for the human race now and delivers them with a variety of distinctive and attractive stories.\r Not too sure about the post apocalyptic Hugo Weaving version of The Hitcher from Mighty Boosh...\rGlad that the Wachowski's seem to like Noel Fielding's rendition of the  nut job enough to include an homage in their film but Old Georgie seemed rather out of place."
    },
    {
      "rating": "7",
      "text": "A film that's epic in scope and features some genuinely incredibly acting by Mr. Hanks, Cloud Atlas is an ambitious project that suffers from style over substance."
    },
    {
      "rating": "10",
      "text": "A stellar ensemble cast, undeniably fantastic script, and stunning visuals make this cinematic masterpiece one of the greatest indie films of all time."
    },
    {
      "rating": "10",
      "text": "A true film masterpiece. A beautifully written adaptation of the novel of the same name. Although there are differences to the novel, the film takes a different approach and links all the 6 mini-stories in a non-linear mosaic.  This is art with a beautiful story behind it with many layers of meaning and symbolism.\r The cast are all amazing. The best performances from Tom Hanks and Hugo Weaving that I've ever seen in any film.\r The beautiful musical score is award winning and there is no question about why it is.\r 10/10. One of the greatest films ever made."
    },
    {
      "rating": "9",
      "text": "I GIVE THIS A 8.5 BUT IT GETS AN EXTRA 0.5 TO COUNTERBALANCE ALL THE HATE.\r I won't go over the same things again: people have gone over the multiple storylines, unconventional timeline and mind boggling plot numerous times.\rI will instead answer their accusations/praises:\r -Is it beautiful? Yes, yes it is.\r-Is it strange? Probably the weirdest movie out there.\r-Is it meaningful? In the first hour, NO. After you watch the whole of it AND PAY ATTENTION, it's life changing. At least for me.\r-Is it well executed? YES. Many people would say no, but the movie achieves its goal perfectly if you give it a chance. Now, if some want it to say something else than it intends to, that's their problem. However the storyline(s) interweave and function like a clockwork.\r-Is it funny? Well. Hm. It has some funny moments as well.\r-Is it dramatic then? This movie is not a drama. Nor a comedy. Nor science fiction. Nor action. Nor a love story. It's basically all of them combined. But in the end, my heart was swelling with emotion, I wanted to laugh, to cry and I felt connected to the world. Not in a heroic or villain way, but through the resonance of our actions. Which was exactly what the movie is trying to say: whatever you do, it changes the world. It doesn't say \"be good\" or \"be bad\". It just shows you how our present is the way it is, because of people that lived in the past.\r In conclusion, I think this movie is a must see. It broadens the mind.\rNow, some may not like it. Racists, homophobes, conservatives perhaps?\rIn any case though, it deserves more than a 5, and whoever gives this a 0 is (frankly) an idiot.\rWay too much thought has been put into this to be reduced to a 0 (what do you give these crap-movies then? -19? People click that 0 way too easily.)\rAll in all, it has changed at least one human's way of thinking (mine) and for that alone it's remarkable. (:"
    },
    {
      "rating": "10",
      "text": "If you can't appreciate the story, then appreciate the way it was told. This is the most underrated film I have ever seen. It took three film crews across the world, three writers/directors to adapt a screenplay from a book that was deemed impossible to do. I don't care much for parts of the story, but the themes, editing, humour, suspense, and eye popping makeup design and special effects are sure to please any viewer. I've never seen anything like it, nor will there ever be."
    },
    {
      "rating": "10",
      "text": "One of the best movies ever made.\r I have to have 150 characters, so:\rAASDHAHLAFKALFHLKAFLKAHFLFJAKLJFALKASJLKJALSKJFLKAJLFJASLKJFASKLLFASALSJLFASJ"
    },
    {
      "rating": "9",
      "text": "\"Cloud Atlas\" 10 Scale Rating: 9.0 (Amazing) ...\r The Good: An absolutely epic film with several fantastic stories all rolled into one. If you can make it through the lengthy run time, you'll be rewarded. Extremely ambitious and risky attempt, which has garnered a polarized response, but an attempt worthy of respect. Severely underrated.\r The Bad: You feel every minute of the 2:52 run time, especially early on. I was not impressed initially as the early stages of the film are difficult to get through. Hit and miss makeup takes away from the film as well. Some of the makeup jobs are extremely silly to look at and distracting."
    },
    {
      "rating": "10",
      "text": "I watched this movie when it first was released on DVD and hated it.  I then read the book, watched to movie again, and only after seeing it twice and reading the book did I come to fully understand the impressive magnitude of this movie.  This is one of the most under-appreciated films in recent history as most people dismiss it as boring and uninteresting.  Watch it once and you will want to watch it again and again.  It has amazing cinematography, terrific music, and great acting overall in an amazing story that stays true to the amazing book it is based off of."
    },
    {
      "rating": "7",
      "text": "Overall the story is intriguing, it's just that due to there being multiple interwoven stories taking place in vastly different settings and time periods, not all parts of the movie appealed to me. It jumps from satirical comedy to some grimdark dystopia to spy movie to drama, which can be jarring. Still, when the story comes full circle it feels pretty rewarding, but the movie certainly isn't for everyone as there is a lot of stuff going on and the pacing is generally slow."
    },
    {
      "rating": "10",
      "text": "I originally went to watch this movie in the theatres because the name caught my attention and the reviews were so divided.\r In my experience, when opinions are split like in the case of Cloud Atlas, with some saying that it was a fabulous movie, and others that it wasn't.. with many quoting that they didn't UNDERSTAND what they watched, it's something worth watching.\r As far as I'm concerned, I was right. I thoroughly enjoyed this movie.\r I have nothing negative to say about it, other than that it was sometimes mentally draining to try and keep up with all the themes that I saw, to try and confirm any connections between events in the various stories, yet that too was all part of the fun.\r Not only was the acting excellent, the overall story welded itself together in such a remarkably vague yet visible way that, as a viewer, I couldn't help but come up with underlying themes and theories all on my own.\r Everlasting love, transcendence of time, strength of human connections and will, the concept of freedom.. just to name a few.\r Now, let's be clear. This movie isn't for everyone, and definitely not intended for young children.\rUncomfortable with sex scenes? Can't follow not-shallow plot? Wrong movie.\r On the other hand, if one is looking for a unique movie where the story's main messages aren't bluntly shoved in your face, but suggested at and left for the viewer to discern in wild, yet smooth, dynamic fashion, this is definitely worth a watch or two (or more).\r All things considered, I highly recommend Cloud Atlas for any appropriate viewers."
    },
    {
      "rating": "7",
      "text": "An engaging thoughtful movie.  6 different interwoven plot lines, all interesting. A long movie, but it doesn't drag.  I'm not sure the movie really gets it done, but the interplay of the different stories helps portray the universal aspects of human nature and how the struggle continues throughout time and place."
    },
    {
      "rating": "10",
      "text": "One of the most criminally underrated movies to date and the best work of the Wachowski's hands down.The ambition and scale of Cloud Atlas is one of a kind with 6 different stories over a timeframe of many centuries. Each story is great on its own with a unqiue tone and style but it goes further. All of these stories are connected to form one big story and message to the viewer.I can only assume that a lot of the more middling or negative reviews come from the initially confusing plot of the movie and the fact that actors play several roles at once with the help of makeup and prosthetics. It can certainly be hard to wrap your head around at first but there is a method to the madness.Even if it may require a second viewing you start to understand how the different stories feed into each other and ultimately all tell the same story of oppression throughout history and how the actors play iterations of the same character throughout all of these 6 storylines.It's a shame how overlooked this movie was back in the day because it's truly one of a kind with a unique style, great ambition and a great message."
    },
    {
      "rating": "8",
      "text": "This film addresses a subject rarely addressed in the cinema: how individual actions can, over the time, influence the course of future events. It mixes six different stories passed in the past, present and future. It's directed by Tom Tykwer, who also wrote the script along with Lana and Lilly Wachowski. In his several roles, it includes Tom Hanks, Jim Broadbent, Jim Sturgess, Ben Whishaw, Halle Berry and Doona Bae, among other artists.This movie is one of the most complex and difficult to follow I've seen in cinema. We need to view it carefully in order to understand it and savor it, and that complexity is a motive why some people will probably dislike it. By mixing six stories situated in six moments in space and time, but united by so subtle connection elements such as a song, a book or a birthmark, this film looks like a tangle of stories without head or tail, but it's not true. That happens because the topic addressed is also complex, so as David Mitchell's novel. The script is flawless, superb and deserves congratulations but the cast deserves even more applause. They literally had to unfold to make this film and none of the main actors made less than three different characters, which is an achievement and a challenge for any actor. And perhaps it was the pleasure of the challenge that led so many big names from Hollywood to risk entering in an openly indie film, far from the financial support of the big corporations of the industry. The technical offices are beyond reproach, thought of every detail and made an exceptional work: the costumes are exquisite and the makeup and visual and special effects are gradually surprising more and more. Reinhold Heil signs the soundtrack, which was also excellent.There are certain films that, as good as can be, end up being marginalized due to issues that have nothing to do with the quality or beauty. This film is one of those. Despite the depth and complexity of the script doesn't allow it to be massively understood or appreciated, is an exceptionally good movie that the fact of not having a film company behind left almost out of the critics attention or the major industry awards. Surprising, exciting, this film is mentally provocative and it's sad that hasn't even been nominated for more categories at the Oscars and Golden Globes."
    },
    {
      "rating": "10",
      "text": "Cloud Atlas is a true missundestood masterpiece. It touches on the deepest subjects such as love, rebellion, life, death, indecision and so much more. Each part of it is brilliantly crafted and put all together in one true flawless masterpiece. The level of mediocrity humanity has reached is unbelievable. Even bumblebee.....bumblebee has a better metacritic than this dramatic and sad yet funny masterpiece. There was one line in birdman that said all the critics do is say big words instead of analyzing the structure and everything important in that movie. The only thing they do is tear appart and trash on original movies just because they can't do a movie. They never think how much effort went into a good and original script, the production design, the special effects, cinematography, editing, etc. They just do what they know best (being selfish retarded **** who are not able to percieve nor understand true art) and giving good grades to the newest unoriginal hollywood movies like bumblebee. The critics don't want profound messages about life death, etc. What the #### is that U don't know. They just want explosions, action, shooting, etc, etc, etc! So as a message to everybody: #### the critics. Every lazy incompetent can be a critic, He/She calls a site and asks for a job and then gets payed by that site to trash on every new artistic film and give 9/10 ratings to every new Marvel Audio Visual Product (because obviously marvel movies are not really movies. Movies have a message and artistic values)"
    }
  ],
  "recommendations": [
    "perfume_the_story_of_a_murderer",
    "the_green_knight",
    "the_giver",
    "inception",
    "the_fountain",
    "hugo",
    "arrival",
    "the_13th_warrior",
    "the_social_network",
    "v_for_vendetta",
    "risen",
    "the_butterfly_effect",
    "life_of_pi",
    "the_darkest_minds",
    "eternals",
    "interstellar",
    "tolkien",
    "roma",
    "tinker_tailor_soldier_spy",
    "unbroken",
    "tomorrowland",
    "samson",
    "chappie",
    "vanilla_sky",
    "donnie_darko"
  ]
}