{"id": 1767, "title": "Cloverfield", "starring": ["Matt Reeves", "Michael Stahl-David"], "runtime": 85, "genre": ["Action", "Thriller", "Science Fiction"], "description": "Five young New Yorkers throw their friend a going-away party the night that a monster the size of a skyscraper descends upon the city. Told from the point of view of their video camera, the film is a document of their attempt to survive the most surreal, horrifying event of their lives.", "releaseYear": "2008", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/qIegUGJqyMMCRjkKV1s7A9MqdJ8.jpg", "categories": {"plot": 2.7142857142857144, "acting": 4.111111111111111, "ending": 3.5833333333333335, "soundtrack": 5.0, "cinematography": 3.235294117647059, "familyFriendly": 5.0, "funny": 2.0, "action": 4.375}, "reviews": [{"rating": "1", "text": "the camera made me feel sick and there was no real story."}, {"rating": "1", "text": "This is the worst film I have ever seen. It is the Blair Witch project all over again. Hand held video camera with a battery which has the longest life I have ever seen. Not to mention the fact it continues to work despite being dropped,bashedthrown about etc. No story to speak of. Do Americans really shout and scream at each other as they do in this film? All in all a poor film which I wish I hadn't wasted my time and money on."}, {"rating": "7", "text": "The movie certainly has a good premise, but unanswered questions in the end and a camera that is way too shaky disrupt the experience."}, {"rating": "7", "text": "Had this come out before Blair Witch think the ratings would have been better but it didn't so...It's really just an Alien version. Still pretty good. I think a sequel could have potential believe it or not."}, {"rating": "7", "text": "Entertaining movie made entirely in a documentary style which adds to the feel of realism. Good pace and character build up and believable in so far as a monster movie can be. Well worth watching."}, {"rating": "7", "text": "Given that I watched this in less-than-perfect conditions on the plane through piss-poor headphones, the seat in front reclined right in my face, a tiny screen, screaming babies ago-go, and a fat American man snoring loudly next to me, it was surprisingly engaging. The word \"steadi-cam\" did pop into my head a few times - the street scenes particularly were suspiciously cleanly shot - there were a few unlikely escapes (but wait - I thought she was near death with a girder sticking out of her chest?), and of course the monster was ridiculous even in broad half-seen brushstrokes; but there was a sense of fear and panic in the film that must have been rather difficult to manufacture, and i thought it quite convincingly captured the sheer panic, helplessness and chaos of an uncontrollable disaster situation."}, {"rating": "7", "text": "As the instigator of pseudo-documentary horror/sci-fi, four-years later, I finally got the chance to watch it, stripped down to the film per se, a 80 minutes running time has testified the audienceâ"}, {"rating": "0", "text": "The makers of \"Cloverfield\" seem to have forgotten to add the essential What, Where, and Why elements to the story. WHAT is this thing? WHERE did it come from? WHY is it attacking New York City and killing millions of people? If they could have added just a LITTLE backstory, this could have been a halfway decent movie. There was no ending either. The viewer never knows if the monster is defeated. All you see is an explosion. Ka-boom, roll credits. The theater is much too expensive to be seeing movies like thise."}, {"rating": "2", "text": "Good idea but god that movie made me SO nauseas... it was shaky and it wouldn't stop moving and it was short. if it has stayed in place it would have worked... not a real story tho...just just goes with its... if u don't get movie sick then ya. but don't go for it."}, {"rating": "0", "text": "The worst film of all time - pointless, amateurish, pretentious. Everyone involved should feel embarrassed."}, {"rating": "3", "text": "Awful movie! Luckily it is very short."}, {"rating": "2", "text": "Abysmal garbage. Let's see lame Cliffhanger, terrible acting, piss poor plot= FAIL. I must give credit for the cgi effects however. Nevertheless don't throw garbage like this towards us Paramount. You should have learned your lessons from War of the Worlds or any of your other disastrous Sci-fiction/monster releases."}, {"rating": "1", "text": "Special Effects were as good as the story was bad! I'm still mad that I wasted an hour and a half of my life watching this rubbish!"}, {"rating": "0", "text": "Anyone that gave this piece of crap higher than a 0 should stick to watching sesame street. If I want to want home movies I visit the jackass down the street. I was disappointed when I missed this on the big screen. Now I'm glad I missed it. It would have been a bigger piece of crap at a higher cost of seeing it. I would classify this as docu-crap."}, {"rating": "0", "text": "the worst movie i've ever seen. the handheld camera movements literally mad me sick. i had to leave the theatre. besides that, the movie was weak on all levels. garbage."}, {"rating": "0", "text": "I have one comment about this movie. It's a waste of time."}, {"rating": "5", "text": "If you have to watch this abysmal film...sit in the very back...the constant shaking camera will make you puke...the monster is awesome...I wish it was filmed in an alternative style more complacent with my stomach cause I might have enjoyed it otherwise."}, {"rating": "0", "text": "What a waste of time. I couldn't believe the lame, very long into to even get to the monster portion. It was a bad combination of product placement, bad acting, no script, and a hangover all in one. I checked my watch over and over and it's only 84 minutes long. A very long 84 minutes, long. Watch the trailer. It's more entertaining and you'll save yourself valuable time and money."}, {"rating": "1", "text": "This movie made my eyes want to bleed and gave me a headache. As a New Yorker the allusions to 9/11 were tacky. The monster had no story and the characters were idiots and I'm glad they all died.J.J Abrams and company hide a truly moronic story behind clever marketing. They get an A+ in marketing and an F for actual movie."}, {"rating": "1", "text": "First off Anyone who lost someone on 9-11 or still gets emotional every anniversary, Don't see this movie. with that said I gave this movie a 1 for the acting as they truly make it seem this was a film found after the event. This \"movie\" is 90 minutes of a shaky camera where you barely see anything especially the monster except a few seconds at the end. No explanation of what it is where it came from but these young kids are running away from it. thats the movie...actually they are trying to rescue a girl which is why they stay...I would have gotten my ass outta there ...JJ Abrahms made LOST Enough said...no explanation keeps leaving you with more questions."}, {"rating": "2", "text": "When I watched the movie the other day, I couldn't believe that the whole movie was through a camera. The movie was a mix between the Blair Witch Project and Godzilla. This is one movie that I actually called, emailed, and spoke to co-workers and family/friends and told them to not even waste their money on. The ending of the movie was pointless. Pointless to the point on why the Camera was needed. Sometimes when I leave a theater, I hear people talking or something, NO. everyone left in COMPLETE SILENCE!!! And lookin @ the Box Office reviews, I cant believe, that this movie grossed $41M . I know there are A LOT of disappointed moviegoers..."}, {"rating": "0", "text": "So bad it was pointless horrible one of the worst movies i've ever seen i regret watching it i don't reccomend it."}, {"rating": "0", "text": "Worst movie ever, filming makes you dizzy, just plain stupid, no real story behind it and then theres an ending that just makes you want to cry because its like \"well I've wasted 2 hours of my life\" but then on top of that laugh because it seems like the producer ran out of money so just decided to end the movie. Crap, if you respect a movie with half a plot, do not see it. If you like watching people die meaninglessly and have a high resistance to motion sickness, go ahead."}, {"rating": "1", "text": "The Blair Witch Godzilla Project. Enough said."}, {"rating": "0", "text": "Horrible movie. Way too much hipe. Characters were annoying. \"Plot\" was annoying. Film style was annoying. Hated it."}, {"rating": "0", "text": "The first 20 minutes were so boring I fell asleep, a first at the cinema, and when the explosions woke me up I thought \"at last it's started.\" I might as well of stayed asleep as the awful hand held camera made it unwatchable. Worst film since Blair Witch Project which used the same diabolical system. Tony"}, {"rating": "3", "text": "A harsh lesson in bad kaiju. the monster has no motivation, unlike godzilla who only wanted to go to his precious radioactive tower. the humans were vapid and unrealistic. their physical injuries at odds with fight or flight instincts would never have allowed certain survival instincts. all this movie did for me was give me a bad headache, and i went into it so hopeful for amazing thrill ride. this was the ubermeh."}, {"rating": "0", "text": "Completely and utterly pointless. Lead in scenes too long and drawn out, and I was actually surprised to see as the credits rolled that there had even been a script. God help us if they make more of these movies. This film was so bad it made me hate every movie I've paid for in the last 5 years."}, {"rating": "2", "text": "This movie tries so hard to be cool and gritty and different but fails on all but one of those goals. Gritty is about the only compliment it gets, if you can call grainy footage and cameras that shake epileptically \"gritty\". The introduction to characters drags, the action sequences are unsatisfying and the ending is a complete dud. And be warned: if watching the \"Handycam-esque\" style of Blair Witch Project made you feel a little queasy, Cloverfield will have you reaching for, and filling, the bucket. Blurgh!"}, {"rating": "0", "text": "AAAAHHH! I am still throwing up from this. . .I don't not even know what to call it. . . .poopy? no it was worse then that. I didn't have any regrets in my life until I saw this movie. It has made me so frustrated I do not even know how to explain. The whole thing could have been great-besides the fact that there was no script and no image. Everything was just a blurry image of stupidness screams. I kept praying that the monster-whatever it was(you never find out) would eat the camera guy to end my misery. It was torture! Watching this movie was t--o-r-t-u-r-e! There is no reason to go and see this movie. Unless of course you are looking for a bad time, big headache, and somehow to waste your money. This could have been a good movie.. But it wasn't. The trailer was more interesting than the movie. I knew as much as I did before I saw the movie from when I left the theater. The only thing I learned was what it feels like to vomit all over the person next to me. The movie can be summed up in one word: worthless. Can they even call this a movie? From what I've seen the producers have no right in calling this a movie. How did they manage to put this on the big screen? We'll soon find out in the next 'Guinness Book of World Records' there will be the record for most people being tortured in one afternoon."}, {"rating": "2", "text": "For the first time in my life I emailed all my friends to warn them about how bad this movie is and the critics are dead wrong. This is complete garbage and other review have really nailed down why. Something else I didn't like was if you are going to do a guerilla type movie the story should line should really try to pass this as \"it really happened\" type feel or else the audience will be confused and angered like I was. The movie ends \"My name is Rob Anderson and if you are watching this, you know more about this than I do\". No Rob, actually I don't...because no monster ever attacked NY and we haven't invented time travel so there is no way this video could have come from the future. All I know is I just dumped $15 on your crap piece of film. Thanks JJ Abrams"}, {"rating": "1", "text": "This movie was a waste of my time. It was way too bloody, violent and just plain stupid. The first 20 minutes were boring-just bring a pillow and blanket and sleep for the first 20 minutes. This movie was so bad people in walking out! Save your money and time and go get ice cream instead of seeing this movie."}, {"rating": "0", "text": "I have never, ever had a feeling of intense anger swell within me as the credits started rolling on a film I'd been eagerly awaiting...until Cloverfield. Despite the nausea-inducing camera work, the movie left nothing but a giant, unfulfilled void where I was expecting to finally see \"that amazing monster flick\" I'd so eagerly hoped it to be. The entire audience actually booed when the credits rolled, I can't believe it is getting such positive reviews! Do not waste your time, or more importantly, your money, on this horrid monster of a movie."}, {"rating": "1", "text": "Horrible excuse for a movie. I don't know what the critics are thinking. It requires not only a massive suspension of disbelief, but also a suspension of reason and logic. Add to that the fact that you do NOT find out anything about the monsters origins, and I would not recommend seeing it even if they paid you $12."}, {"rating": "2", "text": "The camera perspective is from a handheld camera and its like watchin a 2 hour blare-witch project. Watching the 2 minute preveiw is probably more interesting than the movie. Don't waste ur m$n$y"}, {"rating": "1", "text": "Let me put it this way...half the theater left either sick or really ticked off. There were at least 2 people that actually threw up in the theater while I was there. I sat near the back of the theater because of the potential motion sickness. I still got sick. The director should have at least used the steady shot on the camera. It was like they had to throw the \"Im using a camcorder and I need you to know it\" over and over again. Great story but horrible visuals aka camcorder view. It should have been used sparingly. This movie could have been made by anyone and probably been easier to watch than this version. I recommend this movie to know one. If you go sit in the back row and bring a brown paper bag. Cant wait till the book hits the shelves."}, {"rating": "0", "text": "Deadly dull, even at 84 minutes."}, {"rating": "0", "text": "Truly one of the worst films ever made. A complete waste of time, and I wish I could get my money back. I had to leave the theatre twice because I was getting ill from the handheld camera. Several times I had to look down because I couldn't take it. When I could watch, there was nothing worth seeing. The post work on the monster was horrible. If I could rate it a -100, I would."}, {"rating": "2", "text": "I cannot believe that there are so many favorable reviews on this movie ... Here are the facts the movie is 71 Minutes long The monster is in less than 4 minutes of the movie The camera shaking is horrible Nuff said save your money."}, {"rating": "7", "text": "Quite an enjoyable film. Loved the documentary feel and don't agree that the monster's origins, motive, etc, needed explaining. It wasn't really about the monster, after all. The party section went on a bit too long and it didn't succeed in making me feel attached to the characters, the film really improved when we got to the part with the monster attacking. The only complaint I would make about this film is that to me it never seemed very believable that the characters would go to their certain deaths on the off-chance of saving someone's ex-girlfriend. If they had been a couple going back to save their baby (left with babysitters across town?) then it would have made a lot more sense."}, {"rating": "7", "text": "Once you get past the whole shaky cam thing (which really made the movie) its just your generic monster movie plot. It was an enjoyable film but it was poorly executed."}, {"rating": "4", "text": "a hectic subway ride that lasts for more than an hour..CloverfieldReeves's field of horror is so fixated on the crisp of the thrills, that it fails to stand on its structure let along impute a heat on the soul. It is as cold as the world depicted in here, it is basically a razzle dazzle that usual alien invaded tale follows. The only thing it has draw in its viewers is through its perspective which unfortunately is exciting in its initial stage but grows questionable as it ages on screen. The camera work keeps us so busy that you are always attentive towards it, which unfortunately wears down quickly and is then just a hectic subway ride that lasts for more than an hour; you might leave the screen with a headache. It is awfully loud and unnecessarily brimmed with explosives that is clearly mind-numbing. The narration is fast and gripping but it certainly isn't layered or thought provoking and takes its genre sci-fi for granted. Forcibly installed humor shucks away the somewhat earned intensity on each step. The entire feature is imbalanced on its self-created ground that it fails to walk on and just ends up fumbling down the road for attaining its moot closure. There isn't much range offered to the actors to flaunt in aptly but it is not that the allotted acts are on the mark by these performers; they need a better boost. Aforementioned, the sound effects are loud and blunt and the visual effects aren't convincing enough to terrify the audience as it was anticipated. Reeves's efforts are clearly visible but it also isn't enough to float this sinking script whose ironically, the strength of the concept itself weighs it down like an anchor. Cloverfield is a wiped out field before it even habitats itself, it only works as a dinner table discussion, clearly not as a major motion picture."}, {"rating": "7", "text": "This right here is a very under-rated movie. It was a very cool and successful expeiriment that I thought did exceedingly well. It not only kept my attention and stayed interesting throughout the whole thing, it began a new era of film. It brought the idea of making the movie look like it was home videoed to the attention of the film industry. I also love the producer(J.J. Abrams) and the director did well with this movie too(Matt Reeves). So after all of that about how good it is your probably asking yourself, \"why did he give it a 7/10?\" Well the movie isn't completely perfect. I thought for one it could have been a bit longer. It only being like one hour and 10 minutes was kinda a let down. Also, I know it was like home videoed but there was a little too much zooming in and out and shaking of the camera. It didn't have the best angles either. It also was hard to see I feel like. The only time you can watch it is if your in a dark area because in a lot of the parts the glare makes it hard to see the screen and whats going on. One more thing is the actors. They didn't do the best job of acting in this. I guess most of them were just begginning actoras and actresses but they could have done a little better. The only one that did a professional job was Lizzy Caplin(Marlena). She was pretty good in it but then again she has been in a couple of movies before this one. She's not the best acteress though for sure. There is many others better than her, no defense Lizzy. I guess T.J. Miller(Hud) had done a prett y good job too. He had also been in a few movies before too. So those are a few things that this movie lacks and if they make a remake... add these please. So this movie is a pretty good movie with a good plotline and amazing special effects. I highly reccommend you see it."}, {"rating": "3", "text": "I thought the special effeects were excellent, but i didn' like how the storyline was or the ending. I also did not like that the movie was a video cam and even the people behind me said it made them dizzy."}, {"rating": "10", "text": "This is one roller coaster ride. Although this does require a suspension of disbelief because this was on-camera monster attack on NYC, It made me believe it actually happened. This movie was scary, thrilling, emotional, and just plain freakin awesome! I didnt mind the ending whatsoever. Awesome movie."}, {"rating": "9", "text": "From the creator of the recently-ended TV series LOST (who is now known as the director of later films STAR TREK and SUPER 8, as well), CLOVERFIELD is the thrilling point where THE DAY AFTER TOMORROW, PARANORMAL ACTIVITY, and GODZILLA all meet. The use of the similar \"cinÃ©ma vÃ©ritÃ©\" and \"found footage\" styles are prevalent to the film's plot, as it enhances the believability of the disaster which the story is centered on. At first, I didn't think it was going to be that great of a film, as it began with a light-hearted mood, but by twenty minutes into it, once the whole disaster started to take place, I was thrilled. Also, the ending was not that great, and it left me flummoxed by how complex it was, but think of the endings to other films made in \"found footage\" style--especially THE LAST EXORCISM--if you may: they were the same way. Overall, I thought this was a fantastic film. To create yet another monster was a brilliant idea, and for once well-tackled. But if there's one thing about CLOVERFIELD that really goes beyond expectations, it's the cinematography and how ingeniously every action is captured--even if it's on home video."}, {"rating": "7", "text": "This was an effective film the first time around. It's still a gripping watch, although some may find elements of the film a bit annoying. Getting through the first 20 minutes or so really tested my patience as I was not sure what to expect, or when to expect it."}, {"rating": "5", "text": "I admit the movie was a crazy, thrilling ride. However, just because \"Cloverfield\" was filmed in first person perspective doesn't mean it is a good movie."}, {"rating": "2", "text": "I just saw this on opening night, this film is so bad that I am only giving it 2 points, 1 point for actually been made into a film, 1 point for the special effects. During its short 82 minutes, there is probably only 40 minutes of footage that is viewable, the rest of the time is shaking, running, shaking, footage out of focus, shaking, screaming, footage too focused and more shaking, I know its the style, but I personally hate films like that, god forbid blair witch, it makes the movie experience feel cheap and unworthy. I wont recommend this movie, I wont recommend this DVD when it comes out or using this DVD as cup coaster, well maybe as a coaster."}, {"rating": "7", "text": "This movie was a classic version of Godzilla, it was very supsenseful and very....shakey. The camera looked like it was a digital hand held camera I only saw the Cloverfield monster once just before the camera man got eaten, Yum. But over all this movie was pretty short, like 1hour long and it ends with the cloverfield monster destroying the 2 main characters, but it was a good horror monster movie throughout."}], "recommendations": ["the_devil_inside", "paranormal_activity_4", "skyline", "paranormal_activity_3", "hereditary", "2012", "bird_box", "paranormal_activity_2", "midsommar", "frozen", "wonder_woman_1984", "the_matrix_resurrections", "the_blair_witch_project", "paranormal_activity_the_marked_ones", "unfriended", "slender_man", "host", "unfriended_dark_web", "sanctum", "chernobyl_diaries", "the_pyramid", "project_almanac", "knowing", "vantage_point", "district_9"]}