{
  "id": 2140,
  "title": "Clown",
  "starring": [
    "Andy Powers",
    "Peter Stormare"
  ],
  "runtime": 100,
  "genre": [
    "Horror"
  ],
  "description": "A loving father finds a clown suit for his son's birthday party, only to realize the suit is part of an evil curse that turns its wearer into a killer.",
  "releaseYear": "2014",
  "mpaaRating": null,
  "imageUrl": "https://image.tmdb.org/t/p/w500/uNvbakoHyQYqeWanOw3mF3troWU.jpg",
  "categories": {
    "plot": 5.285714285714286,
    "acting": 5.0,
    "ending": 6.0,
    "soundtrack": 5.0,
    "cinematography": 7.0,
    "familyFriendly": 6.0,
    "funny": 5.333333333333333,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "7",
      "text": "At this point everyone is well-versed and familiar with the fears of clowns, and the overall creepy aesthetic that they carry, but the concept shown in this overlooked horror gem is probably the most sinister and frightening. The fascinating spin they put on clown mythology was so depraved and evil and went in very disturbing territory, but that's what horror to me is about. Alongside just being an overall twisted horrifying film with an interesting story, I found the cinematography to be very well done and the tone and atmosphere was set perfectly through it. If you're into horror in general you should check this out and especially if you're into clowns because it delivers very well on both fronts and really doesn't hold back. You will not look at clowns the same way after seeing this film."
    },
    {
      "rating": "4",
      "text": "A one-note one-joke premise ad nauseum. Killing kids has never looked so banal. Needed more humor, more insanity, more creativity, more anything."
    },
    {
      "rating": "6",
      "text": "It's a story about a demonic clown with an appetite for human children. Sound familiar? The movie is essentially \"IT\" with a body-horror twist. As if they were trying to beat that movie to market and were only able to end up with a VOD release. In this movie we watch a father find a clown costume for his son's birthday party. After the party he finds that he can't take it off no matter what he does, and to make matters worse it's turning him into a monster. There's some pretty impressive lore here as to what a clown actually is and why wearing this particular clown suit is having this effect. The movie also has a much appreciated sense of humor about itself. There are moments that poke fun at the craziness of the situation. Unfortunately, what it fails to deliver on if any really effective horror.Most of what the movie has to offer is just having viewers look at pictures of clowns that have been overly creepified. It plays a lot off of how unnerving clowns can look in the first place. As the father's transformation continues on, he does start to look more and more terrifying. Even if it's mostly just due to the fact that he bares a striking resemblance to old Pennywise. As the more monstrous qualities of the change come into play, the clown starts to look a little overdone. Kind of robbing it's appearance of the more subtle creepiness by moving into full-blown monster flick territory. The real problem is that director and co-writer Jon Watts is unable to instill any kind of fear or tension into his scenes. For example, my favorite scene in the movie takes place in one of those jungle gym playgrounds that used to be at every McDonald's back in the day. It's a pretty cool, playful, and creepy setting for a kid to run into a killer clown. Unfortunately, the only payoff was another one of the movie's dull jump scares. Watts never capitalizes on the film's potential. The result is a movie that feels flat and lifeless in comparison to other horror flicks.Clown is good at having some fun with itself and coming up with an interesting take on clown lore. The transformation has some interesting qualities before becoming too overblown in the final act. I also have to give the movie credit for having the guts (pun intended) to show kids getting killed in violent and gory ways. So ultimately there is some value here, it's just that the execution falls short so we end up with something that lacks effectiveness in inspiring fear or genuine interest. In fact I found that the most compelling part of the movie is just how many comparisons I was able to draw between it and the two adaptations of the classic Stephen King story. Jon Watts just doesn't prove himself as a director who is good at horror. Maybe it was just the budget, but who knows. As it stands Clown isn't without some merits and is ultimately watchable. I just think it's one of those movies you should only watch if you've exhausted all your other options, and that includes the ones in other genres."
    },
    {
      "rating": "6",
      "text": "Deutsche Review - Kritik\r Der folgende Test ist in 5 Kategorien zusammengefasst. Diese 5 Kartegorien ergeben die Gesamtpunktzahl von 0 - 100 Punkten. Um einen passenden Userscore zu geben wird auf oder abgerundet. Bei 84 Punkten ergibt das einen User Score von 8. Bei 86 einen von Userscore von 9. Falls eine 85 kommt entscheide ich ob ich es eher positiv oder negativ nehme. Regeln verstanden?\rDann sind hier meine Punkte.\r Story = 10/20\rFiguren = 16/20\rSound = 9/10\rBild/ Set= 7/10\rLänge = 16/20\r Mein persönlicher Score = 58/100\rMein User Score = 6/10\r Lohnenswert? = Ja. Ist kein schlechter Film, aber auch kein sehr guter.\rFortsetzung erwünscht? = Nicht nötig."
    },
    {
      "rating": "0",
      "text": "Screw this movie, it's crap. Screw this movie, it's crap.Screw this movie, it's crap.Screw this movie, it's crap.Screw this movie, it's crap.Screw this movie, it's crap.Screw this movie, it's crap.Screw this movie, it's crap.Screw this movie, it's crap.Screw this movie, it's crap.Screw this movie, it's crap.Screw this movie, it's crap.Screw this movie, it's crap."
    },
    {
      "rating": "2",
      "text": "Clown is neither pure horror nor comedy. Undoubtedly, this film will be a must stop for the terror tasters and their subgenres but for the majority especially for me it's only a movie that aroused interest because of its offer but failed to deliver what was promised."
    },
    {
      "rating": "5",
      "text": "Director John Watts made a strong impression with first film (\"Cop Car\") and he's helming the upcoming Spider-Man, so he's a director to watch. I \"watched\" this new one and was moderately impressed. It's about a man who dons a clown costume for his son's birthday party, then discovers that it's turning him into a blood-thirsty monster. The interesting concept becomes even more diabolical when he determines his prey. The entire film has an ominous sense that something horrible is going to happen (the heavy-handed music contributes). Unfortunately, the payoffs are always off camera, which can engender horrible imaginings, but they just don’t deliver. Some of the plot borders on absurd, but there's a confidence to the filmmaking. Still, it falls short of his earlier promise."
    },
    {
      "rating": "5",
      "text": "Clown has its fair share of scares but the lack of character development makes the film middle of the road.  I was surprised to see this was John Watts next film (just a little different from Cop Car or Spiderman).  C"
    },
    {
      "rating": "0",
      "text": "Le film est très mauvais et en plus je l’ai détesté. Plus jamais je le reverrai !"
    },
    {
      "rating": "5",
      "text": "It becomes fairly apparent early on in this movie that \"Clown\" is striving be \"IT.\" \"IT\" was announced and the hype for killer clown movies started rising dramatically, so this movie seems like it wanted to capitalize on that fad in 2016, and was not very interested in making a good movie. \"Clown\" isn't all bad though. The gore effects are brutal and realistic. The atmosphere is creepy throughout. There is an intriguing clown mythology that is established and there are some tense moments. However, it just largely falls flat. This could have been a much better movie. The story is rather lame, it is about a loving father that puts on a clown costume for his son's birthday party, only to find out later that it is cursed. There really is no established reason why the main character deserves to be cursed by a demonic clown costume. He is established as a hard working husband and father that loves his family. It is just by dumb luck that he gets this demonic curse put on him. I think with some time and decent writing there could have been a better reason for why he gets cursed. Although there are moments of some suspense, mostly the film just isn't suspenseful. The acting and music in the intense moments are weak and it really takes away from any heart-pounding intensity. The acting is not horrible or campy in this movie, but some of the performances feel a bit wooden. The dialogue is nothing special, and is often filled with exposition that sometimes is not necessary. This movie could have used some humor, it is not funny at all, and a bit of comedy would have helped. Every killer clown movie will ultimately be compared to \"IT\" and much like how every shark movie is compared to \"Jaws\" and falls short, same happens here with \"Clown\" to \"IT.\" If you are a fan of these types of movies, give it a watch. If you like other horror movies a lot more, or don't like horror, pass it up. This is not a great movie, but it can entertain if you are tired of rewatching \"IT\" and need some more gore in your clown flicks. Overall, I give this movie a 4.5/10."
    },
    {
      "rating": "9",
      "text": "First saw this on Netflix (not on there now but is on Amazon Prime in the UK). Absolutely refreshing that this killer clown film actually is rather frightening. Best parts would have to be the when the dog eats the clown nose, Kent's attempted suicide and when Kent kills Jack's bully."
    }
  ]
}