{
  "id": 2645,
  "title": "Clueless",
  "starring": [
    "Alicia Silverstone",
    "Stacey Dash"
  ],
  "runtime": 97,
  "genre": [
    "Comedy",
    "Romance"
  ],
  "description": "Shallow, rich and socially successful Cher is at the top of her Beverly Hills high school's pecking scale. Seeing herself as a matchmaker, Cher first coaxes two teachers into dating each other. Emboldened by her success, she decides to give hopelessly klutzy new student Tai a makeover. When Tai becomes more popular than she is, Cher realizes that her disapproving ex-stepbrother was right about how misguided she was -- and falls for him.",
  "releaseYear": "1995",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/8AwVTcgpTnmeOs4TdTWqcFDXEsA.jpg",
  "categories": {
    "plot": 6.333333333333333,
    "acting": 6.090909090909091,
    "ending": 10.0,
    "soundtrack": 9.0,
    "cinematography": 5.0,
    "familyFriendly": 6.0,
    "funny": 6.6923076923076925,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "5",
      "text": "I don’t even know how to start this. Clueless is fine. It has some nice performances by Alicia Silverstone and Paul Rudd. The cinematography is passable. It can be quite funny, and the writing is pretty good. The main issue with this film is its point and the character arcs. Without getting into spoilers, so many arcs and themes seem incomplete, like it was too scared to go all the way with a message."
    },
    {
      "rating": "7",
      "text": "This movie had a lot to offer. From, clever one-liners to some classic punchlines and everything in between, this movie, didn't disappoint. I found Alicia Silverstone's character, Cher to be charming. I like how Amy Heckerling managed to step away from the classic blonde stereotype and decided to give us something fresh, yet familiar. Cher is different in that she is caring, compassionate, and selfless--traits we can all admire in a person. This is proven time and again in the many actions she commits (e.g. when she helps her teacher get a date with another teacher, helps the new girl become popular, etc.). However, not every character in this movie was nearly as well-rounded or even as  likeable as Cher aside from possibly Ty Fraser (the new girl). Most of the characters were okay, the plot was decent, and Heckerling's direction tied the movie together nicely. Overall, this movie is decent. I like it, and appreciate it's influence, but I have to want to see it. Which doesn't happen often. For me, this movie is a strong 7/10, but enjoyable. :)"
    },
    {
      "rating": "2",
      "text": "A big mess, without culmination, is not fun and doesn't take your interest. To me it was new and weird to see in a teen comedy the \"popular\"girls at school being smart as well. For a comedy there were not much successful jokes. Although, \"Mean girls\" has stolen the idea of ​​the \"losers\" transformation, in \"Clueless\" it was developed much worse.I give the movie 2/10, just because of the scene with the driving lesson, which made me laugh."
    },
    {
      "rating": "9",
      "text": "A classic from the 90s, if you've never seen wasting time. Much better than the current teen movies, this movie really portrays so funny, \"dramas\" of teenagers."
    },
    {
      "rating": "10",
      "text": "This is clearly one of the best movies ever made. While it probably causes 99% of the population to scratch their heads with curiosity, this movie really does what it is meant to do very well. It's extremely entertaining and thoroughly over the top. One of the best 'blonde' movies ever made."
    },
    {
      "rating": "0",
      "text": "WHAT I LIKED: Some of the acting is very convincing and erm....\rWHAT I DIDN'T LIKE: Serious messages? They're there, but are mostly to buy into, not think about - these characters represent something so wrong. 'Clueless' is a commercialised, cliched-American, very run off the mill rom-com with very few funny moments. I suppose this film is supposed to be all that, but that doesn't make it enjoyable for me\rVERDICT: It's terrible. Really. Nothing redeems this film in any way."
    },
    {
      "rating": "9",
      "text": "This us without a doubt one of my favorite movies. Having seen it at the ripe old age of 15 when it first came out I fell in love with it and immediately made my father take me to the mall so I could buy a cassette tape of the soundtrack. Now at 40 I still absolutely live it. Sure it's nostalgic for me but this reimagining of Shakespeare's Emma still feels fresh and relevant. The comedy is as potent as ever and the performances are spot on from a doofy and missed Brittany Murphy (Just Married) to a charming Paul Rudd (Ant Man) and a wonderfully charasmatic Alicia Silverstone (The Crush) and more. The soundtrack still rocks as does the clever and inventive screenplay and direction from Amy Hecklering (Loser). The movie is undeniably a classic.Budget: $20mBox Office: $57m4.5/5"
    },
    {
      "rating": "7",
      "text": "Hilarious, silly, charming, sweet and rocking, \"Clueless\" is the epitome of teen movies with all that definition means. Besides, captures totally the essence of the 90s with all its pop cuture references. \"Clueless\" is a marvelous and funny experience who tries to portrait to the X generation with all its contradictions, pleasures and definitions. Alicia Silverstone is the perfect image of this inane, vacuous woman full of good intentions. Her performance is perfect and fit exactly in her persona. \"Clueless\" is a milestone, a movie that is a reference for all the 00s teen movies but with more than all the charming . Lindsay watch and learn!"
    },
    {
      "rating": "8",
      "text": "A well made movie with a fast, witty script. You will find that you never get tired of seeing Clueless. It may not be the Marx Bros, but in the world of modern day comedy, it is the cream of the crop."
    },
    {
      "rating": "9",
      "text": "A funny, astute satire on high school life. The script is fresh, original and speaks to high schoolers in a way most high school movies don't. This movie is great because it gets what high school is all about."
    },
    {
      "rating": "7",
      "text": "The most shocking part about Clueless is that Cher thought she and Christian would have sex when he brought over Spartacus (which is 3 hours long) for them to watch. Nothing says sex like Kirk Douglas as a Roman for 3 hours. Clueless is a funny, cute, and delightful slice of high school film. While hardly revolutionary, the film is incredibly fun to watch and very funny from beginning to end, plus it has more going on in its mind than many a high school film. Alicia Silverstone is terrific in the lead role and really plays the role of the popular and vapid high school girl. There is honestly not much to say about this one. Quintessentially 1990s, Clueless brings the charm and wit of a 1980s John Hughes teen classic and updates it for the 90s. If only there were movies like this nowadays."
    },
    {
      "rating": "10",
      "text": "What a surprise for me. I was expecting a dumb entertaining movie for girls. But in the end there were so many funny scenes. Also I enjoyed the many tricks how to seduce men, it is interesting to see the counterpart, haha. Of course Alicia Silverstone is so sweet with a perfect and yet so many wardrobes. Also the language was great."
    },
    {
      "rating": "9",
      "text": "Clueless is the quintessential 90s flick. From MTV to early cellphones to hanging at the mall to remembering when we had our first crush on Alicia Silverstone, to later discover it was actually her fierce wardrobe. This film is timeless."
    },
    {
      "rating": "10",
      "text": "A fun, great comedy satire, with a lot more clever gags and genuine sweetness then in your average teen comedy! It is, surprisingly one of my favorite movies now, and I don't even like teen movies! But, this film is a clever twist on teen movies, which this movie actually makes fun of."
    },
    {
      "rating": "9",
      "text": "Clueless is a rite of passage movie for all teen girls. And Cher is a real role model. Although her ventures and schemes backfire, she handles them with lots of enthusiasm and gusto which makes her such a lovable character. And she learns that even if you look everywhere for love and don't see it, it will always show up in the most unexpected places...an uplifting and positive message for teen girls."
    },
    {
      "rating": "8",
      "text": "I really enjoyed Clueless... I found it fun, charming and easy to like. It is loosely based on Emma, and while some of the book's issues are put across here, like social standing, the story was updated to make it appealing for teenagers, and it ticks almost all of the right boxes. A perfectly cast Alicia Silverstone positively sparkles in the title role of Cher, and she is further advantaged by a funny well-written script, a classic heart felt story, and very good performances from her co-stars, such as Brekin Meyer and Brittany Murphy. The direction by Amy Heckerling was also spirited. The film looks lovely, with very nice costumes and locations. My only two criticisms are that the film is a little long, and once or twice only when the story almost falls into predictability. Overall, a fun, engaging and well acted film, that I would definitely watch again. 8/10 Bethany Cox"
    },
    {
      "rating": "7",
      "text": "This comedy, which functions as an X-ray of BH's superficial and materialistic youth in the 90s, narrated firsthand by the spoiled daughter of a lawyer, would be a little better if it weren't for the fact that it's difficult, I'm not saying impossible, to feel sympathy with at least one character. If you're looking for the best movies of 1995, those are: The Little Princess, The Usual Suspects, 12 Monkeys, and Babe."
    },
    {
      "rating": "7",
      "text": "The movie is pretty funny but overall it's really quite forgettable. 65/100"
    },
    {
      "rating": "10",
      "text": "Hilariously funny take on the book \"Emma\" by Jane Austen that works on all realms. A definite classic. Anyone that hates it...AS IF!!!"
    },
    {
      "rating": "10",
      "text": "A combination of perfect casting and subtle humor. The best teen movie I have ever seen. Could not be improved."
    },
    {
      "rating": "10",
      "text": "My high school experience wasn’t like this. cher is a queen and i will not debate this"
    },
    {
      "rating": "10",
      "text": "How can you not love this movie??? Clueless is the best movie from this style, im my opinion. Cher is so fabulous! The characters clothes are completely flawless and amazing. I've watched this more than 12 times, and all of those i had so much fun like if i was watching for the very first time! They are so cool and popular, hang out with all these friends and go to these cool parties, especially cher... she's everything i wish i was lol. One of my comfort movies. Perfect!"
    }
  ],
  "recommendations": [
    "easy_a",
    "10_things_i_hate_about_you",
    "the_duff",
    "17_again",
    "friends_with_benefits",
    "50_first_dates",
    "blockers",
    "mean_girls",
    "leap_year",
    "american_pie",
    "sisters",
    "forgetting_sarah_marshall",
    "booksmart",
    "freaky_friday",
    "pitch_perfect",
    "role_models",
    "zack_and_miri_make_a_porno",
    "legally_blonde",
    "blended",
    "pitch_perfect_2",
    "meet_the_parents",
    "bachelorette",
    "no_strings_attached",
    "neighbors",
    "27_dresses"
  ]
}