{
  "id": 2826,
  "title": "Coach Carter",
  "starring": [
    "Samuel L. Jackson",
    "Rob Brown"
  ],
  "runtime": 136,
  "genre": [
    "Drama",
    "History"
  ],
  "description": "Based on a true story, in which Richmond High School head basketball coach Ken Carter made headlines in 1999 for benching his undefeated team due to poor academic results.",
  "releaseYear": "2005",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/y3HOTTyM5nLsdUzXFtFCohG28qj.jpg",
  "categories": {
    "plot": 8.571428571428571,
    "acting": 8.142857142857142,
    "ending": 7.0,
    "soundtrack": 8.0,
    "cinematography": 5.0,
    "familyFriendly": 5.0,
    "funny": 5.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "10",
      "text": "\"Our deepest fear is not that we are inadequate. Our deepest fear is that we are powerful beyond measure. It is our light, not our darkness, that most frightens us. Your playing small does not serve the world. There is nothing enlightened about shrinking so that other people won't feel insecure around you. We are all meant to shine as children do. It's not just in some of us; it is in everyone. And as we let our own lights shine, we unconsciously give other people permission to do the same. As we are liberated from our own fear, our presence automatically liberates others.\" - Timo Cruz\r That's a movie, really. It's one of the most moving films I've seen. This movie really worth seeing. Samuel L Jackson plays the role very well."
    },
    {
      "rating": "10",
      "text": "Great movie! Feeling the excitement in the game, wanting to cheer along with them. Doesn't only focus on the sport of the movie but also high school, society, and life. Well done story plot, with great characters along with it."
    },
    {
      "rating": "0",
      "text": "The movie was excellent. I found it so motivating that I went to his website and ordered a book. It's been almost 4 months and I have yet to see a book. I'm very dissappointed with this whole experience. It's hard to have faith in people when situations like this occure. I truly felt coach carter was genuine and had a great love for helping our children have a better understanding of the importance to do well in school. I hope this isn't business as usual."
    },
    {
      "rating": "10",
      "text": "This was the best film I have ever seen in my life and the film is already very good and the reflections it brings are excellent.  This is the best movie I've ever seen!!!"
    },
    {
      "rating": "7",
      "text": "Not a bad movie, not bad at all. Story was good, and the games looked nice, however, the only thing that made me watch was samuel L. Jackson. Overall, it's worth a rent, that's about it."
    },
    {
      "rating": "8",
      "text": "It's worth watching. Really good performance by actors, good music and incredible story makes this movie an excellent material."
    },
    {
      "rating": "7",
      "text": "Yes, the movie may be a bit cliche, but all sports movies ultimately are. At the end of the day, it's a very good film with an even better message. Samuel L. Jackson is great in the lead role and his performance is certainly one of the many bright spots in this film."
    },
    {
      "rating": "9",
      "text": "It's one of the most inspiring movies. Student comes first. Everything in the movie was good. The characters fitted their roles, there is a sense of excitement in watching this. We'll all learn from it."
    },
    {
      "rating": "7",
      "text": "Coach Carter is such an inspiring story. Sam Jackson does what he does best,  being tough as nails and not being shy about saying anything. This film deserves to be in the best sports drama list"
    },
    {
      "rating": "9",
      "text": "I love the message of this movie, and Samuel L. Jackson once again nails it. It's an excellent movie with an impressive message. 9/10 to me."
    },
    {
      "rating": "9",
      "text": "Rewelacyjny film. Film który pokazuje nam coś więcej niż tylko durne marveloskie efekty specjalne."
    },
    {
      "rating": "8",
      "text": "Coach Carter understands a lot of early-2000s cultural intricacies which other films of the genre struggle to capture, but the relatively simple characters don't always sell it correctly. Still, the movie tells a rich-enough story in a heartfelt, energetic way, which makes rooting for  Coach easy. Samuel L. Jackson plays Coach in a layered performance which sells his sometimes questionable actions well."
    }
  ],
  "recommendations": [
    "the_blind_side",
    "cinderella_man",
    "eddie_the_eagle",
    "remember_the_titans",
    "good_will_hunting",
    "the_ultimate_gift",
    "my_name_is_khan",
    "the_secret_life_of_walter_mitty",
    "breakthrough",
    "forrest_gump",
    "the_shawshank_redemption",
    "the_upside",
    "eternals",
    "mystic_river",
    "scent_of_a_woman",
    "chemical_hearts",
    "goodfellas",
    "joker",
    "a_beautiful_mind",
    "boyz_n_the_hood",
    "invictus",
    "3_idiots",
    "the_devil_all_the_time",
    "rush",
    "revolutionary_road"
  ]
}