{
  "id": 3594,
  "title": "Cobra",
  "starring": [
    "Sylvester Stallone",
    "Brigitte Nielsen"
  ],
  "runtime": 87,
  "genre": [
    "Action",
    "Crime",
    "Thriller"
  ],
  "description": "A tough-on-crime street cop must protect the only surviving witness to a strange murderous cult with far reaching plans.",
  "releaseYear": "1986",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/jCxfbTh8JvJil5edhNywxaTHoWv.jpg",
  "categories": {
    "plot": 2.6666666666666665,
    "acting": 0.0,
    "ending": 5.0,
    "soundtrack": 5.0,
    "cinematography": 8.0,
    "familyFriendly": 3.0,
    "funny": 5.0,
    "action": 4.5
  },
  "reviews": [
    {
      "rating": "8",
      "text": "If your'e a fanboy (or girl) of the action thriller genre then prepare for what is quite possibly the most macho film ever! Great cinematography action scenes and a fantastic noir thriller vibe. Where it's weak in story it more than makes up for in action and style. Carries a stylized manga vibe to it. I'm pretty sure the wachowskis paid homage to this film in particular the attention to detail on the cars/guns/slow-mo action."
    },
    {
      "rating": "10",
      "text": "Easily one of Sly's best movies! It's violent, it's grim, it's 80's LA! Pure gold!"
    },
    {
      "rating": "7",
      "text": "Hilariously cheesy but entertaining Stallone action film. Stupidly awesome."
    },
    {
      "rating": "1",
      "text": "Sylvester Stallone stars in this violent 1986 film from director George P. Cosmatos (Rambo first blood part II). He stars as cop Marion Cobretti known as Cobra to his peers, he enforces his own brand of the law using a vast array of guns and explosives. Really awful  movie with a depressing, dark and violent atmosphere but even with all the violence this film still manages to be bad. A villain dubbed Night Slasher is going round killing women and Stallone (Cobra) must stop him. One of the worst movies in movie history and a real stinker in my books. Bad movie."
    },
    {
      "rating": "0",
      "text": "Director George P. Cosmatos brings us Cobra.... He also directed Rambo: First Blood Part II the year before Cobra but that was better and even First Blood Part II wasn't that great.... Cobra was made in 1986 and it's a action film starring Sylvester Stallone as a cop who wears shades and has a matchstick in his gob. He protects a woman (Brigitte Nielsen) from a ruthless gang I think run by Brian Thompson who's after her. Cobra has some great action scenes but the bits inbetween are boring and depressing a bit like the whole movie. This movie feels like a morgue most of the time because it's dead of any feeling and Stallone at times is a bit wooden and unconvincing and Brian Thompson is a laughably bad villain and Brigitte Nielsen is annoying. The great action scenes don't save the film because it's a horrible story with laughable or annoying and stupid characters and the mood of the film is depressing. I should say all the acting is pretty bad especially from Stallone and Thompson so avoid Cobra at all costs because it's one of the worst films ever."
    },
    {
      "rating": "8",
      "text": "There is no way people actually dislike this movie. Just another reason to never trust the critics"
    },
    {
      "rating": "5",
      "text": "Was enjoying it much more in the first half when it was some bizarre noir/slasher mashup. The dialogue in the slower scenes is pretty awful. The action is filmed very well and the violence is super excessive but it is all very silly and over the top overall."
    }
  ],
  "recommendations": [
    "desperado",
    "safe",
    "ninja_assassin",
    "kate",
    "the_expendables",
    "extraction",
    "sabotage",
    "gunpowder_milkshake",
    "van_helsing",
    "blade",
    "predator_2",
    "first_blood",
    "rambo_first_blood_part_ii",
    "bullet_to_the_head",
    "the_marine",
    "underworld",
    "blade_trinity",
    "6_underground",
    "the_mechanic",
    "transporter_2",
    "shooter",
    "mechanic_resurrection",
    "mission_impossible_ii",
    "the_expendables_2",
    "12_rounds"
  ]
}