{
  "id": 3070,
  "title": "Code 8",
  "starring": [
    "Stephen Amell",
    "Robbie Amell"
  ],
  "runtime": 99,
  "genre": [
    "Science Fiction",
    "Action",
    "Crime",
    "Thriller",
    "Drama"
  ],
  "description": "In Lincoln City, some inhabitants have extraordinary abilities. Most live below the poverty line, under the close surveillance of a heavily militarized police force. Connor, a construction worker with powers, involves with a criminal gang to help his ailing mother. (Based on the short film “Code 8,” 2016.)",
  "releaseYear": "2019",
  "mpaaRating": "NR",
  "imageUrl": "https://image.tmdb.org/t/p/w500/izGX7npHEopDQvngYcxMJEfcFbj.jpg",
  "categories": {
    "plot": 5.826086956521739,
    "acting": 5.631578947368421,
    "ending": 5.666666666666667,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 4.0,
    "funny": 5.0,
    "action": 4.333333333333333
  },
  "reviews": [
    {
      "rating": "6",
      "text": "Its influences are predominantly visible but never problematic. The last thing this film could claim was originality but at least it tries to do things well and in these kind of circumstances is welcome.The film made me remember the Fox series Gifted. I mention it to give you a little idea of the tone, or watch the short film of the same name, which was actually pretty good.Sometimes less is more and this film is a great example of that."
    },
    {
      "rating": "8",
      "text": "Very good for the work funded by people. Those who like to masturbate at how dramatical and sad a film is can go back watching their soap operas."
    },
    {
      "rating": "7",
      "text": "It's decent enough. The plot is quite generic, well meaning guy gets pushed into crime to save his ailed mother. It's interesting enough, especially with the nice world building, and the acting holds up decently. I wouldn't say this film is outstandingly good, but it isn't terrible either. I would say watch it if you have free time."
    },
    {
      "rating": "5",
      "text": "Welcome back all you streamers, work-from-homers and friends! We hope you all are staying safe during this global pandemic. To help you stay indoors, we continue to review movies that may keep you entertained during this endless nightmare. This week I was able to watch, Code 8. This actually debuted on Netflix in December of 2019, but it just now got on my streaming radar.Code 8 is about a young man, Conner Reed (Robbie Amell), with special abilities who is trying to make it in the world. This world commonly has people with \"special\" abilities that have to live in poverty, but Conner also struggles due to having an ailing mother with expensive medical treatments. We follow Conner as he tries to make money and falls into a lucrative criminal world led by Garrett (Stephen Amell, Green Arrow), who works for a drug lord (Greg Bryk). So let's get to the reviewDoes this story sound familiar? I mean come on man! The marginalized, powerful person has to scrape up resources to save their family. Another, we have powers, so lets rob something movie? Okay, you get what I'm saying. You've seen this movie before! The really bad part about this movie is that it's a mash-up of like 3 or 4 different movies that you've seen before. At the end of the movie, my wife and I looked at each other and said, \"how did we get here?\" Now, this disjointed storytelling could be the writing, the direction, or the editing. Most likely, it is all the above. I mean shoot they never even really explained the title of the movie. No single one of those elements was completely bad but the mixture of mediocre direction, writing and editing makes me think I know exactly what happened, I knew exactly what was going to happen and yet I'm still confused at what I was supposed to take away from all of it. It's quite underwhelming. In fact, they left it off as if there could be a second movie; and, for some reason, I have way more hope for that sequel than what I just watched.Speaking of underwhelming, the acting was the most forgettable part of the movie. Green Arrow is always flat, but he didn't have to bring that to this movie too! John Mak, sorry Sung Kang, too was tragic. I actually enjoyed his character on Power, but he did nothing with the limited screen time he had. In fact, all of the characters did nothing interesting. It's the most frustrating part of the whole thing.In fact, everything except for the action sequences in the movie was frustrating. The movie is saved by some cool display of powers and brutal violence. But even the powers were held in check. We've seen these same powers before in other Netflix shows and movies, and they were done much better elsewhere. Again, just frustrating.Needless to say, Code 8 was unimpressive. The predictable and disjointed storyline leaves the viewer wanting more. But do we really want to waste another hour and half? Sure, why not – we’re all stuck at home. The fight scenes are pretty cool, but nothing to write home about. If I were bored, like I was, I’d suggest watching this movie. A handful of streaming popcorn is the height for this film because you might feel under duress by the end."
    },
    {
      "rating": "7",
      "text": "The movie is good. They have a good ambientation but suffer with a lack of good dialogue and excess of cliche. The actors make a good work and take your attettion but it is all. Who likes the superpowers people theme would like this movie. But somebody who is looking for something more can be disappointed."
    },
    {
      "rating": "6",
      "text": "Code 8 is an average movie with a predictable plot, very b - tv pilot vibe to it. Some interesting concepts in here but nothing surprising. Overall this movie has alot of heart and was an entertaining watch. Fun to watch the ammell brothers acting together!"
    },
    {
      "rating": "7",
      "text": "For a $2m budget it looks amazing, good script and well acted.  I guess it was a crowd funded movie, never heard of that before."
    },
    {
      "rating": "10",
      "text": "Amazing film with an amazing cast - do not listen to the critics, enjoy for yourself, has heart and a great narrative"
    },
    {
      "rating": "10",
      "text": "Wow. I like the pace and the emotions of this movie. Different of Hollywood the good way. Highly recommend to watch it. I want to see more from these director Jeff Chan."
    },
    {
      "rating": "2",
      "text": "An amazing excercise in futility. This movie should have stayed a short film. What a heap of garbage."
    },
    {
      "rating": "4",
      "text": "Other than the sci-fi angle, this film's plot is totally trite: Innocent, well-meaning man gets embroiled in a drug deal to help save his ailing mother. What makes it unique is that some of the people in this future-ish world have special \"powers\" that, instead of making them heroes, relegates them to being persecuted (haven't they seen the X-Men movies?). Robbie Amell plays the central character with average leading man skills. His dilemma and the subsequent action is certainly not original or exceptional. If you're able to get past this, you'll be in for a very average crime drama with a very small quotient of special effects."
    },
    {
      "rating": "8",
      "text": "It's far from perfect, but what holds this film back was mostly how it had to climb its way here out of nothing. It was a passion project by a small group of people and it certainly has a ton of heart. I will grant that it's very amateurish, but they had so little to work with, I'd be remiss if I didn't commend the outcome. A real lemonade from lemons production. Look, maybe a year or two ago, I wouldn't be saying this... but this film got a hell of a lot more topical in 2020 than it was in 2019. Police brutality and an abused underclass really hit harder than they used to. This is a bog standard crime drama with a speculative fiction twist. Visualize this movie as a sandwich. The writing, the dialogue, the character archetypes, the tropes, hell the entire plot is the bread. You don't watch it for that; all of that is a vehicle for the premise: Do you want to see a grim reflection of our world where the strife wrought by class prejudice gets turned up to 11? If so, this is the film for you.There's a romantic agony to watching the plight of our antiheroes as they struggle to make ends meet in an authoritarian police state that not only turns the entire population against them, but dials the pressure so high that they practically have to cannibalize one another. So, if you feel a yearning for solidarity with people who are struggling like you are, this is yet another way the movie might be for you.For how unsettling and tragic their world is, this \"crime\" plot might as well be a slice of life. A window into how an entire underclass of people are forced to live - a reflectoin of what people in real life call \"The Trap\". When you aren't allowed to survive above board, you have to scrape by under the table. When you can't afford to live clean, you have to live dirty. The whole thing is a cautionary tale, and PERHAPS it's a bit too on-the-nose - I can grant that! - but it's a cautionary tale that NEEDS to be told: The choices we make as a society have consequences. If those in positions of authority push people down, then those people must undercut that authority.I don't know if I could classify my appreciation for this film as \"schadenfreude\" the way I would normally use that word, because usually it implies watching bad people get what's coming to them. But in this rare case, the itch that this film scratches for me is the feeling of validation, seeing other people struggling and scrambling and watching the world they live in shudder with the strain. If it could be said that this film could only get one thing right, it's that corruption above creates corruption below. It fits. It belongs. It resonates. If you can't see yourself in it, then I have trouble believing you're a person."
    },
    {
      "rating": "5",
      "text": "When it looked like it was going to be good, the film gets lost in a silly story."
    },
    {
      "rating": "5",
      "text": "This was quite meh movie for me. Had good premise, but while watching it felt boring at many times and also to me reasoning of characters at times seemed a bit weird. Quite average, ok if you don't have anything better to watch"
    },
    {
      "rating": "4",
      "text": "Entretenida pero super cliche, realmente no recomiendo perder el tiempo en esto a menos que realmente no tengas otra cosa que ver."
    },
    {
      "rating": "2",
      "text": "Marked as a Canadian film... didn't expect much but somehow I got worse than I expected, good for background noise whilst cleaning the house.."
    },
    {
      "rating": "5",
      "text": "Code 8 was just ok. The story has a good premise. The acting was certainly strong and saved the movie in a lot of ways. But the rhythm of the movie is slow and some dialogues are just so cliché. The effect are fair. The soundtrack is, somewhere I guess. I give it 52%. I wasn't able to past 50% of the movie."
    },
    {
      "rating": "1",
      "text": "(Mauro Lanari)With decades of delay on Marvel and on the cinematographic transpositions, a film about the mutants necessary for those who suffer from a Psyke withdrawal crisis."
    },
    {
      "rating": "6",
      "text": "It's OK I guess. It's not anything that needs to be seen. At least the lead actor puts in a better performance than when he was on Tomorrow People. If you are looking for a superhero movie then this really isn't it. It's something of a re-used story and not very original. Powers are only secondary to the story. It's like having a soda and you don't want another drink but you are still thirsty afterwards. Wanted to rate this as a 5 but maybe it's a low budget and somewhat dull 6 instead ? That's generous."
    },
    {
      "rating": "7",
      "text": "Really a 6.5 but it’s well acted so I rounded up. Overall, I can appreciate the effort put into this movie."
    },
    {
      "rating": "4",
      "text": "As CGI gets better the characters gets thinner.Everything is good in this movie except the story and the characters."
    },
    {
      "rating": "8",
      "text": "8/10 *   Ganz Cool aber ich habe mir gewünscht das Connor noch mehr seine Kräfte einsetzt gegen Feinde."
    },
    {
      "rating": "4",
      "text": "It's not \"horrible\" but at the same time, just barely average.  Concept and storyline all above avg, but this movie needs some charisma (and even a little humor) to make it interesting.  All of the action parts fall flat, no real \"super hero\" action (more of a B-rated heist movie that happens to involve some kids with super human powers) and the acting does nothing to pull you in or keep you interested.  Even some of the action is very 90's hollywood (a cliche heist involving an armored car?  c'mon....so so 90's).I actually started routing for the bad guys just to keep me entertained until the end (they had more character and substance than the main character and supporting actress) All that to say, it's not the worst movie, but there are much, MUCH better options out there than this stale, flat and predictable movie."
    },
    {
      "rating": "10",
      "text": "This movie was amazing!   Discovered on Netflix, loved the universe!!   Wish they made it a tv series, so there could be more stories explored."
    }
  ],
  "recommendations": [
    "limitless",
    "contagion",
    "elysium",
    "what_happened_to_monday",
    "the_tomorrow_war",
    "repo_men",
    "eo",
    "x_men_apocalypse",
    "the_darkest_minds",
    "in_time",
    "the_purge_election_year",
    "jumper",
    "the_new_mutants",
    "infinite",
    "shadow_in_the_cloud",
    "sanctum",
    "lucy",
    "project_power",
    "after_earth",
    "colossal",
    "chaos_walking",
    "brimstone",
    "the_adjustment_bureau",
    "surrogates",
    "pompeii"
  ]
}