{
  "id": 4843,
  "title": "Coherence",
  "starring": [
    "Emily Baldoni",
    "Maury Sterling"
  ],
  "runtime": 89,
  "genre": [
    "Thriller",
    "Science Fiction"
  ],
  "description": "On the night of an astronomical anomaly, eight friends at a dinner party experience a troubling chain of reality bending events.",
  "releaseYear": "2013",
  "mpaaRating": "NR",
  "imageUrl": "https://image.tmdb.org/t/p/w500/oWlgqzVPWMpA8QGB8eUQYXXYgr0.jpg",
  "categories": {
    "plot": 6.962962962962963,
    "acting": 7.428571428571429,
    "ending": 7.384615384615385,
    "soundtrack": 2.0,
    "cinematography": 9.0,
    "familyFriendly": 4.0,
    "funny": 5.0,
    "action": 9.0
  },
  "reviews": [
    {
      "rating": "9",
      "text": "Schrödinger's Cat: The Movie\r Zero FX Magic\r Coherence is a rare treat in a world with so much bad sci-fi in theatres and on television (the current syfy line-up comes to mind).\r It's really good, complex, sci-fi that never bogs down in explication. It also doesn't rely on special effects to sell its central concept.\r The cast is believable and the narrative weaves its way deftly through the characters, very average, lives.\r Buy It at Amazon now - thank me later."
    },
    {
      "rating": "10",
      "text": "A small masterpiece that would have made Rod Serling proud. True science fiction, dealing with scientific conceits, not ray guns and tentacled monsters, that plays with your mind like the very best Twilight Zone ever had to offer. Certainly one of the most enjoyable films I have seen in recent years. I watched it three times in three days, each time catching a few more significant details."
    },
    {
      "rating": "9",
      "text": "Coherence is a solid sci-fi horror which explores some interesting concepts around Quantum theory and causality. It's unashamedly intellectual so won't appeal to everyone and I also feel that the ideas could have been fleshed out a little more for a greater impact. If the film had been half an hour longer it would have been perfect for me. The ending is brilliant though, one of the best I've seen in ages and the concept behind it both fantastic and disturbing."
    },
    {
      "rating": "10",
      "text": "This movie deserves it high score. Its a smart movie that keeps catching you off guard with unpredictable twists. You have no idea at all through out the entire movie how its going to end. It contains a certain magical charm that makes the movie as a whole hard to compare to any other. A great movie, smart, well thought through. I give it a 10 purely for its entertainment value."
    },
    {
      "rating": "8",
      "text": "This is a legitimately good, intelligent sci-fi film. it doesn't try be \"pretend sc-fi\" by using cgi, futuristic technology, and other gimmicks. Instead, it takes a very unique idea grounded in some science and revolves the whole film around it.\r Despite having low production values and relatively unknown actors, the film has very good writing and acting. The chemistry between the actors was very good, and their dialogue was some of the best and most believable I've seen on film. I never felt bored watching this film, despite most of it taking place in a house and showing people talking. This is the real testament to quality writing.\r This film will surprise you, and engage your mind in trying to understand what exactly is happening. My only real complaint, and the reason I couldn't give this a 9 or a 10, is because at the end the protagonist acts contrary to her character."
    },
    {
      "rating": "9",
      "text": "Coherence is a mind bending thriller that is half part a complex alien movie, and on the other half it is about dysfunctional relationships. Throughout you have the doubt of if it is really happening or not, which raises your pulse and adapts tons of tension."
    },
    {
      "rating": "8",
      "text": "This was an unexpected surprise, as I knew absolutely nothing about it going in. It was recommended to me by a friend who's also a big horror fan and I'm glad I listened to him! So much was done here with such a small budget. I watched it with two others and we were all silent and gripped throughout, yet couldn't stop talking about it afterwards.\r To even say that it's a sci-fi movie is somewhat a spoiler, but unavoidable. It's best to go in knowing as little as possible. One of the most enjoyable and refreshing sci-fi movies I've seen in some time and one that managed to build up quite the sense of dread towards the end. It'll have you trying to guess what's going to happen next, all while doubting everything that you've seen on screen.\r An under-rated little gem of a film."
    },
    {
      "rating": "9",
      "text": "One of the best sci-fi movies I've seen in a while.  Some slick storytelling magic that keeps everything just enough out-of-whack to instill a sense of dread.  A very dialogue-driven movie, and the dialogue is believable.  Has a loose, quick vibe - the actors are all able and for the most part believable, and it seems they were left a little improvisational wriggle-room to make the scenes that much more realistic.  The premise is ridiculous and Twilight Zone-worthy, but the way it plays out makes you feel like it's really happening.  Comet overhead causes odd things to occur and I'll leave it at that - the story best plays out when you have no expectations of what's to come.  As others have said, the fact that this movie gets the blood pumping and tensions rising with no special effects or over-the-top gore, no A-list actors or sweeping cinematography (the camera work is great, though) - is a testament to the power of good storytelling."
    },
    {
      "rating": "8",
      "text": "One of the most cerebral movies to come out this decade, this sci-fi movie is built on amazing performances and mind-bending scientific applications. A must-watch for anyone with a passing interest in theoretical physics or good science fiction."
    },
    {
      "rating": "8",
      "text": "If you liked Primer and/or Another Earth, this is a movie for you. Smart, clever and ambiguous, Coherence belongs in that new genre of peaceful but somewhat terrifying end of the world pictures."
    },
    {
      "rating": "8",
      "text": "Depending on the taste of one as a spectator is how they will find their flavor to this film, maybe for the vast majority is too far-fetched and maybe it is, but you need to pay attention although its style does not seem that necessary but if you do, you'll have a really good film on your hands."
    },
    {
      "rating": "9",
      "text": "Espectacular película realizada con cuatro duros que se basa en el famoso experimento de El Gato de Schrödinger.Básicamente es como una serie B con actores que dan la talla, grabada con una cámara sin trípode para estabilizarla siquiera, en casa de algún conocido del director y con un guión que te hace perder lo que su propio título indica. Aplaudir que, aun teniendo una trama increíblemente enrevesada se entiende a la perfección y no se dejan nada en el tintero por explicar. Me encantaría ver de que sería capaz el director con un buen presupuesto detrás sabiendo que ha logrado 'Coherence' con apenas 50.000 $. Muy recomendada."
    },
    {
      "rating": "8",
      "text": "I...what. Coherence is a mindbending science fiction film that will toss your brain for loops as more and more absurd things keep occuring and are to be expected. When things keep progressing and getting worse, it becomes even more and mindbending and now my brain hurts. Coherence turned my mind into mush. Yet, it is oddly coherent and makes sense. Even if it is beyond explanation, it never leaves the grasp of director James Ward Byrkit. Instead, it is an audacious directorial debut for Byrkit that should hopefully propel him to handling bigger and, ideally, even more original films.\r Incredibly original, it is hard to think of a comparison for Coherence. Some have cited the influence of The Twilight Zone and from what I have heard about that show, it probably makes sense. However, in terms of film, Coherence largely stands alone. Showing the events of a dinner party during the passing of a comet, Coherence is a film that really messes with your mind from beginning to end and forces you to keep up with it. Fortunately, Byrkit avoids any unnecessary exposition, which really helps to add to the atmosphere. This confused and lost party and their fear is matched by the audience as we try to piece things along with them. Byrkit could have lost their confusion if he kept stopping to explain everything. Instead, he pushes the pedal to the metal and plunges forward.\r Featuring a largely unknown cast, Coherence is not necessarily a film about its characters. That said, the acting across the board is solid. Plus, the writing of the characters is solid. Nothing extraordinary, nor are they incredibly deep, but their pasts and their stories are important as the film progresses. For them, it is the key to knowing where and who they are.\r More than anything, Coherence shows serious ambition. For this to be Byrkit's debut is an absolute wonder. It is not perfect by any means and probably gets too caught up in philosophy and quantum physics to be truly accessible or perfect. That said, a more experienced director would have problems keeping this one under wraps and having it somehow stay coherent. Instead, many would let the film got bogged down within itself and make no sense in the end. For Byrkit, however, things remain oddly linear. Who we are watching is unbeknownst to us, yet everything is the same and the viewer is able to follow the plot without nary a hitch. As Byrkit adds more and more layers to this film, things remain within our grasp and the film never feels like it is too much. It never feels silly. Instead, this air of paranoia and confusion runs rampant and truly arrests the viewer.\r Showcasing serious potential for James Ward Byrkit in the director's chair, this mindbending film is a terrifying, atmospheric, somehow coherent, and truly original science fiction film. It is a rarity nowadays to say that, but it is the absolute truth. In creating this original film, Byrkit was incredibly ambitious and trusting of his audience to follow him wherever he opted to go. The end result is a truly engrossing experience that - for lovers of science fiction - will pay off in spades."
    },
    {
      "rating": "9",
      "text": "The ending is a little bit of a cliffhanger, but holy hell this movie is awesome! It has such ab interesting premise and they use simple cinematography to show it and it works well"
    },
    {
      "rating": "10",
      "text": "Coherence (2013)Sinopsis:Ocho amigos en una cena experimentan una cadena de acontecimientos inquietantes debido a la influencia malévola del paso de un cometa.Opinión:Un inquietante y minimalista thriller de ciencia ficción que con un reducido presupuesto de 50 mil dólares sin efectos especiales ni aliens ni criaturas ni naves espaciales logra atrapar al espectador con su historia la cual se desarrolla a fuego lento pero haciéndolo bien, se torna un poco confusa a veces pero es precisamente eso lo que te vuela la cabeza, simple pero efectiva.Valoración:5 ⭐ de 5Todo un logro del cine independiente"
    },
    {
      "rating": "8",
      "text": "Reminds me a lot of \"Primer\", but a little more accessible.  Very fun and Twilight Zone-esque.\r abcdefghejklmnopqrstuvwxyz\rabcdefghejklmnopqrstuvwxyz\rabcdefghejklmnopqrstuvwxyz"
    },
    {
      "rating": "6",
      "text": "A well made film that turns out to be incoherent.  No question this film is interesting and will have you thinking, but about two-thirds of the way through I started not caring as much.  A good idea with mediocre results.  B-"
    },
    {
      "rating": "6",
      "text": "Coherence is a chaotic and highly spontaneous dinner party mystery. The acting is artificial, which may work for you (or not) as part of the unnerving vibe. The characters' actions are puzzling and the plot is erratic. Coherence is definitely a film that will keep you guessing. Recommended to lovers of improv and indie films such as Primer and the Blair Witch Project."
    },
    {
      "rating": "7",
      "text": "I'm a sucker for a good time travel movie, and this one was really well done. Now, I'm not a scientist or anything, but it's clear to me that an extensive amount of thought had been given to the time travel scenarios and how it would work if certain situations would occur. The movie got more and more exciting as each minutes passed as more details got revealed around the time loop mystery. It's really well done, and it's easier said than done spinning a story like that the way they did it here.Also, I didn't really know any of the actors in the movie, but all of them did a really great job. :)"
    },
    {
      "rating": "5",
      "text": "The plot was not very tight nor clever. It’s a good idea and an ok execution, but I expected more. A bunch of random stuff happened, but I wanted things to fall into place neatly in the end, which didn’t happen. The acting was also very casual, like it was all done in one take, and they called it a day."
    },
    {
      "rating": "2",
      "text": "A regular independent film, which seems to have neglected the most technical aspects.Low-budget independent films are boxes of surprises. You never know if they are excellent or crap. This film seemed like a good bet, with a plot based on a group of friends who get together for dinner during the passage of a comet that, in a somewhat mysterious way, causes a series of problems such as the Internet and electricity failing, broken cell phones and , stranger still, a juxtaposition of parallel realities.I thought it would be more of a psychological horror film, and I believe there are scenes where some inroads are made in this field, but the suspense and the clever mystery created end up standing out. However, the characters are poor and very cliché, and the whole story becomes so strange that it quickly loses credibility. At one point, it all sounds so surreal that it doesn't really matter what really happened there. Another annoying thing was having so many characters talking on top of each other during the film. If it happens on time it makes things more authentic, but if it is always happening it is too much. None of the actors are known, the bet was on unknown names, but with experience in indie films and sporadic participation in TV series (Emily Baldoni, Maury Sterling, Nicholas Brendon etc.).The film uses sound effects and music quite well to increase suspense and become more tense. Being a low budget film it is not surprising that there is only one filming location and that it is a relatively poor film. What is more difficult to forgive is the rather amateur work of filming, with most scenes so shaky that it seems that the cameraman was nervous. Another thing that is not easily forgiven is the deficient editing and post-production work. These are details that may seem of less relevance but that can lose the chances of a serious film career."
    },
    {
      "rating": "10",
      "text": "Al principio puede parecer lenta, pero tiene muchos detalles que si le prestas buena atención, verás lo genial que es la peli"
    },
    {
      "rating": "7",
      "text": "This is a complex moving investigating a complex, nearly indecipherable idea of space, time, and coherence.  Don't want to say anything more without giving something away.  I would, however, immediately distribute light sticks to all of the members of my family -- all of the same color."
    },
    {
      "rating": "7",
      "text": "If you have an affinity for mind-bending riffs on quantum physics, you'll enjoy \"Coherence.\" Most of these types of stories take the concepts of quantum mechanics (entanglement, superposition, etc.) which exist at the most microscopic--level (electrons, particles) and posit that similar effects could happen at the macro-level (real-world people and physical objects).\"Coherence\" takes a nightmare dinner party scenario (ala \"The Invitation\") and applies the quantum concept of coherence and \"many-worlds interpretation\" (or multiple universes) that is triggered by a passing comet. It's better to come into this with as little info as possible to enjoy the unwinding of the mystery. While its a bit of a slow burn at first, the filmmakers really nail the ending."
    },
    {
      "rating": "7",
      "text": "A great idea for a sci-fi movie; the ensemble cast does well in all the confusion. Entertaining and with a good ending. Give this a try, you will enjoy it."
    },
    {
      "rating": "7",
      "text": "The group of people who experience this unusual phenomena are kind of spiteful and dumb (the acting was fine, though).  However, the situation itself is really cool, and I enjoyed seeing how they tried to come to terms with it.  It's a good example of executing a clever SF idea on a lower budget."
    },
    {
      "rating": "8",
      "text": "Coherence is an excellent film shot for 50K $ and with unknown actors in a small house. The plot is simple, but captures from the first minutes. The chamber of what is happening is only for the benefit of the film. The ending of the film is of course upsetting with an open ending, but in general, logically the viewer was given answers to all questions."
    },
    {
      "rating": "6",
      "text": "This was good.  It's short enough to be worth engaging with, so I'd say just watch it.  Give it a try.  It's a perfectly palatable, pretty intelligent sci-fi without glitz and gloss.  No spoilers, but the ending is awful, makes no sense and completely contradicts the central protagonist's character.  I felt like they ran out of budget or something and the producer burst in on the writer during lunch, said \"We can't afford the ending you wrote!  You need to wrap up this story in ten minutes!  You have five minutes to write the new resolution!\" and things went from there.  I mean, I literally have never seen a more random smeg of an ending in all my life.  They completely went off the rails and just rushed towards something, ANYTHING in what appeared to be raw desperation.  It would be like if this review started talking about fire ants or something.  Absolutely crazy and pointless.  But again, it's well worth watching and deciding for yourself.  Do this if you're a big movie fan or sci-fi connoisseur.  You'll be glad you watched it.  Just don't expect too much."
    },
    {
      "rating": "10",
      "text": "THEE BEST movie I have seen in a very long time.  Wow.  What a mind bender.  I have watched it a few times over the past week.  It is incredibly well done.  I wish I could personally thank everyone who made this film.  What a great addition to picture films."
    },
    {
      "rating": "7",
      "text": "70/100  It's a movie that makes you think, this what intrigued me. Many things that do not make sense at first but they become a bit clearer along the way (but still do not know what's going on)  What I did not like was acting, and how it was filmed (I generally like found footage-like movies, that the kind of filming, but here it did not work for me)"
    },
    {
      "rating": "10",
      "text": "The term ‘sci-fi’ can bring to mind images of mega-budget action sequences and CGI futurescapes; in stark contrast, the most exciting sci-fi in years takes place in the present day and features eight people sitting around a dining room table. Coherence, which is currently garnering much acclaim at festivals and independent showings, is an exceptional (and refreshing) cinematic experience, both as an example of the sci-fi genre and independent cinema in general. Produced on a shoestring budget in director James Ward Byrkit’s house, Coherence manages to blow its big-budget competitors out of the water via a sensational concept supported by a solid cast.When eight friends meet up for an ordinary dinner party, it seems like any other night, until a power cut mysteriously leaves only theirs and one other house with power. Soon the situation becomes disorienting and bizarre when photos and notes start turning up belonging to the dinner party guests, presumably from the other house. The film then descends into an expanding riddle about paranoia and alternate realities, as one character, Em, emerges as the audience surrogate, watching her friends – and herself – fall apart at the seams, in a situation that they don’t understand.Much of Coherence’s success stems from its focus on the central premise – the key idea is so good that it doesn’t bother to waste time with anything else. Aside from a small amount of character set-up in the opening, there are no pauses. All other character development occurs as the story moves along, both lending the film excellent pace and helping the viewer keep up with the increasingly complex story. Coherence also manages to steer almost entirely clear of one of science fiction’s least desirable traits: tedious exposition. A useful snippet of information here and there is all the viewer needs. The filmmakers trust the audience’s intelligence.A major strength of Coherence is found in the performances – each actor creates a character so whole and alive it feels as if they go on living while off-screen, not just puppets illustrating a story. While Nicolas Brendon may be the only familiar face in the line-up (having famously played Xander in Buffy the Vampire Slayer), the entire cast performs exceptionally well. It will not come as a surprise to those who have seen the film to learn that the dialogue was improvised based only on character descriptions and loose scene outlines. This gives the film an outstanding sense of realism, grounding the strange occurrences in a solid and familiar setting.Director Byrkit has several times in interviews acknowledged and cited the Twilight Zone as a source of inspiration, and Coherence certainly has a sense of a modern, feature-length episode of the iconic TV show. One of the things Coherence will leave you with is the tantalizing question of “what would you do?”, not dissimilar to the effect of a great Twilight Zone parable. No doubt this will help the film’s shareability no end – it certainly makes the viewing experience a memorable, if haunting, one. This is a film that rewards repeat viewings; there’s a wealth of clues and allusions so subtle they would go completely unnoticed to even the most eagle-eyed first-time viewer.Coherence has been crafted with love and intelligence, overcoming the obstacle of its minuscule budget to prove that real cinema doesn’t need whistles and bells to have an impact. While it has most definitely succeeded artistically, being praised by both critics and cinemagoers alike, the only problem Coherence now faces is reaching the audience it deserves – the production has precious little money for marketing and distribution."
    },
    {
      "rating": "8",
      "text": "Great example of how you can make a great sci-fi movie without a big budget.All you need is a good story and a lot of imagination."
    },
    {
      "rating": "9",
      "text": "I don't believe I didn't watch this movie before. This movie in the top5 best sci-fi movie for me."
    },
    {
      "rating": "9",
      "text": "What a movie. Exceptionally well made on such a low budget, but yet causes immense visceral feelings in all that will watch it."
    },
    {
      "rating": "1",
      "text": "So annoying that I could not finish it. The characters are insufferable. The men all look alike, with slightly different personalities. That makes it hard to tell them apart. They initially appear as if they're smart, maybe well educated people, but then everything they say and do is moronic. Glad I didn't stick around for the ending."
    },
    {
      "rating": "8",
      "text": "Great movie with a couple of issues.First, the decision making was incoherent for the first half of the movie. It took 10-15 minutes too long for the characters to understand the basics of what was going on. Some of the decisions even after make no sense. Some people still wanting to leave the house, alone no less. This issue went away for the second half of the movie. Second. The characters lacked continuity and coherence. Laurie is supposedly the worst, a succubus, yet was a completely normal person for the most part. Then, completely out of character, she starts putting the moves on Kevin and kissing him? Kevin and Emily have a good relationship at the start but after one kiss and reminisce, he no longer cares about her? Just makes no sense. Third, there could have been a lot more done with the movie. The ending was good, but it doesn't seem like enough. The height of the drama was a couple of fights, some old sexual infidelity, the main character trying to kill and replace 'herself' in another universe, and an inappropriate kiss. The stakes could have been elevated and more continuous. My heart only started really pumping when Emily was trying to get rid of her clone, with 3 minutes left in the movie.Onto the good things.  The idea of the movie is incredible. The direction of the script was driven by the director giving each actor cards with their general direction, presumably for the specific scene or period in the film. The rest was filled in with improvisation and light direction. It makes for an incredibly authentic experience and a story that develops really naturally.It also has one of the most authentic processes of discovery imaginable. The actors are trying to figure out what's going on just as much as we the audience are, and that elevates the movie to an elite echelon of movies. The movie takes us down a maze and the experience just grows and grows and grows.This movie is excellent. Worth the watch, without a doubt."
    }
  ],
  "recommendations": [
    "annihilation",
    "arrival",
    "cube",
    "anon",
    "source_code",
    "captive_state",
    "i_am_mother",
    "the_green_knight",
    "sunshine",
    "interstellar",
    "signs",
    "us",
    "donnie_darko",
    "inception",
    "what_happened_to_monday",
    "a_cure_for_wellness",
    "chaos_walking",
    "europa_report",
    "color_out_of_space",
    "enemy",
    "tenet",
    "sicario_day_of_the_soldado",
    "midnight_special",
    "reminiscence",
    "searching"
  ]
}