{
  "id": 4873,
  "title": "Cold Mountain",
  "starring": [
    "Jude Law",
    "Nicole Kidman"
  ],
  "runtime": 154,
  "genre": [
    "Drama",
    "War",
    "History",
    "Adventure",
    "Romance"
  ],
  "description": "In this classic story of love and devotion set against the backdrop of the American Civil War, a wounded Confederate soldier named W.P. Inman deserts his unit and travels across the South, aiming to return to his young wife, Ada, who he left behind to tend their farm. As Inman makes his perilous journey home, Ada struggles to keep their home intact with the assistance of Ruby, a mysterious drifter sent to help her by a kindly neighbor.",
  "releaseYear": "2003",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/32MsALfK6shuSopCrFjSNoxDc5p.jpg",
  "categories": {
    "plot": 7.076923076923077,
    "acting": 7.21875,
    "ending": 7.666666666666667,
    "soundtrack": 8.4,
    "cinematography": 8.0,
    "familyFriendly": 3.0,
    "funny": 6.0,
    "action": 5.857142857142857
  },
  "reviews": [
    {
      "rating": "10",
      "text": "You can talk about this movie whatever you want, but it will not change the fact that it is excellent. The cast is fantastic, just like the story. If you look at other films that came out that year, and see that half of them are really bad, this movie is fantastic."
    },
    {
      "rating": "10",
      "text": "I fail utterly to understand WHY people hate this film. I study literature, for God's sake, I would have noticed if the script had been dire, which it is NOT. If you think Zellweger was hammy, you don't know ham. The ONLY problem with this film is that Jude Law and Nicole Kidman have dodgy accents, but they could have been a lot worse. Chemistry was good, soundtrack was great. What did you expect? Am so glad the critics agree with me on this one - it's a smashing film!"
    },
    {
      "rating": "8",
      "text": "I liked this movie. It maybe the sweet appearance of Nicole Kidman, Or the extremely good cast. Strange to see Renee Zellweger in that kind of Role. I don't get why people hate this movie this much. It's well structured at best. I mean I can't see anything wrong with it. I guess you couldn't outright say this is one of the best. But still It's a solid piece of work."
    },
    {
      "rating": "8",
      "text": "This is one of my favourite novel-to-film 'epics'. Minghella manages, just like he did with the \"English Patient\" to create an engaging, interesting and inspiring feature. Truth be told, it is a bit long, and that could have potentially be changed, but Minghella stayed true to the novel, which is rather important in adaptations, so I didn't mind that too much. Beautiful cinematography and very good editing, along with great costume design and production design make this a technically greatly done film. The musical score is one of my favourite soundtracks of all time, with excellent Oscar nominated songs by Alison Krauss. The cast has gotten a lot of critical acclaim for this, but seems a lot of the audience had a problem with Zellweger and Kidman. I must say I thought they were both excellent, though vastly different roles - which is also what emphasised their uniqueness. Zellweger is just stunning and truthfully portrays the tomboy that Ruby is, and does it with flare and charm. Kidman was not miscast, unlike many state, simply because that is what the character in the novel was like in both age and behaviour. A coy, weak woman in her early 30s sheltered by her overly-protective father, and having the face real-world problems after a lifetime on unpreparedness. Law is also very good, as are the supporting actresses and actors, making this one of the best casts of the year. Overall, \"Cold Mountain\" has very few things wrong with it - actually, I cannot think of any straightout. Of course, it could have been shorter, and it could have clicked a bit better with me on some points, but overall it is a good, strong epic, technically superb and with a strong, A-calibre cast to boast. Very good! 8/10"
    },
    {
      "rating": "8",
      "text": "A beautifully sweeping epic, Cold Mountain is a true accomplishment from director Anthony Minghella. In watching this, it becomes all the more tragic that he died about eight years ago with Cold Mountain being one of his final directorial works. At least, in his wake, we are still able to cherish this visual beauty. However, the brilliance of Cold Mountain is not just skin deep, as its epic sweep all encompasses a tremendous romance amidst the Civil War and, in this, the film also discusses the impact of the war on the South and the loss suffered by those at home. Plus, though not strictly a war film (it is, but it is not the film's main focus), Cold Mountain also offers brilliant battle sequences to go along with every other positive offered by the film.\r Cold Mountain is a film some have compared to Homer's the Odyssey in structure. This is certainly fair as the film tells the story of W.P. Inman (Jude Law) and his journey to return home to Ada Monroe (Nicole Kidman) during the Civil War. Suffering injuries, escaping those who will capture deserters, and crossing paths with a collection of individuals, Inman's journey is long and arduous. Among the tremendous cast that cross paths with Inman and Ada include Renee Zellweger, Eileen Atkins, Kathy Baker, Brendan Gleeson, Philip Seymour Hoffman, Charlie Hunnam, Natalie Portman, Giovanni Ribisi, Donald Sutherland, Cillian Murphy, Jack White, Ray Winstone, Taryn Manning, Emily Deschanel, and Jena Malone. Essentially, this cast is stacked. Every supporting character is played by somebody who eventually blew up, was a veteran actor, or was a relatively fresh face in acting. How they managed to get such a good cast together is mind blowing.\r The film's main focus - the romance between Inman and Ada - is tremendously written by Minghella. Each line is precise and chosen well. The end result is a romance that, though the characters rarely share the screen with one another, is incredibly well-crafted and realistic. Though they barely know one another, their connection to one another is beautifully brought to life through the words of Minghella that breathes air into the lungs of the film. Even when things slow down (and they do slow down) and the film drags, the romance here keeps the film chugging along and taking on all challengers.\r Visually, the film is stunning. From shots, such as Inman staggering to Ada alongside two towering snow-covered rocks, to the battle sequences, the cinematography of this film is terrific. The best part here is the framing, especially in that aforementioned shot. The result of shots such as this is a film that feels as poetic visually as it is verbally. Minghella clearly expended a lot of time focusing on his word choice in writing this film and it shows in the sweeping, verbose communication in the film. However, the visuals are the same way. The film's shots match its beauty step-for-step and often exceed it with a willingness to just slow things down and let the odd, romantic beauty of the war in the South soak in for the audience.\r The battle sequences express this same beauty, especially the opening one when the Union bombs the Confederacy. The billowing tower of smoke and fire, as well as the ensuing battle that occurs in a cloud of dust and blood is pure eye candy. Minghella's camera lingers in this sequence quite often, offering a sort of juxtaposition between the beauty of the shot and the brutality of the war. Nobody was spared in battle and, as a result, nobody was spared at home. In this film, Minghella does not waste any violence. Though often brutal, his film is about bringing to light the suffering of those in war and those at home. Given that many war films focus solely on those in battle, this is a breathe of fresh air for the genre. In this goal, Cold Mountain is entirely successful, particularly in the sequence with Sara (Portman). A single mother with a baby who briefly takes in Inman on his journey home, she asks Inman to simply lay next to her in bed where she begins openly weeping. The specific pain and suffering experienced by those at home is obviously spoken about openly in the film, but never described verbally. Rather, it is always told visually with one slight written hints. This is one of the greatest accomplishments of the film, as it manages to delve in this often overlooked topic and offer great insight, without having to stand by and attempt to explain the pain. Instead, it makes it more realistic and intimate by simply showing it to you.\r A brutal, beautiful, and truly sweeping epic, Anthony Minghella's Cold Mountain covers the Civil War like few films before it had. Covering battle, romance, and the life of those in South, the film plays no favorites, shows the good and bad of both sides, and covers its topics with grace and ease."
    },
    {
      "rating": "9",
      "text": "The director manages to create a very realistic atmosphere throughout the movie, the cast was excellent and so was the music, I don't understand how can someone say that this is not a love story, you can see it right from the beginning. Great performances from most of the actors on the movie.This is a must for your movie collection."
    },
    {
      "rating": "6",
      "text": "the land will not heal..Cold MountainA typical love story set in a war zone that wanders onto the same lash and delivers it convincingly but unfortunately its the same meal we have been having for the course of its runtime. Anthony Minghella; also the director of The English Patient, is back with a similar project no matter how much admirable, in the end it all seems been-here-done-that. The feature scores majestically on performance level where Nicole Kidman, Jude Law and Renee Zellweger are doing some of their career's best work. Cold Mountain; being a character driven feature, goes deep into it where the priority is set to project the bonding between the lead characters (Jude restraining himself from being seduced and Nicole suffering through loss was the perfect way to bind this parallel roles on screen) which is fulfilled utterly by the script."
    },
    {
      "rating": "10",
      "text": "Absolutely flawless. Anthony Minghella's finest work. Cold Mountain is an often grim look at romance during the Civil War. Rarely does a proper romance fulfill our needs for emotion, excitement and comic relief."
    },
    {
      "rating": "2",
      "text": "An anti-war movie. Not really. A love story - doesn't really pull that off either. Tragedy - should be, but the heartache does not come over. Could have been made into a good comedy - with the right script So what is it - Oscar fodder - as someone else remarked. Too long. Too predictable and in some ways too twee."
    },
    {
      "rating": "3",
      "text": "For all its flaws, the movie does at least effectively demonstrate how ?average? men are so easily exploited and used by war. It also demonstrates how easily morality can be turned upside down in times of war by those leaders who leave the fighting to someone else and personally risk nothing. In the Cold Mountain, men who don?t believe enough in the cause to fight in the war garner power and stature by punishing ?deserters? who don?t believe enough in the cause to fight in the war. In a time when Americans leaders have effectively sold the ?average? man on the idea of giving up freedoms to the government so it can protect his freedoms?this type of \"message\" about war might be timely. At the same time, much of the acting in this move is astonishingly bad. Renee Z?s accolades from Chicago gave her enough self-confidence to go way over the top this time around, and enough stature to prevent anyone from trying to save her from herself. She makes Jack Lemon seem subtle. This is truly horrible: grotesque. Its like something you would have expected for comic relief on Bonanza when Hoss was on vacation. Once Renee Z makes her entrance, you just can?t continue to take the story seriously. It is also note worthy that although this is a film about a war that was principally about slavery?the issue of slavery is virtually absent from the film. There are no substantive scenes involving black actors or actresses. While we learn a great deal about the suffering of southern whites, the plight of blacks is touched upon only incidentally. In one of the film?s more bizarre scenes, Nicole Kidman?s character explains that she is planning on ?taking some Root Beer to the Negroes.? However, it starts raining, so she sends a surrogate with the refreshments."
    },
    {
      "rating": "0",
      "text": "You are without a doubt, the worst movie I have ever seen. TERRIBAD doesn't begin to describe this steaming pile of crap. It is epic all right, too bad it is epic bad. It may have deserved a 1 instead of a 0 due to the historical scenes, and I will probably use them as documentary-type footage in my 6th grade social studies class. However, the movie itself was so ungodly terrible, its worth a negative score."
    },
    {
      "rating": "0",
      "text": "So so so so bad. I nearly slept for two hours. Incredibly boring. Hopefully I didn't pay to see it. A good advice : DO NEVER WATCH THIS MOVIE (except if you want to lose 2hours of your life)"
    },
    {
      "rating": "9",
      "text": "Great plot, acting, photography."
    },
    {
      "rating": "10",
      "text": "Wow i cant believe the bad user reviews. awsome supporting roles by natalie portman and jack white, jude law was good too but the writing is kind of bad."
    },
    {
      "rating": "10",
      "text": "Pretty interesting adaptation of the Charles Frazier book; Minghella changed some events and still maintained the quiet sadness of the book. After reading it, the movie looks even better, as does the acting of the main trio. Jude Law gives perhaps his finest performance, Nicole Kidman gives every word she says a note of slight disappointment mixed with hope, and Renée Zellweger is as fine as she's been in the past. One of the best war movies of the past few years."
    },
    {
      "rating": "6",
      "text": "Great cinematography, brilliant performances from the supporting actors but I have seen far better performances by Nicole Kidman and Jude Law. Not to mention that the chemistry between them isn't that good. In fact it fully justifies the title of the movie!"
    },
    {
      "rating": "9",
      "text": "Great film, beautiful adaption of the wonderful book."
    },
    {
      "rating": "6",
      "text": "Decent epic war romance with some good acting and visuals though plot problems."
    },
    {
      "rating": "8",
      "text": "The American Civil War is one of those historic moments that gave rise to a lot of movies, as it was one of the great defining moments of America's historical course. This film was directed by Anthony Minghella, who left us films as good as “The English Patient” and “Talented Mr. Ripley”, with which this film makes a trio, a “best-off” of the director. The film, by the way, was one of the great cinematographic releases of 2003 and a serious competitor at the 2004 Oscars, with seven nominations of which it managed to reach only one.Despite being a film set in the civil war, it has few war scenes, preferring to give the audience yet another wartime romance, in “Pearl Harbor” style: he goes to fight, and she suffers in the rear, yearning for the return of her beloved. The film is happy in the way it gives an overview of the political position of North Carolina, which joined late to the Confederacy and, despite the youthful enthusiasm of some and the personal interests of others, the southern cause was not so unanimous. Much less well drawn is the romance that forms the core of the script: after all, love at first sight is something difficult to take seriously, and it is the protagonists themselves who assume that they didn't turn around and spoke long before the mobilization, despite the passion that unites them. This gives their romance a touch of incredibility.Despite this weakness, we have two great actors committed to the maximum effort in this story: I have to particularly highlight the effort of Nicole Kidman, who gives us one of the most powerful works of her career (better than in “Moulin Rouge” and without the distance and the coolness her character demanded in “The Hours”). Insecure but courageous, hopeful in a love that had everything to go wrong, her character demanded a lot from the actress, and she was able to rise to the challenge. In the background, Jude Law is just as happy here, giving life to a farmworker who is recruited to fight in a cause he feels belongs to others and not his, until he is wounded and takes the opportunity to desert and return home. However, the character doesn't have as much subtlety and depth as it could. Much richer and more interesting is the figure played by Renée Zellweger who, like Kidman, had just been successful as the protagonist of a musical (“Chicago”, while Kidman had made “Moulin Rouge”). Her character in this film is a hardworking, empowered, self-assured woman who doesn't expect anything to be done for her... in a way, it reminded me a lot of Sofia, the character played by Oprah Winfrey in \"Color Purple\", many years ago. The award for her work was the Oscar for Best Supporting Actress, after two years in which she was nominated and saw it slip away. The cast is completed by honorable and talented additions, including Philip Seymour Hoffman, Brendan Gleeson, Donald Sutherland and Ray Winstone. On the negative side, I want to highlight the participation of Natalie Portman and Giovanni Ribisi… not because of the actors' demerits, but mainly because of the way in which the film didn't know how to use them as much as it could, because of the little relevance of their characters to the plot.Technically, the film has a lot of qualities, starting with its impeccable cinematography, in which the skillful use of the camera allows us to have a lot of clarity, light and a beautiful color palette, giving intimacy to the most romantic or introspective scenes while still giving grandeur to the war scenes and dynamism to the action scenes. The addition of excellent visual and sound effects, often using CGI and other digital tools, was a bonus to the entire cinematic show. The sets and costumes are perfectly suited to the time and period portrayed, with no glaring anachronisms that would make a historian pull out his hair. The film is relatively long, two and a half hours long, but it was well edited, and I only felt it drag on in some very concrete scenes. The dialogues were well done, but it's the monologues that give it more drama thanks to the characters' letters, which are a little too melodramatic. The soundtrack does a satisfying job, but it also doesn't have any themes that particularly stand out."
    },
    {
      "rating": "7",
      "text": "Es buena, me gusto que tiene buena historia, aparecen buenos personajes, y ayudan a engrandecer a los personajes principales. El problema que es muy larga."
    },
    {
      "rating": "8",
      "text": "This is a historical period drama with obviously war and adventure elements to it. It covers themes including civil war and the walking wounded, friendships, the countryside or rural life in general and loneliness, among others.I quite enjoyed this film, as it features some relatively feisty, well thought out characters. There is a good use of background music, a quite unsettling, mildly sinister or creepy slow classical type of music which is quite quiet and not at all over powering or over bearing, not making the dialogue hard to follow, thankfully. The film did seem quite atmospheric due to the good use of music and it doesn't shy away from depicting some relatively gruesome aspects of war at times as well. I found myself feeling gripped to the TV set, to see what became of certain soldiers, how people managed to pull themselves out of very difficult, harrowing situations. Of course its easy to see why this could be regarded as a very grim film but yet it didn't feel entirely grim as such. There is an element of optimism about it - a sense of hope present, although its hard to explain this fully in such a review. Suffce to say, there are different scenes with different tones and some are a lot lighter than others. I suppose you could say there's an irony showcased in terms of the beauty of the surrounding mountainous/rural nature surrounding somewhat gory, violent acts.I thought the film was well cast, with Nicole Kidman portraying Ada Monroe, a well to do lady, looking for people to help tend her land. While she appears a little distant, she seems very much like a good person at heart. Meanwhile, Jude Law plays Inman, a regular joe type who finds himself somewhat lost in the middle of the war and Renee Zellweger plays Ruby Thewes, a distinctly assertive, quick witted independent type. Ruby is probably the most memorable character - certainly either her or Ada. Also present in the cast are the late Philip Seymore Hoffman as Reverand Veasey, Giovanni Ribisi as Junior and Donald Sutherland as Reverend Monroe.I liked some of the landscape shots used, to give us a decent overview of the 'lie of the land' you could say. It doesn't really feature especially breathtaking cinematography as such, I suppose, if your very critical of such things but I did like the setting and there were some good camera angles used, in some scenes, to highlight the landscape, such as showing the streams flowing downhill, with characters hiding or moving slowly from one part of land to another.Content wise, the film features sex scenes with nudity and implied rape, violence, with bloody injuries and war related aggression depicted, some strong  language and in general, the film is relatively frightening due to the war theme running throughout. Due to this, it has been given a 15 rating.As far as criticisms are concerned, there's relatively little to say. It is quite a long watch, at around the two and a half hour mark and as such it would have put me off watching it until recently but I have seen a fair number of long films over the last 6-12 months and as there's less decent TV shows on, I find myself finding time to watch more longer films. If your not especially keen on character driven dramas and hope for pure action to keep you gripped to your seat throughout then this may not be ideal for you, as while there are scenes of war, the majority of the film features a small number of characters reflecting on things, being somewhat philosophical at times and thus it isn't jam packed with special effects, chases and attacks. Both of these things may be seen as a good thing or a bad thing, depending on what you like, of course. Perhaps it could have featured some slightly better cinematography? maybe but I don't feel I can really mark it badly due to any of that as such. It felt like quite a warm film in a sense, which I can only presume comes down to the good characterisation.Yes I'd recommend this film, as I felt it was well cast, it is quite atmospheric and covers good themes. It is bloody and may be a little frightening or upsetting to watch at times but if you don't mind a bit of violence, then its worth checking out, especially if your a fan of the cast (Nicole Kidman, Jude Law and Renee Zellweger)."
    },
    {
      "rating": "8",
      "text": "The film shows you how war can cause the consequences of people, and then everything ends badly for the protagonists and when you see the serious film how the unjust win and the innocent suffer. But in the end everything is going to happen if they put their great efforts so that things go well and thus good people are those who help others and that is why this film gave me something good. This movie is totally a masterpiece!!! The truth is that the film catches you and shows you how the bad guy triumphs and the innocent (good people) die, but at the end of the film it shows you how people change for the good of others, because it is a change of heart to help to the neighbor and everything can change for the community. There are only two kinds of people in the world, good and evil. But in the end, with the help of others, everything will work out for everyone."
    }
  ],
  "recommendations": [
    "the_deer_hunter",
    "hacksaw_ridge",
    "dances_with_wolves",
    "sicario",
    "the_light_between_oceans",
    "the_last_duel",
    "kingdom_of_heaven",
    "hostiles",
    "darkest_hour",
    "the_last_king_of_scotland",
    "legends_of_the_fall",
    "wind_river",
    "21_grams",
    "allied",
    "the_beguiled",
    "first_man",
    "the_rover",
    "1917",
    "the_thin_red_line",
    "only_the_brave",
    "the_last_of_the_mohicans",
    "the_eagle",
    "the_favourite",
    "the_last_samurai",
    "master_and_commander_the_far_side_of_the_world"
  ]
}