{
  "id": 1583,
  "title": "Cold Pursuit",
  "starring": [
    "Liam Neeson",
    "Tom Bateman"
  ],
  "runtime": 119,
  "genre": [
    "Action",
    "Crime",
    "Thriller"
  ],
  "description": "The quiet family life of Nels Coxman, a snowplow driver, is upended after his son's murder. Nels begins a vengeful hunt for Viking, the drug lord he holds responsible for the killing, eliminating Viking's associates one by one. As Nels draws closer to Viking, his actions bring even more unexpected and violent consequences, as he proves that revenge is all in the execution.",
  "releaseYear": "2019",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/hXgmWPd1SuujRZ4QnKLzrj79PAw.jpg",
  "categories": {
    "plot": 4.780487804878049,
    "acting": 5.235294117647059,
    "ending": 6.9,
    "soundtrack": 10.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 7.068965517241379,
    "action": 5.72972972972973
  },
  "reviews": [
    {
      "rating": "6",
      "text": "I had a feeling from the trailer that this would be a little different from your standard Liam Neeson action movie but I was shocked to find how fun and creative this whole thing is. The narrative and tone really set this movie apart from other crime films. By focusing on such a large cast of characters and putting Neeson’s in the background for the latter half, I found the plot to be largely unpredictable because I had no idea who would be in the next scene. The dialogue is quick and witty. The violence is bloody and brutal. The whole thing reminded me of a season of the Fargo TV show or something from Martin McDonagh. The unique tone and odd style really sold this movie for me, making for an entertaining ride.\u2028 Grade: B"
    },
    {
      "rating": "6",
      "text": "A reasonably clever Neeson shoot-em up with some good humour, acting and visuals."
    },
    {
      "rating": "1",
      "text": "Cold Pursuit is a movie that assumes that revenge thirsty Liam Neeson is boxed so hard in the movies he makes that the plot, tension building, character development can be totally omitted and replaced with straight to the point tacky action sequences, all because everybody knows what they will get in a Liam Neeson movie, right? The story was shallow and uninspiring. I was forcing myself not to fall asleep. It was more difficult than Liam Neeson's struggles. I wanted to be entertained, I was not expecting a masterpiece and all politics aside I gave this movie a fair chance to impress me. I can easily say that it was one of the worst movies I have seen in a long time. Nothing worked for me here, nothing !!! , well maybe few shots of Denver and snowy landscape was inspiring but even this was over used. It was like director managed to frame some breathtaking scenery and  was so much in awe of his  movie's maker genius that he wanted to re-use it over and over again. It was like shouting to the world. Hey, look at me. I know how to make movies but the truth to be told you dont, you just dont.The character development is non existent. We got only 1 minute scene of Liam and his frosty family and this was absolutely not enough to get invested in the movie. I was more fascinated by the deputy's mini sub plot than the main event. All supporting actors had more interesting stories to tell than a main character. Even the Thailand chick was more captivating that our hollywood veteran.Why we are shown these collection of scenes not bringing anything into the movie. Why I am suppose to believe that ordinary Joe turns into killing machine? He clearly has a past but movie never tells you what this past was. The villain was awful, over the top. The Indian gangster family was the same. The final moment of the movie nicely summarizes what you just watched. It was abysmal, awful. Please do not make a movie like this ever again. Complete failure."
    },
    {
      "rating": "7",
      "text": "A crazy revenge film, I wasn't expecting much when I bought it at a 2nd hand shop but I enjoyed it once I got a chance to sit and watch it. Neeson is fantastic as always and Tom Bateman is an entertaining and enjoyable villian. The tone is more played for laughs than revenge and most of the deaths in this film are pretty funny, especially the final death. On the negative side, I Laura Dern isn't in the film much and Emmy Rossum feels underutilized in what could have been a more pivitol role."
    },
    {
      "rating": "3",
      "text": "Better watch the original as simple as that Thank GOD my eyes catches someone's comment in somewhere about this movie and its better to see theoriginal one so I did and glad that I didn't see this one first this remake is a crapand no reason to do an exact copy paste of the original one some director in both movies but the acting in the original way better also there was some details this one haven't mentioned don't know why if you see this first you'll see there is something missing go watch the original one to complete the puzzle ! This is just a waste I thing it like more of marketing and making some more money"
    },
    {
      "rating": "5",
      "text": "Liam is getting sucked into doing the same role over & over. Some of his movies are better than others but this one falls into the others category. Best you watch this on DVD or Netflix."
    },
    {
      "rating": "5",
      "text": "Bland, half-baked, full of plot holes, predictable, and at times utterly boring, Cold Pursuit is just a middle-of-the-road action movie that Liam Neeson seems to star in once a year. The performances are okay, the action is fine, but the story is a real mess. If you're going to make a noir film, don't make it rely on sparse action scenes. However, there are some decent sound and cinematography choices that made me stick this one out until the end."
    },
    {
      "rating": "4",
      "text": "Silent Sirens.Cold PursuitMoland's second take on a quirky revenge based tale is a clear \"style over substance\" case. This remake fails on both causes, it uproots the essence of the humor that made \"In Order Of Disappearance\" smooth and flamboyant, and makes it pretentiously commercial. And on the other hand, it comes off short on performance. But there is something in Neeson's eyes that makes you root for the guy. He has always cast that persona on screen over the ages. The brooding voice, slick body language and his panache on the command over the other characters, he gambles the game effortlessly. This is the kind of role that he fits in perfectly for.His on screen fear over the ages, helps us nod easily on setting up the ruthless background of his. Although, this image of his isn't on run until it's last act scrolls upon. The initial stages where he is investigating- or one might call it killing people like a Domino where each of them will lead him close to end the game- that rage of merciless encounter is poured over on pawns. Also, Moland's way of announcing a death is slick fun. It grows on you and balances the tone on chalky humor, along with being informative.Dern as Neeson's wife is barely there to invest on anything. She is almost playing a cameo and still she is better than half of the other cast. Another major crisis in here is the antagonist. There is never a real threat experienced by the viewers whenever the antagonists are on screen. Mocking their own profession and investigating poorly by lopping off their own team members, this stereotypical clan is barely capable to make Neeson writhe on screen. Bateman's irritation over Neeson's ruling might communicate but that too is when his wife steps in and a new chain of cycle is introduced on screen that somewhat helps it grows into more hefty.Another plus point on their side, is the invasion of another gang which is clearly more life threatening than our real \"bad guys\". Their poised and reserved nature leaves the other characters shaking on their seat as they move slowly but steadily near to their revenge. This is where Moland's script delivers completely, its awareness on the catastrophe that each action spirals out, is what helps him puppeteer multiple characters on screen. Like Rossum's cop character that has its own interesting tale to tell.The action isn't necessarily gore and the locations beautifully shot that does fool you to expect maturity on the narration. On terms of originality, there is a long way to go, this B grade action drama is unfortunately short on both action and drama. This remake of Moland's own Norwegian film is a big chunk of disappointment, incapable to regain the magic, the star power is your only stable source to work upon and rely upon. Cold Pursuit is definitely a cold pursuit, with none whatsoever threat of emergency, it is on run without looking back."
    },
    {
      "rating": "6",
      "text": "Es mucho mejor la original, funciona muy bien en noruega, no es creible que el narco sea tan idiota"
    },
    {
      "rating": "4",
      "text": "I'm a Liam Neeson fan, but this was a bad movie. The script & story line were terrible. Jumping around to many different segments that were poorly linked. An unbelievable story with too many disjointed characters. Humor? I failed to see any humor. I walked out being sorry for wasting 2 hrs on this one."
    },
    {
      "rating": "10",
      "text": "Liam Neeson played cool in this movie ! The soundtrack in this movie is amazing. Action , black humor , cruelty . By the way I forgot Liam Neeson ! Advise"
    },
    {
      "rating": "7",
      "text": "It's not an action film but rather a good crime thriller.It's a slow film so don't expect many action scenes but it's still good."
    },
    {
      "rating": "1",
      "text": "Very disappointed. Just another new movie that lacks any real merit. I believe it was an attempt to put a new spin on old story lines."
    },
    {
      "rating": "8",
      "text": "Thought this movie was great. I went in expecting the type of movie nic cage / jon travolta / antonio banderas are putting out these days; just revenge schlock for streaming services, and I was pretty bummed for neeson. But, I was pleasantly surprised by this movie. Fast moving, with great characters that were flushed out very quickly. It seemed like they were able to give each character just enough screen time to make him or her likable. And a nice satisfying, if not overly original, ending. Bottom line, great fun that didn't have to sacrifice its cleverness to be a success. 8/10"
    },
    {
      "rating": "10",
      "text": "Definitely a funny movie ! Not only action but also black humour , good acting (especially Liam Neeson) . The humor here is cool, and the shootings are cool ! Who hasn't watched it."
    },
    {
      "rating": "7",
      "text": "A fairly entertaining revenge thriller which requires very little brain power. Liam Neeson does what he does in this kind of role and does it well enough. The Canadian locations are just fabulous and Tom Bateman makes for a very charismatic baddie. I must say I went in expecting not to enjoy it, but it does sort of engage you even if at times the editing feels a bit slack and the pace a tad off. The violence is often offset by some delicious black humour. On the negative side Laura Dern is just wasted."
    },
    {
      "rating": "8",
      "text": "Liam Neeson has stated his intent to retire from making action films recently due to his age (he is in his mid-60s after all), so this very well may be the last we see of him doing what he's become so well known for ever since the first 'Taken' film a decade ago. And if that's really the case, then I gotta say that he goes out with a pretty ridiculous yet fun bang with this film! He's at his usual best, and there was surprisingly an abundance of dark humor throughout as the film continues to poke fun at the increasing body count in one of the most unique and off-color ways I've seen. It felt very much in the vein of a Coen Brothers or Fargo-style film. Overall, I'd say it's actually one of Neeson's better action films in a while, so considering he's been at this for a while and it may be his last, it felt surprisingly funny and fresh, which was enough to help elevate it from feeling like the usual fare he's been offering us with some of his other action films."
    },
    {
      "rating": "3",
      "text": "Cold Pursuit is by far the most disappointing film I have ever seen. Scenes of pointless brutality leave the audience stunned, some apparently guessing it might be a black sense of humour and start laughing. Everything in this film is exaggerated, feels unreal. A town with a handful of citizens is the background for a man hunt from one cranky drug boss to the next, and there are lots of them. Very credible. The film starts to get boring when the weaving pattern becomes clear, and that is at minute 37."
    },
    {
      "rating": "7",
      "text": "A remake of the 2014 Norwegian film In Order of Disappearance, Hans Petter Moland has returned to direct Cold Pursuit. Snow plough driver and citizen of the year Nels Coxman (Liam Neeson) is your average family man, living the simple life with his wife (Laura Dern) in Kehoe. So when his son is brutally murdered by drug dealers no one really expects quiet Nels to do anything about it. But as we all know this is Liam Neeson and you don't need me to tell you what happens to anyone who messes with his family. Alright I know this all sounds familiar (yes I'm looking at you Taken and pretty much every other Liam Neeson film in the last ten years). It's been done before but are we bored with it? No, of course not. A revenge thriller will always bring in a crowd and under normal circumstances Liam Neeson will also bring in his fanbase. The internet may be done with Liam Neeson but if you enjoy action films at all then Cold Pursuit is not to be missed. Quirky and reminiscent of The Coen Brothers the most obvious being Fargo. It finds the perfect balance between action and dark humour. It's funny and it's violent, it also benefits hugely from having the original director take control of this remake. One by one Neeson starts taking out the people responsible for his son's death eventually directing him to a drug lord known as \"Viking\" (Tom Bateman). Bateman plays Viking with the chaotic energy of a crazed gangster, whose next move is extremely unpredictable creating a constant sense of unease whenever he is onscreen. As each and every supporting character is introduced they get more ludicrous, a lot of these generic revenge stories often have boring and forgettable supporting characters with all the effort put into the main character but Cold Pursuit breaks this trend and is clearly better for it. Unlike the majority of Neeson's previous action films Cold Pursuit shifts a lot of the focus towards the other characters in the movie, sure Liam is the main plot point but the supporting cast push this film away from just being another generic revenge thriller. So what are you waiting for, you need a film to check out this weekend right? Award season is just about finished so there's no better film to see than Cold Pursuit. Highly recommended."
    },
    {
      "rating": "6",
      "text": "Liam Neeson knows very well to what he plays but he already had a few years getting repetitive and stucked.The Commuter was a very clear example. And although this film doesn't come to rediscover something new in the genre, honestly I find it more pleasant.Maybe his most entertaining in the action field since A Walk Among the Tombstones.Obviously I'm not taking into account Widows, The Ballad of Buster Scruggs and Silence.And about his recent controversy, what can I say? Devastatingly disproportionate"
    },
    {
      "rating": "3",
      "text": "3/10 is most likely to be too much for this crap. Waste of time, of money, of Leam Neeson's acting and prestige. Movies like Star is Born, Bohemian Rhapsody and Green Book should be available for viewing in the cinema and at this moment the visitor must choose the least inept film."
    },
    {
      "rating": "6",
      "text": "Cold Pursuit has a style all its own which really makes it stand out from the crowd whether that's for good or for bad remains to be seen. The death cards after every death are visually interesting and fresh, but me halt the momentum of the film that already struggles to build tension. Its character are interesting if not a bit stereotypical in the ways they act in the face of some situations. If you're itching to go out and see a movie that's different and takes some chances see cold pursuit. If your looking for a masterpiece id suggest looking elsewhere."
    },
    {
      "rating": "0",
      "text": "In no way, shape, or form is Cold Pursuit, \"Taken on ice.\" A better way to describe the film is boredom on ice, or better yet, gutter trash on ice. This movie doesn't have a single redeeming moment in it. It's also not an action flick by the way; it's an overlong drama where the writers are more concerned about having side characters go off on some nonsense monologue rather than entertaining the audience with the thrills you'd expect from a Liam Neeson adventure. Okay, yes, I do have to give it some credit, there is a grand total of two minutes where Neeson punches some people in the face without them fighting back.  The worst part about the film is that it all feels so unnatural... Some awful side plots between the police and a rival gang are thrown in and don't add up to much of anything. This is a zero out of ten, because in no way is any of it enthralling."
    },
    {
      "rating": "8",
      "text": "More \"Walk Among the Tombstones\" than \"Taken\". Liam Neeson isn't in it as much as I would like, but it is an overall enjoyable film."
    },
    {
      "rating": "8",
      "text": "Cold Pursuit is unlike most of what Liam Neeson has done before. It is a black comedy, more akin to Three Billboards and Fargo than, for example, the Taken franchise movies. One ruthless, uncaring mistake by a gang tears an average working man's family apart and starts an avalanche of killings in the snows around Denver, Colorado, in the height of winter.  On the way, it has a bit to say about bad choices, karma, racism and even free trade. Very funny, very black, and very violent, it features some very interesting performances, too."
    },
    {
      "rating": "7",
      "text": "If you like Liam Neeson's current crop of movies than you will like this one. It has interesting twists and turns that keeps one wondering how everything will connect. It feels a bit transplanted, it wants to be a Cohen Brothers movie but lacks the emotional thread that makes their movies work. There are some serious casting problems. At times it felt like many of there were \"acting\".  It is entertaining. I read the reviews and was a bit hesitant to go but then noticed how the reviews took a nosedive after his interview problems. Definitely a bias there, just check the date of when the professionals submitted their reviews and you see what I mean."
    },
    {
      "rating": "4",
      "text": "May be the best way to describe the movie is... imagine if you order a Tarantino movie from aliexpress. The Director failed in its attempt to be original. With some very few funny scenes - i found the plot to be dull and boring."
    },
    {
      "rating": "7",
      "text": "So, my buddy and I went expecting something along the lines of 'Taken on Ice'. How wrong we were. We both have the tendency to laugh at what others may deem inappropriate times, so the first couple of times we chuckled, we assumed that was the case. However, it started to dawn on us that the laughs were intentional and we had stumbled into a dark comedy - a genre I truly enjoy. I'm not going to tell you it was a great movie, but I was pleasantly surprised and entertained."
    },
    {
      "rating": "6",
      "text": "Although you might expect this to be an extension of the Liam Neeson's TAKEN franchise, he's actually cast as a more demure character…at least in the beginning. He drives a snow plow in a frigid Colorado town, but when his son is killed, he sets out for revenge. Most of the action is unexceptional and the plot is full of holes. The only surprising thing is the sprinkling of dark humor that punctuates each death. Not really that amusing, but it does add a different tone to an otherwise mediocre action flick."
    },
    {
      "rating": "7",
      "text": "Nels Coxman (Liam Neeson) is a simple man who spends his days clearing the roads in a remote Colorado Ski Town and spends his days with his wife and his son. Nels is so unassuming that when he is awarded Citizen of the Year he states that there are others far more worthy and fusses over getting dressed up to accept the award and make a speech.When his son is found dead of a Heroin overdose; Nels is not willing to accept that his son was a user even though this puts tremendous strain on his marriage and has taken Nels to consider suicide. At his worst moment he learns that his son’ co-worker was involved with some shady dealing and that his son was likely collateral damage from the criminal elements involved.With a new found sense of purpose: Nels embarks on a quest to find the truth and avenge his son’s death no matter the consequences.One would think that “Cold Pursuit” is a standard revenge film but it unexpectedly changes direction shortly after Nels starts exacting his revenge. The film transforms into a Dark Comedy of sorts as characters get a Title Screen when they are killed many of which have a morbid humor to them. The film even takes the bold step of moving away from Neeson for a good third of the film and putting the emphasis on other characters from rival crime organizations to the Sherriff and his eager Detective (Emmy Rossum).As such the film is not what you expect as although there is plenty of action at times; it is a Dark Comedy with dramatic elements. It is more in line of what you might expect at a Film Festival from an Indie studio versus a major studio release.As such fans of Neeson may be disappointed in seeing a departure from the type of films they have come to expect from him in recent years while others may embrace the quirky nature of the film.3 stars out of 5"
    },
    {
      "rating": "6",
      "text": "Not a typical recent Liam Neeson movie, if there is such a thing. Dark comedy in order of dissappearance more like a Tarantino-movie and really nothing like Taken, though the avalanche of death does start with the loss of a son. Nothing to be taken too seriously."
    },
    {
      "rating": "4",
      "text": "Not at all what the trailers set it up to be, the film is a tonal mess with no real pacing, and plays out like a wannabe Coen Brothers homage gone wrong."
    },
    {
      "rating": "7",
      "text": "At first glance, \"Cold Pursuit\" appears to be the kind of typical, white bread vengeance thriller film you'd expect from the genre. \"Liam Neeson seeks vengeance on the people that killed one of his loved ones,\" after all, isn't necessarily a very original premise for a film. But for Hans Petter Moland, writer-director of the Norwegian film this is based on, this is no ordinary actioner. Indeed, its the refreshingly cheeky, weird, and wry tone in play throughout this film that makes it different from every other film of the same ilk. Toss in some genuinely interesting plotting work and a handful of engaging action scenes, and you get a worthwhile cinematic experience."
    },
    {
      "rating": "7",
      "text": "Liam Neeson soldiers through Cold Pursuit in stoic fashion. What saves the film is that all the other characters are more interesting and fun to watch than he is – the police, the “bad guys” (and there were plenty of them), along with “the good guys” (the Indians, old friends of Neeson/Coxsman, and even the hotel staff). The humor (especially when various deaths were “commemorated” on screen) helped too. But the film was dead emotionally, and it was only Neeson’s and most of the rest of the actors’ likability that held things together. If you can, see the original (In Order of Disappearance with Stellan Skarsgård), and you will probably wonder why the director felt he had to make this movie again."
    },
    {
      "rating": "8",
      "text": "In Cold Pursuit, based on the Norwegian film Krafitidioten or, as it is known in the US, In Order of Disappearance starring Stellan Skarsgard, Liam Neeson is a hard-working, respectable member of the community and runs his own snow plow business. His life is turned upside down when his son is murdered, resulting in him going on a quest of vengeance. This seems like a traditional Neeson revenge/action flick. It definitely starts like one. However, what develops is a pretty entertaining dark comedy. Cold Pursuit is this decade's Fargo.A big issue with revenge/crime films is that they often feel by-the numbers. This one keeps things lively. There are many surprisingly clever little actions or bits of dialogue. The movie features a wide cast of unique and interesting characters. In the middle, Neeson is missing for large periods of time, but you'll like the others enough that it doesn't matter. The cast is great all across the board. There are just too many great performances to all individually focus on. Though particular notice should be given to Murder on the Orient Express' Tom Bateman, who always steals the scene as as an odbball control freak/vegan mob boss, and Tom Jackson as a contrasting mob boss in a more controlled, but emotional performance.Film looks great. The movie mostly takes place in a snowy Colorado resort town and the parts out in nature are just breathtaking. There is a particular repeated visual throughout this movie that is really clever and ties the whole thing together. The movie also has great filming locations; some really eye-catching buildings here.Biggest weak point is that running at almost 2 hrs. the movie is longer than it needed to be. Some of the moments feel a little too movie-ish and unnatural. Good thing is that Neeson does the same angry but measured tough guy routine that he does so well. Bad thing is that it's the exact same routine he has does several times.As I said, this is like Fargo. If you don't want things getting too dark, this isn't for you. But if you want something Cohen Brothers/Tarantinoesque than you'll probably like this."
    },
    {
      "rating": "6",
      "text": "Cold Pursuit is such a weird film. The story is kind of messy but at the same time intriguing, and the premise comes off as a TV film that somehow snuck into cinemas except that...it's actually fairly well done? It's so confusing because for every thing this film does well there's also something going against it. The unevenness of it all, though, is what drove me to give it the rating I did."
    },
    {
      "rating": "7",
      "text": "For anyone expecting an action movie like taken because Liam Neeson is in this movie, you'll be surprised. This is a silly movie about silly people doing silly stuff for silly reasons in a silly town. And it's pretty darn entertaining."
    },
    {
      "rating": "7",
      "text": "It’s that time of year again. A Liam Neeson lead action thriller. But, this is not what I was expecting. The trailer made this look like another run of the mill, Neeson lead film. Not that there is anything wrong with that cause I am a big fan of his films. The structure of this film and how it plays out is actually something completely different then his other revenge like films. The film opens with Neeson’s character, Neil Coxman, a snowplow driver working the streets in the cold but actually quite beautiful Kehoe in the Rocky Mountains. Laura Dern plays his wife, whose role here is very short lived and disappears about a half hour to forty five minutes into the film, never to be seen again. Neil wins the award for “Citizen of the Year”, but shortly after, his son is kidnapped after working a shift at the airport and is later found dead in the middle of downtown Denver. Once Neil and his wife are told their son has died of a drug overdose, Neil is already suspicious. He is sure that his son was not a druggie. His wife does not take things well and eventually leaves him. This is where the film picks up steam as Neeson receives information about what happened to his son and begins hunting down each person. This leads to some great, actual comedic like sequences of him toying with these men before he ultimately kills them. I thought this was a great touch and was really surprised by the darker humor throughout this film. Even the film ends on a dark humor moment that fits perfectly. The structure of this film is also quite well done. For about a half hour, we get Neeson hunting and killing lots of men to try and get info leading to the big man in charge, but what’s nice here is we get plenty of scenes with the film’s villain, played by Tom Bateman. It allows you to get to know the dirt bag behind it all and see just how bad of a person he really is. One of the biggest jokes or shall I say, running moments through the film is after each person’s death, we are treated to a title card of their name with some music. Quite the nice touch. The action sequences are well done and the dark humor is quite good. I was really glad this film was different then Neeson’s previous work. I thought we were getting another “Taken” or “Run all Night”, but this is far from it. It is a enjoyable film that has just the right amount of action and humor. Liam Neeson hits another home-runGrade: B"
    },
    {
      "rating": "6",
      "text": "Like most remakes, this is the poorer cousin to the original. Predictable revenge tale that Neeson seems to of made his own of late."
    },
    {
      "rating": "7",
      "text": "One of the craziest, funniest revenge flicks I've ever seen.  Definitely check your \"plot hole\" radar at the door. There are so many through lines in this sucker, it's sometimes too much, but there are so many likable element to it, you can forgive minor inconsistencies."
    },
    {
      "rating": "10",
      "text": "The movie I loved it ! When I watched the film in a whole can say that Liam Neeson well played in this movie . I can't even understand why the Viking who's playing Tom Bateman is showing off , why and why he's the boss . In the end I want to say that the movie is fantastic !"
    },
    {
      "rating": "8",
      "text": "“Cold Pursuit” works at a lot of levels – on the ground, on mountain passes, in the air (the hang glider, really?!).  It’s also a dark, sophisticated send-up of the revenge genre.  With a title presumably inspired by the trope that “revenge is a dish best served cold,” this film starts out as an exercise in paint-by-numbers, but then veers off the guardrails into something much more interesting.As Nels Coxman, Liam Neeson appears arthritically convincing as a 66-year-old action figure (“Taken,” “Taken 2,” if only there had been “the road not taken”).  Coxman is a simple man.  His Open Road snowplow business makes travel between Kehoe, Colorado and the outside world generally passable.  He’s even named “Man of the Year” for his efforts.  When his son is murdered by minions from a Denver drug gang, Coxman goes totally off the rails, murdering three drug runners complicit in the act and picking a fight with the drug lord himself.  There’s no establishment of how Coxman has developed his sudden prowess in fights or with firearms. (I relied on the new Captain Marvel trailer for inspiration.)  Neeson makes up for these oversights by brooding persuasively.Eventually, though, this film evolves from a formulaic revenge story to a dark comedy.  The first clue is that after the first death, a card pops up, joltingly, with the name of the deceased, his nickname and a cross above the writing.  The process is repeated with each new killing.  After a particularly brutal showdown, there are more than a dozen names on the screen.  The genre-bending doesn’t end there.  In a resort hotel, a menacing gangster growls about what he might do to the hotel employee who has displeased him – with his brutal comments on Yelp.  When Coxman’s young abductee requests a bedtime story, Coxman obligingly lies quietly beside his captive, reading the child the sales brochure for a new snowplow he recently purchased.  At the end of the film, the cast is listed “in order of disappearance.”This last bit is a deep bow to the original source material:  the Norwegian film “In Order of Disappearance” (2014) starring Stellan Skarsgard.  Much of the film has a Scandinavian sensibility, particularly since Norwegian director Hens Petter Moland has directed this film as well as the original.“Cold Pursuit” is refreshing, sometimes exhilarating and a totally unexpected departure from the revenge genre.  If “Taken” and “Fargo” had a lovechild, and the Coen brothers acted as midwives, this might be that movie.  But be forewarned:  there’s a lot more blood in “Cold Pursuit” than that wood chipper ever generated."
    },
    {
      "rating": "7",
      "text": "Good music, good humour, acting solid, story a bit strange but still works till the end. Watch this one at home!"
    },
    {
      "rating": "6",
      "text": "I have been a fan of Liam Neeson since the 1980s and have been watching his turning into an action star at the age of 58 with \"Taken\" and I wish he would take a detour now and then back to 'the good old days' like \"Schindler's List\", \"Rob Roy\" or \"Love Actually\". With \"Cold Pursuit\" we already know the formula of his losing a family member, in this case, his son, and then the bloodbath starts.It isn't long before Nels Coxman (Neeson) is killing one guy after another, then choking one before shooting, wrapping another and dumping him down a mountains falls and I stopped counting after the body total reached 15 and that wasn't even half of it. In a sense score is kept for you as each death in listed on the screen. Along with the high body count there is blood all over the place from bride's gowns to snow to a murderer asking a victim to move off a rug to not bloody it. Many attempts at humor fail but a few really get across and the scenes filmed in Alberta standing in for Denver, and a fictionalized ski town called Kehoe, never fail to be anything but beautiful. Nels is a snow pile driver and aside from many shots of him clearing snow for traffic there is also 2 shots of ways to use the snow pile machinery to kill people that aren't half as bad as other killings in the movie. The whole basis of the story is 'a son for a son' when one son is killed and another is threatened before a third son is killed. The father of one son is really a sick, controlling guy who can't quite get the better of his ex-wife even though he is the head kingpin of drug distribution.Talking about a wife though it seems Laura Dern will play a major part of the movie but is in it too briefly. Actually women have a better showing for a movie like this with Dern, Julia Jones as the aforementioned ex and Emmy Rossum as a serious get them police officer. I love her in \"Shameless\", the series on Showtime, and was glad to see her. There are many roles, including all those killed, giving the actors time to impress without all that time on the screen.\"Cold Pursuit\" is an okay genre movie that most people will like but if you don't see it you won't miss it."
    },
    {
      "rating": "7",
      "text": "i have not seen this version yet. i like the original quite a bit, and have a feeling that i am going to like this one, as well. but i am predicting a lot of \"agenda\" reviews to start pouring in. so sad."
    },
    {
      "rating": "7",
      "text": "\"Cold Pursuit\" was quite the surprise. With solid action sequences, beautiful cinematography, surprisingly funny moments and decent acting performances, you won't be bored. If you're in the mood for a darkly funny and entertaining action movie, you might end up enjoying it."
    },
    {
      "rating": "4",
      "text": "Turned off within the first 10-15 minutes; so take this review with a pinch of salt.Bad acting and a bad script were the things that made me bail out on this one - the former when [supposedly] doting parents are identifying their Son's body - not a shred of the emotions one would associate with such a horrific event. Playing Devil's advocate though - this could be explained away as shock.... but you are REALLY clutching at straws with that one!Second, within the same scene, was the complete refusal by the coroner/Police office to believe that the son hadn't died from anything other than an overdose - despite protests from the aforementioned emotionless parents; that their son didn't do drugs! Surely, a medical examiner would have at least checked that statement, and looked for multiple injections sites on the body?With this calibre of acting and script writing, I wasn't prepared to put myself through the remaining 90 minutes - which is a shame, as I think Liam Neesom is a fantastic actor, albeit a bit pigeon holed for roles akin to Taken."
    },
    {
      "rating": "6",
      "text": "I hate this movie first the son dies which I was so happy because I thought this would be a revenge movie this movie is a killing spree there is I believe like 65 kills in this movie from both sides I just rewatched this movie I like it little bit more than last time not so much like I said before my problem is the killing they just kill someone for no reason So I give Cold Pursuit An D"
    },
    {
      "rating": "9",
      "text": "Good movie. You won't get it until the movie ends but once you get it you get it."
    },
    {
      "rating": "8",
      "text": "I really enjoyed it. It had nice dark humor twist to it and while to storyline was a bit silly at times, it did fit in with the dark humor style, if you look at it that way."
    }
  ]
}