{
  "id": 3757,
  "title": "Colette",
  "starring": [
    "Keira Knightley",
    "Dominic West"
  ],
  "runtime": 112,
  "genre": [
    "Drama",
    "History"
  ],
  "description": "After marrying a successful Parisian writer known commonly as Willy, Sidonie-Gabrielle Colette is transplanted from her childhood home in rural France to the intellectual and artistic splendor of Paris. Soon after, Willy convinces Colette to ghostwrite for him. She pens a semi-autobiographical novel about a witty and brazen country girl named Claudine, sparking a bestseller and a cultural sensation. After its success, Colette and Willy become the talk of Paris and their adventures inspire additional Claudine novels.",
  "releaseYear": "2018",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/z73Wer1DgObAwWnqZlOyeI33ROY.jpg",
  "categories": {
    "plot": 7.0625,
    "acting": 6.9655172413793105,
    "ending": 7.5,
    "soundtrack": 7.0,
    "cinematography": 8.5,
    "familyFriendly": 3.0,
    "funny": 8.0,
    "action": 6.166666666666667
  },
  "reviews": [
    {
      "rating": "10",
      "text": "Cinematography: 9.529/10 The film flows well and looks good. Talk about subtlety infusing the camera as a part of the story. Costume Design: 9.522/10 Costume becomes a necessary point in the film to acknowledge: it's not only useful for the story -  but works well and looks good for the overall film.Film Editing: 9.872/10 Solid. Really nice balancing throughout the film in conjunction with the story. Very intimate. Make-up and Hair-styling: 9.879/10 Solid. Sound Editing: 9.792/10 Solid. Visual Effects:9.459/10 Solid. Story: 9.792/10 Solid.Acting: 9.812/10 Solid. Personal: Colette offers history through entertainment in a very accurate, only seemingly subtle -  though very present -  sense. The film has a strong focus on gender-social relations which stands on a foreground though is so backhanded. Through all the festivity, culture - sounds of life for their, Colette and Willy's,  time - Collette glamorizes the neck which she adorns for all to gaze in awe and curiosity. Colette is a film about talent and particular social relationships through a scope - a limited sense, though a world nonetheless to and of other lives with only so much being capable of being revealed through the film. Is this a Feminist film?  Loaded term, right? I wouldn't say so - but, it calls attention to women in insufferable relationships seeking their freedoms and finding their ways about expressing them. Many interesting psychological questions arise from watching Colette: are women acting accordingly within the film to truly express themselves, or to try their hand at being like the ones in the positions which distress them unequivocally, or in spite of individuals (in this case men, though a situation rises between women concerning control and reputation which seems to ultimately support an idea of self and reputation in the film) seemingly oppressing them? There's definitely a large showing of women attempting to express themselves and admiring other women doing so. There is seemingly spiteful dialogue concerning men in a general sense which may be irking for guys none the like of the accused men especially since it's coming primarily from a women with particular wants herself.There are many boundaries to assess with a film like Colette. I don't think the film is a timely film: I simply think it is a film which further contributes to an ongoing though more public conversation of female countenance and draws the idea of being a man into question among other incredulous societal orders. Sadly, people attempt to be selfish in negative ways that don't benefit societies. Thinking of Colette really makes me think of human conditions which vary society to society, neighbor to neighbor, individual to individual though affect discourses of times. It's one thing to talk, live, and think business. It's another thing to talk, live, and think  biased, stereotyping, and prejudiced. Colette is a really good film offering a grand stage for inquiry. How much does curiosity, inexperience, and naivete play in an individual's development? What is the city versus the country to Colette(very nice subtle touch in the film - very poetic)? Overall: 9.707/10-K.D.If you're into Poetry and other bits of creativity, check out my Instagram: @Dufreshest."
    },
    {
      "rating": "8",
      "text": "Once again, Keira Knightley is out there giving a powerhouse performance in period clothes, but this time, she replaces the corset with a dapper suit. And Colette may just be her best performance yet. Knightley plays Sidonie–Gabrielle Colette, one of the most celebrated French novelists of all time. But her famous Claudine novels were never always her own. As a woman, she was forced to hide behind her novelist husband’s name and watch him get all the glory for her work. But, as the film shows, she fights back – for her work, and for her name.Colette is a badass that has slipped the minds of many, but Wash Westmoreland’s film, despite taking place in the late 19th-early 20th century, is timely, as women are still fighting her fight. Fighting for equality, a voice, and the right to be individual. Many of Knightley’s past characters have worn the accessory of asphyxiation, but right out of the gate, Colette’s refusal to conform to the traditional female dress of Belle Époque high society is just one of the indications that the audience is in for a “We can do it!” kind of narrative.  Colette follows the period in the writer’s life when she was married to writer Henry “Willy” Gauthier-Villars. We see the sexual drama of their marriage and Willy’s newfound success as a writer after he asks Colette to write a series of books based on her school days. The Claudine novels became an almost overnight success, transforming into a national brand with young women lining up for the latest in Claudine dresses, beauty products, cigarettes – you name it, they had it. While keeping inside her talent from the world, she flourishes outward in this story of identity.The film paints the portrait of a woman whose life is explored over two decades. Knightley is at the top of her game here, as she manages to create the illusion that her character ages throughout the film’s runtime. Her skin may lack the signs of age, but her demeanor does not. Through Knightley’s gestures, mannerisms, the way she carries herself, the audience feels Colette’s growth from the shy Gabrielle to her husband Willy’s fantasy of her as Claudine to finally, Colette; she transforms into an independent, self-made force and releases herself from the chains her husband has tied to her for so long. As Willy, Dominic West will no doubt make many women hate men more than they already do, but he proves just the right match to his costar.  In the midst of Parisian high art, culture, and cuisine is the discourse on gender politics, as we see Colette’s struggle to write her own name under the title of her novels. But the film also discusses sexuality, and as a queer period piece, it’s full of it. Despite Colette being married to a man, she is sexually fluid. Throughout the course of the film, we see Colette explore her sexuality through her style – going from ballgowns to neckties – and her partners. She has her first female fling with Georgie, played by Eleanor Tomlinson who sports a divine Louisiana accent. Followed by one of her lifelong partners Missy, played by Denise Gough who plays up Missy’s masculine charm well as the perfect support to Colette.There has been some discourse around the casting of Denise Gough, as many claim Missy was a trans man. However, while Hollywood does have a terrible track record when it comes to casting cis actors to play trans roles, Missy’s identification as a trans man is not discussed in the film, nor is it possible to be 100% certain that she was trans in real life. While Missy has a masculine attitude and fashion sense, she could be a he/him butch lesbian. This isn’t uncommon as, for example, Greta Garbo often wore male attire and referred to herself using male pronouns, but was not a trans man. The film does, however, contain a scene where Colette addresses Missy using male pronouns and corrects Willy when he uses feminine ones. It’s an important piece of narrative in a medium that is often lacking in identification of the kind. Despite this, the film isn’t absent of transgender talent, with actor Jake Graf in his role as playwright Gaston De Caillavet, emphasizing the point that casting trans actors, in general, is equally as important as casting them in trans roles.It’s a poignant, unabashedly feminist period piece that is playful and honest in its storytelling of a young girl’s coming of age, her exploration of her own womanhood, and her fight against the patriarchy. The fashion may have gone out of style, but the message has not. While no longer is it, “The hand that holds the pen [that] writes history,” but the voices that shout the loudest that do."
    },
    {
      "rating": "4",
      "text": "Not even Keira Knightley's fine performance and excellent period piece production values can save this cartoonish biopic, which plays more like a film adaptation of a tawdry pulp novel than a serious historic saga. This, combined with the characters' monodimensionality and virtually nonexistent back story, expose a half-baked screenplay in need of major retooling. A genuine disappointment."
    },
    {
      "rating": "7",
      "text": "despite a less than auspicious beginning, Colette finally finds a satisfying rhythm with the introduction of the first Claudine book. Keira Knightley and Dominic West have enough chemistry to keep the picture interesting and the costumes and music add another sumptuous dimension to a not unrewarding production."
    },
    {
      "rating": "7",
      "text": "A fun movie with Kyra Knightley and Dominic West. You can learn a little about the author Colette and a bit about La Belle Epoque and wallow in some clichés about writing (sometimes writers do it more for the money than for art, etc.), but basically this is a colorful and entertaining film with a lot to like – as long as you “go with it” and don’t ask a lot of questions."
    },
    {
      "rating": "8",
      "text": "The movie is good, but the performances are great, particularly Keira Knightley's performance. The movie takes you through a decade and a half of Colette's life and what an interesting life it is. From shy, quiet farm girl to a celebrity to a self-assured woman exploring her sexuality, Knightley is ferocious in making Colette come to life and you can feel it. It truly is one of the greatest performances of this year and it should earn her another academy award nomination. Then there is Dominic West, who also gives a terrific performance, making you loathe and like Willy at the same time. The movie is beautiful, the passions between husband and wife, wife and her lovers are strong, and some of it leads to comedic situations. The only drawback I found was that the movie was a bit slow, but otherwise, it was a well-done movie with clever dialogue."
    },
    {
      "rating": "7",
      "text": "Definately this is not the kind of film that attracts many audiences but I found it interesting enough to take a look and I was honestly surprised.No doubt seeing it without knowing who Sidonie-Gabrielle Colette was will be strange for not knowing anything about her life and I didn't know a damn about her with the exception that she wrote the famous novel Gigi but this film is an interesting piece in which Keira Knightley delivers one of his best performances in years and is quite entertaining despite its simplicity.If you have the opportunity to see it, do it, I don't think you will be disappointed."
    },
    {
      "rating": "6",
      "text": "The movie COLETTE is like prequel for the movie COLETTE, three-quarters for prelude, including interesting state of “affairs”, inclines Knightley’s chance to fight as wholly fascinating figure, somehow, it is just too late. Still, a light, moderately entertaining period piece."
    },
    {
      "rating": "7",
      "text": "It's never uninteresting or slow, but this gorgeous film doesn't end up getting more than skin-deep.  The conflict, while perhaps historically accurate, isn't ever terribly conflicting or challenging."
    },
    {
      "rating": "6",
      "text": "Keira Knightley plays the famed Parisian author, who not only created a series of wildly popular and influential novels, but also explored a controversial polyamourous relationship with her husband  (Dominic West). He initially took credit for writing the books, which eventually caused her rebellious spirit to fully ignite. Knightly does fine in the lead. Her costumes are especially attractive. This is more a biography than a romance, depicting their intense love, stormy relationship, creative conflict and period accoutrements with visual appeal and cultural relevance, but not much passion. May appeal to those who appreciate historical drama."
    },
    {
      "rating": "7",
      "text": "Westmoreland's quirky world is bubbled up by this sharp old book style script that layer after layer manages to keep its engulfing essence constant.ColetteWestmoreland's quirky world is bubbled up by this sharp old book style script that layer after layer manages to keep its engulfing essence constant. For, for once, both the source and the adaptation is cinematic enough to bang its way out of the room. It does best what Burton's Big Eyes unfortunately failed to do so. Working on a similar case, Westmoreland never gives you an opportunity to argue back. The annoyance level that the character goes through ought to communicate on such a script and it does in here. And even though it relies upon that tensed awkward empty moments, throughout the course, the emotions never grows shallow and the energy never wears off.As once a character mentions \"the lease\", Westmoreland has managed to get hold of it. He strains the characters and stretches the lease up till it is about to break and burst out the door. And just when the film reaches that peak moment, he lets go of all and increases the range of the lease. Resuming the clock from zero once again, this ping pong of the viewers' emotion and makers' puppeteering nature is continued till the last frame. It is free from the your usual structure despite of having familiar textbook tale.And emerging as an essential emblem to the current society as well as of the era that the tale revolves around, the maker takes you to different places with a message that bodes well as a metaphor for the entire movie. Focusing on almost a marital issue by imputing fame, art and legacy, it elevates the emotion and the gist of the issues on a much higher and louder scale. So, fiddling with arguably a family drama as such, the storyline demands the performance to a point, that it relies a lot upon it.Especially, when the couple gazes each other across the room with envy and rage or when there is an awkward silence in the room. And Knightly as a free spirited ahead-of-her-time artist dissolves into the persona of Colette. Her resisting force is much stronger than the West's man-ly dark abhorrent force. Her performance as an independent avant-garde open minded character breathes life into the movie everytime it loses its grip in order to foliate the screen with bright colors and stunning visuals. But challenging such a performance on screen, demands much more grittiness which is brought in by West in his suit of armor that is held as a shield for his dogmatic opinions.He makes you clench your jaw and pop your nerves every time he appears on screen. The injustice in his character is justified aptly by his devilish performance. Westmoreland has made a balanced movie. If the emotions aren't shared then the opinions are and if the credit isn't shared then the choices are. Smuggling the emotions like such the film may be mechanical at times but is never chalky. Colette is a fine devoured art, fabricated in a period set pieces it still manages to show us the current state of the society."
    },
    {
      "rating": "1",
      "text": "It's a genuine shame that this film is so dull. The main performances from West and Knightley are so \"one-note\" that after my tenth yawn I gave up being impressed by the set design and the costumes. Pity. You would have thought that the intrinsic nature of the off-beat relationship between these two literary figures would make for dynamic cinema but somehow the drama is just hinted at and not exposed in the raw. What would Burton and Taylor made of this scenario !! But they were legends and ,unfortunately West and Knightley are just actors. I look forward to Westmoreland's next film as I genuinely think he has found a way of curing chronic insomnia."
    },
    {
      "rating": "9",
      "text": "An attest to Knightley's acting talent's and a statement towards anyone who wants to be who they really are, pretty and well acted, a joy to watch."
    },
    {
      "rating": "8",
      "text": "I found this an interesting film in terms of the plot, given its based on a true story. Loosely speaking, its about female independence and empowerment (or the lack of it), in the time its set in - the early 1900s. I liked the determination Colette showed in the face of the social landscape she finds herself in. I like how she stands up for herself and I felt Keira Knightley did well in her performance, while Dominic West also does well as Colettes husband, Willy, who sounds really quite intimidating when he tries to force her to keep writing on his behalf, claiming its for their own good etc.I especially liked that at the end, we're shown what I assume to be real historical photos of Colette accompanied with text explaining what happened in her life after the time the film ends at. Its always nice to see details about the real story after the dramatised depiction, or adaptation, of it. I say that as obviously I can't vouch for how accurate it is but its certainly very much a watchable film, one I'd recommend."
    },
    {
      "rating": "5",
      "text": "Colette life story is interesting, but the movie doesn't really work, the movie really didn't have that power."
    }
  ],
  "recommendations": [
    "mary_queen_of_scots",
    "20th_century_women",
    "the_danish_girl",
    "men_of_honor",
    "dances_with_wolves",
    "the_imitation_game",
    "the_white_tiger",
    "bombshell",
    "swallow",
    "legends_of_the_fall",
    "the_last_duel",
    "closer",
    "american_beauty",
    "the_dig",
    "the_last_king_of_scotland",
    "nomadland",
    "12_years_a_slave",
    "hidden_figures",
    "the_reader",
    "agora",
    "anna_karenina",
    "green_book",
    "thoroughbreds",
    "cold_mountain",
    "the_electrical_life_of_louis_wain"
  ]
}