{"id": 2837, "title": "Collide", "starring": ["Ryan Phillippe", "Kat Graham"], "runtime": 90, "genre": ["Thriller", "Drama", "Crime"], "description": "A gripping thriller chronicling three couples over the course of one fateful night in an LA restaurant. Hunter finds himself on an awkward blind date with the captivating Tamira, while a busboy and his girlfriend are hiding mounds of cocaine to score a big payday, and outside, Peter sits in his car observing his wife’s infidelity with the restaurant’s manager. Though all strangers, their stories are weaved together as they hurl towards an explosive end.", "releaseYear": "2022", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/xdoOkjtC6BLZGdVBfLCKVXrKOcO.jpg", "categories": {"plot": 5.428571428571429, "acting": 4.285714285714286, "ending": 4.75, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 3.0, "funny": 7.0, "action": 5.714285714285714}, "reviews": [{"rating": "9", "text": "makxmdkdnkdndkdmksmdjwmskidiahwiidofjcodmskmsksmsksmsksmksmdkdmdkemekmdkdmdksmdkmdodmdmdmkkjhhhhgasncmmckeowidjd"}, {"rating": "5", "text": "Collide is safe proof. When the fun in Collide begins, it hardly ends with a bang and leaves itself in its roots and never grows to be the flower it wanted to be. Maybe if this was taken more seriously and if they had more time to make it, this wouldn't even bother failing."}, {"rating": "6", "text": "Eran Creevy's entertaining Collide is a briskly paced B-action thriller that features gripping car chases and fight scenes despite its familiar plot and distinctive blend of over-the-top villains and bland protagonists."}, {"rating": "3", "text": "Except for some decent action set pieces, Collide is a forgettable mess. The film is edited terribly and the moments that are supposed to matter don't. The performances are all okay except Ben Kingsley who was lost. Finally the plot holes and unbelievable survival skills (with little injury by the way) brings a mediocre film down a notch or two. D+"}, {"rating": "6", "text": "Quick money always ends in a big trouble!It's one of those films with aimless narration. Indeed, it has a nice cast and characters with the basic storyline, but that did not expand and explored well as it should have been. At least the pace of the narration looked fine. Some characters looked unnecessary, and so a couple of scenes. If these all were managed, then still it could have been a decent film. Because since it is an action- adventure, they did not generate those crucial parts like the stunts and dialogues related to the gangster thing to turn it a better film in its kind.The two veteran actors coming together for the first time added more curiosity than flavour we are looking for. They did okay and so the rest of the cast. Ideal runtime, a few stuffs were in the favour of the film, but those were not enough for the overall success. If the same film was made from the non-English world like perhaps Germany, which was one of the producers of the film would have done better than this existing one which is very familiar with this language.People would watch it only for Hopkins and Kingley and so did am I. But they might end in disappointment, or that could be the reason to rate it fairly better. Whatever, this is an okay film, which is barely entertaining and of all, not a boring film. So trying it for one is okay, but I think not worth if you have got plenty of options over this one.6/10"}, {"rating": "7", "text": "Maybe the story didn't make the best sense, but the action was interesting and the pace of action was good. The bad guys were quite funny also, especially Ben Kingsley's character. So maybe it's not the best movie in a sense of cinematography, screenplay and actors, but if you want a good action movie which I think it's quite good."}, {"rating": "2", "text": "What happened here? Nicholas Hoult, Ben Kingsley, Anthony Hopkins, and Felicity Jones were obviously in this movie to just get a paycheck. Not one thing in this movie is redeemable. The acting is fine because of the actors/actresses, but they clearly didn't care. The movie ultimately ends up into a cliched mess."}, {"rating": "5", "text": "A girl (Felicity Jones) needs a new kidney, his guy (Nicholas Hoult) is ready to do anything to get the money needed. So he gets back to his old criminal life, getting stuck between feuding gangsters (Anthony Hopkins, Ben Kingsley).\"Collide\" is functional, fast-paced and sometimes fun, if ultimately uninvolving actioneer. I have mostly positive things to say about it althought the result is not good enough to earn a recommendation.There will be a lot of shooting, punching and fast cars to satisfy the genre fan who just wants to see something new. The movie also has legendary actors Kingsley and Hopkins together on screen for the first time. And the young stars will not disappoint.But the screenplay is so sloppy that it's hard to stay invested. Firstly I didn't quite buy the main story arc of young petty thief outmaneuvering two veteran criminals with small armies, especially because it was done the cheapest way possible (sudden twists whenever convenient for storytellers). I also didn't buy the young hero as a guy never making mistakes or even getting hit hard, although he was constantly hunted by men who work as killers, and have a lot of shooting experience.Also, the story sits uncomfortably between two chairs, being neither serious enough nor tongue-in-cheek enough. You can't take it as a top-shelf actioneer, and it's not quite a flamboyant eurotrash either (many of the Jason Statham movies).As result, some of the stuff works (the beginning, action scenes), some not. Story becomes progressively more stupid, and Hopkins and Kingsley playing \"colorful\" gangsters is like a ham-fisted parody of their roles in earlier, better movies.At least young stars are doing good work. Jones is cute enough to justify all this punching and shooting, and it's always good to see Hoult (\"About a Boy\", the newest \"Mad Max\", Hank / Beast in \"X-Men\") in a role which doesn't serve as just a window dressing.If he got a movie role as big and colorful as in the first season of TV series \"Skins\", he could be the next Hollywood hero. He looks good in action too."}, {"rating": "2", "text": "Generally a waste of talent. Good actors in a not so good movie. Unbelievable and preposterous. The targeted audience must be grammar school boys."}], "recommendations": ["parker", "16_blocks", "triple_frontier", "extraction", "the_italian_job", "homefront", "contraband", "haywire", "2_guns", "the_gunman", "wrath_of_man", "gunpowder_milkshake", "the_ice_road", "the_commuter", "the_mechanic", "mechanic_resurrection", "red_notice", "wild_card", "honest_thief", "run_all_night", "sabotage", "angel_has_fallen", "kate", "the_equalizer", "bloodshot"]}