{
  "id": 2317,
  "title": "College",
  "starring": [
    "Alona Tal",
    "Drake Bell"
  ],
  "runtime": 94,
  "genre": [
    "Comedy"
  ],
  "description": "A wild weekend is in store for three high school seniors who visit a local college campus as prospective freshmen.",
  "releaseYear": "2008",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/e963mXIiuSwVyklsJxJ68mQ4CE.jpg",
  "categories": {
    "plot": 0.0,
    "acting": 0.0,
    "ending": 0.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 5.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "0",
      "text": "This movie was glaringly formulae. The acting was terrible but the directing was absolutely ridiculous. I mean, the dialogue and scene transitions were so banal and inane I was in utter disbelief. This is the worst attempt at film making I can remember seeing in a theater and possible anywhere for that matter. I feel remote and despondent after having witnessed such a painfully pathetic example of what the human mind can accomplish."
    },
    {
      "rating": "5",
      "text": "It has its good moments, but still a weak entry into the genre."
    },
    {
      "rating": "3",
      "text": "I giggled at moments, and the movie definitely has its moments, but oh my god it's bad. It is so obvious that it sticks to a structure it's awkwardly, embarrassingly obvious, as if the creators made no effort at all to make it seemless. It's definitely the worst college/high-school movie produced this decade."
    },
    {
      "rating": "0",
      "text": "Morris(Kevin Covais) puts it out there; the notion about senior year being the last go-around for he and his high school buddies. But before \"College\" goes lowbrow in the most puerile ways imaginable, Morris tries to connect with Kevin(Drake Bell) and Carter(Andrew Caldwell) in the same intimate manner that Judd Apatow's characters do on a regular basis. It's a short-lived moment. Although films such as \"Superbad\" and \"Pineapple Express\" should've put an end to the neo-teen sex comedy, \"College\" gives it the old college try, but a film in the key of \"American Pie\"(\"Band Camp\" & \"The Naked Mile\" went straight to DVD) is passe. The failure of \"College\" to entice moviegoers officially makes Apatow the John Hughes of this generation. By the time the third installment of \"Porky's\"(\"Porky's Revenge\") rolled out into domestic theaters(and drive-ins!), Hughes' \"Sixteen Candles\" and \"The Breakfast Club\" made moviegoers clamor for thoughtful teenagers who were a little horny, not the other way around. Like the creator of \"Freaks and Geeks\", Hughes humanized the young American on screen, and in the audience. Straight males in Apatow films are allowed to share their feelings with members of the same sex(Jonah Hill & Michael Cera in \"Superbad\"), but in \"College\", to be emotionally frank with a guy is \"too gay\". That's why Morris goes on a bender, frequently uses profanity, and screws a college girl. \"College\" is old school. Only girlfriends are allowed to convey their anxiety about losing each other after graduation is over. But Morris need not worry, because the best joke in \"College\" suggests that he'll be seeing a lot of Kevin and Carter in the future. The three principal leads, albeit not dead ringers, bear a physical resemblance, and have similar personas, to the record shop employees in Stephen Frears' \"High Fidelity\"(based on the novel by Nick Hornby)."
    },
    {
      "rating": "0",
      "text": "This is the filthiest put down of our youth and higher education that you could put on the screen and charge people to see. I walked out and I blame myself for not reviewing it better."
    }
  ]
}