{
  "id": 2057,
  "title": "Collateral Beauty",
  "starring": [
    "Will Smith",
    "Edward Norton"
  ],
  "runtime": 97,
  "genre": [
    "Drama",
    "Romance"
  ],
  "description": "Retreating from life after a tragedy, a man questions the universe by writing to Love, Time and Death. Receiving unexpected answers, he begins to see how these things interlock and how even loss can reveal moments of meaning and beauty.",
  "releaseYear": "2016",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/4vfqosgik5pLb32RpskYifp8PWJ.jpg",
  "categories": {
    "plot": 6.127659574468085,
    "acting": 6.818181818181818,
    "ending": 6.666666666666667,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 6.0,
    "funny": 6.5,
    "action": 7.5
  },
  "reviews": [
    {
      "rating": "8",
      "text": "Вполне простая и трогательная история. Эта самая \"простота\" не позволяет отключать мозг, что хорошо. Много звёздных имён в актёрском составе, на оскар, конечно, никто не играет, но все в кадре смотрятся приятно. Сюжет простой, но довольно интересный. Повторюсь в сотый раз - это крайне простой фильм, но эта простота и завораживает."
    },
    {
      "rating": "9",
      "text": "I'm a dude - I don't cry. So when I say I was at the brink of going full waterfall when Collateral Beauty entered its final minutes, there must be something moving about this film. Great performances abound in this clever tale of recovering from traumatic life event, which is a big overarching theme of this movie. Critics completely discarded it but I cannot fathom why. I usually can agree somewhat or heavily with critical reviews, but Collateral Beauty has more soul and fun surprises than most anyone gave it credit for. If you're willing to feel some warmth in your heart and feel sorry for a character or two OR you like a few mild surprises, Collateral Beauty has more going for it than it's being given credit for. Everyone turns in either a good or great performance here and everyone I've spoken with since watching Collateral Beauty agreed that it was well worth the watch. Maybe it's not an Oscar shoe-in but it's the most I've ever disagreed with an overall critical theme ever in movies. If you watch this with your girlfriend or wife or whatever, wear a poncho so you aren't wearing their tears (or your own)."
    },
    {
      "rating": "9",
      "text": "The philosophical underpinnings of this beautifully created film, cannot and MUST NOT be overlooked. Apart from the fact that only the privileged could live such a reckless life and not suffer grave financial losses, I get that grief transcends all class boundaries. This film also proves that interventions are effective change makers, however drastic and self-centred they are."
    },
    {
      "rating": "10",
      "text": "This was a very emotional and fantastic movie! Will Smith definitely showed raw emotion and other characters were brilliant as well, specially Helen Mirren.shame about the negative critic reviews as there have been many mediocre movies and some people have given positive feedback just because they included his/her favorite movie star. Come on, all movies doesn't have to be same or have a super hero, in the sea of all those ones I find this movie pretty genuine and nice. I cried my eyes out, it really pulls you in. I say to anyone who hasn't watch to go see it rather than read review and judge it yourself."
    },
    {
      "rating": "8",
      "text": "Хороший актерский состав,необычный сюжет и УИЛЛ СМИТ сделают ваш вечер прекрасным!"
    },
    {
      "rating": "2",
      "text": "What’s it about?An advertising executive (Will Smith) totally shuts down when tragedy strikes. His “concerned” friends (Kate Winslet, Edward Norton, Michael Pena) try to help when he starts questioning the universe and writing letters to the concept of Time, Death and Love.What did I think?The intriguing trailer for this film is a lie. The concept, so artfully set up in the preview, is destroyed minutes into the film, creating a jarring effect that leaves a bitter, mean-spirited aftertaste. Collateral Beauty is emotionally manipulative (think Hallmark Channel movie-level) and seems to be created specifically to tug so **** hard on heartstrings that it makes some kind of discordant non-musical cacophony of awfulness. It’s a movie purely about emotions that feels like it was made by someone who doesn’t understand how to human at all. It gets two stars for what I thought the concept was, and the rest of the three taken off for what the actual movie robbed me of."
    },
    {
      "rating": "10",
      "text": "Will Smith deserves an Academy Award for this heartfelt performance. There is good reason he is my favorite male movie actor as he brings real human emotions and you feel deeply what he is portraying. I feel he's been unfairly overlooked by the Academy in the past. This movie made me an others cry, and it also shows the power of love to hurt and yet heal."
    },
    {
      "rating": "2",
      "text": "Collateral Beauty takes its name, but senses no actual beauty of quality in terms of movie reviewing. Will Smith attempts to make a shine, but fails to impress any (and by that, I mean hardly) of us. If you're making tears during the film, that must mean that this movie failed to surprise you. Don't worry, it happened to me too."
    },
    {
      "rating": "0",
      "text": "The idea is not bad, but poor implementation. Also have superfluous scenes. Film tightened somewhat. Draw of the main character is unconvincing. I couldn't believe in it. in this film playing good actors, but it does not save the film and watch without fast forward difficult. the whole movie - nonsense"
    },
    {
      "rating": "2",
      "text": "Remember when everybody said that \"Gods of Egypt\" and \"Independence Day: Resurgence\" are the worst movies of 2016. Well, along comes this turd.When I saw the trailer for \"Collateral Beauty\", I thought it's going to be a modern day \"A Christmas Carol\". I mean, it looked like it could be an emotional movie, despite looking Oscar bait. It's not until I saw the movie and the actual plot.Here the real plot: A successful New York advertising (Will Smith) executive suffers a great tragedy, he retreats from life. He goes to work and builds elaborate Domino sets then watches them collapse while he refuses to communicate with other people. His co-workers react to this by hiring actors to pretend to be Death, Love and Time so they can film him talking to them then editing them out the video so it looks like he's mentally unstable to be a shareholder.Yes, that's the actual plot to the movie and it's awful. No wonder the trailer false advert this, because who would want to see this.How the hell did this get made? And why are there so many big name actors involved? I think this and \"Nine Lives\" are the biggest WTF movies of 2016. I just can't get my head around this. These Oscar winners & nominees agreed to be in this?\"Collateral Beauty\" isn't just the worse movie of 2016, but of the 21st century. What a cruel, heartless, boring, Oscar bait trash of a film. It's the worse kind of Oscar bait, as it ticks all the boxes for the purpose of earning nominations for Academy Award.What's worse is that title of the movie \"Collateral Beauty\" is literally said six times in the movie, but yet, I have no idea what it's suppose to mean. And frankly, I don't give a damn.This is once again another Will Smith Oscar bait movie. There was \"Seven Pounds\", \"Concussion\", and now \"Collateral Beauty\". If I have to pick this or \"Suicide Squad\", for his worse movie yet, this easily takes the cake. Smith himself isn't really the leading man, but neither supporting.At least the rest of the actors are actually trying, as the performance in this are not bad. But that's the only \"good\" thing I can say about this.Overall rating: This movie can go **** itself."
    },
    {
      "rating": "10",
      "text": "Will Smith deserves an Academy Award for his heartfelt performance. Death, Love and Time playing with my own emotions, I felt so deeply what Will and all the other characters were portraying... I was in tears as this movie poured out the power of Love in it's many forms, how love can be so joyous but yet so painful and then so healing, then Time, how precious is time to us all, and then Death, how we fear death but we can choose to be in peace with it and not fight it. Oh my gosh I absolutely loved this film and when it finished, honestly, I couldn't wait to want to see it again. This movie is BEAUTIFUL in more ways then one and I highly recommend it... it's a must see."
    },
    {
      "rating": "9",
      "text": "This movie made you feel and think. Great cast, great performances. Nice break from all the overwhelming special effects movies. Not sure what the critics who trash it are thinking but go see for yourself."
    },
    {
      "rating": "2",
      "text": "This film revolves around a trite trigger for tragedy: the death of a child (and it's set at Christmas to make it even more hackneyed). In this case, it's Will Smith who's can't recover from his young daughter's death. Three partners of his New York ad firm (Kate Winslet, Edward Norton and Michael Peña) concoct a plot to address his depression by hiring 3 actors to portray Time, Death and Love. Now, you've got Helen Mirren in the mix, but even her screen charms can't rescue this tear-laden attempt to stir the emotions. The dramatic effects of the story affect everyone involved with painfully predictable results. Smith cries in almost every scene, turning his misfortunes into shameless treacle. Although most of the performances are effective, David Frankel's direction and the script's transparent manipulation had my eyes rolling, instead of crying."
    },
    {
      "rating": "10",
      "text": "This is the kind of movie that critics should be celebrating rather than savaging. At a time when most movies are based on existing IP or fail to explore any theme, here is one that is an original story idea and that is about interesting thematic ideas. It deserves to be a new Christmas Classic.If you like This is Us on NBC or It's A Wonderful Life, check this movie out. If you like movies and shows about positive emotional growth and relatable human emotions and experiences, you will enjoy this. I wouldn't be surprised if audiences discover this movie on video or television and realize how great it is, much the way both Shawshank and It's A Wonderful Life were discovered after theatrical release. Why critics celebrate bleak films like The Revenant and Hell or High Water (both of which are not about relatable experiences) and yet dismiss movies like this as sentimental and manipulative is baffling to me. All art is by design manipulative; it is meant to elicit emotion in a very structured, calculated way. And this movie is not overly emotional or sentimental. It is just like Shawshank and It's A Wonderful Life in terms of emotions; that is, the emotions are earned and not melodramatic.The screenwriter came up with a brilliant script, and the director and actors realized his vision beautifully. Go see this movie in the theater, so that Hollywood will make more like it. Critics who have dismissed this movie know nothing about the screenwriting craft and how difficult it is to come up with an idea and story of this caliber."
    },
    {
      "rating": "10",
      "text": "First of all, all of the negative reviews of this film are coming from people who never actually saw the film.  If you read what they said, you can tell that they've only seen the trailer at best.  I can't understand why this movie is getting so much bad press.  I watched it this weekend and I absolutely loved it.  The jokes were funny.  The emotional parts were definitely heart felt and authentic.  The acting was amazing. And the script was one of the best I've seen this year.  Just for perspective, I went to see Star Wars: Rouge One the night before I watched this and Collateral Beauty is much more entertaining.  I actually wanted to see it again once I left the theater.  Star Wars on the other hand almost put me to sleep.  Mind you, I'm a huge Star Wars fan.  I've never seen such an aggressive attempt to sabotage a film before in my life.  Every major publication trashed this film.  Meanwhile, every review about Star Wars: Rogue One has been nothing less than a celebration.  Fact is, Rogue One has more characters than a Donald Trump tweet and can (and will) put the biggest Star Wars fan to sleep at some point midway through. Pay no attention these reviews.   Go see Collateral Beauty for yourself.  You be the judge."
    },
    {
      "rating": "7",
      "text": "An admittedly manipulative and somewhat sappy offering that nevertheless redeems itself with its heartfelt earnestness, clever premise and stellar performances among most of the principals. To be sure, the writing could have been crisper (especially in the first 30 minutes), and the sentimentality could have been turned down a few notches, yet the film also provides viewers with ample thoughtfulness about how to view life's big issues. In an age of rampant smugness and cynicism (and even more smug and cynical film critics), it's refreshing to see a movie come along that doesn't apologize for its own forthright emotionalism or its willingness to rely on a little out-of-the-box magic to make its point. (Remember, no one liked \"It's a Wonderful Life\" when it was originally released either.)"
    },
    {
      "rating": "1",
      "text": "The movie that no one asks for but it's released anyway. Yes, it's those type of movies that come out during Christmas time and yes it's another one of those cliche garbage movies like New Years eve from 2011. Combine a bunch of good actors and get this."
    },
    {
      "rating": "5",
      "text": "I Still Do Not Apprehend What Is \"Collateral Beauty\"Love, time and Death are the three abstractions connecting each human being with existence nature, they regulate our steps in the earthly world and rule a concatenation of situations personally related to a superhuman religious power. Based on these three conceptualizations, Christmas wager of Warner Bros. seeks to provide a life-giving message through the long-drawn-out dose of lachrymose content that after all it just got is to try the audience's patience and supply a wrong composition and emphatically distant to what it is proposed.Howard (Will Smith) opens with a poignant speech about the life pillars, in which manifests optimism and vitality of being in command of an increasing advertising agency. Two years later, a downcast man by depression, fatherly devastation, sadness and melancholy appears on screen, usually with an affliction frown and about to immerse himself into a fit of tears. According to his \"colleagues,\" the persistent emotional fluctuation of their chief—he spends the most time stacking up multicolored domino pieces in the form of small forts or constructions for symbolizing each individual fate: everyone will crumble; —is going to make to collapse their advertising company abruptly. To prevent this happening, and with the subterfuge of seeking his social, personal and labor rehabilitation; they determine to hire a group of actors to embody three characters whose their boss sends rejection letters: Love, Time and Death. They are portrayed by Jacob Latimore (Raffi), Keira Knightley (Amy) and an unexpected Helen Mirren (Brigitte) within a deeply unlike role to her triumphant career. All this in order to save the company, redeeming their \"colleague\" and suddenly saving their own lives, each one related to the existing pillars interpreted by the actors.I have to confess that in mid-2015, when I gradually found out about the cast and crew was quite elated and anxious to visualize the suggestive design starring these experienced actors, however, when I slid down on the screen and read the storyline, my expectation was accentuated uncompromisingly. I felt that it was what every film lover demands with devotion in these times of creative vicissitudes; an original story, with unique qualities and fine resolutions.Today, one year and a half later, I have the opportunity to see the film in its entirety, triggering a forceful change of opinion both subjective and objective. First, I noticed an air of magic realism that works to some extent; trying to play with viewers' mind is certainly detrimental since if it does not run with a rigorous and acute diplomacy can cause a powerful cataclysm, and precisely that was what happened to this feature film.  In addition to that fanciful aura into a realistic conception of the world—which is far from generating a consistent empathy with the public, —Allan Loeb's script provides a figurative and utopian searching, shuffling the story desire within the three supporting characters: Whit, Claire, and Simon (Edward Norton, Kate Winslet and Michael Peña). While it conglomerates subplots in the story, Howard, the true leading role, moves to the last place, dragging the course of the occurrences out and trying to be a competent work influenced by philosophical issues. Besides this, the staging does not suggest high conception of imagination or invention, adhering to New York in full holiday season, repetitive close-ups of misty-eyed Will Smith, editing of uneven pace and a soundtrack as generic as deficient for jam-packed dramatic moments, which there are every minute.Despite the constant detriments, the film acquires and retains a stimulating ether around the leitmotiv: trying to bring back a loved one. Playing Love, Time and Death of crystal-clear, but at the same time multiple ways is one of their few skills, even getting to arouse fervor with the cardinal aim of the characters. In addition, the task of giving sense to existence reminds us of the classics which managed more than honoring and paying tribute to life itself: \"Life Is Beautiful\" or \"The Pursuit of Happyness\" (starring Smith in 2006).\"Collateral Beauty\", directed by David Frankel, feels as the definitive collapse of a joint of erroneous decisions about giving shape to a story, however, above film or narrative standards, the movie is a good choice for those who wish to reaffirm the importance of life, time, death and love.Packed with talented stars, a fortifying central plot and a suggestive final twist, Frankel's celluloid does not deserve such reprimand by movie critics. Is it a confusing and irregular motion picture? Yes, it is, but if we are going to talk together about real dud movies, several heads already lean out."
    },
    {
      "rating": "1",
      "text": "I haven't seen an idea so poorly executed in a film ever. Everything about this movie sounds great on paper, but on screen it becomes a pithy, misguided film trying to deliver platitudes on high. The talented cast does the best they can, but unfortunately, this film is a black mark on all of their resumes. The film's handling of it's subject matter (without going into spoilers) is delusional at best and evil at worst. You'll laugh at how ridiculous the movie is, and be angry at how the story resolves."
    },
    {
      "rating": "5",
      "text": "It has been said that the producers originally wanted \"Collateral Beauty\" to join this year's end's awards race but ultimately decided against it. Looking at the big names starring here – Will Smith, Helen Mirren, Edward Norton, Kate Winslet, Michael Peña, Keira Knightley, Naomie Harris – one just has to ask: how bad can it be? To avoid the awards race, I mean. At least it's still released in December, as an antidote to much more popular sci-fi actioneer \"Rogue One: A Star Wars Story\".Well, let's look at it this way. The movie has enough going on for it to catch attention. Really cool cast, intriguing trailers showing Will Smith talking to abstact supernatural beings such as Death, Time and Love... I also liked the ending although if it does not evolve from the previous plot naturally. And when have you ever seen lots of domino bricks toppling on each other without being at least a little bit impressed? They have quite a few of those scenes, right from the beginning.The only troubling note I could foresee is the duration of the movie, which is a measly 97 minutes. Since when any self-respecting glamorous Hollywood project of modern times has been satisfied with less than two hours, or something close to it?And then it happens. Many of the watchers will probably notice soon that they are not not actually enjoying themselves much. For all the ambitions to offer a poignant story about loss, pain and being humane to each other, the result is just... not there. It's too sappy and bland, characters feel like vague shapes than real human beings and the whole plot can be called pretty manipulative.There's actually two kinds of people who I can imagine actively enjoying this: (1) the ones who have not seen a lot of American movies but quite like them, (2) little girls of all ages or sexes. To put it more bluntly: \"Collateral Beauty\" is for this sweet little girl in all of us. I am talking about this joyous abstract being who can still believe that acting nice makes one essentially a good person, no matter the actual deeds, and always pays off in the end. After all, it's, of course, a suitable direction for what is essentially a Christmas movie disguised as \"Will Smith getting serious project\".Speaking of the handsome devil, this role is very suitable for where the leading man Will Smith currently is with his movie making career. Just as his character has lost all passion for all the seemingly sunny and successful life that has come before, I don't actually remember seeing Smith in a movie and thinking that he must be satisfied with acting for quite some time. Maybe he's really enjoying himself in \"Suicide Squad\", haven't seen that one yet.To some degree, it certainly hurts \"Collateral Beauty\" that Will Smith has always been more of a strong performer than notable actor, even given better material. He's always been adequate and he will not sink the ship here, but he's just... not that good.I guess it helps a little that Smith uses little bodily movements and tics to convey the overwhelming emotional pain buried inside the character. But he's far from having a convincing, effortless dramatic role presence as some of his colleagues here, mostly Harris, Peña and the ever-great Mirren.Maybe it's just me... but I have noticed that sometimes moviemakers use this trick to compensate for the mediocre performance of the star. They give him as little dialogue as possible and let him just lurk around, so the screen colleagues and overall atmosphere can make him look better. Remember, say, Eminem in \"8 Mile\"? This seems to be also the case here but sadly the material is not as interesting to really make it work.\"Collateral Beauty\" doesn't offer much in the way of authentic emotions, nor exciting roles from talented cast included here. But as just a Christmas movie for a little girl in all of us, it's quite OK. It looks certainly pretty, which can be confused with good sometimes, when the audience is feeling generous.By the way, Will Smith is appearing next in \"Bright\", some Netflix-produced fantasy that is still mostly held under wraps. The plus here is magnificent director David Ayer known for achieving frightening authenticity with his actors, as in \"Harsh Times\" or \"End of Watch\". I really liked \"Fury\", too. So if there's someone who can give Smith his mojo back, maybe it's Ayer.And if even this will not work out, \"Bad Boys\" 3 ja 4 seem to be on schedule for 2018 and 2019, repectively. Surely Smith can do good with the series that made him a proper movie star?"
    },
    {
      "rating": "10",
      "text": "I decided to see this movie in spite of the trouncing it has received from so many critics. I found it engaging, well written, and emotionally cathartic in more skillful ways than I would have expected, based on the negative reviews. The reception Collateral Beauty has received makes me suspect that someone involved in the project has made some influential people mad. The acting is excellent, and there are some amusing sidelights for anyone who has ever been involved in theater. In some ways, it is an update of “A Christmas Carol” where Scrooge is replaced by a grieving father and the support he attracts to help him heal. Laughter and tears seem like a good Christmas/Chanukah/Kwanzaa present for anyone armed with a hanky and some popcorn (or maybe just soggy popcorn for the unprepared)."
    },
    {
      "rating": "10",
      "text": "I rarely go to the theater to see movies, but as soon as I saw the trailer, I knew I needed to see it.  Having recently lost my husband, I completely got where Howard was coming from, and how losing someone you love changes you and destroys how you see the world and what happens in the \"after\".  I think it spoke from that place deep inside.  It wasn't long ago that I would have been able to follow the plot of any film because grief affects everything in your life.  Even as the co-workers create their plan, you can see they are not sure it is a good thing. When they have to face the consequences of their plan, you can see they feel Howard's pain.  I think it was wrong to compare it to \"It's a Wonderful Life\", or tout it as a holiday feel good movie.  Anyone who has grieved will get it.  I know I intend on making it a permanent part of my movie library."
    },
    {
      "rating": "10",
      "text": "I loved this movie! It is refreshing and different and thought provoking. The critics who thought it was predictable and shallow were obviously in another theatre! I loved the portrayal of grief in aspects not usually found in movies. I loved how the characters really cared about each other and were facing realistic challenges. The writing was excellent and the acting was superb! There was enough humour scattered about to keep the sad parts from taking over, and I really, really liked the twists at the end. I thought about this story for days afterwards. If I had 4 thumbs they would all be up!"
    },
    {
      "rating": "10",
      "text": "Well I loved it.......... Can't understand why so many people seem to have not liked it. The only thing I would have changed were a couple of scenes at the end which may have been superfluous."
    },
    {
      "rating": "9",
      "text": "It is no coincidence that Collateral Beauty is set around the Christmas time and hit the cinemas during the festive season. As beautiful as the story is, it would have a hard time working at any other time of year. We meet Howard at the height of his game. He is an advertising executive with a loyal group of friends and business partners around him. Together they just opened a new office in New York and life is good. Fast forward three years and the picture has changed. Howard has changed. Two years ago he lost his daughter and is unable to process the grief that consumes him. He is no longer able to cope with his surroundings. Instead of working he stopped talking to people and spends his days building elaborate domino structures.This, of course, threatens the wellbeing of the firm and it’s staff and his friends are slowly running out of options. Whit, Claire and Simon worked hard to keep the ship afloat but big contracts depend on the connection that Howard had with the clients. Without his input the business has taken a turn for the worse. However, there is light at the end of the tunnel. They have an offer to sell the company but Howard won’t hear any of it. In their desperation Whit suggests to hire a private detective to help gather evidence that Howard is unfit for business. At first hesitant, Claire and Simon eventually agree and the PI discovers that Howard wrote three letters: one each to Love, Time and Death.They decide to hire three actor to portray Love, Time and Death. The actors are at first supposed to interact with Howard to shake him out of his stupor. That failing they go on to the next steps in the plan.All the while Whit, Claire and Simon are directing Love, Time and Death they also struggle with their own personal problems and how to deal with them. Whit gets a lesson in love, that he desperately needs because his daughter hates him after his divorce. Claire has dedicated her life to the company and made the staff her priority. Now feels she ran out of time to create her own family. And Simon is in dire need of advise from death himself.Meanwhile Howard spends his evenings watching a support group for bereaved parents through a window. One night he gathers up the courage to go inside and join. The group leader is a woman called Madeleine, who lost her daughter to a rare form of brain cancer.  Although he is unable to speak about the loss of his own child, this together with the appearances of Love, Time and Death are the begin of the healing process he so desperately needs. With Collateral Beauty there will be no middle ground. It’s like Marmite. There will be people who love it and there will be people who hate it. I love it. It is such a beautiful story. Will Smith is giving one of the best performances of his life. Considering that his character doesn't speak for most of the time all his emotions are portrayed by facial expressions and body posture. The man is a terrific actor!Helen Mirren is a brilliant as always. She can do no wrong in my mind. Her portrayal of Death could have been awkward, but in fact is was just the right balance between serious and light hearted. Kate Winslet is a wonderful actress. Unfortunately the role didn't do it for me. It didn't do her acting ability justice. It's almost as if the actress was bigger than the role. Although, on the occasions when her talent could be shown - show it she did.I was disappointed with Keira Knightley’s performance. Not quite sure if she was meaning to play a **** but she certainly came across that way. Not very nice for someone supposed to portray Love. Naomie Harries plays Madeleine, the woman that Howard meets at the support group. She gives a stellar performance in her portrayal of the heartbroken mother who lost her little girl in such a cruel way. I can certainly see, where the critics are coming from. There aren't any ups and downs and in a way, the story is also quite predictable. Yet, I really loved it. I can see myself pulling Collateral Beauty out every Christmas together with all the other Christmas movies such as Love Actually & Co. Collateral Beauty is a very moving film. It took me several days of mulling it over in my head before I was able to put my thoughts into words. In fact I actually went to see it when I first came out here in Ireland on December 26. But I felt that  I wanted to keep it close to me for a while, before talking about it. That in itself makes it special to me, because I don't get this feeling very often.It also is a very sad movie but it also is full of hope. In so many ways. It gives hope that we have enough Time and Love before Death comes and gets us. And  hope that we will be able to see the Collateral Beauty all around us in those we lost."
    },
    {
      "rating": "4",
      "text": "Collateral Beauty has a unique premise and offers a poignant message in the end, even if the subplots, tone, and characters required to get there are inconsistent and the emotions feel forced. Good premise, bad execution."
    },
    {
      "rating": "6",
      "text": "I love Will Smith and to his credit, he brings it in this movie. When I first saw the trailer, I figured this would be a thought provoking and emotional drama that would make up for Will Smith's recent movies (Suicide Squad, in particular) but unfortunately this movie is almost nothing like that. The plot of the movie is basically When a successful New York advertising executive suffers from a great tragedy, he retreats from life and becomes a recluse. When their business suffers, his coworkers conspire to make him look crazy, in an effort to discredit him and keep their jobs. Yes, you read that correctly. If you're looking for a feel-good movie full of Christmas cheers then you don't want to go see this movie.The movie means well but alas its extremely fundamentally flawed in its execution and writing. The cast, especially Will Smith, Keira Knightley, Hellen Mirran and Naomi Harris do well in this while Edward Norton (I can't even believe I'm saying this, Michael Pena and Kate Winslet seem to be sleepwalking through the entire film. As I said, Collateral Beauty isn't all that bad. If this movie had been better written and better directed it probably would have been the movie I thought it was supposed to be. The positives are that it does have an underlying message about grief, loss, love and time if you stick with the movie long enough to see it. The performances make the movie watchable and the there are small, satisfying moments that should impress movie. Does it deserve the \"23\" that this site gives it, No it certainly not the worst movie I've ever seen but its also not the best either. As I said, this could have been a great film for all involved had it been over-seen by a more fundamentally sound director and writer."
    },
    {
      "rating": "5",
      "text": "First of all, let me just say I did not have high hopes going into this movie as much as I wanted to. When I first saw the trailer for the movie, I was very enthusiastic as I’m a HUGE Will Smith and Keira Knightley fan; however, with a Rotten Tomatoes score of 12%, I was not looking for much, in fact I almost considered skipping this one. I told myself if it was bad, at least I got to enjoy my bucket of popcorn and cherry sprite–my go to movie snacks–and see all the new movie trailers.The movie started at as most do, a light introduction to all of the characters, with a focus on the main character Howard Inlet, portrayed by Will Smith. After a couple of minutes, we flash forward three years and the next forty minutes are relatively slow. We meet the main characters who are all business partners of Howard, and who each have struggles in their personal lives they try to keep hidden, as well as learning that Howard’s daughter has passed away, and he has closed himself off from those he once kept the closest. The company he started with his best friend and business partner is failing, and they have to do something to turn it around. They have to “help” Howard.They learn that Howard has been writing letters to death, time, and love in somewhat of a therapeutic way to deal with the tragedy. Now, from this point we meet the characters portrayed by Helen Mirren, Keira Knightley, and Jacob Latimore. In my personal opinion, they stole the entire show. Helen Mirren brought a comedic relief to the show, Keira Knightley was a lovely portrayal of a young woman with a big heart and high morals, and Jacob Latimore was stern in his role and his approach to his role. They play three aspiring actors who get roped into being death, love, and time respectively. They each work closely with one of Howard’s friends, and each build a personal relationship with each of the three friends.To avoid any major spoilers for those of you who may not have seen the movie, or want to see it after it’s released on DVD, I won’t go into many details about the rest of the movie. The last forty-five minutes of the movie really pull you in. I was skeptical up until this moment, but by the end of the movie I was in tears. The ending is truly magical for me, and while I might have caught onto what the directors were doing with the plot, I still loved every moment. You will fall in love with the moral of the story, and you will fall in love with the passion of Mirren and Knightley’s characters. You will want to hug Smith’s character. And finally, you will realize that everyone has hidden demons, and true friendship will always overcome any problems you may have.While the movie ended beautifully to me, and had some great characters, it was still not the best movie I have seen all year, and wouldn’t be one I would pay to see again. It seemed like a rip off of A Christmas Carol, a little overdone but decently executed. Anything that tugs at my heartstrings gets a win for me. Will Smith didn’t give me the movie I was hoping for and Kate Winslet seemed like she didn’t really want to be there, but Helen Mirren and Keira Knightley gave me so much more than that. It may have failed to hit the mark for such a stellar cast, but it was a decent movie that at least pulled me in at the end.Oh, and for the final moments of the movie, trust me, you will need a box of tissues. And I would recommend waiting for the DVD release."
    },
    {
      "rating": "10",
      "text": "I honestly don't understand why this movie has such low reviews.  I absolutely loved this movie.  Will Smith was completely believable as a grieving father.  The cast was outstanding, and the casting director deserves an award.  This was obviously a movie that every cast member felt personally connected with.  There wasn't a bad performance in the movie.  The writing was thought-provoking and clever and compassionate.  I likewise don't know how Will Smith didn't win an Oscar for this."
    },
    {
      "rating": "7",
      "text": "Love. Time. Death.I think I underestimated this flick. Despite a wonder cast, I judged the film before watching it. I was surprised how beautiful film it was. Though not a film of the year. It was like 'A Christmas Carol', except the past, present and future were replaced with different topics. And for each topic, separate set of characters with one twist at the end. The overall film was short and sweet.A successful businessman man who had lost his child seems not able to come out of the sorrow. His partners are worried for him, as well as the firm's future. So they come up with an idea to bring back their partner that they hire actors to help him recover. How the remaining tale turns out and the last part of the story brings an emotional ending.There were lots of actors for just an 90 minute film. But everybody had a fair share. Nobody was greater than others. Smith had less dialogues as his role demanded that. From all, Winslet role was so ordinary, comparing her star value. Knightley was good, but her one of the dialogues about 'love' was awesome. Norton, Pena and Mirren, all were good in their respective parts.An emotional film, but I don't think it appeals enough to everybody. As I'm being a fan of that theme, I felt it should have been a bit strong in those parts. Other than that it was a good film, a family friendly drama. It was not based on any book, though, looks like one. Surely worth a watch, especially if you love tearjerker films.7/10"
    },
    {
      "rating": "8",
      "text": "Me ha parecido una muy buena película. Me ha parecido una actuación magnífica interactuando con las 3 bellezas. Aparte muy buen reparto con caras conocidas."
    },
    {
      "rating": "10",
      "text": "I am stunned to see and read too many negative reviews, over what is a great movie, especially for those who deal with grief from losing a loved one. From death and loss when it is least expected, one never if rarely fully heals. In fact the stigma with those who have not felt deep grief, really are in no position to judge those who favor this great movie, or its contents. If you've never experienced such, you've got not a clue yet, until then. Some have hearts of stone; many never deal with their own grief appropos, often hiding losses of loved ones in closets. Those who deal directly with grief, albeit 'grief therapy' then this movie is for you, regardless of negative critics/critques."
    },
    {
      "rating": "10",
      "text": "This is one of the movies that you need to look for and think about the message being offered. Leave out the notion that money can buy everything. Friendship knows no bounds and to give anything, including money to see someone you love and care about get the help and compassion they need. This is about grief and how each one of us goes through it differently. The loss of a child is ultimately harder to grieve through since life is just starting for them.  I give this movie a 10 because I felt the underlying message. Twists and sappy content aside, look at the grieving process and those around the on grieving. We all hurt when our friends and loved ones hurt. Compassion and the willingness to go to any length to help is what this society is missing today. Death is very difficult to process and work through. The emotion these three friends show is a testament to the humanity that is still alive in this crazy world. How far would you go to bring a friend back from the brink..."
    },
    {
      "rating": "3",
      "text": "Collateral Beauty is a film which mainly centers around the emotional core and how some people deal with loss of a family member. However, there are certain aspects of this film which I can't ignore there are characters which do horrible things to a character going through a difficult time and rather than support him, they try and prove he is insane. There are other things which are bad and the other issue with this is the writing, this film is poorly written."
    },
    {
      "rating": "5",
      "text": "Grief is such a powerful plot point, but you always have to make sure to go about delivering the message in the right way. Collateral Beauty, however, did not. I guess it all came down to the casting choice. Will Smith had the charisma of a potato, and only Helen Mirren was great. The plot holes were very visible that it's a wonder how people sat through with all of them. The story does not make sense, and sadly, no matter how much I wanted to like the film, it did not do it for me. The cinematography was great, however."
    },
    {
      "rating": "9",
      "text": "This movie is lit everybody should watch this movie if you are Will Smith fan or not you will love this movie. It is a story a young successful, charismatic bussiness man and how his life changes up side down, after the loss of his daughter, how it puts him into depression and how it changed his life totally.This movie tells how a lose of loved one can change your life drastically."
    },
    {
      "rating": "10",
      "text": "One of the best movie for log time, period. Not sure why this movie with such of bad critical score."
    },
    {
      "rating": "7",
      "text": "Klar, der Film ist ganz schön kitschig und pathetisch, das Ganze dann noch gewürzt mit einer gehörigen Portion Esoterik – und trotzdem hat er mir sehr gut gefallen, denn er holt einen emotional ab. Man kann nachempfinden, was der Protagonist, gespielt von Will Smith, emotional durchmacht, man fühlt mit ihm und wird am Ende fürs dranbleiben auch noch mit einem überraschenden und erlösenden Plot-Twist belohnt."
    }
  ],
  "recommendations": [
    "manchester_by_the_sea",
    "me_before_you",
    "revolutionary_road",
    "blue_valentine",
    "brokeback_mountain",
    "her",
    "the_fault_in_our_stars",
    "marriage_story",
    "up_in_the_air",
    "hereafter",
    "the_descendants",
    "the_hunt",
    "the_intern",
    "closer",
    "the_glass_castle",
    "hotel_rwanda",
    "promising_young_woman",
    "breakthrough",
    "i_can_only_imagine",
    "the_florida_project",
    "the_curious_case_of_benjamin_button",
    "lovelace",
    "heaven_is_for_real",
    "joy",
    "about_time"
  ]
}