{"id": 3352, "title": "Color Out of Space", "starring": ["Nicolas Cage", "Joely Richardson"], "runtime": 111, "genre": ["Mystery", "Science Fiction", "Horror", "Thriller", "Drama"], "description": "The Gardner family moves to a remote farmstead in rural New England to escape the hustle of the 21st century. They are busy adapting to their new life when a meteorite crashes into their front yard, melts into the earth, and infects both the land and the properties of space-time with a strange, otherworldly colour. To their horror, the family discovers this alien force is gradually mutating every life form that it touches—including them.", "releaseYear": "2019", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/vkwgzCBBiY3C1XEy0WakYfMOvnG.jpg", "categories": {"plot": 5.914285714285715, "acting": 6.2, "ending": 5.666666666666667, "soundtrack": 5.0, "cinematography": 7.2, "familyFriendly": 3.0, "funny": 6.428571428571429, "action": 8.0}, "reviews": [{"rating": "6", "text": "Fascinating concept surprisingly well realised on the 'tiny' $12 million budget. The cast is great with some decent cinematography. There is a 10/10 movie in here and while the scale of the projects visual effects is noticeably variable in quality, it was the tonal shifts that I found spoiled its pacing affecting my enjoyment. Add in he usual sci-fi horror tropes and things went stale quicker than I'd hoped. Still worth a long for any genre fans though!"}, {"rating": "7", "text": "I find Richard Stanley fascinating, unfortunately his execution tends to be much rougher then his vision (although this is a far cry from the likes of hardware) but this emetatly watchable about the the invasion of a farm of... something. and how it impacts their lives and psyche. Try and avoid the spoilers and enjoy a rare treat of a well executed batsh*t crazy movie."}, {"rating": "5", "text": "A dramatic display of bright, flashing neon lights that seemingly appear when not quite necessary, like all the bright flood lights that randomly appear around the house during night time scenes, for example. Just a LITTLE excessive! Nicolas Cage loses his freakin' mind, no surprise there. All this jumbled up with lots of confusion on a mediocre film set, with \"reaching for the stars\" special effects makes for a VERY generous \"5\" out of 10! Oh, and we musn't forget the weird, awkward little kid that sucks us into the plot with his \"visions\" and subpar \"warnings\"! Like, what is actually HAPPENING here?! What is this film trying to tell us? Interesting yet equally disappointing in it's own special ways."}, {"rating": "5", "text": "This movie was reasonable decent. It had some moments - some good gore, camp, effects - but overall it was a bit messy. I'm a fan of the genre, so went to see it based on reviews here. The NY TIMES gave a grossly over-rated review. I'm shocked.  It's not the greatest, nor the worst. Given all the crap out there (2019 was worst year for movies in my book), this isn't a bad choice."}, {"rating": "8", "text": "This adaptation of H.P. Lovecraft's science fiction novel is interesting, it not only works in a modern era, but it also allows Nicolas Cage to be as damn Nicolas Cagey as he wants. Overall a pretty good film, with some clunky dialogue."}, {"rating": "9", "text": "Finally, after many years of waiting we got a perfect movie based directly on H.P. Lovecraft. Great atmosphere, very decent performance from Nick Cage and rest of the crew, clearly made by folks who love and understand great master work."}, {"rating": "7", "text": "“We're a family, and if there's one thing families do, it's stick together. Now feed your mother!”"}, {"rating": "6", "text": "Nicolas Cage stars in a lot of garbage and has been doing it for years but occasionally he makes an odd good thing, even if sometimes it's difficult for them to pass the filter of some viewers among all the ****Color Out of Space is another little jewel like Mandy and when I say jewel it's not that I think it's a masterpiece or something like that but among all the bad options of his career, films like this manage to stand out, although most of the attention falls on the return of Richard Stanley.Color Out of Space is a somewhat disorganized film and not all its elements stand out or works as they should but it's a bold proposal that refuses to be passive and therefore ends up being a rather entertaining experience.Automatically destined to become a cult film."}, {"rating": "7", "text": "Not for the faint of heart, Color Out of Space is a true Lovecraftian horror placing Nicolas Cage at his bizarre best. Do not, under any circumstance, watch this movie on drugs. Or maybe, ONLY watch this movie on drugs. Either way, make sure you experience the insanity for yourself."}, {"rating": "10", "text": "This movie gives it all with a weird, crazy, and horrific vibe. Definitely a must watch for Nick Cage and the rest of the cast."}, {"rating": "7", "text": "This movie exceeded my expectations. It absolutely captured the feel of a Lovecraft story. Having read the story a while back, I was surprised at how well the portrayal of the \"color\" matched my imagination. I can't recommend it enough for fans of good horror movies."}, {"rating": "7", "text": "A solid adaptation, albeit with a bit too much alpaca-based comedyWritten and directed by Richard Stanley (his first film in 25 years), Colour Out of Space is a modernised adaptation of H.P. Lovecraft's 1927 short story, and takes a good stab at depicting one of Lovecraft's most oblique entities. Mixing humour and body horror (perhaps weighed a little too much towards humour), the film gives Nicolas Cage another opportunity to go full-Cage after he recently cut loose in Mom and Dad (2017) and Mandy (2018). And boy does he lean into it – this is the most ludicrous, histrionic, and borderline farcical performance since Vampire's Kiss (1989).Just outside the city of Arkham, MA (the fictitious setting of many Lovecraftian stories), Nathan Gardner (Cage), his wife Theresa (Joely Richardson), and their children Benny (Brendan Meyer), Lavinia (Madeleine Arthur), and Jack (Julian Hilliard) have moved into Nathan's deceased father's property, with Nathan embracing rural life by raising alpacas. On an otherwise normal night, the sky fills with pulsating light and a meteorite crashes onto the Gardners' land, and as time passes, amidst a series of ever-more bizarre events, the family members soon begin to show signs of unnatural change.Where Stanley is perhaps most successful in adapting the original is in terms of how he depicts the entity itself, or rather, how he doesn't. In the original story, the entity is described only by analogy, and even then, only in relation to colour. With this in mind, Stanley wisely keeps everything as vague as possible – vibrant, modulating pulses of light that seem to be emanating from somewhere just outside the frame, vaguely-defined spatial distortions, colour manipulations with no obvious source.Important here is the actual colour itself. Instead of attempting to create an indescribable colour (in the story the colour is beyond the visible spectrum), director of photography Steve Annis avoids depicting any one stable colour – every time we see the effects of the meteorite, the hue is in a state of flux, so although we can say the colours are recognisable, they are never identifiable as a specific colour, which was a smart choice on his part.As we get into the third act, the film abandons all sense of restraint as the body horror which has threatened to break through from the earliest moments is finally unleashed, foregrounding the exceptional work of special effects supervisor/creature designer Dan Martin. These scenes are heavily indebted to Chris Walas's work on David Cronenberg's The Fly (1986) and Rob Bottin's work on John Carpenter's The Thing (1982), including a direct visual quote of one of its most famous dog-related moments. Some of the more grotesque human-related effects also reminded me a little of Screaming Mad George's work on Society (1989).It's also in the last act where Cage is turned loose, and that's not entirely a good thing. Full-Cage has been seen in films such as Vampire's Kiss, Face/Off, Bad Lieutenant: Port of Call – New Orleans, Mom and Dad, and Mandy, but each performance has felt fairly organic, never becoming self-conscious. In Colour, however, Cage crosses into self-parody, with his performance having as much to do with people's preconceived notions of a Nicolas Cage performance as it does with finding the character; oftentimes, it feels less like he's trying to convey the character's emotions, and more like he's winking at the audience.Which might be entertaining and all, but which doesn't serve the film especially well. For all its insanity, this is a relatively serious movie, but Cage's performance is so manic, that it affects everything around it. For example, after a meltdown about his alpacas (\"don't you know how expensive those alpacas were\"), which just about fits in what we know of the character, as Nathan is walking away, he stops, turns, pauses, shouts \"ALPACAS\", pauses again, and then walks away. Undoubtedly funny. But does self-reflexive humour by the leading man help tell the story or even create the right tone? No, not in the slightest.The other characters all have a kind of internal logic to their crumbling sanity; the meteorite affects each of them differently, with their minds disintegrating in different, but consistent ways. With Cage, however, Stanley seems unwilling, or unable, to establish the parameters by which Nathan's mind is disintegrating, seemingly going for laughs rather than something more cogent.This issue notwithstanding, I enjoyed Colour Out of Space a great deal. Stanley's return to the director's chair is to be admired for its restraint and how faithful it remains to the very tricky Lovecraftian original. The body-horror in the film's will appeal to fans of the grotesque, whilst others will take pleasure from Cage's insanity, as narratively unjustified as it is. The film is ridiculous on many levels, but it's extremely well realised and well made."}, {"rating": "10", "text": "A phenomenal feat of film making. Richard Stanley has taken Lovecraft’s horrifically imaginative story and turned it into a psychedelic nightmare on the screen. A total barrage on the senses, it’s a pleasure to endure as a viewer."}, {"rating": "3", "text": "An aggressively awful adaptation. On its own merits (disregarding source material) this movie is a predictably subversive, horror cliche filled couple hours of garbage that deserves recognition only for the occasionally well crafted suspense and interesting visuals. Taking the source material into consideration, this adaptation is unfaithful on nearly every level. For every thing it keeps accurate there are 10 things completely invented for the sake of cinematic drama, no doubt in an effort to keep stimulus overloaded infantile adults transfixed by the sensationalized elements that the original story had none of.On the plus side, if you're a kind of passive viewer who enjoys colorful lights, being scared, not thinking a lot in general about any one thing, this movie is designed almost especially for you."}, {"rating": "0", "text": "I'm so glad i have no writing talent... at least no one will butcher my creations in 100 years, making another shallow, mainstream POS family drama."}, {"rating": "0", "text": "This is some pure bs if you're not on drugs. Between awful acting, a ridiculous story, unrealistic reactions, and a story that doesn't make a lack of sense, choose something else. For the love of God, save yourself the trouble."}, {"rating": "7", "text": "How Much More Can You Live In Denial The Movie.There are not many triggers nowadays that would make me instantly write stuff, but when you see an alpaca hydra, I believe it's time to just sit the f*ck down, and talk about it.There are many types of inexplicable horrors. There are slashers where characters run for their lives while someone is chasing them, and always somehow catches up to them just by casually walking. There are zombie apocalypse movies where every major conflict either begins or ends with a random spawn of a zombie horde right behind the main characters. In sci-fi genre, there are often the worst possible plots, which in some terrifying way infected the whole film industry in general - revealing five minutes before the ending that everything that happened had just been in someone's head from the very beginning, which leaves you in a not very ideal state of mind since you've just spent 2 hours living a lie.Then... There are Lovecraftian brain deforming space clusterf*cks where things just happen, and you have to deal with it however your brain is fit to process it, because nobody will help you understand anything. Definitely not anyone in the film itself, no narrators there, and don't even try asking the person who's watching it with you. You can be sure they have no idea, and if by some miracle they do, it still won't be an idea of any worth to anyone at the moment.That being said, it's also the source of all the originality, which makes every single bit of Lovecraftian lore a pure sci-fi gold, which is something everyone has to appreciate. Who doesn't appreciate that doesn't appreciate originality, and should just go watch some Fast & Furious XVII after a few rounds of their worthless League of Legend competitive match that they lost, so they rage quit to some PvE in Fortnite, because their lingering frustration won't allow them to play PvP at this self-loathing, absolutely useless moment of their lives.OK, back to the film itself.Someone might wonder about the title I gave this review, provided they managed to read the whole thing and didn't get offended by me criticizing their favorite series and games of all time. The reason behind it is the characters' utmost denial of totally everything that doesn't correlate with all the norms of their boring everyday lives. At first, it seriously annoyed me, but in the end, it made me look at it from a different angle, changing that frustration in the process into entertainment.(Just like being pissed off on a bus that suddenly stopped for 2 hours, but after those two hours you stop being pissed off, and start being entertained by seeing other people in absolute despair constantly checking watches and phones not being able to do anything to get in time where they should've already been for two long hours).Seeing Nic Cage in a good film is a rare and kinda weird thing in 2020. However, seeing Nic Cage not entirely believing that something is wrong when his wife has just been barbecued by pink energy from space that led to her merging with their son who's head is now growing out of her back making sounds that can't possibly mean anything else then \"kill me\", and comforting her that everything is going to be okay while she's slowly transforming into some Cthulhu on their sofa... That's where I draw the line and end this."}, {"rating": "3", "text": "Does the movie look great? Absolutely. Did the cast do a good job? Yup. That isn't why I rate this movie low. I rate it low because it is incredibly predictable and very slow-paced, especially in the first and third acts. Color Out Of Space does everything you expect it to and it never breaks from that predictability.It's the kind of movie that could have been so much better if they had tried to do more to spice things up. Instead, We got a very straight-forward movie that doesn't really warrant watching."}, {"rating": "6", "text": "Reminded me strongly of The Thing from 1982, a little retro.A good mix of suspense, thrill, comedy, mystery and horror. Here and there a few weaknesses in the last third but overall I found it almost too short."}, {"rating": "9", "text": "Rock solid Lovecraftian shocker that manages to update the source material while also maintaining the creep factor famous of the authors work."}, {"rating": "5", "text": "Interesting, first movie of Richard Stanley since being fired from Island of Dr. Moreau 20 years ago.  Nice photography by Steve Annis, who did a great job on I am Mother, that movie was perfect.  Based on a story by H.P. Lovecraft.  Not really a Cage movie, not really a Lovecraft movie."}, {"rating": "9", "text": "Finally a good Lovecraftian movie, im amazed with the adaptation to modern times and the special and pratical effects. Its a must see, if you are a H.P. Lovecraft fan!"}, {"rating": "7", "text": "I pretty good modern adaptation of the classic novella. The visuals are pretty creative and some of the horror is pretty effective. It takes its time, but its never boring. Nic Cage is awesome and most of the other performances are pretty good. There are some pretty dumb moments, and some unintentionally funny moments, but overall a really solid film."}, {"rating": "8", "text": "Great movie with trully mad atmosphere by Lavcfart's style. Cage is the best for role of crazy character, the story was told with more attention to original book and last scenes was awesome and impressive.Also, I think that creators of film have been stingy on computer graphics which could add more effective and scary atmosphere and scenes"}, {"rating": "7", "text": "This movie is an adaptation of the HP Lovecraft cosmic horror story of the same name. It premiered at TIFF last year but had a brief wide release this year. Lovecraft movies are very hit or miss. Aside from the films of Stuart Gordon, like Re-Animator and From Beyond, no one has really succeeded in making a really good one. His stuff is hard to adapt because a lot of it is short, not easy to adapt into a feature. Also, a lot of the imagery in his stories is intentionally impossible to visualize. That, and his stuff has tons of casual racism in it, even for the time it was written. Color Out of Space is one of the better Lovecraft adaptations out there. It updates the story to a modern setting and it adapts one of his least racist stories, like Stuart Gordon did with Re-Animator. However, unlike Re-Animator, I don’t think this movie will be remembered as a classic. The acting isn’t that great, with the exception of a good old crazy performance from Nicolas Cage. The effects are well-done, it’s bloody and intense and of course it’s very colourful, but overall there just isn’t really much that’s memorable or stand-out about it. It’s a solid horror movie, but that’s about it. I hear the director wants to do other Lovecraft adaptations like The Dunwich Horror and I think that’s great. The movie actually kind of sets up a possible Lovecraft cinematic universe that could be worth exploring and I will gladly watch out for, but I still don’t think this movie is the masterpiece that Lovecraft fans have been waiting for. While I don’t think it’s great and I don’t think people will be watching this movie over and over again like Re-Animator, I think this is still worth checking out for horror and sci-fi fans, especially Lovecraft fans."}, {"rating": "7", "text": "Nice to see Nic Cage do a good movie nowdays. Don't get me wrong, he has had a couple enjoyable movies recently. It's just that he's in so many terrible ones too. Can't say I loved this one but I can say it was enjoyable in an eerie/trippy way."}, {"rating": "8", "text": "Other adaptations of the original story are worse. There are deviations from the plot, but beautiful shots."}, {"rating": "8", "text": "its like a sci fi B movie with a budget, and that makes it fun. the visuals are the best part of it"}, {"rating": "0", "text": "I will not risk to watch another movie like that in my life. What a waste of time"}, {"rating": "6", "text": "It's definitely a Lovecraftian horror movie. It's a thrilling, terrifying, oddly hilarious film, and I cannot recommend it to anyone. Nic Cage is ridiculous as usual, this time basically doing a Trump impression as he gnaws his way through the plot. The rest of the cast does well, though the characters are all super one dimensional, the Witchy Daughter, The Stoner Son, The Working Wife (who really needs that internet), and Nic Cage as whatever the heck he wants. Translating the body horror was excellently done, and I hated every second of it, with an excellent blend of practical effects assisted with CGI. You won't look as alpacas the same way."}, {"rating": "5", "text": "****  The implausible behavior of the characters in an extreme situation.  A miserable parody of Annihilation!"}, {"rating": "0", "text": "Disgusting. One of the worst movies I've seen save your valuable time and dont watch it.The acting is bad and the CGi is awful. It seems most of the money went to Nicholas Cage just to bring attention."}, {"rating": "8", "text": "The Curse (1987) meets From Beyond (1986). If you know what that means, you should frantically run to see this movie! If you don't know what that means, you should cautiously walk to see this movie.The star here is the cinematography, atmosphere, and special effects. Some scenes are simply breathtaking. The plot and the characters were more frustrating. It started out sincere and filled with so much possibility. However, there were frustrating moments where characters said/did unbelievable things. And the end is jumbled but spectacular at the same time. Cage was more uneven than usual here. Some of his choices are so jarring. There are a couple scenes in particular in which he channels his inner Donald Trump.. and while it's funny.. it's also distracting and takes you out of the movie."}, {"rating": "0", "text": "I don't believe there is such a thing as \"good gore\". People are too valuable to the be target of grotesque body dismorphia as entertainment."}, {"rating": "8", "text": "This is Annihilation on steroids and reimagined as a wild Nicolas Cage flick. There are so many comparisons one can draw between this and Alex Garland's sophomore outing (as well as the excellent book it's based on) that it honestly feels like a prequel about the arrival of that story's extraterrestrial visitor and what it was like when it first began creating \"Area X.\"Both films carry very similar imagery, offering alien transformations of everyday sights. The difference between Lovecraft and VanderMeer is also subtly communicated in these same visuals however, through the actual appearances of the changes themselves. In Annihilation for example, each mutation that can be found in the environment and its inhabitants has the look and therefore the feeling of nature rising up to reclaim its lost world. Here however, every metamorphosis is something your eyes immediately pick up on as being a deadly perversion brought on by an otherworldly entity. Oh, and the color palette is decidedly more neon as well.Another distinguishing aspect is how the plots approach similar concepts from significantly different perspectives. Rather than following a cast of characters with backgrounds in the various sciences as they witness the strange new surroundings after they have already come into being, Color takes an average family who already weren't the most normal bunch to begin with (we are introduced in the opening to the daughter practicing witchcraft out in the woods) and places them at ground zero where they witness the horrors blossom around them before their very eyes. So instead of watching only the physical forms of each protagonist change or adapt to fit the twisted landscape they willingly venture into, we get to see their minds, bodies, and home warp all at once in a disturbing orgy of the surreal and horrifying that they totally didn't consent to.Yet, for all of its grotesque and stunningly realized body horror there's a tone of playfulness running throughout the whole thing. It's clear that director and co-writer Richard Stanley wants us to laugh and shudder at the things happening to this unfortunate family, which makes some of the more ridiculous elements and Nic Cage's patented freakouts (one or two of which rank among his best) easier to swallow. In fact in regards to the latter, the qualities Cage is so often derided and mocked for are used in an appropriate manner that actually elevates the overall experience and with a knowing wink to the audience that view his schlocky projects solely for them in the process.The only thing that didn't sit well with me about the movie is that I feel it underdelivered on a defining staple of Lovacraftian fiction. That being how knowledge is harmful and that discovering the true nature of reality or coming face-to-face with something that exists outside our perception of it will cause one to lose their mind. Here though the entity seemingly robs everyone of their sanity before they're even aware of its presence at all. I guess I wanted more of a slow descent into madness as the result of an attempt to understand what's going on, rather than a force in the shadows messing with people's heads long before it begins to step into the light.The unasked question at the back of everyone's brain of what it would be like if a Syfy original actually lived up to its potential and managed to be good without entirely ditching the wackiness has finally been answered. Never before have disgust, bizarreness, and nervous amusement come together so delightfully. What's really impressive though is that Nicolas Cage got to step into one of those more out-there roles he seems to love while still being in a piece of quality filmmaking. Low-key, that might be what I celebrate the most."}, {"rating": "2", "text": "C’est inspiré d’une nouvelle de Lovecraft, ce qui implique (hélas) la rengaine bien connue du célèbre écrivain en matière horrifique, à savoir des monstres (ou des choses monstrueuses) mélangées avec tout un tas d’inepties et de bizarreries plus ou moins étranges… et bizarres !Difficile dans ces conditions d’en tirer autre chose qu’un simple film d’horreur souvent foutraque… et forcément très simplet, car dans les nouvelles du père Lovecraft, aucune justification ne vient justifier ou ne tente de justifier quoi que ce soit et encore moins d’expliquer le pourquoi du comment…Si dans une nouvelle, cela peut passer (éventuellement), ce n’est pas le cas sur le grand écran qui a grand besoin d’un effort d’adaptation supplémentaire ! d’autant que ce film qui s’étale sur 1h50 au bas mot… est bien trop long : il aurait fallu virer 20 bonnes minutes, car franchement, ça se traîne assez sévèrement.Notons néanmoins cette ambiance (si bizarre) fort bien rendue et un Nicolas Cage (comme toujours) très convaincant. Sans oublier de jolis effets spéciaux (violets)… mais tout cela reste insuffisant… et surtout beaucoup trop inepte !"}, {"rating": "9", "text": "A perfect return toForm for Nick Cage. The film plays on imagery, framing, and visuals. The plot is great, Taking inspiration from the classics. Well worth your time"}, {"rating": "8", "text": "Richard Stanley director of one of my favorite pieces of genre of all time Hardware returns from his 30 year hiatus with this creepy, fantastical stylized Lovecraft horror fest. Nicholas Cage (National Treasure) gives another uneven performance as a father and husband whom discovers a glowing meteor in his backyard. Soon after it begins to change the enviorment and than those around him in horrific ways. From ghastly mutations to explosions of beautiful pink florescent light. The movie is intriguing, innovative and stylish with a pulsating dread induced atmosphere. The performances are solid from everyone but Cage. Although he has some inspired moments he just doesn't hold back in unnecessary ways as usual. One thing this movie does prove is that Stanley is back and ready to gave the career he deserved.4/5"}, {"rating": "9", "text": "WOW, I was pleasantly surprised.  After seeing the incredibly positive critic reviews I decided to finally give it a watch, and I'm glad I did.  If you love gory horror mixed with some comedy, this is definitely for you.  The gore in this film reminded me a lot of Carpenter's The Thing, because of the assimilation thing going on here.  The practical effects were amazing, just like in The Thing.  Nic Cage was also top notch in this.  He still has it, just like he had it in Mandy!  You've got to have a very bland taste in films to give this a low score.  It was exciting and creepy from start to finish.  Great acting by everyone.  I can't imagine having such boring taste in movies to give this a bad score.  Must watch film."}, {"rating": "3", "text": "Intriguing at first, pure farce by the end - essentially just a poor man's Annihilation, with the doghouse scene from The Thing directly copied in for good measureThere are some early signs of promise; the initial meteorite discovery is entertaining, and a scene where Nic Cage watches himself being interviewed by local news is played for comedy just right - but very quickly you realise that nothing is going to be answered, the story is going nowhere, none of the characters matter or do anything that matters, and every beat is either completely predictable because it's lifted from better movies, or so bat**** nonsensical that even the actors don't seem sure what the movie is doing Nicolas Cage puts in as baffling a performance as you'd expect (complete with a bizarre valley girl affectation when he's supposed to be channelling his abusive father, which ends up being the exact opposite of menacing), the story jumps from one cliched horror trope to the next with no real structure or narrative payoff of any kind, characters make utterly nonsensical decisions (one character inexplicably commits suicide by climbing down a well that they know is where the alien lives, despite being about to escape the farm when the scene begins), none of the dialogue at any point sounds remotely like a human being in conversation, and there's even an ultra-cheap and totally out of place jump-scare just to complete the bingo sheet of lazy horror tropesPredictable and downright laughable garbage past the first 20 minutes; if you're entertained by a bunch of 'spooky' things happening but get confused by story or characters getting in the way of every cliche possible, then this is the movie for you!"}, {"rating": "9", "text": "This movie walks a fine line between over the top and terrifying, and it manages to walk the line flawlessly. The horrifying parts are more disturbing with Nicholas Cage’s overacting, and his overacting feeds the scarier scenes. Plus the effects are superbly done. My biggest complaint  is that there aren’t more Lovecraft movies like it."}, {"rating": "5", "text": "Этот фильм просто полнейшая шиза в сравнении с адекватной книгой Говарда Лавкрафта...  нудный, тупой, убогий... только до середины было нормально, после пошел полный треш."}, {"rating": "8", "text": "Adapting the iconic story of H. P. Lovecraft to the present day has its merits since it sticks to its skin and skeleton. The plot transmits the fear and restlessness of the original text and that is a strong point; if it hadn't gone too far with the psychedelic colors, he would be a bit better."}, {"rating": "7", "text": "Between the awful horror movies that is spewed out these days, This movie actually ranks well over them in quality.Far from Nick Cage´s best performance. But it is visually something to marvel."}, {"rating": "8", "text": "A Good Lovecraftian Cosmic Horror film, where something falls from the stars and causes chaos for a family living in a rural home.  Some creepy scares, gore, and dark humor.It's not as good as The Thing, Dagon, or The Mist.  It's more on par with Reanimator or From Beyond."}, {"rating": "7", "text": "I'm a huge Lovecraft fan I his entire collection, vertigo graphic novel, the films done by Lovecraft Historical Preservation Society. When I heard they where filming an adaption of my favorite Lovecraft story I was exhilarated it was going to be directed by Richard Stanley I was even more so. I was disappointed when it didn't premiere at any theaters in my state I waited till it released on blu-ray a month later. I was shocked that someone mostly translated Lovecraft well more or less on the sliver screen. The film has pacing flaws, crappy cgi, overacting at points (makes logically sense for people going insane) not following the story. This film isn't going to win any awards, it's not going be a film for everyone for Lovecraftian fans this will be a cosmic treat. final verdict 7/10"}, {"rating": "8", "text": "Nicolas Cage has an alpaca farm, colour comes from space (literally) and starts mutating the animals, people and a hydrologist, of all people, tries to help."}, {"rating": "8", "text": "Really really well made film. Went into knowing nothing about it and was completely blown away by the story. Really good acting and Nicholas cage is on fire. Also nice to see good practical effects and animatronics with the monsters, not as good as the Thing but well done none the less."}, {"rating": "6", "text": "I enjoyed this movie because of how disturbing it is, but it was definitely average."}, {"rating": "7", "text": "This movie is a great adaptation of the book. The actors are (in my opinion) really good and let the viewer be fully immersed. Probably due to a limited budget the alpaca monster seems to be a puppet but it is really good and visually impressive. However I found it a lot more convincing than the mom monster that  looks a bit unrealistic to me, probably because it uses CGI. What really stood out to me is how they used color, portraying a color human beings don't know about seems impossible but they somehow pulled it off. The strange shade of purple they used in the movie really conveys this idea of a color put of space. It's not a masterpiece but it's a pretty good adaptation of a Lovecraft book and that's truly impressive."}], "recommendations": ["the_fly", "signs", "us", "sunshine", "the_invisible_man", "a_quiet_place", "the_ritual", "it", "event_horizon", "the_conjuring_the_devil_made_me_do_it", "annabelle_comes_home", "valerian_and_the_city_of_a_thousand_planets", "the_invasion", "annihilation", "a_cure_for_wellness", "a_quiet_place_part_ii", "cube", "coherence", "scary_stories_to_tell_in_the_dark", "it_follows", "the_green_knight", "the_conjuring_2", "ouija_origin_of_evil", "blade_runner_2049", "reminiscence"]}