{"id": 2646, "title": "Colossal", "starring": ["Anne Hathaway", "Jason Sudeikis"], "runtime": 109, "genre": ["Drama", "Fantasy", "Science Fiction"], "description": "A woman discovers that severe catastrophic events are somehow connected to the mental breakdown from which she's suffering.", "releaseYear": "2017", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/4VOyofBd1pexblxtDZYtYIk7NI4.jpg", "categories": {"plot": 5.026315789473684, "acting": 5.5675675675675675, "ending": 7.333333333333333, "soundtrack": 8.0, "cinematography": 5.0, "familyFriendly": 3.0, "funny": 6.111111111111111, "action": 7.75}, "reviews": [{"rating": "10", "text": "I'm actually more surprised than anyone how much I liked this movie. Anne Hathaway plays Gloria, a woman who has a strange connection a monster attacking South Korea. I think because of the original concept mixed in with great acting I found myself completely entranced with this movie."}, {"rating": "9", "text": "A bizarre, rare and weel-acted picture full of mystery, smartness and surprisingly enjoyable thriller sequences. Colossal cannot have any other description."}, {"rating": "9", "text": "Far better than any film with this ridiculous concept has any right to be. A tonally unique exploration of various dark concepts that uses its conceit to masterfully tightrope walk between all of them without losing a bit of levity and humanity."}, {"rating": "8", "text": "I's a pleasant surprise. Original. It's look like a comedy in the beginning but became darker as time runs by. Some clever introspections about addiction and violence in general. Give it a try."}, {"rating": "8", "text": "When you think of a salad of cinematographic genres, there must be an image of 'Colossal', since that's it, I'm impressed by the ability to combine comedy, drama, science fiction, suspense, a little terror and I do not know what other genre to add. Jason Sudeikis is the actor who really surprises, moving away from his comic roles, you manage to convince him that he is a real problem man."}, {"rating": "0", "text": "Trite, overwrought, and frankly poorly thought out worldbuilding. The actors are solid, as expected, but the plot itself is pretentious without saying much at all."}, {"rating": "8", "text": "An original concept carried by strong performances from its leads. The film goes in many different directions and still managed to keep me engaged. Although the script could have used a little bit of tightening up as certain details could have been expanded on a little more and the tonal shifts can be kinda disorienting at times.I can see this film not being for everyone, but I do recommend the film nonetheless at least for its interesting premise."}, {"rating": "7", "text": "An original film that has good performances and a unique premise.  This monster movie that is also a drama.  All the performances are great here especially Jason Sudeikis in a different kind of role for him.  The only downside was the quick tonal shift, besides that this is a strong film. B+"}, {"rating": "7", "text": "If you’ve seen the trailer then Colossal needs no introduction. For those of you who haven’t seen the trailer Ann Hathaway is the slightly annoying, out of work, “let’s party into the early hours of the morning” kind of girl. After hitting a rough patch with her boyfriend she is forced to move back to her hometown. Meanwhile a giant monster randomly appears and starts destroying Seoul and eventually she starts to realise that she is somehow connected to this monster.It’s as bizarre as it sounds but in the current cinema world of remakes, sequels and prequels nothing is more refreshing than some originality. So hats off to everyone involved in creating this unique monster movie with a twist. No it’s not perfect but it did manage to win me over. Although it drags a little in the middle it’s highly enjoyable and wonderfully quirky. What more can I say, there’s really nothing you can compare it to. Definite recommendation, if you get a chance to see Colossal then take it."}, {"rating": "2", "text": "So bad, we walked out halfway through.  Boring, listless tale of the lives of bar patrons is not lifted by giant marionette connection.  Waste of time and money."}, {"rating": "9", "text": "I loved this movie. I'm surprised I didn't read more about what seems to me the obvious symbolism and allergory all through the movie. From the obvious Souel being a metaphor for her soul and the destruction she is causing to all those around her with her alcoholism or lifestyle to the empty house of her childhood. Everywhere I look there is symbolism, metaphors, and allergory that is fun to tease out. It can be almost too obvious such as when Gloria takes a long trip to get too her real Soeul and do what is morally right once she has stopped drinking. Or Sedakis bring out the biggest firecracker ever to blow up everything around him while drinking heavily and confronting his rival. It kept me constantly thinking as I knew everything has deeper meaning but is not fully explained. Love it"}, {"rating": "8", "text": "Anybody who sees the trailer and expects a monster movie is set to be disappointed, which seems to be a constant theme among those disappointed: they expected something different. Whether they expected more of a monster movie or a comedic take on one, Colossal winds up missing the mark on both, simply because it is not necessarily either. Using elements of monster movies and comedy to tell its tale, Colossal is a genre bending film with a character study core as it examines the life of its lead character, her problems, and how she became who she is today. To do this, it does use a monster terrifying Seoul, but it is merely a device through which we learn about our protagonist and the people in her life. Smartly written with top-notch acting all around, Colossal is a surprisingly satisfying film that will make you laugh, but also  terrify, thrill, and entertain you with everything in its arsenal. It is, essentially, the swiss army knife of films. This, naturally, has its limitations, but writer/director Nacho Vigalondo deftly blending everything together into a cohesive and highly rewarding film is a practically miraculous achievement.Colossal tells the story of Gloria (Anne Hathaway). An out-of-work alcoholic, Gloria abuses the trust of boyfriend Tim (Dan Stevens) and makes a mockery of his hospitality in light of her financial status. Tim opts to show her some tough love by kicking her out and breaking up with her. Returning to her small hometown, Gloria pitches her tent in her parents' empty house, which is being rented out at the moment. While there, she runs into old elementary school friend Oscar (Jason Sudeikis) and, while paling around with him and his friends, scores a job as a bartender at the bar owned by Oscar. The only hitch in this newfound success? At 8:05 in South Korea, if Gloria walks through a playground near her home, she will appear as a huge monster and terrorize the people of Seoul. As we quickly learn, Oscar has the same affliction, appearing as a large robot. Becoming a global phenomenon, the film finds great comedy and excitement in the hysteria by showing the internet's reaction to the insanity, as well as the sheer bloody carnage created by Gloria and Oscar without any intent on their part.Yet, these kaijus are merely a gateway into the psyches of Colossal's protagonists. Peering into why both Gloria and Oscar are undeniably broken people, the film borders on becoming a thriller at moments, as well as being a fully-fledged character study. Tracing their current predicament with an event 25 years prior, which was also the first time the monster was seen in Seoul, Colossal shows just how deeply unhappy and self-loathing its characters are. A woman who got fired from her job as a writer and apparently faced some harassment online over it, Gloria feels inadequate and depressed. Fighting to be heard and stand tall as an individual, Gloria feels personally attacked whenever things go wrong or a situation turns sour, in part because she lacks the confidence in herself to really follow through on anything. As a result, she drowns her sorrows in a bottle in order to forget her past and allow her to not be consumed with the crushing weight of being a failure after having so many expectations placed upon her after getting out of her small town.On the other side, Oscar is a much darker character. Deeply disturbed, obsessed with Gloria, and caught in a vicious cycle of self-loathing that sees him exact his self-hatred on the world in order to vent, Oscar is a surprisingly dark and terrifying man. Gloria is taken aback by this, but Colossal quickly establishes just how much he envies her for having achieved so much by simply leaving the town. Pointing to the death of his mother - of whom he has a photo with her face scratched out - as the event that made Oscar turn, Colossal shows how Oscar seems to play Gloria for all of the inadequacy her feels and the sense that he is a complete failure. Lashing out at her and his friends, Oscar runs everybody off purely because of the violent and passionate hate he feels for himself.As a result of this characterization, we see how destructive their personalities and situations are. Though Gloria and Oscar suffer from their own issues, the people most impacted by their problems are those around them. They are greatly destructive people, both literally and figuratively squashing every opportunity, friendship, and relationship, set before them purely because they cannot get out of their own way and are consumed with their self-loathing. If they simply looked down and watched what they were stepping on, they may be able to catch themselves and stop before causing too much damage. However, like a kaiju, they simply stomp about and ruin every life they encounter along the way. A smart usage of kaijus to personify the inner demons of a person and the damage it can cause for those they love and hold dear, Colossal handles the issue in the proper way"}, {"rating": "7", "text": "A party girl unwilling to grow up (Anne Hathaway) is forced to leave her city life and move back to her little home town. She hears shocking news of giant creature threatening the capital of South Korea and comes to a realization that she is somehow connected to this phenomenon.Also starring: Jason Sudeikis, Dan Stevens, Austin Stowell, Tim Blake Nelson.This is one of those few ’weird’ cool movies that deserve to go big. Having premiered in Toronto film festival last September and ready to attack multiplexes now, „Colossal“ offers fresh approach to monster and superhero movies, or maybe we should call it pastiche or something.It’s a surehanded work by a guy who clearly knows and loves those genres, and feels confident about adding some stuff of his own.Solely written and directed by Nacho Vigalondo, the Spanish filmmaker perhaps best known for time-travelling mindbender „Los cronocrímenes“ (2007), it’s an experience so unexpected that I am not even sure how much if liked it.Sure, I liked most of it while watching, and liked some of it even more after going over everything intellectually later. But sitting in cinema, I felt unsatisfied at times without being able to clearly say why.Perhaps I just don’t buy how the story reaches its turning point and transforms one major character – although it makes much more sense in the end.Perhaps „Colossal“ offers too many genres for its own good (monster movie, horror, drama, comedy, thriller, revenge, romance…) and the potential impact of the whole result is weakened by this. Or perhaps it was just all too original for me and I would learn to appreciate it much more on the second go?But there’s one thing that I am sure of: „Colossal“ is bigger than sum of its parts and feels fresh even if it reminds bunch of other movies.Most of all, Shyamalan came to mind although Vigalondo is a better writer with a better sense fo making story compact and still giving the events and characters enough room to develop and breathe.If you only watch one ’weird’ cool mainstream-friendly movie this year, you should still pick „Get Out“, but „Colossal“ is noteworthy too.It can thrill and surprise you, and the acting’s pretty good also. Hathaway as the leading lady actually seems a bit hammy at times, which is probably expected of her character.The showstealer here is, surprisingly, Jason Sudeikis who feels like a supporting player for big part of the movie and then turns into something of a revelation.I have never been ready to appreciate Sudeikis as a worthwhile addition to all the mainstream movie actors today. He is known for a bunch of forgettable comedies such as „Horrible Bosses“. At the same time, he has always felt strong enough performer and comedian in technical sense, good with lines, timing, and teamplay.„Colossal“ gives him an unexpected chance to shine, and he doesn’t waste a single second of spotlight. I can’t speak much about why he’s so great here without giving spoilers about the story. But this kind of strong presence is surely surprising and has instantly made Sudeikis hundred times more interesting as an actor than ever before.Here’s hoping that Vigalondo has Tarantino-like powers to make actors cool. Based on „Colossal“, I’d like to see Sudeikis turn into a star."}, {"rating": "0", "text": "Voici une colossale débilité qui suffirait à peine à faire durer un épisode de \"Big bang theory\" et à laquelle il manque ici les rires enregistrés. Comme -en plus !- ça dure une heure et demi soit grosso merdo 5 épisodes à la suite de \"Big bang theory\" (c'est la sitcom la plus conne qui me soit venue à l'esprit mais il y en a d'autres, le choix est très large...), il est alors inutile de préciser que le visionnage d'un tel étron est une purge colossale.Quant à Anne Hathaway, je ne savais vraiment pas qui c'était, mais là pas besoin de me faire un dessin, je me barre à toute blinde en courant très vite : vision d'horreur confirmée avec sa serpillère sur la tête, ses yeux globuleux de hareng mort, sa grande bouche de clown triste et son gros cul de péniche et ses fripes de clocharde.Les autres abrutis ne sont pas mieux logés avec leurs tronches de vainqueurs qu'on a pas encore sorties de leurs fions, sans parler de la réalisation à deux de tension et des dialogues à se faire péter le caisson, tellement c'est colossalement con."}, {"rating": "7", "text": "What an original movie idea. I think the movie industry is dying because no one is taking creative risks anymore and boy did this one. I thought the movie was surprisingly funny with its very black humor and well acted. The movies concept and idea is pretty bizarre but I had a fun time with it. People should give this one a try but I feel like it's not for everyone."}, {"rating": "8", "text": "Excellent. One of the more original Sci-Fi / Fi/ Thriller movies to come out recently. Handles tonal shifts really well and the acting was really good. Maybe the end and resolution was a bit sudden and left a bit to be desired. But otherwise, really enjoyed it - it's something totally different from what youre used to. If you enjoyed Cloverfield Lane, you'll like this."}, {"rating": "8", "text": "This movie is just so cool. Not every punch finds it's mark but in the end you walk away happy and bruised. Like a fun play fight that in the end maybe went just a little too far..."}, {"rating": "0", "text": "What the hell are the writers thinking and making a movie like that. Aromantic drama with elements of mass destruction ?It's a new way to say a story as a modern philosopher grunt ? is thisthe future story telling we gonna pass to our children ?\" the little red riding hood , stopped the missile from exploding andkilling everybody from nuclear winter ... and then went to her grandma\".Its a Hollywood thing or cultural thing , i just don't get it. How cansomeone merge two complete different stories in a way that doesn't makeany sense and be proud of. Retardation or stupidity ?Trying to comprehend why this movie was made. Cause of the people whoare tuned to a specific category?-- lets go see this new romantic movie.-- i don't see romantic crap , i only watch movies with destruction ,zombies and vampires-- you gonna love this then.My brain was hurt watching it.Some words about the casting:Hathaway : please stop smiling in every movie you make. Travel thestars (interstellar) with no chance to survive or you are responsiblefor the death of a zillion people , makes no difference to you.Probably someone told you that you have a beautiful smile and yoursmiling since then. stop it. bad actor , bad.Sudeikis : The characters you are playing are below 70 IQ. No surprisesthere. Good fit in this movie. You should stay out of it tho.i am sorry."}, {"rating": "4", "text": "I don't like doing it, but this movie get's a 4 based on it's production work alone. That's it. The story, the characters. None of it works.I'm sure that somewhere in this film there were points that were supposed to be funny, and others that were supposed to be terrifying, but honest to god I couldn't tell you what they were. At no point I felt any inciting of laughter or horror. It feels like a genuinely bizarre picture that aims to nail that rare \"horror comedy\" blend but like most movies that attempt this fails at both. Frankly, it feels like both a failure as a monster movie and a small town drama. Strangely enough, not because it tried to mix those genres."}, {"rating": "4", "text": "First impression: This looks like a quirky comedy about a woman (Anne Hathaway) who discovers she's the force behind a giant monster that's terrifying Seoul. Reality: This is indeed a peculiar scenario, but it's never funny and not very good. Comic actor Justin Sudeikis also figures prominently in the story and he doesn't crack one joke. This is a dreary drama about lost love that magnifies the conflict thru giant beasts. The concept is compelling, but the dark, angry attitude and sluggish pace override the quirky appeal. The holes in the logic don't help its case."}, {"rating": "0", "text": "So bad, we walked out halfway through. Boring, listless tale of the lives of bar patrons is not lifted by giant marionette connection. Waste of time and money."}, {"rating": "8", "text": "An inventive, deceptively profound metaphysical fantasy about how our innermost thoughts spring forth into physical existence, offering us a tangible glimpse of true selves -- if only we have the courage to look at it. The film's excellent performances bring the characters to life, enlivening the picture's quirky yet thought-provoking narrative. Despite a handful of somewhat contrived, drawn-out soliloquies and a slight tendency to meander at times, \"Colossal\" succeeds in virtually every other regard, offering audiences one of the most unique viewing experiences to come along in some time."}, {"rating": "5", "text": "It's not a bad movie but I found it not that good..Anne Hathaway was good on her role but she couldn't save the whole movie..Overall the film \"Colossal\" was just not really a genuinely monster film,it was just boring mostly with a dump plot that didn't really make sense.I don't feel that that I wasted 2 hours watching it on the cinema, but I don't recommend this movie, its not worth it to spend your money to see it on cinema.Just rent the dvd/blu-ray instead."}, {"rating": "0", "text": "I continued watching this with the hopes that it would eventually make sense and turn out to be a good movie.I was wrong.The characters all had unrealistic psychotic tendencies that weren't funny or even shocking -- it was just bad. Don't get me wrong, I think the actors made the best out of the crap they were handed, but the awful dialog followed by sudden dark character twists reminded me of watching bad improv comedy that bombs on every attempt at a joke.If you watched the trailer then you saw most of the scenes with the monsters already. The rest is really odd character development that drags on for an uncomfortable amount of time.Don't waste your time on this one."}, {"rating": "5", "text": "Fascinating premise that only got about 10% of the film's time. The rest was boring fluff. Also, though we all love/adore Anne Hathaway she was miscast just to be the sole A-list audience draw, which obviously didn't work anyway with box office take at a pathetic $3M. As fascinating as the premise is, it's not given adequate time for development so viewers probably called BS on it which explains the poor box office. But if you give it some thought, it's kind of pretty awesome. Maybe someone else will take the concept further next time. It rates a 5 just on the strength of its premise."}, {"rating": "6", "text": "What starts out as an unbelievably imaginative allegory for self-destruction and personal strife abruptly veers off-course and becomes a completely different animal from the film's midpoint onward, which is a shame considering how solid of a path the film was going down for its first half. I still give director Nacho Vigalondo props for taking risks in what is ultimately a risky project overall. I just couldn't help feeling like certain creative choices in the film's latter half left me feeling a little cold in the end. Terrific performances from both Hathaway and Sudeikis all throughout, though."}, {"rating": "0", "text": "Wow - just really bad.  I went looking for other bad reviews - and was amazed to find people were giving this movie a pass.  I may never trust Anne Hathaway again - talk about bad career decisions.  Lame - just really really lame."}, {"rating": "7", "text": "seeing the film I understand why much of the plot is kept under wraps. I have to say it is a fairly original film with some rather good acting, and I can say I enjoyed my time with it. One issue that popped out for me though is that as a Sci-fi buff I was leaning towards the monster side of things and unfortunately the movie fails to explain why and how everything is happening. I understand that it also serves as a metaphor about how destructive people can get, but the movie leaves a lot of unanswered questions, questions that the characters should have themselves, like why and how are larger than life events are taking place. All and all I enjoyed my time with it and it is solid."}, {"rating": "8", "text": "A tale of two cities!Did not expect it. It was a unique film. I love such films, because I'm bored of the same old action, romance, horror, thrillers. But it had loads of flaws. It was hard to get rid of them. Even I thought without those flaws, there's no tale to tell. In the end, entertainment matter and this film provided that without logics. So put aside your adult brain and enjoy it like a kid.I had not seen the teaser, trailer and never heard the storyline before trying it. I just went and sat, the initial parts were not that impressive. Because returning the hometown is a common cliché. Though once the story had taken a twist, the rest of the narration changed completely. Well, the story is about the two cities and each city split into a black comedy and a disastrous theme.An unemployed and alcoholic young woman returns hometown after break up with her boyfriend. Befriends an old friend, and starts anew life. Until she discovers that on the other side of the world, a giant monster wrecking up a city. Once again, she discovers that she had something to do with that. Following it, how her response reshapes the entire episode was told with a twist at the end.Anne Hathaway was simply good. But not to forget Jason Sudeikis' part too. Both of them controlled the narration. This is a film to have fun. Not to go after errs. A film with the giant monsters, but less graphics used. Very clever writing by the Spanish filmmaker known for some good titles. I think the film is a little underrated. Recommended for those who seek nothing but an entertainment.8/10"}, {"rating": "6", "text": "I appreciate the concept, the innovation and the work of the actors involved. It definitely is not boring. It´s great that people try new ideas. And this one works. And it must be hard to make it work. So kudos to them. But i personally was not THAT engaged. I´m not easy to please with scores. i was at the verge of giving it a 7 but I cannot. But it is good."}, {"rating": "4", "text": "It is amazing to me how competently made this movie is, considering how absolutely nonsensical the story is.  If any of the characters had acted reasonably or the resolution had felt earned at all, I could recommend this, but, as it is, I can only warn you to avoid this mess.  I give it a D, just don’t bother."}, {"rating": "5", "text": "Colossal is a film that tries to juggle multiple genres. The dramatic elements work quite well and the ocassional humour works also, at times, but for some reason this screenplay is wedged into a 1950's sci-fi culturally insensitive monster movie - but dont be fooled it is in fact still a dramady.... or is it? Its so unsure of itself you will be led down a path of feeling like they should have cut the scifi out or rewrote the script because it just fails in all three genres by lacking detail and sensibility to the material from which it fails to correctly reference."}, {"rating": "0", "text": "Mala, mala, mala. Es una basura condecorada. Una cagada en estado liquido. He perdido casi 2 horas de mi valiosa vida. Es mal."}, {"rating": "9", "text": "This movie delivers far more than its premise would lead you to believe. Give it a shot, especially since it's on Hulu while I'm writing this."}, {"rating": "8", "text": "A friend of mine texted me earlier this week- \"OMG, you gotta see Colossal. Two words. Jason. Sudeikis\". And as much as I try to sell my brand as \"young trendsetter with plenty of friends and things to do\", that is pretty much all the sway I need to get into a theater. Who am I kidding, I have nothing else to do.I love going into a movie with no background info. Unfortunately, since I go to the movies so much, this is a rare luxury, as I am normally inundated with trailers. I managed not to see one for Colossal. I did accidentally catch Anne Hathaway on the Tonight Show calling this \"a movie about a girl who gets drunk and then a monster terrorizes South Korea\" but I think I just blacked this out since it is such a ridiculous thing to say. But that is pretty much the premise.Anne Hathaway plays Gloria, an alcoholic who moves home during a tough time and falls into friendship with a group of guys who work/hang out at a bar. During this time at home, she realizes that when she walks through a playground in the early morning, a large monster materializes in a linked location in Seoul, South Korea.Instead of spoilers, I am just going to use this time to say that I love that Jason Sudeikis took this role, and he was awesome in this. If he was only in weird indie comedies for the rest of his life, I would see them all. He is so funny and sincere and strangely menacing. I just need to try to separate him from Bill Hader's impression of him, which is pretty spot on. Jason would get a 10, but the movie gets a 8/10."}, {"rating": "8", "text": "Colossal is a good film. It's a bit of a cross over between an indie film and an Hollywood movie. The story is excellent. In a sens it is center around the allegory that we have a monster inside of us. What we choose to do with it, has consequences from childhood to adulthood. The FX are simple but efficient for what it needs to do. The soundtrack of Bear McCreary is a strong point of the movie. The actors are absolutely amazing. Some might not like that the film is focused on the personal drama, then the fantasy aspect. And you will not find and action flick here. I give it a 78%. I didn't expect a monster or action movie, and I found a good acting drama with some fantasy elements. Nice movie."}, {"rating": "7", "text": "Aki elolvassa a tartalmát a filmnek, az biztosan, hogy nem erre számít. Ha szeretitek a filmben szereplő színészeket, akkor nézzétek meg. Nagyon vegyes a kritika és sokaknak nem tetszett. Nekünk igen."}, {"rating": "7", "text": "i'm not coming back..ColossalThe amusement doesn't wear off as Nacho won't let it for he too is aware of its tricky concept where Colossal takes its time to digest in and when it does its edgy characters won't let you off the seat."}, {"rating": "7", "text": "If you can, try to go into this movie with as little information possible.  You probably already know the basic premise, but there are some really interesting plot turns that are really amazing if you don't know they're coming."}, {"rating": "5", "text": "If you're not Jonesing for a Pabst Blue Ribbon (the advertising is about as prominent as the monster), after viewing this mishmash, you have tremendous will power. If someone can explain the actions or non-actions of Joel, please do. Something to do with Oscar's failed almost marriage? Interesting concept but it fails to materialize into much of anything with underdeveloped characters and several head-scratching scenes(f ire spreads, right?)."}, {"rating": "8", "text": "Honestly one of the most surprising films that I've seen in sometime... it was brilliant & completely original. Never saw it coming & that was quite refreshing."}, {"rating": "8", "text": "This is a very quirky film. Its categorised as a comedy drama fantasy film but I wouldn't really say there's much comedy in it - its more a drama, with a fantasy angle to it. Its not a fantasy film like, say, Labyrinth or something like that. Its a bit hard to categorise I guess but in any case, it features some pretty decent CGI effects and the plot was so quirky that it certainly kept me intrigued throughout. I thought Anne Hathaway gave a pretty decent performance.I'd say this is a film about denial and the impact that can have on others. Its hard to comment too much on it without giving obvious spoilers. Its a pretty memorable film I reckon, one of those kind of films that may leave you wondering about and analysing some aspects of it. I wouldn't say its exactly an awe-inspiring or excellent film as such but its certainly worth a watch regardless and so yes, I'd recommend it."}], "recommendations": ["downsizing", "nerve", "chaos_walking", "what_happened_to_monday", "annabelle_comes_home", "lucy", "the_adjustment_bureau", "vivarium", "limitless", "brimstone", "cold_pursuit", "us", "ready_or_not", "chappie", "annihilation", "predestination", "code_8", "repo_men", "contagion", "split", "freaks", "the_butterfly_effect", "ant_man_and_the_wasp_quantumania", "love_and_monsters", "brightburn"]}