{
  "id": 4123,
  "title": "Come Play",
  "starring": [
    "Gillian Jacobs",
    "John Gallagher Jr."
  ],
  "runtime": 96,
  "genre": [
    "Horror"
  ],
  "description": "A lonely young boy feels different from everyone else. Desperate for a friend, he seeks solace and refuge in his ever-present cell phone and tablet. When a mysterious creature uses the boy’s devices against him to break into our world, his parents must fight to save their son from the monster beyond the screen.",
  "releaseYear": "2020",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/9jy9OzZi0Oy8Hdv603QWujbfCwx.jpg",
  "categories": {
    "plot": 7.0,
    "acting": 6.3125,
    "ending": 6.222222222222222,
    "soundtrack": 5.0,
    "cinematography": 8.0,
    "familyFriendly": 6.0,
    "funny": 5.0,
    "action": 8.0
  },
  "reviews": [
    {
      "rating": "8",
      "text": "A wonderful allegory for the dangers our current technological age can possess to the strange and discarded. The parents of a young, lonely autistic boy have their lives turned upside down when a mysterious creature living in the world behind the screens of our tablets and cellphones (acting as an obvious metaphor for pedophiles) begins to pursue their son with the intentions of making him its \"friend.\" Something that only begins to appeal to the child because he doesn't have any.The idea of most of the frights being viewed through the lens of an iPad camera is admittedly a pretty goofy one. Yet, the ways Come Play makes creative use of our always online, app-centric culture ensures that its jolts and jostles are consistently exciting, if not terribly scary. Then there's the monster itself to consider, which is freakishly designed in appearance and shows hints of some particularly compelling attributes that could be expanded upon in a sequel.The aspect I think most viewers will potentially take the biggest issue with will be in the film's representation of someone with ASD. It is a quality of the character that seems to have only been included to make the kid difficult to deal with. However, even if it was meant for nothing more than to service the plot by making certain interactions more believable it is at least effective in that regard. A big problem this genre typically runs into in movie form is that the actions of those onscreen can often come off as nonsensical to the audience even if the writer(s) had a good reason for them that was simply poorly communicated. Here though the presence of this condition allows for a constant sense of context or reasoning behind certain behaviors that would otherwise be questionable. So there's never a moment where you're forced to engage your suspension of disbelief.While far from the nightmare fuel I was hoping for, there were enough thrills and a surprisingly emotional ending to make this the type of fun, feel-good horror I can appreciate regardless. It's centered around an original, interesting, and well executed concept that allow it to stand out from the crowd and give it a unique way to portray its themes. Overall creating a solid case for why this is worthy of being one of your next watches."
    },
    {
      "rating": "5",
      "text": "What seems like a sure fire scare fest is let down by amateur execution. It's a mix of bad performances and somewhat embarrassing cgi. It does however manage a few effective shocks. In this case it's quite frustrating because all of the pieces are there, they just never connect in a satisfying, unexpected way. What's left is an overly mediocre blend of Lights out, Mama and the Babadook that never really finds an identity of its own."
    },
    {
      "rating": "5",
      "text": "Some really clever and creepy imagery (like the Snapchat filter picking up the face of an invisible demon), but just comes off like a 20-minute short awkwardly stretched into a feature length film"
    },
    {
      "rating": "3",
      "text": "This movie had an interesting premise, but save for one segment near the end and the end itself, it's a laundry list of horror movie cliches done in a predictable and often times forced manner. It's hard to hate this movie, but it's also hard to say much good about it. I like the fact that the main character has autism that actually plays a part in his character development, I like the resolution between him and his bully  (even though this is the 1000th movie we've seen where the kids have to have a bully) and I like the ending. But on the other hand this movie makes me want to bang my head on a wall with it's hamfistedly contrived plot points and collection of tiring tropes. Kid with no friends? Check. Bullies picking on kid? Check. Parents fighting? Check. Parent(s) so hopeless out of touch with any form of brain power that they further drive their lonely child away by blaming them in extremely contrived circumstances? Checkaroony.By the time you reach the ending, it feels almost undeserved , as the emotional build up is often just boring. And the ending has been done before much better years ago, by movies like Dark Water and the like. So even the best part of the movie isn't even original."
    },
    {
      "rating": "7",
      "text": "While the movie is definitely derivative (i.e. \"The Babadook\" on a phone), the acting is above average, the creature effects are not bad, and there are a few cleverly done creepy scenes using the device's camera. I'm not sure why they made Oliver an autistic pre-teen, but actor Azhy Robertson makes it believable. And is it just me, or is anybody else sick and tired of \"school yard bullies harassing the child lead\" trope?!? In the film's climax, there is a scene that took my by surprise in a good way (I've seen it all so I give any film kudos if it can pull that off). That actually had me take another look at the movie and I liked it more."
    },
    {
      "rating": "4",
      "text": "When your structure is based on jump scares and they're unable to create an atmosphere of fear, it's more than evident that you have nothing.And in horror, that cripples you instantly."
    },
    {
      "rating": "9",
      "text": "Eerie, creepy and suspenseful with an ending that will melt the blackest heartIt's rare that a movie blows me away and sticks with me for hours after I've finished watching it, but that's exactly what Come Play did to me. Right from the beginning, the eerie vibe starts and it doesn't let up.I have a tendency to get deeply involved with movies of this nature, outcast child struggling through a broken home and difficulty in school. Yes, it's because I can completely identify, so it makes these films more effective and personal. In this case, Oliver is an autistic child who uses smart phones and iPads to communicate. But when an e-book titled Misunderstood Monsters appears out of nowhere, the story begins to unfold.Misunderstood Monsters is about Larry, a lonely creature just looking for a friend to protect. But it's not as simple as that, Larry is not the kind of friend you want. He taunts, torments and injures as he tries to gain enough strength to \"take\" his chosen new friend, in this case Oliver.The amount of tension is constant because Larry is persistent, and the moments of peace are very brief. Eventually, mom and dad put their differences aside as each becomes aware of Larry and his intentions, and their attempts to stop Larry become a lot more challenging than just destroying the devices of communication in the immediate vicinity.The basic story of the parents is that mom is the primary caregiver who struggles to help her child gain the ability of speech and have some sort of social interactions with others. Dad is the fun one who distances himself from the serious aspects of caring for a child with limitations, and prefers to be the lighthearted and fun parent, despite the inequality in responsibilities. Further interpersonal plots twists are one of Oliver's school bullies was once his best friend but that ended in a misguided effort by mom to protect her son from scrutiny. Larry plays on all of this in an effort to convince Oliver to take his hand and be his 'friend'.And like the best movies of this nature, the ending is very bittersweet. You realize the steps mom is willing to go to protect her son, to the point that Oliver actually understands. It's a real heart tugging finale and it has choked me up both times (so far) that I've watched the movie, and that's not an easy thing to do.This is a classic film in that you understand the director likely had aspects of Oliver's upbringing in his own childhood, and that's what gives it a very penetrating authentic feel. It's smart and scary, sweet and sad, and ultimately very effective for those who can connect with the subject matter rather than just expecting a silly knife wielding psycho looking for his next teenage victim to off.An extra mention to the child actor playing the lead role. He did an outstanding job! Right away, your heart goes out to him. He portrays a shy timidness with the innocence of a child that makes you just want to protect and comfort him. His looks and mannerisms playing such a challenging role at his age are to be commended because nothing about it seemed silly or fake. He kind of reminded me of Danny from The Shining but even more engaging.There are a number of messages in the movie, one of which is how technology has crippled human interaction and responsibility. All you need to do is look at how many millennial females cannot seem to drive a car without a phone in their hand and you completely understand.Come Play became an instant classic for me. I was never bored and was on the edge of my seat the majority of the movie. The ending that left me sitting there in the dark feeling a bit emotional helped solidify it as a new favorite. Very well done and highly recommended."
    },
    {
      "rating": "4",
      "text": "Inspired by the babadook,the trailer and rotten tomato score was pretty high for this movie.Watching this movie with any expectation is gonna frustrate anyone.Some shots are good visually and the kid actor does decent job. Background score and some of the acting is uneven at times.Creature design is passable, have shades of poltergeist too. Keep your expectation low and this is a one time watchable."
    },
    {
      "rating": "6",
      "text": "Autistic boy reads a Babadook-esque book on his  phone and the monster in it won't go away until he makes a friend but, his mother will do."
    },
    {
      "rating": "5",
      "text": "One of the better horror movies of 2020 and it's even family friendly to. It's a much watch if you like mystery and thriller horror. I have this an easy five even tho the actors aren't big names"
    },
    {
      "rating": "9",
      "text": "As someone with ASD seeing the way Oliver was portrayed was excellent. He's hyper focused on Spongebob just like I once was and said focus is very accurate to people with ASD. We latch onto things we understand and make us happy. His difficulties with the world are ones I resonate with and it was pleasing to see representation especially in a genre I love so much. People complain it's not \"scary\" but that's because they fail to open their minds to the psychological aspect and just want cheap tactics like gore and jump scares. Larry to me, is an embodiment of many fears I've had. To never fit in, find friends or be perceived as someone worthwhile. The mother's fears of losing her child that she's loved so much and been there for every stage in his life is a great representation of a caring parent. Her reactions show the true terror she feels at the notion of losing Oliver forever.The father is also characterized well as caring yet not always getting it although he does his best as another loving parent to Oliver. He's just as willing to protect his son despite Larry seeming to be unstoppable.Larry's visuals are absolutely sickening. So emaciated and pale, with sunken eyes that look crudely carved while all his bones stick out from his frame, almost like his skin is pulled tight over his body. It's exactly how a character of his nature should look and make you feel while looking at him. The fact he reaches us through electronics is petrifying for me as someone who uses such devices to communicate at times and for comfort.This movie, unlike those with jump scares and intestines all over the floor has rewatch value because I guarantee there will be more to see after coming to understandings about certain aspects."
    }
  ],
  "recommendations": [
    "eden_lake",
    "case_39",
    "vivarium",
    "a_monster_calls",
    "colossal",
    "knock_at_the_cabin",
    "orphan",
    "i_kill_giants",
    "annabelle_creation",
    "little_monsters",
    "the_hunt",
    "the_killing_of_a_sacred_deer",
    "a_quiet_place",
    "smallfoot",
    "nightbooks",
    "annabelle_comes_home",
    "mama",
    "brightburn",
    "the_rite",
    "nerve",
    "swiss_army_man",
    "promising_young_woman",
    "oculus",
    "the_invisible_man",
    "the_road"
  ]
}