{
  "id": 2545,
  "title": "Come True",
  "starring": [
    "Julia Sarah Stone",
    "Landon Liboiron"
  ],
  "runtime": 105,
  "genre": [
    "Science Fiction",
    "Horror"
  ],
  "description": "Looking for an escape from her recurring nightmares, 18-year-old Sarah submits to a university sleep study, but soon realizes she's become the conduit to a frightening new discovery.",
  "releaseYear": "2020",
  "mpaaRating": null,
  "imageUrl": "https://image.tmdb.org/t/p/w500/hGPGRRz6FTIRed1zestdWrV2Iwd.jpg",
  "categories": {
    "plot": 5.25,
    "acting": 5.8,
    "ending": 5.6,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 5.0,
    "funny": 9.0,
    "action": 1.0
  },
  "reviews": [
    {
      "rating": "1",
      "text": "A young woman (Julia Sarah Stone) is haunted by an evil specter in her dreams.  She enters a somewhat sketchy sleep study that examines the nightmares of its participants. NOTHING about this film is even remotely scary. The dreamscapes are obviously CGI and there’s nothing threatening about them. Even as the plot develops, the inconsistencies and lack of thought plagues its credibility. The only thing even remotely intense is the overbearing soundtrack. While it’s trying to achieve slow burn suspense, this poorly conceived film is simply dumb and tedious."
    },
    {
      "rating": "6",
      "text": "I'm a fervent believer that the journey is more important than the destination, although sometimes the destination can be very disappointing.Come True plays with that, and while I wouldn't label it as a disappointment, unfortunately its outcome is not up to what it was building.Its tone is unsettling, although the narrative it's a bit messy. Nonetheless, it's sufficiently plot complex to keep you interested.Maybe it ends up feeling more basic than it did at first instance, but I've seen movies that have tried something similar in tone and style and failed miserably, whereas I think Come True fares better."
    },
    {
      "rating": "4",
      "text": "I wanted to like this because of Julia Sarah Stone; I think she was perfect for the part. She always looked like she just woke up, lol. Still, it was engaging enough, but not enough to make it a good movie. Sure there's a twist, but by the time we get there, we don't care. The dreams themselves needed to be far more fleshed out for me. What and why is the shadow? It was definitely atmospheric, but certainly needed room to breathe."
    },
    {
      "rating": "10",
      "text": "Absolutely unique gem of a sci-fi horror film. Blends so many elements into a masterful expression, with intelligent design behind it."
    },
    {
      "rating": "6",
      "text": "If I don't expect this film to be a horror movie, it wasn't that bad.  Weak for horror, but like a normal film it wasn't bad and the ending of the film we quite liked had the right atmosphere and the resolution of the story wasn't bad at all.  It's a pity that the interesting thing came from the film only in the last 30 minutes before the end."
    },
    {
      "rating": "9",
      "text": "Creepy, entertaining stuff with some twists and turns thrown in for good measure! Parts of the story may not be to everyone's liking but, i for one, loved this."
    },
    {
      "rating": "5",
      "text": "Come True is a psychological thriller that is almost so close to being good that it's honestly painful of how mediocre and messy it is overall.First the positives, the soundtrack by Electric Youth is stellar, and fits the movie's tone quite well with it's melancholy synth melodies. Seriously, it elevates this film a lot in creating the lucid dream state that the movie is trying to go for. The second positive aspect is the film's dream sequences, which are honestly the only good part of the visual storytelling. They're creative, creepy, and look like they were taken right out of Silent Hill 2 (the video game). I truly do love these sequences as they have so many cool and eerie visuals to dissect, but unfortunately this is the only time the film really is effective with its horror. These two positives are really strong, and they are the sole reason why I don't completely write this move off as poorly made. With the film's short length, I'd honestly recommend a viewing of it just for these two aspects alone.Unfortunately, the entire product as a whole doesn't hold itself to the level of quality that the music and dream sequences have. The actors are alright, nothing really stood out, but nothing awful either, just middling overall. The same goes with the dialogue, nothing memorable at all, but also it was decent enough that it didn't sound clunky or poorly written; strictly meh. What was poorly written though was the story, and full warning, I will be spoiling the entire plot from here on, so if you want to see this film, stop reading now. So the story has a really strong start and interesting concept. Sarah is a runaway who spends her nights sleeping at a playground because she doesn't want to return home, but due to this she's getting terrible sleep, affecting her schoolwork. She learns about a lab that does paid sleep studies, and she takes them up on their offer, thinking she'll get better sleep and money from it. Each time she does though, she keeps having nightmares that gradually get worse and worse up to the point where she's getting hurt from them. This idea doesn't sound bad on paper, and with the greatly executed dream sequences it could have been, but the creators seem like they were confused about what they wanted the plot to be.There are a total of two twists in the movie, both conflicting heavily and the second of the two not even being effectively shown or played up at all in the rest of the movie. Twist one is that threatening shadow people are the reason for the nightmares, and they are trying to escape to reality in order to do... something. This plot doesn't matter however, because twist two, our main character being in a coma for 21 years (yes, really) completely nullifies the first plot. Not only is it a lazy trope, but it isn't used at all until sort of the end of the movie. Basically, the whole movie is in Sarah's head, hence why she still thinks she's still in high school instead of a 30 something woman. They never use this idea in any interesting way though, usually dreams/comas, even if they are lucid, are not portrayed how they are in this movie. Even if you completely control the dream, (which Sarah clearly doesn't) details overall are foggy and if you try and focus on an object multiple times it will change in various ways just because that's how your brain works. This doesn't happen though, the movie feels like it's entirely in reality until like, the last half hour. For those who've seen it, they can tell you as well that there's no point in this movie where you can go \"oh yeah Sarah went into a coma at THIS point\", making the only conclusion that the whole thing is a dream. The reason that this matters is because her coma dream suddenly falls into chaos at the end, which again, isn't how dreams work.As if that wasn't bad enough, the movie has an awkward sex scene (because of course it does), where Sarah (a high schooler) **** a scientist in his late 20s. Yes, she is 18, (in the dream anyways) but the scene literally comes out of nowhere between two characters who have no loving connection together. The scientist was stalking Sarah for a good chunk of the film, and she was visibly uncomfortable being around him. It's so pointless and weird, and it's at this point where the movie gets really bizarre with a bunch of imagery and events that ultimately mean nothing, because again, she's just in a coma.If they had just stuck to one plot, this could have been a really good movie and I would be singing it's praises as an underrated thriller/horror movie. Unfortunately it isn't, it's just average. The good parts are really good, but the bad parts are so utterly terrible that it averages out to be a confusing meh. I would still recommend seeing it strictly for the good aspects, just don't expect to see a mind bender or a David Lynch level of stellar writing and character commentary."
    },
    {
      "rating": "9",
      "text": "Another surrealist classic that hasn't been seen before. Uniquely good, solid story, great acting by the lead actress, and great atmosphere. This film deserves way more attention and praise. If you can actually appreciate a well-crafted film and not try to watch another boring Marvel film or another Jurassic Park and Transformers film, then maybe we'd happy art/surrealist films being produced."
    }
  ],
  "recommendations": [
    "the_haunting_in_connecticut_2_ghosts_of_georgia",
    "signs",
    "the_invisible_man",
    "eli",
    "summer_of_84",
    "old",
    "cube",
    "the_mist",
    "a_cure_for_wellness",
    "color_out_of_space",
    "terminal",
    "the_green_knight",
    "antlers",
    "the_maze_runner",
    "the_lodge",
    "the_ritual",
    "gothika",
    "inception",
    "what_happened_to_monday",
    "death_note_relight_1_visions_of_a_god",
    "reminiscence",
    "coherence",
    "the_conjuring_the_devil_made_me_do_it",
    "bad_times_at_the_el_royale",
    "brimstone"
  ]
}