{
  "id": 2262,
  "title": "Coming to America",
  "starring": [
    "Eddie Murphy",
    "Arsenio Hall"
  ],
  "runtime": 117,
  "genre": [
    "Comedy",
    "Romance"
  ],
  "description": "An African prince decides it’s time for him to find a princess... and his mission leads him and his most loyal friend to Queens, New York. In disguise as an impoverished immigrant, the pampered prince quickly finds himself a new job, new friends, new digs, new enemies and lots of trouble.",
  "releaseYear": "1988",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/djRAvxyvvN2yqlJKDbT3uy4vOBw.jpg",
  "categories": {
    "plot": 8.4375,
    "acting": 8.583333333333334,
    "ending": 8.666666666666666,
    "soundtrack": 9.25,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 8.153846153846153,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "10",
      "text": "The critics are wrong, this movie was GREAT. So many classic lines and absolutely hilarious, Eddie Murphy's best."
    },
    {
      "rating": "8",
      "text": "The movie's story isn't that original, but Eddie Murphy delivers a good job and the most jokes are quite funny."
    },
    {
      "rating": "10",
      "text": "Eddie Murphy at his best. This my all-time favorite movie. I have maybe watched this film over 100 time, and at one point I knew all the lines word for word. Arsenio Hall, and James Earl Jones serves as great supporting character in this classic coming of age movie."
    },
    {
      "rating": "8",
      "text": "One of the better comedies to come out of the 80s, it is a bit crude due to its age but the characters are simply unforgettable from the stars to the supporting cast. When you can remember supporting characters clearly, you know that a movie did something right though it does not hurt to have people like James Earl Jones playing a comedic supporting cast in your movie. From the slutty sister, to the yukky hair family and the barbers, all the characters made an impact despite very limited screen time. This is very hard to do in a 2 hour movie and although its cheesy, I actually thought that the love interest is believable making the movie better than one might expect. In my opinion, this movie is probably Eddie Murphy's best comedic performance. Hint, you should watch this movie after Trading Places since it makes a funny reference to the other movie."
    },
    {
      "rating": "0",
      "text": "Bad Bad Bad Bad Bad Bad Bad Bad    Bad Bad Bad Bad Bad Bad Bad Bad    Bad Bad Bad Bad Bad Bad Bad Bad    Bad Bad Bad Bad Bad Bad Bad Bad    Bad Bad Bad Bad Bad Bad Bad Bad    Bad Bad Bad Bad Bad Bad Bad Bad    Bad Bad Bad Bad Bad Bad Bad Bad"
    },
    {
      "rating": "7",
      "text": "Hilarious. Easily my favorite Eddie Murphy of the 80's. The vast majority of the jokes work out pretty well as this one is enjoyable from beginning to end. Not sure how the critics did not love this one or how they can call this a romantic comedy. Yes, there is a romantic element, but it doesn't make it a romantic comedy. Really funny movie right here."
    },
    {
      "rating": "8",
      "text": "A decent 80's Comedy that has taken me a while to see and I'm not sure why as I do love a good Eddie Murphy flick. He's had better but its nice to see some of his earlier work. It has some good laughs thanks to Eddie & Arsenio Hall mostly but the cast as a whole were very funny. Story is a little predictable but still quite funny and it showed what was to come for characters like The Klumps that Eddie would play in the future. Overall a good film and a must-see for Eddie fans!"
    },
    {
      "rating": "9",
      "text": "Definitively a good movies. Especially the humour is top. The story is also interesting, but simple and the moral of the story is so political correct. Acting was top."
    },
    {
      "rating": "9",
      "text": "Except „Beverly Hills Cop“ this is Eddie Murphy's most cherished movie for a lot of people. It is listed as romantic comedy but I view it more as modern fairy tale. The story is about crown prince Akeem Joffer from the (fictional) African country of Zamunda which is an absolute monarchy. He is going to be crowned on his 21 birthday but is weary / unsatisfied /bored of his life in his golden cage. Luckily his father understands this and so Akeem travels to New York (in disguise) with his friend / aide / servant Semmi. I stop here to avoid spoilers but say the word “Culture Shock” is an understatement. I truly enjoy the story. It is a nice comedy, good love story, culture shock, a bit satire and much self discovery aka character growth. The elements are timeless and it works as much today as back then. The cast improves the movie a lot. Eddie Murphy is amazingly good but the other actors also deliver a great performance. I want to especially praise James Earl Jones, Shari Headly and especially Arsenio Hall. Also the rest of the cast is good and director John Landis is always a bonus.  The humor is spot on and makes the movie really entertaining. Overall I recommend it as cult classic and give a 9/10."
    },
    {
      "rating": "6",
      "text": "Coming to America easily kills the playground of laughter by actually a few minutes of laughter and then silence just randomly pops out of nowhere from all the laughing. This 'comedy' needs a little bit of improving, but works great as just a plain movie."
    },
    {
      "rating": "7",
      "text": "One of the iconic comedies that put Eddie Murphy in the spotlight. The plot has the humor that characterizes it and has conquered a certain audience, not in vain. I don't know if it would have been a little better if not for his mania of monopolizing the screen with multiple roles."
    },
    {
      "rating": "10",
      "text": "One of my top old movies i have attached over and over. never boring so hilarious always making my days.A very nice comedy & romantic movie."
    },
    {
      "rating": "8",
      "text": "It feels as if the filmmakers behind this movie followed the term \"Rom-Com\" as literally as possible, only switching the two parts of the acronym together! The first, and better, half of the movie is pure comedy. It's admittedly a bit stretched—considering it serves as a build up for what's to come— and has a couple of jokes that just didn't land. But there's no denying it's the part that garnered the movie a hint of originality to it as well as a dash of heart-warming moments that proved later on how potent—and even essential—they are.Much of the humour emerges from the fish-out-of-water interaction between Prince Akeem and the New Yorkers. So on the surface using that comedic trope in that particular context would make the jokes unbearably clichéd—well, yes and no. Yes because they are clichéd for the most part. No because they ultimately come off as surprisingly refreshing. That was in part due to Landis's decision to make Akeem, as well as his friend Semmi, stick to their character \"regal\" roots as firmly and seriously as the comedic nature of the story, and the comic charm of the duo, would allow. It's Eddie Murphy who's also responsible for rendering the humour effective, as he was in full control and command of his star power.The second part is where the movie became almost entirely \"romance\" film. Granted, the transition between \"comedy\" to \"romance\" was quite smooth so much so you barely notice, so it's just a matter of lack of consistency as we look at the whole picture. The real problem lies in the fact the movie totally succumbed to the archetype story it tells and followed it by numbers. As a result, I was able to see how it's going to end miles away. The fact that I was invested in every single character and immersed in the goings-on is what compensated a great deal for the story's predictability, and kept the movie afloat for me. I can gladly say that I'm excited an curious to see how the sequel is going to turn out.(8/10)"
    },
    {
      "rating": "9",
      "text": "What a Classic entertaininer, The late 80s vibe of american music and life with the streets and lifestyle and the royal lifestyle mixing with it its just awesome, The music was catchy specially the intro's tribe music was amazing, The story was simple and sweet and the acting was great, The humour was just brilliant the way royal tropes are showcased with it the patriarchy thing was dark and funny, The starting intro the prince entry the pen** is cleaned scene \"I lost there\" then the royal meet and the duo's quest for searching queen at queens, the taxi driver \"F** u\" and the reply later the whole neighbourhood's reaction to both rich dudes and there stealing stuff and the house stuff was just amazing set-up then the barbers intro that dudes were just chillingly awesome and funny, The mcdonalds stuff was good and the duo living life as poor the prince's intension for love the whole ups and down's at work, The robbery scene with samuel jackson was brief but awesome and the royal entry at poor house the ending with misunderstanding and the train chase and at last the approval for marriage it was a great and satisfying end for a sweet and entertaining movie, It's a funny classic and a great movie"
    },
    {
      "rating": "10",
      "text": "One of the best comedy/dramas of the late 80’s! An all black cast made an instant classic!"
    },
    {
      "rating": "7",
      "text": "I didn't enjoy it as much as expected, but 'Coming to America' is nevertheless still good.Eddie Murphy is unsurprisingly the star of the film. Any notable scenes include him, which isn't a shock given the obvious and the fact he plays a number of characters; on that note, only Akeem amused me - the barber shop guys... not so much, to be honest.James Earl Jones (Jaffe), John Amos (Cleo) and Frankie Faison (landlord) are the most noteworthy in terms of those away from the lead, while there is even an appearance from someone named Samuel L. Jackson - what ever happened to that guy?!I wanted/anticipated much stronger humour, if only due to Murphy's presence. I can't say I laughed that much, which is disappointing. The romance parts are probably more memorable to me, even if it's kinda familiar in those regards. With all that said, I can see why loads thoroughly enjoy this - it just didn't fully land on me, personally.Still worth viewing and I'm very much up to see the sequel."
    },
    {
      "rating": "9",
      "text": "Still funny as it was in 1988, They don't make comedy movies like this anymore. The story and acting is great."
    },
    {
      "rating": "10",
      "text": "Coming to America is one of the best movies ever made. Several scenes defined pop culture and the soundtrack was amazing. Gave a positive image of Africa as well at a time when this was difficult to do."
    },
    {
      "rating": "9",
      "text": "Coming to America still stands as one of the best American comedies ever made. Eddie Murphy is flawless in his portrayal of the good-hearted African prince who comes to the USA to find love while living as an ordinary person. The supporting cast are excellent too,  particularly Arsenio Hall."
    }
  ],
  "recommendations": [
    "forgetting_sarah_marshall",
    "meet_the_parents",
    "pitch_perfect_2",
    "zack_and_miri_make_a_porno",
    "the_longest_yard",
    "role_models",
    "get_smart",
    "zoolander",
    "friends_with_benefits",
    "the_wedding_ringer",
    "horrible_bosses",
    "50_first_dates",
    "dodgeball_a_true_underdog_story",
    "the_break_up",
    "central_intelligence",
    "johnny_english_reborn",
    "a_bad_moms_christmas",
    "masterminds",
    "tower_heist",
    "this_means_war",
    "horrible_bosses_2",
    "pitch_perfect",
    "delivery_man",
    "thunder_force",
    "the_other_guys"
  ]
}