{
  "id": 567,
  "title": "Coming 2 America",
  "starring": [
    "Eddie Murphy",
    "Arsenio Hall"
  ],
  "runtime": 110,
  "genre": [
    "Comedy"
  ],
  "description": "Prince Akeem Joffer is set to become King of Zamunda when he discovers he has a son he never knew about in America – a street savvy Queens native named Lavelle. Honoring his royal father's dying wish to groom this son as the crown prince, Akeem and Semmi set off to America once again.",
  "releaseYear": "2021",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/nWBPLkqNApY5pgrJFMiI9joSI30.jpg",
  "categories": {
    "plot": 3.5925925925925926,
    "acting": 3.588235294117647,
    "ending": 4.0,
    "soundtrack": 3.0,
    "cinematography": 5.0,
    "familyFriendly": 3.7,
    "funny": 3.230769230769231,
    "action": 6.0
  },
  "reviews": [
    {
      "rating": "3",
      "text": "I'm not really sure how to feel about this movie. If what happened to him happened to a female the entire internet would be grabbing pitchforks.  The first movie focused on love, comedy, and being black. This one spent too much time with feminism, racism, idolizing ignorance, and nostalgia."
    },
    {
      "rating": "0",
      "text": "Holy **** WHY?  I was hoping this would be eddie murphy's comeback, not.... this.All I have to say is that if you're a Murphy fan like me, you'll only need one sentence to be warned away:  \"This film is on par with Pluto Nash.\"A horrendous dumpster fire, I barely laughed.  Arsenio Hall and Eddie Murphy are supposed to be two funny guys, but yet the only actor who could squeak out a laugh (he made me laugh ONCE, which was the only time this COMEDY MOVIE did) was WESLEY SNIPES, who's more notable for his serious roles.  If you loved the first movie, don't kill your nostalgia for it by watching this garbage.  Jesus Eddie, what the hell man?!"
    },
    {
      "rating": "1",
      "text": "Now the male beating trend continues in this once great movie. Sad. Another good piece of art got destroyed by some know groups"
    },
    {
      "rating": "3",
      "text": "Is this a music video or what??? This sorry ass movie was totally messed up! Nothing in the spirit of the original was found here, apart from some of the returning actors. This is dreadful and painful to watch! From someone that enjoyed the original 27years ago."
    },
    {
      "rating": "0",
      "text": "Lazilly rehashes the old plot, but lacks all of the charm of the original. I honestly wasn't sure this was supposed to be a comedy. Avoild at all costs."
    },
    {
      "rating": "0",
      "text": "Absolutely disgusting movie... If what happened to him in America would happen to any girl, the internet would be ravening... it's a misogynist, sexist, bored, with a terrible story line...   not funny at all... where is the comedy? I seriously find it not even watchable!"
    },
    {
      "rating": "1",
      "text": "Absolute garbage. Full of stereotypes and racist nonsense. The entire movie is based on an American ruining a proud African culture with his disrespectful and thuggish nature."
    },
    {
      "rating": "1",
      "text": "badly written, silly, unfunny and lacking the charm and brilliance of the first movie"
    },
    {
      "rating": "2",
      "text": "Is this a comedy? Really? This movies sucks more than anything that I've ever seen since in the last year, I gave it a 2 just because Wesley Snipes is a scene stealer, he's the only funny in this movie, but he is in it five minutes. Don't waste your time, pass on this movie."
    },
    {
      "rating": "2",
      "text": "Coming 2 America is just like the original film, but without any of the comedy - 2 stars"
    },
    {
      "rating": "1",
      "text": "33 years.  33 God Damn years we’ve waited between two films and it’s clear that I’m that time period no one who made the sequel bothered to watch the original to understand why it was any good.  Coming 2 America is in America for five minute of the whole film making the title daft to begin with but the biggest issue is how funny it isn’t.  I laughed properly once the whole film for a sequel to one of my favourite movie memories of all time.  God this is bad and the writers need to be fired."
    },
    {
      "rating": "1",
      "text": "Wanted to like this movie and it was just bad. Not funny, very choppy plotline. If it wasn't for the big names would rate it a 0"
    },
    {
      "rating": "0",
      "text": "This film doesn't even come close to the charm of the old film.  The storyline is just thin and the only \"comedy\" is lame sex jokes or other humor for 6-12 year olds.  The storyline with the women's rights could be implemented well, but is just badly designed just to have a feministic base. I still had hope that the movie wouldn't be that bad, but it's actually worse than my low expectations. But unfortunately this is only another sequel, resulting from the “lust for money” of the production studios and unfortunately also of the actors. Rap, feminism, wokeness, curvyness, blackness and sexual freedom - a classic streaming film from 2021. Sad And that's what I say as a 20-year-old young person. Destroys nostalgia!"
    },
    {
      "rating": "3",
      "text": "Just watched an advanced screening, and dang it was disappointing. I love the original, it is a rare movie you can watch over, and over. That being sad Norbit, The Nutty Professor movies, and Life are 100x funnier than this sequel. It is funnier than Barb And Star if you have seen that.Pros: Returning characters (Amos,J.E. Jones, etc.)Eddie, and Arsenio in SFX makeup as characters from first movie, and one new one by Arsenio which was amusing. Wesley Snipes was decent, but needed some funnier scenes. Instead of same thing over, and over.Leslie Jones did her usual, but a little of her goes a long way.Cons:New characters (The Young Male Lead, Luenell, Tracy Morgan)When I'm watching this movie I want to see Arsenio, and Eddie. Instead I get way too much of the new guy, and his family. Luenell is wasted just sits around for most scenes, and has barely any lines (Why?)The background songs in this movie are awful, really annoyingly bad. The scene with the young male lead where he raps is head slappingly cringeworthy.Eddie is way too laid back in this as Hakeem, and only shines when in SFX makeup as another character. In the original he isn't over the top funny as Hakeem but  he is more entertaining because of the fish out of water experience he is having in New York. This time he is in Zamunda most of the movie, and it makes Hakeem BORING.Sorry Eddie, love a lot of your work but this needed a lot more refining."
    },
    {
      "rating": "3",
      "text": "Dolemite Is My Name was such a great Movie,so i thought Eddie Murphy is finally back. Also i love Coming to America, so naturally i was excited for Coming 2 America, but this Movie is just bad. There are some good Things in it like the scenes with wesley snipes, but it is mostly bad. I am really afraid now that beverly hills cop will be bad aswell.pls Eddie prove me wrong pls pls pls!"
    },
    {
      "rating": "5",
      "text": "The sequel to Coming to America wasn't really necessary, though the nostalgia factor had me interested. The problem with this film is that it doesn't have the charm of the original one. Where Prince Hakim disguised his identity to find his true love, in this version everything is out in the open and it felt like the Producers were more interested in cameos and special effects than story."
    },
    {
      "rating": "3",
      "text": "This movie is nothing but a flashback reunion film, not a sequel same story different person, only interesting part for me was the introduction of Izzie’s daughter."
    },
    {
      "rating": "2",
      "text": "Noioso da morire, senza idee. Peggio di quanto mi aspettassi. Mi auguro che finisca presto questa moda di fare sequel senza senso."
    },
    {
      "rating": "3",
      "text": "No any new ideas. Just a copy of an old movie, which was at least new. The second movie is just boring and pointless."
    },
    {
      "rating": "3",
      "text": "This was not a good movie had a couple of scenes that were entertaining but after the beginning it gets pretty boring."
    },
    {
      "rating": "1",
      "text": "I was looking forward to this one. I REALLY wanted to like this movie, but it was truly awful."
    },
    {
      "rating": "4",
      "text": "This sequel was not what I expected the jokes didn't land as I thought it would but Eddie Murphy and Arsenio Hall had good moments together."
    },
    {
      "rating": "1",
      "text": "Murphy’s talent elevates this sequel from garbage to mediocre. Nice to see Snipes’ comeback continuing apace."
    },
    {
      "rating": "1",
      "text": "This was a purely story driven movie with very little character progression at all. The movie was so contrived and lacked any originality to it at all. The writer didn’t understand what made the first one likable and the director used black tropes that were downright offensive. For a movie that tried to earn its PG by making a movie for everyone rating ended up making African/black people tied to every negative stereotype invented. And then there is the strong and intentional feminist slant...... I started an Amazon account just to watch this movie and feel so lied to that I’m just going to cancel my account now."
    },
    {
      "rating": "1",
      "text": "Dont watch its junk, rehashed junk , i want my money back ,the best parts you see when they advertise the promotion on tv."
    },
    {
      "rating": "1",
      "text": "Lame and seemed forced. It was bad acting on top of bad acting. Only one I enjoyed was Uncle Rheem. Movie was horrible."
    },
    {
      "rating": "0",
      "text": "Absolutely awful. A star studded cast couldn't even save this lame duck. Poorly written story and lacking any real comedy."
    },
    {
      "rating": "9",
      "text": "Although missing originality of African culture, I'm surprised to see how Eddie Murphy and crew have gone far to prove they can do well. So captivating!!!"
    },
    {
      "rating": "2",
      "text": "Such a disappointment. There is nothing new or original here whatsoever. It's a 100% nostalgia bomb that's just lazy and tired. Aren't comedies supposed to be funny?"
    },
    {
      "rating": "6",
      "text": "Welcome back to Wakanda... *coughs*, I mean, Zamunda. After 30 years of no one waiting for this, we finally got our sequel to Coming to America with Coming 2 America. Oh, so clever there. Long awaited and overdue but also, maybe, too late as well. Either way, Coming 2 America follows our favorite heir of Zamunda, Prince Akeem, as he secures his family legacy after learning he has a long-lost son in the United States. He returns to Queens to meet this unexpected heir and bring him back to Zamunda to build a relationship with him. Of course, if everything were that easy, there wouldn't be a movie but the rest we will leave up to you to detail the story. Let's see what we got.Let's be honest, they pulled out all the stops with this movie. All of black acting and comedy royalty appear in this movie. The costumes and sets were all over the top and amazing. Rick Ross' house and Tyler Perry Studios definitely have everything you need for a regal movie set. The biggest qualm I know people are going to have is that this doesn't feel anything like the original. Yes, they take us down memory lane throughout the movie, but it hasn't brought back the feeling from 1988. We all know societal norms and acceptances and culture have changed since then. Nevertheless, after 30 years, it's impossible to recapture that comedic magic without being corny or overly campy. In fact, if I'm being honest, this movie is like 20 to 25 years too late. You can even hear how late it is in Eddie Murphy's accent, or lack there of. I'm going to tell you all now, \"Get over it!\"Where this movie succeeds is that the cast is full of life. The themes of the film are nice and cute for the family. Just like Eddie's career as a whole, he's moved on to making films his kids can watch and be proud of, and there's nothing wrong with that. Coming 2 America has jokes that call back to the past, connections to comics and artists of the present but also ideals that people really shouldn't be fighting so hard to hold on to. The movie comes full circle but part of the issue is that we've been around and around this circle so many times. They waited 30 years to give us essentially the same movie and then just added in a storyline that has been beat to death over the last 5-10 years. This is where I think the filmmakers really missed. You don't call on an iconic film to make it ordinary but that's what we got. The thought of this movie feels rushed but we also come against the fact that the movie feels too long.Coming 2 America is a movie that any family with teens and young adults can sit down and enjoy. The movie is in no way in the same ballpark as the original, but that shouldn't take away from the enjoyment you can get from it. I'd wish for more originality from this flick but I'll settle for endless cameos, nostalgic laughs and the cheap price of the movie. The actual movie is just a handful of popcorn but for the culture grab yourself a bowl and enjoy the call to the past."
    },
    {
      "rating": "1",
      "text": "Done so poorly They've had 30 years to think of a good story, instead its boring non drama with references and memba berries. Leslie Jones really ruins this movie, somebody obviously thinks shes funnier then reality."
    },
    {
      "rating": "3",
      "text": "Terrible writers = terrible film.. There's a shock. I remember when comedy films were funny. Take me back to the 1980s"
    },
    {
      "rating": "5",
      "text": "Below Avg., Too Long, Too many Flash Backs, Murphy is only in about Half the Movie. This Movie is a 4 but I'm giving it 5 because it was free to watch. Leslie Jones is always the same in every movie and needs to work on her acting. Way TOO MANY Musical Numbers. They could have cut 30 min out of the movie and lose nothing."
    },
    {
      "rating": "1",
      "text": "After 15min of watching this, I had to stop. Came back next day and lasted another 10-15min. No connection to the first one. Characters are boring. Acting is boring and crap. Somehow it makes original suffer too by watching this movie. I was nice and gave it 1. Should be 0 really."
    },
    {
      "rating": "0",
      "text": "This is what happen when you have bunch of money but zero story, movie is trash, plot is terrible, leslie jones always playing the same character, movie disrespect prince Hakeem, no respect to Zamunda with a lot of member berries( you member, yes I member). The fist movie was one of the best comedy of all time and they took a **** on it f*** this movie and fu*k amazon"
    },
    {
      "rating": "0",
      "text": "A true terrible movie. Impossible to watch. It may be the worst movie ever. Waste of time"
    },
    {
      "rating": "1",
      "text": "Nothing new and the humor was painful at times. The plot points were too choppy and the ending didn't make much sense, when you consider what was the primary issue that fueld the movie to begin with. Wouldn't watch again. Sucks cuz Eddy Murphy is an excellent actor but I would blame it on the writers of the film, not the cast."
    },
    {
      "rating": "1",
      "text": "The first Coming to America was/is iconic. Barber shop scenes were key  In 2, I was bored at outset. It almost seemed that the movie was rushing to get to barber shop scenes to save itself."
    },
    {
      "rating": "1",
      "text": "The script is horrible. Besides the customs the entire movie lacks logical sense. The prince, now king, is presented with a vision of a son in America, product of a one night stand with a person who drugged him and had sex under the effects of drugs so he has no recollection of the act. Because the situation is from a female to a male I don’t see any complaints but if it were the opposite way pretty sure it would be people screaming RAPE. Then, nobody on the entire movie think about a paternity test, so, in reality we will never know if is his son for real. Then the queen partying with the mother of this bastard son like they were best friends, imagine that in real life! I was nice see how the actors looked after 30 yrs and the customs were good, besides that, the movie was a waste of time."
    },
    {
      "rating": "2",
      "text": "This movie is not at all nice it's trying so hard to be diverse and too much wokeism which has spoilt all the latest movie all nice movies being redone have been spoilt with too much feminism and wokeism This would have been a nice movie but the there is too much unseriousness and playfulness it would have been a nice comedy but too much wokeism"
    },
    {
      "rating": "7",
      "text": "It's not as good as the first one but it's still a fun family movie to watch. It's nice to see the initial story developing, there are really good moments and we enjoyed it very much."
    },
    {
      "rating": "4",
      "text": "No that's really a letdown. I prefer the great original here.Of course you have to be modern and we're not in the 80s anymore. But that's too modern for me. I also get too much singing and dancing in the film.It is positive that many old actors are back and bring back a retro feeling."
    },
    {
      "rating": "0",
      "text": "Una secuela que nadie pidió de otra película que tampoco valió la pena, aburrida, obsoleta y forzada."
    },
    {
      "rating": "5",
      "text": "I was personally underwhelmed by this sequel. While there was leeway to expand the narrative the script just felt washed out, tired and uninspired. There may be a few good laughs here and there, but the movie borrows too many scenes from the original.The narrative fell flat mainly because of a lot of stereotypes of Africa without any significant incorporation of African artists. There are also so many stereotypical portrayals of the African American ghetto as well. The movie tries to incorporate many modern themes but it just falls flat when compared to the original and leads to many cringeworthy moments"
    },
    {
      "rating": "2",
      "text": "Had to make an account to rate this. A feminist type approach is interwined into the story. It gives off odd vibes and can be seen as quite intentional. The story is quite predictable but has a few minor laughs. In comparison to coming to America, the original, this really lacks finesse in every direction and I really like Eddie Murphy's older stuff. But I can't recommend"
    },
    {
      "rating": "7",
      "text": "I waited with anticipation to see this sequel.  I for one enjoyed it. While it does not have the charm of the first, it is worth seeing if you want a light comedy, with timeless messages."
    },
    {
      "rating": "7",
      "text": "Eddie Murphy and Arsenio Hall return in their roles back in their home country. What gets them to the States is their quest to find a bastard son. The film starts with rollicking exuberance and a lavish musical celebration. It’s also genuinely funny, esp. when Leslie Jones is on screen. Sadly, when they return to Africa the story toggles from the funnybone to the heart with a love story for the son (Jermaine Fowler). There are plenty of cameos, including Trevor Noah and Colin Jost, who’s less stiff than he was in Tom & Jerry. The comedy highpoint was the barber shop full of Murphy characters. Ruth E. Carter, who did equally exceptional work for Black Panther, has designed wonderful Afro-centric wardrobes (that BIG wedding dress). While there’s lots of comic energy and every actor is having a great time, the indulgence of dramatic interactions drags the movie down. NOTE: Sit thru the credits for outtakes, John Legend’s lovely performance and one final gag at the end."
    },
    {
      "rating": "7",
      "text": "Light and fun with an ensemble cast plus much of original movie cast making cameos"
    },
    {
      "rating": "6",
      "text": "It's hard to watch C2A and not draw direct comparisons to the original, in fact it's impossible. Why? Because the film is so intentionally self-referential that it practically begs you to, with so many returning characters and recycled jokes.However, it IS a pretty good comedy... IF you understand it's a continuation from the original i.e. a sequel, rather than watch it with that comparative mindset and judge it against what is probably Eddie Murphy's funniest film.The plot is basic, with the fish out of water being Prince/King Akeem's illegitimate son being brought from Queens NY, to Zamunda because of ages old succession laws requiring only a male heir to possess the throne. Throw in a subplot with a neighbouring state looking to get their offspring onto the throne for political/financial reasons and the story moves along quite nicely.From an acting perspective Eddie Murphy and Arsenio Hall look like they're really enjoying themselves, as do all the actors returning from the first film (Shari Headley still looks gorgeous 32 years later!). The new actors/characters, especially the younger ones, aren't so good. Jermaine Fowler as Akeem's son Lavelle in particular lacks the charisma needed for the role, outside the comedy elements which he does do well. Wesley Snipes is hilarious as the Dictator from the neighbouring state, and pretty much steals all the scenes he's in.But, there are problems with the film. It lacks bite and that sense of dread which the first movie had. Being R-rated CTA was able to derive characterisations/humour/depth through racism/profanity/culture clashes that C2A simply can't. It's newer PG-13 'woke' mantra means so much of that is replaced with trying to breathe modern sensibilities into a cliched narrative.Overall though, it isn't terrible... It's just always going to compare unfavourably to it's predecessor."
    },
    {
      "rating": "6",
      "text": "After reading all the bad reviews on this one I wasn't expecting much. Was actually surprised that it did offer some great laughs. Is it a movie that will have you laughing all the way through no, but it does provide some laughs throughout its run time. No where near as good as the first but still some laughs and of course lots of nostalgia. A good way to spend some time watching it during lockdown."
    }
  ],
  "recommendations": [
    "a_million_ways_to_die_in_the_west",
    "the_hangover_part_ii",
    "zoolander_2",
    "the_cobbler",
    "couples_retreat",
    "pitch_perfect_2",
    "thor_love_and_thunder",
    "this_is_the_end",
    "night_at_the_museum_battle_of_the_smithsonian",
    "baywatch",
    "ted_2",
    "neighbors_2_sorority_rising",
    "anchorman_2_the_legend_continues",
    "little_fockers",
    "alvin_and_the_chipmunks_chipwrecked",
    "minions",
    "knocked_up",
    "diary_of_a_wimpy_kid_the_long_haul",
    "alvin_and_the_chipmunks_the_squeakquel",
    "the_happytime_murders",
    "ghostbusters_ii",
    "kangaroo_jack",
    "minions_the_rise_of_gru",
    "dinner_for_schmucks",
    "zack_and_miri_make_a_porno"
  ]
}