{"id": 2647, "title": "Commando", "starring": ["Arnold Schwarzenegger", "Rae Dawn Chong"], "runtime": 90, "genre": ["Action", "Adventure", "Thriller"], "description": "John Matrix, the former leader of a special commando strike force that always got the toughest jobs done, is forced back into action when his young daughter is kidnapped. To find her, Matrix has to fight his way through an array of punks, killers, one of his former commandos, and a fully equipped private army. With the help of a feisty stewardess and an old friend, Matrix has only a few hours to overcome his greatest challenge: finding his daughter before she's killed.", "releaseYear": "1985", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/ollPAAAgZ7euU8VisfqU3cuXhZ6.jpg", "categories": {"plot": 6.0, "acting": 3.0, "ending": 3.0, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 3.0, "funny": 6.2, "action": 5.666666666666667}, "reviews": [{"rating": "10", "text": "Very simple plot but amazing action film. A no brainer, just bring the popcorn and put your brain off.But it's worth it. This is my favorite movie with Arnold Schwarzenegger in it. Throughout the movie, you wonder who the hell would mess with this guy, I certainly wouldn't lol. Some humor very will timed a la Arnold right before the killing blows. I've watched this movie probably over 20 times and it's rewatch value has not diminished yet for me."}, {"rating": "10", "text": "Literally presses all the buttons a film should. If all films were like this, we would live in a happier world."}, {"rating": "10", "text": "This is a good movie to turn brain off. All the Arnold action movies are great but this is one of my favorites."}, {"rating": "3", "text": "Director Mark L. Lester brings us 1985's action thriller with bits of humour in it called \"COMMANDO\"... This action film has Arnold Schwarzenegger who plays Matrix who's considered the best by General Kirby (James Olson). Anyway the basic storyline and premise for this movie is an old friend named Bennett (Vernon Wells) kidnaps Matrix's daughter and takes her hostage along with a group of other helpers, this group also contains Predator actor, Bill Duke who plays Cook in Commando, another villain... The group of criminals/kidnappers want Matrix to kill some president or something so he agrees then he'll get his daughter back but he knows they'll kill her if he did the job anyway. So he works against the clock to find out where exactly his daughter is being held, has fights with policemen, kills a few of the badguys including Cook (Duke), steals his car, steals rocket launchers, grenades, explosives, ammo, shotguns and rifles from a weapon store or something and basically has fun lol. He also brings some black lady along with him (Rae Dawn Chong) who gets involved helping him to find his daughter after so much persuasion by Schwarzenegger. The black lady and Schwarzenegger steal some plane that floats on water and fly to this island using map coordinates because he believes that's where his kidnapped daughter is being held hostage by the badguys. Packed with action, great impressive action, explosions, bullets flying everywhere and loads of dead bodies plus a great fight scene at the end and some witty humour... Commando does deliver however I liked all the acting but when there was no action in most scenes it felt rather dull and boring so this for me is not a good film and against an army of soldiers Matrix would of died in real life so a daft and stupid film but many may like it sheerly for entertainment purposes... To me Raw Deal made in 1986 was better than Commando."}, {"rating": "5", "text": "Somewhat entertaining and hard not to like Arnie but essentially dumb story and screenplay."}, {"rating": "8", "text": "\"Commando\" is how action movie should be.  Lots of hard hits, people flying feet over head from explosions, and every scene is punctuated with a one liner.  I give it a B, next time you’re in the mood for a movie, this one won’t disappoint."}, {"rating": "6", "text": "The beginning is not bad, the first action in the mall is good. But later it become ridiculous. So many enemies and none can shoot him. The humour is dull with many oneliner."}, {"rating": "6", "text": "Reasonable movie, but with good action scenes. It's the tipic action 80s movie towatch when you want some fun and adrenaline. That's my profissional critic with note 6, but my note to how cool he is I give 8."}, {"rating": "9", "text": "Peak 1980s action-comedy. Peak comedy Arnie. The plot's ludicrous but is also entirely irrelevant. I LOVED it."}, {"rating": "7", "text": "Very good typical 80s action flick the script is very good but the delivery is not."}], "recommendations": ["the_last_stand", "war", "broken_arrow", "white_house_down", "death_race", "bad_boys_ii", "safe", "the_mechanic", "mechanic_resurrection", "olympus_has_fallen", "the_expendables_2", "salt", "angel_has_fallen", "the_expendables", "ninja_assassin", "machete_kills", "jack_reacher_never_go_back", "transporter_2", "mad_max", "the_fate_of_the_furious", "escape_plan", "rambo_iii", "mission_impossible_ghost_protocol", "2_guns", "shooter"]}