{
  "id": 2632,
  "title": "Con Air",
  "starring": [
    "Nicolas Cage",
    "John Malkovich"
  ],
  "runtime": 116,
  "genre": [
    "Action",
    "Thriller",
    "Crime"
  ],
  "description": "Newly-paroled former US Army ranger Cameron Poe is headed back to his wife, but must fly home aboard a prison transport flight dubbed \"Jailbird\" taking the “worst of the worst” prisoners, a group described as “pure predators”, to a new super-prison. Poe faces impossible odds when the transport plane is skyjacked mid-flight by the most vicious criminals in the country led by the mastermind — genius serial killer Cyrus \"The Virus\" Grissom, and backed by black militant Diamond Dog and psychopath Billy Bedlam.",
  "releaseYear": "1997",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/kOKjgrEzGOP92rVQ6srA9jtp60l.jpg",
  "categories": {
    "plot": 5.461538461538462,
    "acting": 6.666666666666667,
    "ending": 5.166666666666667,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 9.25,
    "action": 6.444444444444445
  },
  "reviews": [
    {
      "rating": "10",
      "text": "This is one to watch! The reason this movie grossed  $224,012,234 in the box-office is because it is a real crowd pleaser! It had a budget of $75 million, and it really shows. This movie is and always will be a hit. Is it the best movie ever....NO! But is it the worst......HELL NO! This movie is a huge YES YES YES!"
    },
    {
      "rating": "10",
      "text": "A hilarious film with a knock-out cast. A refreshing cast with a flawless performance by Nicholas Cage (However, the accent did need more work) John Cusack and the whole cast are truly amazing! A hilarious film and a truly magical watch that gives everyone of us a good time!"
    },
    {
      "rating": "10",
      "text": "..........................................................................................................................Peter Travers of Rolling Stone Sucks.\r This BORING Person Not Have Fun with Nothing,\rThese type of Popcorns flick, Entertains everyone least YOU, Roger Ebert is very more Cool and Intelligent Critic than YOU"
    },
    {
      "rating": "10",
      "text": "One of the 90s action movies at its best with a story line the mrs will enjoy too"
    },
    {
      "rating": "9",
      "text": "*:*:*;*;*;*;*;;*;*:*:*\"*\"*:*:¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙"
    },
    {
      "rating": "10",
      "text": "In the trailer for this movie, the flying scene where the 2 AH-1 Cobras escort Jailbird 1 during their landing in the Las Vegas strip included the dialog \"Where are they going to land this thing?\" spoken by one of the Cobra pilots, and the response by John Cusack's character: \"How about the blackjack tables\". Neither dialog was included in the final cut."
    },
    {
      "rating": "10",
      "text": "John Malkovich was unhappy during production because the script was being rewritten virtually every day and he had no idea how his character was going to turn out."
    },
    {
      "rating": "9",
      "text": "•¤•¤•¤•¤•¤•¤•¤•¤•¤•¤•¤•¤•¤••¤•¤•¤•¤•¤•¤•¤•¤•¤•¤•¤••¤•¤•¤•¤•¤•¤•¤•¤•¤•¤•¤•¤•¤•¤⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙"
    },
    {
      "rating": "9",
      "text": "bhuihiihihihihihihihyftdfguihihihhiknknknnjteqwsxchjkmkojogydrtfughihinionnonigyrsrsdtyfguiihihuguhhiihhiihhhref"
    },
    {
      "rating": "9",
      "text": "♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤:;:;:;:;:;:;:;:;:;:;;:;:;:;:;:;◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇"
    },
    {
      "rating": "9",
      "text": "+++++++××××××÷÷÷÷÷++++++××++++÷÷÷====÷÷÷÷÷÷÷÷÷+++++++÷÷÷■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■"
    },
    {
      "rating": "9",
      "text": "A great film, it truly, truly is! Really enjoyed this one, they do not make them like this anymore! You will enjoy this one! Monica Potter gives a fantastic performance, as she always does, and she did not have a huge part in this one! This movie has it all; Romance, Action, Suspense and a lot of comedy! BRILLIANT!"
    },
    {
      "rating": "10",
      "text": "What is wrong with you all. Con Air is such a bad film it's good. It doesn't take itself overly seriously like all the egotistical action movies of this decade. It is badass, lighthearted fun, I hated Nic Cage until I watched this film and the director used his infamous bad acting to his advantage and made the movie another awesomely bad cheesy 90s action film. 10/10!!!!"
    },
    {
      "rating": "10",
      "text": "Con Air is a full on adrenaline rush with Cooke acting from a distinguished cast. Nicolas Cage made\ranother effects packed thriller with this movie. The movie has great comedy as well with many quotable\rlines. Con Air will delight you with its memorable action and dialogue."
    },
    {
      "rating": "6",
      "text": "This movie is completely ridiculous, and it features a fakey southern Nicolas Cage with impressive hair.  It seemed like the whole second half of the film was continuous explosions.  Entertaining, and definitely not demanding to watch."
    },
    {
      "rating": "8",
      "text": "When it comes to action films you can't really go wrong. There are several films out there were turning out to be good or bad or okay or a bit of both. They're not guilty pleasures unless they're considered to be cheesy. In everybody's eyes when they think about it, it stars Nicolas Cage, John Cusack, John Malkovich and many other actors. The result in John Malkovich puts it best: \"Welcome to Con Air.\" Oh yes! This is one of the most ridiculous over-the-top action flicks but in most parts they really love it and doesn't care. Well, I'm on the other hand had seen it and you know what, I like it. It's not a perfect film in anybody's opinions they still enjoy it. Nicolas Cage is Cameron Poe, an Honorably discharged Army Ranger is been sent to prison for manslaughter after killing a drunken man and his three men who tried to attack him. He befriends with Mike O'Dell aka \"Baby-O\". He's been paroled and takes a flight to Alabama on board. U.S. Marshal Vince Larkin played by John Cusack who is approached by DEA agents Duncan Malloy and Willie Sims. Cameron and the other prisoners are on flight and now it's been hi-jacked by John Malkovich's character, Cyrus Grissom aka Cyrus \"The Virus\". Now I went into this movie thinking I'm gonna look upon it and no, there's nothing much apart from the action. It just takes place on the plane at Alabama. I looked up parts of it and what I find is those lines that I can't get out of my head. The first of which is \"Put... the bunny... back... in the box.\" \"Why couldn't you put the bunny back in the box.\" and \"DON'T. TREAT. WOMEN. LIKE. THAT!\" And there is one part that I found stupid is that when a dead body who is actually Pinball played by Dave Chappelle thrown off the plane with a message sent by Poe to the U.S. Marshals and landed on the car with people in it. That scene looks like I'm watching a commercial even thought kids love watching commercials. I just find it silly. \"I like Pinball.\" And before that, I just found a song that I think I listen to when I was a little kid and that was \"How Do I Live\" by Trisha Yearwood and I think there's another song which sounds like that with LeAnn Rimes but I am thinking about that, I'm thinking the Trisha Yearwood version, the version that I always love. I listened to this song every time I'm in the mood cause when I was a kid I'm into 90's songs and in recent years I did not know this song is from Con Air, so that might've been a coincidance. But what's really strange is that this song is been nominated for both an Academy Award for Best Original Song and an Razzie Award for Worst Original Song. How does that make any sense? I think I do believe that this is not the first time that I've ever come across a movie that has been nominated for both Academy Award and the Razzie Award and with this song I have no idea. So as I like Con Air if people were interested in this will know that it's over-the-top and silly however they might love the silliness already. Some people love it are fans of it and some people hate it saying that it's silly and stupid or even as I said already they enjoyed the silliness, it just doesn't matter. I think somebody puts it best: \"Con Air won't win any awards for believability – and all involved seem cheerfully aware of it, making some of this blockbuster action outing's biggest flaws fairly easy to forgive.\" \"Well, hooray for the sounds of f**king silence!\""
    },
    {
      "rating": "5",
      "text": "\"Con Air\" is your average blow-up blockbuster movie with nothing memorable but massive cliches and decent acting."
    },
    {
      "rating": "7",
      "text": "Con Air is (hopefully) about as ridiculous as movies can get, but still be very enjoyable to watch. Nic Cage is his usual over-the-top self, playing a character with a Southern accent in which he constantly slips out of almost every take, but no one's paying attention to that. Instead, all that is needed here is a coherent enough storyline, a bunch of explosions, and plenty of car crashes."
    },
    {
      "rating": "10",
      "text": "This movie is just good fun! What is wrong with that? I can be watched over and over and really never seems to get old!"
    },
    {
      "rating": "8",
      "text": "An over-the-top action movie that has a lot of fun making fun of over-the-top action movies. Steve Buscemi's character is a priceless parody of Hannibal Lecter complete with leather face mask and custom made restraint chair."
    },
    {
      "rating": "6",
      "text": "Never before have I watched a film that is so incredibly dire yet so immensely entertaining. Con Air doesn't just ask the viewer to check logic at the door but throw it out altogether and I must say, as soon as I did it became a film so sure of what it was doing I admired it, then I enjoyed it. Con Air tells the story (story being used loosely) of Cameron Poe a retired Army Ranger who gets in a drunken brawl and accidentally kills a man. He is sent away for 7-10 years, even missing his daughters birth. The film's main action however takes place on his flight to the free world as he is being transferred to his original prison for release. However they just so happened to (if you didn't think this plot was bizarre you will now) be flying him by high security plane with some seriously dangerous folk on board.Poe (Nick Cage) tries his best to get his friends through the flight but considering his best friend is diabetic (I couldn't make this up if I tried). The film goes on with a fast pace with a entertaining yet repetitive score backing up the action. Its a sound action film to watch if you are bored, if only to see John Cusack as something other than a mopey heartbroken teenager."
    },
    {
      "rating": "6",
      "text": "A sure-fire premise carried largely by distinct and eccentric characters--impressively portrayed by John Malkovich, Steve Buscemi and, even, Nicolas Cage."
    },
    {
      "rating": "7",
      "text": "In many ways, \"Con Air\" is the quintessential 90s action film. It's got hammy and dialogue delivered through a cheesy lead performance. It's got over-the-top action set pieces that make little to no sense. It's got an almost ad nauseam use of slow motion But, man, is it fun as hell to watch."
    },
    {
      "rating": "5",
      "text": "Huh! It's hard to say what is good in this movie, because the whole time of view the only thing you may see will be the hard-action and a lot of reckless disregard for human life and public property."
    },
    {
      "rating": "6",
      "text": "Is Con Air the epitome of 90's cheesy action flicks? Probably. It's got pretty much everything you expect. Over the top acting performances, lots of explosions, a very high level of testosterone and highly unrealistic and over the top action scenes. If you're into 90's action movies and you haven't seen Con Air, you should definitely watch it."
    },
    {
      "rating": "3",
      "text": "Con Air is a showcase of the worst tropes that plagued action films of the 90s. The unlikeable and badly acted lead character with some convoluted goal involving a child; the never-ending loud and violent explosion sequences; the villain who simply refuses to die, dragging the film's running time out beyond a level that is considered entertaining; a sparse selection of female characters that are furniture to fawn over or be rescued by testosterone-fuelled \"hunks\"; and an ending that celebrates the freedom of a hot-tempted soldier (or \"American hero\", as they are colloquially known) and a charismatic psychopath, a violent death for the villain and, of course, money. John Malkovich's charisma unfortunately can't save this piece of tat."
    },
    {
      "rating": "7",
      "text": "When Nicolas Cage tells you in a strange Southern accent for you to put the bunny down, you should first ask questions about where he's from, and then do what you have been told.Seriously though, he's a unique human being."
    },
    {
      "rating": "0",
      "text": "Nicolas Cage s'est commis de temps à autre dans le blockbuster hollymerdique alimentaire avant de sombrer bien plus tard dans les affres des nanars et téléfilms bas de gamme (pléonasme) mais on ne lui en veut pas dans le cas présent (même s'il est aussi transparent et inexistant), car Malkovich s'est aussi égaré sur ce vol consternant de beauferie amerlocaine.Ainsi que John Cusack et Steve Buscemi et d'autres seconds couteaux plus ou moins coutumiers de ces grosses farces qui étalent vulgairement leurs dizaines de millions de dollars à l'écran. Le scénario complètement foireux a été écrit par un enfant de 5 ans et les dialogues semblent récupérés d'une mauvaise sitcom (double pléonasme) : ça touche tellement le fond à chaque réplique que même tous les Expendables réunis sont allés crever de honte dans leur coin.C'est réalisé par Simon West qui n'a rien à envier à Michael Bay : la moindre action est saucissonnée en tranches et totalement incompréhensible, un montage ultra-cut permanent façon clip de rap sur MTV ou autre chaîne poubelle pour ados. Enfin, même en mettant de côté le grand guignol pathétique de ces branques dont une partie cabotine comme des clébards à piquer et l'autre s'agite comme des poulets sans tête, la grosse daube infernale ne parvient pas à maintenir le rythme et se permet des apartés niaiseux. Tout simplement insupportable !"
    },
    {
      "rating": "3",
      "text": "This film is slightly based on true air travels made to transfer convicted criminals. I think I don't need to say that the idea of ​​a plane full of chains and bars, with criminals traveling like caged beasts, is pure fiction. Despite having a good cast and some regular action scenes, this film has a very poor quality. The script, written by Scott Rosenberg, is too unrealistic and implausible, starting with the totally stupid idea to fill a plane with crazy killers (one wearing a mask out of \"Silence of the Lambs\"), side by side with an arsenal of light weapons and fatty policeman full of donuts. This scenario could only end badly, making the hijacking too predictable. I don't understand how the police had so much difficulty in tracking the airplane with so many locators and covert surveillance devices available in that days, on the service of the writers and the director, Simon West. Starting from there, the film only gets worse, with a huge circus of unlikely and unbelievable scenes. The end is worthy of the Razzie Award that this film won.The film has a good cast led by Nicolas Cage, John Malkovich and John Cusack. Also participating, among others, Ving Rhames, Steve Buscemi, Danny Trejo, Renoly Santiago and Dave Chappelle. Nevertheless, none of the characters was particularly interesting with the exception of John Malkovich, who gave his Cyrus all the required malice and wickedness without allowing himself to explore a little more his evil. Some of the characters tries, mainly through dialogue, rehearse a few moments of humor, but it's a shot that backfired. The action scenes are truly impressive, but most merely to show-off, being clogged with special effects and sound. For posterity remains a regular action movie, able to entertain, which seeks to impress but ends up leaving us a bitter taste, like a good wine that was too long exposed to air."
    },
    {
      "rating": "8",
      "text": "The whole cast seems to be having a ball here and it's infectious. If you don't smile at least occasionally while watching, you need a checkup from the neck up."
    },
    {
      "rating": "1",
      "text": "Con Air is too tiresome to mention story wise so I'll keep it simple. John Malkovich, Nicolas Cage and John Cusack star alongside Ving Rhames in this strange action flick. Also watch out for Steve Buscemi who's a prisoner chatting to some 4-5 year old girl with a dolly singing Godly songs we used to sing at nursery which is creepy and noncey. A plane carrying some of the most dangerous criminals is hijacked by the criminals and Cyrus the virus (Malkovich) is in charge as head honcho or boss. Nicolas Cage just wants to see his kid so stops the badguys with the help of John Cusack using constant communication and saves the day. Con Air is filled with extreme levels of violence and profanity that beggars belief and stupidly over the top and still manages to be nothing more than a boring pile of turd. Avoid this awful film and may God forgive Simon West the director because I don't!"
    },
    {
      "rating": "8",
      "text": "Rented it back in the day and again a few months after really enjoyed it. Put the bunny back in the box."
    },
    {
      "rating": "7",
      "text": "Such an amazingly terrible movie that takes so many cliches, so many plot holes, and so many unrealistic scenarios and pumps them up to 11. Cannot recommend enough!!!!"
    },
    {
      "rating": "4",
      "text": "This movie is entertaining for cave men who like things go boom. Everything magically explodes in this movie. Dave Chappelle and John Malkovich are fun, but John Cusak and Nicolas Cage are boring. Steve Buscemi is wasted. Everyone else is a cardboard cut-out."
    },
    {
      "rating": "7",
      "text": "I partially agree with Rolling Stone. Con Air has most makings of a hit, but it's still a fun movie plagued by by poor performances and terrible music."
    },
    {
      "rating": "6",
      "text": "Non stop action, the pacing is amazing. Cage is a bit over the top and it does have some rather gaping holes in the plot, but it is an undeniably exciting film. Well edited, good score."
    },
    {
      "rating": "4",
      "text": "It's hard to imagine another movie with more contrived plot twists than this one. Not as bad as Anaconda, nor as entertainingly bad. Guess I know why Snakes on a Plane got made."
    },
    {
      "rating": "6",
      "text": "Just peak nineties dumb action fun. Nothing more, nothing less. (+ Cage's awesome hair"
    },
    {
      "rating": "8",
      "text": "Great movie. One of my favorites growing up. Action packed with a great storyline."
    },
    {
      "rating": "7",
      "text": "I have seen hundreds, if not thousands of movies and I can honestly say that this is the most ridiculous one I've seen. It almost seems to me that it's something of a stealth parody of the action genre, kind of like how \"Scream\" is a stealth parody of the horror genre.  to put my thoughts in other words, this film is either comedic genius or complete stupidly and insanity, but no matter what, as a piece of pure entertainment, it's a (note the asterisk)  masterpiece*."
    },
    {
      "rating": "9",
      "text": "》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》********************************************************"
    },
    {
      "rating": "9",
      "text": "⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙●■●■●■■●●■●■●■%÷%÷%÷%÷%÷%÷%÷%÷%÷%÷%÷%÷%÷%÷%$$$$$$$$$$$$$$$$$$$$$$$"
    },
    {
      "rating": "9",
      "text": "Con Air is a classic action film with stellar acting, adrenaline filled action set pieces with an end that is fitting & touching, a must see in my book."
    },
    {
      "rating": "9",
      "text": ">>>>>>>>>>>>>>>>>>>>>>>>>>>>$$$$$$$$$$$$$$$$$$$$$$$$$$$$○○○○○○○○○○○○○○○○○○@.@.@.@.@.@.@.@.@.@.@.@.@.@."
    }
  ]
}