{
  "id": 3775,
  "title": "Conan the Barbarian",
  "starring": [
    "Jason Momoa",
    "Stephen Lang"
  ],
  "runtime": 113,
  "genre": [
    "Adventure",
    "Fantasy",
    "Action"
  ],
  "description": "A quest that begins as a personal vendetta for the fierce Cimmerian warrior soon turns into an epic battle against hulking rivals, horrific monsters, and impossible odds, as Conan realizes he is the only hope of saving the great nations of Hyboria from an encroaching reign of supernatural evil.",
  "releaseYear": "2011",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/5Z7bmszrF0uQxilCC6bjrLo9u9H.jpg",
  "categories": {
    "plot": 7.166666666666667,
    "acting": 7.0,
    "ending": 6.333333333333333,
    "soundtrack": 6.2,
    "cinematography": 8.0,
    "familyFriendly": 3.0,
    "funny": 9.0,
    "action": 7.333333333333333
  },
  "reviews": [
    {
      "rating": "10",
      "text": "Whenever I tell people that one of my favorite movies is \"Conan the Barbarian\" they tend to tilt their heads and wonder why. I receive the same reaction when I admit the same thing about \"Spirited Away\". Both movies stir my imagination to the point of having to love them. I don't care if the acting can occasionally reach cheesy levels, this will continue to be in my top 10."
    },
    {
      "rating": "10",
      "text": "This movie contains much more then most people can understand because it is about power of spirit. Total classic and still one of the best fantasy movies."
    },
    {
      "rating": "9",
      "text": "This movie has aged very well, while some moments are cheesy, it's still a highly enjoyable movie for fans of fantasy epic movies, a truly unique movie that's a lot of fun to watch."
    },
    {
      "rating": "10",
      "text": "The long drawn out silence and \"high adventure\" perfectly set the grand scale of the Conan universe, doubtful you'll ever see a better performance from Arnie... the action is done very well, the dialogue is minimal but perfect for the broody character, the visuals are wonderful, the music is amazing, personally can't find a flaw in this first outing. 10/10"
    },
    {
      "rating": "8",
      "text": "The early 80's were bombarded with a whole slew of 'epic sword and sorcery' films, from the visually splendid \"Excalibur\" to the ridiculous but inexplicably charming \"The Beastmaster.\" But none of them were responsible for catapulting their lead to super-stardom like \"Conan the Barbarian.\"  Sure, it's cheesy and Arnold Schwarzenegger was an even more limited actor then than now, but the 10 year old me that first saw the film thought it was the greatest thing since Star Wars, and that's all that matters. :P"
    },
    {
      "rating": "10",
      "text": "Classic...changed my life. \"Conan:what is best in life? To crush your enemy, to see them flee before you, and to hear the lamentation of their women.\""
    },
    {
      "rating": "9",
      "text": "great style mood and grace, while parts of it are comical the amazing musical score and breathtaking scenery, the first 28 minutes of the movie is without dialog, a testament to how a score can drive a film"
    },
    {
      "rating": "6",
      "text": "A guilty pleasure, carried by Arnolds brute charisma and his lack of acting. A fantasy tale that is ultimately both enjoyable and very silly. The ending is quite disappointing, though, even with this \"Riefenstahlesque\" look."
    },
    {
      "rating": "10",
      "text": "Don't be fooled - this is a pure art movie. No other like it before or since (not even the sequel - it sucks, by the way)\rAmazing soundtrack (how it didn't even got nominated for the Oscar is beyond me)"
    },
    {
      "rating": "10",
      "text": "This is arguably the greatest movie of all time, starring a man seemingly born to do the role, with one of the most underrated Directors ever to be black listed into oblivion by left wing idiots infesting Hollywood ever.   This is not mary sue star wars or game fo thrones female fanservice nonstop.  Quite the opposite!!   The man starts with nothing and is white, nuked the trope of the black man starting with nothing.  He reaches the top.  In fact if you arent racist a black amn could jsut see it as a man not a white blue eyed man.   He grinds for years to buidl strength as a salve, then is taught by ornetal weapons temple masters and goes on to defeat the evil pope of his world.   An amazing pro capitalism anti authroity movie.  Facism and nazi are after all left wing jsu tyoutube yaron brook on that one.   Hitler was a democrat fascist.  Fasism is communism is socialism.   The cure is individualism and freedom with property aka capitalism!   Dont start reading the book by robert e howard l sprage de camp lin carter steve perry john maddox roberts and robert jordan because they are so darn good you will be ruined for anything except jack vance ae van vogt michael moorock glen cook eric frank russel lawrence watt evans and paul hogan.To those who have not seen it I salute you! I wish they brought back the selfish sneeky wiseass turn the tables on you comedy of 80s movies this one exibits."
    },
    {
      "rating": "10",
      "text": "Orchestral score is second to none. Considered by many one of the greatest scores in film history. That alone warrents a 10."
    },
    {
      "rating": "10",
      "text": "Probably the best sword and sorcery movie ever made. The score alone makes it a great."
    },
    {
      "rating": "10",
      "text": "Hervorragender Film mit guten Special Effekts. Etwas in die Jahre gekommen aber absoluter Kult. Auch an der Aufmachung ist bis heute nichts auszusetzen."
    },
    {
      "rating": "6",
      "text": "Although the movie has so many unnecessary parts with a hurried ending, John Millius created \"Conan the Barbarian\" with a appropriate cast and fantastic visuals, which is why its regarded as a classic."
    },
    {
      "rating": "10",
      "text": "Epic swash-buckling fantasy adventure in the true sword & sorcery style.Arnold personifies Robert E. Howard's Conan like no one else could and delivers what the target audience expects. Visceral Combat, One-liners and a camel-punch or two.Right up there with \"The Princess Bride\" and \"Ladyhawke.\""
    },
    {
      "rating": "4",
      "text": "I love Arnie and even though I love cheesy 80s movies this one just didn't catch me. The plot was lame, the acting terrible, the audio was at times unintelligible, and other than the over-the-top gore there was really nothing to savor. Perhaps had I seen it in the 80s I would have had a better appreciation for it, but by somehow missing it I just can't accept giving it anything higher than a 4."
    },
    {
      "rating": "10",
      "text": "\"What is best in life? ...\" \"the riddle of steel\" The gold of Conan the Barbarian isn't really the excellent story telling or Swartzneggers prolifically suited role but in the truth of life we must digest while immersed in this \"survival of the fittest\" . The beauty of Conan here is not great acting but rather the story of passion, the fight of good and evil and the triumph of justice and triumph of the human spirit. Conan the Barbarian as a \"cultural artifact\" is for many the beginning nothing more than slew of meaningless \"adventure movies\" that proceeded afterwards, for myself though Conan means a kind of \"hope\" in many respects .. and that hope while imperfect makes up for a lot of the \"movie sin\"."
    },
    {
      "rating": "6",
      "text": "What has Arnold got himself into, this isn't a good movie nor experience."
    },
    {
      "rating": "8",
      "text": "With a mix of fantasy, humor, and Arnold's big arms, this flick is one that I think gets better and better with repeat viewings.  I haven't read the Howard books, so I can't make any comparison.  But until I do read them, Schwarzenegger is my first thought when I hear \"Conan\" (with O'Brien a distant second).  The classic saga of a boy who eventually extracts revenge on the person who was responsible for killing his parents (Holy Batman!), the film traces the training (strength through slavery) Conan receives as a child.  This leads to a life as a gladiator, thief, and eventually vigilante.  I find the ending to be 'lacking', and rather bland, but the final scene 'promises' more high adventure (re:  Conan the Conqueror).  As I mentioned, there is actually quite a bit of humor in this film (which helps to maintain the fantasy elements, I believe), with some of the better quotes that I remember.  The assorted members of Conan's loose cadre offer various aspects:  Valeria (sex), Subota (loyal companion - like a proto-'George Stone' of \"The Untouchables\"), and The Wizard (start thinking of a Dungeons and Dragons quest party).  I've really started to like this movie (since AMC seems to offer it on a regular basis), and though I pretty much know the dialog by heart, it still offers light entertainment."
    },
    {
      "rating": "9",
      "text": "For its time the movie was surely great, today a bit outdated. But still the world they created is great: savage and wild. Music is fantastic. Of course Schwarzenegger was perfect for this role and the director and cameraman put him perfectly into the scenes.The plot and some fights are outdated. Especially the end fight is too simple. But I liked the fantasy elements in the movie, they fit very well.I am laughing about the \"professional\" = left corrupted critics."
    },
    {
      "rating": "7",
      "text": "'Conan' possesses an eeriness, an unorthodox form of story telling that I doubt we often see. It may not seem like it at first, but in the film there is a philosophical view, of power, vengeance, and loss. Arnold Schwarzenegger gives his deepest role, but the problem was simply his accent. James Earl Jones, in his small yet pivotal role, is the most captivating as the mystical snake priest. The film comes off too eerie for me, but the action and dialogue really pushed me to sit through the whole movie."
    },
    {
      "rating": "8",
      "text": "Conan is based on tales from Robert Ervin Howard starting in 1932. He is one of the fathers of the “Low Fantasy” genre or a least a really well know contributor. Low Fantasy is a setting that is our world with some magic, mythical or supernatural elements but more dark and grim as it hides not the dark sides of human nature (Like the Witcher for example). The movie itself is well know for being an epic sword and sorcery tale and the first big role of Arnold Schwarzenegger which was also a financially successful movie. Be warned it is a show not tell approach and there will be blood and nudity which is fitting for the movie and setting. It is set in the Hyborian Age which is created / defined by Robert E. Howard as between the sinking of Atlantis and the beginning of recorded history. Conan is a young boy and son of a blacksmith. His father tells him about the riddle of steel he must solve as this is important to his people the Cimmerians. Shortly after the village is ambushed and the few survivors including Conan are sold into slavery. This is the set up and beginning of his adventures as he wants revenge and answers. The story is great sword and sorcery material. It delivers and uses all tropes in a good way. This means the story is engaging and you are invested into the characters. There are some good reveals and ideas like for example the riddle of steel, what is greatest in life, a ritual I cant spoil and other scenes that are homages or the approach of the villain to gain power. I don't know why many rated it lower because you have to adapt to the genre. If you don't believe me try comparing 2 classic of different genres like for (an extreme) example Schindlers List to Spaceballs or for a milder case The Great Dictator to The Godfather. No one expects a Shakespearean tale here and for its genre and setting it does a great job. The actors deliver. Arnold Schwarzenegger creates the template for the Barbarian character in fantasy and fiction. He has the looks for this and even his acting works well enough. Then we have the legend himself James Earl Jones as Thulsa Doom. He is a great antagonist as he is smart, a great schemer and uses his abilities to full potential. He is one of the underrated movie characters and I praise the performance. Jorge Sanz as young Conan does a good job in his short role. I always say you should praise good child actors as it is hard to perform at this age. Sandahl Bergman as Valeria and Gerry Lopez as Subotai are great additions to the cast. Overall for the genre we got a satisfying performance. The battles and fights were great and bloody as they shy not away from brutal depictions. Here I must warn you as it is to brutal for some. However it is a grim and dark world so it is fitting for the setting. This is also valid for the sets. It is a world full of dark and grim things as much as debauchery in rich cities for contrast. All sets are a good representation you expect for this setting. What impressed me was the immersive and awesome score. Basil Poledouris enhances the scenes with his composition and reminds me of Ennio Morricone who could also tell a story just with the score. An underrated performance. Overall this movie delivers and became a cult classic for some. It is not an intellectual movie but has an appeal and is entertaining. Bonus knowledge 1: Believe it or not Conan is at the time of writing a Marvel character and he found his way into some events. In a what if story it was also shown that he is worthy to pick up Thors hammer. Bonus Knowledge 2: Conans answer to “What is the greatest in life” is actually what Genghis Khan answered to the same question."
    },
    {
      "rating": "4",
      "text": "Conan the Barbarian stands as a very different take on fantasy and remains to be challenged as far as musical score and majestic feel. Arnold could not have been more fit for a role in his life, makes sense that this is the one that practically launched his movie career. There are obvious things that  are impressive about this movie. There is a particular attention paid to the overall spectacle of the movie that makes it hard to duplicate. The costumes, the sets, and the props. All the things about the environment make it exclusively the Conan universe. Good job. However, There is a major issue with the minimal dialogue and dominantly brutish nature of just about all the characters. The argument would be that that follows after Conan's character and he doesn't say much...okay maybe that is true, but I think James Earl Jones had a little too little to work with. I think he spoke the most out of anyone. And I was relieved to hear him, its like oh, someone who is coherent, and not just anyone, Its JAMES FREAKING EARL JONES, thank you for that. I think everyone was aware of that and given this was an origin story, it sort of gave the impression of self discovery. So the weight was purposely put more on the visuals and music. which is impeccable honestly, I listen to the soundtrack all the time. Its that good. But overall there was too much testosterone all at once to be a great movie. Blood, brutality, nudity, and primitive behavior is useful depending on what you are trying to convey. Here it was just the whole movie. i never felt like it leveled out and rose up a plain or two. The end fight scene was awesome though and  fantasy classic none the less."
    },
    {
      "rating": "8",
      "text": "While a little too long and a little too simplistic in the storytelling, there is a lot that makes Conan the Barbarian entertaining. It looks fabulous, with beautiful scenery, sets, costumes and cinematography, while the score is brilliant particularly in the first fifteen minutes. The dialogue is pretty good as is the direction, while the action sequences are top notch and the special effects decent. The pacing is brisk enough, while the acting I had little problem with. Arnold Schawarznegger is great as Conan, while James Earl Jones has fun as Thulsa Doom and Max Von Sydow is good value as King Osric. All in all, while no masterpiece Conan the Barbarian is very entertaining and worth watching at least once. 8/10 Bethany Cox"
    },
    {
      "rating": "10",
      "text": "Conan the Barbarian is pretty much unsurpassed as a movie.The character arc of Conan is interesting, in how he starts as a nobody with many years of extreme hardship and destitution moulding him into what he is. While the epic revenge arc is cliche, the way it is delivered is not.This is how heroic characters are created, not as Mary Sue or Chosen One. This hero is a hero because the world threw a lot of sh-t at him and he overcame it. The movie illustrates this brutal reality well at the beginning, when there are 30 or so other kids put in the same situation. Each could have been a Conan, but only one overcame the harsh reality and survived, by sheer determination, rather than special powers.By the time Conan and his pals reach the apex of their power and slaughter an entire squad of armoured horseman, it feels well-deserved, rather than driven by cringy character shielding and railroaded plot like in so many movies."
    },
    {
      "rating": "7",
      "text": "/    /"
    },
    {
      "rating": "7",
      "text": "Good movie! I like how the movie takes time to show you how he became so strong and such a good fighter. The characters are pretty bland and Arnold doesn’t have many lines. Best part is where he punches a Camel.The action is also good. Very brutal and Barbaric hence the name. The bad guy is nothing special but he does a good enough job. Like i said there isn’t much personality from Arnold but he plays a good emotionless killing machine at least lol.This movie is far from a masterpiece but its one of Arnolds top 10 films i think. I fun film nonetheless."
    },
    {
      "rating": "3",
      "text": "This is one of those movies that leaves me not knowing what to think. On the one hand, it has become very popular and has a legion of fans, but the truth is that it looks like an extremely dated film and an extraordinary surrender to kitsch, with those costumes and props of somewhat dubious taste, fanciful and inspired by the original comics created by Robert E. Howard.The screenplay, written based on the original stories, takes place in an uncertain time in Antiquity, and begins with the massacre of a town or village by a group of warriors. A child, Conan, is taken as a slave and grows up as such, acquiring enormous stamina and strength at the expense of hard work. He thus becomes a bounty fighter and learns to kill. When he is free, he finds the path that leads him to a quest for revenge against those who massacred his family and took his freedom. Personally, I can't swallow the way this film (like the source material) chews up the past and creates a completely strange space-time reality, where Neolithic elements intersect with medieval props and creations invented for the film, such as the sword of Conan. The construction of the characters, the writing of the dialogues, the conception of the story, everything leaves something to be desired and reveals itself to be average and poor.If there's anyone for whom this movie was important, it's Arnold Schwarzenegger. This actor, now renowned, had his first big box office success in this film, and a job that opened the door to other films, particularly \"Terminator\". And in fact, the actor lived up to what was asked of him (it wasn't much, because his character is basically a muscular animal driven by anger and without any dramatic depth) and his work is the determining point for the success of the film. To be frank, seeing the way he manages, being aware of the relevance the film has had to his career, is the only plausible reason to see it. James Earl Jones also appears here and is the only actor capable of effectively playing a character, but he doesn't have much to do, appears little and seems to be out of his element and uncomfortable with the character.On a technical level, the film has an effective direction by John Millius and good cinematography, which makes good use of the filming locations. The sets and costumes, apart from any matter of personal taste, were well executed and look realistic. The biggest technical problem I've noticed is the primitive special effects and visuals, some of them shockingly obvious like the extra who, to simulate the swing of a sword, takes his hand to his shoulder, strategically placing a bag of fake blood that breaks out. The action scenes are the film's strong point and are heavily staged and theatrical, but they work and are somehow genuine. The film also has an atmosphere that leads us to think that it has given itself too much importance, something that the heroic soundtrack emphasizes and reinforces, which ends up being comical in itself."
    },
    {
      "rating": "4",
      "text": "This film has some strenghts: The music is epic, good and really suits to the movie. The set pieces are realistic and good looking (but they are not enough diverse). Art direction is cool. The effects are good but there are not enough effects in this movie. The fight choreographies are decent. However this movie has many weaknesses too: From acting that leaves more than a lot to be desired, a generic, blank and almost mute main character (Conan), a caricatural vilain (Thulsa Doom), completely blank secondary characters (Subotai, Thorgrim and Rexor.), a simple plot that is bogged down by random side quests (Becoming a gladiator, pushing a big wheel, the underground necropolis and the sword,...) and useless minor characters (the mongols slave masters, the witch, the priest, ...) met along the way, a love story that doesn't really work, this high budget movie is boring and it definitely is not good. In fact, by the time the plot was introduced (45 minutes), I had almost checked out of the movie. I'm honestly not sure why this film is considered a classic; it's not good, that's for sure!"
    },
    {
      "rating": "10",
      "text": "Probably the most underrated film of all time. It's score is acknowledged as one of Hollywood's finest, it's philosophical themes are unmatched (directed by the writer of Apocalypse Now) and it's the most true to history (even despite being a fantasy) to the bronze age- Iron age man"
    },
    {
      "rating": "9",
      "text": "This movie is under rated. One of the best fantasy movies ever made. Sure some parts might be dated but the story telling is solid. This movie is almost a silent film with it's dialog. Some people don't get that. Also it is brutal and tells next story of strength and overcoming. I can see in this day in age the concept might seem much for some. Bat they are just  weak. Writen by Oliver stone, and directed well. For whatever reason they didn't bring back the crew from this film to do the second movie. It was made to be a trilogie. Ahh that's how it goes. This is one of my favorite  movies."
    },
    {
      "rating": "7",
      "text": "Conan's tribe knows the secret of steel and forges invincible swords, but the evil Tulsa Doom and his men burn the village to the ground. Only a few children are saved, including Conan, who are captured and enslaved. Conan grows big, strong and determined to avenge the death of his people. Film entrusted to the skilful direction of Milius and to the muscles of Schwarzenegger. This is a good film, a film of great inspiration for subsequent epic / revenge films and inspired in turn by Hamlet. Good direction by Milius and screenplay by Oliver Stone."
    },
    {
      "rating": "8",
      "text": "Una obra maestra en tanto que la construcción de un universo intrigante y misterioso. Un una iconografía y filosofía fascinante, en que se contraponen el acero (materialidad) y la ideología (metafísica)."
    },
    {
      "rating": "10",
      "text": "There is a 75 character minimum for reviews. If your review contains spoilers, please check the Spoiler box. Please do not use ALL CAPS. There is no linking or other HTML allowed. Your review may be edited for content."
    }
  ]
}