{
  "id": 3864,
  "title": "Conan the Destroyer",
  "starring": [
    "Arnold Schwarzenegger",
    "Olivia d'Abo"
  ],
  "runtime": 103,
  "genre": [
    "Adventure",
    "Fantasy",
    "Action"
  ],
  "description": "Conan is commissioned by the evil queen Taramis to safely escort a teen princess and her powerful bodyguard to a far away castle to retrieve the magic Horn of Dagoth. Unknown to Conan, the queen plans to sacrifice the princess when she returns and inherit her kingdom after the bodyguard kills Conan. The queen's plans fail to take into consideration Conan's strength and cunning and the abilities of his sidekicks: the eccentric wizard Akiro, the warrior woman Zula, and the inept Malak. Together the hero and his allies must defeat both mortal and supernatural foes in this voyage to sword-and-sorcery land.",
  "releaseYear": "1984",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/m5i7S46DT1ESy7URkh2l92awGRr.jpg",
  "categories": {
    "plot": 6.166666666666667,
    "acting": 5.888888888888889,
    "ending": 4.5,
    "soundtrack": 8.0,
    "cinematography": 5.0,
    "familyFriendly": 6.25,
    "funny": 8.0,
    "action": 6.0
  },
  "reviews": [
    {
      "rating": "4",
      "text": "Boring movie with ridiculous fights, bad and redundant dialogues. Special effects outdated and the monsters ridiculous. Some characters and actors were also uninteresting, especially Grace Kellys wild warrior. Watch only the first Conan, it is much better."
    },
    {
      "rating": "8",
      "text": "Not an intellectual movie but also an entertaining and fun one. I view it as guilty pleasure and praise the awesome cast, humor and fantasy story. While I am at it I think the plot and characters can also be adapted for an awesome D&D adventure session. Lets start with a short overview: Conan is based on tales from Robert Ervin Howard starting in 1932. He is one of the fathers of the “Low Fantasy” genre or a least a really well know contributor. Low Fantasy is a setting that is our world with some magic, mythical or supernatural elements but more dark and grim as it hides not the dark sides of human nature (Like the Witcher for example). The prequel Conan the Barbarian was quite successful and made Arnold Schwarzenegger a household name. So a sequel was granted. The story starts when Conan and his companion the thief Malak are cornered by a group of soldiers after a quite successful robbery. After they (which means mostly Conan) defeated a lot of soldiers in a fierce battle Queen Taramis stops the fighting. She wanted to test Conans abilities against her guards and has a quest for him. He reluctantly agrees after he is promised something that is his ultimate goal. He searches the help of a friend the mage Akiro and Zula a female bandit warrior he saved earlier on joined the quest too. Here starts the actual story. It it is entertaining and fun. They toned down the blood, nudity and gore but increased the humor and have some good ideas. Like I mentioned for the prequel you get what you expect. An enjoyable fantasy adventure. If you wanted and intellectual Shakespearean experience you are in the wrong movie and should not even complain. There are a lot of memorable scenes like the mirror scene, the battle of (mage) wits and the climax. Lets go to the cast: Arnold Schwarzenegger is perfect for the role as Conan. He has the looks to be the stoic hero and archetype of barbarian. Then we have Wilt Chamberlain as Bombaata. Today he is a bit forgotten but he was probably the best NBA player of all times. He made a season with an average slightly above 50 points per game and in total over 4000 points (For comparison: Only Michael Jordan came above 3000 points per season). He is intimidating and makes even Conan look a bit inferior. He delivers for a non actor. Lets continue with singer, songwriter and actress Grace Jones as Zula. She fully delivers and was even nominated for a Saturn Award. Malak is played by Tracy Walter. He is for the comic relief / humor and works well. He has quite a great career and is also a good comedian. With Makoto Iwamatsu better known as Mako as Akiro we have another favorite. He is just awesome and had a legendary career. You might recognize him as Iroh from Avatar the last Airbender. Olivia d’Abo as princess Jehnna performance is often lampooned. I say she delivered the trope she was cast for as naive and quin-toxic princess. Together they are a great cast and I enjoyed them. The action scenes and battles work well. They are less bloody but well choreographed for this kind of movie. The special effects however are mixed. The practical effects still deliver but there are missteps especially around the climax. The soundtrack by Basil Poledouris is great again. As in the sequel he delivers an awesome performance that did not get the recognition he deserved. Like Ennio Morricone he tells or enhances scenes with his score. Overall this is a great enjoyable movie to watch. It will not challenge you intellectually but that does not mean it is entertaining."
    },
    {
      "rating": "4",
      "text": "I really like Conan the Barbarian, and while I heard Conan the Destroyer had a dubious reputation I was all for seeing it. Conan the Destroyer is disappointing, lacking the fun and kitsch magic of its predecessor. It does have its good things however, the scenery and costumes do look great and the special effects are an improvement I think. The ending is also fantastic and makes up for the truly dull middle section, and as the villainess Sarah Douglas is perfect. I am not sure whether I take the fact that there is more action here as before as a good or bad thing, either way it was quite exciting. Against all that, the score was rather uninspiring, most of the direction was flat, the story is meandering and dull and the dialogue is cheesy, Tracey Walter's dialogue especially is reminiscent of a badly written Scooby Doo episode. The acting is nothing to write about either, Douglas is for me the only good performer. Arnie is charismatic but the fact that he has more dialogue here than before does show his limitations as an overall actor, Grace Jones does little more than be sexy and hiss and fight, Tracey Walter is annoying with grating catchphrases, Olivia D'Abo is cute but hopelessly miscast and Wilt Chamberlain may have a towering presence but his acting is laughable. All in all, disappointing but I would hardly call it one of the worst sequels ever. 4/10 Bethany Cox"
    },
    {
      "rating": "6",
      "text": "/    /"
    },
    {
      "rating": "5",
      "text": "Massive downgrade from ‘Conan the Barbarian’ in my opinion. They complete removed the Barbaric gory kills which were the best part of the first one. Conan The Destroyer just seems far too silly for me. Its like a cheesy adventure film and its just lost that edge it had.Arnold has a few more likes and does a decent enough job. But the princess lady just kind of annoyed me really. Grace Jones’ character was pretty cool though. This movie is watchable but unfortunately doesn’t live up to the first film and ends up being very mediocre."
    }
  ]
}