{
  "id": 753,
  "title": "Confessions of a Shopaholic",
  "starring": [
    "Isla Fisher",
    "Hugh Dancy"
  ],
  "runtime": 104,
  "genre": [
    "Comedy",
    "Romance"
  ],
  "description": "In the glamorous world of New York City, Rebecca Bloomwood is a fun-loving girl who is really good at shopping - a little too good, perhaps. She dreams of working for her favorite fashion magazine, but can't quite get her foot in the door - until ironically, she snags a job as an advice columnist for a financial magazine published by the same company.",
  "releaseYear": "2009",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/6DH1iP06fcpjD7tppsTwcAyZfDR.jpg",
  "categories": {
    "plot": 3.2222222222222223,
    "acting": 5.222222222222222,
    "ending": 5.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 8.0,
    "funny": 3.1666666666666665,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "0",
      "text": "These comments represent the combined comments of my wife and me; they are not just my opinion. Even a score of zero may be too high. We normally like light fluffy movies but this was trite and predictable. The acting, with the exception of John Goodman, who is always good, was only fair. I would definitely save your money. I don"
    },
    {
      "rating": "1",
      "text": "This movie accomplished two things: it wasted money and it wasted time."
    },
    {
      "rating": "4",
      "text": "Whereas Hal Ashby's \"Being There\" satirized the anaesthetizing effects that television had on the baby-boomer generation, \"Confessions of a Shopaholic\" possesses a likeminded intention to lampoon the masses, but this time, the media form that the film attacks is the Internet, and its ancillary users, \"The Y Generation\"(also known as The Net Generation). In \"Being There\", Chance(Peter Sellers), a gardener with the intelligence of a peanut, convinces people that he's a brilliant economist. Rebecca Bloomwood(Isla Fischer) echoes the mentally-impaired gardener when a line like, \"Risky investment is like a pair of platinum boots,\" is confused for wisdom. The antecedent for this quote was: \"As long as the roots are not severed, all is well. And all will be well in the garden,\" delivered by Chance to great acclaim. Needless to say, the garden is not a metaphor; he's speaking plaintively. Part of the reason as to why Luke(Hugh Dancy) hires Rebecca is biological, but once she's on the staff, the editor explains his plans for her, advising the fashionista to speak in a language that people can understand; in laywoman's terms. In other words: dumb it down. Blogs, with its inclination towards lower word counts and uninformed opinions(not Susan M.'s), has been blamed for a retarding of people's ability to read longer articles, not to mention, books. Since Rebecca apparently knows very little about finance, she's in essence, a blogger, who has infiltrated the publishing industry. Hence, the satire, in an otherwise dreary picture about an absolutely ghastly woman."
    },
    {
      "rating": "5",
      "text": "Enjoyed the fashion and fun. Luke Brandon is every girls dream, together, strong, and understanding. Fun film is see, just do not expect an educational experience."
    },
    {
      "rating": "10",
      "text": "So cute! A perfect chick flick loved it! Will be buying it :)"
    },
    {
      "rating": "3",
      "text": "The main actor did a decent job with a lousy script and charisma-free supporting actors."
    },
    {
      "rating": "1",
      "text": "Horrid. The plots forces you to make so many illogical jumps that you feel vicarious embarrassment for all the superb actors in this film. It makes no sense on any level. Just to name a few problems; Isla Fischer buys Prada and YSL on a weekly basis on a young journalist's salary and she is only 16,000 in debt? Her boss hits on her while drunk on a work business trip and it's supposed to be romantic? Someone sells thousands of dollars of her clothes to a thrift stores in front of her face while she stands by and vocally protests? Hmmm that's illegal. A debt collector aggressively pursues her at her job? Pretty sure debt collectors want people to have jobs so they can pay their bills."
    },
    {
      "rating": "7",
      "text": "I am incredibly amazed that I didn't absolutely hate this."
    },
    {
      "rating": "10",
      "text": "Loved it! Perfect girls night flick!"
    },
    {
      "rating": "2",
      "text": "This movie is a romantic comedy without comedy or enough drama to make it at all entertaining."
    },
    {
      "rating": "2",
      "text": "This movie was such crap pardon my french, it should not be rated as a comedy but a tragic drama instead since the only funny part in it was when she froze her credit card. and even that wasn't funny, you can't even call this movie a chick flick, it had no charm to it at all :P just plainly dumb."
    },
    {
      "rating": "9",
      "text": "I absolutely love this film and have seen it many times, i think Isla Fisher and Hugh Dancy portray the characters brilliantly having read all Sophie Kinsella's sopaholic series."
    },
    {
      "rating": "2",
      "text": "What a stinker. They've Americanised and taken out everything that was funny about the original series, thus ruining said series. Having read them all...Anyway, I honestly hope they don't make another one. What a turd."
    },
    {
      "rating": "0",
      "text": "This movie is absolutely awful! It deserves a negative score. Very poor. Step back and walk away from the DVD, you won't regret it."
    },
    {
      "rating": "0",
      "text": "Easily one of the worst movies I have ever seen and certainly the worst I have ever paid to see. The plot held together like cottage cheese and made ridiculous plot hops from one scene to the the next. All of these ridiculous lurches in the story take place on top of a cast as unconvincing as i have encountered in recent memory. Save your money now by not seeing it in the theater; save your time later by not watching it at home."
    },
    {
      "rating": "6",
      "text": "Before you say i'm stupid, and i have no taste. I would like to say that i think this movie IS NOT that great. If you want a good movie, DON'T GO SEE IT, but maybe if you're in the mood for a cute chick flick, this might be the one for you. However, i have my own critiques: 1. The book was more witty, and you could see some many clothes and everything. but the movie was basically about the main plot, Rebecca Bloomwood who likes to shop, she's in debt, her bank manager comes after her, she is in Sucessful Savings, and Derek Smeath, her manager, while Luke Brandon is the guy she loves. While not being bright enough, the lady in the green scarf (you'll know what i mean when you watch it) tells lies, but it all pays off at the end. This movie doesn't deserve a really low grade, it's cute but it's not oscar worthy or anything like that. Nice try, but it needs work."
    },
    {
      "rating": "6",
      "text": "fashion galore ala SATC minus the originality ... patricia fields dresses us the film with so much flare which Isla Fisher wears well but sad enough Isla can hold the entire film from being more than a recycled attempt to capitalize on the SATC craze.. Hugh Dancy is perfect as is Isla but thats about it nothing new to be found here."
    },
    {
      "rating": "9",
      "text": "I really liked this movie. I could totally relate to the childhood brown practical 50% off shoes and the adult need for designer goods. I have a Prada bag, not because I necessarily like Prada but because I like the looks on strangers' faces when they see me with it."
    },
    {
      "rating": "10",
      "text": "This movie was really fun, i don't get why so many ppl hated it. It was harmless and hilarious. Isla fisher was amazing."
    },
    {
      "rating": "3",
      "text": "Worst book \"adaptation\" ever, all they kept were the names. . sticking to the books after leaving movie theater after 20 minutes!"
    },
    {
      "rating": "3",
      "text": "I got 13 minutes into watching this DVD and it was quite annoying, I may try it again but I think I will just give it my mother. Sad because gven the right role Ilsa could be a great comic actress."
    },
    {
      "rating": "5",
      "text": "Isla Fisher is such a charming actress, she can do better than the material in this movie. The idea behind this film is a good one, but the screenplay just doesn't take advantage of it. It's too routine and predictable. Good supporting cast."
    },
    {
      "rating": "6",
      "text": "If you know how to use your eyes is a good film which critics the rampant consumerism of capitalist society, talking like a heavy thing, but the movie brings reflection in a cheerful and humorous! Super Hollywood, but really liked it! A movie really interesting to see while the world is undergoing a financial crisis. A movie that besides being very funny, makes us think a little about the real value of things, consumer goods considered, perhaps, futile... and rethink this a bit absurd consumerism and publicist who are bombing targets daily."
    },
    {
      "rating": "6",
      "text": "I don't really understand why people didn't like this movie. My best guess is that a lot of the people who dis-liked it had read the books. I have never read the books or really had any desire to do so. I ended up watching this movie because my wife wanted to see it and I actually ended up enjoying it. The acting was solid and the movie moved it's self along at a nice pace. There were some parts of the movie that were a little clunky and out of place and some of the characters could have been deleted. Overall it's a very enjoyable movie and a good date movie."
    },
    {
      "rating": "1",
      "text": "CONFESSIONS OF A SHOPAHOLIC was like a chick flick gone terrible. I can admit that I do enjoy some chick flicks (such as SWEET HOME ALABAMA and JUST GO WITH IT), but this was one of those, \"OMG! It's SHOPPING day! We gotta get down and PARTY girls! Let's go to the MALL!\"-type of movies. Is that really your type of movie? Even if you are a \"shopaholic\" (quote-unquote) yourself, it just appears stupid to waste a whole hour and forty-four minutes of your life watching a stupid chick show that she CLEARLY doesn't know how to handle her money, along with keeping away from her ex-boyfriend (\"'cause OMG! He's such a stalkerrrrr\")."
    },
    {
      "rating": "10",
      "text": "It's not bad. You have to know what to expect. It's simply a cute movie. You just have to know that, and you'll be fine with it. It's the kind of movie I'd recommend for a rent, or to watch when it comes on tv. Will you be moved to tears or bust out of your chair laughing? Probably not, but if you just want to watch something easy, that you can just sit down and enjoy, this is a good one."
    },
    {
      "rating": "9",
      "text": "One of the best romantic-comedies I've ever seen. I don't know why some people hate it that much. It used jokes, which are so dull, so smartly, that you could do nothing but laugh. The fact is, that even though, the cast was excpetional and the message of the movie was unique, the plot was kind of expectable. It always is hard to transfer a book into a movie! Fiser is really talented and the portrayal of a shopacholic really suited her. It was an enjoyable movie, with much laugh and amazing message. The fact that it was expectable, isn't important, because as I was watching the movie, everything happened so fast, that you didn't think: ''Oh  I was sure this was going to happen!   Very optimistic and with promising actors, in my opinion."
    },
    {
      "rating": "10",
      "text": "This is a real rom-com! Hilarious dialogue, amazing cast, an adorable couple, and lots of trendy fashion! Isla Fisher and Hugh Dancy are both very talented."
    }
  ],
  "recommendations": [
    "thunder_force",
    "the_bucket_list",
    "couples_retreat",
    "good_luck_chuck",
    "the_change_up",
    "just_go_with_it",
    "what_happens_in_vegas",
    "evan_almighty",
    "no_strings_attached",
    "trainwreck",
    "second_act",
    "the_perfect_date",
    "the_twilight_saga_breaking_dawn_part_1",
    "17_again",
    "old_dogs",
    "the_game_plan",
    "coming_2_america",
    "my_spy",
    "pixels",
    "diary_of_a_wimpy_kid_the_long_haul",
    "alvin_and_the_chipmunks_chipwrecked",
    "knocked_up",
    "the_green_hornet",
    "zookeeper",
    "zack_and_miri_make_a_porno"
  ]
}