{
  "id": 4643,
  "title": "Conspiracy Theory",
  "starring": [
    "Mel Gibson",
    "Julia Roberts"
  ],
  "runtime": 135,
  "genre": [
    "Action",
    "Drama",
    "Mystery",
    "Thriller"
  ],
  "description": "A man obsessed with conspiracy theories becomes a target after one of his theories turns out to be true. Unfortunately, in order to save himself, he has to figure out which theory it is.",
  "releaseYear": "1997",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/wj0n6gci4EMWRhV9ozCKTgESGdB.jpg",
  "categories": {
    "plot": 6.428571428571429,
    "acting": 5.111111111111111,
    "ending": 6.666666666666667,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 5.0,
    "action": 10.0
  },
  "reviews": [
    {
      "rating": "8",
      "text": "This is one of those movies that really got to me.The characters are very well performed by both Mel and Julia.Various elements like paranoia that somebody is always watching.A true classic."
    },
    {
      "rating": "10",
      "text": "What's the matter with you people??Did you see what i see?Because this is one of the best movie ever...Not only Mel Gibson is absolutely perfect at his role and he showed us what talent means,but this movie has some great drama,crime,mystery and something like action a little bit!I recommend everyone to see it and in my opinion the 137,000,000 $ it took are not enough!"
    },
    {
      "rating": "7",
      "text": "People are suckers for conspiracy theories. This film is quite entertaining as it tickles the notion through this conspiracy obsessed protagonist.  Gibson seems to play well the guy verging on insanity."
    },
    {
      "rating": "5",
      "text": "Suffering heavily from an overall lack of chemistry and believability between its two leads, \"Conspiracy Theory\" also lugs a hefty amount of predictability and iffy writing across the finish line."
    },
    {
      "rating": "5",
      "text": "Conspiracy Theory isn't bad when it comes to most of the details, it's when we see the big picture that it becomes sloppy looking and barely pasted together. Roberts and Gibson have less-than-believable chemistry with an even less believable love story. The movie makes it look like Mel Gibson isn't even acting, the actor is just going through everyday life as a crazy, psycho conspiracy theorist."
    },
    {
      "rating": "4",
      "text": "Conspiracy Theory is a 1997 action, thriller type mystery film directed by Richard Donner who brought us classics such as Lethal Weapon and Assassins. .. Conspiracy Theory stars Patrick Stewart, Mel Gibson and Julia Roberts... The film starts off okay then as it drags goes downhill and the only good thing in my opinion about the film is Julia Roberts. Mel Gibson is totally ridiculous and some of the acting isn't great and it's a film I never really took to that much to be honest so it's not a great film and compared to Richard Donner's earlier works like Assassins and Lethal Weapon it's bad and even the first Superman movie Richard Donner made was better than Conspiracy Theory."
    },
    {
      "rating": "5",
      "text": "On paper this should be a great movie. The cast, the cinematography, the plot. But the shame of it is it never finds a consistent tone and the chemistry just isn't there between the leads. Add to the that some terrible soundtrack choices and a screenplay that meanders around its complex characters and situations with little grace. Huge missed opportunity."
    },
    {
      "rating": "10",
      "text": "This movie is so underrated, it's very cool! This movie is so underrated, it's very cool! This movie is so underrated, it's very cool!"
    },
    {
      "rating": "10",
      "text": "Overwhelmingly well performed acting, really impressive. I love the setting and how you slowly figure out what´s going on. I had no problems matching the different groups and their interests like other reviewers criticized. Lovely Soundtrack. Also the chemistry between the protagonists respectively the love story does look very good and delivers perfectly, it´s really heart touching, a match made in heaven. I don´t believe in those conspiracy theories in real life, but within the movie it´s pretty nicely done and fits in. You got action, drama, love story and even some kind of mystery in this movie. Some critics mentioned the predictability of this film, but I didn´t see many things coming so at least for me it was always pretty thrilling. Excellent movie."
    },
    {
      "rating": "8",
      "text": "Conspiracy Theory is a good detective thriller with detective elements. A prime example of a great thriller from the 90s. A great actor blows. Still young enough Mel Gibson and Julia Roberts. But Patrick Stewart clearly does not age) If at the beginning the film begins to be perceived as a comedy, then over time the viewer begins to pay attention to all the details that Jerry notes. The viewer is slowly immersed in the plot, the viewer can compare herself with Alice, who also at the beginning did not pay attention to everything. The final is somewhat crumpled, and the final is open. After watching the film, you begin to treat paranoids differently."
    },
    {
      "rating": "0",
      "text": "Il y avait de l'idée dans ce personnage complètement parano, exemple parfait de la théorie du complot ou plutôt des (innombrables) théories du complot et des (innombrables) complots (au super pluriel) ourdis sans arrêt  par des salopards de comploteurs qui passent leur vie à comploter en cachette, partout et tout le temps !Et qui visent essentiellement ce pauvre chauffeur de taxi, lui le seul à savoir; à connaître la vérité sur les super comploteurs qui mettent en péril le monde entier... lui seul a vu les envahisseurs un soir dans son taxi et même qu'il aurait été enlevé par les \"Roswell\", les **** hommes gris, les proctologues de l'espace pour une série de tests très invasifs !Et donc depuis lors, il l'a mauvaise, car il sait que les proctologues sont payés par la CIA ! et qu'ils ont tout organisé, tout planifié, exprès pour lui et contre lui...Et donc... si seulement... mais non, hélas ! car dans ce film du cave Richar Donner avec ici un Mel Gibson insupportable de surjeu et de beauferie comploteuse à deux dollars, tout est vrai, vraiment vrai et le super débile parano a raison, voyez-vous ! et la grue à grande et sale gueule est là pour écouter ses conneries et le suivre !Si seulement, c'était du 3ème, 4ème, 8ème degré... mais non, non, non : ce film entier est un dîner de cons non-stop bloqué entièrement au tout premier degré. Et ça, c'est hallucinant, aussi hallucinant qu'ultra consternant, très con-sternant, infniment consternant, pathétique et pitoyable..."
    },
    {
      "rating": "4",
      "text": "This film is strange, as it seems to go in so many directions that it is going nowhere. Anyway, and despite a weak and little intriguing start, it revealed to be improving and captivating my attention over time.The film is based on Jerry Fletcher, a taxi driver obsessed with government conspiracies, who runs an insignificant subscription periodical, where he shares his ideas, and has an obsessive passion for Alice Sutton, a government official he often visits. One day he is caught and tortured, which indicates that someone took some of his ideas seriously, but Alice realizes that something really may have happened to that man, which leads her to try to help him.The film is ultimately average. It starts slowly, in an uninteresting way and takes its time to develop, but it was necessary to understand what would come next. For me, things only started to get interesting when the main character was caught and tortured. At about two hours and fifteen minutes, it is an excessively long film for the content it presents, and has so many twists and turns that it can leave the audience confused and without interest in what they are watching. Another thing that caught my attention was the similarity with the film \"The Pelican Brief\", not only due to the participation of the same main actress, but also due to the similarity of the story told.The cast is dominated by two central names: Mel Gibson and Julia Roberts. Both collaborate well together, although I was left with the feeling that there was little chemistry for a romantic couple. Gibson looked more like an obsessed maniac than a man in love. In fact, Gibson doesn't seem to know how far his character's sanity goes and his performance ends up reflecting that, with many exaggerations and a lack of psychological depth. Roberts is good enough in a very psychologically underdeveloped character. As this is an obsessive and paranoid thriller, it would have been interesting to see these two characters with more psychological wealth and less appearance, but these are scriptwriter mistakes. Finally, a word to Patrick Stewart, in a discreet performance that seemed effective.It is not a film that stands out due to technical requirements or production values, having a regular cinematography. Some scenarios, like Fletcher's house, were very well designed and the special effects are good."
    }
  ]
}