{
  "id": 1042,
  "title": "Constantine",
  "starring": [
    "Keanu Reeves",
    "Rachel Weisz"
  ],
  "runtime": 121,
  "genre": [
    "Fantasy",
    "Action",
    "Horror"
  ],
  "description": "John Constantine has literally been to Hell and back. When he teams up with a policewoman to solve the mysterious suicide of her twin sister, their investigation takes them through the world of demons and angels that exists beneath the landscape of contemporary Los Angeles.",
  "releaseYear": "2005",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/vPYgvd2MwHlxTamAOjwVQp4qs1W.jpg",
  "categories": {
    "plot": 7.095238095238095,
    "acting": 7.0,
    "ending": 7.444444444444445,
    "soundtrack": 5.666666666666667,
    "cinematography": 9.0,
    "familyFriendly": 3.0,
    "funny": 6.333333333333333,
    "action": 5.125
  },
  "reviews": [
    {
      "rating": "10",
      "text": "The best movie ever for me. People who don't like it, are some kind of anti-religious fanatic. Just read their comments and you'll see.\rIt's from the graphic nover masterpiece of Vertigo: Hellblazer by Alan Moore you ignorants."
    },
    {
      "rating": "9",
      "text": "Pretty good and I hope they make a sequel. Constantine keeps you interested through out, Features a good cast, and an interesting story as well. I really enjoyed it."
    },
    {
      "rating": "8",
      "text": "As comic book movies go this is a good one. I can't speak for faithfulness to the comic but as a film it works. Dark and atmospheric just dripping with religious overtones and occult lore. Great supporting cast with bonus points to Tilda Swintons mad Gabriel, and Constantines eager wannabe partner Shia LaBeouf. Not unmissable but certainly worth seeing."
    },
    {
      "rating": "9",
      "text": "Even though the movie is a few years old. Mostly forgotten. I had to rewatch it. I really don't get all the negative reviews and critics bashing it. Reeves does a great job as always. He nails the cynic part of John Constantine described in the comics.  The story kept me engaged and the way the demons, and angels are accurate to what i imagine. the manor isms in which they possess and attack portray a thrilling and creepy feeling.  Even the music score helps keep the feelings of the movie going.  Interesting spiritual and religious perspectives are portrayed as well. Whether you agree with them or not  they can be interesting.  I see complaints about plot holes  but no where on the internet can i find any said plot holes...Nor did I notice anything in the movie.  unlike other movies where you can outright find problems in the story or research storyline failures everywhere. I think people/critics were just looking for reasons to bash this movie for reasons they are too embarrassed to admit. Whether that be they are offended religiously or are still hating on Neo from The Matrix. Grow up people. Have an open mind. And enjoy a unique and enjoyable movie."
    },
    {
      "rating": "10",
      "text": "Constantine seems For me an underrated film. Meanwhile, it is not perfect, but nevertheless had some good ideas, good special effects, moments of terror and great actors."
    },
    {
      "rating": "9",
      "text": "[9/10]\rPros:\rGood ideas, good special effects, moments of terror and great actors and action.\rCons:\rConstantine seems For me an underrated film. Meanwhile, it is not perfect...but pretty awesome.\rExpecting a sequel."
    },
    {
      "rating": "8",
      "text": "It isn't the best movie in the world, but there it is a fun one.  Great effects, mostly uninteresting characters and an interesting and engaging narrative (I know the comics are better, but for an adaptation it isn't that bad.)\r Overall:\rFor what it is, it's an entertaining movie that I enjoyed immensely."
    },
    {
      "rating": "9",
      "text": "niihihibyvbjinknomjooninugugguyfuguguhihojojjjiopiytteqsxfnmkljfeyjiouynmhygbgcswdfgtrh````````````````````````"
    },
    {
      "rating": "8",
      "text": "Though Constantine feels like at least four different movies rolled into one, it is visually stunning and easily one of the best DC movies ever released."
    },
    {
      "rating": "8",
      "text": "A good movie one of Reeves best roles he played it surprisingly well, I'm an Atheist but the Religious dogma certainly plays well in a fantasy movie."
    },
    {
      "rating": "8",
      "text": "Decent Movie!engaging story and screenplay great acting more of a exploring side of character rather than comicbook origin story!"
    },
    {
      "rating": "8",
      "text": "Good movie especially for its genre. Its a based on a great comic and is a decent translation."
    },
    {
      "rating": "10",
      "text": "Definitely a great movie. Keanu Reeves portrays a great character, doesn't matter if that is not exactly the same as the comics version. This deserves sequels with Keanu."
    },
    {
      "rating": "10",
      "text": "This movie is funny, dark and different from all other comic book movies. It's visuals are awesome and so unique. Fantastic story, fantastic acting."
    },
    {
      "rating": "10",
      "text": "o filme e bom com quimicas com os personagem trilha sonora muito boa os atores sao bons cenes com o diabo sao boas e fodase se nao e igual e bom vai toma no cu"
    },
    {
      "rating": "10",
      "text": "ironically this is the best dc movie and the most underrated modern classic to date its ironic best dc express no interest to the reimagining of Constantine that's still infinitely better than the failure of DCEU since its inception in 2013. u would think warner bros would be smart enough to green lit the sequel for a future crossover with this universe into their garbage dceu universe for a possible live action justice league dark movie. according to keanu reeves at Constantine: 15th Anniversary Reunion | Comic-Con@Home 2020 they discussed the ideas of the sequel and they never followed through and had no interest on continuing it. so for me keanu reeves is my favorite version of Constantine and he was the one who even introduced me to this character"
    },
    {
      "rating": "10",
      "text": "This is certainly one of the best movies I've ever seen. Sure Reeves wasn't in his top gear at the moment or Rachel either but a film with that story, plot is rarely seen. It has got some funny moments which are really well placed in scenes. I noticed that critics here at Metacritic critics usually spit and rate films poorly  which are based on supernatural... In this case: Demons, Angels, God, Devil, Exorcism... I can't remember when was the last time I saw a movie about that (Angels,... ) rated above 70% (critics, not users)."
    },
    {
      "rating": "6",
      "text": "This movie could have been much better. Just cutting out the whole section about the little guy that lived in the bowling alley would greatly reduce the 'supernatural gobbledegook' one critic mentioned. And the dialog soundtrack, as noted by a user critic, is often unintelligible. There's an internal conflict between the tone of the movie (so heavy and serious and dark) and some of the imagery used--like Constantine firing gold bullets at demons from a gold shotgun welded to a gold crucifix. In these scenes I felt I was watching an episode of Angel that was taking itself too seriously. Cutting out some of this stereotypical demon stuff would work fine, since as many critics note, and I agree, the plot is incomprehensible and therefore meaningless, and the high points of the film are the the photography and gothic atmosphere. I thought the four main actors were good: the exorcist (Keanu), the cop (Rachel), Gabriel and Lucifer. In the end, I gave it a 6 because I couldn't give it a 5.5; I'm generally a sucker for this type of movie, so the critics 5 is probably more accurate. Its a shame that in this genre there are so few good movies. I mean, what theme could be more important?"
    },
    {
      "rating": "10",
      "text": "Really cool and dumb-free movie, go sleep in your pet's bed and dream another show if you do not like this cool-filled movie, your eyes will burn if you watched this cool movie. The demon effects are so cool and the crossbow looks totally gold and original!\r I really like this movie and I've never stopped from watching this!"
    },
    {
      "rating": "3",
      "text": "I have better things to do than watching Keanu Reeves bad, bad, grumpy mood for 2 hours. Everything about this movie is a mess, and it is dragged down by it's ludicrous premise. Roger Ebert pointed out that all of Constantine had to do would be to go to a priest to get a confession. That's how this movie feels: pointless. It is chaotic, has a lot of bad production designs and a hero nobody cares about, because he is a douchebag that keeps smoking even as he has cancer. The crew must have been giggling from scene to scene, thinking they could get away with this joke of a movie."
    },
    {
      "rating": "1",
      "text": "Very childish Directors should treat the audience with more respect to their intelligence."
    },
    {
      "rating": "3",
      "text": "I thought this movie was terribly shallow. It was like watching the Matrix with none of the flair. I'm not comparing it to the Matrix because it's got Keanu Reeves in it. I'm comparing the two movies because Constantine tries to actually be the Matrix, with similar settings and moods. Unlike the Matrix, however, this movie doesn't draw you into its world; it just gives you what there is. It's completely shallow, and not worth anyone's time. I should also point out that a wise-assed attitude on Constantine's part wasn't about to save the movie. Neither were the actors and actresses, who are good in other films, but in this one, they seemed to not care. There were no saving factors here. In fact, I'm pretty sure I wouldn't have minded if the Devil had won in this one."
    },
    {
      "rating": "0",
      "text": "While I am willing to concede that this movie might be slightly more enjoyable to those unfamiliar with the source material, 'Constantine' does little to make itself anything more than a dumb supernatural action flick.  Whatsmore, it doesn't even succeed on that front.  For those who are unfamiliar, 'Constantine' is very loosely based upon the comic 'Hellblazer' which has been in print for more than 20 years. Both, focus upon the exploits of John Constantine, though the movie has taken a number of liberties with the character.  Originally blonde, British, and combining occult knowledge with urban street-smarts, John Constantine is played by Keanu Reeves in one of his worst performances to date. I personally don't have anything against Mr. Reeves as an actor, but his attempts to portray Constantine (by the way, it's supposed to rhyme with Clementine. They pronounce it incorrectly throughout the entire film.) as a troubled man haunted by his past come off as wooden and unbelievable.  The one good thing I can truly say about this film, is that it encouraged me to look into the comic. Upon doing so, I discovered that most of the scenes or set pieces, that I found interesting or unique in the film, were taken directly from the comic and that the rest of the plot of the film consisted of nonsensical mythos that doesn't fit into the logic of the comic or Catholicism in general.  That's not to say that I found it confusing. It simply didn't make sense.  For example, the movie talks about the Demon Mammon who apparently is Lucifer's son. However, in Christian mythology, Mammon is simply a high ranking Demon in Hell, much like Beelzebub.  These kinds of inconsistencies make the mythos feel arbitrary at best.\r Ultimately this film fails to establish itself as a good action movie, due to poor fight scenes, and excessive emphasis on an inherently flawed mythos. It feels more like a ripoff of its source material than it does an adaptation.  I can't recommend it as an action film, as a thriller, or as a horror, so ultimately I've got to give this a 3 out of 10.  It isn't completely devoid of enjoyable elements, but isn't nearly as good as it *should* be."
    },
    {
      "rating": "6",
      "text": "The Angels verses Demons thing has been done a lot now and Constantine does have some good ideas but does not do much interesting with them. I never felt as if I understood, related to or cared for Keanu's character during this movie which is disappointing considering there was more potential. Constantine is worth a bit of time but don't expect much."
    },
    {
      "rating": "1",
      "text": "No, \"Constantine\" is not part of a trilogy including \"Troy\" and \"Alexander.\" It's not about the emperor at all, but about a man who can see the world behind the world, and is waging war against the scavengers of the damned. There was a nice documentary about emperor penguins, however, at Sundance this year. The males sit on the eggs all winter long in like 60 degrees below zero.\rKeanu Reeves plays Constantine as a chain-smoking, depressed demon-hunter who lives above a bowling alley in Los Angeles. Since he was a child, he has been able to see that not all who walk among us are human. Some are penguins. Sorry about that. Some are half-angels and half-devils. Constantine knows he is doomed to hell because he once tried to kill himself, and is trying to rack up enough frames against the demons to earn his way into heaven.\rThere is a scene early in the movie where Constantine and his doctor look at his X-rays, never a good sign in a superhero movie. He has lung cancer. The angel Gabriel (Tilda Swinton) tells him, \"You are going to die young because you've smoked 30 cigarettes a day since you were 13.\" Gabriel has made more interesting announcements. Constantine has already spent some time in hell, which looks like a post-nuclear Los Angeles created by animators with a hangover. No doubt it is filled with carcinogens.\rThe half-angels and half-devils are earthly proxies in the war between God and Satan. You would think that God would be the New England Patriots of this contest, but apparently there is a chance that Satan could win. Constantine's lonely mission is to track down half-demons and cast them back to the fires below. Like Blade, the vampire-killer, he is surprisingly optimistic, considering he is one guy in one city dealing on a case-by-case basis, and the enemy is global.\rConstantine has a technical advisor named Beeman (Max Baker), who lives in the ceiling of the bowling alley among the pin-spotting machines, and functions like Q in the James Bond movies. Here he is loading Constantine with the latest weaponry: \"Bullet shavings from the assassination attempt on the Pope, holy water from the river of Jordan, and, you'll love this, screech beetles.\" The screech beetles come in a little matchbox. \"To the fallen,\" Max explains, \"the sound is like nails on a blackboard.\" Later there is a scene where Constantine is inundated by the creatures of hell, and desperately tries to reach the matchbox and get those beetles to start screeching.\rRachel Weisz plays Angela Dodson, an L.A. police detective whose twin sister, Isabel, has apparently committed suicide. Isabel reported seeing demons, so Angela consults Constantine, who nods wisely and wonders if Isabel jumped, or was metaphysically pushed. Later in the film, to show Angela that she also has the gift of seeing the world behind the world, Constantine holds her underwater in a bathtub until she passes out and sees the torments of hell. No bright white corridors and old friends and Yanni for her. You wonder what kind of an L.A. cop would allow herself to be experimentally drowned in a bathtub by a guy who lives over a bowling alley.\rTogether, they prowl the nighttime streets. At one point, Constantine needs to consult Midnite (Djimon Hounsou), a former witch doctor who runs a private nightclub where half-angels and half-demons can get half-loaded and talk shop. There is a doorman. To gain admittance, you have to read his mind and tell him what's on the other side of the card he's holding up. \"Two frogs on a bench,\" Constantine says. Could have been a lucky guess.\rThere is a priest in the film, the alcoholic Father Hennessy (Pruitt Taylor Vince), whose name, I guess, is product placement.\rThe forces of hell manifest themselves in many ways. One victim is eaten by flies. A young girl is possessed by a devil, and Constantine shouts, \"I need a mirror! Now! At least three feet high!\" He can capture the demon in the mirror and throw it out the window, see, although you wonder why supernatural beings would have such low-tech security holes.\rReeves has a deliberately morose energy level in the movie, as befits one who has seen hell, walks among half-demons, and is dying. He keeps on smoking. Eventually he confronts Satan (Peter Stormare), who wears a white suit. (Satan to tailor: \"I want a suit just like God's.\") Oh, and the plot also involves the Spear of Destiny, which is the spear that killed Christ, and which has been missing since World War II, which seems to open a window to the possibility of Nazi villains, but no."
    },
    {
      "rating": "5",
      "text": "The premise is intriguing, and works to an extent thanks to Keanu Reeve's charm as the lead, but without going deeper into its material it's only mildly exhilarating, with a side of unintentional humor."
    },
    {
      "rating": "6",
      "text": "manuel..ConstantineAlong an intriguing concept comes a promising script which Constantine may not be able to offer since the screenplay isn't gripping enough but still hits its mark."
    },
    {
      "rating": "4",
      "text": "O filme não é ruim, mas a enorme quantidade de clichês, a releitura fraca do cristianismo, as cenas de ação medíocres e plot nada convincente me impossibilitam de gostar desse longa.Audio: English, with portuguese subtitles. J4300 32' TV SpeakersQuality: 720p SDR [bluray]"
    },
    {
      "rating": "10",
      "text": "This is one hell of a film, watch it and be blown away."
    },
    {
      "rating": "8",
      "text": "Constantine is not your usual supernatural, no Constantine breaks all the rules that the genre has put in stone, it breaks down the wall and builds a new one based on it's own mythology. And may I say that it does a n amazing job at that. This film is not something I usually watch, in fact I was very skeptical when I deiced to view it just to see if it was any good, boy was I surprised! Constantine was amazing!! This film blew my hair back and took my breathe away. This film is bathed in dark but equally bright tones, it mashes them together so well to blend in with the films story That the filmmakers make it look like something whole different form our world. The theme of the movie is not what I'd call religious or spiritually at all but it works. And that's why the film works,this film works on a whole different level than most comic book adaptions and even most supernatural thrillers it put's it case and makes a statement most films don't have the balls to do and they do it with such style and grace that this film just blows away the competition and makes other supernatural thrillers look like seaseme street, and I mus say that's hard to do. Seeing as most films in this genre crash and burn this one takes off to new heights and makes you see what you've never seen before. Keanu Reeves( who in my opinion is an awesome actor.) turns in one of his best and most powerful performances of his career as a man who been to the ends of life and back. And Keanu does it with such style and grace that John Constantine that you just can't hate. This film is not as you expect it too be, when you pop in this film you expect it to be your usual supernatural thriller, but you get so much more. You get a trip into a world that nobodies ever seen before and you come our saying \"Hey that was actually pretty cool.\" And then you know that you've gotten what your money's paid for."
    },
    {
      "rating": "5",
      "text": "Nice visuals and this part did fit Keanu well, but it got pretty bad near the end (except for Peter Stormare as Satan-perfect) and I wish that the story would have been fleshed-out a little bit more. It's still mediocre though and has enough redeeming qualities to check it out once on DVD."
    },
    {
      "rating": "9",
      "text": "I managed to sit through the entire thing without fuss, great movie. The blurb on the back of the blu-ray cover indicated a totally different film to what I ended up watching, action wasn't totally lacking but I would've liked to have seen more. However, what Constantine turned out to be was wonderful both in story and visually. I'd never read or even heard about the comics but like anyone else once you hear human versus demons it's a must see, and Constantine lived up to expectations, just a little more quiet than expected."
    },
    {
      "rating": "6",
      "text": "Wow! Pretty good movie! I love the action scenes but the acting is kind of shallow. The movie's dark satanic plot is going to keep you hooked although Keanu Reeves didn't act so well. However, his attitude fits perfectly with John Constantine's. A must-watch!"
    },
    {
      "rating": "4",
      "text": "What was it that Keanu was mumbling throughout this thing? Does it matter? Do I care about the story? Why is there no suspense? Who cares. It earns its four stars by way of its look, (hell, fully realized!) and the threat of more demons, half-demons, quarter-demons, and demi-demons materializing in full CG intensity at any moment."
    },
    {
      "rating": "6",
      "text": "Pretty entertaining taken on its own, but compared to Hellblazer it doesn't have a leg to stand on. I do like it. If it'd been a faithful adaptation, though, with less of the christianity and more of the cocky blond scouser we know and love...it could have been epic."
    },
    {
      "rating": "9",
      "text": "I saw it twice and I still say that is a very good movie, i mean as a whole thing. Great effects, unexpected thrills (like the one the man is crashed by a car) and a constant intriguing noir mood. I think some poeple with catholic beliefs may undertand better some references in the movie; even it's a fiction and despite some superstition related passages, it represents visually some paradigms of cristinism quite credibly good. I dare to say that lot of haters doesn´t identify themselves as religion erudicts, it becomes uninteresting and sensless to them as the movie developes itself. Keanù's acting may be better but it doesn't affect teh overall rating."
    },
    {
      "rating": "6",
      "text": "Whilst never going to set the world alight, Constantine is a fun action / horror romp. Keanu Reeves is well cast and Rachael Weizse is unbelievably hot. The effects are descent... and Peter Stormare as The Devil? Who can say no to that?!"
    },
    {
      "rating": "5",
      "text": "Somewhat entertaining but the story is almost completely incoherent. Reeves is okay.."
    },
    {
      "rating": "8",
      "text": "Angels and demons battle it out on Earth, but consistently seek to keep the balance between the light and the dark. However, when the Spear of Destiny is discovered in Mexico, it sets into motion a series of events that sees the son of Lucifer, Mammon, be summoned back to Earth. The only thing standing in the way of Mammon and any other half-breed demons that seek to try and possess humans is John Constantine (Keanu Reeves). A demon slayer armed with crucifixes, a gold-plated gun in the shape of a cross, and copious amounts of holy water, Constantine is an impure soul. With a soul long ago claimed by Lucifer (Peter Stormare) for his suicide attempt as a young boy, he consistently seeks retribution by deporting demons back to hell in the name of God. With a soul in hell and a spirit in heaven, Constantine is the perfect man to enforce the balance between heaven and hell on Earth that demons consistently test.Found by Angie (Rachel Weisz) after the suicide of her psychic twin sister, Constantine is tasked with restoring the balance between good and evil no matter the costs to himself or others. In waging this holy war against those that wish to sink humanity into the pits of hell, Constantine naturally hopes to seek favor from God in order to make amends for his mortal sin. Yet, in learning from the angel Gabriel (Tilda Swinton) that he is damned and will remain damned, Constantine continues his spiral of self-destruction. Killing himself by smoking cigarettes that have led to terminal lung cancer, Constantine is the quintessential noir protagonist. Cynical, chain smoking, and cooly charismatic, Reeves both damns the world around him in his language, is deeply jaded, and knows how to deliver random bursts of wit with the requisite zip to make the dialogue pop and feel natural. He is the perfect man for this role with the natural charisma to make him appealing, but the dour demeanor that makes his overwhelming cynicism come off authentically.Yet, it is Peter Stormare who steals the show in this film. Appearing for a brief moment towards the end as Lucifer, Stormare's menacing, sadistic, and devilishly terrifying turn as the very embodiment of evil is the highlight of this film. However, it largely becomes the highlight because of Francis Lawrence's smart and strong direction up to that point. While he allows Stormare's Lucifer to command the screen at the end, until the climax we never actually see him. Instead, his presence is allowed to be felt and linger in the actions of the demons and wicked in the world, creating an omnipresent darkness that descends upon the screen throughout the film. By the time we see him, Stormare is practically set up to disappoint with how ominous the film feels in anticipation of seeing Lucifer for the first time. Yet, through his true embodiment of the fallen angel, Stormare is a sinister and truly demonic presence that chews up the scenery and more than lives up to the hype.As a sinner battling for his own soul, Constantine's battle with Lucifer and the demons of the world is most certainly spiritually significant for anybody watching the film. Paralleling and bringing to life the very real battle waged daily by every person alive to ensure that their soul goes to heaven, the film brings to life the demons that stalk the world and sinister dark arts that surround us all. Waging war through religion, putting himself on the line for others, and leaning on the power of God for extra strength are all actions undertaken by John Constantine as he does battle with Mammon, the sinister Gabriel, and Lucifer. By turning to God and using both His word and His promise to humanity as his source of strength, Constantine is able to overcome all evil he encounters, even if it is the natural evil that resides within himself and urges him to sin. He is able to stamp down this temptation and put God first in his heart and mind. Yet, his struggle until the climax highlights the struggle we all face. Being righteous seeking reward through a spot in God's home is not righteous. It is hollow righteous in the name of self-gratification. It is only when he sacrifices himself and opens up his soul to be finally claimed by Lucifer to save another person from hell does he actually receive the forgiveness he had fought for all these years. Through selfless and second nature self-sacrifice, he is able to receive the absolution he has long fought for, but not until then."
    },
    {
      "rating": "9",
      "text": "Hodgepodge is a word that springs to mind after having seen Constantine. Not in a bad sense mind you, but more in the way that the movie intersperses impressive moments with lesser ones. Overall I was amused by Constantine as he is portrayed by Keanu Reeves: a chain smoking film noiresque anti-hero whose has the gift to send demons back home: back from where they come: Mexico.. eh Hell. He reminds me a bit of Rick Deckard as played by Harrison Ford in Blade Runner  in the way he seems like the same kind of a loner, more prone to silence than chatting and possessed with unique skills or powers in the case of Constantine.\r Here however the two deviate in what I find the lesser -Constantine- and the better one -Deckard -. While the latter has skills, but otherwise isn't really different that you and me, the first is special because he has unique gifts. This is is because Constantine is another one of those marvel heroes bestowed with special powers. Something that seems to intrigue the American mind to the point of bafflement. For a country that so advocates the idea of being able to make oneself: from rags to riches they are oddly fascinated by people inflicted or blessed with supernatural powers by birth. While these two angles seem to be in opposition, one is achieved, the other 'bestowed' it really isn't in the result: either way the person involved soars above the humdrum of the grey unremarkable masses of people. It is something intrinsic in the culture I guess.\r The movie makes sure that we never get bored. There is a lot going on although in the rush they kind of forget to develop the tale well. It almost feels like someone took a stack of dc novels and cut out the best parts and turned them into scenes. So it feels like the movie jumps from one scene to the next without slowing down to establish character or take a breath. This jumble of, granted otherwise cool images, makes the movie sometimes laden with scenes that feel superfluous and feels unfocused. There are lots of scenes around the guy who picks up the spear of destiny, an important object in the story, and who makes his way to an unknown destination wreaking havoc on the way.  It is almost glued onto the movie as an afterthought and the guy who picks up the spear is a total nonentity. He isn't even given a single line of text but gets a lot of screentime.\r The mix of better and lesser parts is also visible in the way the camera is handled. At times there are cools shots one of which is where the camera looks down on Reeves and LaBeouf exiting a building and pausing for a short moment in the most left of the screen in front of the doors so Reeves can light a cigarette. The next shot however is a run of the mill  wide shot. And then we switch to the topshot again when Reeves smokes.\r This messiness can also be seen in the cast. Reeves runs into incredible cool characters like Gabriel, played by  Tilda Swinton and Satan, portrayed by Peter Stormare, but others, notably the main female lead played by Rachel Weisz, who plays the damsel in distress,  are unremarkable.\r The story itself notably suffers from a lack of focus because there is no visible enemy to combat. Most movies focus on one particular enemy, usually assisted by lesser ones who get knocked about before the main enemy is tackled.  In Constantine the real enemy is mostly an unknown quantity. It is like fighting shadows.\r Finally the powers of Constantine detracts from the story as well. At various moments he suddenly has some kind of unannounced power that he demonstrates to make the story move forward. It feels like the makers of the movie attribute some powers to Constantine because they got stuck in the storyline.\r Since I use a strict system of 0,1,5,9,10 I give this one a 9 for it is certainly not a 5."
    },
    {
      "rating": "10",
      "text": "Tirando a performance razoável de Keanu Reeves. Esse filme é impossível um ator estragar,com super cenas de ação e efeitos especiais arrasadores. Rachel Weisz é perfeita aqui,\"Moreninha Gostosa\",legal ver Shia LaBeoulf no começo da carreira Djimon Hounsou está ótimo,Peter Stormare é fenomenal em uma épica performance.\rFrancis Lawrence Manja na direção com um bom roteiro de Kevin Brodbin e Frank A. Cappello."
    },
    {
      "rating": "9",
      "text": "I watched This movie about 2 years after it came out or so, there aren't many movies where a exorcist has problems of his own, that are as well established as in this film, so the movie is a bit unique, in the genre of exorcist movies, because they rarely delve into what it would be like for a cynic to be an exorcist, of course a lot of people don't like the movie for various reasons, I enjoyed the movie and would love to see a sequel."
    },
    {
      "rating": "2",
      "text": "Is it just me, or is this film a whole lot like Night Watch from the year before.  It is supposedly based on a graphic novel, Hellblazer, but the premise and much of the visual effects seem too much like Timur Bekmambetov's crazy movie that was nominated for Best Foreign Language Picture.  Maybe Timur drew from the same source material.  In any case, Timur's movie is infinitely better than this grossly over the top supernatural action movie, which probably would have benefited from having Nicholas Cage, and not Keanu Reeves, in the title role.  At least, Nic has experience in this type of movie.More perplexing is why Tilda Swinton or Rachel Weisz wanted any part of it.  Maybe it looked better on paper.  Translated to the screen it becomes an orgy of demonic images strewn together with all the subtlety of someone who makes music videos.  Oh wait, that's what Francis Lawrence does.  From the get-go, we are dragged into this infernal drama with little in the way of tension or suspense.  You know there is going to be hell to pay, the only question is what the body count will be. Keanu looks completely out of place in this movie, as he tries to draw upon a world-weary look of someone who has had to fight demons all his life.  He never manages to capture it.  The gelatinous white make-up and black eyes don't help either.  Rachel is better, just because she is a better actor, but even she struggles to come up with the right expressions for her mixture of surprise and acceptance as the eventual bride of Lucifer.  I would attach a spoiler alert but it is so obvious, I don't think anyone will be upset.  Besides, if you haven't seen this movie by now, you probably shouldn't even bother.What got me is all the emphasis on suicide and the eternal damnation one must face for taking one's own life.  Surely if God is merciful, he would have a soft spot for someone who takes his or her own life.  No, we are dealing with old world Catholicism here, when suicide victims were buried outside the church walls, as if they might be a bad influence even in death.In Alan Moore's dark world there is no mercy at all, for the living or the dead, with rogue angels like Gabriel making pacts with the devil to give mortals a taste of hell on earth.  I suppose in that sense, Lawrence does capture the essence of the graphic novel, but who says you have to be loyal to the story, especially when it is so bad to begin with.Night Watch did a much better job of capturing the sense of an uneasy balance between dark and light and how easily it can be upset, and it did so on a much smaller budget - 1.5 million as opposed to 100 million.  No wonder Hollywood eventually signed Timur to do Abraham Lincoln: Vampire Hunter.  Take my advice, watch Night Watch and Day Watch instead."
    },
    {
      "rating": "6",
      "text": "Rarely has the question \"What the hell?\" been more appropriate. An uneven amalgamation of the brilliant and the preposterous, Constantine left me by turns intrigued, confused, and wary. The recipe calls for some ingredients that are compelling, others that are audacious, and others that are downright maddening. With a bold, dynamic visual style that fuses film noir elements with traditional horror motifs, Constantine can be considered many things, but dull is not amongst them. This is not a timid film, yet it's not an entirely successful one, either.\r There's an inherent danger in telling a story about angels, devils, God, and Lucifer in that it's very easy to lose a sizable portion of the audience. There's a reason why authors not named Dante shy away from this subject. Some will see it as sacrilegious. Others will see it as silly. The suspension of disbelief curve is steep, and it becomes steeper when the movie throws in elements of black magic and occult philosophy. One would think that matters couldn't get more clear-cut than in a battle between the forces of heaven and the minions of hell. But Constantine finds a way to turn everything a murky shade of gray. Good and evil, it seems, aren't as absolute as we might like to believe.\r Constantine's core strength lies in its visual presentation. First-time director Francis Lawrence cut his teeth in the music video business, and he brings a lot of imagination to developing a vivid palette. There's almost always something to see, whether it's a hellfire-tinged mirror image of Los Angeles or the hedonistic innards of a nightclub that caters to those of both angelic and demonic persuasion. In fact, the film looks so good that it's almost possible to ignore some of the screenplay's ludicrous turn of events.\r Plotting is not one of Constantine's assets. You can't think too much while watching this movie, or the carefully constructed house of cards it erects will come crashing down. The source material is the \"Hellblazer\" series of graphic novels, and the goal of the screenplay is to replicate the tone and point-of-view of the comic books. In the process, it seems that not all of the background has been shoehorned in. It's hard to say what causes the gaping plot holes marring Constantine's narrative highway, but they are as unavoidable as Gabriel's warped, deluded speech.\r Keanu Reeves, who filmed Constantine immediately after being immersed in the Matrix sequels, is in Neo mode. There are superficial differences - Constantine is less likeable and more cynical - but Reeves plays the two as spiritual kinsmen. After all, it took a full movie before Neo came to accept his role as the Chosen One. Rachel Weisz, looking for a good companion piece on her resume for the Mummy flicks, has found it. She lends a dash of class to the proceedings, arguing the case that sometimes good actors can rise above mediocre screenplays. The supporting cast is eclectic: Shia LeBeouf as Constantine's assistant, Djimon Hounsou as the \"neutral\" club owner, Midnite, Pruitt Taylor Vince as a priest, and Tilda Swinton at her most androgynous as Gabriel.\r Constantine will appeal most strongly to those with a penchant for vivid cinematic comic book adaptations. It remains to be seen whether it will find its audience or end up ignored by viewers expecting another installment of The Matrix or a more traditional horror movie."
    },
    {
      "rating": "9",
      "text": "Constantine is one of Keanu Reeves's best films. Perfectly combining a mystical trailer and action. The plot for the thriller is not completely built, but almost completely merges into the final. The final spoils the impression, it looks too frivolous. And the cast pulls the film, there are no directly the most famous actors here. Here it is the actors who are great for their characters. In general, this is a very good film in the genre of mysticism."
    },
    {
      "rating": "7",
      "text": "Based on a comic book, the kind we only heard about after seeing the film, it brings us the story of John Constantine, an unusual hero who lives with one foot in our world and the other foot in Hell.The script weaves a simple story: the fight between Good and Evil is turned into a kind of bet between God and the Devil, in which the souls of Humanity are played and in which they maintain a kind of \"balance\" in that neither is really beating the other. John Constantine, a man who attempted suicide and survived, unintentionally becomes one of the \"referees\" of that balance, going able to send back to Hell all the demons who came to our world in order to cause trouble. However, and precisely because he tried to kill himself, it is Hell that awaits Constantine when he dies, an idea that terrifies him and that he describes as \"going to a prison where you sent most of the prisoners before\". Thus, when he discovers that the Devil's son is trying to use a medium girl to reach our world and provoke the Armageddon, he realizes that if he is able to prevent it, he can acquire divine forgiveness and the desired passport to Paradise.Personally, I like movies with themes like this. They're appealing, although the film quite subverts the religious and spiritual themes it addresses. Without really being a horror movie, it works well as a techno-thriller with a dark background and urban Gothic atmosphere, which is occasionally dotted with intense and disturbing scenes. Unfortunately, I felt that the film fell apart in the last third part and the ending turns out to be disappointing and much weaker than the rest. The film, in some specific moments, seems to make small nods to other cinema works such as \"Exorcist\", which we can see as homage or, on the other hand, as influences that it received. Perhaps the truth is more or less halfway between one thing and another.After \"Matrix\" and \"Devils Advocate\", Keanu Reeves' choice for the protagonist seems quite natural. To some extent, he picked up and mixed elements and mannerisms that he used when he brought Neo and Kevin Lomax to life in the films I mentioned. But that was not a bad idea: Reeves shone in these works and manages to dominate this film very well and to live up to what is proposed by his character. Reeves gave Constantine a sullen, melancholy, pessimistic and misanthropic personality, which gradually humanizes as he helps and cares about Angela, a character effectively executed by Rachel Weisz, in one of the most interesting works of this actress, who became famous for her appearance in \"The Mummy\" trilogy and for her work in \"Constant Gardener\". Alongside these actors, we also have the good performances of Djimon Hounsou and Peter Stormare. Who really shouldn't keep good memories of the film is Shia LaBeouf, extremely boring and uninteresting, and Tilda Swinton, who transformed an archangel full of celestial authority into a kind of androgynous and morally twisted creature, unpleasant from all points of view.Technically, the film bets heavily on CGI and visual effects, with very good results considering the time it was made and the available budget. The look of the demons in this film is something impressive, repulsive and grotesque, as also the way Hell is portrayed, in an eternal storm of fire and pain. Also notable for its realism and majesty is the brief glimpse of Paradise. Struggle or exorcism scenes have been thought out in detail and the effects collaborate widely. Cinematography is good and puts us in a nocturnal, dark and decadent neo-noir universe, where darkness combines well with a scenario full of cheap furniture, kitsch decoration and neon signs, and with urban sound effects like screams, ambulance sirens, car sounds. The soundtrack, signed by Brian Tyler and Klaus Badelt, is deep and excellent."
    },
    {
      "rating": "9",
      "text": "Fantastic film. Great plot, writing, acting, cinematics, music, sound. It has some points that drag and a few points that I feel they could have spent some more time on, but oh man, what a great job. Can't wait to see Keanu revive this role and see more of the Constantine lore."
    },
    {
      "rating": "8",
      "text": "Great movie with great cast of talented actors. The story is moving which is why this is my favorite supernatural movie. However, I feel like the end just drags on without a reason."
    },
    {
      "rating": "6",
      "text": "Decent movie. Has some pretty crazy possessions going on. The movie does tend to drag on a lot though. Hard to keep interested till the end."
    },
    {
      "rating": "7",
      "text": "As comic book movies go this is a good one. I can't speak for faithfulness to the comic but as a film it works. Dark and atmospheric just dripping with religious overtones and occult lore. Great supporting cast with bonus points to Tilda…"
    }
  ]
}