{"id": 2073, "title": "Contagion", "starring": ["Marion Cotillard", "Matt Damon"], "runtime": 106, "genre": ["Drama", "Thriller", "Science Fiction"], "description": "As an epidemic of a lethal airborne virus - that kills within days - rapidly grows, the worldwide medical community races to find a cure and control the panic that spreads faster than the virus itself.", "releaseYear": "2011", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/qL0IooP0bjXy0KXl9KEyPo22ll0.jpg", "categories": {"plot": 4.743243243243243, "acting": 4.24, "ending": 3.4, "soundtrack": 1.0, "cinematography": 5.0, "familyFriendly": 4.166666666666667, "funny": 5.0, "action": 2.2222222222222223}, "reviews": [{"rating": "5", "text": "Great cast, decent acting, but disappointing movie.  The science and relationships between the various agencies was interesting, as was the detective work.  Jude Law's character felt more like an afterthought, not a solid piece of the plot.  The movie had a good message, but it gets lost.  I have recommended to friends and family - save your money and wait for the DVD."}, {"rating": "2", "text": "Unless you are a hypochondriac with a wild imagination of your own, this movie was a disaster.  The acting was fine, but the movie was slow moving and barely kept my attention.  It was Steven Soderbergh's sloppiest work to date.  I couldn't see any good reason to pay the extra money to see this in IMAX.  I thought there might be some amazing cell imagery or something to capture the attention and fascinate, but this was pathetic.  I go to the movies every week and this is the first time in my five years of consistent movie-going, that I was prompted to create one of these accounts and say something."}, {"rating": "7", "text": "The movie was oddly mellow for having the world suffer a highly fatal plague.  That is to say there were no intense situations or extraordinary circumstances that would transform a character into something beyond a small piece of the puzzle.  Each person had a small roll to play and none of them went beyond that.  There are two sides to that coin - on one hand, you had a disjointed story of various people and their outlooks on life, death, family and duty - on the other hand, you got to see a wide variety people's reactions in what could be a very really world phenomenon.  I didn't know how to feel coming out of the theater; the movie wasn't bad, but it wasn't great, hence a 7/10."}, {"rating": "4", "text": "I had much higher hopes for this movie, but it turned out to be a decent disaster movie, with some reflexion  on medical companies who could generate profit from these pandemics. I did not like how some characters acted totally un-realistical. When Kate Winslet's character tells that an average human touches his/her face thousands of times a day... What does she do next? Walking among infected people without wearing face or eye protection...Un-realistic...The other performances were all average, nothing outstanding. I can not really recommend this movie. It is nothing more than a great budget version of the same pandemic formula with the message that some pandemics might be created by medical companies to generate profit through their vaccines."}, {"rating": "1", "text": "This movie was a poor attempt at simulating the movie Outbreak. It was slow to begin with, with incoherent scenes and the characters were all dull. I'm not being biased either, as I find factual science and documentaries fascinating, so a mix of these two should have been great... but it wasn't. I'm also a big fan of Laurence Fishburne, but this role didn't do him any justice. How this got a better review from the critics than Machine Gun Preacher, I have no idea!"}, {"rating": "5", "text": "Slice of life (or in this case death). No significant plot just a plodding look at the progression of a pandemic. I wouldn't call that revelation a plot spoiler since the preview essentially tells the whole story at a glance. That said I stayed engaged for the whole thing, but I could understand if you didn't. I guess I was waiting to see how it ended... Here's your plot spoiler... It doesn't... it just stops abruptly!  Let's just say I'm glad I bought the matinee priced ticket for this one."}, {"rating": "6", "text": "Contagion tells a decent, realistic story of... uh, contagion. It's fascinating on the scientific front but also rather cold and distant. Not to mention undramatic; the deaths of millions are seen from a very clinical, detached viewpoint. Still, it tells it's story effectively enough to scare you into using hand-soap more regularly."}, {"rating": "6", "text": "Wasn't disappointing by any means, but is also not a must-see movie. Good acting, especially from the children, and an original musical score. But the movie left too much unanswered (and not in a sequel kind of way) and the climax was rather irrelevant to what the entire movie leads up to. Worth a see, but maybe wait until DVD. It didn't seem to stand out from any other decent collapse-of-society movie."}, {"rating": "9", "text": "Educational and with a subject that rarely, if ever, gets handled by Hollywood thrillers. I could easily recommend it to anyone interested in the subject, but it's the realism and the sober, analytic treatment of something abstract, that makes me almost give it top score. A perfect ten it isn't, at all. It's no classic and it's no milestone in film. But it's something very special, competently executed, and educational for the layman. If only everyone watched it, we might not touch our faces as much, and we might not create demand for pig slaughter. Let's get rational about sources of diseases. In the real world, the financial interests are not to be trusted, whether governmental or private. We can only ever ask of each other to act in wisdom."}, {"rating": "6", "text": "It's a fine movie but far too many characters and sub plots. Even after watching it, I had to go to Wikipedia and read the plot to figure some things out. It's too confusing and I think that will definitely draw people away from it. Shame too because the cast does one heck of a job."}, {"rating": "7", "text": "I thought the movie was decent when i first watched it. After watching it a second time I realized how the story would just lag. Was good at first, second time around was just boring."}, {"rating": "7", "text": "Excellent actors and story. I liked the film. Side effects is better though. However Contagion is fun to watch and the ending is surprisingly unexpected. I totally respect the director. Great movie...."}, {"rating": "8", "text": "Most disaster films today are worthless just exploding fire or rubble there, spreading the disease there. Contagion changes that. It is intense, fast-paced, and well-scripted."}, {"rating": "4", "text": "An almost 2 hour film with an ensemble cast trying to look concerned about a virus. There is no horror, action or shock factor in this movie at all. I was expecting at least something exciting to happen in the movie but I guess Warner Bros. spent all the money on the cast and filming locations. It has gotten so many positive reviews because it could possibly be the first chick flick to feature a super virus and Laurence Fishburne."}, {"rating": "5", "text": "Great cast and topic, but I expected more from Steven Soderbergh. The dialogue wasn't very good, no great performances by a actor/actress. The movie as a whole mainly focused on the humane aspects, but I would have hoped to see more how media and the drug industry affect the society and government - how todays capitalists actually run the governments. In general, it wasn't a bad movie, but nothing memorable either."}, {"rating": "3", "text": "The cast and acting were extremely seductive but the plot didn't live up to the expectations. This is another thriller with foaming mouth people from all over the world. Everything was flat and predictable."}, {"rating": "1", "text": "This movie is truly a boring dog without any unexpected developments.   A waste of time and money.   Why were Matt Damon , Gwyneth Pattrow, Kate Winslet in the movie if they had no real part to play?   A virus gets out and is spread around the world by traveling people.    There has to be more to a story to make a movie than that.  I suspect the writer quit early on and the camara people and actors just sort of winged it from there.    For a moment we had hope that something would happen when the antibiotic was injected in people world wide --but alas--no werewolves developed-- no nothing.  People in the theatre could be heard softly muttering--don't tell me that 's it.  It's going to end!  Good grief did there was nothing.   The screen lit up --then a dragging lot of nothing and then it ends.   Just huh! well it was no \"I am Legend\".    SCore=0"}, {"rating": "1", "text": "This movie had great potential. It had a great lineup of cast members, and the doomsday senario is definately appealing to those who enjoy watching apocolyptic style movies. However this film failed to deliver the excitement that it portrayed in its previews. Overall the movie is downright boring to watch as it jumps around, and does not adiquately portray the level of emotion, panic, crime, and civil unrest that one would expect if the world was on the verge of a major collapse by a virus that originally had no treatment, no vaccine,  was easily spread by airborne and fluid transmition, and had a high casualty rate. The movie tended to jump around to various characters, and required the viewers immagination to come up with conclusions of how most of characters would end up at the end of the movie. Despite the cast, the acting was poor and most of the cast did not show much emotion. There were very few parts with action as most would expect fights with the military, civil disobedience, mass rioting, looting, and increased gang activity poping up. Most movies of this type have shown numerous sights of mass graves, body collection, and even bodies dead on the streets. You see fighting with government officials/ military personel, rioting, mass looting, and overall increased crime. The potential seriousness of the situation was never really brought out as it jumped around too much to other characters and did not give any character enough time to really develop a solid story line. Parts that seemed to intensify quickly went away and were forgoten about.  An example would be when Mitch Emhoff (played by Matt Daymon) is trying to get out of Minnesota into Wisconsin, but is blocked by U.S. military. He gets out of his car, argues with the solder for a few seconds and then gives up and gets in his car and turns around back into Minneapolis. No other attempts are made by his character to leave the area. He just goes home and thats it. Such a good law abiding citizen during times of crisis! (also extremely unrealistic)  Another moment is when Mitch Emhoff is looking at his neighbors house one night and hears gunshots within his neighbors house, he dials 911 and gets no response, nothing else happens (though one might expect somthing would happen, but it doesent) He goes over to his neighbors house only to find nothing, except that he finds a gun and takes it home only to set it by the front door. You never see anything else happen regarding the gun or an attempt of looters to break into his house. The movie just jumps to a different character.  By the end of the movie it does have an interesting ending of how the virus began, but otherwise it was a very dull movie that could have done so much more. What a waste of money. The best part of the movie was when I got to get up and leave the theater.\rFor those who think this movie was great, probably have not seen \"Outbreak\" or even Steven Kings \"The Stand\". Those doomsday senario movies are much better thought out, directed, and executed."}, {"rating": "4", "text": "this is a video review of the movie i found on you tube that i thought was interesting so take a look for yourselfhttp://www.youtube.com/watch?v=ngCQQvwsAZo"}, {"rating": "5", "text": "Contagion is about a group of people who must deal with the spread and containment of a highly contagious disease. Based on that statement you could probably guess what might happen. Sick people, a search for the cure, and widespread panic. Contagion is exactly what you think it is. Not to say that's bad, but I was not surprised by anything I saw.The disease starts in Hong Kong, from there it is carried by Gwyneth Paltrow back to the states where she and her son die within a day or so. Her husband Matt Damon, immune to the disease, is left to take care of himself and his daughter.Meanwhile Laurence Fishburne, Kate Winslet, Marion Cotillard, and a few other major players are notified of numerous deaths happening around the world. The disease is spreading quickly, and the Center for Disease Control must find a vaccination and keep the public calm.Jude Law a conspiracy blogger/journalist broke the story first. He questions if the CDC is really trying to help. He finds a medicine that he believes cures the disease, and spreads the word. As millions become affected chaos breaks out, road blocks are set up, and the people go nuts.Soderbergh directed an all star cast. Scott Burns wrote a fairly smart script. The movie was well put together and entertaining enough, but nothing more than you'd expect. I wish Soderbergh would have gotten a little more experimental, maybe tinted the movie red or something like he did with Traffic. It seems like disease outbreak movies can go in one of two directions. An epidemic occurs and everyone turns into flesh eating zombies Aka 28 days later & I am Legend. Or an epidemic probably stemming from an animal becomes widespread, and the government works to contain the disease and the world seemingly goes ape **** Aka Outbreak.I honestly felt like Contagion was too predictable and brought in tons of characters the movie couldn't devote enough time to explore. John Hawkes who I loved in Winter's Bone, plays a Janitor who shows up only once in each act of the movie, his character seemed compelling, but was pretty much wasted. The movie somewhat explored the idea that the government and CDC took care of their own before the average person. Hawkes character could have been used to show the struggles and desperation of a lower income individual taking care of his family during this epidemic.Winslet and Cotillard were intriguing as well, but are never really explored. They came and went without us really knowing anything about them. I completely forgot about Cotillard until they mildly tie up her story near the end. I think this movie could have benefited from chopping off some of the extra meat. There were probably 7 or 8 main characters introduced, and only 2 or 3 were given the proper time to develop. Contagion tried to be this massive story about all these different people, but it just couldn't be done in 100 minutes.For this movie to work, they were really gonna have to get us involved with these characters. So when they cry, we cry. When they are angry, we get angry, and so on. They basically just crapped on Matt Damon's character the whole movie, and by the end, sure I felt bad for him, but I wasn't really upset. His wife was cheating on him, he couldn't give his family a proper funeral, and he was stuck inside with no food protecting his daughter for months. I was more like, \"jesus christ\" cut this guy a break. You waited for some kind of reprieve, but what they gave him was pretty unsatisfying.On the positive side, I always say if I can finish a movie in one sitting it was pretty good. And like I said the cast was impressive. Matt Damon is a great actor and he did what he could with the wiggle room he was given. He had two key emotional scenes, hearing his wife has died and dealing with it at the end, both were good. Jude Law probably had the best overall part. They flipped him around so rapidly, you're never really sure of his motives. He was probably my favorite character.I really did like contagion, it just didn't add anything to the genre. If you're going to make a movie on a topic that's already been explored, you have to find a unique way to tell the story. This movie just rang repetition in my ears, and it'll quickly be forgotten.http://themoviehook.blogspot.com/"}, {"rating": "9", "text": "Classic Soderbergh but at his best.  Thrilling and stressful.  Heavy and compelling and very believable.  Not over sciencey but enough to tie together a very realistic feeling and terrifying possibility.  Timely and touching.  He pulls you in to the characters even though it is the most shared screen time and the very def of an all star ensemble cast.  Honest and not too bleak.  Well done.  Its got a \"Traffic\" feel to it.  Superb film."}, {"rating": "5", "text": "Totally average in every way.  No character development whatsoever.  The most developed character in this film was \"the government\", and you know they are always the bad guy.  And that whole thing with Lawrence Fishburn made no sense whatsoever.  It's like they may have had something in the first cut, but then they had to cut the movie down to 2 hours.  As a result, the audience was left with nothing to attach itself to, except the virus."}, {"rating": "5", "text": "A real disappointment, given a good director and such a good cast. Just very mediocre all the way around, starting with a premise that his been done before (Outbreak, The Andromeda Strain), but those films showed more imagination and established more compelling relationships between the characters. It's good filmmaking, but not a great story."}, {"rating": "6", "text": "This subject is more frightening than the movie. It's a rather cerebral look at the worldwide spread of a lethal new virus: personal reactions and panic in the streets, while scientists attempt to find a cure. The first 30 minutes almost seem like an upscale government informational video about plagues. While numerous parallel stories develop, none of them makes an emotional impact. The star-laden cast gives it gravitas, but director Steven Soderbergh keeps his distance from involving drama. Cool soundtrack. You WILL probably be a bit more enlightened about hygiene and touching your face!"}, {"rating": "5", "text": "For a movie about an epidemic, it really could have used a greater sense of urgency - or perhaps some zombies. It just falls flat and doesn't go down the rabbit-hole on enough issues.  Would have been interesting to know a bit more about how the politics behind how the vaccines were being made.  I'm not sure I'm a fan of how they reveal the initial source of the contagion at the end.  Interesting, but there just wasn't a lot to it."}, {"rating": "0", "text": "This movie was boring and no action.  They used medical terms that my sister, who is a nurse, did not know what they were talking about.  They did not explain characters.  We thought the one lady was Fishborne daughter, not, it was his future wife.  Another character, was kidnapped, when rescued, and she realized that she was given a placebo antidote,therefore, she decided to stay in Hong Kong, but, the story did not tell us why or where.  Another character, Matt Damion, they kept referring to him, but even though he was immune to the flu virus, he had no other impact on the cure, >    Do not waste your money.  We paid $12.50 to see this on a MAX screen but this should of never been made for it."}, {"rating": "6", "text": "Contagion is a very interesting movie. It is about a topic that we do not care until it is all over the world, an epidemic. But the things that difference it from other biological thrillers are the unknown origin of the disease and the multiple perspectives of the development of the epidemic.The unknown beginning of the virus gives Contagion a sort of mysterious atmosphere, but also approaches more to reality, because in most of this situation the authorities notice the problem when there are a few amounts of death people and several others infected; so the only solution is to find a cure. And if you add to this a new form of transmit the virus and scientific bureaucracy; you got a promising and very scary picture.The multiple points of views, which is a signature characteristic of a contemporary production, gives the movie a sort of feeling of a vast reality that no one can hold; and this is simply what a virus can do to humankind.Contagion has a terrific idea, simple performances and some characteristics of documentary; but the development of the story it is absolutely predictable."}, {"rating": "9", "text": "First off, I would give it a 9.25 out of 10. Performances are great. Especially Jude law and Matt Damon. Music Score all right, and story intense. It will make you scared of getting sick as jaws made people scared of going in the ocean. This is a really well acted film."}, {"rating": "2", "text": "For all its stars, Contagion has no characters. The plot never grows, and the movie's best scenes appear off-screen. Some of the characters merit annoyance instead of pity and the themes are utterly irrelevant. Can \"wash your hands\" be a theme? Contagion could have made analogies to the spread of information, but instead chooses to scare its viewers into carrying hand sanitizer."}, {"rating": "2", "text": "I was expecting a great film and was very disappointed to say the least. This film seemed thrown together.  It was very choppy with no good storylines or  plot,  with no supence. I couldn't wait for it to end."}, {"rating": "4", "text": "My son asked me if this was a good movie and I had a hard time saying \"yes\".  It wasn't a bad flick, but nothing really happens in it from a film-making point of view to qualify as a \"good\" movie.  It wasn't a documentary, but it felt like it several times.  It wasn't a thriller, but it felt like it several times.  The main problem for me was that there wasn't a central character to focus on.  There were too many storylines.  Some of them were interesting, but not so much as too garner all the attention. It just kind of meandered all over the place.  Some stories play out, but others are left dangling in the wind.  The audience is supposed to surmise the character's fate.  The acting is top notch, but a similar (and better) movie is 1995's Outbreak, with Hoffman, Russo, and Freeman.  Neither is very strong, but at least with Outbreak there is a plot and central characters to follow."}, {"rating": "1", "text": "An hour and 45 minutes of your life you will never get back. This movie was a miserable experience. Not in the least compelling, lacking any and all suspense, leaving you with nothing but discomfort. DO NOT SEE THIS MOVIE."}, {"rating": "1", "text": "The actors and music were great! The movie started off good but slowly fell apart.  The story was not consistent.  Gaping holes in the story and the ending kind of sucked.  The science was good but i left feeling disappointed. OK for renting but doesn't belong in the big house!"}, {"rating": "0", "text": "This is somehow rated high and given lots of attention, but for what? ... I give it a zero - it states the obvious possibility of a disease that can go viral. Whats new about that? ... The thrill was there at the beginning after the first 30minutes it was lag to sit through."}, {"rating": "1", "text": "Well I have to admit I now feel foolish for looking forward to this movie.  It was horrid.  There was only one character that was developed enough for me to even care what happened to him, and that was that I wouldn't have minded if he got the virus.  The movie was so massively boring that the best part was the close up shots of door knobs and drink glasses.  This is a movie to walk out of and save your precious time."}, {"rating": "0", "text": "I really don't understand why Contagion is getitng all these high scores. I'm sorry to say it but this is one of the worst movies I've seen in a long time. It starts out with Gwyenth Paltrow dying in the first 10 minutes of the movie, and people around her also mysteriously dying. After the beginning, the movie just turns crap, there are like 5 stories happening at once which have no connection to each other, one of them including Kate Winslet dying of the virus which made no sense because Kate Winslet had no role in the movie except being shown in an abundance of abnoxious video montages filled with horrible music. By the end of the movie, you feel like you want your money back because nothing ever happened. So, unless you want to see a movie as straight forward and boring as a Swine Flu movie, you should just stay at home or go watch Bucky Larson or something. Trust me, you will hate this movie."}, {"rating": "0", "text": "At the opening credits the lightblulb goes on produced by an Arab company - Imagenation Abu Dhabi - releasing a movie about a worldwide epidemic killing 8 million people opening intnetionally the Friday before the 9/11 anniversary. When I... looked it up I noticed it was supposed to release 10/21. And not one Arab country gets the disease in the film storyline. The biggest surprise is how boring it is. What moron takes two of todays best actresses (Gwyenth and Kate) and kills them off in the first 40 minutes of the film and gives them nothing to do when they're alive. Then glues a fake crooked tooth on the front of Jude Law's mouth.  The Arabs finally found a legal way to fund Al-Qaeda.  Steven Soderbergh should be ashamed of this piece of crap film."}, {"rating": "6", "text": "Contagion borrows an overdone plot device and adds its own unique flair. An epidemic sweeps across the world, and it is up to one man to save his family from the invisible threat. At least, this is what you can infer from the trailer. However, after viewing Contagion, I get more of a documentary sort of vibe from the film. No matter what turmoils may be occurring, Contagion always brings it back to the cold hard facts. The Science. Which is good, if you're into that sort of thing. However, it felt as if the characters were underdeveloped or swept under the rug as an afterthought. The entire film could have been an endless source of suspense and drama if only the director decided to stop playing teacher once in a while. And considering the brilliant cast, one would expect that this would be the case. This brings me to my next point: the camera. During the opening moments of Contagion (the scenes that I remember the most, I might add) there were several shots that were held for far too long. This problem was subtle, but it made the film feel like a middle school media project. That being said, Contagion never falls flat on its face, and it did keep me on the edge of my seat throughout a few especially well done scenes during what I perceived to be the climax."}, {"rating": "9", "text": "The best virus epidemic movie there is, Soderbergh scores again with this star-studded thriller with a very logical explanation of the disease; a fantastic, heart-pounding score; and believable characters. Everything in this movie feels right, and very carefully thought out."}, {"rating": "1", "text": "The trailer is fantastic, there is nothing else to the movie. It just plods along, not feels urgent. Yes, people are dying but it is in the abstract. The movie is really about the virus and CDC's reaction; the characters are all wooden. Save your money; if you feel you need to see it wait until it shows up on cable."}, {"rating": "10", "text": "Thrilling, with a cool original score with just amazing fantastic performances from: Marion Cotillard, Jude Law, Gwyneth Paltrow, Matt Damon, and most of all Kate Winslet. I give this film a 97% of a good movie."}, {"rating": "2", "text": "This is a sorry excuse for a movie.  There is no character development whatsoever and other than people dying from an unexplained virus there is nothing much going on.  There are more plot holes that Carter has little liver pills.  There isn't one character in this movie that you even remotely care about it.  The Government is always the bad guy no matter what.  Matt Damon the star picked up a nice check but exactly for what I have no idea.  If anyone can tell my his job occupation I sure would like to know."}, {"rating": "8", "text": "When i first saw the movie start, I had the usual human reaction...confusion from lack of initial information. As the story progressed, you start to meet many types of people, some good and some bad. It is similar to most hero's tales, except the vilan is not just one person. The villan is a virus humans can't explain. It is like Darth Vader as little, tiny viruses that exist almost everywhere at once. There are people who want to be greedy and take advantage (who you could say are villans) and those who truly want to stop the virus (who you could say are the heros). Whatever you call these people, they are part of a story that affects more than a village, city, or state, but the entire human race. The plot was well thought out, and the characters developed well. It didn't, however, follow the predictable plot of most movies, since there was no climax or central vilan confrontation. Making a movie like this is hard, and even harder to do right. I believe the makes of this movie took a good shot and hit the target, just not the bull's eye."}, {"rating": "0", "text": "I am still pissed I paid 14 dollars to see this craptastic movie! There are a lot of big names in the movie, but way too many characters! It doesn't make any sense why they were even there! I thought that all that character buildup was going to lead to some exciting conspiracy. No, all that lag time for the movie to just end. The first 5 minutes was the best part. Doing laundry is more appealing than watching this movie. TERRIBLE!!!!"}, {"rating": "6", "text": "The movie was well made with good acting and dialog. But really there were just too many deadends and predictable outcomes where the story just didn't go anywhere or add anything to the movie. I mostly enjoyed it but it definitely could have been a lot better with such a high class cast."}, {"rating": "8", "text": "This movie is huge. It stars Matt Damon, Jude Law, Marion Cotillard, Laurence Fishburne, and Kate Winslet. It's about a disease wiping out millions upon millions of people. That disease is spread by the most seemingly unavoidable of all things... contact. And on top of it all, with that one little bit of contact, you're pretty much guaranteed a tombstone. But with Steven Soderbergh directing, we get a much more controlled (but still sprawling) version of the chaos. With all of the characters and supporting storylines going at once, it's easy to get lost, even a little bored, and that's definitely to the film's fault. Even so, we're supplied with an incredible score, terrific performances from an all-star cast, terrifying imagery, and the occasional instance of effective human drama."}, {"rating": "1", "text": "wow, what a horribly boring movie. saw it cause nothing else to see, and a world-wide infection sounded cool and Matt Damon is an awesome actor. story started out slow, kept hoping to see it pic but it failed to develop, the movie felt like a waste of great potential. wish i had that 8 dollars back"}, {"rating": "9", "text": "Honestly, I'm disappointed that more moviegoers don't 'get' this movie.  Yes, there are a lot of plot lines to follow and some people are going to be disappointed that their favorite actor/actress doesn't play a bigger part in the movie.  But the process of weaving so many stories together has the wonderful effect of causing the intellectual moviegoer to consider many aspects of a single story, ultimately considering the question: \"Where would I fit in this story?\"  That's a powerful and important point in this instance. For example, some have stated that the scenes with Jude Law's character seem like a diversion.  There's a point to that.  He may be the most important character in the movie.  I will stop short of offering a spoiler and just say that there are subtleties at work here that mimic the world we live in.  Pay attention!I lament that so many people watch this movie and say, as one reviewer has, that there is \"no real plot development.\"  Instead, this movie should be applauded because the plot development was real; i.e., realistic.  I, for one, wish more movies were like this one."}, {"rating": "8", "text": "A couple of years ago, news and health agencies the world over were concerned about a possible pandemic stemming from bird flu and swine flu. Thankfully like SARS a few years earlier, the outbreaks were rather small thanks to a wealth of precautionary information and measures. In the new film â"}, {"rating": "8", "text": "Overall i liked the movie, it had good moments, and a great cast can actually work well together. The idea of putting what cause the contagion in the last scene was brilliant, I was trying to figured out, and off course it had to be something like that, you don't infect half of the world just by coughing and sneezing, it had to be much more than that, as they showed in the final scene. Matt Damon, Kate Winslet and Jennifer Ehle were the ones that really stood out and Steven Soderbergh definitely brought a film that puts you in a careful situation from now on, you'll think twice before doing something. So for me the movie was good, it had a good story, good performances, and a good director."}], "recommendations": ["children_of_men", "what_happened_to_monday", "code_8", "the_hunger_games_mockingjay_part_1", "eo", "limitless", "chaos_walking", "stowaway", "elysium", "sanctum", "nerve", "the_grey", "the_counselor", "the_titan", "brimstone", "downsizing", "greenland", "colossal", "the_purge_anarchy", "sicario_day_of_the_soldado", "how_it_ends", "tenet", "the_butterfly_effect", "the_tomorrow_war", "the_gambler"]}