{"id": 3329, "title": "Contact", "starring": ["Jodie Foster", "Matthew McConaughey"], "runtime": 150, "genre": ["Drama", "Science Fiction", "Mystery"], "description": "A radio astronomer receives the first extraterrestrial radio signal ever picked up on Earth. As the world powers scramble to decipher the message and decide upon a course of action, she must make some difficult decisions between her beliefs, the truth, and reality.", "releaseYear": "1997", "mpaaRating": "PG", "imageUrl": "https://image.tmdb.org/t/p/w500/bCpMIywuNZeWt3i5UMLEIc0VSwM.jpg", "categories": {"plot": 8.473684210526315, "acting": 8.666666666666666, "ending": 8.181818181818182, "soundtrack": 10.0, "cinematography": 7.0, "familyFriendly": 6.666666666666667, "funny": 5.0, "action": 10.0}, "reviews": [{"rating": "10", "text": "Once of my favorite films of all time. Contact makes you think and wonder about the universe around you differently and is a very good movie to boot."}, {"rating": "10", "text": "I am amazed at how many critics got this movie so wrong. To be sure, the movie had the ambitious task of condensing Sagan's intelligent and realistic novel of the interplay of science, religion, and politics into bite-sized morsel. But it does so very effectively, without being pandering, self-important, or pretentious. The movie sets out some clear questions and lets the viewer take away what they want from the accessible dialogue and the somewhat ambigous events at the end. Lost on most critics is something that makes the movie (and the novel) almost unqiue in the realm of Sci-F: it is one of the most realistic and in-depth portrayals of a scientist and how science intersects with the 'real world'. The character of Ellie is one of my favorites of all time. She is also an excellent role model for girls at a time when women are still underrepresented in the sciences. I give Sagans' book my highest recommendation, and this movie the highest score for doing such an effective job in conveying many of the book's ideas while maintaining an intriguing storyline."}, {"rating": "10", "text": "I love this movie very much, watched Jodie Foster as astronomer. SHe very strong and active, as strong her acting. Bravo Jodie."}, {"rating": "10", "text": "This is my favorite film because it looks at the encounter with extra-terrestrial life in a totally fresh way. It's much more realistic and much more intelligent than most sci-fi films. It is truly a sci-fi drama that is emotionally moving yet cerebral."}, {"rating": "10", "text": "Contact was great. To those who said it was not so good you are wrong. Jodie was great in the film even though she did overact a bit."}, {"rating": "10", "text": "A scientist's vision the reconciles two seemingly irreconcilable philosophies of life: science and religion. The two forces clash throughout the world as humans are faced with the possibility of contact with sentient extraterrestrial life."}, {"rating": "10", "text": "I agree with Moo P. 100%. Contact doesn't feel like a sci fi film at all. It feels like a drama that happens to involve space travel. Why this film isn't more popular is a bit of a mystery to me. One of my favorite films. Excellent story, excellent acting, superb atmosphere, sound and special effects in aiding the story, not showing off or drawing attention to itself. A rare film."}, {"rating": "8", "text": "Bringing philosophical discussions and curious, Contact has a copy photograph, good character development and, as a good science fiction, many discussions after the credits roll."}, {"rating": "6", "text": "It's interesting that with all the hi-tech technology and wonderful gadgets this film shows off on a grand scale, at the end of the day it doesn't differ much from when E.T. decided to phone home. However, this time mankind is being lured by those aliens and in actual fact - they might not be aliens at all. But I digress. Essentially this movie is about the unknown and ones interpretation of the overall philosophy of life and its meaning. I don't know what I was expecting from 'Contact' but too many questions were left unanswered for my liking..."}, {"rating": "7", "text": "Contact is a pretty good science fiction film that is very thought provoking and well-made. As with all of his films, Robert Zemeckis really shows his skill in the director's chair here. The script and story are both very good and the visual effects are brilliantly put together and gorgeous.  The acting here is also good, in particular from Jodie Foster, Matthew McConaughey, and William Fichtner. The message here is also a good one, as it essentially argues that science and religion are not mutually exclusive and can work together, rather than against one another. You can also see the influence of 2001: A Space Odyssey here for sure, as well as the influence of Close Encounters of the Third Kind in the way the possibility of aliens is handled. Overall, the film is an enjoyable one and easy to watch, while still remaining thought provoking and effective thanks to killer performances and direction. The film is far from perfect, but remains quite good."}, {"rating": "5", "text": "After spending a third of a trillion dollars Ellie, played by Jodie Foster, finds herself at the other end of a worm hole. That is to say: back on Earth. It took her 18 seconds to do so.\r Earth, inhabited by moronic creatures called humans, has just found itself to be the target of practical joker living on a planet orbiting Vega or thereabouts. Thereabouts cause that planet was probably just a relay station. It send them humans an instruction manual for building a device nobody on Vega or thereabouts could afford to build, hoping them humans would do it. And they did. In fact, they made even two of them. How stupidly funny is that.\r To their great embarrassment one of the humans appeared so they sent it back with some garbled message that would have the slow witted creatures pondering stuff for the rest of their pathetic existence. What is next? Ellie asks her dead daddy, the guise the alien has assumed for her(and not Adolf H, which would have been funny). Well, we sent you back without a shred of evidence and nobody will believe you. And we erased all the tapes, and the audio and anything that could proof we exist. How about that? It will be just like .. a religion.\rFine with me, Ellie says. For as we have found out from the movie, Ellie doesn't believe in gawd.. but she does believe in something after having had her trip to another world. So she has become a spiritual person so she can have intercourse with the religious guy named Palmer Joss without feeling ashamed for it. (In hindsight the painful look on her face when she kisses Palmer might very well be because Foster was a closeted lesbian, which by Jove would at least have made the movie more interesting if Ellie had been too. Nuke them straight people! )\r So the whole movie, aptly named contact, was about finding an excuse for the atheist (assumed closeted lesbian) Ellie to have (straight) intercourse with the christian Palmer. Two third of a trillion dollars spent on matchmaking and brain reprogramming.. Does this movie get closure that way? Perhaps it does.\r The more I think of this movie, the lower my scoring. The biggest part of the movie turns around a conflict between science and religion, in which the latter means: the christian faith of the american kind. 95 percent of the humans are religious someone says to atheist Ellie, which is why she doesn't get elected at first to go and visit the aliens. She could have replied: but only a third of them are christian. So who will it be? A christian volunteer? A muslim one? A jewish? A buddhist? Which religion shall be required? And if it will be christian, which denomination? The catholic one? Oh and did I tell you about my sexual orientation? Only 4% of the female population confesses themselves to be lesbian. And how about white vs black vs asian? What race shall represent earth?\rBut we just skip over that one shall we.. cause, darn it, this is america and there is just one american gawd and that is the white christian one and no other exist!\r The nicest part of the movie is the beginning sequence, in which we see no humans at all. The camera travels backwards from the planet into outer space. Cool that!\rIn between there are some more nice shots of desert landscapes and some sequences about the planets.\rAs long as there are no humans in it, the movie is actually nice.\r Jodie Foster, how I like her, is at her worst here. She seems constantly on the brink of a nervous breakdown, about to scream or about to cry. Why did they send that nervous wreck to the aliens? No wonder they returned her and without any evidence so they will not send another one. Cause them humans are just too stupid to get that travelling through wormholes mucks with space and time. But you know.. Einstein is dead and with him all the brilliant scientists have died out.. Stephen Hawking? Never heard of the guy. Carl Sagan? Wasn't he a script writer for sci-fi movies? Higgs? Penrose? Witten? Just a bunch of loonies.\r The movie has also Blofield in it. He is named Hadden. Hadden is a deus ex machina. When the plot grounds to a halt, he steps in with a lotta money and gets it floating again. So money is the gawd here? Jup.. the movie is almost brilliant. But there aren't any cats in it though so it remains almost.\r At the end of the movie Ellie is back were she started: in command of a large array of antennae listening to the universe. Did anything happen in between? Apparently not. It was all a dream probably or maybe she got back to another earth in another universe? Isn't that her once deceased dad in the background walking toward her over a pearly white beach? What was it all about? Well we see her looking up at the night sky showing a milliard sparkling stars. She has become that spiritual person in which the scientist and the religious nutcase have become one. I feel at peace with the universe now. We are not alone.So let's depart with that gooey feeling. Yuck."}, {"rating": "9", "text": "I would readily admit this is one of my favourite science fiction films from the 90's. It's intelligent, well-acted and directed, and the special effects it has HELPS the story rather than IMPEDES it. Though she hasn't done much lately, either in the director's chair or acting, Jodie Foster is one of my favourite contemporary American actresses, and it's intriguing how her great talent's been utilized of late (ie., 'Elysium', and I'm still very mad at Spike Lee for having Christopher Plummer call her a **** in 'Inside Man').\r Personally, I must admit that I myself have worried what other worlds' inhabitants would think of our civilization from the messages it might get from Earth. Though I thankfully haven't lost any sleep over it (I have 'Thumper' in the apartment above me to thank for that), as Led Zeppelin would say in the classic 'Stairway to Heaven', '...and it makes me wonder'.\r As what happens in most of these movies, it's rather anticlimactic once the different cultures meet. I'll say to my dying day that the most difficult thing to do in cinema is end a film. Here (unlike perfect sci-fi masterpieces, like '2001: A Space odyssey' or the more recent 'Children of Men') the decent but otherwise unspectacular ending makes me avoid a perfect rating here. But it's awfully close, worth both owning and rewatching, and provides fairly early evidence (which would come to bold fruition in 'Killer Joe') that Matthew McConaughey could actually act. It's also a tossup between this, 'Who Framed Roger Rabbit' and 'Back to the Future' for my favourite Zemeckis moment."}, {"rating": "9", "text": "This movie is not for everyone, just for people interested on philosophy or the existence. The performances are dazzling, Jodie Foster is a very talented actress, also the screenplay made by one of the best astronomers in the world, Carl Sagan. This movie deserves more credit from the \"professional\" critics and the users. Very underrated!"}, {"rating": "9", "text": "A surprisingly beautiful film, Contact serves as a great example of really well done science fiction. The script is beautifully written and really tackles some great philosophical questions. The cinematography is stupendous and has held up remarkably well, especially for a film from 1997. Jodi Foster is honestly incredible and gives a career-defining performance. The support cast is kind of hit and miss, with Matthew McConaughey really standing out. The only flaws that Contact has are that it does drag at one or two scenes, and sometimes the motivations of the supporting characters are unclear. However, this is a fantastic film, and a must-see for science fiction and 90s film fans."}, {"rating": "10", "text": "This movie hit pretty close to home in a lot of different parts. Great acting, good cast, and excellent CG, especially for the time.  Was in awe the entire time, now one of my favorite movies ever."}, {"rating": "10", "text": "Best Si-Fi movie ever. God and point are not existing but we need them anyway. And so we only wouldn't believe, we alone in that \"awful waste of space\". What a message!"}, {"rating": "10", "text": "On an impulse, I went and rewatched Contact, the 1997 film starring Jodie Foster. Man, what a great **** movie. Zemeckis did a lot of good work with Roger Rabbit, Back to the Future, and Forrest Gump, but Contact seems a bit more serious and mature, while still retaining that special magic that made those previous films successful.As the star of the film, Jodie Foster was amazing as Dr. Arroway. Maybe this is going out on a limb here, but I think she should've been nominated for an Oscar for her performance. Unlike a lot of females in big Hollywood movies, the best quality of her character is how driven and intelligent she is, instead of how big her boobs are. And really, how many times have we had a main female lead in a big blockbuster spectacle? Outside of Contact, there's... well, the Tomb Raider films... and Elektra... and Catwoman. It's just sad when you contrast any of those with Contact, isn't it? Is there anything about Lara Croft that's intellectual? She's treated solely as a sex object, right? And that is something that never ever happens with Arroway. Don't get me wrong, Jodie Foster is absolutely gorgeous in this film and looks breath-taking in many scenes, absolutely, but... she never becomes a sex object, she is always shown as a highly capable scientist and intellectual, first and foremost. This is so refreshing and it's a shame that it continues to be such a rarity in Hollywood today.In a lot of films, you also run the risk of an intelligent and highly motivated and aggressive female character being seen by the audience as... well, frankly, as a **** But that never ever comes close to happening in Contact. Arroway is simply this incredibly intelligent, yet dynamic and interesting character, who you empathize with and want to see succeed, and no small part of that is due to Foster's electrifying performance. When Palmer Joss falls for her and decides to vote against her because he doesn't want to lose her, we as the audience are right there with him because we've all fallen for her as well.   I actually thought everyone in the cast did a great job. Matthew McConaughey usually just phones it in on those rom coms he tends to do these days, but I thought he was really good as Joss, the religious love interest. I totally bought their romance. Lot of chemistry there between them.Going back down memory lane, I read the novel back... in high school. Right after I watched the film for the first time, in fact. So, it's all a bit hazy, but I thought the book was really good as well. Generally quite similar to the film, but the ending is noticeably different. Both the film and the novel have the same central theme, which is a debate between religion and science. Instead of building one up while tearing the other down, as a lot of films are wont to do in this arena, the film takes us between the positions of one and the other until eventually, the accommodation we arrive at in the end is both thoughtful, respectful, and nuanced.The ending of the novel has the alien giving Arroway information on a signature of sorts for a universal creator. So she goes back, gets on this big supercomputer that calculates pi, and finds that after a really long time, the seemingly random numbers of pi actually form a pattern, which translates into a visual image of a circle. So that's the proof that God exists, because he planted this signature into pi. You can kinda see why they didn't go with this ending for the film. A scientist at a computer, watching a bunch of numbers being crunched is... not particularly cinematic.Oh, and as far as the ending goes, with the alien being her father... hey, I thought the wormhole ride was enough of a payoff, visually. That was already pretty mindblowing, with all the special effects, so I didn't really care that we didn't see any wacky alien lifeforms. And they explained it well enough in the story. I think the weakest storypoint is actually how at the end, they just keep grilling her and not believing her story, when all they had to do was send another person through.In a lot of ways, I find Contact very similar to the film 2001: A Space Odyssey, except I think it succeeds where 2001 failed. There's the wonder and majesty of the universe, and it poses the same questions; who are we, why are we here, where are we going as a species... but unlike 2001, it's actually got interesting and engaging characters, a great narrative, a far better wormhole sequence, and really tight pacing throughout. 2001 is an emotionally cold film, yet I find just the opposite with Contact. There's so much emotion and richness to the main character, especially with her connection with her father, which we gradually find out with flashbacks."}, {"rating": "7", "text": "It tells of a possible true story when the world discovers a extraterrestrial civilization and you can understand as it could reacting. I think only that the autors have wanted exaggerate when the humanity has built the machine to travel until the star Vega because it isn't true that would so easy build a tecnology so amazing in a few time and already working."}, {"rating": "1", "text": "Arrival (2016) reminded me of this movie.  Equally ignorant.   \"Science is faith based.  It's just about what you believe.\" If agree with that statement, you will probably enjoy this movie.  Otherwise, don't watch this garbage (or watch it for laughs)."}, {"rating": "2", "text": "This film robbed me of more than 2 hours of my life, its a sin I cannot forgive."}, {"rating": "9", "text": "Amazing movie. Gripping and captivating from start to end. Incredible CGI in most parts especially for a 90s movie. Really underrated. Had a couple parts with pretty questionable CGI, including one key part, but the movie is still so good it survives beyond it. Must-watch!"}, {"rating": "7", "text": "Contact is a unique and thought provoking sci-fi delight. The only downside to this movie is the unsatisfying conclusion and the notion that some of it's themes are not explored fully enough (the whole religion versus science debate surely has more meat to it). Still, Contact makes for excellent viewing that is bound to rouse the inner nerd in all of us!"}, {"rating": "5", "text": "This film has not aged well, its ideas are seriously unsophisticated by today's standards and this hampers its credibility."}, {"rating": "6", "text": "Average movie, I'd seen this movie when it came out 19 years ago and had remembered it being better than it was watching it this time around.  The movie is a little slow and has some odd twists.  Overall, I did like the concept.  And the ending was eventful - I liked it.  but I thought they could have done a lot move with this movie and left somewhat disappointed as far as my high expectations prior to watching the movie."}, {"rating": "9", "text": "Surely a great movie. The story is interesting, because it shows some different factions of society how they react to the news, that there are aliens. The visual effects are great for a movie from the 90s.There was only one thing I didnt like: Jodie Foster isnt sympathetic for me."}, {"rating": "7", "text": "Contact is a philosophical and scientifically masterpiece.\r The one thing that totally blew my mind is that Contact is mostly about what really could happen if extraterrestrial life is a possibility. It does illustrate how different nations; religions and people could react. Another amazing aspect of Contact is that the movie does raise much philosophical questions about us humans but also about basic universal things. I really love the plot of this movie, and combined with a great cast and incredible characters like Palmer Joss and Eleanor Arroway is this movie one of the greatest sci-fi movies of the 1990s. The movie surpassed my expectations; it’s so exiting from start and throughout the whole movie. The second act however, is a bit slower but it’s still great. The romance between two of the main actors are good, but for me it doesn’t really contribute anything to the story. The main part of Contact is played out on Earth, and that’s what it’s about; that we humans get contact with “them”. But my only wish is that the movie had less focus on us humans, and more on space, but I still think it’s a great movie. The major reason why I did watch this movie is that the director of Interstellar (2014) got inspiration from Contact and other films. And I can tell you this; there are lots of similarities between Interstellar and Contact, lots of it!\r Another great aspect of Contact is the soundtrack, so wonderful. But the CGI is very vague. Still, it’s a wonderful and scientifically masterpiece.\r Contact gets a 7.8/10."}, {"rating": "9", "text": "I warn you. this is one of the saddest and most depressing Sci-Fi films you will ever see. Many times I cried while watching. This movie is just so beautiful and powerful, led by Jodie Fosters excellent performance. I expected to not like this movie, but boy was I wrong. This is one of my favorite Sci-Fi films of all time, and I want to buy it on Blu-Ray. 9/10 (amazing)"}, {"rating": "9", "text": "This movie is simply awe inspiring and captivating to say the least. A sci fi epic that is relatable but also thought provoking. DO yourself a favour and watch this film. If you loved INTERSTELLAR WATCH THIS."}, {"rating": "10", "text": "Is there intelligent life out there?  Are we alone?  Questions that will be asked for a long time.  This movie follows one woman's quest to make contact.  As you'd expect, she gets a lot of resistance from \"the establishment\", who, really, get political pressure from above.  Sound familiar?  A great movie for sci-fi folks, maybe not if you're dead set against it.  I don't have many DVDs but this one is in my collection."}, {"rating": "10", "text": "Contact is great science fiction, one of the most realistic I've seen. After watching Contact, I realized that it is interesting to show about Space not only the effects and scale of what is happening (Interstellar will clearly leave a trace for many years to come as a reference for space fiction). Now Contact for most people will seem boring and drawn out. But in the film, in fact, they talk about the same things and ideas as Interstellar and Contact is great science fiction, one of the most realistic I've seen. After watching Contact, I realized that it is interesting to show about Space not only the effects and scale of what is happening (Interstellar will clearly leave a trace for many years to come as a reference for space fiction). Now Contact for most people will seem boring and drawn out. But in the film, in fact, they talk about the same things and ideas as Interstellar and 2001: A Space Odyssey, only in a different way. And this Contact is unique, and I am very glad that the main role was played by Jodie Foster. For such a role you need a strong actress., only in a different way. And this Contact is unique, and I am very glad that the main role was played by Jodie Foster. For such a role you need a strong actress. A monumental film in which everything is shot so realistic that you begin to believe in it."}, {"rating": "6", "text": "This is a solid Hollywood blockbuster that is saved from insipidity by presenting some interesting possibilities and good-looking effects.  It also helps that an actress as cool and captivating as Jodie Foster is in the lead role. This was based on a novel by popular scientist/public intellectual Carl Sagan, who was a professor at Cornell U., and it is interesting to note that much of the story is about people jockeying for credit and influence, rather than about scientific discovery. There is a lot of corny stuff that happens here: e.g a completely unbelievable and chaste romance between Dr. Arraway and a religious scholar played by Matthew McConnaughey, and a picture-perfect little scientist childhood for Dr. Arraway. Tom Skerritt is good as the obnoxious Dr. Drumlin; he really excels in that kind of role. The actual alien experience is unexpected, and done very nicely."}, {"rating": "5", "text": "Par où commencer dans ce gloubi-boulga hystéro-mystico-scientifique ? par Jodie Foster bien sûr : elle porte très haut le film à bout de bras avec une force et une conviction admirables et même... entousiasmantes. Quelle merveilleuse actrice en vérité, je vous le dis !Ce n'est pas que cela néanmoins, l'histoire -ou plutôt son substrat- est très inventive... mais son substrat seulement, pas son développement benêt. En effet, comme dans tout film réalisé par Robert Zemeckis, la naïveté et la candeur s'invitent dans tous les plans et à tous les étages, elles ruinent conséquemment toute vélléité de vraisemblance ou de crédibilité. On peut prendre ça pour de la \"poésie\" mais il faudrait devenir aussi bêta que le film lui-même (bonjour les dégâts !).Rien que le début ou le temps d'exposition incroyablement long et larmoyant est un terrible avertissement : \"mièvre à en devenir chèvre, tu deviendras\". La fin -qui n'en finit pas- est du même tonneau neuneu, le tonneau lourdingue et moralisateur, donneur de leçons à la petite semaine. En outre, la musique geignarde qui ne cesse de couiner tout au long du film est à la limite du supportable.Et puis deux heures et demi, putain, faut se les taper : encore le tic compulsif habituel du Zemeckis qui se fait décidément un devoir de nous faire chier, même avec une histoire, enfin un substrat science-fictionnel d'histoire intéressante. Zemeckis n'en reste pas moins un bon faiseur, techniquement parlant : il n'est en effet pas le dernier des manches à la mise en scène, on doit lui reconnaître ça.Par ailleurs, la problématique mystico-religieuse opposée à l'empirisme forcené de la science est bien abordée, malgré le ballot bellâtre Mathieu McConauburne aussi convaincant en prêtre que John Wayne dans Don Camillo.Heureusement, un autre acteur -brillant, lui- est là pour nous émerveiller de son charismatique jeu d'enfoiré coutumier dont il maîtrise si bien la mécanique : James Woods ! hilarant et percutant, on ne s'en lasse pas. Tom Skerritt, second couteau solide, s'avère également excellent dans le faux cul de service, ce qui ne mange pas de pain. Sans compter évidemment le (trop) petit rôle de John Hurt, acteur-né magistral.Pas si mauvais finalement ce Contact... mais pas bon non plus."}, {"rating": "10", "text": "This is one of the best movies of all time. If you are ok with a slower pace movie and love scifi this will not disappoint. Similar to interstellar or arrival. Slow but well paced. Emotional and sad. Simple and beautiful. It is a simple story that reminds us how small we are in the grand scheme of the universe and how small our squabbles as a people can really be. It reminds us to chase the facts but also to embrace the unknown with a sense of wonder and above all that the world is what we make it."}, {"rating": "9", "text": "Amazing movie. Gripping and captivating from start to end. Incredible CGI in most parts especially for a 90s movie. Really underrated. Had a couple parts with pretty questionable CGI, including one key part, but the movie is still so good it survives beyond it. Must-watch!"}, {"rating": "5", "text": "The message in this movie was a little too on the nose for me.  Story was fine until they hit you over the head at the end."}, {"rating": "10", "text": "Great, very underrated, movie. The music and visuals of this movie are fantastic. It's one that the special effects used have held up over time. It's over 23 years old now as of this writing and yet it still looks and sounds amazing. This is all before we even mention the story. Even without good visuals or sound the story could stand up on it's own. I think the story really captures the essence of Carl Sagan."}], "recommendations": ["arrival", "interstellar", "the_martian", "upside_down", "risen", "avatar", "the_giver", "annihilation", "donnie_darko", "chaos_walking", "the_adjustment_bureau", "elysium", "her", "hereafter", "mortal_engines", "sunshine", "cloud_atlas", "the_13th_warrior", "chappie", "stargate", "valkyrie", "i_am_mother", "vanilla_sky", "the_butterfly_effect", "lucy"]}