{"id": 4274, "title": "Cooties", "starring": ["Elijah Wood", "Alison Pill"], "runtime": 88, "genre": ["Comedy", "Horror"], "description": "A mysterious virus hits an isolated elementary school, transforming the kids into a feral swarm of mass savages. An unlikely hero must lead a motley band of teachers in the fight of their lives.", "releaseYear": "2014", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/qnH3SCfb3ePz9qM8BvBtq9JLLXY.jpg", "categories": {"plot": 6.0, "acting": 6.0, "ending": 2.2, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 3.0, "funny": 5.642857142857143, "action": 8.5}, "reviews": [{"rating": "6", "text": "Goofy fun, but very forgettable and predictable. It will ruin chicken nuggets for you forever. It's not very scary and it's over the top, but most of the time, that's why it works."}, {"rating": "7", "text": "It can't boast enough thrills as it should for a horror comedy, but cooties is a solid, albeit cliché, gore fest with a great emphasis on awkward humour sided with a smattering of child monsters which crack some good scenes. This film is also expertly shot if I must say. Directors Jonathan Milott and Cary Murnion need to work on their resolutions of arcs and an overall message which will untie itself rather than leave the audience hanging."}, {"rating": "7", "text": "Started off crazy funny, ended scary and zombie packed! Lots of cheap gore to go around though! Should watch it to the end, and the frog !F*cked! the caterpillar!"}, {"rating": "8", "text": "A slightly fresh take on a old Zombie film genre; I give cooties credit for giving a (basic) story behind the zombie plague. The characters were mostly forgettable, but let's face it, most people who enjoy zombie films aren't always in it for top tier acting or a memorable story line.\r Cooties is a funny, interesting take on a dying movie genre. They take some risks, but never enough to actually make you ever regret watching the film. Some people have taken offence to the fact children are the main target of the virus and movie violence, to them I simply say \"get over it ****"}, {"rating": "5", "text": "This is a moderately funny zombie film that had more potential.  The zombie genre has been rehashed over and over again and there's not much new conceptually that can be done.  The zombie comedy has been done and with Cooties the idea of only child zombies was a little different.  Unfortunately there's just not enough laughs to give it a recommendation.  C+"}, {"rating": "7", "text": "Cooties: An Instant Horror Classic\r by jd ep\r With all the zombie movies and TV shows vying for your eyeballs, its hard to bring something new to the table. Cooties is a zombie movie made by horror fans for horror fans, open ended for sequels and maybe a prequel, a good amount of gore, terrifying monsters and just enough standard horror tropes and winking at the cast's better known works. Written by SAW co-creator Leigh Whannell and co-creator of Glee, Ian Brennan, Cooties balances the mundanity of summer school with the fear of a pandemic. It all starts with a tainted chicken nugget which gets one of the students sick and the teachers are so self-interested, they don't notice the world has caught on fire around them. The movie is good, though not perfect, some of the characters are pretty thin, like Nasim Pedrad's Rebekkah introducing herself to Elijah Wood's Clint, by pointing out the Anti-Rape alarm she has clipped to her coat, in lieu of being able to have a concealed carry pistol, she does little but plays a brash female teacher you almost are waiting for her to get her ankles chewed off by a horde of the infected children. We find out midway through, the virus that turns the students into kind of a 28 Days Later, Rage Zombies, only affects pre-pubescent children, from a bite or scratch. Leigh Whannell also plays a socially aloof science teacher, reading a \"How to have normal conversations\" handbook, when we first see him, named Doug, who is intent on dissecting one of the children, giving the go ahead to stop the tiny terrors by any means possible, as the zombie virus has destroyed the parts of the brain that make the kids human anymore.\r Cooties centers around Elijah Wood's character, returning home to Fort Chicken, Indiana, as he's attempting to return to his roots and work on his first novel, a shoddy version of Stephen King's Christine with a boat instead of a car. Clint has taken a job as a substitute teacher at his old elementary school where he catches up with his old paramour, Lucy, played by Alison Pill, only to find out she's dating the school's P.E. Teacher, Rainn Wilson's Wade. The love triangle has some push and pull but in the dire situation the group of survivors are faced with, as they find the infection goes well beyond the boundaries of the school.\r If you love horror, Catch Cooties\r 7/10"}, {"rating": "8", "text": "Barely scary but frequently funny. I find it funny. Check out yourselves and you will surely find out.\r Watch it here for free http://www.watchfree.to/watch-2a3e80-Cooties-movie-online-free-putlocker.html"}, {"rating": "1", "text": "Worst piece of vile entertainment to come out in 2015. Pathetically attempts to be campy, but ends up being like that decomposing dairy based dessert one left out and forgets for summer weeks on end in the darkness of pantry & ala Homer Simpson attempts to ingest only to succumb to a mixture of rotten photodegradation as product is brought to the light of critical view & end result: subsequent mixture of poor filmmaking & green bile. One of those exercises where one wonders how can this much talent not know they are making such fowl stank degradation? This is visual vomit makes the standard for cinema garbage (bad Adam Sandler movies) seem like classics. Was angry enough with Redbox to try & figure out a way to get my dollar back for renting this absolute trash."}, {"rating": "6", "text": "For its production standards not a bad product.\r Some of the decent second tier horror and zombie movies were made in the 2015 and this is one of that. When the actors are in demand, we expect big from their movies, but this story suits for these actors. Because an average story looks better with guys are not in the watch-out list. So I was not surprised with the movie, but enjoyed the entertainment it offered.\r Rainn Wilson's the man of the movie, but as for the narration Elijah Woods stands on the front. In this, the children were the antagonist, but it is an R rated movie and nothing was so serious to consider. You know bashing kids kind of stuffs were carefully crafted. Comedy means not like you're going to get the loud ones, but simply acceptable for a change in the storytelling.\r If you exclude the zombie kids, the rest of the movie was nothing new. The same old adventure with the similar group of people who tries to survive the epidemic. Especially how it all begins was not logical, so you better not look for a proper explanation for those things. Even the runtime was well shorter than the 90 minutes that makes it sweet, Overall a fun movie, only if you accept what it delivers than what you want.\r 6/10"}, {"rating": "7", "text": "It was violent, well acted, well made, funny and entertaining. Cooties isn't the most original zombie/contaminated movie and it's not the best either, but it sure as hell is a fun movie to watch."}, {"rating": "7", "text": "This film was funny and slick. The idea of child actors being able to take on more adult roles is appealing to me as I enjoy watching child actors really show what they are made of. The story stays on topic of what a zombie film should be but it dosen't resort to every typical zombie movie ever made cliche and I think that's great. Some of the acting could be stronger at times and some writing felt pushed aside."}, {"rating": "4", "text": "Cooties is not a good movie but it is fun enough that some of its audience will enjoy it. Sadly though Cooties is a horror comedy that doesn't provide enough of either horror or comedy. It does take on a slightly different story than most zombie films but is mostly unoriginal. The tone is too bright to be scary and it doesn't have much humour that doesn't feel forced. Rainn Wilson provides a few good laughs and winds up being a bit of a badass later in the movie, but other than that the characters are fairly forgettable. Which is sad because there is some talent here in Elijah Wood, Alison Pill and Jorge Garcia. The gore is really crude looking as well and you can tell its fake and then it is all topped off with a fairly abrupt ending where nothing is truly resolved."}, {"rating": "4", "text": "Cooties is a mostly-funny, never-scary, barely-grotesque, R-rated, B-movie horror comedy that should have never even thought about attempting any sort of semblance to character study.\r Rainn Wilson is the real standout in Cooties. His portrayal of Wade the gym teacher brings the bulk of comedy and life to the movie. Cooties is almost worth watching just for seeing Rainn Wilson do his thing.\r But of course the filmmakers had to go and ruin the seed of potential by crushing the movie with a boring, repetitive middle third. Cooties attempts to introduce some sort of real horror element that doesn't work and then for some reason tries to develop realistic characters with realistic relationship problems. Not everything needs a love story."}, {"rating": "10", "text": "Terrifying and hilarious. This is what a horror comedy should have, and this has those very things. Very nice concept and is just an amazing thrill ride all the through to the end. Amazing movie.\r Some of the jokes are hit or miss, but most of them are funny."}, {"rating": "8", "text": "There's been a lot of zombie comedies out recently, but this has been stronger than most. The dialogue has a little more thought put to it. Well, directed, entire cast was strong especially screenwriter as weird teacher Doug."}, {"rating": "3", "text": "Zombies and comedy sometimes are a rare combination, although Shaun Of The Dead and Zombieland are good examples of when it works out.Cooties is not that bad and it manages to get you several laughs.Its purpose is to entertain and it does it in the most essential way."}, {"rating": "4", "text": "The movie is simply okay for the most part.  However the ending isn’t any sort of conclusion. Since they didn’t make a part two, I guess that’s it.   The movie could’ve used a little more gore and comedy.  It seemed to be leaning back and forth between serious and silly. Never finding a proper balance:"}, {"rating": "8", "text": "A fun gore fest for thr whole family. Well, just not the kids. Unless you want to ruin chicken nuggets for them."}], "recommendations": ["cabin_fever", "krampus", "the_curse_of_la_llorona", "freaky", "zombieland", "scouts_guide_to_the_zombie_apocalypse", "the_babysitter", "splice", "house_of_1000_corpses", "the_possession", "countdown", "the_green_inferno", "malignant", "goosebumps", "drag_me_to_hell", "dark_skies", "gremlins", "ready_or_not", "scream_4", "the_happytime_murders", "unfriended", "texas_chainsaw_3d", "case_39", "hostel", "the_host"]}