{"id": 4841, "title": "Cop Out", "starring": ["Bruce Willis", "Tracy Morgan"], "runtime": 107, "genre": ["Action", "Comedy", "Crime"], "description": "Detectives Jimmy and Paul, despite nine years as partners, can still sometimes seem like polar opposites—especially when Paul's unpredictable antics get them suspended without pay. Already strapped for cash and trying to pay for his daughter's wedding, Jimmy decides to sell a rare baseball card that's worth tens of thousands. Unfortunately, when the collector's shop is robbed and the card vanishes with the crook, Paul and Jimmy end up going rogue, tracking down the card and the drug ring behind its theft, all on their own time and without any backup—except for each other.", "releaseYear": "2010", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/qA31i7FPVDHezuoevx3497CvZd4.jpg", "categories": {"plot": 3.75, "acting": 4.0, "ending": 5.75, "soundtrack": 1.0, "cinematography": 5.0, "familyFriendly": 3.0, "funny": 4.78125, "action": 2.25}, "reviews": [{"rating": "4", "text": "\"Cop Out\" is plain terrible. Bruce Willis and Tracy Morgan fails to show any 'buddy performance'. Instead they succeed to present the true meaning of 'preposterously idiotic'. Way to go, Kevin Smith."}, {"rating": "1", "text": "Pathetic...Most of the user comments don't understand what a movie is meant to be. This movie is as good as any video that you can find on Youtube. Bad plot, a slightly funny joke every so often and easily forgotten after 5 minutes.I understand that the movie is only meant to be funny and that it's not meant to be amazing or something that anyone would recommend, but this movie fails at a comedy just like the parody movies that fail such as Meet The Spartans and Scary Movie. Both hated by anyone who knows anything about movies.Listen to the critics, they get paid for a reason."}, {"rating": "6", "text": "Homage or parody? That is the question. Although the filmmaker gives out directions on how to watch \"Cop Out\", as Paul(Tracy Morgan) pays homage to other films by re-enacting them to a suspect under interrogation, the moviegoer should ignore the authorial voice emanating from Morgan's character, because \"Cop Out\" is a parody, since some of the apparently serious scenes are funnier than the intended comedic ones. On occasion, the silly banter between Morgan and Bruce Willis(even sillier when Sean William Scott joins the party) can be moderately amusing, but it's the dramatic moments, like the one in which a Mexican drug dealer begs forgiveness from God in a church after his younger brother caps a flunkey, that \"Cop Out\" becomes \"Buddy Cop Movie\", a parody made all the more canny for its straight-faced execution of a cheesy eighties cop show like \"Miami Vice\". This filmmaker, known for his impolite dialogue in such anarchic films such as \"Clerks\" and \"Dogma\", has to be kidding, right? As Jimmy, Willis keeps it \"real\"(or is it real?) while he wistfully discusses his daughter's upcoming wedding to a drug kingpin's mistress, a scene that seemingly sends-up the moment where the tough guy reveals his unbeknownst softer side, in this case, via soliloquy. (The Hispanic woman can't understand English, so it's like he's alone). At the actual wedding, however, the emotionally climaxing moment where Jimmy gives his daughter away seems too sincere and persuasive in its adherence toward Hollywood conventionality, the moviegoer fears that the filmmaker might actually mean it. If the sentimental ending is homage, and not a parody of bad television and movies, then \"Cop Out\" doesn't seem like a laughing matter anymore."}, {"rating": "3", "text": "With Bruce Willis and Tracey Morgan i thought this was a good match and it would be funny. It just plainly wasn't at all. The occasional joke that made me laugh didn't over come the amount of time i sat wondering when this was going to end. I'm sorry Bruce but this was not one to be proud off."}, {"rating": "10", "text": "I don't get what was so bad about this movie. It was hilarious! And thanks to this movie, I am now a Tracy Morgan fan! Usually, I was never a fan of Kevin Smith's movies, but this movie mad me change my mind about him."}, {"rating": "7", "text": "Sure, it ain't a movie that I would email all my friends to see...but I like Kevin Smith and I love Tracy Morgan...and I laughed out loud at parts. If you go into it looking for some laughs you won't be disappointed. Just gotta say I think the critics and user scores are way too harsh on this film."}, {"rating": "0", "text": "I laughed more during my vasectomy."}, {"rating": "3", "text": "A Film Review by: Sam Fragoso*1/2\"Cop Out\"Kevin Smith who directed and wrote films like \"Dogma\" and \"Clerks\" makes a new buddy cop film that makes those films look like masterpieces. Bruce Willis and Tracy Morgan star in this dreaded action/comedy picture. Now what I liked about Smith's earlier films was that it continued to be funny through out the whole film and it new exactly what it wanted to be. However that's certainly not the case with \"Cop Out\". For every mediocre joke in \"Cop Out\" there is about twenty minutes of brutal fighting that doesn't move the plot along at all. I recommend watching the first five minutes, it's about the only remotely comedic part in \"Cop Out\". This is a big disappointment for me and I hope Smith's up and coming films are alot better then this"}, {"rating": "9", "text": "Every one...do not listen to the freaking critics. The opening freaking scene tells you it is a parody on other cop movies, in fact it pays homage too them!. (that may be too big of a word for the critics. Get a f-ing dictionary).It is a good, funny, entertaining silly movie. There is a reason you low life critics arent liked...because you are uninformed, pathetic, insecure pussies! By the way, the only reason anybody would be a movie critic is because they couldnt get a freaking job handing carts out @...lets just say it sounds like Marmart. Oh yeah one more thing, Ebert (or whatever his/her name is) said, \"Butch Cassidy and the Sundance kid was a terrible movie. Obviously, he has rescinded that review! That was a review of what most critics wrote. Yeah, yeah, yeah, my syntax is incorrect and I probably misspelled a word...bite me you losers."}, {"rating": "7", "text": "Willis is good anytime."}, {"rating": "9", "text": "Good to see Kevin Smith do something he has not written. It was very funny. Critics seem to forget it is a spoof of 80's cop movies."}, {"rating": "0", "text": "Worst movie I've seen in years. They have redefined the word stupid. The only point of the movie was to see how many f-bombs could possibly be dropped within a two hour time frame. Like I said - Stupid!"}, {"rating": "3", "text": "It was so unfunny. After five minutes I was saying how in the hell could these two have been on any police force for 9 minutes, let alone 9 years. totally inplausible. Tracy morgan is funny as hell, but after you laugh at the rants, you realize not of it could ever have happened. A standard buddy flick with a so-so shoot out ending and Tracy Morgan showcase scences that never blends together."}, {"rating": "1", "text": "A truly painful experience. Makes going to the dentist look like Disneyland. I hope Bruce Willis feels a little bit guilty when he goes to the bank to cash his cheque."}, {"rating": "1", "text": "Bruce Willis does ok for what he's given, and a few parts are funny, but this was just a waste of money/time. I've never been so annoyed at an individual on screen before that I wanted to bash his face into a car windshield and send to an english class - Tracy Morgan. If you can even understand what the hell he's saying, you just want to punch him. Advoid unless you like throwing money away or seeing what a giant turd looks like on screen."}, {"rating": "7", "text": "Tracy Jordon was funny. Story was a little lame but you still enjoyed the movie for the laughs."}, {"rating": "0", "text": "The writing is horrible. The plot is hardly recognizable. I am horrified that execs at Warner Brothers did not have the common sense pull the plug on this lame poorly executed childing horror of a comedy film."}, {"rating": "4", "text": "Bad movie man, bad movie! You can tell BW is fighting with the director and the two guys have no chemistry. Tracey Morgan disappoints me in this movie and I like his style typically, Bruce too. C'mon Bruce, this was just a money movie right? Your better than this dude."}, {"rating": "10", "text": "Its entertaining...if you just need to get away from reality for an hour and just laugh at stupidness...then it did the job! Everyone in the theater was laughing right along with us! It was silly and funny, just like SNL or American Pie....just silly and entertaining! Whats wrong with that?"}, {"rating": "8", "text": "Not the best movie directed by smith but one cant deny it IS better than jersey girl and a few other movies he's done."}, {"rating": "3", "text": "Overall pretty poor effort, by writers on down. Don't waste your time. Normally I'm a luke warm Willis fan but there was nothing but poor jokes to work with here."}, {"rating": "8", "text": "Not drop-dead hilarious, but it was still a funny ride from start to finish.  I wouldn't mind seeing it again."}, {"rating": "6", "text": "Incredibly stupid, but still funny. I really like Tracy Morgan in this, and laughed most of the time he was speaking. He is the only reason this movie was anything good."}, {"rating": "3", "text": "What makes a good cop buddy film? I have seen so many I could give you a list. There are a lot of possibilities involving the cop buddy genre. Unfortunately, Cop Out has none of the factors that make a buddy cop film. Itâ"}, {"rating": "5", "text": "this film is essentaully parodying the old 80s and 90s buddy cop films and has a few funny moments but most of it feels like it just belongs in that era and not 2010. this movie came out 15 years to late even then would just be considerd a ok film at best if it did."}, {"rating": "7", "text": "I'm from Kevin's generation.  Not just chronologically, but also inspirationally.  Fletch is one of my favorite comedies.  As is Stakeout.  As is Lethal Weapon.  All elements clearly and intentionally paid homage (as Tracy Morgan humorously mispronounces at the beginning of the movie).  It was Kevin's not-so-subtle message (along with the cheap synthesizer and Fletch song at the ending fade) that he was about to show a film that had not one ounce of originality, but was meant to be an enjoyable popcorn film for fans of his, fans like him and those who just wanted to be entertained.  I had NO expectations coming into this movie as critics and viewers alike ripped it apart.  From a critical perspective, it's only slightly above average.  However, from the INTENT of the film, it was perfect.  The movie was fun, enjoyable and made me happy to see the genre revisited.  Thanks Kevin!"}, {"rating": "8", "text": "one of the funniest movies of 2010 the plot was dump but what do you expect from kevin smith. the movie made me laugh through whole time and so did the rest of the theater  i was in but i can see why many people didnt like it, its one of those movie either people like or dont."}, {"rating": "7", "text": "It provides the laughs, but there are tons of better comedies and movies out there. It's funny at times and hilarious at others, it starts off poorly but quickly had me laughing. Surprisingly though the funny moments come strictly from Bruce Willis and the supporting cast, Tracy Morgan almost never made me laugh, the only times he did was when he was on screen with Seann William Scott, when Seann isn't on screen Tracy Morgan just ends up being an annoying character who you would rather see played by someone else. However even with it's (numerous) flaws it manages to be worth a rental if your looking for a laugh."}, {"rating": "8", "text": "The film is more funny than not, a predictable buddy cop movie that's fun and enjoyable too watch most of the time, with dialogue laugh out loud funny, even if it does have it's share of it's lameness."}, {"rating": "5", "text": "Generally poor, seen it all before movie which never rises above the level of mediocre. The only section I found myself even remotely chuckling at was the good cop, bad cop routine."}, {"rating": "5", "text": "Its got a few funny moments but The Other Guys is comparably better because the cop buddies in that movie actually seem like buddies."}, {"rating": "1", "text": "The stories Smith tells about the making of this movie and his falling out with Willis are a 1000 times funnier and more entertaining than this flick will ever be. It tries to mimic these 80's cop buddy movies and they even got Harold Faltermeyer to do the music but it just doesn't work. There is no chemistry between Willis & Morgan, the jokes are bland, the action is pretty standard and sidekicks like Scott can't save it. The plot is riddled with clichés and is as predictable as hell so it's surprising it was on 'The Blacklist' of best unproduced scripts. It had better stayed that way..."}, {"rating": "3", "text": "There is nothing intelligent about this piece of crap. Nothing makes sense. Morgan, as usual, is playing an annoying person whom I find aboslutely boring. Willis is okay, but this movie and its jokes are just...bad. Nothing positive to say about this, I'm afraid.   Diagnosis: Don't see it. The worst film of the year: Not \"thee\" worst, but one of the top 15.\rGuilty Pleasure: No."}, {"rating": "5", "text": "It's funny, and funny makes up for a lot of screw-ups."}, {"rating": "0", "text": "Cop Out is a true disaster. Every joke it attempts to make falls completely flat. It's rather disappointing because I was looking forward to it, and it was honestly just a lazy movie."}, {"rating": "5", "text": "Uma comédia razoável,salva pela ação e por ter no elenco Bruce Willis e Tracy Morgan agradando com seu humor e o excelente Seann William Scott.Porém sim tem seus momentos!!!"}, {"rating": "4", "text": "It's not as bad as advertised. Bruce Willis is....Bruce Willis, Tracy Morgan is funny but borderline annoying at times. Seann William Scott provides the most laughs for the movie as his character is a delight but the rest of the movie isn't that great, even by Kevin Smith standards."}, {"rating": "1", "text": "Kevin Smith What are you doing i know you are better than this. Tracey morgan is annoying as hell and Bruce Willis looks like he's asleep or bored and with this script it's not hard to see why. the comedy falls really flat and why this isn't on more worst films of 2010 astonds me i'd easily say it deserves a space with the other terrible movies that came out that year like Jonah Hex, Last Airbender, Twilight Eclipse  and Alice in Wonderland"}, {"rating": "1", "text": "A weird failure from Kevin smith.  Usually a fairly good action actor Bruce Willis fails miserably and Tracy Morgan fails even worse then that.  In a movie that fails in every possible way it can."}], "recommendations": ["ride_along_2", "ride_along", "horrible_bosses_2", "paul_blart_mall_cop", "the_ridiculous_6", "the_other_guys", "get_hard", "zoolander", "thunder_force", "dumb_and_dumber_to", "30_minutes_or_less", "dirty_grandpa", "norbit", "the_longest_yard", "the_wrong_missy", "grown_ups", "dodgeball_a_true_underdog_story", "masterminds", "dinner_for_schmucks", "hubie_halloween", "the_wedding_ringer", "zack_and_miri_make_a_porno", "identity_thief", "the_watch", "tropic_thunder"]}