{
  "id": 1789,
  "title": "Copshop",
  "starring": [
    "Gerard Butler",
    "Frank Grillo"
  ],
  "runtime": 107,
  "genre": [
    "Thriller",
    "Crime",
    "Action"
  ],
  "description": "On the run from a lethal assassin, a wily con artist devises a scheme to hide out inside a small-town police station. However, when the hit man turns up at the precinct, an unsuspecting rookie cop finds herself caught in the crosshairs.",
  "releaseYear": "2021",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/szArp3dQlVajpsqpyPFVAFHFsa3.jpg",
  "categories": {
    "plot": 7.625,
    "acting": 7.666666666666667,
    "ending": 6.333333333333333,
    "soundtrack": 7.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 7.666666666666667,
    "action": 6.75
  },
  "reviews": [
    {
      "rating": "7",
      "text": "Gerard Butler and Frank Grillo play outlaws on opposite sides: Grillo is a mob defector and Butler is the hitman assigned to rub him out. They end up in opposing cells in the same jail. Meanwhile, another assassin (Toby Huss providing some twisted humor) joins the race to dispatch the snitch. Meanwhile, the invasion of the police station gets lethal with the encounters boiling down to one cop (Alexis Louder taking an impressive lead). This film takes a while to get going, but once it does, there are some impressive scenes of violent action. Everyone in the cast seems to be enjoying the pulp aspects of the plot and style, which translates into an unusual conflict drama that escalates into an action film."
    },
    {
      "rating": "7",
      "text": "Esta bastante buena la película pero de ahí... nada memorable para recordar."
    },
    {
      "rating": "6",
      "text": "Didn't have the pop of Smokin Aces and everyone was under utilized. So many good folks in this, but not enough plot to go around. Biggest attraction was Alexis Louder. She absolutely rocked. Totally smitten. Can't wait to see her next gig."
    },
    {
      "rating": "4",
      "text": "Fans of the genre may get some kicks, but overall this is pretty boring and feels very straight-to-DVD…"
    },
    {
      "rating": "2",
      "text": "miss cast for sure Alexis Louder and who ever played the chief were not the right pick for these roles. whenever those two are on screen the film feels like a YouTube video. It's not just the acting it's there writing too. when they speak its feels as if they were added into the script for some reason."
    },
    {
      "rating": "8",
      "text": "Double crossing/double talking bad guys try to outsmart each other within the confines of a jail out in the middle of the Nevada desert. Black humor & witty bon mots about. It's Die Hard set in a jail with a female lead just as human and flawed as John McClaine. Lots of fun"
    },
    {
      "rating": "3",
      "text": "bad[ bad ]adjective, worse, worst;(Slang) bad·der, bad·dest for 36.not good in any manner or degree."
    },
    {
      "rating": "8",
      "text": "Wow - what a surprisingly fun movie! Went into this not knowing what to expect and was pretty impressed with the quality of the writing and the overall movie production. Well done!"
    },
    {
      "rating": "10",
      "text": "best movie of the year would watch it again and all it's sequels to come. can't wait"
    },
    {
      "rating": "7",
      "text": "From the moment the opening credits and especially the title theme music (a direct homage to Lalo Shifren' s Magnum Force theme, the Dirty Harry sequel) started, Joe Carnahan' s love of pulpy '70s thrillers was apparent. Comparisons to John Carpenter's Assault On Precinct 19 are obvious given the siege atmosphere in a police station, and the trust between criminal and cop. It's as though he combined the old school '70s Don Siegel with the new school '70s of Walter Hill. Mean and lean, it's great that Carnahan directed this and the also enjoyably goofy Boss Level in the same year."
    },
    {
      "rating": "6",
      "text": "Often stylish and with a fantastic cast, copshop uses smart direction and editing work to generate great thrills with some notable moments of action mixed in with the tense buildup to its finale. However within such an over saturated genre it fails to truly shine above the rest and yet it glistens nicely enough within the other gold tier of quality films of its ilk and kept me very entertained throughout."
    },
    {
      "rating": "7",
      "text": "While I liked many aspects of the movie and the mix of weird comedy with action, there was still something missing to the plot to make it much better. But it is quite good anyway."
    },
    {
      "rating": "6",
      "text": "I don't mean to sound dismissive in any way, but can it be considered flattering to say that a movie you expected to be trash turned out to be a really entertaining experience? I'm intrigued.Copshop doesn't really care about anything, but what it offers is a fun ride that really seems to admit that it is only made for what it has to last, and that should be enough for you, because if something became clear to me is that if you demand more, you are the one who is fooling yourself with your own expectations."
    },
    {
      "rating": "7",
      "text": "Came in expecting a dumb action B movie.Came out incredibly surprised at how good Copshop was. Great writing, fun characters, stand-out performances and genuinely tension-filled moments.Copshop is a genuinely great thriller and the hidden gem of movies in 2021."
    },
    {
      "rating": "5",
      "text": "Adorable. As if Tarantino had a thirteen-year-old cousin and his cinematographer was bored, and this was their first movie."
    },
    {
      "rating": "5",
      "text": "(Mauro Lanari)So far, Carnahan's worst film. For the first time in his valid career, he mistreats his own directorial qualities by not bringing interesting novelties and limiting himself to yet another more violent, brutal and pulpy remake of \"Assault on Precinct 13\" (Carpenter 1976 ...). The greenhorns will barely remember the derivatives \"Reservoir Dogs\" (1992) and \"Free Fire\" (2016)."
    },
    {
      "rating": "6",
      "text": "I like that Copshop isn't trying to be some artistic revolution for the action genre. It seems like a lot of action films nowadays are trying prove that action cinema can be art too, as if we didn't know that already. I love those movies, but sometimes it's fun to go back to pure and to-the-point 80's style action."
    },
    {
      "rating": "7",
      "text": "Yoi akushon eigadesuga, sutōrī wa motto yokatta to omoimasu. Totemo tanoshikattanode monku wa iemasen."
    },
    {
      "rating": "7",
      "text": "A great movie. Good storyline spiced up with great jokes. The ending of course spoils the impression because nothing is clear. There is some groundwork for the second part, but it seems to me that it will only break the perception of the first and make it worse. However, if it does come out, I will definitely look at it."
    },
    {
      "rating": "8",
      "text": "Хороший фильм, мне понравился. Жду продолжения."
    },
    {
      "rating": "5",
      "text": "The film is very good. the production of the film itself was excellent. the film holds attention from beginning to end to be watched and keeps people in suspense."
    },
    {
      "rating": "10",
      "text": "Smart, silly, wild and thrilling. Every actor is delivering an awesome performance as an interesting character in this odd film. This is a simple storyline that is full of big personalities and action. It feels like they had a blast making this film, and I had a blast watching it."
    },
    {
      "rating": "7",
      "text": "The movie is over-the-top, but it does not ignore the \"top\". I admire Copshop for its self-awareness and tone, but I also acknowledge the nonsensical third act and overwritten dialouge."
    },
    {
      "rating": "3",
      "text": "Triste e inverosimil desarrollo de la historia, especialmente la \"super policía\" que lo único que le falta hacer en esta pelicula es autocurarse como cualquier X-men que se respete."
    }
  ]
}