{
  "id": 363,
  "title": "Coraline",
  "starring": [
    "Dakota Fanning",
    "Teri Hatcher"
  ],
  "runtime": 100,
  "genre": [
    "Animation",
    "Family",
    "Fantasy"
  ],
  "description": "A young girl discovers an idealized parallel universe behind a secret door in her new home, unaware that it contains a sinister secret.",
  "releaseYear": "2009",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/gPMh5rsVrDDAYMDbTcz6Up1DQ4z.jpg",
  "categories": {
    "plot": 5.98,
    "acting": 6.1875,
    "ending": 7.833333333333333,
    "soundtrack": 8.0,
    "cinematography": 6.0,
    "familyFriendly": 7.157894736842105,
    "funny": 7.5,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "10",
      "text": "The people that said the movie was boring and dull are really saying that they don't want to watch something different and new but just want to stay in their comfort zone of totally predictable movies at least its a fresh change from all those other movies."
    },
    {
      "rating": "8",
      "text": "Coraline really provides an interesting story with some very nice visuals! It is very engaging and it definitely involves the viewer to figure out what is happening out. Visually, there are some beautiful scenes, and besides the unusual animation style it is still captivating, but nowhere nearly as beautiful as some new animated films, such as \"Up\" or \"Wall-E\". Nevertheless, a very nice animated film."
    },
    {
      "rating": "9",
      "text": "Good god this film is creepy. Forget actual horror films, I can safely tell you that this was scarier than any horror film I have seen since it's release. Aside from the near mental scarring I underwent, this film was fantastic, it contains some of the best animation I have ever seen, and one of the most compelling heart warming stories. Just don't watch it at night."
    },
    {
      "rating": "9",
      "text": "A true labour of love, which bore gorgeous fruit, visually and stylistically. Not likely to appeal to a crowd looking for singing fish and dancing zebras. Why anyone would expect this to be a Disneyesque, inane sunshine and lolipops venture for a SMALL child and then complain after the fact is a bit of a mystery. It is INTENDED to be dark and yes, disturbing. The artistry and execution left me at a loss for words after viewing, but perhaps that is because I am just a \"moran\" (sorry Bill C)"
    },
    {
      "rating": "9",
      "text": "It was really visually stunning, the 3d was a little distracting in a few places, it was really spot-on the spirit of the book, even with the changes. It was fun and creepy and me, my husband, and my 12 year old daughter all enjoyed it. Amazing stop-action like I've never seen."
    },
    {
      "rating": "10",
      "text": "The extra money for the rich 3D is absolutely a must. I was sad when the movie ended that's how much I enjoyed my experience."
    },
    {
      "rating": "9",
      "text": "At first I felt like a child again, discovering how \"wierd\" evil was rather than scary or threatening. It than dove right in to the insanity and came out squeaky sane on the other side. The resiliency of a child's mind is astonishing and the movie brought that all back."
    },
    {
      "rating": "9",
      "text": "This movie may have been weird, spooky and meant to be played in October. Also, the way that everything went, ( how thematic it was and how scary it was, and to mention one clip of the movie was suggestive enough that it was meant for teenagers instead of children. ) But other than what I just said this was the best movie that I saw that was not meant for toddlers, or adults. The story was surprisingly awesome in an adventurous way, and how they set up the movie was classic. Even better, the movie was definitely appropriately timed, when the movie was ending, I was getting a little antsy. This movie is a must see to any teenager out there."
    },
    {
      "rating": "9",
      "text": "What a magical experience, not a movie at all, but a brilliant adventure. Very creepy... Truly creepy and unsettling... If the movie is too scary for your kids, then don't watch the whole thing! Just because it is spooky doesn't equate it with being bad. The rich visuals were right on. Way better than Nightmare."
    },
    {
      "rating": "9",
      "text": "Excellent script and stellar animation makes this a winner. I saw it without 3-D, but it was still very impressive. Imaginative and beautiful animation, but suspense and menace keep it from being syrupy. Kept my interest and attention till the end."
    },
    {
      "rating": "10",
      "text": "It's surprisingly dark to be called a family film but it seems to go well but is could be better than it actually is that said it was one of my favourites from 2009."
    },
    {
      "rating": "10",
      "text": "This movie is an endless cycle of creativity and spookiness. This movie just makes me wonder sometimes. The animation is pretty cool to be honest. I do recommend this movie."
    },
    {
      "rating": "7",
      "text": "Laika's Coraline is a very, very creepy and disturbing \"kids\" film. The animation in this film is flawless and the story is great. This film is also very, very creepy. This film has some of the most disturbing animation EVER. In the end, this is a wonderful debut for Laika and my rating is 7.9/10"
    },
    {
      "rating": "9",
      "text": "\"Coraline\" é um filme com um roteiro excelente e com uma animação estelar bem feita. Um dos melhores da minha infância, sem dúvida.9/10"
    },
    {
      "rating": "10",
      "text": "Coraline is a masterpiece with insightful and clever stop-motion animation that will entertain you like never before. The 3D is absorbing and intelligent, Athena wise 3D use. The plot is original and riveting, with a pleasant and fascinating ending that you will never expect it coming. Coraline easily is imaginative, powerful and surprisingly, one of the greatest works done in a long time."
    },
    {
      "rating": "8",
      "text": "\"Coraline\" is very basic in terms of story structure or voice acting. But it's the originality that pushes this visually magnificent movie into the stage of performances. Overall a well-made animation that audiences of every age will definitely enjoy."
    },
    {
      "rating": "8",
      "text": "I REALLY enjoyed watching this movie, and my only gripe is a strange one: About half way through the movie, it starts seeming like it's a video game."
    },
    {
      "rating": "9",
      "text": "Films a near masterpiece. I absolutely love stop-motion animation, and this is definitely one of the best. Everything that laika has been putting out is absolute astonishing, or at least a little lake-warm, but i absolute adore this film for its dark horrifying storytelling and just being an absolute classic."
    },
    {
      "rating": "5",
      "text": "Neil Gaiman has always been an acquired taste. His visions of twisted reality in all of his works has always been more appealing to me as in book form rather than as a visual entertainment. Coraline is no exception. His foray into children's books with the publication of Coraline was a surprise to many but his quirky story was well written and appealing on paper. On film however, it just seems...well, strange. Not exactly a kid's movie and not exactly a film for adult's either. The skill it took to animate using stop action movement should be appreciated. Some stop motion techniques exhibited in this film were simply astonishing. But technique alone does not make a good film. A great film for film students does not make a great film for the average viewer. Consider the twisted universe of the film's reality and the even more twisted vision of the film's alternate reality. Look at the scenes with the almost nude acrobatic sisters. Listen to the awful vocal music, This is not a film for children. Let your kids read the book instead and let them use their own imagination to fill in the blanks. And a final note: The 3D theatrical version must have been something to watch. DO not fall for the DVD's 3D version. It is simply bad. Using red and green cardboard glasses, the film is colorless, dark, eye-aching awfulness. The producers of the DVD's 3D packaging should be ashamed."
    },
    {
      "rating": "9",
      "text": "Henry Selick takes Neil Gaiman's imaginative story and makes wonders with it with thrills, dark humor, great stop motion animation, and a cool original score make Coraline one of the best animated films ever made in my opinion. I give this movie 93%."
    },
    {
      "rating": "5",
      "text": "I really wanted to like this movie, especially after viewing the metacritic score. This was the first 3D movie I felt was worth seeing. And while it is not a terrible movie, it certainly does not deserve a 79 score. Others have mentioned it, but Dakota Fanning is NOT a good voice actress. The visuals were hit and miss. When Coraline first visits her \"other family\" is close to stunning and kept my attention. Unfortunately from that point on I felt like taking a nap. The scene with the near-nude granny was not at all necessary, and not funny. That's another thing this movie lacked: humor. All in all, this is not the worst movie I've ever seen. Far from the best. Far, FAR from the best."
    },
    {
      "rating": "8",
      "text": "Coraline will Sewprise You from the BeginningI recently watched the movie Coraline made by Laika Entertainment during English class. It was a very entertaining movie but also had an odd fee9ling to it. I’d like to inform you of positive and some negative points to the movie and why you should watch it. Coraline is about a girl who has to move to a new home, called the Pink Palace. She goes exploring outside her new home and meets a new ‘friend’ named Wybie. He is not aloud to go into the pink palace because his grandmother says it’s “dangerous.” One day while Coraline was exploring her new home, she found a mysterious door. At first it’s locked but she makes her mom find the key to the door. When she opens it up, it’s filled with brick. During the night, when everyone else is sleeping, a mouse lead her to this suspicious door she was so curious in. She opens it up once more but this time there is no brick and it brings her to another dimension. Everything in this universe is considered to be much better than Coraline’s reality. In the normal world her parents avoid her, the mom doesn’t cook dinner, and, they won’t grow a garden. In this opposite universe, everything is more enjoyable. Her other mother and father love Coraline, and spend lots of time with her. Show her amazing shows performed by Bobinsky, and cook amazing dinners. But, is it as great as it seems? Some things I like about this movie is its plot and the voices were very good. There was also lots of things going on in the movie which made it interesting. Some things I didn’t like includes, it’s not age appropriate. The animation made it very dark and mysterious, which could easily scare a 5-7 year old. But, there was many good things about this movie as well. For example, it always kept you at the edge of your seat, and there are many surprises that could be peeking around the corner. Coraline gets to enjoy fancy gardens and nice dinners which is shows a very happy and positive effect on the movie. She gets everything she wants in the world and is offered to stay forever. Overall, Coraline was a entertaining move, but should not be rated PG.The group of people that would like this movie is probably teens and adults. The movie is rated PG but I would only recommend it for the upper elementary kids and older.  I think that because the movie is scary and too mature for young kids. It contains some minor animated nudity. Which, some parents will not find appropriate for their 7 year old children. But, I do understand why it is PG. It is animated and contains dolls and playful young children. But, some things like, the creepy dolls and button eyes could scare younger children more than entertain them. It also contains creepy classical music that could cause chills down your back. It’s a good movie, but I only recommend it for older children, teens, and adults. Scale of 5 Stars: 4 Stars ****"
    },
    {
      "rating": "2",
      "text": "I agree with some of the recent negative reviews. I posted a negative review a week ago and it was erased. Are any of these 10 reviews for real? My wife and I thought it was really boring and long. My friends who saw this movie with their kids also said their kids wanted to leave the theater because it was boring and made no sense. The animation was choppy and overall story line was creepy and way too long. Who is behind all these positive reviews?"
    },
    {
      "rating": "0",
      "text": "This movie was horrible. I have never written a review about a movie good or bad before, but this was so bad I felt compelled to write. It was not a movie for kids. It was way to scary and the story line for adults and kids was long, drawn out and boring."
    },
    {
      "rating": "3",
      "text": "I saw this movie with the family, and there wasn't a single one of us who enjoyed it. Very disappointing given the hype about it. The story was boring, and I wouldn't recommend it to anyone, regardless of age."
    },
    {
      "rating": "3",
      "text": "In reading most of these comments, I noticed that the people that really enjoyed this film were young adults who possibly enjoy video games and have no children. Maybe that's who this movie is geared for perhaps. As a middle aged adult who has seen my fair share of adult movies as well as many kid movies, I didn't find this movie particularly enjoyable for the following reasons: poor characterization and poor story flow. If it weren't for the superior 3D animation holding our attention, my family and I would have left the theatre within 10 minutes and asked for out money back."
    },
    {
      "rating": "0",
      "text": "Pure garbage in 3D. A kids Movie? Maybe for idiots and morans. A story poorly told and not enjoyed by anyone in the theater we were in. No Joke. What's a kids movie doing with a busty animated dancing lady with pasties all about?? Why the high rating on meta critic??? This thing was just awful. Again , I can say No One in the Theater seemed to like it."
    },
    {
      "rating": "5",
      "text": "A good amount of scenes show real beauty and imagination, but I found myself not ever caring for these characters. Not once. Someone else mentioned that the story was reminiscent of a video game, and it is. What a shame. Unless of course your really swept away by video games. Also, paying close to 3 bucks for glasses that belong to a technology that wasn't worthwhile even fifty years ago is quite a shame as well."
    },
    {
      "rating": "5",
      "text": "Very amazing work with the stop-action, but the film is very overrated. The story was mediocre and drawn out too much."
    },
    {
      "rating": "1",
      "text": "It was horrible. I couldn't get into it at all... it made no sense. Avoid it, unless you're under 5. The animation is pretty choppy, even with 3D. I can't see how it got all these great reviews."
    },
    {
      "rating": "0",
      "text": "I wish I could give it a lower score, because this was the worst movie I have seen in many years. Pathetic story, terrible animation, no pace, I fought to stay awake, and later regretted doing so."
    },
    {
      "rating": "5",
      "text": "It was ok could have been better and it definitely was a kids movie kids love to be scared and this wasn't even that scary since it was animated and kids always know the difference better than adults i remember being a kid and i LOVED scary movies all kids do and did anybody ever read any fairy tales from grimm to o Henry what about te little match girl she froze to death was that for kids?? Cinderella if any1 ever bothered to actually read it the sisters die a gruesome death, so all u wawawa a its not for kids morons ' yours are the kids who get beat up and have their heads flushed down the toilet."
    },
    {
      "rating": "0",
      "text": "Gaiman is truly the most over-rated writer who should be on the D-List for DULL. Coraline was a mediocre book and a crappy, and painfully boring movie. Like any mediocre artist, Gaiman is now going for notoriety by hooking up with the untalented Palmer who in turn strips her clothes off at the slightest provocation. I heard they were Scientologists, which would explain an awful lot since Scientologists act like loons out in public."
    },
    {
      "rating": "4",
      "text": "Visually stunning(3d Had great storyline bones but not enough meat to get stuck into. My 10yr old described story line as \"meh\" +points for scaring the shit out of my 6 year old."
    },
    {
      "rating": "0",
      "text": "Overrated tripe."
    },
    {
      "rating": "1",
      "text": "Boring boring boring. Very annoying main character with very very annoying voice acting. Grated on my nerves for 10 minutes til I turned it off. I didn't see it all, but I couldn't stand another second."
    },
    {
      "rating": "1",
      "text": "One star for the animation, interesting but gross. The story was absolute crap. Coraline was annoying, the parents were miserable, I walked out when they started the naked old lady dancing. Gaiman just did a mutilation porn book with his transvestite \"girlfriend\" Amanda Palmer, so it figures he would create trash like this."
    },
    {
      "rating": "0",
      "text": "Somebody asked why the high rating for this incredibly boring and just plain nasty movie, Coraline. Answer... because Neil Gaiman is a scientologist and they have rooms full of sea org slaves writing positive reviews. Beware, Coraline is a depressing misery."
    },
    {
      "rating": "5",
      "text": "I was really looking forward to taking two of my nieces, ages 13 and 9, to a highly rated movie, particularly an animated film. Well, very disappointed. The 9 year old shrugged her shoulders when I asked her afterwards what she thought. She further elaborated that it was \"just okay.\" I didn't find it very engaging at all. It was too long and there were some scenes that seemed very unnecessary to the story line. At least what I could find of the story line. Yes, imaginative and very creative, but it lacked an emotional pull. Maybe I'm just not smart enough like some of the other critic's reviews, or maybe I'm like the child who says out loud, \"the emperor has no clothes!\" in spite of what everyone forces themselves to believe. Perhaps I expected this movie to leave me with a sense of wonder, like other fairy tales and animated films have done, but no such luck. Oh, well. It was nice to spend the time with my nieces!"
    },
    {
      "rating": "4",
      "text": "I just couldn't get into it. Sure, the animation and 3D were great, but the story lacked... something. Maybe the characters... When Coraline entered the new world with all sorts of strange things, she barely seemed surprised. I don't know, maybe it's just me but I felt bored the whole movie. Whenever there was a hint of foreshadowing, I just didn't care what was going to happen. Bottom Line : Only watch it if you are REALLY REALLY into animated/Tim Burton movies."
    },
    {
      "rating": "4",
      "text": "it was  good  if it were  on tv otherwise the 4 applies , it couild have been alot better and entertaining for kids and adults,  i strongly disagree that it isnt a kids movie , im 44  but  i remember being a kid  quite well,  and  i  LOVED  horror movies and scary things and yes even books,  all kids  do."
    },
    {
      "rating": "10",
      "text": "Coraline was one of my favorite books in middle school. When I heard that there was going to be a movie version, I was excited. And the movie did not disappoint.\r The story has an Alice in Wonderland vibe since it involves a young girl ending up in topsy turvy word. It reminds me of Corpse Bride in the designs of the two worlds where the real world is grey and drab while the alternate world is colorful and fantastical. I love the design of the Other Mother's world. It's bright and colorful and everything is made to please Coraline. However, as Coraline starts to resist, everything becomes darker and the Other Mother looks less and less human. And I don't know about anyone else, but the climax scared me to death.\r I also enjoyed the characters. Coraline is a believable kid. She's kooky and weird and has strange taste in fashion. She gets on her parents nerves but she just wants them to to pay attention to her. The parents are also believable. There are times when my parents are so wrapped up in their work that they don't have time for me. They aren't bad people. They're just unbelivably stressed. The Other Mother is freaky as hell. She really seems like the kind of mother we all wish we had. She's funny and loving and gives you whatever you want. Too bad she's doing it so that she can ensnare and kill you. The other characters are mostly hit or miss.\r Fans of the book might not like the changes made, but I think there were for the better. The book lacked detailed descriptions about Coraline's appearance. I really liked the blue hair. It fits her character. I also like the addition of Wybie. While he wasn't a HUGE part of the plot, they made his character relevant. And thank god they didn't make him a love interest.\r I can understand why people wouldn't like it as much. It does have a lot of slow moments, but I liked those scenes because they were used to show us what kind of person Coraline is and about her relationship with her parents and Wybie.\r I'm not sure if it will appeal to Tim Burton fans. It doesn't strike the same balance between macabre, comedy, and whimsy, but it's not trying to be The Nightmare Before Christmas. The only things it has in common with it is stopmotion and director Henry Selick. If you like stopmotion, this is a good movie to see.\r And if you liked this movie, watch Laika's other major stopmotion film, ParaNorman."
    },
    {
      "rating": "2",
      "text": "Ok, so, my family and I decided to go to the movies, just to do something fun. We decide on Coraline... because it was, apparently, the only family movie available... so, we go in and sit down. Not even halfway through the movie, my parents ask me if I wanna leave. The only reason I said \"no,\" was to see how much worse the movie could get. I was absolutely shocked. It was one of the worst, if not, the worst movie I have ever seen! I don't get all the critics making a big deal over this saying,\"Great movie! Blah Blah Blah.\" Neither my Dad, Mom, or my sister enjoyed it. What a disappointment! It was too weird, the story made no sense. The only thing decent, was the 3D, otherwise, it sucks. 2/10 from me."
    },
    {
      "rating": "10",
      "text": "This movie excceded my expectation\rIs one of the few good animated films\rMysterious, interesting and well made.\rI think this Is a simple but a good film."
    },
    {
      "rating": "9",
      "text": "Neil Gaiman is so contemporarily vital, both in literature and cinema, because he more than anyone else (with the possible exception of Terry Gilliam) notes that children and adults alike are fascinated with what lies outside our observable and tangible realms of existence. He realized the reasons storytelling have been significantly important since the dawn of mankind, and devised, as the Brothers Grimm did, that fairy tales and children's stories had to be haunting and entertaining to be both memorable and timeless. This is a great film depicting the growing sense as a child approaches adolescence that their parents and their world aren't exactly as they seem, and that through their trials and tribulations (the 'rites of passage', if you will) they'll reach the 'happy medium' they need to in order to find true happiness in their lifetimes.\r I definitely hope that all of Gaiman's books and graphic novels are made into movies (I most anticipate the 'Miracleman' graphic novels--both those by him and Alan Moore). Ones so well-written would truly be 'comic book movies' worth watching for me."
    },
    {
      "rating": "6",
      "text": "Really fine CGI linked with Gaiman's unimpressive thru the looking glass type story.  A lonely little girl finds another - better? - version of her family when she climbs thru a hole in her bedroom wall and into an alternative world. Spooky but ultimately harmless.  Lots of kool visual surprises."
    },
    {
      "rating": "8",
      "text": "We looked through the button eyes of Coraline in the movie “Coraline” and would like to give our opinion over it. “Coraline” is a movie about an a girl who’s unhappy with her life with her family. She was forced to move away from all her friends and live in the Pink Palace. From there she faces challenges but meets new friends along the way. Laika is the company that produced  this movie. We thought Henry Selick (the director) and Laika did a great job making this movie happen.    “Coraline” took place in the Pink Palace Apartments where she found a magical doorway that leads to an alternative, better world. In the other world she meets improved versions of the people she knows, such as her parents. Everything in that world is how she wants her life to be. This world ended up being pretty dangerous for Coraline. Coraline struggles to find her way and learns to appreciate what she has and not what she wants. We liked the stop motion animation in this movie and appreciate how long it takes to do it. We also liked all the characters such as Coraline, Wybie, Bobinsky, and the Black Cat. One of our favorite scenes in the middle of the movie was about one of the many wonders, the other father’s garden. The beautiful flowers seem to come to life as she walks through the garden. One of our least favorite scenes from the movie is when she had to throw the black cat to escape one of the many dangers. Overall, we all think that this movie is really good. This movie is PG, but we think that a certain age group should watch it. It could be hard for little kids to understand and it will most likely scare them. We recommend ages 10 and up so they will be understand the actual storyline. We also don’t recommend this movie to adults, but it is still good for all age groups. Overall this movie is pretty good but is hard to understand the plot and the message that goes with it."
    },
    {
      "rating": "6",
      "text": "Looking through the eyes of Coraline’s life\t“Coraline” is a creepy but humorous movie that had me on the edge of my seat the whole time. I just watched this movie in my 8th grade English class. “Coraline” gave me the chills throughout the whole movie. The movie has many different opinions, but you either hated it or you liked it. I was more in between. “Coraline” is made with clay animation which in my opinion makes the movie a little bit scarier. It also has many scenes in the movie that were a little sketchy and scary. “Coraline” was made by Laika Entertainment, they specialize in clay animation, just like “Coraline.”\tIn present day Oregon, 11 year old Coraline Jones  (Dakota Fanning) moved to the Pink Palace Apartment. She meets her neighbors Wybie, Mr. Bobinsky, and Ms. F and Ms. S. Coraline feels her life is boring because of the lack of attention from her parents. Out of curiousity Coraline stumbles upon a secret door leading to a new dimension. There she meets her other mother (Teri Hatcher). Her other mother gives her anything she could imagine, new clothes, delicious food, and even made a garden out of the shape of her face. Everything seems to be perfect to Coraline until she wants to go back home, but discovers she may not leave her other mother. Coraline finds out the truth about the new dimension. Coraline must figure out a plan to leave. Coraline uses her strategic ways to escape her other mother. The characters in “Coraline” had great stories about them, but their bodies were out of proportion and not realistic. Mr. Bobinsky was 10 feet tall and his skin color was blue. Coraline’s relationship with her parents didn’t develop as well as I would have liked it. In the beginning they barely talked and it doesn’t get resolved until the last ten minutes of the movie. The movie’s clay animation created a creepier vibe than a kid friendly one because when the characters have eyes for buttons it’s not a pleasant thing to see. Even though some parts I did not like, the movie did have some positive elements about it. I like how it taught a lesson in the story, “ Be happy with what you have.” The movie had a suspenseful plot leading up to the big climax of the story. I also liked that it was playful at times when Coraline had to go find the eyes of the lost ghosts. This movie is PG, a rating that might not be appropriate to younger children, especially from the ages 5-7. I would recommend parents watch the movie first to find out if your child would like it. The movie was awarded a Golden Globe for best animated movie of the year in 2010, a year after it was released. Overall I thought the movie was great. It was entertaining and suspenseful all at the same time, but I would not watch the movie again.Scale of Stars:3 Stars out of 5"
    },
    {
      "rating": "6",
      "text": "Sweet “Coraline”We watched “Coraline” recently and thought it deserved a review. “Coraline” was released in 2009 by Laika Entertainment and introduced a surprisingly dark tale told by stop motion. Parents bringing their children along to the movie theater to see “Coraline” had no idea what they were in for. What seemed like a adorable, sugar-sweet movie about a young girl turned out to be a nightmare inducing film. “Coraline” starts out with a family moving into a new home in the Pink Palace Apartments. Viewers will quickly realize that Coraline’s parents (Teri Hatcher and John Hodgman) are not very good listeners. While exploring in and around her new home, Coraline (Dakota Fanning) meets a supporting character named Wybie (Robert Bailey Jr.), who later gives her a doll that bears a striking resemblance to her. When she explores her living room, she discovers a portal hidden in the wallpaper that leads to a “better” alternate reality where everyone has buttons for eyes. This is where the plot gets dark. Coraline meets her “other mother” who gives her everything she could ever want. Coraline is convinced she wants to stay forever, but at a cost. Her other mother wants to replace Coraline’s eyes with buttons. After realizing this world is not what it seems, Coraline talks to some supporting characters, like the eccentric Mr. Bobinsky (Ian McShane), and two drama-obsessed ladies. The ladies, Miss Forcible (Dawn French) and Miss Spink (Jennifer Saunders), do perform a rather...interesting dance in the alternate reality that includes both of them nearly nude. Despite that suggestive scene, all these characters come in handy to fix the conflict in the movie. “Coraline” is not as sweet as it seems. That dark plot is meant for older children, but the compelling storyline requires you to pay attentiont to find out what happens. The animation would be perfect if it weren’t for the way the characters were portrayed. Some of them are a bit creepy and could traumatize young minds. We think that the movie wasn’t age appropriate and was given the wrong rating of PG. We believe that “Coraline” should’ve been rated PG-13. For example, children probably wouldn’t enjoy the fact that characters attempt to sew buttons into other characters eyes. However, there were a few lessons to be learned if your child wasn’t running out of the room crying. The animations were one of the movies positives and the characters fit the creepy vibe the movie portrays. This movie does have a creepy vibe to it, so we recommend it to young adults. This movie could scare younger children with its dark nature. We think this movie would better suit 10-14 year olds. Do not show your younger children “Coraline”, unless you want them to wake you up in the middle of the night. Our final rating comes down to the movie not being age appropriate despite the beautiful stop motion and interesting plot line. Be careful what you wish for! Final rating: B-"
    },
    {
      "rating": "8",
      "text": "After previously watching the movie “Coraline”, I’ve decided to let others know how I feel about the movie. Henry Selicks’ “Coraline”, is an interesting,  imaginative and creative movie. While the creepiness of the movie gets to me, it delivers an informational message that not many children will pick up on, but an adult, or 14 year old, could get the message. This movie never seemed to bore me or others at any time keeping all of us entertained or immersed in what's happening.When Coraline moves into Pink Palace apartments, she feels bored and alone because she doesn’t have any friends and her parents are always working. She soon meets a boy about her age named Wybie, and her neighbors Miss. F,  Miss. S, and Mr. Bobinski. Coraline then finds a hidden passageway that leads to an alternate universe where everybody has buttons sewn into their eyes and she gets everything she wants including tons of attention from her ‘other parents’. She goes there everyday for awhile. One day they tell her that if she wants to, she can live with them forever but only on one HUGE condition. That’s when she realizes that everything’s not as perfect as it seems in the alternate universe and learns to accept what she has outside of the alternate universe even if it’s not everything she wants.    While “Coraline” was an interesting film, it had a few flaws and things I strongly disliked. Firstly, it might be kind of hard to explain the moral of the story to a toddler. Second, the animation was slightly off at times. But there were many perfections about this movie too, such as the creativity in the names. It had good twists, and the animation was okay at times and kind of creepy.  “Coraline” is rated PG with some considerable sinister scenes from beginning to end. The movie is aimed for children to get a lesson across that we should not take anything for granted because it could be much worse. Coraline was planned out and told pretty well with the voices and characters being spot on with how you would expect it to be. To really get a grip on the movie and it’s meaning an older audience would be suggested. I would recommend this movie to anybody 10 or older and ready to sink into a great movie. Coraline showing great morals and a great story makes this movie top-notch and a definite must watch again."
    }
  ],
  "recommendations": [
    "where_the_wild_things_are",
    "bridge_to_terabithia",
    "paranorman",
    "monster_house",
    "cloudy_with_a_chance_of_meatballs",
    "the_spiderwick_chronicles",
    "the_smurfs",
    "the_polar_express",
    "the_tale_of_despereaux",
    "happy_feet",
    "meet_the_robinsons",
    "nightbooks",
    "mars_needs_moms",
    "my_little_pony_equestria_girls_forgotten_friendship",
    "the_star",
    "the_peanuts_movie",
    "the_land_before_time",
    "the_willoughbys",
    "nanny_mcphee",
    "cloudy_with_a_chance_of_meatballs_2",
    "the_good_dinosaur",
    "ice_age_continental_drift",
    "the_house_with_a_clock_in_its_walls",
    "the_lego_movie",
    "dora_and_the_lost_city_of_gold"
  ]
}