{
  "id": 290,
  "title": "Corpse Bride",
  "starring": [
    "Johnny Depp",
    "Helena Bonham Carter"
  ],
  "runtime": 77,
  "genre": [
    "Romance",
    "Fantasy",
    "Animation"
  ],
  "description": "Set in a 19th-century European village, this stop-motion animation feature follows the story of Victor, a young man whisked away to the underworld and wed to a mysterious corpse bride, while his real bride Victoria waits bereft in the land of the living.",
  "releaseYear": "2005",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/isb2Qow76GpqYmsSyfdMfsYAjts.jpg",
  "categories": {
    "plot": 5.2,
    "acting": 6.041666666666667,
    "ending": 4.2,
    "soundtrack": 5.125,
    "cinematography": 8.0,
    "familyFriendly": 6.0,
    "funny": 3.4285714285714284,
    "action": 6.0
  },
  "reviews": [
    {
      "rating": "10",
      "text": "Corpse Bride is sweet and sincere, dark and funny, and perhaps the most technically accomplished and beautiful example of stop-motion animation ever. A great British voice cast fronted by Johnny Depp (OK he's not British but plays the cripplingly shy young English gent Victor Van Dort well) and featuring Emily Watson, Joanna Lumley, Albert Finney, Paul Whitehouse, Tracey Ullman, Jane Horrocks, Michael Gough, Christopher Lee and Richard E. Grant simply astounds - few directors other than Tim Burton would be able to command the respect of such an array of talent. Helena Bonham Carter blows all away however with her tender performance as Emily, the tragic character of the title. She's a compelling, rounded protagonist and Bonham Carter takes her characterisation in many directions, from child-like immaturity, to bitterness at her situation to eventual dignified acceptance of her untimely demise, and every emotion in-between. The contrast between the sombre, formal and grey world world of the living and the lively, colourful and free land of the dead is striking and effective - Burton has retained his go-to theme of not belonging in the world you are born in, and still has a unique view of death and a distinctive and individual use of cheerfully macabre imagery. In addition to the detail and expressiveness of the puppets and the energy of the animation (supervised by the film's incredibly talented co-director Mike Johnson), Danny Elfman's rich soundtrack and catchy songs, particularly the jazzy \"Remains of the Day\" and the rip-roaring \"Wedding Song\" breathe real life into the film. Though the film has much to say about life, death, class, family, love and loneliness, what makes it so memorable is that Tim Burton has provided us with such an entertainingly oddball piece of fantasy escapism. The world of Corpse Bride is a real pleasure to spend time in, and you really grow attached to the weird and wonderful cast of misfits, be they corpse or not. Burton's kookiness and abundance of unusual ideas can sometimes get in the way of telling a coherent, evenly paced story (most noticeably in his recent efforts Alice in Wonderland and Dark Shadows), but not so here - Corpse Bride is a pleasingly simple tale well-told, and characters and their performers are allowed to make a real emotional connection with the viewer. For a film manufactured using an archaic form of animation that seems to aim to actively reject reality, and which prominently features the reanimated dead, it's an oddly human, and miraculously heart-tugging experience, and is probably the most balanced and immaculate of all Tim Burton's films."
    },
    {
      "rating": "10",
      "text": "Tim Burton carries on his dark, romantic tradition"
    },
    {
      "rating": "10",
      "text": "This was the first movie our two year old has seen and he loved it. It is visually stunning enough to hold his attention even during the less chaotic scenes. It is a wonderful gothic romance."
    },
    {
      "rating": "10",
      "text": "Excellent animation. All the people look cute. The voices also are very good."
    },
    {
      "rating": "10",
      "text": "Johnny Depp and Tim Burton are an awesome team.... I loved this movie!!!"
    },
    {
      "rating": "5",
      "text": "I feel strongly that The Nightmare Before Christmas was one of the great films of my lifetime, and that the charm and unrepressable... oomph it had cannot be reproduced in any way. Not even, or most specifically by the original director. Yes, Corpse Bride had the same demi-goth elements that have made Tim Burton who he is today, and Danny Elfman didn't do a completely shoddy job with the music, but it's no longer a first. Nightmare was just that- comepletely unique and overwhelming. I still get cold shivers up and down my body when I listen to the songs, and the concept, however basic, just fit like a jigsaw puzzle to make a master-piece. Corpse Bride very conciously felt like a rip-off, like Burton wanted desperately to have another go with the medium, and thought somehow he could make another classic by just utilizing the same elements. Nope. Sorry. Didn't work. It wasn't terrible, but it wasn't really good, either. I almost worship the ground Burton and Elfman walk on, and I even loved Big Fish, but I love Burton's films because although each retainting a flavor that very clearly indicating Tim's touch, each movie still remains a completely seperate entity and holds it's own charm. It almost feels like Corpse Bride is a badly disguised sequel to Nightmare, but cops out at the last."
    },
    {
      "rating": "9",
      "text": "Well, I thought it was great but Nightmare Before Christmas was just a tad better. The songs were good, and the characters just gave it  that Tim Burton twang that we all know and love."
    },
    {
      "rating": "8",
      "text": "A story about the dead seems so fresh, alive, and beautiful. This is among Burton's best work. His brilliance for creating imagery and tone is why he is one of Hollywood's most distinguished directors."
    },
    {
      "rating": "3",
      "text": "Characters are dull and unrelatable, the jokes are simply not funny to an adult, and the songs erratic and simply dreadful. Good cinematography, interesting plot, but this movie was 1/3 of what Charlie & the Chocolate factory was. Way too short as well for a $7-$10 movie."
    },
    {
      "rating": "3",
      "text": "Oh wow. I don't think I've ever seen a movie with that little of anything in it. It hardly has any story. There is no suspense, comedy, or good moments. The voice acting is formulaic and no character really stands out. Finally, the script is the most bland, infantile, bare-bones, poor-excuse-for-a-story-line screenplay I think I've experienced. I give it a 3 because of the animation, which is executed nicely if not sensationally, and the jazz musical number involving dancing skeletons and some excellent lighting. These redeeming qualities are no reason to see the film, though. It smply is roaringly dull and numbingly useless. I thought this was supposed to be Tim Burton's quality film after the promise-filled wuss-out that was Charlie and the Chocolate Factory. Instead, it has relegated Tim Burton to the list of washed-up geniuses."
    },
    {
      "rating": "5",
      "text": "Not \"The Nightmare Before Christmas\" or anything like it, by any means. If you were expecting the former, then you will be disappointed. Beautiful animation and the spookiness you expect from Tim Burton, but NO sympathetic characters like the former movie. No one for the audience to hang onto! Beautifully rendered visuals, but no story or emotional ties on the characters. Rent \"Nightmare\" again and leave this one (along with Charlie and the Chocolate Factory) at the video store."
    },
    {
      "rating": "4",
      "text": "The animation was beautful. But, like most people, there just wasn't much substance. Barely any story, and Johnny Depp's character is just unlikeable. For some reason, he's unfaithful to his likeable and charming fiancee and decides to marry a dead corpse he found. The audience is wondering why, but half of the audience is already asleep. The men will gawk at all the well-endowed women. BOOO!!"
    },
    {
      "rating": "5",
      "text": "It looks beautiful...sadly the characters are boring and hollow and do not capture you in any way to make you feel something from this movie."
    },
    {
      "rating": "2",
      "text": "That's it, I'm through with Tim Burton. First there was the unimpressive Big Fish, and now this piece of dreck. It looked good enough, in the usual Tim Burton style, but ugh! The painfully dumb dialogue! The idiotic characters! The crappy jokes! The weak musical numbers! The predictable ending! Did I mention how staggeringly DUMB the whole thing was? It was all I could do just to sit through it. There's no magic, no whimsy, no heart here. It's no Edward Scissorhands."
    },
    {
      "rating": "10",
      "text": "if you truly love tim burtons style, then you will fall in love with this masterpiece. if you like stupid, commercialized, crappy, trendy,spoiled brat films like most people, then stay away from this movie. if you have a great imagination and dare to go where most don't, then this is for you. extreamly creative, classic type story. if you get the dvd go to the extras and just see for yourself just how much mind power was put into this film. hats off, 2 thumbs up, 3 snaps in a circle to tim burton and his crew for making an instant classic."
    },
    {
      "rating": "10",
      "text": "This is the best movie that i have even seen, in my option it is MUCH better than the nightmare before Christmas. i do not understand why people are judging the two movies they are totally different. sure they are Tim Burton's movies but still you don't see a skeleton trying to kidnap Christmas in the corpse bride and you don't see a man marrying a corpse in the nightmare before Christmas. overall I LOVE THIS MOVIE"
    },
    {
      "rating": "10",
      "text": "Stop-motion animation may be a dinosaur, but can still be technically superb. I didn't believe they used real puppets in this film. Very good plot and characters. Fell in love with the Corpse Bride -what a sweet, unselfconsciously erotic darling! I would happily die to marry her and play four-hand classic piano without a score for eternity!"
    },
    {
      "rating": "1",
      "text": "This is a terrible movie. I didn't expect much and I still got disappointed. I felt exactly the same way when I watched Ed Wood. I was BORED to death. Pun not necessarliy intended. It wasn't entertaining. I wasn't moved. I was almost put to sleep. It would've been better if they just did a very short feature like those mini-stories before Toy Story. My friend who invited me because he was expecting something like Nightmare Before Christmas fell asleep. I felt so bad, I told everyone to tell everyone they knew not to watch this movie. The story was lame, the songs were lousy and jokes were flat... except maybe for the one when the corpse was singing and dancing and fell down leaving her leg stuck under a root. But, I laugh at anyone falling down. And, that's why I'm giving it a 1 instead of a zero. I've noted all the critics who rated this movie a hundred and I'll never believe them again."
    },
    {
      "rating": "4",
      "text": "Having seen A Nightmare Before Christmas maybe I expected too much. I expected more humour, I certainly expected a better plot than the typical \"one guy torn between two girls kinda thing\", and much better music. The music on this movie was not catchy at all like on \"The Nightmare...\". I think Tim Burton has been losing it since Charly and the Chocolate Factory, I hope next movie he does he redeems himself."
    },
    {
      "rating": "10",
      "text": "When I was going to watch this movie for the very first time, I thought it would be bloody awful. The movie flattered me: it's so beautiful, so full of content, and so carefully made! Tim Burton is yet to make a bad movie."
    },
    {
      "rating": "0",
      "text": "Bad! Bad! Bad! Bad! Awful! Gross. Disgusting. Awful! The worst I've seen this month. And I did see the new JLO film."
    },
    {
      "rating": "3",
      "text": "Seriously, I don't understand the critical acclaim for this movie. The plot was too shallow and predictable, the characters were either annoying, the music was so loud and so bad. What's there to like about this film?"
    },
    {
      "rating": "5",
      "text": "Cute but blah."
    },
    {
      "rating": "4",
      "text": "Pros: visually stunning, wonderful cast.  Cons: aimed too much towards children 6 and under, bland plot. Overview: It can't match Tim Burton's earlier work, but i guess i just expected too much."
    },
    {
      "rating": "2",
      "text": "We saw this and Wallace and Gromit in the same night. The latter was hilarious and creative and fun, and the former came closer to putting me to sleep than any movie has in years. The much vaunted visuals were frankly a bit dull and strangely thin--I never got a sense anything was around the corner or beyond the horizon. Oddly, the sound was the same, like three people singing into a mike. Speaking of singing, most of the lyrics were god-awful, rhymes that were as predictable as they were meaningless. And of course the story and dialogue were about as simple and wooden as anything from a mid-summer shoot-em-up. There are many reviewers who seem to have praised this movie whose judgments I may never trust again."
    },
    {
      "rating": "2",
      "text": "This picture comes off like a student film--completely unrefined and uninspiring. Don't see it!"
    },
    {
      "rating": "1",
      "text": "The entire plot, with all twists and turns could be summed up in two sentences. Lovely to look at, but no substance whatsoever."
    },
    {
      "rating": "4",
      "text": "Don't get me wrong I loved Sleepy Hollow, Nightmare before Christmas, and Big Fish. This was predictable, not clever, and not worth Tim Burton Johnny Depp or Helena. No good and when the end hits you its like, that was it? Not worth 5 buck."
    },
    {
      "rating": "3",
      "text": "Let's see... I'm Tiim Burton, and I have to keep busy... I know! I'll make another Halloween picture! I'll capitalize on this niche I've cleverly carved out for myself by using all of the usual ingredients. And why work too hard at it? A poorly fleshed-out plot will suffice as the skeleton for my story. I'll cast Mr. Depp as my protagonist again, have Mr. Elfman make the music with those spooky chorus girls singing backup to jazzy ghouls' \"ain't life grand when it's goth\" numbers -- again, and garnish gratuitously with supporting characters right out of Disney's \"Contemporary Musical Cartoon for the Whole Family\" handbook! Okay, I apologize for the arrogant \"alliterative armchair art critic\" bit. But man, I was so sorely disappointed by this movie. Once again I have fallen prey to a trailer that promises more than it can deliver. When will I learn? The bit with the dog (\"play dead! Oh, sorry.\") got me into the theater, and was one of the few things that kept me there. This was a beautiful movie to look at. No doubt of that. But... Dude... If you're going to put such a devastating amount of effort into the production, shouldn't you put as much work into the story? And there were so many opportunities to add tasty details to this thing that could have made it a holiday classic -- provided you hadn't hired an 8 year-old to ghost-write your shooting script. Instead, it looks like... like none of the artists involved were allowed to improvise. It bored me. Depressing. Still... it was pretty to look at."
    },
    {
      "rating": "0",
      "text": "This was absolute dreck. The uninspired, awkwardly inserted musical interludes masked the absence of a plot, or any real depths to the depressingly boring and empty characters. I predicted half of the plot developments, and when they predictably shuffled by on the screen i was wholly unimpressed with Burton's inablility to evoke any sort of fantasy. The sets are dull and lackluster; the only warmth in the movie comes from the all-too-brief scenes of Victor and Victoria together. The titacular Corpse Bride was so poorly defined as a character that her prescence was seemingly unnessecary and defintely forced. the script itself was so lacking and the dialouge so infantile and embarrassingly UNFUNNY that the weak gags Burton has his characters run through are poor respite for his failure to put a smile on the viewer's face. The insultingly inexplicable and cliche ending is good for some incredulous comments. Unwatchable."
    },
    {
      "rating": "0",
      "text": "such a dull drab pointless waste of time, boring insipid characters, dull plot, no twists. and johnny depp has no impact as avoice actor. dont waste your 5.99 like i did. dont."
    },
    {
      "rating": "5",
      "text": "I've been looking forward to seeing this movie for a while, but I was really looking forward to not much. The movie, itself, reminds me a lot of Tim Burton's extremely celebrated Nightmare before Christmas. However, I was crushed about halfway into the rather short movie by boring, uninteresting characters, a twist ending that only an idiot couldn't see coming, and music that just doesn't quite hit the high note. It makes me very sad to say this movie was very \"ok\", but the fact is that it's just too much like it's main character. Short, timid, and vaguely uninteresting. If there's one thing I have to praise, it's the excellent atmosphere and animation. Otherwise, I have not much but disappointment for this movie. Oh, and it was really fun watching the blu ray disc freeze up. I sent for another one, but that one froze up too. Coincidence?"
    },
    {
      "rating": "6",
      "text": "Like \"Mulan\", \"Corpse Bride\" would've been a better film without the music. Danny Elfman's songs don't measure up to his work on \"The Nightmare Before Christmas\", but the allusion to one of Elfman's better known compositions with his former incarnation as lead singer of Oingo Boingo is mildly amusing. Another problem is that the corpse bride (Helena Bonham-Carter) never quite engages us like Victoria (Emily Watson) does. The way Victor captures Victoria's heart with his prowess at the piano is the film's highlight, and it's the ultimate failure of \"Corpse Bride\" that there's no scene which equally enchants, involving the groom and corpse. Victor's fatalistic love towards Victoria also has to be more convinving in a crucial scene, so his drastic action feels more organic than a requirement of the screenplay to create suspense."
    },
    {
      "rating": "0",
      "text": "it is a terrible movie i dont now why i wasted my ime watching it i am never going to listen to critics again because the all gave it great reviews for all those people trying to decide wether to watch it don't just 't and whoe ver had the idea to put depp in a voice role is just plane stupid i am so sick of these terrible movies!!!"
    },
    {
      "rating": "2",
      "text": "Characters are boring, the plot is nothing special and i think you shouldn't waste your time on this overrated animation. I wouldn't watch it again - 3/10"
    },
    {
      "rating": "2",
      "text": "Didn't enjoy it. It was too boring, the plot seemed pretty stupid, and I disliked most of the characters, though I will praise the animation and voixe acting however..."
    },
    {
      "rating": "8",
      "text": "This is not my favourite Tim Burton movie by a long shot, but I did find myself enjoying it. The animation is absolutely amazing with the dark bold colours and inspired visual ideas. The music is good too, it adds very well to the atmosphere. The four songs are pretty decent, if nothing special. Remains of the Day was the one I liked best. The script is witty and deliciously dark in places, while the story is clever and fairly original, even if it drags slightly occasionally. The characters are wonderfully quirky and the voice work from the likes of Johnny Depp and Helena Bonham Carter is top notch. All in all, a beautifully crafted film, if not quite Burton's finest hour. 8/10 Bethany Cox"
    },
    {
      "rating": "8",
      "text": "I loved this movie. Maybe not as much as Nightmare Before Chrismas but close.... Just watching Time Burtons films leave me with a warm loving feeling no matter how off beat they are and darkly twisted. Still, Why Johnny Deep? more than likly more of a sales reason I'm sure sense Johnny Deeps Voice for the charater has no bearings on the film. Thou I love Johnny Deep....for a leading anamation actors he's not much outside of 'ordinary'"
    },
    {
      "rating": "6",
      "text": "The \"HARRYHAUSEN\" logo on the grand piano that nervous would-be bridegroom Victor (voiced by Johnny Depp) practices on may pay tribute to stop-motion animation pioneer Ray Harryhausen, but Tim Burton's lightly macabre animated romance really owes a lot more to the 1930s cartoons of Ub Iwerks and, like his earlier effort The Nightmare Before Christmas, to those 1960s Rankin-Bass Christmas TV specials...as well as the one-dimensional cartoons and illustrations of Charles Addams, Ronald Searle and Arnold Roth. Burton's reputation for making the classic horror material and settings he obviously loves palatable for family audiences may have finally caught up with him here; Corpse Bride is unquestionably handsome and heartfelt--and I really liked Burton's depiction of BOTH of Victor's potential wives, Victoria (Emily watson) and Emily (Helena Bonham Carter) as sympathetic, appealing and attractive characters (even the dead one)--but the movie is STILL a frustrating, tantalizing near-miss. Danny Elfman's songs aren't bad, and add to the atmosphere, but they seem tossed off and aren't nearly as long as they need to be; the instant one of the musical numbers begins to envelop the audience, it's over. Ironically, that's the opposite problem of the rest of the movie; even at only 78 minutes, it's frequently as draggy and slow-moving as a George A. Romero walking zombie. Most problematic of all is that despite the morbid subject matter and vivid visuals, the humor is nowhere near as bracingly edgy or \"sick\" as you'd expect; it's tempting to blame the PG rating, but The Nightmare Before Christmas was a perfect entertainment of its kind that wasn't at all hampered by it. I don't have the heart (or spleen or intestines) to try to talk anyone out of seeing this, and I wish I could get my very own Scraps the Dog at a McDonald's or Burger King mear me, but in all honesty, this movie's current rival, Wallace & Gromit: The Curse of the Were-Rabbit, has all its virtues plus a much faster pace and a far more successful humor-horror blend that leaves Corpse Bride...well, buried."
    },
    {
      "rating": "6",
      "text": "Disappointing but not unexpected. Burton hasn't made a decent flick since Ed Wood, and I believe we are now seeing the decline into mediocrity of he who was once Hollywood's rebel. Corpse Bride was flat, the voice acting was dull (why would you get Depp to voice act? Give me a break), the music was forgettable (and annoying at the time) and the story never really got going. The animation itself was fine, but too clinical. Mr. Burton, your time is up."
    },
    {
      "rating": "6",
      "text": "All of the credit in the world for the animation and the look and feel for the movie. But the plot was paper thin and the only plot \"twist\" in the entire movie was obvious from the second it was not-so-subtly introduced. Enjoyable for the animation, but that's about it."
    },
    {
      "rating": "8",
      "text": "I saw this one today and found it very amusing and charming. Not the best thing out there, but it was quite entertaining. Anyone who has seen Tim Burton's previous works will know what to expect from this one. The stop-motion animation was a lot more fluid than in \"The Nightmare Before Christmas\". Johnny Depp's voice was perfect as the main character. Recommended for those who desire to see something a little creative and different, but it might not be for everyone."
    },
    {
      "rating": "8",
      "text": "I think the story doesn't suit little children. The animation and the character do, but some part of the story need adult understanding. Just take a look yourself, and you'll understand what I mean. Other than this is just magnificent."
    },
    {
      "rating": "9",
      "text": "An unbeleivable spectacle of animation. Burton combined the realm of \"shadow/goth\" with that of a \"dreary heartedsoul\" so well that I found myself covered in goosebumps during the first five minutes. The graphics were such that I felt I had been in 19th century gothic...wherever that place was....ni a previous life. (Maybe I was!) ALthough I say it would have had a more smashing effect without the cheesy music- I give it a nine outa ten. The bombshell of Burton's career!"
    },
    {
      "rating": "2",
      "text": "This movie is terrible. The story is weak. The characterizations are flimsy. The music and songs are uninspired. In the post-Shrek world, animated comedies are to be held to a higher standard. This one fails to work either for adults or children. Bad."
    },
    {
      "rating": "7",
      "text": "Corpse Bride was highly entertaining in that it put a fresh spin on a cliched story. The stylized animation was a joy to look at and the voice performances were for the most part performed well. The ending felt rushed but that didn't detract from a genuinely fun movie."
    },
    {
      "rating": "10",
      "text": "Its official. Johnny Depp is the best actor both on screen and off screen. He plays the role perfectly, and we didnt even see him in person! That guy is amazing."
    },
    {
      "rating": "6",
      "text": "This movie, while looking like a movie that would leave a mark for many years, sadly fell quite short of what I had been expecting. It was a bland, heapless mess with good animation."
    },
    {
      "rating": "4",
      "text": "This movie, like Burton's \" Nightmare Before Christmas\" has a familiar style, but the storyline doesn't intrigue me enough to watch 75 minutes. I found it to be less capturing than Nightmare. But, it is better than the title suggest's."
    },
    {
      "rating": "8",
      "text": "Great movie overall!!"
    }
  ],
  "recommendations": [
    "alice_in_wonderland",
    "cruella",
    "dumbo",
    "pan",
    "maleficent_mistress_of_evil",
    "maleficent",
    "dark_shadows",
    "trolls",
    "rio_2",
    "alice_through_the_looking_glass",
    "happy_feet_two",
    "into_the_woods",
    "the_secret_life_of_pets_2",
    "oz_the_great_and_powerful",
    "the_lego_movie_2_the_second_part",
    "frozen_ii",
    "charlie_and_the_chocolate_factory",
    "ratatouille",
    "the_call_of_the_wild",
    "hotel_transylvania_3_summer_vacation",
    "the_bfg",
    "mowgli_legend_of_the_jungle",
    "the_tale_of_despereaux",
    "beetlejuice",
    "finch"
  ]
}