{
  "id": 2392,
  "title": "Countdown",
  "starring": [
    "Elizabeth Lail",
    "Jordan Calloway"
  ],
  "runtime": 90,
  "genre": [
    "Horror",
    "Thriller"
  ],
  "description": "A young nurse downloads an app that tells her she only has three days to live. With time ticking away and a mysterious figure haunting her, she must find a way to save her life before time runs out.",
  "releaseYear": "2019",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/5TQ0kM41vWFWFAPbZGitOxDysZU.jpg",
  "categories": {
    "plot": 1.3333333333333333,
    "acting": 0.6,
    "ending": 3.0,
    "soundtrack": 2.0,
    "cinematography": 5.0,
    "familyFriendly": 2.0,
    "funny": 3.9166666666666665,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "7",
      "text": "This movie is basically if Child's Play (2019) Stranger Things, IT (2017) Final Destination had a baby. which is not a bad thing. i really enjoyed this film. but the ending was kinda wack."
    },
    {
      "rating": "6",
      "text": "(Mauro Lanari)Struggling with our own destiny in the Smart era, discovering that neither spirituality (the exorcist demonologist) nor technology (the millennial a bit geeky, a bit nerdy) are salvific. Amazing but true: original (!) variation on the theme, cast of TV provenance and yet up to it."
    },
    {
      "rating": "7",
      "text": "From the get go, this movie is more of a comedy in my opinion with a hint of horror scattered throughout with jumpscares and suspense. The movie wasn't half bad as I originally thought it would be as I saw from the trailers back when this movie was in the cinema. From the beginning, there was a moment of cheesy dialouge that was playing a stereotype of how Gen Z act that made me cringe but as the movie progressed, I enjoyed it more and found it more entertaining. The jumpscares can be predictable for the most part but the suspense that it built sometimes and some of the jumpscares this movie threw at the audience can expect a few scares out of the viewers. If you went in watching this movie for pure horror, go watch a different movie because you will be disappointed. This turned out to be, accidentally, a sorta good comedy with a hint of horror. As a horror movie, it's bad, as a comedy movie, not half bad."
    },
    {
      "rating": "9",
      "text": "9/10 *   Bei einer Szene hat mir was gefehlt deswegen ein Punktabzug. Der Rest war gut und unterhaltsam. Verstehe die niedrigen Bewertungen nicht. Der Film ist nicht schlecht!"
    },
    {
      "rating": "6",
      "text": "The death scenes and synomotography were good but the key of the scenario was not that strong and hard to understand."
    },
    {
      "rating": "0",
      "text": "So I went and saw this film because it's spooky season as well as the fact that this film looked like an upcoming classic..............I'm kidding. So the basic plot of this movie is it's a more mobile version of Final Destination. Only this time the characters have an app that tells them when they're going to die so it's easier to attempt to cheat death. If they do there's a demon that will basically flex their time of death and kill them for changing their fate. This movie, was AWFUL. This movie has just about every horror movie cliche that you can possibly think of. There's the cringe-worthy dialogue, the research/library scene in which our protagonists try to figure out what's happening, there's the scene where they go to a priest for help, they perform a random ritual, there's a useless love interest thrown into the mix, the dad character is always busy just so he's out of the narrative, stupid subplots that have no purpose of being in the film, and a dumb ending that tries to set up a sequel. That is literally this ENTIRE film in one long sentence only without specifics. The acting in this movie, is not the greatest but it's suitable. In the third act we get some semblance of back story for our main character which was a little helpful. As well as an honestly hilarious character at a phone store. He makes a lot of nods to those who work in or have worked in retail, which makes for some comedy you can relate to. There's some creepy imagery and nice shots in the film. But aside from that, it's a dumb, annoying movie with loud noises and jump scares, terrible characters and subplots and just all and all a very forgettable horror movie. I'm gonna give Countdown, a D"
    },
    {
      "rating": "6",
      "text": "Its not that bad a film a couple of good scenes that make you jump and decent pacing worth a watch."
    },
    {
      "rating": "7",
      "text": "This movie perfectly shows how dangerous it is to download unknown apps. Of course it will not lead to death, but you can lose a lot of personal info. That's why I always check the reviews of the apps. I did the same with Utopia p2p and now I'm secured online as never before. Always be careful, even being online."
    },
    {
      "rating": "7",
      "text": "There's an app that counts down to when you die and if you try to change the outcome, some demon comes and does stuff to you."
    },
    {
      "rating": "5",
      "text": "En cierto modo es una película entretenida, tiene un poco de la atmósfera de Feliz Día de tu Muerte, de terror no tiene nada, suspenso mucho menos ya que es bastante predecible, los momentos de humor son bastante apagados y no causan gracia alguna, pese a ello, pasé un buen rato viéndola, genérica y de poca fe.Ni tuve que ir al cine a ver esta cosa, lleva un par de meses online y el bluray estaba en venta un par de semanas antes de su estreno en Chile."
    },
    {
      "rating": "6",
      "text": "Countdown, about a supernatural app that tells you when you die, has it's moments but is ultimately underwhelming.A lot of the script, especially lead ELizabeth Lail's personal struggles and backstory which takes up half the time, is really predictable and kinda boring. There is a subplot about a doctor (acted unconvincingly by Peter Facinelli; though in defense, he didn't have any good dialogue to work with) that is pretty cringeworthy and is handled in an unnatural manner that serves to force in a plot point. The look of the evil entity in this is also pretty basic.However, there are several moments where Countdown is being a better movie. The humor in this isn't half bad, especially the reactions of regular bystanders to the leads is pretty fun. Tom Segura as a self-serving tech guy and P.J. Byrne as a nerdy priest both do good job as comic relief. There are a few ideas or scares that weren't half bad. Unfortunately, the good and bad stuff counter each other resulting in a very so-so film."
    },
    {
      "rating": "10",
      "text": "This movie was far worse then any expectations I had, but it was just so bad that it's just so entertaining to watch with friends."
    },
    {
      "rating": "4",
      "text": "It could have been definitely better, and that's how we get such spooks and idiotic application. Film to skip."
    },
    {
      "rating": "5",
      "text": "I give a 5 for the shock moments. Because the film was really creepy. However, the film also suffered from an identity crisis. The film wanted to be scary, funny and romantic. This led to painfully bad scenes that seemed out of place."
    },
    {
      "rating": "2",
      "text": "\"Countdown\" doesn't do anything new. 90% of the movie very predictable and easy to tell what's coming. My biggest problem with this movie was the jump scares. One, they were incredibly cheap scares that lost their touch after the second time. Two, you can see them coming. Every scene leading to a jump scare follows the exact same pattern. The lights gi o out, the music gets tense, and you see something creepy. The character turns around and theres nothing. The music stops and BOOM! Cheap scare.... All of that being said this wasn't nearly as bad as some of the other 2019 horror movies this year. The actors vibed well with eachother despite boring performances and not much of a script.2/10 wouldn't see again."
    },
    {
      "rating": "4",
      "text": "Countdown to Your Final Destination5, 4, 3, 2, and welcome back to Stream to Big Screen! This week the clock ran out and we found ourselves at a premier showing of Countdown. Just in time for Halloween season, Countdown brings us a horror/thriller film with a familiar feel. Justin Dec both directed and wrote this money grab of a movie. Countdown follows Nurse Quinn, played by Elizabeth Lail, as she struggles with her own mortality due to a new popular app. The new app, countdown, is becoming very popular with people who are curious, jokingly or actually, about when they will die. Unbeknownst to those who accept the app, this is no joking matter. We follow Quinn as her time runs out.While Countdown has a nice contemporary and technological aspect, the movie keeps it old school evil as well. Similar to the reboot of Chucky, we get a new technology spin on a familiar horror storyline. This spin is both a positive and a negative. While we leave the movie appreciating the use of the app as a device, we also realize this is the same exact storyline as other horror movies. Picture a mixture of Final Destination, Truth or Dare, Ouija, and Lights Out. It’s like Director Dec sat down and said, “How can I direct a film that people feel they’ve already seen before but has a couple new pieces and people will pay for?”Honestly, the movie had a few eerie moments (jumps) throughout it but for some reason we felt left wanting. It felt as if I never got scared like I should’ve been. You know a movie isn’t truly scary when you can walk out of the theater without watching behind you or staying out of the shadows. They cheated the audience out of the fright they deserved. Particularly in my theater, I felt the patrons were watching the movie as a team. We giggled at parts together. We whispered, “don’t turn around” and “if you don’t run” together. It felt like we were in our living room watching a horror movie marathon.Needless to say, this is a movie you can wait to see on a streaming service. This is the perfect movie to catch on FX near Halloween. Not because it’s bad but because it’s got enough humor to keep you entertained and not scary enough to ruin your evening. Catch Countdown when it hits any streaming service. You’ll enjoy this movie if you pay for a rental or the cheapest possible matinee, but you’ll truly enjoy this movie, if you don’t pay for it.The Stream: Not scary enough or innovative enough in the horror genre.The Big Screen: Good humor and evokes stress throughout the movie.The Final Bill: Countdown is a stressful ordeal that provides you with familiar frights for a night in.P.S. Save your money for the sequel… if this movie grabs enough money this time around-S2S"
    },
    {
      "rating": "1",
      "text": "1/10 An extremely bland, incredibly generic horror movie with little scares and a lot of boring exposition. Countdown provides little to no suspense or tension whatsoever. What feels at times like an offbeat version of \"Final Destination\", the film simply doesn't have enough wit or creativity found in films similar to its premise. Thus making it an extremely forgettable attempt at horror movie. At one point, the film tries to shoehorn a sexual harassment subplot which comes off as being more tasteless than anything. It simply had no place in this movie. You sprinkle in a few cringey attempts at humor and you have One of the worst movies of 2019."
    },
    {
      "rating": "2",
      "text": "So.. I decided to get drunk and watch a stupid horror movie last night and on that part, \"Countdown\" delivers. This was a piece of **** but I also fell asleep after an hour or so, so I re-watched the final act and: ✨ IT'S **** BAD ✨"
    }
  ],
  "recommendations": [
    "insidious",
    "dark_skies",
    "insidious_chapter_2",
    "annabelle",
    "malignant",
    "happy_death_day_2u",
    "the_curse_of_la_llorona",
    "chernobyl_diaries",
    "ouija",
    "shut_in",
    "paranormal_activity_4",
    "the_possession",
    "unfriended",
    "devil",
    "paranormal_activity_the_marked_ones",
    "dead_silence",
    "paranormal_activity_2",
    "the_strangers",
    "the_strangers_prey_at_night",
    "the_haunting_in_connecticut",
    "happy_death_day",
    "old",
    "hereditary",
    "the_grudge_2",
    "sinister_2"
  ]
}