{"id": 807, "title": "Couples Retreat", "starring": ["Vince Vaughn", "Jason Bateman"], "runtime": 113, "genre": ["Comedy", "Romance"], "description": "Four couples, all friends, descend on a tropical island resort. Though one husband and wife are there to work on their marriage, the others just want to enjoy some fun in the sun. They soon find, however, that paradise comes at a price: Participation in couples therapy sessions is mandatory. What started out as a cut-rate vacation turns into an examination of the common problems many face.", "releaseYear": "2009", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/igXVSRZsNX3TZsKrQqSyEJvzHRF.jpg", "categories": {"plot": 4.909090909090909, "acting": 4.25, "ending": 4.5, "soundtrack": 9.75, "cinematography": 5.0, "familyFriendly": 4.666666666666667, "funny": 4.769230769230769, "action": 2.0}, "reviews": [{"rating": "7", "text": "A pretty good movie that has its flaws but all the characters have their uniqueness that makes it really enjoyable.Give it a chance and you will be pleasantly rewarded"}, {"rating": "6", "text": "I understand it was nothing remarkable but come on,  it is not that bad. It was funny and relaxing to watch. It makes you want to go to a tropical setting too!!"}, {"rating": "6", "text": "Is not one of the worst movies I have ever seen , but also not approaching the best films . It is not a film that makes us laugh a lot, but it is a quiet film, and fun to see . Nevertheless , it is not a movie I would see for the second time"}, {"rating": "6", "text": "This movie had a few laughs and lots of pretty women. I've seen many worse movies that have gotten better reviews."}, {"rating": "3", "text": "I give this a 3 because the first 15 minutes were promising and then it just turns into hours of horrible dialogue. I mean really boring, totally not funny endless blabbering about absolutely nothing. I actually just shut it off with probably about 15 minutes to go, I just didn't care how it ended."}, {"rating": "0", "text": "Started off with a cheesy idea. and then it got sooo bad it became a chore to watch. The whole movie was not funny. With ALOT of pointless scenes like the \"shark\" siwm which was boring, not funny and jusy plain stupid. what a waste. AVOID!!!"}, {"rating": "2", "text": "I had very high expectations for this move because of the comedic cast. This whole movie was very tame and felt tedious. The laughs were so far apart I had to remember if I had laughed at all during the movie. All of the interesting or amusing parts were in the trailer."}, {"rating": "7", "text": "What are you expecting watching \"Couples Retreat\"? It's inevitable, cliched and boring but I kinda had fun watching this movie I find it comforting and relaxing, also the characters are like able the chemistry that the actors have with one another is good. Dave (Vince Vaughn who also wrote the script) and Ronnie (Malin Akerman), Jason (Jason Bateman) and Cynthia (Kirsten Bell) and Joey (Jon Favreau who also wrote the script) and Lucy (Kirstin Davis) including Shane (Faizon Love) and his young girlfriend Trudy (Kali Hawk). The group use to include Shane and Jennifer but their divorced she's gone. Jason and Cynthia's marriage is in trouble, their deciding whether they want to get divorced or not as they explain in their Powerpoint presentation as they explain to their friends. The only reason they wanted their friends to go was because an order to come with them an order to get the \"group rate\" package, the only one they can afford. So the friends go on the trip, and they learn many things about each other that they didn't know before like Dave and Ronnie think their marriage is \"something to work through.\" Joey and Lucy can't even stand looking at each other, so Joey thinks about cheating on her. Shane and Trudy are having trouble relating to each other to their age difference. What really bugs me about this movie is the script is written by Favreau and Vaughn also Dana Fox, two actors who are funny and talented yet this movie isn't all that funny I don't know what was happening when they were writing that script. But overall I enjoyed this movie despite it's lazy, cliched, but the dialogue that the two comedic star write is humorous and entertaining. 3.5 out of 5 stars"}, {"rating": "7", "text": "■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■》》》》》》》》》》》》》》》》```````````````````````````````"}, {"rating": "2", "text": "Despite a gorgeous setting and funny performances with great characters, Couples Retreat is nothing more than a star studded big paycheck for all the actors. I give this movie 22%."}, {"rating": "4", "text": "The film has a good premise but is let down by a poor script. The jokes aren't particularly funny but the talented cast do their best. Definitely watchable but it wouldn't come highly recommended."}, {"rating": "4", "text": "Couples Retreat is nothing more than a lukewarm movie with a respected cast. Vince Vaughn and Jon Favreau are both very funny but they really aren't funny here. This film seems like nothing more than a ploy to try to draw middle aged couples to the theatre. The film is very predictable and very rarely funny. However I'm sure it can be enjoyed by some people I just didn't enjoy it personally."}, {"rating": "0", "text": "Amazing how Vince Vaughn's creations go downhill...fast. How can you put this in front of an audience ? It's not funny, it's not original, it's not worth anyone's time. Open the garbage bin, throw it in."}, {"rating": "6", "text": "A score of six for a date movie is good. I laughed out loud a lot. It was a good cast, silly premise."}, {"rating": "9", "text": "A solid comedy that takes a little bit to get off the ground but once it does so, it's a nonstop flight to funny. A terrific ensemble cast from the leading stars all the way down the ladder; no role is too small for a comedy injection in this film. Albeit the ending might have been a touch too every couple is back together and happy but but a strong finisher nonetheless. If you've seen the trailer and are curious, you certainly will not be disappointed. It should score in the low 60s at least on this site, this really is one of few where metacritic is way off the mark (another really clear example that readily comes to mind being \"Vanilla Sky\")."}, {"rating": "9", "text": "Music is supeeerb..I really enjoyed the music & background score..Movie is so fascinating in sound ..Just try listening this once in ur sterio..This Guy is simply rocking."}, {"rating": "9", "text": "Regardless of who you are, you will laugh throughout the movie and not that many movies can make that type of guarantee. Give it a chance and you will be pleasantly rewarded."}, {"rating": "1", "text": "It had your stereotypical black couple. Could not get pass that. Black people were being made fun of in this movie... left the movie along with four of my friends that also agreed."}, {"rating": "10", "text": "This movie was very good.. I give it a 10/10. But of course there were some jokes you can hardly laugh, but the whole theme of this movie was good. I really loved the music in this film. I had bought the music album, and i cant stop listening to it. This is just awesome. You would not have heard such good music in any movie. I BET!!"}, {"rating": "9", "text": "This movie should be rated on what it is meant to be a comedy for couples. My wife & I really enjoyed it."}, {"rating": "0", "text": "The only good thing I can say about this film is that I had a free DVD rental code. It's so painfully bad, I shut it off 20 minutes or so in, right after the 4 couples I cared nothing about landed on their island. It might have been less time than that. It  FELT endless. Spare yourselves!"}, {"rating": "3", "text": "Meh. This movie looked promising but was dissapointing."}, {"rating": "0", "text": "Awful, trite, terrible humor, not funny AT ALL...I don't know how I managed to watch it till the end (I'm ashamed of myself for that!)....dont waste money and time on this garbage."}, {"rating": "5", "text": "Retreat isn't horrible, it's problem is that it tries so hard to be a funny, insightful film to see with your girlfriend, but it turns out to be a pathetically lame, sappy and only rarely entertaining film that the filmakers obviously don't have much detail on relationship."}, {"rating": "2", "text": "Wasn't funny and the only decent parts were recycled from other movies. It was also 113 minutes which is unacceptable for basically all comedies, especially a weak PG-13 one. Shame on the good comedy actors who agreed to work with this script"}, {"rating": "1", "text": "When a movie try too hard to be funny with stupid dialogue and stupid jokes then it turns into a stupid movie, at first it looks  good, but then is not only tah just another boring bad comedy"}, {"rating": "4", "text": "Why do I keep watching Vince Vaughn movies? Some people find his stuttering, fast-forward speech, and gravelly voice endearing, however it gets on my last nerve. Add to that a strange story and a talented, yet underperforming, cast to the mix, and it was a recipe for disaster. The story is really stupid and full of plot holes, no one wanted to go, but Vaughn gets roped into it and they all go? Everyone's getting divorced, than they dance and are in love, than they argue and are getting divorced, enough is enough! This movie sucked! It wasn't funny, it was weird and predictable, and stars Vince Vaughn...who should never play guitar hero in public again!"}, {"rating": "0", "text": "F**king stupid. Literally one of the wrost movies I have ever seen in my life.Avoid this movie at all costs. I don't care if you're stuck on a miserable island with only this movie and a DVD player- you must AVOID it like the Swine Flu (where did that pandemic go?)   Diagnosis: PASS! PASS! AND DO NOT COLLECT $200. This film is horrible.\rPros: None.\rCons: Too many.\rWhat you should do: Build a bomb shelter and destroy all the copies you can. Piece of shhhiittt."}, {"rating": "4", "text": "Run of the mill comedy, pretty cliche, but I did get some genuine laughs. Vince Vaughn is on par, playing Vince Vaughn, and his chemistry with Favreau is still there.My personal highlight was the always foxy Kristen Davis who is as banging as ever and still by miles, the hottest of the Sex and the City cast"}, {"rating": "0", "text": "There are \"good\" bad movies and \"bad\" bad movies. Couples Retreat is beyond bad, it promotes racist and ethnic stereotypes and is also painfully boring. People who love this film are either getting paid to write their 5-star reviews or were born on a different planet. There are so many really decent comedies out there. Why waste your precious time on watching utter drivel?"}, {"rating": "1", "text": "Currently watching cause my wife chose it. This is one of the worst movies I've watched in a long time. Barely funny at any point. Extremely superficial and lazy. Waste of great actors."}, {"rating": "9", "text": "Awesome! Totally underrated and hilarious . Very good movie! Awesome and great movie"}, {"rating": "10", "text": "○●○●○▪▪▪▪▪▪▪▪▪▪▪▪○●○●○●○●○●○●○●○●○●_,_,_,_,_,_,_,_,_,_,/,_,/,_,_,/,_,_,_,_,_,_,_,_,_,_,_,_,"}, {"rating": "2", "text": "Four couples go to Bora Bora, an island paradise with water so blue, the moviegoer will wonder if it's CGI-enhanced. Four couples with issues, some known well in advance, and some which arise during their stay at the Eden West Resort, whose program director is so stereotypically French, it's like he has a mime stuck up his a**. When Marcel(Jean Reno) puts pressure on Shane(Faizon Love), a commando-practicing obese black man, to take off his drawers for a couples skills training exercise, he relents, and scores an obligatory laugh from moviegoers, because big ones are supposed to be funny. It becomes less funny, however, if you set this relationship dynamic in a historical context, where Bora Bora continues to be a French colony. Clearly ashamed about the rolls of belly fat hanging over his body, Shane's friends seem like fake friends, as they allow Marcel's unreasonable request to go by without anybody ever opening their mouths in protest. Both the women, and the men, must really want to see Shane's p****. On all counts, \"Couples Retreat\" is just so dishonest, because it pretends to be innocuous and coy. Here's yet another example of a film that reeks of meddling from studio execs, who insist that all the characters be likable. That the couples are, and boring. Some of the vacationers have cheating on their minds, in particular, the former high school football star(John Favreau) and his wife(Kristen Davis), but they never act on this impulse, since that would force the screenplay to go to places it isn't permitted to go. It's a place called Interesting Movie."}, {"rating": "8", "text": "My favorite films are dramatic foreign films so I was more than reluctant to see this. Yet after 25 minutes I found myself laughing regularly and came out of the theater very upbeat. This movie is a comedy, it will make you laugh, it serves its purpose quite nicely. It's not meant to make you dissect your relationship and figure out the meaning of life, it's pure, unadulterated entertainment."}, {"rating": "8", "text": "The best comedy I've seen this year. You've gotta love the Favreau/Vaughn effort. They are a great team and it shows. The critics never know good comedy when they see it. We've been to see it twice!"}, {"rating": "5", "text": "Yeah, it will make you laugh, even though a lot of the movie and dialog just isn"}, {"rating": "0", "text": "I knew I was in trouble early on. Godawful!"}, {"rating": "0", "text": "Horribly bad."}, {"rating": "1", "text": "Not funny. Really cheesy. Really lame. BAD, BAD movie. Awful movie."}, {"rating": "2", "text": "Long. Boring. Disconnected scenes. No chem between actors. Vaughn was sweaty thruout entire movie. Black chick --> not funny. Typecast. Club scene felt like a school dance on the Saved By the Bell set. Extremely poor editing. The studios and producers would do good to trim this flick and do a re-release on DVD. Revamp the entire movie, make it a satire of itself."}, {"rating": "7", "text": "I thought the movie was cute. It had valid comments on four very different relationships. I guess the critics didn't get it. I guess the movie could have played better on some of the funnier points of the relationships which is why it's being criticized. It's hard to be funny and try to make a point at the same time. So there were a few instances where it may not seem funny, but it is when you think about it."}, {"rating": "1", "text": "The writers and concept thinkers of this movie do not have any talent."}, {"rating": "6", "text": "It was ok, not amazing but not a 23! who's does the rating i would say it's worth the wait for dvd."}, {"rating": "0", "text": "I'm really starting to tire of Vince Vaughn playing the same character in every film. His witty banter is starting to get annoying. He's been doing the same thing since he and John Favreau were \"Made\". The movie has no appeal for men and the humor is dry."}, {"rating": "8", "text": "This is a fully enjoyable film dealing with some real life marriage issues... although the plot is a bit hard to believe the cast sells it... and you feel good at the end."}, {"rating": "7", "text": "I'm not going to try and write an in depth description of why I gave this move a seven but in my opinion Couples Retreat was a pretty good movie that had plenty of funny parts. It's no 40 Year Old Virgin but I enjoyed the my time spent in the theatre. Also as a side note; I never for one second felt as if either Faizon Love or Kali Hawk were perpetuating black stereo types."}, {"rating": "0", "text": "The movie plot not focus enough. Should just make it a porno movie."}, {"rating": "3", "text": "By seeing this film, I chose not to listen to my friend who insisted that Metacritic's composite score of 24 had it right - my bad. Although the (far too few) interactions between Vaughn and Favreau were fairly amusing and showed the benefit of their extensive work together on screen, the rest of the cast had zero chemistry. Furthermore, most of the jokes pretty much consisted of sight gags that barely warranted a chuckle (such as the scene where Faizon Love drops trou). This movie also fell into the trap of forcing Vince Vaughn into his rapid fire, mini-monologue schtick when it didn't make any sense. The least they could have done was have at least one of the couples not wind up together, but instead the writers/director/producers (whoever) chose the rode more frequently traveled. A mess."}, {"rating": "2", "text": "I've never been to a movie where the editing was so poor that it was a tangible distraction. Scenes that were just feeling like they were starting to develop cut to something completely different without warning. I honestly thought at least twice that somone had skipped a reel. Meanwhile, other scenes dragged on and/or felt pointless. Don't understand the point of Vince Vaughan co-signing for the motorcycle. Don't get the 30 second rainstorm. Those are only two examples of how contrived this film felt. Several complete scenes just left the viewer thinking ??? I'm still trying to figure out the shark scene, and still can't piece together how three of the four couples got back together instead of sealing their doom based on what they said to each other. And the relationship expert himself? So are we supposed to think he's a genius who achieved massive success or a total fraud? Again: ??? I fully get I shouldn't be asking so many questions and just enjoying the movie instead. But what can I say...I was put in that frame of mind trom the first few minutes of the flick."}], "recommendations": ["30_minutes_or_less", "thunder_force", "trainwreck", "the_watch", "this_is_the_end", "the_hangover", "zoolander_2", "sex_tape", "baywatch", "dinner_for_schmucks", "little_fockers", "identity_thief", "tammy", "ted_2", "rough_night", "anchorman_2_the_legend_continues", "hot_tub_time_machine", "coming_2_america", "tropic_thunder", "jexi", "pitch_perfect_2", "movie_43", "grown_ups", "a_million_ways_to_die_in_the_west", "good_luck_chuck"]}