{
  "id": 2571,
  "title": "Crank",
  "starring": [
    "Jason Statham",
    "Amy Smart"
  ],
  "runtime": 88,
  "genre": [
    "Action",
    "Thriller",
    "Crime"
  ],
  "description": "Chev Chelios, a hit man wanting to go straight, lets his latest target slip away. Then he awakes the next morning to a phone call that informs him he has been poisoned and has only an hour to live unless he keeps adrenaline coursing through his body while he searches for an antidote.",
  "releaseYear": "2006",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/t2q1VRw1c3ONxKXPbyJindPiKNB.jpg",
  "categories": {
    "plot": 6.0,
    "acting": 5.833333333333333,
    "ending": 10.0,
    "soundtrack": 5.0,
    "cinematography": 10.0,
    "familyFriendly": 3.0,
    "funny": 8.75,
    "action": 8.04
  },
  "reviews": [
    {
      "rating": "9",
      "text": "This movie shows great insight as to what may happen if you received the shanghai cocktail. Most of you would give up. Not my boy Statham....He is the up and coming bad ass of cinema....no question."
    },
    {
      "rating": "10",
      "text": "So awesome and funny, and I'm going again tomorrow."
    },
    {
      "rating": "8",
      "text": "I can't imagine any other actor but Jason Statham in this role. He is pure energy, masculinity and sex appeal. His voice is sooo sexy. The film is outrageous fun for the guys. It's crude, raunchy and very violent- but isn't that what men like? There's nothing remotely real about this film. I laughed a lot and I enjoyed it for what is was- brainless entertainment. I only saw it because Jason Statham was in it."
    },
    {
      "rating": "10",
      "text": "listen, this movie wasn't meant to be any citizen kane suck off. This movie is pure entertainment. If you like ridiculous movies, see it."
    },
    {
      "rating": "8",
      "text": "A pure adrenaline rush from beginning to end, this movie never stops moving! The director definitely succeeded in what he set out to do in making this movie, and the result is one of the fastest-paced movies in the history of cinema. Statham definitely pulls off a showy performance, but he goes above and beyond with his role. His adrenaline fix gets so bad he starts doing some unspeakable things in the middle of Chinatown (those who have seen the movie will understand what I'm talking about), and well beyond that. When you finish watching this movie, you will want to see it again sometime, because your head was spinning so fast the first."
    },
    {
      "rating": "1",
      "text": "Certainly one of the worst films I've ever seen in my life. Jason Statham is terrible in this film and the film really delivers nothing good. Pile of crap basically so avoid CRANK."
    },
    {
      "rating": "0",
      "text": "Horrible. Absolutely horrible. I've seen amateur pornography with better writing and acting, and at least then I got to see more than a nipple slip. The fight scenes aren't even good."
    },
    {
      "rating": "6",
      "text": "Chev Chelios is arguably Jason Statham's best known character and Crank is arguably his best known film, but it is far from his best film. Chev Chelios (Statham) is a gun for hire, who will work for anyone who can pay him. One day he wakes up in a daze and finds a video in which a former employer tells him, that he poisoned him with a rare adrenaline inhibitor, which will kill him in a few hours. Chelios goes out seeking revenge, but must keep his adrenaline pumping, in order to slow the poison down. It's a strange story, but as usual, Statham is terrific, playing his most extreme character. Chelios is a crazy man who goes to extremes, however that's all this film has to offer. Non-stop action can sometimes be fun, but when it's the same thing repeating over and over again for 90 minutes, even the biggest action fan gets tired of it. Statham is paired with Amy Smart who starred in my favorite movie of all-time, The Butterfly Effect, and surprisingly she was terrible! She plays Chelios's girlfriend, a girl who is as dumb as dirt and who follows this crazy man blindly through the city on his hunt for revenge. Crank has some humor and a terrific leading man, but unfortunately, there isn't much of story. Besides Statham's well known one-liners and his ridiculous moves, there is really nothing to see here. Crank is one of those films that starts out strong and then just never goes anywhere. Having seen a lot of Statham's movies lately, I was hoping his best known film would be his most exciting, but it wasn't. It's the same scene repeated many times over, and I was tired of it after a half hour."
    },
    {
      "rating": "6",
      "text": "On one hand, you have to admire the filmmakers for keeping up with such a crazy storyline (almost to the point of Loony-Tunes cartoon-making), but on the other hand you have to question the necessity of having such an adrenaline charged \"plot\" to start with. Either way, it's a 1984-esque foyer into the desensitized future of film-making, so you better enjoy the ride while it lasts...."
    },
    {
      "rating": "8",
      "text": "This movie is fairly interesting. Having had late night anxiety attacks at one point in my life - I totally know what Crank intended to be depicting with the constant need of adrenaline activity to keep yourself going. Although I have to say without Statham this movie would be nothing but a joke."
    },
    {
      "rating": "7",
      "text": "Crank is a very funny, extremely over-the-top action comedy. Jason Statham is on top form here and the movie entertains throughout. Usually, I steer clear of B-movie action garbage, but Crank and it's sequel truly turn that stuff into gold."
    },
    {
      "rating": "10",
      "text": "This movie is almost enlightening.  Everything is done in absolute excess - the action is not only fast-paced and non-stop, but also absurd to the point of laughter.  Action flick tropes are exploited to the point of parody, and calling the intended humor \"blue\" or \"dark\" would be an understatement - jokes aren't just in poor taste, they're completely taboo.  Add another brilliantly deadpan performance by Jason Statham and frantic, almost schizophrenic editing, and it's a befuddling, brilliant mess of movie bliss."
    },
    {
      "rating": "6",
      "text": "A pretty interesting movie, but a little strange    ."
    },
    {
      "rating": "0",
      "text": "This is one of the worst pieces of fecal matter I've had the misjudgement to inflict on myself. It might have some appeal to mentally defective 12-year old crack addicts but that's about it. An action movie needs more than just non-stop action, it needs pacing, or the \"action\" becomes non-stop, bludgeoning tedium. I can't believe someone actually compared it to Die-Hard. Die-Hard had a talented director who knew how to orchestrate and pace. This movie is has only compulsive, empty freneticism. Maybe sociopathic computer game fanatics might appreciate it as well."
    },
    {
      "rating": "0",
      "text": "A collosal piece of crap. Jason Statham is starting to make me reconsider the genius of Chuck Norris. Strictly for the brain dead."
    },
    {
      "rating": "8",
      "text": "Actually pretty good for the most part. Takes a little bit to get into but its a good action flick that offers something original and its well worth watching"
    },
    {
      "rating": "8",
      "text": "This movie surprised me.  While it was every bit, the guilty pleasure I had imagined, it was also quite entertaining with regard to the cinematography.  What I would normally find cheap actually seemed somewhat artful.  The pacing was great and the movie was hilarious."
    },
    {
      "rating": "10",
      "text": "One of the greatest Jason Statham movies ever!!! The concept is brilliant, just staying alive from a poison by making your heart go faster and your adrenaline pumping. There needs to be more movies like this."
    },
    {
      "rating": "8",
      "text": "From the beginning to the end, Crank is like a 90 minutes trip on something. Neither does it deliver complex characters nor a deep plot but it is very entertaining and fun to watch."
    },
    {
      "rating": "6",
      "text": "+Basically its Gta the movie+Excellent cast elevate the weak screenplay+Great sense of physically moving from location to location with Chelios+Action sequences have a great deal of fun with the concept-Ridiculous 'story'-The film never fully commits in tone and so borders on parodyCrank at its best is a guilty pleasure that ALMOST becomes the classic action film it wants to be but just misses the bar by a few inches."
    },
    {
      "rating": "5",
      "text": "Braindead male fantasy that steals freely from \"Run Lola Run\"-but never dull."
    },
    {
      "rating": "1",
      "text": "I usually stick movies out, but this one was just too bad. If you're a teen male or just like pure cheesy, then this is the movie for you. Otherwise, don't waste your time."
    },
    {
      "rating": "10",
      "text": "As long as you view this as a, no pretences, action movie that is all about speed and adrenaline then this movie is one of the best in its kind. well worth the watch"
    },
    {
      "rating": "10",
      "text": "If you can accept the premise - this guy needs to keep his adrenaline high to stay alive long enough to avenge his own death - and just run with it, then you'll love this movie. It is a comedy with off-beat, understated, British humor. And it is loaded with action. What I liked most was its originality in places, particularly the ending. The scene in the chinese market was laugh out loud funny. Stratham was a good lead with great support from Amy Smart. The writers of this film had real fun with their character, putting him in outrageous but just plausible situations for him to fight his way out of. I loved every minute of the film, especially its final few minutes."
    },
    {
      "rating": "5",
      "text": "This deliberately over caffeinated crime saga about a drug dealer (Jason Statham) who's doped up with a substance that will kill him if he sleeps, rests or even sits down for too long, so he has to keep his adrenaline way up while finding and taking revenge upon the culprit, borrows plot and thematic elements from both Speed (ironic, eh?) and the 1949 Edmond O'Brien film noir D.O.A., but otherwise we're in Wannabe Tarantino-land once again. At least, unlike this year's other prime example of such, Lucky Number Slevin, this thing MOVES and doesn't have a leading man who's D.O.A. in and of himself...but as Leonard Maltin wisely said of The Last Days of Frankie the Fly, the price we pay for Pulp Fiction keeps getting higher and higher. Statham (The Transporter, Cellular) is tremendously effective and as compelling to watch as Bob Hoskins was in The Long Good Friday, similarly playing a criminal kingpin whose empire is spinning out of control, and Jose Pablo Castillo matches his performance, but this movie--which also features Just friends' Amy Smart in a demeaning role as Statham's girlfriend that completely betrays the actress's name--is as relentlessly headache-inducing (visually and aurally) as being stuck in a video-game arcade with a massive hangover and no aspirin. And even though I own ten years of National Lampoon magazine and am therefore nearly impossible to offend, damned if this flick didn't feature one bit that did it for me: Statham appropriates a cab from its Middle Eastern driver by yelling \"Al-Qaeda! Al-Qaeda!\" and getting a mob to beat the crap out of the hapless soul. Well, I live near a city in which a Sikh was murdered right after 9/11, so please excuse me if something less ethereal and more solid than laughter jets out of my mouth."
    },
    {
      "rating": "10",
      "text": "The Movie we warned you our video game generation would make. This is a smart action flick. Surprised and happy and will definitely pick up on DVD, probably see in the theater again as well. I'm normally not an action flick goer, so this should tell you something."
    },
    {
      "rating": "7",
      "text": "this is the best dumb movie I have seen in a long time.  Lots of thrills, lots of laughs, and I love Jason Statham."
    },
    {
      "rating": "8",
      "text": "It doesn't really make you think and it's unrealistic as hell. But it's also darn entertaining. The shots made me dizzy at times, but I also found myself laughing at how silly it was sometimes. Chelios takes himself very serious, which made it all the more appealing."
    },
    {
      "rating": "10",
      "text": "Amazing movie. I've seen it twice in theaters now. The cinematography is beautiful and crazy, the action is not dull like the reviewers said, and if you want to, you can actually think about the movie -- there's more to it than just killing."
    },
    {
      "rating": "9",
      "text": "Lets be honest. The critics were never going to like this film. I really hope it does well at the box office because this film is action heavy, violent and genuinly really funny, with some real laugh out loud moments. Statham is perfect for the role and there was never a dull moment in it. It'll never win any oscars but if its pure entertainment you want, look no further."
    },
    {
      "rating": "9",
      "text": "This is a top film, forget the critics views, if u want to watch a film where ur not left numb from bordom at watching people talk for 3 hours then see this. Treat it as an action/comedy and see the humor within the non-stop action, Jason Statham is brilliant in the role and uses the daftness of the plot to great effect. My friends and I havnt left the cinema enjoying a film so much in ages."
    },
    {
      "rating": "8",
      "text": "Was funny at times and the action was great. Definitely not a standard issued Hollywood action movie."
    },
    {
      "rating": "2",
      "text": "This was a painful film to watch. It just tried so hard. I've seen Stratham as an actor in other great films (Lock Stock and Two Smoking Barrels, etc) and had some expectations of this. My only saving grace is that I didn't spend money at the cinema."
    },
    {
      "rating": "8",
      "text": "While there wasn't necessarily anything amazing in this movie, I just found it incredibly entertaining. And when I sit down to watch an action movie, that is really all I care about."
    },
    {
      "rating": "1",
      "text": "I can't believe that this movie actually got made. Sure the first drug-fuelled pitch to the producers would have been a fun night, but it must have gone quickly downhill from there. What is Jason Statham doing in this movie? How can he go from a character like Turkish in Snatch to"
    },
    {
      "rating": "10",
      "text": "Lots 'n lots 'n lots 'n lots 'n lots of action. So much that you just love it. Best action movie ever. You can really see how Jason put a lot of work into it. Truly awesome."
    },
    {
      "rating": "8",
      "text": "Has some flaws but come on, it's so fun, amazing!"
    },
    {
      "rating": "10",
      "text": "Fantastic. I loved the whole thing, and Amy Smart was simply wonderful. Statham has matured into the ultimate modern-day action hero, and has a deft touch with comedy too."
    },
    {
      "rating": "5",
      "text": "Crank comes across like the demented daydream of an ADD teen; it"
    },
    {
      "rating": "2",
      "text": "A pile of garbage. One of the worst films of the year."
    },
    {
      "rating": "10",
      "text": "awesome!!! jason statham = awesome actor, what movie is better then a non stop action movie where if the action stops he dies and then the movie fails."
    },
    {
      "rating": "10",
      "text": "It was a fairly good film I have to say. Non stop action, gore, sex scenes, and even humor. I was very surprised with this movie, and would recommend it highly."
    },
    {
      "rating": "1",
      "text": "Mindless. Idiotic. I feel sorry for Amy Smart. Maybe she needs the money. The choppy undercranking just causes headaches. What trash."
    },
    {
      "rating": "10",
      "text": "I rented this expecting just another action film but this turned out to be awesome. Non stop action, fantastic humour."
    },
    {
      "rating": "8",
      "text": "I was just searching for movies this morning and I figured: Hey, I liked Transporter, so why not get other movies of the charismatic Jason Statham? After Transporter 1 and 2 and Snatch, I moved on to Crank, which revealed to be purely an awesome movie. I think people out here want some kinda intellectual challenge in every movie they see. In my opinion, this is a movie that just cuts all the bullshit people are used to seeing. You don't see stuff like backgrounds because you just don't have time! There's no time to search for Jason's character's childhood or wondering why he makes fun of everyone as he does throughout the movie. He's about to die, he doesn't have time to reminisce about his past. It's goofy, but that's what the movie was all about, not taking anything seriously. People obviously took this too seriously and gave it bad reviews because they were expecting something like Snatch. Something utterly slow-paced or just paced, because really, you can spend THREE HOURS explaining how a guy died in one. That's interesting. In my opinion, it would have made it suck more than it did (for those who say it sucks). You know you're cool when you do a car chase with thugs shooting at you and your hot blonde girlfriend giving you head in the meanwhile. Nevermind the public sex scene where he just makes her look like a total wh.re. It's a guy's movie. You need to have some appreciation for satire to like this movie even slightly."
    },
    {
      "rating": "10",
      "text": "CRANK! awsome beyond all knowing. beautiful work of filming nd the world knows it. this movie was a brillaint feat by Jason Statham. If they decided to turn him into a zombie and make a CRANK 2 the world would be a bettr place."
    },
    {
      "rating": "9",
      "text": "This a tremendously entertainng, action film which is absolutely pure in its rendering of the action concept. This could result in an unwatchable, monotonous trek, as has been the case with some other such films. However, this one is a gem. It is quite easy to slip into the adreanline-drenched mind of the character, and this leads to a (to use the trope) roller-coaster ride of a film. There is some quaint silliness with the protagonist's girlfriend which yeilds some charming (brief) respites. It should be noted that this is a guy-flick, and there are some scenes with respect to the girlfriend which get a bit painful. I was willing to let those pass on by, in order not to miss out on the general enjoyment of the rush. Lastly, although many recent films wallow in some pretty sick violence, this one mostly restricts itself to bad guys dying quickly after getting shot."
    },
    {
      "rating": "9",
      "text": "For those who don't take themselves or their movies too seriously, you'll enjoy Statham and Crank."
    },
    {
      "rating": "8",
      "text": "It seems as though Ms. Weitzman took Crank seriously. Such a mistake. This film"
    },
    {
      "rating": "10",
      "text": "Action from start to finish, great film."
    }
  ],
  "recommendations": [
    "crank_high_voltage",
    "furious_7",
    "6_underground",
    "the_marine",
    "salt",
    "polar",
    "the_expendables_2",
    "the_expendables",
    "transporter_3",
    "eagle_eye",
    "the_a_team",
    "xxx_return_of_xander_cage",
    "lockout",
    "venom_let_there_be_carnage",
    "the_fate_of_the_furious",
    "the_expendables_3",
    "mission_impossible_iii",
    "escape_plan",
    "nobody",
    "the_tax_collector",
    "transporter_2",
    "guns_akimbo",
    "death_race",
    "the_mechanic",
    "this_means_war"
  ]
}