{
  "id": 81,
  "title": "Crank: High Voltage",
  "starring": [
    "Jason Statham",
    "Amy Smart"
  ],
  "runtime": 96,
  "genre": [
    "Action",
    "Thriller",
    "Crime"
  ],
  "description": "Chelios faces a Chinese mobster who has stolen his nearly indestructible heart and replaced it with a battery-powered ticker that requires regular jolts of electricity to keep working.",
  "releaseYear": "2009",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/tzTC4EEvF0OPL63frEiogxL2T8M.jpg",
  "categories": {
    "plot": 5.5,
    "acting": 5.8,
    "ending": 7.0,
    "soundtrack": 5.0,
    "cinematography": 2.3333333333333335,
    "familyFriendly": 3.0,
    "funny": 5.785714285714286,
    "action": 5.387096774193548
  },
  "reviews": [
    {
      "rating": "7",
      "text": "Outrageous, controversial and sometimes draining. Crank 2 is one of the craziest films I have seen, not perfect, but definitely a memorable cinematic experience."
    },
    {
      "rating": "7",
      "text": "Silly, fun, if this made you wanna walk out Jason S, man, what were you expecting!!? It is an obvious rental anyway - and no you can't have money or your hour back.... if you wanna walk out don't wait an hour!! And then ask for your money! How long is it? 80 mins? Dude, what a tight ****, can your dad have his sperm back?"
    },
    {
      "rating": "0",
      "text": "It took me exactly 10 minutes to figure out that I did not want to waste 90 minutes on this turd. Set aside the fact that the movie defies the laws of physics"
    },
    {
      "rating": "2",
      "text": "It was a rather basic sequel that does nothing to establish itself from the previous film and it was actually pretty disapointing. I expected far better."
    },
    {
      "rating": "10",
      "text": "Honestly, this movie gets a terrible wrap. Yes, it's crude. Yes, it's senseless violence. Yes to a million other  accusations I have heard against this movie. But I have watched this a dozen times and I am still entertained. Critics nowadays have forgotten what the point of watching films is. People go to the cinema to be entertained. Of course you won't like this if you're above 25 or a prude. But this movie packs everything you could possibly want in a flick. Over-the-top violence, pervasive sexuality, and balls-to-the-wall action! If you are looking for a movie that you will cherish for dozens of viewings, this one's for you."
    },
    {
      "rating": "10",
      "text": "Funny.  Outside the box.  Definitely, a cult classic.  Unlike other movies, this sequel was better than the first Crank (which I had enjoyed as well).   This is one movie, along with the original, that I will keep in my DVD collection."
    },
    {
      "rating": "10",
      "text": "This movie is hilarious and awesome. Over the top and unlike any other film. Needs to be seen if you got a twisted dark sense of humor. Hope there is a sequel!"
    },
    {
      "rating": "10",
      "text": "I liked Crank. I love this sequel. Sure it's not realistic at all, but the direction and craziness of it all made on hell of a movie. Just so much randomness going on, it's insane. I recommend it. Made my all time favorite movies list."
    },
    {
      "rating": "10",
      "text": "Awesome movie. Will no doubt be underrated like another great cult classic movie, Fight Club."
    },
    {
      "rating": "10",
      "text": "The most entertaining movie ever. It was hilarious."
    },
    {
      "rating": "10",
      "text": "Amazing film which spits on other film's sensibility. Crank 2 aims to be ridiculous and it doesn't disappoint. Best viewed as a comedy rather than an action film."
    },
    {
      "rating": "0",
      "text": "The worst movie I've ever seen in my whole life. There's no script, story or real action and the attempt to embed a false comedy makes this movie a shoddy work. Awful, disappointing, baffling, uneven. 0."
    },
    {
      "rating": "2",
      "text": "I enjoyed the first movie the second time around. this movie was absolutely terrible. i assume the only way someone would enjoy it is to be high as a kite without a care in the world. i can't believe jason did this movie. he's becoming a great actor and getting good roles. this movie will only move him down a bunch of pegs when directors go looking for people. was some good action scenes, when they weren't so completely stupid that you just shake your head at them. I'm being generous giving this movie a 2. even my wife said theres 2 hours of our lives we can't ever get back, and she loves him."
    },
    {
      "rating": "5",
      "text": "This film is over the top and ridiculously violent, it's just a typical 21st Century Action film but Statham puts on a solid performance, but the movie is just a typical 21st century action film"
    },
    {
      "rating": "10",
      "text": "This movie is what the big screen and THX are made for. Forget all that hollywood and indie posturing. This movie is the real thing with honest filmmaking values, perfect acting, a real sense of humor, and real entertainment as opposed to the current set of hollywood and indie fakes. The characters are all pitch perfect except for the by the numbers villians. If you like those fake hollywood and indie films, stay away from Crank, High Voltage, but if you enjoy over the top graphics and action, and get what filmmaking is about, this is a highly recommended flick to be enjoyed more than once on most humongous screen you can watch it on."
    },
    {
      "rating": "3",
      "text": "An hour and a half of my life I will never get back."
    },
    {
      "rating": "10",
      "text": "For gods sake don't listen to these moron reviewers who feel they have to say the best film in the world is something like 'Citizen Kane' because they want to be trendy. Crank: High Voltage is a brilliantly funny, fast paced and action packed film that doesn't take itself seriously. Watch it with mates and have a laugh."
    },
    {
      "rating": "10",
      "text": "This is instantly one of the greatest action movies Ive ever seen . It takes all of the over the top elements of the original and takes it 100 times further. Well worth the watch and so far my favourite movie 2009."
    },
    {
      "rating": "7",
      "text": "Mindless violence and mindless sex fill the screen at a breakneck pace in \"Crank: High Voltage\", a post-modernist exercise in degenerate excess that can best be described as a sort of \"Grindhouse for Dummies\". Typical of the film's juvenile sensibilities, The Cramps' classic three-chord stomper \"Bikini Girls with Machine Guns\" gets an update by having topless exotic dancers shoot up a gentleman's club. At one point, a stripper leaks blood, and maybe, saline, after she takes a bullet in the chest. \"Crank: High Voltage\" is brutal, reprehensibly racist and misogynistic, but fun in a gross, politically incorrect way. This sequel to \"Crank\" is, quite literally, a filmic mash note to the post-modernist master of immoral fun himself. In another sense, the film also works as an unofficial sequel to \"Boogie Nights\". At a race track, Chev Chelios(Jason Stratham) has public sex in a variety of positions with Eve(Amy Smart) that recalls porn star Nina Hartley's driveway escapades in the Paul Thomas Anderson classic. \"Boogie Nights\" documented the moment that the adult film industry made the transition from celluloid to videotape. In \"Crank: High Voltage\", Chelios encounters a picket line of striking \"actors\", who are reacting to another seismic shift in their industry. Later on, as aforementioned, Chev and Eve provide some sideshow entertainment for a house full of racehourse enthusiasts in what seems like an extended show of gratuitous sex. The outdoor boinking actually illuminates on how amateur sex videos are winning the hearts and groins of porn aficionados over the industry-sanctioned product, which spawned alternative \"movie stars\" such as the late Marilyn Chambers and the aging Jenna Jameson. People prefer non-professionals because the sex looks more \"real\", less fake. Quite pointedly, Chev Chelios has no heart. While a man without a heart can fake sex, can he fake love, in the scene where Chev finally kisses Eve?"
    },
    {
      "rating": "8",
      "text": "Not quite as good as the first, this one focused a little less on the constant adrenaline rush and more on violence."
    },
    {
      "rating": "4",
      "text": "I just got back from the movie maybe 30 minutes ago so here is my review... I never wanted to walk out on a movie before EVER! but this movie made me want to. Dont get me wrong there are funny parts but its like a funny part LONG DULL NOTHINGNESS and right before i want to leave another funny thing repeat... If someone offered me to see this movie for free i would still feel ripped off."
    },
    {
      "rating": "2",
      "text": "This is quite possibly the perfect example of self-indulgence utterly ruining what should have been a solid sequel. I did not expect a realistic story, but this was simply absurdity without merit."
    },
    {
      "rating": "8",
      "text": "More insane action from Jason Statham. Very much like the first Crank, but still absolutely entertaining. It has a wicked sense of humor and the thrills are non-stop. I can honestly say I've never had this much fun watching a man try to get his heart back."
    },
    {
      "rating": "2",
      "text": "First, I found the gratuitous use of vulgar language unforgivable. This Hollywood tactic needs to stop. Not only is it audibly offensive but Nevaldine/Taylor found it necessary to make it visually offensive as well. I am left pondering why this film did not acquire an NC-17 tag. I, do, though, now have a new respect for Tarentino. This movie is not even in the same league with Pulp Fiction or the Kill Bill's. It fails miserably and falls flat on its face. Efren Ramirez again, made the most out of his character, this time brother, Venus, and was a welcome respite from the rest of the cast. I fell in love with Jason Statham in the Transporter series but OMG how could you not scratch your head t/o this one and say WTH? Your abs are still amazing but that isn't enough to keep me watching. There is a big difference between making a completely violent in-your-face un-politically correct farse and stupidity. This movie is definitely the latter."
    },
    {
      "rating": "0",
      "text": "Ugh... maybe my way of thinking or preferences to movies made me hate this film. The number one reason (though there are A LOT of reasons) I hate this film is the way it is filmed. The shaky, every-changing camera doesn't focus on just one thing, and forces your mind to digest this crap."
    },
    {
      "rating": "3",
      "text": "Awful movie! Not even close to as good as the first one. They really had no script and just stole stuff from the first one to make this one. Not a good idea."
    },
    {
      "rating": "2",
      "text": "What a piece of garbage film. Whoever made this needs to lay off the drugs. I don't think I've ever seen a film that couldn't keep it's focus like this thing. It's all over there, it's completely ridiculous and apparently halfway through they got bored of just fighting and tits so decided to throw in weird cutscene garbage because they have the attention span of a gnat."
    },
    {
      "rating": "9",
      "text": "Actually turns out to be more random than Crank. Loads of action and laughs, Jason especially funny (\"Did I drop some change? Or did I just hear a Chink?\") Two scenes that were King Kong vs. Godzilla and a Jerry Springer type show were slightly less funny and seemed to serve only as time fillers which was strange since the whole thing only lasted 96 minutes in the first place. They're the only two reasons why it doesn't get a 10, amazing."
    },
    {
      "rating": "9",
      "text": "A second installment of fast and high pace entertainment just as daft as the first well worth the time taken to watch."
    },
    {
      "rating": "3",
      "text": "Horrible movie, I love to watch Jason Statham but come on this movie is ridiculous. The first crank was awesome with a great ending, but Hollywood could not leave well enough alone, because the want money. The premise was the worst. On a good note their were some funny parts."
    },
    {
      "rating": "7",
      "text": "At first I wasn't sure what to think of this movie, but in the end, it's just a silly wallow. If you're a fan of the genre like me, you might get a couple of laughs and some of the action is ok, but in the end it's a second rate movie and the pornographic overtones make the movie a bit distasteful. My wife said it was as if the movie was made by a couple of eight year olds, and she's right. Naked chicks, car crashes, guys cutting off the nipples, some descent brawls and fights scenes, splinkled with saucy humor, and video game dialogue - all trying to keep your attention while moving the plot along. I was going to give the movie a 6, but I gave it a 7 because it did make me laugh a couple of times."
    },
    {
      "rating": "0",
      "text": "Utter, utter garbage. This movie has no heart and that isn"
    },
    {
      "rating": "8",
      "text": "What a crazy movie! It's art! To make such an electric, intense, thrilling filck, one just has to have a lot of talent! Truly High Voltage!"
    },
    {
      "rating": "3",
      "text": "The producers have left behind all pretense of anything happening being grounded in reality. They lost me at the Godzilla style fight with big foam head caricatures of two characters in the movie. This movie is just a dumping ground for every stupid idea they could come up with. Considering people also look at traffic accidents, people will watch this movie too."
    },
    {
      "rating": "3",
      "text": "Utter shit! I like the idea of a preposterous un-PC action movie but this was just badly done in every respect. Some guy on here with a mild retardation suggested that this had \"honest film making values\". Please explain because what I watched didn't seem to have any values at all. I'm not gonna complain about the plot or script because i didn't expect one so heres what i thought about the action. The action sequences were poorly executed, the kinetic shaky camera work rendered the stunts and possible choreography visually null and void when compared to most other decent action flicks.The CGI and stunt work would have been groundbreaking pre-Terminator 2. The two guys directing it should consider changing their style or better yet, their line of work. I can appreciate what they were trying to do but they missed the mark badly. It gets a 3 from me because that's the amount of laughs a got. Considering they attempt to make the viewer laugh with their crazy, outrageous, shocking (parp) movie about 30 times I should give it a 1. I would have loved this when I was 14. At 16 I would have grown out of it. At my current age of 26 I just think it's a wasted opportunity to make something exciting and just another way for studios to make money out of gobshite directors and MTV marketing campaigns. I watched 'Death Race' the other night and unexpectedly really enjoyed it. Thats how you make a brainless action movie Jason. Please leave the Crank franchise alone. Anyone hoping to watch this movie should download it illegally, show it to all their mates so they don't rent it and make the franchise money and then go to the movies and pay to keep decent movies being made. Any self respecting film fan should avoid this at all cost. Anybody with a low to average low IQ, appreciation of daytime TV and/or lover of turgid American bands/music videos, go see it. You'll love it. You Twats."
    },
    {
      "rating": "8",
      "text": "One of the best 'bad movies' I've seen in quite some time. Absolutly absurd, to the point of utter nonsense. And the whole crew working on this movie knew this, and as such it really is a fantastic thing to watch - if you like bad movies."
    },
    {
      "rating": "0",
      "text": "Anyone who gave this more than a zero is a mindless moron on crank."
    },
    {
      "rating": "6",
      "text": "Like the first Crank, this has a breathtaking pace and a lot of stylish cinematography. Jason Statham repeats his role and he is indeed very well cast. It does tend to be a bit too much at times, but it is entertaining."
    },
    {
      "rating": "2",
      "text": "The only movie i have every walked out of. I even asked for my money back. Didn't get it. If i can't get my money back can i get my hour back?"
    },
    {
      "rating": "10",
      "text": "This is entertainment and tats all I expected, it didn't have any thing in the way of its fun. Best to be watched with beer, pizza, and alot of good fiends."
    },
    {
      "rating": "10",
      "text": "It was funnier than the first one was , plus it an action movie w/ tons of crazy shit going on ."
    },
    {
      "rating": "10",
      "text": "My god... never before have I been more entertained by a film."
    },
    {
      "rating": "10",
      "text": "Loved it. Completely ridiculous and over the top, a bit of light hearted fun."
    },
    {
      "rating": "0",
      "text": "I really don't tend to be extreme but this is 100% the worst, most stupid movie I've ever seen and usually I can enjoy stupid movies. It's 0 out of 10 at the most, seriously."
    },
    {
      "rating": "10",
      "text": "A clear premise. Homage to our childhood video games. Could not stop smiling. Completely gratifies every lust."
    },
    {
      "rating": "8",
      "text": "Not as good as the last movie, but still enjoyable."
    },
    {
      "rating": "10",
      "text": "The disparity between the \"real\" critics (yeah like it's an authentic profession) and the public at large shows us once again why it's best to ignore them. This was one of the best directed action flicks I've seen in quite a while. Original, surprising, shocking, and just hilarious. Probably not a good movie for the prudish or squeamish, but otherwise run, don't walk, to buy the DVD."
    },
    {
      "rating": "4",
      "text": "This bored me. I'm a big fan of action movies, but I prefer my action free of obvious camera tricks and gimmicks. I don't enjoy editing that's use dto indicate a character's mental or emotional state. I have the same problem with 'Requiem for a Dream' as I do with both 'Crank' films. I'd love to see Statham just fight. I don't want to be reminde dthat I'm watching him fight in amovie. I dislike like slow-mo and choppy editing. I don't like kung fu movies. What I like is The Bourne Films, Casino Royale, Die Hard (all), Blade: Trinity, Taken, 'Kill Bill', and 'B13'. 'Crank' and 'Crank: HV\" remind me more of 'Snatch' and 'Lock, Stock, ,,,' than of 'Bourne'. What I like is watching athletic, strong, cunning, agile people fight each other and fight the laws of physics. If taht involves violence as a by-product of strength and agility, so be it (like NFL football). I have no interest in violence or shock for their own sake. Hence, I don't really consider the 'Crank' movies to be action films. They're violence films. Agility and speed give em a wonderful headrush. Violence doesn't."
    },
    {
      "rating": "10",
      "text": "This movie was great! If anyone had seen the first one, the Crank movies are made to be mindless action, gunfire, blood, explosions, sex and whatever other great things go along with being a most testosterone-filled viewing experience!! There is no need to get to know the characters and care for them, no need to wonder how it will end, for we all know going into it that Jason Statham in all his rippling manly, tough, pissed off glory will prevail. We don't watch it to be intellectually stimulated, we watch to be entertained. Not everyone's idea of entertaining is equal. That is why there are also movies such as \"17Again\" that makes you giggle and say \"Awwwwwwwwwww\" at the end, or some random chick flick to encourage women to break out the box of tissue and curse their boyfriends/husbands and reality for not being just like the touching films. To each their own. As a female, I hate \"Chick Flicks\" because they distort people's perception of what reality is capable of. This movie just made me sit still and watch and wait for the next bloody kill or the next sadistic way Jason would find to stay alive. Just the way I like my movies: Entertaining 100% Unrealistic Fiction. Delicious!!!"
    },
    {
      "rating": "5",
      "text": "i liked the first crank it was over the top and fun . the sequel how ever is so far over the top it heads into whacko land to the extreme . it was just to bizzare especially the godzilla looking fight it turns into all of a sudden i was just confused and scratching my head on wtf they where trying to do. its a action packed fast paced film which is kinda fun but its just to F'd up with all the wierdness for me to really enjoy."
    }
  ]
}