{
  "id": 3610,
  "title": "Crash",
  "starring": [
    "James Spader",
    "Holly Hunter"
  ],
  "runtime": 100,
  "genre": [
    "Drama"
  ],
  "description": "After getting into a serious car accident, a TV director discovers an underground sub-culture of scarred, omnisexual car-crash victims who use car accidents and the raw sexual energy they produce to try to rejuvenate his sex life with his wife.",
  "releaseYear": "1996",
  "mpaaRating": "NC-17",
  "imageUrl": "https://image.tmdb.org/t/p/w500/gpai5oUFyFGLHOCsYTvVMqlbY7A.jpg",
  "categories": {
    "plot": 8.34375,
    "acting": 8.03225806451613,
    "ending": 9.0,
    "soundtrack": 10.0,
    "cinematography": 10.0,
    "familyFriendly": 10.0,
    "funny": 6.6,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "10",
      "text": "Crash is one real exceptionally well-done film. The theme of racism really slaps you in the face, but it is followed by other underlying messages, such as redemption. The exposés to the first two vignettes are a tiny bit forced, but the transitions are smooth for all of them and the script is sharp and deliberate. Where the movie lacks it makes up for in acting, screenplay, and direction. Haggis knows what he's doing."
    },
    {
      "rating": "10",
      "text": "You will probably never see a movie this good ever in your life,your fathers life and his fathers life.Trust me you have to watch it over and over just to appreciate the perfect acting.Simply stunning!."
    },
    {
      "rating": "10",
      "text": "there are a few movies that can improve our living situation on earth. crash offers to us to be kind and clement to other people. any color or any nationality."
    },
    {
      "rating": "10",
      "text": "People are judging this movie for the wrong reasons. I usually hate when people say something like, \"If you didn't like this movie, you didn't understand it,\" but I'm actually reading the reasons people don't like, and they seem to indicate just that. They say the message is obvious, and then they go on to say the message is that racism is bad. That's not the message. It's already assumed that racism is bad. The movie is pointing out where it exists in seemingly normal circumstances. It challenges the viewer to question how they would've handled certain situations; if they would've been as prejudiced as the characters. The dialogue is thought provoking and interesting. Some say it isn't natural, but neither is Shakespearean dialogue, or the characters singing conversations in movies. It's used to challenge the viewer, and to make them think about important issues that we don't think about. It's not just racism, it's the details of racism's effect on various different people. The discussions may not be natural, but they're based on very real issues.\r The movie is also, as Ebert said as well, more about ideas than people. For those who want more character depth, it's not really about the people themselves, but about how people in general are conditioned by society to handle certain situations. It's better that the people be as generic as possible, to show that the way they're acting isn't because of their specific personalities, it's because they are normal people, acting as an average person would. It challenges you to question yourself, instead of showing you a person who has a specific personality that is nothing like yours. Basically, this movie is good in a way that doesn't follow the formula of what traditionally makes a movie good. That's why people have a problem with it. The use of connecting the storylines is not just made for poignancy, it's to show how closely we are connected to each other; how our thoughts and actions have effects on people, and we don't even realize it. It's about how society's views creep so easily into our minds and become our own views, without us thinking anything of it. And to the person who said this writer is in high school, no. He's actually a three time nominee for writing. Two of his movies one Best Picture, another was nominated, and two others got rave reviews and made a ton of critics' lists. He knows what he's doing, even if some people don't understand it."
    },
    {
      "rating": "10",
      "text": "Perfect movie. It's absolutely stunning all the time. It left me happy but sad at the same time; assuaged but also distraught. Superb actors, and screenplay and editing that totally deserved the Oscar. In my opinion, the music should've also got one. It underlays all these varied scenes with such feeling, it's just fantastic! One of the best movies I know!"
    },
    {
      "rating": "10",
      "text": "Just in case anyone reads this, I ask if anyone has a direct line to Mick LaSalle? He's the critic for the San Fran Chronicle, and the guy is a complete douchebag-moron. He's left probably 50+ reviews that are so far from what he says about great films. This movie is not a 50/100."
    },
    {
      "rating": "10",
      "text": "A compelling and compulsively watchable piece of work with several great performances and some incredible sequences that will shake you to the core. It also gives a much needed message, and should serve as a wake up call to many Americans."
    },
    {
      "rating": "9",
      "text": "With \"Crash\" a beautifully fable-like story is executed with some heavy-handed thematics, but the film is still unquestionably top shelf on a technical and performance-centric level."
    },
    {
      "rating": "10",
      "text": "A great film. Crash really struck a chord with me, it's one of the most thought-provoking films I've experienced. Each character in the film is stripped completely to where every flaw is obvious to the audience. You'll relate to a character in the film much more than you would probably want to admit, but it's in this way that Crash effectively delivers a powerful punch. The film is hard, honest, realistic, and uncomfortable, but it absolutely works; the film gets right to the core of racism and so many other problems that plague our society. Features stunning work from a stellar cast. Deserved Best Picture in my mind."
    },
    {
      "rating": "9",
      "text": "A little too pat to be great, but plenty of very powerful and affecting moments nonetheless - some genuinely funny moments, as well. The intertwining of the various stories is, for the most part, pretty clever; and things often turn out quite differently than you'd expect. Very good acting all around."
    },
    {
      "rating": "0",
      "text": "Disgusting all the way around. Don't recommend it to anyone. Typical white mainstream media stereotypes of people of color. Garbage like this causes more problems rather than entertain. Warning to people of color: do not watch this crap. Walked out in the middle of the film."
    },
    {
      "rating": "2",
      "text": "Let me start by admitting that i walked out after dillon/newton's 2nd encounter, so maybe i missed something pivotal. i just couldn't sit through this frustratingly manipulative, insanely overwrought, false, and downright insipid film. i was really looking forward to this film, especially living and having lived in LA all my life and experienced the racial climate here. this nonsense couldn't be more off base. the way race exhibits itself here in LA is far more subtle, and therefore more interesting and important to explore. this movie trivializes the whole subject. after the first few lines of dialogue spoken by cheadle's character, which i THOUGHT was the film's thesis, i was drawn in. and almost as quickly i was put off. great first 2 minutes though."
    },
    {
      "rating": "2",
      "text": "Preposterous and racist film that portrays the worst in people. Avoid."
    },
    {
      "rating": "2",
      "text": "Ugh, this is what happens when you take a handful of name actors and don't give them much to work with. The writing is pretty bad and the script takes its message and hits you over the head dozens upon dozens of times, when a more subtle approach would have worked much better."
    },
    {
      "rating": "9",
      "text": "Crash was and still is an incredible movie in every sense of the word. Its still a very relevant picture now in 2019 as it was in 2005. It's a very unsettling film, touching on subjects such as racism, healthcare, police violence and gun violence, stuff that is still very relevant in today's society. It's a carefully woven plot, with each deeply flawed character connecting with eachother in some form or another. I can't say enough about this film, it caught me on one of the first times I seen it. Crash is a brutally honest and exceptional film"
    },
    {
      "rating": "9",
      "text": "Куча историй разных слоёв общества, вроде бы такая подача и в год выхода фильма была не нова, но даже сейчас всё действо смотрится на одном дыхании. Но, всё же, я в тот год отдал бы оскар \"Горбатой горе\", но это уже личное предпочтение.Итог: Замечательный фильм, держит в напряжении и поднимает некоторые важные вопросы."
    },
    {
      "rating": "10",
      "text": "$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,●》●》●》●》●》●》●》●》●》●》●》●》●》●》●》●》●》●"
    },
    {
      "rating": "10",
      "text": "♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇"
    },
    {
      "rating": "10",
      "text": "●°●°●°●°●°●°●°●°●°●°●°●°●°●●°●°●°●°●°●°●°●°=_=_=_==_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_="
    },
    {
      "rating": "10",
      "text": "\"**\"\"*\"*:*:*:*:*:*:*;*;*:*:*:*\"*\"*¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙"
    },
    {
      "rating": "10",
      "text": "♤♡♤♡♤♡♤♡♡♤♡♤♡♤♡♤♡♤♡♤♡♤♡♤♡♤♡♡♡♤♡♤♡♡♡¿¿¡¿¡》¿¡¿¡》¿¡¿¡》¿¡¿¡》¿¡¿¡》¿¡¿¡》¿¡¿¡》¡¿¡¿》¡¿¡¿》¡¿¡¿》"
    },
    {
      "rating": "10",
      "text": "{}{}{}{}{}{}{}{}{}{}{}[][][][][][][][]()()()()()()()()()!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!"
    },
    {
      "rating": "10",
      "text": "⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙●■●■●■●■●■●■●÷%÷%÷%÷%÷%÷%÷%÷%÷%÷%÷%÷%÷%÷%÷%$$$$$$$$$$$$$$$$$$$$"
    },
    {
      "rating": "9",
      "text": "♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》"
    },
    {
      "rating": "10",
      "text": "●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●■¡■¡■¡■¡■¡■¡■¡■¡■¡■¡■¡÷*÷*÷*÷*÷*÷*÷*÷*÷*÷*÷*÷*÷*,."
    },
    {
      "rating": "10",
      "text": "As 'Crash' unfolds and more and more characters are shown, it's clear that this is a realistic yet problematic study of human behaviour, it addresses various issues of how we react to various cultures and beliefs, but also shows the dark side and dangerous capabilities of our fellow man. In the ensemble cast include Brendan Fraser as the District Attorney, his opinionated and perhaps paranoid wife played by Sandra Bullock, who are both carjacked by the talkative and philosophical Chris 'Ludacris' Bridges who has all the answers to the racial problems that sweep America, along with his friend.\rWe also have a racist LAPD officer in Matt Dillon, who cuts a hardened and bitter man with his own personal grief, which he takes out on others, especially a black couple on their way home one night who have did nothing wrong, these two are played by Thandie Newton and Terrence Howard. In the bigger frame of it all we have recurring character Don Cheadle, a detective in Los Angeles. Of course these stories intertwine in often dramatic circumstances, some become unspoken enemies while others become unlikely heroes. The exact point here is the perception of the individuals being shown, many times there is no intent involved in this wide variety of characters, but their race is enough for other people to judge or be judged by, this message is relatable for the fact that this is still a problem, a problem which is addressed with the fullest attention by Paul Haggis, director and co-writer, who links these very different stories in the most unlikely yet understandable of ways, who could have thought that racist cop who basically molests an innocent woman, ends up saving the exact same woman from a burning car on the highway.  Each of these people interact with each other one way or another, sometimes with tragic results.\rThere is retribution, however, to be had with these characters, who learn the error of their ways through luck, chance, drastic circumstances or just talking to others, saying that, there are those who feel that they are indeed being discriminated against and want to take matters into their own hands one in particular being a Persian shop owner, played by Shaun Toub.\rThe scope and detail that goes into making each character as interesting as the next, they all have hate and opinions, but all this proves is that they are human. A wonderful, calm and fitting score accompanies the film, highlighting pivotal points and shining moments. With a cast that also includes Ryan Phillippe, Jennifer Esposito and Michael Peña, there are some emotional and finely executed performances in the film, they each play a role that demands attention for the message they are sending, a problem is not necessarily being addressed and sorted, but it is being shown in plain sight for the world to see."
    },
    {
      "rating": "9",
      "text": "Paul Haggis made this picture with a great passion flowing in his veins, fashioning honest, smart and true characters out of nothing, while winding them together in a plot that ennobles the cinema."
    },
    {
      "rating": "0",
      "text": "Clearly written by a rich white person from Santa Monica who doesn't have a clue about life in the real Los Angeles. This movie makes Grand Canyon look deep. Maudlin manipulative glop."
    },
    {
      "rating": "10",
      "text": "First off, I would give crash a 9.5 out of 10. Acting is really good. Terrence Howard and matt dillion I think were the best in the movie. Score is good. Story is really good. Telling the story of discrimination and the racist side is just happy, but at the same time powerful. Overall, this is a great movie.  Highly recommended for everyone."
    },
    {
      "rating": "10",
      "text": "Don Cheadle's performance totally changed my perception of black people. They're the best. He's the best. Racial tension  More like sexual tension, every time sexy Brendan Fraser is on screen. Watch it. Love it. Rewatch it. Peace. p.s  When are we going to see another George of the Jungle sequel? I mean, HELLO! TARZAN! peace."
    },
    {
      "rating": "2",
      "text": "If you're making a movie that positions itself as \"hard-edged realism,\" it's probably best to avoid an excess of dramatic contrivance and coincidence. I lost count at about 65. This movie just plain sucked."
    },
    {
      "rating": "8",
      "text": "\"Crash\", a racial movie directed by the famous Paul Haggis, is a masterpiece. With a powerhouse cast with a good lead from the director, the movie starts with pain and anger and triumphantly ends with love and forgiveness. It surely is one of the greatest movies i've seen currently these days."
    },
    {
      "rating": "4",
      "text": "I think the negative reviewers are a little harsh, I wouldn't call it racist by any stretch of the imagination. But cliched as all hell? Yeah. This is typical hollywood masquerading, trying to be deep and meaningful. Lacks Robert Altmans subtle weird humanism in Short Cuts. Plagued by white guilt, the movie runs the complicated issue of race through Hollywoods dreaded machinery of doom, leaving just scraps of brilliant acting and dialogue submerged in a mire of annoyingly coincidental plotpoints."
    },
    {
      "rating": "10",
      "text": "This movie is a must see.  It is simply phenomenal.  The plot is engaging and the acting is fantastic.  It tackles complex social issues directly.  Anyone who does not feel uncomfortable at some points of this movie should check their pulse.  It's deep (in a good way)."
    },
    {
      "rating": "10",
      "text": "Paul Haggis's 'Crash' its so much more than ye-olde-school racism. It is about the lack of human connections and mental damages brought up by living in modern America. More specifically, Los Angeles. A metropolis feeding on the minds of people, overflowing with concepts of hatred and anger brought by its hectic pace.\"It's the sense of touch\" says Detective Graham (Don Cheadle) after a close-call car accident. \"In LA nobody touches you. We're always behind this metal and glass. I think we miss that touch so much that we crash into each other just to feel something\". His partner and lover Ria (Jennifer Esposito) thinks he might have lost his frame of reference, which might be true. But these ideas were always deep inside him and maybe this brush with mortality just made them come forth.The film spawns a glassy and gloomy soundtrack occasionally containing sublime and dramatic world music and its visual style is polished and deeply introspective. Shots follow the characters beautifully as they clash with the surrounding neon lights of the big city. There is technical prowess in 'Crash' and, like all great films, there is no moment of pause. Los Angeles is the Haggis's chosen melting pot for not only necessarily race, but varying human ideologies. The 5-6 subplots are switched from one to another with relative ease, and often they split into more or they rejoin one another.Yet deep down, this is a film not about racial discrimination and eventual awareness, but about people and how ridiculous they can be. Scenes are switched at a fast pace, yet there is not one which is not interesting. Each one is focused, thorough and in a couple of minutes Haggis is more psychoanalytical than most films are in hours. He puts his characters in worst-case scenarios which they pass, but this might just be the first film which is about the lingering emotions brought up by those situations rather than the situations themselves. It is this what makes this film truly emotionally powerful.It's funny how things work. And as the film progresses each of its characters are drawn to an eventual silver-lining; most of them finding solace, overcoming and awakening from their emotional coldness. Snow falls over Los Angeles as people go on about their lives. Just like before, consumed by quotidian anarchy masquerading as order, feeling regret, love, hate, sadness; and I felt everything too. It was so familiar. But in the end, I just laughed at everything and thought to myself: \"people, man... people\"."
    },
    {
      "rating": "10",
      "text": "Great Film!!"
    },
    {
      "rating": "4",
      "text": "Not a great film. Mediocre at best. Brings up some important points and is powerful in some scenes, but too much filler and way too preachy. Maybe some better actors/actresses would help (Sandra Bullock, Ludacris and Brendan Fraser come on!). Micheal Pena is the soul of the movie and carries the weight of the film. I'm sorry, Brokeback was a better film and even Munich was better."
    },
    {
      "rating": "8",
      "text": "Its hard to describe this movie and its certainly very controversial, but I enjoyed the experience. 83/100"
    },
    {
      "rating": "4",
      "text": "It´s not the worst film ever. It has certain moments in which it wants to be a great film. There are some good performances. But everything is so contrived, laughable, some scenes made the theater laugh when I saw it back in the day. If there´s a big mistake in the history of the oscar awards it has to be this film winning Best Picture. Clearly a strange fix cos Brokeback Mountain got Best Director few seconds before. I remember all critics in Spain saying \"What?\" All the other 4 nominees were so above this film, especially Munich and Brokeback mountain\rThe issues here discussed have been many times addressed before, only that 10 times better. Forgettable film, in fact nobody remembers it now compared to other films from that same year"
    },
    {
      "rating": "7",
      "text": "While I did find the message incredibly overbearing and overexaggerated, especially at the beginning, the character and plot development is so touching and poignant in places that it nearly nullifies my earlier concerns. Great performances from the majority of the cast and overall a pretty solid film in my view."
    },
    {
      "rating": "7",
      "text": "Crash succeeds with outstanding acting and some very compelling scenes but at times seems continue to press a point that was made within the first 15 minutes. In the end, Crash will keep you interested all the way through."
    },
    {
      "rating": "0",
      "text": "This is the cheesiest, most maudlin self-serving pile of garbage I have ever seen. It was a little hackneyed early, but watchable thanks to decent pace and the occasional laugh. At about the three quarter mark, the cheesefest begins. I have never seen a movie so unintentionally funny. The blanks?The cloak of protection? \"My guardian angel?\"Snow in Los Angeles?Even one of these events would take a movie over the cheese-limit. Did someone actually get paid to write this? Was it someone they pulled out of a high school creative writing class?Used correctly, coincidence and the crossing of paths of otherwise unrelated storylines adds poignancy to a story. When you do it 600 times, not only does it lose any meaning - it becomes a joke. There's a tiny shred of something important and meaningful in this movie, but it's completely hidden behind horrible writing, bland acting and a mountain of stereotypes. Honestly - there isn't one believable character in the entire thing. Every single person is exactly what you'd expect...or the exact opposite of what you'd expect. No depth. No shades of gray. I hadn't had a laugh this good in a while, until I started reading some of the reviews of this pile of dreck on this site. I actually saw someone use the word \"masterpiece.\" I laughed so hard I think I peed my pants a little. If you think this movie is a 10, please stop posting movie reviews."
    },
    {
      "rating": "5",
      "text": "\"Crash\" by Paul Haggis is a film with a terrible sense of scope and content. It"
    },
    {
      "rating": "10",
      "text": "Great movie! It's so dead-on accurate about real life."
    },
    {
      "rating": "10",
      "text": "I just came home from seeing this movie, and must say it is one of the best movies I have ever seen. Not very often such a special movie like this is made. One word: MASTERPIECE. Go see it."
    },
    {
      "rating": "10",
      "text": "As you watch this movie you can see yourself in the characters. it is so real and when you leave the theatre you can't stop thinking about it."
    },
    {
      "rating": "3",
      "text": "Bad white man! Bad!!! Caucassian men beware... you will have a finger wagged in your face for two hours. The one lesson we all should walk away from this film with is People ALL suck at one time or another. Gee, I learned that from living life everyday. Give me something deper and less manipulative. So, I'm supposed to feel bad when a violent criminal meets an accidental fatal wound? A man that has been car jacked is more willing to be shot by the \"racist\" police rather than give up the criminal that kidnapped him at gunpoint only moments before? I suppose a police officer of a racially diverse background could not be shown as being a bit of a dirt bag? If want to feel bad about yourself, enjoy this film. To be honest... any film that creates this strong a reaction, even negetive, has an inherent artistic value. Save your moeny though, and wait for it to come on IFC."
    },
    {
      "rating": "0",
      "text": "In a nutshell, this is a very derpressing racist movie demonstrating racial intolerance. It was so depressing that I walked out halfway through this film as did the few other people in the theater. Despite these glowing reviews that seemed to have loved it, I found it exploitative and very derogatory toward all races. Avoid."
    },
    {
      "rating": "3",
      "text": "Too predictable, very contrived and no real panacea to the universal problem of racism is offered in this movie."
    },
    {
      "rating": "3",
      "text": "What an overblown, inarticulate, clumsy and depressing film! The strokes are so broad, and most of the set-ups so obvious that even the bits that do work and are affecting are blown out of the water ten seconds later by something so eye-rollingly hideous - a girl is told that she's got her father's invisible shield to protect her against bullets... What happens next? Duh. Some of the stories are incredibly slight and trivial - Sandra Bullock has three conversations and that's her narrative. Other ones are insanely implausible - a TV director whose had two difficult experiences in a day after (presumably) a life of dealing with racial tensions, suddenly goes loopy for no obvious reason. Worst of all is the cynicism here - and this the bit where I really agree with one of the other reviewers here - the whole film operates on the assumption that people aren't good or bad, they're just trying to get through difficult circumstances - and it also operates under the assumption that if depressing and cynical films are 'artful' then REALLY depressing and cynical films must be Leonardo da Vincis. So everyone is corrupt or evil in one way or another - only one character is honourable all the way through, the rest are universally just different shades of self-involved wankery. You come out of the cinema not uplifted by people's struggles or wiser in the race wars, but sickened by your fellow man, disgusted by our whole revolting species. This isn't a tragedy, it's a self-indulgent, wallowing, decadent film that reveals the bankrupcy of the film-maker's spirit - a man who can afford the luxury of an absolute loss of faith and wants to take the whole world down with him. Not very good. I'd go as far as to say that in its representation of humans as universally corrupt, it's very nearly evil."
    }
  ]
}