{
  "id": 874,
  "title": "Crawl",
  "starring": [
    "Kaya Scodelario",
    "Barry Pepper"
  ],
  "runtime": 88,
  "genre": [
    "Thriller",
    "Horror",
    "Action"
  ],
  "description": "When a huge hurricane hits her hometown in Florida, Haley ignores evacuation orders to look for her father. After finding him badly wounded, both are trapped by the flood. With virtually no time to escape the storm, they discover that rising water levels are the least of their problems.",
  "releaseYear": "2019",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/mKxpYRIrCZLxZjNqpocJ2RdQW8v.jpg",
  "categories": {
    "plot": 4.645161290322581,
    "acting": 5.305555555555555,
    "ending": 5.181818181818182,
    "soundtrack": 5.666666666666667,
    "cinematography": 5.5,
    "familyFriendly": 3.0,
    "funny": 4.5,
    "action": 6.722222222222222
  },
  "reviews": [
    {
      "rating": "0",
      "text": "THEATRE and cover your face so no one sees you there. Main character is bitten on both arms and a leg and is miraculously HEALED before the end of the movie. Father has shoulder bitten, leg broken and arm bitten off but walks during movie and swings a brick and shovel really well. Two cops are idiots. Decisions they made to survive were STUPID and, last but not least, the coincidentals that keep stopping them from escaping are just way to predictable. A **** movie"
    },
    {
      "rating": "4",
      "text": "this film has a bad plot.  there are a number of possible things that could have been avoided.  for example, when Haley wanted to take her cellphone that had fallen in an area where there was a crocodile, and she managed to retrieve it.  but instead of returning to a safe place, she instead made a call there causing the crocodile to attack her.  after that instead of returning to safety with the path she was on, she went through a gap in the cable that caused her to get stuck.  it's one of the most ridiculous things from movies I've ever watched."
    },
    {
      "rating": "8",
      "text": "Chomp. Chomp. Chomp. This is my kind of thriller! A college swimmer (Kaya Scodelario) and her dad (Barry Pepper) are trapped in their Florida home during a major hurricane. Also in the crawl space with them are several alligators. Needless to say, people are eaten alive in the rising water. However, it's not with excessive gory detail, but just enough brutality to make it distressing. Although the duo's multiple injuries strain credulity, their fight for survival is tense and exciting. This doesn't break any new ground for the genre, but it sure does entertain with several good jump scares and plenty of bloody reptilian thrills. Interestingly, shot entirely in Serbia."
    },
    {
      "rating": "0",
      "text": "Polite words simply don't describe this film as efficiently so I'll just say: 'Crawl' is the most retarded film I've seen in a long time. Cliche ridden **** about morons doing a piss-poor job at surviving a problematic situation and disappointingly being rewarded for their stupidity rather than eaten alive like you'll eventually hope.I should have stopped watching after the opening scene when it was shown the main character was a swimmer. That cliche **** was the first warning sign but no, I ignored it and continued.Also, **** these favourable critic reviews. Wankers."
    },
    {
      "rating": "8",
      "text": "Español: Sin duda una pelicula muy completa, no es la mejor en suspenso y terror, pero supera las espectativas. La trama es sencilla y envuelve muy bien. Los personajes cumplen bien sus papeles. No se necesita tener grandes efectos con lo peligroso que son los cocodrilos. Sin duda es palomera y recomendada."
    },
    {
      "rating": "3",
      "text": "I think that it's great that this movie dives straight into the action within the first 20 minutes. What I don't think is great is that the CGI is terrible. It was constantly unrealistic looking and couldn't really scare me even though I have a great fear of alligators. The jump scares in this movie are horrendous. I went to go see this movie with my friends who are all terrified by horror movies and they didn't get scared once or ever jump at the jump scares. We were laughing more than we were in fear. The characters also are some of the dumbest characters in horror history of all time. They're constantly doing the last thing you would ever do in a horror movie. I get that's the trope of the horror genre but if they were a bit smart I think it would've added to the fear factor knowing that even though they were smart the alligators could outsmart them. Finally, the plot points and what happens during the movie is really dumb. Everything that could go wrong happens, nothing ever works for the characters. Couple that with inconsistent moments in the movie like, \"The alligators hunt by splashes in the water\". While earlier in the movie the characters weren't splashing and the alligators hunted them anyways. This was just a genuinely bad horror movie that isn't scary, looks terrible and is very inconsistent."
    },
    {
      "rating": "4",
      "text": "[ENGLISH]Bad. It is a surreal movie at all times.Packed with absurd situations and stupid decisions.On top of it, alligators sometimes crush anything with extreme ease, and other times, they make minor scratches...In my case, I have not felt any kind of emotion. Totally cold in my seat. I could only think of all the absurd situations that were constantly happening...As for the technical section and interpretations, they are fine, without highlighting anything...I do not recommend it.[ESPAÑOL]Mala. Es una película surrealista en todo momento. Repleta de situaciones absurdas y decisiones estúpidas.Encima, los caimanes a veces machacan cualquier cosa con extrema facilidad, y otras veces, hacen rasguños sin importancia...En mi caso, no he sentido ningún tipo de emoción. Totalmente, frío en mi asiento. Sólo podía pensar en todas las situaciones absurdas que ocurrían constantemente...En cuanto al apartado técnico e interpretaciones, están bien, sin destacar en nada...No la recomiendo."
    },
    {
      "rating": "1",
      "text": "Simply put, that girl is arrogant and stupid! The alligator is unbelievably slow. They both are so emotional whilst knowing they are running out of time . Hell, she just text without a care for help instead of seeking protection first when the alligator is so close besides her. So frustrating to watch."
    },
    {
      "rating": "8",
      "text": "A way better movie than the reviews would suggest. I think reviewers saw hurricane and gator and thought it's like Sharknado and I here to say that they were wrong. This movie is more like the shallows or Jaws in the suppense it brings. Kaya Scolderario is amazing in the lead role, I'm impressed."
    },
    {
      "rating": "4",
      "text": "To keep it simple  It's **** stupid all the situations that they end up in could've been avoided, it's like they wrote the script in a way so the characters would get in a bad situation so we could see them overcome it, it's just  **** dumb to be frank however the CGI is actually OK"
    },
    {
      "rating": "7",
      "text": "This is quite a thrill ride. It gets right into the action, and it's wall-to-wall WILD to the very end. Barry Pepper is really good as the dad, and Kaya Scodelario is incredible in the lead role. It's a genre flick, and if you're into this sort of thing, you'll dig the alligator quandary for about 80 minutes."
    },
    {
      "rating": "7",
      "text": "It's a little fun fast movie with some good jump scares here and there. Didn't know alligators could be this scary. The movie is short which is good and the actors did a pretty good job. If you're looking for something fun and scary to watch, Crawl might please you."
    },
    {
      "rating": "10",
      "text": "This isn't a very memorable film although it is thrilling and we'll made. Once the conflict begins you are on the edge of your seat with worry for the protagonists it is when they waste screen time with unnecessary dialogue that have nothing to do with the dangers at hand the movie appears campy.I did enjoy the performances of the small cast and of course the gators. It's a pretty fun filled movie so give it a shot."
    },
    {
      "rating": "6",
      "text": "You’ve heard of a Sharknado, now get ready for a Hurrigator! This movie was stupid. Why did the critics like this? It’s a movie about killer CGI alligators! Doesn’t seem like the kind of movie that would get high critical praise, but here we are. What did I think of it? While this movie is very stupid with some very cheesy and unrealistic moments and a ton of stuff that doesn’t make sense, I enjoyed it. Much like Brightburn, this movie has a big director attached to it as a producer, Sam Raimi. This movie does feel kind of Evil Dead-ish, it’s about people in an isolated location with a creepy basement trying to survive, but it’s not nearly as good. Honestly, I really don’t have much to say about this movie. This movie doesn’t overstay its welcome and it succeeds at precisely what it sets out to do, just be entertaining. It doesn’t really try to be anything more. I can’t really fault the movie for that. As for my recommendation, does a killer alligator movie sound appealing to you? If yes, give it a watch. It’s really short. It’s under 90 minutes. You don’t have much to lose. Just turn off your brain and have fun. If not, you are not going to enjoy this movie."
    },
    {
      "rating": "7",
      "text": "Tight, tense, and chock-full of thrills, \"Crawl\" represents the best that thrillers with this running time, budget, and concept can be. It's entertaining and fun without broaching upon the realm of disposability, emotional without it taking itself too seriously, and smart enough without any open attempts to try and reinvent the wheel. Throw in a terrific performance from Barry Pepper and some terrific visuals from director Alexandre Aja and you're left with an incredibly solid thriller of modest, yet successful proportions."
    },
    {
      "rating": "8",
      "text": "Much more exciting than I figured it would be. The lead actress is magnetic (where have I seen here before??). The main problem with it is that all the action takes place in essentially the same spot, and the \"supporting characters\", such as they are, are too summarily dismissed. But I probably grabbed my face 10 times in this sucker - which is a great sign for a summer popcorn thriller."
    },
    {
      "rating": "5",
      "text": "Bananas film with some good visuals and entertainment but also dumb characters and situations."
    },
    {
      "rating": "2",
      "text": "The cast does a solid job but this was a dud for me. The CG stuck out like a sore thumb, the plot is far from original and everything from the troubled relationships to the ending was painfully cliche. Crawl is everything we have seen dozens of times before and offers nothing unique to separate itself from everyone else."
    },
    {
      "rating": "7",
      "text": "Good summer popcorn flick. Had a lot of genuine \"jump out of your seat\" scares. Not too gruesome. If you like creature horror, definitely go see this. The alligators were not \"good boys\", to use current doggo language."
    },
    {
      "rating": "7",
      "text": "\"Crawl\" delivers exactly what is expected of it; an entertaining single-location 'gator chompfest that is gory, tense, scary, and concise."
    },
    {
      "rating": "5",
      "text": "If there’s anything worse than crawling around a filthy, rat invested basement during a category 5 hurricane it’s crawling around a filthy, rat invested basement full of hungry alligators during a category 5 hurricane.Haley (Kaya Scodelario) tries to rescue her father (Barry Pepper) during a devastating hurricane but the two become trapped in a flooded basement full of alligators. I didn’t exactly expect a whole lot from Crawl and you shouldn’t either, as long as it’s entertaining then it’s a job well done and what more can you ask? We’re never going to get another Jaws standard movie so go in with low expectations, try not to pay too much attention to the script and I promise you won’t be disappointed.Crawl delivers on the one thing that matters, it won’t bore you and it’s not trying to be anything more than an average thriller. This film wastes absolutely no time getting started and gets straight to the violent chomping. It lays on the tension and keeps the frights coming and coming. I like a good monster movie I mean who doesn’t and Crawl is your typical entertaining thriller you can enjoy and then immediately forget once you leave the cinema. These movies always find their audience and normally do well at the box office. Two actors I’ve never heard of and some CGI alligators won’t break the bank so don’t be shocked if we get a Crawl 2 in a couple of years. It’s a hell of a lot better than The Meg but doesn’t come close to being anywhere near Jaws. Recommended for those of you who enjoyed Lake Placid or The Shallows."
    },
    {
      "rating": "10",
      "text": "Un brillante y enervante thriller que de seguro te tendrá en todo momento al borde de la butaca.Un padre y su hija se verán atrapados en el sótano de su propia casa en medio de una feroz tormenta en la cual una manada de cocodrilos se interpondrá entre ellos.Ya es sin duda una de mis favoritas del año, va directo al grano y no escatima en entregar al público varias escenas grotescas y viscerales que en lo personal me hicieron poner una contundente expresión de desagrado y en una llegué a taparme los ojos, esos cocodrilos no se andan con cuentos y destrozan sin piedad todo lo que tienen en su camino, de ritmo rápido y conciso, personajes con poca profundidad, pero con un sentido de supervivencia admirable y un final que si bien genera alivio, desentona un poco con el resto de la película, en fin sólo son pequeños detalles, me gustó muchísimo y de verdad la recomiendo para pasar un buen rato"
    },
    {
      "rating": "8",
      "text": "Extremely fun, fast paced horror action film. The end leaves a little to be desired but the journey to it makes it worth it"
    },
    {
      "rating": "5",
      "text": "Crawl is surprisingly a decent monster movie. Here are the negatives. The visual effects suck. The alligators look like they came out of a Playstation 2 game and it is kinda distracting. Barry Pepper’s acting was really inconsistent. At the beginning of the film, he wasn’t trying at all and his acting was pretty bad but as the film progressed, it did get better. Towards the end of the film, some of the action scenes start to get repetitive. The main character will get out of a fight with an alligator into another fight with an alligator. Another issue would be that some of the characters kinda walk off major injuries. One of the characters has a broken leg but seems to walk it off later on. My main issue is that the characters make some pretty dumb decisions. They are multiple moments where the characters could make an escape but they don’t. One such scene is when one of the characters finds a shovel and instead of using it to knock out a weak wall, they decide to attract the attention of the alligators. That problem does take away from the experience of the film a little bit. Here are the positives. Kaya Scodelario does a great job as the main character. You feel for her and what she is trying to do, which is save her Dad. She does a great job at finding different and creative ways to fight off the alligators. The production design for this film is really good. The sets are pretty cool. The basement set makes you feel claustrophobic while the water fills in. The film knows how to build tension really well. The film always present this sense of danger throughout the entire scene until the last act. The beginning scene with the gators is incredibly tense. They set up the fact that the gator is in the basement and you just have to wait till they reveal it to the characters. The film is incredibly gory also. You do see people’s bones sticking out of their body and you do see a gator rip a guys head off and it’s incredibly intense to watch. They also make the smart decision to not use music in these tense scenes so that it feels real. The soundtrack is generic but it does have a couple good scores in there. The cinematography is decent for what the film is going for and the tone and pacing are consistent. Overall, Crawl is a decent monster movie with a good protagonist and some great set design but is held back by dumb decisions and crappy visual effects. I give Crawl a 5/10."
    },
    {
      "rating": "8",
      "text": "Alligators petrify me so I knew I was going to be scaredand boy does this movie have the jump scares a bit more than jaws. But the plot is semi ridiculous and lackluster in its exposition. As far as techs like sound design, editing and visuals go it’s the best I’ve seen so far this year.  Crawl is impossible to not get scared in. Alexandre Aja is right now someone who I admire but I do know alligators are fearful creatures. There scare me more than criminals because they’ve been here on earth longer than us. Accuracy is what counts with creature thrillers and I think they did a good job at the prop making department. Applause"
    },
    {
      "rating": "8",
      "text": "Crawl delivered exactly what I wanted from a summer genre movie. Alexandre Aja is a master at delivering tight, cohesive creature feature thrills and he is at the top of his game here, aided by focused performances by Barry Pepper and Kaya Scodelario. Kudos to the special visual effects department- they bring the gators to life with chilling accuracy. I love to be scared and this movie gave me the kind of thrills that are sadly missing from most of the cookie cutter cardboard sequels that pass for cinema these days. Not every film has to be a classic - Crawl knows exactly what it wants to be and it nails it. If you are looking for a scary good time - see this film!"
    },
    {
      "rating": "10",
      "text": "What a film. Possibly the film of the year. So much better than that damp rag of a film called the Joker. I haven't seen a movie like this since Transformers: Dark of the Moon. Bravo!"
    },
    {
      "rating": "5",
      "text": "I would describe Crawl as a B-Movie with a higher budget.The Good: The special effects and CGI look really good (besides the aligators at times). The makeup looks good as well. The best part of the movie was when one of the aligators threw the human body to another gator. Also, the theme song feels very claustrophobic and anxiety giving which is perfect for this movie.The Bad: This movie is predictable and boring. It lacks a plot, I mean there is some here but it really does have a B-Movie feel. As I said the special effects look really good but there aren't any in the crawl-space in which the movie takes place.The Ugly: Our main character is very inconsistent. She is shown as weak but then shown as a badass but then back to weak. Also, she has the one of the absolute worst catchphrase in cinematic history \"Apex Predator, All Day!\"This movie is mediocre at best and I cannot recommend it. Trust me you've seen it before."
    },
    {
      "rating": "8",
      "text": "**** alligators, me and my homies hate alligators. also kaya scodelario kicks ass in this movie"
    },
    {
      "rating": "6",
      "text": "crawl is a highly entertaining movie, one worth a few scream. although highly implausible but much much better than all those B grade shark movies. it's a no brainer but just one to watch with chips and beer. the CGI crocs were actually quite real and properly executed. the gore is enough to churn stomach as anything could hurt badly, not only the crocs. ( remember ímpossible'the movie about tsunami in indonesia)"
    },
    {
      "rating": "6",
      "text": "It's a thrill-a-minute flick that certainly passes the time, but the cheesy father-daughter dynamic, hearkening back to the daughter's early days on the swim team, is a bit much. And unlike most genre films of this type, it layers too many elements into the mix to be realistic - hurricane, flood, alligators, levee breaking, etc. And I have to say, after all that, \"See ya Later Alligator\" during the credits just doesn't fit at all. If you're up for some easy thrills and some solid alligator-generated gore, you'll have a good time. Just don't expect anything with the depth of Jaws, Piranha or other predator flicks in its lane."
    },
    {
      "rating": "6",
      "text": "Usually this kind of movies with over the top concepts in combination of animals trying to eat people alive seem to fall under a sort of very bad category where it is blatantly obvious that it is just cash grab.  Most of them are done with very minimal budgets and very poor/stupid storytelling and for the most part they don't even come out to the big screen but go straight to DVDs --So it was kind of interesting to see a project that has some of those over the top concepts, like a hurricane that leads a bunch of extremely aggressive alligators into a house where two people are trapped, and see it done with actual decent effects and very decent performances. If anything the fact that it came to theaters already had something to say about it, and I must say that for what it is, it is quite entertaining and suspenseful. It is still a bit silly, considering why the two main characters got trapped there in the first place, but their father/daughter relationship is still believable and it carries the movie way up till its end--which comes quite fast I may say because this is a very short movie. It ends a bit unsatisfactorily, but for what it is worth it was still a decent watch."
    },
    {
      "rating": "5",
      "text": "It's just amazing to me how a movie like this can be so boring. The refusal of mainstream horror movies these days to blend horror and comedy is baffling to me. It's like audiences only get horror if it's \"scary\" or making fun of horror cliches because that's \"smart\" to laugh at. There's no in-between. Everything is either a big broad obvious comedy or so self-serious it has no room to breathe -- this is the latter."
    },
    {
      "rating": "8",
      "text": "Given his proficiency with gore Alexandre Aja could have gone the B-movie route with Crawl and still delivered a good time for the people who have enjoyed his previous works. Instead he came out of his box and made a genuinely respectable thriller. The first sign this isn't going to be another Piranha 3D comes from how he takes time to make the protagonist feel like a real, layered human being before putting her through a watery and scaly hell. We learn about her goals, life, and even her personal and familial struggles. All of which define who she is and her behavior for the audience in a believable manner. Personally, I didn't quite care much about this stuff as I was really only here to see people get eaten, but those a little more demanding of their movies will likely appreciate that this isn't straight Lake Placid style schlock.Aja keeps things lean and mean with a brisk 87 minute running-time. A welcome change in pace from the 2+ hour mega-blockbusters that make up the majority of cinema today. Once the first gator appears it's a non-stop series of ever-escalating, yet grounded thrills. The majority of the action takes place in one location and revolves around only a few characters. For all the praise small-scale horror films like this often receive, I've begun to realize how having only a handful of people onscreen can limit the tension in a way. It's hard to get a full sense of danger as we know the main character is going to be mostly fine until maybe the very end of the movie, and the side-characters are usually just there for the body count so they don't get any development. This is a problem Crawl doesn't have as the person who spends the most time beside the protagonist gets just as fleshed out as she does while still only taking on a supporting role. So we end up caring just as much about them as we do her, which keeps the anticipation and dread in each encounter high due to their lack of leading actor protection.Alexandre Aja did everything he could to make Crawl an experience that could be enjoyed by more than just those who typically watch movies about killer reptiles. It's not quite the Jaws of alligator flicks (more like the Don't Breathe), but should succeed at having a wider-reaching appeal than any that have come before it. Plus, in his effort to target more than just a niche audience Aja shows real growth as a director and delivered what's likely his best film to date."
    },
    {
      "rating": "7",
      "text": "Exciting, scary, short fun thriller movie that keeps you entertained and doesn't bore you for a minute. What more could you possibly want from a title like this?"
    },
    {
      "rating": "8",
      "text": "i think it is a good example for a good monster movie with low budget. scodelario is amazing."
    },
    {
      "rating": "8",
      "text": "This is a fun movie to see on a hot summer day. The crocodiles did not have a lot of personality, but the actors and their dog did. I really love a well-plotted, sheer escapist film like this one, and if you need a break, this is an excellent choice. I will probably buy it on DVD for the same reason. Escape is always welcome -- at any time of year."
    },
    {
      "rating": "7",
      "text": "\"Crawl\" is a surprisingly good movie. Supported by impressive CGI effects, a decent cast, well made action sequences and a satisfying ending, you can easily forgive it's many flaws. If you're in the mood for an intense and entertaining horror movie, you could do a lot worse."
    },
    {
      "rating": "3",
      "text": "Thoroughly 'meh' creature featurePredictableRad goreCompletely forgettable in every way"
    },
    {
      "rating": "6",
      "text": "A fine little survival movie with the usual plot but a far more superior cinematography and production setup, Crawl really lets fear of large, mammoth gators crawl under your skin. TN."
    },
    {
      "rating": "5",
      "text": "Crawl is forgettable in my opinion and yes it did have its moments. The suspense wasn't really there for me although the gore was definitely top notch. It was well done and well edited. But it just didn't work for me."
    },
    {
      "rating": "1",
      "text": "This was absolutely wretched. The most derivative film I have seen for years. Was willing it to end for the last 20 mins."
    },
    {
      "rating": "7",
      "text": "First of all, the suspense in this film is top-notch and was used effectively. For a majority of the film, you follow Haley and her dad in a crawl space and if you’ve ever been in one you know it’s a small space and despite the small space a lot of stuff goes down. There is very little to no music throughout the entire film which helps keep the viewer on the edge of their seat the entire time. Neither the characters or the audience know where the gators are at any time and it causes for some scenes where people get scared. The acting in this film done by the two leads was well done. Both Kaya Scodelario and Barry Pepper did fantastic jobs with their characters and made them feel like real-life people that you want to see survive till the end. They seem like an actual father-daughter relationship with the ups and downs that come with it. I also just want to say that Haley is a badass and super resourceful. She isn’t afraid to do anything if it means both she and her father will live. But this is where you need to turn off your brain for the film because some logic isn’t followed. In the film, you can see here getting hurt from the gator but no repercussions. With her dad, you seem him hurt and having a hard time to walk but with her, she just shrugs it off and walks just fine. I’m sorry but yeah no you should be limping and or dead cause both of them would have died from blood loss just saying. Also, in my opinion, this film would have worked better as a short film because at times it felt like it was dragging on because they need to make it a full-length feature film. In the end, Crawl actually isn’t that bad and worth watching at a cheap price. I give Crawl a 7.5/10."
    },
    {
      "rating": "3",
      "text": "Un nanar de plus de la part d’Alexandre Aja, le Français exilé à Hollywood qui démoule de vagues films horrifiques et/ou catastrophés (et catastrophiques) pour ados gavés de pop-corn. On peut regretter qu’au cours de ce film plein d’innondations, l’on ait pas fait appel à ce bons vieux requins, lesquels étaient pourtant partants pour manger un morceau… ou plusieurs (morceaux) !L’on s’est donc rabattu ici sur quelques crocos, ou plus précisément, vu ça se passe en Floride, sur des alligators très retors ! c’est la jolie Kaya Scodelario qui s’y colle et en tant que nageuse émérite, elle fait la course avec les sacs à main. Les effets spéciaux sont bien faits, la réalisation reste toujours de bon aloi… néanmoins, on reste sur sa faim et on trouve l’ensemble à la fois convenu et timide.Tout cela manque en effet de mordant si je puis dire, et le scénar sent un peu trop le gros navet pas frais qui laisse fortement incrédule ; on ne s’ennuie pas, cependant… ou très peu. Mais l’héroïne reste étonnamment habillée pour ce genre de films : même pas un petit débardeur ? ou quelques vêtements déchirés ? non, non, ça pourrait être considéré comme sexiste, on vous dit ! ah je vous jure…"
    },
    {
      "rating": "8",
      "text": "Effective HorrorCrawl is a pretty good horror film to watch whenever it’s rainy outside."
    },
    {
      "rating": "5",
      "text": "Movies should not always be realistic or plausible, that's more than understandable but also in spite of the fact that as a viewer you're looking for a certain type of entertainment you have to know at what moment you draw the line with the absurd; And Crawl is full of absurdities.This film reminds me of ''Don't Breath'' because it appears to me that in the absence of innovation in the genres of horror and suspense, a certain part of the critics are applauding simple plots and praising them as better films than they really are.I will not say that this is a failure because what it offers is enough and will be more than enough for a big part of the audience and that's not bad but it doesn't mean it's a great film either.At the end of the day everything depends on your own taste, it will depend on your own time and your own expectations. Maybe that's how this film will be more rewarding. For my part, there was nothing memorable or extraordinary. It does have certain entertaining elements and also lasts less than 90 minutes so ... well yeah, it's just a regular film."
    },
    {
      "rating": "8",
      "text": "This movie was really scary, creepy, and suspenseful. The visual effects were terrific especially the the alligators and the storm, they were both really real looking. The acting from Kaya Scodelario and Barry Pepper was fantastic. This was a great horror movie."
    },
    {
      "rating": "4",
      "text": "Muy mala la pelicula pero bueno. Tiene partes más o menos interesantes......"
    },
    {
      "rating": "4",
      "text": "It is a money well spent expenditure, for the makers not exactly for the viewers.CrawlAja understands the script better than anyone. As he should. The director Alexandre Aja is aware of the trajectory that leads these characters and us towards the climax. And it is that ammo of his that he uses at the sign of danger. If the film walks a toddler walk, Aja is pulling tricks left and right to not let it fall or fumble. And it doesn't. The film maintains its productive sensible pace as the elements topple one over another, scaring us using the game of numbers. Yes, it is good to see math involved in a commercial horror film. Let's take the basic setting for example.The plot kicks in after the characters gather up in one location. Now, the makers to elevate the fear of our hosts uses the outnumbered logic to corner them. Being aware of the fact that you are to be drowned by a series of creatures, he isn't revealing this information all at once. That discovery is itself scary. And it is not just that measurement but the amount of water that they are fiddled by like a toy or even various insects crawling over them.These tiny aspects of the genre keeps us engaged and entertained. But now this is where the film gets stuck. For beyond the B grade pop cultural theme, there is no other layer to look for. The crux of the emotional punches is the father and daughter relationship that never communicated with me. When something so vital as this fails to hold on to its promises, the drive or the dive that makes these characters keep jumping or sacrificing or saving is like an empty gun fired across the room for attention. Crawl doesn't crawl literally but it surely does crawl metaphorically; I know that's a cheap shot."
    },
    {
      "rating": "3",
      "text": "This is basically a direct-to-DVD film that somehow got a mainstream release AND critical acclaim. I gotta say, it surprised me how bad this film is considering how much buzz it got. It's predictable, it's laughable at times, and it's not particularly fun to watch. I looked at my watch numerous times to see how much time was left."
    }
  ]
}