{"id": 2312, "title": "Crazy Rich Asians", "starring": ["Constance Wu", "Henry Golding"], "runtime": 121, "genre": ["Comedy", "Drama", "Romance"], "description": "An American-born Chinese economics professor accompanies her boyfriend to Singapore for his best friend's wedding, only to get thrust into the lives of Asia's rich and famous.", "releaseYear": "2018", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/1XxL4LJ5WHdrcYcihEZUCgNCpAW.jpg", "categories": {"plot": 6.674418604651163, "acting": 5.6875, "ending": 6.428571428571429, "soundtrack": 5.0, "cinematography": 4.0, "familyFriendly": 6.0, "funny": 6.323529411764706, "action": 5.0}, "reviews": [{"rating": "5", "text": "Fans of the romantic comedy genre may find and build a home within the charms and appeals of \"Crazy Rich Asians.\" I, however, cannot seem to look past the fact that many of those \"charms\" and \"appeals\" are beats and tropes recycled from countless other films with similar premises. It's \"My Big Fat Greek Wedding\" meets \"The Princess Diaries.\" It's \"The Prince & Me\" meets \"Notting Hill.\" It's so many elements from so many other similar films thrown together to little effect. From the \"plainful\" character work, to the mediocre-at-best comedic notes, there's not much for me to chew on in this. Even the importance of the film's casting is undercut by the fact that the movie isn't necessarily saying anything specific about Asian culture at all. In fact, you could insert any ethnic group within the film's title and still convey the same message - that marrying up in class is a difficult thing to do sociologically. A \"Crazy Rich Middle-Easterners\" that takes place in Dubai. A \"Crazy Rich Indians\" that takes place in Delhi. A \"Crazy Rich Latinos\" that takes place in Rio. Any of them could work. Why was \"Get Out\" so effective at what it set out to do? Because it was so specific in what it was trying to say. You cannot feasibly swap out races of characters in that movie without sacrificing the thematic matters at hand (race relations between black and white people in America). And though, again, the casting within this film is an important step forward for Hollywood, I find it hard to believe that it was of that much importance to the people behind it, when the most specific thing we see relative to the Chinese experience is just one scene of characters folding dumplings in between attending Western-friendly parties where they happen to be blasting covers of American pop songs over the loudspeakers. It's not a particularly bad or offensive film at all. It's just simply plain. Very plain. And it doesn't even scrape against the boundaries of the romantic comedy genre in the ways that it should (i.e. in a narrative, character, or thematic way)."}, {"rating": "3", "text": "The screenwriters, actors and actresses played their parts as best as they could when not given authentic direction . Apart from Golding , Keng Hua & Constance , the rest of the film crew hammed up , strutted and pranced and the dialogue was stilted as stage actors could only deliver . In essence , they were caricatures of themselves. Crazy Rich Asians , written by Kwan who left Singapore at ten years of age , is a fiction of his Americanized  imagination and produced to impress a Western audience  who prefer their crass , loud mouth , braggarts of Asian stereotypes confirmed . And they were duly given that ."}, {"rating": "6", "text": "Don't get me wrong: i'm not saying I was disappointed. In the contrary, I was amused by this film. It's just an average romantic comedy. The production and cast are great. I recommend you guys who are rom com lovers to check out this movie. If you just want to have fun (like I did), this movie totally worths it. In this review, I just want to take a closer look at the cultural significance. I'm just having a problem with the unreasonable script and the hype. The Asian/Asian-American background is nothing but a background: I mean, the conflict between old money and new middle class can happen anytime anywhere, right? The funniest moment in this film happens when Rachel Chu claims herself as a poor immigrant \"nobody\" - if a young econ professor at NYU is a nobody then why do we normal people ever bother to live. Besides, I know the movie exaggerates, but you tell me how is it possible for a poor immigrant from China to ever make it to the econ department at NYU. These settings distance the audience from an immigration experience, which should be universal, at least for some American immigrants from East Asia. The presentation of Asian culture also seems suspicious. On the one hand, I appreciate the Asian accent, Chinese lyrics, dumplings, mah-jong, etc., which show respect for Asian culture. Specifically, the warmest part in this movie is when Rachel Chu and Nick Young eat street food after they arrive in Singapore. For me, that part constitutes a most authentic living experience in Singapore, a developed Asian country yet filled with traditional Asian culture. On the other hand, some of the cultural symbols are too emphasized that it becomes creepy. For instance, the dumpling part. I mean, literally no families in Asia would make dumplings in that luxurious an environment. No need to mention the depiction of the kitchen and epiphyllum - the production is trying too hard that it becomes exoticising."}, {"rating": "4", "text": "Went to see this movie because of the good reviews and thought it would be quite funny and entertaining.  Wrong - the reviews seems to be PC - based on a Hollywood movie being made about the Asian culture with actual Asian actors and not based on the merits of the actual movie.  Its a glorification of Richness and Money and Bling though its heroine is supposedly modest and unflashy. It was boring beyond belief formulaic and predictable and most disappointingly the three young women I went to see it with absolutely loved it!!!So that makes me old bitter.twisted and cynical I suppose - still happy to be me tho lol"}, {"rating": "0", "text": "This was one of the worst movies I've ever seen. Shallow and disgusting. Not at all funny."}, {"rating": "3", "text": "Triter than the tritest sitcom, Crazy Rich Asians revels in adoring the material excesses of its super-rich subjects while pretending to mock them. The two leads can’t act, most of the other roles are silly caricatures - with the exception of Gemma Chan, who somehow conveys authenticity in a sea of contrivance. The humor is few and far between. I have no idea why so many critics recommended this forgettable waste."}, {"rating": "5", "text": "Bang average romantic comedy. Feels fresh because it exposes audiences to a different culture but at its core, a formulaic plot, the writing was standard and still had a few laughs. Nothing special but enjoyable nonetheless. A little overhyped perhaps!"}, {"rating": "3", "text": "I bumped my rating up because I am glad that a film with an Asian cast has done so well. I also am a fan of Constance Wu and Awkwafina. This movie, however, made me angry. Not sure why it's called a rom-com when it is neither romantic nor funny. We never got any hint at why the central couple was so meant to be together, except presumably the simple fact that they are both attractive. The movie is visually stunning, for sure, but at the end of the day it just felt like a movie about how great it is  to be filthy stinking rich. Not worth my hard earned money, that's for sure."}, {"rating": "6", "text": "Crazy Rich Asians will grab your attention from the start as it introduces an Asian woman and her family minus her husband checking in at a hotel they had booked only to be told that there wasn't a reservation and that they should seek accommodation in Chinatown by the White hotel staff. This incident stayed on my mind as I watched the movie unfold. Nick Young played by Henry Golding is filthy rich to the point where he can sit in a restaurant in New York with his girlfriend and someone can secretly take a selfie with him in the background and through Social Media, spark a global conversation about his wealth and his mysterious girlfriend. The problem with that is that his girlfriend Rachel Chu played by Constance Wu doesn't know that he is filthy rich. She accompanies him to Singapore to his friend's wedding and then discovers his status. I struggled with this premise. It didn't feel realistic especially as her friends knew instantly who he was. This is a romantic comedy that teenagers will fall in love with and with an All- Asian cast it is a refreshing optimistic hope that Hollywood is expanding its boundaries. The movie is a winner for the country of Singapore which is shown in all its beauty from day-life to nightlife. I had the pleasure of being at Singapore's International Airport in 1985 and it was beautiful then and it is still amazing. There are a lot of Asian jokes that I didn't find funny some of which played with the sound of the names. The actors did a great job although I found little chemistry between Constance Wu and Henry Goulding. Awkwafina as Peik Lin Goh and friend of Rachel was funny and great in her role. The theme of Crazy Rich Asians is about Class and it is interesting to see those who experienced discrimination being in a position to discriminate against others. It also explores the premise of not telling important things to loved ones and seeing the complications it causes when the truth is discovered. It also gives us a look into how the wealth of Singapore live and some insight into how being wealthy measure up to be happy. Material things are portrayed as the key to wealth and happiness in many scenes.I found the script struggled on focus as we are at a friends wedding but the spotlight is thrown on Nick Youngs unknown girlfriend Rachel since he has never brought a girl home in the past and through it all, I feel like I'm watching Nick's wedding. In the end, \"Crazy Rich Asians\" is predictable, but don't read deep into it as I did. Just sit back an enjoy the beauty of Singapore and imagine that you are on a romantic vacation. I give Crazy Rich Asians a C."}, {"rating": "6", "text": "There is a lot to enjoy in Crazy Rich Asians, and the high production value speaks volumes in the presentation of the opulent wealth of the cast. From a screenplay perspective, Crazy Rich Asians sticks to tried and true or cliche Romantic Comedy tropes, and isn't surprising or fresh. However, there are definite chuckles to be had."}, {"rating": "3", "text": "First, I'm a dude and not a rom-com fan so my rating reflects that. This film is a chick flick, an idealized rom-com with asian actors instead of Hollywood B-listers. I only lasted 20 minutes before puking but it was enough to grok it. It also seems very paint-by-the-numbers, plot-predictable. Notwithstanding that observation, it's not bad for what it is, but it's not for everyone. If you're a teen femme then you'll love this, hence the high ratings, but if you're 80% of everyone else then it's a hard skip."}, {"rating": "4", "text": "Apart from the fact that it is an Asian cast, something new and laudable, it is actually a rather dull and predictable 'boy meets girl, family disapproves, boy loses girl then gets her back in time for the happy ending'. Has been done a thousand times on Hallmark channel alone. There are maybe 3 decent laughs and the rest is so 'sincere' and sappy I practically got diabetes. The cast was game,photography beautiful, but the script awful."}, {"rating": "4", "text": "I understand why this became among the summer’s hottest hits, its entertaining, funny story defies the overly White image of Hollywood, and appeals to the deepest desires of everyone who love seeing rich movie characters living an ideal lifestyle. Does that automatically label Crazy Rich Asians as decent? Well, it does keep to a standard no-risk level like that of any romantic comedy released during the summer, although it still got its various charms…The protagonist, Rachel, a first-generation Chinese American, has been named a “banana,” yellow on the outside, White on the inside, with an appearance to match her situation perfectly; her hairstyle resembles a classic US magazine fashion cover, though she being middle class still looks ordinary enough. Her façade works once she travels with her boyfriend, Nick, to Singapore, where everyone she meets has a more sophisticated standard of beauty. That goes as well to her old blonde friend she visits, played by the funniest actress, Awkwafina, who is a pure gold persimmon: yellow inside and out.You feel Rachel’s awkwardness when she meets the world of wealthy living, which helps later as it justifies when her heart gets broken. It comes in a situation for her when everyone is having a wonderful time celebrating the room’s most adorable couple, yet she’s too caught up in her own trouble to pretend she’s happy too. Here, a devastatingly strong #MeToo moment informs you why many, such as her mother, come to America from other countries.I can’t really call it effective in the long run however, because the filmmaking is as bland as every rom-com ever made. Any hint of visual creativity from the cinematography is in a zesty montage of stylish modern text graphics, a creative oversaturated style never done again later. In fact, the montage is unfit for the film’s intentional feel of sophisticated living contrasted against poor living. The experience consequently feels far more American than Asian, especially with how the events play out, when personal pleasure (an American value) is proven to be greater than family (an Asian value- the movie’s words, not mine). No amount of joyless establishing shots relishing in Singapore’s great landmarks can make this film any less American than it clearly is.In fact, the finished product didn’t really need a PG-13 rating, nor should have it aimed for one, because the subject matter would most likely bore teenagers into scrolling through Instagram while still in the theater. An R-rating honestly would’ve resulted in a sincerer telling of the events without the pressure to win over a wide family market. With that pressure present, the script based on Kevin Kwan’s novel presses a hypocritical theme irrelevant to older generations, saying that being young, rich, and beautiful is more important than family. To shut older viewers off even more, anybody over the age of fifty acts either cold, goofy, or one of those two traits one act then another the next.But to be fair, when it comes to portraying the look of rich people in Singapore, the costumes’ grandness comes off very much authentic. Costume designer Mary E. Vogt honors Chinese culture with several clever details coming straight out of Chinese culture: Blue and white is for Chinese funerals, and Red represents fertility! You are guaranteed to keep track easily of everything the characters wear, which helps strengthen the comedy since everyone is so identifiable. I should also comment on the bride’s blooming dress, a true work of craftmanship that along with water glistening the isle she walks across, and artificial fireflies held by the crowd, took my breath away!It’s things like this that tempts me to travel to Singapore, as Jon M. Chu’s direction shows clear love to its tourist destinations, especially with the attention put into crustacean meals and closeup shots on dumpling making! But at the same time, I must remind myself that the food lingered on results from a dreadful editing job, one so bad that it even overlooks when hands change positions between shots! I can only imagine how many meaningful scenes of Rachel meeting Nick’s relatives landed on the cutting room floor for tourist servitude. Worst of all, just when you think the picture will end in a different, mature way from other fantasy-driven romantic comedies, nope! The entire last five minutes suddenly hammers a dumb Hollywood climax, one that could’ve and should’ve been cut to better results.Now listen, you can still celebrate the diversifying of Hollywood, yet there’s something non-race related about this movie I want to make very clear: Unlike what Crazy Rich Asians thinks, you don’t need a fancy dress to be happy, because true joy comes from your loved ones. A wedding involves not cake or decorations but binding together a couple who deeply loves each other. Anything physical lasts one day. A marriage lasts a lifetime."}, {"rating": "6", "text": "It’s a little basic in its execution, and the main couple don’t share the same chemistry as say Emma Stone and Ryan Gosling, but the production design is fantastic and Awkwafina steals every scene she’s in."}, {"rating": "5", "text": "a satisfying closure..Crazy Rich AsiansCrazy Rich Asians is a plot driven romcom that reboots mediocrity with finesse. The so-called under extinction genre, gets a savior this time along with the hyped summer movies category. But all of it is satisfied and coated with commercial aspects to lure the audience in, where within those two hours, there is a genuine thirty minutes of good in it. Brimmed with humor, ancient trading, cheesy shots and one dimensional sketchy characters, it is thoroughly entertaining to the core, despite of the flaws. The morality conflicts in here isn't something new and neither is any sub-plot, but blending it all in and dressing it up with expensive clothes; literally, it offers a safer ride to the audience. The tiny surprising ticks of the feature, is its metaphorical sequences that it stages on screen and even the weaving of it is clearly visible, it is utterly pleasing to experience it on screen. The long stares across a room, over chewing the manipulative emotions and filling in the spaces with one-liners shucks away the intensity and undermines the momentum. The background score and editing may not be up to the mark but the songs are up beating with blinged costume designing and huge production design that is definitely alluring. The adaptation may not be smart but is gripping and able to hold the audience with a satisfactory smile on the face. The feature politically fits somehow considering the sensitive issues, the world is going through, the track touches the appropriate nerve of the audience. Chu's world is sassy, brave and ironical in a way that fiddles with contradictory nature like a pro. Wu and Golding's troubled portrayal is supported well enough by Yeoh and hilarious Awkwafina. A knack for imputing rich tradition, show stealing one-liners and popped up political references are the high points of the feature. Crazy Rich Asians is a satisfying closure to the plethora of summer blunders but on terms of craft, it doesn't change a dime."}, {"rating": "7", "text": "Initially, I’m thinking Crazy Rich Asians is about to be a surprise musical. So, at any point in the film, I’m ready for a burst into song — which doesn’t happen, and I feel like that’s a bit of a spoiler for anyone that might be wanting that sense of anxiety all throughout the film. Crazy Rich Asians is a very upbeat film with sinister moments which greatly assist one of the major themes in the film concerning appearances in the big picture from the minutiae.Throughout the entirety of the film, I find myself focusing heavily on all of the food. I’m listening to the conversation at the table concerning Rachel Chu’s life up until that point, and I’m staring at the Lobster that no one is touching at the top of a towering plate of food. Obviously, food is a very important aspect of many, if not all, cultures. Crazy Rich Asians does implement food as a part of familial tradition and decorates the film with so much tasty looking food. If you’re really into different types of food, watching Crazy Rich Asians may assist your drive to seek more foods or feel like pleasurable-slow-torture (kind of like being in the shower and finding the right temperature for an itch though potentially making oneself susceptible to a burn from the hot water running once one finds full satisfaction from the itch being water-scratched — just me?).Crazy Rich Asians really focuses on families, relationships, reputations, social status, and wealth. Wealth is a huge part of the conversation from the very beginning of the film. It’s in the title of the film. There’s no way to ignore that the film will be dealing with vast amounts of wealth all throughout. There’s even a point in the film when a few of the acting partners downplay actual love because of the reasons behind their relationships — long-term wealth. I think it’s awesome to be a great person and be wealthy. Rich doesn’t mean snob. On another note, relationships costs. Relationships have a greater chance of working when all parties of the relationship may afford time to ensure a functional relationship.Yet — what is greater than wealth, at least seemingly so in the film, is one’s reputation and social status. There’s a very difficult acceptance process of anyone entering Nick’s family especially anyone without reputable status or substantial wealth from a business model which will allow for the family’s status and wealth to increase. Crazy Rich Asians doesn’t ever dismiss wealth as much as a message in the film seems to be saying: love persists over all… every so often (concerning wealthy familial dynamics).There are so many different types of relationships set in the film that are sensible business wise but makes one wonder if any of the partners in the relationship ever just agree like the couple in Lady Chatterley’s Lover on allowing an alternate lover in their relationship. There’s a lot more to relationships than money — but, don’t sleep on cash though, it’s necessary. The film does use the core relationship driving the story to touch base on elements which make a good relationship beyond cash though such as early-good-honest-open communication, mutual respect, food, and fun.Familial relationships are key to the film. Assumptious and controlling are not admirable characteristics to me at all. I didn’t like any bit of the conversation between the women talking about people changing going off to another country. Am I the only one noticing the broken psychology of these women thinking their sons will never like another woman besides them? There’s a very fine line in being a parent and being a selfish person. One’s life experiences and upbringing may really determine whether one is mentally fraught. Nurturing is not always in plain sight. As is clear in the film, as well as a big point of modern conversations concerning social media, the presentation is not always the reality of all happening when the cameras are off and not capturing.Crazy Rich Asians is a decent film which really makes me think of life with a lot of money. Honestly, I’d eat a lot of Lobster. Also, I’d always have a dessert with dinner except on the weekends. I’d probably be married: to be honest, I’m probably not going to propose until after about thirty years of a strong friendship, maybe kids — I mean, what’s the rush? If a couple is in a relationship, they’re in it, right? Speaking of marriage, the final wedding in Crazy Rich Asians is really quaint. Shall I continue discussing facilities and properties? If you’re a great person with awesome unchanging intentions (only susceptible to changing to improve those awesome intentions — in the best ways possible), money is probably all the rest you need to assist in fulfilling the rest of your life.Overall Grade: B-/B"}, {"rating": "9", "text": "Oh boy, does this movie deliver.  It starts out a little \"conventionally\", but man, does it hit the pain points efficiently.  In fact, as I'm thinking back to the film's climax (no spoilers), I'm getting goosebumps.  Kudos to the filmmakers - you've got yourself a winner."}, {"rating": "1", "text": "This movie was so boring, I finally walked out. There was little to no plot. It was all about showing luxurious earrings, airplanes and houses. I totally did not see what all the hype was about."}, {"rating": "7", "text": "This type of love story has been done a thousand times. Yet, it was still a fun romp, with a few laughs and, of course, a few happy tears. \"Crazy Rich Asians\" is something different, while being the same old thing, all at the same time."}, {"rating": "0", "text": "stupid movie. anybody who knows anything about the real Singapore will tell you its garbage. the good looking people mustve collected from all over, most native Singaporeans are not particulary handsome or pretty, the male lead isnt even Singaporean(he's half Brit/Malay). Singapore is like living in a spaceship complete with robotic collectivist hivemind people. everything is pricey and overrated except for the train system. satay and chili crab are nothing special. also why are indians/malay/minorities depicted mostly as servants? this movie makes being filthy rich look boring. a bachelor party in international waters and people are only dancing and eating? where's the drug use and sex?"}, {"rating": "3", "text": "Underwhelming and bland romantic comedy. The filmmakers obsession - nay, veneration - of obscene wealth and weddings that cost $10million+ was just vulgar. Over-entitled, obnoxious rich kids acting like jerks was commonplace and seemed to be just acceptable. The movie glamorised the unreal, and unattainable world of the richest 1%; with an unhealthy fixation on luxury products, glamorous locations and posh British accents. Having said all that the costumes, sets and production values were high and the actors were all fabulous looking, but it all felt empty and immoral."}, {"rating": "3", "text": "This is nothing but just another run-of-the-mill engagement party rom-com. The fact that this is the first all asian cast in a quarter century makes that fact even more egregious. Also, the only gay character is presented as an asian over the top fop, so, so much for breaking down stereotypes. If this movie had an all white cast it would have been panned by the critics.Oh, and let me place my Razzie vote for Henery Golding for the worst performance by a leading man.The more I think about it, the more I hate it."}, {"rating": "10", "text": "Went and saw this movie with my Chinese wife.  While exaggerated for comedic effect, this movie really did capture the typical Asian mindset when it comes to relationships and pleasing the Asian family.  I encountered the same type thing when dating my future wife, even to the point of where my fiance broke it off with me because of her family's pressure. As the movie pointed out, her American indoctrination eventually won out and she came back to me.  Both of us totally empathized with this movie and enjoyed the comedy as well as the exaggerated portrayal of the Chinese culture.  Really fun movie with a great ending."}, {"rating": "6", "text": "I was really looking forward to this movie.  The movie is ok but nothing special.  The acting is solid but the story seems too formulaic and trite."}, {"rating": "1", "text": "People are fawning over a hyped up drama, whose plot is a simplistic afternoon Cantonese or Korean soap opera, that doesn't represent the real Singaporean culture. For those who know TVB, you know what I mean.Also: Minus points for only showing Chinese faces in Singapore and where minorities (Malay and Tamils) only play servant roles. So this is the new Hollywood reverting to its worst impulses: Chinese are the new masters and everyone else is an Uncle Tom, sorry an Uncle Tong?"}, {"rating": "9", "text": "An outstanding film - with an excellent mix of love story, humor, deceit, family issues, and more.  Awkwafina is great in her smallish role (she doesn't play the humor too \"big\" like I feared she might), but I was pleasantly surprised to see the always amazing Gemma Chan (\"Humans\") playing the role of Astrid. Her elegance and dignity is perfect for this particular role. And Michelle Yeoh is towering as the matriarch.  A great late summer quality surprise."}, {"rating": "8", "text": "There is so much beauty and information in this romantic comedy and family drama. The costumes and scenery were stunning.I received an education on the culture of Singapore,that made each shot more meaningful. Representation is important. The fact that there aren't more films like this is astounding. There were things about it that were clearly tourism marketing for Singapore. What was happily missing was any sense that they were commodifying contemporary East Asian culture. The romance of it all, is so needed right now. The love stories (bf/gf or mother/son) overshadow the glamour and movie magic. This movie is loaded with movie stars that deliver. I look forward to watching this movie in 10,15, 20 years."}, {"rating": "7", "text": "This film is delightful; it is filled with beauty.  It is absolutely fantastic that the director, writer of the original book and cast are all Asian or Asian American.  It is romantic and sweet.  Some of the characters are a bit too broadly written or acted, and that prevents the movie from being great.  But it is very good nonetheless.  There are laughs, tears, courage and redemption.  I hope this ushers in more inclusivity in major studio films."}, {"rating": "7", "text": "This is a fun movie.  Good characters and acting.  It drags a little bit in the middle but it's fine.  It's funny in the right places.  I liked the cinematography."}, {"rating": "9", "text": "Never a dull moment.  The leads are enchanting.  The cast is star-studded (if you have paid attention to Asian actors and actresses over the years).  A fun romp with a good message.  My only issue is with the way it **** wealth.  Thankfully, the female protagonist is not drawn to that flame.  She is accomplished, self-assured, and genuine.  You will root for her because she is worth rooting for.  You will leave the theater feeling uplifted.  Kudos for that."}, {"rating": "8", "text": "Ok, so I liked this movie and was as expected.  Cute romantic comedy. The sidekick friend did a great job.I was specifically excited to see a movie with a largely Asian cast. It is nice to see some diversity out there.Beautiful setting, Makes me want to visit Singapore. They could have made some of the supporting characters a little more well-rounded, but I guess that it why they are supporting characters... Overall good for the whole family."}, {"rating": "10", "text": "What a lovely film. I especially loved the Astrid character. What class and grace.  In general, while the movie is mostly light and often funny, it has 2 or 3 powerhouse dramatic moments.  The Mahjohng sequence?  Floored me.  It's just a wonderful collection of scenes woven together with skill. This is what happens when you have good writing.  It BURIES most every other Rom Com to come out in the last 4 or 5 years."}, {"rating": "7", "text": "It's a perfect timing for a feel-good film. It's not funny enough but it's surprise element is a must-see. Watch it."}, {"rating": "9", "text": "A solid movie with a lot of laughs and tears. The cast shines equally well in dramatic and comedic scenes."}, {"rating": "10", "text": "Fantastic way to finish out the summer movie season. An entertaining rom com with engaging characters, opulent backdrops and some extremely poignant moments. Pleasure to watch from start to finish and hope a sequel is in the making!"}, {"rating": "10", "text": "Highly recommend this movie. It's refreshing and hilarious. Even if you're not into rom-coms you should still watch this in theaters."}, {"rating": "9", "text": "Funny, charming, and relatable. Characters have clear Asian (both westernized American and Singaporean/Chinese) culture and traits, while not pushing an objective or playing the race angle. Must watch."}, {"rating": "8", "text": "“Crazy Rich Asians” is a delightful film directed by Jon M. Chu with a screenplay co-written by Adele Kim and Pete Chiarelli based on the novel by Kevin Kwan. This is the first all Asian film since ‘The Joy Luck Club” which was shown some 25 years ago. Hopefully, it will not be the last. This a universally appealing piece of film making where, by chance, the participants are of Asian descent but all of us, Asian and non –Asian alike, can identify with the problems, circumstances and situations that befall the main characters in the film. True, it has a formula-style boy/girl/family plot but, because of the fine acting, editing and directing, the audience is able to just sit back with ease and enjoy how the story unfolds. Also, for those who have never been to or seen Singapore, the film offers an opportunity to view this exotic place that, in some instances, makes Dubai look like a shanty town. I give the film an 8 and offer it as a very pleasant way to spend 2 hours watching characters engaged in a fun-filled romantic tale."}, {"rating": "8", "text": "I usually hate romcoms because, to be blunt, they're usually boring fluff for the woman you're dating. In this case, I was pleasantly surprised to find that this film is just as funny as it is dramatic and heart-wrenching. Whenever one of these, \"typically mainstream\" films get made, I always want them to be unafraid in grounding the film in dramatic realism. By this, I mean the ground rules are set, the characters acknowledge that they're not the center of the universe, and there's actually some relatable content. Crazy Rich Asians has all of that, and all around it's just a great film. Very funny, but also very well written and acted."}, {"rating": "8", "text": "A somewhat offbeat yet still traditional love story about a couple who meet in New York City, this is a kind of modern-day Asian Romeo and Juliet. Rachel Chu (played by Constance Wu) is a hard-working Chinese American, whose single mom put her through school and watched her daughter graduate with a PhD in Economics and then go on to become the youngest economics professor at NYU. This plot may also qualify as the Asian version of Guess Who’s Coming to Dinner, because Rachel is unacceptably poor (that is to say, middle class) and inappropriate for the family of her intended, Nick Young (Henry Golding). He is the heir apparent to the multibillionaire real estate empire built by his Singaporian parents and grandparents. Rachel is blissfully unaware that Nick is the “Prince William  of Singapore” (more like the Donald Trump, Jr. of Singapore) because in New York City, he acts normal and likes to play basketball at a sweaty, grimy YMCA. Due to return home to inherit his family’s dynasty, the prodigal son shocked his family the year before by deciding to spend another year in New York with Rachel. As the film opens, he tells Rachel over a deli platter followed by dessert that he wants her to come home with him and attend the wedding of a family member. It will also be an opportunity for Nick to unveil his new love to his family.The most prodigious obstacle to the match is Nick’s mother, Eleanor (Michelle Yeoh) who is bound by tradition, culture, and family loyalty. Eleanor Young, now separated from her husband, is cold and arrogant. She is, like all the billionaires of Singapore, mired in the lifestyle of the outrageously rich and surrounded by senseless luxury. She is preoccupied with materialism and social status, notwithstanding that she started out in life as an Oxford law student. She has almost lost her soul in this insipid world; however, her love of family, country, and culture will prove to be her only deliverance.The charm of the plot is the innocence of Rachel, who is down-to-earth, humorous, and spontaneous. Underneath her naive and fun-loving exterior, she is an intellectual Wonder Woman, who can, if provoked, sustain a game of wits based on lifelong discipline, direction, and academic training. Rachel has a hidden strength, and she has a secret weapon. She has a PhD, which she wields like a magic lasso. Billions of dollars cannot buy Rachel’s level of intellectuality. Hollywood has a long history of indicating intelligence in a woman by giving her a pair of glasses. Rachel doesn’t have glasses, but she has x-ray vision. She can see through the superficiality of ostentatious riches. A kind of Chinese Cinderella, at the end of the story, she is the only woman whose delicate foot fits into the glass slipper, and she is the true princess who will live happily ever after—in between publications, academic conferences, and teaching classes on game theory."}, {"rating": "8", "text": "Entertaining romantic comedy also has a very deep understanding of Chinese culture and its related delights and problems. The casts are absolutely great, and it proves to be one of the summer's biggest surprise hit. If you are an Asian, who is Western educated, returning to your 'hometown', you will feel a deep affection for this flick."}, {"rating": "7", "text": "Would you like to go to, or even better, have a ‘to die for’ wedding? Would you like to see a romance that is romantic and might even bring a tear or two to your eyes? Would you like to see food made and served that might even have you salivating even though you may not be familiar with all you are seeing? How about getting introduced to a new, hunky, movie leading man in his feature debut coupled up with a beautiful woman who has made a name in television? How about seeing luxury that you may never see even if you are part of the 1%? All this is offered, in the first Asian ensemble in a contemporary setting since 25 years ago, in “Crazy Rich Asians”! Oh yes, how about seeing a really wicked stepmother?Constance Wu, who you may know as the mother in “Fresh off the Boat” on television, plays Rachel, a professor of economics and Henry Golden, her boyfriend, is a New York professor who tells her that his family is comfortable. He wants her to meet his family and he uses the fact that his best friend Chris Pang, who gives Golden some competition in the looks and charisma department, is marrying Sonoya Mizuno, with Pang wanting Golden to be his best man.This is NOT a spoiler! What Henry calls comfortable is probably more than most of the audience’s wildest dreams and his family don’t hesitate to show off what they have. Hey, somebody doesn’t like the way they are being treated in a hotel just make a telephone call and buy the hotel!“Crazy Rich Asians” is being sold as a romantic comedy but there isn’t much of the latter that hasn’t been seen before. There is the wild, best friend of the leading lady, played by Awkwafino, who is seen in almost every romantic comedy played by an all American cast just as we have the gay poor relative of the family but very close to all the women played by Nico Santos and let’s not forget the obnoxious family member, Jimmy O. Yang, who takes, or tries to take, over everything.The romantic story between Wu and Golden is, more or less, another Cinderella as she was raised by a working-class single mother, Tan Kheng Hua, who ran to New York to get away from an abusive husband and he, of course, is the handsome Prince. His mother, Michelle Yeoh, who believes family comes first and that Wu is not right for her son or family. There is, in a way, a fairy grandmother, Lisa Lu, and forget the glass slipper as what you will see of opulence makes any kind of slipper needless.The core of “Crazy Rich Asians” is the romance and it delivers beautifully while a secondary romance is unnecessary though, obviously, put in for a good reason. For a comedy, you won’t hear many laughs but that is mainly because very little of it is original.“Crazy Rich Asians” is certainly worth seeing for the leads, many of the supporting players with Michelle Yeoh outstanding as one of the latter group. It is also a chance to see Singapore in its entire splendor not to mention how wealth is treated there as compared to the western world.Oh yes, that movie 25 years ago was “The Joy Luck Club” and 25 years is too long a time between that and “Crazy Rich Asians”, hopefully, the next will be a lot sooner!"}, {"rating": "7", "text": "\"Crazy Rich Asians\" is a good rom-com movie about a NYU economics professor who goes to Singapore to meet her boyfriend's family, and- as the title suggests- they turn out to be extravagantly rich. Now the story doesn't put forward anything new or widely creative in the rom-com genre: our two main characters are in love, they are living it up, some ups and downs occur, come the climax and the eventual short-lived break-up, to the final sequence of apologies and confessions of true love. However, the whole project felt more about the style than about the story and the events: the esthetics in this film are astonishing, the picture and the representation of Singapore is just breath-taking, all building up to the esthetics-climax (rather than the events climax, once again), which is the absolutely magnificent wedding taking place in the second half. The performances from the whole cast are pretty good as well.\"Crazy Rich Asians\" may not be the rom-com movie of the year, story-wise, but it is undoubtedly a timeless, stylish piece of eye-candy."}, {"rating": "7", "text": "Crazy Rich Asians is a pleasant summer film with a few slow sections around the middle. The show I saw was full of women, and certainly the story was made to please them, but I guess a man who is forced to go could enjoy the spectacular views of Singapore and the lavish sets. The story is pure romance with impossibly pretty women and handsome men. Two of the people with the funniest lines were suspiciously gay. What made this movie interesting (and different) was the Asian setting and the wonderful Asian cast."}, {"rating": "7", "text": "They are crazy, rich and asian, the title delivers. Though at times the film is quite sappy and over-the-top, I am so glad to see more diversity come out of Hollywood. The storytelling is easy and the cast quite good."}, {"rating": "7", "text": "\"Crazy Rich Asians\" is a crazy good time at the cinema with great visuals, an amusing tone, and a story that is relatable for us Asians."}, {"rating": "8", "text": "Though slightly overlong and rich in cliches (some might even say stereotypes), this endearing offering sufficiently entertains and charms with its many humorous and touching moments. While this is far from groundbreaking cinema, the film nevertheless provides ample laughs and heart-tugging sequences that leave viewers pleasantly satisfied. It's also heartening to see a film provide an adequate showcase for an underserved and vastly underrepresented cinematic constituency. Enjoy this one for what it has to offer; just don't expect it to go down in the annals of filmmaking."}, {"rating": "10", "text": "I went to this film not thinking much. The title was a bit of a turn off for me. I was so surprised how much I liked this film. The casting is amazing. There are characters who normally I would think were overly corny, but Jon Chu somehow makes them work. From the opening of this film we are entertained as the Young family is turned away from a hotel due to their race even though they already have a reservation. Throughout this movie you never see the actual money being made but rather there is a male figure who seems to be always busy who provides it.  To go along with that the sets in this movie are ridiculous. You really see the idea of an extremely extravagant lifestyle. Maybe part of the reason I like this movie is because I come from a wealthy family and am dating a girl like Rachel Chu comes from an immigrant family. Maybe its because I identify with Nick Young in his quest to get with someone out of his circle of what he has been living with. Whatever the reason is I am a big fan of this film. Everything really goes right for this movie. I really am impressed."}, {"rating": "8", "text": "Crazy Rich Asians is funny, heartwarming and equally heartbreaking. It had the potential to go so very wrong, but turned out to be one of the most entertaining and powerful romantic comedies of the decade as well as one of the best tourist advertisements for Singapore ever made."}, {"rating": "8", "text": "Filme muito bom, simples basico nada de muito diferente que voce nao tenha visto mas ele tem o toque asiatico e suas belezas (que eu aprecio muito) como eles podem ser tão ricos?"}], "recommendations": ["the_big_sick", "captain_fantastic", "the_best_exotic_marigold_hotel", "the_princess_diaries", "young_adult", "ingrid_goes_west", "the_help", "green_book", "home_again", "moonrise_kingdom", "the_age_of_adaline", "moxie", "endless_love", "lady_bird", "the_intern", "me_before_you", "charm_city_kings", "afternoon_delight", "about_time", "20th_century_women", "the_witches_of_eastwick", "freedom_writers", "the_perks_of_being_a_wallflower", "fighting_with_my_family", "the_dreamers"]}