{
  "id": 883,
  "title": "Creed",
  "starring": [
    "Michael B. Jordan",
    "Sylvester Stallone"
  ],
  "runtime": 133,
  "genre": [
    "Drama"
  ],
  "description": "The former World Heavyweight Champion Rocky Balboa serves as a trainer and mentor to Adonis Johnson, the son of his late friend and former rival Apollo Creed.",
  "releaseYear": "2015",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/1BfTsk5VWuw8FCocAhCyqnRbEzq.jpg",
  "categories": {
    "plot": 8.58,
    "acting": 8.575342465753424,
    "ending": 7.888888888888889,
    "soundtrack": 7.833333333333333,
    "cinematography": 8.333333333333334,
    "familyFriendly": 6.0,
    "funny": 9.0,
    "action": 8.39622641509434
  },
  "reviews": [
    {
      "rating": "10",
      "text": "i have been a long time rocky fan and this movie was a outstanding movie a 10 hands down. Creed is a fantastic film on its own, but it is an amazing tribute to the legendary sports film that came before it in Rocky (and, in some ways, its sequels). Michael B Jordan is fantastic, the fighting/training scenes are intense, and,as a whole, the film is extremely well-shot. Overall, this is a superb film that both fans of the Rocky franchise and newcomers can appreciate."
    },
    {
      "rating": "9",
      "text": "Creed is a fantastic film on its own, but it is an amazing tribute to the legendary sports film that came before it in Rocky (and, in some ways, its sequels). Michael B Jordan is fantastic, the fighting/training scenes are intense, and,as a whole, the film is extremely well-shot. Overall, this is a superb film that both fans of the Rocky franchise and newcomers can appreciate."
    },
    {
      "rating": "8",
      "text": "Though an imperfect film, Creed is the perfect boxing film. If I were to envision the best possible product of the majesty, mystique, and intensity, brought to the table by boxing, Creed captured it all. From the brilliant walk-out music (the great soundtrack in general), the training, and absolutely stunning fight choreography and cinematography, Creed has it all. The non-boxing parts can feel a bit disjointed at times and then of course it has classic Rocky cheese, but it does enough to honor the original, while going out on its own. Ultimately, the fight for respect faced by Adonis \"Donnie\" Creed is a similar one faced by the film as a whole. Fortunately, it is entirely successful in forging its own legacy thanks to the fantastic direction from Ryan Coogler (I would be hard pressed to name a better new director right now) and phenomenal performances from Michael B. Jordan and Sylvester Stallone. Overall, Creed is a great film on its own, but an absolutely phenomenal boxing film."
    },
    {
      "rating": "10",
      "text": "Ryan Coogler writes/direcst a love letter to the Rocky series.  The movie is awesome!  The chemistry between Stallone and Jordan is fantastic.  What I love most is how organic/natural the story flows.  From a technical standpoint, I love the shot of the first fight and the score. Stallone should be taking home some hardware this award season for his performance.  I am a frequent moviegoer and this is definitely in my top 5 for the year."
    },
    {
      "rating": "8",
      "text": "It doesn't re-invent the boxing movie or pack too many surprises, but it is nothing but respectful to the beloved \"Rocky\" series and both Stallone and Jordan deliver some powerhouse performances. Jordan straight-up carries the movie for a lot of the running time. The cinematography was superb and the direction and editing on point. Everything gelled. The only things I might have done different are to have given \"Pretty\" Ricky more personality aside from being a trash-talker, and taken a page from \"Southpaw\" and made the fights seem more brutal (not that they don't seem realistic, but that movie took it to a whole other level). I really enjoyed this one and would recommend it to anyone."
    },
    {
      "rating": "9",
      "text": "I have actually never completely seen the previous Rocky films before since it just didn't peak my interest at all. In fact, this one didn't either but it was the best option at the time since Spectre didn't have any seats left. I do not regret it. I admired the film's rhythm, the camera work and editing complementing the rest of the film's elements flawlessly that both probably even outshone them. One particular shot that I loved was the Long Take used during his first professional fight. There are very few films I remember pulling off this shot that has made me feel so emotionally engaged. The characters were raw and genuine, no doubt played exceptionally by the cast, particularly, Jordan and Stallone. Some cliches here and there, but it was subtle and weaved in cleverly. The film was well crafted, intense but unhurried, keeping me immersed the entire time. This is the first of Coogler's work that I've seen and I'm looking forward to watching his previous and future films. Well done."
    },
    {
      "rating": "9",
      "text": "Ryan Coogler’s Creed delivers on everything that a great boxing film should, and represents a full return to form for Rocky. Directed by superstar in the making Ryan Coogler, and starring powerful performances from Michael B. Jordan and Sylvester Stallone the film is amazing. Creed is exhilarating, beautifully acted, while honoring the previous Rocky films lovingly. The film may be a little too familiar at times, but at least approaches it’s overused plot lines with a different take.\rFrom the opening scene the film captures your attention, showing us a glimpse into who this character is “a fighter.” The film remains an exhilarating journey with this character, who is easy to connect with. As the film progresses, Coogler mixes old techniques like the famous Rocky slow motion sequences, with newer (less used) techniques like very intimate fight sequences, where the camera helps the viewer feel like they’re standing in the ring. The film will draw you in from the moment it starts, to the moment it ends.\rOne reason the film is so exhilarating is the terrific acting of Michael B. Jordan, who leads this journey. Once again teaming up with director Ryan Coogler Jordan anchors the film, and in the process creates a relatable, and human main character. On this note, after seeing “Creed” and “Fruitvale Station” I would be willing to make the bold statement that I think Ryan Coogler is on his way to becoming the next Scorsese. All of this being said what may be even more satisfying is seeing Sylvester Stallone return to form as Rocky Balboa.\rSome may criticize the movie for not bringing a lot of original plot lines to the movie, they would be right. However, while not very original the film handles these plot lines from a different perspective. No longer are we watching the nobody rising up against the odds, now we see a man trying to get out of the larger than life shadows of a man he never knew. Those who love the Rocky films recognize the slow motion moments in almost every film, and the iconic way the boxing matches were choreographed. Creed departs from the overuse of slow motion and more adapts the fight choreography of Raging Bull, while still mixing the essence of the Rocky fight scenes.\rThe way Coogler mixes old with new in many different ways helps make the whole film feel like the story it’s telling. Coogler captures the tone of the older Rocky films, while also making a film distinctly different. Michael B. Jordan and Sylvester Stallone deliver, and Creed ends up being exactly what fans hoped it would be. In the end if you have the time go see Creed, it’s a terrific 2 hours to spend."
    },
    {
      "rating": "10",
      "text": "Creed is proof that a beloved franchise can re-surge and still be excellent today, with great acting, a phenomenal script, and some of the best film characters in the whole year. This is truly one of the best movies to come out in 2015."
    },
    {
      "rating": "10",
      "text": "I'm a massive rocky fan and when I went and saw this film last week I was absolutely flabbergasted to find that this was one of the best films I've seen in my entire life the characters were incredibly real and developed to the point where I forgot I was watching a film, the boxing sequences were extremely well crafted and filmed and was very tense.\r10/10"
    },
    {
      "rating": "8",
      "text": "Rocky seven was actually a surprisingly engaging experience, and one which proves that a strong brass section can make anything seem poignant. The performances were great, and the storyline was a refreshing update to the genre that was realtively free from the boxing movie cliches which generally plague these types of films. The pacing was excellent; though long, the film doesn't drag, and the cinematography was tight and considered. I was emotionally invested in the outcomes for the characters, which is really the best measure of success for this genre. If you are a Rocky or sports film fan, this will not disappoint. 7.76/10"
    },
    {
      "rating": "9",
      "text": "Excellent movie! By mixing the old with the new, Creed manages to make one of the most poignant and beautiful commentaries on modern life that I have seen. I highly recommend Creed."
    },
    {
      "rating": "9",
      "text": "Had I not seen \"Fruitvale Station\" I would have thought \"Creed\" would fail. But since I did, I had faith. Turns out \"Creed\" is fantastic. Creed is directed by Ryan Coogler and stars Michael B. Jordan as Adonis Creed, the son of Apollo Creed and Sylvester Stallone as Rocky Balboa. \"Creed\" is a terrific movie. To begin the chemistry between Stallone and Jordan is outstanding. There both witty and it's clear that they both enjoyed creating this film. Furthermore, Coogler fills the film with realism. Sure, there are cliches but what makes this movie stand out is how Coogler uses them. Not to mention there ain't many of them to begin with because Coogler does things differently. This is shown when the main love interest has a hearing problem and will eventually become deaf. It shows how Coogler while trying to make his film similar to the Rocky movies also wants to create something different. Now one of the most impressive parts of this movie is how Coogler shoots the boxing sequences. The best fight is the first fight Adonis fights. Why one may ask? The whole fight is one take. That's right there are no cuts just zooms and lots of movement. It's fantastic because it immerses the viewer in the fight and gets down and dirty as I like to say with the characters. Also, while the second fight is not filmed like this it's interesting enough mostly because there is no clear scene where Creed takes over the fight. The challenger is always fighting back which makes that character feel more human instead of another obstacle. Furthermore, Stallone gives one of his best performances in years. While \"Rocky Balboa\" was a send off for his fighting career this film shows an older broken Rocky who feels as if he has no reason to live. Stallone portrays him with conviction and is one of the best parts of this movie. Overall, even though the final fight should have been filmed like the first one Creed succeeds because of an interesting story, wonderful acting from all the leads and a gritty, real tone which is why I'm giving \"Creed\" a 9 out of 10. See. This. Movie."
    },
    {
      "rating": "8",
      "text": "'Creed' pays respect to the Rocky formula, but just like the film's protagonist, it separates itself to create an engaging and inspiring story about family and creating your own legacy. Ryan Coogler proves that he is one of the best young directors working today, and Michael B. Jordan and Sylvester Stallone give fantastic performances."
    },
    {
      "rating": "8",
      "text": "Ryan Coogler is now two for two, first with  Fruitvale Station and now with Creed, the best Rocky sequel yet. Creed in many ways is like the original Rocky, it’s a drama about the characters and boxing happens to be apart of it. At it’s core, it’s a story about a young man who’s had nothing in life, no father, no home and it’s his battle with himself to make a name for himself. It’s a deeply moving and inspirational movie with excellent acting performances and some of the best boxing scenes I’ve ever seen put to film."
    },
    {
      "rating": "8",
      "text": "So I've just seen \"Creed\" and it was pretty good. I would go that far and say it's the best Rocky movie since the first.\r Ryan Coogler directed the hell of this movie and let me just say it was beautifully executed. Coogler brings a fresh and brilliant story that really made \"Creed\" as special as it is.\r Sylvester Stallone delivers one of the best performance in his career and I really hope he gets an Oscar nomination for this, because he's performance was both terrific and stellar.\r Same with Michael B. Jordan as he delivered a terrific and solid performance, I mean right after \"Fant4stic\" you would think his career has just gone down the drain, it's not until \"Creed\" came to save him.\r The camera work for the fight scenes was excellent, it was inspiring, it had passion and overall it's a great movie."
    },
    {
      "rating": "10",
      "text": "Coogler recognizes, elaborates upon, and skewers us with this simple fact: we all have a little Rocky in us. Speaking of whom, Stallone completely transforms his best known character, coming to us now more like a brooding Marlon Brando antihero, and pulls it off so well that you almost leave the theater without realizing this isn't a Rocky movie. The transformation of Stallone's career, which has taken us all the way from The Lords of Flatbush to the present day, is as much a revelation as the film itself."
    },
    {
      "rating": "6",
      "text": "So if anyone cares, you can still see this movie in the cinema, starring Rocky and a bunch of other people whose names really don't matter. \"Original\", \"exhilarating\" and \"breath-taking\" are just some of the words being used to describe this movie, they're not the words I'd use but who am I to judge. Nostalgia comes to mind once this movie starts and remains the entire time, it's a movie that doesn't really bring anything new to boxing movies, you'll get your training montages, emotional moments, and your epic slow motion knock-out punch that seems like each scene is simply ticking the box on the \"how to guide to boxing movies.\" Original? No but entertaining popcorn movie? Yes. Recommended if there's nothing else to watch."
    },
    {
      "rating": "8",
      "text": "I had a lot of fun with this movie. At first I thought it would be just a plain old cash grab with A-list actors to see tickets and spit on the name of the rocky movies but no. It's a well directed, well paced and very emotional boxing film. Ryan Coogler is a very talented director. He has a very strong attention to detail and emotion just like his last movie “Fruitvale Station”. I remember watching that movie and it just made me aggravated about the police and racism. The movie turned me into a radical I wanted to do something about it and Ryan Coogler does not fail to bring that same emotion to screen here. At times the movie can be very heart-breaking and intense especially in the boxing sequences. But, it can also have a light and strong heart bringing hope and cheer to the audience and characters. The only thing I can hope for is that there isn't a Creed 2 because with this movie making 30M and the talk of it in interviews there most likely will be. But, I hope the studios will have the decency to respect the franchise and the fact that there really isn't anywhere to go but down after this movie wraps everything very well. One of the cons I had with the movie was that even though it's formula was somewhat original. It managed to hit almost every cliche in the book and have characters act irrational so that the second act can movie into the third. The movies I enjoy are the ones where the characters don't act completely different and everything is so convenient to the plot so that the movie can movie along. But with all that said I think that this is a pretty solid rocky movie"
    },
    {
      "rating": "8",
      "text": "'Creed' was a masterful film, and a must see for Rocky fans. Frankly, 'Creed' is one of the best movies I have seen all year - This is for a variety of reasons, lets start with the fact that the direction is expertly crafted. The fight scenes seem so real, it truly feels like I am in the ring with Creed and Rocky themselves when these fights break out. The ending was perfect, it was open-ended (left for a sequel I suppose) and it left a smile on my face. Some bad things are the relationship between creed and a girl seems forced just to have a love interest in the film. Also the 'villain' (if you can call him that) was stupid, It felt like a cartoon and kind of cheapened things up a little bit. Overall 'Creed' is worth watching."
    },
    {
      "rating": "8",
      "text": "A logical and strong entry in the Rocky cannon. Just like it's predecessor, the effective \"Rocky Balboa\", the film goes for the realism and heart of the first two Rocky films. Rocky Balboa (who Adonis Creed refers to as \"Uncle\") is now a sympathetic and endearing character who you want to root for just as much as Michael Jordan's Adonis Creed. The finale (Creed must face a formidable opponent that is about to serve a very long prison sentence) is satisfying too."
    },
    {
      "rating": "10",
      "text": "YOU can’t keep a good fighter down.\r And while many would have been happy for cinema’s greatest boxer Rocky Balboa to stay down after the surprising success of his self-titled and sixth film nine years ago, you’ll be glad he got back up off the canvas for a seventh round.\r To be fair though, this is not Rocky’s fight. It’s a passing of the torch, or gloves as it were, to Adonis Johnson aka the illegitimate son of Apollo Creed, Rocky’s opponent in the first two films of the series (and friend in the third and fourth).\r “Baby Creed” is played by Michael B Jordan (Chronicle, Fantastic Four), a troubled young man who didn’t know his father but is drawn to Apollo’s legacy and the world of boxing.\r After a promising start to his pugilistic career but with a temper in danger of landing him in trouble, the young Adonis packs in his job as an accountant to follow his boxing dreams.\r He moves from LA to Philadelphia, tracks down Rocky (Stallone, of course) and begins training, hiding the fact he’s Apollo Creed’s son from everyone but Rocky.\r So far, so formulaic, and on paper this looks like an uncalled-for cash-grab; a desperate attempt to restart the franchise. But the reality is this is one of the best films of the Rocky series – one worthy of the championship belt.\r Creed is filled with the rich history of its predecessors but is not weighed down by it. Perhaps its greatest feat is walking the line between the old and the new – fans of the series will be well rewarded, but newcomers will find this a great starting point to the saga.\r The film is totally Adonis’, and therefore Jordan’s, but it does a great job of valuing and honouring Rocky, and therefore Stallone.\r Jordan’s performance is great, both in terms of the physicality and the dramatic requirements. He owns a tough role that is constructed almost entirely in the shadows – not only of his character’s father, but of Stallone, of Balboa, and of the Rocky legacy. That he doesn’t buckle under all that weight while comfortably creating a new character is something to be applauded.\r But the real star of the show is Stallone. A best supporting actor Oscar nomination beckons. After seven films, Rocky is a comfy pair of slippers for him, but in the transition from ageing fighter to “loveable uncle”, he adds new depth and new dimensions to the character that is the best display of Stallone’s talents since Cop Land.\r Coogler, directing his own script, is the quiet achiever here. He gives both Adonis and Rocky good arcs, and you can see the screenplay is the real difference between this being a cheap knock-off and the real deal. But he also handles the action well. The film’s middle fight – a one-take, two-round sizzler – is masterfully done, as is the way he builds momentum in the final bout.\r The flaws are few but are really no fault of the film’s. There is nothing truly new here – no surprise given this is Rocky VII – and you can spot the story’s beats from a mile away, which takes some of the punch (ahem) out of proceedings.\r There is also a fine line between melodrama and real heart, and which side Creed falls on may well depend on your frame of mind when you step in the ring. Similarly, it’s humourless/serious approach skews toward self-parody, something amplified by the over-the-top and unbelievable nature of the climactic bout.\r But Creed has the potential to win you over if you let it. The injection of new blood, dealt with intelligently, makes for an enjoyable new story in the Rocky saga, aided in no small way by Jordan, Coogler and, dare it be said, a career-best turn from Stallone."
    },
    {
      "rating": "9",
      "text": "This movie will make you want to stand and cheer. Just awesome. It steals a lot from the original Rocky story, but hey, that movie won best picture, so why not? Michael B Jordan and Stallone work really well together. This is the \"passing the torch\" movie that Rocky V should have been."
    },
    {
      "rating": "8",
      "text": "Creed hardly tells an original tale but the excellent performances from the main cast (including Stallone) and fantastically visceral boxing scenes make for an overall package that is well worth a watch, particularly if you are a fan of the Rocky franchise."
    },
    {
      "rating": "6",
      "text": "A late offshoot from the popular ‘Rocky’ series of the seventies and eighties. It has some nice touches in both the writing and directing departments, but otherwise it’s pretty much the tried and trusted formula from the better examples of the series. If you are not a fan then the lack of originality and the seen it all before feel won’t convert you. The screenplay draws from the perfunctory elements as before- the no one becoming someone; the training; the obligatory girlfriend; the rousing music and the climatic fight. It’s all here folks and if you like this sort of thing, then it’s the sort of thing you’ll like. Performances are adequate for the demands of the material, but none are Oscar worthy so don’t believe the hype. The climatic fight sequence packs more than a few punches and truly gets the adrenaline racing helped no end by some brilliant editing."
    },
    {
      "rating": "9",
      "text": "Boxing movies usually follow a cliche script or finds ways to just completely ripoff its far superior predecessor (I'm looking at you Southpaw).  Some take stories from real life, while others focus on a down and out person  who pulls himself/herself together to fight for a living. The then come together and become the top of their craft. It gets to the point where the stories get boring. They're predictable, sappy, boring, etc. Creed might steal some cliches from boxing movies or previous rocky movies,  but mostly it throws all the other cliches out the window. This gives audiences a refreshing take on the Boxing genre and a great movie in a long time.\r Both of Adonis Johnson's (Michael B. Jordan) parents weren't around when he was growing up. His aggressive and insurgent nature  has caused him to get a bad-rap in the foster home that he lives in. His life suddenly changed when the wife of Apolo Creed comes in to adopt him. Apolo had cheated on Johnson's mom and left Creed's mom before he was born. He can now lives the life he's always wanted or maybe not. He's always wanted to follow the footsteps of his father without getting there with his name. He meets up with Rocky (Sylevester Stallone) to get him to train him and eventually is able to get into the sport he loves.\r Creed exceeds past its predecessors (besides the first one) because it does a great job of combining both the amazing parts of the Rocky series while giving audiences a new and fresh take. It doesn't want to ride the coattails of the past while still still staying true to the name, and the movie gives us those moments that made the franchise great. This small little awesomeness of irony in the story, is just one of the great things Creed does. Creed the movie doesn't want to be great because of their name while Johnson also doesn't want to get inti boxing because of his name. It's an interesting parallel that really shows us that the director really does get it. He knows what the fans of the series want, while pulling in a new generation of fans.\r The best part of the movie is the acting within the grittiness of the movie. The movie has those amazing corny moments that people love from the last films, but the movie is grittier version of it's predecessor. The acting reflects this as Stallone really shows a broken down version of the once great boxer. His idea of knowing that the past is in fact the past, and he can't cope with leaving the past where it is. Also everything he's loved in life has pasted and gone. His career, his family, and his life has been transformed into something different. Both Jordan and Stallone show their acting chomps as their chemistry is great together. The script helps in this but it's really their performances that make you believe that they're this new family. Stallone gives his best performance, maybe even better than the original Rocky. Michael B. Jordan sells that he is indeed a boxer and the direction of those fights were fantastically put together. The cinematography brings to life the fight scenes and it feels extremely real. The choreography is best since the Fighter.\r The script helps the movie feel real as well. Johnson doesn't all of a sudden become this amazing boxer. It take months for him to train before his first bout. He has boxing all his life in different countries underground. Nothing about the script screams cliche and it doesn't scream for attention. I simply knows what the fans want and it produces that product onto the screen. Bringing back some of the original actors, characters, set pieces, etc., is something not really done anymore. At least not to the quality of this movie. Overall the script prevails without an overabundance of the Rocky formula, while still giving us that Rocky feeling. Also they answer the question of who won during the third fight of Apolo and Rocky.\r Overall, the movie is fantastic. The cinematography shows us the grittiness of Pittsburgh while giving the audience fantastic fight scenes that can rivial any boxing movie. The acting sells us on the script as well, with Jordan and Stallone seeming like they've been acting together for years. This might be the most surprising movie of th year to some as well. Creed is the second  best Rocky movie of all-time and might be the be the best boxing movie since Ragging Bull. 9/10"
    },
    {
      "rating": "9",
      "text": "Creed is a fresh yet familiar story that builds once again on the story of Rocky Balboa and now Adonis Creed. After the sixth installment of the Rocky franchise it seemed like the series had finally run its course, but Ryan Coogler managed to come along and inject some new life into this franchise. Ryan Coogler both writes and directs beautifully by creating new great characters with new stories while also paying tribute to the Rocky films that came before it. Michael B. Jordan is officially a movie star. This kid showed how talented he was with Fruitvale Station and now he's got a role that makes him unavoidable. Sylvester Stallone is back as Rocky and he plays him beautifully. Stallone simply just will never forget how to play him, but he doesn't steal the spotlight either. This film belongs to Jordan and Coogler. The fights are outstanding and truly some of the best fight scenes in all of film. We even get a fight that is done all in one take which I'm sure many people wouldn't notice and that's a huge accomplishment. I can't wait to see a sequel for this film and Coogler better be involved. He better take Black Panther too."
    },
    {
      "rating": "8",
      "text": "Good movie. Brings me back to the memories I have of watching the unforgettable Rocky films. I did wish they went through with the first championship fight, but no feelings hurt here. Another achievement under Sylvester's Movie Hall of Fame belt."
    },
    {
      "rating": "9",
      "text": "A thoroughly enjoyable film. Great script, cast, believable characters.  This is why we go to the movies.  Highly recommended holiday film. Sly Stallone is back!"
    },
    {
      "rating": "9",
      "text": "Creed is an excellent movie.  I really had a good time watching it.  The tag line is the Rocky Legacy lives and that really feels accurate because this film feels like a passing of the torch from Sylvester Stallone to Michael B Jordan who can continue to make more of these movies.  Many of you might say it is a clone and that Michael B Jordan, Tessa Thompson and Sylvester Stallone are basically filling the roles of Rocky, Adrian and Mickey in the first films but to me it feels like a completely different dynamic whilst retaining enough of the semblance of the original dynamic to make it recognizable.  The fight scenes are excellent, it is brilliantly shot, the drama feels poignant, personal and well written and all the actors and performances are great, especially Sylvester Stallone’s.  If you loved the previous Rocky films you have got to go and see this one.  If you are on the fence about it I would suggest going to see it anyway.  This might be the film to make you go back and see the previous Rocky movies."
    },
    {
      "rating": "8",
      "text": "Respect.\r Creed to sztandarowy przykład bardzo dobrego powrotu zakurzonej już serii o legendarnym boxerze - Rockym Balboa. Walki nigdy nie były tak emocjonujące w żadnym widzianym prze ze mnie filmie (no może po za The Raid). Odczuwałem każdy cios, który bohater zadawał swoim przeciwnikom. Historia nie wydaje się być naciągana, co mnie bardzo zaskoczyło bo jest to 6 cześć Rokiego! Sylvester Stallone wypadł wyśmienicie. Uwierzyłem w jego postać w 100%. Michael B. Jordan po katastrofalnej Fantastycznej 4 pokazał, że jest bardzo dobrym aktorem i dopiero się rozkręca. Mam nadzieje, że się nie mylę i w niedalekiej przyszłości zobaczymy go w kontynuacji Creed."
    },
    {
      "rating": "8",
      "text": "Although nominally part of the Rocky saga, Creed is very much it's own beast. While it deftly acknowledges the previous films, it is unequivocally Adonis Creed's story and Rocky Balboa is a supporting character. Fortunately, this means that a detailed knowledge of the previous Rocky films is not necessary and the film can easily be enjoyed on its own merits.\r The story rests firmly on the relationship between Michael B. Jordan's eager, ambitious Adonis Creed and Sylvester Stallone's Rocky, and the chemistry between the actors is the films greatest strength; Creed is a young man in need of a mentor and father figure, while Rocky is a lonely, ageing man in need of a purpose, and it is the evolution of their relationship that forms the emotional heart of the film. Both actors perform strongly, with Stallone's turn as the ageing, directionless former champion of particular note (surely Oscar nomination worthy).\r There are some extremely well shot fight sequences, particularly the one take boxing match, and the way it reinterprets classic sequences is very enjoyable for those familiar with the originals.\r Overall, Creed is a thoughtfully made, skilfully acted, and highly enjoyable film that ends up being much more than simply a \"boxing movie\"."
    },
    {
      "rating": "10",
      "text": "Creed is the seventh film on the Rocky franchise,directed by Ryan Coogler and stars Michael B. Jordan as Adonis Johnson the son of Apollo Creed,Sylvester Stallone returning to play Rocky Balboa and Tessa Thompson as Bianca.\rCreed follows Adonis Johnson,who's father (Apollo Creed) died before he was born.However he loves to box and one day he decides to seek out Rocky Balboa to train him.Rocky sees Apollo in Adonis and agrees to train him,even though he battles a deadly opponent but with Rocky's help he will train and try to make a name for himself not just depend on his father's.\rThis movies,much like Rocky (1976),it's not concentrated on the boxing as much as in the characters.Adonis Johnson is played wonderfully by Michael B. Jordan who is definitely Oscar worthy with this performance.Adonis is trying to prove that he was not just a mistake and show the world that he can fight.He goes through a lot of struggle but with the help of Rocky he will try to overcome his fears and be better at what he does.\rSylvester Stallone is magnificent on the iconic role again.He proves that The Expendables it's not all he does and he is worthy of a lot more.\rOne of the first professional fights on the ring that Adonis has it's been made to look as one-shot take and it's brilliant.I really loved that scene and even more than the final battle.\rI really like the personal struggles that the characters have to go through,the way they overcome them and the dialogue between the two main characters it's really good and sometimes even touching.I was tearing up in a few scenes and the amazing soundtrack coordinating with the lines of the dialogue made for some pretty intense/sad scenes.\rI really liked Creed,it's certainly one of the best movies of the year and worthy of many awards."
    },
    {
      "rating": "8",
      "text": "The movie is a solid eight, which puts it squarely at \"worth the money.\" While this movie isn't going to win any awards, it does highlight the amazing endurance of the Rocky franchise, but also the boxing mythos, in general: the fallen son, redeemed by his adopted family and adopted father. While there are moments in the movie, like Rocky's cancer, the quality of opponents, and the relative ease that he becomes a \"good\" fighter, the ending is very satisfying. The challenge with most boxing movies is it literally comes down to a single event, so there's a 50-50 chance it will end in a way that you expected, fortunately they chose a different path. With the loss at the end, but a loss that shows his potential, the movie shows that it isn't above it's own myth creation and lives in the, somewhat, real world.\r Great to see in the theaters or as a Netflix night."
    },
    {
      "rating": "9",
      "text": "After many attempts to revitalise the franchise, Creed captivates the audience with heartfelt performances, impressive character development and outstanding direction. Sylvester Stallone gives another deeply stunning performance as Rocky Balboa and is truely worthy of an oscar nomination once again. Ryan Coogler proves his talent with this daring yet successful addition the rocky franchise."
    },
    {
      "rating": "9",
      "text": "Fighting a way out of a bequeathed legacy is something CREED does as a movie just as much as its eponymous lead.Replete with training montages and feel good moments,this is a movie which is definitely a part of the Rocky pantheon and the best one in years. Suprisingly,Stallone is in his element again after an eternity.It may not reinvent the genre but it revitalizes it.Well defined characters and relationships feel organic.Character traits are embellishments and not afterthoughts. Characters themselves fit into existing templates,while staying true to their established traits.Nothing feels forced out of place,but at the same time,it feels new.The audience is part of every fight,flowing with every jab and floating with every dodge,seamlessly shot.A few cliched framing devices in the third act notwithstanding,Hollywood has a bona fide movie star in Micheal B Jordan and a stellar director in Ryan Coogler.Along with FRUITVALE STATION,this pair is fighting 2-0-0.JJ Abrams and Colin Trevrrow should take notes."
    },
    {
      "rating": "9",
      "text": "Loved it!! Great acting, great script, great boxing scenes.  Stallone wears the Rocky character like a second skin.  Michael B. Jordan was perfect.  This is a great example of how to carry on the legacy of a beloved franchise like Rocky and do right by it (unlike Star Wars)."
    },
    {
      "rating": "8",
      "text": "When I saw the trailer several months ago, I was intrigued by Jordan, until I saw it was yet another Rocky movie.  Originally thinking the last thing the cinema world needed was yet another Rocky flick, I was blown away by how good this movie is.  Although the viewer benefits if they know the first three movies, the story is compelling enough to stand on its own.  Both Jordan (no surprise) and Stallone give top notch performances.  In fact, Stallone's is so nuanced as an old guy who knows he's an old guy, that he absolutely earns his Oscar nomination.  Although the final fight scene, just like in all the Rocky flicks, drags on and is unrealistic, the movie wins one over with its heart and performances.  Good job!"
    },
    {
      "rating": "6",
      "text": "Creed continues the Rocky Bakboa's saga with technological instruments, \"modern\" story-telling and a grand new plot, that doesn't work completely with the originals. Anyway, it has the same thriller, action and love of the predesesors, despite the many differences that shows and kills the main original idea."
    },
    {
      "rating": "9",
      "text": "Fans of boxing and Rocky will rejoice after seeing Creed. One of the best boxing films that has come out in the last decade, and one of the best sequels in the Rocky franchise. The fighting and choreography are incredible, the way the film makes you feel what the characters feel is poignant and long lasting. Maybe Sylvester Stallone's best performance as an actor. Don't miss out on Creed!"
    },
    {
      "rating": "10",
      "text": "Two A+ films on the same weekend.  I loved every second of Creed.  While the boxing scenes are phenomenal the main reason to love Creed is because of the characters and the relationships they build with each other.  Michael B. Jordan is great you really feel the pain this guys gone through.  Also Sly Stallone has never been better and should be considered for a best supporting actor nomination.  In the end I was laughing, crying, and cheering the whole time.  A+"
    },
    {
      "rating": "9",
      "text": "Shockingly great. The Rocky franchise turned on its head and given a completely new life, in the form of Apollo Creed's son. Beautiful story-telling and utilizes all the elements that made the original Rocky magic. Minus half a point for Michael B Jordan, who lacks the depth and vulnerability of Stallone, but has a made a giant leap from Fruitvale Station. The other half point deduction is the paper thin motivation the young Creed has to become the worlds greatest champion. Neither of these points gets in the way of enjoying the movie, and Stallone is a joy to watch, as always.\rAll in all, about as good as Rocky II, which is saying a lot."
    },
    {
      "rating": "8",
      "text": "Outside of the original 1976 Rocky film, the Rocky franchise consists of some decent films but none can hold a candle to the original film which still holds up today nearly 40 years since it's release, however Creed is a very good film and earns the spot of the second best movie in the entire franchise. The film does so many things right, the gym politics between fighters is an interesting angle, the boxing choreography is the best the series has ever seen but still not at Raging Bull's (one of my favorite films notwithstanding sports or boxing movies genre) level of realism and accuracy of how boxing matches actually happen. The acting is phenomenal, Michael B Jordan will be a heavyweight (boxing puns!) in Hollywood in a few years, Sylvester Stallone however surprised a lot of people with a very touching and emotional portrayal of a man who has lost his family and is just waiting for death. Stallone's performance didn't surprise me because I have always known in certain situations this guy can deliver, watch the original Rocky movie, the guy was nominated for an Oscar, he absolutely deserved that nomination, there is more to him than Expendables franchise.\r I would recommend everyone to check this out, as much as I liked this film I have to admit that it will not reach the iconic status of the original Rocky film. Primarily because the film had a few missteps in the editing department, the first half could have been shorter by 15 minutes or so, it was trying to be a cool funny film for everybody but I was glad that it ditched all that for intense heavy emotional drama in the second half. Another minor nitpick I have is I never felt as invested in the relationship of Adonis and Bianca compared to Rocky and Adrian, these films aren't about romance though so it's not a big deal. Further, I found Adonis Creed to be a lot like Apollo Creed smart, intelligent and charismatic, which is great and all but I prefer Rocky as the protagonist because he was a blue collared simple man who was not good with words but always got up after being knocked down."
    },
    {
      "rating": "10",
      "text": "Excellent! I'm a huge Rocky fan and this movie did not disappoint. It fits very well into the Rocky story, but establishes itself on it's own merits. The movie is well written, acted, and directed. Ryan Coogler did an amazing job writing/directing. Stallone and Michael B. Jordan deliver outstanding performances and have great chemistry together. Definitely a must see!"
    },
    {
      "rating": "10",
      "text": "If you would have told me, before watching CREED, that I would have enjoyed it so much I would create an account on metacritic and post a review AND give it a 10, I would have laughed in your face!  I am not a hardcore Rocky fan.  I've probably seen 2 of the whole series.  From that perspective I still thoroughly enjoyed watching CREED.  CREED is great entertainment and is definitely a new school classic.  Cooglers use of the camera in storytelling really puts the viewer right in the middle of the action.  CREED wasn't even a choice on my \"to watch\" list, but I am glad that our group decided on this movie.  Fresh and relevant, with very convincing performances from the whole cast, CREED delivers a surprise left hook out of nowhere!  CREED runs 2+ hours long but felt half that because of the wonderful flow of the movie.  Jordan's performance as a professional boxer was impressive, and Stallone's aging Rocky was pure class.  Kudos to them both.  Go watch this movie."
    },
    {
      "rating": "10",
      "text": "This film is incredible\rI mean it's not like any boxing film that I've ever watched\rit's so special and the best bit that it's not just about boxing but it holds lots of  empowering quotes, realistic relationships and the soundtrack is amazing btw"
    },
    {
      "rating": "8",
      "text": "In a fashion similar to this year's \"Mad Max: Fury Road,\" this film acts as an emphatic rebuttal towards those wary of sequel/reboot/remake fatigue in Hollywood. The film ingeniously revitalizes a seemingly finished franchise, repurposing the familiar faces into a story that speaks not only to \"Rocky\" fans, but to the average filmgoer as well. \"Creed\" is a masterfully conceived, well-shot piece of filmmaking"
    },
    {
      "rating": "5",
      "text": "Oh dear....\rAfter the brilliant Rocky Balboa offered a very tidy bookend to the Rocky film franchise the world really didn't need Stallone to dust off the character for (hopefully) one last outing (although this film does leave the story open ended, which just feels like another throwback 'beat' to the original Rocky movie).\rMichael B. Jordan is introduced as Apollo Creed's illegitimate son Adonis \"Donnie\" Creed (who was born after his father died in the ring, in order to make him just about young enough to 'be' an up and coming fighter) who decides to leave his pretty decent life behind in California and head to Philadelphia as a way to find out who he really is.\rRocky is now effectively alone, the characters introduced in Rocky Balboa who offered some emotional context have apparently disappeared, and Paulie has died in the interim too. Rocky and Donnie form a bond after Rocky, who is immediately dismissive of getting back into the training game, has a pretty impressive change of heart and begins to get Donnie into better shape.\rDonnie's love interest, Bianca is shoe-horned in after they meet because she lives in the apartment below, and plays music too loudly... Cue awkwardness that blossoms into love/hate/love as the plot requires.\rDonnie is offered the chance to fight the undefeated, undisputed, light-heavyweight champ because of extraneous circumstances that for some reason make an unknown 'Creed' a better money making prospect that the number one contender... (Yes, that made no sense to me either!) Culminating in a beat by beat cover version of Rocky's first fight with Apollo (and, sadly, does set up a potential sequel).\rAlong the way we discover a little about Donnie's motivations, Rocky's difficulties with being alone, and the parallel 'internal' fights of both men as they battle to overcome their fears (of different things, for different reasons).\rAll in all it's just highly derivative and a completely unnecessary film. As mentioned, the finale of Rocky Balboa was the perfect ending to what was then a 30 year franchise. Now, coming up on 40 years since we first saw Rocky climb out of the ring after beating 'Spider', lighting a cigarette, and heading home... We're left with a bad aftertaste with the final mouthful, despite some great acting on Stallone's part, because seeing this film only reminded me just how fresh and exciting the original Rocky film (that Creed desperately attempts to emulate) actually was.\r Immensely disappointing."
    },
    {
      "rating": "10",
      "text": "'Creed' is a movie that benefits from the history of the 'Rocky' franchise that it brings with it into the theater, giving it the advantage of a built-in emotional gut punch. That head-start allows the filmmakers to fully develop their new characters so that the film stands on its own two feet and delivers on every level."
    },
    {
      "rating": "9",
      "text": "Mark Sly for Best actor nomination. Story that had all the 'underdog overcoming adversity for a character you felt for' as the first Rocky. Great score, outstanding fight effects. A true joy to watch."
    },
    {
      "rating": "8",
      "text": "Overall, it's definitely a worthy addition to the series of Rocky films. Ryan Coogler, who also directed Michael B. Jordan in the just as excellent film Fruitvale Station, directs him to yet another great and memorable performance. Sylvester Stallone also gives his own iconic character plenty of heart just as he's always done in the past films. The film also felt appropriately nostalgic in all the right places, however, I was somewhat disappointed to see the film's final fight copy the very first film's final fight almost exactly to the letter. Other than that, this was a great and fun film that left me satisfied for the most part, yet wanting more (possibly a sequel) at the same time."
    }
  ]
}