{"id": 4387, "title": "Creepshow", "starring": ["Hal Holbrook", "Adrienne Barbeau"], "runtime": 120, "genre": ["Horror", "Comedy"], "description": "Inspired by the E.C. comics of the 1950s, George A. Romero and Stephen King bring five tales of terror to the screen.", "releaseYear": "1982", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/4SoyTCEpsgLjX6yAyMsx3AsAyRQ.jpg", "categories": {"plot": 5.777777777777778, "acting": 5.5, "ending": 5.0, "soundtrack": 7.0, "cinematography": 5.0, "familyFriendly": 3.0, "funny": 5.0, "action": 5.0}, "reviews": [{"rating": "8", "text": "A great collection of creepy tales similar to the Stephen King short story books (Night Shift,  Skeleton Crew) with a horror comic storyline threading everything together. I saw this movie on HBO at way too young of an age and I'll probably never forget the scenes of Ted Danson buried up to his neck in sand as the tide rolls in, or the cockroaches pouring out of a man's mouth. Burned into my brain forever."}, {"rating": "4", "text": "You would think a epic team up with King and Romero would have been the stuff of cinematic legends. Unfortunately that's not really the case. Most of the stories are fairly boring and all seem to have some sort of \"moral\" with \"bad\" people seem to always get their comeuppance. From a greedy family, to a child beating father, they all eventually meet the same fate. It's not really anything inspiring. I feel like Creepshow would have been a lot better if they had all just dipped into the pool of already avaible short stories by King. I was given the impression that two of them actually are, but if they were, I have no idea which ones.Boring, tedious, uninspired, these are a few words to describe Creepshow."}, {"rating": "4", "text": "While two of the stories were okay and actually entertaining, the rest of them were boring, stupid and just plain bad. The acting was beyond bad, the writing was stupid and some segments were cut too short. At least the practical effects were quite good and the movie had good gory moments."}, {"rating": "7", "text": "Any film with Ted Danson and Leslie Nielson in it is alright with me!. Its very much cooky/quirky, with a comic book feel and indeed comic book style illustrations shown in the interlude between the different stories portrayed. It is of course quite spooky, with spooky castle type eery music played in the background for most of the film. You could say its over the top - its very much a film of the 80s in any case. Its the sort of film that does leave you feeling a little edgy, like something sudden may happen at any moment, just about, although I can't say I found it particularly scary. Its too comic for that, with the supposed blood being a very, very bright red (think particularly red tomato ketchup). I'd say its worth a watch, yes."}, {"rating": "3", "text": "It was a dirty print. I wasn't sure about the comic-book style but I guess it worked. Sadly it all looks very dated. The sound worked. There was nothing bad about it but there was nothing memorable about it either. Father's Day: Reminded me of Return of the Living Dead III (1993) but nowhere near as good. The Lonesome Death of Jordy Verrill: Reminded me of Slither (2006) but nowhere near as good although better than previous. Something to Tide You Over: Predictable zombie retribution boredom. The Crate: The monster from Congo (1995) but better although still boring. They're Creeping Up On You: Lots of gross bugs. Overall: Dated badly with old-fashioned filmmaking. The second story in the anthology was the best."}, {"rating": "7", "text": "A series of horror-comedy films featuring mini-stories, the first two of which are Stephen King, translated in 1982, 1987, and 2007.Villains and oppressors win in most of the stories. Those who were killed are resurrected and take revenge. Stories are fun. As a concept, an illustrated magazine atmosphere is created for the audience. Nudity prevails in some stories. The paths of the characters in the stories in the last chapter somehow cross."}], "recommendations": ["scary_stories_to_tell_in_the_dark", "pet_sematary", "batman_the_killing_joke", "king_arthur_legend_of_the_sword", "jack_the_giant_slayer", "sinister_2", "sin_city_a_dame_to_kill_for", "insidious_chapter_3", "the_conjuring_the_devil_made_me_do_it", "percy_jackson_sea_of_monsters", "insidious_the_last_key", "final_destination", "insidious_chapter_2", "the_last_witch_hunter", "resident_evil_damnation", "underworld_awakening", "ouija_origin_of_evil", "it", "maze_runner_the_scorch_trials", "evil_dead_ii", "i_am_legend", "annabelle_creation", "the_haunting_in_connecticut_2_ghosts_of_georgia", "the_witcher_nightmare_of_the_wolf", "the_woman_in_black"]}