{"id": 768, "title": "Creed II", "starring": ["Michael B. Jordan", "Sylvester Stallone"], "runtime": 130, "genre": ["Drama"], "description": "Between personal obligations and training for his next big fight against an opponent with ties to his family's past, Adonis Creed is up against the challenge of his life.", "releaseYear": "2018", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/v3QyboWRoA4O9RbcsqH8tJMe8EB.jpg", "categories": {"plot": 6.7631578947368425, "acting": 7.052631578947368, "ending": 6.9, "soundtrack": 6.8, "cinematography": 7.5, "familyFriendly": 6.0, "funny": 5.0, "action": 6.555555555555555}, "reviews": [{"rating": "8", "text": "Don't go to a Rocky or Creed movie expecting it vary too far from the formula, it won't. Stallone's wise-old-man role as Adonis Creed's Yoda is not new, but has matured  since Creed and is very much fun to watch as he delivers Jedi-master words of wisdom in shorter-than-a-Tweet sound bites. The battles in the ring are spectacularly cringe-worthy and or course the climax will play out in 12 rounds.  Kind of goes without saying.Adonis' truth-of-character is buried deep and as a \"dig-deep\" story, it comes with more nuance than you'd expect. But as predictable (or not) as the movie formula may be, you'll enjoy the ride if you let yourself. Why not let yourself?"}, {"rating": "8", "text": "A very good follow up to the surprise break out hit that was Creed. Michael B Jordan, Tessa Thompson and Sylvester Stallone plus a surprisingly good performance by Dolph Lundgren bring everything to the table for Creed 2. This is a much needed, crowd-pleasing film in a time where there have been a ton of disappointments released onto the big screen."}, {"rating": "6", "text": "Solid and sober. Elements that were always needed in the Rocky sequels, however my biggest fear became reality because the film is completely structured as all those Rocky sequels and it feels so predictable that it takes away much of the charm.It's still a very entertaining film and a remarkable sequel. I definitely recommend it. But you should see it with the mentality that this film is completely devoid of surprises and while it doesn't disappoint, it's not memorable or worthy of more attention.Also they must definitely stop here. A third film would only commit the same mistakes. And it will definitely not feel so fresh anymore"}, {"rating": "6", "text": "The first CREED was an excellent film. This second one suffers from pacing issues. The fight scenes at times were comical in that you could tell they were overtly fake. Good acting and excellent music. I would rent it and watch it at home."}, {"rating": "5", "text": "Caple Jr.'s persuasive anthology on this boxing match to prove it is essential, makes it less essential.Creed IICaple Jr.'s persuasive anthology on this boxing match to prove it is essential, makes it less essential. You can practically see him sweat behind the screen like Jordan sweats in front of you, to grab your attention, and once you give it to him, he doesn't have anything new to say. It is old book testimony and in fact the film itself confesses it once, \"the history might repeat itself\" and unfortunately it does. The entire structure of the script is similar to the previous Drago chapter in Rocky series.The boxing matches, the songs, the routines, the mistakes, the family drama and rebirthing itself once again, all the antics installed in here is a seen-this-seen-that conflict and also the solution. It merely feels like an episode of a series, and neither is this the middle chapter where everything gets flipped, nor is this the grand season finale, no one's wiser after the dust settles. Still there is something gutsy about Jordan's looks that makes you want to stay in this fight till the last round.His work is more than admirable, primarily because along with all those hokum strategies, irrelevant slow motion shots and at times impressive tactics, he can also act. And that's very hard to find. He makes sure you are looking in his eyes when he is on screen. And he does what he couldn't do in the previous Creed chapter and that is to make you choose him over Stallone. On Stallone's defense, he doesn't have much to invest in this one. Reminiscing the repetitive melodrama of his personal life, Stallone is completely out of this ring. He is underused for the most part of it.The peak moment of the film does allow both of these heavyweight championship to play the higher cards. A genuinely moving showdown of Stallone and Jordan in the middle act does makes your heart pump faster. In that hospital room, where Jordan's idol has fallen in front of him, somewhat and somehow the film promises you to take this into newer territories with justified reasonings. But as soon as you raise your hopes high, it beats you down to the ground with a knockout punch. What was Coogler's head spinning punch in the previous installment, it is left out dry and numb by Caple Jr.Arguably, the execution isn't bad, it is weak at times, but it also has its moment, the real culprit though is the script, confined in its own bubble no one is ready to pop it out. Thompson, Rashad and Lundgren as the supporting cast isn't impressive enough to hold on to their own ground, they are handed over a stereotypical space to fill in. As far as the action is concerned, both Jordan and Munteanu has done a bravura of work, it is surely a more gritty fight than the previous one but then these are empty punches. Creed II is another Monday on this training boxing match, the tactics or methods may change but it still is a regular physical training."}, {"rating": "6", "text": "I love the first “Creed”, it was one of my top films of 2015. This has a much more committed and emotional Michael B. Jordan and some of the energy that made the first film so great, but in between is filler, predictability and a more workmanlike execution."}, {"rating": "9", "text": "Sure it's formulaic but Creed 2 is a worthy successor to the first and an awesome piece in the Rocky franchise. While it is easy to predict a lot of the film the characters are what makes this movie a success. All of the characters story's are handled well and surprisingly even the Drago's who are not just plain bad guys they actually have a decent amount of emotion and you get their motivations. Bottom line it's not as good as the first which I gave an A+ but this isn't that far behind. Overall a solid 9 an A."}, {"rating": "5", "text": "Ryan Coogler is back, having solidified his title of heavy weight champ. Out of Russia appears a challenger, the son of Drago (the Russian villain in \"Rocky IV\" played again here by Dolph Lundgren). Of course, Stallone is back to continually dispense wisdom and inspiration. The plot follows the same structure as always: intimate personal moments, dramatic encounters, training montage, big fight…repeat. The cast does fine, but this sequel doesn't possess the emotional power of the first (and believe me, it tries). The staging of the fights isn't remotely original and the script is highly predictable. Not much here unless you just wanna follow the legend's predictable progress."}, {"rating": "8", "text": "A sports movie sequel done right, \"Creed II\" takes everything that worked so well in \"Creed\" and augments it to a satisfying degree without entering the realms of silliness that some of the other \"Rocky\" films unfortunately wandered into. The stakes, the circumstances, the character arcs, the time span -- all of it is heightened, making for a fantastically enthralling and invigorating movie-going experience. And with a really nuanced look into the lives and motivations of the antagonistic forces at hand in the film, it all ultimately shapes out to being more than just your average \"good-fighter-versus-evil-fighter\" slugfest. This is a much needed, crowd-pleasing effort with some terrific performances, an epic feel, and a commanding mainstream directorial debut from one Steven Caple Jr. Color this opinion unpopular, but I might just like this one more than the first."}, {"rating": "1", "text": "Every time I try to watch this piece of dreck certain other bodily functions take over. Did it even have a writer out of middle school? Predictable would be high praise for this formulaic crap. If you don't know what's gonna happen from scene to scene, then maybe you should be screened for pre-Altzheimers."}, {"rating": "7", "text": "On its own, Creed 2 is a solid and enjoyable movie with fun fights and emotional moments. Unfortunately, with such a high bar set from the first movie, the sequel just feels like it cannot quite compete. It is more of a copy-paste movie rather than doing something entirely its own and new. Ultimately, that is a relatively small gripe in the grand scheme of it because Creed 2 is still an enjoyable film worthy of your time."}, {"rating": "10", "text": "The Movie is amazing, so emotional, acting is brilliant, just such a great follow up to the original."}, {"rating": "6", "text": "This was...OK.  A totally adequate sequel with some good acting (Jordan & Thompson), some good fight choreography, and some questionable writing.  It's not as subtle or original as the first Creed film, and it's also not as entertaining or over-the-top as Rocky III or Rocky IV.  If I had to compare it to the earlier Rocky films, it feels the most like Rocky 2.  A movie that was more predictable and not as good as the original and was overly weighed down by clunky family drama that wasn't written particularly well and didn't advance the plot or add depth to the characters.  On top of that, this movie has what must be the tenth \"you can't take this fight, you can't win!\" speech given in a Rocky film, but it makes absolutely no sense.  The writer DID do a good job of giving Drago and his son more depth and motivation then any villain in the latter Rocky sequels, but it also has a fight in RUSSIA in 2018 and never mentions the political climate...and never really explains WHY it has to be in Russia since Drago is a contender looking to fight the champ and would have zero leverage to dictate his own terms.  Sly was GREAT in Creed.  He's kind of lost here.  And that's probably the writing, too.  It's like they have no idea what to do with him.  And for some reason he's still broke despite managing a super star boxer that I would assume exists in a world similar to the real world, where even a middle weight champ like Canelo Alvarez has sponsorship deals worth over $300 million.Overall, this is a clumsy film.  Which doesn't mean it's not entertaining or there aren't good parts.  But I can't see it becoming an all time favorite of anyone like Creed, Rocky, Rocky III, or Rocky IV."}, {"rating": "7", "text": "Creed II is not the biggest game changer the Rocky franchise has ever experienced since 2015's Creed, but as much as the flaws hurt Creed II, it still has punches that can defeat most problems with this Creed sequel that people somehow didn't ask for, but deserve it anyways. Creed II packs punches, but even the slightest of a punch can miss the most critical part of the movie. Just don't try to do slight punches because you'll miss your chance to find Creed II a good one."}, {"rating": "6", "text": "A very mixed film in the Rocky Franchise. While Michael B Jordan gives an even better and larger performance then he did in the first this film feels cliché and predictable. You have seen it before, Cheer for the underdog, get revenge, Stand your case. Its the same in every rocky movie but its still fun. Actors are great, it moves at a quick pace and the Boxing scenes are as good as they can be. I believe Creed is finished his side story but somehow we will get a 3rd one. 6/10"}, {"rating": "9", "text": "I love all of the Rocky movies (except Rocky 5), so I was very excited to see Creed II. Although Creed II utilizes the basic formula and structure of a Rocky movie, it works, because it's gotten me to the theater to see an eighth Rocky movie. The performances from the cast are amazing, especially from Michael B. Jordan, and the movie does a great job fleshing out the extremely cheesy Russian villains from Rocky 4. It's not as groundbreaking as the first Creed movie, but the themes and fight sequences are great enough for me to walk out of the theater wanting to see more Creed. Overall, go see it if you like Rocky movies."}, {"rating": "3", "text": "The overwhelming feeling I experienced through most of this film was boredom.  I'm absolutely the target audience for this sort of film - loved the first 5 Rocky films, and really enjoyed the first Creed.  It all ends with this one.  First off, Victor Drago has zero charisma.  The appeal of Rocky IV was Dolph Lungren's charm.  All you have with this new kid is muscles.  And the first fight?  Predictable and tedious.  Even the classic montage sequence which is the backbone of any Rocky/Creed movie? they  ruined it by throwing in those rap sequences instead of sticking with the classic orchestral stuff.  Just a flat-out waste.  Expected to much more from a Rocky IV tribute."}, {"rating": "2", "text": "Loved the franchise but the well is dry. Visuals are great... but this film should be seen on cable so you can fast forward through the predictable parts harvested from every other Rocky film."}, {"rating": "3", "text": "Shadow boxing excuse for a movie; it's a soulless, unnecessary, sheer bore that like its affirmative action insanely over-rated predecessor features a no charisma lead character played by an utterly lackluster actor who's in great shape physically but that's it.  Points for a semi-clever plot digging back into the Rocky canon as Stallone did so cleverly throughout his series and no doubt had a hand in here (He should have called it quits though after the last one!), but the actual antagonist is nearly non-present.  The tone on this spinoff series is wrong and this thing drags badly, one thing Rocky movies never did."}, {"rating": "0", "text": "yawn.............................................................................................................................................................................................................................................................................................................................................................................................................................................."}, {"rating": "8", "text": "I'm a sucker for the Rocky movies! Sure each new installment has gotten a little cheesier over the years, but there's no denying how inspiring and full of heart each of them are as well, and the franchise really returned to form with the release of the first Creed film three years ago! In this go-around, Adonis Creed takes on Viktor Drago, son of Russian boxer Ivan Drago, whom Rocky famously fought in Rocky IV in order to avenge Adonis' father and Rocky's friend Apollo Creed who was infamously killed by Ivan in the ring. The stakes are certainly higher in this film, as Creed fights for honor, his family, and justice for his late father. Michael B. Jordan and Sylvester Stallone also make for a great and inspiring duo once again. And like with many of the previous films, it does feel very derivative at times and borrows heavily from past films in the franchise, but that still doesn't even come close to stopping the film's infectious and inspirational energy, and if it's not enough to get you pumped, then I don't know what is! Overall, even if it does take quite a few pages and tropes from the previous films, it hardly even matters and is more than likely to have any moviegoer pumped and cheering by the film's end!"}, {"rating": "2", "text": "I hate when hollywood revisits all these old movie ideas and rehashes them. For F's sake come up with an original idea and movie. also, enough with the whole racial diversity BS. is that why you green lit this??? wtf. and btw -- no we don't need a black superman or james bond. they're white guys. unless you're going to cast the black panther as an asian, i think we should again, just come up with original characters."}, {"rating": "3", "text": "Creed has been one of the biggest movie disappointments for me. Personally I have loved all the Rocky movies and Creed and have watched them countless times. This movie feels like they should of quit while they were ahead. You can only make a movie with the story line so many times and this just feels like Rocky IV but with different characters. Michael B. Jordan is a gifted actor but something about the movie just seemed corny. The soundtrack was bad and the middle of the movie seems like a snooze. Movie is predictable and the fight scenes are nothing to write home about (which should be the best part). If you are looking for advice I would just watch Rocky IV at your house and get a lot more satisfaction. I would not go see this movie again."}, {"rating": "10", "text": "This movie was nicely paced and the fighting was superb. Adonis continues to struggle with his manhood but takes deep strides in his life and relationships. I will see this again for sure. Not sure why I didn’t see any white people in the theater though. Weird."}, {"rating": "7", "text": "It's one of the better Rocky movies. Yes it's a the same old formula, but it's a winning formula and due to the excellent script and acting it still packs an emotional punch. If you like Rocky movies you'll like this."}, {"rating": "5", "text": "Has cool fight scenes but Creed 2 does nothing new or interesting. Should return to focus on Rocky."}, {"rating": "7", "text": "While Creed II fails to break new ground, feeling rather cliche, and fails to come close to the greatness of the first Creed, it is still a good boxing movie. The relationship between Adonis (played by Michael B Jordan, who is great once again) and Bianca (played by Tessa Thompson, who is also great) is fantastic, the fights are fun, and it's great seeing Dolph Lundgren back as Ivan Drago, although his acting, along with Stallone's, is pretty stilted. The themes in the film are fine and really resonate on the Drago side more than the Creed side. A solid boxing movie in the end and one of the better Rocky movies."}, {"rating": "7", "text": "Overall, it was just fine. It was not great, but it was definitely not bad, it was simply fine. I'm glad I didn't pay full price to see it in the theater, but as a rental, it was definitely worth it."}, {"rating": "9", "text": "\"Creed II\" is a tour de force sports drama that carries forward the Rocky franchise in a fantastic manner."}, {"rating": "5", "text": "+Great cast+Excellent soundtrack+Cinematography is impressive+Looks great in 4k HDR-Plot suffers from predictability-Screenplay is uninspiring-Side characters feel unimportantIn spite of its flaws Creed II is an entertaining watch like the previous movies. It's a shame when it boils down to the same old big fight at the end which is set against an awfully low budget seeming CGI crowd... While the cast are excellent, the film itself feels flimsy with outmoded pacing that doesn't fit the modern clean visuals. The poorly paced and simplistically constructed drama is put to the side to allow for more 'boxing montages' in which old school choreographed fights take center stage. A missed opportunity to deliver higher quality fight scenes with a better dramatic quality."}, {"rating": "8", "text": "If you loved the first Creed film by Ryan Coogler, don't be afraid because the sequel actually does pack a punch. Everything flows organically and the overall presentation of this film directed by Steven Caple Jr. does not disappoint as you watch Creed and Drago go at it in the ring. And trust me, this film felt like a pay-per-view well spent that you don't want to miss."}, {"rating": "8", "text": "Yes!I've been procrastinating on this one for forever, and people kept saying that this one isn't as good as the first Creed. That blinds us easily. It easily makes us think that something's just straight up not worth watching because it's \"not as good.\"But this thing was great. I like that it didn't forcefully introduce any new characters but instead just developed Creed, Bianca and Rocky more. Those are the characters I enjoy watching and there was more to learn about them so why not? Bianca has a small singing thing going for her and she sounded gooooooood. The only thing I was a bit indifferent on was the pregnancy ****. It happens immediately after they have sex after Creed proposes. Why does it always happen like that? Like they've been together for a while and only now she gets greganananant. Did they have sex for the first time? That whole thing was pretty pointless overall.While fine to watch, the story follows the same predictable formula. It's the same thing again; Creed wins a fight, takes another fight since he's overly confident and loses it and then you go through some mental ups and downs and get ready to fight the same dude again. Nothing groundbreaking is done here, but the directing is good so it's still enjoyable to watch. The training montages were great, the character moments felt genuine, and the camerawork was fun, albeit not as creative as in the first Creed. Bianca's small music subplot is used creatively during the last fight's entrance which I thought was very surprising and awesome. The soundtrack to the movie itself was great too. Rap, once again, by many artists that specifically made music for this film. I loved it.The antagonist or whatever the **** main boxing bad guy was pretty good too. Nothing too special but they took an old bad guy from the Rocky's who had cummed a son, and made the son some sort of killing machine. It was an interesting twist, but it's not like Creed was gonna lose anyway since the whole movie builds up to that last fight in the same way every Rocky movie does. But it was fine. Not the old bad guy though. The actor was bad. Also sometimes the fight scenes looked fake and the audience looked like two extras copy pasted to be an entire boxing audience. Maybe the director was high ¯_(ツ)_/¯That is all :D"}, {"rating": "7", "text": "It was good movie even though a bit cliche and predictable story in a way. I enjoyed it, but not as memorable as other Rocky/Creed parts."}, {"rating": "6", "text": "Não é tão bom como o primeiro, é mais obvio o que acontece mas mesmo assim mais uma vez Michael B Jordan brilha no papel e só isso faz o filme ser melhor."}, {"rating": "9", "text": "It is unusual that a sequel managed to be so close to duplicating what the first chapter achieved. One of his points in favor is the emotional charge and the dynamics of the fights in the ring. I know there is no such thing, but that's how the fourth chapter of Rocky (1986) should have done. In the name of 80s nostalgia, the appearances of Dolph Lundgren and Brigitte Nielsen."}, {"rating": "9", "text": "Enjoyed this as much as the first Creed. Well directed, especially considering that this is the director's first big budget film.The best thing about the film is that it has something missing from the Rocky franchise after IV, a really good opponent. Whereas Ivan Drago was like a machine, his son Victor is more like a vicious animal in his fighting style. He actually seems agitated while having to wait to fight. It doesn't hurt that he is a mountain of a man. He's also the most sympathetic villain in the Rocky canon. Once I learned his history and motivations, I honestly didn't have it in me to root against him.The cast is great all across the board. Again, Sylvester Stallone has Rocky nailed down. Although Adonis Creed has his moments of bad decisions and lashing out in a jerky and immature manner, Michael B. Jordan does such a great job of expressing his vulnerability and raw emotion that you can't be upset at him. Although it is a small role, Russell Hornsby has an excellent scene as a pragmatic and opportunistic fight promoter. You kind of wish he was in more of this. This is also probably Dolph Lundgren's best acting.The only major downside is that the movie suffers from following similar plot beats from other films in the franchise."}, {"rating": "8", "text": "While Creed II adheres maybe a little too closely to the classic Rocky formula, a good script and great acting from Michael B. Jordan and Tessa Thompson make this an admirable effort from director Steven Caple Jr."}, {"rating": "8", "text": "As I see sport film after sport film being adapted or created i keep thinking that this it this is the last one theres nothing creators can do after this especially being that this is a sequel but creed 2 is somehow a second revitalization of sport movies along with its prequel creed,its great but a undeniable amount of magic and chemistry among the cast and movie making has left the set and it just is not quite the same still great though."}, {"rating": "8", "text": "Great SequelThough it’s not as good as it’s 2015 predecessor, Creed II is still a very fun film and follow up to Rocky IV."}, {"rating": "8", "text": "Comparing to the first Creed this one lost strong in one aspect, wich is the direction, we won't find in her those incredible camera moviment, long takes and really smart positioning that we had with Ryan Coogler before, in here it is ok, there aren't many different or creative shots as we had in the first one, but this is by leveling from up there, because, again, is not bad at all, is just not very unique. The cinematography does have some nice points, but really few and fine, but again, there isn't comparison to the first one.In the first film, and in other Rocky films, sometimes we had an opponent where he doesn't have much substence, it is just a strong and hard to beat dude, wich maybe what it is in Rocky 4 for example, and i found it very important to not be like that, when they made you care, almost equally to both sides, then this is a story that it is great, and, fortunately, this is what happens in here.The way that they built the whole Victor Drago sequences is really good, he isn't just a evil guy that wants his name on the top, it is way beyond that, his back story with his mother and father are strong and you can see that he is doing that for bigger reasons, to make his dad proud and for take back their lifes how they were before Ivan lost the fight for Rocky, and you can see that a lot of times, how Victor react to certain things in some moments are really touching, you wish him better and you unserstand him. Considering this, it gives a nice resume of how this movie reaches in our personal life, this movie is a lot about fatherhood. We have the Drago relationship, the kid trying to \"fix\" old things and making his dad proud. Adonis with his daughter, that gave him a lot of extra, gave him inspiration to go on and be better with his hardwork. And Stallone with his son, that he wants to speak with him, but it is afraid of getting into ans messing something up, so as with his father, that he still wants to make him proud and make the name giant, it is very well made. This is strong, father and son relationship is a strong thing, able to make you do things that you wouldn't believe, with the body and even more with the mind, and i think that the film represents this really well.There are two training sequences herre, the first isn't a big deal, there is a nice montage with a cool ending, but nothing very special or different. Now, the second one is amazing, they go all the way back into no training in technological places and going to nature, get into the desert and that whole sequence is so great, so inspiring, so strong, so painful and raw, they could do a different thing with different training sessions or even the same but in different ways that end up being fantastic.Ivan Drago character was really good, almost everything, since where and how he lives with his son and how he manages to do the training, you can see the necessity to win and get back what he used to have before the Rocky 4 fight. More to the end one thing happen and there you can see a big character transformation, was really emotional and really well done, wich also is in function of the very nice Dolph Lundgren job together with the Florian Munteanu job, they both had nice chemistry, we could totally see how Victor was struggling and trying to help his father to get back up in life and the end he have some really touching moments, they both.Another nice script moment is the one where Adonis and Bianca daughter was born, in determined moment a possible tense moment is happening and it is crucial for what is going on in the story, and the way that it is done, without even one dialogue, showing great acting by Michael B. Jordan and Tessa Thompson, it was so strong and so real, one of the best scenes in the whole film. Stallone is also great in this film, he is a lot like in the first one, but in here he does have a nice improvment in the fatherhood part also at the training one during the desert. There are some really nice dialogues in this film, some really deep and wise things said that can be used in your life. There are strong and provocative moments that worked just well with Ivan Drago. But at the same time there some that could have had better moments, like the first conversation between Rocky and Ivan, it was ok, but it could have been even stronger. Dialogues between Adonis and Bianca in this one also get much better, Bianca have way more to do in here and she helps a lot in the inspiring part.Creed 2 gets exactly where it should, it is not just a boxe movie, it is a movie that talks about life, about struggle, change, difficulties and how to get up and keep fighting, even when you fall, get up and keep there because it is worthy the hard work of something that you love. Talking a lot about parenthood, making others proud and having something more to keep you hardcore, this is what it is about and it is beautiful and inspiring."}, {"rating": "8", "text": "Creed II. Fight of the heirs. An interesting sequel to the new chapter of the Rocky series. The first half of the film, as expected, is not very interesting, but the second, as always, is on top. A hell of a workout and of course the final battle of the sons of two great boxers."}, {"rating": "6", "text": "As much as I was entertained by this sequel this didn't wow me like the very first Creed movie. Personally I liked the actual Rocky 4 more than this rehash of this Rocky 4 plot. Michael B Jordan and Dolph Lundgren had the of standout roles. Everyone else just seemingly went through the paces for a pay check."}, {"rating": "7", "text": "After the surprisingly amazing first Creed, there was huge expectations for the second one. However, director Ryan Coogler does not return for the sequel but is instead directed by Steven Caple Jr. Let start with the positive.The film brings back over the top villain Ivan Drago and introduces his son Victor Drago. What this film does great is actually make Ivan Drago human. We actually care a lot about what is going on with the Drago family and my only disappointment is that we didn't really get to see more of them. The film also has some great music albeit not as good as the first in my opinion. Likewise it has some great boxing scenes but again it ain't as good as the first one which also had the amazing one shot fight scene.The film feels like Rocky II and Rocky III combined as it has Creed dealing with his new fame but also being challenged by a raw powerful boxer. The director manages to give more depth to the characters especially with these drama.The actors also all give a great performance as usual.Lets go over the negativesCreed II does not really change the Rocky formula and this film retreads a lot of the same grounds that was in the first Creed. It retreads the Rocky giving Creed the mantle again. It has Creed trying to live up to his father, again. It has Rocky and Creed drama, again. Additionally, Creed's motive doesn't always feel necessary or right but people just support him anyway. He wants revenge but doesn't even remember the fact that Rocky did that in Rocky IV? The film can basically be summarised as \"not as good as the first one\" but if you love the Rocky franchise or enjoyed the first one then there is no reason not to give this one a watch"}, {"rating": "6", "text": "While this was a solid movie and entertaining from start to finish, there was something missing, something in it that evoked melancholy. In contrast, the 1984 movie between Stallone and Lungren was awesome. It was now, it evoked the height of the cold war, and there was no has beens, but right nows. Even in this movie when the big fight finished, there was a silent sequence while Rocky observed it from an old man point of view. This made it kind of a rehash. Let me put it this way: Back to the Future was the exciting original. Remember in Back to the Future Part 2 they had to rehash it and go to some of the same places he originally was in the 50s and it wasnt quite as good? Same thing. Great fight sequences however."}, {"rating": "6", "text": "Decent enough, but adheres too rigidly to the Rocky templateAfter Rocky Balboa (2006) did the seemingly impossible, redeeming and concluding the franchise after the damage done by Rocky V (1990), Creed (2015) did something even more unlikely - revitalising the franchise with Rocky as a supporting character. For the sequel, Stallone is back as a writer (sharing credit with Juel Taylor, from a story by Sascha Penn and Cheo Hodari Coker), with Steven Caple Jr. directing. And whilst it hits all the beats one expects from a Rocky movie, the problem is that it hits them slavishly, and does little else.Set 33 years after Rocky IV (1985), Ivan Drago's son Viktor (Florian Munteanu) is training as a professional boxer in Ukraine. Meanwhile, in Philadelphia, three years after his professional debut, Apollo Creed's son Adonis (Michael B. Jordan) is preparing for a championship bout, unaware that the Dragos have him in their sight.Thematically, legacy is a huge issue in Creed II, particularly as it relates to fathers and sons, examining the emotionally fraught terrain that can result when fathers try to live vicariously through their sons, and when sons must live with their father's failures.In relation to this, the depiction of the Dragos is especially interesting. In Rocky IV, Ivan was a cartoon villain. In Creed II, he's still relatively thin as a character, but Lundgren is given enough room to portray him as essentially broken, living on nothing but bitterness, resentment, and shame. One gets the impression that from the moment of his loss he's been waiting for this, seeing his son as nothing more than the delivery method of his vengeance. Ivan has raised Viktor in pure hate, teaching him that the only thing that matters is winning, but you can see in every move that Viktor makes he's far more concerned with earning his father's respect - winning as an end unto itself means relatively little to him. There's a lot of pathos in that, and both Lundgren and Munteanu act the hell out of it.The training montages also do something interesting in respect to Viktor. Showing him jogging through economically impoverished communities, stacking crates, lugging around bags of cement, and working with less than state-of-the-art equipment, the parallel is not to Ivan, who trained with hi-tech gizmos and gadgets in Rocky IV, but to Rocky's training in the original Rocky (1976). Indeed, whilst Adonis lives in a luxury apartment, Viktor and Ivan live in a dingy bedsit in Ukraine that recalls Rocky's original digs in Philadelphia.The problem with all of this is that the Dragos' story is by far the most compelling one in the film. Set against the complex and fascinating Drago family drama, Creed's story is pretty insipid. And this feeds into the film's most egregious problems - its rigid adhesion to the Rocky template, and the concomitant predictability. Chances are that everything you think might happen in Creed II does, as the film makes no attempt whatsoever to be original. Aside from the Drago subplot, there is nothing here that we haven't seen before. Granted, the Rocky franchise has always tended to wear its predictability like a badge of honour, and the core template does work. But even when a film adheres to that template, one shouldn't be able to predict each narrative beat with near perfect accuracy. Even Rocky V, as awful as it was, tried something new. It didn't even remotely work, but the thinking behind it was admirable. Aside from two unexpected cameos, Creed II never once caught me off-guard, and because of that it's is interminably boring at times.Even the boxing itself is not especially well-done. Kramer Morgenthau's cinematography is fine, but nothing special, and pales in comparison to Maryse Alberti's work in the first film. Aside from Raging Bull (1980) and Ali (2001), both visually unique in their own ways, Creed is arguably the most technically proficient boxing movie in terms of in-ring competition. Creed II, however, shoots all the fights conventionally, holding a fairly uniform three-quarters distance from the actors, with Caple Jr.'s only trick seeming to be slow-motion, which he grossly over-uses.Although there are some laudable elements here, Creed II is a disappointment. Sure, the Rocky melodrama is there, the Rocky fights are there, the Stallone one-liners are there, but with a narrative focused almost entirely on the less interesting characters, this is a missed opportunity. Apart from the Drago subplot, everything is by-the-numbers. Yes, we care about these characters, but that's because of the previous films, and whereas Creed forged a path very much its own, Creed II returns to the overly familiar."}, {"rating": "8", "text": "let me first start with telling you that this is a good sequel. The movie delivers upon creed and expands on the world and narrative The sound design is also great and the end Absolutely made me cry. I recommend this movie to everyone who liked the first one. But if you did not like the first one, You won't like this one either"}, {"rating": "8", "text": "Vale pelas lutas, apesa que quando está fora do ringue o filme é meio cansativo e um pouco chato, mas vale sim"}, {"rating": "8", "text": "An excellent movie, with professional cinematography. Whilst watching  the movie, I was pleased by the fighting scenes as they were immensely enjoyable, besides that however, I also found myself intrigued by his motivations for fighting. A perfect balance between fight scenes and story development."}, {"rating": "7", "text": "A real great movie and with a great message, in perfect line with the first installment, i hope in a third movie."}, {"rating": "10", "text": "Magnifica pelicula muy emotiva y épica genial la actuación de los Drago y de Rocky como no podia ser de otra forma , las escenas de entrenamiento,las peleas ,musica y naarativa de las mejores de la saga, muy recomendable ver en cines Creed 2 y imprescindible si eres fan de Rocky"}], "recommendations": ["creed", "avengers_age_of_ultron", "bumblebee", "top_gun", "ant_man_and_the_wasp_quantumania", "the_magnificent_seven", "the_equalizer", "skyscraper", "rocky_v", "x_men_apocalypse", "angel_has_fallen", "the_equalizer_2", "rocky_ii", "spider_man_far_from_home", "the_accountant", "kingsman_the_golden_circle", "nobody", "king_arthur_legend_of_the_sword", "hanna", "infinite", "thor", "super_8", "taken", "spectre", "the_godfather_part_iii"]}