{"id": 2585, "title": "Crimson Peak", "starring": ["Mia Wasikowska", "Jessica Chastain"], "runtime": 119, "genre": ["Horror", "Romance"], "description": "In the aftermath of a family tragedy, an aspiring author is torn between love for her childhood friend and the temptation of a mysterious outsider. Trying to escape the ghosts of her past, she is swept away to a house that breathes, bleeds… and remembers.", "releaseYear": "2015", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/s6cFBCAlfFBwBKVgJOme3JpjZLo.jpg", "categories": {"plot": 7.723076923076923, "acting": 7.844444444444444, "ending": 7.4, "soundtrack": 5.0, "cinematography": 8.428571428571429, "familyFriendly": 3.0, "funny": 8.0, "action": 7.0}, "reviews": [{"rating": "10", "text": "A modern gothic romance masterpiece. It is an impeccably acted, beautifully shot, soulful piece of art. Guillermo del Toro has delivered another work of genius. Jessica Chastain is the greatest."}, {"rating": "8", "text": "A surprisingly disturbing, grim and moody movie with superb visuals. The good cast is there too. The story may not be the most original and unexpected, though it has some scary and disgusting moments. If you value the downbeat atmosphere in movies, you should give this one a go."}, {"rating": "7", "text": "del Toro made a beautiful love and problematic story, with stunning visuals. While we don't have a lot to be scared of, Chastain does all the work on her dark and dangerous role that hunts everyone and causes a few deaths. Hiddleston is more of a victim of all of this and his character doesn't give him the chance to shine a lot but his performance is quite sweet. Wasikowska is a darling. She seems smart in the beginning but she takes a lot of time to realise where she's getting into, probably because of her innocence. Hunnam has very few space in this, which is a shame. In a nutshell, the story manages to hold our attention throughout the film. We know there's something wrong with Crimson Peak since the start but the script reveals us everything on the right time and it's cool to have that like this, not everything explained just in the final sequence. Well done del Toro!"}, {"rating": "8", "text": "\"Crimson Peak\" is a visually striking, wonderful tale of manipulation and love with amazing production design and cinematography, and especially incredible work from Guillermo del Toro and Jessica Chastain."}, {"rating": "9", "text": "Beautiful scenes and settings, immaculate costume design, wonderful acting, intensely suspenseful, and even gruesome in a few places. It's not related, but I kept thinking of Bram Stoker's Dracula and Interview with the Vampire while watching. Love the gothic horror theme. The plot had some twists and turns and the ending was surprising and satisfying, like a good meal."}, {"rating": "7", "text": "Excellent performance from Tom Hiddleston and a very dark but convincing Jessica Chastain. Costume and set design were something to admire, however the emotional side of the story was very hard to believe and felt incredibly rushed. Although saved by a thrilling and terrifying ending scene between our main characters"}, {"rating": "7", "text": "Crimson Peak is a very decently made movie. it’s hard to discuss it without giving away tons of the plot twist and I will say I was gripped, even though I don’t think the film fully realises what it wants to be.  I can recommend it as a good gothic story though I would give a word of caution that just after you have seen it you realise that it wasn’t that good even though you are gripped whilst watching it.  The thing that really keeps this thing going is the great cinematography, the design, special effects and the cast, particularly Jessica Chastain who, as I mentioned earlier, I  rally want to see nominated for an Oscar next year for this role and I hope the film gets some other nominations for the technical categories.  I can recommend it, though I would say, wait for this one to come out on DVD and if you are not completely sure about it, rent it first before you buy it.\r Guillermo del Toro has done a decent movie, but it’s definitely not up their with his classics like Pan’s Labyrinth and The Devil’s Back Bone."}, {"rating": "7", "text": "We’ve come to expect a certain level of creativity and high production value from a Guillermo del Toro film over the years and ‘Crimson Peak’ exceeds these expectations with a stroke of artistic flamboyance that makes it a masterful portrait of moving images.\r It’s no surprise that this film is a feast for the eyes and ears, a triumphant combination of spectacular production and costume design with stunning cinematography and a powerful soundscape, no doubt ‘Crimson Peak’ will be tough to beat across a number of technical categories at next year’s Oscars.\r Tom Hiddleston’s performance as the conflicted “Sir Thomas” is accomplished but the centrepiece of the film, aside from the house, is the foreboding relationship between Mia Wasikowska’s “Edith” and “Lady Lucille”, brilliantly played by Jessica Chastain, who despite the supernatural terrors is the true dark heart of ‘Crimson Peak’.\r However the narrative and the very nature of the film are both its strength and weakness depending on your point of view. ‘Crimson Peak’ is simultaneously a gothic romance, period costume drama, murder mystery and a stylish horror picture that harks back the “Golden Age” of Hollywood, albeit with Del Toro’s modern artistic strokes and 55 million dollar budget.\r But straddling several genres without committing strongly to a single one leaves 2 ways of taking in the film. If you’re cinematically open-minded you might take positives from each of the elements whether you’re a fan of those types of films or not. Alternatively though ‘Crimson Peak’ might be too melodramatic and not horrific enough for horror fans, or too horrific and not romantic enough for costume drama fans, and is held back by faithful but often tedious Gothic drama dialogue.\r The Bottom Line…\rAlthough it spreads itself a little thin in terms of narrative, ‘Crimson Peak’ is more than satisfying enough to keep audiences engaged throughout, and weaves a stunningly vivid cinematic tapestry that reintroduces dark Gothic beauty to modern cinema."}, {"rating": "7", "text": "Had a few weak points but all in all, a much better film than Pacific Rim. Tom Hiddleston and Jessica Chastain were excellent. Mia Wasikowska and Charlie Hunman were pretty good too. As can be expected from a Guillermo Del Toro film, the visuals were stunning and definitely Oscar worthy. Also Oscar worthy was Chastain's performance. She portrayed her character brilliantly and certainly deserves Best Supporting Actress. Some parts were a bit predictable but in spite of its flaws, it's still an intriguing, enjoyable movie. A combination of Val Newton and Alfred Hitchcock."}, {"rating": "10", "text": "This is the kind of movie i grew up watching and they dont make them like this anymore! I am 60 years young, but I still enjoy a good gothic romance and this one delivered! The visual artistry alone is worth seeing!!"}, {"rating": "9", "text": "Solid 9. One of the few movies I really enjoyed this year. The ending was a bit rushed but everything else was well played. I did enjoy that everything was tied to the very start"}, {"rating": "8", "text": "Crimson Peak is a Gothic Ghost Story that tells the tale of love, loss and betrayal. This film is a Del Toro film through and through, focusing on atmosphere and characters over bravado and cheap thrills. If you are expecting a horror film, you will be disappointed. It is a Gothic Ghost Story more akin to Wuthering Heights than Bram Stokers Dracula.\rSolid Film, Gorgeous Visuals and excellent cast. 4/5 Worth seeing."}, {"rating": "8", "text": "The art design, the colors and every part of this movie is just visually stunning, simply wonderful to watch. \"Crimson Peak\" comes up being a macabre gothic tale that takes this genre to another level."}, {"rating": "10", "text": "Director Guillermo del Toro creates intricate worlds filled of  reality of  flesh and blood that generate overwhelming viewers and memorable masterpieces (Crimson Peak). \"Crimson Peak's\" atmosphere focuses on passion and love , sex and lies, and dark secrets. In the movie there are two kinds of monsters (The Ghosts and Lucille Sharp (Jessica Chastain)) but the Scarlet Summit and the characters in general  are the most terrifying thing onscreen. Guillermo del Toro  has enough professionalism to bring us to the beautiful Victorian-era England.\r All the movie is fantastic but in Allerdale Hall really begins \"Crimson Peak\", obviously the introduction to the life of Edith is important (especially the warnings of her mother).The colors are autumnal, mustards and oranges. Kate Hawley takes one of the aspects resaltables of the movie. Lucille slashes through that mellow golden landscape in fiery-crimson dresses or heavy all-black gowns. On the other hand, Allerdale Hall is a daunting ruin where there are spaces too large or too small  giving us the perfect atmosphere to scare the entire planet, but the most gruesome of the mansion is the constant red clay that threatens to sink into the pleasure of the movie.\r Edith's trips all over the house and the warnings of her sister - in - law (that there are rooms she must not go into) .\"Crimson Peak\" has a beautiful wardrobe, dark secrets, a hunsband who seems a stranger, a sister- in - law hiding something behind cups of tea, a pap , an ax and a strange obsession with her brother and her macabre secret with \"Mother\".\r As in \"Pan's Labyrinth,\" \"Crimson Peak\" engenders an atmosphere of great proportions for great performance. The images themselves have tremendous power: A blonde woman sneaking through a dark house holding a candelabra. A black-haired woman stalking through an interior snowfall, carrying a tray of rattling tea cups. A man in his workshop creating toys that open their mouths to vomit silver balls. Edith sees horrors at night through doorways, down hallways. She must be brave enough to face these phantasms, to look them in the eye, to see what she is not supposed to see. On the opposite side, Thomas and Lucille must prevent Edith from seeing.\r Del Toro is of the old - school, and reminds us in \"Crimson Peak\"   through totally extinct tricks nowadays, (as transitions from scene to scene or where a circular shape surrounded by blackness homes in on one small image) covering us  mainly black in color (circles , hugs or transition ).\r Mia Wasikowska as Edith Cushing is just perfect for this role, this is the work of her career, there is no one to surpass her ability to convey the terror on her face, Tom Hiddleston as Sir Thomas Sharpe plays with his character around the movie , playing as the protagonist or antagonist ( the style Miles Teller - Peter Hayes - in Divergent Series),   Charlie Hunnam as el Dr. Alan McMichael is the undisputed hero and the best for last Jessica Chastain as Lady Lucille Sharpe begins with a minor character but as the film progresses Jessica performs one of the best characters in his successful career, She is the point of the movie surprise.\r \"Crimson Peak\"  is Guillermo del Toro's a worthy project. \"Crimson Peak\" overcomes \"Mama\", \"Pacific Rim\", \"Pan's Labyrinth,\" or any other movie made ​​by Guillermo. This work is a masterpiece of a decade.\r See del Guillermo films  is an absolute pleasure , full of emotion , terror, ambition, perfection and foremost excellence and superiority.It's true \"what terrifies him will terrify others\" and \"Crimson Peak will terrify entire universe."}, {"rating": "10", "text": "A large scale Gothic romance complete with all the graphic artistry to lure our senses into the decrepit beauty of Crimson Peak.  The psychological currents under the surface of the characters fills the atmosphere where their inner desires and fears manifest around them. Guillermo Del Toro is a master at depicting this visually. In Crimson Peak he's made a large scale, visually beautiful, classic Gothic romance in the literary and cinematic tradition of the genre.  It's an experience for the senses as you are kept in increasing states of sexual tension and disconcertment.  Definitely best seen on the big screen.  I love Gothic romance, and Crimson Peak will be considered one of the best execution of the genre."}, {"rating": "8", "text": "A gothic tale of ghost and crime with the seal of Iron Chef Del Toro. The story starts slow but is compensed with some effective scares. Hiddlestone and Chastain does the needly for make it work. Give a chance."}, {"rating": "8", "text": "Crimson Peak is a hard film to identify. Yes, it is a gothic romance, but with it blending so many different genres on top of that, it is certainly hard to fit into any circle. That being said, I am more than happy to let it be on its own and just sit back and enjoy. Thanks to truly beautiful visuals, Crimson Peak absolutely soars and confirms my love of Guillermo del Toro's films. It can be truly violent a couple of times and does manage to scare on a couple of occasions, but its usage of ghosts in a non-scary role is truly brilliant. The design of the supernatural elements is great and they are certainly metaphorical of something, but I am personally having trouble placing my finger on what. Though it is not scary, the film manages to still be deeply unsettling thanks to the great performance of Jessica Chastain. Mia Wasikowska and Tom Hiddleston were also particularly strong here. There are numerous things that stand out to me beside these things, including the symbolic usage of bugs, the brilliant costume design, and the fantastic production design. The whole lore of the mansion, the explanation of the name, and my God the visuals. I know I mentioned the visuals, but the cinematography and visual effects were absolutely phenomenal. Those alone are worth the price of admission. Crimson Peak will ultimately be looked down upon for not being scary thanks to a horrific marketing campaign, even though its intent is not to scare you, which is truly tragic because it is a wonderful film that is masterfully directed by del Toro and has a powerhouse performance from Chastain."}, {"rating": "8", "text": "Del Toro's visuals and the acting of the three leads turn a blah story into a interesting movie. Definitely worth the watch, but know this: It is not a horror movie. More like a Gothic Romance/Ghost Story."}, {"rating": "8", "text": "Really good film. Enjoyed it very much. Despite I'd not call this a horror (only a couple of screamers during the whole movie), it's spooky what only makes this thriller much better. Really loved the story about Loki and his sister and it was very interesting to watch how the young lady investigates it (because the stuff is really complicated (well, in my opinion)).\rP.S.: The only thing I would like to add is that I was really sad about how it all ended for Loki... =*("}, {"rating": "9", "text": "Crimson Peak is a predictable gothic horror/romance that has a cliche'd plot and twists that you can tell just a mile a way, but co-writer director Guillermo Del Toro creates a elegiac, campy atmosphere that will haunt and you keep you interested at the story. Is it a masterpiece? No, Toro and his co-writer Matthew Robbins make an captivating story, that sometimes can be original and dab it with smart old-fashioned humor, the film is like a painting the colors are pure ecstasy and the watching the story is breathtaking. Mia Wasikowska (Alice In Wonderland, Friends With Kids) is somewhat okay in the film, but she is a revelation and makes this script work. Wasikowska plays Edith Cushing dreams of being a writer but blames her set backs on her handwriting because it gives her away as a female. Her father Carter (Jim Beaver) who's a business man who distrusts Thomas Sharp (Tom Hiddleston) who comes to Buffalo with a business proposal but quickly falls for Edith. After Carter bribes Thomas and his evil little sister Lucille (Jessica Chastain) back to their home in England things began to unravel. Edith marries Thomas they move into this mansion with Lucille who sulks about the property while making tea for her new sister in law. The performance here are stunning, so far this is the best performance I have ever seen from Jessica Chastain and Hiddleston is great as well. Grade A-"}, {"rating": "8", "text": "Misleading advertising has ruined many a movie, and unfortunately, Crimson Peak is another victim of poor marketing. Trailers made the movie out to be similar to recent scare fests like The Conjuring when it is actually more Gothic and romantic like Sleepy Hollow or Bram Stoker's Dracula. With all that being said, Crimson Peak is a very engaging and creepy film. Crimson Peak is about a woman named Edith, whose heart is stolen by a stranger who leaders her to a mysterious mansion atop a hill of blood-red clay, but she quickly learns that the house and her lover hold dark secrets. What may disappoint horror fans is that this movie isn't very scary. Apart from a great deal of dread and a couple of nail-biting sequences, Crimson Peak is not a horror film. Edith describes this film perfectly when she is describing a manuscript she wrote: \"It's not a ghost story; it's a story with ghosts in it.\" It's a beautifully filmed, sexual, violent Gothic romance. There are great performances from the entire cast, with Mia Wasikowska and Jessica Chastain giving standout performances, but the best character in the film is the house itself. The mansion's elaborate and darkly beautiful design make it one of the most memorable haunted houses in film, and every single shot of it is like a piece of art. Del Toro paints such stunning imagery in Crimson Peak that you could pick any frame from the movie and hang it as an art piece. He directs each actor and shot with grace and elegance that it makes up for the film's rather predictable plot. Crimson Peak isn't Del Toro's horror masterpiece as some people were expecting, but it is a beautifully crafted work of Gothic fiction that should be a suitable diversion just in time for Halloween."}, {"rating": "10", "text": "Crimson Peak, mas allá de su cruda violencia o de su excelente fotografía, su bello vestuario o su increíble sonido o diseño de arte, es una película con elementos clásicos del cine de terror y horror original. El cine de terror de estos tiempos se a vuelto simple, mediocre y estúpido, se caracteriza por tener screamers poco originales y muy gastados acompañados de una historia sin sentido y aburrida. Pero en esta ocasión, Guillermo Del Toro retorna al horror clásico de una manera espectacular y sutil, no hace falta que un fantasma aparezca enfrente de la pantalla ridículamente con un grito acompañado para causar terror (Hola Actividad Paranormal), Crimson Peak juega con el sonido y el ambiente (Spoiler) \"Aquella escena del pasillo en donde el fantasma sale del suelo es espectacular y terrorífica a la vez\" La imaginación de Del Toro es brillante y el diseño de los fantasmas (así como los efectos visuales) son únicos y excelentes. Considero que esta película no es del todo \"terror\" pues tiene romance, misterio y suspenso y horror. Es una perfecta combinación entre la imaginación de Del Toro con una historia de misterio al mas puro estilo de Alfred Hitchcock."}, {"rating": "9", "text": "The decision to go see this movie was totally last minute. We were in line to see Witch Hunter, but I last minute changed my mind and I definitely don't regret it. By no means am I anywhere near a movie critic, but I also hate scary movies and for some reason I opted to see this.\r The acting in it is amazing. There was only one scene in it where I had to close my eyes, and it wasn't because I was scared, it was just really gory and I can't really handle a lot of blood and gore. I've always had a soft stomach for stuff like that. It had it's jumpy moments, but wasn't terrifyingly scary. Which actually worked out in it's favor, because it really helps you focus on the love story and the plot twists of the whole thing. I absolutely love Tom Hiddleston, and his acting in this is amazing and he's just gorgeous in it.\r If you're afraid of scary movies and aren't sure if you should see this, do it. I'm starting to slowly love scary movies, and this is just enough for someone who doesn't like them to want to watch more. It's got a few scary bits, but nothing terribly astounding. It's just a beautiful story and I don't regret spending my money to see this."}, {"rating": "8", "text": "The clay, the snow, the crimson peak. It's a magnificent film Guillermo del Toro has crafted here. Visually rich and beautiful, it captures the viewer's eye throughout its entirety. During the film, however, I caught myself concentrating on the technical aspects, rather than the emotional ones, but still completely got an appreciation for the compelling performances, especially Chastain's and Hiddleston's. It's by far the most scary and gory work del Toro has produced (not including The Strain). I was legitimately surprised by how much blood there is, and found the suspenseful setups brilliant. Why a 4-star rating? I thought about that a lot, because it really is a smart film. The truth is that, regardless of how dark, emotional, mystical even, it manages to be, the plot is quite boring: two siblings in search of a female, wealthy suitor in order to finally get a machine to work. There's something about that that feels dull to me. Also, the final act is a masterpiece in its execution."}, {"rating": "8", "text": "Interesting and well acted. The movie is visually stunning. Not a wholly original plot but captivating none the less. Recommended viewing for those who like dark fantasy with imaginative storytelling. A tier above recent Hollywood \"blockbuster\" type movies."}, {"rating": "8", "text": "Del Toro did not disappoint. Rich graphic details such as light shining directly through the broken roof, past the falling leaves to pile of snow below help immerse audience in the beautiful 19th century Gothic, dark romance thriller. It's not a horror movie, but more like a movie with ghosts. I recommend it if you can stand the jump scare and ugly looking apparition"}, {"rating": "9", "text": "Del Toro takes his time to get to the violence, but he never let go the audience and captures their attention with a magical and gothic aesthetic.\r Watch this movie here http://www.watchfree.to/watch-2a4529-Crimson-Peak-movie-online-free-putlocker.html"}, {"rating": "8", "text": "My expectations were higher since Guillermo del Toro movies are always enjoyable, the story is kind of predictable and I didn't get scared :v But I enjoyed watching those rads fx and the acting."}, {"rating": "7", "text": "Good modern take on a gothic movie. Full of undercurrent emotion. All that crimson is a tad over the top at times, but otherwise an indulgent way to wallow in some melodrama while waiting for the inevitable thrills and spills. May well revisit this one, but it would have to be alone as the rest of the family would probably find the levels of brooding passion and the final scenes a little uncomfortable."}, {"rating": "10", "text": "Hauntingly Beautiful Gothic RomanceGuillermo del Toro is a director and artist whose films fall into two distinct categories: big budget English language blockbusters like \"Hellboy\" and \"Pacific Rim\" and lesser known, low budget Spanish language horror films like \"Devil's Backbone\" and \"Pan's Labyrinth\". His latest film, \"Crimson Peak\" is what happens when these two worlds collide, in other words, a big budget English language horror film.\"Crimson Peak\" is set in the late 19th century, first in New York, then in rural England. Edith Cushing (Mia Wasikowska) is a young budding writer who is intelligent, beautiful, and strong willed, refusing to"}, {"rating": "10", "text": "kguguinininhiihihuftseadtugihojjopkpkojonniibguyffyyfugguugihhihiihihihihugfyughiiihhiihihihihihihihihihihhiihih"}, {"rating": "10", "text": "$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.》■》■》■》■》■》■》■》■》■》■》■》■》■》■》■》■"}, {"rating": "10", "text": "●°●°●•●°●•●°●°●•●°●°●°●°●°●°●●°●°●°●°●°●°●°=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_"}, {"rating": "10", "text": "⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙■●■●■●■●■●■●■●■¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡**************************"}, {"rating": "9", "text": "This movie was great. I usually struggle with gothic genre movies. I find they become too wrapped up in themselves, and leave me out of the equation. This movie was different. It has everything I like about the gothic genre (amazing old house, victorian-era, etc), and nothing that I don't like (confusing plot, confusing language, strange characters). I found I could relate to the story and the characters, and for this to happen in a gothic movie is amazing.\r Not to mention it has great special effects and the way they shot it was very good too. Go and see it, you'll enjoy it!"}, {"rating": "8", "text": "Exceeded my expectations. The film was perfectly cast and everything about the movie (wardrobe, scenery, visuals etc.) just looked great .  Of course, being a Guillermo Del Toro film,  Ron Perlman made a surprise cameo as the house."}, {"rating": "6", "text": "I had such high expectations for this movie! Pan's Labyrinth, like many, is one of my favorite movies of all time, and The Orphanage is probably one of my favorite ghost movies. Understanding that this was a different type of film, I was still hoping for a similar delivery. First of all, the plot is predictable, which would be fine if there was enough meat to the story or horror to fill the time, even if you know what the end is going to be. There was little tension, almost no mystery, and the ghosts seemed like an afterthought thrown because the plot was unable to hold its own without them. The acting was great, and the visuals were gorgeous, so if you are looking for pretty images without much substance, this film is for you. If you are looking for a rich and involving plot, with a supernatural undertone, look elsewhere."}, {"rating": "8", "text": "Crimson Peak is a scary, beautiful, albeit a little predictable journey into a old haunted mansion. Many are saying it's not as much a Gothic Horror as it is Gothic Romance, I beg to differ, it's more of a Gothic Thriller, with romantic and horror elements. The film isn't the most original, as it seems like every horror film has the main character move into an old haunted house, but this film does put a different spin on it. The film is different in that it avoids the one dimensional ghosts haunting a person, whereas she's seen ghosts her whole life, and these ghosts are serving a different purpose. However, some of the thriller aspects are so obvious that the plot becomes a little predictable. In the end Crimson Peak is a spooky, beautiful, multi-layered, albeit a little predictable film from Guillermo del Toro."}, {"rating": "7", "text": "There are two types of films that Guillermo Del Toro makes: his somber, brilliant horror films, usually low budgeted and in Spanish, and his Hollywood style opuses, such as Hellboy and Pacific Rim. On the latter, Del Toro shows you his sharp eye for production design, and create detailed, intricate 'blockbusters' that are sadly more style than substance.  Crimson Peak is an attempt to create a 'marriage' between his two body of works...it failed on some level.  Again, the production design is brilliant, costuming impeccable. The main character is obviously the house...an incredible creation that deserved at least an Oscar nomination. The bad thing: straight forward plotting, which I will not divulge here,contains 'twists and turns' that are predictable.  Surprisingly, I felt that the whole film felt rushed and not enough emotional connection is established between Hiddleston and Wasikowska. Chastain as per usual is brilliant...but again, the film could have been more...it could have been a classic...Alas, it was not meant to be..."}, {"rating": "7", "text": "The bleeding snow and gothic ambiance produce a good horror spectacle, but the haunting simply follows lady in creepy dress formula.\r Comparison is bound to made with Pan's Labyrinth, since Crimson Peak has Del Toro's trademark twisted fairy tale feel and desolated last century setting. It is a peculiarly and aesthetically pleasing horror, but the clash between romance and thriller is neither as bold nor magical as previous incursion. The simplistic nature works more like The Woman in Black, although Del Toro's presentation does separate it from other entities.\r The plot revolves around Edith (Mia Wasikowska) who is charmed by Thomas Sharpe (Tom Hiddleston) in the first act. After she's drawn to their lives, she discovers that Sharpe siblings might just hide some ominous secrets. It's a straightforward deceit and debauchery story with a few rather daunting apparitions thrown into the mix.\r The first noticeable edge Crimson Peak has is the flamboyant style of visual. Those who have watched Hellboy 2 or Pan's Labyrinth should be familiar with this graphical flair. The colors are splendidly painted, nearly every scenes have bleak backdrop yet glossy golden or scarlet undertone. Either it's from outlandish outfits or clever use of vista, the scenes where these characters interact appear nearly surreal.\r Tom Hiddleston creates a suave gentleman persona who also seems secretive and distant at times. Jessica Chastain as Lucille, the sister, is very unnerving. She's almost oozing sinister air, which is complimented well by her typical dark dress, and also a good contender for Disney lady villain. Compared to the two, Mia Wasikowska as the female lead is rather timid. She's not entirely bad, but some of her expressions don't convey the necessary dread.\r This also translates to the horror. Crimson Peak has one of the creepiest apparitions on romance themed movies, a couple of its scenes might just surpass full-fledged horror movies in recent times. However, the reaction from Edith is shockingly dull, almost seemingly lacking self-preservation instinct despite visited by constant nocturnal phantoms.\r I don't care how suave Tom Hiddleston can make excuses, the mansion has hole on the roof. While it's good for panoramic shots for falling leaves or snow, it’s a clear sign of hazard. There are also patches of blood-stained dirt that seeps through the living room. Those anomalies coupled with strange occurrences and screams of night terror, Edith should realize the danger sooner, but in too many scenes she's too oblivious, partially for the sake of plot.\r Crimson Peak is a strange marriage of romance and horror. Both aspects have glimpses of brilliance, yet they never culminate in conclusion beyond what other ghost stories have told. Having benefit of classy presentation and eerie atmosphere, it's still a highly presentable horror flick. However, for those looking for another grand tale or magical journey from Del Toro, Crimson Peak might not reach such zenith."}, {"rating": "6", "text": "'Crimson Peak' is one of those movies where the director, Guillermo Del Toro, is the star. This is one of those films where the director's visual style of filmmaking upstages the story. Think of it as like 'Downton Abbey' mixed with the \"Harry Potter\" franchise and a hint of 'Pan's Labyrinth' (2006).\r It's a pretty typical horror film, especially from someone as talented as Del Toro. You can see some of the really scary parts coming from a mile away. My only issue is that some of the CGI wasn't rendered enough and some of the creatures looked a little silly at times.\r The movie stars Mia Wasikowska, Jessica Chastain, Tom Hiddleston and Charlie Hunnam, so you can expect great acting in this movie. Wasikowska's character is constantly being haunted by different ghosts and demons throughout and they tell her the same thing to be \"aware of Crimson Peak\".\r Wasikowska then meets Hiddleston's character who wants to invent and innovate. They later get married and live in his house with his sister played by Jessica Chastain, who seems extremely eerie.\r The whole film relies on suspense, and like most Del Toro films, can be deliberate in terms of pacing. Some of the scares are genuine and Del Toro crafts this expertly.\r My only issue is that the story is very predictable, and at times, it can be very cliche. If you have never seen a horror film in your life, you'll probably enjoy this and will be scared by it. But if you've seen many, scarier horror films, especially from Del Toro, you'll probably be underwhelmed with this one.\r Other than that, this film does contain scares, twists and beautiful production design. It is well acted and some of the images will give you nightmares. It's just...there are better, scarier films to see this October."}, {"rating": "7", "text": "I thought that Crimson Peak had a great story, cast, directing, and visual effects. I was excited to see what happened next. Although it wasn't the scariest movie ever, it did deliver a few thrills, and keeps my faith in Guillermo Del Toro."}, {"rating": "9", "text": "I really enjoyed this movie. The acting, the music, the set designs and the costumes are beautiful. The ghost are really scare but they are not on screen a lot, which makes sense given the fact that is not an horror movie. The plot gets predictable some times but you still enjoy the story. It is definitely designed to be seen on the big screen to enjoy the visuals."}, {"rating": "7", "text": "Crimson Peak was interesting in many ways, but ultimately not very good. My main problems were Tom Hiddleston, who I believe was miscast, and the script, which had no spark of originality whatsoever. I read that Benedict Cumberbatch was supposed to do the Hiddleston role, and I missed him all the time. I am sure he could have made more of the part than Hiddleston did who was too bland for a gothic “hero.” Hey, Hiddleston, never seen Heathcliff in Wuthering Heights??? Mia Wasikowska was more or less interesting, depending on whether she wore her hair up or down (it was that kind of a movie) and Jessica Chastain was great. She seemed to understand that this was about “scenery chewing” and went for it, so she was the only character who was fun to watch and didn’t seem to have a stick up the you-know-what. But it is a beautiful film with interesting special effects and the haunted house was fantastic. But I kept thinking – is this the same director who did Pan’s Labyrinth and The Devil’s Backbone?"}, {"rating": "7", "text": "Del Toro spends almost ten years to make his imaginative horror love story into the big screen, it works well as a periodic gothic romance thanks to its beautiful setting and sumptuous costumes yet falls short due to its predictable plot at the very opening of the film. It's a film full with paintings, dreams, terrifying fantasy and the addition of several modern types disturbing scares that really fit perfectly into the story but the supernatural are far more lesser than expected. Both Mia Wasikowska and Tom Hiddleston deliver solid performance while Jessica Chastain surprises audiences the most in which she is able to have fun expanding the full potential of her eerie character physically, mentally and emotionally well. Despite the disappointing story line and the CGIs of the spirits which look like those in Mama, this artistic and sombre film on a woman trapped in the social conventions is worth a watch for its creativity of combining both modern and classical elements."}, {"rating": "8", "text": "Guillermo del Toro brings back the Gothic Romance in a beautifully twisted way. Crimson Peak bathes in rich atmosphere and incredible art direction. The cast is uniformly great, with Jessica Chastain being the standout, as she deliciously chews the scenery. Tom Hiddleston plays a man of charm and mystery very well. Mia Wasikowska is delightful in her naivety.Things sort of play out as you'd expect, but half the fun here is being ahead of the characters. The film is primarily an exercise in atmosphere, and what an accomplishment it is in that regard. Crimson Peak didn't do very well in theaters, but I hope people continue to discover its lavish and deranged wonders as time goes on."}, {"rating": "8", "text": "I went into this movie expecting a \"classic\" oriented plot and genuine horror, and the film lived up to my expectations. Guillermo Del Toro does not rely on cheap scare tactics found in most horror movies (i.e. \"pop out\" scenes, over the top gore, etc.) but rather focuses on character development and the plot itself. This film does a great job of making the audience care about the characters and tells a good story. I wasn't so much scared in the traditional sense that I lose sleep at night; but more so that I connected with the characters and felt their suspense. The well developed characters and intriguing plot set up the viewer's emotions for the scary scenes. You may not necessarily come home from Crimson Peak and lose any sleep at night, but if you like a good story you will be satisfied and hope that Hollywood goes more in this direction with horror than it does most modern day horror flicks."}, {"rating": "6", "text": "In the aftermath of a family tragedy, an aspiring author is torn between love for her childhood friend and the temptation of a mysterious outsider. Trying to escape the ghosts of her past, she is swept away to a house that breathes, bleeds... and remembers.\r Director Guillermo Del Toro returns with an interesting cast for Crimson Peak, his passion project, that certainly delivers on visuals and atmosphere. There are ghosts, macabre horror and jumps scares, but this is more tragic romance than anything else. Allerdale Hall, home of the Sharpe siblings, is a character in it's own right. A swirling staircase, narrow hallways, creaking floors, an exposed roof, courtyard machinery, and an elevator shaft that is central to the plot. The rooms are covered in darkness with lamps and fireplaces illuminating the dark, brownish green walls and furniture.\r Unfortunately the story just isn't that interesting, beneath those luscious visuals, it doesn't really go anywhere. It's as if Del Toro and his writing partner thought of every gothic horror cliche, throwing them all into a script that perhaps was written in a day. Ir's not a grind to get through however, everything moves at a decent pace, the tone is tightly consistent throughout and the plot is easy to follow, and maybe that's what lets it down. Plenty of promise but nothing challenging for the viewer.\r The characters, wether by accident or intent, come across a little dopey. Mia Wasikowska plays Edith Cushing, a wanna-be writer haunted by her dead mother who has warned her since she was a child, \"Beware of Crimson Peak!\" She falls for British aristocrat Sir Thomas Sharpe (Tom Hiddleston), and after the death of her father, moves in with Thomas and his sister Lucille (Jessica Chastain). Behind Edith's back, the brother and sister plan to swindle her out of her fortune. Turns out she isn't the first wife Thomas has tried to kill with poisoned tea, under the instructions of Lucille.\r Charlie Hunnam plays the childhood friend to Edith, but he comes and goes without much presence. Hiddleston, although dashing as always, fails to give any life to his character. It's only Chastain and the third act that save this film, her anger exploding during a brilliant sequence of bloody stabbings and the chasing of Edith around the gothic mansion before the finale in the foggy, white snow and red clay covered courtyard.\r Interestingly, Crimson Peak will divide the audience into loving or hating it, much like another recent Del Toro project, Pacific Rim. For me it edges itself into a positive score with memorable visuals albeit a predictable direction."}, {"rating": "9", "text": "Extremely atmospheric and well acted, \"Crimson Peak\" offers the audiences, a good old Gothic romantic story with splendid visuals and an interesting plot."}, {"rating": "7", "text": "It's certainly flawed in dreary dialogue and a slight extinguish of intrigue during the second act, but crimson peak is a solid, and decaying, romance chiller (rather than a thriller...this was more \"depressive\" let's say) and was filled with gorgeous scenery and visual imagery that had a firm grasp around the majority of this film's weaknesses. Sometimes it didn't know where it was going, but I guess the sickly aura of this film and it's calm uneasiness brings about the fact that love is indeed a cruel and bitter ghost."}], "recommendations": ["candyman", "last_night_in_soho", "sleepy_hollow", "the_others", "what_lies_beneath", "stoker", "dark_city", "the_ninth_gate", "the_fly", "the_neon_demon", "mandy", "doctor_sleep", "the_mothman_prophecies", "the_lodge", "the_crow", "nocturnal_animals", "color_out_of_space", "the_grand_budapest_hotel", "the_conjuring_2", "lights_out", "doctor_strange", "the_cell", "suspiria", "the_ballad_of_buster_scruggs", "the_brothers_grimm"]}