{
  "id": 4314,
  "title": "Crimson Tide",
  "starring": [
    "Denzel Washington",
    "Gene Hackman"
  ],
  "runtime": 116,
  "genre": [
    "Thriller",
    "Drama",
    "Action"
  ],
  "description": "After the Cold War, a breakaway Russian republic with nuclear warheads becomes a possible worldwide threat. U.S. submarine Capt. Frank Ramsey signs on a relatively green but highly recommended Lt. Cmdr. Ron Hunter to the USS Alabama, which may be the only ship able to stop a possible Armageddon. When Ramsay insists that the Alabama must act aggressively, Hunter, fearing they will start rather than stop a disaster, leads a potential mutiny to stop him.",
  "releaseYear": "1995",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/21nqRJ6ofEgVvEl68J4O9V26Xzy.jpg",
  "categories": {
    "plot": 8.307692307692308,
    "acting": 8.285714285714286,
    "ending": 7.571428571428571,
    "soundtrack": 10.0,
    "cinematography": 10.0,
    "familyFriendly": 3.0,
    "funny": 5.0,
    "action": 7.888888888888889
  },
  "reviews": [
    {
      "rating": "6",
      "text": "Excellent post Cold War undersea thriller starring Gene Hackman as Captain Ramsay, the grizzled, old school Captain of the nuclear submarine USS Alabama, and Denzel Washington as his newly promoted First Officer, Lieutenant Commander Hunter.\rWhen a situation develops that forces Hunter into committing mutiny, in order to prevent a launch of nuclear missiles, it ultimately boils down to a battle of wills between the two men. Each convinced they are right, and each dedicated to their course of action.\rTony Scott directs, and conjurs up a tight and well crafted on screen depiction of life on a submarine. Going from the initial mundanities of everyday life, to ramping up the tensions as the crew deal with the distinct possibility their sub might become a very large metal coffin.\rThe acting throughout is excellent, with (pre-Lord of the Rings) Viggo Mortenson a stand out, as the weapons officer (and old friend of Hunter) who gets caught in the middle.\rThere are some (big) problems with the film though. The first is that it does take extreme liberties its narrative. The film was criticised on release by anyone and everyone connected with the US Navy, who stated that the principle notion of the movie (a mutiny) would never happen in real life. Other criticisms were thrown around about the (late in the day) script re-writes by Quentin Tarantino. It's so obvious where his 'lines' are in the script, and when they are being spoken it's utterly out of place.\rThe ending was also commented on, and it's no surprise this film was parodied in an episode of The Simpsons, the ending coming in for a very wry level of sarcasm due to it essentially being a cop-out. People wanting an actual epilogue that puts things into context won't be getting one.\r Overall though this is an exciting action-thriller. Put your thinking cap in your pocket, fire up the DVD/Blu-Ray, ramp up the bass on your sound system/TV, dim the lights..... And go along for the ride!"
    },
    {
      "rating": "10",
      "text": "You know that once a movie is lampooned by the Simpsons it has to have surpassed a certain level of quality and popularity. Watching this movie, you'll soon see why it easily earns it's place in Springfield. Smart, dramatic and featuring some great performances from Hackman and Washington, this is a story of deadly what-ifs in a place where no-one on Earth want's a deadly what-if situation."
    },
    {
      "rating": "7",
      "text": "Crimson Tide is an entertaining action thriller featuring powerhouse performances from Denzel Washington and Gene Hackman. Well directed film Tony Scott, Crimson Tide has quite a few tense moments that really pack a thrilling and thoroughly edge of your seat moments. While it can be a pretty stereotypical war film at times, it really can be thoroughly thought provoking as to who is right and who is wrong, which is not what I expected. Crimson Tide really makes you think at times and wonder who is in the right. Additionally, Crimson Tide really has some good performances from Hackman and Washington who really bring the differences of their characters to the forefront and really play the roles perfectly. That said, some of the supporting cast felt a little awkward and left a bit to be desired. Viggo Mortensen and James Gandolfini, for example, were nowhere near as good as I had hoped. Overall, Crimson Tide is an interesting film with unexpected philosophical ponderings."
    },
    {
      "rating": "6",
      "text": "Nuclear devastation threatens the west coast of the United States when Russian rebels capture several intercontinental missile bases in Siberia and declare war against the USA. The crew of the submarine USS Alabama is in the midst of this modern missile crisis when the order arrives to launch the pre-emptive strike. Then communications break down, but not before a last garbled message comes through.\r Now the captain, played by veteran Gene Hackman, and his second in command, played by the gifted Denzel Washington, face off: fire as ordered, and possibly trigger a global nuclear war, or reestablish communications, and thus risking the submarine and cause a delay with possibly disastrous consequences for the US. A rebel submarine makes matters more difficult.\r The movie is commendable in that it remains focused on the crew and we know not much more than they do. This makes us feel as they do.  However, Crimson Tide lacks flow. Flow is when events in the movie feel as being part of a natural progress that makes the story move forward. A movie lacks flow when we start to wonder.\r With Crimson Tide it starts  with the assignment of Washington to the Alabama. It somehow feels strange that an important ship like the Alabama gets a second in command assigned who knows nothing of that particular ship, has no experience and seems of a different disposition that his commanding officer. But then stranger things happen.\r Next is the garbled message. Just when the Alabama loses contact with central command they get this garbled message. Is it a recall of the previous order? Nobody knows..but how convenient that it arrives just in time to lay a seed of doubt and stir the fires of conflict. But it could happen. Stranger things have.\r Next then is that when Washington convinced Hackman to reestablish contact with headquarters using a buoy, the winch breaks down and makes such noise that it alerts the rebel submarine. How very convenient. But stranger things have happened.\r Next, the Alabama succeeds in destroying the Russian submarine even though the latter fires four torpedos first on the latter.  But the only two torpedo's fired by the Alabama do hit. It could happen. Stranger things have.\r However, the last torpedo damages the Alabama and it sinks to the bottom of the sea, reaches hull crushing depth, but just in time regains buoyancy and escapes in the nick of time. Well. It could happen, stranger things have.\r Then when the Alabama is in the position to reestablish contact with central command the transmitter is broken. And when the confrontation between Hackman and Washington reaches boiling point, it suddenly works again. It could happen.Stranger things have.\r But having so many events conveniently happen breaks the flow of the story. Strange things happen, a series of strange things is extremely rare. And if a story requires them to be there otherwise there would be no story is bad story telling.\r Compare Crimson Tide to the Caine Mutiny which has no such odd incidents. It is a natural story that has flow. Crimson Tide can only exist because it requires exceptional strange things to happen. This is its main flaw.\rNo excellent acting by Hackman, Washington and Mortensen can repair that damage."
    },
    {
      "rating": "10",
      "text": "\"Crimson Tide\" is a 1995 film Starring Denzel Washington and Gene Hackman. The Tony Scott film involves a first officer (Washington) on a nuclear submarine who clashes with his captain (Hackman) over whether or not they have enough information to perform a first strike on a volatile Russia. As far as, Tony Scott films go, they're sort of hit or miss. I loved \"Man On Fire\" and \"Unstoppable.\" However, movies like \"Deja Vu\" and \"The Taking Of Pelham 123\" are just sort of \"meh\" for me. This is partly because Mr. Scott made a very strange transition midway through his career. He went from using a really clean and traditional camera movement (as in \"Top Gun,\" \"True Romance,\" and \"Crimson Tide\") to using this really frenetic and trippy camera style (as in \"Deja Vu,\" \"Man On Fire,\" and \"Unstoppable\"). Sometimes the latter works, sometimes it doesn't, but one thing that usually has stayed amazingly consistent throughout Tony Scott's career is a brilliant lead performance from Denzel Washington. Tony Scott and Denzel Washington have collaborated together five times, and they've crafted some amazing stuff. \"Crimson Tide\" is no different here - Denzel sails through this movie with an utterly incredible finesse. However, while Denzel's performance is a force to be reckoned with, the best performance in this film is from none other than Popeye Doyle himself; Mr. Gene Hackman. His portrayal of Captain Frank Ramsey is one of the most menacing performances I've seen him give in a long while. Hackman owns this ship. In terms of directing, this movie in my opinion had everything \"The Hunt For Red October\" had, yet there was just a tad more. While \"The Hunt For Red October\" filmed it's underwater combat scenes using trick photography and models in midair, \"Crimson Tide\" actually shot their model ships underwater and utilized practical special effects on them regularly. While \"The Hunt For Red October\" had a brilliant score by Basil Poledouris, \"Crimson Tide\". . .had Hans Zimmer. Finally, while \"The Hunt For Red October\"'s plot was very interesting and definitely worth watching, \"Crimson Tide\" managed to be one of the most intense filmgoing experiences for me in a very long time - the fear of a nuclear holocaust is hammered into your head at an almost unsettling degree. White-knuckle film? You don't know the meaning of the term. \"Crimson Tide\" is an unbelievable film that I will not soon forget."
    },
    {
      "rating": "2",
      "text": "Caught this on cable last night -- the \"extended version\"! This is the worst kind of rah-rah jingoistic dreck, and an outrageously dumb premise to boot. Not to mention the cop out ending. The entire time you can't escape the feeling that both Hackman and Washington are slightly embarrassed for taking part in this. I'm sure Viggo Mortensen regrets it. For my part I'm embarrassed to have sat through it all. Roger Ebert unbelievably gives it an 88 though, making you question his integrity, or curious about what he gets paid to give these sorts of films good reviews."
    },
    {
      "rating": "9",
      "text": "Probably my favourite Tony Scott film, amidst stiff competition. The acting of both Hackman and Washington, plus the fine supporting cast, is top-drawer, and Scott keeps the suspense up, the film's as tight as a drum. It's rumoured that there were plenty of script doctors, including Quentin Tarantino, but that's no crime--especially when it works. One of my favourite submarine films--it's up there in my books with 'Destination Tokyo' (I haven't seen my DVD of 'Das Boot' yet). It's a great shame that Scott decided to take his life a few years back. He was a much better director than I used to give him credit for. I guess it's true that we don't realize just how good people are until they're gone. This film's essential for war film enthusiasts or those who enjoy suspense films or thrillers: It wouldn't be out of place in the oeuvres of, say, Sir Alfred Hitchcock or David Fincher, and would make a great double-bill with 'Lifeboat' or 'They Were Expendable'."
    },
    {
      "rating": "10",
      "text": "I consider this as a forgotten masterpiece. It has two great opposing characters that are caught in a cat and mouse game that can decide the fate of humanity. The psychology of the characters and moral ambiguity are great. There is no black and white or easy answer in this situation. Story: It is set on the USS Alabama submarine which is armed with nuclear rockets and on a mission near Russia. Lets continue with the main characters first as those are important. We have Ron Hunter who is the new first officer on the submarine and Captain Frank Ramsey who is a veteran and the hard as steel but fair commander of the ship. Both have different opinions, personalities and world views that collide. The submarine is in striking distance when a civil conflict erupts in Russia. A nuclear missile base is captured by ultra nationalist that threaten to start a nuclear war if either Russia or the USA confronts them. They receive the order to be ready to launch their missiles to avoid a nuclear attack by destroying the base before the rockets can be started. With this set up I end here to avoid spoiler. The story is engaging, intense and immersive. It deals with a problem that has no easy answer as you have no clue who is right or wrong. Also the clashing characters are great. A conflict between people who believe in the same things but in different ways. They set up the story and characters in a truly amazing way and the themes are worth to discuss a lot. By the way it is said to be based on an incident during the Cuban Missile Crisis which was the closest thing to the end of mankind in history as the USA and Russia were on the brink of nuclear war. Back to the movie. It works well because of the great actors and their performance. We have Gene Hackman as Captain Frank Ramsey who is one of a few submarine commanders with actual war experience. He is a man of duty, no nonsense and hard but fair. Then there is Denzel Washington as Lieutenant Commander Ron Hunter the second in command. He is less experienced but also a man of honor and principles. The struggle or conflict between those two made the movie great along with the story. They are like two side of a coin similar but different. Both characters have their valid points, code of honor and will do what is necessary. While I say these two carry the movie the rest of the cast is also excellent with George Dzundza as Chief Walters, Viggo Mortensen as Peter Ince and Matt Craven as Roy Zimmer to name a few. They fill the support roles with a good performance and enhance the movie. The mixture of fitting great actors in an immersive story won me and many others over. For the sets and visuals I say they are fully convincing for someone like me who has no naval, submarine or military experience (Like nearly all viewers). I always use the argument that it has not to be absolute realistic in an entertainment movie if it is not immensely implausible. On a sidenote I just read that they had no US Navy support as they objected a lot in the script. So I praise the effort. The soundtrack was done by Hans Zimmer who is one of the 3 great film music composers in the movie industry (John Williams and Ennio Morricone are the other two). So there is nothing to criticize here as he delivered something that was nominated for the Oscars. Overall this is a forgotten gem of its time. Basically unknown now but really good. An easy recommendation by me."
    },
    {
      "rating": "10",
      "text": "I have watched this movie more times than I can count, it's my go to feel good action flick when I'm bored or angry at **** movies.  There is nothing subpar about this flick."
    },
    {
      "rating": "5",
      "text": "Reasonably entertaining but thinly-plotted thriller with good acting but inconsistent writing."
    },
    {
      "rating": "7",
      "text": "Cette grosse machine, que dis-je, cette grosse machinerie hollywoodienne inspire une certaine méfiance de prime abord avec bien sûr l'habituelle rengaine \"nous sommes les meilleurs, en avant pour la gloire de nos armes etc\" puis bien entendu une légèreté certaine dans quelques situations et dialogues ainsi qu'un certain laxisme côté réalisme général.On s'étonne à ce sujet que le sous-marin nucléaire lanceur d'engins (SNLE) soit fumeur et qu'il y ait autant de gros dedans dont certains doivent à peine tenir dans les coursives : avec tout ce poids, on s'étonne également qu'il ne coule pas à pic directement. On s'étonne aussi de la présence de ce clébard qui va pisser partout dans le sous-marin nucléaire. Le combat aux torpilles est du même tonneau avec des torpilles qui dansent la lambada pendant que les sous-marins font la danse du ventre...Cela dit, le film ne fait pas n'importe quoi non plus et reste infiniment plus réaliste qu'une pitrerie comme Octobre Rouge avec Sean Connery et sa moumoute : il faut dire qu'on est tout de même pas dans du Tom Clancy et que USS Alabama est bien plus sérieux que cela. Construit comme un thriller à grands enjeux, ce huis-clos sous-marinier nucléaire sait distiller une tension et un rythme indéniablement efficaces, et ce du début à la fin.Il s'agit d'ailleurs à mon avis du meilleur film de Tony Scott qui délivre ici une mise en scène carrée et bétonnée, totalement insubmersible : il exploite avec à-propos les moments de grandiloquence et les tournants décisifs d'un scénario très présentable finalement.Gene Hackman est au centre et l'un des artisans, sinon l'artisan premier de cette tension de tous les instants qui va crescendo : il incarne avec un brio sans faille ce commandant éminemment intéressant et contrasté. Hélas, a contrario, Denzel Washington fait pâle figure et n'est pas au mieux dans un rôle trop grand pour lui et qui le dépasse entièrement : c'est vraiment dommage mais on s'y attendait : il n'a jamais été convaincant et n'a jamais fait que surjouer en permanence dans toute sa foutue carrière.En musique de fond, on a l'habitué des grosses productions, à savoir le Hans Zimmer qui ne fait pas dans la dentelle mais sait ici se révéler tantôt homérique tantôt assez discret et plus banal. Ses choeurs sont en tout cas un sacré clin d'oeil aux choeurs de Basil Poledouris sur Octobre Rouge...Voilà donc une grosse machine assez bien huilée pourvu qu'on y regarde de pas trop près et dans l'ensemble un divertissement de qualité. Bon travail Tony mais Gene remporte la palme !"
    },
    {
      "rating": "5",
      "text": "Crimson Tide is surely a wave that comes and goes but as far as it keeps hitting the surface, it gives you a one big wallop of sweat and war inducing debate.Crimson TideScott's bull fight of the lead actors going head to head on screen for a better, stronger, smarter punch is persistently convincing us to invest in their ideologies despite of having a non-gripping screenplay. It is surely a mature script. A well balanced and calculative that grims behind the screen for judging you as per the decisions you land upon. Surprisingly, the tense environment that is created which you fret upon will wear down at some point, proves you wrong as the feature ages on screen. And it is not because of its often fumbling script but because of the persona, charisma, and the performance of the cast.Seeking the power for their own reasonings and strong beliefs, Washington and Hackman steals your breath away everytime they share the screen. Washington's merrier and self-righteous portrayal is a straight bullet fired that demands attention. On the other hand, Hackman's provocative and the most human of all role amongst its cast is the apt challenge for Washington to overpower. This well constructed script maybe your textbook thriller drama, but the source from which it extracts the potential to drive this vehicle on both the direction is pure pop chase fun.It depicts nature of each character at its best. And since the source or threat that fuels their decision is mutual, the perspective that varies couldn't be more clear. Having said that, it doesn't suggest that it doesn't have any weak moments. Often or not, it takes its time and over chews stuff for a cinematic purpose. But the fabrication of this submarine is too authentic and grounded for you to fall for such distractions. Crimson Tide is surely a wave that comes and goes but as far as it keeps hitting the surface, it gives you a one big wallop of sweat and war inducing debate."
    },
    {
      "rating": "8",
      "text": "How far can a misunderstanding between two stubborn men go when they are stuck inside a confined space? This movie answers that question inside an American submarine when a stubborn veteran commander no longer understands his first officer, younger and idealistic. To make matters worse, they are facing a major crisis, waiting for an attack at any moment. This thriller is undeniably good and has a story that holds our attention and makes us aware of any fight between these two men. Both are right in their ideas, so they can not dialogue in order to appease themselves. A fight that can have unthinkable consequences, since the core of the issue is the use of nuclear weapons contained in the ship. The situation is obviously dramatic and the script explores the nuclear fears of today's society very well. Denzel Washington shines in the role of the Officer Hunter and Gene Hackman is a veteran with decades of work that returns to show its value. The sets and costumes are excellent, as are special effects and sound effects. In my view, the film's weakest point comes at the very end, where the two men who have been harshly confronted throughout history end up almost like friends. This does not seem to agree with the stubborn and proud personality of any of them and goes against logic, however nice it may seem for the end of a movie."
    },
    {
      "rating": "5",
      "text": "This movie has not aged well. The Captain who is all about being by the book threatens to murder two of his crew for not listening to him and assaults his XO in front of the entire crew. Despite this, he is given an early retirement with a pension instead of being arrested for trying to launch Nuclear missiles while communications are down. The intention of this movie was to question who is right but it never seems the Captain is doing anything except acting like a petulant child. The racial overtones of the \"Spanish Horses\" they talk about near the end of the movie also points to the Captain hating the XO for his race."
    },
    {
      "rating": "7",
      "text": "Despite some considerable plot holes, this is still a well made geo-poltical thriller that uses is submarine setting to build the claustrophobic tension to good effect."
    }
  ]
}