{"id": 325, "title": "Crisis", "starring": ["Gary Oldman", "Armie Hammer"], "runtime": 118, "genre": ["Thriller", "Crime", "Drama"], "description": "Three stories about the world of opioids collide: a drug trafficker arranges a multi-cartel Fentanyl smuggling operation between Canada and the U.S., an architect recovering from an OxyContin addiction tracks down the truth behind her son's involvement with narcotics, and a university professor battles unexpected revelations about his research employer, a drug company with deep government influence bringing a new \"non-addictive\" painkiller to market.", "releaseYear": "2021", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/15e2VcMTtk3pqgGlHWxisvygFAw.jpg", "categories": {"plot": 10.0, "acting": 10.0, "ending": 5.0, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 3.0, "funny": 5.0, "action": 5.0}, "reviews": [{"rating": "10", "text": "Such a fast pace movie movie and the genius of the script is intertwining all three stories into one. Gary Oldman and Michelle Rodriguez both put in great performances in this movie. It’s a must see!!"}, {"rating": "7", "text": "Dont know why such low ratings but I quite enjoyed this one - great actors, interesting plot, paralel stories, idea behind of what they wanted to show. Yes maybe something was missing to make it great but still a good movie"}, {"rating": "5", "text": "I saw it because I was interested in its cast, but Crisis is an inert thriller that neither excites nor captivates.It never got frustrating or terrible for me, but it was inconsistent and underwhelming."}, {"rating": "5", "text": "(Mauro Lanari)For newbies who do not know the Soderbergh of \"Traffic\" (2000). Have a good study."}, {"rating": "10", "text": "Great movie. Make sure to see it. It's about the problems our society has with opioids. The actors are very good, especially Evangeline Lily who plays architect  whose son does not come home from school. Find out what happens. You will love this movie."}], "recommendations": ["the_ultimate_gift", "we_are_your_friends", "the_lucky_one", "good_will_hunting", "21", "backdraft", "17_again", "the_italian_job", "american_hustle", "breach", "abduction", "the_king_of_staten_island", "passengers", "the_vow", "the_blind_side", "the_karate_kid_part_ii", "american_gangster", "the_boy_next_door", "the_usual_suspects", "10_things_i_hate_about_you", "the_professor_and_the_madman", "ghostbusters", "triple_frontier", "alex_cross", "changeling"]}