{"id": 2599, "title": "Critters", "starring": ["Dee Wallace", "M. Emmet Walsh"], "runtime": 86, "genre": ["Comedy", "Horror", "Science Fiction"], "description": "A massive ball of furry creatures from another world eat their way through a small mid-western town followed by intergalactic bounty hunters opposed only by militant townspeople.", "releaseYear": "1986", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/7tFJqfcmu7sAxwcRwQ0j9qnGrok.jpg", "categories": {"plot": 9.0, "acting": 8.2, "ending": 4.0, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 6.0, "funny": 5.666666666666667, "action": 4.0}, "reviews": [{"rating": "10", "text": "Critters is a 1986 sci-fi horror starring Scott Grimes and Dee Wallace... I have this a 10 rating based on originality because the sequels were even worse and to me this is the ONLY decent Critters film besides Critters 3.. Critters 2 and 4 were just plain bad... The premise is similar to Gremlins but these furballs called Critters come from space and they eat whatever they can get their teeth into and attack humans too. A family is plundered into disaster and must survive when their home is targeted by the furry critters but they also have help to get rid of the critters in the form of two alien bounty hunters with big guns shooting up the place lol. The bounty hunters can take the form of any person's face as their face mutates and transforms to fit in kind of but the main goal is to destroy the critters. Good and bad acting in this film and some stupid characters to say the least but it's entertaining and rarely boring so a great film. It feels very dark this movie in the atmosphere department and more times than not there's a sense of dread with dead animals turning up near the family home or cops being killed by the critter creatures. Good film and best in the series."}, {"rating": "6", "text": "Critters is an absolute joy to watch. For a film that is so clearly a rip off of Gremlins, it manages to actually meet the quality of the original."}, {"rating": "9", "text": "The critters are my favorite mini monsters. These monstrous pint size ghoulies are on the run from space bounty hunters. They land on earth start hatching and mutating so they can snack on a human family in a classic country home. The movie starts out as a family drama with a touch of sci-fi and soon becomes a kick ass battle with gruesome little and big spaceballs. The practical effects are awesome. The movie is scary, funny and so entertaining. This is one of those awesome, retro kid saves the day movies played by ginger Scott Grimes. Dee Wallace Stone (Cujo) also stars along with a young Billy Zane (Dead Calm) and Lin Shaye (Insidious). A must see!Budget: $2mBox Office: $13m4.5/5"}, {"rating": "4", "text": "If the movie \"Gremlins\" struck me as odd, yet fun, this film, released at about the same time, is much more surreal, as the script is based on the arrival of a plague in a rural Kansas village: furry, voracious, toothy, deadly aliens. I confess, I'm not a fan of alien movies. And seeing these flesh-eating fur balls is not strictly something I'd ever think to see again, even though I found the movie, overall, tolerable. It's a film where comedy and sci-fi go hand in hand and where suspense reigns... there are also some tense, though not scary, scenes.The script is basically what I said: a group of furry and particularly voracious creatures flee the stellar authorities (something the film quickly forgets) and decide to come to our planet, where they begin to feed in a rural house, where the family that lives there quickly begins to fear for their lives. Simple, direct, functional, effective, with no major problems other than a few loose ends to explain or one or two sub-plots that were forgotten in the middle of everything else.The cast does its job effectively and without major demerits. The film's family seems to us to be quite credible in their way of acting and relating, with a nice couple, two teenage children and normal fights between siblings. The youngest turns out to have a more evident role, and is very well played by Scott Grimes. Billy Green Bush and Dee Wallace are safe bets and give us solid work. Nadine Van Der Velde is equally effective.On a technical level, the film bets a lot on creating an alien that can be funny and threatening at the same time... the result is not bad, and we almost managed to empathize with those devouring creatures. I don't know how they did it, but the creatures seem credible and authentic enough. The visual, special and sound effects used are equally good, most of the time: I just didn't like the excessive futurisms on the spaceship, because the effects used look very dated and cheap, even considering the film's age."}, {"rating": "8", "text": "Classic 80s horror.  Good mix of humour, likeable characters, and horror. What this pulls off that none of the sequels managed to capture is a sense of suspense where the characters actually feel like they're in danger. It's hard to balance with its goofiness, but Critters pulls it off nicely!"}, {"rating": "6", "text": "this movie was entertaining and with a good story. recommended to pass the time"}], "recommendations": ["monster_trucks", "species", "predators", "alien_resurrection", "deep_blue_sea", "the_predator", "tremors", "the_crazies", "resident_evil_apocalypse", "anacondas_the_hunt_for_the_blood_orchid", "pacific_rim", "independence_day", "predator_2", "aliens", "the_last_days_on_mars", "30_days_of_night", "the_meg", "dawn_of_the_dead", "twister", "47_meters_down", "kong_skull_island", "pitch_black", "rampage", "jurassic_world_fallen_kingdom", "hellbound_hellraiser_ii"]}