{"id": 3835, "title": "Crocodile Dundee", "starring": ["Paul Hogan", "Linda Kozlowski"], "runtime": 104, "genre": ["Adventure", "Comedy"], "description": "When a New York reporter plucks crocodile hunter Mick Dundee from the Australian Outback for a visit to the Big Apple, it's a clash of cultures and a recipe for good-natured comedy as naïve Dundee negotiates the concrete jungle. He proves that his instincts are quite useful in the city and adeptly handles everything from wily muggers to high-society snoots without breaking a sweat.", "releaseYear": "1986", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/pduPduL1ub5kok3lPYT15ryC9L6.jpg", "categories": {"plot": 8.0, "acting": 7.0, "ending": 10.0, "soundtrack": 5.0, "cinematography": 8.0, "familyFriendly": 6.0, "funny": 7.5, "action": 10.0}, "reviews": [{"rating": "8", "text": "While decidedly languid and a tad too short, this is the first and best of the tales about the Australian living legend. The scenery and cinematography are very nice, and there are entertaining and somewhat informative parts in the script. The story is engaging too, and has both funny and quite tense bits. The direction is fine, and the acting is good enough. Paul Hogan is a very likable, charismatic and funny hero, and Linda Kozslowski is decent support. As for the sequels, the second was inferior but passable but the third isn't really worth bothering with. This though, while not perfect is the real deal and works as solid entertainment. 8/10 Bethany Cox"}, {"rating": "0", "text": "On connaît \"l'humour\" (entre guillemets !) américain et son cortège de films idiots pour les bouffeurs de hamburgers lobotomisés mais connaissez-vous l'humour australien ? non ? eh bien tant mieux. En fait, il ne faut pas connaître. Vous pourriez faire une mongolite aigüe.Mais si vous voulez vous y risquer (à vos risques et périls), tentez de regarder un \"Crocodile Dundee\"... Pas besoin de tenir jusqu'au bout, sauf à des fins d'étude scientifique comparative (avec les Amerloques pour voir qui remporte la palme...). Une certaine durée suffira mais cela dépend de votre endurance : je crois en tout cas que c'est un boulot rêvé pour Forrest, Forrest Gump.Le sieur Dundee donc boulotte des crocos avec un couteau et traîne une jolie grognasse avec lui dans la jolie nature australienne, puis à New York où il fait connaissance avec les indigènes locaux. La blonde n'a pas inventé l'eau tiède mais elle ne porte jamais de soutif, donc ça fera l'affaire. Mais entre les deux, j'ignore qui est le plus débile.J'ai presque eu un rictus cependant, il me faut l'avouer, lorsque les soûlards dégomment des kangourous au fusil sur leur pickup parce qu'il faut pas se moquer et que ça n'a pas l'air comme ça mais dégommer ces bestiaux sauteurs, ce n'est pas une mince affaire. On m'a dit de toute façon l'autre mercredi à dîner, que le plus efficace, c'était le boomerang : \"ça vous décapite un kangourou à 50 mètres !\"Bon, à part ça, je meuble cette critique comme ce pseudo-film à deux dollars australiens tente de se meubler lui-même, à savoir une suite de \"gags\" dont Vidéogag n'a pas voulu : trop australien, leur a-t-on dit. Et puis le croco ne pète pas, ne rote pas et ne bouffe personne. Même pas ce vieux con et son chapeau élimé, que même les aborigènes là-bas, ils l'ont même pas invité à dîner. Et pourtant, c'était un mercredi soir."}, {"rating": "10", "text": "Crocodile Dundee is a comedy, made in 1986 and stars Paul Hogan and Linda Kozlowski and at times a rather annoying Mark Blum as Richard Mason... Sue Charlton (Kozlowski) is a reporter and travels to Australia to visit Crocodile Dundee (Hogan) to find out how he survived after being attacked by a crocodile. Later on she asks him to visit New York with her and from there he stays in New York and meets a few screwballs and even gets involved with a few fights involving a pump or something. He punches Richard Mason (Mark Blum) because he is being a pain at some dinner one night in a restaurant and he tries flirting with some prostitute's and even stops a robber by throwing tinned food cans at his head. There's a crocodile attack on Linda Kozlowski but Paul Hogan rescues her and when Sue Charlton gets asked by Richard Mason at the end to marry her Dundee (Hogan) decides to leave his hotel and go walkabout and Sue (Kozlowski) chases after him down the street and through the subway. With one of the most beautiful and heartwarming endings in movie history it makes Crocodile Dundee a classic and a great comedy."}, {"rating": "6", "text": "Fairly entertaining fish out of water film with good acting though probably doesn't hold up that well."}, {"rating": "6", "text": "\"Crocodile Dundee\" is incredibly cute.  It moves along at a good pace and there is fun to be had in every scene.  If you can overlook some language and drug references, this is fun to watch with a kid.  I give it a C, if you've already seen the best, but you insist on watching a movie, try this one out."}, {"rating": "7", "text": "A pretty simple comedy that puts a man out of his comfort zone and the laughs ensue.Entertaining enough"}], "recommendations": ["beverly_hills_cop", "beverly_hills_cop_ii", "bad_boys", "beverly_hills_cop_iii", "shanghai_noon", "the_legend_of_zorro", "the_whole_nine_yards", "red", "the_wackness", "the_jewel_of_the_nile", "due_date", "days_of_thunder", "the_boss", "the_adventurer_the_curse_of_the_midas_box", "just_like_heaven", "lethal_weapon", "vacation_friends", "red_heat", "wanderlust", "sister_act", "lethal_weapon_4", "blue_streak", "robin_hood_prince_of_thieves", "shanghai_knights", "the_mask_of_zorro"]}