{
  "id": 29,
  "title": "Cruella",
  "starring": [
    "Emma Stone",
    "Emma Thompson"
  ],
  "runtime": 134,
  "genre": [
    "Comedy",
    "Crime"
  ],
  "description": "In 1970s London amidst the punk rock revolution, a young grifter named Estella is determined to make a name for herself with her designs. She befriends a pair of young thieves who appreciate her appetite for mischief, and together they are able to build a life for themselves on the London streets. One day, Estella’s flair for fashion catches the eye of the Baroness von Hellman, a fashion legend who is devastatingly chic and terrifyingly haute. But their relationship sets in motion a course of events and revelations that will cause Estella to embrace her wicked side and become the raucous, fashionable and revenge-bent Cruella.",
  "releaseYear": "2021",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/wToO8opxkGwKgSfJ1JK8tGvkG6U.jpg",
  "categories": {
    "plot": 6.902439024390244,
    "acting": 7.7272727272727275,
    "ending": 5.666666666666667,
    "soundtrack": 7.818181818181818,
    "cinematography": 9.0,
    "familyFriendly": 6.0,
    "funny": 7.0,
    "action": 7.3
  },
  "reviews": [
    {
      "rating": "10",
      "text": "Far better than expected, the production, costumes and cast are the best part of the film"
    },
    {
      "rating": "5",
      "text": "Disney should take the risk of giving creative freedom to its directors, Cruella needed a creative touch intended for adults and not only for children."
    },
    {
      "rating": "9",
      "text": "A wonderful movie. Emma Stone was an absolute powerhouse, she easily deserves an Oscar nomination for this role."
    },
    {
      "rating": "5",
      "text": "The movie is shallow and relies entirely on the visual. It's “The Devil Wears Prada” for kids."
    },
    {
      "rating": "10",
      "text": "Finally watched Cruella and it was magnificent, I just loved the whole punk rock aesthetic; the whole visual style of the movie was excellent. I loved how they reinvented the Cruella character to make her more of an antihero and how they totally changed up the One Hundred and One Dalmatians story but still keep some elements in like Anita, Roger, Pongo, and Perdita as well as the Cruella de Vil song. The costumes were just spectacular, some of the best costumes I've ever seen. The performances from Emma Stone and Emma Thompson were outstanding, just perfection Stone did an excellent job at bringing humor and giving a heart to a normally heartless character and Thompson gave one of the best villainous performances I've seen, also the performances Paul Walter Hauser and John McCrea were great. The makeup and hairstyling were phenomenal especially on Emma Thompson and Emma Stone. The sets were superb. The soundtrack is awesome, the song selection was perfect and original music was great. The only criticisms I have would be that the screenplay at times was a little cheesy and the visual effects specifically the Dalmatians were a little odd and not the best or most realistic looking but other then that it was a pretty perfect movie."
    },
    {
      "rating": "8",
      "text": "Well, I didn't see the film \"101 Dalmatians\", at least not \"actively\", but I know that there is a protagonist there, \"Cruella\".I was able to see this film on Disney + and I also replied on \"User Score\" beforehand and the film does not even come close to 7.2... But.The film looks like a theatrical performance rather than a movie. The actors are a bit run-of-the-mill, but Emma Thomson is the best of the whole film.If you want to see a very good actress, you can watch the film, without Emma Thomson the film would be 4-5/10, but with Emma Thomson 8/10. The film is ok, acting by Emma Thomson is perfect... I would even go so far that she could get an Oscar nomination, that's how good I thought the acting was. The film itself is really something \"childish\", \"gloomy\" but a bit \"special\" in terms of quality, as I said, just because of Emma Thomson I give the film an 8/10..."
    },
    {
      "rating": "7",
      "text": "Cruella Review UStarring Emma Stone,Emma Thompson,Joel Fry,Paul Walker Hauser.Rating=3.25/5Positive1.Emma Stone Acting2.Emma Thompson Acting3.Casting4.Comedy Scenes worked well5.An engaging 1st half6.Decent Direction and music7.Good CinematographyNegative1.Lag2.Logic mistakes3.A Predictable 2nd half4.Climax.Verdict=Despite its flaws,Cruella is a decent comedy fashion movie with good performances.Cruella=Not So Cruel.Sabharish GStory:This story is about the villain of 101 dalmatians,Cruella De VilReccomended!"
    },
    {
      "rating": "4",
      "text": "Disney following classic dead parent flow, but villain origin is nice to see (maleficent-esque tbh). They pushed the boundary and tiptoed everywhere, but didn't cross that disney-moral-barrier. My vote would have to be going even further and at least dark knight level"
    },
    {
      "rating": "8",
      "text": "Walking into Cruella I had no idea what to expect. I’ve personally mostly enjoyed the Disney Live-Action movies, minus a few, but reading some of the reviews for it left me with worry walking into the theater. But boy am I glad I took the plunge!Cruella is easily my 2nd favorite movie of 2021 so far. Emma Stone is absolutely breathtaking as Cruella and is so perfectly cast. The film is so much fun and I cannot wait to add this to my home collection."
    },
    {
      "rating": "9",
      "text": "Let me tell you, I drug my fight on watching this movie. My wife tried to get me to watch it for weeks and weeks and I just had no interest. However, she put it on one morning without saying anything and I found myself drawn in. Overall the movie was fantastic! Not at all what I expected and I was pleasantly surprised by that. The story telling was original and creative and the cast of characters was done amazingly well. All in all I hope they find a way to do another live action 101 Dalmatians incorporating this story and characters"
    },
    {
      "rating": "10",
      "text": "An incredible creation by Disney and an extremely wonderful acting by the cast."
    },
    {
      "rating": "9",
      "text": "Good Good Good Good Good Good Good Good Good Good Good Good Good Good Good Good! Cruella!!!"
    },
    {
      "rating": "10",
      "text": "I really liked the movie and I really regret not having watched it before seeing the mixed reviews here.I try to systematize the reasons for most negative reviews:1. Alt-right: \"Disney is pushing the modern agenda!\" Cmon, this is not the universe of the Witcher or something! Black characters and gays are not in conflict with the fashion industry in England in the 70s. As well as the fact that women rule in this movie, which is based on the world of fashion. This movie was not about war, damn it! Personally, I'm against modern tradition to put black persons where they are unfit the lore. But this movie is not the case.2. Dog lovers: \"I like dalmatians, why she will try to skin them later? Her motivation is unclear.\"She sees dalmatians as tools that killed some1 she loved.She has the genes of a psychopath. She's obsessed with success in the wild fashion industry which leads her to become a psycho herself, achieving her goals at any cost.How TF can the motivation of a psychopath to make a fur coat out of someone she hates be unclear at all?3. Fantasy Haters: \"This Disney movie is for kids\"Oh, really? Disney, for kids? Who would ever guess!4. CGI Haters: Too much CGI!Agree."
    },
    {
      "rating": "10",
      "text": "One of the best movies of 2021! Excellent cast, plot and storyline. Maybe a lilbit too much CGI. I have no idea why it has only 59/100 from -payed- so-called “professional” critics. If any one ever cares about their “oppinion”."
    },
    {
      "rating": "3",
      "text": "Cruella became a sadistic maniac that wanted to kill puppies for WHAT reason now? No, seriously, this 'prequel' doesn't explain **** Just another lazy attempt at making their irredeemably evil villains appear 'complex' because that's what's trendy right now. The Cruella in this movie is NOT the same character as the one in 101 Dalmatians- not even close.Oh, and let's not forget this movie is filled with the same array of issues as all their other live adaptations. **** writing, **** casting, **** pacing. At least the visual style and costume design are decent-good-ish. So there's  that, at least."
    },
    {
      "rating": "4",
      "text": "Not satisfied with owning almost everything mainstream, Disney appropriates counterculture with this so-called punk film. 'Cruella' has funny moments, and the costume design is astounding, but the plot is mediocre at best. The final twist is another typical Disney moment to try to surprise the audience. Emma Stone and Emma Thompson are the best part of the movie, but 'The Devil Wears Prada' vibes make their interaction a little derivative. Can Disney not make a film thinking of converting it into a franchise?"
    },
    {
      "rating": "3",
      "text": "The movie is a series of music video clips /action sequences sprinkled with dialog. Cheap thrills and self-gratifying plot aside, it does have some good performances."
    },
    {
      "rating": "10",
      "text": "I seldom write reviews anymore as they go ignored, but this is my favorite movie of the year, even better than Nobody (starring Bob Odenkirk, directed by the guy who did the brilliant Hardcore Henry).  Craig Gillespie displayed genius of camera control and editing in I, Tonya, but here everything was next level. Emma Stone gives career best performance, costumes are Edith head caliber, everything just popped. set in england just before punk revolution, the zeitgeist of fashion is brought to life in the fashion of Batman Begins."
    },
    {
      "rating": "9",
      "text": "i watched this movie today, i wanna say this; this is the best live-action from Disney. i loved it. Emma stone is so talented. Musics, art of direction and actings was perfect. i felt all emotions happy, sad, mad etc. i love movies, gosh i love movies."
    },
    {
      "rating": "10",
      "text": "The movies acting is well done and it shows the complexity behind Cruella, it shows the split in personality and the different mindsets between characters. It’s music and costumes are also amazing sounding and are so stunning to look at, with beautiful and unique designs."
    },
    {
      "rating": "7",
      "text": "Sinceramente non mi aspettavo molto da questo film e, già a partire dal trailer, mi sembrava una copia de \"Il diavolo veste Prada\". Sicuramente i costumi sono la cosa migliore, ma anche la trama, seppur con qualche forzatura evidente, non è male e l'ho trovata abbastanza coinvolgente. Penso che l'errore più grande del film sia più che altro il fatto di farti compatire troppo con la protagonista, non dandoti davvero l'idea di qualcuno che ruberebbe dei cani per scuoiarli."
    },
    {
      "rating": "10",
      "text": "I loved it and i actually enjoyed it more than the original Cruella . i normally prefer the old Disney cartoons better.. I hope there will be a sequel..Also Emma Stone played an amazing part.."
    },
    {
      "rating": "8",
      "text": "I had no real desire to watch this, plus I haven't really liked Disney's live action stuff, but I was pleasantly surprised at how much I enjoyed it. The production and costume design is so gorgeous and it looks like they really put a lot of effort into it. Both Emmas steal the screen, they're both so good in this. I wish they didn't feel the need to bombard you popular 70s songs every few seconds; it got tiresome after a while."
    },
    {
      "rating": "10",
      "text": "One of the best live action Disney character films.I like the fact she doesn't actually kill the dogs"
    },
    {
      "rating": "10",
      "text": "The attention to detail in the creation of this magnificent film is immense. You have the dramatics of the gorgeous outfits to the dynamics of the different shades throughout the film between scenes, using tones to enhance the ambience. It’s an overwhelmingly unique masterpiece. The first time watching it, it raised goosebumps over my skin. It really lets you see a hidden side to ‘Cruella DeVil’. It’s an absolute must see. You shan’t regret it."
    },
    {
      "rating": "0",
      "text": "Another cash grab disney live action product that is fatally off the mark.Say what you want, while Maleficent had its issues: her character could actually undergo the anti-hero treatment.Cruella is someone who tries to SKIN DOGS for christ sake WHY are we trying to make a sympathetic anti hero out of this character!?"
    },
    {
      "rating": "0",
      "text": "Disney has fallen from the top. They're making bad movies all the time , because they have clearly lost the passion to make great movies. It's all about messaging and if it's not harmful for the kiddies. Even though these messages are more harmful to kids than they do good, but anyway. It's just like they throw a bunch of money against it and think it will be fine: Insert ideology, make it look flashy with a bunch of CGI, hire celebrities and that's about it really. Oh and clearly these reviews aren't rigged. Can't put a negative review on here without trying 100 times and the signup for Disney + advertisement on the top of this page is reaaaally subtle. They definitely didn't pay for that."
    },
    {
      "rating": "5",
      "text": "Disney has done it again.In its constant eagerness to remake its animated characters in live-action, now it was Cruella de Vil's turn, and she received the same treatment Maleficent received.The villain turned anti-hero.Yet once again the same question arises: Why?And sure, the complete and total answer would be money, but Disney seems more focused on giving cool characters to the new generations, while omitting their past in the animated classics.And I guess it's fair, not much of the public has seen or will see those films, even kids, therefore a story like this, designed to be visually impressive, becomes quite attractive for the general audiences.And Cruella is all about making a visual impact, and I know how to appreciate good work in terms of costumes, sets, music and production, but I also pay a lot attention to the script, and Cruella is more about style than substance, and that creates a gap that nothing else in it can fill, and it's hugely unsatisfying.Emma Stone and Emma Thompson are the attractive force in acting terms, battling to see who's the biggest **** but the appeal becomes tedious after a while, much like the montage in which Cruella crashes several events of the Baroness played by Thompson.We understand it, she's kinda punk, aggressive and audacious, they didn't have to sell it in such a persistent and repetitive way, especially considering that these scenes are only made to show off the costume work, not because it adds anything to the story.The rest of the cast is criminally wasted, especially Mark Strong who's only there for one important scene.Cruella is more of an audiovisual show, than a true tale.Yes, there's an origin story there, of course, but this ultimately says nothing at all.Do you want to meet the real Cruella de Vil, the actual villain? Watch 101 Dalmatians."
    },
    {
      "rating": "5",
      "text": "The first 20 minutes of this movie are excruciating due to the fact that the child actress is one of the worst I’ve ever seen. I was so confused by that. Disney fills the rest of the movie with a good cast, and fantastic costuming. The storyline here tho is just a mess. I also cannot stand how for a movie about dogs 80% of them are cgi. Not worth making a new franchise. Please don’t ruin this character anymore"
    },
    {
      "rating": "0",
      "text": "so you take the most irredeemable Disney villian of all time and try to justify her wanting to skin puppies with \"Dalmations killed her mom\". Not just mean spirited Dalmations. Dalmations trained by a different villian. Are the Batwoman series writers moonlighting for Disney at this point? Christ all mighty."
    },
    {
      "rating": "0",
      "text": "just Bored..........................................................................................................................................."
    },
    {
      "rating": "0",
      "text": "A laughable attempt to make an evil character relateable, through some of the most idiotic contrivances.  Dalmation guard dogs attack an intruder, and that is supposed to be grounds for wanting to skin puppies.  The people behind this movie are clearly sociopaths who think any excuse constitutes mitigating circumstances.  Had a bad childhood?  Well we will give you a pass for the atrocities you commit as an adult."
    },
    {
      "rating": "0",
      "text": "Who asked for this, seriously who asked for a back story of someone who murderers and skin dogs alive?"
    },
    {
      "rating": "1",
      "text": "Too much hype for nothing. I've been hyped for this since it was announced and I'm very disappointed. Better save your time and money.The movie tries too hard (clearly with awards in mind), the plot is awful and boring. Sadly the movie is supposed to be about Cruella but could be about any other character who wants to be a fashion designer with no cares for the law, the writers apparently don't know much about the title character. I think the good reviews are not objective thanks to the good cast.The only good thing worth noting apart from the good cast is the stunning costume design.I have to add I wouldn't recommend this movie for kids because in the end it sends kids the wrong message."
    },
    {
      "rating": "8",
      "text": "Really dug it. Costumes, performances and soundtrack are all great. One of the best Disney live-action remakes; honors the source material while making it its own thing."
    },
    {
      "rating": "3",
      "text": "Cruella cumple con la fomula promedio y mediocre de presentar una franquicia que agrade al publico general con guiños simplones, giros anticlimaticos y la ya obligada extension de dos horas de narrativa que arrastra mas que ofrecer algun riesgo, pero realmente no se la juega por la creacion de una villana. Es una simplona manera de dejar a una mala heroina de venganza, haciendo una caricatura de la caricatura."
    },
    {
      "rating": "8",
      "text": "Good cast. Good acting. Good script. Not perfect but one of Disney’s best live action films. Emma stone was amazing in the film. So I’ll say it’s an 8/10 and one thumbs up."
    },
    {
      "rating": "0",
      "text": "Disgusting, atrocious, repuslive and utter **** crapWho actually **** likes this ****"
    },
    {
      "rating": "8",
      "text": "This movie was a different spin on Cruella's character and I think it works in this era of films we are living in. The movie has fantastic editing and dialogue. The main antagonist was menacing and well written. Two issues I had with the movie was the frequent use of licensed songs and the CGI. Most of the music in the scenes felt out of place and the CGI was not Aladdin levels of bad, more 2007 era movies. Most of the movie used practical effects so that felt nice. Watch this movie for the characters and enjoy."
    },
    {
      "rating": "10",
      "text": "I love it, so cool, fashion, criative, interesting, the best disney's movie the last days!"
    },
    {
      "rating": "2",
      "text": "Set in a hyper cosmopolitan version of 70s London, this Cruella isn't that cruel and to be honest isn't very much fun to watch. it's pure China sponsored Disney - expensive budget, overlong with a bombastic and ill-fitting soundtrack. At the end of the day this sympathetic and feminist take on Cruella doesn't need to exist at all - 2 stars for the costumes."
    },
    {
      "rating": "10",
      "text": "The outfits were very amazing. Emma Stone's acting is spot on. A must-watch for those who loved 101 Dalmatians."
    },
    {
      "rating": "8",
      "text": "Great another Disney prequel movie about making a Disney villain sympathetic. That was my thought when I heard the announcement of this movie. I had no care about watching this as Disney have sucked with these live-action prequel/remake of Disney animated movies. I eventually decided to give it a watch as there was a fair amount of internet buzz, both positive and negative, that kind of made me want to watch it. So does Disney finally do it right or is does this skin the legacy of 101 Dalmatians?Firstly, Emma Stone does a phenomenal job as Cruella. I honestly thought no one would be able to live up to the performance by Glenn Close, who is also an executive producer on the movie, as Cruella but Emma Stone proved me wrong. Her performance was very stylish and cruel which is exactly what I want from Cruella. Emma does add another layer to the character in the heartfelt moments which does make her more sympathetic. Emma Thompson plays the antagonist, the Baroness, and she also delivers an amazing performance by being narcissistic and full of attitude. Every time Emma Thompson is on screen she just steals it. Joel Fry and Paul Walter Hauser also do a good job as Jasper and Horace respectively. They play the friends of Cruella and add a level of heart and fun to the movie that I really enjoyed.One of the best aspects of Cruella (2021) is the rivalry between the titular character and the Baroness. Seeing both of them compete in fashion war was surprisingly exciting to watch. Every scene with them together is tense, and this is thanks to both Emma Stone and Emma Thompson having great chemistry. I also really love how bold and dark the director, Craig Gillespie, went with it. There is violence, murder, attempted murder, attempted child murder and corruption that genuinely surprised me. There is also a twist near the end that I think was pretty good and I think a fair amount of people would not expect.Cruella (2021) is a visual spectacle thanks to the costume design by Jenny Beavan’s. There are countless different and unique clothes throughout the movie that are stunning. We got the extremely over the top fashion from Cruella but we also got the elegant yet beautiful clothes of the Baroness. There are so many costume changes and they are all great yet perfectly represent the characters, it is quite an achievement from Jenny. The set design is also really well done and bring 1970s London to life. We get the gloomy city but the vibrant parties which all look stunning. The cinematography by Nicolas Karakatsanis is gorgeous and illustrates the party and costumes perfectly. One scene on the top of my mind is the Cruella catwalk which looked stunning thanks to the cinematography. Cruella also has a great music score by Nicholas Britell. The orchestral compose soundtrack works well for every scene and really captures the emotion of the moment. He also utilizes a 1970s pop soundtrack which you think would be annoying but it works so well here. Every song choice is used effectively and fits the scene that is occurring.  However, some scenes get slightly ruined thanks to the really bad CGI. The CGI is very noticeable, especially when it is the dogs which I don't get why they had to be CGI. There are scenes at night that are usually done to hide bad CGI but even that doesn't work to cover it up. Additionally, the story is very predictable for the most part and simply goes beat for a beat on a villain origin that is very formulaic. Disney has done the story beats for Maleficent and this goes the same way. The runtime is also 134 minutes which is very noticeable as there are some moments where the pacing slows down considerably. It could have cut down by at least 15 minutes while still retaining the core elements. There are issues with the screenplay with some lines feeling overly cringy or edgy that sound dumb and don't quite fit the tone of the movie. One big gripe I had was a dumb moment near the beginning to make Cruella sympathetic that was so stupid that I laughed even though it was not meant to be funny. It was just a really weird and dumb way to justify her hatred of the Dalmatians.Overall, Cruella (2021) surprised me a lot in how much I enjoyed it. It was to the point that I couldn't believe this was the same company that made Mulan (2020). Despite feeling there was no need to make a prequel on dog skinning lady even after finishing Cruella (2021), it's an excellent movie. It has gorgeous cinematography, stunning costumes and sets, a vibrant soundtrack with an amazing performance from Emma Stone and Emma Thompson. There is a lot to love in this movie which is why I believe that anyone who is still sceptical, should give Cruella (2021) a chance. It might surprise you."
    },
    {
      "rating": "9",
      "text": "Doing for this human Disney villain what Angelina Jolie did for Maleficent, Emma Stone portrays a character who was once nothing but an evil character in a story that was a book, and then a film (sevearl times over) and now, she has her own origin story.Looking at the way things are, we're seeing these origin story films taking off. We've had it with Maleficent, We've had it with Joker and now we've got the one and only Cruella DeVil. While normally I am not one to go for milking characters from franchises, I can say this story was more dark and twisted than I expected. While it's not a film you could stick the youngest kids in front of, it's certainly one that is a nice nod to those of the generation who grew up with this classic character.There are a few changes that take you by surprise, such as how Cruella is not as heartless as she's seen to be in the story book or the original Disney animation classic, but she is shown to have a natural side of malice to her, which comes from her mother. Yet, the kindness in her comes from her father, which shines in her in the last minutes of the film.Emma Stone was someone I never would of personally pegged to play s uch a character, yet I am happily proven wrong by her amazing acting skills. Watching her on screen, she  takes you through several emotions ranging from cheering her on, to wondering if you really want to like her anymore, to feeling sympathy for her to feeling joy at her long overdue triumph.The film gives several nods to things people who know the original story of 101 Dalmatians, such as the three savage Dalmatians owned by the Baroness, the mention of how Cruella thinks they'd make a fantastic coat. The mention of how the car she obtains, which is pointed out by Horace to called a DeVil, is a name she likes so she adopts it as her last name. Then of course we get the appearance of Pongo and Perdita, the famous Dalmatian duo appearing in the final moments of the film.Overall, this film is a wonderful watch, one I could indeed watch again in a short while as it's just well done and good from start to finish. The only thing I feel is a little issue is how it panders to sme political correctness with some race changes, but it's not the worst thing.Other than that, it's a very emotional story telling of how one girl born different grows up thinking she needs to shun who she truly is to get anywhere. And only when  does she embrace those differences does her power shine through and she begins to become the Queen inside she knows she is. It's a bit of a classic tale, one which teaches you to that being who you are is the best thing to be. Though, this telling of that classic lesson twists it up by not hiding the fact that anyone can find bad parts to the true selves. It's down to deciding who you want to be is where you'll find out if you're good or bad.By the end of the film, it's really down to the viewer to decide whether if Cruella is as bad as she was originally shown to be, or if there's more to this character than we ever knew.Will there be a sequel? Knowing Disney, it's probably already in the works. But with what's been set up, there's a chance they could make it work. Do I want to see a sequel? I'm half and half on that. But only time will tell if it will happen and if it'll be any good if it does.The film is a 9/10. A win for Disney, hands down."
    },
    {
      "rating": "5",
      "text": "I loved it !!!!! Worth my money!!! It was something I recommend to watch to enjoy with family , friends , simply makes you realize you do not need anyone to approve your work but self love"
    },
    {
      "rating": "9",
      "text": "Extremely fun and enjoyable. Not just a gorgeous film, but also a beautifully crafted mix of genres. I didn't even noticed it was a 2 hour movie, it passed flying."
    },
    {
      "rating": "1",
      "text": "This movie makes no sense on it's own, and even less as a prequel to 101 Dalmatians."
    },
    {
      "rating": "3",
      "text": "Just watched this movie along others today and let me tell you, not my wife or me were liking this crap.The only redeeming qualities are the entertainment value for some minutes and the soundtrack, everything else is dumb, just like modern art being parodied and mocked, this move tries to pass **** tastes as art, this movie also tries to pass itself as arty."
    },
    {
      "rating": "6",
      "text": "Cruella trata de abarcar más de lo que puede resolver. Es más forma que substancia, con una fotografía que es impactante y que te hace dudar si esto sucede en los 40s o los 70s y un vestuario por demás deslumbrante. Pero al final el guión cobra factura al entregar una historia demasiado genérica derivada de otras películas exitosas. De Cruella, como villana tenemos poco y lo de romantizar al villano, no lo entiendo. Aquí no existe ninguno."
    },
    {
      "rating": "1",
      "text": "Exactly as dumb as the concept sounds. I thought maybe the visuals and production values would compensate, but no."
    }
  ],
  "recommendations": [
    "alice_through_the_looking_glass",
    "oz_the_great_and_powerful",
    "pan",
    "maleficent_mistress_of_evil",
    "maleficent",
    "the_nutcracker_and_the_four_realms",
    "aquaman",
    "dumbo",
    "tomorrowland",
    "corpse_bride",
    "paddington_2",
    "rio_2",
    "the_call_of_the_wild",
    "the_bfg",
    "thor",
    "alice_in_wonderland",
    "tron_legacy",
    "the_lego_movie_2_the_second_part",
    "finch",
    "dolittle",
    "black_panther_wakanda_forever",
    "ferdinand",
    "mowgli_legend_of_the_jungle",
    "ben_hur",
    "bumblebee"
  ]
}