{
  "id": 393,
  "title": "Cry Macho",
  "starring": [
    "Clint Eastwood",
    "Eduardo Minett"
  ],
  "runtime": 104,
  "genre": [
    "Drama",
    "Western"
  ],
  "description": "Mike Milo, a one-time rodeo star and washed-up horse breeder, takes a job from an ex-boss to bring the man's young son home from Mexico.",
  "releaseYear": "2021",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/bzJBmh8U5ofExJara4nrdqlW8f3.jpg",
  "categories": {
    "plot": 4.777777777777778,
    "acting": 5.033333333333333,
    "ending": 4.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 5.0,
    "funny": 7.0,
    "action": 3.1666666666666665
  },
  "reviews": [
    {
      "rating": "4",
      "text": "Worst Clint Eastwood movie yet.But let's not forget that he's already 91 and still in front of the camera. Great respect for that.It's more because of the weak actors next to Eastwood and the weak story."
    },
    {
      "rating": "4",
      "text": "While I enjoyed watching this movie and I understood the point, I gotta say, emotionally it falls pretty flat. I believe this is largely because many of the decisions that these characters are making would normally require serious contemplation but instead are made with little to no thought at all. Given that, it made it even more difficult to accept Clint's character at Clint’s age. Finally add to that the supporting cast not being very convincing either and you're left with a movie where every emotional (or would-be emotional) crossroad misses the mark. All in all the movie is just poorly cast and it seems like it was butchered in the editing room."
    },
    {
      "rating": "8",
      "text": "My man Clint Eastwood in his 91, riding a horse, walk smoothly, talk smoothly, directing the movie, act in the movie so well, and it just amazed me so much, Cry Macho is overall still a great movie but not perfect with the reason that i think they can make the story better, i know that this is an adaptation but i think they can wrote a similar but yet a better story, and just let the original Cry Macho as it own story in the book, it's not bad but it can be better, the other thing is Eduardo Minett as Rafa (the other main actor), his performance was mostly good but sometimes it's not and it is kinda bothered me, but besides all of that again for me Cry Macho is still a very well done movie, beautifully well made from Eastwood, proving that he is still killing it and that's the highlight of Cry Macho."
    },
    {
      "rating": "6",
      "text": "Not as good as The Mule. The basic story is very similar to Liam Neeson movie The Marksman. It feels like the main character of the washed-up cowboy should be around 50 to 55 years old. But Clint Eastwood is 90+ and so the scenes where women are swooning over him are a bit ludicrous. With The Mule, Clint’s age worked for the story (old grandpa as drug runner) but in Cry Macho his age works against the material."
    },
    {
      "rating": "5",
      "text": "“This macho thing is overrated. Just people trying to show that they've got grit. That's about all they end up with. It's like anything else in life: you think you got all the answers, then you realize, as you get older, you don't have any of them.”Clint Eastwood, man what a legend. My respect for this man hasn’t faded.What’s even more impressive is that at the age of 91 he’s still acting and making movies, which is really inspiring.Also, the fact that 90-year-old Eastwood starred/directed a movie during the global pandemic, where he was the most vulnerable, it’s kind of mind blowing and it's something that I can't get pass.Now for the movie itself, it’s an uneven road trip movie that’s more aimed for an older demographic. I don’t know how to describe it, but everything felt stilted in terms of pace and the film making. The movie also has some questionable scene transitions, such as cutting to ‘one year later’, which made the previous scenes seem unnecessary.Even then, Clint Eastwood is still charming, and he made me smile at times. Also, the movie looked beautiful.Although, from how I see things, Eastwood is “the last cowboy” in cinema. From Sergio Leone till now. This movie reflects on that deeply in every visual. His character Mike is past his prime; where horse riding and the inner grit of the west has become a distant memory as the modern age comes creeping in. But of course, in the end he is the hero, like he always has been."
    },
    {
      "rating": "4",
      "text": "Even though it's always great to watch on screen such a legend as Clint Eastwood, Cry Macho lacks both power and emotion. Most dialogues feel empty and trivial, and there almost isn't any internal development in the characters. It also has some nice shots and landscapes, being a quite enjoyable film in visual terms."
    },
    {
      "rating": "2",
      "text": "Cry, Macho or The Little Gallo That Could. Veteran actor Eastwood delivers an appropriate performance as Mike, a down-and-out cowboy looking for redemption and meaning in his later years of life. At 91, Eastwood may not be able to pull off the action stunts like he used to, but he ably bring his character to life on the screen to drive this otherwise dull and dusty screenplay. The plot moves along about as fast as the border line in Tijuana on a weekend and is full of outdated tropes that don’t make the film special in any way. Mike is somewhat of a white savior figure who “rescues” a teen boy from the dangers and wanton realities of Mexico in the 1970’s. Mexican police are depicted as incompetent, taking bribes and being motivated by personal gain. A strange subplot where Mike plays Dr. Doolittle for a sleepy Mexican village. And of course, there’s a love story interwoven for good measure.The relationship between Mike and the boy is not fully developed during the course of the film and makes the ending unsatisfying. The credits roll and I didn’t feel invested in the journey the two had just been on. The titular Macho, a cock fighting rooster, is along for the ride as the boy’s security blanket. Macho represents his transition from boy to man (as you will see from the film’s ending) and serves no purpose to the plot other than helping resolve the film’s main conflict (and no, I don’t mean the pacing). Macho’s role in the film is to wrap up a story that’s been going on for too long. Macho doesn't cry in the movie either, though he does get something stuck in his eye. Hmmm… The plot, while contrived, manages to pull at a few heart strings and is really about the coming of age for the boy and the reconciliation of age for Mike. The action and pacing of the movie harken back to the films of yesteryear - dialogue driven plot with little wiggle room to keep the attention of modern audiences who are desensitized to gratuitous violence, sex, and unexplainable action sequences. The plot needed more action, more Western theme tropes to truly deliver on a meaningful cinematic experience. The film served as decent background noise and gave occasional glimpses of good cinematography. Though somewhat enjoyable, this film does not meet the mark for its potential. This film is not much of a quick draw with how Eastwood hobbles around screen at times, nor is it much of a bullseye."
    },
    {
      "rating": "3",
      "text": "Malisima, una perdida de dinero por ver este somnífero.En serio les recomiendo ver otra cosa en el cine."
    },
    {
      "rating": "4",
      "text": "Kurinto īsutouddo kantoku no saigo no eiga ni naru koto... Shōjiki ni iu to hijō ni zan'nendesu."
    },
    {
      "rating": "5",
      "text": "Very boring, the only good thing is the development of the protagonist but hence all bad."
    },
    {
      "rating": "3",
      "text": "Clint Eastwood knows how to direct a movie, but I'm guessing he had a story he really wanted to tell, but was under the gun so to speak to get Cry Macho out as quick as possible. The acting is all over the place, and the stereotypes are ridiculous.  The cockfighting scene was wonderfully lit, and totally unbelievable at the same time.  I know Mr. Eastwood still has one more great movie in him for his swan song. I just hope Cry Macho isn't it."
    },
    {
      "rating": "4",
      "text": "It's sad to see an icon like Clint Eastwood, both as an actor and director, trying to make something out of this inert, sluggishly paced material. The picture comes across like an awkward hybrid of classic Westerns, road trip tales and mismatched buddy films, with touches of horse whispering and totally preposterous romance tossed in. Much of the narrative is predictable, saccharine-encrusted and lacking in swashbuckling thrills. The mix yields a thin, uninvolving story brought to life by a lame script and even lamer, one-dimensional acting and character development, failings that even better casting and a more polished script wouldn't be able to help. What's most distressing, however, is that, with Eastwood's filmmaking days dwindling, one can't help but wonder why he would waste his time and talent on an underwhelming project like this. Riding off into the sunset should make for a grand exit, not a hobbled departure."
    },
    {
      "rating": "0",
      "text": "Este señor no sabe hacer otra cosa? Casi todas sus películas traen las mismas temáticas glorificando demás a los hombres."
    },
    {
      "rating": "1",
      "text": "This movie really damaged Clint Eastwood’s talent as a director starring in his own movie. He pulled it off in The Mule but he fails miserably in this movie."
    },
    {
      "rating": "0",
      "text": "Unforgiven is one of my best four films  in the history of cinema.not beacause I was thinking Mr Eastwood is not double communist and anti old woman like us (from Iran).It was mankind.but today I've got the mistake.he is."
    },
    {
      "rating": "4",
      "text": "I like the actor Clint Eastwood, but not the director, at least not his most recent films.I get that 'Cry Macho' is Eastwood meditating about his past as a movie star, but there are so many wrongs in this.First, as a Mexican — and I'm not offended by what’s been done here—, it's very distracting to look at the setting, which is far from what Mexico looked like in the late 70s. I know this might seem trivial, but you can't take a film seriously if there's no minimal effort to investigate more and try to insert your characters into a more believable environment. Come on, by that time, the country had already hosted the World Cup and the Olympics, and in the film, it looks like there are only cockfights, dust, and people in sarapes in Mexico City and its surroundings.And we need to talk about those female characters. The evil lady feels like a telenovela villain, and the good one is just an accessory to Mike. In the end, these characterizations don’t support the overall criticism of the “macho” figure in the movie.The plot is very average, and although I found Mike very charming and funny, it wasn't enough to keep me interested. Let's hope Eastwood has another shot at making a better movie next time."
    },
    {
      "rating": "3",
      "text": "This legendary director should have quit while he was ahead. I have not seen a movie this slow, this bad, this poorly shot and directed in... well... weeks... due to the pandemic and such limited releases. Seriously, really slow, poorly acted and NO ONE wants to see a 90 yr old man giving and receiving sexual glances from women 1/2 his age."
    },
    {
      "rating": "6",
      "text": "Howdy, Streamers! Cry Macho premiered this week in theaters and on HBO Max, and we watched it on HBO Max. It's the new film from prolific director and Hollywood icon, Clint Eastwood. At 90-years-old, it seems like Eastwood still churns out a movie almost every year, and he frequently has a starring role in his directorial efforts. Here, Eastwood has continued to trade on his legacy of old Western, strong-and-silent, cowboy type. The question here is whether that machismo in Eastwood is still compelling. Let's see how it goes.Based on a 1975 novel of the same name, Cry Macho is the story of Mike Milo (Eastwood), a former rodeo star, who after having suffered a devastating injury began working as a horse trainer on a ranch. Due to indulgence in alcohol and pills and, generally, no longer being reliable as a ranch hand, Mike loses his job. However, Mike's former boss enlists him to go to Mexico City to retrieve his son, Rafael (Eduardo Minett), from his abusive and neglectful mother. The boss' motives are unclear to Mike; nevertheless, with reservations, Mike travels from Texas to Mexico City to pick up the 13-year-old boy. Rafael is troubled, according to his unreliable mother, and Mike finds the boy out cockfighting with his trusty rooster, Macho. As Mike and Rafael travel back to Texas to meet his father, Rafael's mother sends her heavies and the Federales after them. From there, a road trip/lowkey chase movie ensues. It's Gran Torino on the road in Mexico, or many other variations on some Clint Eastwood movies.As we've come to know, Clint Eastwood is a simple filmmaker. There's not a lot of flash. It's all very uncomplicated and easy. Essentially, Cry Macho is a road movie between an old man and a kid where they break down each other's walls along the way. Nothing surprising, and so the emotion is key for this film to work. Like a sucker, it got me. Despite it all, it's a nice movie with a good central relationship. In fact, the simplicity of it all makes it so much easier to be endearing, especially since you know what's coming at almost every turn.If there are problems here, it is because Clint Eastwood is doing his regular Clint Eastwood thing. He is gruff and stoic. It's a carbon copy of many of the roles he has played in the last few years or throughout his legendary career. Eduardo Minett does his best as Rafael, but the acting is rough going - especially in the beginning. Eventually, he gets into the rhythm with Eastwood and they fall into a nice chemistry. I'll also shout out Natalia Traven as Marta because she sweeps in in the last third of the movie and infuses every scene of hers with charisma and beauty.The biggest problem is how basic, with a capital \"B\", this plot is - it tends toward eye-roll inducing except for how charming it ultimately becomes.Although Cry Macho can be bland at times, the central relationship between Mike and Rafael brings charm and sweetness to the film. Eastwood has a distinct style of direction and acting that can be repetitive from movie to movie, but this snuck up on me and has won me over and likely will win other viewers over as well. It's probably only a handful of popcorn for theater viewers, but it's a nice bowl of popcorn for those streaming on a quiet Sunday afternoon."
    },
    {
      "rating": "10",
      "text": "Another hit from Clint Eastwood. A heartfelt drama of redemption and character study."
    },
    {
      "rating": "3",
      "text": "bad[ bad ]adjective, worse, worst;(Slang) bad·der, bad·dest for 36.not good in any manner or degree."
    },
    {
      "rating": "4",
      "text": "God bless old Clint for still having the energy to stay active in the cinema world but the last couple of his films have been stale & lacking real action drama. The story was dull right from the start. I almost scored it lower but my spouse enjoyed it so I gave it a middle of the road grade."
    },
    {
      "rating": "5",
      "text": "While Eastwood's acting is great, the plot is very boring and nothing that interesting really happens in the movie."
    },
    {
      "rating": "4",
      "text": "Really, really, really wanted to avoid giving this a red score, so I did.  I gave it a 4 because I know Clint is a great actor and director, but his age is definitely showing here.  And while he wasn't bad, he wasn't as good as his old self like he was in The Mule.  What really made this film not so great was the terrible supporting cast and story.  There literally wasn't much to work with here on all angles.  This movie seemed to be just made out of boredom from Clint.  It was pretty weak and lame.  BUT, it gets 4 stars for being a bit charming.  Couldn't stand the kid...."
    },
    {
      "rating": "7",
      "text": "Rented this movie as I saw it was a new Clint Eastwood film. Clint is obviously much older now and he simply can’t do the same action gun-toting that he used to in his earlier films; yet these new movies don’t suffer for it. And why would that be? Because the film focuses on telling a strong story and having well-written characters that grow throughout the movie. You start Cry Macho with a washed-up rodeo cowboy named Mike, who’s been through hell. His boss of many years is done and fires him but they’ve been through a lot together and so he decides to call in a favor. He wants Mike to head down to Mexico City to retrieve his son from his ex-wife who isn’t treating the boy well. And so the journey begins.Mike finds Rafo and with a little work convinces him to leave Mexico to live on a ranch in Texas with his father. However, his mother is not happy with this and does everything to stop him from leaving. Along the way, in which much hiding from cops and stopping in towns is done, Mike and Rafo learn more about each other and begin to trust each other and form a friendship. By the end, they’ve both become better people thanks to one another.Overall, this movie is worth a watch if you’re looking for a story with meaning and enjoy seeing characters bond over the course of a movie. Also, Rafo has a pet rooster as he was involved in cockfighting. Macho the rooster is a whole character himself, it’s pretty funny."
    },
    {
      "rating": "5",
      "text": "(Mauro Lanari)Like the Woody Allen of senescence who deconstructs himself more and more with each new work, Eastwood insists on using the films of his own old age to distance from his macho cinematic icon. Not a particularly difficult task when you are 91: you just need to be framed. In the embarrassing implausibility of the screenplay by Nick Schenk, already author of \"Gran Torino\" and \"The Mule\", \"Cry Macho\" is a buddy road movie stuffed with scenes tending towards science fiction. Essential, minimalist, simple, linear, frank, gentle direction, with too few things to say and show. The concluding considerations on life and of a life are a jumble of banalities, and the desire to enjoy it and still have a good time at his age is not commendable: it is a surreal exorcism of the sunset boulevard."
    },
    {
      "rating": "4",
      "text": "It's really time for Clint Eastwood to retire, he's way to old to be doing all this work"
    },
    {
      "rating": "7",
      "text": "A mid Clint Eastwood flick.'Cry Macho' is passable, I had a fine time with it as I got suitable enjoyment. I wasn't overly invested but I don't have any noteworthy issues either. It narrowly gets a 3* rating from yours truly.At the age of 91, Eastwood is still acting, directing and producing movies - you gotta admire his longevity! He remains entertaining to watch, having come a long way since that debuting (uncredited) role in 1955's 'Revenge of the Creature'. There isn't much to note about the cast behind the lead, though Eduardo Minett and Natalia Traven are alright.I have nothing else to say. It's a satisfactory film."
    },
    {
      "rating": "6",
      "text": "Cry Macho is far from being the next classic Eastwood film. While I do think there is sketching to the story itself, the film never really comes together. Eastwood more than shows his age with the film and the film suffers from it. Not to mention the less than spectacular performance from Eastwood’s young co-Star. Perhaps with a younger more believable lead and a better young actor the film could have been something special. But for me - it was a miss. Feel free to watch the film on HBO Max,  don’t waste your time going to the theater for this one."
    },
    {
      "rating": "5",
      "text": "Una película muy meh y eso que fui con unas expectativas bastantes neutras pero aun así lograron decepcionarme."
    },
    {
      "rating": "2",
      "text": "Doesn't start or finish anywhere, I don't have any empathy with any character and you could sail a fleet of ocean-liners through all the holes in the script. Is the test of a good Director that they are able to discern that they themselves are unsuited for a lead role? What was going through Clint's mind when he was shooting the widow trying to get him (a 91 year old) into bed? I think we should pass around the hat to have all copies of this destroyed to preserve the dignity of Clint's lifetime body of work.I'm a big fan of Clint but this is a movie too far. He is finally too old to play anyone and needs to stick to directing if he still can. A fabulous career deserves a better-ending than this. He's kind of doing a Joe Biden but I don't think a teleprompter would have helped in this case."
    }
  ],
  "recommendations": [
    "jane_got_a_gun",
    "widows",
    "donnie_brasco",
    "the_gunman",
    "true_grit",
    "creed_ii",
    "man_on_fire",
    "the_accountant",
    "good_time",
    "news_of_the_world",
    "the_town",
    "hell_or_high_water",
    "the_equalizer",
    "trouble_with_the_curve",
    "public_enemies",
    "live_by_night",
    "lucky_number_slevin",
    "savages",
    "a_walk_among_the_tombstones",
    "wall_street_money_never_sleeps",
    "a_most_wanted_man",
    "a_most_violent_year",
    "the_next_three_days",
    "no_country_for_old_men",
    "changeling"
  ]
}