{
  "id": 3779,
  "title": "Cujo",
  "starring": [
    "Dee Wallace",
    "Danny Pintauro"
  ],
  "runtime": 93,
  "genre": [
    "Horror",
    "Thriller"
  ],
  "description": "A friendly St. Bernard named \"Cujo\" contracts rabies and conducts a reign of terror on a small American town.",
  "releaseYear": "1983",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/uNBt2YxrQdyOjnm2rDQ5QiCmQ0K.jpg",
  "categories": {
    "plot": 7.333333333333333,
    "acting": 5.333333333333333,
    "ending": 5.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 5.0,
    "action": 8.666666666666666
  },
  "reviews": [
    {
      "rating": "7",
      "text": "I was legitimately scared by this movie - and what made it for me was the mom - she's terrific in every role she plays. Amazing as the protector with this canine menace on the prowl."
    },
    {
      "rating": "8",
      "text": "I consider Cujo the novel to be one of the lesser Stephen King works and am overall just not much of a fan of it. Cujo the movie I'm quite fond off however. It trims away so much of the book's fat. Excising all the pointless subplots and superfluous padding in order to focus solely on the domestic drama and rabies-induced terror. It's a leaner, meaner, and all around better way to experience the story as a result. Improvements were even made to the ending.The characters are a little underdeveloped though. We never really get to learn who they are so it's impossible to legitimately care about them. This hurts the main plot thread involving the infidelity of Dee Wallace's character. Given that there's no exploration of why she would cheat on her husband, it and everything involving her lover Steve Kemp feels like it should have been left on the cutting room floor. As for Cujo's owners, the things going on in the Camber's household are only vaguely hinted at and will likely confuse those unfamiliar with the source material as a result.All in all, none of this is really a big deal though. This is a Stephen King flick so we're all just here for the action anyways. In that department this is easily one of the author's most effective adaptations. It's the only movie I've ever seen that even comes close to capturing the same kind of tension that can be found in Jaws. It does get a little repetitive at a certain point watching Cujo repeatedly assault a broken down car with the hopes of mutilating the protagonists inside, but it doesn't take too long for the film to switch gears and return you to that edge-of-your-seat anticipation with excursions outside of the vehicle. The St. Bernard himself is a terrifying beast whose gradual degradation is excellently telegraphed by an ever-increasing coat of muck and grime.The actual plot may be a little weak and underwritten, but the situation at the core of it all is intense. A naturalistic horror film that makes \"man's best friend\" more terrifying than any ghost, ghoul, or monster. Thanks to a noticeable axing of so much of the source material's more unnecessary story beats, it's also one of those rare movies that's better than the book it's based on.8.5/10"
    },
    {
      "rating": "2",
      "text": "This movie is basically about a dog that gets rabies after being bitten by a bat and then unleashes a murderous rage. Of course, there is a mother who protects her child from the furry monster's fury, which is an attempt to mess with our deepest feelings of empathy. It didn't work very well with me.Inspired by a Stephen King book, which is probably better than the movie, the movie is histrionic and exaggerated from start to finish. Rabies disease is serious, but I never knew of any case that even resembles what the movie shows. That really was a problem for me, because I didn't believe in the movie. Then the whole plot is so predictable and basic that it didn't get me involved, nor did it get me stuck in the movie, wanting to see it all the way through.I think Dee Wallace did a great job and is the actress who most contributes to the movie not being a complete fiasco. Far from merely screaming and running away or protecting her son, the actress was able to bring her character to life and show real dread."
    },
    {
      "rating": "10",
      "text": "This movie is perfect !!!! « TERRIFING » !!!!! Exellent ! Is terrifing as hell !!!"
    },
    {
      "rating": "5",
      "text": "A film with that only people scared of dogs should be afraid of the terror scenes look real more real then today's movie standards"
    },
    {
      "rating": "10",
      "text": "It's a terrific movie, i absolutely love it, it's terrifying, and it's scary, Cujo also fills with an unexpectedly fantastic performance, all the cast especially Dee Wallace (Donna), Danny Pintauro (Tad), and Daniel Hugh Carrie (Vic) are so good, i even want the whole affair drama story more and even become a movie (with the same cast of course), Cujo is an intense 93 minutes movie based on Stephen King's novel that really worth to watch, it's also just become one of my favorite King's movie adaptation."
    },
    {
      "rating": "8",
      "text": "The First Stephen King Movie Adaptation that I ever saw, and one of my favorites. It makes you feel bad for Cujo."
    }
  ],
  "recommendations": [
    "secret_window",
    "pet_sematary",
    "harry_potter_and_the_goblet_of_fire",
    "the_raven",
    "harry_potter_and_the_half_blood_prince",
    "cold_pursuit",
    "pirates_of_the_caribbean_dead_men_tell_no_tales",
    "the_conjuring_the_devil_made_me_do_it",
    "1408",
    "the_punisher",
    "sin_city_a_dame_to_kill_for",
    "x_men_origins_wolverine",
    "spider_man_no_way_home",
    "batman_the_killing_joke",
    "the_lovely_bones",
    "the_maze_runner",
    "death_note_relight_1_visions_of_a_god",
    "the_invisible_man",
    "bumblebee",
    "i_am_legend",
    "the_dark_tower",
    "insidious_chapter_3",
    "the_spiderwick_chronicles",
    "the_prestige",
    "ouija_origin_of_evil"
  ]
}