{"id": 119, "title": "Cult of Chucky", "starring": ["Fiona Dourif", "Brad Dourif"], "runtime": 91, "genre": ["Horror", "Thriller"], "description": "Confined to an asylum for the criminally insane, Nica Pierce is convinced that she, not Chucky, murdered her entire family. But when the psychiatrist introduces a new therapeutic \"Good Guy\" doll with a familiar face, a string of new, grisly deaths leads Nica to wonder if she isn't crazy after all.", "releaseYear": "2017", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/r5JUiMYfatwYeDkxkLWYUx5GIjY.jpg", "categories": {"plot": 4.166666666666667, "acting": 4.8, "ending": 2.0, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 2.0, "funny": 5.0, "action": 5.0}, "reviews": [{"rating": "8", "text": "Getting Closer To The OriginalCult Of Chucky definitely does a great job at it's horror."}, {"rating": "2", "text": "There's no denying the quality of the special effects and the directing, Which are definitely a highlight of the movie. And it certainly is the most ambitious of the franchise with what happened in the film plot-wise. However, That doesn't make it a good movie.It took far too long to really get anything of Chucky and even then it mostly felt like a teaser. The characters are a bit too shallow for me as well and it's kind of hard to really establish anything in terms of character development when they're mostly isolated and killed off rather quickly. Don't get me wrong, The cast (especially Jennifer and Fiona) do a great job, I just didn't care for how some of the characters, who are painfully predictable, are written.And the whole twist at the end took way too long to play out. It's really not until the last 35 minutes of the movie that we get any sense of a story and by then, I found myself barely able to finish. They really did save everything for the end and it didn't really work out for them."}, {"rating": "5", "text": "A decent amount of funny scenes and a couple of good performances but overall a step down from 2013's 'Curse of Chucky'in terms of story telling."}, {"rating": "7", "text": "Cult of Chucky what went wrong mostly everything what was the point of this movie, to be honest, I don't like half the stuff this movie did I like the first act but then after that movie falls apart completely the first half is like a mystery which was awesome and andy does not do much in this anyway and tiffany what was the actual point all she did was ruin the movie again I really do like her in the bride of Chucky but this with her killing like she is a doll possessing dolls like what the actual F is wrong with this movie I am so pissed that this movie sucked I was looking forward to this well this movie to me the good things they did the doll was better definitely the score is the ok to curse of Chucky score is better the kills in this movie are awesome so brutal don Mancini that is what he did right was the kills again the first half is good but the second get's so confused u are just confused watching this movie or you are pissed at every decision that made in this movie there is no story really besides possessing dolls and making this movie so confusing and the acting is not good by brad dourif this is the only film that he is chucky that I think is not good lines what don't make sense or work I don't know what happened during production of this what something seriously went wrong a movie I wish I liked all round my least fav chucky movie in the series by far that is saying something because the story and the stuff they are trying to do which again makes it more confusing so I give Cult of Chucky an C-"}, {"rating": "8", "text": "Cult of Chucky (Child's Play 7) is solid continuation of Curse of Chucky. After seeing DVD collections, I thought it would be disappointing sequel but no, it was a proper continuation with so much new additions. It is totally dark, horror and slasher.Movie is properly made. The concept is executed beautifully. There are plenty of shocks and scares, pretty good acting and lots of violence. The direction and editing work is done beautifully. The pacing is so much good that you might not know when the movie is over. I don't know why company thought not to release Curse and Cult of Chucky in theatres. Both were good movies and should have been given wide release.Overall, this movie is treat for psychological horror and Child's Play fans. You are gonna love it, for sure."}, {"rating": "5", "text": "this movie was pretty disappointing, i wouldn't say it's the worst in the franchise, (i'm looking at you seed!) anyway. this movie was just plain not scary for me, i did likenica, . in this movie, andy was alright, i liked chucky in this movie, but all of a side that, this movie wasn't that good for me, especially when curse was really good, and this is the follow up, so..5/10"}], "recommendations": ["curse_of_chucky", "dead_silence", "a_nightmare_on_elm_street", "i_still_know_what_you_did_last_summer", "halloween_ii", "underworld_evolution", "house_at_the_end_of_the_street", "halloween_iii_season_of_the_witch", "the_eye", "i_am_number_four", "the_mummy_tomb_of_the_dragon_emperor", "friday_the_13th", "the_babysitter_killer_queen", "hellbound_hellraiser_ii", "the_twilight_saga_eclipse", "saw_ii", "slender_man", "the_grudge_2", "insidious_chapter_2", "wish_upon", "the_possession", "the_last_house_on_the_left", "i_am_legend", "the_twilight_saga_new_moon", "underworld_rise_of_the_lycans"]}