{"id": 1333, "title": "Cursed", "starring": ["Christina Ricci", "Jesse Eisenberg"], "runtime": 97, "genre": ["Horror", "Comedy"], "description": "In Los Angeles, siblings Ellie and Jimmy come across an accident on Mulholland Drive. As they try to help the woman caught in the wreckage, a ferocious creature attacks them, devouring the woman and scratching the terrified siblings. They slowly discover that the creature was a werewolf and that they have fallen victim to a deadly curse.", "releaseYear": "2005", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/em45jL4CfTMyj5V83kj7rhdorJu.jpg", "categories": {"plot": 8.75, "acting": 8.571428571428571, "ending": 9.0, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 6.0, "funny": 8.333333333333334, "action": 9.0}, "reviews": [{"rating": "10", "text": "I thought this movie was a awesome horror and comedy film. Jesse Eisenberg and Christina Ricci were great."}, {"rating": "9", "text": "●●●●●●●●●●●●●●●●●●●●●●●●●●●●●●●●●●●■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡"}, {"rating": "9", "text": "●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_"}, {"rating": "9", "text": "》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》¡********************************************************"}, {"rating": "9", "text": "+×÷=+×÷=+×÷=+×÷=+×÷=+×÷=++××÷÷==++××÷÷==+++×××÷÷÷===+×÷=⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙"}, {"rating": "9", "text": "♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤》¡》¡》¡》¡》¡》¡¡¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡"}, {"rating": "9", "text": "Cursed is an intense lycan themed horror thriller from Wes Craven. Any lover of Craven's films will love this. It is sublimely exaggerated, tautly shot, jumpy scary & the movie has plenty of comedy as well mostly supplied by Jesse Eisenberg. One of my faves to watch especially at Halloween or any season of the year, A-."}, {"rating": "8", "text": "An October Favorite...I honestly don't understand the bad ratings that some people have given this movie. It is a favorite of mine and one that I watch every October when I am watching my Halloween collection of movies. The well-known actors (Christina Ricci, Joshua Jackson, Milo Ventimiglia, Jesse Eisenberg, Portia de Rossi, Judy Greer, Michael Rosenbaum) are great, not to mention the dog Zipper (Solar). The movie is certainly not the same-O, same-O werewolf movie. And it is kind of fun having it take place in the Hollywood Scene with some actors and singers playing themselves. I recommend it to anyone who wants to see a good movie for the Halloween Season. My only problem with it is that they never made a sequel."}, {"rating": "9", "text": "This is one of my favorite movies!If you love campy horror flicks, you will LOVE this movie. It has a collection of B-list stars who all do great in their campy roles. Christina Ricci is amazing and adorable, and you will be entertained during the whole movie.This has to be one of the only Werewolf movies that I actually like and doesn't go too deep into the myths and legends. The characters are all believable and the world the movie portrays is a place I would love to live in. We all know Wes Craven can do horror, this is his answer to the campy B movies that have come out, and he does excellent!If you're looking for some edge of your seat thriller, this isn't for you. This movie is meant to have fun, not to be taken seriously. It is one of my favorite movies, and is unapologetically campy."}, {"rating": "9", "text": "●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●■¡■¡■¡■¡■¡■¡■¡■¡■¡■¡■¡■¡■¡■¡■¡■¡■¡■¡■¡■¡■¡■¡"}, {"rating": "9", "text": "*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:☆°•☆°•☆°•☆°•☆°•☆°•☆°•☆°•☆°•☆°•☆°•☆"}, {"rating": "9", "text": "*:*:*::*:*:*:*:*\"*\"*\"*\"*\"*\"*\"*;*;*;*;*;*;*;*;*;*;*;*;*;*☆°•☆°•☆°•☆°•☆°•☆°••☆°•☆°•☆°•☆°•☆°•"}, {"rating": "9", "text": "♤♤♤♤♤♤♤♤♤♤♤♤♤♤♤♤♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥"}, {"rating": "8", "text": "The story is not original, the acting is overall okay except Joshua Jackson who was pretty bad and there was no blood or \"Wes Craven's violence\". But, it is still a pretty good movie."}, {"rating": "4", "text": "Although not without its moments, Cursed is a disappointing horror comedy of appalingly weak performances, repulsively cheesy VFX and a wildly predictable script."}, {"rating": "1", "text": "Wes Craven peut encore bien prouver son talent dans la manière dont il conçoit les effets spéciaux, mais ce long-métrage, m'a fait plus rire que peur, limite j'ai envie de mettre comédie dans la page senscritique de ce film ^^Cursed réunit tout les clichés possible, passages trop prévisibles, voirent même particulièrement gênant, avec des personnages stéréotypés (d'où un mec du film passe en 10 minutes de hétérosexuel à homo.. et qu'il représente bien le mal alpha cliché), le film contient du gore à l'allure fan service, d'où les compositions musicales n'ont malheureusement pas de queue ni tête...Bref, un film très nul qu'on oubliera vite !"}, {"rating": "9", "text": "I thought this was great. dont watch it excpecting a clever movie. its a freakin horror movie after all. The scene in the carpark wtht eh werewolf was quite scary. very well done. watch it, laugh and be scared."}, {"rating": "9", "text": "@#$%@##%@#$%@##%@#$%@##$%@#$%@#$%+÷+@#$%@#$%@#$%@#$%@#$%%$#@%$#@%$##%$#@%$#%$#%$#@%$#@+÷+***%$#@%$#@%$#@%$#@%$#@"}, {"rating": "9", "text": "There was \"Scream\" and then there was \"Cursed\" !!!!!A sketchy ending but over all one of the best horror flicks to hit theaters in the year 2005 next to \"Cry Wolf\" and \"House of Wax\". I could only imagine the terror I felt when watching Mya being chased around a parking lot at a charity benefit by a gigantic werewolf! Kevin Williamson has a knack for writing good chase scenes! The movie, like I said, had some what of a weak ending to it but over all, the rest was pure gold! I don't why so many people trash this movie? It was amazing! I applaud this movie and I would have to say see it to believe me! I would have to say I felt sorry for poor Mya! She shouldn't have died off so quickly just because she flirted with guy! UGH! That Joanie! Well like I said, recommend this movie to you all! Go see it, it's truly original other than the other dumb horror movies they've making (NOTE* Paranormal Horror Movies SUCK!)"}, {"rating": "9", "text": "An exceptional warewolf film !!!! It was good, momentarily scary, with laughs. Ricci was convincing in her role as the leading lady. She played the part well. Jesse Eisenberg, who plays her brother, did a good job in the movie as well, he looked like he did his research for the role. As far as thrills goes it was momentarily scary, but when it comes to the scenes with the werewolves, they could have been more gore and violence. The movie focused on comedy more than thrills. Although the comedy was put in at the right times it still did could have been good without it. The movie does keep you on the edge of your seat and you really care about the characters. It has a few plot twists which makes it more suspenseful. The final scene makes the whole movie worth your while, it is raw and very violent. If you are looking for a good movie you got one. I would recommend it to anybody, except for raw, die hard blood and guts fans."}, {"rating": "9", "text": "Enjoyable if you don't take it seriously !I will admit this movie is very hokey however I did enjoy it, especially after a second watch where I didn't take it as a serious horror movie. I watched the movie primarily because Milo Ventimiglia was in it, he looks really good in this film, if you want eye candy he definitely delivers. His character and his scenes with Jimmy were my favorite. The film seemed more like an 80s or 90s movie and I'm surprised it came out in 2004. The acting isn't great and the plotline is thin but if you can take it for what it is it's still entertaining."}, {"rating": "8", "text": "johuyfhgcjhfytdrsdtughijkjouyrwrfyyihihugygygygygyygk,.,,,.,.,.,.,.,.,.,.,.,.,.,.,.,.,.,.,.,,.,.,.,.,.,.,."}], "recommendations": ["ginger_snaps", "the_cabin_in_the_woods", "fright_night", "friday_the_13th", "the_babysitter", "scream", "drag_me_to_hell", "zombieland", "saw", "from_dusk_till_dawn", "shaun_of_the_dead", "a_nightmare_on_elm_street", "bride_of_chucky", "cabin_fever", "wrong_turn", "the_babysitter_killer_queen", "scary_movie_3", "underworld_evolution", "cult_of_chucky", "venom_let_there_be_carnage", "scream_4", "the_mummy", "zombieland_double_tap", "disturbia", "dead_silence"]}