{"id": 344, "title": "Curse of Chucky", "starring": ["Fiona Dourif", "Brad Dourif"], "runtime": 97, "genre": ["Horror", "Thriller"], "description": "After the passing of her mother, Nica Pierce, a young woman in a wheelchair, is forced to deal with her sister, brother-in-law, niece and their nanny as they say their goodbyes to mother. But when people start turning up dead, Nica discovers the culprit might be a strange doll she received a few days earlier.", "releaseYear": "2013", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/x9DzkDWp8O82Wzxk6otuD9bce9a.jpg", "categories": {"plot": 7.875, "acting": 8.5, "ending": 8.0, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 3.0, "funny": 8.0, "action": 5.0}, "reviews": [{"rating": "7", "text": "I think what shocks me most of all is that this film didn't get a theatrical release and instead went straight to video. Curse of Chucky is a soft reboot of the franchise, Bringing Chucky back to his roots with a revamped look. And with a solid supporting cast helping along the way, Curse of Chucky reminds us all of why we loved the franchise (and Chucky) so much. It's a gem that is right up there with the best the franchise has to offer."}, {"rating": "7", "text": "I can honestly say that I found this movie to be very entertaining. Is it perfect? hell no but, it is a fun horror movie with some great kills and funny one liners."}, {"rating": "7", "text": "It’s Not Amazing, But....Curse Of Chucky brings the franchise (mostly) back on track with a better told story than Seed ever could pull off."}, {"rating": "8", "text": "this movie is actually really good! it's sad seeing the chucky movies no longer in cinemas to DVD. (except for the remake) i loved almost everything in this movie."}, {"rating": "8", "text": "Curse of Chucky so this is a very different movie than I expected heard it was the goriest so I was seeing how the pacing would be and OMG this movie was pretty awesome this feels like the first movie Chucky does not even start to really go crazy until 45 minutes in which I believe could be the exact same time as the original child's play I do like Don Mancini direction in this I think the only thing he should have fixed was the doll in some scenes what is with the girly faces and the hair also what is with that I hate when I see that and the ending drags a little bit where you see camos they should of that did camos I do get the whole story in this I think what this movie did right was the story right about the ending when Nica is almost gonna die Chucky explains the whole story behind the original movie which I thought they weren't going to do that it worked so well made sense also you know how the rob zombie Halloween did a backstory Michael did not need a back story this one kinda need or did not it is how you look at the movie but I like the story they went for very interesting oh yeah the kills holy **** the kills where the best ever the eye kill the jaw kill wow they did on the suspense and the kills I was really surprised how good this was for a return to one of my beloved series it works the story works the characters are entaining on screen and to watch it feels like the original the score is a nice return the ending does drag because of the camos they did but all after that this movie is a movie I will definly watch again I give Curse of Chucky an B"}, {"rating": "9", "text": "Curse of Chucky (Child's Play 6) is solid comeback. After back to back disappointing sequels, this part revived the franchise. It is totally dark, horror, slasher movie for which this franchise is known. This movie didn't contain unnecessary humour like last three parts.Movie is properly made. The old concept is revived beautifully. There are plenty of shocks and scares, pretty good acting and lots of violence. The direction and editing work is done beautifully. The pacing is so much good that you might not know when the movie is over.Overall, this movie is treat for horror and Child's Play fans. You are gonna love it, for sure."}, {"rating": "5", "text": "After her mother's mysterious death, Nica begins to suspect that the talking, red-haired doll her visiting niece has been playing with may be the key to recent bloodshed and chaos.  (5)"}], "recommendations": ["cult_of_chucky", "a_nightmare_on_elm_street", "halloween_ii", "dead_silence", "wish_upon", "bride_of_chucky", "the_babysitter_killer_queen", "the_ring_two", "jason_goes_to_hell_the_final_friday", "friday_the_13th", "seed_of_chucky", "the_texas_chainsaw_massacre_the_beginning", "jigsaw", "halloween_iii_season_of_the_witch", "saw_ii", "rings", "halloween_h20_20_years_later", "insidious_chapter_2", "the_grudge", "friday_the_13th_part_2", "the_grudge_2", "saw_iii", "fright_night", "texas_chainsaw_3d", "i_still_know_what_you_did_last_summer"]}