{"id": 3096, "title": "Dallas Buyers Club", "starring": ["Matthew McConaughey", "Jared Leto"], "runtime": 117, "genre": ["Drama", "History"], "description": "Loosely based on the true-life tale of Ron Woodroof, a drug-taking, women-loving, homophobic man who in 1986 was diagnosed with HIV/AIDS and given thirty days to live.", "releaseYear": "2013", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/7Fdh7gUq3plvQqxRbNYhWvDABXA.jpg", "categories": {"plot": 7.9772727272727275, "acting": 7.788888888888889, "ending": 7.0, "soundtrack": 7.0, "cinematography": 5.0, "familyFriendly": 3.0, "funny": 9.333333333333334, "action": 7.833333333333333}, "reviews": [{"rating": "8", "text": "Matthew McConaughey delivers an Oscar-worthy performances for the bold and powerful Dallas Buyers Club. Though some scenes feel out of place, it is clear why this is a strong Oscar contender."}, {"rating": "7", "text": "This is loosely-based on a Texas electrician/rodeo rider (Matthew McConaughey) who contracted AIDS in the mid-80s and struggled to smuggle alternative treatments for fighting his and many others' illness. In setting up his \"club,\" his homophobia is challenged when he partners with a trans character (Jared Leto). The story unfolds at a steady pace, but it's really about the two leads. McConaughey imbues his character with much of the swagger typical of his personality, but manages to show emotion once or twice. It's Leto who completely transforms himself into a sweet, sensitive woman and creates the film's most poignant peaks. The movie is a bit too long and repetitive in the setbacks, but it still manages to tell the story effectively with award-potential performances."}, {"rating": "7", "text": "Dallas Buyers Club is a well developed movie because it shows deeply the human aspect when it is facing enormous adversities, which resemble the Greek tragedy, that in this case treats of a man against HIV and the American FDA. The main character portrayed us all in common life, fighting for what we deserve, getting up after several falls, but there is always someone or something that wants to take you down for money reasons. Beneath this primary message we can discover one about acceptance and changing ones minds, add to this the film transmit the idea of being who you wish; here is the character of Raynon who takes care of these. Despite that these topics seem very unoriginal, is the way in which is shown that makes the difference, turning the environment very visceral. First we have the protagonist: who is very well accompanied by a travesty that doesn't fear of saying what he thinks and a doctor that questions everything that is imposed. Of course they all are amazingly performed, highlighting Matthew McConaughey and Jared Leto. Another interesting thing is how this movie manages music and sound in order to represent in a better way the life of these sick people. Obviously it is accomplish by a strong direction and script."}, {"rating": "7", "text": "McConaughey is almost unrecognisable, the story's moving but only if you think that it's happened for real. Also, maybe the depiction of AIDS patients is a little too blunt for what was this condition really was in 1985. The homophobia looks a bit pushed, but it is Texas, so I wouldn't know if that would correspond to reality.\r Great acting performances - the only problem is this plot has been a little overused before, even if again, it is a real story, and therefore lacking the rocambolesque bit to it. If you are willing to forget that this film is not like others, and wants (for once) to be a close-to-reality account, and hence you are willing to not expect to be overflown with pity and compassion at all times, then it's probably at least a 9 for you."}, {"rating": "9", "text": "I never thought I'd say this, but Matthew McConaughey actually has talent! This film was the one that finally proved that to me! In this film, he portrays Ron Woodruff, a bull rider and electrician who tests positively for HIV. The film is loosely based on the true story of his buyers club that he starts for several other HIV patients with the use of illegal drugs. The film boasts a solid and talented cast. McConaughey gives what is, in my opinion, his best performance yet by far! Jennifer Garner also gives an honest performance as a headstrong doctor. Jared Leto returns to the big screen after his four-year absence from filmmaking as a transvestite named Rayon. His performance, along with McConaughey's is what really propels the film's conflict. Overall, the pacing is slow in some spots, but manages all the while to remain entertaining, thanks to the Oscarworthy performances from McConaughey and Leto. Definitely check this one out for an interesting take on a great true story!"}, {"rating": "9", "text": "This is the movie you see about a week or two after seeing \"How to Survive a Plague\", which comprehensively details the political/movement details underpinning this excellent story. McConaughey is outstanding, but I want to make sure and mention that Jennifer Garner is fantastic in a supporting role. She is so much better in subtle, compassionate roles, as opposed to the caricature stuff she often plays, such as her role in \"Butter.\"   I  also hope that Jared Leto is recognized for such a daring portrayal. Even though the topic is extraordinarily emotional and heavy, the movie is not difficult to endure. It's a hopeful tale  one that I recommend."}, {"rating": "10", "text": "I thought Dallas Buyers Club would be underrated but this film is surprisingly successful.There's nothing that i didn't like about that movie, it's perfect.Matthew McConaughey is incredible as Ron Woodroof, a homophobic cowboy diagnosed with HIV and given 30 days to live. Jared Leto is more than incredible playing Rayon, a HIV positive transgender woman.He gives us the best performance of the year as well as his career"}, {"rating": "10", "text": "Excellent movie and great acting. My pick for best movie. You feel the challenges of a life or death situation in face of government bureaucracy and what courage is all about. Recommend for young adults and older."}, {"rating": "9", "text": "Wow. No wonder Matthew McConaughey and Jared Leto won Oscars for this film. They're both brilliant in showcasing two faces of AIDS sufferers which oppose each other; one being a fighter doing all they can to prolong their life and the other succumbing to their disease by giving in and not taking their treatment seriously. What's beautiful is the characters themselves are polar opposites and this disease brings them together which results in helping many people.\r Unlike Philadelphia which gave us a personal story which shows us a complete journey of an AIDS sufferer til death, this film instead chooses to highlight how different people react to a disease differently. It also highlights how much of a joke the US health system is, particularly in how they addressed AIDS - other countries were putting out drugs which were effective and easier to access; whereas the US would put a harmful product out as a reaction to public need without proper analysis whilst also limiting access. When the film ended I wanted to see more of Ron Woodruff's story or at least a photo of what he looked like.\r It's a must see film that will surprisingly make you laugh too."}, {"rating": "5", "text": "Despite all the effort and talent on display, DALLAS BUYER'S CLUB is surprisingly ineffectual. It doesn't really tell us anything we don't already know and it's questions never go beyond the obvious. This is basically a good TV movie of the week. A serious issue film that used to air on HBO Saturday evenings. Now Lifetime would pick it up. Jared Leto however is quite a revelation, but he even is forced to come and go as the plot points desire. If you've seen the trailer for DALLAS BUYER'S CLUB, you've seen the movie... and in fact... the trailer is better! Much better."}, {"rating": "0", "text": "So, this movie was a great hit for Hollywood. That's the biz they are in. getting people to the theater. The issue comes in when the public believes this movie was real. or the public begins to \"relate\" to it and react because of it. Now, on some levels it was a good scary live right movie or you will die. Good stuff; BUT, now it had almost nothing to do with the real AIDS campaign. Sure, they made sure to drop a few key words to wet ones appetite, BUT, it still sent the following false messages: a.) Some big things aren't about money. b.) Everything IS about money. c.) Aids was a big deal in places other than San Francisco. d.) People can have heart attacks and walk out of a hospital 30 minutes later just fine, (if your matt m. famous movie actor). 4.) An average person can treat legal, law enforcement, and medical folks violently and not be put in jail, or brought up on charges. If I shot a shotgun at a door anywhere, there would be cops there in 3 minutes.  So, what now? On to the good stuff. The acting was marginal and seemed fake and felt like they were reading the script in rehearsal. Am I jealous of what these actors get paid to do this stuff? Your dam right I am. Do I believe that anyone with \"talent\" can \"make it\" if they try really hard? No I don't. Can they cut the scenes any shorter? More later."}, {"rating": "8", "text": "\"Dallas Buyers Club\" after 2 years and 3 other movies \"The Lincoln Lawyer\" (2011), \"Magic Mike\" and \"Mud\" (2013) elevates Matthew McConaughey from a drugged, drunk, naked at midnight bongo player to an A list actor who no longer has to prove himself. Though the field is very competitive this year in the best actor category he certainly deserves an Oscar nomination and, possibly, a win.\r McConaughney plays Ron Woodruff, the true story of a womanizing, dope taking electrician cowboy who was diagnosed with AIDS in 1985 and given 30 days to live. After a few rough days he accepts the diagnosis but does not accept the 30 day sentence. He takes AZT through underground channels as it is not approved by the FDA and is only available in a patient experiment. He quickly finds out how toxic it is, killing most people who are taking it, and does research finding other drugs, though illegal in the USA, are available in Mexico. Being a hustler he starts a club which costs $400 to join and gives people the drugs for free.\r As most people thought at that time, his friends, and the men he worked with, thought of AIDS as a 'gay disease' and quickly finds himself in fights and being ostracized. Collapsing one day he is rushed to the hospital where he shares a room with Rayon (Jared Leto) a transsexual with AIDS and enough sass to beat, and take his money, in a game of cards with Ron. When the latter starts his club and needs customers he and Rayon become partners developing a constant bickering repartee that also brings great empathy to both. There is no looking away from Jared Leto's performance, especially a scene when he visits his father, who brings across the sass he uses as a defense and the hurt he finds as a transsexual. At this point there is no reason he shouldn't get an Oscar nomination and if he wins it will be deserved just as McConaughey will have earned his.\r The films shows all the problems that people with AIDS faced, not only the discrimination but with the FDA and medical profession working against them. Ron travels all over the world to get the needed drugs and he is faced with all sorts of problems from the government and the Boards of hospitals. He eventually goes to court in San Francisco to fight for his right to take drugs that aren't approved in the USA for, mainly, financial reasons.\r Ron gets involved with a doctor, Eve Saks, played by Jennifer Garner who does a great job but really isn't necessary to/for the movie. Denis O'Hare as her boss Dr. Sevard, Griffin Dunne as an American doctor working in Mexico along with all the supporting actors give excellent support.\r The director, Jean-Marc Vallee, and the screenwriters Craig Borton and Melissa Wallack, in telling the story of two polar opposite men, don't hesitate in telling, and showing, how the world of AIDS was in the 1980s.\r Both Matthew McConaughhey and Jared Leto give full portraits of two completely different people who come together to help each other to live and wind up respecting each others role in life.\r \"Dallas Players Club\" is a must see film not only for the two main performances but for the history of the beginning of an illness that was discriminated against by the government, medical profession and the public and is still killing people today!"}, {"rating": "9", "text": "One of the best movies of the year. Oscar nominations for Matthew McConaughey and Jared Leto. The movie documents a sad chapter in the history of our country and how many lives were lost because of the FDA and President Regan."}, {"rating": "10", "text": "Though it may be a story of sickness and death, \"Dallas Buyers Club\" is about the rebirth of a homophobe. Suddenly an outcast among his heterosexual friends, Woodroof reluctantly warms to a new community  particularly a drug-addicted transsexual named Rayon who becomes his business partner. Rayon is played by an earnestly committed Jared Leto who nevertheless comes off as a theatrical drag queen cliche. They run the buyers club together out of a cheap motel, the unlikeliest pair of Bonnie and Clyde renegades yet. Quebec filmmaker Jean-Marc Vallee (\"The Young Victoria\") directs \"Dallas Buyers Club\" with a loose naturalism, seedy environs and lively humour that prevents the film from becoming over-sentimentalized. It's a true story long in the making (screenplay by Craig Borten and Melisa Wallack) based on Woodroof's remarkable late life. But what \"Dallas Buyers Club\" is, ultimately, is the apotheosis of another transformation: McConaughey's great U-turn. A few years after sinking into rote romantic comedies, \"Dallas Buyers Club\" tops an astonishing streak for the 43-year-old that has included \"Mud,\"  Bernie\". He lost more than 40 pounds for the role (Leto, too, is startlingly thin), and appears so gaunt as to wipe away any memory of his rosier, more superficial performances. Extreme weight loss, too, can be a superficial ploy, but McConaughey inhabits the clamouring, clawing Woodroof, whose zest for life (which McConaughey has always exuded) flourishes with the meaning of a moral cause. He stomps down hospital hallways in cowboy boots, a foul-mouthed champion against the system, spouting obscenities in a Texas drawl. In one late scene that could be either Woodroof or McConaughey, he looks in the mirror, and smiles."}, {"rating": "8", "text": "About as good of performances as you're probably ever going to get from Matthew McConaughey. Jared Leto and Jennifer Garner also do a pretty solid job as well. Although it is based on a true story, it does a better job than most films creating a cathartic ending. Well shot, does not drag on  a definite see for this year."}, {"rating": "6", "text": "Weird! That's the only word to describe the oscar nominated film Dallas Buyers Club. Now don't get me wrong this is not a bad movie, it has many things going for it! Such as fantastic performances from both McConaughey and Leto ( Leto's being the stand out in my opinion ) and an interesting story. It's just that the whole aids concept is really weird to me, i didn't know much about it going into the film and I honestly don't have a real opinion on it coming out. In the end I have a new found respect for the victims of aids and a movie like this is sure to raise awareness about those victims as well as their treatment methods. All in all Dallas Buyers Club was an alright movie, but its one that I will probably never watch again!"}, {"rating": "9", "text": "I mean, yeah, the film is amazing, but I'm just glad Matthew McConaughey decided to stop being a rom-com actor and focus on films that can actually be good."}, {"rating": "7", "text": "An oddly-inspirational film that continues to expand upon Matthew McConaughey's diversity. Jennifer Garner and Jared Leto, while existing in a dark, vulgar setting, both add appeal to the film's beauty. The greatest aspect of the film, though, is the character progression as the viewers witness a transformation over the (roughly) 2 hour movie."}, {"rating": "9", "text": "Hollywood's first awesome movie about aids in America with a very strong performance by Hollywood's upcoming great actor Matthew mccoughey and also supporting performance by jared leto who keeps the movie interesting as well as funny but all eyes will be on the man with the scronny shoulder who lift the movie to both crictcal and box office success\rA must watch movie of the year and a pure Oscar winner for best actor on the horizon."}, {"rating": "10", "text": "This movie was one of the most unexpected, underrated \"Great\" movies of the year..you fall in love with Roy who is a bull riding , woman loving , Rodeo superstar who unexpectedly find he has HIV and is given a full 30 days to live ...Jared Leto plays a great role and this movie won't let you down homophobic or not."}, {"rating": "8", "text": "Dallas Buyers Club could have been a somber and tiresome film given its extremely important and sensitive subject matter, but thanks to the terrific performances by McConaughey and Leto it never feels like a history lesson or a social/political statement.  The two men share a bond that gives this story a very human heart which carries it over any didactic tendencies that it is has."}, {"rating": "7", "text": "Matthew McConaughey has really astonished me in recent years. Whether in a strong supporting role (e.g. \"Bernie\"), a memorable turn as a key character (\"Mud\") or carrying the whole film as he does here, he's just been riveting and real. Of course his physical transformation is amazing, but I have to note that he's also one of very few actors who can convincingly portray someone who is \"impaired\" (drunk or whatever). As for the rest of the film, it's basically a medically themed docudrama, on the order of \"Lorenzo's Oil.\" It is interesting and worthwhile to recall how screwed up so many things were as people learned gradually about the AIDS crisis. But McConaughey's performance is stunning."}, {"rating": "8", "text": "Dallas Buyers Club uses the human drama of Ron Woodroof to explore moral and ethical dilemmas. How do we deal with death? The morals between one’s own well being and the government coporations. These questions are explored through Woodroofs dilemma. Through Ron’s arc from average cowboy porking to active treater to a fighter against the system it is all nicely conveyed. Matthew McConaughey gives a great performance immersing himself in the character and Jared Leto is unrecognizable. While I am lacking familiarity with the events the film was based off of on its own it’s a well made film that deserves a watch."}, {"rating": "8", "text": "Matthew McConaughey is nearly unrecognizable as Ron Woodroof, a man who contracts AIDS during the beginnings of the crisis in the 1980s.  He is straight, and homophobic, and when he first learns he has contracted the disease he sets off to Mexico to get medication that is not available in the U.S.  I think at first his intention was to make money selling the drugs in the U.S., but when he meets the gay people in the same predicament as he is he becomes compassionate and comes to the realization that gay people are the same as any other people.  Its a movie about tolerance, acceptance, and the fact that our FDA is more concerned with profit than helping people recover.  McConaughey lost a lot of weight for the role and gives a great performance.  Jared Leto is also in top form as a transsexual who partners with Ron to sell the drugs to the gay community. Overall a very moving film with great performances."}, {"rating": "6", "text": "If not for the performances, particularly that of Matthew McConaughey and Jared Leto, this movie would have been absolutely boring. They give what is perhaps the best performances of their careers. Jennifer Garner was good, but not great.\r The pace is a bit too slow. It couldn't accommodate two hours. They should have made this movie shorter. Bet even though the film felt boring at different scenes, the ending ones were good.\r I enjoyed the characters and performances. The plot, on the other hand, left a lot to be desired."}, {"rating": "9", "text": "Still trying to wrap my head around the negative reviews. People think that this movie (and too many others) are trying to manipulate them psychologically. Particularly when in comes to a subject as heavy as the AIDS epidemic, there are going to be strong emotions, but Dallas Buyers Club is nothing but forthright and honest about telling it's story. Mcconaughey and Leto make a believer out of me. The script was so good that they simply needed to support it, instead both knocked it out of the park. Just a very enjoyable, poignant movie experience. Even if you believed that the creators of the film were trying to steer you falsely in a direction, at least they got the skeptics thinking about it."}, {"rating": "7", "text": "Based on real events, this is a story of Ron Woodroof, a straight Texan, a rodeo cowboy, who by accident finds out that he has HIV virus and is given about 30 days to live by doctors. The fight that he starts for his life helped many thousands of others.\r No doubt Matthew McConaughey, who plays Ron Woodroof, will be nominated for the best actor. I also liked the performance of Jared Leto who plays Rayon, his transsexual business partner.\r On the other hand, the character of Eve Saks, the helping and sympathetic doctor, even though played well by Jennifer Garner, is quite flat and cheesy due to the script.\rOverall, the movie deserves to be seen."}, {"rating": "7", "text": "Riding the tidal wave of accolades and awards recognitions, will DALLAS BUYERS CLUB assist the vehement renaissance of Matthew McConaughey to decisively harvest an Oscar statue as the top honor? The odds are very rosy and clearly he is the front-runner now, the only weighty competitor is his THE WOLF OF WALL STREET (2013) co-star DiCaprio, whose overdue condition may facilitate him to snatch the highest kudos.\r DALLAS BUYERS CLUB is a dark horse in the BEST PICTURE race and altogether it picked up 6 nominations, apart from BEST LEADING ACTOR, Jared Leto is also having BEST SUPPORTING ACTOR trophy in his bag. Both men’s weigh-lost exploits are purely meritorious for the sake of taking “acting” with full-blooded dedication, which usually works every time, say Daniel Day-Lewis in MY LEFT FOOT (1989, 8/10), or Tom Hanks in PHILADELPHIA (1993), right, the film is also about AIDS, but Ron Woodroof (McConaughey) is an out-and-out straight man, a dissolute rodeo actually, who is as parochial as his working-class peers, homophobic, ribald and unlikeable, squandering his life immoderately without repentance.\r So, when HIV resides inside his body, as if the almighty God generously give Ron a chance to redeem his meaningless life, it is a customary one man’s fight against the venal DEA, the monopolized pharmaceutical enterprise and the collusive hospital MDs, but there is a missing point, like many biographical narratives, all the achievement comes rather easily in a way that we audiences never comprehend what makes the protagonist “the chosen one”, as for Ron, it is his macho heterosexuality distinguishes himself from the massive homosexual patients, thus the clash and metamorphosis is very theatrical, but how does he manage to be the pioneer in the business of illegal medicines deserves more detailed dissection.\r Director Jean-Marc Vallée (C.R.A.Z.Y. 2005, 8/10) is not a novice in dealing with gay-themed feature, although DALLAS BUYERS CLUB is more of an assigned job for him, a light touch comes effectively when he wields the rodeo clown metaphor to manifest Ron’s inner fear, surreptitious and hallucinating. The make-up team is quite praiseworthy too with so many damaged goods to take care of, the impact is authentically appalling.\r From denial to acceptance, McConaughey unleashes an energetic personification with electrifying panache, self-destructive, uplifting and utter poignant, Ron is not a likable person, but in the end of the day, he becomes a better man, an unorthodox hero. Leto, on the other hand, sets an immaculate epitome of a woman’s soul trapped in a man’s body, his most emotive scene is the only time he wears a baggy man’s suit to ask help from his estranged father, awkward and uncomfortable, his vulnerability is all over the place. Jennifer Garner, as the good side of the hospital doctors, is almost characterless and generic, a major disappointment in the storyline, her patronizing poise is perpetually obtrusive, it is a character should not occupy so much of her screen time, we would love see more of Leto instead.\r It is never a winning battle for Ron, the obstacles are too redoubtable to conquer and Ron doesn’t have the time either, we might wallow in the staged success, but the reality tells us it is a tough one to hem in the lucrative pharmaceutics within a modulated system, the “life first” rule certainly is easier said than done."}, {"rating": "8", "text": "A story centering about a homophobic racist southern roadeo rider who finds out he has aids and his friends turn on him during the aids epidemic in the 80s. Treatment isn't available outside of trials so he seeks results in Mexico and finds a successful mix of legal drugs. Struggling with pushback from the FDA after he sets up a successful \"buyers club\" for others in the area to be treated, while struggling with a difficult relationship with his drag queen partner whom he grows to at least respect, played amazingly by Jared Leto. Jennifer Garner plays a charming doctor who befriends Matthew McConaughey and helps him in some ways. It's a great movie."}, {"rating": "8", "text": "McConaughey and Leto give great performances. From start to finish it's a satisfying and informative film to watch. It's definitely one that makes you think and is one that shouldn't be missed."}, {"rating": "9", "text": "Great acting, great scary story. Wonder if its stille the same with the industri deciding which drugs that Work and not... probably. Both Leto and McC does an amazing job. Just the fysical apperance is oscarworthy."}, {"rating": "10", "text": "One of the most inspiring films of late. Dallas Buyers Club is a story like none another. It'll move you--I guarantee it. Matthew McConaughey gives the performance of his lifetime. Still, it is Jared Leto that has given the performance of the year!"}, {"rating": "6", "text": "The film succeeds in the acting department (especially from McConaughey) but after a solid first half, the movie becomes repetitive and a little uninteresting."}, {"rating": "7", "text": "A solid movie with some memorable performances. It does many things right, but it never takes off to become a great movie. All in all, it was a fascinating story."}, {"rating": "8", "text": "A true example of really good film-making. However, what carries this movie are McConaughey's and Leto's performances. They are simply marvelous. Can't remember when was the last time I've been so astonished."}, {"rating": "9", "text": "McConaughey was great in this role, he was the role, the movie the story. Can;t say that about any of his films before this one. On top of a great acting job, the story was very good and even learned tings I didn't know among the way. Leto was also VERY good as the transgender partner. Yes, the movie is predictable at times but worth a watch or two."}, {"rating": "7", "text": "Dallas Buyers Club is certainly a pretty good biopic of a man dying of AIDs who decides to try and help other victims get the drugs they need. I think the hype over the acting is a little over the top. Their transformations are amazing and the acting is great, do not get me wrong, but it is certainly not McConaughey or Leto's best performance. To me, McConaughey was better in Mud, Killer Joe, and (later) True Detective. Leto was better in Requiem for a Dream and Mr. Nobody. However, both were great here and deserved their Oscars, if not just for this film, but for their body of work. Jennifer Garner is also good here, though she somehow managed to fly under the radar for many. The biographical elements here are solid and the film itself is a alright, but certainly not anything great. What really makes this one click is the aforementioned acting from McConaughey and Leto. Their chemistry is great too and is truly contagious. They both do a great job playing their respective roles and the praise they received is deserved. The praise for the film itself, however, may be a little much, but I enjoyed it regardless."}, {"rating": "8", "text": "An inspiring story amout a man struggling for life and helping other people to struggle. Nice acting and emotionally engaging plot work well in this movie."}, {"rating": "8", "text": "Nel momento in cui più che una malattia l’AIDS sembrava un flagello divino, Ron Woodroof si scopre sieropositivo dopo un controllo di routine: un marchio difficile da portare per uno come lui, omofobo elettricista che partecipa ai rodei, vive in un piccolo mondo dalle vedute ristrette come le sue e ha con il sesso un rapporto di puro consumo. In ospedale gli danno trenta giorni e una medicina che lo fa stare peggio: Ron decide di reagire, va in Messico alla ricerca di una cura alternativa e, quando la trova, mette su un’importazione parallela (nonché illegale) per distribuirla ad altri nelle sue condizioni attraverso il club di cui al titolo, ingegnosa trovata per aggirare il divieto di vendita diretta. Ad aiutarlo c’è soprattutto il travestito Rayon, che gli allarga a dismisura la clientela, ma presto arriva il contrasto con la rigidità della medicina ufficiale e con le case farmaceutiche: una battaglia persa, ma, prima di morire ben sette anni dopo rispetto a quando gli era stato pronosticato, Ron riuscirà a ottenere, almeno in parte, ragione. E’ curioso che, anche adesso che la malattia è stata culturalmente metabolizzata, i film sull’AIDS continuino a essere assai rari: l’argomento sembra restare tabù e anche questa sceneggiatura di Craig Borten e Melisa Wallack ha fatto una gran fatica a venire alla luce. Il progetto, nato quando Woodroof era ancora vivo, è passato per tante mani ed è stato finalmente realizzato solo grazie al contributo di McConaughey e al contenimento dei costi: solo venticinque giorni di riprese (se non altro, i due protagonisti hanno così evitato di morire d’inedia) e attrezzature ridotte al minimo. Con queste ultime, il canadese Vallée firma un dramma classico in cui si narra la parabola di redenzione di un uomo ignobile che ha il coraggio di sfidare il destino e i mulini a vento (ovvero Big Pharma), superando al contempo i propri pregiudizi mentre mette in mostra un fino a quel momento sopito spirito imprenditoriale. Come si nota, tutta una serie di classici temi del cinema statunitense che vengono però raccontati con il piede ben piantato sul pedale del freno: i patetismi sono banditi in favore di uno sguardo molto naturalistico (magari un po’ aiutato dalla carenza di mezzi) che sembra ispirarsi a certe opere di Cassavetes. Il Texas che ne esce è un postaccio, dove lo squallore degli ambienti si somma alle ristrettezze mentali di chi ci vive senza alcun desiderio di allargare l’orizzonte: solo la malattia arriva a portare un sconvolgimento tale da far cadere le barriere, ma il prezzo è venire esclusi senza pietà dal proprio ambiente. Proprio per la capacità di narrare tale sconvolgimento, la prima parte del film si rivela più interessante della seconda, dove hanno il sopravvento le disavventure del protagonista con la DEA e con la giustizia del suo Paese diminuendo in qualche modo l’intensità della pellicola anche se l’impostazione visiva rimane coerente: si veda il tristissimo ristorante in cui Ron cena con la dottoressa Saks (Jennifer Garner), l’unica esponente della medicina ‘ufficiale’ che si degni di dargli ascolto. E’ probabile che gli dia ascolto anche perché, sotto i baffoni e dietro l’aspetto pelle e ossa ottenuto perdendo circa venti chili, c’è il fascino di Matthew McConaughey, la cui prova d’attore, con incluso tour de force fisico, è il vero valore aggiunto di ‘Dallas buyers club’ che, grazie a lui, passa da lavoro discreto a pellicola da vedere: l’immedesimazione è sia fisica sia psicologica per una recitazione che, come il film, riesce a trasmettere la carica emotiva pur sforzandosi di non mostrarla in modo palese. Accanto a lui, gli altri attori danno vita a onesti ruoli di supporto (anche Garner risulta sacrificata e non è particolarmente incisiva) con la sola eccezione di Jared Leto che – dopo una pausa di cinque anni – si toglie una decina di chili per incarnare un/una Rayon molto femminile: una bella prova solo messa un po’ in ombra da quella di McConaughey che magari fa un po’ la figura di quei chitarristi abbonati all’assolo che mettono in secondo piano il resto della band ma, tutto sommato, meriterebbe proprio l’Oscar."}, {"rating": "8", "text": "In Jean-Marc Vallee's \"Dallas Buyers Club,\" McConaughey and Leto bring near perfect performances and the talented writers weave in some bureaucratic intrigue along side a hefty amount of emotional depth, rendering the film into a worthy dramatic study of one man's shockingly true story."}, {"rating": "10", "text": "Dallas Buyers Club chronicles the struggles of a man suffering from AIDS as he is shunned by friends and finds solace in the most unexpected of places. As he struggles to stay alive, he is forced to use medication that brings him into conflict with the authorities.\r We follow Ron Woodroof (Matthew McConaughey) as his previously cavalier lifestyle is brought to a standstill with the knowledge of his disease. His confession of his illness to a friend has an unexpected effect when he is perceived as a homosexual, even though he clearly loathes them. He straightens up and does some research, and when he discusses this with Dr. Eve Saks (Jennifer Garner), he finds that as long as a treatment is not approved by the FDA, there's no chance he can opt for it, despite its use in other parts of the world. AIDS brings him into contact with Rayon (Jared Leto). His hatred of gays resurfaces. But they are another misunderstood group of people who indulge in their feelings without bringing harm to anyone. Ron is evicted by his landlord and his walls are vandalized. Finally he gives up everything and heads after a rumour in Mexico. On his return he starts the Dallas Buyers Club, and attempts to spread medication not approved by the authorities.\r Somewhere along the way, he changes and looks at life differently. This development is surprising when it happens, and I applauded when he rose to the occasion instead of going down the easy path. Ron becomes a big businessman, travelling between different countries in order to circumvent law in bringing life saving drugs into his own country. His interactions with Dr. Eve (Jennifer Garner) are a source of great insight into the disease and much amusement on the side. We also get to see some of the hidden life and past of Rayon. Ron finally takes FDA to court to avail his right to his own treatment.\r Matthew McConaughey has perhaps delivered the most shining performance of his career. Other than weight loss, which is what most actors go for when a role requires it, apart from weight gain, he created a character who was at once a southern hippy and low life yet had a peculiarly uplifting view of life.\r Jared Leto plays a cross dressing gay man who finds friendship in the reluctant Ron. Together they spend what time they have trying to keep other people suffering from AIDS alive.\r The script succeeded in imparting useful information about the disease and its possible cures and the development of medicine designed to keep the harmful effects of the virus at bay. But it did not achieve this at the expense of entertainment. The film was comical all the way.\r We also get to witness the dirty side of society_ the misconceptions people have about the disease and its patients, and their unforgivable behaviour when they unload their insecurities onto the hapless victims. Also portrayed is the behaviour of straight men towards homosexuals.\r The production design did a remarkable job given that the budget was negligible compared to other great movies nominated for the category of Best Picture. The environment of the 1980s and 1990s Texas, including the cars and dresses,  was convincing. The film succeeded in letting us glimpse into the daily life of that era as well as telling a good story with intriguing characters.\r Dallas Buyers Club is a must watch film because I don't really know any other that has dealt with the subject with this much depth."}, {"rating": "8", "text": "Stars Matthew McConaughey and Jared Leto certainly put themselves through the ringer here playing aids stricken characters, McConaughey even going as far as to shed a considerable amount of weight for his role. Economical editing propels the story forward and the two lead actors are superb even if the film suffers from a mid section that seems to lose some momentum. Things become very emotional at the end with Leto registering strongly in these scenes."}, {"rating": "9", "text": "Day by day, movie by movie he's getting better and better. Who? Matthew McConaughey. I thought 'The Lincoln Lawyer' was his best, but then 'Mud' came and I was shocked about his performance. Now even better in this movie, in fact the best from all of them. The first thing popped out in my mind was the Christian Bale's 'The Machinist'. Because of his weight reduce for the role in the movie was phenomenal. In this movie as well McConaughey did same homework for a movie character and it was just awesome.\r You can ask anybody who saw the movie will say McConaughey's performance was astonishing. But you know what I surprised in the movie other than him, Jared Leto. You will gonna observe his next best performance in here only after 'Mr. Nobody'. Yeah, I was shocked by his appearance, he totally had the movie along with McConaughey.\r The movie was based on the real story about a person from the 80s who had HIV+. The movie briefs his struggle to survive against the dangerous disease as well fight against the law. The story was very good, it says 'no matter what, you never give up'. How far would you go to fight in order to survive when law and medicine failed its duty along with losing your best buddies. It was just like the other perspective of story to 'Puncture' where a man fights to prevent spreading this same disease.\r If 'The Machinist' for Christian Bale then 'Dallas Buyers Club' for Matthew McConaughey. He nailed it, the character was totally looked like from the state of Texas and none others would have been done like him. Definitely one of the front runners for OSCAR in the best actor category. This great performance will be a biggest breakthrough in his career for sure. And that makes he's in watch-out list from now on."}, {"rating": "8", "text": "Since before the start of the new millennium until just after 2010, Matthew McConaughey‘s body of work was just that, a body that worked well on the screen for so many of the aimless, brainless onslaught of romantic/comedy disasters, in which he played the lead. In 1996, McConaughey played Jake Tyler Brigance in Joel Schumacher‘s A Time To Kill. Hailed as the best performance of his career, it seemed like, critically, that was the closest the actor would get to any praise.\r In 2011, McConaughey took the lead in Brad Furman‘s The Lincoln Lawyer, a by-the-number crime/mystery, where, McConaughey was able to flex some of his acting muscles as opposed to abdomen muscles. Since then, in what has been the most sudden and misunderstood acting turn in recent memory, McConaughey has reinvented his career and is continuing to be casted as a serious actor with serious acting skills.\r While the Texan acting inspiration has remolded his career in a time span that puts to shame that of Downey Jr. and Travolta, one of McConaughey‘s unflinching signature acting staples is his bold and proud Texan accent. And while I can’t really imagine how a cowboy like himself was cast in Christopher Nolan‘s upcoming science fiction Interstellar, McConaughey and his accent were surely a match made in heaven for his role as the slowly weathering and dying HIV/AIDS patient Ron Woodruff.\r For Dallas Buyers Club, McConaughey and his accent worked exceptionally well. Quebecois director Jean-Marc Vallee helms McConaughey as Ron Woodruff; a rugged, homophobic, ultra-macho, bull-riding, money throwing,  playboy with no accord to anyone. Woodruff, a money hustling, chance taking electrician juggles his fortune, his luck, his women, and his job to make ends meet and live a somewhat fulfilling life. It isn’t until an unexpected accident at work that leaves Woodruff hospitalized, giving him no choice but to make a difference in his life and the lives of many others.\r Upon learning of his recent HIV positive diagnostics and short thirty day life expectancy time span, Woodruff, reluctant to die, uses his hustling, smooth-talking, greasing ways to secure him a new, untested medicine to prolong the spread of HIV, the FDA (Food and Drug Administration) approved AZT. After consuming an uncontrolled amount of AZT, the only legal drug that was available at the time in the United States, all the while, still abusing his substances, Woodruff has a close encounter with death. Coming to the morbid realization that the ATZ was depleting his longevity, he enlists the help of a disgraced doctor (Griffin Dunne) and together bring unapproved anti-viral treatments to the U.S illegally. What starts off as a simple economic money tapping market venture, Woodruff, along the way, comes to the realization that his efforts to help others, are actually working. Enlisting the help of fellow HID/AIDS victim Rayon (Jared Leto), the two start the Dallas Buyers Club, an alternative treatment centre for paying members that pits Woodruff in a gestating face-to-face with the FDA and other pharmaceutical companies. As the clientele grows thanks to Rayon’s introduction to the biggest HIV/AIDS demographic, homosexuals, Woodruff has a revelation that not only changes his opinion of gays but also is a deep and dark look of sexual discrimination in the south of the U.S in the 1980′s.\r Dallas Buyers Club is a film dependent on the skills of its actors physical and mental performances. Aside from McConaughey‘s drastic forty pound weight loss, supporting actor Jared Leto dropped a hefty amount of weight to play the utterly convincing transsexual Rayon. Veering far away from Christian Bale comparisons in his eerie and grotesque turn as Trevor Reznik in Brad Anderson 2004′s indie The Machinist, the two leads in the Dallas Buyers Club abandon physical spectacle in exchange for allowing their on-screen presence to give a candid, historical accuracy of HIV/AIDS patients, and the brutal struggle they faced against a deadly and unforgiving epidemic in the United States in the 1980′s.\r Dallas Buyers Club is McConaughey’s best role yet. Fierce, trashy and edifying, the actor substitutes humility for profanity, glamour for wretchedness, and the light-hearted for the heavy and unapologetic. Finally, McConaughey joins a club of actors that he should be proud to be a part of.\r Although the year’s lead actor category is going to be a full one at this year’s Academy Awards, the Supporting Actor category will have a  clear winner. Unrecognizable, subtle and submerged into the role, their is no deny or ignoring the raw talent Leto brings to the role of Rayon. His previous efforts as a dedicated method actor, either gaining a large amount of weight or shedding weight with a wink of an eye, Leto‘s dedication to the craft is showcased in Dallas Buyers Club, and will surely be rewarded."}, {"rating": "7", "text": "Dallas Buyers Club is a performance movie. If you don’t know what that is it means a movie relies on its actors and actresses to carry the plot. Usually this is because the plot is terrible and has no depth whatsoever, but the plot is one of the best things about Dallas Buyers Club. You probably know that it is based on true events and some of the stuff Ron Woodroof got away with is almost unbelievable. And it makes brilliant entertainment. But as I have mentioned this is a performance movie and the strongest thing about it are the performances. Matthew McConaughey is amazing and I think the reason behind it is he has just had what some are calling a McConnaissance, he has had a career change and is now planning to do more serious roles and less crappy rom-coms. Jared Leto I think is just as good, he plays a transvestite. And is not a transvestite in real life. That is a hard thing to pull off. But he does it extremely well and the hair and makeup artists perfectly show his descent into extreme illness. All of the supporting cast are brilliant aswell and compliment the lead cast while staying Oscar worthy, of course they haven’t even been nominated that’s how the Academy works. The only things about Dallas Buyers Club which I didn’t like were that I had no idea who some characters were, they just sort of turned up. And the last shot was slightly clichéd, not the whole ending that was almost perfect. It was just the last shot felt a bit overly philosophical when it wasn’t actually philosophical in any way. However Dallas Buyers Club is a hugely enjoyable and very intelligent movie overall, mainly due to the two leads Matthew McConaughey and Jared Leto who practically carry the whole movie."}, {"rating": "9", "text": "Incredible Performances, an incredible true story, and an amazing soundtrack. Very inspiring film. If you have not been able to see this film yet, get out and see it."}, {"rating": "8", "text": "Matthew McConaughey and Jared Leto give fabulous performances in this strong film about a man trying to fight against an authority while also learning to become a more respectable human being.  A-"}, {"rating": "7", "text": "Dallas Buyer's Club is a great film, and another incredible example of what a talented actor Mathew McConaughey has become. His performance is astonishing and one of the best performances of 2013. He  immerses himself into the role, his character really does begin to come to life. It's a stunning performance. The movie's script leaves a bit to be desired, and the pacing is a bit uneven especially during the film's middle act but overall this is a very solid story.The direction is good,and the movie feels mature and precise with the way it handles it's subject matter. It's not an easy watch,but very rewarding for patient viewers.It's one of my 10 favorites of 2013,a truly great year for films.Dallas Buyer's Club gets my approval."}, {"rating": "10", "text": "You know what's so extraordinary about Dallas Buyers Club? It's raw, it's daring, it's non-stop, it's crude, it's entertaining, you get invested in the two lead actors' performances (Matthew MacCounaghey  and Jared Leto), it's greatly made, it's not an easy view, it's an achievement, it's a crowd-pleaser! Awesome movie!"}, {"rating": "8", "text": "Dallas Buyers Club explores the seedy underworld that is the fight against AIDS. This movie is not easy to watch with the homophobic slurs and imagery, but the performance from Matthew McConaughey stands as the years best with Jared Leto bringing in an equally impressive performance as Rayon. I was not entertained, but inspired throughout as this movie is more of a character study on Ronald Woodroof rather than an explanation of historical events. It serves its purpose well as the movie takes its spot as one of the best movies of 2013."}], "recommendations": ["richard_jewell", "the_danish_girl", "philadelphia", "judas_and_the_black_messiah", "the_mauritanian", "just_mercy", "hidden_figures", "brothers", "bombshell", "spotlight", "the_imitation_game", "the_last_king_of_scotland", "fences", "the_post", "the_founder", "only_the_brave", "nightcrawler", "gold", "gifted", "jackie", "wall_street", "still_alice", "the_judge", "the_fighter", "a_bronx_tale"]}