{
  "id": 563,
  "title": "Dangerous",
  "starring": [
    "Scott Eastwood",
    "Mel Gibson"
  ],
  "runtime": 99,
  "genre": [
    "Action",
    "Thriller"
  ],
  "description": "A reformed sociopath heads to a remote island after the death of his brother. Soon after his arrival, the island falls under siege from a deadly gang of mercenaries, and when he discovers their role in his brother’s demise, he sets out on a relentless quest for vengeance.",
  "releaseYear": "2021",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/vTtkQGC7qKlSRQJZYtAWAmYdH0A.jpg",
  "categories": {
    "plot": 7.75,
    "acting": 7.0,
    "ending": 5.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 5.0,
    "action": 10.0
  },
  "reviews": [
    {
      "rating": "7",
      "text": "Awesome Movie! I wasn't expecting much when I decided to watch this. I honestly thought it would suck right from the start but the story is pretty well made. Overall I would rate a very Solid 7/10 very entertaining!"
    },
    {
      "rating": "10",
      "text": "These are the kind of stories Jack Kirby wanted to tell. I challenge anyone to find a better film that depicts the existential crisis of a pantheon Godlike beings. These are the creative swings that people have been clamoring for the MCU to take, and they knocked it out the park. With audiences having less prior knowledge of these characters than any other in the MCU, the largest main cast, and no definitive main character, I would argue that this is the strongest ensemble cast in the MCU. The pacing allowed the film to truly feel like an epic, while mixing in two intertwined mysteries presented early in the film and revealed at the perfectly placed denouement. Chloe Zhao's use of scenic wide landscape shots for many of the action sequences puts the audience in the eyes of a mortal spectator viewing a clash of gods from a safe distance. Never before has a film made me ache for the chance to see the long lost wonders of the ancient world, which were brought to life as living breathing cities, and not just fancy CGI backdrops. The film has been met with mixed reviews, but I think that like many films before it, time will have many detractors reversing their opinions."
    },
    {
      "rating": "4",
      "text": "It wasnt completely bad and some parts of it were ok and watchable, but at the same time nothing special and some parts of the acting or the story were a bit too dumb. 4-5 my rating"
    }
  ],
  "recommendations": [
    "mortal_engines",
    "the_13th_warrior",
    "cloud_atlas",
    "the_green_knight",
    "arrival",
    "blade_of_the_47_ronin",
    "master_and_commander_the_far_side_of_the_world",
    "inception",
    "hugo",
    "blade_runner_2049",
    "captive_state",
    "avatar",
    "annihilation",
    "chaos_walking",
    "dunkirk",
    "sunshine",
    "interstellar",
    "valerian_and_the_city_of_a_thousand_planets",
    "signs",
    "coherence",
    "sicario_day_of_the_soldado",
    "what_happened_to_monday",
    "reign_of_fire",
    "a_quiet_place_part_ii",
    "unbroken"
  ]
}