{"id": 2373, "title": "Daredevil", "starring": ["Ben Affleck", "Jennifer Garner"], "runtime": 103, "genre": ["Fantasy", "Action"], "description": "A man blinded in a childhood accident fights crime using his superhumanly-elevated remaining senses.", "releaseYear": "2003", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/oCDBwSkntYamuw8VJIxMRCtDBmi.jpg", "categories": {"plot": 6.375, "acting": 6.035714285714286, "ending": 8.0, "soundtrack": 6.666666666666667, "cinematography": 5.0, "familyFriendly": 6.0, "funny": 6.75, "action": 6.0}, "reviews": [{"rating": "8", "text": "I know what your thinking. 8 for Daredevil? The original is worth 6 at most, the 8 is for the Directors Cut version, which is better than the original cinematic version. For the Directors Cut, a sub-plot is added where Matt and Foggy Nelson take the case of a murdered prostitute, with a drug addict framed for the murder, played by Coolio. This addition makes the film seem darker than the original cut. Foggy Nelson is given more to do than be just the lawyers sidekick and we get more time with Matt Murdock as a lawyer than a masked vigilante. Also, the reason the cops come for Kingpin at the end seems more believable than in the original cut. The opening origin is extended, focusing more upon Matts catholic upbringing and making us feel more for his relationship with his father, which makes it more tragic when his father is murdered. However, many flaws still remain. The playground fight scene's a big one, and you can't help but feel that Jennifer Gardners casting as Elektra was just stunt casting, due to her being in Alias. I personally liked Colin Farrels portrayal as Bullseye. He plays the character crazy and enjoyable, just like Bullseye. I feel they missed a trick though. When Bullseye asks Kingpin for a costume, that was the right moment for Bullseye to get his Marvel costume. But seeing Ben Afflecks gimpy DD costume and the schoolgirl Elektra, maybe a Bullseye costume was better left undone. Michael Clarke Duncan will always be John Coffey off the Green Mile for me, so I'm not fully convinced as him playing Kingpin. I was convinced in his battle with Daredevil and him talking with Bullseye, but not much else. And Ben Affleck as Daredevil? I honestly didn't mind him. Who would've thought the addition of Coolio would help this become a better film? Still confounded by Ben Urich finding the gasoline/alcohol marked DD which he set on fire..."}, {"rating": "10", "text": "Daredevil is an excellent marvel comic and superhero movie. The movie received a lot of flak when it was\rreleased. I don't see why, the movie is terrific. From the acting to the special effects, the movie hits the\rmark. Daredevil deserves the utmost kudos for staying true to the dark themes of the comic book.\rDaredevil and The Punisher are the truest movies to the comic books and they both received low reviews.\rThe reviews mean nothing because both of the movies are magnificent. Both movies are 100 percent true to the marvel comics, A+ for both movies."}, {"rating": "8", "text": "I don't know why this movie gets such low ratings. I know it is not an all time favorite but back then it was entertaining, had good humor and well done action / fight scenes. For clarification: I have not read the Daredevil comics as they were not well known in my country and know him mostly from crossovers with Spiderman and other heroes. Still have to watch the Netflix series (I know shame on me). Back to this movie: It is the story of Matt Murdock. Lawyer by day and vigilante hero by night. He grown up in New York's in the Hells Kitchen neighborhood. As child he had an accident that made him blind but improved his other sense to superhuman levels. He is the dark guardian of his neighborhood as crime rules. Hells Kitchen has a famous history of poverty, gangs and crime bosses ruling the streets. More I wont tell because of spoilers. Ben Affleck is an excellent actor and I think he did an entertaining job here as Matt Murdock and Daredevil. I know he won the golden raspberry but think it is hardly the worst performance in this year. Jennifer Garner as Elektra is dividing. I think the role was a misstep for her career while making no serious errors. She is believable but a bit misplaced by the script. The villains are however excellent. Colin Farrell as Bullseye is such an enjoyable (slightly?) mad bad guy that you will love to hate. Then there is Michael Clarke Duncan as Wilson Fisk better known as Kingpin. He is intimidating, a brilliant plotter and always in control or adapting to every situation. He is always a force to be recognized and one of the most acclaimed villains. I know that Wilson Fisk is white in the comics but don't care about skin color. We got such a good actor and performance that I will praise him. Then there is the story. It is the classical first movie with introduction of the backstory, establishing the characters, settings and relations. So far nothing wrong here. The special effects are good and the fights are well choreographed. I know that Marvel raised the bars later on so it may be a bit underwhelming for some. The soundtrack is excellent and I like Evanescence contribution here. Overall this is a forgotten superhero movie. Hated by some and valued by others. I think it was entertaining at is time and is still watchable. Maybe less if you watch the Netflix series that I hear only praise."}, {"rating": "8", "text": "+++++++++÷÷÷÷÷÷÷++++++÷÷÷÷÷+++÷÷÷+++++++÷÷××××÷÷÷÷÷÷÷÷÷÷■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■"}, {"rating": "8", "text": ":*:*:*\"*\"**\"*\"*\"*:*:*:*:**::\"*:*¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙"}, {"rating": "8", "text": "=:=:=:=:=:=:=:=:=:=:=:=:=:=:=:=:=:=:=:=:=:=:=:=:=:=:=:=:♡◇♡◇♡◇♡◇♡◇♡◇♡◇♡◇♡◇♡◇♡◇♡●■●■"}, {"rating": "8", "text": "Daredevil is what you expect from a marvel themed action film. Daredevil has impressive special effects, a nifty twist, a talented cast who bring the character's to life. Daredevil is a worth entry to the marvel superhero series."}, {"rating": "8", "text": "I have to admit when I saw Daredevil in its theatrical release, I found myself underwhelmed by it. I loved the visuals, but I found the love story soppy and couldn't always make sense of the story. However, hearing so much about the Director's Cut being superior I got the DVD off my brother, and actually I really liked it. Daredevil is not what I call a perfect movie, I still did find the love story soppy and becoming dangerously close to flagging down the film and the soundtrack is rather dated and heavy for my liking. On the other hand, I loved the stylish visuals, the fresh, funny dialogue, that I could make much more sense of the story and could be more entertained by it and the characterisation of the titular character with him being vulnerable and flawed I found him very interesting. The other characters are not as well developed, but are enthusiastically performed. Colin Farrell especially is lots of fun, Jennifer Garner is decent and Michael Clarke Duncan is great as is Joe Pantoliano. The editing is good if occasionally rushed, and the action sequences are clear if not always very subtle. Overall, a good movie that fared much better on re-watch. 7.5/10 Bethany Cox"}, {"rating": "10", "text": "If you plan on watching i beg you to watch the director´s cut. It offer half an hour of new fottage thta improve the story in ways you cna´t imagine."}, {"rating": "8", "text": "●°●°●°●°●°●°●°●°●°●°●°●°●°●°●°●°●°●°●°$.$.$.$.$.$.$.$.$.$.$.$.$.÷*÷*÷*÷*÷*÷*÷*÷*÷*÷*÷*÷*÷*÷*"}, {"rating": "8", "text": "*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:☆°•☆°•☆°•☆°•☆°•☆°•☆°•☆°•☆°•☆°•☆°•☆"}, {"rating": "8", "text": "Daredevil is an extremely, highly underrated Marvel movie. The hate for this movie is ridiculously overblown and exaggerated beyond human human comprehension. It’s nowhere near as bad as many haters make it out to be. I don’t know why a lot of idiots rate it lower and think it’ worse than real bad movies like Jumper, Because I Said So, Thor: The Dark World, Iron Man 3, Batman V Superman: Dawn of Justice, Suicide Squad, Justice League, X-Men: The Last Stand, X-Men Origins: Wolverine, X-Men: Apocalypse, Glass, the Punisher movies, the TMNT movies, the F4 movies, the Star Wars prequels, The Pink Panther, the Alvin and the Chipmunks movies,  Walk to Remember, Alice in Wonderland (the live-action version), Alice Through the Looking Glass, the Transformers sequels, The Pirates of the Caribbean sequels, Takers, The Amazing Spider-Man 2, The Revenant, almost every Adam Sandler film, and almost all of Tyler Perry’s movies."}, {"rating": "8", "text": ",,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,^^^^^^^^^^^^^^^^^^^^^"}, {"rating": "8", "text": "》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》********************************************************"}, {"rating": "8", "text": "⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙●■●■●■●■●■●■●■●÷%÷%÷%÷%÷%÷%÷%÷%÷%%÷%÷%÷%%÷%$$$$$$$$$$$$$$$$$$$$$$$$"}, {"rating": "10", "text": "great it received a lot of flak for some reason but i  loved it!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!"}, {"rating": "9", "text": "&!£!¥**¥()₩)((££&__&/^/%==$÷÷#×@+-'ccv'bm,\":;!??))(&*()₩¥£^&^$#\":&°•《》◇■●♤◇♧♧◇[[}{{♤♤>|~~○⊙○`|{■□○☆°"}, {"rating": "9", "text": "Stunning -------------------------------------------------------------------"}, {"rating": "8", "text": "$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.》■》■》■》■》■》■》■》■》■》■》■》■》■》■》■》■"}, {"rating": "8", "text": "♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇"}, {"rating": "8", "text": "●¡●¡●¡●¡●¡●¡●¡●¡¡●●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●:;:;:;;:;:;:;;:;:;:;:;:;:;\";;:;:;:;:;;:;::;:;:;:;:;:;:;:"}, {"rating": "8", "text": "¤¡¤¡¤¡¤¡¤¡¡¤¡¤¡¤¡¡¤¡¤¤¡¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡•¡•¡•¡¡•¡•¡•¡•¡¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•"}, {"rating": "9", "text": "(at around 1h 30 mins) The Braille writing on the charm pendant spells \"Ailektra\". First character is single dot in the middle - Braille letter \"A\" (characters with dots only in first column \"K\" and \"L\" are placed in the middle)."}, {"rating": "10", "text": "Un ottimo film,personalmente mi è piaciuto veramente tanto.Una storia ben fatta,un cast spettacolare ed un ottima recitazione,mi è piaciuto tanto anche perchè sono un fan del fumetto di Daredevil e adoro Ben Affleck e Jennifer Garner."}, {"rating": "7", "text": "Daredevil. Devil of Justice. There isn't much to say about this film. It's a good superhero movie about a blind fighter with and without injustice in a suit. Ben Affleck, in my opinion, perfectly portrayed a blind man."}, {"rating": "9", "text": "The movie was grows for me, i'm not sure in the beginning of the film because i did not a big fan of the whole flashback scene on how Matt became blind and all that stuff, but then Daredevil started to fills with a stunning, exciting, and cinematic action sequence, the movie has a lot of hearts in terms of drama, and the Daredevil himself played really well by Ben Affleck, Jennifer Garner is mesmerizing as Elektra, Michael Clarke Duncan as for the first time a black Kingpin, not sure for the first time and ended up think he was a great Kingpin, Colin Farrell is great as Bullseye too, and Jon Favreau is just always enjoyable to watch, it's a pretty good revenge story with again good performances, great action, good drama, Daredevil is surprisingly works very well, it's a great movie overall."}, {"rating": "7", "text": "Pretty entertaining hero film with pretty good acting and writing, good action, visuals and music."}, {"rating": "4", "text": "Sem sombra de dúvidas um dos piores filmes já produzidos da Marvel,não são os atores Affleck,Farrell,Garner e Clarke Duncan estão excelentes,destaque ainda mais para performance de Colin Farrell,o problema é a idéia de colocarem na maioria cenas bestas sem ação e sem vida no filme,mas destaques as cenas do Demolidor Vs Elektra,chefão e Collin são as únicas que prestam."}, {"rating": "7", "text": "Summary: Ben Affleck stars as the blind Marvel Comics character who is a lawyer by day and vigilante by night."}, {"rating": "7", "text": "A decent superhero flick but compared to the likes of Spider-Man, etc there are just better ones out there to look to instead. I actually enjoyed the Elektra prequel that followed more than this, but enough about the bad because its still a good film with an interesting premise and a good line-up of actors. The problem is it never really grabs you and you don't really fall in love with any of the characters so I found myself drifting throughout, but still there's enough here for it to be enjoyed."}, {"rating": "4", "text": "\"Daredevil\" is just the worst movie you can think of in Marvel Studios. It has crappy CGI, undeveloped romance between Affleck and Garner (in the movie), and a monotonous length that rushes towards the end."}, {"rating": "7", "text": "Back then it was mindblowing (even though Ben Affleck cannot act), now it seems like old trash. Still a solid movie."}, {"rating": "7", "text": "Real guilty pleasure movie for me, just enjoy the movie for being so, Different, at the time of release it had to go up against the amazing spiderman 2 so, good job for being fun and mindless, this being the main reason why i love the film. The character of Daredevil is very hard to portray and i believe the film did a pretty decent job.\r7/10"}, {"rating": "5", "text": "While 'Daredevil' is most certainly dark and daring (no pun intended), there does seem to be some form of miscalculation regarding to the movie's overall execution to its plot. Ben Affleck stars as respected lawyer Matt Murdock, who, as a child, lived with his wasted father who was a boxer, but one day, after seeing his father as a gang member, he runs into an accident involving bio-hazard oil splashing directly into his eyes causing him to lose his sight and go blind. As he wakes up in his hospital bed, he notices that his four other senses have become heightened, and can visualize what is going on, as long as he concentrates on his four other senses allowing him to direct what he must do. Matt, one night, hears that his father's in trouble, and it turns out that the murder of his father was done at the hands of the Kingpin (Michael Clarke Duncan), and Matt will never forget this night. Time and time again, Matt tries to bring \"justice\" to the city, he fights crime at night as his \"Daredevil\" alter ego, nobody seems to know who this strange vigilante is, but he has gone on record for stopping some of the most vicious criminals in the city. We are then introduced to \"Bullseye\" (Colin Farrell), who is recruited by the Kingpin to assassinate Nikolas Nacheos (Erick Avari), the father of Elektra Nacheos (Jennifer Garner), whom Matt falls in love with, and it turns out that they both share the same skills in fighting. The movie does have its moments of pleasure, and some pretty neat action thrown here and there, but overall, some of the dialogue, some of the direction and just the overall execution of the story comes off a little ridiculous and unintentionally hilarious. I liked the tone, and I liked the actors and what they brought to their performances, but overall, the movie could have been better... a lot better."}, {"rating": "4", "text": "For a superhero that's supposed to be so dark and tortured by guilt (emotional and Catholic), Daredevil is a rather goofy movie. It's dialogue feels like it was written by someone who had never read a comic book trying to emulate one, and scene after scene of forced drama (and by drama, I mean play a ton of emo songs)."}, {"rating": "4", "text": "Excluding some impressive stunts, there's just not much here if you look at all the money and star power that went into making it."}, {"rating": "2", "text": "This movie is so **** stupid it's depressing. Are you saying that you can press a button (without holding it) in your computer and delete a text? 'Cause that really happens in this piece of sh*t. Nothing good comes out of here -- with the exception of Ben Affleck's performance (for the most part) -- and even Jon Favreau is bland in this picture. I don't even understand how the general consensus of the audience gives this movie a 7.0. It's so colossally dull and noisy.\r 2.5/10."}, {"rating": "3", "text": "Daredevil could’ve been a good film. The set up was decent and the visual style was intriguing but the film quickly throws away its potential after the first act. The film glosses over Daredevil’s origin, which could’ve been a film onto itself and fleshed out the protagonist but the film just skips to him being Daredevil so he can fight the Kingpin. Michael Clarke Duncan does the best he can has the villain and provides one of the more entertaining performances of the film but its not enough. The film is way too goofy at times and his henchman Bullseye along with Eletrika along with some bizarre choices in filming, editing, and scoring. The cast assembled here is good and fine but while they try to give the best performances they can they have been handed a terrible script. Daredevil isn’t the worst comicbook movie ever but its still bad providing a forgettable film that you could honestly skip, which is a shame considering how fascinating this character is in the comics. Hopefully the upcoming Netflix series will make up for it."}, {"rating": "4", "text": "I recently read Brian Michael Bendis' run on Daredevil and was blown away by how good it was. Out of curiosity (and my better judgement) I decided I had to watch this movie. Unfortunately, the quality of the comic book is lost to the film. Director Mark Steven Johnson got just about everything wrong.  The casting was poor - the most obvious example is Michael Clarke Duncan as Kingpin. In the comics, he's a fat white guy. In the film, hes a black body builder. I could have lived with this if Michael Clarke Duncan could play the role of a villain - but he's just to damn charming. Ben Affleck was mis-cast, as was Jennifer Garner. Their combined acting was pretty poor - I just couldn't suspend my belief long enough to accept either of them as heroes. I think the director just tried to cram too much into this film. The film covers Matt Murdock gaining his powers (and disability) as a child, his fathers death, his career as a lawyer, his romantic relationship with Elektra, his friendship with Foggy Nelson and Ben Ulrich and his feud with both Bullseye and Kingpin. It was just too much - the movie was saturated and watered down with plot devices. Aesthetically speaking, the film was too dark. Many of the scenes were filmed at night or in dark interiors. I found it distracting during the action scenes; the sequences were hard to follow because of the dimly lit sets. Finally, I'd just like to point out that this movie is CHEESY. Good god. I actually laughed out loud a couple of times because of how bad the acting/dialogue was. The bottom line? Skip it, especially if you're a fan of the Daredevil comics."}, {"rating": "0", "text": "Daredevil is the sort of half-asses, visually lackadaisical potboiler that makes"}, {"rating": "6", "text": "Okay superhero movie, at best. The score and dialogue are pretty unintelligent, but the added imparity of blindness to the protagonist adds for at least a little something extra."}, {"rating": "3", "text": "Daredevil embodies what not to do in a superhero movie. Have cheesy one-liners, convoluted plot and a Director who claims all the best scenes were removed in post. Overall not badly shot, but everything else stinks."}, {"rating": "7", "text": "Daredevil is a great movie, for the Marvel fans (at least.). Ben Affleck is a blind hero by the name of Daredevil who makes his vision by his excellent hearing. The movie is over the top R rated fun. Jennifer Garner is hot, Duncan is funny and Ferrell is awesome and violent. This movie is so boring to normal man and so much fun to Marvel fans. Critics aren't Marvel fans. Daredevil is so awesome you will cry. It's corny fun. What we want! The guns are used and the blood is shed. Watch the UNRATED version! (If You Dare!) every actor nails it in this film and the pacing is good as well. It's a 7/10 movie for sure. Nothing less nothing more."}, {"rating": "2", "text": "com certeza um dos piores filmes de adaptaçoes de quadrinhos ja feitas, ben affleck horrivel no papel de demolidor ele quis ser maior que o personagem o que decepcionou muito os fãs do personagem."}, {"rating": "4", "text": "Daredevil was historically a Marvel Comics second-stringer, but in hindsight, it makes sense that writer and artist Frank Miller made him the starting point for the superhero renaissance of the 1980s, which looked deep into the psyches of the people beneath the tights, found heroes with scars and demons, and set the tone for comics and their film adaptations ever since. Who, after all, had a rougher time of it than Matt Murdock, a poor kid blinded, orphaned, and thrown to the tender mercies of New York's Hell's Kitchen? His powers come from a sense of loss (his four remaining senses are heightened by his blindness), and even his choice of profession spoke to the great divide within him. A lawyer by day, he acts as a one-man star chamber at night. Drawn from a grab-bag of characters and incidents taken mostly from Miller's run on the comics series, writer-director Mark Steven Johnson's version of Daredevil seems aware of the murky waters it sets out to explore. That makes its tendency to hug the shore all the more frustrating, even though Johnson starts off by making his hero even darker than expected. Ben Affleck steps into the cowl and fetish suit, and for his first adventure, Johnson has him cold-bloodedly murder a rapist who cheated justice. It's almost as if the writer-director had accidentally made a film about occasional Daredevil nemesis The Punisher instead of the Man Without Fear; the fact that the movie treats this as no big deal suggests that it comes from a more disturbing place than anyone in the Marvel universe could imagine. True, Daredevil at least partly deals with Affleck's decision to stop killing, but it's given all the gravity of a decision to stop smoking or eating fatty snacks. The film seems to want all the trappings of the Daredevil comic–the dripping rooftops, the suggestive brooding, the Catholic iconography, and the ever-present potential for damnation–without the attendant baggage. Suggesting a cross between Ving Rhames and Ed Wood stock-player Tor Johnson, Michael Clarke Duncan plays Daredevil's arch-foe The Kingpin, the pitiless source of most of New York's crime, and the man whose decision to assassinate the father of Affleck's new lover Elektra (Jennifer Garner) lends the film its late-in-arriving central conflict. Casting Affleck would have paid off had the conflicted, acerbic star of Boiler Room, Changing Lanes, or even Bounce shown up. Instead we're left with the cardboard hero of Armageddon and The Sum Of All Fears, a caretaker leading man wholly dependent on the quality of the movie around him. Sadly, there's not much of that. Johnson's reliance on optical effects and secondhand fight choreography strains Daredevil's personality through a Matrix filter, and it rarely succeeds on those derivative terms. (Anyone annoyed by shortcomings in Spider-Man's special effects can start working out the wording of their angry Internet posts now.) Thanks to Jon Favreau's turn as Affleck's schlubby partner, a funny cameo by Kevin Smith, and especially Colin Farrell's gleefully psychopathic interpretation of the villain Bullseye, at least there's good stuff in the margins. But on the heels of such successful comic-book adaptations as X-Men and Spider-Man, Johnson's film makes Daredevil look like the second-rate hero he never really was."}, {"rating": "4", "text": "It's not enough to make a regular popcorn superhero flick when films like Spider-Man as well as X-men has wit, character development and high-octane action sequences that makes them great movies all around.\r Ben Affleck fits the role for Matt Murdock/Daredevil but the movie is, ultimately, too derivative to be on par with other superhero movies. It does have enough moments that, without them, would've made the movie much worse than it already is but the rest of the characters don't get their showcase, especially Elektra."}, {"rating": "3", "text": "Mildly entertaining and not much more. The reason why everyone bags on this movie? It's cheesy, Nachio heesy!Concept is great and another Hollywood easy out by going to the comic book well at it's finest. The story is solid though if not a little disconnected. M Duncan as the big boss is a bit of a redirect from the comic but he pulls it off smashingly."}, {"rating": "4", "text": "2003's Daredevil is a terrible movie, but a brilliant comedy. In some ways, it feels like it could be The Room of superhero movies, but it does make a lot more sense than The Room. The soundtrack is hilarious, the moral ambiguity of the titular character is delightfully heavy handed, the action is fun to watch, and there is a lot of delicious scenery chewing from the entire cast. This is one of those rare 4/10 movies that I can watch again and again."}, {"rating": "2", "text": "Ben Affleck is a tool. He's about as believable a super hero as I am a super model. Ben, do us all a favor, stick to directing and  romantic comedies so that I don't have to see you anymore!"}, {"rating": "4", "text": "There are moments of undeniably zippy fun, but Daredevil suffers from indolent acting, incoherent pacing and a monotonous script that's weak compared to the average superhero movie standard."}], "recommendations": ["elektra", "lawless", "thor", "fantastic_four", "alex_cross", "true_grit", "jack_reacher", "spider_man_homecoming", "lucky_number_slevin", "sin_city_a_dame_to_kill_for", "iron_man", "the_suicide_squad", "the_nice_guys", "the_amazing_spider_man", "red_2", "spenser_confidential", "spider_man_far_from_home", "inside_man", "gangster_squad", "the_karate_kid_part_iii", "logan_lucky", "the_italian_job", "seven_psychopaths", "true_lies", "red"]}