{
  "id": 896,
  "title": "Dark Phoenix",
  "starring": [
    "Sophie Turner",
    "James McAvoy"
  ],
  "runtime": 114,
  "genre": [
    "Science Fiction",
    "Action",
    "Adventure"
  ],
  "description": "The X-Men face their most formidable and powerful foe when one of their own, Jean Grey, starts to spiral out of control. During a rescue mission in outer space, Jean is nearly killed when she's hit by a mysterious cosmic force. Once she returns home, this force not only makes her infinitely more powerful, but far more unstable. The X-Men must now band together to save her soul and battle aliens that want to use Grey's new abilities to rule the galaxy.",
  "releaseYear": "2019",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/kZv92eTc0Gg3mKxqjjDAM73z9cy.jpg",
  "categories": {
    "plot": 2.9565217391304346,
    "acting": 2.8620689655172415,
    "ending": 5.133333333333334,
    "soundtrack": 7.0,
    "cinematography": 5.0,
    "familyFriendly": 3.5,
    "funny": 5.4,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "0",
      "text": "To be honest, it was clear that Dark Phoenix would be another failure from Marvel, just because the main role playing by Sophie Turner instead of a good actress, or to tell more precisely that Sophie Turner unsuccessfully tried to show something and no one knows what is it. Unfortunately, bosses of film companies and TV channels idiots (mostly) and absolutely don't understand what a quality product means, they have the task to get as much profit as possible, and for it, they think that them need to invite famous faces, but not good professional actors. So here it turns out not a movie, but sh*t with dubious special effects.With regard to Dark Phoenix:- The main  minus is Sophie Turner. How could she be invited after the Game of Thrones and X-Men: Apocalypse ? With the same success, the role of Jean Gray could be played by mannequin from clothes store no one would know the difference.P.S. The New Mutants will be epic fail, for the same reasons as the failure of Dark Phoenix and X-Men: Apocalypse - famous faces not good professional actors. This is especially true of Maisie Williams, which \"actress\" as Sophie Turner.Bob Iger, Christine McCarthy, Alan F. Horn, Alan Bergman, Emma Watts, Cathleen Taff, Asad Ayaz, Isaac Perlmutter, Dan Buckley, Joe Quesada, Kevin Feige, Louis D'Esposito, Victoria Alonso what are you f* doing?"
    },
    {
      "rating": "0",
      "text": "One of the worst movies by Marvel, and absolutely worst along with X-Men: Apocalypse to all of X-Men series. Of the thousands of actresses Marvel/Disney have chosen dummy Sophie Turner."
    },
    {
      "rating": "0",
      "text": "That's enough! Stop invite Sophie Turner and Maisie Williams into movies and TV shows, because from this they will not become actresses, they will remain two mediocrities who were accidentally taken into Game of Thrones, and now for some reason film companies consider it their duty invited these mediocrities to play the main roles. STOP! YOU'RE DESTROYING HOLLYWOOD!"
    },
    {
      "rating": "3",
      "text": "First of all, I hated everything in this movie and really found no joy in this movie. As soon as I saw the credits rolling I booked it out of the theatre and was the first one out. This movie is so slow in its pacing to the point I nearly fell asleep a bunch of times. This is a superhero movie and part of one of the greatest Marvel superhero teams and there is nothing to keep somebody’s attention for longer than 2 seconds. This movie is one-hour and fifty-four-minutes long but it feels like a three-hour-long film. This is due to the boring dialogue and a slow-paced story that never really picked up at any point. Even the action scenes were boring to watch. This movie has one of the most iconic comic book person ever and they just waste her. There is like three or four action scenes in this film and every single one was just as boring as the last one. The characters for some reason changed so that they were nothing like what they were actually supposed to be. This can be mainly seen with Charles, played by McAvoy, and Nightcrawler, played by Kodi Smit-McPhee. They both had major character changes that just didn’t suit their characters at all. Also, I rewatched a clip from X-Men Apocalypse and Nightcrawler had a downgrade on his makeup effects. The makeup looks nothing like what it did in the last movie. The special effects in this film were just hideous and I couldn’t stand to look at it. This film had a budget of $200 million dollars and I think all of it went to get back all of the actors because they all probably had better movies to film. Lots of scenes in this film just ended randomly. The part where I thought the film was going to end ended up not being the ending and went on for like 2 more pointless minutes. In the end, Dark Phoenix just isn’t a good film for anybody. I give Dark Phoenix a 3.5/10."
    },
    {
      "rating": "3",
      "text": "Not the worst movie I've ever seen. But at a loss of words when it comes to say anything good about it. The acting wasn't bad, but at times was flat. The story as it relates to the comics was way off. Overall, sirens your money elsewhere."
    },
    {
      "rating": "4",
      "text": "X-Men Deserved BetterDark Phoenix is extremely disappointing, but I’m sadly not surprised considering it’s extremely troubled production and multiple delays."
    },
    {
      "rating": "0",
      "text": "This is baaaad. This is not an X-Men movie. Cringe is the king of this so-called movie. It is not a movie"
    },
    {
      "rating": "0",
      "text": "This movie was freaking awful, I never thought they could outdo origins wolverine or last stand but they pulled it off."
    },
    {
      "rating": "2",
      "text": "They took a truly cosmic scale character and made a deeply mundane film out of it. Why would you do that?  There's no epic character arc here, just a series of firework shows interspersed with overwrought agonising.  It's so earthbound in perspective that even the cardboard baddie aliens were made to look entirely human.  A few sparkly effects later, some more maudlin introspection and then we wrap up leaving everyone wondering what the point was.  A gross injustice to the source material.  Super disappointing."
    },
    {
      "rating": "3",
      "text": "A terrible script meets worse directing and an editor that must have been kept in the dark as to the purpose of many of the scenes.  A few decades ago this would have been put in the vault and never seen the light of day.  If you want something more entertaining check out the reasons people are giving this a 10.  Even the shills are phoning this one in."
    },
    {
      "rating": "7",
      "text": "X-Men: Dark Phoenix, an end to an eraThe Stream: The movie is a bit predictable, lacks originality and the end leaves you a little empty.The Big Screen: The movie looks great on the big screen particularly in action sequences.The Final Bill: Being the end of an era, X-Men fans should catch it in the theaters and general watchers should watch the other movies first and then consider a matinee, if you have free time.No after credit scene. Parents be warned that unlike the other 3 movies PG-13 is accurate with some language and violence towards the end.-S2SStream to Big Screen is back at it again. This week we will be reviewing the long awaited, X-Men: Dark Phoenix. The fourth, and final, movie of this recent X-Men reboot. A movie marking a last for 21st Century Fox films with the X-Men due to the Disney/Marvel acquisition. The third movie of the series had mixed reviews but ultimately was very entertaining. Let’s see if Dark Phoenix arose from the ashes for one last flight.Let’s dive deep into the ashes. I wouldn’t say that there are elements of this movie that are bad, just ones that were lacking. The movie is missing some minor detail that would lead you to say, “Oh, that right there was on point.” Even in the ending, the viewer just feels like the movie was good, but something was missing. I’m not sure what 21st Century Fox and director, Simon Kinberg, were thinking when they looked at the product as a whole. Looking back on it, the movie made you feel like when you pick up your cup expecting orange juice, but actually you picked up the wrong cup and drank apple juice. It’s still healthy for you and it quenched your thirst to a degree, but it wasn’t the taste you expected.On top of that, this movie is too eerily similar to X-Men: The Last Stand. Too many elements of the movie made me feel as if I was watching a reboot of Last Stand rather than it’s own independent movie. No seriously, the plot was similar, except the stupid cure aspect. With that said, Dark Phoenix is actually a better version of Last Stand. This may be the reason why the movie feels like it’s lacking originality, but ultimately the movie is just too predictable on its own. This may also be because of the movie trailer. The movie trailer was very good, but also gives away too much. The movie did hide a couple secrets from the viewers, which were worth it, but again execution was lacking. Finally, the director let the movie live in flashbacks too much. An issue not too horrible, but we got the point of the flashbacks the first time we saw them. The 5th time was understood, but just too much.Now, the part that you’ve been waiting for. This movie looks like they spent a $200 million budget. The scenes seem to literally jump off the screen at times. The scene that was in space look great and the action scenes are very clear and well cgi-ed, except for some running and flying. Unlike the previous installments, the movie’s action towards the end is closer to a John Wick film than X-Men. Quite welcomed, even though it’s short lived.The storyline, while predictable, still was executed well, except the ending of the franchise. We take a ride with the X-Men every step of the way. Just like the movie jumps off the screen, so do the emotions we feel. Sansa, while not a great actress, displays a nice depiction of a person drinking in /falling prey to power, yet keeping true to who we’ve known her character to be. James McAvoy, again does a good job, but the movie missed an opportunity to truly use Michael Fassbender. Clearly, the producers were featuring the Queen of the North, but they could have still taken advantage of the star talent in the cast. Lastly, the movie has a little comedy in it, compared to the previous installments, but the few chuckles were good.Long story short, X-Men: Dark Phoenix is a solid movie, but is just lacking a little in execution that would make you say it was a great movie. For fans of the series, you should see this through to the end and the action scenes will make it worth a matinee price. For everyone else, go check out the previous installments first, and then consider seeing the movie during an early matinee."
    },
    {
      "rating": "7",
      "text": "Highly underrated movie that is way better than the first Phoenix saga attempt in X men Last Stand.  I can see how some people hate it though."
    },
    {
      "rating": "3",
      "text": "Already forgot what this movie was about. In another year, I'll completely forget about it if I'm lucky."
    },
    {
      "rating": "8",
      "text": "+Excellent cast deliver memorable performances+Superb soundtrack+Great action sequences-Super cheesy dialogue alert!I expected much less than was delivered here - with all the reviews I'd read going in I expected some sort of feminazi disaster....I was pleasantly surprised and enjoyed watching the journey. Some superb acting here and Simon Kinberg's pleasing direction means all the production goodness is up on the screen here. The emotional and action packed core of the film is present and solid with Sophie Turner delivering an excellent performance here as troubled mutant Jean Grey. The teenage me that grew up loving the animated xmen series was so happy watching this today!(was genuinely moved by the ending also!) So for all true x-fans who love seeing the trials and tribulations of those poor downtrodden uncanny mutants, ignore the hate and breathe in the x-goodness that is Dark Phoenix."
    },
    {
      "rating": "7",
      "text": "All are not good especially the justification of the phoenix that adds another nonsense .. The music is superb #LoveHansZimmer ..The story is sensitive like the phoenix and gifted compared to everything around it .. We talk about power .. Less than x men 3 but much darker and impacting!In conclusion it is an excellent thought you should start! All you need to wake up the woman who is in you \"Laetitia founder of L-Women!\" seen 2 timesTous ne sont pas bon notamment la justification du phénix qui ajoute encore un non-sens.. Les musiques sont superbe #LoveHansZimmer..L'histoire est sensible comme le phénix et surdoué par rapport a tout ce qui l'entoure.. On parle de puissance.. Moins que x men 3 mais beaucoup plus dark et impactant !En conclusion il est un excellent cru tu devrais te lancer ! Tout ce qu'il faut pour réveiller la Femme qui est en toi \"Laetitia fondatrice des L-Women !\" vu 2 fois"
    },
    {
      "rating": "7",
      "text": "Güzel ve sürükleyici bir film filmin bazı sahneleri gereksiz olmasından başka bir kötü yanı yok izlenmesi gereken filmler arasında"
    },
    {
      "rating": "8",
      "text": "X-Men: Dark Phoenix marks the end of a great franchise that lasted 19 years. Granted The New Mutants will be the last X-Men Movie from 20th Century Fox, but this was the last installment in the mainline franchise. X-Men: Dark Phoenix was one of the greatest movies of 2019 in my opinion, I was more than impressed with the talent in this film and I thought it was a sad way to end the series, literally sad as in emotional. I’m happy they showed us the true potential of Dark Phoenix in this explosive finale! I’m very upset that this movie got panned for absolutely no reason at all."
    },
    {
      "rating": "8",
      "text": "It wasn't nowhere near the crapfest most of the reviewers are saying it is. I put it in my top 5 X-Men movies. The only thing that throws it off is that it has a cheap kinda quality to it and the costumes sucked. Sophie Turner is a great Jean Grey. I really think it should've been a two part movie"
    },
    {
      "rating": "0",
      "text": "the movie was horrible. Sophie turner looked like a dam zombie and played Sansa again in Flippen X-men. And \"respect for women lacking\" as throughout the movie they demeaned crippled Prof X."
    },
    {
      "rating": "3",
      "text": "Here we go again. Just when I thought it couldn't get any worse then the last stand, fox managed to surprise me. What a horrible movie, it donesn't even make sense, the plot is awful. Thankfully it's the last one. The rating 3 is for Magneto, the only good thing about this movie."
    },
    {
      "rating": "1",
      "text": "This was literally the WORST X-Men film I've ever watched. It even found a way to be worse than The Last Stand. Don't waste your money. A dollar saved is a dollar earned.. to be used on a movie that's not an absolute flaming dumpster fire. Also, the exploding dumpsters had terrible CGI flames."
    },
    {
      "rating": "3",
      "text": "Only Fassbender as Mags brings something cool to this movie the other actors don't really get what their characters are about.The script is awful the movie has no soul."
    },
    {
      "rating": "1",
      "text": "I knew I shouldn't have gone after reading the reviews but everyone was up for action. The reviews are accurate; it is a retread of everything before and then we put in lots more fight scenes to give it a sense of stakes. Interestingly, the current Jennifer Lawrence curse continues, if she is in the movie, it will tank. This movie is about getting the last dollar out of the franchise. Then again Captain Marvel was far worse than this and made tons of money. My hat is off to the marketing professionals at Disney, they made the right choice not to waste money on this one."
    },
    {
      "rating": "3",
      "text": "This movie is boring at its best and hard to watch at its worst. There is only one kinda fun action scene in the third act but it quickly becomes boring again. There's no feeling of real stakes and I blame the villains because, despite all the exposition thrown at the audience, their plan is not well explained and you are given little sense of how powerful they are or how scared you should be. Character motivations are slim or nonexistent and the cast seems entirely checked out. Overall, I cannot recommend strongly enough that you go see something else. Dark Phoenix is not the worst X-men movie but its definitely bottom 3 and should be avoided at all costs."
    },
    {
      "rating": "3",
      "text": "prolly the worst x-men of the last years, a very weak plot, with a bad direction, boring, useless, nothing new happens, a bunch of great actors with no chance to act properly"
    },
    {
      "rating": "3",
      "text": "As soon as Jennifer Lawrence said women do all the work and name should be changed to X Women .  I knew I was in for another poorly written dull movie with an agenda other than entertainment."
    },
    {
      "rating": "1",
      "text": "This movie is bad....This movie is very bad. The only thing that stops me from giving this movie a 0/10 is because Michael Fassbender came through with a decent performance as usual. Everything else on the other hand is honestly awful. Atleast X-men 3 had the Juggernaut to laugh at."
    },
    {
      "rating": "3",
      "text": "This movie was shallow, there was a forced intention to make it bigger than it really was, as for example the \"solar flare\" or whatever thing that destroys planets... but somehow stopped nearby earth, just in time for it to be absorbed by Grey... really?. The enemies were also shallow, I mean they were some kind of aliens, very stereotypical aliens if you ask, with the ability of acquiring human forms... I mean like thats not been used in a hundred movies and tv programs before, and that posed no real opposition, and the final one, just vanished because it could not absorb all the power it wanted... Sorry it had some action moments like when the military was after Jean, and all of that, but that has nothing nothing of special... (sigh). Hope they didnt make the trailer so appealing as to have me running to watch the movie."
    },
    {
      "rating": "3",
      "text": "Good: The acting was fantastic, as usual for this cast. Good music. Great CGI.Bad: Incredibly boring and trite script that stays heavy and depressing the whole movie. Typical millennial masturbation about naive and untrained young people being better than those with experience. Picture Captain Marvel, but without the refugees and you have pretty much the exact same story. At least Captain Marvel had some funny moments and good action though."
    },
    {
      "rating": "1",
      "text": "Is this a kind of joke ? I think Its the worst movie of 2019 .  just wasting  my time for watching . even its not good for spend time just make me angry and nervous !!! . Only reason i gave 1 is because of working hard for make this thing . What you need is find a spoiler and ask about the movie and simply   you wont have to watch it  and waste your time like me !!."
    },
    {
      "rating": "3",
      "text": "This is by far the worst Xmen movie put out there. Acting was terrible and you might as well throw out Xmen Days of Future past when watching this movie,  because the movie in no way correlates with Days of Future Past as it should."
    },
    {
      "rating": "0",
      "text": "worst comeback ever this movie sucks watch this if you want to waste 30 dollars this move is not worth the money"
    },
    {
      "rating": "0",
      "text": "Too much SJW bs in this one. Not a high quality movie or good story. It says something when what is usually the \"shill media\" who pander to anything that's anti white male, are also reviewing this movie poorly. Avoid."
    },
    {
      "rating": "2",
      "text": "This is probably one of the most terrible movies I've seen recently. Dumb plot, dumb and lazy characters writing, dumb everything."
    },
    {
      "rating": "1",
      "text": "Absolutely awful movie. No chemistry between actors, making JLaw one of the good guys even though she's not. Rubbish, absolute rubbish. This actors don't even look like Xmen. Could go on for decades, because even when first class came out i said no to this actors as xmen. I don't recommend this movie its just a big waste of time nothing more."
    },
    {
      "rating": "1",
      "text": "Terrible movie. I made a mistake thinking that i might be wrong that this movie could actually work, but I've been fooled before. Definitely worst X-men movie"
    },
    {
      "rating": "2",
      "text": "IDK WHY PPL ARE DEFENDING THIS! It's an awful movie.... it's tanking for a reason, it's loosing over 100 million dollars for a reason. The reason is it sucks!"
    },
    {
      "rating": "1",
      "text": "Feminist garbage infects and destroy everything it touches. Vote with your wallets!"
    },
    {
      "rating": "1",
      "text": "This is an utterly reprehensible attempt at bringing the Dark Phoenix saga to the big screen.  The story was ALREADY WRITTEN in the X-Men comics for god's sake!  You had ONE job studio clowns, and you couldn't even get that right.  Avoid this dumpster fire at all costs."
    },
    {
      "rating": "1",
      "text": "This is extremely disappointing. It has taken me a while to really get my thoughts down, after rewatching it. Simon Kinberg wrote a great film called Sherlock Holmes that was so well done. So how the hell is this possible? Well when I heard about the reshoots and the delays, I knew there was problems coming ahead.The writing and effects are the worst aspects of the film. The cast, Michael Fassbender, James MacAvoy, and Jennifer Lawrence are outstanding; trying to make a god awful movie some how work. I am frustrated with Jessica Chastain and how they wanted her to be. There are moments in which this could work, but they are afraid to commit and use cliches to finish the story. But there is a comic book. There's a reason why this film exists, so use it.Overall, just don't watch this movie."
    },
    {
      "rating": "0",
      "text": "More SJW trash. Jennifer Lawrences character proclaims \"women do all the saving around here\", conveniently forgetting that Nightcrawker (A Male) LITERALLY SAVED EVERYBODY by himself in space not 2 minutes prior? I am 19 minutes and 30 seconds into the film and just burst out laughing. Boy am I in for a bumpy ride. Imagine paying money to see this tripe."
    },
    {
      "rating": "0",
      "text": "Dragged to see this loathsome wreck by my nephew who hasn't yet developed critical-thinking skills, I found myself desiring to undergo a colonoscopy; at least I'm unconscious for that.Which may be a great win-win future business-venture: combine colonoscopies for reluctant adults with obnoxiously-woke SJW superhero movies targeting viewers with IQ's less than 50.  And that's not to insult people actually born with developmental deficiencies; THEY can't help the way they are.  No, I'm talking about allegedly functioning-members of society who intentionally switch off their brains because social-media orders them to. Seriously, I read some of the positive \"10 out of 10!!!  SQUEEEEE!\" reviews.  Geez, get a economy-sized drool cup for all that saliva, Skippy.This movie was directed by Simon Kinberg who wrote the screenplay for 'X-Men Last Stand'.  You know, that 3rd movie that was supposed to be directed by the awesome Matt Vaughn but instead went to the hack Brett Ratner?  That should set off Defcon-1 Red Alerts to your wallet.  AVOID THIS MOVIE AT ALL COSTS...Sophie Turner: boring.  Just because she was on Game of Thrones doesn't justify her yet in a leading role.  She needs to seriously pad her resume with at least 5 years of movie roles before doing something this big.Jennifer Lawrence: jarringly-obnoxious & phoning-it-in.  Is she worried that fellow up-and-coming Brie Larson is invading JLaw's man-hating-feminist turf?  Too bad James McAvoy and Michael Fassbender were probably forced at legal-gunpoint.  Seriously, they have this constant \"God-I-wish-I-was-anywhere-else-but-here\" looks on their faces throughout this dreck.And Quicksilver?  He gets sidelined for the most of the movie?  He was the BEST thing about 'Days of Future Past'.Jessica Chastain: competing with Brie Larson for Wooden-Plank-Oscar of 2019.Everybody else: Forgettable. Bland. Invisible.Honestly, if this is the new Hollywood standard, with ENDLESS nagging political lectures to all you audience rubes about how wise they are, I say, \"Sure.  Go for broke.\"  And I mean that LITERALLY.  Hollywood, I suggest that all superhero movies from now on feature EVERY.SINGLE.MINORITY with a political axe to grind as Gary & Mary Sues: perfect in every way, marching across the screen with all your propaganda packaged as eternal wisdom.  And make sure that EVERY moustache-twirling villain from now until Doomsday features a white/conservative/Christian/Alpha male.I'm sure that will reap gi-normous financial windfalls.  As for me, I'm done with movies.  A waste of time & money."
    },
    {
      "rating": "1",
      "text": "I don't remember one of characters name, she change herself in person, she died"
    },
    {
      "rating": "0",
      "text": "I thought Apocalypse is the worst movie franchise. I was right, because Dark Phoenix is not a film at all. This is a badly made amateur video clip. No moments are emotional at all. The plot and dialogue ignores every character development. Xavier is feeble heart and forceless hand. Erik is coward's coward, crybaby and pathetic wimp. The president accepts the mutants, and Erik hides in a bidonville built of Lego toy bricks with a possy of dirty rednecks. Senile teenager Peter is moody. Raven is Mockingjay again. Even the actors seem uninterested in their roles. Fassbender plays like a cheap melodrama. Probably, he is training, waiting for the death of his career. McAvoy just does not play. Turner can not play. Kinberg can not shoot. Action and CGI is poor. The costumes are terrible. All is awful, sad trash."
    },
    {
      "rating": "0",
      "text": "Basically sjw gone wrong, just political agenda with no regard for a good story character development etc.."
    },
    {
      "rating": "0",
      "text": "Horrible. One of the worst \"superhero\" movies ever. Sophie Turner is a pretty bad actor and should not be a lead.This movie was boring and feels rushed, incomplete, predictable in places and poorly constructed.The costumes were very bad and the CGI looks very cheap.Dont waste your money on this very films-student-style and loaded with tropes movie.I was honestly hoping they would end with a good send off considering it's the last Fox Studios X-Men movie. It was full of cheesy one liners and terrible direction. I was ready to leave the movie within 45 minutes of starting it.Now that the Mouse is in charge we can expect nothing good ever again. Sad."
    },
    {
      "rating": "8",
      "text": "Far better than Apocalypse! It could have been better in terms of aesthetics and grandness, but, none the less it is definitely entertaining!"
    },
    {
      "rating": "3",
      "text": "Enredo bizarro. Construção da história ruim. Personagens mal aproveitados. Fênix negra boba."
    },
    {
      "rating": "1",
      "text": "A terrible mess of rushing around for absolutely nothing. It seems like no one even tries to act properly. I didn't even know that this ends the franchise, but what a depressing way to end it indeed. This films tries too hard to be something it is not supposed to be."
    },
    {
      "rating": "8",
      "text": "I actually thought it was okay. Sure, there was some weird direction and weird pacing, but for the first time, these characters felt and moved and behaved like the xmen I grew up with in cartoons and several comics. Oh, and of course it would have been much better without that horrible line about \"xwomen\", that was total cringe for me (a woman)."
    }
  ],
  "recommendations": [
    "the_new_mutants",
    "captain_marvel",
    "poseidon",
    "suicide_squad",
    "red_dawn",
    "black_panther_wakanda_forever",
    "jumper",
    "the_twilight_saga_eclipse",
    "jonah_hex",
    "next",
    "shadow_in_the_cloud",
    "seventh_son",
    "x_men_apocalypse",
    "the_tax_collector",
    "the_twilight_saga_breaking_dawn_part_1",
    "national_treasure_book_of_secrets",
    "terminator_genisys",
    "teenage_mutant_ninja_turtles",
    "wonder_woman_1984",
    "doctor_strange_in_the_multiverse_of_madness",
    "the_twilight_saga_new_moon",
    "the_old_guard",
    "the_guardian",
    "i_am_number_four",
    "i_am_legend"
  ]
}