{"id": 1040, "title": "Dark Shadows", "starring": ["Johnny Depp", "Michelle Pfeiffer"], "runtime": 113, "genre": ["Comedy", "Fantasy"], "description": "Vampire Barnabas Collins is inadvertently freed from his tomb and emerges into the very changed world of 1972. He returns to Collinwood Manor to find that his once-grand estate and family have fallen into ruin.", "releaseYear": "2012", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/eteQ3gyMpA0oiWcYX4XoXGry0cB.jpg", "categories": {"plot": 5.804878048780488, "acting": 5.666666666666667, "ending": 4.636363636363637, "soundtrack": 6.833333333333333, "cinematography": 7.5, "familyFriendly": 6.0, "funny": 5.166666666666667, "action": 5.0}, "reviews": [{"rating": "2", "text": "The visual are top notch but Tim Burton never finds a consistent rhythm, mixing campy jokes and gothic spookiness. Dark Shadows suffering imbalance and ridiculous script and all A-list star here couldn't help much. Despite its intriguing trailer, Dark Shadows turn to be dead and boring entertainment."}, {"rating": "5", "text": "This was a decent movie, and honestly it was better than I expected.  The best part of the movie was the production design, costumes, and makeup.  Johnny Depp did well with the material he was given, even if he did come across as rather annoying at times.  The movie as a whole was funny at times, but at other times I wasn't sure if it was supposed to be a comedy, a drama, or a horror movie.  Overall, I think if you're a Johnny Depp or Tim Burton fan, you'll like this movie.  If not, you should see something else."}, {"rating": "4", "text": "You know that feeling you get when you are watching the trailer to a movie and feeling that all the funny parts were most likely just seen? That was Dark Shadows for me. I knew all the laughs that could be had in the movie arrived in that 2 min sneak but I could not resist Depp and Burton. I have definitely seen worst, don't get me wrong, but i felt myself growing bored and considering how uncomfortable my seat was as it droned on. Save it for a home rental."}, {"rating": "7", "text": "I generally like Tim Burton as well as  Johnny Depp. This movie was no exception. It is a dark (of course with Tim Burton) comedy with some hint of action/thriller in it. I would not really characterize it as a horror movie even though there are a vampire as well as a witch and a werewolf in it. Of course there is the romance stuff but I personally feel that is really more of a background or justification to the plot than anything else.\r This is not a magnificent movie but it"}, {"rating": "7", "text": "There are plenty of flaws to this Dark Shadows, such as uneven plot and character usage. But, Depp plays a most excellent Barnabas Collins and is a vampire that is not afraid to use his very being and powers to get what he wants. Something few vampire movies successfully utilize. Fans of the TV show will undoubtedly be upset with what a two hour film tries to sum up in a thousand episode television show. But for someone new to the series as a whole, i walked away pleasantly surprised and charmed with what Burton and Depp were able to pull off."}, {"rating": "7", "text": "Barnabas Collins has a huge fortune and a great future but he turns out to be cursed by a witch, whose love he despised, becoming a vampire. Now, centuries after his disappearance, he will try to return to his ancestral home in order to protect his descendants. Directed by Tim Burton, it has screenplay by Seth Grahame-Smith. The cast is headed by Johnny Depp, Michelle Pfeiffer and Eva Green.This is the film adaptation of an old soap opera. First, I must say I never saw the original series, so I can not make comparisons. But one thing I noticed: as this film is a dark comedy, many people did not like it because they expected to watch a horror movie or a thriller. This happens especially when we know the story from a book or previous film. But that does not make it a bad movie. As I had no expectation, I watched it as a comedy and really liked it. The dark mood is rare because it is controversial, but this movie is full of good comic moments without breaking with political correctness.The script works on a regular basis, it should have been more reviewed and worked. There are a handful of dubious elements, poorly explained situations and plot holes throughout the film. The provision of the actors was positive, but Johnny Depp's performance in the lead role, overshadows almost all colleagues. Actor experienced and proved in terms of versatility, he is able to do almost any role. Eva Green was also perfectly at the height of her role, giving an icy sensuality to the villain. The scenarios are excellent, particularly Collinwood, whose Gothic and sinister environment has lots of charm. I'm not a big fan of the seventies, but the epochal recreation seems to me dubious and untidy. Most of the scenes seem so much like the present that the audience quickly forgets the story takes place in the past. The cinematography is good, alternating darker and gray tones with more colorful scenes in order to emphasize sensations. The visual and sound effects are good. In turn, the soundtrack has coordination problems between the original track, made for the movie, and music pieces from the seventies that arise in the film and obfuscate soundtrack."}, {"rating": "8", "text": "I never saw the tv show so have nothing to compare it to except Depp and Burton's previous movies. I thought this was witty and well acted. Depp is excellent as a camp, over-the-top Barnabus Collins. Maybe it's not what fans of the series were expecting (or wanting), but I had fun!"}, {"rating": "2", "text": "This may be the best example of a trailer that crammed the movie's ONLY decent 2 minutes into a promising preview. The other 111 minutes are deadly dull. In this vague nod to the TV series, Johnny Depp stars as Barnabas Collins, who returns to his home in the 70s after being buried for 200 years. The potential for fish-out-of-water humor is wrung out in a handful of gags (all in the trailer) and the rest of the proceedings are incredibly tedious and listless. The only thing worth watching is the art direction. Otherwise, this is undoubtedly Tim Burton's worst film ever."}, {"rating": "5", "text": "It was okay.  It started off good, but then there was too many plot lines and back stories, and it kind of fell apart.  It was very rushed, and the characters seemed very superficial.  It was like they were trying to cram years of a TV show into one 2 hour movie.  I've never seen the TV show, so I don't know if the movie was merely the same premise, or if the whole plot was straight from the TV show, but it sure seemed like I was watching a soap opera.  It was extremely melodramatic and soap opera-y.  Yes, it was a former soap opera, but I hopeful that the movie would just be using the same premise to create something better and deeper than that.  That didn't really happen.It seemed like the movie was written 8 hours long, and they just cut most of it out and awkwardly patched the rest together.  At the beginning, we got so much of Victoria that it seemed like the movie was being told from her point of view, but then she disappears for much of the rest of the movie.  It was weird, and I wasn't really feeling the relationship between her and Barnabas.  That being said, it was humorous and fairly entertaining...as much as a soap opera can be."}, {"rating": "7", "text": "I liked it much more than I anticipated I would. I was hoping and praying it wouldn't remotely resemble a Pirates film - it doesn't.   The acting is excellent - particularly Helena Bonham Carter (as the family psychiatrist) and Bella Heathcoate (as Victoria Winters). The parts are not overplayed like they often are in Burton films. Your head isn't spinning by the third act. But what stands out for me is the music - perfectly captures the time period.  I was particularly pleased to hear Donovan's \"Season of the Witch\" and Alice Cooper's \"No More Mr. Nice Guy.\"  The movie does the early 70's perfectly..  Sure, it gets a touch slow, and perhaps runs a bit long, but it's a good movie."}, {"rating": "10", "text": "A fun movie but at the same time dramatic and a little horror. Excellent scenery, even the special effects,an amazing make up, as always, a truly stellar cast and a storyline particularly full of vampires, witches, curses and mysteries to solve."}, {"rating": "3", "text": "The movie is NOT a comedy. All the \"funny\" parts are in the trailer. I'm not even sure what genre it belongs in as it isn't scary either. Just kind of a dumb high budget B film you'd expect to see straight to dvd these days."}, {"rating": "3", "text": "I can't find the Old Burton in this movie. Maybe he is changing his style, I don't know, but I don't like it. I have to admit the mixed all styles: vampire, retro, gothic it's well done...but no more. I am really tired to see Depp doing the same \"Jack faces\" over and over again. If Burton are producing and directing \"kids stuff\" is time he public that new, 'cos this movie.... isn't Burtons style."}, {"rating": "2", "text": "The trailers made this movie look like it was going to be funny and entertaining, I'm a huge Helena Bonham Carter, Johnny Depp, and Tim Burton fan, but this movie was bad. There were funny parts but overall a bad film. There was no character development and the story was all over the place. There were way too many flaws in the story for me to be able to like it."}, {"rating": "9", "text": "It was great in my opinion. However I had one problem with the film and that was the things Depp normally comes out, which which can easily confuse young people, and the actors seem to mumble on occasion, making it hard to understand. Other than that it was a good film, and if you haven't already seen the film, expect many hidden suprise's..."}, {"rating": "6", "text": "There were funny moments in the film, and also scary ones (like that of the child disguised as a ghost) but all as a whole, it was a bit boring, progress was slow, too much speaking sometimes, and characters relationships felt a bit superficial, Victoria overall, it was good at first but then she just disappears the whole film, and her relationship with Deep is barely shown. I think the first part and the ending of the film were the best dramatic moments, the rest felt just as filler."}, {"rating": "8", "text": "I walked into this film expecting to laugh frequently. As it turns out,  a word better fitted to the result would be intermittently. I did enjoy the film. You just need to bear in mind that the majority of punch lines were already delivered in the promotional trailer.I am a fan of Tim Burton and Johnny Depp. For those of you like me out there this will be worth every penny. Don't waste your money on the IMAX version. This particular film is not improved much by the format.This time around Mr. Burton didn't come across as outlandish as in previous films. Perhaps he is residing closer to Earth as he grows in age. Although, my movie date said, and I quote, \"this Tim Burton guy must smoke some good stuff.\"Johnny Depp was impeccable in his rendition. Who would expect any less. The guy has something. Some of you out there could only wish.Eva Green's character was tons of fun to watch. She gives the movie that extra that makes you want to keep watching. No doubt she had a good laugh playing this character. Let's hope she doesn't take it home with her. Scary.Michelle Pfeiffer hasn't been much on the circuit lately, and I wish she did. Her skills are as good as ever in this movie. We miss you girl! Come back more often!Everyone else performed as expected. Professional deliveries all around. Just nothing too off the pallet. I'm not sure the writing asked more of them.I particularly enjoyed the set design and costumes. The right blend of grandiosity and fantasy without getting too outlandish. Do look around as you walk through this film. You will find interesting treats.Tim Burton has always done well using digital effects combined with cinematography to deliver a believable world of fantasy. The film is simply beautiful. Sometimes you just want to hit the magic pause button and stare at the screen for a while. Amazing.Make your way to the theatre and watch this film with positive expectations. It will be well worth it. Just don't expect to laugh off the seat of your pants simply because the marketing wants you to believe that. In retrospect, I see clear now that the movie was never intended to be that. But simply another fantastic world delivered by the never-disappointing Burton-Depp team. Thanks guys!"}, {"rating": "7", "text": "Dark shadows: Fun for the elderly, good for those between 30 and 40 years, but not very good for those under 18. Not that I did not like but when I left the cinema did not like anyone but me. In my opinion it is entertaining but little more ... The problem with this movie is that it has not used the original it was."}, {"rating": "8", "text": "I liked it. I think some of the criticism is valid, however, this IS a movie adapted from a soap opera. It's not supposed to be deep, or especially thought provoking. It's just good campy, vampy fun!"}, {"rating": "2", "text": "I don't know what happen with Burton, I remember Charlie and the Chocolate Factory, Ed Wood, and The Nightmare Before Christmas, excellent movies, but now he do blockbusters for kids, or really terrible movies, Dark Shadows is a great example. The trailers are really funny, but when you watch the movie, you can watch the bad development, the terrible performances (really? Deep again?) and all the problems that Dark Shadows have. Funny in some moments, but the biggest part of the movie is terrible."}, {"rating": "9", "text": "Witty and well crafted with an ingenious interwoven plot as it is not quite a horror film, not quite a romance film while being comedic and seemingly resolute in purpose. Johnny Depp is absolutely amusing and thoroughly entertaining as he tries to apply old world logic to the culture and attitudes of 1972. A bit of a new twist on an old style for Tim Burton. Not to be missed!"}, {"rating": "10", "text": "I like it. Very good movie. One of best Burton's movies. The story is gorgeous. very good cast, Depp is famous, this role (Barnabas Collins) is really for him"}, {"rating": "0", "text": "Sorry to say this movie stank! For the first time this year I feel cheated out of the ticket price. It's a funny thing, as I usually love Depp/Burton movies. Sorry nothing to spoil really, as all the good scenes were already put in the trailers. Watching this movie was like watching a ceiling fan, for two hours! Whollmoley what were they thinking. I will probably rent it for $1 at redbox just to see how it ended. Yes this is the first movie I walked out on in years."}, {"rating": "10", "text": "True to the original material in many ways.  New and different in ways that do not detract.  I thought the soundtrack was great.  One of Elfmans best in fact.  The look of the movie is appropriately dark and shadowy.  Well done.  FUN!"}, {"rating": "0", "text": "What a piece of crud.  This movie sucked (pardon the pun) almost as much as the Twilight films.  Someone please make Burton and Depp from making movies together.  A TV show with over 1,000 episodes that ran for years cannot be made into a condensed two hour movie.  Don't waist your time.  Go see Avengers again, like many people did."}, {"rating": "6", "text": "this film was something i was looking forward to see but only got disappointed. this film was great don't get me wrong with that but there was so many things in this film that didn't really seem to make much sense. the story line and the actors were done well but to be honest i would of rather watched Sweeney Todd instead. the ending was shallow and the finish was too quick. the next film to this would be something to look out for..because i hope it picks its self up."}, {"rating": "8", "text": "It's not the best Burton film, but the art direction and interpretation work are excellent.The story and characters could be better explained but the movie is simply fun."}, {"rating": "6", "text": "With Dark Shadows, Tim Burton reminds us just how good his films can be. It's not on par with Beetlejuice or Corpse Bride, but it's an extremely fun ride and almost makes up for the disappointment of Alice in Wonderland. It's visually sumptuous, with Burton's trademark gothic flair and some pleasing 70s period details, and has a solid atmospheric soundtrack from Danny Elfman, bolstered by an eclectic collection of cheesy rock, pop, soul and disco tunes. It's well-acted across the board, particularly by johnny Depp, Helena Bonham Carter, Jackie Earle Haley and Chloe Grace Moretz, and a gag-laden script by Seth Grahame-Smith and an abundance of camp energy helps to make the film thoroughly enjoyable. The best scenes are in the film's first half, with vampiric aristocrat Barnabas (Depp) adjusting to the 20th century and to his highly dysfunctional family after being forcibly entombed for 200 years. The film does, however have a big problem with maintaining a consistent tone. It's dark, but would probably benefit from being either even darker, and though the horror elements have been toned down because of its low age rating, I would suggest that it's a bit too raunchy to be suitable for some of its intended audience. This raunchiness does result in a very funny supernaturally-powered sex scene between Barnabas and manipulative witch Angelique (Eva Green), but the majority of the implied sexual goings on may result in some awkward questions posed to parents by their children after seeing the film. Also, the special-effects dependent, relatively big-budget finale of the film was presumably meant to be exciting, but comes across as stupid, overblown and belonging to an entirely different film. At other points, there are scenes that appear a bit disjointed and unconnected to those that came before, and Eva Green is guilty of some wooden delivery of her lines, and an accent that alarmingly frequently changes continents. I'm not sure if Dark Shadows says much about anything below its immaculate surface, but the film remains a memorable, funny and light-hearted romp which Burton fans will love, and it proves that there is still afterlife to the relationship between the goths'  director and his favourite actor."}, {"rating": "4", "text": "I don't usually like Tim Burton's movies and Dark Shadows is in between. I liked it but then i didn't like it. Overall it was an ok film, and nothing more. Johnney Depp was his usual strange but comedic self in another one of his collaborations with Tim Burton, but he didn't even feel like the main character throughout. This movie was so clustered and packed with different plots and narrators. One of the main storylines which was between Barnabus and Victoria was only granted about one or two scenes and both were very brief at that. I found myself laughing quite a few times which is about the only positive i can think of from this film other than Depps performance. The ending to the film was just plain strange. It moved from one new story, to and old story, to another new story, and then back to the old one. This film was just filled with too many storylines and different narrations. Theres only two reasons why i would recomend this movie and thats if you're a Depp fan or a Tim Burton fan. If not, do not bother with this movie, even if you were a fan of the original tv series. 4/10"}, {"rating": "6", "text": "Probably it's not the best collaboration between Tim Burton and Johnny Depp, Dark Shadows was a little more than a disappointment. The laughs were a little funny, but Eva Green sure looks smokin' hot as Angelique. Although some of the scenes were too dark with less violent a little bit, but I'm not sure if fans haven't been familiar with the short-lived soap opera cult back in the late 60's. I watched every Burton/Depp movies like Edward Scissorhands, Sweeney Todd, Alice in Wonderland, and Sleepy Hollow. So Dark Shadows is good, but it needs a makeover. I'll wait for a rental."}, {"rating": "3", "text": "It's an open secret among civilians outside of Hollywood that Johnny Depp is a wildly overrated actor, and Dark Shadows stands among the most prime examples. Who told him he was funny? He is clearly his own biggest fan, as there are scenes in Dark Shadows in which he stinks of overconfidence. To be fair, we didn't actually sit through the entire film, but after 40 plus minutes our only hope was to still convince the theatre to give us a refund."}, {"rating": "6", "text": "Dark Shadows takes advantage of the interesting premise. The story could have been a bit more organized and the little bit of action could have been better, but it is consistently funny throughout."}, {"rating": "4", "text": "\"Dark Shadows\" is an oft-filmed tale of shunned-love accented by revenge.  This version is largely set in 1972 when director Tim Burton was a teen so the soundtrack is basically a best of 70s hits collection. All the principal actors get to dress up in period fashion with lots of flattering makeup and hairstyles which I think really thrills the actresses. But the experience itself is something you've seen many times before unless you're only 13 which, by the way, is the maturity-level of this film."}, {"rating": "4", "text": "I expect Dark Shadows to be a funny loosely based comedy and what i got was a  movie that lacks everything creative. very dull which isn't characteristic of tim burton. Visually okay,  acting below par."}, {"rating": "5", "text": "To be honest I thought this was a comedy film. But when I saw it it was just a basic vampire story with a 1970's twist in it. It lacks from a few thing and the ending was silly. But other than that it was okay. Dark Shadows 5.7/10"}, {"rating": "1", "text": "Unless you are a fan of Johnny Depp and/or Michelle Pfeiffer, Eva Green, Helena Bonham Carter and/or Tim Burton you will have a hard time sitting through this almost 2 hour film of â"}, {"rating": "7", "text": "It was quite funny and intriguing, but then things are a little bit confusing at some points of the movie, when I can't tell the main purpose of some of the characters to the story, if you get what I mean. It was terribly confusing to those who do not know about the original like me, especially from the climax up to the end. It was very well-made though, as expected from a Tim Burton film, and some actors were quite good. My exact rating is 6.5, but I'm all right with this rating."}, {"rating": "10", "text": "Long time fan of the original series and loved the new movie. There are even lines lifted direct from Jonathan Frid's portrayal of Barnabas. Wonderful mash up of old and new!"}, {"rating": "5", "text": "This movie was interesting, but the delivery was pretty campy. The actress that plays the Witch, Eva Green, had some of the campiest and cringe worthy acting I have seen in a while. I was glad to see that Abraham Lincoln Vampire Hunter author Sean Graham Smith wrote the screenplay, so it had a little bit of oddness to it. Typical Burton film. It is not really worth paying full price to see in theaters, so I would wait for it to come out at Redbox or any other rental place."}, {"rating": "3", "text": "Tim Burton's Dark Shadows is just another partnership between Burton, Johnie Depp and Helena Bonham Carter. Nothing else. The big problem is Seth Grahame-Smith's screenplay. With its weak humor, the film doesn't know which character to follow. Another problem are the subplots, that are poorly resolved. Johnie Depp is okay as a vampire, Jackie Earle Haley and Helena Bonham Carter are good, but Eva Green delivers an over the top performance as an evil witch. At the end, Dark Shadows is a boring, poorly written film."}, {"rating": "3", "text": "What happened to TIm Burton? He used to be such a great film maker. My guess is that he had a spurt of creativity in his teen years and was happy to muck around in the same stomping grounds for the rest of his life. Hollywood and the general public felt differently though. After rehashing Beetlejuice and Nightmare before Christmas to make Corpse's Bride, someone probably told Mr. Burton that people were getting tired of the same thing in slightly different packaging. It's at this point that Mr. Burton fell into the same trap that currently plagues Hollywood. The remake.  Planet of the Apes was drab and had none of the Tim Burton Magic. Charlie and the Chocolate Factory was just dreadful. And now we have Dark Shadows. Tim Burton doesn't seem to be able to point this piece in any direction. There's just far too much ground covered in too short a time. I had no feelings throughout the entire movie for Victoria, who's supposed to be the main love interest. They could've pulled a Sixth Sense, she's been dead the whole time, and no one would've blinked or cared.  And why must all Tim Burton movies star Johnny Depp and Helena Bonham Carter? They're both good actors, but please get some other people in there. Did they sign some sort of life long contract? If they had removed the whole vampire being confused by modern day shtick, they may have been able to tell a decent story. Or go the other direction and go for pure comedy.   This movie is muddled and confused. If you're aching for some Burton/Depp magic, go watch Edward Scissorhands for the hundredth time."}, {"rating": "9", "text": "I'm surprised that this movie hasn't gotten better reviews.  I wasn't expecting much but was very entertained throughout the whole movie.  I especially liked all the bright colors/visuals.  It was pure entertainment."}, {"rating": "7", "text": "I did see a few of the old shows, and was unimpressed, didn't care, and was fascinated more by the young Mississippian gal who told me about it. Lifetimes passed. And, lo, the king approaches. We have a comedy. A mystery. Gothic Nightmare. Spoof. Homage. Cameos just in time. Yeah, it was a bit long and I was mostly entertained."}, {"rating": "3", "text": "The worst film Tim Burton has ever directed. I sat through a gruelling 2 hours of nothing but crap. The story is an absolute mess with so many plot points scattered everywhere and some scenes are very poorly paced and are just use for padding to make the film more painfully longer. The characters, with the exception of Johnny Depp, are boring and uninteresting and most of them are utterly useless and pointless to the plot. The only redeeming quality of this film is the production design and Johnny Depp's campy performance as the vampire. Tim Burton cannot juggle this many characters and failed to develop any of them and in addition to all these characters, the story completely stumbles with scenes trying to make the characters interact but results in most of them being entirely pointless to the overall story. The film can't decide whether it is a comedy or a Gothic horror and it fails in delivering both. I thought the trailer was better than the film itself. That's just sad."}, {"rating": "5", "text": "Dark Shadows sees Tim Burton retracing some of his Beetlejuice steps. It's actually pretty funny with laugh out loud moments sprinkled throughout. The movie isn't perfect, however. The tone is a bit uneven; Dark Shadows never seems confident in what it wants to be. The action scenes are underwhelming, too. All in all, though, Dark Shadows is another entertaining effort from Burton & Depp."}, {"rating": "7", "text": "Who else could be the better choice to direct thiz movie other than Tim Burton. The description is gothic, epic, classic, mystic, magic, comic, slapstick, frantic, scenic, antique, not yet tragic, but with no garlic! Just like his previous masterpieces such as BEETLE JUICE (1988), EDWARD SCISSORHANDS (1990), BIG FISH (2003) and ALICE IN WONDERLAND (2010). Thiz time, Tim Burton tries to bring back classic vampire tale based on the original TV series in 1970s-era. The story takes place in the year 1972, when 196-year-old vampire Barnabas Collins has just awakened in his coffin after being cursed by a cold hearted witch Angelique Bouchard who previously fell for him. Now, he arrives back in his grandiose mansion to restore his family to its former glory, what he does not know later, the world has changed a lot since his last departure. The original version looked more like a soap opera, but in Tim Burton hand it turns out to be a fresh family drama with some mysterious elements and sometimes cynical good humor. It is certainly acceptable, considering Tim Burton has done his homework for compiling 1.225 TV episodes into two-hour movie.  On thiz occasion, the Director Tim Burton has also successfully gathered together all his favorite performers. Thiz is his eighth collaboration with Johnny Depp, his seventh with his real-life partner Helena Bonham Carter, his fifth with Christopher Lee and his second with Michelle Pfeiffer after her role as Catwoman in BATMAN RETURNS (1992). Have you ever seen the original Barnabas Collins which played by Jonathan Frid? If you are old enough to have a chance to see his performance previously, you probably would have realized that Johnny Depp has done a lot of efforts to portray that character through his tone of voice, his facial expression and even his gestures. Beside that, there are some other performances which have got my attention. For the umpteenth time, ChloÃ« Grace Moretz has shown her maturity in acting, thiz time to become a rebel teen daughter. Bella Heathcote also makes a special impression as a mysterious new nanny. And Eva Green is obviously very attractive and sensual even as a ruthless witch. The rest of the Cast members are Johnny Lee Miller, Jackie Earle Haley and Gulliver McGrath, plus a special guest appearance by the legendary rock star Alice Cooper. In fact, the gang of 1970s version also make cameo appearances as the guests in the ballroom party scene, including the late Jonatahan Frid, Lara Parker, David Selby and Kathryn Leigh Scott. Thiz movie really brings us back in time to 1970s. Everything is so authentic, including the clothes, the hairstyles, the cars and even the songs. My favorite moment is when they play the song TOP OF THE WORLD by The Carpenters. Somehow, the song sounds so fresh and uplifting. It sounds pretty much like thiz, Such a feeling coming over me. There is wonder in most everything I see... It can also be precise words to describe thiz movie. Get ready for nostalgia ^_^\r Visit My Blog on JONNY MOVEE: http://jonnyfendi.blogspot.com"}, {"rating": "1", "text": "Stole 2 hours from my life, a huge letdown. Started semi-promising but towards the end I found myself scratching the arm of my chair, I was bored, couldn't wait the movie to end. The final \"battle\" was absolutely chaotic and shallow. Burton seems to get to the end of dark, humorous,charcters with an English accent and elegance to put Depp in..."}, {"rating": "5", "text": "I came away thinking this film didn't know what it wanted to be. The trailers painted a different picture; that it was a wacky comedy  it isn't, though it did draw a few laughs from time to time. Also I wonder who the target audience is, if not Depp and Burton's egos?"}, {"rating": "5", "text": "Despite all the flaws and difficulties imposed upon DARK SHADOWS, it certainly did have its moments. The movie itself wasnâ"}, {"rating": "7", "text": "Dark Shadows is a pretty good film. but i think many people were misinformed, if you guys saw the trailer you would think its a dark looking movie but its a comedy. WORD OF ADVISE: IT IS NOT A COMEDY! the trailers failed in my opinion because they advertised it as funny! and it is not, its not supposed to be. Yes there are a few laughs here and there and a few silly scenes but this movie is dark! if you think this is a little kids movie no sir it is not, they show depp (collins) killing people sucking their blood, there is somewhat adult content (no nudity) of course. it is not a little kids film. but i did enjoy this movie, the story is interesting, long story short its about this lady who is a witch! who was never loved by barnabas collins (Depp) so she curses him and his family that's it! a somewhat interesting story, a few funny scenes, some dark killing scenes. its a dark good movie. its based on a TV show, i have never seen it, but i don't think you're supposed to see it to get the movie. It stands on its own. over all i would give this a SOLID 7. not a great movie at all, and not a bad one either! all these bad reviews were given because they didn't think the movie was funny enough! solid movie specially if you love depp, and tim burton."}], "recommendations": ["beetlejuice", "alice_in_wonderland", "sin_city_a_dame_to_kill_for", "it", "pan", "edward_scissorhands", "corpse_bride", "oz_the_great_and_powerful", "charlie_and_the_chocolate_factory", "it_chapter_two", "the_conjuring_the_devil_made_me_do_it", "ghostbusters_ii", "stardust", "the_witches", "indiana_jones_and_the_temple_of_doom", "zombieland_double_tap", "aquaman", "the_babysitter", "ghostbusters", "green_lantern", "carrie", "thor_love_and_thunder", "poltergeist", "goosebumps", "the_suicide_squad"]}