{
  "id": 4881,
  "title": "Darkness Falls",
  "starring": [
    "Chaney Kley",
    "Emma Caulfield"
  ],
  "runtime": 86,
  "genre": [
    "Thriller",
    "Horror"
  ],
  "description": "A vengeful spirit has taken the form of the Tooth Fairy to exact vengeance on the town that lynched her 150 years earlier. Her only opposition is the only child, now grown up, who has survived her before.",
  "releaseYear": "2003",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/qoceKsM15yL5Tmyuhkdl7vM5Vi4.jpg",
  "categories": {
    "plot": 5.333333333333333,
    "acting": 5.0,
    "ending": 6.0,
    "soundtrack": 6.0,
    "cinematography": 5.0,
    "familyFriendly": 6.0,
    "funny": 0.0,
    "action": 6.666666666666667
  },
  "reviews": [
    {
      "rating": "8",
      "text": "I saw this when it originally came out in theaters. I went to a promo screening with friends and I remember them giving us little flashlights. I really enjoyed the movie although it felt very quick and there wasn't much substance to it. I've watched it a few times over the years but revisiting it recently I really appreciated how entertaining it was. Not much time is given to the characters but the leads are likable and Emma Caufield as Caitlyn is quite good and you feel invested in her plight as she tries to save her brother. Centered around a small town goofily named \"Darkness Falls\" a legend exists about an old woman horribly scarred and wrongfully murdered who used to collect children's teeth and still does. If you see her she comes after you with a vengeance and the only way to survive is to stay in the light. Director Johnathan Liebesman of Texas Chainsaw massacre the beginning gets a lot of milage out of the concept and has fun with it. There's lots of clever and silly gags that work surprisingly well. It's a rocket paced funhouse of a movie packed with thrills and chills. So don't overthink it because the makers certainly didn't. Turn off your brain and have a surprisingly fun time.Budget: $11mDomestic Box Office: $33mWorldwide Box Office: $47m4.25/5"
    },
    {
      "rating": "8",
      "text": "♡◇♡◇♡◇♡◇♡◇♡♡◇♡◇♡◇♡◇♡◇♡◇♡◇♡♡◇♡◇♡◇♡◇♡◇♡◇♡◇♡◇♡◇♡◇♡◇♡◇♡◇♡◇◇◇♡◇♡◇♡◇♡◇♡◇♡◇♡◇••••••••••••••"
    },
    {
      "rating": "8",
      "text": "ihihihihugyftdrfyftewqtyiopmolljpmkbjhhgdxgsstyiopuyreqdvnmkhfyguiguugyfuughiugtdst"
    },
    {
      "rating": "10",
      "text": "The sound of Matilda Dixon's wailing throughout the film is really the sound of an elderly woman's groaning in bed. The sound was both sped up in the parts where Matilda screams, and slowed down in the places where she gurgles and breathes heavily."
    },
    {
      "rating": "6",
      "text": "Well, I confess that I expected more from this film, even considering that it is a film for the teen audience where, therefore, the terror doesn't scare that much. I think that if we are really teens (I'm older, so I'm out of the target audience), the film must be really impressive to watch. So, take this into account. In fact, considering the audience its aimed at, the film is good. The problem is with me, that I am older, more difficult to scare and, even worse, I have seen a lot of horror films and it is not just anyone who scares me.The film begins by explaining the story we are going to see: in the past, in a small coastal town in the USA, a very kind elderly woman who was unlucky enough to be disfigured in a fire was accused and executed for a crime she did not commit. Angry by the injustice and cruelty with which she was treated after years being good to everyone, she vowed to take revenge and, since then, appears to all the children in the night when they lose the last baby tooth. All those who recklessly look her in the face appear dead. However, a boy survived and reached adulthood, despite the trauma, the death of his mother and his whole life marked by successive attempts by the spirit to kill him. Now, he can make a difference and try to save the son of the woman he has always loved, and who is marked to die too.The plot is predictable, we have seen a lot of similar stories, but it will work very well for teenagers wanting to feel chills down their spine. The scares come from the rapid appearance of things and shadows on screen, and the tension is well built throughout the film. Things heat up right from the middle and the film gets thicker quickly, discarding much of the plot building that other films take to exhaustion. There are some clichés but the fact is that they are well used and the film works well.The cast is led by Chaney Kley, who curiously passed away because of a sleep disorder, in one of those almost fateful coincidences between fiction and real life. The actor gave life to Kyle, who tries everything to defeat the Tooth Fairy and save people after a life of trauma due to her. The actor is good and does an excellent job in this film, which is one of the best works of his short career, more turned to the TV. Lee Cormie is excellent in the role of Michael, the target child of the evil entity's attacks, while his mother, played by Emma Caulfield Ford, is not so good and always seems a little artificial. The rest of the cast does not deserve much attention and is limited to the average or mediocrity usual in a teen film.Technically, the film is quite regular. Personally, I would highlight good cinematography, which knows how to use light and shadow masterfully to frighten and create tension. Good quick shots in the action scenes also help, and the incidental soundtrack is very good and works effectively. The Tooth Fairy, however, seems to me somewhat exaggerated, inasmuch as it is nothing more than a flying creature with things similar to tentacles of cloth or smoke and a face of eaten flesh behind a porcelain mask, Jason Voorhees/Michael Myers style."
    },
    {
      "rating": "10",
      "text": "$.$.$.$.$.$.$.$.$.$.$.$.$.$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,》●》●》●》●》●》●》●》●》●》●》●》●》●》●》●》●"
    },
    {
      "rating": "10",
      "text": "Plot HolesThe tooth fairy is sensitive to light, no matter how dim, Yet she is shown flying around during the storm with no reactions to the very bright and near constant lightning."
    },
    {
      "rating": "6",
      "text": "At the beginning, it was a fantastic horror movie, and scared the **** out of me when I only saw the first 1/3rd or 1/2 on HBO. For that I give it a 6. But when I saw the whole movie, all my fears were gone, because the 2nd half of the move was HORRIBLE, and it had a simply atrocious ending. Its as if the script writer was on a role, then decided to let his dog write the ending of the movie."
    },
    {
      "rating": "0",
      "text": "I had more laughs than scares while watching this. The acting was a hilarious and the plot not thought out at all, like they were desperate to just make a movie. The \"demon\" chasing them was quite amusing as well; the way it was set up was very unbelievable. The appearances she made were totally random and put whenever the movie seemed too \"dull\" for the director. It was either a great comedy or a horrible horror film."
    },
    {
      "rating": "0",
      "text": "Probably one of the dumbest \"horror\" movies I've ever watched. I was pretty much laughing the entire time. Oh, and it didn't make any sense whatsoever."
    },
    {
      "rating": "2",
      "text": "Ach ja… “Der Fluch von Darkness Falls”…seufz.\r Vielleicht der schlechteste Film der letzten Zeit aus meinem Lovefilm-Abo.\rViel kann ich nicht dazu schreiben, denn es gibt auch kaum was zu sagen.\r Ausser: der 10jährige Kyle trifft auf die bitterböse Zahnfee, die seine Mutter umbringt (aus Gründen, die ich immer noch nicht so ganz verstanden habe, aber egal).\r 12 Jahre später - in Worten: ZWÖLF Jahre später - ist Kyle also 22 Jahre alt… und hier muss ich auch schon schließen, denn das KOMPLETTE Personal ist definitiv falsch besetzt.\r Der “22jährige Kyle”, Chaney Kley, war während dem Dreh schon 31 Jahre alt - sieht im Film aus wie 35. (siehe Bild)\r Das gilt für sämtliche Rollen. Das Alter, das sie haben sollten, passt in keinem Fall.\r Die Zahnfee an sich ist nicht nur einfallslos animiert (und mit nervigen Asthma-Tönchen akustisch unterlegt), sondern auch ziemlich tollpatschig.\r “Wir brauchen mehr Licht” - “Ihr müsst im Licht bleiben!” - “Sie mag kein Licht” - “Licht!” … das ist eigentlich auch schon Hauptbestandteil der Dialoge, die in keiner Sekunde witzig, originell oder gar “neu” sind.\r Der einzige Satz, der mich zum Lachen brachte, und der den Drehbuchautoren und Machern zu denken geben sollte, war “Und alles wegen einem scheiß Zahn”.\rSchade um die Produktionskosten. Ich hoffe, das Catering am Set war wenigstens angemessen.\r Abgedroschener Horrorschrott, den man sich sparen kann."
    },
    {
      "rating": "1",
      "text": "Que desastre de película, ha envejecido muy mal y si en su momento era mala y sosa, ahora lo es aún más, el guión es pésimo, pareciera que pusieron a un grupo de extras a actuar de la manera más acartonada posible fingiendo que les da miedo una vieja deforme cuyas acciones tienen muchas contradicciones, se supone que sólo mata a la gente que la mira directamente, pero se ve claramente como ataca a varias personas de manera indiscriminada y todo se resume en un tipo traumado, una tipa que no sabe donde está parada y un niño asustado de la vieja que a la larga no te importa que les pase a los personajes porque sólo están allí para marcar presencia, cero carisma, cero terror, un producto fallido."
    },
    {
      "rating": "10",
      "text": "☆○☆○☆○○☆○☆○☆○☆○°°°°°°°°°°°°°¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡▪▪▪▪▪▪▪▪"
    },
    {
      "rating": "10",
      "text": "⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$"
    },
    {
      "rating": "10",
      "text": "♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;"
    },
    {
      "rating": "10",
      "text": "●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_"
    },
    {
      "rating": "0",
      "text": "A truly dreadful, poorly thought out film with dreadful acting. Avoid."
    },
    {
      "rating": "9",
      "text": "I love this movie. It's a good horror film."
    },
    {
      "rating": "6",
      "text": "Whenever I heard of Darkness Falls I'm thinking that this movie's going to be awesome and since I've seen it, I was thinking that it was okay, for a horror film. I almost had low expectations on the film. I don't hate it as much as everyone did, I literally thought when I saw the cover I'm thinking that this is going to be an awesome horror flick. All right, let's get on with it. Over 150 years ago, Matilda Dixon was adored by all the children. She would give them a gold coin whenever they lost a tooth, earning her the name, the Tooth Fairy. One night, the fire broke out in her house leaving her face disfigured and severely sensitive to light. She has to wear her porcelain mask and she only leaves her house at night. But when two children didn't come home, the town's people blamed her and they hanged her in the light. Before her death, she placed a curse on the town and swore revenge. Kyle Walsh, who lost his last baby tooth, has witnessed his mother's murder by an evil spirit. Twelve years later, Kyle returns to his childhood home because Michael, the young brother of his romantic interest Caitlin is being stalked by the same spirit. Yeah, when I was experiencing it, it starts off quite well. I used to be afraid of the dark when I was a kid but not anymore. Now as I said already I don't hate the film but the only problem here is the running time where the movie finishes at 71 mins while the end credits is in 10 mins. Maybe over 70 mins is good enough. What I did get the gist is where in 1990 Kyle Walsh is a child and then twelve years later, he's an adult and the curse is still not dead and buried in 2002. However this movie is released in 2003. The movie itself is scary, that's what I like about it even the thrills in the third act. I would recommend this film to those who are horror fans if they haven't heard of it but for me I personally think this horror movie is okay."
    },
    {
      "rating": "7",
      "text": "I went to watch this movie today and it is very weak but BUT when I was a child I was very scared of this movie, for that reason I give it a score of 7"
    }
  ]
}