{
  "id": 61,
  "title": "Das Boot",
  "starring": [
    "Jürgen Prochnow",
    "Herbert Grönemeyer"
  ],
  "runtime": 150,
  "genre": [
    "Drama",
    "History",
    "War"
  ],
  "description": "A German submarine hunts allied ships during the Second World War, but it soon becomes the hunted. The crew tries to survive below the surface, while stretching both the boat and themselves to their limits.",
  "releaseYear": "1981",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/ypXpwknmGfr4sF0hrlWAwHh2JE5.jpg",
  "categories": {
    "plot": 8.090909090909092,
    "acting": 6.8,
    "ending": 8.0,
    "soundtrack": 7.0,
    "cinematography": 9.0,
    "familyFriendly": 3.0,
    "funny": 5.0,
    "action": 8.25
  },
  "reviews": [
    {
      "rating": "10",
      "text": "Four hours edge-of-your-seat suspense. I didn't avert my eyes for a second. The audience is never asked to either sympathise or condemn these characters. Das Boot is instead a haunting testament to the futility of war."
    },
    {
      "rating": "10",
      "text": "Probably the best war movie ever made. Forget garbage like 'Saving Private Ryan'. This movie truly captures the futility of war no matter what side you are on. Claustrophobic, non stop action that literally had me cringing throughout the long (nearly 4 hours) journey. You get so absorbed into the movie, you get to know the characters so well. Great acting, filming, dialogue and music. A masterpiece. 10/10"
    },
    {
      "rating": "9",
      "text": "One of the most suspensful movies I've ever seen. Great pacing. Simple story. Amazing."
    },
    {
      "rating": "10",
      "text": "Just too drawn out, even though that's necessary to a point to develop the tension of the underwater attacks. But still rates a 10 as the best submarine warfare movie ever made. One of those rare movies that, once viewed, is never forgotten."
    },
    {
      "rating": "10",
      "text": "This movie would have been awfully boring it wasn`t as scary as it is. The first time I watched it I had to take breaks because I couldn`t take the tension. The claustrophobia of this film is something really special. We sit in half- darkness most of the time anticipating hull sounds. The story is simple, though it`s just secondary to the main part and that is the Uboat. This tin coffin reminds us of everything we`d like never to experience in our lives. And yet there were real poeple volunteering to serve onboard of those coffins. Right to the end that history showed most of them were destroyed in action. For some reason the German actors really play it well. I mean this couldn`t have been done so good if they were average. Everything is believable here - the effects (as few of them as there are) are great, the submarine external views underwater are outright scary, the music perfectly goes with the atmosphere."
    },
    {
      "rating": "10",
      "text": "Absolutely the best sub movie of all time.... I could actually imagine the smells and rotten food. Terrific performances... terrific everything!!!!!!!This is a must see or you have truly missed something great!"
    },
    {
      "rating": "9",
      "text": "Trois versions de Das Boot ont vu le jour : la courte, la longue (3 plombes et demi, moussaillon !) et l'extra-longue (5h mon garçon !) parce que quand on aime, on ne compte pas, mon gars ! et toutes les 3 sont excellentes, prolongeant à chaque fois un peu plus l'expérience de la vie des sardines dans leur boîte...Une expérience forcément claustrophobique à l'un des (nombreux) moments-clés de la Seconde Guerre Mondiale, fin 1941 lorsque les loups silencieux ont mangé leur pain blanc et deviennent des proies, les proies de la Marine britannique équipée du sonar. L'un des tournants de la guerre évidemment et une lutte désormais perdue d'avance pour les sous-marins de la Kriegsmarine...C'est bien sûr le film qui a fait connaître Wolfgang Petersen dont la réalisation précise et pointue comme une horloge restitue à merveille le calvaire des gars dans leur boîte de conserve. La tension et la peur, le sang-froid et l'espoir sont à couper au couteau sur ces visages tendus, de même que les moments fulgurants de l'attaque et de la fuite, ce jeu permanent du chat et de la souris.Le film a révélé aussi Jürgen Prochnow en état de grâce ici qui campe un commandant à la fois désabusé et cynique, paternaliste et loyal jusqu'au bout... et délibérément optimiste et opiniâtre, un exemple et un phare pour ses hommes. Un vrai rôle de composition jusqu'à la fin, une fin qui offre au film un dénouement étonnant de maturité... et d'ironie.Car Das Boot n'est pas que dramatique et stressant, il est aussi parfois drôle et toujours très humain, plus vrai que nature et réaliste jusqu'au bout des boulons. Bien sûr, les effets ont un peu vieilli pour une certaine partie d'entre eux (les maquettes...) mais au vu de son âge, Das Boot fait encore le boulot. On s'interroge également sur la musique électronique de Klaus Doldinger mais on finit par y adhérer à notre insu, son thème enquiquinant se montrant très efficace.Il s'agit clairement d'un beau film de guerre dont la sincérité est touchante, sans aucune gloriole de bas étage, sans guimauve déplacée, sans effets de manches ou autre tour de passe-passe : c'est prenant, surprenant et d'un pacifisme intelligent."
    },
    {
      "rating": "7",
      "text": "This interesting war film shows us a little of what was the daily life of a submarine crew during World War II. As the film is German, not surprisingly, is a German submarine. And tastes good to hear the dialogues in the original tongue, giving more authenticity tho the movie than the English, which most of films used indiscriminately, because of commercial interests.This film is, of all submarine movies, the best I've ever seen. The more realistic and closer to reality, without dramatic contrivances, without the flying imagination of those who have never seen a submarine but has to make a film about it. Its based on a book by Lothar G. Buchheim which, I believe, describes real events. The script reflected this effort, this search for reality. I do not know any of the actors, I am no expert in cinema, but I enjoyed the interpretation of Jürgen Prochnow, the captain, and Klaus Wennemann, who played chief engineer submarine. I will not be very surprised if someone says to me that some footage was shot in a real submarine... whole scenario was thought to detail and it shows how submarines are claustrophobic.Far from the American sensationalism, this European film makes a very interesting picture of a reality that most movies rather fantasize the extreme. It is a proof of how thin can sometimes be the line between documentary and a cinematographic work."
    },
    {
      "rating": "9",
      "text": "Wolfgang Petersen creates a wonderful and exciting film in Das Boot. I had never watched the film until today. I watched the equivalent aviation version 'Shady Lady' which was compared to Das Boot and hence my late arrival at the time.\r Das Boot is so powerful, wonderful characters and tension. An excellent 9/10"
    },
    {
      "rating": "8",
      "text": "The Das Boot Director's Cut, a whopping 3h 28m, doesn't have much of a plot line, but instead is more of a documentary on U-boat life. It is so accurate in its happenings, and doesn't hold anything back. It doesn't sugarcoat the filth or the fear that encompasses the ship. Petersen and company have crafted a fine film just short of a modern classic."
    },
    {
      "rating": "10",
      "text": "I consider Wolfgang Petersen to be one of my favorite film directors, and \"Das Boot\" is probably my most favorite of his career. \"Das Boot\" portrays life on U-96, as accurate as possible, leaving no room for creative liberties, even if the submarine sank later in the war."
    },
    {
      "rating": "9",
      "text": "Brilliantly Gothic, Chillingly Sincere and Deeply Spiritual. Wolfgang Peterson has presented the audiences with one of the most brutally moving war movies ever made. The plot comes second, the exhaustive and asphyxiating battle comes, first. This is what every war movie should aim to be. True to its characters and true to the war. Poetry and Repugnance walk hand-in -hand here."
    },
    {
      "rating": "10",
      "text": "An Epic among epics, its one of the most important submarine films that must be take into account.\r based on a heart pounding biography of life on a German U-boat in the middle of the atlantic during WW2, its so intense and chilling in war combat you can imagine what it must be like stuck in a tin can in the bottom of the ocean waiting for fear to strike. In the end I had no whose side I was rooting for.\r I think this a good film to tell the terror and agony the germans experienced from a better perspective in naval warfare, that you be hoping that at least we can live a happier lives than them in a safer world of peace and tranquility never again the horrors you will experience in this brilliant monumental epic C"
    },
    {
      "rating": "10",
      "text": "A true epic, what a masterpiece, one of the best and most intense war films I've ever seen.Now I have to find the different cuts, let's see if it gets even better."
    },
    {
      "rating": "4",
      "text": "I believe it has a good feel of authenticity due to all dialogues being in German and realistically portrayed what one would experience on a German submarine (as far as I could imagine).That's all the good aspects I found worth mentioning.Characters or \"The Drama\": Something that has been praised in the reviews before deciding to watch the movie - is pretty much non-existent. The characters lacked any introduction - except the usual hectic one in the beginning where you are bombarded with all of the characters' names . I could only name ONE member of the submarine by the end of the movie - in other words, ONE of all the characters. None of the characters has any personality except the usual team of; The emotional one, the posh one, the mentally questionable one, the missing home/relatives one and the decision-maker. The acting was both good and bad, it isn't short of intense death stares.Objective or \"The Adventure\": Where are they going, what's the objective or mission? Lacking the concept of where they are, which might be reflecting the sense of the crew and shifting more focus on the submarine, after all - they do have a navigator. This lack of a mission led to - unsurprisingly - that the action came to them. Later on, when they do set up destinations it's either; briefly mentioned and reached right away or it's described in detail and - of course - becomes difficult.Sound & Music: \"We can hear more down here, than we can see up there.\" Keeping the music to a minimum for specific moments only or reflecting the crew's emotions is a good aspect. But the movie could be more reliant on or more telling with sound than words. To explain that the approaching \"humming\" is a ship - after establishing that a ship is approaching isn't that.Story: This is apparently based on a novel... A fictitious narrative. Rushes through the last act like crossing it off the checklist, thus failing to make an impactful ending.My expected ending: The ship they thought was abandoned and once again shot at, was one of the most impactful scenes - of the few. Therefore, I expected them to take their roles later on in some way. And so comes the situation where they are stuck at the bottom and manages to resurface. At this time, I expected the engines to not work, receive fire and they would be left to surrender...Would they be treated like they treated the crew of the ship before - left to die?"
    },
    {
      "rating": "10",
      "text": "My score 100Metascore / User score 86 / 80Tomatometer / Audience score 98 / 95IMDB 84(90.5)"
    },
    {
      "rating": "10",
      "text": "Intelligent, thrilling, accurate.I saw the director´s cut and it was a \"nailbiting\" event. Probably the best (Anti)War movie made! Absolutely the best Submarine movie.A Must see."
    },
    {
      "rating": "10",
      "text": "The best german movie all time. The suspense is high during almost the whole movie and it is easy to understand what is happening. In the same time the movie gives a good view into the normal day on a uboat, because it is more realistic than sensational or put in some feelings or patriotism. The atmosphere is great and the play with the sound is amazing. Classic"
    },
    {
      "rating": "4",
      "text": "The English dubbing was awful so I switch to native German with subtitles. Film states 40,000 U-Boat crew went to sea and 10,000 came back, but I didn't care if only zero had came back. They killed my people, so... I was so detatched from watching this movie beyond the historical WW2 stuff."
    },
    {
      "rating": "9",
      "text": "Error search is what I always do in veridic pictures:Not found on the first series but a shame (really bad) on the more recent (2018) series - it is understandable that for \"stun effect\" all the gauges are really bright, in an \"indiglo\" way that it didn't exist in those times. But for me, an Engineer, I find really bad that the divisions in the gauges between \"Unit Order\" contain 6 divisions instead of the correct 5 as the divisions exist for easy reading in the days where digital displays/numbers didn't exist. It never was used not only in WW2 but never in any gauge in history since it doesn't allow accurate reading of an analog display! **** aside - great time spent seeing both the new and the old series (which I prefer the old one and I advise to see the series instead of the director's cut)"
    },
    {
      "rating": "10",
      "text": "Review for the Director's Cut, in German.Is Jaws my favourite movie? Is Shawshank? Is The Empire Strikes Back?No, because Das Boot is.The tension, the danger, this is a slow burn movie with a feeling that everything on-screen is authentic to the hellish experience of being stuck on a U Boat in WWII. That's why I prefer it in German with subtitles (although the original German cast did the English dub so its pretty good). Watching in German adds to the authenticity.Sehrohrtiefe!!!"
    },
    {
      "rating": "9",
      "text": "The claustrophobic nature of it's setting, combined with a taut script adds to the suspense in this gripping war movie.One of the best war movies ever made."
    },
    {
      "rating": "9",
      "text": "My all time favorite. I love this movie.Anyone thats interested in WW2, watch this movie."
    }
  ]
}