{"id": 1522, "title": "Date Night", "starring": ["Steve Carell", "Tina Fey"], "runtime": 97, "genre": ["Comedy", "Action", "Adventure"], "description": "Phil and Claire Foster fear that their mild-mannered relationship may be falling into a stale rut. During their weekly date night, their dinner reservation leads to their being mistaken for a couple of thieves—and now a number of unsavoury characters want Phil and Claire killed.", "releaseYear": "2010", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/ucEWhj32KEDcFKHMWVeu8r1Q4ld.jpg", "categories": {"plot": 6.625, "acting": 6.333333333333333, "ending": 6.0, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 6.0, "funny": 6.46969696969697, "action": 7.166666666666667}, "reviews": [{"rating": "3", "text": "For a comedy with two very talented leads and several very good supporting actors, \"Date Night\" was incredibly unfunny and severely disappointing. I was saddened at the stupidity of this movie's jokes and the mediocre way it developed the film's recurring gags. Carell and Fey both need to rebound."}, {"rating": "6", "text": "Above the tedious Hollywood \"love comedy between married couples\" formula, \"Date Night\" is actually impressive because of its capacity to fuse action, humor, and romance."}, {"rating": "7", "text": "Funny and coherent, \"Date Night,\" proves to be hallarious at times with a relatively sensible emotional poigniencey that counterweights a seemingly outrageous mad-cap adventure to take down crime and curruption in the Big City. Sex, action, and awkwardness abound, this movie equitably manages the intangible subtlties of Tina Fae's comedic prowess with Steve Carrel's big-budget, brick-and-mortar performances. Couples will enjoy \"Date Night\" because of its specific appeal towards both sexes meanwhile, shedding light on the humor and more substancial infrastructural archetypes surrounding healthy heterosexual relationships. 7.3."}, {"rating": "8", "text": "Yeah, honestly, you can tell people were purposely trying to bring the user rating down. It was at like 3.2 on the day it opened, but no one was posting reviews. Anyways, this movie works pretty well considering the history of the director. It was riding that thin line between stupid and too stupid. But it succeeded, mostly because the movie was focused on the two leads, who have great chemistry."}, {"rating": "7", "text": "Steve Carell and Tina Fey are effortlessly hilarious, and you get the sense that they could have done more for this film if given greater control of the somewhat limited script."}, {"rating": "6", "text": "Overall, not bad. Some clever lines and clever writing, however some slow lulls in the middle of the movie. A few lines were so funny that you couldn't help but laugh out loud, and of course Tina Fey is always a delight."}, {"rating": "6", "text": "Perhaps the most prominent comedic figures on television, 30 Rock's Tina Fey and The Office's Steve Carell collaborate with Shawn Levy (Night at The Museum) in Date Night. First off, a movie such as Date Night  does not possess a goal to make a cerebral and qualitative experience; instead it aims its course to create endless laughs utilizing elements such as slapstick comedy.  This film performs this genre's criterion to perfection, as it ultimately creates a gut-wrenching humorous experience.Date Night's premise is simple, a worn out married couple, Fey and Carell, look for excitement with a night on the town.  They soon realize that this love-renewing night could lead to their murder due to a implausible mix up.  As the audience can realize, the plot of the film is very simple and somewhat weak, but that is not the film's strong point nor is it its \".  What makes this film excel is its actors.  As a fan of both Fey and Carell, I consider them to be comedic geniuses in a way that they can make any plot funny. They do so in this film as they create endless gags that have the audience laughing out of their seats.  There is not much to qualify, the main point is that Fey and Carell make this film work; with their traces of subtle comedy to \"laugh out loud\" ridiculous moments that only a significantly stiff person would not appreciate.Date Night provides the laughs even with its simple premise, and that's all what it should do.  If you are solely looking for an incredibly humorous movie, this film provides for 30 Rock and Office fans alike."}, {"rating": "6", "text": "Tina Fey and Steve Carell are a perfect duo of comedy and this is a great sit through. It does become hard believe at times, but the comedy takes the attention."}, {"rating": "7", "text": "The first time i watched it it was funny and i thought it was well preformed. The second time i watched it I thought it was HILARIOUS!! This was a great performance from two actors that really know each other well and made it the best they could. Certain areas were a little dragging but overall it was very good."}, {"rating": "6", "text": "I am a huge fan of both Tina Fey and Steve Carrell, and had eagerly awaited this film.  I feel Carrell's comic skills are often marginalized, and I believe Fey is simply a genius of comedic writing and performance.  Having said that, I wish I liked this movie more. ________ The story is sufficient in that it keeps the pace of the movie quick and agile, and provides ample opportunities for both comedic absurdities and action thrills.  Carrell and Fey share a chemistry that works comedically.  Most of the movie is amusing, and there are a few genuine \"laugh out loud\" moments.  But overall, the movie has a bit of a generic feel to it., I would recommend it as a light, popcorn movie night rental. ________ Special mentions to Mila Kunis and Best Actor Oscar Nominee, James Franco, as they deliver an entire act's full of hilarity in one inspired scene.  Also to Common and William Fichtner in their respective roles as two of the film's \"heavys.\" >>>> My full cinema profile here: http://bit.ly/MyMovies"}, {"rating": "3", "text": "Date Night is a stupidity movie with randomly unfunny scenes. Carell and Fey weren't that funny in the movie. The lines and the script were pretty dull and not quite chuckle. I wasn't even laughing in the theater,when I saw some audiences were not laughing and have awkward chuckles,but little bit people were laughing that much. If only Carell and Fey could be more funny should be done written perfectly on this movie,not kid-friendly dull unfunny scenes in this stupid movie. I know that I seem too harsh for a good movie on Rotten Tomatoes and to all those critics who like this,but there you'll go,Date Night I can't live without."}, {"rating": "7", "text": "The plot is a little bit weak, but Tina Fey and Steve Carell brought the whole movie up. They were hilarious together. It wouldn't be good if they weren't the cast."}, {"rating": "8", "text": "I don't get the low reviews? I thought this was an all around good movie. Carell and Fey were both very funny and the film had a solid story line. Worth a watch."}, {"rating": "3", "text": "A Film Review By: Sam Fragoso\"Date Night\"**Steve Carrel and Tina Fey are a boring and suburban married couple in \"Date Night\"ReviewYou would suspect the king and queen of comedy would produce a better movie then \"Date Night\" ..... but they don't.Here's the premise: a boring married couple out in the suburbs of Jersey, decide they want to go out, have a night to remember. So they go into the New York City to this insanely expensive restaurant. The only problem is they don't have a reservation, so what do they do? They take one, of course (cause so many people do that). Anyways they take this reservation only to find out the reservation they took belongs to this debt owing couple.Two thugs come up and take them outside and the story goes on from there. \"Date Night\" delivers hardly any laughs and you would think Carrel and Fey would bring something to the table here. It's really disappointing to see these two comic wonders be stuck in such a flat and poorly written so called \"comedy\".I will say though the one up side to this film are the cameos by all the different actors, it kinda reminds you of all the better films they have been in. James Franco, Mila Kunis, Ray Liotta, Mark Wahlberg and J.b. Smoove almost save the film to it's ultimate demise, but \"Date Night\" is slow paced, boring and extremely predictable, do yourself a favor and pass on this very mediocre movie.Instead go out and rent \"The 40 Year Old Version\" (Carell) or \"Mean Girls\" (Fey) both infinitely better films then this one.CastSteve CarellTina FeyMark WahlbergCommon"}, {"rating": "5", "text": "I've just watched the Date Night trailer, and it is both funny, slick and well made. If it is any guide, the movie will have thousands of hilarious gags."}, {"rating": "10", "text": "Don't believe the negative reviews. This is a berry funny movie. Trust me; I know comedy. This was good."}, {"rating": "0", "text": "This movie was excruciatingly bad. Tina Fey and Steve Carell have been funny ... but not here (Tina Fey's portrayal of Sarah Palin, for example). This is the only movie in my life where I looked at my watch to see how much longer this dog was going to bark. James Franco and Mark Wahlberg give adequate performances.Not even they could save this mess. There were twenty seconds of almost amusing outtakes at the very end as the credits mercifully rolled."}, {"rating": "7", "text": "Originally I didn't like this movie as much, but after watching it again it had its moments. At time's it lagged a bit but for the most part you were kept in the thrill of the moment not knowing what to expect next."}, {"rating": "9", "text": "Don't listen to the negative reviews, this movie was fantastic. I couldn't stop laughing, and the plot wasn't bad either. Un-realistic? For sure. But that doesn't mean it's a bad movie."}, {"rating": "9", "text": "A wonderful getaway for those who are married or have been married. it's a familiar situation (dull marrige) with a great twist!"}, {"rating": "6", "text": "Not horrible, but not so great either. It was a very awkward mix of action on comedy."}, {"rating": "9", "text": "Hilarious! I won't hesitate to buy a ticket for any movie these two talented and very funny people appear in....together, that is!"}, {"rating": "8", "text": "While its story and action sequences are nothing spectacular, the actings provided by Fey, Carell, and the host of supporting characters such as Taraji. P Henson, Ray Liotta, James Franco, Mila Kunis, Common, and others more than make up for its director's flaws. Furthermore, you will laugh your butt off the entire time."}, {"rating": "10", "text": "It's hilarious, I don't get the hate."}, {"rating": "8", "text": "Funniest movie of the year! Tina Fey and Steve Carell are true comedic gold!"}, {"rating": "3", "text": "Love Steve & Tina long time. Went in with great expectations, full of good cheer, ready to laugh until my gut exploded. I sat there for 90 minutes, waiting waiting waiting to laugh. I think one chuckle was all that was given involuntary life. Nuff said."}, {"rating": "9", "text": "One of the funniest movies i`ve seen in years. Carell and Fey are a fantastic on-screen couple and their escapade is highlighted like a Woody Allen/ Coen Bros cut `N` shut. Some of the hand-over-mouth funniest set pieces and one of the best chase scenes of recent memory. Oh and robot pole dancing?!!! Fantastic stuff."}, {"rating": "8", "text": "Very Good (B+) movie. Could have been better with a few more over the top moments. Steve Carell is a very funny man."}, {"rating": "7", "text": "The success of \"Date Night\" is directly attributed to the chemistry between Steve Carell and Tina Fey, who despite being A-list stars, could be your neighbors, or the handsome couple you meet at a party. Playing Phil and Claire Foster, the relatively unglamorous NBC headliners of \"The Office\" and \"30 Rock\", respectively, have a middle class air about them, which allows the pair to blend in seamlessly among the other patrons at the family restaurant where their characters listlessly feast on a middle class dinner of potato skins and salmon. Phil is like the second-person narrator in the Talking Heads' track \"Once in a Lifetime\", the David Byrne-written masterwork about how ennui can creep into even the best of marriages. Friday night is \"date night\", and it's the \"same as it ever was\". Later in the film, Phil almost literally says, \"This is not my beautiful wife,\" after Claire flirts with a shirtless Mark Wahlberg, who not only emasculates Phil, but half of North America's males, as well. Too bad this well-oiled comedy team wasn't cast in a more ambitious film along the lines of Albert Brooks' \"Lost in America\", or even Ted Demme's \"The Ref\". They connect with each other, and the audience. Thankfully, the pair's impeccable comic timing and lighthearted temperament help prevent their Kafkaesque situation from becoming too heavy-handed and steeped in testesterone. So often in action-comedies, spectacle(gunplay, car chases, etc...) neutralizes, and ultimately, stamps out comedy(for example: \"Beverly Hills Cop 2\"), because its characters in peril end up acknowledging the danger around them with too much reverence. Except for one overlong car chase scene involving a taxi cab(as if Tony Scott guest-directed a segment for Jim Jarmusch's \"Night on Earth\"), \"Date Night\" never forgets that it's a comedy. Both Carell and Fey strike the right balance of gravity and levity throughout their ordeal, which also staves off the excessive silliness so common in modern comedies, where the narcissistic performer often resorts to schtick. They're scared, but not so scared that their absurdist banter and goofy antics are replaced by kinesis(running, dodging bullets, etc.). In addition, both Carell and Fey(far from being narccisists) generously allow Wahlberg, and especially James Franco and Mila Kunis, get laughs, big laughs. \"Date Night\" is predictable, but harmless infectious fun. Since the two television veterans are so appealing together, however, the moviegoer wishes the Fosters would quit their jobs, buy a winnebago, and drive across America with Steppenwolf cranked all the way to eleven. They could also be the people that David Byrne sings about on the \"Remain in Light\" track \"Once in a Lifetime\"."}, {"rating": "8", "text": "Much funnier than I expected and the out takes at the end were hilarious. Let's face it. There are no great films out there right now, so have some fun and see \"Date Night.\""}, {"rating": "10", "text": "Funniest movie since When Harry Met Sally. Truly hysterical in places."}, {"rating": "10", "text": "Not only is Date Night hilarious from start to finish it keeps you on the edge of your seat the entire 98 minutes. I was afraid that if I left for a refill or a bathroom break that I would miss a exciting or hilarious moment."}, {"rating": "10", "text": "I thought that this movie was frickin Hilarious. I love this movie so much that I'm seeing it again"}, {"rating": "9", "text": "I really think this movie deserves a better rating. Really funny and fresh. Good for a first date."}, {"rating": "7", "text": "I thought this movie was fun, humorous, well acted and pretty good story line. I appreciate movies that do not depend on a lot of vulgarity as a means of communicating the story. It was worth the money I spent to see it."}, {"rating": "9", "text": "Tina Fey and Steve Carell have great chemistry, without being sophomoric these guys bring a predictable movie up a notch and create a memorable funny film. On a par with great comedy duos like Hepburn and Tracy. The dance sequence was particularly funny - I was laughing from beginning to end - it's not easy to entertain a cynic like me with humor - they did it!"}, {"rating": "9", "text": "I thought it was a well thought funny movie which was both filled with action, amazing comedy and outstanding acting. I saw this with my girlfriend and we loved it. we couldn't stop laughing. Go see it! its not just a date movie it's for anytime"}, {"rating": "1", "text": "This movie was terrible!!!! By all means, skip it and save your money! There was absolutely no plot whatsoever in this movie. It was boring, contrived and a complete waste of my time and money!!! This movie is beneath the talent of Steve Carrell who is usually very humorous. Skip this movie and don't even rent it!"}, {"rating": "4", "text": "Seemed all over the place. Bloopers were the funniest part."}, {"rating": "1", "text": "Painfully unfunny throughout."}, {"rating": "9", "text": "In hollywood today, there are 3 types of romantic comedys. The \"lets put in a bunch of famous people, give it a few oscars, and call it funny\", the \"let's just have a bunch of sex thrown into there\", and the \"lets give you the whole plot in 2 minutes and make you watch it for 2 hours\" movies. I'll be honest, this movie did use the power of stardom and sex a little over my taste, but not excessively. Overall, I enjoyed this move. It was the first movie in years that I actually laughed because it was supposed to be funny. Usually, I laugh because movies are so badly made, they're funny. This is how romantic comedys should be. To put this movie in this chatagory would be insulting; it was in a catagory all it's own. Steve and Tina made a relatable, interesting, and laugh your butt off couple who really had the worst luck of all time. It delt with issues married people face every day, but not to the point where it became a melodrama. It was just a laugh your butt off good time. My only critism is the prostitute club toward the end. Yes, Steve and Tina pole dancing made me wanna pee my pants, but it was badly handled. It showed way too much of the prostitues, and not in a comical way. It was in a realistic way that made me wanna vomit. William's weird sex fettish and the ugly prostitues did not add to the film, it lessened it. I have to give props to J.B. Smoove & his performance. He took the cab scene from great to one of the best comedic scenes I have ever seen. Good going, JP! In conclusion, wait until it comes out on dvd and rent it at 12am that day. You'll be glad you did."}, {"rating": "6", "text": "Funny, but not that funny. Some parts were good, such as the banter between Taste and Whippit. Other parts were just awkward, such as the terribly exaggerated car chase scene (I do realize this is a comedy and not true to any realism, necessarily, but that scene was just over the top), which could have been alright had it been funny, but sadly it was not. All in all, the movie was alright seeing as I had no expectations and no prior glimpse of the plot. In actuality, the plot would make for a very good action movie, as I was genuinely surprised by the twist at the end - however, that twist does not belong in a comedy."}, {"rating": "8", "text": "I thought the movie was hilarious. Im legitimately surprise but the current rating. Really funny i would recommend to all of my friends."}, {"rating": "4", "text": "I tried my best, but this movie just couldn't make me laugh. There are too many stupid recurring gags such as \"Killshot!!\" and watching Tina Fey run into an open cabinet that become more annoying than funny over the long run. Fey and Steve Carrell are hilarious at times, and there are great cameos by James Franco, Mark Wahlberg, and Mila Kunis, and if you're a fan of \"Goodfellas\" you get to see Ray Liotta as a tough guy again, but the screenplay is just stupid most of the time and it's more of a funny premise than a funny movie over the long run. Can't recommend this movie, as funny as Carrell and Fey are when they click."}, {"rating": "8", "text": "If you are going to see this movie thinking that it will be slap-stick  funny,  you may be disappointed, I really liked this movie, it was very funny but it is funny in a more subtle way than other comedies. Much of the humor is based on real life experiences in a way similar to what you would see on the tv show \"modern family\" which makes it enjoyable because you can relate to Steve & Tina's characters (early scenes!). Steve Carell & Tina Fey do an excellent job of playing the normal married couple whose life has become somewhat mundane, there is plenty to like here, I'm really surprised at the negative reviews. It is even funnier the second time I saw it."}, {"rating": "7", "text": "It's clear that Fey and Carell are trying to make the most of the material given to them, and they are mostly successful in rescuing what would otherwise me a very mediocre movie. Both leads are funny, charming, and realistic, proving their comedy chops. This definitely belongs in the same company as Fey's other film, \"Baby Mama\"--funny, but not \"30 Rock\"-funny."}, {"rating": "9", "text": "Date Night is a hilarious movie that really captures how not so young anymore couples act, the great chemistry between the leads makes it even better, it's ultimately a very hilarious and enjoyable movie."}, {"rating": "5", "text": "This Is A Good Movie, Dont Get Me Wrong...Just Once In A While Is Seems Boring, And \"Washed\" Up...This Is Not A Bad Movie, Or The Best Movie Ever!Half-Way Decent Cast... :)"}, {"rating": "6", "text": "Caught this on a plane while flying across the Atlantic and enjoyed it more than I thought I would. The script is pretty standard but the two leads, Steve Carell and Tina Fey as well as an excellent cameo from Mark Walhberg; make Date Night a fairly enjoyable way to spend an hour and a half."}, {"rating": "5", "text": "So, to begin with, you've got this screwball comedy starring Sarah Palinâ"}], "recommendations": ["the_wedding_ringer", "the_other_guys", "identity_thief", "neighbors", "forgetting_sarah_marshall", "30_minutes_or_less", "wedding_crashers", "tower_heist", "tammy", "step_brothers", "wanderlust", "just_friends", "stuber", "the_longest_yard", "anger_management", "dodgeball_a_true_underdog_story", "this_is_the_end", "22_jump_street", "blended", "dinner_for_schmucks", "due_date", "sex_drive", "central_intelligence", "rough_night", "ted_2"]}