{
  "id": 3587,
  "title": "Dawn of the Dead",
  "starring": [
    "Sarah Polley",
    "Ving Rhames"
  ],
  "runtime": 101,
  "genre": [
    "Horror",
    "Action"
  ],
  "description": "A group of survivors take refuge in a shopping mall after the world is taken over by aggressive, flesh-eating zombies.",
  "releaseYear": "2004",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/ttquyxStEEctzghtA2f4PUGprDr.jpg",
  "categories": {
    "plot": 5.428571428571429,
    "acting": 6.64,
    "ending": 6.125,
    "soundtrack": 10.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 6.428571428571429,
    "action": 8.333333333333334
  },
  "reviews": [
    {
      "rating": "9",
      "text": "This may seem like a b rated movie but it's not it's surprisingly well made movie, truly enjoyable if your into the zombie movie genre like I am, if you are this is a must see."
    },
    {
      "rating": "10",
      "text": "i love the dawn of the dead remake and  the  original was even better . these are two movie that were the best remake films i have ever seen  in my life"
    },
    {
      "rating": "10",
      "text": "best zombies movie ever, don't miss it. i love this movie and i think everyone should watch it. I Promise, you will enjoy it, even if you hate movies with zombies"
    },
    {
      "rating": "9",
      "text": "One of the better zombie films out there and definitely one of the most entertaining with some great character work and solid special effects  make-up. It's a remake of Romero's 70's Classic but made fresh for today's audience, and it works perfectly. A nice crop of actors give the characters life plus there's zombies like you've never seen before that really know how to run! It also has the perfect setting in a shopping centre  Overall a Horror classic and personal favourite of mine!"
    },
    {
      "rating": "9",
      "text": "This film was the one to introduce me to the genre a while ago. A lot of good action scenes, some scenes are tense, some are disturbing, others are even funny. An overall really good movie."
    },
    {
      "rating": "9",
      "text": "One of the best zombie movies in a long time. Dawn of the dead has great acting & phenomenal special effects."
    },
    {
      "rating": "8",
      "text": "One of the best horror films of all time. It is genuinely frightening, great special effects. Suspenseful, well directed and acted. The touches of humor make it work that much better. Excellent."
    },
    {
      "rating": "10",
      "text": "This is a truly terrifying and captivating horror movie.Ving Rhames shines as the cop who don't take **** from anyone and the rest of the actors like Sarah Polley and Kevin Zegers are impressive.Highly entertaining movie."
    },
    {
      "rating": "8",
      "text": "Hell, this movie was great,blood and all that,but the problem is,the zombies are too fast.I was first scared by the movie,but later,it was fun"
    },
    {
      "rating": "8",
      "text": "Robugly, could you be less vague? Overall, as horror movies go, the characters here were astro physicists compared to your average teen slasher bimbo/jock clique."
    },
    {
      "rating": "9",
      "text": "Though I love both 'Legend of the Guardians: The Owls of Ga'Hoole' and 'Watchmen', I actually think Snyder's remake of George A. Romero's 'Dawn of the Dead' may be his finest and most personal work of the three. Usually I stay away from contemporary remakes of the classics like the plague, because to me, atmosphere is everything, and today's directors tend to significantly miss that point, but sometimes I just can't stop myself, and it helped that two recent character actors I really respect (fellow Canadian Sarah Polley and Ving Rhames) played significant roles. Though I still prefer the satirical angle on consumerism Romero utilized in his 70's original (and for that reason alone it would make a great double bill with 'Salo, or the 120 Days of Sodom', at least from Pier Paolo Pasolini's philosophical context), this is head and shoulders (shot, of course, so it doesn't come back as a zombie) above other remakes of this era. I wish Snyder still had the sense of hunger that permeates this first film of his (pardon the pun ;) )..."
    },
    {
      "rating": "9",
      "text": "This movie is what Resident Evil movies should have been. Story, characters, and sets are just amazing! Dawn of the Dead is labeled under horror because of the zombie theme but there is more action than frights."
    },
    {
      "rating": "9",
      "text": "Eh...I don't feel this is a 10/10 movie but it is in no way horrible. It, much like Zombieland is very well written but I feel as if they could have added a touch of comedy to it instead of it being just purely action."
    },
    {
      "rating": "9",
      "text": "Rewatching Sarah Polley movies after Away From Her was so brilliant, this still plays well.  It's a strange film to watch because it affected culture so much, video games especially.  Effects still hold up, editing is good. Polley is best performance, Ving Rhames close behind."
    },
    {
      "rating": "9",
      "text": "這部電影的特色，人在末世中，從不知所措，害怕，絕望，苦中作樂，悲傷，到覺悟的心情轉變，喪屍顯得不為重要。PS:The female lead is pretty awesome. XD"
    },
    {
      "rating": "8",
      "text": "Awesome awesome movie. Loved this movie since the first time I ever seen it. Lots of zombies, and a lot of killing. One of the best zombies movies ever made in my opinion."
    },
    {
      "rating": "9",
      "text": "●●●●●●●●●●●●●●●●●■■■■■■■■■■■■■■■■■\",\",\",\",\",\",\",\",\",\",\",\",\",\",+,+,+,+,+,÷,÷,÷,÷,=,=,=,=,.."
    },
    {
      "rating": "9",
      "text": "*:*:*:*;*;*;*:*:*:**:;*;*\"*\"*\"*\"*¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙"
    },
    {
      "rating": "10",
      "text": "Dawn of the Dead (2004): 10 out of 10: I sympathize with the fan boys that feel any remake of Dawn of the Dead is religious sacrilegious. You get an emotional attachment to films that scared you in your youth. (One on mine is Assault on Precinct 13 that was remade recently and I just know I will be disappointed with the remake. I am still scared of ice cream trucks as a result of seeing that film when I was 9)\r Remakes themselves have a well deserved bad reputation. (Easiest movie trivia question: What is the best film remake? The Maltese Falcon of course. That Humphrey Bogart perennial was a remake of a 1931 film of the same name. I'm sure back in 1941 that there were a couple of people complaining that Bogart was no Ricardo Cortez and the ruined the story by taking out the affair and homosexual subplots. The first film after all was a pre-code affair.)\r Dawn of the Dead is in reality a different movie than the original. This is no shot for shot Psycho remake nor is it the same movie with a glossier CGI coat of paint. It is a faster more intense zombie film. It is one of the best action horror films of the last ten years. The opening twenty minutes in simply one of the scariest action packed sequences I have ever seen. By the time our band of protagonists gets to the mall they are not the only one's catching their breath.\r It becomes a pretty good sized group at the mall and you end up slogging through some slow bits as the zombies eat it down to a more manageable size.The acting is across the board good and the effects are suitably gory and plentiful. Director Zack Snyder wisely dumps much of Romero's sociological subplots and replaces them with a more timely commentary. (Instead of zombies as consumer motif we have shooting undead celebrities. And instead of an outwardly hostile motorcycle gang, we have a more subtle power struggle between the otherwise powerless.)\r The updates honestly work, as a more literal remake would have simply fallen flat. Is Dawn of the Dead better than the original? I won't say. Is it one of the best films of 2004? Yes. Is it better than Romero's own sequel Day of the Dead? Good Lord yes."
    },
    {
      "rating": "10",
      "text": "As much as I love Romero's 1978 classic, I must agree with fellow movie buffs who say that this particular remake was unfairly prejudiced and slandered upon release. The movie sticks pretty much to the basic plot; a group of people hide out in an abandoned shopping center during a zombie apocalypse. That's all there is to it. The acting was good and some of the comedy moments were actually pretty funny (Hollywood Squares, anyone?). Of course, seeing as it was shot in the modern era of the zombie flick, there is just enough blood and huts to satisfy any gorehound. The zombies looked scary and WERE scary simply due to the fact that they could sprint (a cliche started by 28 Days Later). The heavy metal soundtrack really helped the atmosphere of a zombie invasion and went great with zombie-killing. In sum, an underrated horror movie."
    },
    {
      "rating": "9",
      "text": "I am not really into gore, but this movie is fantastic in its genre. Beyond the gore, the construction of the characters is good; although, they had some fairly stereotypical ones (that is one of the reasons why I don't give this movie a 10). From a more analytical perspective, it is not just about horror, but also about how in extreme situations our human condition can either betray us, or strengthen us. Fate plays a role in our lives, but we always have a choice, even if there doesn't seem to be one. I definitely recommend it."
    },
    {
      "rating": "10",
      "text": "A remake that I just loved. Funny in all the right spots, action that just keeps you on your toes, moments of silence that can get you on your first viewing, etc. The terrifying running zombies and a mall to defend yourself. Awesome cast of characters too."
    },
    {
      "rating": "10",
      "text": "YES! This remake of Romero's original film is WAY much better. A perfect cast, with suspense, more zombies, action, and a very fantastic plot. If you like zombies - Watch this film!"
    },
    {
      "rating": "10",
      "text": "This movie is the pinnacle of epic zombie movies that are also funny."
    },
    {
      "rating": "8",
      "text": "I like this remake. It's full of fun action, good characters, gore, and some great horror in it."
    },
    {
      "rating": "1",
      "text": "if you have ever seen any zombie horror film before then you needent see this one. all the cliche'd characters, one dimensional personalities and terrible cringeworthy one-liners as per usual. however unlike other fliks, there was none of the suspense and not enough jumpy moments to save the film. aside from some smirk raising black humour, this really was a very very poor film. waste of time"
    },
    {
      "rating": "10",
      "text": "Very good remake. I have not seen the original. So I won't compare it with the remake. But this is a good movie and very entertaining and creepy. TH emovie is especially good for a first time director and the ending is very good provided you stay till the end of the credits."
    },
    {
      "rating": "9",
      "text": "About as good as the original."
    },
    {
      "rating": "0",
      "text": "Really terrible. It doesn't hold up a match to the original, and it's even worse watched on its own merits. Avoid at all costs. And don't believe people who say this remake is good. They are Consumer zombies."
    },
    {
      "rating": "4",
      "text": "Overrated. not much character development, pretty cheesy at times, but it did have some good points such as being funny. but is mostly mediocre and flat."
    },
    {
      "rating": "10",
      "text": "Outstanding movie, much better than the original Dawn. Great directing, acting, soundtrack and action. As with most of my favorite movies, I enjoyed it more the 2nd, 3rd and 4th viewing. The Directors cut is also much better than the original theater version."
    },
    {
      "rating": "2",
      "text": "On the heels of the Texas Chainsaw Massacre remake, the newfangled Dawn Of The Dead streamlines another scrappy horror classic by discarding everything special about it in favor of pure visceral effect. Swarming with zombies on both sides of the camera, the film is unrelentingly relentless, leaving no room for original director George Romero's wry satire on consumerism or his slow-paced, creeping undead. As in 28 Days Later, which at least makes gestures toward social commentary, the zombies are fast and focused, barely pausing to savor \"Brains! Brains!\" before dashing off to the next fresh kill. Responding only to hot lead, they give first-time director Zack Snyder a chance to test how many subhuman heads can get blown to smithereens before the MPAA issues an NC-17 rating. (Answer: Several dozen and counting.)\r Looking lost in the grindhouse, an overqualified Sarah Polley stars as a suburban Milwaukee nurse who wakes to a virus that turns her boyfriend and a neighbor child into flesh-eating savages and converts her cul-de-sac into a zombie apocalypse. Banding together with a few survivors, including tough cop Ving Rhames, Mekhi Phifer and his pregnant wife (Inna Korobkina), and down-to-earth hunk Jake Weber, Polley and friends hole up at a local mall run by overzealous security guards. During the long standoff with the zombies outside, they devise an escape plan right out of the Clint Eastwood vehicle The Gauntlet while contending with infighting and new infections.\r Tasteless and gratuitous enough on its own terms, this Dawn Of The Dead would still be much more palatable had the original never existed. As it stands, the remake is akin to an Animal House knockoff staged at a country retreat and called The Rules Of The Game. Gone are Romero's wickedly funny riffs on malls as consumer utopias; they're replaced by a pack of bickering ninnies, smugly ironic Muzak versions of songs like \"Don't Worry, Be Happy\" and \"All By Myself,\" and, worst of all, product placements at every turn. With his background in commercials, Snyder was either inured to Romero's point or too concerned with nailing the important technical details, such as overhead shots of propane-tank explosions or the gooey sound of an unborn mutant sloshing around in amniotic fluid. Confusing body count with intensity, the new Dawn Of The Dead could be a metaphor for how little Hollywood values human life, if only it had a brain ripe enough to feast on."
    },
    {
      "rating": "9",
      "text": "El Amanecer de los Muertos (2004)Sinopsis:Una enfermera, un policía y otros residentes de Milwaukee pelean con unos zombis carnívoros mientras están atrapados en un centro comercial.Remake de la película homónima de 1978.Opinión:La primera vez que vi esta película hace años, no me gustó, ahora la vuelvo a ver y me encantó, básicamente la historia es la misma, pero en comparación de la versión original el desarrollo y ritmo son mejores mientras que la original era más extensa y lenta, podría considerarse uno de los mejores remakes de terror que existen y eso ya es algo, lamentablemente no puedo decir lo mismo de los dos remakes que se hicieron de Day of the Dead, de los cuales hablaré en otro momento.Valoración:4.5 ⭐ de 5 ⭐"
    },
    {
      "rating": "3",
      "text": "The original 1978 horror splatter-comedy ''Dawn of the Dead'' had an idea that played like cast-iron satire: zombies invading a mall. The one good exchange from that film is repeated in Zack Snyder's single-minded scare-tactic remake: when someone asks why the zombies congregate there, the response is: ''Memory, maybe. Instinct.''\r Otherwise, Mr. Snyder's blood feast is strictly by the numbers: this second-rater could be the world's most expensive Troma film. That makes sense: the screenwriter for the remake, James Gunn, also banged out ''Tromeo and Juliet'' (1996), that no-budget B-movie-studio's seminal film (that is, if the word seminal can be appended to Troma). Still, this is the first studio picture to exhibit the tacky Troma influence, which means ---- something, like the end of shame in Western civilization, perhaps. However, since ''Dawn of the Dead,'' which opens today nationwide, doubtless thinks of itself as a reimagining rather than a remake, the concept of shame was probably obliterated the moment the script got a green light from Universal.\r ''The Dead'' -- with apologies to James Joyce -- notches its frights early, before the introduction of the, excuse the euphemism, characters. The first undead we see is a little girl with part of her face rotted away, who goes right for her dad's neck. The mother, Ana (Sarah Polley), barely escapes the house intact and drives away through an apocalyptic version of the dozy suburban tract neighborhood she had come home to the night before. The graphic point of zombielike conformity was made earlier with an overhead shot of the neighborhood.\r In such instances, ''Dead'' establishes its scariness with an efficiently tactless facelessness -- that is, if the use of the word faceless doesn't provoke a defamation of character suit from the zombie lobby, apparently based in Toronto. That's where this movie was obviously shot, despite shabby attempts to convince audiences that it is set in Milwaukee.\r Milwaukee, the home of the bubbler, is transformed into the subdivision of the living dead. Ana runs into Kenneth (Ving Rhames), a uniformed cop, who makes her speak. It's one of the few ways to tell the zombies from the living -- though with dialogue like this, who's better off? They're joined by Michael (Jake Weber), Andre (Mekhi Phifer) and his very pregnant wife, Luda (Inna Korobkina). They make their way to the Crossroad Mall, where a handful of security guards led by the suspicious C. J. (Michael Kelly) have taken up residence.\r C. J.'s intolerance is evident early, when he calls Andre ''Shaq.'' His ragtag minimum-wage squad is determined to keep the zombies out, especially once Ana figures out that the life-free scourge is spread from a zombie bite. Isn't it always funny that people in zombie movies have never seen zombie movies, so they have no information whatsoever?\r ''Dead'' does an adequate job of building up the tension early, but the traces of humor with which the original writer-director, George A. Romero, slathered the first version weren't nearly as ham-fisted as those found in the current one. The reimaginers of ''Dead'' have to cope with being compared with a classic, while Mr. Romero had to deal with a much more horrendous thought: making a sequel to a legitimate classic, 1968's spartan and terrifying ''Night of the Living Dead.'' (Mr. Romero's genius came from never explaining why the zombie infection plagued Pittsburgh, a plot device this new version keeps.)\r There are a few other nods to the initial ''Dawn of the Dead,'' like a cameo appearance by the gore makeup genius Tom Savini, who worked on the earlier film. And the opening and closing credits by Prologue Film are so good they're almost worth sitting through the film for.\r Such treats aside, we're left with a movie dependent on generating its small amount of sparks by setting an order in which to eliminate the annoying cast members. A scene in which weapons have to be liberated from a gun store so the group can carry out a plan to get to a marina and sail away to safety -- don't ask -- shows why zombie pictures aren't unsettling anymore. The flesh-eaters are picked off like video-game targets.\r The eventual video game is bound to be a lot more fun -- and less slowed down by bad dialogue -- than this ''Dead.''"
    },
    {
      "rating": "7",
      "text": "That ending really ruined this film got very boring in the last 5 mins and stopped it from being a 10/10"
    },
    {
      "rating": "5",
      "text": "the live action Dead Rising movie at this point. it had the typical \"zombie flick on a friday night\" movie. need a short but sweet zombie action movie? here it is."
    },
    {
      "rating": "7",
      "text": "I must admit, I don't care for the zombie genre what so ever. However, I made an exception for Zack Snyder. I decided to give this a go, as preparation for his new film 'Army of the Dead'. This film was a blast from start to finish. The concept of them being stuck in a mall, and having to survive by working together was entertaining to watch. Considering this film was released 17 years ago, it still holds up in 2021."
    },
    {
      "rating": "10",
      "text": "Hijbhihgftgutdrsfhjopllmkioutrwaeqessgnkgfughjuihugufgdrdgsruhojobinonigydrdghhdwt"
    },
    {
      "rating": "9",
      "text": "hiihutgihihhihiyftffyyffyguhiihinknonojojihhiihihohonono,,,,,,,......,,,,,,,........,,,~~~~~~~~\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\""
    },
    {
      "rating": "1",
      "text": "Why is everyone so stupid? Why did the mall security have guns? Why didn't they just shoot the mall security guards in the face when they had them outgunned and out armed? Why didn't security try to team up with more survivors instead of trying to get rid of them when there are safety in numbers? Why does the power tripping SG not arm anyone while they are out doing objectives? Why does no one know these things are zombies? Why is the ego tripping security guard locking up other survivors other than just to have some random  in the movie? Why is he concerned about people stealing stuff in a zombie Apocalypse? Why do people act like wood when they are told that everyone they know is dead?This is my mind running through the fist 20 or so minutes. God help me though this movie......"
    },
    {
      "rating": "5",
      "text": "I never watched the original, but what I would recommend for \"Dawn of the Dead\" is to make a survival horror game rather than a movie. The ideas are fresh and tense, but its displayed using the wrong techniques."
    },
    {
      "rating": "3",
      "text": "Okay, first and foremost, the zombies themselves have issues. They DONT behave like zombies. They REACT to injury. Minor injuries can CRIPPLE them. They can PICK UP things and USE things. They can think for crying out loud. They can RUN. And why is the incubation period so erratically different its ridiculous. The protagonist's husband who is bitten at the start of the movie turns like a few seconds whereas another character who I wont mention to avoid spoiling the plot turns after what seems like a WEEK after being bitten. Its ridiculous. Oh and get what, BURNING zombies kills them. I can hear people cutting themselves to that/ Pro tip to those out there who dont know how to the survive the zombie apocalypse: Zombies are DEAD people who are infected with a BLOOD-BORNE virus (though this is debatable in other variations) that kills the host and takes control of their body after they are deceased. They want to feast on ALL living things INCLUDING animals. They are slow and can at best, jog if a prey attracts them. They can grab for things mindlessly but they CANT open doors, use weapons or pick up things, Zack Snyder! Nor can they be CRIPPLE by minor wounds like gunshots - they DONT feel PAIN, they're DEAD. Oh and Mr Snyder, the makeup of the zombies, why do they look like HUMANS instead of badly mauled walking corpses? The lines are horrible at times while at other instances they're brilliantly written. There are some tense moments but in most cases, you'll be just yelling at the screen and be utterly frustrated at how ridiculously naive, dumb and stupid the characters are. Seriously. For instance, stupidity No. 1: NO ONE knew what made the people turn into zombies despite many of them seeing people get bitten and turning e.g the protagonist's husband. Not only until around 1/3 of the way into the movie do the main characters realize \"Oh maybe its the bite?\" *facepalm* You are tell obviously who's gonna die (and they do) and you'll be cutting yourself at the most stupidass things the characters would do. WHY, WHY would you GO AFTER your DOG amidst the HUNDREDS of zombies that want to EAT you IF you know they WONT hurt your dog? Srsly that thing there, is what caused the plot to climax and end as it did. Had that certain character NOT gone after her dog and stayed with the plan, I am sure NO ONE would've been killed. And WHY do the characters just use **** pistols and shotguns? You have a GUNSTORE for God's sakes, there are things called RIFLES that are MORE accurate and also automatic & semi-automatic weapons all with a crapload of ammo. Why not just clear the streets? Why not use the damn rifles? Seriously the ENTIRE movie, they just stick to horrible horrible pistols (GLOCKS just damn GLOCKS for crying out loud. There must be Desert Eagles and M9's lying around in the store!) and those mediocre cop shotguns. Had they used a M16, M4A1 Carbine, SAW machine gun or hell even a plain old Lee Einfield, I am sure everyone would've survived. This is a movie that you watch drunk with your buddies on a Friday night. You'll probably watch it and forget about it, and probably switch to playing Left 4 Dead. The original 1970's Dawn of the Dead is vastly superior despite the outdated makeup effects. Watch that. Avoid this insult to the zombie canon pile of excrement at all costs. Hell even the ending is lacking. A braindead film that absolutely wont want to feast upon."
    },
    {
      "rating": "7",
      "text": "This remake of the original Dawn of the Dead proves to be a more effective and powerful film than the original. It may not appeal to everyone, but for those who enjoy a good zombie film, this new take will certainly be a good choice."
    },
    {
      "rating": "2",
      "text": "Bored me to tears. There is nothing really interesting about it. The plot is generic, the characters are just your stereotypical horror types and the zombies rarely seem like a real threat."
    },
    {
      "rating": "7",
      "text": "One of the better zombie horror efforts of the last few years. It's not as apocalyptic as Romeros original but the storyline works well and the action scenes are good."
    },
    {
      "rating": "8",
      "text": "Sometimes you wonder whether people even watched this movie or just dismissed it as \"lesser\" than the favorite Romero-classic from 78 without even giving it a chance. I mean \"Paranormal Activity\", the worst **** atrocity I've ever seen, has a better metascore. I'm probably one of the most pretentious cinema snobs that you'll ever meet, but I loved this movie. It's miles better than the original, which is revolutionary, sure, but has much flatter characters and lesser development. And don't give me any of the \"striking critique of capitalism\"-nonsense; that \"mall-shoppers are like zombies\" is as shallow a symbol as a 14-year-old punk-rocker who just discovered Bill Hicks would come up with."
    },
    {
      "rating": "7",
      "text": "A great remake if you ask me. It was entertaining and interesting through out. Its nice to see a franchise get a much needed reboot and be a sucessful reboot as well. Acting wasnt good though."
    },
    {
      "rating": "5",
      "text": "Unfortunately, the Dawn of the Dead remake (original was made in 1978) didn't live up to the prior expectations I had placed on the film upon hearing how good it is from my friends. Character development was virtually non-existent as the director instead opted to introduce more unnecessary empty shells as the movie progressed. The blood and gore was fine yet the zombies seemed more human than any recent flick of the same genre that I've seen recently. There's also a few cheesy moments which could have been left out."
    },
    {
      "rating": "4",
      "text": "Considered by many to be the precursor to the zombie-obsessed lives we live in today, Dawn of the Dead unfortunately is an average survival flick. This one never seemed to grab for me."
    },
    {
      "rating": "5",
      "text": "Considered on its own merits alone, it's a passable zombie movie with a memorable opening and epilogue and a blandly forgettable everything else. Only one character that the audience knows or cares about fails to pull through, with all the other deaths happening to the cardboard cutouts that pass for 80% of the characters as an excuse to have gore for its own sake. Lots of interesting ideas that become mere filler due to superficial half-treatment. The movie is good for a few scares here and there, but it pales terribly when compared to the original. Gone is Romero's social commentary, replaced by admirable yet insufficient earnestness, and there lies the film's true failing: it takes itself more seriously than it lets the audience take it."
    }
  ]
}