{
  "id": 301,
  "title": "Dawn of the Planet of the Apes",
  "starring": [
    "Andy Serkis",
    "Jason Clarke"
  ],
  "runtime": 130,
  "genre": [
    "Science Fiction",
    "Action",
    "Drama",
    "Thriller"
  ],
  "description": "A group of scientists in San Francisco struggle to stay alive in the aftermath of a plague that is wiping out humanity, while Caesar tries to maintain dominance over his community of intelligent apes.",
  "releaseYear": "2014",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/kScdQEwS9jPEdnO23XjGAtaoRcT.jpg",
  "categories": {
    "plot": 8.790322580645162,
    "acting": 8.589285714285714,
    "ending": 8.307692307692308,
    "soundtrack": 8.0,
    "cinematography": 8.333333333333334,
    "familyFriendly": 6.0,
    "funny": 8.0,
    "action": 8.375
  },
  "reviews": [
    {
      "rating": "10",
      "text": "Nothing, absolutely nothing, in Dawn of the Planet of the Apes falls short of being amazing. An emotionally heavy and truly moving film, Dawn is an absolute marvel of modern science fiction, building upon the strong and unmovable foundations Rise of the Planet of the Apes had left earlier. With a plethora of solid characters from both ends of the tale, an explosive sequence of events and a rather poetic script, Dawn raises the bar for the Planet of the Apes franchise and other big-budget philosophical productions of it's caliber. Dawn really is something that deserves appreciation; few films in our day can only dream of achieving what Dawn has. A film that truly touches it's audience with heartfelt passion and remorse for humanity, Dawn is the kind of film that films as an art form and the film industry needs in general.\r Both Rise and Dawn are thought provoking; films that challenge our perception of our very own species through another. However, Dawn triumphs more spectacularly in a way few films before it had done so; through unsolicited and unforced emotion and depth that makes Dawn a true modern science fiction classic, something that the original creators of Planet of the Apes would be very proud of."
    },
    {
      "rating": "8",
      "text": "Great film. The first of the new series was utterly surprising in a good way. I did´nt know what to expect. The second i knew what to expect, and I was very happy when I left the Cinema. Good story, acting usefull, effects great and overall just plain good entertainment."
    },
    {
      "rating": "8",
      "text": "These new age Planet of the Apes films continue to deeply impress with me with equal parts brawn, brain, and beauty. Smart and impeccably well crafted, this installment's first half is a little weak at times, but the second half is unmatched in recent times from war films. Honestly, this and its first installment have to be some of the best war films of this decade and up there for this century as a whole. Director Matt Reeves picks up where Rupert Wyatt left off with a beautifully poetic and stunningly crafted film about Caesar and the apes. Mirroring foreign politics on the brink of war in real life, all of those same problems and confusions are represented here with a deeply human and moving film the result. Neither side is good, neither side is bad. Instead, it is one big shade of gray with plenty of confusion on both sides. The cinematography and score are once more incredible. The special effects are fantastic and the fight choreography incredibly impressive. Many modern day blockbusters lack weight and an air of importance and \"epicness\". This one has it all in spades with a truly incredible film that packs a true emotional punch due to the trauma that can come from misunderstandings. Once again, the modern day Planet of the Apes delivers."
    },
    {
      "rating": "10",
      "text": "the storyline was amazing, can't think of another word to describe it. i enjoyed every second of this movie, if its the story, or the actors, even the effects was detailed much more then most people will notice.\ri can't think of one bad thing to say about this movie.\rif you watched the first movie this one is a must watch"
    },
    {
      "rating": "8",
      "text": "As an unashamed fan of the original Planet of the Apes films (which I once picked up for under a fiver), I am more than happy to enjoy this Sequel to the Reboot of the Remake of the Planet of the Apes. What’s been delivered is another entertaining film; almost, but not quite the equal of its predecessor, with a decent story and characters, and special effects at the top of their game.\r An expedition of humans has ventured deep into ape territory with the intention of restarting a hydroelectric dam to restore power to the ruins of San Francisco. With a deep mistrust of humans at the very core of ape doctrine, the plan becomes a tense diplomatic mission as the humans and apes negotiate to avoid another brutal conflict and needless loss of life.\r Caesar is played by master of motion capture Andy Serkis and amazingly, the motion capture was largely filmed on location in the forests of Vancouver, the CGI seamlessly integrated with live action. As a character, Caesar is rare among apes in that he was raised by a human and can see the good in them.\r Our human hero is Malcolm (Jason Clarke), a survivalist and engineer, who is in charge of the expedition, but is not much of a leader. Neither is he a diplomat, but he is level headed enough to develop a relationship with Caesar, with whom they share a common goal which transcends the interspecies squabble – each has a family they would do anything to protect.\r The real leader of the humans is back in San Francisco: the militaristic but pragmatic Dreyfus (Gary Oldman) who has already lost his family (he swipes through their pictures on a prominently placed iPad – in shops now!) and has little desire to understand or relate to the apes.\r The previous director Rupert Wyatt is replaced here by Matt Reeves, who gave us found footage monster movie Cloverfield, where the tantalising excitement of citywide destruction just off-screen was undermined by the idiotic decisions made by the protagonists. There are shades of this frustrating characterisation here with one member of Malcolm’s team, Carver.\r He is nothing more than a catalyst; right from the opening scene, where he shoots first and thinks later, wounding Caesar’s son Blue Eyes in the process, everything about him screams “I’m the **** who’s constantly going to jeopardise this fragile diplomacy” – which is barely saved from the brink of collapse more than once before the inevitable final showdown.\r Koba fills this role for the apes, but he is a stronger character and an established personal rival of Caesar, who tries to corrupt the younger apes, including Cesar’s impressionable young son Blue Eyes.\r We also remember the dramatic “No!” – The first words spoken by an ape in both Conquest and Rise, when Caesar flexes his vocal chords to deliver an ultimatum to the humans, but the apes here tend to converse in sign language amongst themselves. Perhaps they see spoken language as a hallmark of humanity, but they prefer to save their English skills to dramatically intimidate humans, reminding them that they share a level of intelligence which apes may even have surpassed with their sense of community. While the apes have built a new society from the ground up, the surviving humans continue to scavenge in the ruins of their decaying civilisation, relying on old technology.\r There’s a great scene about halfway through the film. Power is restored to an old petrol station in the woods, and as it flickers into life a song plays from a stereo: The Weight by The Band, a song which is both religious allegory and an exploration of the music which flows from the American South. Its thematic relevance extends to include references to Judgement Day and the American civil rights movement.\r Hearing recorded music and seeing artificial light, symbolic of humanity’s legacy, offers a spot of hope, which is inevitably undercut by the melancholy of the world lost and the inevitability of an impending finale, which I’m going to talk about now, so stop reading to avoid spoilers. Hey, I’ve already told you that they managed to get the power back on so Gary Oldman can charge his iPad.\r The audience wants a fight, we’ve paid to see apes with machine guns, and a fight is what we get, courtesy of the hot headed Koba and unrelenting Dreyfus. Lamentably although hell inevitably breaks loose, credibility is stretched. The previously pacifist apes are far too good at using the machine guns they have only recently stolen from the humans.\r We know the apes have both intelligence and physical strength on their side, but it’s hard to explain hold their own so well against the trained human guards. Ultimately, they overwhelm the humans with sheer numbers, when they might have concocted a strategic assault using some kind of unique and established ape advantage, such as their non verbal communication, or climbing ability."
    },
    {
      "rating": "8",
      "text": "The only thing I didn't like in this movie is how everything goes wrong almost 100% of the time. I feel like it's an overused cheesy storytelling device where everything is going along just fine, then hey someone forgot to do this, or someone didn't do that. Of course in order to have a story you need conflict, but please... give me a good solid reason for that conflict to exist. One plot convenience is fine, but this movie was kinda rife with them. Still loved it 8/10﻿"
    },
    {
      "rating": "9",
      "text": "\"Dawn of the Planet of the Apes\" - the sequel to \"Rise of the Planet of the Apes\" - more than capitalises on the promise of \"Rise of the Planet of the Apes\", delivering a captivating and electrifying sci-fi whirlwind of ambition, action, intellect and heart. The cinematography, editing, visual effects, directing match and exceed the high standards set by its predecessor, but what truly sets \"Dawn\" apart from others of its ilk is the surprising depth of thought and feeling that belies and bolsters its dazzling spectacle. The thematic foundations that were laid in \"Rise\" are built upon here and then some. What that film started to explore - human nature and animal instinct and how frighteningly closely those two things intersect - is looked at more in-depth and given a heightened sense of urgency in Dawn of the Planet of the Ape's post-apocalyptic context. Films like \"Dawn of the Planet of the Apes\" gives the blockbuster genre a credibility that it is losing and shows you do not have to sacrifice a heart, a soul, a brain for a large budget - and they can be as big as each other. This is a franchise still alive, kicking and thumping its chest."
    },
    {
      "rating": "8",
      "text": "A sequel that is without a doubt better than its predecessor, Dawn of the Planet of the Apes proves to be the more mature of the two films. The tension between apes and humans is at its peak, even so, the desire to re-estabilish a unity is present in members of both nations, whilst others are ready to engage in an all-out-war. The result is an action-packed sci-fi delight, with a humanistic conflict at its heart, albeit the emotive themes are fairly cliché and the movie is predictable at times."
    },
    {
      "rating": "10",
      "text": "Absolutely the best movie of 2014. The CGI effects were unbelievable and Andi Serkis is able to act incredibly as Caeser. Acting is also top-notch and the story fits in well with both the prequel and the original films. Don't put off seeing this movie because the concept might sound 'silly' or if you are a Religious nut, because missing out on a film this great is just insulting."
    },
    {
      "rating": "8",
      "text": "Accompanied by near seamless visuals, atmospheric cinematography and great performances from its human characters, Dawn is an excellent study into the futility of war, the love of power and the human condition, made more poignant by having these concepts played out almost exclusively by the apes."
    },
    {
      "rating": "10",
      "text": "During \" Dawn of the Planet of the Apes \", you get that sense of dread from the opening shot of the movie to the epic and breathtaking conclusion to this memorable sequel, where the Apes come to life on screen."
    },
    {
      "rating": "9",
      "text": "Dawn of the Planet of the Apes occurs a decade after the events of the first film (Rise of the Planet of the Apes) and follows a band of survivors of who have endured a deadly viral outbreak. It chronicles the relationship between the human survivors and a group of genetically modified apes led by Caesar. Through the evolution of the narrative events occur that leave the human survivors and the apes on the brink of war.\r The cast includes Jason Clarke, Gary Oldman, and the wonderful returning Andy Serkis as Caesar. The acting is in all regard good, but where it truly shines is in the scenes where Clarke's character is interacting with Caesar. The chemistry between the two leads is compelling, thrilling, and aw inspiring. Particularly due to Andy Serkin's phenomenal video capture work. Gary Oldman is also fantastic, (per usual) and no actor's presence seems to detract from the film.\r Director Matt Reeves is one of the undeniable factors that makes 'Dawn' so great. Reeves direction is smart, intuitive, and filled with dozens of engaging shots. Reeves hits the mark with almost every frame and this greatly affects the overall intensity and emotion of the film. The screenplay is also admirable for creating memorable dialogue even if some of it fells like exposition.\r 'Dawn' also exceeds in exhibiting interesting social commentary throughout. The film presents themes of racial tension in intellectual ways and this is greatly appreciated due to the much-needed depth it adds. These social messages help to create a great deal social relevancy propelling the film past just great Si-Fi.\r Dawn of the Planet of the Apes improves over its predecessor in almost every way. From the stellar direction to the social commentary, 'Dawn\" exceeds the summer blockbuster template to construct a film that is truly relevant while also being extremely entertaining."
    },
    {
      "rating": "9",
      "text": "This eighth (!) picture in the Planet of the Apes franchise gives the original film a run for its money. Building on the aftermath of the last film, this movie places Caesar at the center of the story, and it's surprising how well it works, given that he and all of his simian costars are (wonderfully) computer generated characters. In fact, the only sleight I can give this otherwise wonderful picture is that the actual human characters feel much more artificial than the titular apes."
    },
    {
      "rating": "9",
      "text": "Dawn of the Planet of the Apes is incredible just shy of CG Nirvana. Its great plot twisting story keeps you on the edge of your seat most of the time."
    },
    {
      "rating": "9",
      "text": "Although not as consistently entertaining as the first film, Dawn of the Planet of the Apes provides a deeper and more meaningful story with Andy Serkis upping his game and carrying his film to greatness. For a bonus the human characters are actually compelling. I give this film 88% of a good movie."
    },
    {
      "rating": "10",
      "text": "This movie was amazing from start to finish, with it's well done story, beautifully crafted message about war and there's no superior race no matter what you think, and the amazing visuals, seriously, I kept forgetting these aren't really apes, well done Matt Reeves, can't wait for the third one."
    },
    {
      "rating": "10",
      "text": "The storyline was absolutely fantastic. From the introduction of the movie, showing the near extinction of humanity to the final scenes; this film was packed with heartfelt characters and beautiful dialogue, and even leaves an open ending for a possible third movie, its so good graphics look good and its very interesting i recommended"
    },
    {
      "rating": "10",
      "text": "Dawn Of The Planet Of The Apes is an amazing movie if you enjoy action movies then this is a great movie if you like story and tense moments then this is also amazing. I loved the film and think it's possibly the best film of 2014. The moments when bullets are shot it's loud and you will most likely jump the movie is amazing and deserves the 10 ."
    },
    {
      "rating": "10",
      "text": "Great film. Brilliant effects and very believable. I can't really think of anything bad about this film. It was very good and entertaining. Watch it if you can."
    },
    {
      "rating": "8",
      "text": "An improvement on Rise, that film's sci-fi ambitions a tad undercooked. Here the focus is on psychology. Koba is a great villain, with a strong performance from Toby Kebbell who has some hilarious \"playing\" dumb-ape scenes that are perfect - until he becomes a simplistic power hungry mad hatter at the end. He was broken by the world and thought he was helping the apes, then suddenly at the end he becomes simply insane and angry. The other \"villain\", Gary Oldman, is vastly underwritten - in fact the humans are in general. This film is less about a rift between humans and apes then it is about Caesar realizing apes aren't just inherently good because they're apes and not humans. I wish the ending were tighter in general and the human dilemma equal to the apes."
    },
    {
      "rating": "10",
      "text": "Dawn of the Planet of the Apes takes place ten years after the first and much has changed. Caesar(played by Andy Serkis) returns as the ape leader in an even better performance than the original with the support of his returning ape friends Maurice and Koba. Caesar now has a family, including his rebellious son Blue Eyes, his wife, and newborn son. Caesar’s companion, Will Rodman(played by James Franco) has died, which introduces the new cast. Jason Clarke, Keri Russell, Gary Oldman, and many more amazing new characters that are trying to survive in the rundown city of San Francisco. The Apes are growing in numbers and strength, while the majority of humans are either dead from the simian flu or each other. Caesar is now in charge of the apes and only wants what’s best for his kind, but Koba, Caesar’s right hand man, has other ideas. When the humans and apes try to work together Koba ruins every chance for peace through violence. A war between apes and humans is inevitable and nothing can stop what is to come, not even Caesar.\rThis movie hits in all the right places. The visuals are astounding. The contrast from the lush green forests and the dilapidated San Francisco makes for a great setting, and the way it’s filmed cannot be understated. The way in which the intense battle sequences are filmed, set this movie apart from every other action blockbuster. In one sequence the camera is rotated an entire 360 degrees revealing the destruction of humans and apes at war, which makes for the most dramatic scene in the entire movie. The CGI integration is seamless, especially when so many apes appear at once alongside humans. The loss of James Franco doesn’t even phase this cast, every character has a purpose and it shows on-screen. The beautiful script is heard not only with the human cast, but the apes too. They speak less, but do when necessary, and it is breathtaking just as it was in the first film.\rDawn of the Planet of the Apes surpasses it’s predecessor, Rise of the Planet of the Apes, in every way. The characters, the cinematography, and plot are all impressively intriguing. This is the best blockbuster of the year, and great fun for the entire family. The only downfall is that this movie isn’t an IMAX 3D Experience."
    },
    {
      "rating": "10",
      "text": "i was mind-blown by the effects and the way they built this amazing story this is someone better than rise and the slow pace of this film adds to the drama dramatically, cant wait for number 3!!!!!!!!"
    },
    {
      "rating": "8",
      "text": "\"Dawn of the Planet of the Apes\" sequel to the prequel to \"The Planet of the Apes\" was very good, in moments of drama, and action, new characters, between apes and humans, the usual \"ape\" characters , The plot was spectacular, the post-apocalyptic scenario was great, the story very good, and the performances and special effects were very good."
    },
    {
      "rating": "8",
      "text": "A very interesting movie though it's also slightly depressing. Then again, this is a planet of the apes movie. The first of these ended with a lecture on how we'll destroy the planet. So being depressing isn't exactly a surprise. But anyway, let's talk about the apes. Caesar was the best character because he had the most depth. Krona was also a good villain because he was really complex. Gary Oldman's character was interesting too. He obviously has a tragic past, and there's one scene where you feel sorry for him but at the same time, he's prepared to destroy the apes even when one of his own people tries to tell him that they aren't truly evil. It's a very good movie, one of the best of 2014."
    },
    {
      "rating": "8",
      "text": "‘Dawn of the Planet of the Apes’ Continues the Saga.\r A quick montage at the beginning of “Dawn of the Planet of the Apes” fills us in on what has happened since “Rise of the Planet of the Apes.” Three years have gone by for us in the audience, and about a decade for the assorted primates on the screen. James Franco and millions of other people are dead, victims of a lethal virus and the usual apocalypse-causing disease of hubris. After a period of violence and chaos, the survivors have cobbled together a reasonably stable society in the ruins of San Francisco, with Gary Oldman in charge.\r But this is not “Dusk of the Planet of the Humans.” The spectacle of yet another desperate population, huddled together in the wake of catastrophe to await the next zombie, alien, robot or monster attack, would be unlikely to inspire much excitement. The real interest lies across the battered Golden Gate Bridge, in Marin County, where our evolutionary cousins, under the benevolent guidance of an upright-walking chimpanzee named Caesar, have built their own civilization. In contrast to the bedraggled human colony, the ape encampment is a thriving city-state with distinctive wooden architecture, domesticated horses, a sophisticated (mostly signed) language and an educational system overseen by Maurice, the gentle, copper-furred orangutan who gave the first movie an extra fillip of soul.\r The sylvan, simian Athens in the Muir Woods is a remarkable achievement and an important part of what makes “Dawn of the Planet of the Apes,” directed by Matt Reeves from a script by Rick Jaffa, Amanda Silver and Mark Bomback, the best of this summer’s large-scale, big-studio franchise movies. Granted, this isn’t a very high bar to clear: “better than ‘Transformers 4’ ” barely counts as praise, even with an exclamation mark. But unlike that toy-smashing extravaganza — and unlike 2014’s visitations from the “Spider-Man,” “X-Men” and “Godzilla” money trains — “Dawn” is more than a bunch of occasionally thrilling action sequences, emotional gut punches and throwaway jokes arranged in predictable sequence. It is technically impressive and viscerally exciting, for sure, but it also gives you a lot to think, and even to care, about.\r Starting with the apes themselves. In the final credits, Andy Serkis receives top billing for his performance as Caesar, a role that continues to redefine screen acting in the digital age. His facial expressions and body language are so evocatively and precisely rendered that it is impossible to say where his art ends and the exquisite artifice of Weta Digital, the special-effects company, begins. The same is true of the other main ape performers: Karin Konoval (Maurice); Nick Thurston (Caesar’s son Blue Eyes); Judy Greer (Caesar’s wife, Cornelia); and especially Toby Kebbell as Koba, Caesar’s lieutenant and eventual nemesis.\r Koba, a survivor of scientific experiments, bears the physical and moral scars of human cruelty. When the apes encounter a scouting party from the city (led by Jason Clarke and Keri Russell), Koba is quick to sound the alarm. The humans, about to run out of fuel, want to restore an abandoned hydroelectric station in ape territory, and they ask Caesar for help. Koba warns that people are a violent, duplicitous, predatory species that should be fought if it can’t be avoided.\r Caesar, who saw the generous, tender side of humanity when he was hanging out with Mr. Franco and Freida Pinto, is willing to give our kind the benefit of the doubt. There is plenty of evidence — both in the movie and beyond it — to support Koba’s view, but the film comes down squarely, and maybe a little too squishily, on the side of tolerance and cooperation. The ape and human societies are parallel primitive patriarchies (women nurture and worry, while men lead and fight, a disappointing but hardly surprising failure of imagination on the filmmakers’ part), and they are threatened by symmetrical schisms. As Koba opposes Caesar, so does Malcolm (Mr. Clarke’s character) find himself increasingly at odds with Dreyfus (Mr. Oldman), who sees the apes as a mortal threat to be confronted with maximum brutality.\r And while “Rise” found room for exuberance in the shadow of catastrophe — partly because it seemed so justifiably excited by its own ingenuity — “Dawn,” its title notwithstanding, paints a darker, scarier picture of the future. It also has a grave, brooding beauty, intensified by Michael Giacchino’s wild and subtle score and by the deep, verdant shadows of Michael Seresin’s cinematography. Mr. Reeves has a fine sense of visual detail and also of the eloquence of nonverbal exchanges between characters, digitally enhanced and otherwise. (Ms. Russell and Kodi Smit-McPhee, as her adolescent son, do especially graceful work in limited roles.) The film is full of small, memorable moments and crowded with distinctive personalities on both sides of the ape-human divide."
    },
    {
      "rating": "8",
      "text": "That was pretty cool, maybe Andy Serkis's best acting so far. I liked this movie more than other two."
    },
    {
      "rating": "6",
      "text": "\"Planet of the Apes: Revolt\" is the promised sequel to \"Rise of the Planet of the Apes\", both of which are based on Pierre Boulle's dystopic book. Now humans are a minority, a race facing extinction (what an irony!) that apes seem to be able to seriously threaten. The contact between them reminded me of the difficult and dangerous understanding between different communities when distrust prevails. We can imagine something similar in moments of our past, like the first contact between European navigators and indigenous peoples of the Americas, for example. Distrust, fear, displays of power to intimidation... the film shows these in a very interesting way, with the apes being very similar to us, in behavior and way of think. Unfortunately, the whole film is quite pretentious and full of self-importance: both sides have an exaggerated awareness of the relevance of events to their own community. This is the most boring point of the movie. The actors do a good job, but non-human characters get more interest and dominate the scene. Technically, the film doesn't deserve major criticism. CGI is more cautious than in the first movie and seems more real. Sequences of combat and action are breathtaking, certainly pleasing to those who seek action and adventure."
    },
    {
      "rating": "8",
      "text": "Serving as a sequel that improves upon its predecessor, Dawn of the Planet of the Apes adds resonant depth to the complex political tragedy to the narrative of a long-living franchise. It's a gorgeous-looking movie and nearly everything about it works.It takes a while for the story to really get going, just as it was with Rise of the Planet of the Apes, the previous film. But once the action starts, the cinematography really starts to shine. The action sequences are some of the best I've seen in a long time. The vibrant colors bring out incredible detail and the camera follows everything perfectly. Once again, Andy Serkis is magnificent as Caesar. Really, all of the motion capture imagery is just beyond stunning. There's so much behind the facial expressions and mannerisms of the apes: brotherhood, pain, etc. It's incredible how much emotion is evoked in the actors' performances when they hardly even speak!The script does a wonderful job at developing the apes as characters, but Dawn suffers from the same problem that Rise had: clichéd and underdeveloped human characters. Gary Oldman makes the most of his smaller supporting role, but the rest of the human characters behave in ways that are quite illogical that make it difficult to really care about them or understand them. Some of the human characters don't even do enough to justify their large presence in the film.Dawn of the Planet of the Apes mostly overcomes what flaws it has with an intelligent story, engaging political drama, and beautiful, smooth direction. It improves upon its predecessor in every way and enriches the drama of an enduring saga.Story: 8Acting: 8.5Script: 7.5Visuals/Sound: 10Entertainment Value: 8.5OVERALL SCORE: 8.5/10"
    },
    {
      "rating": "8",
      "text": "번역없이 이해되고, 여러번봐도 질리지 않는 영화!!A film that can be understood without translation and never get tired of watching many times!!"
    },
    {
      "rating": "9",
      "text": "Far and away the best movie of the summer.  It all goes back to storytelling.  This crew didn't sit back and rest on its tech laurels. Serkis is amazing, but the writing and the directing are top notch.  Remember the first Apes movie? Not in this franchise. The Tim Burton fiasco?  We've come a long way, baby."
    },
    {
      "rating": "10",
      "text": "The best movie of 2014 so far. For two hours it immerses you into its atmosphere! Great characters, fantastic main plot, top notch CGI ... it is a must see!"
    },
    {
      "rating": "10",
      "text": "From start to finish had me on the edge of my seat.  An amazing visual experience mixed a fantastic script and score.  This film is a deeply emotional one as well you really feel for these characters.  There is nothing not to like about this film.  A+"
    },
    {
      "rating": "10",
      "text": "This is the best movie I have seen in 13 years (Training Day). Everything worked in this film to perfection, I would not have changed anything, this director did bloody awesome. It's a must see. 10/10 - and I have never giving anything a 10 in any reviews."
    },
    {
      "rating": "10",
      "text": "I will make this short and sweet. Excellent  movie. Has a little of everything in it. The acting is good especially what it takes to bring Caesar to life. After watching the making of Rise OPOA I realized how much went into creating a movie like this. However, it's not just the incredible technology that brings this to life, it is the excellent story. Very touching, moving and thought provoking."
    },
    {
      "rating": "8",
      "text": "es una buena película con buenas ideas pero falto mas historia mas enfatizada en lo es pero tiene una buena historia buena trama la música suena bien pero tuvo algunas cosas que no estuvieron bien y me aburrí por eso pero lo demás fantastico"
    },
    {
      "rating": "8",
      "text": "\"Dawn of the Planet of the Apes\" 10 Scale Rating: 8.5 (Fantastic) ...\r The Good: While they are very different films, the sequel transitions flawlessly from the first and fits into the franchise perfectly. You get so used to the apes, that you forget that they are created with special effects. That is the mark of truly fantastic work and you can't help but be impressed. In films like this, it is easy for the human actors to fall to the wayside, but that does not happen here .. at least not with the leads. Jason Clarke's Malcolm believably connects with Caesar and forms a bond that I feared would not be achievable. It's a shame that Serkis won't get award consideration due to being a motion capture actor. He deserves it. The battles were intense and the film does a great job causing you to wonder if your favorite characters will live or die. Lastly, the film is very poignant and provides excellent social commentary without cramming it down your throat. A worthy successor, which is hard to come by these days.\r The Bad: I gotta admit it ... scenes of monkeys, riding horses, wielding machine guns, and leaping through fire were among the more ridiculous scenes that I have ever seen. They were during some very serious moments, and I couldn't help but laugh at them. Some of the supporting cast was pretty cliche and forgettable. They also weren't well characterized and I didn't even see what happened to a few of them."
    },
    {
      "rating": "8",
      "text": "After the pleasant surprise that was the first film of the new Planet of the Apes series, the expectations for the sequel, or middle part of the trilogy, were somewhat bigger. Thankfully, everyone involved was fully aware of that and delivered another smart blockbuster with a lot of vital commentary on the futility of war and violent conflicts. The film doesn't want you to pick a side too easily as hostility between the last remaining humans on Earth and the intelligent apes arise. There are decent and bad characters on both sides. This makes for an interesting ride, as the conflict spins more and more into chaos and there is little anyone can do against it, after a point of no return. Once again, the CGI is incredible, thanks to great motion capture acting and the accompanying special effects. Thankfully, the human actors are en par, especially Gary Oldman only takes two short scenes to make a strong point for being one of the best of his generation. The gloomy atmosphere, the great cinematography, it all adds up to an intelligent and pretty damn entertaining continuation of the story. If there is one complaint it would have to be that the ending is merely a cliffhanger for what's next in part three. But at least we all have something to look forward to."
    },
    {
      "rating": "8",
      "text": "Spectacular movie. Once you get over the little kids laughing at the apes you find the plot to be very deep and the characters all put in very tough situations. There was a level of drama in the film that I was not expecting. The action was just the right amount and not overdone. I do think they rushed the transition from the first movie to the this one (a two minute montage of clips to show how the world went to hell) but other than that no real issues."
    },
    {
      "rating": "7",
      "text": "If you are looking for an action picture that is not totally mindless, this movie is a good choice. It’s a little too long and generates more cloying sentimentality than genuine emotion. Still it has enough action in a sturdy enough plot to keep the audience quiet. This was the first time CGI really annoyed me (has it reached its limits?) since the swarming apes, always shot from above, looked like swarming ants with identical ape decals pasted over them. On the other hand, digital makeup has improved enormously, or Andy Serkis is simply a genius at acting under these conditions. In the end, I couldn’t decide if the pessimistic philosophy that war is inevitable and neither humans nor movie apes will improve (exemplified by the selfish “apes” who must go out for popcorn refills in the middle of a movie in a packed theater) or whether this philosophy was just a cynical excuse for another sequel."
    },
    {
      "rating": "7",
      "text": "Although the plot is predictable, Dawn of the Planet of the Apes combines great visual effect and refined motion-capture acting into an emotional spectacle. Much of the novel factor of Planet of the Ape franchise is how believably humane the apes can be, it's also a measure bar as comparing the movies of this franchise in order serves as prove of technology advancement. Andy Serkis has perfected a masterful interpretation of the ape-human mime hybrid. It's not an overstatement that the apes fare better and more convincing than the human counterpart.\r Visual is splendid and aesthetically pleasing. It's not as extravagant as other blockbusters in recent time, but the art direction offers a unique appeal. Different than most grayish dire post-apocalypse setting, the movie turns to a more organic setting, a lustful return-to-nature background while some of civilization remains still stand tattered. Glossy urban areas have now coated with rustic flavor while the apes territory is leaning towards early civilization settlement. One is deteriorating while the other contrastingly and gradually improves.\r The movie has one of the best uses of motion capture lately. Apes moves with fluid almost humanized motion even though some of the hunchback traits still persist. It's interesting to see such varied range of emotion that can be conveyed by the apes' while most of them only communicate with body language. Action sequences are well done; a couple of scenes are shot in very interesting point of view or continuous shot. It's a little heavier on action than the prequel.\r However, the humans aren't nearly as intriguing. Jason Clarke as Malcolm, the engineer and leader figure does a decent job, but he's eclipsed by Andy Serkis' Caesar. He's not really an engaging lead role as James Franco was, and it's a bit underwhelming when the movie tries to compare the two together. Gary Oldman as Dreyfus works with what he has. Being a man with practically a thousand faces, he can pull off any role, but here his character is rather unexceptional.\r The plot is a bit overused though; those who have seen Dances with Wolves, Pocahontas or Avatar will find little surprise. Granted, there's only so much this \"two civilizations\" premise could go and the movie does go for more mature outlook, but a lot of the scenes foreshadow any twist the movie could've had, even more so for those knowledgeable of the franchise. In the end Dawn of the Planet of the Apes does any movie strive to, it immerses the audience and makes them invest in the character's struggle. With the pace it's going the apes are here to stay."
    },
    {
      "rating": "10",
      "text": "Nothing is bad about this film. Characters are solid, likable and relative. Every side, weather Ape or Human, has an opinion backed by some, very, logical and understanding motives. The acting is superb all performances are top notch. The over-all story-line is Sensational, does a great job bring out messages and themes that are relevant today within our changing society, also does a great job Humanizing the apes, their not just the bad guys (have never seen the original film, so im not 2 sure if they are seen with humanity).\r Their are many other important points to add, but to the point, Dawn Of The Planet of the Apes is a Spectacular squeal that will go down as one of the greatest science fiction films of the 21st century.\r 10/10, yall **** need to watch this film :D"
    },
    {
      "rating": "10",
      "text": "Excellent movie, excellent history, and excellent visuals, I was hoping to enjoy something like this since a long time, totally surpass the previous planet of the apes."
    },
    {
      "rating": "10",
      "text": "freaking monkeys and guerillas on horses with guns during an apocalypse setting o yea and gary oldman enough said about this awesome movie its a must see summer movie."
    },
    {
      "rating": "10",
      "text": "One of the most intelligent and entertaining big-studio releases of the summer so far, Easily it's one of the best of the year,  It is amazing the most  exciting, and powerful of all the Apes films."
    },
    {
      "rating": "8",
      "text": "Good solid Film.  Consider it an 8.5.  It almost reaches the levels of praise that some reviewers are giving.  Its a close masterpiece.  I felt the climax and ending could have been handled a little differently.  It almost happens so fast that you feel like the rug is pulled up from under you, because the film is just starting to hit a terrific pace that I did want to stop.  The script is laced with all kinds of good allegories and you could read practically anything into this engaging and sometimes brutal tale.  I stared in wonder on just how good the apes looked.  It was incredible seeing them.  The humans do get the short stick and there is no picture given on the events outside of San Fran.  This sequel though has me looking forward to the 3rd film which I thought would never happen.  I found first one mildly entertaining, but it is nothing like this one."
    },
    {
      "rating": "10",
      "text": "Such an amazing movie! If you can make monkeys on horses, guns blazing NOT funny, then you've done something right. It takes place during human extinction, wile apes & human live separately, & apes hate humans for what they've done to them. Its also one of the few times the sequel is better than the first, which is Rise of the..."
    },
    {
      "rating": "9",
      "text": "Intelligent and provocative in all the right ways, Dawn of the Planet of the Apes expands on its remarkable predecessor with dynamic motion capture, well realized ape character arcs and a blatant and bleak social message."
    },
    {
      "rating": "10",
      "text": "A complete re-imagining of the movie \"Battle for Planet of the Apes\", this movie \"Dawn\" is exactly what the original creators of the first film wanted to do. That was until the Fox executives got their hands into the project and turned it into a virtual home movie and pilot for a failed TV series. It took 40 years but we finally have that great battle movie in our hands. The actors playing apes do an excellent job and you never once wonder if they are real or not you are just immersed in the film. The action and plot have many twists and turns and keeps you interested for the full duration of the film. I really love what these new movies do for the franchise giving it the credibility that the continuing 70's sequels could never give."
    },
    {
      "rating": "10",
      "text": "The most entertaining, well told, socially conscious and aware films I've seen in a very long time. Loved the messages about the environment and gun violence. Wonderfully acted and shot, Dawn is a gem."
    },
    {
      "rating": "10",
      "text": "Wholly crap! What an amazing film! The visuals were FANTASTIC, the characters were well realized, especially the apes, and the story is for the most part unpredictable and takes some not so heavy twists and turns that still present a strong effect on the movie itself. There are really no plain and simple, black and white characters. As for the main characters (Caesar, Koba, Malcom and his family, even Dreyfus) present such three dimensional characters. Even for the supporting characters, they don't fully present three dimensional characters, but more of representations of different themes of characters that were used to see in movies. For example, you have a character that despises Apes for everything that's happened to the world when really he's afraid of this new world. Essentially, all the characters serve a purposeful role, three dimensional or not. In the end, it's a beautifully dark and exciting installment filled with beautiful cinematography, set pieces and fascinating characters (mainly Caesar and Koba). Overall, it's one of the greatest sequels of all time! I give this masterpiece an A+!"
    }
  ],
  "recommendations": [
    "avatar",
    "war_for_the_planet_of_the_apes",
    "hellboy_ii_the_golden_army",
    "the_abyss",
    "alpha",
    "in_the_heart_of_the_sea",
    "ex_machina",
    "master_and_commander_the_far_side_of_the_world",
    "the_martian",
    "the_iron_giant",
    "blade_runner_2049",
    "interstellar",
    "first_man",
    "alien_covenant",
    "stargate",
    "deepwater_horizon",
    "how_to_train_your_dragon_the_hidden_world",
    "the_perfect_storm",
    "the_lord_of_the_rings_the_two_towers",
    "arrival",
    "the_thin_red_line",
    "reign_of_fire",
    "jungle",
    "rise_of_the_planet_of_the_apes",
    "mortal_engines"
  ]
}