{"id": 4787, "title": "Day of the Dead: Bloodline", "starring": ["Sophie Skelton", "Johnathon Schaech"], "runtime": 90, "genre": ["Action", "Horror"], "description": "In a world overrun by zombies, military personnel and survivalists live in an underground bunker while they seek a cure.", "releaseYear": "2017", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/3jM4C1wJxHLWlF4tcSyyv6fnJPR.jpg", "categories": {"plot": 6.0, "acting": 2.6666666666666665, "ending": 6.0, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 3.0, "funny": 5.0, "action": 6.0}, "reviews": [{"rating": "0", "text": "I usually love B movies, especially zombie ones, but this was so awful it makes most B movies look like masterpieces of acting and script writing. The Acting and dialogue was soooo bad in this movie it was cringeworthy, yet it paled in comparison to how truly dreadful the directing and script was."}, {"rating": "3", "text": "Another painful remake that does not stain Romero's legacy nor the legacy of the original film but unfortunately it uses them to attract attention. Avoid it"}, {"rating": "1", "text": "Everything about this movie is terrible.  Plot, directing, acting, dubbing, and script.  At times this is so poorly done it almost qualifies as a spoof of the genre.  Too bad that was not intentional."}, {"rating": "2", "text": "Awful sequel to the terrible remake.This film has bad acting and is boring."}, {"rating": "4", "text": "IDMB gave this movie 9.1/10 and I would have been OK with this if this was a B movie scale. It's an above average movie which, unless you're a die hard fan of the undead genre (rotters, in the movie) will not manage to hold your attention long enough."}, {"rating": "3", "text": "I couldn't figure out if this was Asylum level self-aware awfulness for its own sake or an earnest zombie flick with serious social commentary. Whatever it is, it did not work at all."}, {"rating": "6", "text": "As far as crappy zombie movies go, this isn't that bad. More generic than anything. I may just be desensitized from having watched so much truly awful stuff back during the height of the undead craze, but this is still leagues better than the 2008 remake.Admittedly the first 25 minutes or so is awful. That's because you're getting bludgeoned in the head by the bad acting, unnatural dialog, and new rapey take on Bub (now called Max) right out of the gate. Once the survivors set out to get meds at a nearby college though things get much better. That's when it settles into a comfortable groove of the expected zombie action. There are even some decent twists made to stuff from the Romero movie.The \"Rotters\" look pretty good. So does the gore. The appearance of main zombie is the only reason this got any sort of buzz before release. It's easy to see why. They accentuated Johnathan Schaech's mouth to great effect. The guy gives a suitably creepy performance. The action never really deviates from the expected headshots and bite marks, but Max's ability to think makes him a more significant threat to the soldiers in the bunker. It's also the only zombie movie I can think of that at least tried to make a memorable antagonist that stands out from the rest of the living dead in a notable way.This still in no way deserves to share the same name as one of the greatest zombie movies of all time as all it really does for the Romero film is reduce it's quality to that of your average straight-to-DVD effort, but there's still enough of the original Day of the Dead hanging around too keep things pretty entertaining throughout. The characters may make some baffling decisions and the production values are low, but the ending is more upbeat than you would expect. Trust me, there are worse alternatives out there. Like The Zombie Diaries for example. At least this isn't ineptly made. In fact, the biggest problem with Bloodline is that there isn't really much about it to distinguish it from your typical Romero clone.6.1/10"}, {"rating": "4", "text": "I lost count of the number of people who died to save the life of a little girl, and what's the point of a vaccine that stops you turning from a zombie bite if the zombies always bite huge fatal chunks out of your neck anyway? The camp commander was right all along; lots of people died for nothing. I found myself rooting for the romantic zombie. Love conquers all; even death."}, {"rating": "0", "text": "How are you bored me, unfortunate mediocrity! How long can you shoot about a zombie? Do not you have any more imagination than anything else? If there were any sense in this film, I would write a little more, but there's really nothing to write about. Oh, yes, of course, if you like snot, bloody teeth, decaying flesh - then there is something to see."}], "recommendations": ["army_of_the_dead", "see_no_evil", "ouija", "jason_x", "legion", "cabin_fever", "piranha_3dd", "land_of_the_dead", "the_wolfman", "the_green_inferno", "jeepers_creepers_3", "ghost_rider_spirit_of_vengeance", "the_legend_of_hercules", "jeepers_creepers_reborn", "wrong_turn", "the_final_destination", "malignant", "van_helsing", "the_host", "the_eye", "the_darkest_hour", "slender_man", "skyline", "transformers_age_of_extinction", "underworld_blood_wars"]}