{"id": 2864, "title": "Daybreakers", "starring": ["Ethan Hawke", "Sam Neill"], "runtime": 98, "genre": ["Action", "Fantasy", "Science Fiction"], "description": "In the year 2019, a plague has transformed almost every human into a vampire. Faced with a dwindling blood supply, the fractured dominant race plots their survival; meanwhile, a researcher works with a covert band of vampires on a way to save humankind.", "releaseYear": "2009", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/xFZH2l9UOyIclk2ZFWNHQ38B2RP.jpg", "categories": {"plot": 5.0, "acting": 5.6, "ending": 6.5, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 3.0, "funny": 7.0, "action": 5.333333333333333}, "reviews": [{"rating": "4", "text": "\"Daybreakers\" portrays the rise and fall of democracy, but in a bloody dumb way."}, {"rating": "8", "text": "I can't believe all the nitpicking about this movie. I initially did not go to see this because of what I read. I thought it was a very interesting story....a new twist for a vampire story. It was very well done from start to finish.......quality acting, well known and interesting actors. I read one comment that Sam Neil's daughter added nothing. Wrong again, it added horror and pathos to the story. I enjoyed this movie more than \"Sherlock Holmes\". This held my interest where Sherlock started to bore me. I recommend this movie to anyone who is a horror fan."}, {"rating": "8", "text": "Big, dumb and lotsa fun, Not ashamed to say I thoroughly enjoyed this late nite on TV. Some good frights, Willem Dafoe, what more could you ask for? Best consumed intoxicated, I imagine."}, {"rating": "2", "text": "A pretty bad film."}, {"rating": "3", "text": "This film was bearable. Mostly because my girlfriend gets scared in horror movies and clings to me the whole time, which is nice. Other than that, the film itself is a complete flop. Most notably, the supposed cure for vampirism is the most idiotic deux ex machina cure I have seen in a movie in some time. Also, if there are light proof military suits, then are there never any vampires out during the day? Don't they understand that it would be better to hunt humans when they would actually be outside? This movie does not verge on idiotic, it IS idiotic."}, {"rating": "7", "text": "I honestly really enjoyed this movie. but i just felt that it couldve been better as a television series on a channel such as hbo or showtime so that way it could keep the gruesome vampireness but also add to the story maybe flesh certain things out a little more and maybe stretch the original plot of the movie out a little to maybe make a first season as i felt like the movie kindave moved to fast without really explaining certain things to just move on to the next scene. also WHY THE HELL IS THE MAIN CHARACTER NAMED EDWARD! I WANTED A REAL VAMPIRE MOVIE NOT A HOMAGE TO A SPARKLY POSER!"}, {"rating": "8", "text": "I wanted to see a real vampire movie because of the Twilight invasion. And I loved it. Very hard to pick out what's bad about this movie. Finally no more embarrassing sparkly skin when in the sun. They stayed out of the sun, because they would catch on fire if they were in the sun. Interesting premise, intriguing story, Great acting, a real vampire story, and its an entertaining story and its fun. Its a bloody good time."}, {"rating": "7", "text": "Takes a bit to get into but it was actually rather good for the most part. I enjoyed it. The cast was decent ,I expected better, and the action was good. Its one of those films where you either like it or you dont and I liked it."}, {"rating": "5", "text": "the movie is enjoyable but the plot is alot weaker then i though going to see it ,the acting is not to good not much to scare you the vampiers dont really act like vampires whitch is where i though the movie really diapointed me the most. If it is a boring raining day this movie will keep you enterained for a couple hours."}, {"rating": "6", "text": "WHAT IFâ"}, {"rating": "7", "text": "This is one of those cases where the users know more than the critics, but Metacritic doesn't weigh the numbers right.  If you cull the people who don't like horror movies or are bored with vampire movies, you end up with people who see this movie for what it is:  a very imaginative variation on an old model, with high production values and fine actors, and a number of political and philosophical issues.  The plot is not without its imperfections, and at times it comes close to jumping off the plausibility track entirely.  But as a conceit of how societies get propelled by basic instincts that aren't evaluated or controlled, and lead to unexpected difficulties and political nightmares, it is a movie that provokes thought while delivering on the imaginative potential that the vampire fantasy allows.  Life vs. death as an option -- the basic vampire theme -- is often available to us in real life, for a while, anyway.  Or a better life with ethical compromises, vs. a poorer one with no such comprises.  Whole societies face those choices, and often choose the wrong option.  Sometimes societies stumble upon a cure for their ills that fixes everything,  almost by accident.  Sadly, that is more often a fantasy.  I give this movie an enthusiastic 7."}, {"rating": "8", "text": "I liked it. Nothing special but worth the time spent. I can`t possibly deny the good try that was made with the story. I must say I haven`t seen anything like it. In times when everything about vampires is 'been there done that', this flick surprised me. I also appreciated the way in which the story got by. Make no mistake - there`s lots of blood and brutality in this thing. The special effects are cool, the idea about the de-evoluted vampires also got portrayed well. Ethan Hawke and Sam Neill did a good job, with Willem Dafoe one class above them. The drama and character development behind it are as shallow as they can get, although this did not cause the film to get boring in any way. The ending is not easy to forsee but is a little dissapointing. First of all original, good action movie."}, {"rating": "7", "text": "Daybreakerâ"}, {"rating": "8", "text": "I hate vampire movies! From Dracula to Twilight I find the whole genre absurd and have never enjoyed a film that has featured vampires, until now. I chose Daybreakers, because it is a new idea in an otherwise stale genre. It's about a modern day utopian society where the bad guys have actually won! Modern society has adapted, from industry and technology to entertainment, to accommodate a society run by vampires. Humans are nearly extinct and the vampires are looking for a blood substitute to sustain their population. On the other side, the small groups of remaining humans think they may have a cure, but need some willing vampires to help them. Even though this film features vampires, it's more of a science fiction film. about two groups trying to deal with the problems of a futuristic society, and it was really well done. Ethan Hawke stars as a vampire, who refuses to drink human blood. He feels empathy for the humans and doesn't like what his race has become. Hawke was one of these young actors who had nothing but looks. When he first started he was really nothing more than eye candy for bad movies. Since then, he's really worked at becoming a better actor and today, he thrives in Sci-Fi movies like this. He's paired with some veterans of the genre, Willem Dafoe and Sam Neill, both of whom add that aged wisdom needed to support this young cast. This film is a terrific example of how innovative and entertaining science fiction can be, but it's so much more. There are action scenes, romance, and even some gore thrown into the mix, and the result is one of the best Sci-Fi film I've seen all year. The violence and blood may turn some people off to the film, but for me, this really became a can't miss gem."}, {"rating": "1", "text": "Absolutely ridiculous. This plot is heavy on symbolism, but it's still a dumb movie. Just think about it for 1 minute and you'll start wondering why they bothered to make this at all."}, {"rating": "6", "text": "Daybreakers: Everything is a Little Better With Some Sunscreen I"}, {"rating": "0", "text": "Terrible. Couldn't make it to the halfway point. No further comment is necessary."}, {"rating": "4", "text": "If all that can be delivered in Daybreakers is a metaphor of oil/blood, it has little going for it. Costumes and special effects warrant a fair kudo; ditto for action sequences. Beyond that, this film is replete with gratuitous violence, overindulgence in bloodletting as if its audience thirsts for hemoglobin with their popcorn. Add vomiting to that and we have a better metaphor for the reaction of intelligent viewers. In sum, the film sucks; ditto for the vampires. Looking for the best vampire movie? Rent Nosferatu--1979."}, {"rating": "5", "text": "Style over substance. This movie is like a Corvette with a moped engine. Looks cool and small snippets are visually stunning but overall the movie is a simple Meh on the scoreboard of fun. I didn't really want to see this movie because I did see these directors first movie \"Undead\" which is probably the worst zombie movie ever created. Dafoe's role as \"Elvis\" and Niel's role as \"the bad boss guy\" both felt contrived. The characters were so 1 dimensional you probably could guess what they were going to say before they said it, I guess cliche' would be a good way to describe. I was overall hoping that the transformed vampires deprived of blood would be more bad ass but instead they were simply caught and killed by the vampire army like it was no big deal. The story of Sam Neil's daughter was completely unnecessary. I would wait to rent it or better yet for TV."}, {"rating": "1", "text": "This movie had a halfway decent premise, and absolutely refused to deliver on it. The thematic premise posed during the opening scene is only vaguely related to the themes explored in the film. It seems to only be there for shock value. In regards to the actual thematic premise, whether to find a blood substitute or a cure for vampirism, it is addressed in only the most shallow fashion. Also, the idea that the world could completely change to the one depicted in the film in the span of only 10 years is ridiculous. Ultimately though it is character that counts and Daybreakers has some of the most thinly drawn and comical characterizations you can imagine. This would be fine if the film was pure satire, but it takes itself way to seriously and makes the viewing all the more painful. Oh and there are gratuitous scenes of violence throughout. Stay away. Far away. You'll be a better person because of it."}, {"rating": "1", "text": "Wow... blown away by terrible screenplay and terribly developed characters. NOT WORTH THE MONEY. Maybe watch it in 3 years on cable television if you are trapped at home and it is somehow the only thing on tv."}, {"rating": "8", "text": "There are a lot of strong new concepts in the movie, it's brought down a little by a few over the top bits and a ending that goes for the cliche rather than something more troubling. ...and personally I loved the bat ;)"}, {"rating": "6", "text": "Going into this movie I had low expectations and so was therefore not let down by what I saw. It was entertaining enough to keep me interested, but not so grand where I'd have to see it again. It was a cheesy B film that was predictable yet fun. I would liken it to Resident Evil 3 in terms of enjoyability."}, {"rating": "2", "text": "This movie suffers from many things: First of all, it didn't know what kind of movie it wanted to be. It wasn't scary, it wasn't gory (by today's standards), so its not a thriller. Bad Directing: There were times that the only reason i knew what was going on was because the movie followed so many tired tropes that at any point in the film, you can accurately predict what will happen next. Bad Acting: Some of the actors were so bad that I was excited to see them get mauled, only to have my hopes dashed by this disappointing, meandering, BORING film. Heck, even the ending was left open, as if they were thinking of a sequel.. Who are they kidding?"}, {"rating": "3", "text": "Like most people today, I am growing tired of vampires. The point of this film was to bring the science fiction fans into the world of vampires. However, this movie was not exactly the right choice. I'm not saying that the story was ludicrous. It has an interesting premise, but it was done in the most horrible way possible. The characters were one-dimensional, the movie was rushed, and the plot line to save humanity was weak. And that's not the half of it. The action sequences are dull and uninteresting, the visual effects gave me a headache, and the horror elements are invisible to the five senses. I found Beetlejuice more frightening than this film. Not to mention that this movie will most likely disappoint the action goers craving for an intense ride, but it will also push away teenage girls that go crazy over sexy, vexed vampires. I suggest you take your date to go see Avatar again, because this movie will only ruin your night."}, {"rating": "7", "text": "I don't see why so many people are complaining and giving this film a 1. If I ever gave a film a 1, it would have meant I got my money back after 30 minutes in...and I know these people on here did no such thing. I felt like this was a decent vampire film that featured a lot of new concepts to the vampire mythos. I went into this film with the idea of it probably being a cross between blade runner and a john carpenter film...and guess what - that's EXACTLY what it's like. The only thing I wish they would have focused on was the origin of the vampire disease and how it spread so quickly. One reviewer on here pointed out that it is \"ridiculous\" to even suggest that in 10 years time our world could reach that point. Really??? A decade is a long time...do you know how long it takes for people to catch the ebola virus? Pretty quickly upon contact...now imagine if the ebola was a walking, living thing (now THAT is scary!). However, the film concentrates on one city in a world supposidly taken over by vampires...who knows how the rest of the world is in terms of human resistance. Anyways, to sum this film up - acting was okay overall - i would have loved to have seen more from the great Sam Niell, but they did a great death scene with him at the end. Go into this movie without expectations, expect some nice concepts and you'll enjoy it. Cliche bats jumping out and such - only things I hated about the film."}, {"rating": "7", "text": "This was an enjoyable film along the lines of so many dark stylized films. The movie goes into detail and comparisons onto today's situation and where we may be heading when it comes to resources. It may not be a masterpiece, but it is a really fun way to spend a couple of hours where you can walk away with the experience and the filmaking. Ethan Hawke I feel really delivered and although Willem Defoe was really cheesy, it was the kind of performance that brings a smile to your face. Sam Neil, really played his part out however and made you feel like you were part of this world. Overall, not a terrific film especially when it comes to the ending, but it made the world believable and made you root for the protaganists in a dark and gritty world with a sense of heart....and blood."}, {"rating": "1", "text": "A good idea splattered along with the rest of the tons of fake ridiculous blood in the movie. Really a shame, faulty story, bad acting, and what on earth is wrong with the brother??? i mean seriously!!"}, {"rating": "5", "text": "Even though \"Daybreakers\" is pure fantasy........it would help if the premise it was set in was halfway believable. In less than 10 years we are led to believe that humans have virtually been wiped out and replaced by the vampires. But not even the black death,The Spanish flu, AIDS ,small pox couldn't come close to decimating the human race to such epic proportions as depicted in \"DayBreakers\". If Daybreakers was set 100 years from now then you might just have a more credible setting......but set just 10 years from now........not very credible at all. The action was okay.....but nothing not seen countless times before, but what let the film down most was the TERRIBLE.....TERRIBLE script......not even Sam Niell or Dafoe could improve things. There is most likely going to be a sequel......but please please employ somone that can write a decent script next time!"}, {"rating": "7", "text": "I thought the detail of the Vampire society was very good. The acting wasn't as bad as I've been reading, aside from some pretty cheesy lines. This isn't going to be a deep story to begin with so I had no real problem with, \"the cure\", even though I can see how someone who wasn't enjoying the first hour could be turned off by it. If your in the mood to see a good horror type movie, and don't go into it wanted to pick it apart I think you'll be thoroughly entertained."}, {"rating": "5", "text": "This movie could've had better and more entertaining ways of killing vampires, I kind of thought it sucked to with everyone a vampire and the sun was the cure to convert you back into a human lol, usually it's used to kill vampires lol, I didn't think it was the best vampire movie, From Dusk Till Dawn was way better the one with George Clooney and Qintan Tarentino not any of the other sequels though lol."}, {"rating": "7", "text": "It's an all too obvious metaphor, the CEO of a billion dollar corporation as bloodsucking vampire, but that's exactly what Charles(Sam Neill) is, quite literally. The company he runs, Bromsley Marks, seems benevolent enough; this company, a major supplier of human blood, wants to solve the world's dwindling reserves by developing a blood substitute. But just like any business, it's all about profits. The fact that human lives would be spared(the agenda which drives Edward(Ethan Hawke), a hematologist in charge of the program), becomes a secondary matter to the corporation, which shouldn't surprise this humanitarian(despite being a vampire himself), or anybody who knows how big business works. \"The Daybreakers\", in spite of its silly storyline, does make a salient point about diseases and cures, or rather, the conflict of interest that may get in the way: best exemplified in the crucial scene where Charles admits to Edward about vampirism being good for business. This rampant greed, so symptomatic in the corporate world, makes the moviegoer wonder about cancer, or AIDS, and what the drug companies would lose if such afflictions were remedied by some medical breakthrough. The film itself alludes to vampirism as a disease when Charles talks about his daughter, who had characerized this condition of post-death dynamism as such, before she went underground with the other humans. It's this same underground that Edward joins, a cell where he pioneers a conversion process requiring wine fermentation tanks, like something out of Ken Russell's \"Altered States\". Predictably, \"Daybreakers\" gets bogged down by the requisite need for action. To allow such action to take place, the film invents an alternative way to transform back to human, which doesn't really make a whole lot of sense, but is, admittedly, more cinematic than standing in line at a wine fermentation tank."}, {"rating": "7", "text": "If I'm entertained for the entire length of a movie, then that movie is a success for me. This movie was entertaining. If you don't like gore, however, stay away. I thought the gore was funny and found myself laughing when heads and bodies were exploding. The directors love gore so much they had a slow-motion scene in the movie's goriest moment showing bodies flying through the air! Hilarious! I do feel, however, that the movie would have benefited from someone other than Ethan Hawke in the title role. He was too one-note and looked on the verge of crying the entire movie. A good \"B\" film!"}, {"rating": "5", "text": "Interesting premise, absurd fix. How does the sun cure their vampireness? Maybe I didn't pay enough attention to the movie, but I liked it as a vampire movie up until that point. And to think, I thought Willem Dafoe would only improve upon this one."}, {"rating": "6", "text": "In this movie vampires have taken over and the human race is almost extinct leading to a blood shortage, if a blood substitute or a cure isn't found soon the vampires will turn into even more horrible bat like creatures, yeah it's as goofy as it sounds, and it ends up being an ok movie that most vampire maniacs will enjoy but for everyone else, it's an ok movie from beginning to end."}, {"rating": "6", "text": "Daybreakers has an interesting sci-fi/fantasy premise - as the result of a virus, vampires become the dominant species on the planet, and struggle to survive once the remaining human population, and their life-giving blood supply begins to dwindle. The film has satisfying and effectively moody visuals and good direction from the Australian Spierig Brothers. In the lead role as a vampire scientist searching for a human blood substitute to feed the starving vampire population, Ethan Hawke us just how consistent his performances are, and Sam Neill keeps your attention, with a quiet menace about his character, who's basically a vampiric bureaucrat. And of course, it goes without saying that Willem Dafoe looks cool with a goatee on his face and a crossbow slung over his shoulder. The film, as a new take on the vampire myth with a satirical edge that comments on world energy crises is, for the most part, far better than it has to be. It does have a disappointing finale, issues with pacing, particularly when we spend any amount of time away from the cool vampire world and with the dull, depressing humans, and there's the odd bit of clunky dialogue. The explanation of one of the key plot points is also incredibly unsatisfying. For what it is though, Daybreakers is a decent example - it doesn't bring many new ideas to the table, sure, but just about everything is done well, and I enjoyed it far more than another recent modern take on a vampire film - 30 Days of Night. There's potential for expansion of this intriguing world in a sequel too, but whether this will manifest at all, or as anything beyond a direct-to-DVD feature remains to be seen."}, {"rating": "5", "text": "I watched Daybreakers rather reluctantly due the average critical reception it received at release and after watching last night I indeed can confirm how average the movie was from its production values to its entertainment value. Daybreakers has onboard some good actors with a some what different take on the future of vampires, but unfortunately neither the actors nor the story premise are very interesting to watch. The characters are pretty one dimensional and fail to make us care. Was there a love story between two characters in this movie? Was it a friendship? I after watching I'm not sure. In the end of the movie did I care to the outcome of the characters dilemma? Kinda i guess, but I wasnt sure. As the screenplay plays out it feels awkward and muddled; and some of the editing during scenes feels unnatural. The vampire theme in movies has been used a lot now, A LOT, and as I mentioned earlier the premise seems interesting at first but the film makers don't do a lot with it and in the end isn't particularly bad but hardly memorable either. I give Daybreakers a 5/10, it does exist, it is watchable, but is average - not particularly bad, but not good either."}, {"rating": "5", "text": "It was definently interesting but overall a boring film. It also lacks originality as well. The cast is ok but I am a bit disapointing that Hawke wasnt better in this film. A little disapointing overall imo."}, {"rating": "7", "text": "With some pretty solid world-building on the part of the Spierig brothers, and an incredibly engrossing slew of sci-fi/horror visual effects, \"Daybreakers\" thankfully restores some faith to the vampire film sub-genre."}, {"rating": "6", "text": "A total surprise! I have consistently been dumbfounded by the vampire craze in movies and television as of late, but then a small film like Daybreakers came along in a month like January, and I found myself wanting to take back all my preconceptions. Daybreakers is so much fun! It's amazing concept that executed with style."}, {"rating": "8", "text": "Daybreakers had an interesting story and at the end it was one of the best vampire movie i have ever seen.There is a lot of blood and the actors are really good.The only dumb thing is the cure,like if the sun would help them."}, {"rating": "7", "text": "Well, this film does not offer the frightful vampires we all come to love.  It does, however, add a nice little cog into the vampire machine.  It's a keeper."}, {"rating": "5", "text": "The more interesting questions about the morality of this world with themes like genocide, economical consequences or the meaning of humanity are present throughout the story, but sadly almost discarded towards the end when Daybreakers just becomes what it didn’t seem to be for most of the time: just another vampire movie."}, {"rating": "8", "text": "Film of the classic vampire genre that does not offer much more than the myriad of films of the same genre, however the film is beautiful and entertains a lot giving us a good world dominated by vampires. The only particularly visible flaw sevondo me is that the final with the half twist is a bit pulled away and not well cared for."}], "recommendations": ["priest", "world_war_z", "the_girl_with_all_the_gifts", "30_days_of_night", "surrogates", "the_last_days_on_mars", "pandorum", "the_tomorrow_war", "28_days_later", "abraham_lincoln_vampire_hunter", "underworld_blood_wars", "chernobyl_diaries", "splice", "the_last_witch_hunter", "brightburn", "devil", "underworld", "i_am_legend", "underworld_awakening", "monsters", "riddick", "the_darkest_hour", "dark_skies", "army_of_the_dead", "lucy"]}