{"id": 3372, "title": "Daylight", "starring": ["Sylvester Stallone", "Amy Brenneman"], "runtime": 115, "genre": ["Action", "Adventure", "Thriller"], "description": "A group of armed robbers fleeing the police head for the New Jersey Tunnel and run right into trucks transporting toxic waste. The spectacular explosion that follows results in both ends of the tunnel collapsing and the handful of people who survived the explosion are now in peril. Kit Latura is the only man with the skill and knowledge to lead the band of survivors out of the tunnel before the structure collapses.", "releaseYear": "1996", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/omw7K0L6qArF87zv7qDjjVysyev.jpg", "categories": {"plot": 6.0, "acting": 5.0, "ending": 5.0, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 5.0, "funny": 5.0, "action": 5.0}, "reviews": [{"rating": "6", "text": "Your On Demand Cable Guide may categorize this as a \"horror film\". Mine did. But, it's not, and I'm thankful. It's a suspense film, aka, a thriller. This is kidnap story done sans the clichés, meaning, it's done slow and methodically, like peeling back the layers of an onion. A married couple working through some issues pick up a hitchhiker and the movie ensues. The hitchhiker isn't working alone, and his isnt too stable either. One minute he's compassionate, the next minute he's ruthless. Is he going to find \"faith\"? Is he going to reject mercy? You never know if he and his partner in crime are going to \"turn a new leaf\" and become \"the good guys\" or if they're going to follow the traditional knife-wielding route and be killers. The score compliments the vibe here well, and the length of the movie is just right. Any longer would run the risk of filler. It's worth a rent, but I think that's all one can do as I don't see it available on Blu-ray anywhere."}], "recommendations": ["identity", "escape_room_tournament_of_champions", "vehicle_19", "the_rental", "21_bridges", "cellular", "the_crazies", "the_purge_anarchy", "i_see_you", "the_call", "the_hurricane_heist", "the_purge", "vacancy", "secret_window", "alone", "28_weeks_later", "paranormal_activity_the_marked_ones", "evil_eye", "the_autopsy_of_jane_doe", "texas_chainsaw_3d", "the_toll", "reasonable_doubt", "limitless", "spiral_from_the_book_of_saw", "the_forest"]}