{
  "id": 4801,
  "title": "Days of Thunder",
  "starring": [
    "Tom Cruise",
    "Robert Duvall"
  ],
  "runtime": 107,
  "genre": [
    "Adventure",
    "Action",
    "Drama"
  ],
  "description": "Talented but unproven stock car driver Cole Trickle gets a break and with the guidance of veteran Harry Hogge turns heads on the track. The young hotshot develops a rivalry with a fellow racer that threatens his career when the two smash their cars. But with the help of his doctor, Cole just might overcome his injuries-- and his fear.",
  "releaseYear": "1990",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/4kHzXHRJGcRxxRvkCvb5yTxZwml.jpg",
  "categories": {
    "plot": 4.0,
    "acting": 4.75,
    "ending": 5.0,
    "soundtrack": 8.0,
    "cinematography": 5.0,
    "familyFriendly": 5.0,
    "funny": 5.0,
    "action": 4.5
  },
  "reviews": [
    {
      "rating": "7",
      "text": "The long-awaited sequel to Top Gun has apparently already been made; it is titled \"Days of Thunder\". Essentially, Pete \"Maverick\" Mitchell has become Cole Trickle and a NASCAR driver. That is honestly the only difference between the two films. As such, this one is incredibly enjoyable. The racing scenes are intense and very well done. The characters, much like Top Gun, are enjoyable and though quite generic, they are pretty well put together. But, sure, the similarities to Top Gun do hurt it because they did just take the same plotlines and re-do them, but since Top Gun is absolutely hysterical and over-the-top enjoyable, so is Days of Thunder. Plus, even as a non-NASCAR fan, I truly believe it was a great portrayal of racing and racers. For that, Days of Thunder is nowhere near as bad as many say it is, rather it is a very good popcorn flick that entertains in spades."
    },
    {
      "rating": "10",
      "text": "If you're a NASCAR fan it may just be the best movie you've ever seen."
    },
    {
      "rating": "5",
      "text": "A half-decent Top Gun rehash about boofheads and the dumbest sport going around."
    },
    {
      "rating": "8",
      "text": "I enjoyed watching this movie, it felt like top gun on wheels, the lighting in some of the scenes was vary well orchestrated in this movie, especially in the garage scenes love to see the shadows and effects of the light through the fans, the music from Hans Zimmer is pretty well done as well, there is some flaws with the movie, but the acting from tom cruise, Robert Duvall, Randy Quaid, is pretty solid, I thought Nicole Kidmans accent was not fooling anyone, but honestly the movie was fairly entertaining to watch the story was well put together."
    },
    {
      "rating": "3",
      "text": "Faire un film sur le Nascar (le naze-car) c'est déjà partir avec un handicap lourd, car qu'est-ce que le Nascar sinon qu'une bande de bourrins qui tournent en rond comme des cons sur des \"circuits\" dessinés par des enfants en maternelle ?Cela dit, loin de l'idée d'arrondir les angles, Jours de tonnerre en rajoute des couches bien épaisses dans la caricature (involontaire ?...) du sport des beaufs amerlocains et en fait un Topgun avec des bagnoles et bien sûr le même petit con, très à l'aise dans son rôle de petit con, le petit Tom Croûte !Insupportable fanfaron et en même temps un vrai cave qui ne sait même pas ce que sous-virage ou survirage veulent dire (sic ! je n'invente rien) tandis que les courses sont (heureusement poour une fois) réduites à ce qui en fait l'intérêt (?) à savoir les carambolages des débiles dans de grands panaches de fumée (Topgun, tu vois ?).En fait, seuls Michael Rooker et Robert Duvall sortent leur épingle de ce jeu de dupes, les seuls à avoir compris la bouffonnerie non assumée du film, les seuls à l'exploiter assez subtilement à l'insu des scénaristes et du réalisateur lui-même, Tony Scott, qui délivre tout de même une mise en scène assez dynamique pour nous maintenir éveillés.Ce qui n'empêche pas naturellement le passage obligé à la guimauve obligatoire, l'amourette pathétique entre Crouze et Kidman, parce qu'il fallait bien une présence féminine dans ce monde de beaufs... sans mentionner la période de \"doute\" après l'accident, le passage de témoin du \"pilaute\" vétéran au jeune con, puis le doute du jeune con -le héros pardon !- qui retrouve ensuite son \"héroïsme\" tandis qu'il met pied dedans en criant \"hihaaa\" et fonce à travers le rideau de fumée du crash.Et la musique dans tout ce fourbis, mes aïeux ! de la bouillie des années 80 signée Hans Zimmer ! je dis : meeerde.On a donc quelques crashs et quelques répliques comme \"la poussette...\" et \"je le fous dans le mur direct\". Involontairement ou pas, le film a raté sa vocation de comédie satirique, seule voie de sortie négociable pour se rétamer dans le premier degré au ras du bitume."
    },
    {
      "rating": "5",
      "text": "I heard Tarantino loves this, he introduced me to Switchblade Sisters so i always give an audience.  The director made Top Gun with Cruise a few years before. Ebert wrote a hilarious review including a template for Tom Cruise, including the wise older woman and an arena to grow in, awesome.  This movie had more corn than a large with extra butter.  I could not make 20 minutes it was just too much."
    },
    {
      "rating": "2",
      "text": "a big chunk of mess..Days of ThunderScott's race track leads to nothing but a brutal accident that is occurred because of the driver itself. It had a linear lane to follow and yet it still somehow managed to go off the track for the most part of the feature. It is a misconceived act. This is a big chunk of mess. And it's not that it couldn't have been repaired, it's just that the storyline itself was dull enough to rot out the emotions, it never had the chance. Despite of being an exhilarating and nail biting sport, the feature isn't cinematic at all. The chills and thrills that you hope that you are about to receive, even that too is in shortage.It is eerily shot with confused amateur cheesy camera work that looks like a cheap television movie that wasn't funded properly. As far as narration is concerned, it is poorly crafted and loosely constructed for it to stand on any whatsoever ground. On terms of performance, the actors aren't given that much room and the ones that are given, aren't sensible enough for them to be convincing. Cruise that as usual loves to be on the driver's seat, this time feels weak since he isn't focused on his own track. The supporting cast like Kidman, Duvall and Rooker, too fails miserably on holding on to their characters.Daft editing and Towne's benign and questionable screenplay works like anchor and undermines the somewhat decent, even though familiar, concept. Scott's execution also deserve to be put on stand in here, his fatal attempts of delivering a highly pitched dramatic concept seems obvious since he fails to shot even a normal conversation, it is inedible and uncomfortable. Days Of Thunder is long, hard and hectic days, these are the days that not only audience wishes it to go away, but by the end, makers and actors too are on the same boat."
    }
  ]
}