{
  "id": 1347,
  "title": "Dead Silence",
  "starring": [
    "Ryan Kwanten",
    "Amber Valletta"
  ],
  "runtime": 89,
  "genre": [
    "Horror"
  ],
  "description": "Jamie returns to his hometown in search of answers to his wife's murder, which occurred after receiving a weird package containing a ventriloquist dummy named Billy, which may be linked to the legend of ventriloquist Mary Shaw. Destined to find out the truth, Jamie goes to the town of Raven's Fair, where Shaw used to perform and is buried. But Jamie is in for more than he expected.",
  "releaseYear": "2007",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/jovXaCasPvShaQbN8VgS9QkAmo3.jpg",
  "categories": {
    "plot": 5.72,
    "acting": 4.636363636363637,
    "ending": 5.166666666666667,
    "soundtrack": 8.0,
    "cinematography": 4.5,
    "familyFriendly": 3.0,
    "funny": 5.0,
    "action": 3.0
  },
  "reviews": [
    {
      "rating": "6",
      "text": "Not as bad as people made it out to be. Fantastic twist at the end. Kind of scary. It will sruprise you how everything is set up. Great for watching it with the girlfriend."
    },
    {
      "rating": "0",
      "text": "It was pretty terrible. Too much like any other generic straight to dvd horror film and wasnt all that interesting and it wasnt even scary either. I was disapointed."
    },
    {
      "rating": "1",
      "text": "I was the type of horror movie done over and over. Where the viewer should be surprised, there is often disappointment. The main character was dull, and the plot line even more so. The ending was supposed to shock, but I just looked down and thought, \"I wasted a thing of Popcorn on this?\""
    },
    {
      "rating": "6",
      "text": "James Wan sets up a few good scares to go along with the uneasy atmosphere here. I don't know what it is but he apparently likes using dead, creepy old ladies in his horror movies. To go along with the scary looking old lady there are plenty of unsettling ventriloquist dummies around. Both bring quite a few good scares thanks to how unpleasant they all look.\r The story itself isn't too bad. I just wish it was a little more fleshed out. The characters in the small town are quite interesting, each of them with their own unique quirks. It's a shame we get to watch them make so many dumb decisions. Overall I just wanted more from both aspects. Honestly had this have been a TV show where we could have spent more time in it's unique setting and learned more about it's characters I would have loved that. As it stands the whole thing feels like there could have been more going on. I just wish there was more to the mystery at hand.\r If you're looking for some good scares then yeah you should check this out. It fails to deliver fully on it's unique story and characters, but still provides some decent frights. It might not stick with you long, but James Wan once again makes one of the better horror flicks I've watched. So if you're looking for some decent scares then pick this one up. There are plenty of creepy ventriloquist dummies and one terrifying old lady who are ready to deliver. My total score for it is a 6.5/10."
    },
    {
      "rating": "0",
      "text": "The movie had a promising start. But after that, it became boring. You a horror movie, that's boring. The atmosphere wasn't there, it wasn't scary. The twist at the end, wasn't enough to save this movie."
    },
    {
      "rating": "6",
      "text": "Deutsche Review - Kritik\r Der folgende Test ist in 5 Kategorien zusammengefasst. Diese 5 Kartegorien ergeben die Gesamtpunktzahl von 0 - 100 Punkten. Um einen passenden Userscore zu geben wird auf oder abgerundet. Bei 84 Punkten ergibt das einen User Score von 8. Bei 86 einen von Userscore von 9. Falls eine 85 kommt entscheide ich ob ich es eher positiv oder negativ nehme. Regeln verstanden?\rDann sind hier meine Punkte.\r Story = 12/20\rFiguren = 15/20\rSound = 12/20\rBild/ Set = 13/20\rLänge = 9/20\r Mein persönlicher Score = 61/100\rMein User Score = 6/10\r Lohnenswert? = Kann man mal schauen.\rFortsetzung erwünscht? = Eher nicht."
    },
    {
      "rating": "8",
      "text": "I don't usually get scared by movies, but this one was spooky. I actually liked it better than the Saw movies, which are making me sick already."
    },
    {
      "rating": "0",
      "text": "A simply stupid film. Repetitive, boring, and not even amusing in its stupidity. Very bad."
    },
    {
      "rating": "10",
      "text": "Dead Silence is an actual horror movie that is scary and effective!"
    },
    {
      "rating": "8",
      "text": "Relied more on atmosphere than plot, which ended up raising the movie above all the other horror fodder that's out there now.... despite the lame twist at the end."
    },
    {
      "rating": "0",
      "text": "This film had no redeeming qualities...the rhyme was annoying (can 'Shaw' and 'dolls' even be considered slant rhyme?), the acting was probably the most horrific aspect of this movie...and I'm not certain that the directors have been in an actual graveyard--most of the tombstones would read 'Betty' or 'Fred' with no last name or date. Also, Mary Shaw's grave was in pristine condition, even though she had died like 50 years earlier and her headstone was covered in these weird cockleburr-type things--a setting needs realistic details, otherwise, it's just a distraction. Those \"atmospheric effects\" were like trying to watch a movie through a dang smokescreen--if you plan on watching this, invest in some good glasses."
    },
    {
      "rating": "1",
      "text": "I like the Saw movies, but Dead Silence is terrible. The idea to telegraph the scary parts by making everything go absolutely silent was cool, and earns the movie one point. Otherwise, it's easily one of the worst movies I have ever seen."
    },
    {
      "rating": "6",
      "text": "The movie wasn't anything beyond amazing, nor good. It couldn't do anything but remind me of 'Bogeyman'. That's all this film reminded me of. Couldn't tell you why, but it did. The movie has no major scares. Of course, a twist."
    },
    {
      "rating": "10",
      "text": "I don't give a crap what the critics say, I thought the movie had its scary moments and as always in any of James Wan's movies there is a great twist."
    },
    {
      "rating": "6",
      "text": "Pretty decent horror movie. James Wan (Saw 1) is a really good director who can really build to some great scares. Unfortunately, he's working with a pretty dumb script and scenario, and the movie can't escape its \"B-movie\" feel. The twist ending at the end is REALLY stretching it, although I'll praise it for being, at least, unique. Still, the movie itself feels a little slow at times, James Wan yet again reverts to the \"clowns are scary\" technique to scare people (they're not scary.) and there aren't really many likable characters here. Still...decent horror movie. I would have been disappointed if I saw it in a theater but it makes pretty decent DVD entertainment."
    },
    {
      "rating": "8",
      "text": "Ever since I first heard that this movie was done by the writers and directors of the Saw trilogy, I have been waiting to see it. Even though it was no Saw, I still enjoyed this film. They had some great scares, and the ending was very unexpected. For people who were looking for tons of gore, your going to be dissapointed, however this ghost story will keep you covering you eyes and holding onto the person besdie you. Overall I enjoyed this film, and if anyone wants to see a decent horror film, I would suggest this one."
    },
    {
      "rating": "9",
      "text": "I don't get the people who watch, movies. I mean seriously, you got here a movie that is creepy, spooky, and its the best it can do with a doll type series, not like Chucky. It's not Saw its just PRODUCERS From SAW. You get what you want in this movie, I think its totally creepy, if just see it, geesh, never seen a movie like this before, the only reason I don't give it a 10 is I don;t like endings like that. But with all the dumb movies out anymore a bunch of kiddie movies that are funny or so, or some lame idea, you got a real freak zone and still, people whine about it not being like another movie its freaky. Eyes moving I mean what more do you people want! I am not being harsh or mean i just dont' get critices or people, too much people judge movies, because its not like another movie, if you exspect a movie to be creepy or a doll like or ghostly or about dolls thats what your gonna goet if you go into the movies to see what its producers did in another movie or your soo picky then i don't know what to say. This movie is too freaky, and to creepy it was all it asked in my book, but of course the VERY best movies people hate the dumb movies people love. I mean seriously do I have to write a very lame story to make people read than a really, good idea and freaky plots and get hated. I love this movie, you all can hate it or have a big issue with it all, I didn;'t like is the ending. I don't like bad winning. But the rest RULES."
    },
    {
      "rating": "9",
      "text": "The acting had me in stitches. As did the dolls. It's kind of a Chucky meets Nightmare on Elm St. But I liked it! It even made me jump once, which movies never do. The ending was... imaginative... think that's the nicest way of putting it! It was a big twist, but one of those silly ones that tries to make you go \"ooooh!\", unfortunately it didn't quite work that way.. Rather than being shocked by the ending, I was amused to see how far the writers had stretched it. Nonetheless, I thought it was a great film and will be watching it again! Although I'm yet to figure out why I enjoyed it so much.."
    },
    {
      "rating": "1",
      "text": "James Wan should never direct, he should go back to his day job, and not get into movie indsutry."
    },
    {
      "rating": "3",
      "text": "The movie could have easily taken a turn as a throwback/satire of all those old, terrible horror conventions, and it most likely would have been better if it had. Look at all the most generic aspects of the horror genre (or at least the oldest, and, now, never really used any more): a mysterious package with no sender listed; constant, inexplicable lightning and thunder that appears even though there was no previous signs of even rain falling; a weird hotel room and cemetery; a dusty, cob-web filled (and of course cavernous) theatre (which would normally have been a mansion in other cases); and of course a town lynching and the vengeful spirit that comes as a result. Not to mention horrific acting-- a must. However, unfortunately, the movie was fully meant to be taken seriously, and, as a result, was pretty much insufferable except for a few minutes of footage every now and then. The beginning was undeniably the worst part, due mostly to the atrocious pacing and poor writing that seems to have been just hastily thrown together for that scene to exist and set up the following \"plot.\" And from then on, the pacing is just as uneven throughout most of the movie until you reach the flashback-- which, by the way, was the only intriguing part of the movie, along with a few minutes that followed it-- which was paced and filmed well (or maybe it was all just relative, compared to what we just had to sit through). The pace didn't stay completely even after that for very long, but it was still much improved. The dialogue-- sorry New York Post-- WAS terrible, in all cases, and was (in my opinion) probably the main reason Wahlberg did such a bad job with the part. It's like the Star Wars Prequel Effect-- actors who have proven that they can do a good job are given horrific dialogue, and their performance is reduced exponentially. The only reason to attribute this movie a 3 is because of the minor jump-scene scares it elicited (but only on a 50% mark), cinematography which deserves a much better movie to go with it, and the fact that there were points in the movie where I was somewhat interested in what happened (though that amounts to maybe 15 minutes of screen time in a 90 minute movie). As for the \"twist\"-- well at least it was SOMEWHAT contextual to the plot, unlike the first Saw's-- which, really, wasn't a twist at all and added absolutely nothing to the movie whatsoever. However, the twist still didn't really have to much effect on the plot. And given the fact that it was such a terrible movie up to that point, and the fact that we had basically already suspended all disbelief (most likely due to brain cells shutting down)-- it wasn't terrible, just about 95% illogical. The only other thing I can say the movie had going for it, was the fact that the innovators of the splat-pack did manage to make a horror movie that didn't rely on gore, and actually built minor tension every now and then. That, and this was an incredibly tame \"R\" movie, even more so when looking at the people behind it. And Calvin H., sorry the twist wasn't great-- just because you can't see a twist coming doesn't mean it's good (especially when they don't even add much to the movie)-- in fact, if you have absolutely no idea about a twist, it's likely a bad one, since a good twist will still leave evidence along the way (and no, three seconds of cumulative footage \"explaining\" the twist does not count as laying evidence-- please go watch Shyamalan movies or, if you thought this twist was good, you might enjoy even the predictable twist in Se7en). And Norm D. (I'm on a roll here), no, you seem to be one of the few people who hasn't seen this doen a million times before, and can't seem to recognize that all the things you're saying are basically untrue. This \"freaky idea\" would barely even hold up as a Supernatural episode. And in terms of what more do we want than \"eyes moving\"? Are you serious? I'm a sixteen year old boy who has a horror fix, and I can still basically see all these things you somehow can't. I honestly hope you're a 10 year old who wants to see grown up movies (which I also would hope accounts for your atrocious writing). So for anyone actually reading this, it does work as a cheap horror fix, but I would strongly suggest other movies to help out the fix: The Descent, which is undoubtedly one of the greatest horror movies to come out in quite some time; 28 Weeks Later, one hell of an incredible thrill ride; even guilty pleasures like Hostel, which at least is well shot, pretty well acted, and at least has a smart script (or themes to it, if you'd rather). So I would generally reccommend against this movie, even to those who think it'll be scary because of the doll-- the eyes moving, head turning schtick gets old pretty quickly, sicne that's about the only gimmick they employ. Honestly, I had realized this was going to suck utterly, but I had expected some good scares given the premise. Unfortunately, no."
    },
    {
      "rating": "6",
      "text": "this movie was certainly not bad, most reviews i read said leave this movie alone, well thats just not the case, the story isn't very good but moves along nicely, as for scares well thats what this movie does well ur be behind ur pillow quite a few times. and the lighting looked quite nice in this movie, i dont normally notice but i did with this one.  not as good as the first saw but probably better than the rest."
    },
    {
      "rating": "7",
      "text": "I watched this movie as an ongoing look into what the director of SAW did after his first Masterpiece Horror. If you have ever seen the chucky films like myself and laughed your ass off at them cause they were so stupid then this one might open your eyes another ways. The film follows A man who gets a puppet as a gift    and it ends up killing his wife and the whole film is him trying to prove his innocence that he did not kill his wife along with discovering the dark secrets of the puppet and its owner. The movie is called Dead Silence as the puppet only strikes when there is total quiet, which works VERY well with the suspense of the film. Like the saw film it ties most things up at the end with a very UNEXPECTED twist.Fans of SAW and those who want a decent version of CHUCKY should like this filmPeople scared of PUPPETS,CLOWNS and OLD SCARY WOMEN should lock their doors and try not to think about the movie at all"
    },
    {
      "rating": "9",
      "text": "I do not remember liking this film the first few times I watched it but now that I've paid a little more attention to it I've thoroughly enjoyed it! Anyone who has a fear of creepy dolls will be in a living hell that's for sure as Jamie investigates his girlfriend's death and the suspicious doll that turned up when it happened. It goes at a good pace but really picks up towards the end for one hell of an ending that I can't believe I forgot :P Overall a solid Horror film worth a look!"
    },
    {
      "rating": "4",
      "text": "\"Remember: whatever happens, don't scream.\"\r I like Horror-Mystery movies..but this is..bad.I don't know but i didn't like this movie.Seriously, i can't watch this movie again, is borinnggggggg."
    },
    {
      "rating": "1",
      "text": "Terrible movie. Oddly coming from the guys behind Saw, Insidious and the Conjuring, this film is more unintentionally goofy than scary and offers more laughs than scares."
    },
    {
      "rating": "7",
      "text": "Scary! A horror movie involving PUPPETS. Almost as scary as clowns. This movie was not perfect. Certainly not flawless. But it Is scary. Maybe a little too scary. Very unique, and made in a way that will keep you watching, I can't say you won't look away I few times. Cause again it involves... ugh... \"those things\"."
    },
    {
      "rating": "7",
      "text": "All of James Wan's movies have different tones, but this one was by far the strangest. Nevertheless, I enjoyed this weird horror movie. It had a couple very effective jump scares and a lot of good tension. This plot was very weird and crazy, but it was simple and interesting. The twist at the end, though, was pretty unnecessary which I didn't particularly like. I recommend this one if you like Wan's other films."
    },
    {
      "rating": "5",
      "text": "This horror movie doesn't really feel like a horror movie. While the main character is likeable, the story is awkward, long, and boring. This is really a mystery, and if this was scobby doo, I actually would have really liked it."
    },
    {
      "rating": "6",
      "text": "Dead Silence gets by on its style alone. The visuals are artful and expertly shot. It is worth watching for the visual design (if you appreciate that kind of thing), despite the thin plot line."
    },
    {
      "rating": "7",
      "text": "What I liked the most about this movie was its history, a great story for this movie which is a bit loose thanks to the bad atmosphere of this, it was thought as a horror movie but what we got was a movie of the suspense type Which I do not finish convincing many.The film will keep you hooked from its inception as Jamie Ashen tries to discover who was responsible for the death of his wife, investigating the corpse of Mary Shaw because according to Jamie was thanks to her the death of his wife, I recommend 7/10"
    },
    {
      "rating": "5",
      "text": "This film takes advantage of the world of ventriloquism to make horror. It is not a totally new idea, but it worked quite well, if we want to believe that a famous ventriloquist was in fact the reason why a city lived its golden era, as the film ends up suggesting.The script begins with the mysterious death of a woman shortly after receiving a box at her home, without address, containing an old ventriloquist doll. While the police regards him as a suspect, her husband returns to his father's house, in a city where there is an old legend about ventriloquist dolls, in which they are truly evil. It's not a complicated story, and it has a lot of logic flaws and unbelievable situations, but it works decently if we don't start thinking too much about it.The cast is led by Ryan Kwanten, and he is good enough for the job. Donnie Wahlberg also makes a very good contribution, although his character looks really stupid. Bob Gunton and Laura Regan helped a lot in what was possible, but there was little for them to do here. Judith Roberts was quite good in her role, but it was not the right movie for her to shine.Directed by James Wan, director with very solid predicates in the horror genre, the film does not fail to build a pleasant tension and plays quite well with the mystery. Despite this, it is not scary enough and many of the scares are predictable or rudimentary. Elegant cinematography, somber at the right times, and good visual and sound effects were important elements in the construction of dramatic tension."
    },
    {
      "rating": "6",
      "text": "This film feels like a precursor to Malignant in that it focuses on a familiar premise (creepy dolls/a cool looking slasher) and goes through with taking itself seriously. Throw in a stupid but fun twist that makes no sense at all and you've got Dead Silence, a feature film version of that one episode of Goosebumps with that ventriloquist dummy (+ ghosts!). Maybe it helps that I'm deadly afraid of anything that comes close to a doll but I found this to be a creepy/fun and entertaining time (with a few beers of course)."
    },
    {
      "rating": "7",
      "text": "I remember watching some scenes of this movie when I was a child. I got scared that time. Today, I watched the full movie and I think the movie was scary and dramatic but the story had more potential.It had good story and genuine horrifying and remarkably different scenes. However, I was little bit disappointed with the movie. The story had a lot of potential and I expected too much after knowing that it was directed by James Wan. The execution was also not thay good, it was very simple. The acting was normal, nothing great about it. Some good things about this movie were the setting of spooky environment and some good scary scenes.Overall, the movie was good. You will get entertained but it feels like movie is missing some kick."
    },
    {
      "rating": "8",
      "text": "I'm absolutely captivated. I don't like horror movies, but The Ominous Silence grabbed me immediately, mainly because of the perfect intro and the excellent music that accompanies the film. Add to that the idea of the doll, the cool locations with impeccable atmosphere and especially the incredible reveal at the end. For me, a great horror film that I recommend."
    },
    {
      "rating": "6",
      "text": "Town that killed a ventriloquist are in trouble when she comes back to cut out the tongues from all those who killed her and their extended families."
    }
  ]
}