{"id": 345, "title": "Deadpool 2", "starring": ["Ryan Reynolds", "Josh Brolin"], "runtime": 120, "genre": ["Action", "Comedy", "Adventure"], "description": "Wisecracking mercenary Deadpool battles the evil and powerful Cable and other bad guys to save a boy's life.", "releaseYear": "2018", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/to0spRl1CMDvyUbOnbb4fTk3VAd.jpg", "categories": {"plot": 8.07843137254902, "acting": 7.9523809523809526, "ending": 7.8, "soundtrack": 8.5, "cinematography": 5.0, "familyFriendly": 3.0, "funny": 8.094594594594595, "action": 8.035714285714286}, "reviews": [{"rating": "10", "text": "Simply better than the first movie, and even better than Infinity War in my opinion, great movie, great over the top FX, great story with unexpected twists, hilarious jokes and very positively surprised!"}, {"rating": "9", "text": "Overall, Deadpool is a hilarious, over the top, self aware movie that has the best after credits scene i have ever watched. With the pressure of making a movie better than the 2016 adaptation, i could tell they wanted to make it more everything than the first movie, and it most ways they did. The gore is kicked up a notch, the humor is on point, and i never got bored when watching this movie. The cast did a great job brining their characters to the big screen. Most especially domino, Zazi beetz does a great job playing the lucky badass all throughout the movie. Its great to see colossus and negasonic teenage warhead back but i feel like i could've seen a little more of her. But cable is in a league of his own. Josh brolin does an amazing job playing the badass super soldier. But the one thing this movie has a problem with is its mood and pacing, at some points it tries to be romantic but it just made me feel awkward watching this with my parents next to me. same thing with the pacing at times. But those are just small points that dont affect how i feel about this movie and i believe deadpool 2 was well worth the wait and was everything i wanted the movie to be and more. But is it better than the first? In my opinion it is in most ways, but i feel like their are more iconic scenes in the first deadpool than in the second. But no matter what i say, If you have the time, i highly recomend you watch this over the top \"family\" movie."}, {"rating": "8", "text": "Ryan Reynolds has made a career for himself by playing Ryan Reynolds in literally every movie he's ever been in. And by being handsome. Mostly the handsome thing. It never won him much critical praise though until he started playing the character of Deadpool. Who, as the comics will tell you, is actually just Ryan Reynolds. So kudos to him for finally finding a way to make that work and getting that superhero franchise he's tried umpteen times for.Deadpool 2 is more of the same with tons of callbacks to the previous film. I kind of wish they would ditch the sentimentality and just go full on superhero farce already. The cliché emotional stuff with Morena Baccarin is easily the least interesting part of the whole thing. The movie is at it's best when it's delivering more of the crude, irreverent humor and gleefully gratuitous violence of it's predecessor. Luckily, that's what it spends most of it's time doing.Nearly every bit of pop culture you could think of gets skewered here. Especially other superhero movies. Deadpool once again did a way better job of having the characters operate like the do in the comics than any of the main X-Men films ever have. Even to the point of fixing another tragically mishandled fan-favorite villain. It's also still very refreshing to experience a superhero film make such liberal use of gore, heavy profanity, and killing. Let's hope Disney and Marvel take some notes from what Fox was able to achieve by making R-rated cape and costume flicks now that they've recovered their long absent mutants. Oh, and that they keep Reynolds around.Deadpool 2 doesn't really take it's title character in any new directions or branch out from what the previous film did much at all. And it didn't really need to. The first Deadpool was such a breath of fresh air (even in spite of sticking close to origin story conventions) that a second helping feels like exactly what we needed. Especially since round two might actually be a bit funnier. Let's also not forget how it's one of the best Fox movies at doing the comics justice. Even the X-Men films I've really liked have managed to butcher a character in one way or another. Deadpool 2 gets them all right and limits it's use of the overexposed Wolverine to a few well-placed jokes.8.6/10"}, {"rating": "10", "text": "I didn't expect a film as good as the first one, and in some ways it wasn't - a few gags were overcooked (notably the 'proposition' one - but for most of the running time my wife and I were laughing constantly and loving the action. Very close to GotG as the best \"funny\" Marvel movie to date."}, {"rating": "8", "text": "All the pre-screening reviews: don't believe any of 'em. Fox did an awesome job making sure the finalized cut released to the public is rock solid (unlike, you know, DC/Warner Bros.). I will say this: I think this one is better than the first. It's very entertaining, with all the layers of humor and quips we expect from Deadpool. If you have any interest at all, it's totally worth the money."}, {"rating": "10", "text": "Action packed and funnay A.F!  Many nods to various Heroes and villains in the Marvel universe.  Biggest complaint is the first quarter is a bit slow...  But picks up fast.  If your a fan of the first movie see it!"}, {"rating": "9", "text": "Deadpool is its own genre of movie - action/comedy/commentary, oh, and foul, foul language, my god, it's like over the top with the most foul of them. So though it's an \"R\", there should be a lower limit of age 14 due to language and so much massive amounts of gratuitous death and dismemberment. Seriously, there's a portion of the public that may need trauma therapy after viewing this. Anyway, it's a heck of a fun ride. Ryan's snarky commentary throughout is funny but it's uneven because he doesn't apply it to his love scenes with Vanessa (Morena B), but that's a minor nit that's certainly offset by so many other areas of strength. TJ Miller is always a comedic treat, just saw him in \"Ready Player One\" last night, too. And the character \"Domino\" made for some entertaining moments with her super ability of \"luck\". A fun, solid \"9\" of a movie - and I don't hand those out often."}, {"rating": "7", "text": "I laughed alot.  I wish I had laughed more.   Two of the set pieces had me rolling on the floor with the best comedy in a movie I've seen in a long time.   Overall, I think they risk making him too lovable though"}, {"rating": "9", "text": "So many aspects of this movie i liked1. Great writing and jokes. I found my self howling most of the time2. ORIGINAL. So nice to watch a marvel movie that doesnt kind of put me to sleep.3. Soundtrack. Feels like deadpool is creating their own style in the midst of a 80s obsessed era.Deadpool is also an example of a movie that relies heavily on CGI but does so in a way that still keeps you engaged and entertained rather than desensitized... if you know what i mean Overall i loved this movie and it deserves your hard earned money :)"}, {"rating": "8", "text": "Infinitely better than the original. Reynolds has upped the ante and the result is a far funnier action movie. The story is just as generic and predictable as the first. For fans of the original or even new comers this movie is a blast!"}, {"rating": "10", "text": "I loved the first one a lot, and believe it or not, I love this one a lot more!"}, {"rating": "8", "text": "Deadpool 2 is a worthy sequel to the original movie. New director David Leitch (of John Wick fame) makes Deadpool 2 feel like an actual John Wick movie from time to time. Ryan Reynolds is again great in the role of Wade Wilson (aka Deadpool), but this time his character takes a bit of a backseat because there are Cable, Domino, the fat kid, and other characters fighting for screen-time, and even taxi driver Dopinder becomes a bit annoying. Still there is a lot of humor, plenty of situational jokes (some of them targeting the cinematic universes of both DC and Marvel, as well as the X-Men film series and Disney which are about to acquire 20th Century Fox) and many awesome action scenes that can only be found in a Deadpool movie. This time Wade Wilson/Deadpool's character actually develops a bit more, thanks to his girlfriend Vanessa and the quest to save the fat kid. To top it off, there is an awesome mid-credits scene that literally blasts everything off. Just be wary of a few gory scenes in the film though, which are lifted straight from the Deadpool comics."}, {"rating": "8", "text": "A worthy successor to the original, yet not as refreshing and vibrant, Deadpool 2 is the best possible sequel for the merc with a mouth. With a noticeably higher budget, the multitude of action sequences are more absorbing than the first (as one could guess with the addition of David Leitch as director). Said action is balanced with an abundance of jokes and fourth-wall breaks, which are as strong as ever, and cement Ryan Reynolds as a comedic master. But what’s more impressive is the ensemble surrounding him, which handles the balance between intensity and hilarity flawlessly. The villain in Cable is a near-perfect representation of the character, and Josh Brolin brings his A-game. Where the film faults, though, is its story, which is seemingly over-convoluted when compared to the genius simplicity of its predecessor. A lack of motivation for the events taking place on screen, besides the fact that they’re funny as hell, is kind of frustrating, and the poor writing choices chosen for these setups serve as through away jokes (as referenced by the merc himself). But in the end, Deadpool 2 knows what it is, and uses that to its advantage when creating some of the funniest sequences ever put to film."}, {"rating": "9", "text": "I'll be the first to admit that I was not expecting much when entering the theatre for this movie. As we all know, sequels can and usually are just...eh. This movie surprised me with its current jokes and vibrant cast. I don't want to say/talk about any of those jokes for spoiler reasons. The part in which I did not like was the mid-credit scene. Something happens in it which kind of makes the entire movie pointless. It confused me and left me wishing that it never happened. The cast/acting was great and the jokes were on point so I'll give this movie an 8.5. Since I had a great overall movie experience when seeing this, I've decided to round up to a 9. Marvel fans who liked the first one should see it, but do not bring your kids. The jokes are as raunchy as they come. That's not a fault... that is just Deadpool."}, {"rating": "10", "text": "Ha ha ha oh my god this movie was hilarious. Jokes were so good I couldn't stop laughing at the times. Brilliant movie, Ryan Reynolds is absolutely fantastic. You need to watch previous DC/Marvel movies to get the jokes though but I believe most people seen them anyway. Highly recommended."}, {"rating": "8", "text": "Deadpool 2 is a movie for Deadpool fans, a lot of the hand-holding in the first movie is is not here. Many of the references in the film are from the Deadpool universe so much so that they will go over most people's head.  the action is there the jokes are there the entertainment is there. Deadpool 2 builds up on the first movie in the lot of good ways and then not some good ways. if you are a fan of the Deadpool character you owe it to yourself to see this movie if you are only a fan of the first Deadpool movie you may not like the left turns taken in this movie"}, {"rating": "8", "text": "DP 2 was a cool and fun movie. Funny but also emotional in many ways. The story is pretty good and it starts very strong. Domino was for me the best part of the movie. Interesting acting for that character. Cable was easy to relate. The action is well displayed with good timing and the CGI got much better. I think most of the budget went there...More Xmen jokes, maybe because of the Xforce team. And don't miss the end credits, it's a blast. I give it a 85%. This isn't the movie for peoples that never saw a superheroes movie. There is a lot of reference and jokes about them.  Maximum effort."}, {"rating": "9", "text": "Español:Después de ver la película en español latino, sin duda es una excelente película. NO APTA PARA MENORES 15 AÑOS. Lenguaje explicito drogas, sexo. La película cumple su objetivo que es divertir y tiene unos cuantos cameos muy buenos, sin duda a esperar por la tercer entrega de deadpool"}, {"rating": "10", "text": "This movie was very therapeutic for my support pug, which I no longer need as Wade has fixed my PTSD from the several terrible movies Ryan Reynolds forced down our throats and not in the fun, feel it in your fluffy bunny slippers, kind of way. I might be able to tolerate maple syrup during sex again. Thank you Deadpool!"}, {"rating": "8", "text": "Fun and enjoyable. Some of the jokes did not mix well with the serious story."}, {"rating": "9", "text": "Better than the first, I thoroughly enjoyed it and laughed throughout. Cable was my absolutely jam."}, {"rating": "7", "text": "\"Deadpool 2\" is a worthy sequel to the first Deadpool but with just a smidge less. Once again, Reynolds proves himself the best fit for the character with plenty of laughs to go around. But what holds the film back is it's uneventful plot and lack of villain. I walked out not disappointed nor blown away."}, {"rating": "7", "text": "Deadpool 2 is fun, entertaining and has an emotional touch to it. However, it seems to me what the whole movie eventually wraps around one simple mediocre and foreseeable message. On the other hand, this movie is a good comedy with interesting characters. I wouldn't say that this movie is a worthy sequel but it isn't a bad movie either."}, {"rating": "7", "text": "It's a very good film, in my opinion not better then the first one. Some parts of the movie I found a bit underwhelming, but humor is again at it's best.Colossus owned in this movie! :)"}, {"rating": "8", "text": "My expectations for Deadpool 2 started out fairly modest because I wasn't sure if it could live up to how fun and unexpectedly good the first one was, but as more and more of my friends saw it my expectations started to rise. And, I had a great time watching it. I do think that the first one is better, but overall I think I may have enjoyed this one more. It's kind of weird. Story: The story of the Deadpool 2 is definitely more complex than the first one (although it does essentially boil down to \"Guy from future wants to kill kid, Deadpool no like that\"), and as a result I did find myself more invested in it than the first one. It seemed a bit more serious and the stakes did seem higher. It really is a paint by numbers superhero story, but it completely works for Deadpool 2 because you could almost look at it as part of the joke that is Deadpool. He likes to take shots at superhero stuff, but he happens to be in a movie that follows the standard superhero formula. A big thing that didn't work for me story wise, and a big reason why I think that the first one is a tiny bit better, is that the kid who Deadpool wants to protect is straight up not likable. I didn't like his character, wasn't super impressed by the kid portraying the character, and honestly was quite annoyed by him any time he was on screen.Humor: This is where it gets weird. I found Deadpool 2 to be funnier than Deadpool, but I feel like Deadpool 2 overcooks it a bit with the comedy. There was a point in the movie where it felt like it was just constantly pelting me with jokes, and not all of them landed. So while I found it incredibly funny overall, I think it could have benefited from toning down the number of jokes by just a smidge.Acting: Ryan Reynolds is Deadpool. That's all that really needs to be said. Overall: Deadpool 2 is a solid movie and a worthy sequel to Deadpool, although it may not be quite as good."}, {"rating": "9", "text": "Loved it much more than the first movie. With better story, better humor, better visuals and action scenes, Deadpool 2 is a great comic book movie that delivers lots of fun. Post-credit scene is a freaking masterpiece. And despite that my favourite 2018's comic book movie is still Infinity War, DP2 came very close to it. Can't wait for DP3 and X-Force!"}, {"rating": "7", "text": "Deadpool 2 is more of the same; more action, more humour, more banter.  Yet it lacks the 'energy' of the first one, settling itself into a comfortable position of a 'summer blockbuster'.  It's throw everything but the kitchen sink approach works sometimes: but jokes felt flat, some elaborate set pieces don't work as well as before.  It's telling when the funniest jokes are the ones in the post ending credit and its own brilliant marketing."}, {"rating": "7", "text": "“I’m Batman”‘Deadpool 2’ is a massive improvement over the first in terms of film making and having more freedom to go balls to the wall. Not feeling so contained. Having more laughs and soul in this serious drama about the ‘F’ word. Well that’s what Deadpool thinks. A lot more ruthless when referencing other movies or other source materials surrounding this movie.Now my main issue from the first movie is how colorless and bland the film making was. Something lacking or anything stuck out as memorable in terms of visual comedy. This time it’s directed by David Leitch, best known for John Wick and Atomic Blonde, who added a lot of his mystical tricks into this. How Leitch filmed the action scenes was slick and flowed smoothly. Especially in the musical numbers (played for comedy) that plays along during those sequences as a parody for blockbusters trying to be serious. Also not forgetting the truck chase.Ryan Reynolds returns as the mouth taking anti-hero, but more crude and plenty of fourth wall breaking to go around. It’s clear from interviews and the behind the scenes that Reynolds is having an absolute blast playing this role. Probably the most fun he’s ever had. Taking past failures into account for humor and doesn't waste time to erase them. Reynolds once again captures the character in spirit through his sharp line delivery and comedic timing. But also giving the character heart by showing a softer side, which stops him from being annoying.Josh Brolin is having such a great year it’s unbelievable. First ‘Infinity War’, than this, and Sicario 2. I've never seen an actor who’s been in three movies within three months back to back. His physical work and keeping up the straight man phase throughout also adds to the comedy. Never cracking a smile and keeping up the ‘tough guy’ appearance. He commands the scene whenever he appears on screen. Brolin delivers a great performance, what’s new?While the achievements deserves it's praise, but please keep in mind it’s not perfect by any mean, like a masterpiece level. It’s freaking stupid if you ask me. Some of the CGI looked a bit noticeable and since there’s a lot of jokes, not all land. While all the actors played the parts well, small or big, were excellent either way and have such great chemistry with each other. Unfortunately the same couldn't be said about T.J Miller who was one of the worst parts of the movie. The running gag of “You look like an avocado had sex-” or “you look like Freddy Krueger **** a topographical map” was never funny in the first place. Glad he’s screen time was short. I really hope they kill his character off in the next one, which seems more possibly if you heard the recent news surrounding the actor. Or knowledge his absence.Other than that, Deadpool 2 is an extremely enjoyable film that succeeds and falls short in certain areas. If you like the first, then you will or probably have enjoyed this. For me, I was laughing and smiling for 2 hours.Overall rating: Zazie Beetz and Rob Delaney are national treasures."}, {"rating": "7", "text": "Deadpool is back in the big screen and he's funnier than he already is in his first theatrical film. Like the first movie, Deadpool 2 can literally only work if you laugh at its idiotic, fourth wall-breaking humor (which is what Deadpool is always known for and it needs to always work to make Deadpool humor literally Deadpool humor). I'm not saying you should laugh at 100% of its humor, but at least 60% or higher of its humor. Of course if that isn't your cup of tea, there's always tons of action to come along with the humor (because it's Marvel). Undeniable flaws from the first movie returns, but can thankfully be ignored by its action and humor which shines just in time before the first flaw can even get reached."}, {"rating": "8", "text": "I wasn't expecting to enjoy this movie as much as I did. Deadpool 2 has a pretty rocky start, the first 20 minutes were straight up hard to enjoy and made me worried for the rest of the film. After the first act the real plot kicks in and things get into a really good groove. This sequel is not as fresh or in a sense special as the original Deadpool was, but it made up for it in its wonderful action set-pieces and the addition of some pretty great new characters (Cable, Domino and Peter) with the glorious return of Colossus. So all in all I'd say that Deadpool 2 has the same good and bad qualities of its predecessor (fun as balls with humour that's equally hilarious as it is forced wrapped in a pretty conventional plot), but DP 2 has a more interesting story and overall I'd say it's more rewatchable. It's quality entertainment."}, {"rating": "7", "text": "La verdad que bastante buena es una buena segunda parte pero es el síndrome de mas de lo mismo.La primera parte fue bastante mejor ya que fue la introducción del personaje.Es bastante entretenida pero no hay mucho cambio de la primera parte."}, {"rating": "9", "text": "When considering ‘Deadpool 2,’ there hasn’t been another superhero sequel as good if not better than the original since Christopher Nolan flexed his muscles in the genre with ‘The Dark Knight.’The main body of ‘Deadpool 2’ blends together the action, plot and soundtrack to such a high degree that it’s virtually unparalleled compared to other films.  From recent memory, the only other film that comes close—besides the first Deadpool—was last year’s ‘Baby Driver.’The film’s dialogue is packed with movie references, nods at pop culture, and even jokes at Ryan Reynold’s own expense, so much so that a second viewing would absolutely be necessary to try and catch them all.The movie isn’t perfect.  For example, the first half of Cable’s storyline feels a bit disjointed from the rest of the film.  However, it steadily becomes increasingly well integrated over time.However, for a franchise that prides itself on violent irreverence, it’d be unthinkable to assume that they were capable of making audiences well up with emotion at the end, yet they had the entire theater choking back tears, a rare achievement that strongly rounds out this film and places amongst the best in its class."}, {"rating": "7", "text": "As expected it is completely entertaining movie, with great jokes, good performances Ryan Reynolds owns this character like it's his own soul, and some of the action scenes are simply superb.But this movie loses the appeal the first had, the first was very straight forward, while this one starts wanting to be one thing and shifts. The first act was really slow, and the jokes weren't landins at first, but after Vanessa's death the movie just picked up and started getting better and better.Some of the dialog is really farfecthe'd, trying to hard to be funny, and sometimes when you expect that seriousness, that the movie has at times, you get some really dry jokes that ruin what could have been a great moment/sceneSo this is definetely worth the watch, but i guess being a sequel from a sucessful movie, it really stretched itself thin. and not forget to mention basically the best post credit scene in history of cinema."}, {"rating": "8", "text": "When Josh Brolin said in an interview that Deadpool 2 was funnier was the first Deadpool I thought it was some promotion BS but was i glad I was wrong Deadpool 2 was funnier and more action packed than the first Movie.Before I say what I enjoyed about Deadpool I would just like tonsay although DP2 is funnier and more action packed it is not better than the first one and I will talk about that.First off the first act of this movie was weird ot feels like the movie is transitioning from the first movie even thought it uses from jokes from the first movie and surprisingly they work throughout the film.Although something emotional happens in the first act involing Deadpool and Mellisa's character Vanassea it felt like the director or writers did not know how to fully utilize until the later stages of The second act of the movie.Although I have to say again again Ryan Reynolds Performance as Deadpool is Great and is never boring throughout the movie.When the movie starts to go into the second act the story felt more clear and focused amd the action and humor are amped up with Cable being added to the mix making jokes about Dubstep and Deadpool with his dry humor.The kid in the film firefist potrayed by Blah was okay he had a simple story with was the catalist for the entire movie and the performance was fitting.The second half of the movie is were all the excitinv this happen with all the X-Force stuff amd the do something with X-Force thats hilarious some people may find it dissaponting but for me it was wonder amd Betaz character Domino was kind of badass who had the superpowet of luck with proved to be cinematicThe last act of the film was also well done a bit weird but well executed with very funny humor,explosive actionNow the villains of the story there was a surpriseVillain in the movie that I won't spoil but when whenever tnis villain was onscreen he was awesome and the other viallain which involved firefist and doing these bad experiments was kinda weakni mean you understood why they where villians but it was too generic and weakAnd then there was the story arc involved the Cable and the kid which was a bit take it or leave it lod of thing but never riuned the experience of the movie at all.The story may have felt of in the first act of the movie the sfory became more focused in the second act and again the movie is very funny on certain scenes i was literary crying from laughing even thought this certain basic instinct moment happened with was a bit much the movie was still great and the action was better and more epic.The retirning characters like Colossus were also good in the film so that gets an up.And again Ryan Reynold performance was great the man can do no wrong as Dead pool."}, {"rating": "9", "text": "Après le carton de sa première aventure, l’anti-héros délirant Marvel est de retour dans Deadpool 2, un film très attendu pour les nombreux fans de la franchise. Nous l’avons vu, on vous donne notre avis… sans spoil.Il avait fait sensation en 2016, Wade Wilson est de retour cette année chargé à bloc dans un nouvel opus de la franchise Deadpool. Le casting au complet remet le couvert en y intégrant de **** nouveaux comme Zazie Beetz dans le rôle de la chanceuse Domino, Terry Crews en Bedlam, Julian Dennison est Russell, Shioli « Bisou Yukio ! » Kutsuna, Josh « Thanos » Brolin et… Peter. On notera des caméos délirants tout au long du film dont un certain Phantom, mais on ne vous en dira pas plus.Dans les grandes lignes, l’histoire nous fait suivre Wade contraint de protéger un adolescent geignard « XXL, comme il est dit » qui est prit pour cible par Cable, un mystérieux homme venu du futur. Deadpool y versera beaucoup de sang et de membres dans des scènes d’actions toniques et parfois très gores.Côté action justement, les amateurs de boum boum et de chorégraphies en auront largement pour leur argent avec de magnifiques combats et un budget revu à la hausse. Budget qui manque par contre au niveau des effets visuels de certains personnages entièrement fait en CGI.Égal à lui-même, Deadpool s’en prend à toutes les firmes de comics que ce soit Marvel ou DC Comics, mais également à son interprète principal. Batman, Wolverine, Green Lantern et les X-Men en prennent plein la figure avec un Wade Wilson en pleine forme.Pour conclure, Deadpool 2 est bien le film que l’on attendait avec son humour décapant. Les caméos sont hilarants, tout comme les personnages secondes qui malheureusement n’ont que très peu de réplique. On regrettera que certains personnages principaux n’apparaissent pas plus à l’écran comme Negasonic Teenage Warhead et Yukio (Bisou Yukio !) qui ont un gros potentiel en espérant les voir de retour dans le film X-Force. Ce second film met donc les bouchées doubles mais ne fait pas dans le « too much » car il explore suffisamment les personnages de Cable et Wade Wilson pour équilibrer entre les sérieux et les blagues potaches de notre ami en rouge et noir. Bref, un excellent opus qui ravira les fans du premier film mais aussi les lecteurs du comics.NOTE DE LA RÉDACTION : 4/5"}, {"rating": "7", "text": "You will have fun with this movie, it's great, good action & jokes etc. But it doesn't feel quite different from the 1st one. It tries to bring back everything we loved from Deadpool 1, but it kinda falls short. Some jokes don't land, breaking the 4th wall was used way too much often. Things like that makes the 1st one shine a lot more than this one. I felt this movie lacked some originality, but still it's a great movie.Also, some CG it's way off, you will see it and feel it. We are talking about (more or less) 2005-2010 CG level."}, {"rating": "8", "text": "Wade Wilson is trying to live up with the super hero life, he fight criminals and also still in his relationship with Vanessa. During some events in the future, a person killed the familly of a militar, and for get them back, he decides to go back in time and killed that person while is still a kid, and that crosses the deadpool way. Directed by David Leitch.The story of this movie does have some really up moments and some really up down ones. Right at the very beginning one thing is going on, and that thing leads to one big deal that happens, and this happening feels so dislocated of the whole plot of the movie that it is disturbing, and they keeped bringing that back apparently having not to do with the plot, but at the very end that makes sense and it is important, i like to think in this story as two circles, one around the other that first seems to be completely disconnected but in the end of the circle the find eachother, it is good. The other circle would be the Cable one, his motivation wasn't bad, but still there was some moments that didn't felt right, like somethings that was kind of out of place, some things that he did during his journey that aren't really a thing that made sense, but considering that the movie makes joke about everything, incluiding itself, it get a free pass and doesn't bother much. The tone and narrative change from times, but not all of the moments are organic, some felt just threaded there. The chemistry between the characters in some moments works in others not that much.The comedy in this movie gets fantastic, it started slow, with some common lines, but as the keep goes, the comedy start getting another level, there are a few ways that the movie try to get you to laugh, wich is lines, actions that break the expectation and some really not convenient moments. All of these work ? No, but generally made me laugh the hell out of me in some moments, there are some big things that they did just to make a giant joke, and that killed me completely, was really funny, there at least two moments that i got broke of how much i did laugh. There are some lines that are good, but there are some that just don't work, wich is normal, there are those simple fart jokes, wich i don't find them funny anymore, was so much used in so many different ways, for me that is exhausted already. There are jokes that got repeated from the first one, but most of them get to a new level and can still be fun, jokes with Ryan or with Fox for example, worked out very well for me. The movie also is a machine gun of references, it does reference so many things, musics, movies, events, most of the time it is very cool. The break of the fourth wall is a big differential, always that he spoke to us, it was a nice moment.Ryan Reynolds as Deadpool one more time, just proved why he is the perfect one for this role, his voice and comical time are perfect, he convinced me in his physicality and also in the personality, in the dramatic moments he didn't convinced me perfectly, but i can't say that it was bad, surely wasn't as good as the comic ones, but it was functional. Josh Brolin was badass, his dramatic moments wasn't the best of the history, his character didn't seemed to have much expressions, it was pretty simple, he worked more as a ladder for deadpool and for the plot to flow, but in the action moments he was great. Zazie Beetz as Domino was pretty cool, she didn't had much challenge in the acting, i believe, but she fit well in that role. Morena Baccarin have a small role here, but she convinced me in the romantic parts, you could see that she was kind and full of love, really good.The action here can be dope and at the same time hilarious. It was pretty fun, the choreography of fight wasn't insane, but it was good, there are some sequences with swords and shots that are really nice to see. The powers of Cable were well demonstrated and it was badass. There is one specific moment that the characters used their powers togheter to beat a villain, wich was dope. The way that they show Domino's powers was great, they didn't just said that she was luck and showed a lucky moment, the showed the whole process to make the ending to be that lucky one, also pretty damn cool.The soundtrack was good, it had some uses of already known songs, in some moments that worked really well, in some not that much, but in general it was different, wich is always nice.The cgi was better than the first one, but not by far perfect, it had some moments that wasn't really that good, but generally it also worked out very well.The movie have some switches between drama and comedy that doesn't work everytime, but singularly they both deliver some good moments. The comedy is very nice in general, so as the action."}, {"rating": "8", "text": "Дэдпул 2- смешной и крутой фильм. Сюжет не настолько банален, как в первой части, но и чего неожиданного нет. Персонажи все также крутые, но от Силы Икс ожидал большего, чем просто шутка. Юмор такой же, как и в первой части. Главного злодея слили еще в трейлерах, поэтому не было такого удивления. Графика красивая, но в некоторых местах был виден хромак. Второй дэдпул на много лучше своего предшественника, но как не странно хуже Логана."}, {"rating": "8", "text": "Esta es una gran película. En mi opinión no supera a la primera, pues pierde ese toque de sorpresa que su predecesora sí que tenía. También aumenta la proporción de chistes, y por ello la cantidad de ellos que no funcionan. Los personajes son muy buenos, tenemos un gran desarrollo de deadpool, un cable increíble e imponente y una domino muy bien plasmada. Sin duda una gran peli que te hará reír y pasar un gran rato."}, {"rating": "9", "text": "Please, for the love of all things holy, DO NOT listen to the critics on this one. This movie **** rocks my cock. THE best superhero movie this year. **** Black Panther, it's overrated, sorry. I will admit that I liked, but did not love the first deadpool. I thought alot of the jokes didn't land but in this movie, nearly all of them land with guttural laughter. How this could currently have a 66 from the critics is insanity. With some saying it's more of the same...not even close. It's shocking, gory, funny, heartbreaking and sweet and loving in all the right ways. Now I will admit, some of the jokes don't land and I wished they had more action scenes without as many cuts. But when they don't cut away from the action...its so badass. The 4th wall breaks are top notch and...im sorry but a 66!? Seriously. Youll tongue punched Black Panthers ****. Just go watch this movie. It's is the best movie of the year, so far. Oh and Cable is better than Killmonger and Thanos, @ me"}, {"rating": "9", "text": "I liked the movie but it did not feel like the Deadpool we had in the first movie. The main reason why its like that is because the writers wanted us to learn more about Wade`s character and what happens when somebody takes everything away from him. Overall its a great movie.I expect to see that infamous Hitler baby murder after credits scene on bluray."}, {"rating": "10", "text": "Great, an independent film without the disney **** black humor, no censorship, infinite references to the previous films and the universe, characters with charisma, funny but humble jokes that do not clash as in other marvel movies that pretend to be serious but are a joke in itself, 2 hours very fun"}, {"rating": "9", "text": "David Leitch tenía como reto superar a la grandiosa primera parte dirigida por Tim Miller, y, al parecer, logró lo que no muchos logran, superar a la primera parteDeadpool 2 supera a su sucesora, ya que esta grandiosa secuela contiene mas acción, mas profundidad en la trama, giros inesperados, referencias geniales, mejor calidad, mejores interpretaciones, mejores efectos visuales, cameos grandiosos, personajes iconicos, etc.Además, el \"villano\" es grandioso interpretado por Josh Brolin, a quien podimos veer como Thanos en el UCMLo unico en lo que podemos quejarnos es la secuencia, ya que en partes la película esta presentando una escena de acción impresionante, y de repente bombardean con escenas de diálogo, además, la presencia de T.J. Miller solo ocasiona que la película tenga escenas sin sentido ni peso en la trama que solo están para justificar la presencia de el personaje.Pero eso es lo unico malo dentro de una película grandiosa y extravagante que se resume a una palabra \"diversión\""}, {"rating": "10", "text": "Una de las películas más graciosas que he visto. Sus continuas referencias a otras películas e incluso famosos y superhéroes más la gran historia que tiene detrás hacen que la película sea de lo más entretenida. Por no hablar de las numerosas referencias que Deadpool hace sobre que sabe de que está dentro de una película. La verda, me ha sorprendido el resultado. No esperaba tanto."}, {"rating": "9", "text": "Every joke works in this movie (except for Brown Panther, as it's offensive), but if you're not a big fan of Mr.Pool, then please avoid the sequel too, because you're not gonna like it either. Otherwise, great fun's ahead and Ryan Reynolds did it again by bringing in youngsters who could take this franchise for the next 10-12 years!! Really amazing!!"}, {"rating": "10", "text": "The movie contains more action and characters than the first one while having the funny aspect from the first one a almost perfect sequel."}, {"rating": "9", "text": "A great fallow through from it's predecessor. It's not perfect but I went into the theatre expecting exactly what I got plus a bit more. I'm not going to spoil it for you but was really surprised at how the events turned out in the second to third act. Love how it doesn't take itself seriously and some say that it does it too much but if you are a Deadpool fan you know that's the whole point. Ryan Reynolds was born to play Deadpool, can't wait for the X Force Movie!"}, {"rating": "8", "text": "I loved the first movie and I’m happy to say was a lot better. I loved the characters of cable and domino. The entire X force scene was hilarious. I loved the jokes in this movie such as the calling cable Thanos. I also loved the fight scene with cable and Deadpool while bangarang is playing. Overall a good movie"}, {"rating": "9", "text": "In Deadpool you will only see how an actor loves his character, how he only wants us to come and go with a smile from the cinema and how he gets it, Jesus.After thinking that the first was unsurpassed, this wonder comes to my face, winks very well put, frenetic humor, much action in the best Deadpool style, in short if you liked comics and the first movie, this time you will love it, and if you are only from the movies, you will love her as well. DOMINO I LOVE YOU"}, {"rating": "7", "text": "Script not as good as for D1, not even close, but still a decent movie and certainly better and way less juvenile than any Avengers movie or spinoffs.Classic Deadpool: he just can't STFU, and that's the way we like him. Decent fights, violence, acting and humour. Cable is awesome, too.Verdict: Spandex!"}], "recommendations": ["deadpool", "thor_love_and_thunder", "the_a_team", "zombieland_double_tap", "the_green_hornet", "thor_ragnarok", "pitch_perfect_2", "jumanji_the_next_level", "pineapple_express", "kingsman_the_golden_circle", "shazam_fury_of_the_gods", "venom_let_there_be_carnage", "ted_2", "guardians_of_the_galaxy", "this_is_the_end", "megamind", "the_suicide_squad", "tag", "this_means_war", "baywatch", "minions", "logan_lucky", "the_losers", "peter_rabbit", "night_at_the_museum_battle_of_the_smithsonian"]}