{"id": 1559, "title": "Death Wish", "starring": ["Bruce Willis", "Vincent D'Onofrio"], "runtime": 107, "genre": ["Action", "Crime", "Drama", "Thriller"], "description": "A mild-mannered father is transformed into a killing machine after his family is torn apart by a violent act.", "releaseYear": "2018", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/g0eEEZAqMf98ULQnoiORuazjOpn.jpg", "categories": {"plot": 7.764705882352941, "acting": 7.0, "ending": 7.5, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 3.0, "funny": 9.5, "action": 6.826086956521739}, "reviews": [{"rating": "10", "text": "This movie delivers what is promised, nothing more, nothing less. A great return for the revenge genre. Bad reviews are due to the crybabies that inhabit the larger media space. Who would have guessed that in 2018 a man with a solid traditional family unit meting out justice would be so offensive."}, {"rating": "10", "text": "Those Americans who have a problem with good guys ensuring bad guys receive justice should move to Europe or Mexico or some other sh!t#hole.Bruce Willis still has a gift and was a great choice to play Kersey."}, {"rating": "9", "text": "Good movie.  Bruce Willis is always good in this type of flick.The \"critic\" reviews seem way off.  I guess in the current climate, their politics outweighs their job responsibility of providing impartial movie reviews.Oh well, the user ratings will show that this one is worth seeing.  Just remember, it's R rated, so leave the kiddos at home when you go see it!"}, {"rating": "9", "text": "So liberals are having a ball with this movie because of the violence, so what, are we suppose to bow down, nah we get back up and we carry on, has the nation turned into a bunch of snowflakes, this is a great movie and everyone should go see it."}, {"rating": "10", "text": "I’ve already read about 10 “reviews” from idiot liberals panning the film because of their anti gun beliefs and bias. “This isn’t the proper time for gun violence in film.” Last time I checked these are movies and violence is also depicted in the overhyped **** that are black panther and get out, so where was the outrage then? Double standard racist illogical **** I’m paying money to see this new take on the classic with one of the greatest action hero’s of all time in Willis. Pay no mind to these so called “critics”. They’re a bunch of leftist PC cretins pushing their own political opinions without even objectively reviewing the actual movie."}, {"rating": "3", "text": "A bland action film that is easily forgettable. Eli Roth has proven to be one of the worst directors in Hollywood and while it can't get much worse than Green Inferno, he brings nothing new to the genre. Then comes Bruce Willis who is physically there but mentally he's a million miles away. Overall a pointless remake, a high 3. D+"}, {"rating": "6", "text": "Entertaining though by-the-numbers, \"Death Wish\" is a serviceable action flick."}, {"rating": "9", "text": "This was a great movie.  It admits there is violence and pain in the world and shows how a man deals with it. It is more of a story than a morallity bit.  It has a good sense of humor and is entertaining.  Willis is on top of his game and I had a good time rooting for him."}, {"rating": "9", "text": "Fun flick    ."}, {"rating": "2", "text": "The fact that certain critics are taking this movie seriously to talk about how this movie was released in bad timing is an insult to the issues about gun reform. This movie is too boring to be taken seriously. It tries to be this trashy B-movie action flick and trying to talk about vigilantism and PTSD seriously, but instead it is a dull, by-the-numbers action film with no real thrills and any attempts at trying to tackle PTSD is barely mentioned (only one scene and it only goes on for less than one minutes) and you can get better and more interesting movies that tackle vigilantism. It's just a slog to sit through, not helped by the bland direction Eli Roth gives. The only remotely enjoyable thing about the film is how Bruce Willis is clearly foaming it in. If you think about his what his eternal thoughts are during filming and why he never emotes at all, it is quite fun. More fun than this shoot-em-up movie is!"}, {"rating": "10", "text": "Good movie.  It is what it is and I actually loved it.  Bruce Willis is a BA in this movie and it has plenty of funny moments has well."}, {"rating": "9", "text": "Death Wish was a terrific movie! The professional critics look for artistic content and subtle messaging in films way to much. This was a FUN movie to watch!Way to Go, Bruce Willis!"}, {"rating": "10", "text": "The critic reviews are shocking...  I was thoroughly entertained!  One of Willis' best movies in a long time.  I strongly urge you to check this out and judge for yourself, I have no idea how so many critics could have such a drastically opposite opinion than mine, I like to think I have a good taste in movies..."}, {"rating": "8", "text": "once again the \"professional critics\" or how I call them \"compromised political ideologue Employees of mass media\" fail to do their job...injecting their politics and offering 0 reviews or arguments of the movie..thus separating themselves again from the rest of the actual paying public. the movie was great if you like vengeance action movies, good cinematography, great sound and Bruce Willies doing his best to fill Bronson's shoes... it is good guys...just don't forget to watch the originals."}, {"rating": "10", "text": "The original was good.  The remake is AWESOME.  A timely movie about heroism, given the troubled age we live in."}, {"rating": "10", "text": "I thought this movie was great! Better than the original, which I saw in a drive-in theater. I know why so-called \"critics\" hate the movie, they hate America in general and so nobody can expect them to like a movie about Americans taking care of business. Critics don't have any problem with Brad Pitt shooting anybody, nor do they have issues with a killer using an oxygen tank to drive a rod into innocent people's brains, but let somebody who even acts slightly conservative kill an obvious criminal and that's the worst evil in the world! If you are looking for entertainment, this movie is entertaining. If you hate criminals and don't mind seeing them get killed, this movie is entertaining. If, on the other hand, you hate America and everything about it you will probably hate this movie. Move to Cuba, the Cuban government will protect you and see to all your needs! You could also get a film crew an make a movie where Planned Parenthood is the hero. Them babies are the worst!"}, {"rating": "10", "text": "Here's an objective review of \"Death Wish.\"It was fine. It didn't deviate from the \"vigilante seeks justice\" storyline. Bruce Willis was the best choice for the vigilante role, and the actors are all fine. I liked how resourceful Willis was with using the environment in gunfights (he had a character name, but it doesn't matter), and the visual effects for gore were very well done. I admired that Willis did get hurt multiple times in the movie, and had to solve it on his own. The ending wrapped up a little too nicely, and the writers should have made the first two murders connected to Willis' struggle, since otherwise he's just killing random thieves and drug dealers. But, it's fair. I enjoyed it, for what that's worth.You don't need to attach your political views onto the movie. The movie isn't worth your outrage. It's a popcorn movie that will be forgotten about in a few months.@LOL_at_redhats) \"While the film is probably fine\"........ So you didn't watch it?"}, {"rating": "10", "text": "Went and saw it last night and was pleasantly surprised of the quality of the movie. Bruce Willis still got it and I highly recommend it!"}, {"rating": "8", "text": "I didn't know what to expect but was pleasantly surprised by this film.  So much violence that I closed by eyes more than once.  If you want to watch a film that will draw you in for an escape, this will do it.Only scene I found unbelievable was when the city is in the midst of 24 hour coverage of the main character knowing that he is white wearing a hoodie, yet he is still wearing a hoodie walking down the street.  It's like Batman episode #1 where he walks into a bar and tells the waiter he doesn't want to draw attention to himself. Nobody else wants to wear a hoodie because they would be targeted.I recommend it and may see it again."}, {"rating": "9", "text": "What a great movie. Despite what the critics are saying its definitely worth seeing. This is a great remake and has a good message."}, {"rating": "10", "text": "Just saw this movie as did not believe a 12 rating for Bruce Willis.  So glad I did as were the other members of the audience.  We all got some laughs and no nasty sex stuff.  Due to the language and one violent scene in particular not for the younger set."}, {"rating": "7", "text": "For Dr. Paul Kersey (Bruce Willis), life is good but at a crossroads. With his birthday coming up, his daughter Jordan (Camila Morrone) is preparing to leave their affluent Chicago home to start college in New York.His wife Lucy (Elisabeth Shue) knows this is a good thing for their daughter but also knows that it is a turning point in their lives as they will soon be facing an empty nest.Sadly their ideal life is turned upside down when a home invasion and robbery turns unexpectedly violent leaving Lucy dead and Jordan in a coma. A distraught Paul finds little solace in therapy or in the support of his brother Frank (Vincent D’Onofrio) who is putting his own life back together.Frustrated by the inability of the police to find those responsible and bring them to justice; Paul becomes even more and more frustrated as the weeks pass. Paul eventually comes into possession of a gun and begins to practice with it which eventually leads him to taking to the streets in a Hoody. When a chance encounters has him gun down two criminals, Paul finds a sudden rush from his experience, especially when it was captured by an onlooker and posted online. Thanks to his face being hidden, the media dubs him the “Grim Reaper” and Paul begins a campaign of vigilante justice as he tracks down those responsible for his suffering and looks to exact a brutal revenge.The movie directed by horror icon Eli Roth is a faithful update of the Charles Bronson classic. Paul is now Doctor Vs an Architect and Chicago not New York serves as the setting, but the tone and subject matter of the film is very much the same. Roth does show his horror background with a couple of killings that are a bit gruesome but they are not overly gratuitous as he cuts away from the carnage instead of lingering on it. What I found most satisfying is how the film moved at a slow and almost deliberate pace. This was not a run and gun action film like many of the past films Willis has done. His Kersey is an everyman who decides to take extraordinary measures when he believes the law has failed him.He moves at a steady pace and even in the most frantic moments, moves with the speed one would expect of a man of his years who has only recently fired a gun. Although effective he is at times unsteady with his shorts and actions and his inexperience shows.It was refreshing to see combat on screen by a character that seemed real vs a polished officer or combat vet.The cast was solid and really worked well with one another and you could see the struggle they faced with the situations presented to them. The audience at my press screening responded well to the film and seemed to get behind Paul as he embarked on his crusade. I am very curious to see in this time of controversy about gun laws how the film will be received.For me, “Death Wish” is a very entertaining retelling of a well-known story that still holds up and still asks many difficult questions about our society and how to best protect the ones we love.3.5 stars out of 5."}, {"rating": "8", "text": "I loved it! Of course I'm a big Bruce Willis and Vincent D'Onofrio fan so this was very enjoyable. The fact that there were no rape scenes, nudity or sex was absolutely awesome! The story was good and the acting was great! Well done!"}, {"rating": "4", "text": "By-the-numbers forgettable revenge flick (straight from 2006) with Eli Roth's usual overindulgent torture porn fetish and a charmless and tired Bruce Willis sleepwalking each scene. D'Onofrio gives an enjoyable performance, the gore is sorta fun in places and it's always nice to see Elisabeth Shue (even though she was kinda bad here), but there's nothing of merit in what Death Wish (2018) has to offer... move along."}, {"rating": "9", "text": "I enjoyed this movie love Bruce Willis watched the original with Charles Bronson many many times I think Bruce did well in this movie"}, {"rating": "6", "text": "Death Wish is one of those movies where you know exactly what you're gonna get when you walk into the theater. You don't go for enthralling story or an enticing script...you just go for an enjoyable movie going experience. And that's what I got with Death Wish. Yeah, Bruce Willis phones it in throughout a good chunk of the movie and the set up takes a bit too long, but once the vigilante storyline comes to fruition it's a pretty enjoyable watch. I'd say this movie is worth a matinee ticket, or you could just wait until it's on a streaming service."}, {"rating": "10", "text": "Action packed and fun, enjoyed this movie a lot. Bruce Willis just nailed it."}, {"rating": "6", "text": "This is as generic as an action movie could possibly get, and it probably wasn't released at the right point in time, but this still makes for an entertaining and surprisingly pretty fun time at the movies. It's far from being a great or even really good movie and it won't be remembered after a few months but there's nothing terrible about this."}, {"rating": "7", "text": "Death Wish is a fantasy action flick, as was the original. How did I like the film? It was not quite as raw and blunt as the original, however was a fun romp which left me satisfied by Willis's initially broken man gone furious. Sometimes not believable, but that's just how action movies tend to be - and Death Wish knew what it was and did it well.Now, I've seen two extremes for this movie surrounding gun politics, and a disappointing amount of critics with shallow opinions derived from this. Now, I feel the message surrounding guns in the film was from both sides - showing the dangerously easy guns are to obtain with the obnoxious amount of resources on the internet and overly exuberant sellers of weapons - and the flip side to showing the value of them (albeit unrealistic wielding by Willis). How protecting yourself is best you can do, cannot always rely on the police - it's just the original movie's message reused in today's world. However my point is polarizing views give this movie a severely skewed rating in either direction based on just the gun angle, which is a poor assessment by a movie viewer not thinking about the film as a whole - and forgetting this movie is indeed a revenge action film. I just happened to believe the stance on gun violence was actually rather balanced. There was plenty of mockery of gun enthusiasts, and there were insinuations that a majority of gun wielders besides Kersey, and educated doctor, were in over their head while using one - and that Kersey's focused and unwavering character under fire as he actually used the gun, was an exception and not a commonplace (with bumbling criminals/professionals being wiped out). There were gun jams, and fortunate situations even for this character where it's highly likely others would have died - taking the movie aspect of these scenarios and painting them as fantasy. Yes, the good guy killed everyone and got away with it - well, so did the other Paul Kersey decades ago. A movie, is a movie."}, {"rating": "10", "text": "Like it's original namesake, this movie has an excuse plot and you're basically paying money to watch Ker- I mean Willis shoot people for over an hour.10/10The film \"critics\" are literally babies and every single negative review I read mentioned their own politics more than the movie itself."}, {"rating": "2", "text": "This movie was not very good, especially when compared with the original.  The Wile E. Coyote antics for the killings was apparently appealing to the lowest common denomiator of viewers.  If mindless violence is your thing, then you'll probably like it."}, {"rating": "7", "text": "My husband and I just saw this movie.  We both enjoyed the movie because it has a great story to tell.  Bruce Willis is very good as the man who takes the law into his own hands.  We are all rooting for him and there was serious cheering going on when the bad guys were getting their just desserts.  If you enjoy seeing that, you will definitely emjoy this movie."}, {"rating": "9", "text": "Very entertaining Bruce Willis movie. It delivers what it promises, and it stays true to the Originals in almost all ways. Thats something a few recent movies could learn something from. Well worth Your money."}, {"rating": "8", "text": ".มนุสรเธอเก่งมาก อ้าวไม่ใช่ 555+เป็นหนังเรื่องใหม่ของ ผกก.Eli Roth ที่เคยฝากหนังโหดๆมาแล้ว อาทิเช่น - Knock Knock ที่เคยทำคีนู รีฟ หมดท่ากับสาวๆมาแล้ว- The Green Inferno ทีั่พาเมีย ผกก.ตะลุยแดนมนุษย์กินคน- Cabin Fever และ Hostel 1 / 2ที่ครั้งนี้แกขอแปลกแนวมาสายแอ็คชั่น แต่ก็ยังคงความโหดสยองอยู่ และก็ได้นักแสดงสายบู้ ตัวพ่อ Bruce Willis คนอึดของทุกคน ความรู้สึกหลังดูมันเป็นการเปลี่ยนบทบาท ครั้งสำคัญของ Bruce Willisมันก็แอ็คชั่นนั่นแหละ แต่มันเปลี่ยนที่มันไม่ได้เก่งตั้งแต่ต้นเรื่องมีโชว์ดราม่า และอัพระดับจากสายบู้มาสายโหด จึงเป็นบทที่ Badass มากๆ ซึ่งมันทำให้หนังดูสนุกและน่าติดตามมากขึ้น และตัวหนังมันให้อารมณ์ ระทึก กดดัน ชีนฆ่าเอาคืนก็โหดสยองเสียวๆสุดๆ ส่วนเนื้อเรื่องก็ไม่ซับซ้อน ง่ายๆไม่คิดมาก แต่ก็ชอบที่มีประเด็น ความนิ่งเฉยเมย ของกฎหมายตำรวจก็เล่ามาได้โอเคแต่ก็ไม่ได้เยอะมากสรุป ถึงแม้เรื่องนี้พล็อตจะไม่ซับซ้อนมาก แต่ก็มีความโหดความมันส์ ที่จะทำให้เรานึกถึงละครเรื่อง ล่า มาก ใครชอบแนวล่าแก้แค้น ก็ห้ามพลาดเลยเนออออ"}, {"rating": "10", "text": "Im a little late for this  this one but Death Wish is a fun great movie. Don't let the \"critics\" fool you by making it all about themselves and their political ideologies."}, {"rating": "1", "text": "This movie is trash I walked out after 30 mins to see something else. Good luck if you waste your time in this garbage movie. I will flop and go straight to Blu Ray or DVD. You will see."}, {"rating": "4", "text": "This remake stars Bruce Willis as a gentle surgeon, who takes revenge into his own gifted hands when his family is brutalized. It's never been a surprise that Willis isn't much of an actor and this performance mightily reinforces that fact (of course, Charles Bronson, star of the original, was even more wooden). The plot unfolds predictably, but the pace never lags. The only standout is the grisly murders, which is no surprise since it's directed by Eli Roth, who's know for exceptional visceral violence. Otherwise, it's mundane by the numbers filmmaking."}, {"rating": "10", "text": "This movie was awesome! I don't understand the low ratings from the professional reviewers."}, {"rating": "10", "text": "This movie delivers what is promised, nothing more, nothing less. A great return for the revenge genre. Bad reviews are due to the crybabies that inhabit the larger media space. Who would have guessed that in 2018 a man with a solid traditional family unit meting out justice would be so offensive"}, {"rating": "10", "text": "His best film since the original Die Hard trilogy. Bruce Willis nails it! Fantastic cast, simple well executed story and great action. Oh, how the critics got this one wrong! This will be a cult classic for sure!"}, {"rating": "4", "text": "It's an Eli Roth movie. You're getting what you foolishly paid for: violence for violence sake and about as much depth as a puddle."}, {"rating": "4", "text": "I mean it's definitely a remake of Death Wish.   I went in kind of excited, but it was all a bit of a blur.  Revenge movies are basically like adult cartoons, so it's weird it dragged a lot between action scenes, and I just ended up feeling kind of bad at the end despite the humor.  It'd be nice if Bruce Willis could tap in to some more of his old energy, especially for something like this.The marketing of the movie was pretty manipulative to get people riled up, and it worked, look at the review section already.   This movie isn't really worth getting worked up about, it's not a particularly strong take on anything besides Man Torturing/Killing Criminals, and you've seen movies like it before.I'd just go find Death Wish 3 and watch that if you haven't and watch Bronson kill people with a bazooka, it's a better time.  For a modern take they haven't done it better than John Wick/John Wick 2 yet."}, {"rating": "4", "text": "Those hoping for a return to form for Bruce Willis are sure to be disappointed. Not only is the movie itself another black mark on his once respectable resume, but even though this is his first starring role in a big theatrical release since 2013's Red 2 the actor doesn't put any effort into his performance. One could argue that he was going for subdued. I personally think we just sleepwalking through another role. Same can be said for any of the white actors onscreen that aren't Vincent D'Onofrio.The movie itself is cliché and super predictable. Weirdly enough Death Wish is overly sentimental, but nothing manages to connect with the audience on an emotional level. Given Eli Roth's penchant for extreme blood and gore, one wouldn't be blamed for thinking that if the writing fell flat (which it does) at least the action would be entertaining. Unfortunately, with the exception of one auto body shop torture scene this talent of his goes underutilized making this Roth's most restrained film to date. After shocking the world with grindhouse throwback films like Hostel, Cabin Fever, and The Green Inferno it's sad to see the director come out with something so pedestrian.Like a lot of gun heavy, vigilante revenge flicks, Death Wish takes a brief peek at the social conflicts arising from it's character's actions via radio talk shows and social media, briefly hints at the dilemma of gun control, and then completely shies away from actually saying anything about these issues. I get that diving into this morally grey area is tricky and could you blacklisted, but if you're going to make a movie that's so very clearly pro-gun as this then you might as well just come right out and defend your position rather than just tiptoeing around it. The opposition certainly has no qualms about expressing their views and it would have gone a long way towards making this movie not feel so limp and lifeless."}, {"rating": "8", "text": "Utterly enjoyable even if bit unrealistic.Willis is believable, though his shift to McClaneish persona might be a bit too swift. However, this is not supposed to be a movie about moral dilemmas is it? It is about a man getting his revenge and kicking ass in the process. I will give the movie props for the secondary story which actually makes ride towards ending a bit uncertain. Will it be happy ending or moral message ending?I liked it, and if you ever liked any Willis movie probably ever, you will like it too."}, {"rating": "10", "text": "Bruce Willis does a great job again. Movie is great and whats most important very entertaining. Quite probably one of the best action thrillers in a decade. A must see for those who enjoy action and especially Bruce Willis fans. Don't listen to critics, as usual they are totally disconnected from what this movie is and what it supposed to be. In case i did not make myself clear enough - critics are reta***d."}, {"rating": "9", "text": "In a time where gun violence is becoming more and more of a daily occurrence in our lives, it’s easy to see why some critics have panned Death Wish, painting it as a lackluster picture. I can only assume many of the critics that have reviewed the title thus far have feared being labeled as a pro-gun nutjob opposed to viewing the movie as a standalone experience meant to entertain the masses. I see the film as an outstanding return to form for actor Bruce Willis (Die Hard, Hostage) and director Eli Roth (Hostel, Cabin Fever), both having released some not so great features as of late. I grew up in a household where Die Hard was a Christmas time staple; Willis has always been the epitome of what a man’s man looked like, and Roth has been a personal hero with his catalogue of quirky yet thrilling horror films, serving as one of my biggest inspirations when pursuing a degree in special effects.While the film is a remake, it takes some liberties by making our protagonist Paul Kersey (played by Willis) a doctor while retaining the traits of a loving family man; the opening of the film shows that he shies away from conflict. After being called into work at the wrong time, he is stricken with grief over the death of his wife and the fact that his daughter is laying in a coma due to a home invasion gone wrong. With the police department failing him, a random chain of events sets him down a course where he spends his nights (or days) seeking justice.As most revenge tales are, the film is a bit predictable. Most of the tension comes from wondering if Paul will find his family’s assailants, be caught by the police that are seeking him out after his first encounter goes viral, or if he’ll simply be killed, because John McClane he is not. Having most of his experience gained from online videos, he does come across as a bit clumsy at first, but in a rather quick time, he’s popping off headshots left and right. Willis does not disappoint when playing either part, but clearly is having much more fun playing the bloodthirsty version of the character.His escapades quickly gain the attention of the media, some of which condemn his actions, while others praise the character giving him the moniker “Grim Reaper.” While I in no way condone murder, the movie paints a pretty poor picture of the local police department while portraying a realistic approach to the events had this happened in a non-fictional context, since we live in a world where people rely too much on the police to protect them with a legal system putting the criminals’ rights first. Sure, there are a few “WTF” moments, such as how someone would acquire a fully automatic machine gun legally, but the overall film works.While the film is gory, with Roth’s background in horror shining through with a number of practical effects whenever it fits the story, it is nowhere near as gruesome as the reviews make it out to be. That said, many of the bigger deaths in the film are depicted in a much more entertaining way than other action films, which tend to have someone being shot and falling over, rinse and repeat. Paul even goes as far to use his medical knowledge to torture one of the criminals to the audience’s delight. The previously released Death Sentence, which is another remake of sorts of the same film, had much more gore shown front and center, with a much higher body count, and it received none of the backlash that this film has.Death Wish isn’t going to add much to the revenge film genre, but it does provide an entertaining way to spend 2 hours. While the original film appears dated 30 years later, the remake does the namesake justice and should not be missed, despite many of the critics saying otherwise."}, {"rating": "8", "text": "If you like John Wick and Max Payne, you'll love this film. Bruce Willis is back with a vengeance and it's good to see him shine in a good movie again. I always liked Eli Roth as a film maker and this one doesn't disappoint again. Both thrilling and action packed, while not taking itself too serious all the time. Gets the balance right, aside from a few moments where the acting goes a bit too over the top for my taste. All and all I very much enjoyed this film and would recommend it to all action lovers. Too bad to see so many critics have lost their sense of humor. But I'm glad this movie has been made, just to kick against their holy houses. Just very sad to see these critics devalue this movie to give them some easy and cheap moral brownie points. Hope it scored well with their quasi intellectual blogger friends. Go see it and make up your own mind, I would say.."}, {"rating": "7", "text": "Dr. Paul Kersey is a surgeon who often sees the consequences of the city's violence in the emergency room. When home intruders brutally attack his wife and young daughter, Kersey becomes obsessed with delivering vigilante justice to the perpetrators. As the anonymous slayings grab the media's attention, the public begins to wonder if the deadly avenger is a guardian angel -- or the Grim Reaper itself. For me, it was really surprising and was hands down my favorite movie in the series. Final Grade is a B+."}, {"rating": "10", "text": "Death Wish is just as funny as it is a dark action splatter. Dr. Paul Kersey becomes a self-taught vigilante to avenge the murder of his wife. The even paced Movie manages to pull you side to side from action comedy into ruff horror scenes."}, {"rating": "9", "text": "I Love the movie I saw the older one a 100 times or more and this one I loved too I loved the man that played Frank his brother I saw him on Law and order he is the one of the best actor's he needs another show of his own!!!"}], "recommendations": ["four_brothers", "rambo", "taken", "peppermint", "guns_akimbo", "assault_on_wall_street", "repo_men", "the_purge_election_year", "the_punisher", "taken_2", "london_has_fallen", "punisher_war_zone", "machete", "cold_pursuit", "bright", "brightburn", "limitless", "nobody", "taken_3", "the_equalizer", "equilibrium", "olympus_has_fallen", "chappie", "the_mechanic", "shooter"]}