{
  "id": 1276,
  "title": "Death of Me",
  "starring": [
    "Maggie Q",
    "Luke Hemsworth"
  ],
  "runtime": 95,
  "genre": [
    "Horror",
    "Mystery"
  ],
  "description": "A couple on holiday on a remote South Pacific island awaken one morning with a hang over and no recollection of what transpired. When playing back a video of the previous night, they see they participated in a local ritual that somehow ends with him murdering her.",
  "releaseYear": "2020",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/8F9xUvb1JMWUMkFV2Yq3aiueAbq.jpg",
  "categories": {
    "plot": 10.0,
    "acting": 10.0,
    "ending": 10.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 5.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "10",
      "text": "I just watched this one last night and I really liked it. The photography was beautiful, looked like the same islands they shot Man With the Golden Gun (I love James Bond films). This psychological thriller had lots of twists and turns and I cared about the characters, even the \"bad guys\" had a strong point of view that I understood. I spent a couple of hours after discussing it with a couple of friends that watched it \"virtually\" with me. It really is that good and is worth discovering for yourself."
    },
    {
      "rating": "10",
      "text": "I've been a fan of Darren's work for years - St. Agatha is probably my favorite film of his. Like that one, this has a lot of psychological horror to it and a very twisty plot. The setting for this is much more picturesque and I loved that they seemed to use local talent to fill out a number of supporting roles and give the film some authenticity. SPOILER ALERT!  I have to say, I've read some of the reviews that accuse the film of falling back on the \"evil native\" cliche of films from the 90s and the Hostile movies, but I found the natives to have a true point of view in this film, and were actually the heroes in the end where Maggie turned out to be the villain - not believing and causing the island to get obliterated.  It's this turn that actually made the ending stronger for me than in the Wicker Man where the natives were the villains through and through and burning the cop in the end didn't have any real effect.  These islanders and their families would have all been saved if they succeeded in the sacrifice.  I've read a number of reviews and none of the critics seemed to pick up on this mislabeling the natives as the villains -- this may have been the fault of the filmmakers for not being clearer - I don't know. I've asked my friends to watch it because I need to discuss this with someone rather than just read a bunch of reviews.  I feel there's something really smart here that some have seemed to miss.  Nevertheless, it got me thinking which is rare for a film these days (happens more with TV). In any case I liked the film, good job to all involved with it!"
    },
    {
      "rating": "5",
      "text": "Wickerman on a Thai Island as female traveller and her husband are drugged, he impregnates her, chokes her to death, guts himself and then the islanders try to sacrifice her so they can stay healthy and avoid typhoons."
    },
    {
      "rating": "4",
      "text": "It borrows too many cliches to feel interesting.And freshness was the least of its problems, and still fails to overcome its own barrier of mediocrity"
    },
    {
      "rating": "10",
      "text": "I read a bunch of reviews for this, seem to be more positive than negative contrary to what I'm seeing here so I went in with high expectations. I watched this film on Friday night and it's been marinating since then and I do believe this is one of my favorite films of the year. It seemed like a tense ride at first but there are things that just stick with you, images, performances, story points.  This movie really grows on you and now I find myself needing to watch it again to appreciate all the twists and turns.  I think some of  this comes from it not being what I expected. I read a lot of comparisons to \"Midsommer\" and this one cut to the chase right off the bat. Just dove right in and was nonstop tension. Maggie Q of course delivered but what look like local actors - there was such personality and authenticity rather than a bunch of people that \"looked like actors\".  Then the was the story. Some have said a bit predictable at times, but there were some great twists and turns.  Overall, do yourself a favor and watch this, preferably with some friends because there's a lot to discuss and unwrap after."
    },
    {
      "rating": "10",
      "text": "Loved this movie!  Got going right away and never let up!  Good twists at the end and I have a feeling this will stick with me for a while!  I’m a big fan of St Agatha like some of the others who posted here and this is a wonderful follow-up to that film!"
    }
  ]
}