{
  "id": 2395,
  "title": "Death Note Relight 1: Visions of a God",
  "starring": [
    "Keiji Fujiwara",
    "Aya Hirano"
  ],
  "runtime": 130,
  "genre": [
    "TV Movie",
    "Crime",
    "Drama",
    "Fantasy",
    "Thriller",
    "Animation"
  ],
  "description": "Yagami Light is an ace student with great prospects, who's bored out of his mind. One day he finds the \"Death Note\": a notebook from the realm of the Death Gods, with the power to kill people in any way he desires. With the Death Note in hand, Light decides to create his perfect world, without crime or criminals. However, when criminals start dropping dead one by one, the authorites send the legendary detective L to track down the killer, and a battle of wits, deception and logic ensues...this was aired on Japanese tv shortly after the death note anime was completed, this special basically re-cuts the first 26 episodes of the series into a two hour movie with some new scenes and dialogue added and the story is seen from ryuk's viewpoint.",
  "releaseYear": "2007",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/bB22CJM8arCCRvjFedmH5qtsbHb.jpg",
  "categories": {
    "plot": 3.328358208955224,
    "acting": 3.66,
    "ending": 3.3529411764705883,
    "soundtrack": 3.5,
    "cinematography": 6.0,
    "familyFriendly": 3.0,
    "funny": 3.625,
    "action": 3.5555555555555554
  },
  "reviews": [
    {
      "rating": "2",
      "text": "The movie broke all the characters from the anime and made them into worse versions. As a movie it failed to deliver the actual moral of the story in a good way. Summed up the movie was a gore-turn-on-fiesta for the two main characters."
    },
    {
      "rating": "5",
      "text": "You know, I had the smallest of hopes for this movie. However, it just ruined everything what made Death Note great. Pacing is too fast, Characters aren't likeable or people you can sympathise with unlike the manga, and it's just a mess, but I am not going to lie; it was an entertaining film to watch. It was cool seeing how the setting was adapted into an american highschool, and William DaFoe was a great casting choice for the film. Talent is certainly there, the actors are just let down greatly by the writers. Effects are pretty nice as well. Otherwise, it's a painfully medicore attempt at trying to \"adapt\" and westernise a great Manga/Anime series, simillar to what Ghost in the Shell was back in March. The film certainly had potential - and could have been great. But, that's where it failed."
    },
    {
      "rating": "5",
      "text": "It's worth a watch, but its logical inconsistencies may turn off fans of the original. It's not The Last Airbender or Dragonball Evolution levels of bad, but it does dumb down some of its source material to fit the 101 minute running time....Part of the original's strength was that, although supernatural elements existed, there were clearly defined rules, and every move the leads took was intelligently calculated. These rules are changed in this adaptation somewhat, most notably, a specified cause of death now needs only to be \"physically possible.\" By that logic, why doesn't Light just make one of his victims draw an exact copy of L's face and name? For some reason, this never occurs to Light, probably because he too has been dumbed down. What made him so interesting in the series, in addition to possessing a genius level intellect, was that he was a model student; not someone you'd suspect of serial murder. Here, they made him into a troublemaker from the start, and he makes idiotic mistakes like openly reading and talking about the notebook in public places. Heart attack is not the default cause of death as in the anime, resulting in an unnecessarily gory film. Misa wasn't a strong character in the source material, and I have no idea why they tried to make her a pseudo Lady Macbeth here. It's almost as if she's making Light do these things, rather than focusing on his descent to evil....The setting change didn't bother me, because the story of Death Note could have happened anywhere. The characters, however, are often so different from the originals that I wonder why they bothered keeping their names. The real stars of the film are William Dafoe as Ryuk, (he's perfect in anything sinister to cartoony levels,) and Keith Stanfield as L, (he captures the air of his source character remarkably well.) The real problem is the short run time, which forces the plot to move at breakneck pace, and does not allow for the methodic intellectual chess game between Light and L. There's enough here to make me believe the actors could have made this shine through, but not with 1 hour 40 minutes. Instead of sequel baiting, perhaps more focus should have been placed on creating a better film....All that said, I was still able to enjoy myself watching this film, and that's because the concept is really good. What happens when a teenager is given the power to kill? At the very least, we get an answer to that question when the power falls to a cringy punk. As you might expect by the run time, it starts going bad for him pretty fast. The effects were decent, though more practical effects for Ryuk would have been appreciated. The music was hit or miss. I think if they slapped another hour on to really develop these characters and the plot, or cut Mia's character entirely, we could have had a better film, but as is, it's passable. Average."
    },
    {
      "rating": "4",
      "text": "The issue with Netflix's death note is its failure to turn death note into a prime time basic television Teen audience show. The movie feels like this type of show which would run for a couple of seasons crammed into an almost two hour movie. You will feel all of the hour and forty six minutes as this movie has nothing to keep you enthralled. No sides to pick. The movie doesn't know if it wants light to be the ultimate evil or good and doesn't give you any other side to root for if you find the anwser yourself. light has no charisma or strong motivation, he does not captivate. In the original series Death note, light has the strongest charisma and clear and defined motivation. This gave viewers a chance to either be hypnotized or completely turned off by him. There is none of that in this movie. Light is said to be very bright multiple times but is never shown to be bright outside of math problems or doing homework for other kids which ends up with him getting caught and getting sent to detention (not very bright). So the movie lacks any genius plans or long thought out killings for the viewer to follow and figure out or be suprised by. This in turn creates another issue for the opposing force of L. L is never given any challenge or run around to solve and so his character is weakened because his defining factor,his supreme intelligence is lost as his quirks of eating candy,sitting positions, and matter of fact social awkwardness actually define him and so he is seen as a Weirdo who makes pretty obvious conclusions and is quick to anger instead of the cool and calm super genius who is going toe to toe with Kira. Misa or Mia in this movie is a step up from her air headed idol self to a cheerleader who is more of the i cheer cause i want to and smoke cigarettes while doing it type than the typical pretty and popular. I believe this character would have been more interesting as the main character. Mia is introduced to the death note by light and becomes addicted to the power of it. pushing light to do more killings and then working killings on her own. I think her power craze would make for a more interesting story then the typical western issue of tap dancing between morality with power. Finally Ryuk is the saving grace of this movie. A perfect adaption, ryuk's love for carnage, apples, and unclear motivations or loyalties shine through perfectly. Ryuk is for the most part hidden in shadow or unfocused lens but when shown his CGI is very well done. I hope this isn't the last we see of His live action character because he could be wonderful in better mediums. In summary, Netflix's death note is a shallow adaption of one of the greatest Suspense Thrillers in the world, with a weak main character in light who's addition to the plot seems to be the name connection to the original character, the naming of the villain Kira, and a very weak challenge for L to figure out. Weak and misused side characters and no one to root for, Watch this movie for ryuk and some interesting aesthetics, otherwise there is nothing here for even a boring rainy afternoon."
    },
    {
      "rating": "10",
      "text": "My wife left me.    :("
    },
    {
      "rating": "5",
      "text": "This film is far less awful than the flood of incensed fan reviews suggests; that's not to say it's very good, or even holds a candle to the source material (which I loved). It's seriously hurt by a 90 minute runtime which makes the story almost incomprehensible, and a script that's trying way too hard to be \"American teen movie\". Netflix's Death Note isn't completely without its moments though! There's some great performances (Ryuk and L mostly), and stylistically it's definitely cool. Ultimately, just another entertaining but forgettable popcorn movie, with a frustrating amount of wasted potential."
    },
    {
      "rating": "5",
      "text": "Bottom line, this movie needed to be a miniseries and not rushed into roughly an hour and a half movie.   The pacing was too fast and it doesn't allow you to really connect with any of the characters in the movie.  Another problem I had with this adaptation, which is what most people will point out is that they fundamentally changed the core attributes of the characters that they adapted from the anime series.  For instance, Light was smart, but he wasn't genius level smart like he was in the anime series.  He also wasn't very confident and the way they approached being \"Kira\" was completely different.  Light, in the anime series, was all about creating and being the god of this new world order where crime will essentially be eliminated, and nothing and no one would stand in the way of that.  This Light, just didn't have the stomach for it.  Not to mention, Light, in the series, was the epitome of what every man wish they were, and every woman wished they were with.  Light. in this movie, was remarkably average; even down to the reason for why he continuing to use the Death Note and pursued this life as Kira, all to impress a girl (Mia).  What really made the anime series shine though, was the way Light and L danced a mental tango where Light was trying to either find a way to eliminate L or convince L that he wasn't Kira and L trying to get L to slip up so to confirm his suspicions that Light was Kira.  In this movie, not so much; L confronts Light at a gelato shop, where he breaks Light to into letting it slip that he was Kira.  This movie would have been better served if they cast a better Light, and didn't write him as such an unconfident wussy.  Also, in the series, Ryuk and Lights relationship wasn't as adversarial as it was in this movie.  In the series, Light and Ryuk was there for some side commentary and answer any questions that Light may have had in regards to the Death Note.  In the movie, they really didn't like each other.  Ryuk was the true star of this movie and because they played the relationship the way they did, his screen time was pretty limited. All in all, it's going to upset fans of the original anime series.  To the point where they will flat out give this a \"0\" because of those differences.   I think if you come in, never seeing the anime series, you'll find this movie to be remarkably average.  That's why it's getting the oh so average score of a \"5\"."
    },
    {
      "rating": "4",
      "text": "The cultural phenomenon known as \"Death Note\" is a lot of material to try to turn into an hour and forty minute movie. So what we end up with is a film that goes for cheap thrills instead of a truly satisfying adaptation. You aren't going to get all of the well thought out twists and turns, shocking reveals, or deep looks at the characters and morals of the story. You will get treated to some gory kills and surprising sense of humor though. This is the kind of thing that is sure to break the hearts of longtime Death Note fans, likely regardless of how much of an open mind they have going into this. The movie's baffling tone and angst-driven teenage romance are just likely to turn of those who have not experienced the manga/anime.Adam Wingard seems to be content with almost parodying the source material. Rather than focusing on twisted, complex characters and the dark motives of it's lead character the movie is perfectly content to have us laugh at everything going on. I could deal with a more self-aware style that's willing to poke some fun at itself, but I can't tell if a lot of the humor was intentional or not. Is the movie actually trying to not take itself seriously, or failing miserably at delivering tension and thrills? Regardless of which is the case, the movie is funny for all of the wrong reasons. The more action-packed conclusion the film has does lead to a nice little twist though. So there is some payoff in the end.While Wingard can't carry the story or tone necessary to keep things afloat, he does deliver some visuals. The gore is ridiculously over-the-top, adding to that possibly unintentional comedic feeling the movie has, but it's still pretty entertaining to watch. Ryuk looks great and his scenes carry a cool mix of creepy and playful. Probably the thing from the anime and manga that the movie gets the most right. I also have to praise the casting. Nat Wolff, Lakeith Stanfield, and Willem Dafoe are pretty great in their roles as Light, L, and Ryuk respectively even if they aren't playing the same versions of the characters many of us know from the source material. Stanfield even manages to nail some of L's mannerisms. We also have Shea Whigham in a nice and very likable supporting role to help back things up.In the end though the strong cast can't make up for the lackluster writing. This also just isn't a good adaptation of the source material. It's a bad movie, but it's a watchable bad movie. When all is said and done I couldn't tell if I was laughing with it or at it, but it still managed to make me like a few of these characters who are basically originals despite having the recognizable names. I don't recommend watching it. Especially not if you are a fan of the real Death Note story. You won't be bored if you do decide to check it out. Just disappointed. There's so much more that could have been done here and better.4.5/10"
    },
    {
      "rating": "8",
      "text": "These bunch of 0 scores are ridiculous. Objectively speaking, the only issue with this movie is the acting of the main character. It is a bit weird, but it is decent.  Everything else about the production seems good to me: special effects, gore, photography,  camera angles, slow motion.  People are just pissed about the adaptation (and the movie is based on the anime, it is not an adaptation) because they wanted something more similar to the anime. And because of that they are looking for excuses to tear the movie apart. The main character here has a different personality (he is not a villain like in the anime) and some other things about the base story are changed, but it is still pretty good, interesting and entertaining.  I liked L and Ryuk a lot.  Characters were interesting and well developed.  I would have liked a little bit more of strategy fight among the antagonists. I think the movie did a good job preserving the core aspects of the original work while bringing something different, american-style."
    },
    {
      "rating": "4",
      "text": "I felt the movie rushing to cover all of the anime materials and failing at all of them. Have to admit it was a good effort but a bad idea to put such a deep story into a movie. When I say \"good effort\" I mean average actors, dialogs and direction but not awful."
    },
    {
      "rating": "8",
      "text": "For somebody who has never seen the Anime version of the film I found it quite amusing. I enjoy movies where we get to watch somebody play god. Willem Dafoe portrayal of Ryuk was as usual awesome for a bad guy with his voice. As far as the protagonist and his girlfriends love story was concerned, typical. The ending I did not care for, as it left a bunch of open ended questions.  However I enjoyed watching it, the mystery, the fantasy, the lore, I enjoyed it all and that is why I am giving it a high score. I also like most movies Dafoe plays the villain."
    },
    {
      "rating": "5",
      "text": "It started good for me, but went down after 30 min... Qualley is beautiful and good but jeez... it started nicely done...why?"
    },
    {
      "rating": "0",
      "text": "The worst movie ever after watching the the series..Don't know why these idiots made such kind of movie...They should have copied the whole context..So it would be more pleasant."
    },
    {
      "rating": "4",
      "text": "As with most American adaptations of anime, they completely missed the mark on what makes Death Note interesting. The anime had (at least for it's first half) an extremely tense game of cat and mouse being played by characters that were incredibly intelligent and purposeful in their actions. This movie was a couple of boys that were kinda angry at each other yelling for a little bit, while Ryuk went from a sinister trickster into some sort of horror movie knock off demon. Definitely skip this unless you're super curious how much they could have possibly missed the mark on this."
    },
    {
      "rating": "6",
      "text": "Expecting a movie with a run time of less than 10% of the source material while still expecting 100% of the story is not only asinine, but inequitable (note this is the issue with most reviews under 5). The team led by Adam Wingard showed a considerate and attentive effort on reducing a complex story reliant on long term character development down to a short 1.5 hours. The real tragedy here is not that the story failed to be a copy and paste effort from its Japanese material, but instead that this adaptation was not expanded into an episodic series. I would have loved to see more of Willem Dafoe as Ryuk and to see a more subtle progression of Light turning towards Kira, but cuts and alterations to the story needed to be made in order to create a coherent and enjoyable movie. Hardcore fans will only enjoy scoffing at the inconsistencies from the anime or manga, but if you enjoyed Death Note casually years ago or are unfamiliar with the source material, then I would suggest giving this film a shot. Don't let the fanatics sway you away because this American version of a Japanese manga doesn't unrealistically follow the source material religiously. Not the greatest film, but it is certainly nowhere near the Dragonball Evolution levels the current rating suggests."
    },
    {
      "rating": "8",
      "text": "I'm familiar with the source material and think credit should be given to this movie considering the audience it's catering to and the running time. As a Netflix show success means lots of repeat viewings by all types of viewers and I think it makes for an entertaining 100 minutes that you can watch on a Saturday with friends.Even the Death Note creators approve of it for what it is."
    },
    {
      "rating": "4",
      "text": "Après le manga et plusieurs adaptations japonaises au cinéma, le fameux Death Note part aux USA pour un nouveau film qui voit et revoit à sa manière les évènements du cahier de la mort. Une nouvelle adaptation qui démarre fort bien ma foi, puis se prend les pieds dans le tapis alors que les rebondissements se succèdent, de plus en plus incohérents...Je me demande pour ceux ou celles qui ne sauraient rien de cette histoire étrange, n'ayant rien lu ni rien vu s'ils entravent quoi que ce soit à ce bordel géant qui survient dans le dernier tiers du film. La fin du manga est d'ailleurs assez foutraque à cet égard mais ce n'est pas aussi aberrant en comparaison de ce scénario qu'ils ont écrit à trois : ils n'ont pas dû s'y retrouver eux-mêmes, ceci expliquant cela dans doute !Notons néanmoins que la réalisation est de bonne facture et qu'on ne s'ennuie pas le moins du monde, y compris dans la confusion très ambiante. Côté distribution, le petit gars se débrouille bien, de même que sa jolie copine (on dirait une petite soeur d'Eva Green !) mais pourquoi \"L\" est -il devenu un homme de couleur qui vit au Japon (?) se téléporte à Seattle et devine tout plus vite que la lumière...? c'est n'importe quoi.Bref, quel regrettable manque de rigueur ici et on préfèrera de loin les adaptations japonaises, bien plus claires et maîtrisées que ce Death Note américain, et c'est décidément bien dommage, car le sujet en lui-même reste toujours aussi fascinant."
    },
    {
      "rating": "4",
      "text": "As an adaption of Death Note, it's a 1/10. As a film taken on its own, it's just a mediocre Tween Romantic Thriller with a Death Note skin. Some of the ideas this film presents are interesting taken in abstract, but it's definitely avoidable as a whole."
    },
    {
      "rating": "4",
      "text": "Some parts are okay, some parts are cringy and some parts are awful -- really awful. I did enjoy watching it, but I couldn't deal with the fast pace and the weird relationship in this adaption of Death Note. A series might have been a lot better."
    },
    {
      "rating": "8",
      "text": "A little different from the anime and little fast paced, but it had to be done so it would work as a movie, but still a good movie. Hope there will be a second movie."
    },
    {
      "rating": "5",
      "text": "This movie is sadly and painfully casual in almost all aspects of it. It has to many tags such as: Mystery, Horror, Adventure etc. which a lot of those is not! The directing style is also clumsy and nothing out of the ordinary. A lot of third person shots from Ryuk's perspective, when he is not even there and it's useless. I didn't feel like the movie had pacing issues or dragging with the story, everything happened and unfolded right away, which was a god thing considering that it became boring pretty fast. The actors performance was almost the whole time exaggerated and broke off the little immersion the movie had. It wasn't very fun to watch neither entertaining. Also the 80's-90's styled music felt too forced and didn't fir at all the movie's environment and it's dark vibe. But the visual effects really looked good so credit is due there. Every single decision in the movie felt without consequence despite it's dramatic ending, which you could foresee almost from the intrigue. Also the plot was awfully simple, and louzy, but at least it wasn't cheesy. There is no humor in the movie which concludes to the fact that it takes it's self to seriously. There is a stable conclusion at the end, but it's just not enough to save the movie. So overall it's a painfully average movie, with almost every single main element being fundamentally flawed and broken. And my average rating is for the movie aspects only and not even considering the Manga on which is based on, and the accuracy of it, because then it would be a much lower rating."
    },
    {
      "rating": "4",
      "text": "Quite disappointed by the movie, there are some aspects of Light's personality that definitely are not form original character, making him look ridiculous and annoying. I liked Mia though, she had an interesting development through the film. L... I better don't talk about such a parody of original character, being just another annoying child. In resume, one can end up enjoying the film, but it's far away from the anime or manga and accept weird decisions, hope they fix them in next movie if there is one."
    },
    {
      "rating": "10",
      "text": "Im not entirely sure people know what \"adaptation\" actually means. Movie didnt deserve so much hate reviews . Despite some flaws in the plot, im still looking forward for a sequel."
    },
    {
      "rating": "4",
      "text": "While the reputation is not as bad as critics and fans made it out to be, as someone that has not seen the anime, it's interesting but it has a ton of bad ideas! For one the pacing is rushed where it felt that the writers had to shove a ton of episodes in an hour and a half runtime, while also dragging and it feels like it is a lot longer than it should be. Not to mention that the main romance between Light and Mia feels forced and unnatural and all to conventional for the movie's own good. Hell having the romance being the central part of the movie instead of the titular book itself and the cat-and-mouse game between Light and L is honestly the worst decision they could have done. And with dialogue that is over-written and constantly on-the-nose it comes off as laughable as putting 80s soft-rock in integral scenes in the movie, especially towards the end with laughable uses of Chicago and Air Supply!There are some good here. Willam Dafoe as Ryuk and Lakeith Stanfield as L are good here, there is a few stylish shots and lighting that is alright, the gory death scenes are fun, and the soundtrack by Atticus and Leopold Ross does add a bit to the movie's atmosphere, but the movie has some serious issues with the movie's foundation that really on it's own just does not work. I doubt that the anime is like this, in fact I feel that the romance is a movie only idea, and really this might have been the best Netflix could have hoped for when making a Death Note movie based on the anime's premise alone.If there is one thing that the movie does right, it is getting my curiosity for the anime to peak and I do want to check it out. Unfortunately to see how superb the original is!"
    },
    {
      "rating": "4",
      "text": "It was an OK movie, but it really wasn't Death Note at all. I understand how a reboot works, but the main characters were too different (not related to one being a white american or black) from the original ones. - Kira is not the perfect student in his school that gets a notebook that makes him think that he's a god.- L is not really weird and thinkative like he should be. Instead, he's more emotional and jittery.It's like another story in the world of Death Note. It's like... they just gave up to get a wider and younger audience to like the movie. They will think \"Oh, Kira is awesome, he thought all that in the end\" but we will know that Kiran and L were a lot more awesome in the anime.Still, L's acting was pretty good. Kira felt like... just a spoiled child ranting."
    },
    {
      "rating": "4",
      "text": "Se pasaron el anime por el colo, la película estuvo entretenida además mia estaba super buena, ella era el propio lyght y lyght era un retrasado, el no era lyght. ryuoh estaba hecho con Paint."
    },
    {
      "rating": "7",
      "text": "I am going to start out by saying I have not watched the anime but know of it.  With that being said I enjoyed the movie but it did leave me asking more question then I had to start with like why does L know how to use the death note.  Why leave the movie in a cliffhanger.  why was it everything rushed would have like it to a little more played out.  overall i rate this a C+.  Think about this movie as a pg 13 verson of final destination."
    },
    {
      "rating": "7",
      "text": "I liked it. Get over it. When critics and fans say they hated the new Death Note, I feel they set their expectations too high. The movie dared to be different, even from the casting choice. If you don't like action packed, cheesy and an original interpretation of Death Note, this is not for you. Death note has many adaptions and it is time for fans to accept a different, at times cheesy in terms of acting but unique movie. And I feel people will understand it more in the years to come. I loved the original Death Note and enjoyed this movie too.Pros: The twist is interesting. It takes liberties with the rules. L and Ryuk are amazing in this, and the actor for L clearly understood the character. There are new intense moments that give this movie a unique style.Cons: It is short, so the story is a bit rushed. Very cheesy and some scenes are either ironically or unironically played for laughs. Nat Wolff as L is a decent actor, and a lot of the lines are filled with a lot of cursing but if you accept what this movie is and what the NEW characters are trying to be, you'll accept it.Death Note (Manga and Anime) and Death Note (2017) are very different mediums. Go in with an open mind. Everyone automatically hates the 2017 version, if you go in hating it, then what's the point of watching it? Give yourself a new perspective on a movie that already has a majority consensus, you wouldn't be adding anything new to the table."
    },
    {
      "rating": "7",
      "text": "Film animesiyle hiçbir alakası yok akıl oyunları karakterler hikaye nerdeyse hiç uymuyor hiçbir bekletiniz yoksa izlenebilir ortalama üstü bir film.ehh yani işte çokda birşey beklemeyin"
    },
    {
      "rating": "7",
      "text": "A great movie, plus a bad adaptation. It is very different from the anime, but it has its ups and downs, the anime is very intelligent and very intellectual, the movie, no..."
    },
    {
      "rating": "0",
      "text": "dürüst olmak gerekirse film bok gibi ama bok diyecem boka yazık olur sırf bu film yüzünden netflix kullanmayı bıraktım aq netflix demişki \"bakın çok sevdiğiniz manga ve animenin içine edicez\" demişler abi ana karakter zeki karı kızla işi olmayan bir elemandı bunda gitmişler mal am hayali kuran birine dönüştü ulan orijinal light mezarında ters döndü aq aynı şekilde L de öyle abi L denen adamı zenci yapmak kimin fikriydi amk he bide belki bu boka devam eder belki diye önemli karakterleri öldürtmediler amk hee bide ryuk sen hadi animede en azından sempatik biriydin bir tarzı vardı ulan filmdeki katıksız orospu çocuğu aq misayı mia yapmışlar bide hayır bide mianın ikinci kira olmasıda komik light:aaa bak mia bu deftere adı yazılan ölüyo mia:hadi sikişelim bu filmi onaylayanın yapanın yönetmenin netflixin hepsini zenci siksin amin"
    },
    {
      "rating": "0",
      "text": "Horrible and despicable. Honestly, I don't think the people who made this even watched the original Death Note."
    },
    {
      "rating": "0",
      "text": "Netflix had to ruin a good anime"
    },
    {
      "rating": "0",
      "text": "Se a métrica de avaliação desse filme, fosse ele ser mais um escolar americano genérico, ele poderia merecer até um 6, mas não, a proposta desse filme é adaptar uma obra investigativa que já existe, já é consolidada, e é considerada uma das melhores do gênero Seinen, então ele merece ser avaliado a partir disso, e dessa perspectiva, o filme parece uma sátira do original, onde está recheado de estereótipos escolares americanos, com os personagens principais tendo o mesmo nome do original, mas com as personalidades completamente opostas, isto parecendo uma piada de mal gosto do roteiro com a cara do público que é fã do original"
    },
    {
      "rating": "1",
      "text": "a really bad adaptation, a poor history, is a disrespect to the characters and the essence of the original material."
    },
    {
      "rating": "1",
      "text": "Аниме было довольно неплохим, а фильм ужасен. Лайт в нем тупой, цель Рюка не ясна, кира никак тетрадь не прячет, эл истеричка хотя в аниме он был спокойным и очень умным детективом."
    },
    {
      "rating": "0",
      "text": "Hot Garbage. So many inconsistencies in the story writing. Please watch the anime instead. Please watch the anime instead. Please watch the anime instead. Please watch the anime instead. Please watch the anime instead. Please watch the anime instead. Please watch the anime instead. Please watch the anime instead. Please watch the anime instead. Please watch the anime instead. Please watch the anime instead."
    },
    {
      "rating": "0",
      "text": "Oh boy where do i start?, There are so many things wrong with this movie i cant even begin to tell you about my frustration. The movie in no way properly follows the anime. There are rules of the death note that were changed in the movie like the fact that only the death note keeper can see a death god when in fact anyone who touches it should of been able to see ryuk. The characters in the movie are not even the same race as the anime. And yes i know they arent japanese but for Fu*** sakes why did they make L a African american? I'm not racists but cmon! They barely show ryuk at all in the movie probably because Netflix has a poor CGI budget or whatever. Most of the story is stretched out for no reason in a ton of boring scenes that lead to nothing but a small 2 minutes of dialogue. I wont even bother reviewing the rest of the movie because its all pointless, the movie sucks end of story and is not even worthy of having the Death Note name."
    },
    {
      "rating": "0",
      "text": "Absolute garbage. I do appreciate that they tried to take many ideas from the animé. They get the basic concepts correct, but the changes to the plot of the source material are unforgivable. Some of the changes were made to create completely unnecessary plot twists which were vastly different from the animé, and ended up being your standard horror clichés. Ryuk was also a lot different from the animé and manga despite being the single element that remained mostly intact. In the animé he acted like he didn't care about what happened with the Death Note, and that made him even more likable as a character. In this film he's portrayed as having sinister urges for how he uses the Death Note, as if he was actually a demon or some kind of evil entity. Ryuk seemed far more neutral towards everything on the show.Light acts like an irrational dunce compared to his criminal mastermind version from the show. Misa, or \"Mia\" in the film, is much more sadistic and conniving than in the animé. Even L has a personality change, but most of his mannerisms remain the same. He too lets his emotions run wild, which is a huge departure from his cold and calculating nature on the show. This is mostly the result of an overly elaborate plot twist that is such a sharp deviation from the source material it makes you wonder if the director even watched the whole series. They also continue to cram in needlessly complicated plot devices that have no place or purpose in a supernatural detective story. On top of that, they keep ripping off various other horror films, and it feels like more of a horror film than a detective story. This is probably their greatest sin of all because it utterly destroys the tone that made the animé so unique to watch. It just becomes another disposable American horror movie which is definitely not what Death Note should have been like.This was easily the worst live-action adaptation of Death Note, and possibly the worst live-action adaptation of any animé period. I didn't think it could get much worse after Ghost In The Shell, but Netflix had to prove me wrong. Hollywood seriously needs to leave animé alone forever."
    },
    {
      "rating": "3",
      "text": "This movie was just an awful adaptation. Light's and L's characters are just terrible and tries to hard to play their roles. Ryuk is kept in the dark for some reason like we don't already know what he looks like.The deathnote isn't being used correctly, in the anime anyone who even touches a small piece of paper from the notebook could see the shinigami who originally owned it, not in this movie though, and he barely uses the note to kill them in a way that makes it traceable, all the heart attacks in the anime make the police force think someone is intentionally killing criminals but in this movie he uses decapitation, stabbing,and other ways to kill the criminals but to make kira known to the world light makes criminals write Kira on their cell walls like a **** moron. Mia has the mindset of kira more than light himself does in this movie. In short this movie is a weak adaptation to the anime/manga."
    },
    {
      "rating": "2",
      "text": "It could have been decent but wasn't. Poor adaptation which turned the characters into cardboard. Suspension of belief is one thing but the characters need to react to situations with some degree of authenticity. The acting was shockingly bad. The director has to take the blame for that. Very poor."
    },
    {
      "rating": "2",
      "text": "Death Note starts with a simple premise, what if you discovered a book that could kill anyone by writing their name in it as long as you know their face? Sadly, this is not a horror movie. I am actually not quite sure what it is trying to be. It mixes together action and horror with a touch of mystery. But, the worst offender is that no one bothered to watch the movie to check for inconsistencies in anything. The entire movie just feels like an inconsistent mess to me.Right from the beginning, there is a huge inconsistency. The Light Turner we are presented with is not a killer. In the first moments of the film, he stands up for himself only to get beaten up and abandoned by the person he protected. Moments later, he and the girl he protected, Mia, are teaming up to kill people. This feels completely out of character since Mia completely ignores him after he saves her and walks away with I think the guy who punched him in the face only reinforce the fact that Light would probably refuse to listen to Mia at all. The fact that Light was scared **** by the use of the Death Note makes it seem like he would not be using it any further and would turn it over to his father or back to Ryuk just to get it away from him.Other inconsistencies include not needing to know Watari's real name to control him. Apparently his business card that probably says Watari instead of an alias on it is enough. Everyone draws absurd conclusions super fast (example will come below).On top of that, our ace investigator in L is someone who loses his cool very quickly and easily and feels more like a stereotypical black teen than a great detective. We also never really see him do much detective work. All he tried to do is draw out Kira by appearing on television and then assuming that Kira needed a name and a face to kill. I do not know how he reached that conclusion along with many others that he makes.The unbelievable plot then makes matters worse. The Death Note can make the impossible possible, which takes out a lot of the suspense. On top of that, everyone seems to know what will happen next. Light, L, Mia, and James (Light's father) all draw absurd conclusions from random tiny things that makes you wonder how it happened. For example, James says he knew Light was the killer when the first victim was the person who killed Light's mom. The problem is we see Light use it before. We have evidence others have used the Death Note before. The climax and ending further cheapens it by showing that Light manipulated everything for like the last forty minutes. In the end, Ryuk's role makes this film seem like a cheap horror movie where people are tempted by the supernatural power of an object that he then takes back and gives it to another. Except in this case, the motivation for them to use it makes no sense. Mia and Ryuk both manipulate Light into using the Death Note, but for someone who is so scared of it, he seems to have no issues using it. He never really gives into the temptation of it. He just does it because someone else asked him to.Next, the choice of actors baffles me. A lot of the lines seem poorly executed and falls flat. It lacks emotion. Light's lines feels almost tone deaf at times and it doesn't fit him considering how he should be emotionally involved in everything. Yet, it never feels this way. His delivery is just poorly done. Everyone feels like they are reading off a script and super monotone. Even Ryuk, who is often praised by others feels the same because all he has is one dreading voice and nothing more."
    },
    {
      "rating": "0",
      "text": "Wow, wtf happened with this movie? Death Note is one of the greatest anime/manga of all time, so why was such a terrible live-action version ever green-lit? I knew this film was an epic fail the moment that Light screamed like a little girl at the sight of Ryuk. That scene was both depressingly painful and unintentionally hilarious to watch. Almost EVERY decision Light and L make in this movie are completely out of character from their anime counterparts and stupid beyond reason. Mia is essentially the exact opposite of her original version, instead of a light-hearted goth girl we get a psychotic cheerleader, ugh. The characters, the style, the plot, the intensity of the cat-and-mouse game, basically everything that made the anime so great is ruined in this film. Some of the death scenes are absurdly over-the-top as if the director just binge-watched the entire Final Destination series and thought the same formula would work here. Unfortunately Death Note is even worse than those films. The 80's music only makes it feel even cheesier, as they try to mimic Donnie Darko as well and still end up with a trashy teen horror flick. The movie even breaks the very rules of the Death Note itself. This isn't only a bad anime adaptation, it's just a bad movie period. Cringy dialogue, lame action set-pieces, terrible movie logic, and worst of all Ryuk is hardly even in it! Willem Dafoe is actually a good choice for Ryuk but he's portrayed as some kind of maniacal puppet-master, which is NOT what he ever was in the show. Do yourself a favor and skip this hot mess."
    },
    {
      "rating": "0",
      "text": "Absolute **** Death note is one of the best manga/anime ever and Netflix make it American and turn it into a teenage love story with stupid characters with no development and don’t use their brains.L is one of my favourite characters ever and in this he is a stupid, irrational character who needs a reason to eat sugar.Missing the best scenes from the anime. POTATO CHIP!!    Tennis match   Naomi suicide scene   Ls death   Near and Mello don’t exist  misa misa is changed to Mia who doesn’t have a death note or  the shinigami eye which isn’t even mentioned and the relationship between misa and light is changed to a teenage romance instead of light using her for his own personal gain and lights dad is still a police detective but doesn’t die and the family is changed as light has no mom and no sister. L and light are both **** retards and light never denies being Kira ( which he called himself ) and ends in a chase through Seattle - not Tokyo- and a **** chase, the two intellectual characters who fight with their minds and outsmart each other, now run around the streets mindlessly with l carrying a gun.I swear this **** should be deleted from my mind forever. Actually offended by how **** this is and can’t understand why this was ever made the Japanese have already made multiple films and a live action tv series so this is unnecessary and just ruins the name of death noteI need a **** lie down now"
    },
    {
      "rating": "2",
      "text": "Si le tienen algo de aprecio al anime, por favor no vean esta película, lo convierte todo un desastre. Los personajes son 1000 veces mas estúpidos, la trama es cambiada por completo y no tiene sentido, la actuación es pésima, el desarrolo en la película es forzado y antinatural, no se adapta nada bien de la fuente original tanto del anime como del manga, le agrega un montón de clichés que no añade lo más mínimo a la historia. Sin duda, un gran error del calibre de Dragon Ball Evolution"
    },
    {
      "rating": "2",
      "text": "as an Adaptation this was the worst...destroys the Traits of the characters, follows the Death Note's Story very poorly and its simply cliche after cliche... now if this was just an alternative take on Death note...then its even worst....why not improve on the story make it better do something awesome and memorable...but Nope...they went on the route of \"lets make an inferior version\" this was awful guys...it was bad for a Death note fan, bad for a Death note enthusiast and I imagine for someone that knows nothing from Death note...this was Horrible."
    },
    {
      "rating": "3",
      "text": "I really wanted this to be good but sadly it's not. I could go over why the changes to Light's character ultimately hurt the adaptation but most of that has already been pointed out. The thing that really made this almost unwatchable to me is the direction of making the film into a Final Destination experience with the deaths. Even if you are going to go the final destination route, which is horrible for a Death Note adaptation, at least make the deaths creative and unique. The death note could add to deaths when it comes to people being controlled but they didn't even go this direction..."
    },
    {
      "rating": "1",
      "text": "The movie is bad in almost every way. It's like your in the middle of a movie after the first minute and the characters aren't introduced or well made. As an adaption it's even worse. It's ok to create a movie with the idea of the Death Note, but recreating everything besides the names of some characters is not enough. They tried to recreate some of the best manga moments within the script though, but it didn't made much sense without the thinking process."
    },
    {
      "rating": "9",
      "text": "Can all anime viewers back off?! for me and i believe people like me(who doesn't knows anime) can enjoy this movie a lot: it has action, not boring at all. so i like if it's different from anime and my advice don't listen stupid comments: just watch! one think i didn't like was THE END of movie, guessing will have second part or something....."
    },
    {
      "rating": "3",
      "text": "Bad as a movie, even worse as an adaptation. Except for the first name of the characters, and the Death Note itself, nothing else connects the movie with the manga/anime. The way Light was represented was awful. The development of the plot was bad. Light controlled Watari using just Watari as his name? Ryuk chose Light cause... He's not interesting, he doesn't have a motivation, he just reacts to everything! To a notebook falling from the sky, to a bullying situation, etc."
    }
  ],
  "recommendations": [
    "the_maze_runner",
    "the_darkest_minds",
    "9",
    "the_witcher_nightmare_of_the_wolf",
    "what_happened_to_monday",
    "maze_runner_the_scorch_trials",
    "surrogates",
    "chaos_walking",
    "bumblebee",
    "the_hunger_games",
    "tenet",
    "percy_jackson_sea_of_monsters",
    "the_mist",
    "x_men_apocalypse",
    "riddick",
    "fantastic_beasts_the_crimes_of_grindelwald",
    "the_last_airbender",
    "color_out_of_space",
    "fifty_shades_darker",
    "colossal",
    "king_arthur_legend_of_the_sword",
    "bird_box",
    "the_hunger_games_mockingjay_part_2",
    "the_girl_with_all_the_gifts",
    "lucy"
  ]
}