{"id": 2007, "title": "Death Race", "starring": ["Jason Statham", "Joan Allen"], "runtime": 105, "genre": ["Action", "Thriller", "Science Fiction"], "description": "Terminal Island, New York: 2020. Overcrowding in the US penal system has reached a breaking point. Prisons have been turned over to a monolithic Weyland Corporation, which sees jails full of thugs as an opportunity for televised sport. Adrenalized inmates, a global audience hungry for violence and a spectacular, enclosed arena come together to form the 'Death Race', the biggest, most brutal event.", "releaseYear": "2008", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/5A79GeOb3uChQ0l0ZDjDyODKQp3.jpg", "categories": {"plot": 5.913043478260869, "acting": 7.0, "ending": 3.0, "soundtrack": 2.6666666666666665, "cinematography": 2.0, "familyFriendly": 3.0, "funny": 6.333333333333333, "action": 7.387096774193548}, "reviews": [{"rating": "10", "text": "It was a cool movie I think you should make a part 2 to this."}, {"rating": "0", "text": "Eh it was a poor and unneeded remake. The cast sucked, The entire idea was poor and is pretty much exactly the same as the original, and it was just boring. Its one of those films that was more fitting for a direct to dvd release."}, {"rating": "7", "text": "In 2012 the US economy collapses, unemployment and crime rocket to their highest ever levels. Jensen Ames is a steelworker, his yard is being closed down and he gets a measly last pay of $300. When he return home to his wife and daughter all is normal until she is murdered by a burglar, leaving Jensen with the blame. 6 months later Jensen has been found guilty of a murder he didn't commit and is on his way to Terminal Island Prison. At Terminal Island people have the chance to win their freedom by competing in Death Race, Jensen becomes the new star of the competition however his rivals aren't all to keen on him taking the limelight.\rDeath Race is a great dumb action film, the plot is good though you wont remember it in 2 hours. The action is bloody and satisfying, the racing is tense and the film is well edited. Wrapping it all together is a half decent story, everything you need in an action movie...oh and Jason Statham."}, {"rating": "4", "text": "Gabriel Z, firstly you said that the title is Death Race and we shouldn't expect a good movie but a mess of explosions The movie that this movie was based on was \"Death Race 2000\" and that was a good movie most of us critics went into \"death race\" expecting something as good as the original and could you please refrain from commenting on critic websites, since you do not know anything about a good movie."}, {"rating": "4", "text": "Fast paced, a pure action film with absolutely no substance. Empty headed and over stylized, the does entertain to a point, but it's like eating a sandwich with nothing between the bread. It never quite satisfies. What were you thinking Joan Allen?"}, {"rating": "4", "text": "Even though the story line is incredibly thin, Anderson still managed to leave open a number of plot holes. Copying from 1975 the film \"Death Race 2000\" and the 1987 Schwarzenegger film \"The Running Man\" as well as computer games like \"Carmageddon\" or \"Destruction Derby\", Anderson's \"Death Race\" has little new to offer besides some 21st century special effects.\r The only ones who can really look forward to something new and refreshing are fans of Tangerine Dream's Paul Haslinger. Haslinger's soundtrack adds a grim industrial feeling to the film, making the brainless movie bits a bit easier to swallow.\r Still, the film consists of little more than monotonous car chases with lots of bullets and explosions added to them. If you're interested in a dumb and unoriginal action film filled with plot holes, then \"Death Race\" might be your thing. Otherwise, watch out you don't fall asleep....."}, {"rating": "7", "text": "Easy watching, nice entertainments."}, {"rating": "10", "text": "This movie was really great. i really enjoyed the action scenes. this is one of my favourite movies and i have seen ALOT of movies."}, {"rating": "10", "text": "This is the movie i've been waiting for, none stop action, guns and sassy language. The actors made their parts believeable and showed true emotion. Lately movies have been missing that edge and this movie deffinatly had edge. Best action movie out for sometime."}, {"rating": "5", "text": "Stratham is the only reason to watch this. Not much in it except a one line plot and explosions."}, {"rating": "9", "text": "Oh please if you went into this movie expecting anything more than what it delivered you are delusional. The title is Death Race, did anyone expect deep emotional drama or in depth dialogue? I expected cars, bullets, explosions, and hot women, and that is EXACTLY what I got. LOVED IT!!!! So turn off your higher brain functions, you only need the primal ones, kick back and enjoy the ride."}, {"rating": "1", "text": "Predictable, over-acted, under-plotted rubbish. I gave it 8 for the car scenes, but took 7 off for Statham's crap acting."}, {"rating": "7", "text": "It wasn't anything special, but it was entertaining.I've seen far worse movies.The acting was good, the effects were good but it just lacked something in the plot that would have made it better."}, {"rating": "2", "text": "Well, as they say on the interwebs, \"There's x minutes of my life I'll never get back!\". Forget plot development, character development, suspense, mental engagement, lip-syncing, clear dialogue, etc. etc. This mumbling sepia toned video game was a interesting as Grantourismo 4. The dialogue mumbled, and the soundtrack overbearing. Note to producers: 1) Loud music does not polish the t*rd. 2) Adding some colour 'occasionally' might even help the movie. 3) a storyline might help too..... Sorry but this movie has the gore for an adult audience, but everything else seems at 10 yr old level maturity level."}, {"rating": "2", "text": "Terrible. All the cars with the guns look really cheap; the movie has a feel as if it was made in 1990. You can totally tell the cardboard that has been sprayed silver to look like metal. The violence is also cheap. It cuts from the healthy person to a puppet with no head and red paint shooting out but you don't see the in-between."}, {"rating": "9", "text": "The best action movie in recent memory. Fast Cars, big guns and fancy girls. And yes it's as good as it sounds. I really enjoyed this movie from the first moment to the last. Not really a complicated story, but who cares? Pay attention at the beginning, cause the best part is probably the first five minutes with the real Frankenstein. Not saying the least of the film is not amazing. If you like true action, and the occasional nasty language doesn't bother you, go and watch it right NOW!!!"}, {"rating": "8", "text": "This movie is just alot of fun despite what critics say. It's full of vehicular mayhem with a little humor and drama in for good measure. If the Shawshank Redemption, The Road Warrior, and The Running Man all got together and had a baby....Death Race would be it. Jason Statham once again proves he can mix action and drama sort of like he did with The Bank Job and still make an entertaining movie. The vehicle action is quickly shot and VERY fast-paced kind of like the racing itself....its brutal, bloody, and unforgiving and vehicles explode, fly through the air with machine guns a blazing in a wonderul orchestra of automotive violence. im not a very big Paul W. Anderson fan....Event Horizon and now THIS stand as his best films, im actually surprised at how entertaining this was. The whole cast shines in this film, no-one comes off as annoying or underused....everyone gets the appropriate screen time and lines of dialogue to keep a proper balance given the talent here. This is just a FUN FUN movie, its heavy on action and light on being overly serious. i HIGHLY RECOMMEND this to action film fans as a BUY.....and strongly recommend it as a rental."}, {"rating": "10", "text": "I thinkk it is th movie of the YEAR!!!!!!!!!!!!!!!!!!!!!!!!!!!!!"}, {"rating": "7", "text": "Great action movie, love the storyline, acting was okay thanks to Jason Statham. Natalie Martinez is a babe!"}, {"rating": "9", "text": "Very good effects, action scenes. The acting is either good or above average. It is never bad though. The movie is to the point. It does not waste your time, every scene has its purpose. It delivers what it promises."}, {"rating": "7", "text": "I'll be honest... While it's not perfect by any means nor is like the original, it didn't turn out THAT bad. I actually enjoyed it."}, {"rating": "6", "text": "Like most other stathan movies, it's big on action and special effects, and adrenalin, but the writers could have done a better job, also after watching this movie I had a sudden urge to go home and play the game \"full auto 2 battle lines\"."}, {"rating": "8", "text": "Cars, exploding cars, exploding cars with guns, hot chicks and what can only be described as a doom truck. Death race is a simple, fun movie."}, {"rating": "2", "text": "I have struggled to come up with something positive to say about the film; some small redeeming feature to give the viewer some refuge against the barrage of irrational, senseless, poorly edited and photographed mayhem populated with wooden actors and banal dialogue--but there really is only one good thing I could come up with: it ends"}, {"rating": "8", "text": "I thought this was great. Mind you, I watched Babylon AD the week before so maybe it gained something from following that. Good pace, great fight scenes, movie well structured. Everything about the story is straight out of the action movie cliche lucky dip but who cares, it does it all really well and pulls you in. The only detraction was that some of the dialogue was a bit lame when it was meant to be tough."}, {"rating": "4", "text": "Put your brain in park and your adrenal glands in first. The film does what it says on the side of the video game box it came in, drive cars with guns and blow stuff up. It is like the scriptwriters walked through a section of Toys-R-Us looking for insparation, they found it reading the back of the boxes in the 'retro' gaming zone. The movie of Max Max the Game."}, {"rating": "9", "text": "Thourghly enjoyable. I have to say that this is Anderson's best movie and easily one of 2008's greatest."}, {"rating": "10", "text": "Best Movie i ever seen from awhile .. best acting and cars design .. and the more reality to the it make it the most action movie of the year"}, {"rating": "7", "text": "This movie was recommended to me by someone who has an annoying tendency to love every action movie ever made, so I wasn't really looking forward to seeing it. I was pleasantly surprised though. While it's not the greatest action movie ever made, and seems much like \"The Running Man\" retold, it kept my interest throughout."}, {"rating": "8", "text": "As a movie about cars with machine guns and whatnot, it delivers. Why you'd go into something like this looking for a deep and engrossing plot is beyond me."}, {"rating": "10", "text": "Is it me or do the critics INSTANTLY hate a movie when Paul W.S. Anderson's name is in the directors credit? I mean, geez, every movie this guy has produced was an absolute blast - Mortal Combat, Event Horizon, Soldier, Resident Evil, and Alien vs. Predator. Yeah, sure they weren't Hamlet but there are full of great fun and thrills. I'm going to see this as soon as I can - the guy delivers!"}, {"rating": "0", "text": "Worst movie I've seen in years. 30 Days of Night and Spider-man 3 were cinematic masterpieces compared to this horrible drek. Trite story, totally insulting."}, {"rating": "10", "text": "Its an amazing movie but i dont know about these other people and their bad comments but its so clear to me that these bad commentors dont know what an action movie is all about."}, {"rating": "4", "text": "The warden created Death Race. Since this made-for-television spectacle, an amalgamating of NASCAR and attempted manslaughter, is more organized than an intramural sports program for convicts, Hennessey(Joan Allen) wears a second hat at her maximum security penitentary. She is de facto commissioner of a high-profile sports league, who oversees its daily operations from an office that overlooks the track. The thorny prison superintendent wields power, unchecked power. This autonomy allows Hennessey to manipulate her latest race by dispatching a personally-sanctioned attack vehicle to eliminate the lesser drivers on her roster, thus paving the way for a Frankenstein(Jason Stratham) versus Machine Gun Joe(Tyrene Gibson) showdown in the final heat, the last of Death Race's three stages. In essence, she fixes the race. \"Death Race\" is a coded film about the integrity of professional sports. For years, prior to the major scandal that rocked the basketball world, naysayers of conspiracy theories used to maintain that it would take tremendous chutzpah, with the prevalence of television cameras and a nationwide audience, to predetermine a contest's outcome for the sake of ratings and audience growth. When the coach(Ian McShane) says, \"I love this game,\" \"Death Race\" gets specific about its target, although to be fair, all sports are susceptible to a dereliction of honest stewardship. Like the coach says, \"That's entertainment.\" That's the cynical times we live in. This alleged film, a video game, really, has A.D.D., but it works on the level of revenge fantasy for professional basketball fans, who at one time or another, felt robbed."}, {"rating": "9", "text": "For what it is--an action packed brainless death race--its a great movie for this class of shows. I enjoyed the ride and appreciated the simple plot and battle scenes. Go see it if you need a break from a day of stress and work."}, {"rating": "7", "text": "Death Race is a solid action flick. Statham plays it cool like he always does, with decent support. The action is realistic, rough and gritty. Don't expect high art, it's just fun Saturday night popcorn action the way it should be."}, {"rating": "3", "text": "(I'm short on time so this is going to be a very short and quick review) I was really looking forward to this movie from the second I saw a trailer for it in a theatre awhile back. I finally got to see it and to be honest it was just a run-of-the-mill action flick. Had I seen this during the summer it probably would've been completely forgettable instead of just partially as it was. Most movies of this genre thrive off of their \"wow moments\". People watch them simply for those scenes. Death Race has one. Those of you that have seen it know what I'm talking about. When the lead character and Shotgun Joe both hit the pad and cause the semi-truck to flip end over end. My jaw dropped at that moment. If only there had been a few more like it. As a side note though, this movie would make a great base for a video game. It actually plays out so much like one that it's a little bit funny and awkward at several points. To sum it all up though, either watch any good racing movie, Grindhouse, or play Twisted Metal, just don't try and do these things all at once."}, {"rating": "7", "text": "An excellent B-movie. Lots of action. Even a story-line. Well played characters, except for the Lady-in-charge. Makes you wonder if TV companies would show such an event. Not really. We know they would !"}, {"rating": "6", "text": "Okay, I think i'm a fan of Jason Statham. I loved both of his Crank films, I enjoyed his role in The Italian Job (best thing about that film, IMO) and I truly enjoyed his Death Race film. Death Race doesn't have any character development, the acting's sub par, the dialogue is cliched and the plot is quite a mess, but damn, this film is entertaining. Fast cars, bloody deaths, big explosions and Ian McShane being awesome as ever make this film really enjoyable. You'd think this film was a video game adaptation, considering it was made by Paul W.S Anderson, who's responsible for four Resident Evil films and 2 Mortal Kombat movies. You can definately see the video game influences with the cars running over the switches to get weapons (Kill switches are especially fun) Henessey, the sadistic prison warden, is definately a brilliant antagonist, who wants to pump up the ratings as more ratings equals more money, and shes willing to do anything to do so, including planting bombs, sabotaging races and murder. Her big antagonistic truck that she was building, The Dreadnought, seems much better in theory than in execution. Its like the director just gave a kid some broken up vehicles and made the design around whatever mess was made. It did look cool though. Much more enjoyable than any of Paul W.S Anderson's Resident Evil movies."}, {"rating": "8", "text": "The story about a man who was framed for killing his wife isn't the most original thing in the world but it does a good job of setting the pace, if bloody adrenaline fueled action doesn't keep your attention, you may want to look elsewhere for your next movie."}, {"rating": "2", "text": "Death Race (D) - Other than cars and names, this movie has nothing to do with the film it is based on - which is one that I love. This is silly with totally absurd dialogue - if you like fast cars and crashes ala all the other contemporary race movies, you might find some value out of it."}, {"rating": "0", "text": "Another Paul W.S. Anderson film that unsuccessfully attempts to pass off meaningless motion, loud noise and shots of marginally-contained breasts as entertainment.  Pure hell to sit through."}, {"rating": "6", "text": "Action, explosions, cars and lots of guns. This movies comes like a racing game. But that's it. There are heaps of action movies out that have the same ingrediances and are way better. It's not a total fail but u may skip this movie..."}, {"rating": "9", "text": "MOST awesome film every could get my mind of it it was in the back of my head for time and WOW its so awesome i just wanna watch it some many more time lol its like one of them film that just drive the bubbles in ur head and the speed of the car and the sexy the one with frankstan is sooooo hot."}, {"rating": "6", "text": "This movie is actually a good action movie with a lot of explosions and guns and hot women. Which incidentally makes you think it's directed by Michael Bay, sorry couldn't resist. Anyway its a decent movie with good actors but the plot could have been better. Jason Statham, and Tyrese Gibson were decent and Joan Allen plays a really good villain but it is not as good as The Transporter."}, {"rating": "10", "text": "Um estilo velozes e furiosos mais foda,claro com Jason Statham correndo a mil num super carro e dando super porradas num som de heavy metal. Tyrese Gibson está ótimo também com Machine-Gun-Joe. Cheio de cenas excelentes de ação,cenas arrasadoras de arrepiar e muito palavrão."}, {"rating": "8", "text": "I really liked this movie. Good action, good actors, I liked the story (not the most original one  but it works). After all, great movie. It's great watching it multiple times. Even though I know the whole movie, it's still entertaining."}, {"rating": "8", "text": "Great movie along with great acting from Statham. Good action, the right amount of gore and a good dialogue throughout. Some very good deaths and the idea of the race itself was very clever."}, {"rating": "6", "text": "Death Race kills.\rIn one of  Jason Statham's most consistent films. Death Race takes a simple plot and executes it with precision. The film is filled with good action sequences, a well developed story line, and is just fun to watch."}, {"rating": "8", "text": "So the good points were that the action sequences were well made, there was some good old brutal violence and there was Jason Statham. And now the bad points, the acting is not that good, the movie is predictable and short.This is a good movie but you will forget it pretty fast."}], "recommendations": ["need_for_speed", "furious_7", "the_expendables", "the_expendables_2", "xxx_return_of_xander_cage", "the_fate_of_the_furious", "the_mechanic", "ninja_assassin", "transporter_2", "6_underground", "war", "salt", "safe", "lockout", "the_transporter_refueled", "the_marine", "transporter_3", "escape_plan", "bloodshot", "the_expendables_3", "mission_impossible_iii", "mad_max_fury_road", "london_has_fallen", "angel_has_fallen", "crank"]}