{
  "id": 4869,
  "title": "Deck the Halls",
  "starring": [
    "Danny DeVito",
    "Matthew Broderick"
  ],
  "runtime": 93,
  "genre": [
    "Comedy",
    "Family"
  ],
  "description": "Determined to unseat Steve Finch's reign as the town's holiday season king, Buddy Hall plasters his house with so many decorative lights that it'll be visible from space! When their wives bond, and their kids follow suit, the two men only escalate their rivalry - and their decorating.",
  "releaseYear": "2006",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/muRplVEe8xU1jVlq9WpQSOamb6s.jpg",
  "categories": {
    "plot": 8.0,
    "acting": 5.0,
    "ending": 8.0,
    "soundtrack": 6.0,
    "cinematography": 5.0,
    "familyFriendly": 4.0,
    "funny": 6.8,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "10",
      "text": "This is such an amazing movie, we really did love this movie here. The film has such a true story line, with an amazing cast and so many laugh-out-loud moments that are going to have you and your family rocking around the Christmas tree!"
    },
    {
      "rating": "10",
      "text": "I love this movie it really puts you in the Christmas spirit. This is so amazing and has loads of up and down moments when you end up laughing out load at those two fools! This movie boasts an amazing cast with a fantastic story line and such funny moments. Matthew Brodrick is amazing and you really have to watch this one guys!"
    },
    {
      "rating": "10",
      "text": "The cast is so awesome in this movie! The jokes are so savage and I just L.O.V.E. every part of this movie, it is one of those films that you can just watch over and over and not get bored! An awesome movie that really puts you in the mood for Santa to come!"
    },
    {
      "rating": "4",
      "text": "Unlike Christmas with the Kranks, this movie has lame jokes and the story is an incredible mess. There is not a lot to reccommend. Little charm or fun in this holiday movie."
    },
    {
      "rating": "1",
      "text": "Starts out somewhat interesting, and DeVito is always good--he could read the phone book and make it interesting--but, he can't overcome the horridly cliched script full of trite, heartstring tugs. Broderick seems to sleepwalk it, and looks a tad bloated."
    },
    {
      "rating": "10",
      "text": "Love it. Great for getting you in the mood for Christmas. One of the cheeriest movies for the cold nights it. LIGHT EM' UP! It's December now guys. Lets show some love for an amazing Christmas movie!"
    },
    {
      "rating": "0",
      "text": "This is perhaps the worst Christmas film ever made. Not once in the unbearable 2 hours did I laugh or even smile ( except when it was comprehending just what I was exactly watching).all these 10 star reviews must be sarcastic as unless you are 5 years old or younger you WILL hate this film. The worst way to spend your Christmas and such a waste of good talent"
    },
    {
      "rating": "9",
      "text": "Arguably the most important work from a major studio this year. \"Deck the Halls\" skewers commercialism, organized religion, familial dysfunction, pop psychology, and the modern industrial condition ... and that's just the first reel. Broderick's manic vulnerability hasn't been put to such good use since \"Max Dugan Returns,\" and DeVito is charming and smug all at once. This will surely replace \"It's A Wonderful Life\" and \"A Christmas Story\" for required Christmas viewing."
    },
    {
      "rating": "7",
      "text": "What the hey! It's a zany Christmas movie and you'll enjoy it if you enjoy zany Christmas movies. Predictable but in a good sort of way."
    },
    {
      "rating": "6",
      "text": "Good premise, but it steps on all its own jokes. It plays serious music and fades to black when it should insert a quick reaction, a follow-up joke, then cut to something else.By the time the ending rolls around, you'll either be in a jolly mood and tolerate it or you'll be checking your watch. It's not a classic."
    }
  ],
  "recommendations": [
    "elf",
    "christmas_with_the_kranks",
    "fred_claus",
    "the_muppets",
    "a_cinderella_story",
    "the_spongebob_squarepants_movie",
    "blended",
    "the_night_before",
    "hannah_montana_the_movie",
    "sonic_the_hedgehog",
    "the_spongebob_movie_sponge_out_of_water",
    "arthur_christmas",
    "the_christmas_chronicles",
    "last_christmas",
    "diary_of_a_wimpy_kid_dog_days",
    "american_pie_2",
    "yes_man",
    "the_princess_bride",
    "hot_tub_time_machine",
    "sing_2",
    "minions_the_rise_of_gru",
    "paddington",
    "the_grinch",
    "the_three_stooges",
    "click"
  ]
}