{"id": 2567, "title": "Deepwater Horizon", "starring": ["Mark Wahlberg", "Kurt Russell"], "runtime": 107, "genre": ["Drama", "Action"], "description": "A story set on the offshore drilling rig Deepwater Horizon, which exploded during April 2010 and created the worst oil spill in U.S. history.", "releaseYear": "2016", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/jgBIYCZACe3iaS9TL2XzVGkO5p5.jpg", "categories": {"plot": 7.428571428571429, "acting": 7.9423076923076925, "ending": 7.428571428571429, "soundtrack": 5.0, "cinematography": 7.5, "familyFriendly": 6.0, "funny": 5.0, "action": 7.642857142857143}, "reviews": [{"rating": "7", "text": "Typical disaster movie... More of a documentary movie that tells how the Deepwater Horizon oil rig collapsed in 2010 due to oil leakage. It shows how the oil rig team and the BP oil company have different basic preferences. The oil rig chief engineer, Kurt Russell as Jimmy Harell, stands for safety first, and the BP representative, John Malkovich as Vidrine, goes for quick startup of the project at the expense of safety. Compromising safety led to the worst oil platform collapse in American history, resulting in 11 dead. It is a real story telling team show, no role is imposing, just Kurt Russell and John Malkovich, then Mark Whalberg and Gina Rodriguez.  The movie is breathtaking, absorbing, well crafted as facts and cinematography."}, {"rating": "7", "text": "A movie showing the greed of corporation's and the lives they take knowing they will never have real consequences just to save a buck. The actors and performances were as good as they get better than expected a emotional film."}, {"rating": "8", "text": "This was a much better film than I was expecting, in fact I would recommend that you go and see it.  The film is a disaster movie dealing with the 2010 oil spill in the Gulf of Mexico that lead to the worst oil disaster in US history.  It’s a really, really, good disaster film that has some very good performances from actors like Mark Wahlberg, Kurt Russell and John bloody Malkovich and I am not editing that, because you can’t say his name without saying that because he is so damn awesome.  The film’s biggest strength is that director Peter Bergh who, after watching this, you will never believe directed the abomination Battleship, really put the time and effort into understanding how oil rigs work and even went to an oil rig to learn it himself and as a result he makes some good technical information, without it being boring to the audience, plus his reliance on practical effects over CGI for the most of the film really pays off and makes everything feel more physical and have more weight to it.  If I have to have a bit of a nit pic, I do think Mark Wahlberg is slightly mis-cast but I would really recommend you see it especially in cinemas.  I saw it in an Imax screening and I think that’s the best way to experience it and I am not sure this film will play too well on DVD and NetFlix."}, {"rating": "7", "text": "\"Deepwater Horizon\" was a simple and wonderful true story, real heroes on the oil spill in the Gulf of Mexico, Mark Wahlberg excelled in his starring role, and the rest of the characters, and include the work that Peter Berg She has done with this project."}, {"rating": "8", "text": "If there was a film this year more suited to being watched on a big screen then someone please shout up. Deepwater Horizon fills the screen with incredible stunts, effects and tension that if you are even remotely considering watching this movie then do not wait for the dvd and get to the biggest screen to watch it. The action is stunning, the tension will have you gripping the armrest, the grizzly injuries will have you chewing your fingers and believe it or not the emotional core will have your eyes watering. Based on the real life oil spill, Deepwater Horizon follows the men as they attempt to evacuate the exploding rig. They are all heroes for their ability to remain calm and follow evacuation procedures, but what makes the film so true to real life is that we don't have one main character being the hero for all, instead it shows how many go that little bit further to prolong time for escape. There aren't many near misses or dangling from ropes over canyons, what we have are major issues and characters navigating their way around in the safest way possible. Sounds as if this will take any tension away but in fact it doesn't instead placing the every man in their shoes. Mark Wahlberg is the lead name on the piece but in fact he isn't particularly for and centre of the narrative. It is more of an ensemble piece with certain characters receiving star names to portray them. Malkovich is great as the sneery BP spokesman and Russell brings a charm to Mr Jimmy with this pair's rivalry being one of the stories strong points. Wahlberg's chemistry with Kate Hudson feels real and the emotional impact upon their family brings a tear. There are problems. At times it is overly sentimental, especially towards the all-American hero, and the characters aren't particularly fully developed but regardless you see this for the pure tension woven throughout, from drill pipe tests to full on explosions. It is a very good film and one of the first that will have you fretting at the sight of high pressure mud."}, {"rating": "9", "text": "This movie scares you on a level that is impossible for horror films to surpass. The brutal intensity of watching the employees burning, getting crushed, and receive injury in horrifyingly realistic ways effects you on a level not unlike director Peter Berg's previous screenplay, Lone Survivor. Deepwater Horizon does not delve into character development, but rather character depth. You get to know the cast by their personalities and how they react to certain situations they encounter. Kurt Russell and Mark Wahlberg shine as \"Mr. Jimmy\" Harrell and Mike Williams, their dialogue rich and realistic, specifically with Russell's commanding and competent portrayal of Mr. Jimmy. Peter Berg has made another masterpiece."}, {"rating": "8", "text": "What’s it about?The night in 2010 when the Deepwater Horizon oil rig exploded, causing the worst oil spill in US history.What did I think?While initially hamstrung by technical jargon and setup, the film goes from zero to a billion in the space of five minutes as the second act begins. The resulting destruction is an incredible spectacle that is grim, bloody, and, ultimately, deeply saddening."}, {"rating": "8", "text": "Well I don't tend to write reviews even tho I probably should more often but I felt I NEEDED to write one for this work of art.First off this was one movie I didn't care to see, but to to say there wasn't tears down my face at the end would be a lie. This movie is one of the most intense movies this year. Peter Berg has a dramatic way of involving you within the gritty intense action that was based on a true event that happened not to long ago. His camera work made things feel not forced and the amount of CGI was exactly what we needed. He didn't overpower the effects and at times made it seem so very real as if it was an actually webcam type device that was within the pipeline itself.The acting from all angles was prestigious. They were all very well done for the limited about of development shown. Everyone from Russell, Wahlberg, Malkovich, & Gina Rodriguez made you feel what the emotions they where conveying. Like I said there wasn't much of character development but some how that wasn't needed because in the end you felt for every single character even the ones in one or two scenes. This movie over all was just WOW bringing substance and character to an extremely sad event within our lifetime. Highly recommend this movie and I will give it an 8.2 out of 10."}, {"rating": "6", "text": "Based on the true events surrounding America's worst oil spill in history. However the use of the phrase \"based on true events\" is debatable, more like a made up story with pictures of the actual people shoved into the credits. Aside from the unnecessary back story for Mark Wahlberg's character and the overuse of bad omens leading up to the disaster it's worth a watch. Very well made for the most part and generally gets better as the story develops. Recommended."}, {"rating": "5", "text": "A disaster movie based on real events when in 2010 there was a huge explosion on\ran oil rig in the Gulf of Mexico. That incident was considered to be the largest oil spill in US waters.\rThe visuals are very dramatic. The rest of the movie was not that exciting. The rig's personnel talking\rtechnical jargon all the time were in dissonance with music that pumped up the feeling of coming pandemonium.\rThe last third of the movie describing the explosion is epic. It was definitely very expensive in production\rbut not very believable. I doubt that the movie will stay with me for any serious period of time."}, {"rating": "7", "text": "Deepwater Horizon reminded me of the movie Everest in terms of tension and the emotional impact. The film is well acted and harrowing. It also honours the victims by not hyperbolising the events that took place on April 20, 2010."}, {"rating": "10", "text": "This is a remarkable film; not easy to watch, but so important for everyone to see. Just as the NY Times said, it's time filmmakers start honoring the real heroes in our country (rather than the usual, worn-out fictional/cartoon ones).  Deepwater Horizon does just that.  The spectacular explosions and falling apart of the oil rig are unbelievably real, as are the performances of every single actor. Congratulations to Summit."}, {"rating": "9", "text": "The focus of this film is not on the environmental damage caused by the titular oil explosion, but on the crew members who fought and died during the disaster. Mark Wahlberg plays one especially heroic worker, but the true star is director Peter Berg (look for him in a cameo when the helicopter lands). He sets up the culture with quick-cut macho exchanges, but his magnificent recreation of the chaos and calamity makes the experience exceptionally gripping. It's a dizzying outburst of devastation. While the film clearly indicts BP as the greedy villain, the epic endeavor to avert, then survive the disaster, is riveting."}, {"rating": "8", "text": "I really appreciated how this film really gave you the feel and how it pulled very few punches. This film follows a lot of the same troupes that other Peter Berg films do.  Not that it's a bad thing. Much of the scenes once the disaster begins to occur are devastating and it's a real gut punch. A-"}, {"rating": "10", "text": "You can't help marveling at the tightrope the filmmakers walk: honoring their courage and sacrifice while making an action flick entertaining enough to justify the more than $100 million it took to make it come alive on-screen."}, {"rating": "10", "text": "Rollercoaster real events drama of a catastrophe announced and the heroic efforts of the workers. Maybe the initial documentary part is some slow, however, is a good choice for the hungry for action."}, {"rating": "6", "text": "It's visually shocking, with a lack of character development. However, it's a dramatization of a real horror that'll scare you more than any horror movie released nowadays. It's worth."}, {"rating": "10", "text": "A technically immaculate, hauntingly authentic cautionary tale that is easily one of the most painful, effective, and memorable cinematic experiences I've witnessed in a theater in a long while. This second installment in Peter Berg's already incredible \"American hero/tragedy/Mark Wahlberg\" trilogy expands on all the things that made its predecessor, \"Lone Survivor,\" so great. The realistic dialogue, the naturalistic performances, the sweeping set piece direction - it all adds up to a film that literally places you amidst the blistering heat of this grave corporate mistake. It's heart-wrenching, empowering, terrifying, moving, brilliant, brash, and - without a doubt - nothing short of my favorite movie this year so far."}, {"rating": "10", "text": "An intense, atmospheric and overall well-made film that shows human emotions in a way no movie has this year. Deepwater Horizon is a film built on courage, the extraordinary cast and most of all, the true events that inspired it and the heroes who counted on hope when times were dire. The visuals were excellent, and the film was very well shot. Mark Wahlberg was excellent, and the rest of the cast did not disappoint either. This is an important film to watch that highlights a disaster that seemed almost too much of a dream to occur. Berg's disaster film left me engulfed in emotion and awe. Don't miss it."}, {"rating": "9", "text": "The film surprised the hell out of me, to be honest.  I knew it would be a harrowing experience, but I didn't expect such excellent acting performances. My hat is off to Peter Berg, as well.  He's an underestimated director, but he does something pretty amazing with such a tragic story."}, {"rating": "2", "text": "The unethical conclusion of the movie totally -- yes, totally -- ignores the colossal environmental impact of Deepwater Horizon oil spill.\r Apart from a brief reference to environmental impact at 2/3 of the way through, via a scene with a distressed bird covered in oil which dramatically interrupted some humans (i.e. main focus was their inconvenience/surprise, not sadness at the ecological tragedy), there are no references to the colossal environmental impact whatsoever.\r The movie's conclusion labours for five minutes in a \"R.I.P.\" slide show listing of the 11 humans who died.\r Their loss is a great tragedy, however 11 human deaths should never hide the 10,000's of animals who died due to this oil spill.  The movie's conclusion completely ignores all of this.\r Species killed and poisoned by this oil spill:  North Atlantic Bluefin Tuna; Sea Turtles; Sharks; Whales and Dolphins; Brown Pelicans; Shorebirds. https://en.wikipedia.org/wiki/Environmental_impact_of_the_Deepwater_Horizon_oil_spill\r Peter Berg, the director: what a loser.  What an unethical jerk.\r We live in a co-dependent world with the environment and wildlife.  10,000's of animals were killed and their natural habitat destroyed, then a movie is made that pretends it didn't happen: totally unethical."}, {"rating": "0", "text": "A great disappointment!\r The dialog in the first half hour was mostly unintelligible and the rest of the movie incomprehensible -- a combination of accents, fast talking, irrelevant banter, and terse, unintelligible tech-speak!\rOnly the subtitle clarification helped to let the audience know what was going on.\rThe rest was continuous noise and flash-bang pyrotechnics.\rThe story was known from real life, so we knew what to expect, but this movie -- in my opinion -- didn't add much to appreciating it -- except the horror of it all."}, {"rating": "9", "text": "I had goosebumps from the last third of the film through the credits. What a respectful, impactful, exciting film that made me feel, for lack of a better word, unworthy. These courageous people acted so heroically, not only to protect and save their friends/co-workers, but even to do right by the rig and, in effect, the environment. Mark Wahlberg is at his subtle acting best, and Kurt Russel is simply outstanding.  Gina Rodriquez is also amazing in a smaller role. Not sure what the make of Malkovich as the \"villain\" - he's almost doing a James Carville Ragin Cajun....but hey, they can't all be perfect. . it's a really solid film."}, {"rating": "7", "text": "Deepwater Horizon is filled of impact about one of the world's largest man-made disasters ever. I usually despise disaster films, but this one did a great job at it."}, {"rating": "9", "text": "I was aware of the events that took place at Deepwater back in 2010. The movie is extremely well made and intense disaster film that is very respectful to the events that took place at Deepwater. Mark Wahlberg was spectacular here as well as Kurt Russell, I also really enjoyed Gina Rodriguez in this too. Very Good film all around"}, {"rating": "9", "text": "Deepwater Horizon is the most technically impeccable movie of the year so far. The visuals are stunning and the sound especially should be a shoe in for an Oscar nomination. This is also the most immersive movie that I've seen in a long while and the most impactful. The actors and director Peter Berg make Deepwater Horizon feel as real and authentic as it could be and it gives you a better understanding of what actually happened that night of April 20th."}, {"rating": "7", "text": "Well done, I enjoyed the story line. Great cinematography. Thought was good for presenting events the way they may have happened with some Hollywood twists, worked for me, enjoyed it"}, {"rating": "8", "text": "This is a great movie, its based off the oil spill that happened back in 2010, Mark Walhberg kills it in this just like he did in Lone Survivor and im sure Patriots Day will also be great, i personally love Lone Survivor more though"}, {"rating": "7", "text": "With a similar style to that of Lone Survivor, Peter Berg's Deepwater Horizon stands out with its powerful performances and technical brilliance, as well as its respectful yet intense plot."}, {"rating": "7", "text": "As a disaster movie, it was great with tons of explosions, great camera work, a good performance by Mark Wahlberg, and realistic action. It's also quite depressing how 11 people died on the oil rig and how BP basically got away with this. Where the film suffers is that the characters aren't that interesting, there's technological talk that the average person wouldn't understand, and there are times where it's hard to understand what's going on. Overall, it's a good tribute to those who died, a good account of what happened that night, and what caused the oil rig explosion to happen. But when it tries to expand beyond a typical disaster film, it falters a bit."}, {"rating": "8", "text": "It was GREAT movie! From the best ever disaster films I have ever seen in my life!\rIt really couldn't get any better than this..\r''DeepWater Horizon'' was definitely totally worthy of my money to watch it on the cinema!"}, {"rating": "8", "text": "Can't remember a disaster film I enjoyed as much as I did seeing this in the theater.  Was great from start to finish, a lot of stuff I didn't get because I'm not an oil driller, but will definitely watch again when it comes out on video."}, {"rating": "10", "text": "ay Mark You been making a lot of movies in Boston here. What did you forget about your pals from Dorchester but this is Michael W Mckay, I wrote a book called    a big house for little men all about Walpole State prison, contact me\rhit me up at facebook with a message abighouseforlittlemen55\r This Movies is 10 out of ten"}, {"rating": "8", "text": "Deepwater horizon was a really good movie that told a real story About an Oil Rig When I first bought this movie I did not even watch it for a while  it was not so interested into it I watched it today I really like Mark Wahlberg performance in this movie I liked all the characters in this movie the only character they want u really to care about is the wife in this movie which to me trying to be in the movie The Oil stuff what happens is insane It was cool visually and it was insane crazy I give Deepwater Horizon An B+"}, {"rating": "10", "text": "Outstanding, dramatic thriller about the events leading up to the explosive blowout on deep sea rig in April, 2010. Good portrayal of the key players by Russell, Wahlberg and Malkovich.  If you feel complacent or curious about the life on an oil rig at sea, it is well worth seeing."}, {"rating": "9", "text": "Peter Berg has done a great job mixing the intensity of  Deepwater Horizon disaster with some well developed character moments to give the viewers people they can form a connection with. The visuals and the way the film was shot give it some fantastic scenes that art breath taken,"}, {"rating": "7", "text": "Director Peter Berg has found a niche. He is not a good director in the least. He is guy that claims to be \"one for them, one for me\", but his films continuously seem to be \"one for America, and then another for America\" at this point. Deepwater Horizon is no different. Yet, it is somehow a good film with a great sense of scope. A celebration of average joe heroes who saved lives during the Deepwater Horizon oil spill and the negligence on the part of BP that led to this disaster, Deepwater Horizon is an accessible, smart, and powerful film that may pull a little too hard on the viewer's heart strings at the end, but is undeniably thrilling and a riveting portrayal of the disaster. It is not a film that rushes to the finale, rather building tension until the pressure is too much and the whole thing blows up into a cloud of fire.Mike Williams (Mark Wahlberg) is the Chief Electric Technician on the Deepwater Horizon. James \"Mr. Jimmy\" Harrell (Kurt Russell) is the head honcho. The two show incredible courage throughout the escapade and save people left and right, even after they are battered and broken. Casting Wahlberg and Russell in these roles is a stroke of genius as they are perfect fits for these modern heroes. Going above and beyond the call of duty, the men sacrifice themselves and their bodies to try and save as many people as possible. Racing across the ship to try a last ditch effort to save the rig and then jumping from the rig itself, Mike Williams' actions after the explosion are incredible, including saving multiple men from the accommodations. Injured and with one eye swollen shut, Mr. Jimmy is a man that never stops to take his hand off the wheel. Once he gets up, he is not going down again until everybody is safe and the rig is clear. Even afterwards, he calls roll to determine who made it off and who lost their lives. Wahlberg and Russell are classic tough guys and really show why in this film with good performances as these real life heroes.Yet, this really drives at the point of the film. Williams in particular gets the most character development of anybody with a wife and daughter waiting his return at home. He is a family man, the quintessential American. With a single American flag waving on the ship and in the aftermath (oh the national anthem call out, \"THE FLAG STILL WAVING OR WHATEVER\"...i.e. the flag is still waving as the rig burns in the background, poetic and overtly patriotic), Berg stuffs the heroism down our throat, but makes it work. The film is tense, thrilling, and action-packed. He may go too American and too hard on the celebration of heroes in this one, but these men do deserve praise for their actions and then patriotism is limited to just a few shots. In essence, he reins it in a bit for this one and lets the men do the talking.However, the key to this film is the explosion and the ensuing fire. With phenomenal sound effects and tremendous visual effects, this is where the huge budget for the film went it paid off. The film will probably not be profitable because of the budget being too high, but as a film, it really paid dividends. The film U-571 is still cited as one of the best films to test to see if a new sound system is working out well, but it may need to be updated to Deepwater Horizon. The sound is simply that good. The explosion, the chaos, and all of the tension leading up to it is impeccable and really what this film rides on throughout. Without it, Deepwater Horizon would not be nearly as good as it, especially considering how little meat is on this bone.  Using a pair of men as scapegoats for everything and not covering the punishments faced by BP, the film does include some real court footage but leaves out any information regarding the financial repercussions for BP. The only updates are regarding the dead and the two men who were shown in the film as being direct causes for the disaster. Unfortunately, the film does such a poor job of developing anyone other than Mike Williams, the death of the other characters are not felt at all, instead being reduced to background carnage. Seemingly recognizing this, Berg shows a montage at the end of the real men with their families. A touching moment, it does feel like a band-aid to make up for the fact that he only focused on one man for the whole film.Thrilling, entertaining, and with tremendous sound editing and visual effects, Deepwater Horizon is a film that is a bit thin with regards to its writing, but never ceases to be a powerful and utterly compelling experience. That said, boy does it ever do justice to Mike Williams and his wife. Not to be disparaging, as I am the last one to criticize based on looks, but these people are not Mark Wahlberg and Kate Hudson. Not even close. Few are, but these people are just your average citizens, yet Berg casts Mark \"Muscles\" Wahlberg and Kate \"Brad Pitt's New Girl\" Hudson as them. I would be honored if I was the Williams family."}, {"rating": "8", "text": "Deepwater Horizon sheds a light on the events of the Gulf of Mexico Oil Spill that I was unaware of. These men and women went through a brutal and shocking catastrophe that's very intense and well directed. It's definitely one of the better disaster movies of recent memory."}, {"rating": "7", "text": "Movie was exactly what it planned to be. Action and a good story. How that snooze fest Sully beat it is beyond me. Does not do the BP oil spill justice, but thier will probably be a documentary or other movie down the road that goes more into it. All in all a good watch."}, {"rating": "8", "text": "To remind us our errors and limits.It was a surprising film. Because it was based on a real event, but there's nothing much about heroism which is essential for most of this kind of film and its success to inspire the viewers. I liked that. They just wanted to tell the story. Not to create a hero nor a villain. But due to the casting, Mark Wahlberg looks the centre of the story. And also points out a negative character without confirming anything properly. But if the film is depicting the real incident correctly, then it was no man's fault. It should be a technical error that led to the man's push over the limit.It's April 20 2010 about 60 kms away southern coast of the US in the Gulf of Mexico. A new batch arrives to continue drilling in the deep sea as part of oil exploration. When they felt they have got it, but it's only a back foot. Small small errors, following a big blow, the entire crew with the greater effort to stop it ends in vain. Finally, it is a matter of saving their own life than the drilling platform. With lots of action, how one of the biggest man made disaster in the recent time comes to end covered in the remaining part.From the director of 'Lone Survivor' and his part in the project was appreciable. It is another sea disaster theme like the recent 'The Finest Hours'. The film was mainly developed from the articles and also got nominated for the Oscars in two categories, but did not win any. Visual effects were the key for such film and I liked those parts. I appreciate for recreating the event for the world know what really happened. It is a must see, not for entertainment purpose, but it will work for that as well. Recommended!7½/10"}, {"rating": "6", "text": "Excellent first act where the tension builds up like in the best of disaster films while at the same time leaving it clear for everyone of us to see how these repulsive money-hungry companies destroy us, their employees and the planet. Great second act where the disaster happens. Great scenes. Cringe-worthy third act with laughable group prayer included. Overall, something way better than what I expected from this smaller film which didn´t get much attention when it was released. At teh end of the day, I have never been a big fan of \"true stories\" in films. But this was good overall."}, {"rating": "7", "text": "Another worthwhile team-up between Mark Wahlberg and director Peter Berg. The true story this film is based off of is retold in a harrowing fashion and many of the scenes were incredibly hard to watch. However, I also thought that the final act felt a bit rushed and that the acting was questionable at times. I especially thought that the accents of Kurt Russell and John Malkovich's characters felt rather hokey and Malkovich's character was especially wasted. Nonetheless, the film still managed to boast some powerful visuals and action and remained an entertaining watch for the most part. Overall, it's not the best disaster flick out there and isn't what I'd call groundbreaking by any means, but it is worthwhile enough."}, {"rating": "5", "text": "A bipolar movie that fails in the areas i expected unfortunately. The first half is great. It delves into the details of running the rig without being boring. John Malcovich is great as what most people would call a villain but isn't really. When the disaster starts, it's all good. And the escense of the movie climaxes with the huge explosion. Everything after that is pretty bad though. It honestly should have ended there. Things get way too action packed and numbing. Unlike a intense battle between two adversary's, there is no weight behind all the explosions as it's just about surviving. This style isn't always bad. It can be good like the beginning of cod ghosts. This is the second movie I've seen in a while that should have ended after it's climax. Anthropoid being the other. Now to see The Girl (please don't suck or I'm talking a break from movies) On The Train. :)"}, {"rating": "8", "text": "Related media: I had read some news articles and watched some news clips on the disaster.>What's it like?: It's a disaster movie regarding the Deepwater Horizon drilling platform that is very close, in technical aspects, to the real incident. I think the director had tried to keep the extent of the explosions to what really happened, unlike in the third act of his earlier film, Lone Survivor.>Pros:>1) The technical aspects of how an offshore drilling platform operates and how the disaster unfolded seemed very realistic. But see Cons #1.>2) The atmosphere was kept tense for the audience until the moment of the disaster, and during the disaster, it was a matter of disaster recovery. There was no dull moment for 95% of the film. See Cons # 2.>3) Mechanical special effects, as opposed to CGI was used to show the explosion - quite a lot of money went to blowing up and burning a mock offshore platform - and the results are great.>Cons:>1) Unfortunately the detailed explanation of how the disaster occurred was inadequately done. I was confused as to what was happening to the bubbles, the cement, the drilling mud, the tests, etc. It could have been difficult to insert this explanation in without appearing like the poor job done in Interstellar with regards to how a wormhole allows you to travel faster than the speed of light. Perhaps it could have been a flashback to some training class about platform disasters.>2) The last 5% of the film was post-climatic and was as if it was trying to engender the audiences' emotions. It could have been done better and with more details after the aftermath. Not a single clip of the oil spill (sans fire) was shown, as if some sponsor of the film had demanded that this not be shown so as not to anger the oil companies?>How would the the different age groups rate it?Children: AverageTeens: GoodYoung adults: GoodMedium age adults: GoodOld adults: Good>Rating: 4/5 (no half scores). It is worth paying to watch it in the cinemas."}, {"rating": "7", "text": "Decent movie; a one time watch with good acting; all based on a true story.I would recommend subtitles for this one!Effects were good and dramatic...."}, {"rating": "8", "text": "Although I didn't understand like 90% of what the people were saying, it was all tech talk the first half, the latter half is what saved this movie from getting an lower score. Very well acted, it felt very realistic."}, {"rating": "8", "text": "Great movie, based on real events. Suggest it to everyone - even though maybe the acting isn't the greatest here (even though there are many talented actors in it), it is a good movie in a sense that it depicts the disaster really well and makes you feel everything deeply"}, {"rating": "8", "text": "What a great movie. The performances by Mark Wahlberg and Kurt Russell were absolutely fantastic. It really shows the human spirit and will to fight on. The movie when the rig explodes is edge of your seat thriller/action film. The movie was incredibly intense."}, {"rating": "8", "text": "Pretty good disaster movie, good information on what went wrong with the drilling rig, good character development, good explosions, good stunts, Mark has taken his acting up a level."}, {"rating": "6", "text": "Deepwater Horizon has amazing acting not much else. This movie has 0 Cons but only 1 Pro.    ."}], "recommendations": ["everest", "the_perfect_storm", "apollo_13", "dunkirk", "patriots_day", "greyhound", "first_man", "13_hours_the_secret_soldiers_of_benghazi", "master_and_commander_the_far_side_of_the_world", "in_the_heart_of_the_sea", "the_finest_hours", "argo", "flight", "anthropoid", "unbroken", "zero_dark_thirty", "the_martian", "valkyrie", "avengers_infinity_war", "sicario_day_of_the_soldado", "the_grey", "sully", "interstellar", "12_strong", "mortal_engines"]}