{"id": 3090, "title": "Deep Impact", "starring": ["Robert Duvall", "Téa Leoni"], "runtime": 120, "genre": ["Action", "Drama", "Science Fiction"], "description": "A seven-mile-wide space rock is hurtling toward Earth, threatening to obliterate the planet. Now, it's up to the president of the United States to save the world. He appoints a tough-as-nails veteran astronaut to lead a joint American-Russian crew into space to destroy the comet before impact. Meanwhile, an enterprising reporter uses her smarts to uncover the scoop of the century.", "releaseYear": "1998", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/a3vQS7JKqlOb3MdVJHuTCP9s7Mg.jpg", "categories": {"plot": 5.96875, "acting": 5.714285714285714, "ending": 5.857142857142857, "soundtrack": 5.0, "cinematography": 10.0, "familyFriendly": 3.0, "funny": 7.0, "action": 6.333333333333333}, "reviews": [{"rating": "6", "text": "I really don't think it was all that bad. Better than Armageddon and I really liked it. I Don't know why people say it's so bad."}, {"rating": "2", "text": "The movie is boring, no real suspense. Don't know how this movie got PG-13, when they say f**k twice, and in the sexual way. The part with the wave is good, but that is about it. I do not recommend Deep Impact to anybody wanting a \"good\" disaster film. 2/10"}, {"rating": "10", "text": "Great movie. excellent."}, {"rating": "10", "text": "This is one of my favorite disaster flicks. I just think this movie is so good. I love how it focuses on the characters and not the action. But the action is awesome. This is one of the only movies to make me cry. Not weep, cry. It has such a sad ending!"}, {"rating": "10", "text": "I am just rewatching it on Netflix, and it’s incredible how well this movie held up.The pacing and story telling are pitch perfect, with no gimmicks real characters that behave smartly and rationally. Also: Morgan Freeman as the most presidentially president outside of The West Wing.The science is spot on and the graphics were way ahead of their time.Thank you to every one who worked on this gem!"}, {"rating": "7", "text": "Deep Impact is a pretty good movie with a very unfortunate name. It is another story that plays into people fears about the end of the world, with a situation we rarely think about. As far as stories go, this is a good one, telling the story from four different angles. Tea Leoni's was by far the most interesting, as an up and coming reporter from a troubled family, who becomes the face of the crisis. What I didn't like was the storyline in space, where the would be heroes try to stop the asteroid. It just seemed unnecessary and like it dragged on. If the legendary Robert Duvall wasn't one of the astronauts, I'm pretty sure most of those scenes would have been cut. Deep Impact has a great cast, with a strong story, but it's also a little slow and cheesy at points, but it's a much better movie than most of the other end of the world scenario films."}, {"rating": "4", "text": "An average adventure similar to the same-year release of Armageddon. It packs a few punches but not enough to make Deep Impact worth re-watching. A shame, too."}, {"rating": "2", "text": "Watched movie again after 15 years.  Bad movie.  Poor acting and very predictable and ridiculous script.  Now I know why I haven't seen Téa Leoni in many movies of note.  She did a poor job of acting in this movie."}, {"rating": "7", "text": "A really deep movie that does a good job of showing the world in this situation. I really like how it doesn't focus on just one person as the \"hero,\" but rather select individuals. Although, Morgan Freeman does tend to steal the show, as usual."}, {"rating": "6", "text": "I think this movie is BETTER THAN ARMAGEDDON! It has nearly no stereotype \"heroes\" and a humanitarian side. It's too long for the story, but it has a good ending."}, {"rating": "10", "text": "An intelligent screenplay, talented cast, touching soundtrack, decent editing/pacing and excellent cinematography come together in fantastic cinematic fashion. Watch on the biggest screen with the biggest audio for the deepest impact. Some of the lines are a bit cheesy and many of the more ambitious visual effects don't hold up so well in 2022 but the heart of the story is here to see and enjoy all these years later."}, {"rating": "10", "text": "One of my favourite science fiction disaster films of all time. Morgan freeman does an excellent job playing fictional U. S. President Tom Bec. The Plot is mysterious, dramatic, intense and powerfully moving as well as spectacular visuals. A really deep movie that does a good job of showing the world in this situation. I really like how it doesn't focus on just one person as the \"hero,\" but rather select individuals. Although, Morgan Freeman does tend to steal the show, as usual. It's just as awesome as the day after tomorrow"}, {"rating": "4", "text": "Think back to 1979 and a disaster movie called Meteor; Sean Connery, Natalie Wood, Russian and American scientists united in a desperate attempt to stop a giant asteroid ploughing into the Earth. Twenty years on and Meteor has spawned its very own trend. Bar a certain giant lizard, 1998 is the year of the asteroid disaster-movie. And while action junkies should gear up for Jerry Bruckheimer's explosive Armageddon (big rock threatens the Earth, Bruce Willis dives into a space shuttle to destroy it), DreamWorks' more thoughtful Deep Impact (same plot, no Bruce Willis, more human drama) has managed to get its foot in the door first.\r What begins as a tale of hanky-panky in government soon gives way to a deadlier agenda. The mysterious `Ellie' is, in fact, ELE; the codename for the US government's secret preparations for a direct hit by Biederman's rogue comet. As the end of the world draws closer in the months that follow, the film spins out several micro-dramas: Téa Leoni and her troublesome parents; Wood and his girlfriend; and a team of astronauts - including retired Apollo veteran Spurgeon Tanner (Robert Duvall) - who have been dispatched to try to nuke the planet-denting ice rock.\r Director Mimi Leder does her best to try and find depth and emotional complexity within a simple high-concept Hollywood premise. Unfortunately, while the idea itself is a brave one, the result is a barely interesting action movie, intercut with forgettable slices of soap opera. Will Leoni make up with her pop, Maximillian Schell? Who will get picked to take up one of the 800,000 hidey-holes in a deep, blast-protected cave? Is this last orders at the bar for the human race?\r Leoni, in her first major dramatic role, performs admirably under impossible circumstances, while Wood's young love story with Leelee Sobieski simply dissolves into an annoying distraction. Only Duvall nabs a compelling plotline and tries to give the film its heart, but he's off screen far too much. His cause isn't helped by a dodgy screenplay which is short on entertainment value but long on literary pretence. With shades of Contact, this is the kind of movie where the heroine who must explore deep truths is named `Lerner' and the fate of the world hinges on the Christ-like sacrifice of a man (almost) called `Fish' and a spaceship called `Messiah'.\r Nevertheless, there are some impressive disaster effects in the final hour, and thanks to some clever and knowing twists, Deep Impact keeps you averagely entertained right up until the cataclysmic tidal-wave finale. That said, it still merely makes you hunger for Armageddon; an event movie that promises more of the things that would have made this film better (deep-space heroics, action, adventure, ooh-ahh computer-graphics), but with less of the spiritual guff that ultimately sucks the fire from its rival.\r While the forthcoming Armageddon promises to unload a Con-Air-in-space adrenalin rush, Deep Impact is a more spiritual \"Let's solve our personal problems before the comet kills us\" movie. It's a slowly-spun sci-fi fable - but **** what an ending..."}, {"rating": "5", "text": "The season’s first comet-targets-Earth special effects extravaganza is spectacular enough in its cataclysmic scenes of the planet being devastated by an unstoppable fireball, but proves far from thrilling in the down time spent with a largely dull assortment of troubled human beings.\r Boasting a pedigree from two studios as well as the combined expertise of exec producer Steven Spielberg and his “Jaws” producers Richard D. Zanuck and David Brown, this comes as close to a universal, all-encompassing disaster picture as has ever been made, in that all life on Earth is threatened with extinction by the onrushing astral interloper. And yet, the choices of characters made by scenarists Michael Tolkin and Bruce Joel Rubin are mostly odd and uninvolving, with perhaps only one or two of them expressing any lust for life, a burning awareness of the preciousness of time, or a philosophical framework through which to view the threatened holocaust.\r With director Mimi Leder working in the same hyperventilated, would-be realistic style she applied to “The Peacemaker,” the characters all frantically scurry about keeping appointments and fighting deadlines, with all of them facing, of course, the biggest deadline of all. But the impact they create is shallow and scattershot, leaving one to wait impatiently for the major moments that, fortunately, do arrive.\r An unaccountable amount of time, especially in the early-going, is given over to Jenny Lerner (Tea Leoni), a rising MSNBC reporter who, while investigating some high-level Washington shenanigans, stumbles onto traces of a very big story indeed. A year before, amateur teenage astronomer Leo Biederman (Elijah Wood) and an observatory technician (Charles Martin Smith) independently identified a new comet that is now certified as being on a collision course with Earth.\r With impact looming in a year, U.S. President Beck (a solemn Morgan Freeman) announces the news to the world. The government hasn’t been asleep at the wheel, however; a giant spaceship called Messiah will blast off in two months’ time, the president informs, so that astronauts can plant eight nukes on the comet in the hope of blowing it to smithereens and thus eradicate the threat.\r The mission, which concludes precisely halfway through the picture, proves a dismal failure, succeeding only in splitting the comet in two unequal pieces, each of which strike the planet. The smaller portion, it is eventually determined, will hit just off the North American eastern seaboard, causing a 350-foot tidal wave that will destroy New York and Washington, among other cities, and travel 650 miles inland. The larger rock will land in Canada and trigger what is called an E.L.E., or Extinction Level Event, complete with Earth-enshrouding dust clouds that will block out the sun and almost certainly wipe out all life.\r The trauma created by the who-will-live/who-will-die edict is explicitly dramatized through Leo Biederman’s story. By virtue of his having co-discovered the comet, he and his family get to go underground. His girlfriend Sarah (Leelee Sobieski) and her parents are not so lucky, however. To enable Sarah to join Leo, the seriously underage couple marry, but even then there is much melodramatic toing-and-froing as to whether she will accompany him or remain with her folks. Potentially heart-tugging, this subplot is played out in the hokiest, most predictable manner, one that panders directly to the teen audience.\r The adults are no more interesting. Although she has the looks for a plausible TV anchor, Tea Leoni’s Jenny seems so stiff and uncomfortable during her broadcasts that she wouldn’t last a weekend on the air. Furthermore, her character is stuck in a forlorn funk; her mother (a classy Vanessa Redgrave) commits suicide after the older woman’s ex (Maximilian Schell) marries a much younger woman, and Jenny spends a good deal of time dealing — not very effectively — with her errant dad. Leoni’s eyes seem on the verge of tears almost throughout, and her sad, brittle demeanor is an odd object of focus for such a high-powered picture.\r In a different way, the team of astronauts isn’t very compelling either. Robert Duvall’s lead pilot, described as the last man to walk on the moon and a veteran of six shuttle flights, would normally be expected to have a certain weight and to command respect. Instead, the younger flyers (Ron Eldard, Mary McCormack, Blair Underwood, Jon Favreau and Alexander Baluev) treat him dismissively as a dinosaur, almost a liability. Duvall, possibly not wanting to repeat himself by playing yet another military tough guy, makes his character somewhat defensive, as if he had something to prove. It’s one way to go, but not all that convincing.\r The water effects are just the slightest bit phony looking, but they still register dramatically, as do glimpses of the ocean making its way up through the valleys and over the mountains of the eastern states."}, {"rating": "2", "text": "High Profile, Low 'Impact'\r One down, one to go.\r The year's first of two much-anticipated movies about space-rocks hurtling toward Earth, \"Deep Impact\" is an underwhelming disappointment from executive producer Steven Spielberg. (That still leaves \"Armageddon,\" scheduled to open July 1, whose asteroid the size of Texas could seriously one-up\r\"Impact's\" merely Manhattan-sized comet.)\r But the comet is not the only smallish thing about this film. For a suspense drama, \"Impact\" is a slack, oddly enervated and mawkish soup of largely lethargic performances by such normally robust stars as Robert Duvall, Morgan Freeman and Vanessa Redgrave.\r The story itself seems torn from recent headlines: One dark day, President Beck (Freeman) announces that a speeding ball of dirty ice is on a collision course with the third rock from the sun (whoops, that's us!). A joint U.S.-Russian team of hot-shot rocket jockeys, led by veteran mission commander Spurgeon Tanner (Duvall), is quickly assembled and sent up to plant six nuclear-warhead \"moles\" in the surface, which will theoretically atomize the comet into a harmless shower of hailstones. But somehow the scheme doesn't work as planned and now mankind must steel itself for an \"extinction level event\" – wonkspeak for the very thing that killed the dinosaurs.\r So far so good. In a refreshing change from the more obvious disaster-movie theatrics, the movie wisely focuses on the individual human dramas of ordinary people facing their demise. But the bland script shows far more evidence of the schmaltz of writer Bruce Joel Rubin (\"Ghost\") than it does the hard-edged canniness of co-writer Michael Tolkin (\"The Player\" and \"The Rapture\").\r For one thing, the human dramas are not all that dramatic – much time is wasted on an uninvolving subplot involving the comet's teenage discoverer, Leo Biederman (Elijah Wood) and his efforts to save his white-bread girlfriend (Leelee Sobieski). It's difficult to care about these people when director Mimi Leder never asks them to furnish anything other than cheap, manufactured sentimentality.\r There's one scene in particular where Tea Leoni as an MSNBC reporter is reacting to the telephoned news of a family member's off-camera suicide. We see only her face as the personal tragedy slowly sinks in. What could have been a nice, subtle moment, however, is ruined by the fact that Leoni's emotive abilities do not extend above well-trained eyebrows.\r That's just one example from a laundry list of under-utilized talent and squandered opportunities. Early on, when an astronomer (Charles Martin Smith) is frantically trying to log on to e-mail to warn the world of the deadly comet, his computer freezes with the blunt announcement, \"Opening mail server . . . Server down.\" It's a tiny, telling joke that hints at a genuine intelligence behind the film, but the theme of our betrayal by modern technology is quickly abandoned.\r Another dashed hope comes one long hour into the story, when mild looting and profiteering start to break out among the panicked citizenry. It looks for a moment as though the film might finally generate some real electricity, delving into the savagery we hide within us, ala \"Lord of the Flies,\" but then the pandemonium subsides and we return to our regularly scheduled programming about insipid teen love, predictably selfless sacrifice and tear-jerking family reconciliation. There are many such moments of button-pushing lachrymosity, but they are so false that you'll likely gag with anger at the lump in your throat.\r Despite the fact that when we first see the comet floating in outer space it resembles a piece of styrofoam sprayed with that Christmas-snow-in-a-can stuff, there are a couple of nice special effects. The flying boulder looks much more terrifying the closer it gets to Earth's atmosphere. And a massive tidal wave does look rather realistic – water effects having come a long way since the parting of the Red Sea in \"The Ten Commandments.\"\r Much of the movie is set in and around Washington, D.C., so there is some modest pleasure to be gained from seeing the familiar sights of the city on the silver screen. Nevertheless, a tepid chase scene set on the Key Bridge and the Whitehurst Freeway is nowhere near as heart-pounding as a typical rush hour on that roadway.\r When all is said and done, it is precisely such lackluster imitations of real life that prevent this lightweight melodrama from leaving any deep, or lasting, impact of its own."}, {"rating": "7", "text": "Deep Impact is a rare representative of disaster films in the drama genre. For a disaster film, the action of the film is quite calm and a little delayed. Good cast, and great ending with no happy ending. The plot is certainly stupid and naive, but so in any film of this genre"}, {"rating": "6", "text": "This is better than your average impending-destruction-of-planet-Earth SF extravaganza.  It adds more elements of mainstream drama to the story.  The lead is an icy, ambitious young female newscaster (a character that is popping up more and more in real life as well as cinema).  She (believably portrayed by Tea Leoni) struggles with family problems and stumbles across what looks like a political scandal, but turns out to be something much bigger.  Freeman is a dignified presence as the president.  The tale of the brilliant teen and his girlfriend is cute but predictable.  There are some cool apocalyptic effects towards the end - action fans will probably want to just skip ahead to those."}, {"rating": "2", "text": "C'est la cata ! Deep Impact est un condensé de tout ce qu'il ne faut pas faire dans un film-catastrophe comme par exemple, endormir son audience (par exemple !). Ou bien ne pas étirer la guimauve plus que le nécessaire ou le strict nécessaire syndical très strict parce que sinon... non seulement ça nous fait chier mais en plus ça devient complètement ridicule.Alors bien sûr, Freeman a déjà endossé le rôle-type de toute sa carrière en plein essor à venir, c'est-à-dire le vieux sage à l'air grave et digne qui fait passer Maître Yoda pour un pilier de bar qui vient de tomber dans le coma -le temps qu'on ré-inverse les syllabes, on dort déjà- car après un discours du vieux bonze noir, l'acceptation de la catastrophe se fait dans la plus sereine des résignations.Et dans le vaisseau pour nous sauver, un autre bonze qui a trop la \"cool attitude\", ce vieux briscard de Duvall, un autre philosophe de la vie... euh du sacrifice et de l'héroïsme, la main sur le coeur et le sourire aux lèvres comme l'entraîneur qui fait son dernier discours avant l'envoi de la rencontre.La Téa Leoni est mimi en fouille-merde fouineuse mais tout de même un peu limitée, un peu comme cette musique \"digne\" qui n'en finit pas de déborder de dignité et de sacrifice d'un bout à l'autre du film, film qui se traîne ignominieusement et lamentablement, sauf à la fin, la toute fin... et encore !Différent d'Armageddon et au moins sans Bruce Willis (ouf !) et malgré sa réalisation appliquée, Deep machin n'a décidément aucun impact sur le spectateur et le reste du monde. Un courant d'air tout au plus."}, {"rating": "6", "text": "This film tackles the end of the world in the traditional American perspective: a newly discovered comet threatens to destroy the planet and the US leads the crusade to eliminate the threat. Despite the obvious American imperialist propaganda implied here, the film is good, especially for those who enjoy catastrophe movies. His story bears a strong resemblance to \"Armageddon\" and some scenes remind us of \"Independence Day\", but there are big differences between these three films. One of the most notable is that this film gives more attention to the characters than to the tragic events. Unfortunately, this makes it a lot slower and monotonous than we might at first glance. There are people who see it as good, others want more action and they will get a little frustrated. I, in particular, have been able to appreciate this more leisurely way, although some scenes are perfectly expendable. The special effects have been quite well made and are grandiose, although they seem a little unbelievable.The characters have been very well developed, much better than most of the films of this genre, which helps a lot to catch the attention of the public. Elijah Wood and Leelee Sobieski can be particularly touching and, despite their young ages, get a good chemistry together. Even so, there are times when they exaggerated in sentimentality. The rest of the cast (where we can see experienced actors like Robert Duvall, Vanessa Redgrave or Morgan Freeman) has a much more contained and uninteresting record, which is a little surprising. Still, Freeman and Duvall have always been a little better than the rest of their peers, though their characters are relatively minor in the story (we may even think that the talent of the actors has been misused). Tea Leoni was clearly a casting mistake, she never really got her character."}, {"rating": "10", "text": "Easily one of the greatest movies of all time, and the greatest disaster movie of all time.  Very emotional and heart-wrenching, and brilliantly plotted, with great special effects."}, {"rating": "7", "text": "Una buena película, muy emocionante y conmovedora, está muy infravalorada; la recomiendo."}, {"rating": "7", "text": "Both Deep Impact and Armageddon were released in the same year 1998 and both had almost same story but I enjoyed Deep Impact more. The cast played their characters nicely. The direction was good. The running time was proper 2 hour and not like Armageddon which sas unnecessarily stretched to 2hr 30min. The pacing was also proper, you will not get bored. The logic in the story was far better than Armageddon.It's hard to believe how did this movie grossed less than Armageddon. It's box-office collection is proof that movie is underrated. Overall, give it a try. You eill enjoy it."}, {"rating": "10", "text": "This was a great concept and it was a great movie i enjoyed in my younger years and i still do, i wish they would make a remake. #MovieThirst"}], "recommendations": ["everest", "apollo_13", "the_perfect_storm", "deepwater_horizon", "sully", "the_abyss", "outbreak", "greyhound", "first_man", "in_the_heart_of_the_sea", "patriots_day", "greenland", "dark_waters", "the_martian", "allied", "the_midnight_sky", "the_finest_hours", "the_lost_city_of_z", "nightcrawler", "interstellar", "armageddon", "beirut", "only_the_brave", "stargate", "independence_day"]}