{
  "id": 3825,
  "title": "Deep Blue Sea",
  "starring": [
    "Thomas Jane",
    "Saffron Burrows"
  ],
  "runtime": 105,
  "genre": [
    "Action",
    "Horror",
    "Science Fiction"
  ],
  "description": "Researchers on the undersea lab Aquatica have genetically altered the brains of captive sharks to develop a cure for Alzheimer's disease. But there's an unexpected side effect: the sharks got smarter, faster, and more dangerous. After a big storm damages their remote research facility, they must fight for their lives.",
  "releaseYear": "1999",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/fyn0zyCI4kIlbDoHH0Hzv09hDC5.jpg",
  "categories": {
    "plot": 7.444444444444445,
    "acting": 7.25,
    "ending": 5.666666666666667,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 7.5,
    "action": 6.833333333333333
  },
  "reviews": [
    {
      "rating": "6",
      "text": "Renny Harlin, c'est connu, est un gros bourrin : sa grande passion, c'est de faire péter des trucs. Alors, quand vous lui donnez une station sous-marine, il casse tout. Et si les responsables sont tout désignés, à savoir nos **** copains les requins, ça ne le dérange pas plus que ça !Des requins génétiquement modifiés, plus rapides, plus forts, plus intelligents : les requins qui valaient trois milliards. Ils peuvent nager en marche arrière, font des créneaux et tapent le zéro à 100 en 3 secondes. Ils sont trois et la jouent collectif : une vraie équipe de foot.Ne tournons pas autour du pot : ce n'est pas aussi débile qu'un Sharknado mais presque... A force d'en faire des tonnes, Renny fait perdre toute crédibilité à son film... Cela étant, c'est indéniablement drôle de voir ces crevards se faire bouffer les uns après les autres et se prendre des trombes d'eau dans la gueule. Après un temps d'exposition syndical, le film ne marque par ailleurs aucun temps mort, à part les morts !Les acteurs ne sont là que pour sonner la cloche du déjeûner. On notera tout de même la très charmante Safron burrows, une belle fille fort intéressante que j'avais remarqué dans l'abominable nanar spatial Wing Commander.En tout cas, Renny sait toujours filmer et n'a pas perdu la main : un vrai pop-corn."
    },
    {
      "rating": "7",
      "text": "Deep Blue Sea. This is got to be something that I've check out as a kid but didn't watch it all the way through but certainly interest me. Before I've heard of Jaws, this is the one I've heard of and the death scenes really interests me and I know exactly were it begins. Yes, my favourite part is where Jim got his arm bitten off by a shark. I just can't stop thinking about it. The opening scene is something that you'd expect from a horror slasher flick. I'm even surprised that Samuel L. Jackson's been killed by a shark. The special effects of the sharks are made of animatronics and computer generated effects and some of which are pretty decent. Some of them don't age well like the CGI of the way sharks look and some of them look good like you will see what you'll see. It's not the best film I've seen in years but enjoyable for what it is and Jaws is still to this day my favourite film of all time considering a great film of all time. Deep Blue Sea really does have those sequences of sharks and it didn't scare me and that's really about it."
    },
    {
      "rating": "10",
      "text": "¿¿¿¿¿¿¿¿¿¿¿¿¿¿¿¿¿¿¿¿¿¿¿¿¿¿¿¿¿¿¿¿¿¿¿¿¿¿¿¿¿¿¿¿¿¿¿¿¿¿¿¿¿¿¿¿¿¿¿¿¿¿¿¿¿¿¿¿¿¿¿¿¿¿¿¿¿¿¿¿"
    },
    {
      "rating": "8",
      "text": "With this interesting story i was prepared for the best shark movie(since jaws) but the CGI effects were horrible and it was not scary at all.The good point is the performances from Thomas Jane,Samuel.L Jackson and LL cool J"
    },
    {
      "rating": "7",
      "text": "Deep Blue Sea isn't exactly Jaws but it's good enough and offers enough scares to be compared favorably to it when you think about shark movies. The CGI, especially now in 2020, but nonetheless it's still a good enough movie to be a suitable B movie."
    },
    {
      "rating": "7",
      "text": "Stupid story with a questionable script but the CGI still holds up today  ."
    },
    {
      "rating": "7",
      "text": "Una frenética **** de acción imparable de principio a fin, para ser de 1999 esta muy bien hecha a nivel técnico, la historia quizás es algo en donde no se profundiza, pero rara vez importa porque afortunadamente no hay por donde aburrirse con esta película."
    },
    {
      "rating": "9",
      "text": "One of the scariest shark movies of all time,though nothing can top Jaws. The Smurfs 2 has a better user score. Yes, CGI is terrible, but that's not really a problem."
    },
    {
      "rating": "10",
      "text": "Deep Blue Sea is one of the best shark genre films, with memorable scenes, a tense soundtrack, various references to classic franchise jaws and a good story."
    },
    {
      "rating": "0",
      "text": "This movie is so bad that after viewing it I felt extreme pain.The pit in my stomach is so large I cannot describe it. Please don't watch this. Please. I am currently experiencing thoughts of suicide."
    },
    {
      "rating": "9",
      "text": "While it may not have the brains of Steven Spielberg's \"Jaws,\" this shark flick more than makes up for it with big thrills and all out fun. I feel like Deep Blue Sea doesn't get enough credit. There's a lot of good stuff going on here. The kills are great and often surprising. Renny Harlin shoots his shark attack scenes like traditional horror movie scares. We've seen these tricks used before, but they're much more effective here because it's sharks instead of apparitions.The cast is fantastic. Usually when a rapper steps into acting scene it's usually just to much things up. This is especially true with horror movies. However, LL Cool J proves to be an exception here. His character is one of the best parts. Simultaneously funny and someone you can root for. Samuel Jackson is excellent as always. This may not seem like the kind of movie where he would be allowed to flex his acting muscles, but he is given one of his more memorable monologues here. It serves as a reminder of just how talented he is at commanding the screen and taking hold of the viewers attention. Essentially, it's another reminder of why Jackson is one of the greats. It Thomas Jane who steals the show though by nailing the does-everything action hero role and adding some masculine sex appeal to the mix. He's all around awesome and Deep Blue Sea stands out as one of his best movies/roles.The plot may be a bit absurd, but stands to give viewers a great setting for underwater mishaps. Renny Harlin knows how to craft tension in his scenes. It's more than just sharks causing these characters problems. Their sea-based facility proves to be a crumbling death trap. The strength of the movie comes from just how exciting and enjoyable it is to watch the likable cast try to escape with their lives and dodge sharks in the process. At the end of the day, isn't that what you want from a movie like this? I know I do.Deep Blue Sea is a blast. Well-made, deceptively clever, and a whole lot of fun. It works as an action movie and serves as a decent (if unscary) horror movie as well. There's a lot more going on here than one would additionally think. It might all be of the cheap thrill variety, but it's hard to criticize the movie for that when it does everything so well. As it stands this might just be second only to the legendary Jaws in terms of shark movies. It's seemingly got it all. Provided what you're looking for is people getting chomped. Which is kind of the point of most shark movies, don't you think?9.2/10"
    },
    {
      "rating": "6",
      "text": "Attempting to find a cure for Alzheimers, a team of scientists on board a sea-based conduct research on the brains of sharks in an attempt to improve their intelligence. When the sharks get loose, they must fight their way to safety against an apex predator that is now able to reason and plan.The plot and science behind Deep Blue Sea obviously make absolutely no sense, but it delivers plenty of B-movie style action set pieces and it’s certainly never dull. *Spoiler Alert* Samuel L Jackson dies a memorable death at the hands of a shark."
    },
    {
      "rating": "6",
      "text": "A pretty decent Jaws wannabe. Some OK performances from Samuel L. Jackson & LL Cool J. Overall: An entertaining popcorn horror, nothing special but OK if you don't take it too seriously and enjoy it for what it is."
    },
    {
      "rating": "6",
      "text": "An engaging thriller with a mindless plot, Deep Blue Sea managed to keep me hooked throughout its loud 100-minute running time. A doctor and her team of researchers looking to find a cure for Alzheimer's in sharks in an isolated facility in the middle of an ocean - what more do you need for some sweet chaos while also supported by some unethical practices? Deep Blue Sea is not the most realistic shark film out there but it has a lot of cool action, suspense, the added pleasure of flooding sequences, and a protagonist that you love to hate. Go for it. (Grade B-). TN."
    },
    {
      "rating": "4",
      "text": "Deep Blue Sea (1999) is a movie directed by Renny Harlin starring\rSamuel L. Jackson, LL Cool J and Michael Rapaport. It's a shark based\rthriller with a twist that also makes it somewhat a sci-fi movie. It's\rimpossible to compare with the shark parodies made recently, but it's\ralso not like the previously released shark classics such as „Jaws\".\r The whole action happens on a floating facility used as a test lab to\rfind a cure for Alzheimer's disease. The medicine is being created from\rthe brain of sharks, which are kept in special cages to prevent them\rfrom breaking out. Which of course happens, it wouldn't be a thriller\rif everything went fine throughout the movie. Chaos breaks out in the\rfacility when a shark attacks an employer and they manage to escape. It\rturns out the sharks where genetically mutated to be 5 time smarter\rthan any other animal. The crew, all by themselves, must survive the\rshark attacks, and think of a strategy end this.\r Starting from the main „actors\" in the movie, the sharks' visual\reffects are awful, in my opinion, the robotic shark from „Jaws\" looks\rmuch better. They are poorly made and all of the action regarding them\rlooks entirely fake, with blurry and stiff movements. Which ruins\ralmost the entire movie (as far as visuals go) because they are the key\relement.\r The real good actor worth mentioning here is LL Cool J (Preacher) who\ris the cook of the facility. He still manages to make a side character\rone of the most interesting and comic ones. He is the only reason why\rthis movie is watchable. Other scenes are either boring with no energy,\rpredictable or look totally fake\r If you wanna watch a shark classic i would much rather recommend „Jaws\"\rby Steven Spielberg. It's better in all aspects."
    },
    {
      "rating": "5",
      "text": "I don't know why this is a cult movie besides Jackson and LL Cool J. It's just so boring and there are only two good scenes of shark action in two hours. This kinda sucks."
    },
    {
      "rating": "6",
      "text": "This is so cheesy. The story is pathetic and the excuses for the experimentation on the sharks are poor. The dude that swims with them is so annoying. It is so bad that it is funny. The sharks are not believable and if they were then it would not have been as good. The action is not that exciting but the whole film is fun and very unchallenging. So bad that it is good type of movie. It didn't look great but it is funny and monstrous."
    },
    {
      "rating": "10",
      "text": "Perfect movie for a scream."
    },
    {
      "rating": "7",
      "text": "The only flick anybody can compare this too is Jaws, but come on, that movie was made 30 years ago."
    },
    {
      "rating": "7",
      "text": "You won't be giving it a standing ovation but you will have a jolly good hour and a half of CGI sharks and Samuel L Jackson."
    },
    {
      "rating": "7",
      "text": "Very entertaining B-movie. The way the sharks scarf down the cast is gruesomely funny."
    },
    {
      "rating": "8",
      "text": "Most shark movies are really dumb. I really liked this one though. I like the facility that sharks are kept in. Still would be terrifying to work or be at. The very thing that happens in this movie, is the very thing I would be scared of happening."
    },
    {
      "rating": "7",
      "text": "Meh.....................................................................I did this to space out the review because the movie is simply Meh."
    }
  ],
  "recommendations": [
    "underworld",
    "kong_skull_island",
    "the_meg",
    "transformers",
    "predator_2",
    "the_shallows",
    "anacondas_the_hunt_for_the_blood_orchid",
    "van_helsing",
    "anaconda",
    "the_predator",
    "47_meters_down",
    "godzilla_king_of_the_monsters",
    "pacific_rim",
    "ninja_assassin",
    "species",
    "rampage",
    "ghost_rider_spirit_of_vengeance",
    "predators",
    "monster_hunter",
    "transformers_dark_of_the_moon",
    "jaws_2",
    "doomsday",
    "jack_the_giant_slayer",
    "underworld_blood_wars",
    "ghost_rider"
  ]
}