{
  "id": 2856,
  "title": "Delivery Man",
  "starring": [
    "Vince Vaughn",
    "Cobie Smulders"
  ],
  "runtime": 105,
  "genre": [
    "Comedy"
  ],
  "description": "An affable underachiever finds out he's fathered 533 children through anonymous donations to a fertility clinic 20 years ago. Now he must decide whether or not to come forward when 142 of them file a lawsuit to reveal his identity.",
  "releaseYear": "2013",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/dKTkxSeNgHdwgrAbhwbXuUk4tzb.jpg",
  "categories": {
    "plot": 6.578947368421052,
    "acting": 6.5,
    "ending": 6.0,
    "soundtrack": 6.0,
    "cinematography": 5.0,
    "familyFriendly": 6.0,
    "funny": 6.526315789473684,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "3",
      "text": "This movie was NOT funny! I didn't laugh even once. It was a sad drama. Vince Vaughn plays the regular character he always plays. Story was predictable, with no suprises."
    },
    {
      "rating": "7",
      "text": "Delivery Man was a surprisingly charming little movie, and it featured Vince Vaughn at his best in several years, he really should do more heartfelt, dramatic performances like this."
    },
    {
      "rating": "6",
      "text": "Vince Vaughn plays his typical character, short on accomplishments but big on charm. Twenty years earlier, he was an enthusiastic donor at a fertility clinic and now he finds out he's the father of 533 children. From all signs this looks like a riotous comedy, but there aren't many laughs. You can expect a heartwarming conclusion, but it's pretty chilly instead. Without the heavy handed music to tell us when it's funny and when it's sweet, you might have miss it. Vaughn carries the film and it moves at a steady pace. It just never becomes special. The weird thing: none of these offspring look vaguely like him."
    },
    {
      "rating": "5",
      "text": "Delivery Man is the better Vince Vaughn movie from this year.  This is way better than the internship.  Although it's a comedy, Delivery Man can be very inspiring.  I was really impressed with the acting from Chris Pratt.  While this movie won't be nominated for any oscars.  It well definetly give you a good laugh.  It's not a movie that you need to see in theatres.  I suggest waiting for the DVD.  Overall, slightly better than the average Vince Vaughn movie."
    },
    {
      "rating": "7",
      "text": "We are living in a time when movies are becoming morally cheaper by the minute. Curse words and body parts are now the major source of entertainment in place of a good story line and meaningful moments. Vince was sweet but an idiot; kind but like every other human in need of a Saviour which makes him easy to relate to! The main story line hits at the heart strings of mankind  love for your family amid trials, sufferings and... well... humans being human.\r It's also clean which is a bonus for me! As opposite to Fatal Attraction as you can get."
    },
    {
      "rating": "9",
      "text": "I don't know why this movie has such bad reviews. It was very cute. Nice story, and nice values. I'm definitely not someone to clutch my pearls at raunchy movies, but it's refreshing to see a movie like this that's funny and good without being gross and has a sweet message."
    },
    {
      "rating": "7",
      "text": "While the story is a goofy farce of the original Canadian film, \"Delivery Man\" is still brings laughs, tenderness and even heart. This movie is all goofiness with all the heart in typical heartwarming comedies. Overall, you'll find wonder in a movie like this. I give it a B."
    },
    {
      "rating": "7",
      "text": "It's a sweet comedy, and while it's heart is in the right place, not all of the plot elements are. There are plenty of funny moments throughout, especially from Chris Pratt, and the whole thing really does tug at your heartstrings. The problem with the film is that there are a lot of issues with the story. For instance one plot line about Vaughn's character owing money to some dangerous people feels like it doesn't belong at all. I really feel that the movie would have been better without it. There are several other issues with the story like this in the film, and while they do hurt the film, they don't ruin it. It's still a feel good type movie that does bring laughs. So if you're willing to put up with some issues that are admittedly serious for a movie to have, you'll still find plenty to enjoy here. My total score is a 7.5/10=Good."
    },
    {
      "rating": "10",
      "text": "I LOVE THIS MOVIE! Starbuck was awesome! Delivery Man is AWESOME! I'll now wait for an other Scott/Vaughn movie: Business Trip! Congratulation to Ken Scott!"
    },
    {
      "rating": "7",
      "text": "It was a remake of the Canadian movie 'Starbuck'. For those who saw both the versions are not happy with this. I admit that I have not seen the original, but this movie is not bad at all, especially if you are seeing for the first time. It was one of the best comedy of the year.\r The credit must go for everyone who worked for the movie. The director did a fine job for the second time with the same script. The main difference came from the Vince Vaughn with his usual performance exhibition and expressions.\r The theme was kind of fresh, at least to me. Just like the expanded version of 'The Kids are All Right'. It was funny in parts and also filled with meanings about the life with light sentiments. The sudden change of scene from comedy to seriousness transforms along the viewer's mood. When you are smiling at one point it makes you to hold back after emotions strike.\r I was hesitated before the watch, but now I am glad that I saw this diverged movie. A variety of movies like this can be watched in any given day with quality narration. The pace was well controlled, not dragged to stretch or hurried to reach the final. Can't recommend though it may surprise you a little if you wanna try."
    },
    {
      "rating": "5",
      "text": "This movie is good not great. The type of movie watching it you enjoy but wouldn't want to see again or care to talk about. It was funny and really drew on the strings of parenthood. It really showed emotion and a good plot idea. The Canadian version Starbuk was much better but overall not horrible"
    },
    {
      "rating": "10",
      "text": "Very entertaining, great story about simple man.\r Story about delivery man who realized there are more important things in life then money. Film with only few funny moments comady/drama?\r worth seeing. something different for once."
    },
    {
      "rating": "7",
      "text": "Funny, heart warming comedy is Vince Vaughn's best work in years. I was expecting a dud, but this film actually delivers on Vaughn's strengths as a comedian. Worth a look"
    },
    {
      "rating": "6",
      "text": "A contemporary subject given the Hollywood-treatment with Vince Vaughn. Yes, it could be more charming, more dramatic and more heartfelt--but it largely does the trick."
    },
    {
      "rating": "3",
      "text": "There is a time in the movie where someone says this is weird and that couldn't describe this movie any better. Delivery Man doesn't have anything funny and a story that is utter trash. I couldn't wait for this so called comedy to end."
    },
    {
      "rating": "4",
      "text": "A very peculiar and off putting movie. The concept is so ridiculous that it should be an outright comedy, but instead it tried to be a drama. Poorly executed and very weird."
    },
    {
      "rating": "5",
      "text": "This is a very standard film with a decent amount of heart, but not enough humor.  This is pretty much a straight drama that's not bad it just never gets to a point where your fully invested.  C+"
    },
    {
      "rating": "7",
      "text": "I thought it was really honest and heart felt performance by Vince Vaughn, It's hard not to like him in the movie.\r maybe the script is light and the plot ultimately ridiculous, but it's Vaughan at his most charming & silly. If you love Vaughan then don't pass this by, it's a return to form after the bomb that was \"The Internship\".\r I suspect critics are tired of waiting for Vaughn to live up to his potential and absolutely blow us away, I'm tired as well but not so cynical to under score something ultimately heart felt."
    },
    {
      "rating": "7",
      "text": "A shot for shot remake of it's french Canadian predecessor, Delivery Man is actually not bad at all. The acting was good, the movie was light hearted and there were some funny moments. One of Vince Vaughn's best movies in a while."
    },
    {
      "rating": "8",
      "text": "I think this movie is certainly underrated. Vince Vaughn has been typecast as a comedy actor but I think he is a bit better than people think. This movie its really very funny and I don't think it was really supposed to be, but you leave the theatre feeling happy. Its a feel good movie if anything."
    },
    {
      "rating": "7",
      "text": "\"Delivery Man\" 10 Scale Rating: 7.0 (Good) ...\r The Good: Much better (and deeper) than expected. While Vince Vaughn's act has grated on me quite a bit over the years, his performance in this film was subdued. This leads to an unexpectedly likeable character who seems to legitimately want to turn his life around. Chris Pratt delivers most of the film's one-liners and was a comedic bright spot.\r The Bad: While it ended up being a better film than expected, it wasn't really very funny. Aside from Pratt's occasional aforementioned one-liners, there wasn't much to laugh about. Colbie Smulders wasn't all that great and her one-dimensional character could have been played by just about anyone."
    },
    {
      "rating": "9",
      "text": "I have always liked Vince Vaughn, even though I realize he is somewhat limited in his depth of acting.  This movie though had quite a different feel about it.  I feel he went out of the boundaries a bit and turned in quite a nice performance.  I liked the story and the heart felt feeling that it gave me watching it!  Really entertaining and an enjoyable flick, that I would recommend highly to anyone seeking a nice evening by putting in a movie.  Nice cast ensemble and a very nice job of acting by all.  Made me realize in our own way no matter how small the contribution is, we can make a difference in other's lives."
    },
    {
      "rating": "7",
      "text": "One of my favorite comedy's about such a really comical matter. It has some really heart warming and some tender soul searching moments as well."
    },
    {
      "rating": "6",
      "text": "I didn't find this particularly appealing or even especially funny to start with but in the last quarter or so, it did become quite positive and even uplifting. Its cheesy and amusing after a while and I enjoyed seeing the TV presenters talking about the case on TV, in the film (even the BBC is mentioned specifically by name in the film). I suppose it is a somewhat thought provoking film. Vince gives a fairly good performance in this film as a somewhat likeable average joe type, who finds himself in an extraordinary situation. There are worse films than this and there are better - if your really interested in seeing it then it may be worth a watch, yes, otherwise I wouldn't especially go out of your way to see it but like I say, its not bad. Maybe people might think its too cheesy towards the end but I liked that aspect of it - its not what I'd regard to be over the top, unnecessarily sentimental - ok it is certainly a bit sentimental but not in an entirely bad way."
    }
  ],
  "recommendations": [
    "50_first_dates",
    "the_break_up",
    "the_five_year_engagement",
    "friends_with_benefits",
    "pitch_perfect_2",
    "the_cobbler",
    "just_before_i_go",
    "click",
    "sleeping_with_other_people",
    "that_awkward_moment",
    "the_king_of_staten_island",
    "palm_springs",
    "funny_people",
    "a_bad_moms_christmas",
    "peter_rabbit",
    "zack_and_miri_make_a_porno",
    "the_wedding_ringer",
    "shazam",
    "megamind",
    "tag",
    "blockers",
    "deadpool_2",
    "the_green_hornet",
    "hancock",
    "forgetting_sarah_marshall"
  ]
}