{
  "id": 3565,
  "title": "Deliver Us from Evil",
  "starring": [
    "Hwang Jung-min",
    "Lee Jung-jae"
  ],
  "runtime": 108,
  "genre": [
    "Crime",
    "Action",
    "Drama"
  ],
  "description": "A retired contract killer goes on a bloody rampage when a young girl finds herself at the mercy of gangland human traffickers and only one man can come to her rescue, with an arsenal of weapons and years of experience in the art of killing.",
  "releaseYear": "2020",
  "mpaaRating": null,
  "imageUrl": "https://image.tmdb.org/t/p/w500/hngKHgBHRD5nbTx92zatBC6eMSP.jpg",
  "categories": {
    "plot": 8.666666666666666,
    "acting": 9.0,
    "ending": 5.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 5.0,
    "funny": 5.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "1",
      "text": "Skipped it to the end. Film about child abuse in catholic church."
    },
    {
      "rating": "9",
      "text": "This is often an extremely difficult film to watch, especially if (like me) you're a parent. After years of reading about clergy sexual abuse in the church I expected mainly to be appalled by the bottomless narcissism of the central figure, Oliver O'Grady. And I was. However, the institutional evil that saturates the hierarchy all the way to the top of the Vatican seems an order of magnitude more chilling. Deposition footage of the Bishop of the Diocese of L.A. and a Monsignor there makes one believe he is looking at Satan incarnate. I did not sleep well after watching this. A very important documentary for everyone to see. It's perhaps the best horror film made in years."
    },
    {
      "rating": "9",
      "text": "I must say this movie was disturbing, real, powerful, moving and brilliant. Although it was somewhat slow and repetitive it was still unbelievable to get a real life look at the ignored crime of Catholic Clergy Sexual abuse and child molestation. The most powerful story is that of two parents among other adults in the film, whose daughter was sexually abused by a varied victim madman. The story of there horror and the pain that they struggle with is so indescribably moving and superb. The effects that the news had on them of there daughter being abused is stunning. This movie is truly brilliant Grade A for a documentary. The man behind the crime should be jailed for life to bring true justice to the many female and male victims and the crime should be acknowledged by the Catholic Church and worldwide. This is a big step in decreasing the amount of sexual abuse in church related manner."
    },
    {
      "rating": "10",
      "text": "Thank God. This movie will reach believers to hopefully cry for their church to be better, hold itself to higher standards and serve the people -- not its own interests. I'm so thankful to those with the courage to speak up. Their victimization by those perpetuating this evil (within the church) needs to be stopped. It starts by talking about it and the priests and church to be accountable to those they took an oath to God to serve."
    },
    {
      "rating": "8",
      "text": "For the most part, \"Deliver Us from Evil\" is an exemplary documentary about the abuses of the Catholic church. Late in the film, however, the filmmaker and Thomas Doyle resort to Michael Moore-tactics when they send two of Father O'Grady's abuse victims to the Vatican for an apology. They must've known it was a certain inevitability that the two women would be sent away catharsis-free, and would now be saddled with a new psychical wound in need of healing. Doyle and the filmmaker probably didn't prepare the women for the possibility of rejection because they wanted to capture real tears on film. This is disappointing. When Doyle is calming the two women down inside a cafe, he looks like an actor. Other than this egregious violation of trust between documentary filmmaker and subject, \"Deliver Us from Evil\" is essential viewing for all. Father Oliver O'Grady, quite clearly, doesn't look at all repentant. He's like the criminal who gets away with the perfect crime and wants to share his story with an audience. He's on an ego-trip."
    },
    {
      "rating": "9",
      "text": "This movie may bee too long and may have some unpowerful content amount its brilliant script, profound characters, and heart throbbing moments. But its brilliant and messy powerful pizzazz makes it a documentary classic. It is both stunning and powerful. It takes you into the mind of a confessing madman and gives you a in-depth look at the life that his once young victims now live."
    },
    {
      "rating": "9",
      "text": "Just watch this movie, its unbelievable! I have never felt SO bad for anybody as I did for the victims and their families."
    },
    {
      "rating": "10",
      "text": "It is more powerful and haunting then any horror film. More suspenseful then a thriller. More thought provoking then an art film. It is simply amazingly powerful. It ranks with the best documentarys of all time. Every person in the catholic church should watch this film and act on it"
    },
    {
      "rating": "9",
      "text": "The spellbinding power of this Oscar nominee for best documentary comes from its chilling subject matter, a notorious pedophile priest and the cover-up of his heinous acts by the Roman Catholic hierarchy in the state of California. Director Amy Berg's documentary is clear-sighted and tough-minded  a portrait of individual criminality and institutional indifference. A study in the betrayal of trust, and the irresponsibility of authority. In addition to giving faces and voices to victims who are often anonymous, it offers an interview with a convicted ex-priest who admits his crimes without remorse. \"Deliver Us from Evil\" presents three case studies of Father O'Grady's abuse. Simply put, jaw-dropping.\r In the 1970s and 80s, Father O'Grady was serving as a parish priest in several towns in Central California, where he molested children over and over again, both boys and girls, including, a 9-month-old. Filmmaker Amy Berg masterfully exposes just how deeply rooted the corruption runs. Armed with anguished testimony from the families of the abused and their lawyers, she seamlessly presents indisputable evidence that the Church knew about O'Grady's activities. The hierarchy moved him from one parish to another, simply to avoid public scandal, and to prevent destroying the careers of those in power.\r Present day and walking around the streets of Dublin, O'Grady peers into a schoolyard with an interest that can only appear perverse after what's been revealed about him. He seems so removed from his crimes that he could be an actor playing the part of a pedophile ex-priest. That he agreed to appear in \"Deliver Us From Evil,\" is an indication not just of an oversized ego, but also a complete failure to comprehend of what he has actually done. Father O'Grady walks freely today in Ireland, not even registered as a sex offender. \"Deliver Us From Evil\" has already prompted legal attention in Los Angeles toward Cardinal Roger Mahoney, who allowed more than 550 priests under his jurisdiction to molest children without punishment.\r Watching this documentary, and especially the interviews with O'Grady, is so much more disturbing than any piece of fiction could ever be. This is a real monster victimizing children, and it was allowed by a group that was claiming to do God's work."
    }
  ]
}