{
  "id": 2315,
  "title": "Demolition Man",
  "starring": [
    "Sylvester Stallone",
    "Wesley Snipes"
  ],
  "runtime": 115,
  "genre": [
    "Crime",
    "Action",
    "Science Fiction"
  ],
  "description": "Simon Phoenix, a violent criminal cryogenically frozen in 1996, escapes during a parole hearing in 2032 in the utopia of San Angeles. Police are incapable of dealing with his violent ways and turn to his captor, who had also been cryogenically frozen after being wrongfully accused of killing 30 innocent people while apprehending Phoenix.",
  "releaseYear": "1993",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/pxWuGsyzVQSqHWxVQLy4XUcopIL.jpg",
  "categories": {
    "plot": 7.7,
    "acting": 7.285714285714286,
    "ending": 5.5,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 7.444444444444445,
    "action": 7.066666666666666
  },
  "reviews": [
    {
      "rating": "7",
      "text": "90s classic it has both action and comedy something rare nowdays all in all a cult classic."
    },
    {
      "rating": "9",
      "text": "An original, fast-paced, intelligent combination of satire and action. Stallone plays a tough policeman who pursues a dangerous criminal in a future society where political correctness rules. Bullock is Sly's partner and their relationship creates several funny moments. Snipes plays the bad guy who loves chaos and almost steals the show. This is a lighthearted movie but it depicts a 'perfect', rational society which isn't very far from ours.\rargonautis.eu"
    },
    {
      "rating": "8",
      "text": "The critic metascore is **** This is classic Sylvester Stallone. Sometimes these metascores are just a joke. This is one of those times. As of writing this the critic score is 34 and and the user is 8.9. Ridiculous. The critics need to pull their heads out of their ______."
    },
    {
      "rating": "8",
      "text": "Great overall movie, Wesley Snipes was pretty funny to, great action, plot and storyline. The only problem i had with it was some of the acting, especially Sandra Bullocks performance was a little flat, but overall a must see film."
    },
    {
      "rating": "10",
      "text": "I dont understand the critics. This movie is not only a big entertaining with a lot of good jokes, but gives also good action and great performances by Sylvester Stallone, Wesley Snipes and Sandra Bullock. But in addition they created a funny and convincing \"brave new world\" futuristic city.There is only one thing I didnt like: Some action scenes are unrealistic."
    },
    {
      "rating": "7",
      "text": "Demolition Man has a really interesting proposition on Sci-Fi terrain. It presents a striking future to the audience; even the modern audience. Specially modern audience.However, the entire movie is built on a really weak argument: no clear motivations from anyone, no well-drawn characters. Everything in this movie has been done to motivate the action, so, neither the story or the characters is so interesting as the action or the scenario proposed.The future in this movie is the best one character. This story wouldn't work in another way. Or another time."
    },
    {
      "rating": "8",
      "text": "Demolition Man was made in 1993 and is a fantasy action/thriller/sci fi comedy... Demolition Man is full of heavy handed violence, explosions, bad language and humour... Sylvester Stallone (John Spartan aka the demolition man) teams up with Sandra Bullock who's another cop but John Spartan doesn't agree with how the world's changed since being in cryogenic freezing status for yearsthen initially thawed out. The world seems to have lost the plot and there's no normal sex because sex is done through some digital equipment which is hilarious, no swearing is allowed otherwise some dumb machine gives you a ticket fine for swearing demanding you pay a fortune for bad language and there's no toilet roll/paper in the toilets just 3 seashells which is oddly amusing. However, John Spartan (Stalllone) is thawed out from cryo prison to catch Simon Phoenix (Wesley Snipes) who also had his butt frozen for years but has escaped and is a dangerous criminal that the police can't handle so they assign John Spartan (Stallone) to catch him and return him to cryo prison. However, Sandra Bullock and Stallone disobey orders and Stallone doesn't capture Simon Phoenix (Wesley Snipes) but kills him in an explosive action packed finish with bullets flying round and explosions and fighting. Demolition Man is very violent and mixes comedy in with the action which works very well and the acting is great. Overall a decent and entertaining film."
    },
    {
      "rating": "9",
      "text": "I don't know who these \"Critics\" are but they must be pretentious teenagers who don't understand the movies of the 80's and 90's. This is a satirical action roller coaster ride. You know you should be eating salad but you want that ham burger, or should I rat burger. Plus it has Sandra Bullock in tight pants in it.Ignore the stuck up critics (if that's what they are) and watch Demolition Man."
    },
    {
      "rating": "7",
      "text": "This is perfectly good smash-em up sci-fi. Wesley Snipes is a crackerjack bad-guy, and you can put up with Stallone if you have a mind to. Sandra Bullock is fun as a future lady bored with the perfect life. And of course, the good guys win. Buy some popcorn, get out the beer and have a  good time."
    },
    {
      "rating": "9",
      "text": "Um Excelente e original filme de ficção científica de ação.\rWesley Snipes é genial nesse filme dando uma brilhante performance,Stallone também está perfeito,Sandra Bullock é linda e está perfeita no papel."
    },
    {
      "rating": "10",
      "text": "Demolition Man is one of the best Sci-Fi Action movies ever created. Up high on the list for me."
    },
    {
      "rating": "2",
      "text": "Downright horrible movie with plotholes appearing literally every 5-10 minutes. The only few things good about this film is the action (especially the beginning and the final action scene) and Sylvestor Stallone as well as Wesley Snipes. These 2 actors are very good and definately deserve better than to be in this film. The jokes, by the way, range from decent to painful to sit through. (There was one joke that was even used like 3 or 4 times, just altered slightly. It wasn't even funny the first time.) Don't even bother thinking about seeing this film."
    },
    {
      "rating": "4",
      "text": "the thing that stick s out in this movie is senseless violence,  and IM not againts violence in entertainment but the background plot of this movie is so poor and uninteresting,   plenty of tounge and cheek lines you and your friends can repeat   out of boredom, and  some  korny fight scenes mainly stallone"
    },
    {
      "rating": "9",
      "text": "An entertaining movie with creative ideas, a fresh vision for a future society and of cause a great trio with Sandra Bullock, Sylvester Stallone and Wesley Snipes. It is the kind of movie fans like and critics hate and the Metacritic ratings show this. The story begins in 1996 in Los Angeles. There are riots on the streets and the dangerous criminal Simon Phoenix who can be described as psychopath took many hostages and barricaded himself in an abandoned building. The cop John Spartan who earned his nickname “Demolition Man” for causing much collateral damage is on his way to stop him but it is an unauthorized operation that will get him in trouble. After the climax of this set up ituation both are sentenced to a new form of imprisonment.  There is the idea of criminals being cryogenically frozen and get treatments in form of subliminal lessons. After this the actual story starts in 2032 and I stop here because of spoilers. The story is entertaining from start to finish because they took a lot of effort into creating the setting, world and situations. It is a future society that is different from the other things you experience in different movies. Without spoilers I can only say it is an interesting concept and both better than our world and far worse if you think about it. There is a lot to analyze and talk about and we had fun in my circle of friends. Sidenote: nearly everyone I talked about like the ideas and setting as it feels fresher than other more used settings. Back to the review: Also the humor and action is well done and improves the movie. Of cause without the great team behind the movie it would be a lesser experience. I think I should praise the director and writers first. Marco Brambilla delivered an awesome debut and the movie is memorable for the script and ideas by Peter M. Lenkow and Robert Reneau. The cast delivers an excellent performance. Wesley Snipes as Simon Phoenix is an excellent villain. He is crazy, enjoyable and intimidating. Sylvester Stallone as John Spartan is the hero. He also delivers his role and has some scenes to act well. Sandra Bullock as Lenia Huxley is a good asset but I feel they could have used her better. However she does the best she could and it is praiseworthy for me. Other than those I remember Nigel Hawthorene, Bill Cobbs and Glenn Shadix. The main actors deliver and help to make the movie so enjoyable. The sets, costumes and style are amazing. They convince me that the setting and world is real. If the immersion is good you have succeeded. Overall I see this a classic and rewatched it a few times. A great experience alone for the ideas. It is not a 10/10 and misses this mark but this does still mean it is really good."
    },
    {
      "rating": "4",
      "text": "\"Demolition man\" car partout où il passe, les bâtiments trépassent et qu'une fois les vilains refroidis, il ne reste plus que des ruines ! ce film n'est en soi qu'une grosse bande dessinée gonflée aux stéroïdes et en même temps une tout aussi grosse pantalonnade... même si ça reste de temps à autre assez spectaculaire.Cela ne se prend donc jamais totalement au sérieux ou plutôt rarement en fait malgré tout de même nombre de morts violentes et les macabés qui s'entassent ; il faut dire que contrairement à un Commando (oui, celui avec Schwarzinator) les blagues sont éculées, les jeux de mots téléphonés et les clins d'oeil gros comme des maisons.Au milieu de tout cela, Wesley Snipes cabotine pire qu'un Joker sous amphétamines et accentue encore ce côté décidement trop forcé et superficiel... Pourtant, cette société futuriste de bénis-oui-oui, de culs bénis et du politiquement correct a certainement ses bons moments et quelques bonnes idées. Elle préfigure sans doute l'évolution de notre société actuelle de bisounours du vivre_ensemble où l'on combat le terrorisme avec des fleurs et des bougies et les manifs des casseurs anarchistes avec des discours pontifiants.En tout cas, une débutante faisait ses débuts aux côté d'un Stallone globalement toujours aussi constipé : Sandra Bullock ! et son ingénuité y reste charmante. La réalisation est de bon aloi mais un tantinet cut alors que le film manque de nerf ici et là. C'est que le film un peu embourbé dans ses impératifs de comédie a oublié qu'il s'appelait \"Demolition...\".On ressort finalement assez déçu de cette dystopie un peu trop bouffonne pour séduire ou du moins amuser : ce n'est heureusement pas aussi débile que le Juge Dredd avec le même Sylvestre, loin de là même... mais tout de même."
    },
    {
      "rating": "10",
      "text": "this is one of the great 80s Movie. its silly, its fun its just a great time. i love this Movies with all its flaws..we need this kind of heart and souls in movies again."
    },
    {
      "rating": "10",
      "text": "Dark satire about a politically correct Utopia society. That all seem's well and above board until they defrosted the Demolition Man. Looking at today's times this is almost prophetic lol."
    },
    {
      "rating": "7",
      "text": "Demolition man is not to be taken seriously , look at it as a cheezy self aware action sci fi film and then probably you will like it. The action is cool and both Stallone and Snipes give over the top performances but it works for a film like this. The future society may look funny which can make this film into an action comedy but in a positive way."
    },
    {
      "rating": "6",
      "text": "John Spartan i Simon Phoenix ... :) Klasyka kina lat 80 i 90... jest tutaj wszystko, charaktery z jajami, wizja przyszłości i trzy muszelki ;)"
    },
    {
      "rating": "9",
      "text": "This movie is a TON of fun. If you are looking for a great 90s action movie, then look no further."
    }
  ],
  "recommendations": [
    "shooter",
    "true_lies",
    "angel_has_fallen",
    "gangster_squad",
    "2_guns",
    "red",
    "the_equalizer",
    "from_paris_with_love",
    "copshop",
    "the_last_stand",
    "the_losers",
    "jack_ryan_shadow_recruit",
    "american_ultra",
    "red_2",
    "boss_level",
    "the_mechanic",
    "last_action_hero",
    "iron_man",
    "white_house_down",
    "escape_plan",
    "skyscraper",
    "mission_impossible_ghost_protocol",
    "kingsman_the_secret_service",
    "die_hard",
    "iron_man_2"
  ]
}