{
  "id": 2273,
  "title": "Demon Slayer: Kimetsu no Yaiba -To the Swordsmith Village-",
  "starring": [
    "Natsuki Hanae",
    "Akari Kito"
  ],
  "runtime": 115,
  "genre": [
    "Action",
    "Animation",
    "Fantasy"
  ],
  "description": "After his family is viciously murdered, a kind-hearted boy named Tanjiro Kamado resolves to become a Demon Slayer in hopes of turning his younger sister Nezuko back into a human.  Together with his comrades, Zenitsu and Inosuke, along with one of the top-ranking members of the Demon Slayer Corps, Tengen Uzui, Tanjiro embarks on a mission within the Entertainment District, where they encounter the formidable, high-ranking demons, Daki and Gyutaro.",
  "releaseYear": "2023",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/o8DB5825myndApdQQHbf4bv1mzL.jpg",
  "categories": {
    "plot": 6.222222222222222,
    "acting": 6.764705882352941,
    "ending": 5.3125,
    "soundtrack": 9.5,
    "cinematography": 5.666666666666667,
    "familyFriendly": 3.0,
    "funny": 3.6666666666666665,
    "action": 4.5
  },
  "reviews": [
    {
      "rating": "6",
      "text": "The Village has a twist at the end that is just out of this world and literally is, but that does not make this movie a bad one, it makes it a dark drama about what is it like to live in harmony, and I surprisingly enjoyed it."
    },
    {
      "rating": "10",
      "text": "Beautiful film. Stunning. Gorgeous cinematography, masterclass performances from the cast, and a beautiful, haunting score. The negative reviews likely have to do with the way this move was marketed. People went in thinking they would get a horror film, and instead got a love story."
    },
    {
      "rating": "9",
      "text": "I don't know why so many people don't like this movie. I find it truly amazing. Don't expect it to be a slasher/gory horror movie cuz it's not. The acting is superb from everyone in this movie and the cinematography is different and interesting."
    },
    {
      "rating": "9",
      "text": "All the numbers you see below that are in green are from people who actually have a higher sense of intelligence and can comprehend concepts that are not based around solely the shallow physical world. All the red numbers are from people who lack any capacity for art and need shallow entertainment to keep them afloat. Great movie."
    },
    {
      "rating": "9",
      "text": "This movie is not ment to be a horror/thriller movie. It creates its own genre. The story has great detail and a great plot. It also scares you with your own fears. A great movie, see it."
    },
    {
      "rating": "0",
      "text": "Is it possible to give a movie a negative score? Cause this one didnt even deserve a 0. It was by far the worst movie i have ever seen. Slow, boring, not scary AT ALL. If your going to advertise a movie as a scare fest....then you better come through. OVERALL CRAP"
    },
    {
      "rating": "9",
      "text": "Phenomenal, underrated, and misunderstood. This film works and it is executed with such finesse and beauty, accompanied with top rate  acting on behalf of nearly every character, especially Hurt, Howard, Phoenix, and Weaver. It deals with the human nature of pure fear in the midst of a warm depth of love and how we cope with it all. This film grew on me over time, and while not hailing it as much just as soon as I walked out the theatre door, it still made me think as it aged gracefully in my mind."
    },
    {
      "rating": "7",
      "text": "An atmospheric masterpiece with a story that doesn't quite lead up to it's build up however after a second viewing many will see the key metaphor behind the village which is what the movie is all about."
    },
    {
      "rating": "6",
      "text": "This had the premise of a great movie if M. Night Shyamalan didn't screw up the ending. The film leaves a bad taste in your mouth. This is when Shymalan's writing and directing begins to slip."
    },
    {
      "rating": "7",
      "text": "This is very intriguing. I thought this movie was still a cult classic, and here I come into this page seeing an 5,8 User Score. This movie deserves a bit more, let me tell you why.\rSure, it's not a movie that is here to fascinate and captivate with it's creative shots and effects - though some of the movie is very beautiful, that is largely due to the amazing soundtrack, which if you havent heard - you should, it got an Oscar for good reason. The actors do their job pretty nicely too, however I don't recall anyone making a massive impression on me. But the one thing I remember was the story. It was very timed, very trhilling and a great premise overall. Just for the premise alone, though not that original, I say this movie deserves at least a 7/10. 5.8 just doesn't do it justice - it has some very scary momments, combined with very well told lore, a great character evolution and an awesome soundtrack. Sure, it might look a bit dated, but I think it holds up pretty nicely.\rConsider this just a comment, not a review. I simply had to say what I thought about this. I love this movie and I recomend it to anyone wondering if they should watch it."
    },
    {
      "rating": "7",
      "text": "Really slow for the first half but picks up significantly after that. The atmosphere is great, and the characters are all extremely interesting as well as the backstory and twists for this village. There's one scene towards the end that is pretty scary. Definitely one of Shyamalan's better movies."
    },
    {
      "rating": "6",
      "text": "this is a very sweet movie but with one of the most crazy story that I ever seen. Everything in that were so predictable, but I realy liked tha \"strange creatures\""
    },
    {
      "rating": "3",
      "text": "Bryce Dallas Howard is a gem. It's fine if you don't buy it, just watch her and Joaquin Phoenix share their childhood.The VillageM. Night Shyamalan, the writer and director, over the years has managed to create his own followers, fans with a specific voice and taste. Now I might not be strongly one of the members of the elite group but his grammar is something I understand and occasionally fall for. And this is what I love the most about his films. It is not something that actually makes you think or makes your head spin with jaw dropping visuals, what it is, is a slow burn and what it does is make you fall for it, slowly, like falling in love. It could happen within two hours or just an instant. And his films does spiral out, does advance in a way that every scene lacks a missing puzzle.And it is always that one missing puzzle. So it can happen that you can fall in that one moment. But this one works somewhat different than his usual films. In fact it works in the opposite direction. Usually his film starts somewhere in the middle of the desert and then finds a proper track as it ages. The film ages and things start to make sense as every element falls into places. What we have here is outrageously arrogant.Yes, I understand that the storyline asks for the film to make sense, have correct order from the first stage and it also asks for the chaos to flood in and upset the expected outcomes. But when the film shines the light on the hidden matter, where it is anticipated to check off all the avant garde activity into certain mannerisms, the film keeps that vacant and us, strangely alone in the middle of the woods. The Village could not be more isolated, it makes sure you feel the same way after you've had its tour."
    },
    {
      "rating": "10",
      "text": "I'd like to say two things about myself before starting this review.  First of all, I almost always agree with critical ratings for movies.  Second of all, I like to go into movies without knowing anything about them except their critical ratings and/or Oscar/Golden Globe performance.  I watched The Village because of a friend's recommendation, knowing nothing about it or its director, M. Night Shyamalan.  Halfway through the movie, I knew it was great.  After it was over, I was certain it was one of my favorite movies ever.  Much to my surprise, I found out later that it had mixed critical reviews at best.  To this day, however, this is by far my favorite film of 2004.  My theory is that too many people went into this movie knowing at least one of two things: the director of the movie and everything in the trailer.  Shyamalan is known for making movies with silly twists and awful dialogue, so I think too many people failed to give this movie a fighting chance.  And the trailer made this movie look like a cruddy horror movie.  I certainly wouldn't have watched it after watching the trailer, and if I had liked what I saw in the trailer, the movie probably would have been disappointing.  So to those who haven't seen it, know that this movie tells a love story.  The setting of the movie does not make the movie.  The plot twists (though very well done I think) do not make the movie.  The suspense/mystery helps make the movie engaging, but does not make the movie.  As it should be with any great movie, the characters make the movie, and the three main characters (acted superbly by Bryce Dallas Howard, Joaquin Phoenix, and Adrien Brody) are interesting, believable, and imperfect."
    },
    {
      "rating": "10",
      "text": "Without a doubt, the greatest film I have ever seen. I don't understand why anyone wouldn't like it.  The acting is phenomenal, the cast is great, the music is the best I've ever heard in any film, the movie is deep, creepy, twisted and brilliant. It's a story of how far someone will go for love. Anyone who didn't like the movie was expecting a slasher movie."
    },
    {
      "rating": "9",
      "text": "This is one of the most misunderstood and misjudged films that I have ever seen.  It's a powerful story and an incredibly fascinating study of human nature, the psyche, and of society.  The main reason for poor reviews centers around disappointment over the fact that the film isn't about what people thought it would be about going into it.  People who are big lovers of slasher and horror films saw the trailers and thought that this was going to be one of those. It is not. So, if you're looking for those kinds of thrills, you may be disappointed.  If you watch this with an open mind and don't set yourself up with expectations, you may be pleasantly surprised by a powerful film.\r The acting is superb.  William Hurt, Sigourney Weaver, Adrian Brody, Joaquin Phoenix, and newcomer Bryce Dallas Howard all deliver outstanding performances.  Their characters are both believable and engender empathy from the audience.  They are deeply human portrayals.\r The story, while requiring some suspension of belief, is plausible.  It's a fascinating story about what happens to people who try to escape the sorrow and pain of their past by living in an idyllic, \"innocent\" society, only to discover that the very crimes and fears they sought to escape are lurking right in their midst...in their own society and in their own hearts.  This is a thriller with a very realistic human dimension, if you are willing to enter into it and see it.\r The music is superb and fits the tone of the film very well.  It's dramatic and emotive.  I thought M. Night Shyamalan did a fantastic job with writing and directing this film.  His curse is the huge success he achieved with The Six Sense and then having to live up to and exceed that stellar success.  If you can set aside your preconceived notions of what one of his films is \"supposed\" to be about, you will enjoy another of his classic films.  I think this is one of his best."
    },
    {
      "rating": "8",
      "text": "The movie was great, can't understand the bad ratings lol"
    },
    {
      "rating": "1",
      "text": "The plot was good enough, but the script was horrible and the acting was mediocre. At times the script gave me a headache! It was a pathetic attempt to make the actors speak as if they were in the 19th century."
    },
    {
      "rating": "6",
      "text": "The Village is an interesting little film. Featuring exquisite cinematography from the legendary Roger Deakins and a great score from James Newton Howard, it packs a lot of promise just on the surface. The acting is also pretty good. Nobody really stands out, but they all turn in solid performances. In addition, M. Night Shyamalan does a great job building suspense and keeping us on the edge of our seats throughout. Heck, I even like the twist here. In many ways, I find it to be creepier than the other most likely explanation for what is happening in this village. Yet, aside from the look of the film, the terrifying atmosphere, and the score, nothing is truly great about this one. The story is interesting, but overall, the film lacks a certain \"wow\" factor, leaving it as simply slightly above average. I am surprised at the hostility towards the twist here, because again, I quite liked it. Though it changes the film a bit, it still keeps it as creepy and intense as it previously was, which is why I am sad that I did not like it more, but alas, here we are."
    },
    {
      "rating": "3",
      "text": "Boring. Pretentious. Slow. All words that describe this travesty of a movie. The biggest problem with The Village is that it tries so obviously hard to be smart, and that everyone involved thinks they're being really clever. The sad truth is, they aren't. And what the hell was that ending? Really, guys? THAT\"S the best you've got?"
    },
    {
      "rating": "3",
      "text": "Poor story and script, underdeveloped idea and plot, unfinished and not so interesting. I hate describing film as 'boring', but sometimes that's the word. The Village is boring. Some plot scenes would have been much more impacting, like revealing the big secret of the village or red, not real creature dead in the woods or meeting with people from the town. From such movies you see and learn of the importance of directing and how it affects the whole movie. Because of the lack good directing 'The Village' fails to impact and to be liked by the audience, although there is potential. Points for idea, story and acting."
    },
    {
      "rating": "3",
      "text": "Can Shyamalan still be called an \"it\" director? Let's face it that other than \"Sixth Sense\", his other two (now three) have been utterly disappointing. Especially this one, that lacked any kind of energy or intrigue. The twist at the end as was already pointed out was obvious. Everything in the movie was done in a nauseating vague manner...... The costumes laughable. The direction was very good, but the script was cumbersome at best. Adrian Brody played a crazy village guy for some reason and Joaquin Phoenix played that character that doesnt seem to want to speak, but then gets coaxed into it. All the elders seemed cardboard. I would bet there was more violin than dialogue. And just a suggestion to M Night: how about trying to make the monsters look somewhat realistic? I nearly fell out of my seat with laughter at the aliens in \"Signs\" and trust me, very little improvement in this one. Was this a comedy? No, a disappointing movie by an overrated director."
    },
    {
      "rating": "3",
      "text": "i did like how the story twisted but i didn't like how it turned out. this movie could have been a lot better if it didn't end up like it did. I did think that it was good at the beginning butwhen I found out that the creatures in the forest were adults in costumes I was dissapointed."
    },
    {
      "rating": "8",
      "text": "I only saw this once, in the cinema, and I thuoght it was really spooky. I went to see it with my friends and I thought the scary thing was a hedgehog. Oh, and one of my friends won't have anything to do with red. I think she was joking."
    },
    {
      "rating": "3",
      "text": "i gave it a 3 because at least its a movie, but in short. It sucked. no plot no storyline."
    },
    {
      "rating": "0",
      "text": "This movie was by far one of the **** horror movies of all time. It amazes me how it has a higher score than better grossing and interesting movies such as the Saw series. A good movie isn't watching a blind woman getting scared due to village people. Honestly, are todays movies critics blind?"
    },
    {
      "rating": "7",
      "text": "THE VILLAGE IS a seemingly innocent and innocuous story that turns on a dime, presenting the terror, wit and twist ending that made Shyamalan's THE SIXTH SENSE so brilliantly original."
    },
    {
      "rating": "3",
      "text": "This movie falls completely under the same category as every M. N. S. -film. Total and utter nonsense. The director continually tries to mystify and over-intellectualise banal drivel. There is so much suspension of disbelief needed in this film - as in all of them, that you have to be a brainwashed fanatic not to notice how nothing happens for large amounts of time, how the director always fails to get inside his characters' heads, and how silly, childish and pompous his plotlines are. And still Shamalayan tries to convince us he has a \"hidden, deeper message\" underlying it all. The message is clear: Steer wide of this waste of your time."
    },
    {
      "rating": "3",
      "text": "The Village began Shyamalan's fall as a director. The Village tries so hard to be something more than what it already is but its sloppily directed and has more \"why\" then scares."
    },
    {
      "rating": "5",
      "text": "Looking back on this film I can appreciate the plot twist but at the time of watching and I believe I will forever feel like this was a giant waste of money. I went expecting a horror or at least a thriller as the trailers led me to be believe but instead I got the feeling of pure disappointment."
    },
    {
      "rating": "7",
      "text": "Really enjoyed it but you just know this is the type of film that most critics will hate.  Oh well their loss."
    },
    {
      "rating": "9",
      "text": "I was saddend when i saw how bad the reviews were of this movie. i loved how it played out, it shocked me. i was glad it didn't turn into a monster-slasher movie. it deserved better rattings."
    },
    {
      "rating": "10",
      "text": "Phenomenal. but only to those who are intelligent enough to understand the window of social consequence that M. Knight opened in The Village. This movie was about the personal and social ramifications of creating a subsociety. I think some of the same psychology can be found in the subcultures within our own society."
    },
    {
      "rating": "1",
      "text": "Good actors and well-filmed, but a truly goofy plot makes for a predictable and boring time-waster by the Shyster. Bergman he ain't."
    },
    {
      "rating": "7",
      "text": "I loved The Sixth Sense. I thought Unbreakable was silly. I fell asleep 15 minutes into Signs. So it was with very low expectations I decided to see The Village. Having seen it now I will say the following: I'm giving Signs a second chance. And I'm definitely going to see Lady in the Water. I am again a fan."
    },
    {
      "rating": "10",
      "text": "amazing film, the art is screaming, Bryce excellent, Brody simply brilliant."
    },
    {
      "rating": "0",
      "text": "Unbearbly lame, unwatchable tripe; one of the worst \"films\" I have ever seen."
    },
    {
      "rating": "1",
      "text": "For all you people who were dissmayed at the fact that it wasn't really a thriller, I know how you feel. When I first go the chance to see this movie, was expecting at-the-edge-of-your-seat thrilling events like monster killing or mass murder. But nooooooo, the only slightly exciting parts were in the previews, which in my opinon, was better than the actual movie. The rest of it is just everyday life for people in the 18th century. What I hated the most was the ending. What they say is an , \"Astonishing\" truth is, in actuallity a big dissapointment. The only money this movie made is a product of flavored false advertising. Don't see the movie and from now on don't entirely trust previews."
    },
    {
      "rating": "2",
      "text": "Shyamalan seems to officially be more interested in tricking us, than scaring us, which is a shame, considering he's much more apt at the latter. The first 30 minutes (the scary part) produces some of the same quality scares as Signs. The last 30 minutes (the tricky part) are more than obvious and filled with the depth of a junior high writing assignment. The movie is well made with superb cinematography and music, and M. Night continues to prove he's an apt director. But one in need of a screenwriter."
    },
    {
      "rating": "1",
      "text": "Terrible! Supposed to be a thriller? Was it heck it wasnt the least bit thrilling! Sure the twist was slightly clever but ever so predictable and made the movie less scart. It was more funny than anything especially the \"magic rocks\" and sending some blind girl across a forest and over a wall and into a town just for some medicene! its just stupid! Why not send one of the \"elders\" they know the secret and they can see! A complete waste of my time!!"
    },
    {
      "rating": "10",
      "text": "The reviews for this movie have completely obliterated my view movie criticism. I just finished reading the incredible reviews for Hon Kong and am in aww. I will never trust a metacritical movie score again (not to say that I have in the past). Absolutely ridiculous. To be honest, M. Night Shyamalan, always pitchs his movie trailers to totally mislead you and your expectations. I actually like that but could see why someone wouldn't. I think a lot of people were upset because they were expecting some horror film and received a really smart thriller. Second, M. Night Shyamalan has the unfortunate problem of being examined by the entirity of pop culture because of his previous success with The Sixth Sense. This movie is more in the vein of an art film. A movie that true movie lovers appreciate not really for mass appeal and pop culture's ADD satisfaction. In all honesty I didn't think the Sixth Sense was that great. I'm not a huge Shyamalan fan but this is definately his masterpeice. Wonderful plot, cast, production, ect. = wonderful movie."
    },
    {
      "rating": "2",
      "text": "Yes, believe the reviews. It's a stinker. The reason I'm even bothering to vote is 'cause I noticed James Beraldinelli's review. From what i can remember, this is the only movie he liked that I absolutely hated. Interesting."
    },
    {
      "rating": "1",
      "text": "Just horrible. It thinks it's clever but it's just lazy in coming up with a tricky ending."
    },
    {
      "rating": "9",
      "text": "What can I say but I really liked this film. I actually do not like horror/suspense films but The Village transcended any such definition by being much more psychological oriented which begged the question of much larger sociological condition. For those who prefer their films coated with candy this is not the film for you. If however you enjoy a thought provoking film that is masterfully acted with a beautiful and believable setting then this films is one of the rare ones. Among other things this film actually made me long for an innocence that living in the modern fast paced world has robbed us of. I can definitely see the allure. But then again the pesky human condition of suffering, and often by our own hand, raises its ugly head. I however was soothed by the love story. What one is willing to go through for true love is a theme I never tire of. And considering Ivy's condition it made it all the more so powerful. It was as if I could feel what it was see was feeling, the fear, love, and sheer will to continue. And by the end I felt uplifted by the results of her trails as well as the difficult choice of the elders, even if it only supposedly occurs in one tiny portion of the world."
    },
    {
      "rating": "8",
      "text": "Slightly slow but a brilliant concept for a film. The twists are poor, but the overall idea is innovative and touching. When watching for the first time there are some fine moments of suspense. Every viewing after you ignore the horror element and admire everything else, from the tragedy behind the foundation of the town to the guilt of the elders. Noah also provides one of the best villains in that you find yourself unable to hate him despite what he does. Incredible soundtrack."
    },
    {
      "rating": "2",
      "text": "An absolutely anticlimactic disappointment. Even with strong leading roles and a great score, it falls so many times and leaves you with a depressing sense of cinematic displeasure."
    },
    {
      "rating": "9",
      "text": "This is a great movie. It's not a conveniently-genred horror or suspense flick. It's messy and strange and beautiful and artful all at the same time like a great movie should be. (I agree with accusations that the fright-filled trailer is misleading.)The formidable cast including Bryce Dallas Howard, William Hurt, Joaquin Phoenix, Sigourney Weaver and others, breathes life into M. Night Shyamalan's unique poetic prose. I typically agree with Metacritic ratings so I didn't see this film when it came out in 2004 and just watched it now in 2018.  The critics were wrong. This is a solid film about people facing the consequences of their decisions."
    },
    {
      "rating": "3",
      "text": "This undeniably talented writer-director M Night Shyamalan has been repeating himself with steadily decreasing movies and his latest does nothing to buck the trend. Add on top of that the ending was extremely disappointing."
    },
    {
      "rating": "5",
      "text": "I thought he movie had a lot going for itself even after the twist was revealed. However,  it kept at a boring pace and didn't deliver much excitement and scary moments."
    },
    {
      "rating": "8",
      "text": "The Village hands down has got to be the second best thriller/drama, movie with a twist that I have ever seen. M Night Shyamalan has out done himself again. A gripping movie that will keep you guessing until the very end. For more about this movie check out our blog at http://chique-critique.blogspot.com/2012/11/the-village-drama-mystery-thriller-2004.html"
    }
  ]
}