{
  "id": 1145,
  "title": "Den of Thieves",
  "starring": [
    "Gerard Butler",
    "Dawn Olivieri"
  ],
  "runtime": 140,
  "genre": [
    "Action",
    "Thriller",
    "Crime"
  ],
  "description": "A gritty crime saga which follows the lives of an elite unit of the LA County Sheriff's Dept. and the state's most successful bank robbery crew as the outlaws plan a seemingly impossible heist on the Federal Reserve Bank.",
  "releaseYear": "2018",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/AfybH6GbGFw1F9bcETe2yu25mIE.jpg",
  "categories": {
    "plot": 6.75,
    "acting": 7.166666666666667,
    "ending": 5.8125,
    "soundtrack": 5.0,
    "cinematography": 9.0,
    "familyFriendly": 3.0,
    "funny": 5.0,
    "action": 6.615384615384615
  },
  "reviews": [
    {
      "rating": "1",
      "text": "It's like masturbation but without the finish. I wouldn't recommend this to anyone."
    },
    {
      "rating": "3",
      "text": "The overall premise is cool, I like ambition in my bank robbers. However, when King Leonidas, er Lt Flanagan, catches whiff that's when plausibility goes out the window. Things get stupid then, and the director - Christian Gudegast, \"London Has Fallen\", another tepid Gerard Butler vehicle - tries to cover that up with a shootout that's the very definition of ridiculous. Seriously, how do you have a high-impact rifle shootout involving the public in LA and there aren't 200 police responding in minutes?! So Hollywood stupid. And the little twist thing they do at the end is so anti-climatic, it just adds to the disappointment of what this could've and should've been in more capable hands."
    },
    {
      "rating": "6",
      "text": "\"Den of Thieves\" has lofty ambitions, and grasps a bit of it. It could have been more bleak, and effective in delivering its twists."
    },
    {
      "rating": "4",
      "text": "It seemed interesting at first, but when a movie has some completely illogical aspect as to how the crime was solved, I'm no longer interested in watching the rest of it.  So about 30 minutes into it, the cops are sitting at the station trying to decide who did it.  Then one of them says  \"How about Merryman\"....WHERE DID THAT COME FROM?  Then the lieutenant asks about a guy who hung around with him....Again ,,,WHERE DID THAT COME FROM?  Then when they question that guy, the cops act like they don't know anything about the connection between the two..STUPID."
    },
    {
      "rating": "5",
      "text": "\"Den of Thieves\" was a well planned film, but its duration did not let it work as it should, the story and the characters were good, but its long duration makes it slow, it would have erased some unnecessary things."
    },
    {
      "rating": "5",
      "text": "An inconsistent film to say the least, the action sequences are without a doubt entertaining and the performances turned in by everyone stand up, the story unfortunately degenerates into utter farce and that for me ultimately undermines the potential this film had, this is not a bad film but by the end you will come away underwhelmed."
    },
    {
      "rating": "5",
      "text": "An intense third act heist makes up for a confused first hour or so. There's a lot of clunky writing to set everything up, but it manages to just about hold your attention for just about long enough for all the pieces to come together. O'Shea Jackson Jnr. and Pablo Schreiber in particular put in decent performances, but the film around them is a little too cluttered and messy."
    },
    {
      "rating": "6",
      "text": "Realism is something that is always appreciated, especially auditory realism; in this case every chase, every shot felt real because of the sound. Although the script is a bit behind, I have to clarify that the sound is spectacular. 6.9 / 10"
    },
    {
      "rating": "6",
      "text": "For a heist movie I would've liked a more in depth robbery scheme and plot. Just seems like most of the movie is Gerard Butler's marital issues and the bad guys figuring out whether or not one of their comrades is a snitch or not, which is not only obvious but we already know that he is from the beginning of the movie. The action scenes at the beginning and then end are pretty darn cool but they don't make up enough to help the movie. Gerard Butler was great I thought, he was the perfect guy for the role he was put in. The other positive and what saved the movie for me was the twist ending that I didn't see coming and sets up really nicely for a sequel.Overall, the story is bland, the heist isn't all that great and deep, Butler was really good, and the ending really helped the movie. Don't I'd recommend, didn't find it to be all that fun and good enough. I AM looking forward to the sequel though as it has the potential to be way better just as long as they up the overall story with a better heist and such."
    },
    {
      "rating": "6",
      "text": "A group of expert bank robbers plans to rob the Federal Reserve of LA, while a team of cops tries to track them down. Nothing original here. Even the head cop (Gerard Butler) has classic authority issues and typical family drama. At least he's not an alcoholic, which would have completed the flawed hero trifecta. While the narrative unfolds with predictable plot points, it remains an reasonably involving caper flick. Even at 2:20, it was never boring, but it was never thrilling either."
    },
    {
      "rating": "2",
      "text": "Oh my. There was another hour more of this when we decided to stop the film? It's not just paint by numbers, it's crayola art on the placemat at your local dinner. I think middle-school boys that never saw a heist movie in their life might enjoy this."
    },
    {
      "rating": "4",
      "text": "A boring tale of heist that doesn't even come close to being an adequate action piece with bland dialogue and dull acting."
    },
    {
      "rating": "5",
      "text": "Frankly I expected something worse, but if you've seen some heist films before you know what awaits you and learn in advance that you will not see anything new or more interesting."
    },
    {
      "rating": "6",
      "text": "Lots of needless violence but if you're into that, this movie is great.  Sometimes it was hard to follow and it was a bit long but I enjoyed it for what that's worth.  Although some parts of it seemed a bit far fetched, some of it was fairly accurate I suppose."
    },
    {
      "rating": "9",
      "text": "Butler is very entertaining. Solid thriller heist movie with oddball characters, action, cars and guns. Only film critics, otherwise known and folks who have never made a movie, could find lots of things to hate here. You on the other hand will not. Enjoy."
    },
    {
      "rating": "8",
      "text": "8.4/10 While it is essentially a new generation revamping of Heat, it works extremely well in that regard with an outstanding last hour of pure high octane clever grittiness and action. The first 90 min do move rather slow during the character buildup which is necessary, but as the story pieces together and the intensity hits, it becomes a great ride. The heist sequence was phenomenally executed with innovative genius and the suspenseful conclusion will be sure to surprise. Overall a very overlooked film."
    },
    {
      "rating": "5",
      "text": "Den of Thieves is a thriller of thrillers and that's what it tries to be best at. If I had to see more than just a thriller of thrillers, then I would easily become disappointed since I came to see a movie which can literally become more than just a thriller of thrillers. Yes, I know there's more to this film; however, the only more I can see out of this is a heist thriller of heist thrillers. I recommend renting it once it comes out officially on home media but don't expect it to be more than just a thriller of thrillers."
    },
    {
      "rating": "9",
      "text": "I've read and listened to quite a few reviews of this movie so far and have to say that I'm a bit surprised of how low the rating is.  Most reviews take issue with the notion that Den of Thieves is just a carbon copy of Michael Mann's masterpiece Heat.  I've probably watched Heat more times than I care to mention and did see a lot of similarities but there were also quite few differences.  The technology used by robbers in Thieves is noticeably different and the interactions between cops and robbers is noticeably different too.  Cops are more corrupt and robbers don't get quite as much backstory as you'd like (despite the 2.5 hr run time).  Acting is nowhere near the level it was at in Heat but is substituted by arguably some of the best gun battles I've ever seen (I'd say even better than Heat).  The scenes at the gun range are entertaining and the final robbery and pursuit by the police is just pure awesomeness.  If you're a big fan of Heat and like cops and robbers type movies - this movie will be pure delight.  I give it a 8.5/10 - this is coming from a big HEAT movie fan."
    },
    {
      "rating": "8",
      "text": "Movie was good. Man, these critics need to find themselves..Day Jobs!! I found it to be entertaining and enjoyable."
    },
    {
      "rating": "8",
      "text": "The critics rated this hugely enjoyable LA-based crime drama way too low. A commanding performance from Gerard Butler and taut action sequences make this a cracker. Go see it."
    },
    {
      "rating": "8",
      "text": "the reviews for this movie area bit low in my opinion. I had a good time watching this. give it a chance, you won't be sorry.."
    },
    {
      "rating": "8",
      "text": "Very good heist movie, Gerard Butler is the best that Ive seen him in a while. It's a slow burn film that eventually picks up and rebounds in the middle and last half of the movie. The action was very good and intense, its not groundbreaking but its very good."
    },
    {
      "rating": "9",
      "text": "Thoroughly entertaining action thriller which borrows heavily from Michael Mann's Heat but adds its own unique twist. Solid performances from all involved, especially enjoyed Gerard Butler as the protagonist"
    },
    {
      "rating": "7",
      "text": "An easy story to follow until it surprises with a twist at the end. Action packed driving stunts & riveting shootouts. No Oscar winner but a fun shoot'em up film."
    },
    {
      "rating": "10",
      "text": "This is by no means a masterpiece.  But its user score is so low and it has no reason to be.  Den of Thieves is really great.  Though I don't like the actors in the cast I think they pulled it off and really fit in their role.  The movie was incredibly well directed with a great score.  One of the only problems is the cinematography.  Not because it is bad, its fine, but the color tone can be bland at times.  Den of Thieves is a really great heist movie with really cool fight scenes that...  I HAVE TO STRESS IS NOT CORNY.  This is not a cheezy movie.  This movie has a ok story but is excecuted so well that you don't remember all of its flaws.  The movie reminded me of Sicario."
    },
    {
      "rating": "10",
      "text": "It's the best movie in the world. I love the plot, I love the characters and the special effects are the best"
    },
    {
      "rating": "5",
      "text": "Den of Banality - It's kindof like Heat (one of my favorite movies ever) but - worse in pretty much every way.  Banal writing and cliche dialogue and directing, which had me fast-forwarding to self-edit through some parts, and wanting to for other parts.  The final heist is unique and one that hasn't been done before on film, but its nothing amazing either, and not even to save this mediocre film.  Also, the twist at the end was atrociously stupid.  There are a few heat-like scenes in that the head detective guy is close in periphery to main bad guy, and those are the best scenes of the film, and the ending heist is OK, but nothing great..the rest..is slow and semi boring and very basic which you likely have seen 100 times before.   If you want to re-make Heat at least give it good writing and make it worthwhile, this is horrible in comparison."
    },
    {
      "rating": "5",
      "text": "It started out really good if you expect an action movie with not just action but a story behind it, but in the middle it all changed and was full of fillers regarding main characters relationship and what not, which to me didn't seem brought anything to the story. The action is good and parts of the heists and ending is great, but overall the movie is too long and gets too boring in the middle which really brings down its rating"
    },
    {
      "rating": "7",
      "text": "Bom filme, bons actores, final inesperado. Gostei sem duvida um filme que valeu a pena ver."
    },
    {
      "rating": "2",
      "text": "interesting plot, completely ruined by Gerard Butler, severe case of over-acting and trying way too hard. Ultimately turn it off after 45mins as this pulled me out of the story, ..... --To Gerard... chill out with your acting and think about the audience, k bud? do better in the next one."
    },
    {
      "rating": "8",
      "text": "What on the surface might look like 'another Gerard Butler movie' is actually a very tense, atmospheric and well made crime movie that reminds me of Heat. The Premise: A crew of former soldiers and some criminals perform high stakes heists in Los Angeles, taking increasingly higher risks to get rich and call it quits. The leader of the heist crew doesn't seem to recognize when to stop though, and after a messy job he gets spotted by Nick, a police officer with some rather unorthodoxe methods. Thus a tense rivalry starts as the crew prepares for a very audacious job.Throughout the movie the tension is conveyed very well on the viewer as the heist leader and the officer become increasingly hostile towards each other. Action scenes are visceral, well filmed and get your blood pumping. Though there's not much of it, what's there is well done. I can recommend this movie, i give it an 8/10."
    },
    {
      "rating": "6",
      "text": "Solid movie that goes borderline ridiculous at parts. It’s like the movie Heat for a younger crowd, just not as deep or good."
    },
    {
      "rating": "10",
      "text": "Good movie great ending    A lot of action And moves quick Never heard of the movie before just watched it May 2020"
    },
    {
      "rating": "8",
      "text": "The film should get a straight 10/10 for drifting the Ford Mustang and not putting into a crowd, curb or wall. This is a great heist movie with some great scenes and good acting throughout, scenes are sometimes cinematic with great lighting and tones. I put this film up there alongside HEAT, The Town and Point Break etc etc. It is a film where I am looking forward to the sequel with great anticipation."
    }
  ],
  "recommendations": [
    "wrath_of_man",
    "21_bridges",
    "seeking_justice",
    "the_commuter",
    "the_bank_job",
    "the_mechanic",
    "a_walk_among_the_tombstones",
    "escape_plan",
    "shooter",
    "premium_rush",
    "contraband",
    "man_on_a_ledge",
    "the_call",
    "street_kings",
    "triple_frontier",
    "the_equalizer",
    "unstoppable",
    "the_bourne_ultimatum",
    "safe",
    "the_november_man",
    "copshop",
    "the_equalizer_2",
    "unlocked",
    "rocknrolla",
    "cellular"
  ]
}