{
  "id": 3753,
  "title": "Denial",
  "starring": [
    "Rachel Weisz",
    "Tom Wilkinson"
  ],
  "runtime": 109,
  "genre": [
    "Drama",
    "History"
  ],
  "description": "Acclaimed writer and historian Deborah E. Lipstadt must battle for historical truth to prove the Holocaust actually occurred when David Irving, a renowned denier, sues her for libel.",
  "releaseYear": "2016",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/nDa2t1jxRXQ2QnIqOlBNpVHoEg3.jpg",
  "categories": {
    "plot": 6.173913043478261,
    "acting": 6.16,
    "ending": 7.285714285714286,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 5.0,
    "funny": 7.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "5",
      "text": "A disappointment. Sure, we know how it all turns out, but plenty of other dramatic films have managed to present true stories in a compelling way. Presenting Irving as a buffoon robs the film of its central conflict. And Weisz plays an overwrought role from the start, badly diluting the emotional impact of the defense team's visit to Auschwitz. Really, the lawyers' constant turmoil is distracting. So much effort is expended to create conflict that we are left to wonder how these people ever manage to make it to court on time."
    },
    {
      "rating": "6",
      "text": "Rachel Weisz plays a Holocaust scholar who's sued in British court by a prominent denier (Timothy Spall). While there is a somber, moving visit to Auchwitz, most of the narrative revolves around the legal wrangling. Although it's attempted, the film doesn't succeed in the emotional connection that would have created a powerful experience. Instead, we watch relatively dry legal proceedings (it is England, after all). David Hare's screenplay manages to effectively hit the case's salient points and Weisz's performance is solid, but this is probably the most detached treatment of the Holocaust ever put on film."
    },
    {
      "rating": "7",
      "text": "Well made courtroom drama based on a true story. Good performances throughout and solid direction."
    },
    {
      "rating": "8",
      "text": "“Denial” is the true story of an American Holocaust scholar, Deborah E. Lipstadt, who was sued for libel by a Holocust denier as recounted in her book entitled “Trial: My Day in Court with a Holocaust Denier”. The screenplay for the film was written by David Hare based on Ms. Lipstadt’s book. Mick Jackson directed the film which stars Rachel Weisz, Tom Wilkinson and Timothy Spatt. This is basically a courtroom drama played out in the London courts and gives the audience a clear understanding of the fundamentals of the British legal system and the roles the solicitor and barrister play. Yet this is not just another Holocaust story but a rather sensitive and personal insight into those who teach about this unfortunate event in world history as well as those who lived to tell about it. Ms. Weisz’ performance is extraordinary and she communicates her dedication to the role certainly in some part because of her own personal background and experience. As a lawyer I can recite a number of improbabilities and inaccuracies that take place in the courtroom scenes but one must remember that the screenplay is based on the perceptions of Ms. Lipstadt and I believe that, had there been more input from a barrister or solicitor in the making of the film, the noted inaccuracies would not have appeared. That being said, and seeing the film as a layman seeking a good entertainment experience, this film adequately attains that goal. Accordingly, I give the film an 8 with much of the credit going to Ms. Weisz who is largely responsible for its positive rating,."
    },
    {
      "rating": "7",
      "text": "A film told impassionately and emotionally, Denial from director Mick Jackson is an important film exposing \"historian\" David Irving for the liar, anti-semite, xenophobe, and sexist, that he truly is and expresses in his writing. Though the ending may be obvious, the final verdict of the film is not without tension and power, as the film still manages to create the proper impact of the moment. Yet, Denial is held back from being better for being very much typical in regards to both Holocaust and courtroom films. Operating within the confines of its true story, Denial is relegated to filling in the gaps between its courtroom scenes with prototypical courtroom drama interactions, as well as classic moments from better Holocaust movies. My tears and emotion over the Holocaust were present for sure, but the film never really built on anything that past films have not already dissected.\r Yet, in spite of its typical nature, Denial still feels powerful. A court case about proving the Holocaust and honoring the deceased and the survivors, it is a film with inherent emotional prowess. Mick Jackson brings this element to life in the film and really showcases just how impactful this case is, regardless of which way the verdict goes. Should the judge rule in favor of Irving (Timothy Spall) or in favor of Deborah Lipstadt (Rachel Weisz), the ramifications of the case will be far reaching and could, honestly, change the past. It is through the importance and significance that the film finds its success. Riding on its impassioned telling of the story, Denial rises above its cliches and becomes a thoroughly riveting and moving experience.\r This element is most certainly bolstered by the acting. Rachel Weisz is limited in her lead role, yet still brings the good with an emotional performance. Her overt passion shines through and ignites the same passion within the viewer. Her lawyer, Richard Rampton (Tom Wilkinson), has the same passion, yet far more subtle. It is only later in the film that we realize how deeply this case has impacted him to a similar degree as Lipstadt. Wilkinson does a brilliant job bringing this element to life with a typically great performance. As Irving, Timothy Spall is tremendous. He brings Irving and everything about him to the viewer with the end result that you despise him. Spall, though in a vile role, is brilliant. From his non-verbals to the nonchalant delivery of incendiary commentary.\r While its cliches stand as its biggest faults, Denial also does feature a decent amount of filler at times, as well as oddly chosen courtroom scenes. Though powerful, there is very little actual proving of the Holocaust and far name calling of Irving. He may be wrong, but it takes a few court scenes for the film to actually showcase his falsehoods. That said, the courtroom scenes are still powerful, but a little left of center initially before focusing in on the important moments.\r Overall, Denial is passionate and filled with rage towards deniers. It is this powerful approach that elevates it above its cliches and filler to deliver a solid and thoroughly entertaining, yet poignant film with absolutely stellar performances."
    },
    {
      "rating": "7",
      "text": "A capably made, well-acted fact-based courtroom drama that appears to get things down by the book but that also leaves viewers surprisingly emotionally unengaged, a somewhat perplexing outcome given the highly charged nature of the subject matter. Even though the courtroom debate at the heart of this story is more about forensics than emotions, that theme pervades the film so much that the picture feels more clinical than involving. Enjoy the performances (especially Timothy Spall and Tom Wilkinson), and be awed by the moving visit to Auschwitz (one of the few emotionally impactful sequences in the film), but don't be surprised if this offering lets you down in other regards."
    },
    {
      "rating": "7",
      "text": "Most people don't expect to walk out of a movie smarter than they walked in but seeing \"Denial\" not only entertains but teaches the audiences. Most Americans don't really know about the British court system but the main difference is that in America in libel cases the defendant is innocent until proven guilty while in England the defendant is guilty until they can prove their innocence.\rDeborah Lipstadt (Rachel Weisz) has written a just published book \"Denying The Holocaust\" portraying David Irving (Timothy Spall) as the holocaust denier he is and the latter claims she has ruined his career, cost him a loss of income and defamed him so sues her.\rThe \"Denial\" is based on a true story and the courtroom scenes are word for word from the actual trial records. Richard Rampton (Tom Wilkinson) defends her in court while Anthony Julius (Andrew Scott), who was Lady Diana's solicitor in her divorce, heads a team to prepare the case. Irving defends himself hoping to bring his denying the holocaust to more of the public and increasing his following while making his argument more valid. The outcome of the trial has a lot at stake on both sides and while some may go into the movie knowing the ending they will still get caught up in the trial.\rIt has been awhile since there has been a good trial movie and this fills that absence with both parties agreeing to the judge making the decision instead of the hearing being in front of a jury. His final decision is over a 300 page report and everyone in the audience where I was holding their breath and some even vocalizing at the decision.\rFrom the opening scene, where Irving confronts Lipstadt, giving a lecture in a full hall, to the last scene in \"Denial\", the film holds your attention and the three leads Weisz, Wilkinson and Spall are standouts, especially the latter who as a despicable person may make you shake your head back and forth but will hold you interest. The supporting cast doesn't have a less than worthy player.\rA film about the holocaust doesn't immediately bring laughter to mind but with Lipstadt, as a 'fish out of water', provides quite a few smiles and, in some cases outright laughter, as the differences in the ways of Americans and Brits, especially in the courtroom, come about naturally.\rWhile I wasn't so emotionally involved as I thought I would be I was more intellectually involved than I usually am with a movie.\rAn aside: I have finally found someone who has written, and keeps, more diaries than I did/have and he makes my collection look like nothing!"
    },
    {
      "rating": "7",
      "text": "A courtroom drama about who's right and who's wrong!There are many factors to consider, especially for a film like this. Yep, the film was based on the real courtroom event. The film is about two people to prove they're right on their book about the war crimes whether that took place or not. So all the episodes take place in a British high court with mention of Auschwitz concentration camp, particularly about its ruins than the events that happened in there. That means it's a great drama to learn about how these two fought in a lawsuit face-off, but there's nothing about the real event just like the film 'The Eichmann Show'. If you are not a Jew or a neo nazi or not even a European and North American, then this is an okayish film from the entertainment aspect, other than learning truth and history.I really expected some real events, but we have already seen in many films about Auschwitz camp. So they kept this film as a modern day court trial than mixing up with those old crime. Great acting by all. Timothy Spall nailed it in his negative role. He was just a fine supporting actor, till I started to recognise him since his genius display in a biopic, 'Mr. Turner'. This is his one of the top performances. He could play Don Trump in his biopic, beside Rob Redford who's a bit old for that. Rachel Weisz was okay. Her role was not strong enough, despite she's in the main character. Because everyone around her took the honour to rise above hers. Be it Tom Wilkinson, who was surprisingly awesome.So in my perspective the film was good, but not great. The courtroom events lacked strong hold with what a film needs and what the viewers wants with twists and turns in the argument. But I'm very happy being honest than modifying its story to make film commercial worthy. Though the film had some its own moments, in the end it was not enough. Particularly how it concludes and to think why this trial even took place makes no sense at all. Seems more a joke than anything serious, just because of someone being crazily challenging and the other one responding to it. Anyway, it's still largely a sensitive matter and my view is just as an outsider. But the film is worth a watch, if you are not expecting a bigger picture after reading its synopsis.7/10"
    },
    {
      "rating": "7",
      "text": "Very well acted for sure but what I love about this film is the accuracy. For the dialogue during the court room scenes, They use the actual recorded testimony from the trial and I felt that made this film all the better. They were truly spoken words from a sickening court case and they were among the best scenes of the film. And the filming at Auschwitz was very haunting.My only complaint was that despite being the lead role Weisz didn't have much dialogue or screen time. And she felt really out of character compared to everyone else on the cast. I probably would have re-cast the role and found someone to better fit the film."
    },
    {
      "rating": "0",
      "text": "Well spoken articulate Historian David Irving is portrayed by the most uncharismatic of britbongs while butt ugly Lipstadt is shown as a hottie by jew actress Weisz. What could possibly be the purpose of this movie? The premise of course is the continued perpetuation of the big lie. Spielberg basically gave Lipstadt a a legal warchest in the millions while Irving in over his head represented himself. The outcome was never in doubt and the lizard men win again."
    },
    {
      "rating": "0",
      "text": "Denial is just like the reviews, If you rate this 'movie' negatively your review will get denied. With a base budget of $10 million Denial was a massive box hit flop only drawing in $9.2 million.The movie builds on the narrative that freedom of speech doesn't exist and that fabricated lies can be enough to get a historian thrown into jail. Stunning and brave, right?"
    },
    {
      "rating": "5",
      "text": "It is unfortunate that much of Denial is burdened with ham-fisted, over-acted drama and a wandering script, because Denial tells an important story - and asks important questions. Fans of Tom Wilkinson should definitely watch it, he has the most character development and the best moments. Timothy Spall, while his usual excellent self, portrays a one-dimensional character well; Rachel Weisz, trying on a bad American accent, portrays a one-dimensional character poorly. Add in a wandering screenplay and some directing that tries hard to be bleakly stylish, and Denial is a disappointment that doesn't rise above average. 5/10"
    },
    {
      "rating": "9",
      "text": "Se você é um historiador, professor ou um simples amante de história, você tem a obrigação de assistir o filme britânico intitulado Negação (Denial) de 2016. Este filme pouco percebido, devido o alto valor “estimado” dos filmes puramente comerciais em nosso país, é uma narrativa que necessitamos ver, sentir e falar mais. Pois seu tema é muito sério, e trata não apenas de um fato histórico verídico, mas também de toda uma carga emocional, que algumas pessoas tendem a esquecer com o tempo (o HOLOCAUSTO). Sendo assim, confira nossa crítica do filme Negação.Rachel Weisz como a historiadora Deborah E. Lipstadt durante o julgamento no filme Negação.Negação, como diz em seu nome, trata do gigante julgamento entre a historiadora judia e também escritora Deborah Lipstadt junto a editora de seu livro Penguin Books e o falsificador de história e (pseudo)-“historiador auto-intitulado” David Irving. Os dois travaram uma impressionante batalha jurídica em Londres referente a uma suposta difamação de Lipstadt para com Irving, quando esta em um de seus livros criticou a obra de Irving lhe colocando como negacionista do Holocausto.O filme traz de maneira dramática as disputas morais referente ao caso, trazendo o ego inflado de um adulterador da história contra uma verdadeira historiadora, que fez críticas acadêmicas a este. Tudo isso, trazendo à tona, o velho revisionismo anti-semita e pró-neonazista, que se reergue 20 anos depois da queda de Adolf Hitler. Discursos que homens como Irving tentam fazer com suas obras.Lipstadt e seu time de advogados e defensores após o julgamento. Cena do filme NegaçãoO filme consegue trazer em seu roteiro, escrito em parte pela própria historiadora Lipstadt (com base no seu livro “History on Trial: My Day in Court With a Holocaust Denier”, publicado em 2015) e David Hare (roteirista do filme A Oitava Página de 2001 e Sombras do Passado de 1985), na busca pelas provas do holocausto e das falsificação da história de Irving, para então livrar a historiadora do banco dos réus e colocar Irving em seu devido lugar (longe das discussões acadêmicas e sérias sobre a história do holocausto).O longa dirigido por Mick Jackson (Volcano: a Fúria de 1997, Acusação de 1995 e O Guarda-Costas de 1992) traz um conceito de filme real, que quase se compara a um documentário atuado, tem diálogos fortes e cenas que impactam. Não existe tomada aleatória, tudo se encaixa no contexto do julgamento, tudo demonstra o quanto estava em jogo naquele momento. Isso acabou por tornar o filme cansativo para uma massa casual, que não busca ver e sentir algo por um momento crucial da história (e não falo de um momento que vende como uma batalha épica de cinema, mas aquele momento que ocorre em um tribunal ou na mente de um indivíduo, mas que importam e afetam a história).A briga de narrativas jurídicas são intensas, chegando a ser até (acredito eu) um bom filme para futuros advogados, que queiram assistir algo diferente e entender um pouco sobre o sistema judicial britânico, que alias ganha um bom punhado de tempo sendo explicado no longa. Tudo que aconteceu naqueles meses de julgamento foi esmiuçado e dissecado neste filme de quase duas horas.Timothy Spall como David Irving durante o julgamento, cena do filme Negação.Com um elenco diversificado e bastante competente, como a ganhadora do óscar Rachel Weisz (como Lipstadt), do indicado duas vezes também ao óscar Tom Wilkinson (como o advogado de Lipstadt, Richard Rampton) e do eterno Rabicho de Harry Potter Timothy Spall (como Irving). Foi possível captar esta intensa disputa pela verdade e também pela real justiça, que ao colocar Lipstadt no banco dos réus, colocou também em cheque todos os historiadores sérios e todas as vítimas e sobreviventes do holocausto junto a ela.O filme trata tão bem nosso momento histórico, que ele aborda quase no seu final outro tema importante nesse momento da era da pós-verdade, que é até onde vai a linha da liberdade de expressão real e a que abusa desta liberdade para então mudar a história, trazer notícias falsas, manchar reputações e responsabilizar alguém pelo que ele realmente esta falando."
    }
  ],
  "recommendations": [
    "richard_jewell",
    "the_imitation_game",
    "philadelphia",
    "spotlight",
    "just_mercy",
    "the_last_king_of_scotland",
    "jackie",
    "patriots_day",
    "darkest_hour",
    "the_post",
    "the_mauritanian",
    "judas_and_the_black_messiah",
    "the_reader",
    "the_last_duel",
    "the_theory_of_everything",
    "snowden",
    "the_hurricane",
    "mary_queen_of_scots",
    "men_of_honor",
    "miss_sloane",
    "12_years_a_slave",
    "bombshell",
    "the_father",
    "the_dig",
    "the_danish_girl"
  ]
}