{
  "id": 1012,
  "title": "Despicable Me",
  "starring": [
    "Steve Carell",
    "Miranda Cosgrove"
  ],
  "runtime": 95,
  "genre": [
    "Family",
    "Animation",
    "Comedy",
    "Crime"
  ],
  "description": "Villainous Gru lives up to his reputation as a despicable, deplorable and downright unlikable guy when he hatches a plan to steal the moon from the sky. But he has a tough time staying on task after three orphans land in his care.",
  "releaseYear": "2010",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/9lOloREsAhBu0pEtU0BgeR1rHyo.jpg",
  "categories": {
    "plot": 7.21875,
    "acting": 7.7894736842105265,
    "ending": 7.5,
    "soundtrack": 7.0,
    "cinematography": 5.0,
    "familyFriendly": 7.555555555555555,
    "funny": 7.857142857142857,
    "action": 7.0
  },
  "reviews": [
    {
      "rating": "10",
      "text": "My son (age 7) and I went to see this today with my father - so three generations all watching a \"kid's movie\". We ALL enjoyed the movie and had a great time."
    },
    {
      "rating": "9",
      "text": "Despicable Me deals in the absurd and comes out winning on every level. Why is it that the villains of a film also make for more memorable and worthwhile characters? This is pretty much what the film surrounds itself with, all these villains attempting to outdo each other by becoming the greatest villain ever known.\rSteve Carell voices Gru, an evil mastermind who isn't feeling quite as evil these days, someone has stolen the Great Pyramid, and is now considered the greatest villain in the world, much to the dismay of Gru.\rThe thief in question is Vector (Jason Segel) who seems like an accidental villain, simple minded and naive. but with the typical evil lair that is just too funny to ignore, sharks, missiles and hidden rooms, the film is rich with cliche but knows that it is, making it that much more enjoyable.\rGru aims to better the pyramid raid by stealing the moon, thats right, the moon. With the help of his trusted mad scientist Dr. Nefario (Russell Brand) and his hilarious minions called the, er.. Minions, he hatches a plan to finally be called the best.\rBut when he must infiltrate Vectors lair to retrieve a sonic ray that reduces the size of any object, he is upstaged by all the gadgets on show, so he adopts three orphan girls so as he can get them to deliver robot cookies to the house so as he can move forward with his plan. But who knew he was going to pick the most loveable and funniest of the bunch.\rAgnes is the smallest of the trio, and by far the funniest, she sees and believes things that the others don't, and truly sees a father figure in Gru.\rIt's difficult for a fresh comedy to come in and leave a lasting impression without falling into the same routine of previous attempts, but the film manages to take a very popular and gestated idea and basically poke fun at its own absurdity, and that is where the true laughter lies in this film, the fast-paced animation we are used to seeing in a Pixar film are present here, mixed with a perfect variation of characters and a brilliant voice cast that also includes Julie Andrews and Will Arnett.\rA truly funny and original film has been created with Despicable Me, it has the absurdity and laughter of a one-liner comedy but the heart and assurance of a Pixar classic, without being a Pixar film."
    },
    {
      "rating": "9",
      "text": "Pretty good animated family movie that is somewhat like The Incredibles. The villain was awesome and just the use of weaponry was cool. The part where Gru's boss squeezed the apple was hella creepy."
    },
    {
      "rating": "8",
      "text": "See, if I did not know which company produced this movie, I would have thought it was Pixar. This fun movie is sweet and touching at times, and filled with hilarious surprises throughout."
    },
    {
      "rating": "5",
      "text": "One of the worst opening theme musics I've ever heard, so that didn't set a good first impression with me. Comedy is too juvenile for my liking. Kids would no doubt love it, but there still needs to be more for the more mature for it to better rounded. Story isn't great and seems to be handled a little sloppily, voice acting is meh and I didn't feel much for the emotive content. Nothing new for me really."
    },
    {
      "rating": "8",
      "text": "esta pelicula es un pastel de chocolate un maravilla que merecia el ganar el oscar ya que su franquicia ha recibibido criticas positivas en general a los criticos"
    },
    {
      "rating": "7",
      "text": "Its crazy that this movie is 10 years old. For better and for worse, it definitely reshaped the face of animated film all through the 2010s. This movie's animation hasn't aged super well, but it is well written, charming, entertaining, and it knows when to not be annoying. Its a great family film, and I think it's earned its place in children's movie history."
    },
    {
      "rating": "8",
      "text": "A pretty good effort for the first film from Illumination Entertainment. Despicable Me is a great animated film. Sure it's not my favorite movie, but it's the best in the series. The story is good, the animation looks great, the characters are lovable, and the humor is actually funny. Before the Minions overstayed their welcome, they were funny with some of the greatest moments in this film. Even though its not my favorite, Despicable Me is a great first effort."
    },
    {
      "rating": "9",
      "text": "Despicable Me has dazzling animation, lots of laughs, originality, cute little characters (the minions), and just a heartwarming story , backed by solid voice acting make for an ideal family film. I give this movie 89%."
    },
    {
      "rating": "7",
      "text": "Despicable Me is one the animated film that I enjoyed the most; starting by the plot: two bad guys that are constantly fighting to demonstrate who is the most evil. The interesting thing is that these two villains are very real, they both have conflicts with themselves and with the people that surround them, and both are trying to have a better life. Here lies the charm of the movie, the amazingly well develop characters, and with this I not only refer to the protagonist and antagonist, I also refer to the girls, the old scientist and the minions; all this bunch of captivating characters during the film, manage to break their stereotype. This release of the characters is the most remarkable concepts of this picture, because nowadays the protagonists are typecast and their development is linear or zero. This achievement should be awarded, the director and writers of Despicable Me have come back to the classics. This is what the animation filmmakers must learn, the pillar of cartoon production is a character that breaks his stereotype and evolve to an original form."
    },
    {
      "rating": "6",
      "text": "The puerile movie takes its chances on the comedy and humor rather than the story and characters. As a result \"Despicable Me\" may sometimes be overly reactive to such preposterous comedies they create, but at least succeeds in making a mark in the innocent hearts of the young ones with its mellifluous tone."
    },
    {
      "rating": "8",
      "text": "I really enjoyed it. It's not on Pixar level (obviously), but it was pretty funny and really sweet."
    },
    {
      "rating": "7",
      "text": "Despicable Me has some genuine humour and the animators look like they had fun making it. The characters and movie moments are fun and will have kids and some adults giggling throughout. The story does lack some weight as it ends up being a standard predicable story - something we have seen too many times before and may leave some adults wanting more, but what we have here is fun nonetheless. Recommended for kids.â"
    },
    {
      "rating": "4",
      "text": "The movie's formula might be \"cute and fluffy\" but plot and jokes are nothing worth remembering and Steve Carrell has never been less funny. The little girls and minions give a few good laughs, though."
    },
    {
      "rating": "8",
      "text": "A good solid movie, and a good combination of kids humor and adult humor as well. Will def buy on Blu-ray for the kids when it comes out."
    },
    {
      "rating": "10",
      "text": "Oscar worthy for best animated film but will lose to Toy Story 3. One of the best movie this far and so far it has been Toy Story 3 and Cyrus."
    },
    {
      "rating": "9",
      "text": "A funny, family-orientated film that really goes into depth about adoption and, thatâ"
    },
    {
      "rating": "8",
      "text": "A surprisingly good non-Pixar animated film. No crude jokes, many levels working at the same time, and heart also in a real way not in a Shrek calculated way. It earns its emotions. The film owes a lot to Bond and The Incredibles but it's fun in its own right. A very pleasant surprise."
    },
    {
      "rating": "7",
      "text": "Excellent animation and a series of funny moments make this a thoroughly entertaining film to watch for the whole family. The story verges on absurd but then again it is a fairytale where minions exist and the world's greatest villains have a soft spot for orphans."
    },
    {
      "rating": "7",
      "text": "Surprisingly enjoyed this, although the 3D at times seemed quite poor, the overall animation of the film was good and the story line was enjoyable. Heart-warming tale  for all ages. IT'S SO FLUFFY!"
    },
    {
      "rating": "8",
      "text": "It's been a long time since Universal stopped making 2D animated features except in 2006, they made Curious George that starred Will Ferrell and the rest of the cast. Four years later, they released their first CGI animated feature length film, Despicable Me. I've never saw it in theaters, but I've got the DVD of this movie and now I'm going to review it.\r It revolves around a super-villain named Gru, who plans to steal his arch-nemesis's shrink ray in an attempt to shrink/steal the moon. One day, he adopts three girls from an orphanage and made them do the job for him. Upon being distracted by them, he learns that being a father is more important than just being a super-villain, but little does he know that he himself is on a desperate battle between him and his arch-nemesis named Vector.\r I know what the story was about, but you have no idea how much this movie has impressed me. It has a terrific voice cast, great animation, cool action scenes, and entertaining comedy.\r The only problem that I had with the movie was the villain named Vector. He's wasn't given enough screen time to begin with, but that doesn't mean the characters have anything to do with it.\r Despicable Me lacks in any depth with the villain, but has solid acting and very good comedy. It is in no doubt one of the best animated movies ever made since the Disney era.\r 8/10"
    },
    {
      "rating": "10",
      "text": "I have to say this movie touched my heart as much as it did my laugh box. Steve Carrel is hilarious and if you didn't watch the credits you probably wouldn't know it was him. The story is very creative and original and (as always) was copied a year later with Megamind. I do have a hard time understanding some of those negative reviews though."
    },
    {
      "rating": "7",
      "text": "Light Bulb.\" It took a little time for the light bulb to turn on in \"Despicable Me\", but when it finally does it actually becomes a good film. The slow start almost ruined it for me but luckily the visuals were good enough to keep me intrigued while the directors Pierre Coffin and Chris Renaud figured out where they were going with the movie. And I must say when they finally figured things out it completely turned the movie around for the better.Read full review at FlicksWorthWatching.com"
    },
    {
      "rating": "8",
      "text": "the movie was awesome..but it did tend to rush at some points"
    },
    {
      "rating": "7",
      "text": "I am 31 yrs old and for some reason I still like watching animated film. I absolutely loved those little minion things, they were hilarious! The only problem that I had with this movie was that Steve Carrell accent was a little weak, and at time he just sounded like himself trying to do a Russian accent. Overall this was pretty funny movie. Acting: OK\rStoryline: Good\rCharacters: Good"
    },
    {
      "rating": "7",
      "text": "A great film, harmless family fun.I'll be honest it's nothing new but it's got it's charm and is worth watching, i'd rent rather than buy though :P"
    },
    {
      "rating": "7",
      "text": "Borrowing heavily from Disney and Pixar animation, Despicable Me is charmingly written and thoroughly involving for children of all ages, with remarkable voice acting from Steve Carell."
    },
    {
      "rating": "9",
      "text": "Pretty darn brilliant! I greatly enjoyed this film, with Carell dishing out superb voice talent. It struggles to get off the ground initially, but it takes off after 10 mins or so. This story is so funny and the supporting characters really light up the screen, in particular the three little girls along with the hilariously slapstick minions. Then, suddenly, the film's emotional fist slugs you right in the gut, full force, and this \"evil\" comedy quickly turns to an unconditional, parental-love story."
    },
    {
      "rating": "10",
      "text": "Summer 2010 was a time filled with sweet seasonal treats, especially amongst animated features. \"Toy Story 3\" hit theatres a month earlier than \"Despicable Me\", and was quickly deemed the best animated film of the summer, and quite possibly the year. I had undoubtedly agreed with the previously mentioned statement- until I visited my local movie theatre one afternoon in July to see \"Despicable Me\". The film, which features the voice talents of Steve Carell and Miranda Cosgrove (to name a few), was charming, moving and, possibly most importantly, hilarious for all audiences. I found myself laughing out loud on numerous occasions, as well as stifling back a tear or two at other times. The film is centered around a less-than-superb villain who, in order to complete a ruse to infiltrate his enemy's lair and steal the moon, adopts three orphaned and unmeasurably adorable sisters. With little experience in the paternal field and a strong background in being a misanthropic antagonist, comedy ensues as the girls completely rearrange his life. Looking for a feel-good film with heart, adventure and laughs? Look no further- you've found \"Despicable Me\"."
    },
    {
      "rating": "8",
      "text": "Great, humorous, movie..a film designed to get old and young to laugh..great, clean humor and an interesting storyline,plus memorable characters( including the Minions) make this a one-of-a kind move!!!"
    },
    {
      "rating": "8",
      "text": "Despicable Me is a sometimes predictable yet hilarious piece of cinema with stellar voice acting, a laugh-inducing script, and some of the best animation this side of PIxar."
    },
    {
      "rating": "7",
      "text": "This movie is a great family movie, and it could have nearly managed an 8. The animation is superb and the storyline was surprisingly good. The voices were played well, and the plot of it was good. There is a few messages that the movie may give out to children, (good ones) though. It's funny, random but really good fun!"
    },
    {
      "rating": "9",
      "text": "This movie is absolutely brilliant. The animation is top-notch, the characters are lovable and memorable, and the jokes are bound to have both kids and parents on the floor laughing. It probably won't bring tears to your eyes like Pixar/Disney movies do, but it's still very touching and heart-warming and it will definitely give you a warm, fuzzy feeling. 9/10."
    },
    {
      "rating": "5",
      "text": "One of the best done animated movies I have seen. It is packed with lots of humor and quick wit. As with every movie, one must ignore critic reviews and experience it."
    },
    {
      "rating": "6",
      "text": "A turbaned man, a Muslim in Egypt, is nearly killed by a van carrying American tourists; ugly Americans, made so by the film's use of Lynyrd Skynard's \"Sweet Home Alabama\" blaring over the soundtrack, signifying impropriety. And sure enough, the tourists emerge from the van like they own the place, decked out in garish excursionist regalia, oblivious to their display of cultural insensitivity. Right away, \"Despicable Me\" establishes the American character as being hardly heroic, despicable even, conveyed through the southern family's non-concern for the Muslim pedestrian. When the young boy falls from the pyramid's scaffolding, he falls without any interference from a superhero, because there is no such thing as a superhero(read: Americans and Muslims alike are despicable). This satirical, and boldly subversive opening, demonstrates how the film views America as being the lesser of two evils in every global conflict. America is the more congenial villain. The boy falls; the boy bounces, off from the fake pyramid, perhaps, a metaphor for the fake war, initiated by the despicable against the relatively despicable. The world of \"Despicable Me\" is a dystopian one, and this opening scene establishes this dystopia, by going against the grain of how America sees itself, as heroes, because there's an expectation level on the moviegoer's part that some man from the sky will swoop down from the heavens and save the boy before he hits the ground. But alas, \"Despicable Me\" is not that movie. There's only villains, like Dru(Steve Carrell), an aging evil mastermind, engaged in a race to steal the moon with Vector(Seth Rogen), an upstart scoundrel who wants to just like Dru. This anti-NASA notion is a contest that could easily be construed as a parody of America's fight with the Soviet Union to conquer space during the Cold War. (\"Victor\", Vector's \"nerd name\", incidentally, is the NATO name for a class of nuclear-powered Soviet attack submarines.) When Dru deploys his shrink ray at the lunar sphere, he becomes an evil Neil Armstrong of sorts: the first man to walk all over the moon. He represents the America that other countries make us out to be, a tyrannical America. But Dru has a sentimental streak, a conflicted man who believes in family values, and saves the world, even though nobody asked him to save the world in the first place, as the cause of the dilemma was of his own making. Depending on who you are, Dru's actions, taken in its entirety, makes him either a hero, an anti-hero, or a villain."
    },
    {
      "rating": "7",
      "text": "Sure, this movie was a little kiddy, but at about half the movie, there was, surprisingly, some funny stuff for my age. It could've been better if little kids would understand that Jason Segel, pretty much plays how he is in real life, lazy, sort of that Steve Carrel- type character in Anchorman: The Legend of Rob Burgundy, but most of all, silly as Hell. The movie was also a little sappy, but yeah, for an animated movie about a guy being a dad while also having a \"second life\" to the kids, you should expect something like that. In my opinion, this movie was worth your money. See it yourself if you don't believe me!"
    },
    {
      "rating": "2",
      "text": "Strictly for kids. I laughed maybe 3 times out loud. Very tired jokes, nothing really funny and new if you've seen the trailers."
    },
    {
      "rating": "8",
      "text": "An animated movie is one of the must lucrative schemes ever concocted. No matter what, as long as the film is animated numerous kids will beg their parents to take them to go and see the film. Don"
    },
    {
      "rating": "10",
      "text": "Awesome, not as good as Toy Story 3, but a solid film."
    },
    {
      "rating": "4",
      "text": "Old jokes. I felt like I had already seen this move."
    },
    {
      "rating": "2",
      "text": "You are led to believe that this is about a bad guy who because of some adorable kids, becomes a good guy.  In fact, it really a story about some terrible animation (from a much overused style) about a guy who isn't really that bad (he has minions that he does care about - knows their names, asks how they're doing...), isn't very good at pulling off bad pranks (steals the Statue of Liberty - the small one from Las Vegas), and is just focused on the moon from a childhood experience.  The movie handles the 'adoption' terribly - I mean can you really walk into an orphanage and bring home 3 kids in a day on the basis of some obviously made up references?  There are just so many things wrong with the plot it's just ridiculous, but even if you want to give it a pass because it's a \"kid's movie\" and you have to pretend to be stupid for those types of movies, then fine let's focus on the animation.  Somewhere between Shrek and The Incredibles, it became \"the thing\" to do a certain type of animation that got just enough realism to do people correctly, but not too much to be freaky.  Since then, this and every other animated movie that comes has to follow this style.  The problem is that the style is a compromise, that only works so-so.  Just like this movie."
    },
    {
      "rating": "8",
      "text": "It was a great movie. Funny. Charming. Sweet. The only thing it lacked was story. Go just for laughs."
    },
    {
      "rating": "10",
      "text": "I thought the movie was hilarious!!!"
    },
    {
      "rating": "9",
      "text": "Although not as refined as Toy Story 3, my children enjoyed this much more and were talking about it the next day. Also the audience was more involved in this film. Laughing and getting into it much more, this was true of adults and children alike. So really, this movie does what it sets out to do. It was funny, and good looking. However some of the themes of adoption and returning adopted children back to an orphanage were in poor taste to anyone who has been involved in the adoption process. Most others will not even notice."
    },
    {
      "rating": "9",
      "text": "Loved the movie. nothing else to say. it appeals to all ages and was pretty freaking funny."
    },
    {
      "rating": "7",
      "text": "Good movie for the whole family. The characters were lovable, especially Gru. The soundtrack was fun too (featuring Pherell). We've all been running around the house saying things like \"Freeze Ray\", \"Lightbulb\", and \"Squid Launcher\". That's usually a sign of good fun at a movie when the kids return home with some funny lines."
    },
    {
      "rating": "8",
      "text": "Besides Steve Carell's wonderful accent, the best thing about 'Despicable Me' is how touching it manages to be, despite the fact that the film is clearly set up to end on a good note."
    },
    {
      "rating": "6",
      "text": "well out of all theese family CGI films ive seen this one is prolly down on the bottom of my list. its not bad bujt its not great eather . i found it to be just ok and thats about it . the only decent comedy comes out of the little minions ."
    },
    {
      "rating": "10",
      "text": "This is a Great movie. I myself saw it the day it was released. And loved it. The minions are the funniest characters of the movie. They just do the silliest of things."
    },
    {
      "rating": "7",
      "text": "Although the story isn't totally heart-warming and a few jokes felt a little tired, Despicable Me is still quiet clever in a few places and shows some great animation and design."
    }
  ],
  "recommendations": [
    "spies_in_disguise",
    "bolt",
    "penguins_of_madagascar",
    "hotel_transylvania",
    "despicable_me_2",
    "ice_age_the_meltdown",
    "madagascar_escape_2_africa",
    "the_croods",
    "ice_age",
    "hotel_transylvania_2",
    "robots",
    "shazam",
    "rise_of_the_guardians",
    "storks",
    "over_the_hedge",
    "shaun_the_sheep_movie",
    "madagascar",
    "puss_in_boots_the_last_wish",
    "the_secret_life_of_pets",
    "turbo",
    "megamind",
    "peter_rabbit",
    "despicable_me_3",
    "captain_underpants_the_first_epic_movie",
    "cloudy_with_a_chance_of_meatballs"
  ]
}