{
  "id": 892,
  "title": "Despicable Me 3",
  "starring": [
    "Steve Carell",
    "Kristen Wiig"
  ],
  "runtime": 96,
  "genre": [
    "Action",
    "Animation",
    "Comedy",
    "Family",
    "Adventure"
  ],
  "description": "Gru and his wife Lucy must stop former '80s child star Balthazar Bratt from achieving world domination.",
  "releaseYear": "2017",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/rAuzEXXpdXlUHNzsnxnhnQOCVsA.jpg",
  "categories": {
    "plot": 6.0,
    "acting": 5.857142857142857,
    "ending": 5.0,
    "soundtrack": 7.0,
    "cinematography": 3.0,
    "familyFriendly": 6.823529411764706,
    "funny": 5.82051282051282,
    "action": 4.5
  },
  "reviews": [
    {
      "rating": "5",
      "text": "Overcrammed. Anybody who has seen this movie already knows exactly what I am talking about. The 'minions in jail' subplot, the 'Lucy wants to be a better mother' subplot the 'Agnes wants to find a unicorn' subplot, the 'Gru and Dru' getting to know each other subplot, the 'Balthazar Brat' subplot - Just... calm down. I would consider this worse than the priors, apart from the Minions movie. Not much of the movie tries anything new, nor tries its hardest to top any other animated movies from the past year. It's fun enough to watch with your kids, and is a decent way to kill an hour and a half, but not memorable enough for me to give it a higher score. There's also definitely better to take your kids to see that parents can also get more enjoyment from. What's undeniable, though, is how much money this will make. The cinemas were packed where I saw it, but hey. That's what Illumination does best. Overall, I'll put this right in the middle. It's exactly what you'd expect given the previous two."
    },
    {
      "rating": "5",
      "text": "The last two films were funny and charming, this movie is the half of charming and funny than the other two movies. Despicable 3 deals with a lot of subplots that are not helping or supporting the main plot. Margo, Agnes and Edith are characters that are just there cause the´re were important in the first film but they are boring and useless. The villan is good but there´s a lot of the same jokes about him that it could be anoying. And Dru (Gru´s brother) its anoying and unfunny even though it´s Gru´s same voice with an other accent. The movie is good for children because they will have a lot of laughs at every time of the movie, and adults that love their childresn will have fun two because they are with their children."
    },
    {
      "rating": "5",
      "text": "While the previous two movies were very funny and charming, this movie isn't nearly as funny and charming as the others. It is mediocre at best and outright silly at worst. This is basically a cash-grab."
    },
    {
      "rating": "6",
      "text": "Watching this movie was a harmless experience, yet I couldn't help but feel angry over how many flaws this movie had that could've been easily fixed. First, the movie is rushed, the relationships between the characters are poorly experimented with and the Minions presence in this movie ultimately proves to be extremely unimportant despite having nearly a third of the movie to themselves. Themes involving parenting and siblinghood are so undeveloped to the point that it's a complete and utter bore to listen to the dialogue... because most of it didn't even need to be there in the first place (especially from Lucy) let alone the fact that it could've been replaced with dialogue that properly developed the characters in the movie. There are funny moments, but they don't really apply to the \"older\" audiences... at least the intelligent older audiences. Despite the fact that Illumination had bland animation in Sing (Count how many times they use the same crocodile in Sing... I had to use a youtube channel just to figure it out) at least they had more developed landscapes, especially the roads which are surprisingly unique. It's one of their better visual treats, but not even close to being the best emotionally (because the title to that belongs to Despicable Me... which was basically Annie but if it were actually good.) Still, if you have children, or if you're a child on this website (because I know that most people on the internet are children) I do recommend watching this harmless movie... it won't make you lose too many brain cells."
    },
    {
      "rating": "6",
      "text": "When I saw the trailer, I thought about not watching, but I gave Gru's third movie a try.The film has a very weak plot, even comparing with the second film, which in my opinion, is also weak. No part of it is well crafted, which left me with the impression that the film looked more like an episode. If it was an episode, it would have been better. Even with that, some scenes are funny.About the characters, the girls are still good, but they gave the younger girl more protagonism, which I found unfair to the others. Gru's \"new brother\" was a good character ideia, but like I said, it was not well worked. The villain has an interesting story (maybe?), but nothing beats Vector.In short, Illumination could think of better sequences for Gru and his minions, not just make a movie because they think gonna have money . I would say not to watch it in the theater, expect to go on DVD and draw your conclusions. I gave them a chance, and they wasted."
    },
    {
      "rating": "5",
      "text": "What can you expect with a third installment of a washed out story? A mediocre movie with little to no character development. At least none to really care about. There was no real emotional threshold for our hero (Gru) to cross and prove himself in anyway. There are a few laughs, but the minions just come off as overused and annoying. A few references are made to the previous two films for nostalgia laughs and reasons. Overall, not a great film but not a horrible one. Take the kids and then wait for it to come on Netflix. Not a movie worth purchasing when it comes out."
    },
    {
      "rating": "7",
      "text": "I thought this was a great movie which kept the story going from previous movies. It had some funny parts, although I'm not sure anything will be able to compare to the 1st movie. I will be buying this movie for my daughter to watch at home, but I'm not sure I would pay to see it in theaters again."
    },
    {
      "rating": "6",
      "text": "Fans should rejoice for another Despicable Me film. We should expect another Despicable Me film to be like the first two. The problem with this installment is that it ends up being sluggish half way through. What they promised was another Despicable Me film, we expected it to be that way, what we got is a film that ends up being sluggish right before the film can even reach its climax. If you can still laugh your way through, then Despicable Me 3 can be a great film in the franchise, but as a result of having a sluggish plot that never fixed itself during the climax, Despicable Me 3 never receives much praise compared to the first two installments."
    },
    {
      "rating": "6",
      "text": "It's an okay movie to pass time. While the film is entertaining and colourful enough when one doesn't think about it, one can't help notice the overstuffed plot, lack of laughs & joy, as well as a distinct lack of emotion in the film."
    },
    {
      "rating": "8",
      "text": "Despicable Me 3. After the first two movies, we have a trequel, which shows us another wonderful story about Gru, his girls, Lucy, and the yellow minions. It is a kind story, a great animation and unforgettable characters. It has only two negative points: the first one is the villain. Balthazar Bratt, a former 1980s child star who seeks revenge against the world. He is an interesting and a charismatic character, but who is not sufficiently developed. In the movie we have only two scenes which show us his love for the 80s, but both of them were unbelievable. These scenes are accompanied by typical 80's songs: ''I'm Bad'' and ''Take on me''. The second negative point is the story, more precisely the story lines, there are too many! We have 6 story lines which are little connected. There are Edith and Agnes who search an unicorn, Lucy who wants to be a good mother, Minions in prison etc.So, I think 8 is the perfect mark for Despicable Me 3."
    },
    {
      "rating": "1",
      "text": "Folks come to see the MINIONS not stupid interactions between unbelievable villains (bubble gun chewing no less. If you are under 12 or like cookie-cutter plots and few minion appearances you may like this embarrassment to film ."
    },
    {
      "rating": "6",
      "text": "DecentI think overall lacked imagination, dialogue wise and story wise as it, at times was a but predictable. But with good funny parts that saved this from complete disaster."
    },
    {
      "rating": "7",
      "text": "I think this movie is better than DM2 and Minions honestly. Even with his mistakes, the sub plots than go fast and some jokes that are not funny, the film manages to have a great villain. The characters are good and the feel like they are the same, the humor is hilarious, the animation is great, the music is cool to hear song like the new Pharrell Williams song \"Yellow Ligth\" and Bad from Micheal Jackson and the story manages to have really good changes and respect of the original and his sequel. Not the best of the franchise, but still better than Despicable Me 2 and the Minions movie ."
    },
    {
      "rating": "3",
      "text": "As it doesn't take any risks on the franchise and a sorry plot masterminds it, this new addition to Despicable Me's franchise gets to be every time duller and simplistic."
    },
    {
      "rating": "4",
      "text": "If you ever wanted to see what movie an algorithm would make, then just watch Despicable Me 3. Everything this movie stands for is made to make the most amount of money as efficiently as possible. From the villains character design, to the music choice, to anything the Minions are featured in... everything's made to be as neat, tidy, and appealing to as many audiences as possible. Everything's a reference to something else, and doesn't add anything. \"Of course we had to include Michael Jackson's Bad in the movie! The Algorithm said so!\" a studio producer says. \"Make sure the villain looks like a caricature of the 80s! Kids will laugh at how stupid he looks, while parents will laugh because they can relate to it!\" It's hard to rationalize this hatred for Illumination Studios, because at the end of the day, they are still a company, and a company's main goal is to make money. But when so many other studios try to make money but also push the envelope just a bit, it gets really frustrating when a movie like this makes millions (probably billions by time it's out of theatres... never mind merchandising).And considering how inexpensive this movie cost ($80 million, compared to... say, Toy Story 3's budget of $200 million) other studios will begin to study what they're doing and emulate that. Who needs meaningful and memorable plots and themes when you can have little yellow goons running around, doing goofy things?I can't give this movie a rating under 4, because it is still made well, makes sense, and can still be enjoyable for some."
    },
    {
      "rating": "1",
      "text": "La pelicula es muy mala no tiene gracia, es un refrito de las anteriores no tiene nada novedoso el trailer engaña con respecto a la pelicula. La trama es bastante pobre(spanish)"
    },
    {
      "rating": "5",
      "text": "When I was Minions, I was disappointed that the film was not as good as its predecessors. This sequel to Despicable Me 2 is no different. Despicable Me 3 is another average sequel that proves the series has overstayed its welcome. It is slightly better than Minion, but that's not saying much. My problems with this film is that the plot is a complete mess. While Minions was uninteresting, this film has way too many subplots. In fact, this film is oversaturated with subplots to the point that it just crams way too many different story into one film. Also, the humor is weak in this film. There is also some problems with the characters as Lucy is as annoying as she used to be in Despicable Me 2, Dru is obnoxious, and the Minions don't serve any purpose in this film other than dumb gags. Fortunately, the animation in this film is still great, the villain is cool, and the 80s references throughout the film were nice. As a sequel, Despicable Me 3 is a mediocre sequel that is less charming and funny than its predecessors."
    },
    {
      "rating": "9",
      "text": "The best in the series. The story was great, it was funny and unlike any story I have seen. The characters were great, and made me laugh a lot. It is better than critics say."
    },
    {
      "rating": "5",
      "text": "This Despicable 3 was just ok. The story is fine. The villain was fun and surely the more funny side of the movie. The brother duo wasn't very interesting. It lacked emotions or humor. Somehow I felt Dru was kind of the minion replacement for a good while. The mother vs children relation wasn't very convincing. Not that I was bored, but I will forget that movie very fast. I give it a 55%."
    },
    {
      "rating": "0",
      "text": "Despicable Me 3 is the low point for the franchise that still has decent ( albeit, downgraded by a bit) visuals, but the story is dumb and unoriginal, the relationship between the two brothers doesn't work, the characters range from irritating to bland( with an exception.)and the humor mostly misses."
    },
    {
      "rating": "10",
      "text": "In just seven years, Illumination Entertainment has turned the grouchy, pointy-nosed villain Gru and his yellow Minions into some of the most recognizable characters in all of pop culture. They’ve starred in multiple movies, they show up in theme parks, you can buy their toys, and so on. The characters are ubiquitous. This feat of marketing is even more fascinating in its success considering that the Despicable Me franchise has yet to produce a truly good film, a streak sadly continued by the latest, Despicable Me 3. Like the first two films, as well as the obnoxious Minions spin-off film from 2015, this new entry is a loud, manic, and frantic extended episode of an overly familiar sitcom.Steve Carell returns as the voice of Gru, who is unceremoniously fired from the Anti-Villain League for his continued failure in capturing the current title-holder for the most nefarious villain in the world, the 1980s-obsessed Balthazar Bratt (voiced by Trey Parker, a long way from South Park). As Gru figures out his next steps, he learns that he has a long-lost twin brother Dru (also Carell); upon meeting him, Gru must handle his jealousy at Dru’s upbeat personality, his expansive material wealth, and his flowing blonde hair. A few subplots are sprinkled around the A plot, serving as time-wasters: the Minions abandon Gru and get stuck in prison; Gru’s wife Lucy (Kristen Wiig) struggles to handle adoptive motherhood with Gru’s kids; and one of those daughters tries to find a real-life unicorn near Dru’s mansion in the country of Freedonia.Ah yes, Freedonia. You may recognize that name from one of the greatest comedies of all time, Duck Soup, starring the Marx Brothers. It’s one of a number of overly confident references made in this film, by writers Cinco Paul and Ken Daurio & directors Pierre Coffin and Kyle Balda that exist for no good reason. Take, for instance, the bit where the Minions use an underwater vehicle to nearly run over two clownfish that look suspiciously like Marlin and Nemo from Pixar’s wonderful Finding Nemo. Illumination Entertainment has made a mark in Hollywood very quickly; their films are made cheaply, feature big-name stars, and rake in a lot of dough. (Minions, for all of its lazy humor, made a billion dollars worldwide, which explains why there’s a sequel on the way.) But their hubris in name-checking much, much, much better films only serves as a reminder that you could be watching something else. Despicable Me 3 is as rote and familiar as Illumination’s other work."
    },
    {
      "rating": "0",
      "text": "Okay where in the world do you even begin to start with this film. Despicable Me 3 in my opinion is the worst films of the franchise by far. The plot was really screwy and almost lost my mind when one of the yellow tic tac's started talk, I honestly feel like my dumb o meter sky rocketed halfway through the film. And you thought the minions were annoying, well Dru (Gru's brother) was just as annoying. It's like the creators hired two year olds to write and direct this."
    },
    {
      "rating": "10",
      "text": "Movie Title: Despicable Me 3MPAA Rating: PGWoah. It has been so long since Despicable Me 1, I cannot remember the last time I put down the whole thing. The plot is: The movie starts when someone shows details about an 80's show that got cancelled, known as The Evil Bratt Show. After this, we see that the person who played an 80's evil character in the TV show, Balthazar Bratt, on a motorboat and about to play a tape titled \"Heist Music\". Then, he gets onto a cruise ship on the way to Gru's hometown. However, in the meantime, we notice Gru and Lucy going underwater. Next, we realize that Gru gets fired from the Anti-Villain League for letting go of Balthazar Bratt, the latest evil guy in the world. However, we notice the Minions and Gru's three little girls somewhere in the movie. After that, we see Gru, Lucy, the Minions, and the three girls going to Freedonia to meet his long-lost twin brother, Dru. However, the Minions are later seen in Freedonia being in a singing contest for TV, singing their own gibberish song until the police see them and capture them before transporting them to prison. However, the Minions escape by the time they need to defeat Balthazar Bratt in the big city. The movie ends when Balthazar Bratt is defeated, and when the youngest of the girls is seen with a goat instead of a unicorn.What all parents know (One-to-zero star rating on what parents say): The sexual innuendo, the swearing, and the comic-strip humor.What some parents know: The remaining of the things in this movie.My meta score: 100 points - The movie made it into the hall of fame! This should help uprise the user score for this movie.Warning: Some reviews may contain the alternative for swear words: $&@@&-&/*[££9-9+9-9&-9++99-++**@!?."
    },
    {
      "rating": "10",
      "text": "i thought it was great it was over before you know it.  his brother is a trying to be evil. has lots of neat toys. be interesting to see if they are together in the next movie.   i stayed after the credit to see it something else showed up none thing so you can leave as soon as the credits roll"
    },
    {
      "rating": "10",
      "text": "Steve Carell doubles your fun in Despicable Me 3 – he not only voices Gru, the bald-pated baddie turned goodie, but Dru, his blond, long-lost twin and a villain-in-training with an even more delightfully bizarre accent. The yellow band of fart-tooting Minions are back (their group sing of Gilbert & Sullivan is not to be missed), as is Kristen Wiig as Gru's wife Lucy Wilde, still trying to bond with his three adopted daughters. The plot kicks in when the couple are fired by the Anti-Villain League's meanie new boss (Jenny Slate) for failure to apprehend the notorious Balthazar Bratt (hilariously voiced by South Park mischief-maker Trey Parker). Bratt is a former 1980's child star – cue soundtrack bites from Michael Jackson, Van Halen, a-Ha and Madonna – who is out to steal the world's largest diamond unless Gru and Dru can stop him.Whew! The overload of subplots can be wearying, but you'll be laughing too much to complain. Pierre Coffin (who voices the Minions) and co-director Kyle Balda keep the plot spinning merrily. Pharrell Williams contributes five new songs to the mix, including the hummable \"There's Something Special.\" It's no mystery why Illumination's franchise is still something special after three go-rounds – the box-office gross is a whopping $1.5 billion and counting. Carell is the life of the party and the main reason this animated blast of slapstick silliness packs appeal beyond the PG crowd."
    },
    {
      "rating": "0",
      "text": "silly silly silly silly silly silly silly silly silly silly silly silly silly silly silly silly silly silly silly silly silly silly silly silly silly silly silly silly silly silly silly silly silly silly silly silly silly silly silly silly silly silly silly silly silly silly silly silly silly silly silly silly silly silly silly silly silly silly silly silly silly silly silly silly silly silly silly silly silly silly silly silly silly silly silly silly silly silly silly silly silly"
    },
    {
      "rating": "7",
      "text": "An improvement over the solid yet disappointing Despicable Me 2 and the 2015 Minions spin-off. It's a little sweeter, funnier, and crazier. It still doesn't live up to that first Despicable Me movie, but it's a good enough follow up to make it worth a watch for the kids and maybe the rest of the family too. Steve Carrell is still killing it as Gru and now the newly introduced Dru. The animation is stunning. I can't get over how distinctly different the plastic items look from everything else in the film. It's like you are actually witnessing an animated person hold a real toy. This is something Pixar achieved with their Toy Story series and it is no less impressive here.The brotherly bond on display here between Gru and his surprise twin Dru is entertaining, but lacking a real emotional core. The heart of the Despicable Me 3 can actually be found in Kristen Wiig's character's attempts to become a true mother in the eyes of Gru's girls. These moments are few, but incredibly sweet. The conflict in the film stems from a villain with an 80's sense of style that is perfectly voiced by the scene stealing Trey Parker (of South Park fame). Parker's credit's song is not to be missed.Sugary sweet, bright, and immensely silly. The Despicable Me series gets a new dose of life with it's third Gru-centric chapter. While Minions of Despicable Me 2 were merely serviceable continuations of the franchise, 3 feels like the first really worthy follow up to the 2010 hit. It does just well enough to provide entertainment and hold it's own against the various Disney and DreamWorks releases, even if it necessarily as powerful. 7.5/10"
    },
    {
      "rating": "6",
      "text": "Best in the trilogy with some wacky new ideas and fairly funny villain. Animation has improved."
    },
    {
      "rating": "8",
      "text": "Next part of the Despicable Me is the reduction of flights and humor in relation to other productions. All gags and funny scenes are aimed at younger viewers, and in both the English and the dubbed versions there are no ambiguous or popcultural references in which an adult viewer could find fun. It is still ridiculous, but it only causes a slight grin, not a laugh."
    },
    {
      "rating": "6",
      "text": "This movie is not as good as the other two movies. I felt that the story was rushed and a lack of laughs.The villain has an interesting story (maybe?), but nothing beats Vector. In my opinion i think this movie was ok."
    },
    {
      "rating": "3",
      "text": "People always complain about how mean humanity can get; we all know of the pain whenever a terrorist strikes an airport or a movie theater or an elementary school on a regular day. So why let a cast of yellow criminals define our whole pop culture? The people behind Despicable Me 3 are not even secretive about their agenda: one of their recent tweets read, “It feels so good to be bad. #DespicableMe3 #Minions” - @DM_MinionsThe countless obnoxious jokes in this feature well surpass PG-rated acceptability, as the writers continue to victimize women and give men a bad name. The opening logos alone feature two consecutive fart gags. Then Gru, Lucy, and his minions set off to fight their foe on a US Marine ship, only to end with the fat fleshy penguin passing by an office birthday party window in his *ahem* birthday suit. Meanwhile, the Minions land in the middle of a beach where an attractive bikini girl bends down as we look up at her, pressed cleavage framed accordingly. Of course, it sets the Minions into a wild beach party… for some reason.These giggly yellow tic-tacs never grasped my interest, in fact it wasn’t until last month when I watched the Despicable Me movies for the first time. Well, guess what? Now I have a good reason to hate these golden parasites: these disgusting role models make breaking the law look lovable. While co-director Pierre Coffin still puts in the appropriate contagious voice for these deformed egg yolks, the strength of his performance brings no humor into the poorly staged gags. For instance, after Gru loses his job, these one-eyed laxative pills quit. It leads the live pancreases into a long, pointless subplot that stretches from American Idol rip-off (named “Sing” of course), to a hip little prison. After two movies and one spinoff, I refuse to believe that none of these oddly shaped humans think twice about these lemon jelly beans wandering about. In truth, these ugly bananas could have been funnier if they had actual human emotions instead of just meeting the comedy’s demands.Nobody else here, especially the female characters, contributes any value either. The oldest of the three girls, Margo, does continue her boy issues, but her forced attempt to court a Mexican boy just segues into a usual lazy stereotype. The youngest of the girls, Agnes, continues to bring out the franchise’s soul with her adorable search for a unicorn, which in the end does nothing except give the most forced moral that ever forced around the morals. Gru’s wife, Lucy, learns the ways of a good disciplined mother, which like Margo’s subplot, just turns into hateful stereotyping towards an aggressive Mexican woman with facial hair. So no good family morals here!Although, the parents may smile a bit from the nostalgic 1980’s callbacks: expanding bubblegum, musical hits on a cassette tape, Michael Jackson, Jazzercising, toy robots, Rubik’s cubes, a bloated Donald Trump doppelganger, and those flashy MTV colors! It certainly resembles what you remembered from your childhood, but here is the catch: it all comes from the antagonist.Yeah, sorry: the nostalgia only exists to subliminally teach kids to see you as destroying their Generation Y imaginations. The whole climax represents that concept as the bad guy’s giant robot toy terrorizes Hollywood’s major landmarks. It ends with a dance battle between the embodiment of the parents’ childhood and Gru, the embodiment of the present-day childhood. Clearly, the blame on the movies’ destruction lands on the parents’ nostalgia, and Generation Y must rebel against it!Between all the colorless merchandising that we can never escape from as stemmed by this franchise, it’s important to know exactly why we refuse to escape. From my experience, the Minions embody our current outlook on violence:-The yellow color represents positive feelings, the round pill shape suggests balance-The blue overalls represents working without too much responsibility-The gibberish language mixed with other world languages represents the Americanized melting pot-The alternating between having one or two eyes represents how some people are one sided and others can look at both sides-Their nearly identical appearances represents how we each represent them in some way or another.So in conclusion: Despicable Me 3 and its predecessors teach us all, kids and adults, that America sets worldwide humanity in balance through crime. I say different. Today’s kids must learn not to feed their greed, and Illumination Entertainment is not helping."
    },
    {
      "rating": "5",
      "text": "This installment of the movie definitely wasn't as good as the others. This movie shows how Gru finds his brother that he never knew about, but at the end his brother becomes a villain and Gru wants to take him down again. I feel that this movie had no point in adding the brother in from this point of view, however this movie did show friendship and forgiveness and change in a person which is important and the minions are hilarious!"
    },
    {
      "rating": "8",
      "text": "Description GenerateWatch Despicable Me 3 Full Movie - Online Free [ HD ] Streaming http://qn.telemovie.pw/movie/324852/despicable-me-3.htmlDespicable Me 3 () - Steve Carell Illumination Entertainment Movie HDGenre : Adventure, Animation, Comedy, FamilyStars : Steve Carell, Kristen Wiig, Trey Parker, Miranda Cosgrove, Dana Gaier, Nev ScharrelRelease : 2017-06-29Runtime : 96 min.Movie Synopsis :Gru and his wife Lucy must stop former '80s child star Balthazar Bratt from achieving world domination."
    },
    {
      "rating": "10",
      "text": "GOODGOODGOODGOODGOODGOODGOODGOODGOODGOODGOODGOODGOODGOODGOODGOODGOODGOODGOODGOOD"
    },
    {
      "rating": "6",
      "text": "The gang of wacky, lovable villains-turned-heroes is back with a new villain (voiced by Trey Parker) and Gru's new bro Dru. Plot isn't really important…what we're looking for is the zany character comedy that's expected from this franchise. Although the pace never lags and there's plenty of energy, the humor is more conceptual than laff-based. As a result, it's fun without being especially funny. The visuals are still a colorful delight."
    },
    {
      "rating": "5",
      "text": "This film was . . . okay? A good summary of the quality is that while we were watching it by wife and I both end up splitting our attention to do something else. It was sort of amusing. Balthazar Brett was hilarious. The rest of it was . . . bad. There are worse ways to spend an hour and a half, but there are also a lot of ways that time could be better spent."
    },
    {
      "rating": "6",
      "text": "It's a family time!I'm not a fan of this film, except I always loved Minions, particularly their solo film before this one. That prequel was awesome, so much fun. But it's hard to believe, this franchise has already reached three films/parts. Yeah, the Minions helped to find its place among the animation fans, but in this film they were kind of ignored. That's the truth. They had less screenspace which directly affected the film and those who love them.Gru is set to meet his twin brother, Dru, who is dreaming to be like his father, a supervillain. But now changed Gru is not interested to help his brother. Instead, he uses him to accomplish on what he had failed recently. Okayish story, but it had some good fun. It's almost given a hint about the possible plot for the next sequel. I think kids would enjoy it without expecting much. So a one time watchable film.6/10"
    },
    {
      "rating": "5",
      "text": "Painful doesn't even begin to describe the latest installment in the Despicable Me franchise. Not even the amazing voice talent of Trey Parker can save this mess of a film, where Steve Carell brings two levels of annoyance in both characters he portrays."
    },
    {
      "rating": "6",
      "text": "Despicable Me 3: Despicable Me 3 continues the adventures of (now former) supervillain Gru (Steve Carell) who with his wife (Kristen Wiig) and his army of Minions while they fight crime. They are doing battle against former eighties child star and supervillain Balthazar Bratt (Trey Parker) who is trying to steal a giant pink diamond in France.The Good: I like the Minions. I have Minion characters on my checks from Costco and my address return labels. I have a couple of large minion dolls that guard the dryer in the laundry room. I am not a middle-aged woman who drinks too much red wine, however, for me the Minions spark joy. When the minions are on the screen their antics are the funniest thing around (The jail bit in this film is downright inspired and almost saves the whole movie.)Also a special kudos for the cutest “unicorn” I have ever seen on film (Take note The Last Unicorn). In fact, the entire film is cute, colorful and very kid friendly. (The main bad guy's superweapon is expanding bubblegum.)The Bad: Let's start with a quote from the first Despicable Me…[Sees Edith near his iron maiden]Gru: No, no! Stay away from there! It's fragile![the iron maiden closes with Edith inside; a red liquid leaks from underneath; Margo and Agnes gasp]Gru: Well, I suppose the plan will work with two.I missed this Gru in Despicable Me 2 and he is long gone in Despicable Me 3. Gru simply works better as a despicable villain with an occasional soft spot rather than a big softy who only does villain stuff because that is what is on his CV and the mortgage is due.There are also too many subplots in the film. The Minions are spun off for most of the flick, so their scenes cannot do double duty for the rest of the plot. Obvious jokes that the writers initially would have had (The villain is stealing the Pink Panther after all) were clearly cut for time. It leads to a choppy, meanwhile in another movie, vibe.In conclusion: This is the weakest of the Despicable Me films (Yes weaker than even The Minions movie). It also made over one billion dollars. This is not even including the ridiculous monies the merchandising made. Needless to say, we should look forward to many more efforts down the line."
    },
    {
      "rating": "6",
      "text": "I dont know how    many more of    these are necessary.    They are all light entertainment, nothing more and nothing less"
    },
    {
      "rating": "4",
      "text": "Despicable Me 3 or let's just keep making these movies because it's the only guaranteed hit at our studio? But you can already see fatigue setting in. The US has consistently been hating the franchise more and more since 2013. The movie overall was pretty stale. It can't beat the 1st or 2nd movie and it only manages to outpace Minions by a smidge. It's 4 plots are all jumbled and rush. Some moments are endearing and cute but overall the movie just isn't good."
    },
    {
      "rating": "6",
      "text": "Is Gru returning or saying goodbye?After the unthinkingly massive success that DreamWorks Animation got in world of children's cinema seven years ago, Gru and his fellow believers became, at the speed of light, in cult characters and direct representatives of pop culture, attaining, at the expense of their magnetic attraction components for audience, a second installment directed by Pierre Coffin and Chris Renaud and a spin-off. Today, it arrives—using as inspiration the money generated by the three previous ones—a third film with Gru as \"only\" protagonist, cornering a second place to the Minions, alternating their participation in form of escape quite similar to John Sturges's \"The Great Escape\" with Agnes' cravings for meeting a unicorn in the real world, a loving sub-plot between Margo and a village dweller, Lucy's efforts to become a good mother, the ghosts from the past that instigate Gru to leave behind the life of responsible father, the impact that his twin brother causes and the chase of the main villain who radiates 80's style through and through. They said that Hollywood original ideas had no longer a place in an American blockbuster, they are wrong, here there are, but with an oversaturation of stories that conclude condemning the feature film to the ranks of the summer film for lucrative purposes, one brimming with nutty entertainment just like the franchise.The new ingredients of the recipe are introduced with independence, namely, are like mini-episodes attached with roughness in a story where coherence is conspicuous by its absence, but after all, that's the meaning of an animated film, a manumission from the ordinary world for the audience, however, doesn't enable it to insert a jerk of situations as diverse as unrelated. In addition to repletion of ideas that aren't boldness, there's a technical and visual section that doesn't exhibit fresh optimizations, the optical potential of a couple of scenes is hampered by the interception of previously commented sub-plots. Nonetheless, there is room for drama and action sequences, orchestrated with ability, in which they employ a palette of vivacious colors, graphics emulating reality with care and a photography elevating Chris Meledandri's proposal to the next level, at least visually.Regarding the most recent affiliations, antagonist Balthazar Bratt, an eighties star who is turned down publicly and commercially thanks to the arrival of pubescence and Dru, Gru's twin brother, an almost identical clone of the main character, except for a fulgent blonde mane and a snowy trousseau, provide a breath of fresh air to a universe with immeasurable possibilities ranging from peripheral products to worthy characters of their own installment, however, the captured effect isn't bilateral. Bratt's introduction, deploying a James Bond-style espionage plot, in the first two acts is tedious, lifeless and discouraged, it's not until the final apotheosis the extravagances of the former child idol consolidate motivations by which he goes villainy, crushing, allegorically, the emblematic Hollywood sign located at Monte Lee, Los Angeles. Dru doesn't get a completely interesting and innovative treatment, as a standalone character.One more time, we again witness amusing and argumentative expertise containing the Minions as supporting characters. They pass through a strike against their own master, the participation in a singing talent show and the escape of a high-security prison. Without a doubt, they're Squirrel Scraft counterpart in \"Ice Age\" franchise, that was used as a magnetic mechanism, something audience loves, especially the little ones.The atmosphere impregnated by the villain is something unexplored for Dreamworks animations, making use of angles and editions of that time, in order to give cohesion to the past of the villain, nonetheless, visual achievements are not enough, they got with the character; soundtrack, present in most of his appearances, is made up of classics already established as \"Bad\" by Michael Jackson or \"99 Luftballons\" by Nena, beating around the bush with own musical compositions that had to be highlighted in the film.With a story going nowhere because of the torrent of sub plots that the screenwriters embed in the middle of the footage, \"Despicable Me 3\", directed by Pierre Coffin, Kyle Balda and Eric Guillon, will please lovers of animated espionage and adults avid for an evening of cinema without demands, at the expense of the voice performances, the inherently hilarious occurrences of the Minions and incessant references to the 80's culture. For everyone else, the latest foray into children's cinema, the result of the alliance between Illumination and Dreamworks, falls by the wayside thanks to a creative mess that cannot be saved by a graphic section worthy of consideration, something that is not a matter of surprise nowadays."
    },
    {
      "rating": "8",
      "text": "Es una muy buena película que entretiene con personajes simpáticos y animación sorprendente. Disfrute mucho de verla con mi familia y es mejor que Minions y la segunda película sin duda. Recomendable."
    },
    {
      "rating": "8",
      "text": "Solid movie, a lot of people are way too hard on it. It's funny, it's a good kids movie with a good amount of humor hidden humor for adults."
    },
    {
      "rating": "5",
      "text": "Illumination knows how to make inoffensive, child-friendly animated movies, but they don't seem to know how to make a movie with heart. Family was the focus point of the whole movie and yet it was extremely poor and a completely undeveloped theme, not once did a character go through the struggles of a relationship with facing consequences. The story is fine, the voice acting is average at best and the animation is nothing special. An overall average movie."
    },
    {
      "rating": "4",
      "text": "I loved the first two Despicable Mes, but this one just sucked. You  might as well say that Illumination pulled off a \"Shrek the Third\" with this. The story was weak, much of the heart, charm, and wit was gone in favor of uninteresting and unfunny new characters, and the humor just isn't funny anymore. Balthazar, Dru, the Freedonians, and even Agnes (Thanks to her new actress) were mostly obnoxious, and all the subplots make the story look like a mess! If you loved the first two like me, you'll be disappointed with this."
    },
    {
      "rating": "10",
      "text": "This is one of the kind of sequela that did not bored you in the cinema. The plot of Gru's live is growing, the Minions were fantastic and funny as always...I'm already hoping that a fourth movie is in process"
    },
    {
      "rating": "5",
      "text": "Scattershot is the best way to describe this movie. There's far too much going on, none of it really leads to anything worthwhile, the sub-plots are more or less pointless, and the main plot itself becomes superfluous very fast. Really, the only thing this movie has going for it is the animation; Illumination IS becoming an animated powerhouse. However, this movie is incredibly disposable, and a prime example of franchise overstaying it's welcome while doing everything it can to sustain revenue. Let it die, Universal, it's over."
    },
    {
      "rating": "6",
      "text": "I wasn't looking forward to this one, yet before seeing it my hopes went up a tiny bit. I got what I expected from the movie, not a satisfying \"conclusion\" if it is. I don't understand why all these studios love adding in many villains and extra storylines into the final films or the third films of the franchises. It's cute, I guess, but it relies on Steve Carell's funny voice and the little girls being cute. I guess it has nice lessons about family and such, but it is a disappointment. I love the other ones, but not this one."
    },
    {
      "rating": "7",
      "text": "Unfortunately, this shows that the Despicable Me movies just need to stop, I'm not saying this movie is bad it's just fine. The problem is nothing is refreshing anymore, and it just feels old. It is entertaining and the characters are great as ever, but I can't but feel a sense of boredom with this series. We all know there will be a sequel though, based on the ending. C+"
    }
  ]
}