{"id": 756, "title": "Despicable Me 2", "starring": ["Steve Carell", "Kristen Wiig"], "runtime": 98, "genre": ["Animation", "Comedy", "Family"], "description": "Gru is recruited by the Anti-Villain League to help deal with a powerful new super criminal.", "releaseYear": "2013", "mpaaRating": "PG", "imageUrl": "https://image.tmdb.org/t/p/w500/5Fh4NdoEnCjCK9wLjdJ9DJNFl2b.jpg", "categories": {"plot": 6.717391304347826, "acting": 7.05, "ending": 6.8, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 7.111111111111111, "funny": 7.277777777777778, "action": 7.666666666666667}, "reviews": [{"rating": "8", "text": "I feel as if Despicable Me 2 is just not quite as charming or unique as the original. I think what made me like the original was the \"bad guy\" theme; it lacks the originality of its predecessor. I find the new character of Lucy Wilde somewhat annoying, and I was rolling my eyes at Margo falling for Antonio as well as Gru marrying Lucy. I also didn't find myself laughing as much as I did during the first film, the film just isn't that funny. The three girls also had a lot less screen time. The new villain El Macho doesn't make as much of an impact as\"Vector\". However, its still entertaining enough and will satisfy its younger viewers. The minions are still great, at least.\r (P.S, \"Despicable Me 3\" and a spin-off film \"Minions\" are in the works!)\r If you liked this review, please mark this review as helpful and read my other reviews on a wide variety of movies, TV shows, and videogames."}, {"rating": "7", "text": "Minions take center stage against its human counterparts (who are still underdeveloped), and shine in this humorous, yet predictable and light-hearted installment."}, {"rating": "10", "text": "This movie is so funny!!! The funniest are Minions and Shannon at the date!!!!! Can't wait for the next movie!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!"}, {"rating": "7", "text": "While it doesn't remain as good as the first one, this sequel is still a fun ride. With new characters, humor, and the minions, this still continues the fun series."}, {"rating": "6", "text": "Sequels always lose the prequel's momentum. It distances itself from the original movie in a bad way. The characters are great but the plot doesnt bring anything new into the franchise."}, {"rating": "7", "text": "Definitely not as good as the first film, but still a good sequel. Despicable Me 2 still has the first film. The story is well written, the animation looks great, and the characters are mostly good. Also, the humor is still funny, especially from the Minions. However, this film clearly isn't as good as the original because the girls lack relevancy as characters in this film, and Lucy is an annoying character. While not as good as its predecessor, Despicable Me 2 is a good sequel."}, {"rating": "9", "text": "This movie restored my faith in humanity. I didn't believe love was real until I saw Lucy Wilde and Felonious Gru interact. This is a masterpiece, the magnum opus of illumination animated studio. The comedy is outstanding, I went into a coma in 2013 after I had watched this movie as a result of my detonating, bombous laughter erupting my appendix. I awoke from my coma yesterday evening after 8 whole years of fantasising the 156 dates that Lucy Wilde and Felonious Gru went on before their inevitable, breath taking marriage. However - I must refrain from giving this movie a perfect score; As I discovered something from the film I watched last night with my colleagues in the emergency room upon my awakening. Ghostbusters: Answer The Call features a overlapping actress - Kristen Wiig. This is blasphemy against my incandescent Lucy Wilde as she is the voice actress for this exquisite queen. The fact that Kristen Wiig was involved in such a noxious, putrid and rancid hour and fifty-six minute experience is insulting to the law of God. 9/10 I am very disappointed in this sin."}, {"rating": "9", "text": "An Incredibly cute ending along with hilarious, entertaining, and very heart-warming moments and the extra moments with the minions doing silly antics all throughout the film including during the end credits are what make Despicable Me 2 just as good as the original!! While the original is still fantastic and I liked the villain a lot better in the first Despicable Me movie, I still enjoyed Despicable Me 2!!\rIt will be one those movies that I will add to the items that I wish to have on Christmas!!\rI still really liked it and I would actually like to see the film again either in the theatre, on Blu-Ray as rental, or even after I receive this movie on Blu-Ray 3D as a Christmas gift on Christmas or even after I buy this film on Blu-Ray 3D after Christmas for post-Christmas Shopping!!\rI would rate this film a 9.95/10 on a 10-star scale!! On a 5-star scale...I would rate this film a 4.95/5..on a Letter Grade Scale from A+ to an F...I would rate this film an A Grade!!!!"}, {"rating": "8", "text": "I'm glad to see that the critic scores are edging up, it really doesn't deserve any less than a 7 average.\rIn a way they've followed the classic sequel-ruining approach of cramming in more plot threads, more characters, and bigger action, but in this case I actually found it to be the perfect way forward.  The hyperactivity and loony-toons silliness works even better at a faster pace, and they still take time to breath for some surprisingly heartfelt moments in between.  They certain crank up the cheese in these moments, but they spoof tired cliches and tropes so well that even then it manages to be consistently hilarious rather than nauseating.\rIt also benefits greatly from a much better, less annoying villain this time around."}, {"rating": "3", "text": "Like another reviewer, I found the movie a bit flat.  I felt like the screenplay was trying to kill time to compensate for the lack of a plot.  I did chuckle a couple of times, but altogether the film wasn't really enjoyable for the adults, and eminently forgettable.  ...though the kids enjoyed it."}, {"rating": "5", "text": "\"Despicable Me 2\" is funny, but struggles with its plotting and it's missing the \"bad guy\" theme puts the film below its original. While this movie does have its moments of laughs, it's no where near the cleverly built structure of Gru from the first film. At first, the films starts well, with surprising suspense and gives high hopes, but the film does fail later to reveal the purpose of the cool first scene. This leaves many simple questions that weren't answered and leaves the audience confused.  Although the movie's humor does shine through the film, the plotting, does seem, fairly standard. Gru's villainous theme is gone in this movie, and in most cases, hurts the film rather than helps it. Gru, who is now a father and a \"good\" guy, has a different approach to this film, and is not as unique as the first film. While the first film focused on the cleverness of bad guy and good dad qualities, \"Despicable Me 2\" abandons this and focuses on Gru as a good person in life. While the minions are as fun as ever, they take up a large portion of the film from their shenanigans, which is a bit tiresome. The storyline is fairy straightforward and nothing new, with Gru and Lucy's love story isn't put with enough depth. The film focuses sometimes on rather \"stupid\" scenarios that may seem cute, but lags a bit, and unfortunately wastes time on trying to be humorous. Moments like these slow down its pacing, and does affect the film's outcome. The villain in the film starts out strong, but in the end, ruins his potential and could have felt more sinister, but barely does anything. The ending climax isn't much new  the hero wins, and nothing else really. The film doesn't do much to the audience, except laugh, which is okay I guess to several kids today. The film isn't close to the best of the best (I'm very surprised how close it is to Monsters University on Rotten Tomatoes and Metacritic, as I found Monsters University a lot better), but it's a good laugh.., which we sometimes just need."}, {"rating": "10", "text": "One of the only movies better than the first one that isn't that much different. It's very funny and the Minions are the best thing ever. One of the best movies this summer."}, {"rating": "9", "text": "EVEN VILLAINS NEED A LITTLE ROMANCE. Generally speaking, it can be a gamble to follow up on a well-received movie with a sequel  doubly so if that movie is animated. Luckily for Despicable Me 2, that gamble mostly pays off with an enjoyable, if slightly less heartfelt sequel to the 2010 original. Of course, this film's biggest obstacle was finding a basic premise. The whole first movie hinged on the idea that a supervillain named Gru (voiced by Steve Carell) could be redeemed. But now that he's redeemed, what do you do? It's kinda like making a sequel to How the Grinch Stole Christmas; the main character is fundamentally different from the one you started with. In the case of Despicable Me 2, Gru no longer seeks riches or power, only the love and safety of his three adopted daughters, Agnes (Elsie Kate Fisher), Edith (Dana Gaier) and Margo (Miranda Cosgrove). So where do you go from there?  Directors Pierre Coffin and Chris Renaud could have taken the easy route and made Gru bad again. Instead, the filmmakers introduce a love interest, Lucy played by Wiig an  Anti-Villain League agent tasked with recruiting Gru as a spy. Using Gru's past knowledge as a supervillain, the unlikely duo set out to track down an evil mastermind who's stolen a chemical compound that mutates lifeforms into deadly, invincible monsters. Not surprisingly, Wiig and Carell play well off each other  even in animated form  and Wiig's energetic, offbeat character is a welcome addition to the series. Her performance really complements Carell's, and Lucy is a fun, peppy counterbalance to the cantankerous Gru. Gru's daughters, meanwhile, add another layer to the main storyline, as Gru continues to fine-tune his parenting skills  particularly with Margo, who's recently taken an interest in dating boys. But as you might expect, the real stars of this movie are the Minions. Where in the first film Gru's yellow henchmen were mostly played for laughs, here they become integral to the plot and are just about as involved in the story as Gru. Perhaps not surprisingly, it works to the sequel's advantage, both narratively and comedically. In fact, after watching Despicable Me 2, the idea of the Minions getting their own spinoff actually doesn't sound half bad. As for the story, Despicable Me 2 isn't anything groundbreaking, but then again, neither was Despicable Me. That doesn't mean there isn't plenty to enjoy. Given Gru's emotional changes in the last film, the sequel isn't so much a supervillain send-up as it is a spy parody, which gives the franchise a fresh new feel, albeit a not quite as edgy one. Likewise, the journey for Gru here is less about him learning how to be a parent and more about him learning how to interact with women. By its nature, this story isn't going to tug at the heartstrings as much, but it certainly does amp up the comedy. Is Despicable Me 2 a laugh riot? A few scenes are, but more often than not it'll put a smile on your face and garner a steady stream of chuckles. While this movie is undoubtedly made for kids, there are definitely several bits for the older set as well. Story aside, Despicable Me 2 is also beautiful to watch. As with most 'toons these days, the animation is positively gorgeous, and the 3D is top notch. If nothing else, this flick has spectacle appeal, for both audiences young and old. If you enjoyed the first Despicable Me, this sequel offers more fun, shenanigans and a solid followup story to the 2010 original. While Despicable Me 2 isn't the most laugh-out-loud or innovative family film, its stunning animation and amusing hijinks make it worth a watch in between other summer flicks."}, {"rating": "9", "text": "What a fantastic movie. Just saw it in theater and boy was it a blast. It was even better than original (which in my opinion was good). Very funny and had a nice story. Must see."}, {"rating": "5", "text": "While Despicable Me 2 has plenty of laughs some lazy writing. ltos of filler, and a clhice and predictable story prevent this film from being as good as its predecessor. Fans of the original will probably enjoy this film though and be able to overlook these flaws with the story but everyone else will. For everyone else if you were not a fan of the first one you are definitely not going to like this film and I’d stay skip it. I wouldn’t recommend seeing this film unless you are a die hard Despicable Me I would say either skip this film or wait until it comes out on DVD. Go see Monsters University if you want to see an animated film because while it is a kids film and lacks the humor of Despicable Me it is much more engaging and well written than this obvious cash grab, which has convinced me that Illumination Entertainment is only capable of creating animated films to entertain little children, which is not what I want to see because outside of the first Despicable Me this studio has made films that are really meh."}, {"rating": "10", "text": "One thing about movie reviews that may always be a challenge to me especially those whom review movies as a profession, I wonder what they are looking at sometimes. The Critics score was 63 with 39 reviewers 21 Positive and 17 Mixed and 1 Negative. Ideally with an animated movie there is a basic fundamental story being told so your expectation is 1) Be Funny 2) Story should flow and not belabor the point 3) And give us a nice ending. So my puzzlement with reviews is what are we watching, Despicable Me 2 raised the bar with fun, excitement and sheer enjoyment. I laughed from beginning to end, the story flowed very well and the ending was amazing. With an animation thats all you need in some cases there are failed attempts with freshness, but this movie is fresh and I'd watch it again and again as I have done many other favorites. Yes reviews are someones opinion and point of view, but sometimes it just doesn't need to be so difficult."}, {"rating": "8", "text": "I took my family to see it and we all loved it; even my three year old sat still through the entire thing. The minions are hilarious and Gru is a more likable character this time around. definitely recommend this one to any fan of animation."}, {"rating": "10", "text": "Another amazing flick, not as good as the first but just as funny! Especially the minions, I love them! Anyone who loves animated movies needs to see this now! Although I felt the final battle was a little lackluster, the sweet ending almost brought tears to my eyes, it was so cute! Watch it now!"}, {"rating": "7", "text": "I loved the minions! There were plenty of moments where they had the whole theater laughing. A lot of people seem to be upset that Gru no longer acted as a villain, but it was still enjoyable. I like the two films equally. If you had fun watching the first one, there's no reason to think you won't like this one. Not a favorite of mine, as far as animated films go, but it was worth the price of admission, as they say."}, {"rating": "5", "text": "Yes, it was made for children, but it the main things I loved from the original: Character development, creativity and the charm of Gru being evil. It just wasn't quite as good as the first one, and they went overboard with the minions, I feel."}, {"rating": "9", "text": "I really liked the first movie, but this one was just hilarious! It's an animation movie so I really don't care about the story, which are maybe the weakness point. But the character...in my opition, Grue is not the main character. The funniest part of this movie is his yellow army. All of them make me laught so hard every time I saw them and the end...the two last song make me laught so hard!\rIf you want to spend some funny time alone, with friends or with you children, don't hesitate!"}, {"rating": "10", "text": "GOODGOODGOODGOODGOODGOODGOODGOODGOODGOODGOODGOODGOODGOODGOODGOODGOODGOODGOODGOOD"}, {"rating": "10", "text": "The best family comedy this year. Despicable Me is the best great animated movie series. It was a superhero adventure packed with action and lots of laughs. Kids and adults will be talking about this movie for months."}, {"rating": "4", "text": "This movie was flat. The story was very boring and banal. Throughout the film I felt little to no feelings for any character. I see that many people thought the jokes were funny, but I found them to be insisting upon themselves. As if they were funny simply because they were meant to be. The original pieces of the soundtrack were very stock sounding, and those few non-original songs were quite honestly bad. It didn't even sound like the voice actors were doing anything but reading directly from the script. For me, the biggest problem with this film was that the entire production felt too bland; when I was watching this I felt as if the writers and director had played a games of visual mad-libs from a passage that has been used far too many times.\rOn the positive side the animation is good. That's about it."}, {"rating": "5", "text": "Despicable Me 2 is nearly despicable with its silly and downright annoying characters. It is full of lame jokes that will make kids laugh but not adults. It barely has and ounce of anything to take seriously."}, {"rating": "1", "text": "Didn't really like this movie coming away from it. This was a big surprise  I like the first one and I heard great things about the sequel. As time passes, I've liked it less and less until, frankly, I actively hate it now. Final analysis as to what turned me off: it's such a chick flick. It is a romantic comedy with minions. If you are into that genre, as most women are, you'll probably love Despicable Me 2. If you are an adult male, this one is poison you have to suffer through. Luckily the minions launch attacks against the estrogen assault periodically trying to break the monotony (and they do wind up stealing the pic). That is your only consolation.\r The main plot and the majority of the subplots are anchored upon various femme fantasies. All characterization of each main character is rooted upon either their romantic or mother relationships, except for the villain. The villain is actually worse than a cardboard cutout villain. He's fat, hairy, underdeveloped, and notably unsexy and unsympathetic in any way. That last point is a huge surprise given the background of Gru and the whole premise of the first movie (sympathetic villainy). Boys are slammed as dangerous and irredeemable hearbreakers or worse,  and sure enough the one boy character is last seen smugly breaking the heart of one of Gru's daughters.\r The highlight of the film revolves around the shenanigans involving an awkward date in which the \"true love\" female saves the bungling male from a  And of course, the villain is dispatched via what else but a lipstick weapon in an anti-climatic final confrontation that doesn't match the energy of the date scene. The ending is, what else, a giant wedding concluding when the girls declare they finally have a mother they can love.\r Yuk, yuk, yuk. Guys, beware."}, {"rating": "8", "text": "I actually enjoyed this sequel more than the original.  There are more laughs, because the minions are featured more.  I guess you either enjoy the low brow humor of the minions or you don't.  I think they are hilarious.  The 3D is better than average, and at the end of the film while the credits are rolling they feature clips with the minions where the 3D really shines.  The animation is really excellent looking throughout.  It isn't quite up there with the best of Pixar, or even \"How To Train Your Dragon\", or \"Kung Fu Panda\", but it's close."}, {"rating": "8", "text": "This movie is especially for kids, now in my case the first part was the best (Despicable Me).\rSometimes i feel pretty boring because bad jokes but wt hell, my wife enjoy like a little girl..."}, {"rating": "7", "text": "Despicable Me 2 is enjoyable, but does not reach the level of enjoyment that its predecessor. This movie is about Gru (voiced by Steve Carell) is now a proud father of 3, and has given up evil for a less exciting life. Suddenly, he is recruited by the Anti Villain League and one of their agents, Lucy Wilde (voiced by Kristen Wiig) to catch someone who has been stealing a dangerous chemical. The plot is not as rich as the original, but still fun for all. This is a must see for kids, especially those who saw the first Despicable Me movie. The minions are much more prevalent in this movie."}, {"rating": "10", "text": "After watching a no-fun movie like  man of steel, here comes the funniest movie of 2013! Funnier than Monsters university! This is not like the first one, but this is a perfect sequel. Minions are the x-factor of this movie! They always steal the show! But minions are more funnier, more cuter and more crazier than in the first movie! The latest addition of Lucy Wilde is awesome. Her character is a very effective one!  She is the best human character in this movie! This is the most-wanted animation flick of 2013! A must-watch movie for anyone! More minions this time makes the sequel much better!"}, {"rating": "5", "text": "It's disappointment, inferior to first in every single way! Plot are boring and too simple, jokes are for kids only, so if someone gives it a high rating  he's probably 10 year old. Animation is great, but that's not enough"}, {"rating": "8", "text": "If you liked the first one you'll love this one too. Though it is not as touching it still sparks a good message and leaves you pleased and entertained. Fun for the whole family."}, {"rating": "0", "text": "Espero que esto acabe pronto una buena animacio rinde credito aPixar escogidas de Disney  y bueno lo demas aveces sobresale sin embargo el peor erro de esta empresa fue poner esta pelicula."}, {"rating": "8", "text": "As VFX and standards rise up, there is no doubt quality in movies needs to also. Despicable Me 2 reaches them, and slightly more. I would say that it was about as good as the first one, and the background to the movie was gorgeous. Even though the humor becomes a little bit crazy, it fits well with a movie like this."}, {"rating": "7", "text": "Fun. Especially if you see it with a theater full of kids. Plenty to keep the adults entertained as well. Lots of laugh out loud moments. The minions make the movie as you'd expect."}, {"rating": "6", "text": "Like so many sequels, this one lacks the inventiveness of the original. Gru, the villain, is now a good guy and he's recruited to help stop an old evil rival. Of course, the popularity of the minions assured that they're even more prevalent. They're still cute, but the off-kilter gags are less off. The visual style is still quirky, but the humor is more mainstream and less funny. While it's certainly energetic and the soundtrack is slamming, it's simply not as much fun this time around. NOTE: Just like the last one, the best 3D is during the credits."}, {"rating": "8", "text": "The story is quite predictable, but remember that you are watching Despicable Me 2 for the humor, not the story. If you go in with that mindset, you'll not be disappointed. Trust me, you'll laugh, regardless of how old you are (I'm 19)."}, {"rating": "6", "text": "Were you disappointed Gru didn't get a chance to use his dance moves to woo a lady friend in the first Despicable Me? Well worry not, Despicable Me 2 is here to entertain and slightly annoy with its overly saccharine message of family. Despicable Me 2 tells the story of how Gru gets roped into stopping an elusive villain by ditsy anti-villain agent Lucy Wilde (Kristin Wig). Along the way Gru must contend with his new role as a single father and how to move past his old life as a villain. The main problem with Despicable Me 2 is that it doesn't capitalize on its emotions, it doesn't make you feel as warm as the first one did, in fact it only really makes you wish you were watching it. The film is impressive for its visuals, in fact the film ups the spectacle quota quite a bit and the budget seems bigger meaning the action feels more impressive but it lacks that personal touch. The kids are just as entertaining, Agnes with her youth, Edith with her oddly fun obsession with violence and Margo with her faux grown up sensibility. They are just as good but the scripting in the first was tighter giving each of the children moments. In this Edith is a cameo, she rarely appears and has very few lines or things to do. In fact this film doesn't really emphasize family so much as scream it at you making for a fairly manipulative film and without one of the children in the actual film it feels like whatever message they are trying to delivers seems a tad moot considering the lack of a cohesive family for almost the entire run time."}, {"rating": "8", "text": "A movie I really enjoyed. It was funny and charming. I think it started off a little slow but the story turned out to be very solid. In my opinion it wasn't as funny as the first one since Gru is sort of a good guy but it still hit most of the right notes. If you liked the first one you'll probably enjoy this just as well. Definitely recommend."}, {"rating": "10", "text": "Excellent! Even better than the first. Really reminded me of the old Chuck Jones cartoons. Just the right amount of hilarity and romance. And you must love Agnes. Highly recommended for all ages."}, {"rating": "8", "text": "I read some reviews saying that this film is about minions funny and just that. But today I watched with my son and he laughed too. I only say two things, nothing very good, but nothing too bad either. A good movie, that's all."}, {"rating": "8", "text": "A charming and cute follow up to the surprise-hit original that released in 2010. While perhaps not as a fantastic as the original, Despicable Me 2 manages to entertain all the way through."}, {"rating": "0", "text": "Although this is a film intended for children, who aren't exactly the best at judging whether or not a film is good, I still believe that they should be held against the same scale as other films. with that out of the way, I will now say, this film was, in a word, awful. the plot was boring and bland, the protagonist, Gru, is now boring and flat, and the minions are only there to provide cliched comic relief. there are better ways to spend your money than on this film."}, {"rating": "8", "text": "Not as good as the first movie, but the minions are hilarious and it's a great movie for anyone who wants a good laugh. I'm giving it an 8 because it didn't quite meet my expectations but was still worth the money."}, {"rating": "8", "text": "You would think that a sequel wouldn't quite live up to the expectations of the first, but surprisingly it does. I really liked this in the fact that it's still as memorable as the first one. Personally I loved the first one better than this one, but you have to give this one credit. It's still that kid-friendly, slapstick funny entertainment that we all still know and love. I love how the character Gru has to deal with having to help save the world and still raise his girls. And I love how this movie tries to add more conflict in the story. I especially loved El Macho. I thought he was a really cool villain. He may have been a little to scary for kids, but he's one cool villain. The love story between Gru and Lucy felt off at some points, but in the end, it works out. Overall, it's a great sequel."}, {"rating": "8", "text": "Some critics and viewers tend to give sequels bad reviews because of the lack of originality.    However, historically with animation, where would we be without building on past successes?    The venerated and greatest cartoon family of all, the Warner Brothers \"Looney Tunes\" period from the mid-1930's to approximately 1980 or so relied on many of the same ideas over and over again, but we still love Bugs Bunny and company with all our hearts.\rThe Star Wars and Star Trek series continue on, and there's no reason the Despicable Me movies couldn't become serial, either.    First we have great characters in place, Gru, the girls, especially Agnes, of whom it would take a very vile person to dislike, and the hilarious minions.    The animators are top notch with better backgrounds and detail than just about any competitor.    The story line isn't exactly \"Gone With The Wind\", but why should it be?\rThe minions get more screen time this time around and recall the comic genius of their Looney Tunes ancestors.    They are funny and a gold mine for plenty of laughs.\r\"Despicable Me 2\" lacks the evil edge of the original but makes up for it with plenty of eye candy that you probably won't catch the first time you see it.\rAs far as animated films go, this one like the first one is as enjoyable for the adults as it is the kids.    Don't let sequel fears make you miss this one."}, {"rating": "9", "text": "The Minions are BACK!!  and Better than EVER!  I took the kids on July 4th to see Despicable Me 2 and it was a great movie!\r For me, the main story regarding GRU took a backseat to whatever the minions were doing.  Which isn't to say that the story was bad.  The story was a very good comedic tale of a once bad guy becoming a good guy and in the last story the girls got a daddy and this one they get a mommy.  Kristen Wiig is amazing as the female love interest and agent for good.  The main bad guy in the movie was El Macho, who using a secret syrum, manages to build an invincible super minion.  Several million super minions, who are purple with crazy hair and indestructible.  I must admit that I found the purple minions as cute as the regular ones.\r In the end, Despicable Me 2 was a great sequel with all the same flair and comedic moments as the original.  It may not be original, as it builds a lot on the story of the first but it is a great adventure and worthy of watching for those that loved the original.\r I highly recommend for those that enjoyed the first and just want a good laugh.  I found this movie not as good as the Croods but better than Monsters University."}, {"rating": "8", "text": "awesome movie a perfect job for making people laugh i love it good job by universal it is an awesome movie for a family there are very funny moments in the whole movie"}, {"rating": "8", "text": "While it undoubtedly entertains and charms, I just think if the movie is called 'Despicable Me 2', then you should the main character (Gru) despicable."}, {"rating": "3", "text": "qqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqq qqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqq qqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqq qqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqq"}], "recommendations": ["hotel_transylvania_2", "minions", "peter_rabbit", "megamind", "shazam", "incredibles_2", "the_lego_movie_2_the_second_part", "puss_in_boots_the_last_wish", "penguins_of_madagascar", "goosebumps", "storks", "the_lego_movie", "hotel_transylvania", "spies_in_disguise", "turbo", "hotel_transylvania_3_summer_vacation", "ice_age_the_meltdown", "despicable_me", "night_at_the_museum_battle_of_the_smithsonian", "zombieland_double_tap", "shazam_fury_of_the_gods", "the_croods", "meet_the_robinsons", "my_little_pony_the_movie", "minions_the_rise_of_gru"]}