{
  "id": 4107,
  "title": "Detroit",
  "starring": [
    "John Boyega",
    "Will Poulter"
  ],
  "runtime": 143,
  "genre": [
    "Crime",
    "Drama",
    "Thriller",
    "History"
  ],
  "description": "A police raid in Detroit in 1967 results in one of the largest citizens' uprisings in the history of the United States.",
  "releaseYear": "2017",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/tmCt2hy9QoFHft3UcHwpGX2Sihl.jpg",
  "categories": {
    "plot": 6.934782608695652,
    "acting": 6.9523809523809526,
    "ending": 7.714285714285714,
    "soundtrack": 8.4,
    "cinematography": 7.142857142857143,
    "familyFriendly": 3.0,
    "funny": 5.0,
    "action": 7.888888888888889
  },
  "reviews": [
    {
      "rating": "4",
      "text": "Director Kathryn Bigelow and writer Mark Boal’s ‘Detroit’ is a gruelling watch, not just for the fact it’s based on shockingly violent, and tragic events in modern USA history but because the screenplay interferes with certain facts for the sake of ‘entertainment’. While it may be the screenwriter's task to ‘dress-up’ the content of a movie it’s not their task to pad it out with violent falsehoods till it begins to lose sight of its fact-based situation. Many scenes tend to play out as unnecessary, and often they are.  The main storyline focuses on the deadly 1967 race riots that already feature enough tension and brutality to sustain viewer concern. It’s uncertain what moviemakers feel they can add to these terrible events decades later - within an artificial re-enactment (maybe a quality documentary would have been a better medium?) But, it’s doubtful any good might come from this re-hashing of yesterday’s hatreds – especially given the present climate of extreme ‘identity politics’ causing division between all races - this in itself, comes across as exploitative ‘activism’ - pushing suspect negative agendas.  Sometimes, revisiting certain ugly historical events can offer a moral compass - even giving us warnings signs if they are thoughtfully analysed (as with ‘The Free State Of Jones’ in ‘16) – While others, simply fuel more contempt and distrust - feeding increased hatred.  Some may ‘like’ this movie but looking at the financial returns, its possible many prospective patrons may have had the wisdom to see this offering as perhaps, unfortunately, one of the latter variety."
    },
    {
      "rating": "4",
      "text": "The Hurt Locker, Zero Dark Thirty. Two terrific movies stamped on the poster of a mediocre thrown together film about the Detroit riots. Or is it about the riots? It’s a little hard to tell. Detroit takes you in so many directions it throws all these characters and their subplots at you. Oh and don’t forget to mix in some real footage of the riots so the audience doesn’t forget what they’re supposed to be watching. You have John Boyega’s character and all his problems, Will Poulter the racist cop and his issues but let’s not forget Algee Smith aka Larry the soul singer who will break into song at every single opportunity.It’s hard to believe this film was made by the same person it changes tone so often. The story has no idea what it wants to focus on and you’re left with a mess. Once all the characters introductions are out of the way and a few clips of news footage the story decides to bring us in a slightly different direction eventually leading to the events that took place in the Algiers Motel. This section is my problem, for an hour you’re subjected to this horrendous interaction that I can only describe as comical torture porn reminiscent of “Funny Games”. Believe me that’s the last thing I expected from Detroit. The script is hilariously terrible I never once believed the idiotic things these characters were saying to each other, nothing ever felt natural. The dialogue, Will Poulter’s over the top I’m gonna totally kill every last one of you and I’m gonna smile while I do it performance. This segment feels completely out of place, a separate movie within another movie. A bad horror movie.But wait there’s more. After the seemingly endless endurance test you also have to sit through the aftermath of the motel incident in the most rushed together court room scene I have ever watched. Honestly at this point the movie had well and truly lost me so I just didn’t care anymore. Detroit wanted me to be on the edge of my seat instead I was slouched down fighting off sleep because oh yes we’re about to sit through another song by Larry. Yeah that’s what the movie needs more singing. I didn’t expect to love this but I also didn’t expect to hate it quite as much as I did. So just in case you couldn’t tell I didn’t like Detroit one bit. Not recommended."
    },
    {
      "rating": "4",
      "text": "It was alright, And liked some of the director's (K.B.) other movies.  I live in Detroit, and i was just a boy during the riots, i remember it much differently than portrayed.  I understand that its just my personal experience thats skewing my view of the events in the film. Its an okay movie, and worth the ticket price, but living it, i just feel they couldn't do it the proper justice, but they tried, so A for Effort?"
    },
    {
      "rating": "4",
      "text": "I'm sorry, but I did not find this to be a very good film at all! This was quite a misfire from the usually exceptional Kathryn Bigelow in my opinion. The film always felt too preachy about its real-life historical events and overall theme, the opening animated sequence used to briefly describe the racial situation and tensions in Detroit felt bizarre and completely out-of-place, the characters are all unlikable, which I know they're supposed to be. However, I found myself rooting for neither the police nor the victims, as each of them all made stupid decisions throughout the film that made it hard for me to care about anyone or what would happen next. Lastly, the way things do end up turning out was not only predictable, as history has a way of repeating itself and which color or side it favors *hint hint*, but also had me leaving the theater with a very unpleasant taste in my mouth. Overall, this was really just an all-around unlikable film with an important historical story that I guess more or less had to be told, but its preachiness and the way the characters and events were played out made it near-impossible for me to like or accept it."
    },
    {
      "rating": "3",
      "text": "Awful. Director elected to focus on the (alleged) events at the Algiers Motel and its a mistake. No background for the characters are provided . Looters loot and cops commit excessive violence. Tell us something we don't already know."
    },
    {
      "rating": "7",
      "text": "This movie seemed to lack a reason for being. I felt like I was watching several movies stitched together and a good hour of that seemed to be torture porn that went on far longer than necessary. There are great performances here and one major character arc that makes it somewhat compelling but for all its violence and handheld camerawork (can the shaky cam die already?) it was surprisingly dull. There is something I really admired about the concept here: the decision to attempt to tell the story of the riots and by extension the story of Detroit and police on black violence, through this one seemingly atypical event, has merit. You've got the white cops with their own personal rage, fear and sadism and the black community cowering in fear, making many self-desctructive decisions out of spite. At first I thought it was too broad to name the film Detroit but after thinking on it it feels right."
    },
    {
      "rating": "9",
      "text": "I noticed that whenever a serious movie about a historical event concerning Black Americans premier, a number of people, who haven't even seen the movie, rate the movie lowly to bring down the overall score of the film.  I see this all the time, all over the internet.  I guess it is difficult for some people to accept that race relations is one of the things that America has done horribly.  Those people would prefer that the racial chapter of America's shameful and embarrassing history be ignored. Well, it can't be ignored, because race relation is always simmering, festering, smoldering.  \"Detroit\" is a very good movie that takes us inside the hearts and souls of its inhabitants.  It won't be easy for many white people to watch.  It won't be easy for many black people to watch, either, but for different reasons.  However, it IS worth watching.  Be warned, you should prepare yourself, beforehand, for the experience."
    },
    {
      "rating": "10",
      "text": "One of the ugliest periods of recent American history involved the civil rights movement, efforts to squash it by incredibly mean and profoundly racist and stupid politicians and police departments and rioting that destroyed several neighborhoods in large American cities - Watts, an L.A. suburb, Philadelphia, and in Detroit, where this movie details the horrific rioting and downright psychotic actions of its city police force, particularly one sadistic cop and a few co-horts, who advance on a motel, the Algiers after reports of sniper fire, a claim never proven, although the movie suggests it was a stupid move by a black man playing with a starter pistol, firing out the motel window with city, state cops and National Guardsmen milling about in the street below.    Three young black men would die during an incredibly horrific \"questioning\" by a deranged white patrolman (Will Poulter) who has already murdered one black person as he sees that victim supposedly looting a grocery store and shooting him in the back, and a couple weak kneed but equally repulsive \"partners\", who systematically terrorize the people they flush out of the motel rooms, with no proof of anybody's wrongdoing.    The abuse and aggravated assault, along with the murders, was a horrible moment in an already scarred and frightened country.    As \"Detroit\" points out, for those who choose to remember 1967 as the \"Summer of Love\", hippie music and discovering the joys of recreational drugs, the nation was embroiled in Vietnam, drafting blacks and poor young men at a very slanted ratio, and the continued efforts of rednecks and other hatemongering morons to deny equality to blacks, and even white people who dared to side with them.    The senselessness of the rioting (destroying what little blacks had by angry mobs) and the murders is especially poignant and done superbly.    Director Kathryn Bigelow makes the viewer almost feel like they are on the streets in the middle of the chaos, and the acting is great all the way around.    Nothing rings home like accurate history, and \"Detroit\" does all it can to be as authentic and true to events as is possible.    It brings out anger at the cops who behaved so terribly, understanding for the victims, none of which had done anything even remotely illegal, and even embarrassment at how \"civilized\" people can be such monsters.    Sad to say, parts of American society still harbor the same idiotic racism against one another, with well meaning people of all races usually ending up the victims.    Racism is universal, is present in every culture, nationality and levels of society.    \"Detroit\" treads carefully, rightly putting the blame where it belongs.    The actions of few mar the efforts of those such as myself who are sickened by this behavior to try to reach across and be true equals.    Racism fuels paranoia, innocent people get caught in the middle, and nobody wins.    This movie does a lot to demonstrate what NOT to do if you're in law enforcement, and does show us how to be dignified as possible under insane conditions, as the victims tried to be, and points out that at least some of the white officers and guardsmen were as appalled and revolted as the black community.    This movie will be one of the year's best, and gets my vote right now as the best I've seen."
    },
    {
      "rating": "8",
      "text": "A cinematically important, hard-hitting indictment of a system gone terribly wrong and in need of fixing, even 50 years after the historical incidents portrayed here. It's the kind of film that will make some viewers uneasily squirm in their seats but that will (and should) make most of us righteously outraged. Its often-relentless intensity, combined with its painfully heartfelt personal stories, make for a gripping piece of storytelling, particularly when it comes to a little-known and much-forgotten tragedy that today's society should know about. Director Kathryn Bigelow's and screenwriter Mark Boal's penchant for authenticity and thoroughness is highly commendable (if a bit overplayed at times), but better to be accurate and truthful than to gloss over something that needs to be told in all its ugly candor."
    },
    {
      "rating": "10",
      "text": "Wow, what a movie! Incredible historical recount of the events surrounding the 1960s riots in Detriot, and the despicable racism and criminality displayed by white Detroit police officers. It's a sad movie, but a story that needs to be told."
    },
    {
      "rating": "8",
      "text": "Detroit was pulse pounding and a very good movie, Kathryn Bigelow made a good...film. Mostly and alright film if you take this criticism. TO ME...and just me as a simple human being though this movie was good but also long and a bit of a bait movie(really should call this movie Algiers) In summary I guess, is a long Law and Order episode."
    },
    {
      "rating": "7",
      "text": "Bigelow is an excellent director and this is an important story but it lacks balance. The Algiers Motel story is important but should not dominate the film as much as it does. There should be more about what led to the riots and about the riots themselves, all aspects of them -- what the rioters did and what the police and national guard and authorities did. It is a large story and there were other riots in other cities with similar situations. By focusing so much on one incident, the whole picture is not elucidated. The Algiers Motel is more than the story of a few very bad cops but it is not the story of the Detroit Riots or the story of race in America. It is only a part of those stories. We need to solve our problems of race and to deal with all aspects of the problems."
    },
    {
      "rating": "10",
      "text": "A very deep and moving film about the Detroit riots.  Definitely an eye-opener regarding race relations in the city even to present day, and some background about why many in the city don't trust the police force.  Powerful and well worth two and a half hours."
    },
    {
      "rating": "10",
      "text": "I would be perplexed by the barrage of negative ratings, but I noticed only one of them was accompanied by a review. I think this is quite telling, and as other people have pointed out I think it is due to people's inability to come to grips with our nation's past. From my understanding, writer Mark Boal (who worked as a journalist after receiving a philosophy degree from Oberlin College) crafted a well-researched and historically accurate screenplay. Reading articles about the events as they actually happened is like reading the plot summary for the film, something that should be deeply appreciated. I chalk many of the negative reviews up to spiteful people who haven't seen the movie, or took offense to the uncovering of this ugly chapter in our nation's history that shows what white supremacy looks like front and center. As for the movie a as a movie itself, I admit it barely gets a 10 rating, but after a few days of digesting it I do think it earns legitimately earns it. It has its flaws, but they are minor and do not affect the takeaway of the film. The film is broken up into three parts: the riots, the Algiers Motel incident, and the aftermath. It starts off a bit slow, and some of the scenes involving the riots seem jolted and thrown together without rhyme or reason. However, their true purpose is to give context to the motel incident. The scene in the motel (which is hardly a scene as it lasts for over an hour) is nothing short of spectacular. It is extremely tense due to the blend of predictability and unpredictability - we understand the *societal* context of what we are seeing, but we don't know how the *individuals* will act in this situation. The acting is phenomenal, and it is so realistic - again, props to Mark Boal for doing his homework. The aftermath adds minutes to the movie that some may find dragging, but I think they are essential to highlight how the problem is not just a few bad eggs. It shows how the riots that occur at the beginning of the film were not just a random occurrence, but rather a result of hundreds of years of slavery, mistreatment, housing discrimination, racism, and systemic oppression. We see a justice system that fails to do what it is intended to do, and we see that it actively furthers injustice. Others have noted that none of the characters are particularly likable, something I disagree with. There are multiple characters who are wholly good people, who are morally sound, resolute, and even charismatic. It is clear who Bigelow is rooting for, and so to you reader I say that who you are rooting for will highlight a fundamental aspect of your personality. Because, ultimately, there are things that the 7 black men and 2 white women could have done to possibly prevent being held hostage in the motel, eventually leading to the deaths of 3 innocent black men. But there is nothing that the millions of Africans could have done regarding being brought over here by slaves. From then on, there have been things that could be done by blacks to better their situation - but there are far, far more things that the oppressive whites could have done. It is extremely difficult to fight back after hundreds of years of slavery, followed by deprivation of rights, having a justice system that works to imprison you, having a society that rejects you, etc. It is extremely easy to just not oppress people. It is so easy to just treat people in an equitable fashion. So while those 9 people could have acted differently, they shouldn't have had to. The police should have, and could have, and didn't. It would have been very easy for the Detroit police to not kill 3 people that night. I can only hope you, too, see that."
    },
    {
      "rating": "9",
      "text": "The race riots in 1967 Detroit caused looting, burning and desperate circumstances for all involved.  The primary event depicted in this film occurs when several police raid a hotel in search of a sniper. They resort to brutal tactics in an attempt to obtain information. Director Kathryn Bigelow has masterfully created unrest and mayhem in the first hour of the film, while effectively setting up the backgrounds of the primary characters. As conflicts ramp up during the core episode, uncomfortable tension pervades. It's an intense and cruel experience. The third act lays out the aftermath. Throughout it all, a level of anxiety is undeniable. This is partly due to Bigelow's intense direction, but also thanks to a cast of superb performances (John Boyega is especially compelling). Of course, the parallels to today's racial discord are not lost and they make an already disturbing film that much more powerful."
    },
    {
      "rating": "8",
      "text": "Ricardo G. Williams, author of “Unchained Mind”, writes a blog at blogster and this particular post stayed in my mind for a long time and as I watched “Detroit” it came back to me and the comments made by a group of people: BrotherDocs, MsPurrrrfect, AmalaTSering, AkunaKumara, Jayyyohhh, Concervative and a couple of others who, obviously, have no idea what Black men go through in everyday life in our cities and THEY ARE THE ONES WHO SHOULD SEE THIS STORY! Plus those who think they have any idea of Black life in the USA!To read the post and the comments go here:http://www.blogster.com/thewritertwo/should-i-be-traumatized-by-the-police-or-am-i-paranoid “Detroit” is a very violent movie and should be seen more by white people than black people. As a gay activist I’ve been involved with some police actions such as tear gas, being hit by police batons, being thrown in ‘wagons’ and taken to jail but what this film shows is the sheer brutality of police let loose.I was not really aware of this Detroit story as I was moving my life to Memphis, Tennessee, in 1967, where Martin Luther King had been recently assassinated and I was told when I had to drive to Mississippi “We you have 3 strikes against you: being a Yankee, being a Jew, Being Gay—at least you aren’t a N-----!”This is a rough movie on the audience and I have no idea how a Black person could sit through it but every White person should before they ever blame any Black person for doing what they have to do to survive. The story, based mostly on facts, written by Mark Boal and directed by Kathryn Bigelow, brings you into the world as it was played out that July 23rd. It is physically powerful, provoking, grim and no ‘happily after’.Three white policemen are put on trial for what happened, with an all white jury so the outcome is a given. Facts show that the policemen were the bad guys and at the end the credits tell what happened to them plus Larry Reed, played by Algee Smith, who was about to hit the big time with a group of his friends and called The Dramatics. Their appearance is cut short by a riot taking place outside and moves to the Algiers Hotel, a seedy place catering to drugs, hookers and other mayhem. While there is violence going on outside the film concentrates on seven Black men and two young white girls who came from Ohio, though it is not quite clear how or why they became to be where they were.Scene after scene is a powder keg, sometimes exploding, always part of the riot that is going on further away. Interspersed are real video clips from those days.Will Poulter, as the cop in charge is despicable from his first appearance while it takes some time for his two partners Ben O’Toole and Jack Reynor to join him in his vicious ‘games’.  John Boyega as a well meaning Black security guard, Algee Smith, Jacob Latimore, Jason Mitchell, Anthony Mackie as a completely disrespected Vietnam war vet are exceptional while Kaitlyn Dever and Hannah Murray as the two girls from Ohio are believable and make it hard to believe one of them would go on to have 4 children and be a hairdresser in real life.“Detroit” is a too long film that could have easily been cut by 20 minutes and the violence can at times be almost sickening especially when showing the interrogation sequences but Kathryn Bigelow, Mark Boal and, director of photographer, Barry Ackroyd bring you into the scenes of outrageous enforcement methods and catches you emotionally.“Detroit” is a film that white people who think they know, or even don’t know, black people, should be filling the auditoriums of theatres."
    },
    {
      "rating": "8",
      "text": "One for 2017's best films. Don't listen to the alt-right crying about \"white guilt\" or the SJWs saying a white woman has no right to tell this story. If this was about 15 minutes shorter it would've really be something special, but as it stands it is a powerfully acted adult drama."
    },
    {
      "rating": "8",
      "text": "This film could be broken into three parts: 1) The prologue, showing a good visual description of how the Detroit riots began, and introducing us to two of the main characters, a singer with the Dramatics and a security guard; 2) The Algiers Motel incident; 3) The trial of the police officers.  As a person who was growing up as a resident of Detroit in 1967, I felt that the depiction of the beginnings of the riot was very convincing, and I thought the use of documentary footage was effective.  However, I thought that the introductory montage of murals should have been deleted.The scenes in the Algiers Motel were harrowing, and this section did seem long (but partly because it was so hard to watch).  Yes, one might ask several questions - why didn't the supervisor immediately remove the mean cop (probably because there was a riot going on, and he felt he needed all the officers on duty).  It's easy to say - why didn't the residents mention that the man who had been killed had just shot off a toy pistol?  (Would it have made any difference?)Unfortunately, this movie still seems to bring up issues that are still relevant today.  State police/National Guard knew that the bad cop was going overboard, yet nobody stopped him.  The consequences seem to be similar to those for various current incidents.One other point - the depiction of Motown music and artists was spot on."
    },
    {
      "rating": "8",
      "text": "Of course, the \"all lives matter\" racists are trying to undermine the score of what most people really think about the film. Get a life, Trumpkins. Focus your annoyance elsewhere."
    },
    {
      "rating": "8",
      "text": "Detroit may be nothing similar to her previous titles such as The Hurt Locker or Zero Dark Thirty in terms of best-of-them-all of the year, but after all she may be on to us again with another of her finest movies for the year. I do appreciate her hard work on this film even if it isn't near her high-acclaimed titles such as — you guessed it — The Hurt Locker and Zero Dark Thirty. Seriously, you expect these finest works to be directed by a male, but you are actually fooled if you think so since it's pretty rare to see a female doing such things like these."
    },
    {
      "rating": "8",
      "text": "Before my screening of Detroit played, the trailers shown beforehand featured these dumb action movies with bad CGI, you know, the ones expected to score box office success. Boy did it feel refreshing to see what I went to the theater for: a thriller based on a thought-provoking true story about how little has changed since the incident at the Algiers Motel.First, a stylized prologue educates us on the public 1967 mindset by painting out the prior 100 years of racial history. The colorful film reel fit for an elementary classroom then time-warps us into the riots stirred up by Civil Rights, no sugarcoating included. The Black community embraced unlicensed after-hours club for the initiators of violence. The White police officers reacted to the rebellion by scaring them with death games. In any other director’s hands, this project would have turned out as hate-fueled anti-White propaganda much like The Birth of a Nation or Get Out; rather, director Kathryn Bigelow (The Hurt Locker, Zero Dark Thirty) and her team made great strides to tell the real story of what happened in Detroit.Everything within the first charcoal-tinted twenty minutes brings sense into Detroit’s economic structure of the time. With each bike stolen, with each fire set ablaze, with each fireman injured by a thrown rock, with each Black woman sexually harassed by an officer, with each piece of real historical news footage, the attention closes in on the personal conflict within the riot rather than the spectacle itself. Although the usage of religious institutions deserved stronger prevalence across the entire runtime to match the moral strife of the time, the big picture still explodes with a great undying flame.True to Bigelow’s traditional style, a documentary approach records the dramatized events. Despite an unnecessary musical score by James Newton Howard (The Fugitive, Michael Clayton), a grainy Steadicam stressfully complements the sudden edit cuts, transferring the 1967 motion sickness into your own eyeballs.The tension really sets its spark ablaze during the entire middle chunk: a motel-set interrogation in search for a blank-loaded gun aimed at the police outside. These victims, two of them Ohio-local White prostitutes, the rest young Black men, face the worst of Detroit’s hate over the next hour and a half. The one holding the gun is shot dead, nobody knows the gun’s whereabouts, yet the cops only see an easy chance to humiliate the weak one by one.Every performer gives their greatest effort, the most impactful being a respectful Army Veteran who to the police is no different than any other negro. But Larry, a struggling musician also harassed that dreadful night, adds the most soul to our soulless history. The two whores receive the same poor treatment as their Black companions, lovingly supporting each other even after one gets stripped nude by a cop. While their stories lack their full potential, standing more as victims than empowering female role models, their sentimentality despite their destructive lifestyles make it easy for women to connect with. As with the other Black victims, none of them were motivated enough to cheer on, yet you can still tell them each apart simply by looking at their wardrobe.By now, I believe screenwriter Mark Boal (The Hurt Locker, Zero Dark Thirty) just proved himself to be the most underrated writer in Hollywood today, as he achieved great heights to the artform by writing under a variety of styles, including courtroom drama, real time, and visual storytelling. His intense dialogue helps us to physically feel the situation without coming off as one-sided. He structures the multiple events so that every death hits you hard in the right timing, as true to the expressed motives we learn about each character, whether Black or White.The issues seen here at Detroit looks upsettingly familiar to the anti-Trump riots we see today, almost normalized on a daily basis as it was back then. However, hope manages to lie within its social message: no stereotypes raise their ugly head, not all Blacks involved in the riots are mean spirited, and not all cops are racists. The different social groups stand up for one another and some even stand up for the other side, in a story everybody over the age of eighteen needs to know at once, especially now during the summer season.So bottom line, this history lesson matters to you: Black or White, male or female, young or old, innocent or guilty!"
    },
    {
      "rating": "8",
      "text": "As a child, you are told that the police are there to protect you. If ever you should find yourself in a sticky situation, calling the cops is the safest option as there is an obvious line between the good and bad guys. As a white person, this largely stays true. However, this continues to be proven incorrect as time goes on. Initially, it was black people crying out for justice in the face of police brutality. Yet, whites turned a blind eye, as their experience told them that only the guilty fear the cops or are arrested. When police brutality began spilling into the public eye and into the suburbs, however, everybody was finally able to get on the same page. Films such as Detroit and the various court cases in which innocent people were heinously gunned down by cops only for the cops to then get off free, further bring the issue to light. While there are good cops and any absolute statement about the police is without merit, there remains one thing that is absolutely certain: the slogan \"protect and serve\" is accurate insofar as the cops protect and serve themselves and their fellow officers. If a person, no matter innocence, dares to question the cops or is deemed to have interfered with them in some fashion, then they may as well start calling funeral homes because they are not leaving the situation alive. In the fifty years since the Detroit riots, the established fact that the cops are not to be trusted and are the enemy of all unless proven otherwise has gone nowhere. Riots still happen. Innocents are slaughtered by prejudiced and violent psychopaths in cop uniforms. Those cops still get let off free. Helpless and frightened, the victims in this film are just a few of the thousands that cops have lashed out against without provocation, so do not let your skin color provide you with a false sense of protection. When it comes to you or them, cops will opt to \"protect and serve\" themselves first no matter how innocent you may be. Over the course of two hours, Detroit brilliantly depicts this as black men and white women are violently tortured by white and black cops, while some cops offer a helping hand in the midst of the darkness. It is a surprisingly balanced and reasonable approach to such a hotly contested issue, yet it never shies away from showing the truth in every bloody detail.Chilling in this display, Detroit often plays out like a horror film. With director Kathryn Bigelow slowly building the tension and setting the scene, it is obvious that emotions are high from the very beginning. Though the riot kicks off after the opening raid on an after hours club, tensions are high even in that scene. Perfectly setting the stage for the rest of the film, Bigelow shows the foundation of the war zone. Neither side trusts each other and both are all too willing to escalate the situation beyond repair. Rapidly unraveling to the boiling point, Bigelow takes the time to establish the riots without unnecessary exposition and then never rushes into getting to the Algiers Motel. While perhaps some of the backstory on the singing group is a bit excessive, the film refuses to skip over details. Every bit is important is establishing the innocence of the men and women in the Algiers, while also showing why the cops would be so hot under the collar and the deaths already caused by the cops. To anybody even casually watching the film, the anger of the men in the Algiers and the tired frustration of the cops can be felt in its entirety. By the time Bigelow finally allows the action to kick off in the home, her slow atmospheric build-up has left the audience falling off of the edge of its seat just waiting to watch the horror that will unfold on this fateful night.Once the events in the hotel kick in and reach their conclusion, however, the film somehow ramps up the horror even further. If watching black people systematically and remorselessly killed in spite of their innocence was not horrifying enough, Bigelow shows the true horror that unfolds. Not only are they killed, but their murderers can get away with it without or with very little punishment. As a timely social issue film, Detroit not only shows just how little has changed, but brings to light just horrifying the results of the trials are in context. It is not just the potentially justified shooting of an unarmed civilian. It is the intentional shooting of an unarmed civilian with no evidence supporting their assumed guilt. It is murder derived out of a misunderstanding and chaos that has deadly results and no repercussions. It is the kind of horror that is a bit more subtle and less obvious than the bloody psychological and physical torture endured by those in the Algiers, but it is just as horrifying and relies far more on subtle direction from Bigelow to come off properly. The slow unraveling of the case, the ominous appearance of the Attorney (John Krasinski) as he easily gets the men acquitted, and the after effects of it all make it somehow"
    },
    {
      "rating": "7",
      "text": "This is the latest movie from Kathryn Bigelow, the director who made \"Hurt Locker\", one of my most favorite movies.50 years ago, in 1967 there were infamous riots in Detroit, and this movie is about one of the most tragic episodes of those riots, torture and killing of 3 black people at Algiers Motel by Detroit police.Even though there were several court cases based on investigations of that event, some details are still vague and sketchy. This movie is Bigelov's vision of what happened there in 1967. It is not as much a docu-drama as a dramatization with some fictitious characters.The movie is hard to watch: it is very intense and brutal. Some even consider it a horror movie. Parts of it truly belong to that category.I liked the film's cinematography and acting. What I did not like about the movie is that it was too long, almost two and a half hours, and at times it felt dull.Also, having lived through Los Angeles riots in 1992, I would attest that the movie is somewhat simplistic, uses a brush too wide and avoids important nuances.Even though in my opinion it is not the best Bigelov's movie, it deserves to be seen and discussed."
    },
    {
      "rating": "8",
      "text": "Detroit puts you right there in the action during the heydays of the Detroits riots. Good cops, bad cops..Good black people, bad black people..its all here. And this actually happenned in real life all the way down to the innocent verdicts of the white cops who killed innocent black people.  Kinda sad though. Still..A jolly good Movie!"
    },
    {
      "rating": "8",
      "text": "\"\"But what would they have done differently? What would any of us? And how do we know for certain?\"\"---There's a salient line from the Vox review, but the main thing I took from it, as this is one film people will talk about forever afterward. It should be up for Oscars.Other pertinent questions here right off:  Why in the world would not the lead officer in this whole predicament not be suspended by his dept. right off, esp. with the Internal Affairs detective saying he will now be investigated for murder for shooting a looter with NO weapon in the back, and then bleeding out??  Why do the Algiers motel interrogees not tell the mean cop that it was a starter pistol fired by Carl, who has just deceased, but instead let the whole ordeal go on and on??The film is a bit mind numbing in that it forces the viewer to ask more questions than it answers--- but because it's a historical recreation where all the facts still aren't known, that's to be expected to a certain extent.The performances, production design and cinematography, are all awesome here except for one--- Krasinski as the lawyer at the end doesn't come off very well. The film starts off extremely well, involving us deeply in the time period and story, reaches a climax, but then starts to drag towards the end is my only other criticism here.  Every white American should see this, talk about it, write extensive synopses on all the scenes for years to come--because this is one of those great films that will grow on folks the more it is viewed.  The trolls and their negative reviews and votes here need to be ignored bigly on this one."
    },
    {
      "rating": "0",
      "text": "This movie is so booooooring with bad acting. Movie is 2 hours and 20 minutes long that s 1 hour and 20 minutes to long it s boring movie i fell into asleep"
    },
    {
      "rating": "8",
      "text": "A poignant and timely examination of the events leading up to the harrowing night at the Algiers Hotel in Detroit during the riots, this is a powerful film that underscores issues around race, police brutality, and civil rights that are still painfully prescient. The performances are exceptional, but the pacing is sluggish at times, and this hampers the experience overall. With superb cinematography and an excellent soundtrack, this is a compelling film well worth your time. 7.93/10"
    },
    {
      "rating": "8",
      "text": "The sub-plots were a little much and that weird animated opening was very out of place for a film based on such serious events. Regardless, This is still a very good movie. The cast did a great job and I felt that Will Poulter gave the performance of his career, which is already very promising, with this film and he definitely made the movie IMO.Is it a little preachy at times? Yes but I think they did a good enough job show both sides of the riots and in a realistic enough way to be a brutal reminder that history is doomed to repeat itself if we allow it to."
    },
    {
      "rating": "10",
      "text": "Another sad chapter in America's racist past. Another great movie from Kathryn Bigelow one of the best director's in Hollywood. Excellent story more relevant than ever since now Donald J. Trump a racist is president of United States."
    },
    {
      "rating": "9",
      "text": "This film is brutal and by the end you feel emotionally drained. Kathryn Bigelow has crafted a film that will break you and make you so angry that it's hard to deal with such an injustice. A"
    },
    {
      "rating": "7",
      "text": "Although \"Detroit\" casts a net that is more wide than deep, the film is well documented, harrowing, and intense."
    },
    {
      "rating": "9",
      "text": "A very intense, raw and real look at police brutality and an event that was shaped by it. Its a story that needed to be told, most would write it off as liberal or left wing propaganda but it doesn't demonize police or white people in the way some would say it does. In my perspective, I found it to be aimed more toward the Justice System in America and how it could be used to let evil people get away with crimes that good people are caught in as well on both sides. It's a insanely good movie and one that I recommend to anyone"
    },
    {
      "rating": "10",
      "text": "What an incredible experience. If you want a moving, extremely re-active and interactive story this is the game for you.If you love the character interaction parts of games like Mass Effect, you'll love this.Pushing the boundaries of what a video game is and can be."
    },
    {
      "rating": "7",
      "text": "\"I need you to survive the night\".This is not a thriller. This is a horror movie. The intensity almost killed me.'Detroit' is an ice cold look into the past, which later comes to a sickening realization that some things don't go away. Racism is alive and well. Same thing with sexual assault.It doesn't matter if this was directed by a white women from San Francisco; Kathryn Bigelow made one hell of a movie. Couldn't think of any other director to helm this kind of story than her. While not focusing too much on the usual guilt trip, just telling what happened in history. Everyone was a victim.John Boyega was amazing in this. His reactions alone without any words tells a lot of what's going through the characters head. He tries really hard to stay calm and collective, but at the end the system broke him. Is it just me or dose Boyega look like a young Denzel Washington.Will Poulter, on the other hand, scared the hell out of me. This guy is more evil than any villain combined. I remember seeing him in 'Son of Rambo', when he was just a kid, but now this I didn't see coming. He's a great actor that I hope didn't receive any hate from people, you know like death threats, because some people can't tell the difference between playing a character.My only issues I had is mostly with the editing choices and the strange animated intro. Editing isn't messy or anything, just a few cut away shots that felt off. The film starts quite interesting, if I must say. For a movie that's so brutal and shocking, not once did I expect it to open up with a short animation. It looked beautiful, but wasn't needed.Overall rating: I wish more people are talking about this, because it deserves the attention."
    },
    {
      "rating": "8",
      "text": "Great movie that depicts a real historical event and shows how despicable racism can be. I thought the movie was great and definitely people need to see it to understand how far we have evolved and that we should not reverse it and get back to something like this."
    },
    {
      "rating": "7",
      "text": "In fact, a lot of horror film techniques are used (non jump scares) and the tension is impossibly high.I actually didn't like Zero Dark AT ALL. But here, her style works to make an amazing inmersive film.It feels a bit longer than neccesary. And the contrasts between \"bad cops\" and \"good cops\" its a little too huge. Basically the same thing happened in Zero Dark.Its fascinating how she doesn't allows herself to soften the realitiy. But then those contrasts look fake."
    },
    {
      "rating": "9",
      "text": "Otra de las grandes sorpresas de 2017. Primera película que veo de su directora y me parece fastinante. Salí de la película dando saltos y me apetece ver todo lo que haya hecho esta mujer después de ver esta 'Detroit'. Es genial y completamente mi tipo de cine."
    },
    {
      "rating": "8",
      "text": "However disturbing it was to watch this film, understanding that what was depicted actually transpired, I found it heroic for Kathryn Bigelow to have \"gone there\".  Kudos to her, for the research done and all the hard work to get this story out in the limelight."
    },
    {
      "rating": "7",
      "text": "Detroit narra sólo más o menos bien la represión racista de la época, aunque es muy general y no profundiza en lo realmente importante, aun así es entretenida y curiosa de ver."
    },
    {
      "rating": "10",
      "text": "IntenseDetroit is a very well made look back at the riots in Detroit in 1967."
    },
    {
      "rating": "8",
      "text": "This is a frantic film with shaky camerawork and an almost constant feel of people walking on eggshells, being on their guard, waiting for the next incident to occur, to crank up the tension again. Its quite unsettling viewing, mainly as its based on a true story and it certainly made me angry at the way police officers dealt with the situation. Its undoubtable that a gross misjustice occured, to say the least.In slightly less tense scenes, music such as motown music is played or performed, which I quite enjoyed as I like that music - it also helped to accentuate the humanity which, of course, they had and I most certainly found myself feeling a mix of sadness and anger at how they were treated. I felt this film did well at keeping the viewer feeling tense and gripped for the duration - the jerky/shaky camerawork also added to a feeling of disorientation and certainly its made clear that those who were caught up in the events, whether purely accidentally in the middle of riots, in houses targeted by the police or otherwise, were given no dispensation.The acting was quite solid and I thought it seemed a well made film, giving people an insight into a truly dark moment in American police history - a clear example of abuse of power. The film is directed by Oscar winning director Kathryn Bigelow, of 'The Hurt Locker' and 'Zero Dark Thirty' fame and I'd say this is certainly as good as those films. A solid watch, if a disturbing one due to the plot and themes, I'd say this is worth a watch."
    },
    {
      "rating": "8",
      "text": "A dark and disturbing yet moving look into the Detroit riots of 1967.John Boyega continues to build his impressive resume with another strong performance."
    }
  ]
}