{"id": 2878, "title": "Deuce Bigalow: European Gigolo", "starring": ["Rob Schneider", "Eddie Griffin"], "runtime": 83, "genre": ["Comedy"], "description": "Deuce Bigalow goes to Amsterdam after a little accident including two irritating kids and a bunch of aggressive dolphins. There he meets up with his old friend T.J. Hicks. But a mysterious killer starts killing some of Amsterdam's finest gigolos and T.J. is mistaken for the extremely gay murderer. Deuce must enter the gigolo industry again to find the real murderer and clear T.J.'s name.", "releaseYear": "2005", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/yXdQ4UGDFCsPrynJOdIk20AYLus.jpg", "categories": {"plot": 5.0, "acting": 4.8, "ending": 5.0, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 3.0, "funny": 3.925925925925926, "action": 5.0}, "reviews": [{"rating": "8", "text": "I loved this movie. I am suprised that I did because I really wasnt expected much when I first started watching it but I laughed from start to finish. There were a few corny and cheesey parts to it but I still enjoyed it."}, {"rating": "7", "text": "Just as funny as the first film despite still being totally silly and far-fetched, but like the first you need to really understand Schneider's style of Comedy and not take it too seriously to just sit back and enjoy this very funny movie. It's probably just under from the first one as the novelty has worn off a little so I'm glad there wasn't a third one that followed, but as far as sequels go this still did the job and had a nice amount of jokes and gags, so well worth checking it out!"}, {"rating": "1", "text": "Some insightful parodies, hilarious routines, especially Norm McDonald's cameos, but yea it will keep us out of the IGASC (Intergalactic Association of Sentient Civilizations)  like permanemty  that kinda of makes you proud"}, {"rating": "10", "text": "Funnier than the first. One of Rob Schneider's best comedies ever. If you want a hilarious and fun comedy, this is one of the best around."}, {"rating": "10", "text": "I'll never get tired of words like mangina, hebitch manwhore, so I liked this. Not really 10 just trying to compensate for all the haters, who really should be more careful about the movies they rent obviously."}, {"rating": "0", "text": "If Alexender the Great defined the art of brutality to the highest level, this movie has some similarity; it defines the brutality of comedy movies to the highest level. The jokes are sick, uncanny, and made me choked! Mike Bigalow shows that he has a brain, but he does not know how to use it! He probably got this job because of his last name. Worst comedy movie of the decade, if not of all time!"}, {"rating": "3", "text": "Seems there will always be a place for someone to make us laugh at (with?) stereotypes -- as long as we know the jokes are presented with self-awareness rather than spite. Evaluated based on artistic merit and contribution to intellectual curiosity -- 0; Evaluated on delivering what it promises (or what the informed viewer would expect) -- 6. So, hey, let's split the difference."}, {"rating": "4", "text": "To the people here who are panning the movie with votes of zero - what did you expect from Deuce Bigalow European Gigalo? If you didn't know what you were getting into when you walked into the cinema, there is something wrong with you. Yes, the movie sucked. I expected it to suck. I was hoping for a few god-awful crude laughs, and I have to say the fart-joke was well executed. The movie is what it is and I could never score it high as it treats every subject it touchs upon so superficially, with shallow jokes, and no sustained humour. Since it's rated 'R', it might as well go all way but the moral restraint of the lead character holds everything back. It's rated 'R' - there's no need to do that. A movie unsure of it's own identity except during the most crass of moments and except during the most crap of love stories."}, {"rating": "9", "text": "Cant get any better then a Rob Schneider movie."}, {"rating": "10", "text": "Please this movie was way better then the first one it was more perverse and had better comedy then the first one could ever hope to. The thing that it was in Europe just made it even better with more jokes and all."}, {"rating": "0", "text": "Painfully unfunny. A terrible movie. Waste of time and money."}, {"rating": "0", "text": "Laborious to even sit through. Total trash. Has earned film history infamy as shining example of why most sequels are a waste of film."}, {"rating": "0", "text": "I thought the first Bigalow: American Bigalow was a surprise comedy hit that hit the spot. But this second offering is a total surprise crap wonder! I just can't imagine what got into Rob's head when he agreed to do this. I thought he was one of the good buddy buddy kinda underdog actor/guy whom u can root for... Alas, success perhaps got he better of him??? I could have given this movie at the very least 1 out of 10, but when i heard the movie made my friend who paid to watch this rubbish as well got feverishly sick, I knew it was my moral duty to ass-slap Rob in the face and rate his Duece an utter 0! Please let there be no Deuce Bigalow: Brooklyn Gigolo! or someone's gonna seriously get hurt."}, {"rating": "8", "text": "It's one of the funniest movies we've ever seen."}, {"rating": "0", "text": "Horrible movie. At first I wondered why there were only 6 other people in the theater. 10 minutes into the movie, I found out why. This film was grotesque, void of any true humor, and had absolutely no plot whatsoever. A \"0\" in my opinion is too good for this half-assed film."}, {"rating": "0", "text": "Has to be the worst, phoned in sequel in years. Looks like they wrote it and shot it in a weekend."}, {"rating": "9", "text": "After looking at the meta critics average score, I was prepare for the movie to be really bad! but to my suprise I actually loved this movie! very funny! go and see it."}, {"rating": "0", "text": "Disgusting,nasty,rude and horrible."}, {"rating": "0", "text": "Probably the worst movie I've ever seen. If America is the new empire, this movie is further proof that surely we are in decline. I felt dumber just watching it. If you go and don't have a chick with you that you plan on making out with for an hour and a half, you will have wasted your time."}, {"rating": "0", "text": "Worst. Movie. Ever. Period. I already didn't expect to much about this, though I was a little bit psyched about it. That's just because it's almost entirely recorded in Amsterdam, The Netherlands. Being Dutch, I thought that was pretty cool. I hoped they'd make my (somewhat) beloved country look good, and not be too cliche about the city where i went to school, Amsterdam. But offcourse, just like almost every foreigner coming to the Netherlands always does, the makers of this \"movie\" probably spent a 2 weeks in coffeeshops, took their notebooks and laptops with them, and came up with a script. Sort of. I saw the results of their efforts last night, and 80 minutes later, I wasn't feeling that happy. Not that happy at all. It took them pissing and shitting Canadians, a tricked out boat, a woman with a penis for a nose and a lady with a blowhole in her throat(Before you ask; yes, she will meet the penis-nosed lady, and no, the result is not surprising). This combined with some of the worst Dutch actors this land has to offer(really, the Dutch accent in our English is horrible, but it won't -barely- make you want to rip of your ears.) resulted in the worst 80 minutes I spent watching a movie. 3 things that weren't too bad about this movie: - Hanna Verboom(she's hawt!!!) - the piss/s..tting Canadians - the word \"prostidude.\" Now that's a funny word."}, {"rating": "0", "text": "Total garbage. painfully unfunny. worst comedy of the year."}, {"rating": "0", "text": "The only thing more upsetting than movies like this is that there are actually people who pay to see them."}, {"rating": "1", "text": "A boring, unfunny piece of crap. The first movie was not too bad, but it did not need a sequel. This movie proves that it is so."}, {"rating": "6", "text": "Now I know this won"}, {"rating": "0", "text": "Agreed. This has to be the worst sequel of 2005, if not the last few years. So unfunny I wanted to scream, so boring I didn't have the energy to, so crappy I wanted poop on it."}, {"rating": "0", "text": "ohmigod. i can't believe this ever even got made. off the grid horrible. totally wrong and not in a funny way at all."}, {"rating": "0", "text": "pathetic, tasteless, just plain poor. a low point for Rob Schneider who i actually think can be quite funny, but the material he had to work with here was junk even for Deuce Bigalow standards. deserved to be endlessly mocked and made an example of for ripping off fans trying to cash in on the first movie. a disgusting effort."}, {"rating": "0", "text": "On par with hurricane Katrina as the worst American disaster of the year. Poor Rob Schnider."}, {"rating": "10", "text": "I thought this movie justifies my love of humanity. Rob Scheider's mangum opus promises much and it delivers like a Domino's delivery driver. I laughed so hard I peed in my pants. Apologies to anyone I hit with said pee, I hope they make a third one even if I have to pay for it myself. This movie is recommended for blind nuns and families with either really young children or grandparents addicted to rohypnol."}, {"rating": "0", "text": "This movie was just stupid. nothing funny about it. i agree with Wes E 100%."}, {"rating": "5", "text": "I thought it was a lot better then the first one. It was pretty funny and had a lot of hilarious moments. The plot isnt all that interesting, the acting is pretty average, and it can be a bit dull but it was still a decent comedy."}, {"rating": "1", "text": "This movie is disgusting and almost never funny.  I wasn't expecting some sort of witty masterpiece, but this movie doesn't even provide stupid laughs.  Most of the time it's just completely flat.  I can deal with underwhelming plots in comedies if the jokes are funny, but every time European Gigolo even bothers to come up with one, which isn't often, it is just plain disgusting.  I'm not some sort of snob, but this movie was not any good.  It will have you gagging, but not from laughter."}, {"rating": "10", "text": "There really are too many funny lines in this film. The scene with the guy delivering pot for his daughters birthday cracks me up. Couple of scenes are a bit gross out tho. Just fast forward  Unexpected gem."}, {"rating": "5", "text": "You really need to turn your brain off for this one. Bigalow part 2 is packed with stereotypes, sex jokes and everything that resides at the bottom of the immaturity scale. Did we need a sequel? Nope. Nevertheless  this film can be a lot of fun when you just want to turn off. Any films created by or featuring the friends of Adam Sandler get unjustified hatred. You won't care about the characters on display and the script uses too many dirty jokes to get by. A few scenes are cringeworthy and a few border on hilarious. A mixed bag when it comes to the audience  recommended for the teenagers but everyone else may want to avoid European Gigolow."}, {"rating": "1", "text": "I watched this after a coworker loaned me her copy and insisted it was a shame I'd never seen it. Honestly, I have no idea why it seemed to hold such a high rating in her mind. I was bored and uninterested throughout the entire movie. I can think of 1-2 times in the entire film where I cracked a laugh. Beyond that, it was simply a stupid waste of time."}, {"rating": "10", "text": "Best Rob Schneider movie of all time its so funny in every way i love the plot the characters the wrting and its not only best Rob Schneider Movie but 6th best movie i ever seen"}, {"rating": "6", "text": "Not as good as the 1st. There was at times where it seemed like they were doing to much to be funny. Still a pretty funny movie though."}], "recommendations": ["grown_ups_2", "movie_43", "meet_the_spartans", "epic_movie", "scary_movie_5", "vampires_suck", "miss_march", "the_hangover", "a_haunted_house", "one_year_one_night", "the_watch", "the_dictator", "hot_tub_time_machine", "dumb_and_dumber_to", "grown_ups", "jackass_the_movie", "30_minutes_or_less", "the_interview", "anchorman_2_the_legend_continues", "norbit", "little_man", "this_is_the_end", "sex_tape", "white_chicks", "the_ridiculous_6"]}