{"id": 3262, "title": "Deuce Bigalow: Male Gigolo", "starring": ["Rob Schneider", "William Forsythe"], "runtime": 88, "genre": ["Comedy"], "description": "Deuce Bigalow is a less than attractive, down on his luck aquarium cleaner. One day he wrecks the house of a gigolo and needs quick money to repair it. The only way he can make it is to become a gigolo himself, taking on an unusual mix of female clients. He encounters a couple of problems, though. He falls in love with one of his unusual clients, and a sleazy police officer is hot on his trail.", "releaseYear": "1999", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/w0UKAcY4fAPuQW2GhAoIMwutIA5.jpg", "categories": {"plot": 5.0, "acting": 8.0, "ending": 5.0, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 3.0, "funny": 7.545454545454546, "action": 5.0}, "reviews": [{"rating": "8", "text": "Bjjbytguginniughioninugdttsweyuomkkkhfulyedguijggughihhiigguguugyfrsestdugihhihiihihhfeh"}, {"rating": "8", "text": "》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$"}, {"rating": "8", "text": "Not a great comedy, but still good one to spend your time with. I've seen better from Rob Schneider."}, {"rating": "8", "text": "Deuce Bigalow is a hilarious movie. It might not be the smartest film but it has some of the funniest lines to date. Rob Schneider is great along with all the other characters."}, {"rating": "8", "text": "$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.》■》■》■》■》■》■》■》■》■》■》■》■》■》■》■》■"}, {"rating": "7", "text": "Silly, perhaps, but Rob Schneider is such a likable actor that it really doesn't matter and this is a very funny film. As long as you don't sit there taking it too seriously and laugh along at some pretty out there jokes then you will have a good time, but you will need to 'get' Schneider's comedy in order to enjoy it. It's also a clever concept too I think of an Average Joe taking over the role of a Gigolo and he pulls it off perfectly, so if you're in need of a good chuckle look no further"}, {"rating": "8", "text": "One of the laugh out loud comedies from 1999, following in in the footsteps of Austin Powers 2 & Big Daddy also released that year."}, {"rating": "3", "text": "Rob Schneider, I don't care if you are friends with Adam Sandler, there are many more comedians more deserving (and more funny) to have the their own movie than you."}, {"rating": "9", "text": "Just genious    ."}, {"rating": "9", "text": "A hilarious concept with great acting from Rob."}, {"rating": "7", "text": "Hur hur hur - funny! The sort of movie that is great if you don't expect anything from a movie but easy humor that you can watch while also surfing the net."}, {"rating": "10", "text": "Ignore the square reviewers - they must be glum booring people that need to relax and learn to enjoy a good funny film! This is a laugh a minute film and I would reccomend it to any bloke - and some women, although my wife seemed to think it was in poor taste! That has got to be a selling feature !!!"}, {"rating": "0", "text": "Would probably rank as one of the all time worst movies, if it weren't for its sequel."}, {"rating": "3", "text": "When Deuce Bigalow is fired from his job cleaning fish tanks, he meets a male prostitute that asks him to care for his fish whilst he is away. When he breaks an expensive fish tank, he finds himself working as a gigolo to pay for the damages. It’s hard to fathom quite why this was such a big hit at the box office as, despite the best efforts of Rob Schneider, the tired old jokes very quickly become rather grating."}, {"rating": "9", "text": "My Family and I absolutely love this Rob Schneider Movie.We love that the movie Makes fun of one man’s misery, that he has to turn to Prostitution to make some money, in a short period of time.And the Characters he meets, are very special in their own way."}, {"rating": "8", "text": "I miss movie like this, where we could just laugh. I remember to be in the movies with just a few people and almost pissed myself from many laughters."}, {"rating": "8", "text": "I love this movie. When it first came out I never seen anything like it. It's so hilarious. The worst gigolo ever!"}], "recommendations": ["just_go_with_it", "grown_ups", "paul_blart_mall_cop", "yes_man", "ted", "norbit", "thunder_force", "the_other_guys", "what_happens_in_vegas", "dirty_grandpa", "a_million_ways_to_die_in_the_west", "dodgeball_a_true_underdog_story", "old_dogs", "hot_tub_time_machine", "dumb_and_dumber_to", "get_hard", "night_at_the_museum", "dinner_for_schmucks", "dumb_and_dumber", "masterminds", "30_minutes_or_less", "good_luck_chuck", "neighbors", "just_friends", "wild_hogs"]}