{
  "id": 2602,
  "title": "Devil",
  "starring": [
    "Chris Messina",
    "Bojana Novaković"
  ],
  "runtime": 80,
  "genre": [
    "Horror",
    "Mystery",
    "Thriller"
  ],
  "description": "A group of people are trapped in an elevator high above Philadelphia, and one of them is the devil.",
  "releaseYear": "2010",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/aivXPSi53H95BoUa5njEYso389s.jpg",
  "categories": {
    "plot": 6.1,
    "acting": 5.894736842105263,
    "ending": 8.571428571428571,
    "soundtrack": 5.0,
    "cinematography": 7.0,
    "familyFriendly": 5.75,
    "funny": 7.0,
    "action": 7.666666666666667
  },
  "reviews": [
    {
      "rating": "10",
      "text": "This movie is great! Its not like all the other damn horror movies these days where there is no story at all, and all they focus on is blood and gore. This actually has a story and it definitely worth your time and money!"
    },
    {
      "rating": "9",
      "text": "+*+*+*+*+*+*+*+*+*+*+*+*+*+*%*%*%*%*%*%*%*%*%*%*%*%*%*%*●◇●◇●◇●◇●◇●◇●◇●◇●◇●◇⊙■⊙■⊙■⊙■⊙■⊙■"
    },
    {
      "rating": "5",
      "text": "It's common knowledge these days to believe that M. Night Shamalamadingdong is nothing more than a one-trick pony. Yes, his name IS amalgamated with this film but luckily for us he is only producing the movie and not actually directing it. Does that fact help? Maybe yes, perhaps no. Either way I have mixed feelings about \"Devil\". It's neither frightening nor suspenseful but it does have an element of unpredictability which is appreciated. All in all It's nothing special but it does do It's intended job for what It's worth."
    },
    {
      "rating": "5",
      "text": "After watching Devil I can say that I was surprised that something of this caliber came from M. Night Shyamalan.\r Wait...no, no I'm not...\r Despite only filling the producer/writer role, Shyamalan's continued floundering seeps into every corner of this film.\r While Devil's premise is interesting its execution is incredibly flawed thanks to twists that can be seen from miles away, unbelievable and down right moronic events and circumstances setting up these twists, and a complete lack of any kind of suspenseful build up. For a movie that was supposed to be thrilling and unsettling Devil falls flat on its face."
    },
    {
      "rating": "4",
      "text": "Is it entertaining? Sure. But its good concept and carefully wrought tension are totally scuppered by its appalling direction, its hilariously bad dialogue and ludicrous characters, particularly the stereotypical Hispanic religious nutcase who happens to be right."
    },
    {
      "rating": "5",
      "text": "\"Devil\" is quite silly at times, but at least it's entertaining and sometimes very thrilling. The acting isn't very good, and the characters are rather generic: overly-serious black guy, crazy old lady, a**hole businessman, and boring guy and girl. Many plot points are so silly that they are unintentionally funny. Apparently, you know the devil is near if a child hits his head on the table when he falls, and suicide notes are either completely insane or completely rational, never both. I think I liked this movie because it's sort of a modern version of Agatha Christie's \"And Then There Were None\" which is one of my all-time favorite novels. I recommend it if you can get past the sillier plot points."
    },
    {
      "rating": "4",
      "text": "I can't say the movie is rubbish, but it is certainly far from good. Watchable at best. The idea, people dying inside an elevator, is amazing and I'll admit that it's the idea that has inspired me to watch the movie. But, except that good idea - there's absolutely nothing, except maybe the atmosphere but that's mostly irrelevant. The acting is actually quite bad, the plot itself is more comical than frightening and I actually watched the movie hoping for a scary moment until the credits started rolling. I was bitterly disappointed. All the elements of a bad horror movie have been implemented here, even mocked in some strange way, but the movie is not even close to a parody. If you enjoy a creative idea to stimulate your deductive mind, you can give the movie a try and look at the elevator as a puzzle, but beside that, it offers absolutely nothing and I do not recommend it for watching."
    },
    {
      "rating": "3",
      "text": "Boring, forgettable, And a waste of time. Well at less it's really forgettable so at less it's not a awful watch I mean it is watchable but that not saying much. Movie still sucks."
    },
    {
      "rating": "3",
      "text": "Pros: it's well acted and it has a good premise. and the first 15 minutes are pretty good and well as the last 5 minutes.\r Cons: It's badly written, the story is all over the place, the twist sucks, the charters are annoying , the movie is really forgettable, and it's really boring\r Other thoughts: Devil is not unwatchable but it's still pretty damn bad."
    },
    {
      "rating": "10",
      "text": "A+ *************************************************************************"
    },
    {
      "rating": "9",
      "text": "A very clever, thrilling outing from a generally unfavoured film maker. Devil kept me guessing until the finale, and left me more that satisfied. Watch this film."
    },
    {
      "rating": "10",
      "text": "I found the original script, too bad the movie is not a little longer, I find that the reviews are pretty harsh??? It is a good B movie. Waiting for the next chronicles."
    },
    {
      "rating": "10",
      "text": "I don't watch horror movies but this is a 'horror' with a twist.  You keep changing your mind as to who the devil is until right at the end and even then it's a surprise!"
    },
    {
      "rating": "10",
      "text": "Went into this movie with diminished expectations but came out liking it. So much better than m.night's last few that I hope it's a comeback trail. Give it a try if you have fond memories of his older stuff like the village"
    },
    {
      "rating": "10",
      "text": "This movie was absolutely fantastic ! It kept me on the edge of my seat from beginning to end. Great script, lots of twists, superb acting. I clapped my hands when it was over ! Congratulations, filmmakers !"
    },
    {
      "rating": "10",
      "text": "From the master of the modern day dark thriller, M. Night Shyamalan, comes Devil. Going into a Shyamalan movie, you know you're going to see a tragedy, a hero, and an amazing twist at the end. Coming off two absolute bombs, Shyamalan needed a good film to get back on track, and Devil is it! This is one of those movies that's hard to describe without giving stuff away, so let me just say, it's Shyamalan at his best! It's a great story, a young unknown cast, and the ending will just blow your mind. Unlike most Horror/Thriller writers, Shyamalan doesn't use gore to shock you, but rather has a story that will just scare you to your core, and by the end of this one I was rattled! This is a top notch film that fell way under the radar, because of its unknown cast, but if you like scary movies or edge of your seat thrillers, you have to see this film!"
    },
    {
      "rating": "9",
      "text": "I just need to say this first. After M. Night's horrific move on making The Last Airbender, I thought NOTHING would redeem him for it.  This movie barely does it. Since he actually direct this movie, he still has a way to go to earn the respect of the average moviegoer. This movie was actually pretty intense. Director John Eric Dowdle (Quarantine and The Poughkeepsie Tapes) seems to know what he's doing when it comes to thriller/suspense movies. The movie often does the movie trick to completely shut off the picture to take us into the darkness of being trapped inside a small space like an elevator, which I found to be a good thing.  I especially like the concept of the story, in which the Devil comes to Earth in human form and when that happens, everything is ends up going bad. One way they make that assumption was when the religious security guard tosses his toast with jelly in the air and it lands jelly side down....a useful test to see if the Devil is here.  Another thing I liked about this movie is the cast itself. Each person trapped is very different and you may believe anyone of them is the one behind it. The thing that I did find a tad annoying was the acting of Logan Marshall-Green, one of the trapped. His acting was a bit off in my taste, but it's nothing that would distract you from the rest of the movie.  I'm not going to reveal who the \"Devil\" is, but me personally, I had a guess and I was right.  The twist on who is the devil may be obvious to some, but the overall twist kinda catches you off guard."
    },
    {
      "rating": "10",
      "text": "If your looking for blood and gore then I suggest to look elsewhere. The movie tells a story. A really good story about good, evil and choices. This was the first movie in a long time that told a scary tale like a \"Halloween tale\" if you will that leaves you thinking. The other thing I liked was how this movie made me reflect on myself. Do I hold grudges? Have I forgiven others? Best money spent in a long while!"
    },
    {
      "rating": "9",
      "text": "Better than expected and not as bad as critics expressed.  More of a thriller than a horror flick.  Kept me guessing until the very end.  Not too many movies have done that for me.  Not the exorcist, not the last exorcism type of movie.  A thriller-suspense type of movie.  probably not worth a blu-ray purchase but worth a one time rental when it comes to DVD.  Not because the movie does not have merit but because the nature of the plot and suspense."
    },
    {
      "rating": "9",
      "text": "This movie deserves a whole lot better rating then the critics gave it.  I thought this would be another M. Night bust but i gave it a chance and boy was i impressed.  Ever since the Village i fell off the M. Night Shaymalan wagon because the endings didn't live up to the movie as a whole.  Its been like eating cake with no frosting, the best part wasn't there.  But this one had a terrific ending and the screenplay didn't seem so bland like his last few flicks.  9/10.  Certainly back on the M. Night wagon, to some degree."
    },
    {
      "rating": "6",
      "text": "The movie is a surprisingly decent one from M. Night Shyamalan from his current movies."
    },
    {
      "rating": "9",
      "text": "Okay, M. Night Shylaman, before this movie came out, I remembered you for \"Avatar: The Last Airbender\" and that's not a good thing, I had mixed feelings about you when I was about to watch \"Devil.\" Honestly, I expected me to hate \"Devil,\" but after watching it, it turns out that I underestimated you. The movie is VERY VERY interesting with a sense of creepiness that is abundant in the movie, it scared the living crap out of me. It was an extremely enjoyable creep fest about murder mystery, paranoia, fear and anxiety. The movie has that feeling of anxiety, the fact that you're in a small space with a killer is not quite settling. So its a great Halloween movie, it creep-ed the hell out of me and had a great ending. Its a must see!"
    },
    {
      "rating": "9",
      "text": "An smart and well-paced horror flick that, while intense, falls short of being truly horrifying.  It keeps things fresh by feeling like a classic whodunnit with a supernatural twist or a good episode of \"The Twilight Zone.\"  Since Shyamalan didn't actually pen the script (he's the mind behind the story, but the screenplay was handled by a different party) or direct the film, it lacks the subtle tension common in most of his other productions; opting for more jump scares than edge of your seat suspense.  Plot development and themes, however, are very Shyamalan-esque.  When all the pieces fall into place, it's a nicely executed revelation."
    },
    {
      "rating": "10",
      "text": "I created this account, after 4 years of lurking, to write a review of M. Night Shamalan's return.  The movie \"Devil\" was amazing. The best way to compliment this film would be to say, \"he's back.\"  This was one of the best  Shamalan movies I have seen since, \"The 6th Sense.\" I saw it on using a Redbox kiosk tonight, and had expected to see Shamalan's \"last demise\" so to speak.  Holy Crap, this movie was amazing, I don't know if he planned it this way or not, but this was ingenious! Just wow...."
    },
    {
      "rating": "9",
      "text": "This Horror Movie Is In The Top 50 Best Horror Movies!This Horror Movie Is Not Like Any Other.. Its So Creative And Well Thought... Really Good Acting For Once!! :DMy Score Is 9!"
    },
    {
      "rating": "9",
      "text": "The acting was great and there was some really intense moments.In some other movies some details would disappear but in this movie all the details are important.The only annoying thing in the movie is the mexican/religious security guard."
    },
    {
      "rating": "3",
      "text": "JSau, down below, is right in his opinion of this movie.  This seems like one of those Christian evangelist movies, targeted to an audience who believe in the Christian devil, and if you do happen to be one of those believers, you'll probably be scared. Otherwise, this is pretty silly stuff. Good acting and great cinematography, especially the disturbing opening shots of Philly, are the redeeming factors."
    },
    {
      "rating": "4",
      "text": "Look, with the proposal of including five actors in a elevator, could have been better. I think it would be nice if they explored a little bit the life of each one character, their mistakes, and etc. One thing more dramatic thrilling. Perhaps even really a little scary. Even with the little case with horror movies, I think that when properly treated, the results are gratifying. Well, for what could have been left much to be desired, too bad that."
    },
    {
      "rating": "7",
      "text": "A very efficient thriller/horror. It's a fun cool movie and its worth a rental and its worth your time. It's a short little game of clue that is just plain fun to watch. Yeah, it has flaws, but alot of movies do. Check it out."
    },
    {
      "rating": "5",
      "text": "Not frightening movie at all, in fact, is PG-13 so that limit's more the tension,probably the mature. The story was quite interesting, but other than this was a complete boring movie, so, do not even touch this, unless you wanna puke."
    },
    {
      "rating": "2",
      "text": "Good side: director is able to build tension and suspense out of a thin scenario in the very confined space of an elevator. From that point of view, the exercise is a success and he has talent.\rBad side: this movie has nothing to do with Satan. This movie is about Hades. That part was disappointing as there's nothing tied to the scare Satan stories can create. Also, movie holds just one viewing: after you've seen it, there's nothing much left for watching it again.\rOverall, a movie that falls short on story and biblical background, leaving you on your hunger. Renting it is ok. Buying it is pointless."
    },
    {
      "rating": "7",
      "text": "'Devil' is basically the first \"Good\" M. Night movie I've seen in a while since 'Signs'. Though the horror wasn't really there, the rest was gold. Just wish M. Night could make something better than this, even though I like it, 'cause it appears to be his \"last\" good film he's making."
    },
    {
      "rating": "7",
      "text": "A simple and effective little thriller; its pacy, utilises its small space with ingenious camera-work, and keeps the audience guessing as to how it's all going to end.  Surprisingly, it also has a great use of humour to balance the tension and chills, I eagerly await the next installment of the Night Chronicles."
    },
    {
      "rating": "10",
      "text": "since the last airbender a lot of people have hated m night shaymalan because of his preception of the animated series.But a lot of other people have been fans of shaymalan since the beggining.i have no experience for shamalan movies except for the last airbender and when i saw the hate on the movie i felt bad for the guy.oh and by the way if you like the last airbender go to   last airbenderfans.com.i think why people like this moive is because he just produced it.i guess thats okay.everyone has good and bad qualities.anyway i recomen this for anyone who is looking for a good thriller form the mind of a potentially good director with a lot to give but is misunderstood.goo see the movie"
    },
    {
      "rating": "0",
      "text": "Yo I'm sorry but this movie was garbage. I don't even know what to say. Saw 3D >>>>>>> This. It was boring. THe acting sucked. The mexican guy was ****ing annoying going on about the christian BS. If I wanted a church lesson I would go to church. I guess if you are really bored you might get minor enjoyment out of this but I'm sure watching youtube is more entertaining unless its husky starcraft, that guy sucks ass."
    },
    {
      "rating": "5",
      "text": "Not the worst but still a disappointing horror which borders on a whodunit type thriller but it's all been done before and there's nothing memorable to encourage a recommendation."
    },
    {
      "rating": "7",
      "text": "Aside from the stupid sub-plot, some-what weak dialogue, and the some-what below average acting, It was actually a rather enjoyable movie that I kept you interested from start to finish. I liked it."
    },
    {
      "rating": "8",
      "text": "Shockingly, a very good movie. M. Night Shamalyan really knoced me out of nowhere with this movie. The overall movie is more of a supernatural thriller, however the twist ending and the special effects have a mix of horror in their too. My main problem is the movie is very short, and I wanted to see more! I can't wait for the second Night Chronicle movie!"
    },
    {
      "rating": "5",
      "text": "This suspense film revolves around a group of people, unknown to each other, who are trapped inside an elevator of a skyscraper, unaware that one of them is actually the demon in disguise, willing to drag them to Hell and punish them for their sins. Screenplay is based on a story by M. Night Shyamalan, director of \"Sixth Sense\" among other films. In fact, the concept idea is good, intriguing and succeeds in grabbing the public attention, having been decently developed in the script. \"Who will be the next victim?\", \"who is the devil?\"... these two questions are the skeleton of the film from a given moment and this makes everything more predictable from then on because they're limited to a set of options and conclusions. The film is too fast and doesn't have a very good pace. We cannot appreciate the suspense when everything is happening so quickly. The actors' work was decent enough, particularly Chris Messina, but most of the characters weren't particularly good. Jacob Vargas, in particular, played a Latin with strongly stereotyped and absurd characteristics. Cinematography is good, visual and sound effects were well used to densify the environment at the exact moments. The film has quality. However, it lacks some unpredictability and a deeper story, with stronger characters."
    },
    {
      "rating": "0",
      "text": "\"When he's near the toast falls jelly-side down\"\r Most wtf line in this movie. And this movie is wtf. The script is so awful and has Christian proslyzation. After two characters die, you just don't give a **** The basic concept is so good, but we just felt they were all gonna die. The most boring victim of \"Satan\" is actually the most interesting character. There was no suspense and it feels 2 hours long. Also wtf at the name thing, was that supposed to be a twist? The directing was good, but everything else was so awful, even the CGI. Hellraiser 1 put more fear of omnipotent beings into us than this drab movie."
    },
    {
      "rating": "6",
      "text": "There are Intuitionists and there are Empiricists, two warring factions of elevator inspectors who form the Elevator Guild, an organization that is at the center of the alternative world in Colson Whitehead's first novel \"The Intuitionist\", an allegory about race, upward mobility and...religion. The Empiricists see the problem; they scoff at the procedural metaphysics that is practiced by the Intuitionists, men and women with hunches who divine the problem. Lila Mae Watson, the first black elevator inspector in the history of the Guild is an Intuitionist; she uses a faith-based approach on each inspection job. Intuitionists just know. But then Lila Mae's kind come under fire when an elevator car she oversaw on a routine inspection, suffers a complete malfunction, plummeting to the ground, which calls the Intuitionists' methodology into question. As it turns out, Lila Mae was a victim of sabotage, perpetuated by the Empiricists, who rigged the fall. G. Carson is the elevator inspector in \"Devil\", a film with a world that's topsy-turvy in its own right. The vertically-challenged opening shots of the upside-down metropolis has an estranging effect on the moviegoer, because it reallocates heaven and hell from their normal points of reference: north and south. So what does it mean when Gehenna finds itself aloft in an emblematic sky, while a reconstituted Canaan is lowered from the celestial sphere, occupying where the ground used to be? Well, if Gabriel and his gang of rowdy angels can kick ass in Scott Stewart's \"Legion\", why can't the devil sport an altruistic side and do God's work for a change? \"Devil\" inverts The Rolling Stones' song \"Sympathy for the Devil\" through its originative characterization of an archfiend who has sympathy for the human condition. Taking the form of an old woman, the devil works in ways more mysterious to God; she's a one-demon advocacy group: D.A.D.D.(Devil Against Drunk Driving). The devil cares. Like the Colson Whitehead novel, \"Devil\" has its own intuitionists and empiricists in a holding pattern of ideological discord. When a ghostly image superimposes itself upon the elevator passengers in the security camera monitor, Ramirez(Jacob Vargas), the intuitionist(read: ecclesiasticist in the Whitehead novel), has a gut reaction; that video disturbance, his gut tells him, is the devil, whereas Lustiq(Matt Craven), the empiricist(read: atheist), dismisses his partner's spiritual notions outrightly. Bowden(Chris Messina), the detective in charge of the ongoing crime scene, is also an empiricist, but with a difference; he believes that man is the devil, after a mortal demon left his wife and child at the scene of a vehicular homicide. He becomes an intuitionist after the devil reveals herself, and forces the drunk driver(Logan Marshall-Green) to repent. Afterward, in the squad car, Bowden tells Tony who he is, and forgives the man for what he'd done to his life. The devil made him do it. That's pretty subversive stuff. God is nowhere on the scene. G. Carson(COL-son) is no longer in the elevator inspection business. What if \"G\" stands for God?"
    },
    {
      "rating": "6",
      "text": "for M night shamalamadingdong , this wasnt half bad . as a horror movie it wasnt all that great ... well it wasnt even scary period but it was a intresting story and original so i was entertained atleast. the acting was prety decent and its pacing was pretty good . its worth seeing if you want to see some thing original and abit entertaining but if your looking for some thing scary ... look els where."
    },
    {
      "rating": "8",
      "text": "Great and suspenseful movie! Every second of the movie keeps you on the edge of your seat. One of the best twists I've seen in a movie. Definetly worth seeing!"
    },
    {
      "rating": "8",
      "text": "Will Devil make you fear going in elevators, or will make the audience want to put pitchforks through themselves? Devil is about five people stuck in an elevator, with one of them being the Devil. The people in the elevator are Jenny O' Hara (Extract), Bojana Novakovic (Edge Of Darkness), Geoffery Arend (500 Days of Summer), Bokeem Woodbine (Ray), and Logan Marshall-Green (Brooklyn's Finest). Chris Messina (Greenberg) plays a detective trying to piece together which one of these people is the Devil. Devil starts out slow, but the effects, the plot, and the acting piece together a decent supernatural-horror flick. The thing that I like best about this movie, is the twist ending. Overall, the movie rarely scared movie. However, the one person that turns out to be the Devil, and the way that person looked at the camera nearly made me pass out. Also, they all have a little dirt on them, so you can't tell which one is the Devil. For example. Hara's character is a robber, Novakovic likes to marry the rich, and leave them with their money, Arend's character is one of the main causes for the economy, Woodbine's character is a thug, and Green's character is just plain weird, carrying a satchel with pliers, scissors, and more creepy stuff, and doesn't take them with him on the elevator. I expected this movie to actually be funny. However, it's my favorite horror film since The Crazies. However, the beginning starts out slow, but I got into it after 20 minutes. Devil ends with the quote \"If there's a devil, there has to be a god.\" Hopefully, when I fall asleep tonight, there will be a guardian angel with a dream catcher right next to my bed, so I don't get nightmares. An hour and twenty minutes of fun, Devil gets a: B+."
    },
    {
      "rating": "8",
      "text": "Good film! Totally didn't see coming who it was & loved the way it all came together at the end. A horror with a good story doesn't come around very often. Last couple Shyamalan films have been a let down, this one is very good."
    },
    {
      "rating": "8",
      "text": "The title alone should draw skepticism but at 80 minutes the movie is actually good (and I usually assume that any movie under 90 minutes will be predictable and traditional).  In fact, I enjoyed the big reveal/climax! I just wish that at every key moment in the movie, the screen didn't turn black (Ugh!) - who knows if due to not wanting to pay for more special effects, lack of visualization/creativity, wanting to preserve a PG-13 rating, or director's preference. But, despite those moments, I was engaged throughout. Quite surprised by that."
    },
    {
      "rating": "8",
      "text": "I wanted to see this film and I am glad I did. I thought it was great. It was interesting, Had a good story but the backstory was a little bit too generic though, and it ended good as well. I would highly recommend this."
    },
    {
      "rating": "6",
      "text": "i actually enjoy this movie. This movie was very interested. I like movies that have me thinking. This is one his best movies in long time. He bounce back from last air bender. This is a nice movie to watch if you like thriller horror movies. Nice movie to get for blu ray and dvd. I suggest everybody should check this movie out. This movie isn't outstanding but its still good."
    },
    {
      "rating": "7",
      "text": "The film draws the viewer in with classic suspense and satisfying thrill. Were it not for the sub-par dialogue and predictably sequential killing of those involved, the film may have warranted a bit more of an attractive critical surrounding. Nevertheless, it stands to be a very stimulating horror flick, which is almost as creepy as some of the characters in the supporting ensemble. A definite win for a director who makes more duds than a French bomb factory. It's no Sixth Sense, but if you have any appreciation for scary movies, you'll get something out of \"Devil.\""
    },
    {
      "rating": "8",
      "text": "Finally, am above-average screenwriting by M.Night.Shaymalan. You would love to know who's the devil among the people who are trap in the elevator, and that's what makes you watch the movie to the end. There's enough \"ouch\" moments that will keep you interested in watching the whole movie."
    }
  ]
}