{
  "id": 4321,
  "title": "Diamonds Are Forever",
  "starring": [
    "Sean Connery",
    "Jill St. John"
  ],
  "runtime": 120,
  "genre": [
    "Adventure",
    "Action",
    "Thriller"
  ],
  "description": "Diamonds are stolen only to be sold again in the international market. James Bond infiltrates a smuggling mission to find out who's guilty. The mission takes him to Las Vegas where Bond meets his archenemy Blofeld.",
  "releaseYear": "1971",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/tOrCHtj4uUOt5p57F3SUwWbsQiE.jpg",
  "categories": {
    "plot": 4.4,
    "acting": 5.4,
    "ending": 7.25,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 5.333333333333333,
    "funny": 5.333333333333333,
    "action": 5.333333333333333
  },
  "reviews": [
    {
      "rating": "3",
      "text": "Directed by Guy Hamilton, produced by Harry Saltzman and Albert Broccoli and with screenplay by Richard Maibaum and Tom Mankiewicz, this is the seventh film in 007 franchise and resumes the participation of Sean Connery in the role of the British agent for the last time. This movie will attempt to Americanize the character, an option that, for today's fans, was highly incorrect, despite the success at the box office.In this film, James Bond seeks revenge on Blofeld, who blames the death of his wife, Tracy Bond. At the same time, he investigates the disappearance of diamonds in South Africa, suspecting trafficking. During investigations in Amsterdam, Bond found suspected links with the United States, where the stolen diamonds are sent. Narrowly escapes death in a crematorium and continues to follow the clues to Las Vegas, where he will face again Blofeld, the mastermind behind the theft of diamonds, with which it plans to build a space satellite that destroy entire cities.Although Sean Connery returned to the role of 007, the film's producers know they will not be forever. On the other hand, the pressure for adapting the character to a new audience increases with the entry in the seventies. Although the plot is almost entirely passed in the United States, the film has almost no action scenes, on the contrary: some particular scenes are perfectly anecdotal, in a humorous style that did not benefit the film. On the other hand, it appears to interpret the character Connery no motivation and no concern that shown in previous films into thinking it would have been better to the paper, once and for all, to another actor. The theme of space conquest, which was fashionable during this time, it could also have been better used, as would be in future films.In this film, apart from central casting inherited from previous films, James Bond is incarnated by Sean Connery. Jill St. John gave life to the bond-girl Tiffany Case. Charles Gray played the villain, Blofeld. Putter Smith and Bruce Glover gave life to the double murder, and apparently homosexual, Mr. Kid and Mr. Wint."
    },
    {
      "rating": "0",
      "text": "Ce dernier Bond avec Connery avant qu'il ne revienne bien plus tard dans les années 80 pour une sorte d'ultime baroud d'honneur (raté lui aussi soit dit en passant) ressemble étonnamment à une auto-parodie à l'insu de son plein gré (on suppose)...On est pas loin ici en effet d'un OSS117 (avec Dujardin ou pas...) tant les situations grotesques se succèdent les unes aux autres alors que l'élégant Sean très pince-sans-rire se contente de hausser les sourcils et d'afficher le petit rictus dont il a le secret (à part une joke tout de même !) . Le scénario décidément très alambiqué qui tourne autour d'un trafic de diamants à la noix se révèle à la fois poussif et souvent ridicule, à peine digne d'un épisode de série télé fatiguée, avec rebondissement bidon à la clé.On ne sait plus trop à quel degré on doit prendre cette suite d'élucubrations de l'agent double zéro (sans Nielsen et sans nos super débiles ultra mongolos d'Eric et Ramzy) et on préfère à dire vrai ne pas y penser trop fort et se concentrer sur ces filles à forte poitrine qui ne cessent de harceler le super agent de Sa Majesté...Pas trop longtemps quand même ou plutôt le moins longtemps possible, car cette stupidité semble un peu trop éternelle par son ennui et sa bouffonnerie (involontaire ou non, on ignore ce qui est le pire...)."
    },
    {
      "rating": "5",
      "text": "Overall, this isnt a bad one but it is VERY heavy on the camp and over-the-top nature of the mid half of the Bond Franchise. That being said it is a perfect lead in for the next decade of Bond films led by the former Saint, Roger Moore. https://latetothegame.blog/2019/02/14/key-movies-of-my-life-james-bond-edition-diamonds-are-forever-1971/"
    },
    {
      "rating": "0",
      "text": "This movie felt like we got the plots of three movies moulded into one. First, We deal with diamond smuggling then the country assassins who just feel painfully out of place and then we have Blofield thrown into the mix with his bonkers plot because why not? The story is already an uninteresting mess so why bother trying to make it any better.Honestly, This is right up there with the worst that the series has to offer. It makes me wish that Connery stayed away and left his Bond legacy intact rather than ruining it."
    },
    {
      "rating": "6",
      "text": "The franchise is getting more and more dumb with more \"humour\", that I dont like and action, that is outdated and unrealistic. Anyway Sean Connery is fun to watch."
    },
    {
      "rating": "8",
      "text": "Having watched 25 Bonds from Dr.No to Skyfall, I place this one at 14/25.But really, I'm placing it N°1 Austin \"Bond\" Powers.Diamonds are Forever has one element that makes it unique: a lot of Bond movies are more or less willingly comedic. Not Diamonds. This is an utter parody, in ways that you wouldn't believe if I spoiled you.I haven't laughed this hard at any Bond movie, and truly, it is the original Austin Powers.The real life story is that Sean Connery was sick of the role by 1967, and quit after You Only Live Twice. He however couldn't find a new role, and was more or less forced to return to EON for a paycheck. And it shooooooows.Connery does not even pretend to attempt to act. He looks, and very clearly is, a man on a mission: get that paycheck and get out as fast as possible. Now I don't know how EON took that attitude, and if it's the reason why this movie is a complete joke, but it produced one of the best movies of the franchise, if you admit that it's a parody.Between a main actor that didn't even want to pretend to act, stupid characters with stupid actions, those two (I imagine gay?) assassins couple that acted so oddly and pretty much killed half the planet by the movie's end, the big villain's absolutely, monstrously stupid actions, the lines, oh the silliness of the lines, the Bond girl who must the most accurate depiction of a stupid 17 year old ever, the plot that is mad even for a Bond, the action that must have the most ridiculous enemies ever (fear the horrible pipe melding robot, can you escape its 5km/h?!)...For the longest time watching this, I had doubts whether it was unwittingly terrible or self-aware.At the final battle of the movie, Bond, the villain, and the girl, are in the villain's secret lair. The girl is hanging around in a bikini. Bond steals a cassette that controls the villain's superweapon. He exchanges it with a cassette that destroys the superweapon(it's a thing). He shoves the good cassette into her panties for hiding, and goes away escorted by the villain's goons.Two minutes later, the girl comes in and proudly says \"I DID IT, I CHANGED THE CASSETTES!\" and we get to see Sean Connery, at the time on the ground on his belly like some old man that fell over, say in the most epic way:\"YOU STUPID TWIT YOU'VE RUINED EVERYTHING\"There's absolutely no way in hell they didn't know how insane that was. They knew. They knew very well they were making a completely camp parody.And I'm not even mentioning the beyond-glorious scene of the Space Vehicle that Bond randomly steals and then goes out into the desert with with its little arms flailing about.Watch this movie, watch it drunk, watch it with friends, and expect hilarity.As a Bond movie however, this is more like a 0/10."
    },
    {
      "rating": "8",
      "text": "The seventh James Bond movie and the return of Sean Connery. George Lazenby had some arguments during and after “On her Majesty’s Secret Service” with the producer and did not sign a contract for another movie. After checking out all options they rehired Sean Connery for a record salary. The movie starts with James Bond taking revenge on someone for what he did at the end of the last movie. Meanwhile several diamond smugglers are killed in a way that is to systematical to be a coincident. Also there are huge numbers of diamonds thrown on the market that flatten the prices drastically. James Bond is send on an investigation to find out what is behind this incidents. Again we got a good James Bond story. It has some good twist and a bit more humor than before. The plot is good by James Bond standards and it has an interesting climax. I also enjoyed the cast. Charles Gray is a great Blofeld (tied with Telly Savalas for me) and a remarkable actor. Mr. Wint and Mr. Kidd are a great team and won me over. They are just so enjoyable to watch. Sean Connery is as always great as he had made the role his trademark even we he did not want to be reduced to just being James Bond. After not getting much gadgets in the last movie Q can shine again. I like Qs scene in Las Vegas and I think he is never allowed to be near a Casino again for the rest of his live ;-). The other gadgets are focused on hiding and identifying identities. For the sets and locations we got an USA theme in this movie. Nothing to say against Las Vegas. Overall another good James Bond movie. Might not be my favorite but is still worth rewatching from time to time."
    },
    {
      "rating": "5",
      "text": "Connery and Hamilton are back for the crowd. the roar of cheering undermines their own voice, and visually, it is a textbook James Bond mission.Diamonds Are ForeverHamilton, after a while, is back in the game. A break that propelled into one big fumble in this installment. With very little skin in the game and passion to spiral out a thrilling thriller, Guy Hamilton, the director, who gave us one of the best chapters of James Bond, makes it look like it was a fluke. For, as far as execution is concerned the game of cat and mouse never grasps the momentum that it script demands. Our heartthrob and overly sung hero is definitely panting, but the effects are usually the aftermath, the journey that led him to this lack of energy isn't projected thoroughly to us.Resulting in, this bizarre train of event, which makes us feel like, that the makers are overselling the product and the actors, well, overacting. Also, in doing so, the hype that they build up- mind you there is also the pressure of the big banner- is something that exceeds their potential and is also probably why, in these last few chapters, the final act has turned out to be the most disappointing one. Sean Connery revisiting his character seems much more confident this time.No rocks in the drink and no bullets in the gun, he believes in old testament and the result is adorable; people are digging it. The bond girl syndrome is elevated to a more respected level- well, they are still working on that, it is a slow rickety skate- in a sense that it isn't there for glamorous event, they have got few cards hidden under those, umm, pockets; on terms of the whole gender equality notion, the franchise collapses from the first chapter itself, it is good that we can laugh about it now(!), for as far quality is concerned it didn't qualify, not even the first round, so let them say that Diamonds Are Forever."
    },
    {
      "rating": "4",
      "text": "There is no doubt about it, this film is a horrible mess. It is saved somewhat by some of the glitz and glamour, but horribly hurt by its complete lack of dedication. It's the worst type of female and male degradation and there is so little positivity and spirit in the film. It's also incompetently shot."
    },
    {
      "rating": "2",
      "text": "A miserable trainwreck of a Bond movie. Right down there with Tomorrow Never Dies, The World Is Not Enough, Die Another Day, Spectre And Licence To Kill. There isn’t much to like with this movie. The only thing it has going for it is it’s theme song. Everything else is really poor. Watch any of Sean Connery’s earlier Bond movies. This one is best off forgetten."
    },
    {
      "rating": "4",
      "text": "Directed by Guy Hamilton, produced by Harry Saltzman and Albert Broccoli and with screenplay by Richard Maibaum and Tom Mankiewicz, this is the seventh film in 007 franchise and resumes the participation of Sean Connery in the role of the"
    },
    {
      "rating": "7",
      "text": "Diamonds Are Forever for me not surpassing In the service of Her Majesty. The story is nice, so is the location, but it doesn't have the atmosphere with the snow from the previous movie. Action scenes nice too. Overall, this movie is great. In short, good. I can recommend."
    },
    {
      "rating": "3",
      "text": "Quite possibly the worst bond movie, completely waste's the potential of a great revenge sequel to OHMSS. We could've gotten something similar to Licence To Kill, which IMO, was a great movie."
    },
    {
      "rating": "6",
      "text": "Not a horrible movie, but it does feel very cheap compared to its predecessors. Connery looks very bored and doesn't bring it 100% this time, Tiffany Case is a very ditzy Bond girl making hr frustrating to watch at times. Charles Gray is an okay Blofeld, but the stunts and effects in this film are pretty cheap and laughable. It does have small moments I like, but overall just a \"meh\" movie."
    },
    {
      "rating": "10",
      "text": "James Bond is awesome!James Bond is awesome!James Bond is awesome!James Bond is awesome!James Bond is awesome!"
    },
    {
      "rating": "3",
      "text": "While Connery's Bond is still fun to watch, Diamonds wastes a great setup to make a tone deaf unfunny comedy."
    },
    {
      "rating": "6",
      "text": "Diamonds Are Forever, the seventh James Bond film, can be viewed as either one of the best or one of the worst Bond movies. Depending on how you look at it, \"Diamonds\" is the ultimate Bond film if you don't need anything more than mindless harmless amusement. However, you should steer clear of this one if you can't get past the silliness, poor editing, and the clumsily put together narrative. Although it cannot be compared to the original Bond films from the 1960s, \"Moonraker\" and \"The Man with the Golden Gun\" starring Roger Moore are not as terrible or ridiculous."
    },
    {
      "rating": "0",
      "text": "Easily the worst of the Sean Connery Bond movies, and you can easily tell that Connery had completely lost his passion for playing James Bond here as well."
    }
  ],
  "recommendations": [
    "the_man_with_the_golden_gun",
    "the_spy_who_loved_me",
    "thunderball",
    "casino_royale",
    "tomorrow_never_dies",
    "skyfall",
    "you_only_live_twice",
    "the_world_is_not_enough",
    "no_time_to_die",
    "die_another_day",
    "goldeneye",
    "octopussy",
    "spectre",
    "from_russia_with_love",
    "killer_elite",
    "for_your_eyes_only",
    "xxx",
    "quantum_of_solace",
    "the_running_man",
    "mission_impossible_rogue_nation",
    "iron_man",
    "the_legend_of_zorro",
    "jack_reacher_never_go_back",
    "the_marksman",
    "jack_ryan_shadow_recruit"
  ]
}