{"id": 3063, "title": "Diary of a Wimpy Kid: Dog Days", "starring": ["Zachary Gordon", "Steve Zahn"], "runtime": 94, "genre": ["Comedy", "Family"], "description": "It's summertime, and Greg Heffley is looking forward to playing video games and spending time with his friends. However, Greg's dad has other plans: He's decided that some father-son bonding time is in order. Desperate to prevent his dad from ruining summer vacation, Greg pretends he has a job at a ritzy country club. But Greg's plan backfires, leaving him in the middle of embarrassing mishaps and a camping trip gone wrong.", "releaseYear": "2012", "mpaaRating": "PG", "imageUrl": "https://image.tmdb.org/t/p/w500/7pTvjELxw0f0E6sUPGtPEl4WD0S.jpg", "categories": {"plot": 8.5, "acting": 7.833333333333333, "ending": 8.0, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 8.0, "funny": 8.25, "action": 5.0}, "reviews": [{"rating": "9", "text": "The best of the Wimpy Kid movies. I was smiling and laughing throughout the entire movie. It's hilarious and brings several life lessons for kids to the table. The cast, as always, did a fantastic job. If you enjoyed the other Diary of a Wimpy Kid movies you'll enjoy this. Hilarious and one of the best movies of the year."}, {"rating": "8", "text": "At first I didn't like the Wimpy Kid films at all and when I found out about a third film, I laughed and didn't expect anything from it. But I then watched the 2nd Film on TV and was gripped to the Holly/Greg storyline. This caused me to go and watch the 3rd Film, Dog Days, expecting a cheesy, bad film. However, this film isn't all too bad. It's a light hearted comedy, with some good jokes, some bad jokes, and some copied jokes (There's a scene completely copied off a Mr Bean episode!). But it wasn't too bad. The Holly/Greg story that I was hooked into remained and, although it wasn't completely resolved, they ended the film and the story with finesse. Although I warn you, the opening and ending bits with human Greg standing in front of a cartoon background is the cheesiest thing ever, but you can forget that. Overall It's not the worst film of the year *Cough* Abe Lincoln Vampire Hunter *Cough* but if you are looking for a comedy with great constant gags, It's not the film for you."}, {"rating": "8", "text": "By far it is the best of the \"Wimpy Kid\" movie trilogy. It is at some parts hilarious, but others were very weak and boring. But that is usually what I expect from these movies. You have to give the comedic style some time. Not to spoil, but the ending is hilarious. I was also really scared to death (honestly, during a PG movie!) during one part."}, {"rating": "3", "text": "i found this film terrible . you have a dad who is retarded a mom who is overprotected and brother who is cool but messes with your head . wow this trilogy is a waste of time"}, {"rating": "8", "text": "The Movie is the best than the last two movies.The Movie still have those problems like it's predecessors but  still manages to have the word \"Fun\" in it."}, {"rating": "9", "text": "This movie was awesome! The best of the three Diary of a Wimpy Kid movies. The storyline was good. The characters were great. There were some hilarious parts. The acting was well done. Diary of a Wimpy Kid: Dog Days is a great movie. If you hate Wimpy Kid, you are silly as JB. I'd recommend you watch it."}, {"rating": "10", "text": "The best of the three! Dog Days delivers much more of a sentimental lesson but still pushing in the vast amount of fun and awesomeness the series needs."}, {"rating": "10", "text": "the best of the three. was so funny and greg is still very good. better than the dark knihght rises big time and its the best of 2012. good graphics and good acting. this is a graet movie"}, {"rating": "1", "text": "Honestly This Movie In My Opinion Is Trash... Boring And Uncreative..\rOne Of The Worst Of 2012"}, {"rating": "10", "text": "This trilogy is great. In this film the characters are awesome, the story and themes are done well, and it's also very funny."}, {"rating": "9", "text": "If this really is the end of this film franchise, then I say it ended on a pretty high note. Its all the same wacky and witty humor of the first 2, but this time its during the summer. You see Greg getting in  embarrasing and troublesome situations a lot more this time around. Yes, this wimpy kid wants to play video games all summer, but his dad tries to change that. That is one big plot point. His relationship with his dad. Anyways, it is not the best of the series (Rodrick Rules is) but it is one heck of a fun conclusion."}, {"rating": "9", "text": "Has to be the best out of the 3! Hilarious, and when you see the bond between Greg and Holly starting to grow, it feels great! Especially loved the end - no spoilers here. Want to watch it? Go ahead! It will have you in stitches. Excellent cast too!"}, {"rating": "6", "text": "The three Wimpy Kid films don't all manage to shock or put true emotions in them, but still manages a handful of laughs and has plot that is true to its book franchise. With family in mind, the film displays once again a humorous typical family facing troubles and going through another adventure in every day life. With this in find, kids will love these scenarios, which adults a little bored, but interested at times."}, {"rating": "8", "text": "I still remember being in shock when I heard that the \"Diary of a Wimpy Kid\" film series was skipping \"The Last Straw\" and just directly adapting \"Dog Days.\" That said, I was still interested in seeing the film, considering that it was released while I was still a gigantic fan of the books. While I'm not sure if it's better or worse than \"Rodrick Rules,\" I can safely say \"Diary of a Wimpy Kid: Dog Days\" is still an entertaining romp. It's often quite funny, it stays relatively true to the book, and it's pretty well-acted. It probably won't win the series any new fans, but for the already-converted, it's a fun little diversion and a good time at the movies."}, {"rating": "5", "text": "This movie is not really like \"dog days\", it's more like \"the last straw\" and \"dog days\" mixed together. Anyway the acting is cheesy, some of the things in the movie don't happen in the book, and the tattoo. More about the tattoo, it didn't even stay on Rodrick's body when he went in the pool, it ran. You could clearly tell it was make up, cheap make up."}, {"rating": "4", "text": "Are we like getting more installments or that's just it? The books have way more than Dog Days and if you want money, then take your time and make a good Wimpy Kid movie. Say hello to Dog Days, wimpy kids."}, {"rating": "7", "text": "While i do think its wise to end the series at this point, it still remains a solid movie that ends the series with a well deserved ending, while still remaing relatable."}, {"rating": "9", "text": "Yea, the film continue being some kind of pointless as the originals, that tries to be a \"good friend\" of the bestsellers. Anyway, Diary of a wimpy kid III: Dog days is truly funny, full of great stunts, with enjoyable story-telling and correct following of the original book, despite the wrong name and some simple cliches."}, {"rating": "5", "text": "Diary of a Wimpy Kid: Dog Days is the worst of the three movies and it still is mediocre and easy forgettable but it is harmless and fine for kids to watch."}, {"rating": "8", "text": "This is the best movie in the series. The characters are great and have improved. The story will make you laugh a lot, and I can still watch it multiple times."}, {"rating": "0", "text": "Ooh just the same thing constantly! I don't want to repeat everything I said about the other two but the movie is even worse! The only thing that changed is the location of the movie."}, {"rating": "7", "text": "The plot isn't as good as the first two movies but it surely was the funniest of the franchise"}, {"rating": "8", "text": "(Warning: Nostalgia blind)Great way to end it off. Combining the 3rd and 4th books was a good call."}, {"rating": "6", "text": "This movie starts strong, but unfortunately, I lost all interest when Greg gets taken out of the Jefferson house, as he called 911, which led to Mr.Jefferson almost getting arrested because he was holding a knife in hand. It's a long story.Bottom line, this movie is heavily nostalgic, as I adored watching this movie in the basement as a kid. It has an awesome soundtrack, memorable characters, and an overall magical experience.Therefore, I recommend that you watch \"Diary of a Wimpy Kid: Dog Days\" because you're sure as hell gonna enjoy it as much as I did."}], "recommendations": ["the_game_plan", "chicken_little", "the_spongebob_movie_sponge_out_of_water", "ice_age_dawn_of_the_dinosaurs", "the_croods_a_new_age", "spy_kids_all_the_time_in_the_world", "garfield_a_tail_of_two_kitties", "the_boss_baby_family_business", "alvin_and_the_chipmunks", "the_angry_birds_movie", "night_at_the_museum_battle_of_the_smithsonian", "bedtime_stories", "sonic_the_hedgehog", "herbie_fully_loaded", "alvin_and_the_chipmunks_the_squeakquel", "hotel_transylvania_2", "the_spongebob_squarepants_movie", "marmaduke", "teen_titans_go_to_the_movies", "minions", "alvin_and_the_chipmunks_chipwrecked", "the_babysitter_killer_queen", "free_birds", "ice_age_continental_drift", "night_at_the_museum_secret_of_the_tomb"]}