{"id": 4320, "title": "Diary of a Wimpy Kid: The Long Haul", "starring": ["Jason Ian Drucker", "Alicia Silverstone"], "runtime": 91, "genre": ["Comedy", "Family"], "description": "A Heffley family road trip to attend Meemaw's 90th birthday party goes hilariously off course thanks to Greg's newest scheme to get to a video gaming convention.", "releaseYear": "2017", "mpaaRating": "PG", "imageUrl": "https://image.tmdb.org/t/p/w500/ivRrDm5PlOndteVZgjhQenzKU5t.jpg", "categories": {"plot": 3.1, "acting": 2.8333333333333335, "ending": 5.0, "soundtrack": 0.0, "cinematography": 1.0, "familyFriendly": 5.444444444444445, "funny": 4.08, "action": 0.0}, "reviews": [{"rating": "6", "text": "Not the best Diary of a Wimpy Kid movie ever, but it was very fun to watch. The story wasn't amazing either, but it still worked. The acting also improved through the entire thing. The jokes were very gross at some points, but still funny! I would say only watch it if you are a fan."}, {"rating": "10", "text": "they got rid of the pig. that's all. i wanted them to stay with the pig since i love pigs but the family is so dumb they got ridden of the pig.edit: nevermind, manny got the pig back. this pig is so perfect"}, {"rating": "0", "text": "This is one of the worst movies I have seen, and is one of the worst 'comedy' films I have seen. I loved the previous Diary of A Wimpy Kid movies because of great cast members, funny and realistic situations, and charm. In this movie, they have changed all of the actors that made the original films good. And the new ones were awful. Rodrick, who in the original films looked like the character he was designed to be, a rebellious teenager who deep down has sympathy, was replaced by a new Rodrick who looked like an emo Asian girl. The casting sucked. The comedy was very off with bad timing and stupid situations. The film attempted at a cheap gag when Greg picked up a diaper and was called diaper hands. Oh wow very hysterical. Rodrick was brain dead in this film, and Greg looked like a 6 year old. This is nothing more than a knockoff, and does not deserve to be in the Diary of A Wimpy Kid series."}, {"rating": "4", "text": "Remember when we all thought the entire film franchise of Diary of a Wimpy Kid was over? Then they managed to make another one just for easy benefit from your wallets. If you're prepared to see this movie, please skip on this one entirely or wait for it on rental. If you have kids with you, they will have to wait for another great film suitable for their age."}, {"rating": "1", "text": "Don't blame me, it's Sunday, but yeah, this is the worst movie of the whole franchise and without the original cast, the new ones completely suck, kid actors must have grace and charisma and these have none of that."}, {"rating": "5", "text": "The commercials made it look good. When I saw it, though, it was not as good as imagined. The acting... well, it can be lackluster. They also forgot to put in a huge part from the book into this movie. Well, in the end, it's a \"meh\" kind of film."}, {"rating": "4", "text": "Yes, this movie's bad, but at the very least, it was bad in a campy way. The story is awfully predictable, but shows promise. There's new additions to the story that only exist to be hip with the kids, but half of the movie is pretty faithful to the book. The CG in the film is incredibly fake, but the 2D animation is actually really good up to the point it's some of the most faithful animation I've ever seen. But then there's the cast, the biggest cause of controversy. But in the execution, they're actually pretty good actors. I will say that Rodrick's actor does a pretty bad job, but the others give out a fairly charismatic performance. Also, I'll give props to Tom Everett Scott that he looks fairly similar to Steve Zahn. Even though it's a mediocre road comedy, it's Oscar worthy compared to the other bad films this year."}, {"rating": "3", "text": "If an entirely new cast of under-performing leads doesn't say enough about this abomination, than The Long Haul's grueling attempts at sub-par humor will make any fan of the series leave the theater immediately."}, {"rating": "1", "text": "As someone that did grew up with the books and a bit of the movies, I was expecting garbage, and I got garbage. While the older films were not high art, they were not as pandering, padded, stupid, nor disgusting as this movie. It's basically every terrible kids movie made in the 90s and 2000s, filled with crass toilet humor that thinks that being gross is somehow funny (which is not), filler that don't do anything but distract from the main story, and characters that are underdeveloped or just plain unlikable. If anything, this movie is a sad reminder that movie studios will still beat a dead horse and Batman and Robin really did a number on Alicia Silverstone's career."}, {"rating": "0", "text": "It's awful. Could be the worst I have seen this year. It's Poorly acted, unfunny, lazy, and cringe-worthy. My family and I were in awe with the laziness put into this motion picture. It's like none of the crew working for this even tried. We felt like leaving the theater. These make the original films look like their comedic gold. Do not watch this disappointing mess of film."}, {"rating": "2", "text": "Ugghh... Now i'd expect more from 20th Century Fox, you could've made a great film but come on guys another Diary of a Wimpy Kid Reboot? I'm not saying the old Diary of a Wimpy Kid movies were good, but they were at least decent!Diary of a Wimpy Kid: The Long Haul has the worst green screen effects, camera work, and acting I've ever seen in a cinema. Period.Now I could go on for hours of how this movie is just plain out bad. But, I don't want to waste my time doing it. :)- HateReviews"}, {"rating": "5", "text": "The Diary of a Wimpy Kid is back with a fourth installment, and despite not being a reboot it has an entirely new cast. I can understand recasting Greg, Rowley, and Manny. The actors who originally played them are simply too old to play these characters believably despite being so well-loved in their roles. But Roderick? The parents? Why recast them? My best guess is that it was simply cheaper to hire them. Still, it's not like it helped the budget much. From what I've read it cost just as much to make this one as it did to make \"Dog Days.\" The recasting wouldn't be so much of a problem if the new cast lived up to the old one. Unfortunately, they don't. They aren't as charming or likable, and they certainly don't have the same acting ability. This is especially noticeable in Jason Drucker and Charlie Wright, our new Greg and Roderick respectively. You know, the two main characters. They're about as amateur as amateur can get. Wright in particular.But let's be honest everybody, the issue with this movie isn't that there are a bunch of new faces playing old characters. It's that the material isn't as good. This is very much a Wimpy Kid movie. It's got the same visual style and it's all about watching Greg scheme and make things worse. It's just nowhere near as funny as what came before it. The majority of the one-liners and play on words fall flat on their face. There are humorous bigger gags that are pretty funny near the end of the movie. That's when \"The Long Haul\" starts focusing less on the plot and instead on just screwing with the Heffleys as much as possible. So it's not like there aren't some laughs to be found. Kids in particular are likely going to have a lot of fun with this movie. Parents on the other hand are likely going to find themselves annoyed by the cheapness of the humor and unnecessary gross out gags.As for the plot itself it's almost your typical Wimpy Kid setup. Greg concocts some scheme that naturally gets in the way of his parents plans which leads to a lot of crazy hijinks. Only this time around things are infused with a lot of cringe-inducing references to YouTube and the \"let's play\"-ers out there. That's right, the movie is trying way too hard to fit in with the kids. To be hip and cool. The writers know what's going on with the kids today. Always gotta be connected and stuff. Previous Wimpy Kid movies have kind of tied this to some kind of morals where Greg ultimately ends up learning something here. That doesn't really happen here. The movie sort of forgets to include the part where he learns his lesson in favor of all out chaos in the final act. I'm not complaining too much though because that's when the movie starts being funny.In closing, it feels like no one was really trying with this one. A lazy cash-in on the name that's sure to disappoint quite a few fans. The casting is weaker, the writing is lackluster, and too often is it devoid of laughs. It's not a complete dud as the youngest of viewers will likely find themselves amused with it. On the whole though this is a really bad way to bring back the Wimpy Kid brand and may just have ensured that the series stays dead this time around on the big screen.5.2/10"}, {"rating": "10", "text": "I really enjoyed this movie.When Greg touches the diaper, random people post videos of him touching the diaper and he becomes a viral video called \"Diaper Hands\".One thing I liked about this movie was the pig that the little brother, Manny, won from the carnival.I also thought it was funny when Greg went crazy about touching a diaper.The funniest thing was when the little kid spoke spanish and got his pig back."}, {"rating": "1", "text": "The comedy is better than the others but still has the same problems of the last 3 horrible movies. Now the location has changed again but nothing else as changed as usual."}, {"rating": "0", "text": "The best word to describe Diary of a Wimpy Kid: The Long Haul is stupid. It's just flat-out stupid. Not even funny stupid like Dumb & Dumber, no, it's just unbearably stupid. I genuinely question how anyone thought this was a good idea. This film is so bad and 5 years too late, that even the original cast got too old, forcing the studio to replace everyone and even parade that fact in their marketing.Wow. Just... wow."}, {"rating": "2", "text": "The new cast just makes this movie terrible than it is. Greg looks like he's lesbian; the book is much better than this movie. So just go read that instead of watching the film."}, {"rating": "0", "text": "Roderick didn't drink the piss. They refused to complete his character arc. Worst movie 0/10"}, {"rating": "1", "text": "After watching this crap, I wanted to go blind. Not only did I fall down the steps in the theater after the film ended, I promised myself that I will go blind, but I didn't do that luckily.The new cast is DISGRACEFUL! Rodrick is hands down the worst, Devon Bostick gave a lot of energy and creativity to Rodrick and this new guy kills enjoyment. NO good humor at all. Also, WHY IS THIS BASED ON THE 9TH BOOK WHEN THERE WAS BOOKS 5-8 TO GO THROUGH! I guess they had to make an indirect sequel since Greg is now 8 years old instead of 13.The filmmakers should have made one more film back in 2013, basing the story around The Ugly Truth, with some elements from Cabin Fever. After all, if the cast is becoming older, they should've been in films with more maturity.Hopefully, there will either be no more Wimpy Kid films, or they'll bring back the original cast for a more mature film. In the meantime people, take this film and toss it in the furnace."}, {"rating": "8", "text": "For all her “Clueless” comedy cred, Silverstone just might be at her best conveying a mother’s special knack for witheringly guilting her very own boys."}, {"rating": "8", "text": "For all her “Clueless” comedy cred, Silverstone just might be at her best conveying a mother’s special knack for witheringly guilting her very own boys."}, {"rating": "8", "text": "For all her “Clueless” comedy cred, Silverstone just might be at her best conveying a mother’s special knack for witheringly guilting her very own boys."}, {"rating": "8", "text": "For all her “Clueless” comedy cred, Silverstone just might be at her best conveying a mother’s special knack for witheringly guilting her very own boys."}, {"rating": "8", "text": "For all her “Clueless” comedy cred, Silverstone just might be at her best conveying a mother’s special knack for witheringly guilting her very own boys."}, {"rating": "9", "text": "This movie was way funnier than the reviews said. There's a lot of gross-out humor but it's all harmless fun that made this 42yr old laugh. I like the old Wimpy Kids but the new cast do a great job. I definitely recommend it for families to watch together as it has a positive message."}, {"rating": "5", "text": "Wimpy Kid in a National Lampoon's Vacation!I'm not the first one to say this, but this film is in the wrong franchise. Of course it was different than previous ones. It is a road movie, though all it reminded me was 'National Lampoon's Vaction'. It has been five years since the last film in the 'Wimpy Kid' series. I understand the reason for recasting, but still I expected to be what it is famous for.The family decides to take a road trip, instead of flying to attend the grandma's 90th birthday. The mother wants it in an old way. That means no technology throughout the trip. But the kids are so addictive of their phones and so her husband. How they make it, and other troubles that they face during a long journey was told with some fun.Yeah, I did not say the film isn't any fun. You would enjoy it, as a time pass film, but the laugh is hard to come by. Every bit of the film is one way or other, resembles other films. The actors were good, the direction was good, but not the writing. Despite all these flaws, the kids might enjoy it better than the adults. Just an average film, but not the worst film as others saying.5/10"}, {"rating": "1", "text": "I couldn't care less about the cast change, honestly it's probably an improvement. This movie is a painfully idiotic and unnecessary diversion for the lowest common denominator of viewers."}, {"rating": "1", "text": "I couldn't care less about the cast change, honestly it's probably an improvement. This movie is a painfully idiotic and unnecessary diversion for the lowest common denominator of viewers."}, {"rating": "0", "text": "greg goes poop because he pees in bottle let me tell you from the beginning greg goes on road trip with fam to go to convention with digby and hot babes cause that how digby do it also digby is a pedophile he goes with greg backstage and he kisses greg but greg does not like that and he farts on him and then they go on into bathroom and then it uncomfortable and it scary but then greg mom and dad go brr with car and then greg mud bends and then he kills everyone because he felt like it"}, {"rating": "0", "text": "Why.Everyone's already said what's wrong with this, but I'll say it again.Terrible actors. Terrible script. Over Reliance on outdated pop-culture.This is just sad, man."}, {"rating": "0", "text": "Even though the books are just sublime, this film, unfortunately, has to be the worst I've ever seen."}, {"rating": "0", "text": "The game begins in Spiral Mountain, the home of the Bear and Bird, when Gruntilda – a witch with a penchant for a rhyming couplet – kidnaps Banjo’s sister Tooty in order to steal her ‘beauty’. Shocked and outraged, the furry and feathered duo set out to retrieve Tooty and teach Grunty a good lesson in the process. To do this they must battle through Grunty’s lair, fighting her countless minions, exploring many strange and enchanting levels, and destroying each of her various musically-sealed doors – the favoured defence mechanism of old hags, apparently.Those doors gate progress through the lair overworld, and breaking those seals involves collecting musical notes scattered throughout the game’s nine levels — 100 on each. Of course, they can’t simply wander around collecting quavers; the devious Gruntilda has made sure that their adventure is packed with many obstacles and perils. The duo must first unlock those levels, each one sealed by that other renowned resource witches commonly use, jigsaw pieces (we’re not making this up, honest). Along with the notes, you also have to gather the 10 jigsaw pieces – affectionately known as ‘Jiggys’ – which are used to fill in picture and unlock news worlds, and so on.The levels are incredibly charming, and they are all exceptionally diverse and well-designed; you’ll go from a mountain range, to a beach, swamp, desert, winter wonderland, cemetery, ship, forest, before partaking (famously) in a life-or-death quiz. On paper, it's all standard stuff, but it's shot through with a wondrous fairytale atmosphere, aided by an incredible soundtrack from Grant Kirkhope. The music beautifully mixes jaunty comedy with wonder and some Brothers Grimm-style darkness, although the cheeky humour of the script and the overwhelming colour of the world keeps this resolutely family-friendly."}, {"rating": "7", "text": "idk why people hated this so much. it is my second favorite doawk movie behind rodrick rules. ad least it as better then dog days. dog days was garbage. at least this had ONE PLOT! (unlike dog days) it was actually good to say the least! everyone only hates this movie because their simping over the old cast... CANT GET ROBBIN WILLIAMS BACK CAN YOU!?"}, {"rating": "3", "text": "I've tried to give a movie a chance to see if It would be a good movie for me despite i was aware of the negative reception, i've shouldn't have do that. This movie it's incredible mean-spirted, frustranting and unfunny to watch, the only good things for me was the pig's fart scene and the various videogames references. Hands down the worst diary of a Wimpy kid movie in the series"}], "recommendations": ["the_smurfs", "alvin_and_the_chipmunks_chipwrecked", "spy_kids_all_the_time_in_the_world", "the_boss_baby_family_business", "home_sweet_home_alone", "yogi_bear", "zookeeper", "alvin_and_the_chipmunks_the_squeakquel", "the_croods_a_new_age", "minions", "neighbors_2_sorority_rising", "coming_2_america", "night_at_the_museum", "chicken_little", "cloudy_with_a_chance_of_meatballs", "alvin_and_the_chipmunks_the_road_chip", "marmaduke", "space_jam_a_new_legacy", "kangaroo_jack", "hotel_transylvania_2", "night_at_the_museum_battle_of_the_smithsonian", "goosebumps", "ice_age_dawn_of_the_dinosaurs", "the_game_plan", "free_birds"]}