{
  "id": 2294,
  "title": "Die Hard",
  "starring": [
    "Bruce Willis",
    "Alan Rickman"
  ],
  "runtime": 131,
  "genre": [
    "Action",
    "Thriller"
  ],
  "description": "NYPD cop John McClane's plan to reconcile with his estranged wife is thrown for a serious loop when, minutes after he arrives at her office, the entire building is overtaken by a group of terrorists. With little help from the LAPD, wisecracking McClane sets out to single-handedly rescue the hostages and bring the bad guys down.",
  "releaseYear": "1988",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/yFihWxQcmqcaBR31QM6Y8gT6aYV.jpg",
  "categories": {
    "plot": 9.434782608695652,
    "acting": 8.454545454545455,
    "ending": 9.0,
    "soundtrack": 10.0,
    "cinematography": 10.0,
    "familyFriendly": 3.0,
    "funny": 9.181818181818182,
    "action": 8.657534246575343
  },
  "reviews": [
    {
      "rating": "9",
      "text": "Not only one of the best action films of all time but also one of the best Christmas films of all times.  I love that is also features Reginald VelJohnson from 'Family Matters' fame."
    },
    {
      "rating": "7",
      "text": "Die Hard is as high tech, rock hard and souped up as an action film can be, a suspenser [based on the novel Nothing Lasts Forever by Roderick Thorp] pitting a lone wolf cop against a group of terrorists that has taken over a highrise office tower.\r Bruce Willis plays John McClane, an overworked New York policeman who flies into Los Angeles at Christmas to visit his two daughters and estranged wife Holly (Bonnie Bedelia).\r Planning a rather different holiday agenda are the terrorists led by Hans Gruber (Alan Rickman). The dastardly dozen invade the plush 30th floor offices of Nakatomi Corp during its Christmas party, and hold the employees hostage as a computer whiz cracks a code that will put the mainly German bad boys in possession of $600 million in negotiable bonds.\r Slipping out of the party in the nick of time with nothing but his handgun, Willis is the fly in the ointment of the criminals’ plans, picking off one, then two more of the scouts sent on pest control missions.\r Beefed up considerably for his role, Willis is amiable enough in the opening stretch, but overdoes the grimacing and heavy emoting later on. The cooler and more humorous he is the better. Rickman has a giddy good time but sometimes goes over the top as the henchman."
    },
    {
      "rating": "5",
      "text": "A very shocking action movie, but not really much more. The acting is strange."
    },
    {
      "rating": "8",
      "text": "Certainly a classic action film. \"Die Hard\" has a very charismatic hero and a very likeable villain, and has fantastic action scenes that still live up to its standards today."
    },
    {
      "rating": "9",
      "text": "My score 100Metascore / User score 70 / 57Tomatometer / Audience score 93 / 94IMDB 82(82.7)"
    },
    {
      "rating": "9",
      "text": "The best of the four Die Hards. Bruce Willis as John McClain was great. /the action and humor made this movie great and the best Die Hard."
    },
    {
      "rating": "10",
      "text": "This movie is absolutely awesome. Only idiots will deny it. If you didnt knew when this movie was made then you could have thought it was made in 2000 and up since its so awesome made."
    },
    {
      "rating": "10",
      "text": "This is the perfect action movie. Bruce Willis is the witty action hero every movie wishes it had and Alan Rickman the classy badass villain every movie wishes it had."
    },
    {
      "rating": "10",
      "text": "This movie is great. Bruce Willis plays an amazing character in this one. He's very witty and funny. There are so many ups to this movie. I don't want to spoil it so I will just say get the DVD and watch it pronto. I am now going to watch the rest of the films in the series and waiting for the newest installment which comes out next year."
    },
    {
      "rating": "7",
      "text": "Very good action film with great acting and good humour. Very entertaining."
    },
    {
      "rating": "8",
      "text": "Many critics have noted over the years that 'Die Hard' is one of the greatest action movies of all time. I would be partial to that sentiment to a certain degree. It isn't one of the best films ever made but it is top of its class in its respective genre, which is good enough for me. Bruce Willis is a terrific hero but It's Hans Gruber (played by Alan Rickman) who is the standout character of the flick. He's simply everything you ever look for in an evil villain - and the accent only helps. If you're looking for a fantastic popcorn feature to enjoy then look no further."
    },
    {
      "rating": "8",
      "text": "In spirit, this is the simple story of a man who saves Christmas; a kind of Santa Claus Conquers the Martians scenario, in which the greedy German terrorists are defeated by the noble and just bullets of Bruce Willis' MP5 - delivering the meaning of sharing and caring right into their heads. Of course, trying to define Die Hard as nothing more than a hollow-day (!) movie would be doing it a great disservice. The characterisation of both McLane and Gruber (or Grinch - a coincidence? You decide) is done superbly by their respective actors. They draw you in with their personalities so well, that you find yourself cheering both of them on, just to see them continue to snap at each other. It's like a bizarro buddy-cop routine that took the 'good cop, bad cop' play a little too seriously. It's not incidental that the characters themselves often refer to cowboys and Westerns - this is a veritable wild-west duel, taken at a number of vertical paces rather than a standard back-to-back reflex test. That being said, however, some of the best moments are when McLane is just talking to himself, cracking wise while in the middle of a seemingly impossible situation. You don't have to convince anyone that you're a badass when you've just jumped off an exploding rooftop, Roy. You could try and make a case for the ending being cheesy and unnecessarily joyous, or that there are many implausible moments, but that would just be ill-spirited pedantry. This is action at its finest, and you better take what Mr. McTiernan gives you. There's no CGI or giant robots flying around - just good old-fashioned action, and it quickly becomes very obvious that films these days are just plain old doing it wrong. So sit back and plug in for two hours; you'll be yippie-kai-yaying in no time. Written for: www.webbinghaus.tumblr.com"
    },
    {
      "rating": "10",
      "text": "Simply one of the greatest action movies of all time -- if not the greatest -- and an absolute masterpiece of a film in nearly every facet overall. So often action movies are considered the filth of filmdom, containing silly plotting, thin character work, and juvenile thrills that appeal to the most basic, reptilian parts of our brains. But, I say again, let it be known that John McTiernan's \"Die Hard\" is not only the quintessential action movie, but an absolutely, undeniably well-made and brilliant film altogether. The plotting is exquisitely done, featuring numerous plot threads that are well-thought-out, revolutionary to the genre, and -- most of all -- smile inducing to the umpteenth degree. The characters within these plots are also unquestionably fascinating, with personalities that offer so much to the stakes and the situation at hand. And the action is thrilling, yes, but also terrifying. There's so much of this movie where you're simply convinced something has to go wrong for John McClane, but you also feel that you can't help but watch and see what happens. It's like watching a double-digit run rally in the bottom of the ninth to tie and eventually win the game -- you can't believe you're seeing it happen, but you feel blessed for being there to witness it. \"Die Hard\" is the pinnacle of action movie filmmaking and one of the best motion pictures that the medium has had to offer us."
    },
    {
      "rating": "8",
      "text": "Die Hard is popcorn entertainment at its finest with strong performances all around (including an iconic portrayal of Hans Gruber by Alan Rickman), witty dialogue, and terrific action sequences."
    },
    {
      "rating": "10",
      "text": "When John McClane is on the edge, it's entertaining for fans to enjoy  seeing  their cute up hero  not give up also enjoying every word McClane says. The film has to the best villain in recent memory a hero can relate to, screenwriters Jeb Stuart and  Steven E. DeSouza do a pretty good  job writing kick ass dialogue and creating intense scenes and a suspenseful story that's it's  dialogue that crackles with wit. Director John McTiernan's directing was equally impressive it's impressive that he knows what he's doing behind the camera. Bruce Willis as John McClane was epic, he brings fantastic charisma to his character, he has a wildly epic sense of humor as McClane. Alan Rickman as the villain was cool. Grade A+"
    },
    {
      "rating": "10",
      "text": "Die Hard presents the happy marriage of a summer blockbuster (where you really see the budget on the screen), excellent music/sound, memorable cast (who deliver superb performances) and superior action choreography delivering genuine movie magic. Like most of the film making ingredients used to make Die Hard the cinematography punches above its weight adding superior artistic merit to what could've easily turned out to be something more average. Tension (which kicks you in the face early on) builds nicely throughout the film. The story is punctuated by its memorable characters in particular Hans Gruber portrayed excellently by Alan Rickman. Willis establishes his action chops here and his movie career rose to stratospheric heights immediately after this. Lost count of the number of times I have seen Die Hard...Memorable cinematic shots stay with me long after watching this like the fall at the end. A classic action thriller that still holds its own."
    },
    {
      "rating": "7",
      "text": "Die Hard is a classic. It's full of cheesy one liners, it's not very subtle, it's cliché and it doesn't even bother trying to be believable. If you like mindless action movies, Die Hard is perfect for you."
    },
    {
      "rating": "10",
      "text": "The other kind of Christmas movie, Bruce Willis / Alan Rickman signature role, a classic and the beginning of a long running franchise. Actually it is based on a book named “Nothing lasts Forever” by Roderick Thorp. The book however is at least unknown in my country and I was as much surprised about it being a book adaptation as everyone else I asked about. What I read about lead me to the conclusion that they improved the story as the book had a downer ending. The story follows detective John McClane who travels to Los Angeles on Christmas Eve in hope to reconcile with his wife Holly. She is on a party held by her employer the Nakatomi Corporation in their tower building on their Nakatomi Plaza. Unbeknownst to them a group of armed men led by Hans Gruber are targeting the vaults of the building. This is the set up for the story. The story itself is well written, intense, thrilling and enjoyable. I especially like that the villain Hans Gruber is not a moron. He is clever and adapts his plans perfectly to the situation. A very hard to overcome antagonist for John McClane. Also John McClane is not depicted as standard unharmable action hero and this makes the movie more special. He is neither perfect nor invulnerable or flawless and this was refreshing. I clearly see how this become a cult classic. The actors are the other thing that made the movie so good. Lets start with Bruce Willis as John McClane. It is his first mayor role in a big movie and became as much his signature role as much as breakthrough (as action star). He fully delivers his role and character. However Alan Rickman as Hans Gruber is even better. Only a few villains left such an impact. He is routinely high up on top movie villains list of all times. An absolute flawless performances or so close I can not see a difference. These two work well. The rest of the cast also delivers and I want to praise Reginald VelJohnson, Bonnie Belinda and Alexander Godunov for their roles. Visually the movie is awesome too. Be it the sets, stunts and action scenes. Everyting is fitting. Also there are many memorable scenes and everyone knows the phrase “Yippee Ki Yay”. The writing and dialogues are also well done for an action movie so I should praise of cause director John McTiernan and the two writers Jeb Staurd and Steven de Souza. The rest is history. It became a box office success, elevate both Willis and Rickman and became a cult classic atop on a different kind of Christmas movie. Overall this is a must see classic and I think this should be the final sentence in my review."
    },
    {
      "rating": "10",
      "text": "Still one of the reigning action movies that all others movies of the genre aspire to be. This is the quintessential action movie. Skillfully directed, greatly paced, witty, and it brought us one of the most iconic action stars in John McClane."
    },
    {
      "rating": "10",
      "text": "\"Now I have a machine gun. Ho ho ho.\"Christmas is the time for love, peace, forgiveness, and sharing. It's also the time where a man in a white vest guns down at terrorists at the Nakatomi Plaza, with no shoes on.Die Hard is one of the best Christmas movies ever.Merry Christmas everyone."
    },
    {
      "rating": "9",
      "text": "A clever, thrilling and well-acted picture that bless John McTiernan and Bruce Willis' prestigious filmography that cannot be overcame by any other holiday action picture"
    },
    {
      "rating": "9",
      "text": "Die Hard is a really cool action movie, not sure why it has such low user ratings. Bruce Willis as the lead is great, and the rest of the casting and performances are also good. The action is entertaining, the comedy is pretty good, and the ending overall is pretty satisfying for what the story set out to be. I would definitely recommend this movie for anyone into action flicks."
    },
    {
      "rating": "9",
      "text": "Die Hard is an absolute success.With magnificent Bruce Willis and Alan Rickman, it stands as one of the best action movies of the 80s and the history of cinematography."
    },
    {
      "rating": "7",
      "text": "This film began a remarkable action movie franchise that runs around the detective John McClane of the New York Police Department. In this film, he will try to save the life of a group of hostages held captive in a corporate skyscraper of Los Angeles. Directed by John McTiernan, the film has a script of Jeb Stuart and Steven E. de Souza. Bruce Willis embodies the leading role. The film was nominated for four Oscars (Best Sound, Best Editing, Best Sound Effects, Best Visual Effects).At first glance, this film does not look like anything special. Another eighties action movie, full of explosions, police cars made in pieces and bloodthirsty killers facing a single man, full of noble intentions. However, this film has something different: in a decade full of bullet proof heroes, this hero does not act (or looks) as something indestructible. He hurts himself, complains all the time and looks like a guy facing a situation beyond his control. So, its not difficult for the public to chear McClane, making Willis great performance the big advantage of the film.Everything else followed, more or less, the pattern of the decade for action: stunning sets, special, visual and sound effects made with great care and regular performances from the rest of the cast (the interpretation of Alan Rickman, then still little known by non- British public, deserves a positive note of attention). This is an action film that captivates some audiences more adverse to this kind of movies, which proved to be the key to its success."
    },
    {
      "rating": "10",
      "text": "What is wrong with people giving to one of the most amazing classic action films of all time so many negative score? This movie was a masterpiece, since many movies that tries to take stories from books kinda fails most of the time, but this just did a perfect job, Hats off to John Mctiernan for this amazing film."
    },
    {
      "rating": "7",
      "text": "It's the start of all great action films, period. It's so good because it has a vulnerable hero, so you never know whats going to happen."
    },
    {
      "rating": "6",
      "text": "The ultimate Bruce Willis action-flick straight out of the 1980s. Die Hard is no doubt a roller coaster of thrills, but it is all a bit familiar. Nevertheless, Alan Rickman's villainous portrayal will long be remembered."
    },
    {
      "rating": "9",
      "text": "German terrorists, a skyscraper, Christmas Eve and LA. When these elements are combined, you get Die Hard, a 1988 rip-roaring action epic that shot Bruce Willis to international fame. The plot is delightfully simple; John McClane is a New York cop who is visiting his wife Holly in LA during Christmas Eve. He meets up with her at her business company's Christmas party. All goes well until a few uninvited guests in the form of creepy terrorists seize control of the building and take all 30 of the guests hostage, demanding a ransom. McClane, in the bathroom at their time of arrival, escapes into the unfinished skyscraper armed only with his standard issue 9mm at his disposal. His main objective; find out what the hell is going on. His only help is a flatfooted cop on the ground played by Reginald VelJohnson of Family Matters. Along the way, he is listening to radio messages between the villains with a stolen walkie talkie in an attempt to figure out their nefarious plan. Alan Rickman is great as Hans Gruber, leader of the baddies, and delivers a performance he echoes in the Harry Potter films as Prof. Severus Snape. One of the best movie villains of all time. This festival of explosions, guns and epic battles was directed by John McTiernan, famous already for the original Predator. He delivers a movie that entertains as well as it shocks. In particular, the sequence in which one of the hostages attempts to save his own life by offering McClane to the terrorists. Correctly anticipating a liar, Hans shoots him in the head. The film was one of the biggest box office hits of the 1980s and spawned three sequels throughout the 1990s and 2000s, firmly placing John McClane as an action hero alongside the Terminator and Rambo. Also, it is the best Christmas movie ever made."
    },
    {
      "rating": "10",
      "text": "This is truly an piece of cinema. Bruce Willis was excellent as the perfect NYPD detective John McClane. That Hans Gruber got what was coming for him."
    },
    {
      "rating": "9",
      "text": "Director John McTiernan's \"Die Hard\" is one of those original one-man macho action movies that have brainless fun and a surprisingly deep character depth. It certainly is a masterpiece."
    },
    {
      "rating": "10",
      "text": "Let's not mince words, this is one of the best Christmas movies ever. \"Fists with your toes!\" Seeing young Bruce Willis again after all these years is always a laugh, but he really sells the \"everyman\" role well, and his scenes with his wife are surprisingly moving too. An action movie with heart!"
    },
    {
      "rating": "6",
      "text": "This movie launched a whole new perspective on the hard hitting action hero. It's not pulsing with muscle like Arnold or Stallone. It's not suave and tact like James Bond. It is sloppy, gritty, and wise-cracking. Bruce Willis opens out a stage all his own with his role as John McClane. A normal NYPD cop visiting his wife in LA runs into a problem when a some bloodthirsty thieves break into the Nakatomi building (Mrs. McClane's work building and headquarters of the entire company) Lead by German master mind Hans, they take over the building with dozens of hostages including John inside while they plan to steal the company's wealth. He's just one man. And he looks pretty ordinary, but he quickly proves to be a problem for the bad guys. Bloody shootouts, hard nosed fight scenes, and clever Willis commentary. Any person who likes action films has to respect what has been done here. Simple as that. Due to the excessive blood, gore, and swears, the score has to be a little low. I also felt some of the hand to hand and gun fights were a bit choppy and chaotic more so than they needed to be. The local chief of police also seemed pretty stupid. That was kind of the point, but I think they made him a little too stupid and ignorant. But don't get me wrong, this is one of the best action movies on record. John McClane is one of my all-time favorite action heroes. Takes the genre to new levels. Props."
    },
    {
      "rating": "10",
      "text": "I enjoy Die Hard a lot. It's simply fun, entertaining, and in fact gives me Christmas cheer. It's a solid film with an awesome John McClane."
    },
    {
      "rating": "10",
      "text": "Action movies don't come much better than this. The acting is good, the pacing is good, the plot is good, and the one-liners are sublime. One of the best christmas movies as well."
    },
    {
      "rating": "9",
      "text": "just a fun film thats over the top and the king of 80s action films . bruce willis comes off as the every man who is **** , funny , and just in over his head but just plods on through this fun action packed adventure ."
    },
    {
      "rating": "10",
      "text": "An action film at it's peak finesse and a perfect Christmas movie. Action; absolutely awesome, acting; memorable and quotable- need I say more about this film? It is too damn good to give it the highest praise."
    },
    {
      "rating": "9",
      "text": "Die Hard is flat-out amazing, it is a great action movie that is nice for the holidays. The plot is great and Bruce Willis' acting is hands-down amazing along with the antogonists' acting, this creates for an intense and gripping movie. The dialogue is all great and I kept wanting to know what would happen next as it is that intense. The violence and action is well-played out and very entertaining, it is a great watch. The flaws are that the story sometimes slows down and this can be annoying but this happens rarely and is uncommon. Overall \"Die Hard\" is a great movie that action junkies must watch as well as a great entertainment fix for anyone that watches it. Breakdown for \"Die Hard\": Presentation: 9.2, Plot: 9.0, Acting: 9.5, Dialogue: 8.7, Lasting Appeal: 9.2, Verdict: 9.1 out of 10 \"Amazing\""
    },
    {
      "rating": "10",
      "text": "Em 1988 um ano após o excelente filme policial Máquina Mortífera,Era criado mais um excelente filme e franquia policial com ótimas sequências.\rDuro De Matar um suspense de ação,Arrasador cheio de ação e com excelentes atuações do até então novato Bruce Willis,Alan Rickman incrível como o antagonista Hans Gruber,Reginald VelJohnson como Al Power,e Bonnie Bedelia como Holly GeNerro."
    },
    {
      "rating": "8",
      "text": "Best movie of the hostage action shooter movie cool fast hitting  scope and range u actually feel the chemistry between the characters and cast not like some recant bull"
    },
    {
      "rating": "8",
      "text": "One of the best action films of all time, Bruce Willis puts on a very charismatic performance. Alan Rickman also puts on a nice villainous performance"
    },
    {
      "rating": "9",
      "text": "I may be young, but god, I LOVE the classics, especially this film. The action in the film had me on the edge of the sofa for the whole film, I just couldn't get my eyes away from the TV!\rA great, funny and action packed film that I would definitely recommend watching!"
    },
    {
      "rating": "10",
      "text": "A fun, action thriller, Die Hard is arguably a perfect film. Its so well made, incredibly well written, and has some really great and hilarious performances. If you are a fan of action movies, you have to see Die Hard. Better yet, its a Christmas classic!"
    },
    {
      "rating": "10",
      "text": "A classic Christmas classic, with great action, amazing acting, and a reasonable plot. Its keeps you on the edge of your seat. Anyone who hates this movie either hasn't seen this movie or just plain stupid, or worse."
    },
    {
      "rating": "10",
      "text": "Not only is it a thrill-a-minute ride, but it has one of the best film villains in recent memory, a hero everyone can relate to, dialogue that crackles with wit, and a lot of very impressive pyrotechnics."
    },
    {
      "rating": "10",
      "text": "Die Hard is a terrific action movie that keeps the tension going for the entire movie. Alan Rickman plays a fantastic villain who is intelligent enough to be a legitimate threat."
    },
    {
      "rating": "10",
      "text": "Unequivocally one of the greatest action (and Christmas!) films ever made. A great hero complimented by a charming Bruce Willis, a perfect villain brought to life by a PHENOMENAL Alan Rickman, brilliant direction and cinematography, and of course, some awesome action. You don’t even need to be told how good this movie is; just look at how many copycats have tried to recreate its magic. Key word, “tried,” because no one has ever managed to recapture the simplistic beauty of this film."
    },
    {
      "rating": "10",
      "text": "This movie has a wonderful piece of classical music we know in love and it's lovely to listen to!"
    },
    {
      "rating": "10",
      "text": "Not quite sure how this movie has any negative reviews, much less a significant number. To each their own I guess.Quite probably my favourite action movie. It is a Christmas staple for me, along with 'Its a Wonderful Life' (a very different movie). Watch it every year and quite often follow it up with the still good but not sublime Die Hard 2, also a Christmas movie...Movie is tight and tense. Characters' motivations are clear. The action is stellar. McClane is a fantastically flawed, sarcastic, caring, noble protagonist.You can pretty much ignore everything after Die Hard 3, which was also okay, but ditched the Christmas-time setting."
    },
    {
      "rating": "5",
      "text": "Many people love Die Hard. I, however, am not one of those people. Packed to the brim with bad ideology (anti-European and sexist) and action genre cliches, Die Hard is boring, derivative, and just generally predictable. Bruce Willis is entertaining in the lead role, but beat-for-beat, I have seen this movie before many many times and that is excluding releases since 1988. The direction from John McTiernan is uninspired and he is practically invisible while his movie falls apart thanks to unrealistic sequences and being overlong. Honestly, this whole movie is pretty damn unrealistic. That being said, there are positives. Willis is charming, Alan Rickman is phenomenal, and the action is appropriately thrilling and largely well-directed. Those positives are enough for me to say Die Hard is middle of the road, but I do not really understand the acclaim."
    },
    {
      "rating": "0",
      "text": "Je ne l'avais pas revu depuis quelque temps voire depuis bien longtemps, repoussant à l'insu de mon ignorance l'échéance d'un revisionnage afin (et avant) de confirmer que ce premier Die Hard est bel et bien... le pire de tous !Et pourtant la mise en scène de McTiernan est des plus correctes... mais c'est là le seul point non négatif de ce piège à cons. Evidemment, le film a catapulté directement le Bruce et son sourire en coin, son air goguenard et sa crasse médiocrité au rang de \"super star\" mais il n'y a pas là matière à s'en réjouir : ce serait plutôt le contraire (jour de deuil pour le cinéma américain).Le ton général du film est largement bouffon à la manière d'une espèce de bande dessinée résolument imbécile, ce qui nuit à tout le sérieux dont il pourrait se targuer, y compris la violence pourtant assez évidente. Les méchants terroristes (!?) sont des Allemands dont le chef cabotine comme un Teckel en colére et l'escouade est composée d'Allemands bien blonds avec un gros accent : sûrement des Nazis déguisés...!Le scénar quant à lui est à peine suffisant pour remplir la feuille de route d'un nanar mal dégrossi et le film manque de rythme : il ne parvient en fait jamais à le trouver et met un temps fou à démarrer. Ni drôle, ni spectaculaire, ni fait ni à faire, ce premier Die Hard est une daubasse ridicule du début à la fin."
    }
  ],
  "recommendations": [
    "true_lies",
    "last_action_hero",
    "die_hard_with_a_vengeance",
    "die_hard_2",
    "mission_impossible_ghost_protocol",
    "first_blood",
    "demolition_man",
    "angel_has_fallen",
    "live_free_or_die_hard",
    "shooter",
    "mission_impossible_rogue_nation",
    "the_foreigner",
    "the_equalizer",
    "hulk",
    "red",
    "the_incredible_hulk",
    "the_terminator",
    "john_wick",
    "sherlock_holmes_a_game_of_shadows",
    "from_paris_with_love",
    "john_wick_chapter_3_parabellum",
    "the_rock",
    "gangster_squad",
    "daredevil",
    "boss_level"
  ]
}