{
  "id": 339,
  "title": "Die Hard: With a Vengeance",
  "starring": [
    "Bruce Willis",
    "Jeremy Irons"
  ],
  "runtime": 128,
  "genre": [
    "Action",
    "Thriller"
  ],
  "description": "New York detective John McClane is back and kicking bad-guy butt in the third installment of this action-packed series, which finds him teaming with civilian Zeus Carver to prevent the loss of innocent lives. McClane thought he'd seen it all, until a genius named Simon engages McClane, his new \"partner\" -- and his beloved city -- in a deadly game that demands their concentration.",
  "releaseYear": "1995",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/lwTE6cUhGxRaJvQ5VPdletIGDPh.jpg",
  "categories": {
    "plot": 6.95,
    "acting": 7.461538461538462,
    "ending": 7.125,
    "soundtrack": 10.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 7.666666666666667,
    "action": 7.44
  },
  "reviews": [
    {
      "rating": "10",
      "text": "It's just Die Hard. What can you say more than these two magic words that make this already brilliant action thriller an amazing experience, even after the second and third time. Awesome!!!"
    },
    {
      "rating": "10",
      "text": "The \"Yippy Ki Yay\" is used at the right time. Die Hard With a vengeance was pure perfection from beginning to end. Samuel l Jackson makes the perfect partner in race against the time gritty thrillers. Hooking from the begging."
    },
    {
      "rating": "10",
      "text": ".......................................................................................A Masterpiece...........................Underrated for the knows-all CRITICS like Scarface (1983), But the public shows the truth.........."
    },
    {
      "rating": "9",
      "text": "Sure, it doesnt have the same feeling as the first or second one but its still amazing for a third sequel right? I mean, look other films that have had 3 sequels, they were bad. The beginning takes a little bit to get your head round. It's basically John Mclane and Samuel L. Jackson solving puzzles by Simon."
    },
    {
      "rating": "6",
      "text": "The poorly written dialogue and overblown third act provide minor obstacles for John McTiernan's second outing in the Die Hard franchise, which mostly thrills while serving up the right amount of action."
    },
    {
      "rating": "9",
      "text": "Die Hard With A Vengeance is at some points just as good as the first but is able to stand on its own and delivers a nice spin on the franchise."
    },
    {
      "rating": "9",
      "text": "the first film was great the second one was eh. the third one brings us back to where this series should be . willis and jackon are a great and funny team . lots of funny moments and some great action . one of the few sequels that didnt disappoint."
    },
    {
      "rating": "10",
      "text": "From the star of Blind Date, the first two Die Hard flicks, and Pulp Fiction comes this masterpiece that will blow your mind. Detective McClane and an shopowner named Zeus Carver track down the mysterious Simon, who is Hans Gruber's brother (if you didn't understand that part you need to see the first one as well) and an soldier. Simon's plan is to destroy McClane, but he should have known he's an lethal weapon with an side of amazing skills and dangerous power. Can McClane catch Simon before he bombs an school hidden somewhere in New York?"
    },
    {
      "rating": "5",
      "text": "No deja de ser divertida y que te deja prendido al sillón, pero es la más flojita de la serie. No es el clásico estilo de la saga \"Die Hard\". Hay pocas escenas de tiroteos masivos como nos tenían acostumbrados hasta este momento. Luego en la 4, vuelven ese tipo de cosas que en esta no vemos."
    },
    {
      "rating": "8",
      "text": "It's fun to see how McClane plays Simon's little game in NYC, with Samuel L. Jackson at his side, and the film delivers the goods with a vengeance. Lots of action and explosions, just like what you would think. Some parts feel like an afterthought (the ending), but most of the movie works well as a Die Hard movie."
    },
    {
      "rating": "6",
      "text": "The movie is overall fun as the 2 prequels, but decent at its own."
    },
    {
      "rating": "8",
      "text": "Die Hard with a Vengeance is the third installment of the Die Hard series and second sequel to the excellent Die Hard made in 1988... John McTiernan returns after the failure of Die Hard 2 which was awful to direct Die Hard with a Vengeance.. This stars Bruce Willis as John McClane and Samuel L Jackson and also Jeremy Irons as the bad guy who is Hans Gruber's brother but unknown to Bruce Willis until later in the movie. I don't remember much about Die Hard with a Vengeance as not seen it in ages but I remember the stunts were good, good chase scenes and decent action scenes. It was a much better movie than Die Hard 2 by miles and Bruce Willis with a sign saying I hate black people was pretty hilarious. Die Hard with a Vengeance is far more superior than Die Hard 2 and the acting was okay and Jeremy Irons did pretty well as the badguy considering what he had to work with. Good film."
    },
    {
      "rating": "9",
      "text": "Awesome."
    },
    {
      "rating": "5",
      "text": "I have, as far as I can recall, never seen a die hard movie before so this is my first one. In Die hard: With a Vengeance the suspended cop McClane(Bruce Willis) gets neighborhood shop owner Carver (Samuel Jackson) to tag along as reluctant side kick, which guarantees some witty bouts of snarky exchanges and it gets delivered as can be expected.Just like 48 hours the movie turns around the combination of these two men, reluctant uncomfortable bed fellows who are forced to cooperate because a megalomaniac psychopath, played by the aptly haughty Jeremy Irons,  has them run around New York against the clock solving riddles to forestall  bombs going off. Soon it is revealed that Irons is the brother of one of the earlier bad guys Willis has dropped from a building in one of the previous movies.  Killing a bad guy doesn't always end the evil: it might create a new one.\r There is a nice twist in the plot as it becomes apparent that there is more to it than mere vengeance. In fact you might say you get to watch two movies for the price of one as the first half is different from the second half.\r Unfortunately the movie is so bend on throwing you from one action sequence into the next, without spending much time on connecting these that the plot starts to unravel and the plots holes need to be patched up with all kinds of allowances. Irons, for instance, suffers from that omnipresence and omnipotence that is so typical for these movies otherwise the story would not stick. The CIA and FBA make a short appearance, but Irons calls the men out by name and after that, having been found out apparently, we never hear from these agencies again for it is Willis who needs to save the day and nobody else. Their only purpose seems to be to inform us who the bad guy is. Bad storytelling, if you ask me.. for they could have tricked Irons into revealing himself after Willis got him worked up. For a while it looks like that was they way they were heading, but that is dropped.\r At various moments the movie relies on sheer luck or coincidence to keep on going. For instance one of Irons' games with Willis and Jackson involves a bomb in a briefcase in a park that is lying there for them to be picked up, yet nobody sees or steels the briefcase while it lies there, unattended in full view of a lot of people. At another moment Willis gets ejected from an underground tunnel and drops down to the ground at the same time as Jackson, making his was via another route, drives past him so he can pick Willis up and they can continue the pursuit together. After a while it seems that the writers just gave up making sense and went with the whatever goes is okay ploy.. At some point for instance Willis stops a truck thinking it is driven by terrorists without shooting the drivers first and it turns out just to be an innocent guy, yet some time later he just shoots the drivers, and it turns out they are terrorists.\r After a while you get the feeling that movie is overburdened with twists, explosions and people. For instance Irons has a female sidekick who seems totally superfluous and could have been left out as her presence doesn't add anything to the story, just like the guy who is the go between between Irons and his employers from the Middle East.  Also, after the first twist in the plot there is a next one and a next one after that one, until it starts to become tedious. In addition one wonders why Jackson is still tagging along. The choice of making him a shop owner who gets to be involved by accident loses all logic when it becomes clear Irons has lost his omnipotence and omnipresence and Jackson's presence is no longer required or demanded by Irons.\r The major point is that the first movie, as I read, plays in one building with one man taking on the terrorists in that building. The scene, the time and the actors are limited which makes the story self contained. In this movie the scene is the whole of New York where the one guy vs a bunch of terrorists becomes untenable as too many things could and would interfere. This is why many movies corner of the set. Isolating the scene is done to cut off people from outside help and has an additional purpose of limiting the playing field and of keeping people in.  This movie fails in this and thus it needs to patch up a lot of the plot holes and that shows..\r All in all not a bad film, but not a good one either. So a five"
    },
    {
      "rating": "10",
      "text": "Nitidamente superior ao segundo,John McTiernan volta com tudo trazendo um excelente Ás na manga Samuel L. Jackson que brilha e diverte com sua excelente atuação como o samaritano Zeus,Bruce Willis mais uma vez está excelente como John McClane. Jeremy Irons também é show de bola como o antagonista Simon. Larry Bryggman e Graham Greene também são destaques. Genial na ação,comédia e na história."
    },
    {
      "rating": "9",
      "text": "Bruce Willis is back again his character still remains the same which is good, he still bring his charisma to the fourth installment. It's predictable but it's clever, Jeremy Irons was the best villain ever! Screenwriter Jonathan Hensleigh's script adds suspense and keeps McClaine the same and adds  delivers just what it advertises, with a vengeance.  Samuel Jackson was awesome. Grade A-"
    },
    {
      "rating": "7",
      "text": "It's unbelievable, over the top, predictable and cheesy, but it's still a very solid action flick. The acting is great, the action scenes are very well made and it's very entertaining. It's a way better sequel than the second."
    },
    {
      "rating": "7",
      "text": "Call me crazy, but I think this movie marked a big step forward for the John McClane Die Hard series and a story that hits just as hard as the others before it. John McClane is a mess and has lost his wife and family. All he has is his job. So why would a German terrorist want him to suffer and or die, especially at the expense of others? For whatever the reason, some crazy terrorist is making John play a game while he works his own schemes on New York City. McClane must use his brain to see through the wiles and still come out as the hero. He will need help though, and he gets it. Some people like to rag on this one because it is about terrorists/thieves again. I mean yes, it is, but if it is just as clever as the prequels while bringing new dynamics in as far as scale, and characters, why mess with the formula? It works. I think the biggest gamble was Samuel L. Jackson being the partner/side-kick to Willis. Based on the ability Bruce has to be the lone wolf, adding someone next to him could ruin the vibe but it worked. Sam did it well delivering a memorable performance and making sure the human reasoning isn't lost among the explosions and shooting. They just got this down, if John McClane can stay this good and entertaining as a character and somehow keep making it through these crazy situations without getting ridiculous and unreal, why stop? Good job, worth a watch."
    },
    {
      "rating": "7",
      "text": "Despite the flawed beginning, simple cast, and some-kind-of poor end, this film has enjoyable moments, tension parts and amazing story-telling, this film gets the best of the year. Bruce Willis is still being our die-hard man."
    },
    {
      "rating": "8",
      "text": "Die Hard: With a Vengeance is a nice addition to the series imo. I do miss the Christmas theme, and Holly, but I still enjoyed it."
    },
    {
      "rating": "7",
      "text": "This is the third film in the series \"Die Hard\", which runs around the character of John McClane. In this film, he will face a terrorist group seeking revenge on him, specifically, by placing bombs in several places of New York. Directed by John McTiernan, the film has a screenplay by Jonathan Hensleigh. Bruce Willis takes the lead role.This film marks the return of McTiernan to the director's chair and managed to be different from the previous films. Addressing racial issues with humor, the film has good comic moments between McClane and Zeus, a seller from Harlem that takes racism too seriously and, eventually, become the main sidekick of McClane.Bruce Willis managed to shine again in a role that he knows well, but the spotlight was also turned on Samuel L. Jackson (who played Zeus) and Jeremy Irons, who gave life to the main villain. The eloquent and precise combination of the three actors was very important to the success of the film. The script also deserves congratulations: besides introducing humorous moments with great intelligence, also fled the pattern marked by two films, where Willis worked alone and out of his jurisdiction, to save his wife and the other people who were with her in danger. The time element is crucial to the film: with McClane working against the clock, the adrenaline flows freely and quickly infects the audience, which is attached to what is happening on the screen. The special, visual and sound effects are good, the picture is also positive."
    },
    {
      "rating": "10",
      "text": "Another Masterpiece!Great music amazing story and screenplay every scene was amazing,acting and whole chemistry between Bruce and Samuel was amazing and the villain played by Jeremy was having a thing like 1st one but not as great as his little brother but love he's Simon talk it was great.The actions were damn amazing at start it felt like playing GTA the way he drives and do the talk.this movie has shades of 1st one like flawless story with amazingly shocking twist and mystery puzzle type and had the situations like 2nd one,Samuel Jackson killed it amazing right from start the dialogues were Awesome like the way he addresses people sort of racist but Hilarious and starting was great the Board scene from then one every situation and phone booth scene specially bomb and robberry it was purely a treat to watch greatest surprising puzzled movie.whole ending was literally suspenseful and great and love the yippi ka lined bye bye to villain.Overall a hell of a ride Masterpiece."
    },
    {
      "rating": "10",
      "text": "Die Hard With A Vengeance follows up the previous two Die Hard Films and serves as a genuine sequel to the original, which the previous film could not deliver.With the paring of Samuel Jackson, Bruce Willis is allowed to expand his characterization due to strong dialogue that he shares with Jackson. Not to mention casting Jeremy Irons as a complimentary villain for the protagonists."
    },
    {
      "rating": "6",
      "text": "its just Simon says but people can actually **** die but hey at least the villains name is Simon so i guess it makes sense"
    },
    {
      "rating": "8",
      "text": "So once again we are in the company of John McLean, and what a ride we are in for! You all know the premise by now it is John against the odds. This movie is both a return to the spirit of the original movie in that it"
    },
    {
      "rating": "9",
      "text": "clever plot. well acted. lots of fun"
    },
    {
      "rating": "6",
      "text": "I think it is a little better then Die Hard 2. But, not nearly as good as Live Free or Die Hard or Die Hard. But, still an ok movie."
    },
    {
      "rating": "8",
      "text": "better than die hard 2, but not better than the orignal still way better than most action movies out there."
    },
    {
      "rating": "8",
      "text": "A good movie, but accurately should be a good 5/10. Just because the movie has a made-up story flawlessly thought-out, which I think isn't much, but the acting is funny, dazzling, smart, and terrific."
    },
    {
      "rating": "7",
      "text": "An absolute blast.  True to its predecessors and action-packed from beginning to end.  Sam and Bruce play with and against each other quite well; I particularly enjoyed the humor during the scenes where they accuse each other or racism.  Jeremy Irons is excellent as usual.  A solid action film."
    },
    {
      "rating": "8",
      "text": "Die Hard with a Vengeance is a classic entry into the franchise. The film is fast paced, colorful and tons of fun. This is an excellent Die Hard sequel and one that comes close to topping the original."
    },
    {
      "rating": "6",
      "text": "Another solid Die Hard film with good action and pretty good villain. Ending is a bit lame."
    },
    {
      "rating": "7",
      "text": "The addition of Jackson and Irons really elevated this movie. Irons plays such an amazing villain and Jackson is great starring opposite of Willis, The two really compliment each other. Die Hard: With A Vengeance is the only movie of the franchise that truly matches the original in quality."
    },
    {
      "rating": "7",
      "text": "As far as threequels go, \"Die Hard: With A Vengeance\" is more than just a success. Not only did it - at the very least - hold my attention and keep me entertained, but one can even say there are a few sparks of brilliance littered throughout, such as the additions of Samuel L. Jackson and Jeremy Irons to the gallery of new figures John McClane has to traverse. However, I can't help but feel that there's a bit too much going on here at times. Juggling McClane and Zeus, the cops, and Jeremy Irons's character all at once does seem to get a bit too strenuous for director John McTiernan here for a bit, but by the time the third act rolls in, it all makes sense and its smooth sailing from there on in. Definitely not the best \"Die Hard,\" but it is most certainly one of the better ones."
    },
    {
      "rating": "7",
      "text": "Putting Sam Jackson in the mix was a brilliant move by the film makers and Jeremy Irons is a serious badass.  The big weakness is this film is the exclusion of Bonnie Bedelia."
    },
    {
      "rating": "7",
      "text": "Keep the franchise going, keep it going. We all want more... except for... ding dong.... A Good Day to Die Hard. Die Hard: With a Vengeance will not just keep the franchise strong, but it also keeps it dead too."
    },
    {
      "rating": "9",
      "text": "Die Hard with a Vengeance is unique in franchise. This is not Die Hard, but the film is shot at a high level. It is clear that the script was difficult to redo. But is Samuel Jackson an extra in the film? An excellent action movie from the beautiful era of the 90s. A clearly expressed antagonist with his goal, perfectly and realistically set scenes of pursuit. Yes, sometimes in the film there is \"Hollywood nonsense,\" but without it you can not shoot an interesting action movie)"
    },
    {
      "rating": "5",
      "text": "Le film pop-corn par excellence au scénario abracadabrantesque typique mais il serait malhonnête de dire que l'on s'attendait à autre chose au vu du passif de la saga en la matière. On est donc dans une hystérie certaine, l'hystérie des évènements qui se télescopent et s'entrechoquent de façon quasiment ininterrompue.On ne s'ennuie donc pas et pourtant on trouve le film un peu long, fatigué par cette agitation souvent grotesque bien qu'indéniablement spectaculaire, on en conviendra. Bruce Willis est dans son élément, à la fois énervant, pathétique et parfois désopilant : un bien curieux mélange, ma foi. Le film a lancé la carrière de Samuel Jackson qui se tire très bien d'affaire dans ce méga-block-buster frénétique et, disons-le, car nous avons envie de le dire, carrément imbécile.Il est plus surprenant d'y retrouver le calme Jeremy Irons, habitué aux films intellos ou dramatico-psycho-trucs qui joue ici le rôle du grand méchant mégalo avec une aisance inattendue et un petit second degré bienvenu. Il cabotine dans la joie et la bonne humeur en tout cas, celles de son cachet je suppose et il a bien raison.Il peut arriver qu'on rigole de temps en temps devant les facéties et les aventures de l'inspecteur au débardeur crados tandis que -sauf rare exception- McTiernan délivre une mise en scène assurée et efficace. On reste tout de même sceptique sur l'ensemble, une sorte de comédie d'action, laquelle ne propose jamais de moment jubilatoire ou sortant vraiment du lot malgré sa débauche de moyens. Si le film n'est bien sûr pas mauvais, le seul commentaire qui nous vient à l'esprit au générique est... bof !"
    },
    {
      "rating": "7",
      "text": "Die Hard with a Vengeance was released in 1995 and was directed by John McTiernan. It is the third film in the Die Hard series and is about officer John McClane (Bruce Willis) who is called into action to stop a terrorist who is detonating areas around New York City.As someone who wasn't a big fan of Die Hard 2, this film impressed me lots and was a big improvement over the previous instalment. For me, Die Hard 2 was a rather bland action film with nothing particularly smart about it and at the same time felt too similar to the original with McClane's wife being in peril and also the fact that it too took place at Christmas, just like the first. This entry was refreshingly different and made for a great viewing experience.The film gets off to a very strong start with brilliant pacing; we're given our situations at an expert pace and we're introduced to our characters without any slow or exposition-heavy moments. Right from the get-go, the main villain begins to play his cleverly-written game of cat-and-mouse with the heroes which was very exciting and tense. Right from the start I knew this would be much better than Die Hard 2 as it proves straight away that it has wildly different ideas and provides a whole new exciting experience.Bruce Willis is once again great in the role of John McClane and the film doesn't slow itself down at any points to let us know what stage of his life he is in, and instead gives us the information over the course of the film which makes for a more effective way of giving us information rather than blatant exposition. Samuel L. Jackson was also great as Zeus, the person of whom John tags along with; the two had fantastic chemistry and I'd be more than happy to see them in a Die Hard film together again.Unfortunately, after the excellent first half, the film becomes rather bland after the point where the villain stops toying around with the heroes like he did earlier and the film becomes a rather bland action picture like Die Hard 2 was. The film did maintain the expert pace and never took a minute to breathe but was not anywhere near as thrilling as the previous half was. Also, the ending of the film felt very tacked on and much like a reshoot; because that's exactly what it was. The way the scene prior to the final scene set up the ending only worked with the original ending it was expecting, however because of the studio wanting it to be changed, the ending we received feels very out of place and overall dissatisfying.Overall, Die Hard with a Vengeance was the sequel we should have initially received instead of Die Hard 2 in my opinion and started off with many fresh ideas and constant tension as well as a brilliant pace, however most of these elements are sadly lost in the latter half and the film becomes a bland action picture towards the end. I was also dissatisfied by the new ending too and how it really didn't work at all. However, I would still recommend this film to the fans of the original Die Hard, even though the film does begin to run out of steam later on.7.8/10"
    },
    {
      "rating": "8",
      "text": "This is the true sequel that Die Hard fans deserve. Bruce Willis returns to form as John McClane, delivering clever lines, eye-catching action and some great chemistry with Samuel L. Jackson."
    },
    {
      "rating": "8",
      "text": "Top Example of the good action-movies from the 90ies. The scenes look so believably and immersive. Story-wise unfortunately nothing new: the antagonist commands the protagonist what to do, otherwise he harms random people."
    },
    {
      "rating": "7",
      "text": "Not as good as the first one but better than the second one just seems a little rushed."
    },
    {
      "rating": "8",
      "text": "This is more like the true sequel to the first movie, it has better characters and premise than 2"
    },
    {
      "rating": "9",
      "text": "\"diehard\" which is a amzing movie. Its even more of a chrismans movie then the first one. there are very good graphics"
    },
    {
      "rating": "9",
      "text": "While not as good as the first movie, I think this third installment is an improvement over Die Hard 2 and is such a joy to watch from start to end. NYC makes for an excellent setting with great cinematography, with once again, great action all throughout. Samuel L Jackson and Bruce Willis have awesome chemistry together, and Jeremy Irons makes for another great villain. Very great movie, it feels grander and bigger, and easily one of the better Die Hard sequels in my opinion."
    },
    {
      "rating": "7",
      "text": "This is the only good movie in this series and I don't understand how anyone disagrees."
    },
    {
      "rating": "9",
      "text": "Trzecia część,a ciągle seria trzyma poziom.. warto oglądać ten film. John jest w formie cały czas."
    },
    {
      "rating": "7",
      "text": "This film is jam-packed full of raw thrills and unmissable action. Samuel Jackson and Bruce Willis were a strange, yet entertaining duo in this sequel. It was fantastic to see Hans's manipulative brother Simon take part in this movie with all of his genius, sneaky, and mastermind tactics against Zeus and John, playing games with the two throughout the duration of the story. I am fully satisfied with this film's capacity of action and adventure, you won't be tempted to fall asleep during this thriller. I loved the scene in which Zeus is in the subway station ready to answer a phone call from Gruber while an officer threatens to arrest him. It is identical to the robbery scene in The Incredibles in which has almost the exact same setup! It's hilarious to watch. This is a worthy follow-up to the first two movies in the franchise and contains all the thrills everyone wants to see in any Die Hard movie. Love it!"
    }
  ]
}