{
  "id": 2006,
  "title": "Die Hard 2",
  "starring": [
    "Bruce Willis",
    "Bonnie Bedelia"
  ],
  "runtime": 124,
  "genre": [
    "Action",
    "Thriller"
  ],
  "description": "Off-duty cop John McClane is gripped with a feeling of déjà vu when, on a snowy Christmas Eve in the nation’s capital, terrorists seize a major international airport, holding thousands of holiday travelers hostage. Renegade military commandos led by a murderous rogue officer plot to rescue a drug lord from justice and are prepared for every contingency except one: McClane’s smart-mouthed heroics.",
  "releaseYear": "1990",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/56QECFJxueUVJAppVxwEE9ZDYrn.jpg",
  "categories": {
    "plot": 5.846153846153846,
    "acting": 7.428571428571429,
    "ending": 5.8,
    "soundtrack": 9.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 6.5,
    "action": 7.428571428571429
  },
  "reviews": [
    {
      "rating": "9",
      "text": "Die Hard 2 is the best part in the franchise. This is a selected 90s fighter with an interestingly staged suspense. Excellent acting by Bruce Willis, who was at the peak of his career. A bright representative of the fact that not all films action movies can be boring and stupid. Great sequel."
    },
    {
      "rating": "3",
      "text": "It is just a pale imitation of its predecessor with similar dialogue, a weaker villain, numbing explosions and half the fun the first film. As a sequel, its much bigger than its original; but better? No way."
    },
    {
      "rating": "6",
      "text": "The second installment of a great action movie series. John McClane is back to pick his wife up from the airport in New York when he runs into some trouble with terrorists who take over the flight grid and plan to execute  their evil plans at will. McClane is forced into action when the lives of thousands of people including his wife are threatened. The smart-talking and gun blasting is alive and well in this picture. The character and story line retained in this sequel is blatantly repeated from the first but definitely welcome. That much is rare. John continues to be the normal everyday cop who accomplishes superhuman feats without really overreaching practicality, again, rare. I thought the fight scenes and shootouts were on the choppy side. That could be attributed to the older action style and the authentic nature that John McClane is meant to show. A bunch of clever bad guys up against a guy who just wont die, what more could you ask for? Well done. Action/Bruce Willis classic, it's worth a watch."
    },
    {
      "rating": "10",
      "text": "This is the best movie we watched since The Hills Have Eyes!!!!!!!!!!!!!!!!!!!!!!!!!!!!!"
    },
    {
      "rating": "9",
      "text": "It's a sad commentary, but every year around the holidays I start thinking about John McClain. That is how ingrained media has become in our minds. This week I decided to watch Die Hard 2 for the 8 millionth time, because unlike most sequels, I found it to be better than the first. Not to say that the first isn't a classic film, but the second one has two things the first lacked. First, Director, Renny Harlan, who is the master of action films, completely unappreciated, and a man who has given me hours of excitement. The second thing is the supporting cast, which features the likes of Dennis Franz from NYPD Blue, Fred Thompson of Law n' Order, and of course veteran character actor, William Sadler. Willis once again is brilliant as John McClain and gave the 90's a true action hero! The Die Hard films are the frame work by which all modern action films are compared and if you skipped the second one, because it was a sequel, you're an idiot! This is a can't miss movie for action junkies."
    },
    {
      "rating": "9",
      "text": "After Die Hard hit it's predecessor for the audience and me, Die Hard 2 hit the big screen. It may not be as good as each other but it's still had the thrills and action and the music from Michael Kamen. Bruce Willis reprises his role as John McClane and all the suspense with the action still hits the film with all the dignity. After the people are saved at the Nakakomi Plaza, John has to save the people at the airport from the plane crashes caused by the terrorists including Col. Stuart played by William Sadler. There's only one plane crash which is caused by Col. Stuart and John gets upset. The people who are not from the first film know John McClane because he saved hostages at the Nakatomi Plaza. Jeez, that's a coincidence. I actually love the ending fight scene and the plane explosion. Surely I can't even get over this movie much like the first film. I would talk much about it but I can't do it anymore. It's just McClane shooting terrorists and saving the airport even though I know what causes the plane crash. It took place on Christmas Eve much like the first Die Hard and Bruce still says the line that is from the first film. Yep, you guessed it, \"Yippie-ki-yay, motherf£$ker!\" I'll bet he says that in all of the Die Hard films. While Die Hard is the most popular and memorable film of all time, Die Hard 2 had it's reputation to become a sequel and to think that Die Hard had to milk in all the sequels to impress audience and critics and myself alike. Many people say that this is the worst out of all of them, well I disagree with them, I just love and think it's a great sequel, okay, not that great but still good. But now the fifth film came out, people went mad. They said they don't like the fifth film and calling it a piece of crap. The recent Die Hard films are nothing compare to the old ones. And in the third film, it won't be the same with Holly McClane, Richard Thornberg and Al Powell from the first one to be precise. Yeah, I know he had a small role in the second film which I'm doing but that's just when he was in Los Angeles. Either ways that's Die Hard 2, a sequel to Die Hard, have my congratulations."
    },
    {
      "rating": "10",
      "text": "Fantastic movie.\r It takes all the stuff that was great about the first die hard (christmas time, simple but extremely exciting and engaging story, good character, great acting etc.) and basically does all that again, but puts it into a setting that is new and isn't at all a simple rehash of die hard 1.  It's a really great sequel and does pretty much everything right."
    },
    {
      "rating": "10",
      "text": "Die Hard 2 is one of the best sequel to a movie franchise, and the characteristics of the first one are all here: cheesy dialogue, tight spaces, and badass police officer John McClane. The story is just as fresh and exciting as the first one, and is a feat to beat."
    },
    {
      "rating": "10",
      "text": "i have never expected an airplane version of die hard but it is god damn entertaining"
    },
    {
      "rating": "10",
      "text": "Die Hard 2 is the film that really made Die Hard an amazing franchise. Because it became a series with this film.Die Hard 2 might have a different setting from the first one, but it still was astonishing. One thing that made it great was that it was directed by Renny Harlin(A Nightmare on Elm Street 4 director. Both are great films). Another reason was that it had fantastic development. Yes, some of the villains were forgettable, but Die Hard 2 is still fun and sometimes creative."
    },
    {
      "rating": "6",
      "text": "Die Hard 2 doesn't live up to the excitement of the first movie. Its still decent overall with some great action sequences, but it also has too much exposition in comparison to the first movie."
    },
    {
      "rating": "6",
      "text": "Not as good as first film but still quite fun and Willis is great. Enjoyable."
    },
    {
      "rating": "2",
      "text": "This movie flat out sucks. The cast isn't anywhere near as good, Too many weak subplots and there is a severe lack of the natural comedy/action blend that the first one had. Seems to me like they just wanted to recreate what made the first one so good rather than trying to come up with a more original idea that would have made this sequel thrive."
    },
    {
      "rating": "9",
      "text": "Como la primera, esta es un joyita divertida y graciosa. La idea del aeropuerto es genial, y mantiene un ritmo intenso durante las dos horas. Genial!!"
    },
    {
      "rating": "7",
      "text": "Basically a knock-off of the original Die Hard but with one of the most memorable death scenes in film history.  Still enjoyable and featuring Canadian actress Sheila McCarthy of 'Little Mosque on the Prairie' fame."
    },
    {
      "rating": "6",
      "text": "This sequel is trying to be the first Die Hard, but it fails miserably. Most of the acting is average at best, the movie tries to be silly fun, but comes off as stupid instead and worst of all, it's even a little bit boring at times. While Die Hard 2 is not a bad action movie, it's definitely not a good one either."
    },
    {
      "rating": "7",
      "text": "It looks like a rehash... maybe because I was too blindfolded to see that. Oh, it is. Not only that, but it's also enjoyable and it builds up a stack of freshness to keep the movie going."
    },
    {
      "rating": "7",
      "text": "Die Harder may be a bit dumb for the dialogue, with more gross words than simple ones. But it's perfectly enjoyable and full of action and suspense. This film continue with the first one fantastically, despite the bad and more mixed worldwide critics. PD: My new favorite action film."
    },
    {
      "rating": "2",
      "text": "One word:  Really?After the all-round awesomeness of the first movie, the sequel is disappointingly nonsensical, with a cardboard cut-out villain whose primary motivation is that he's a bit peed off with the government or something - nobody really cares, least of all the villain - and such a ludicrous finale that it makes the climax of Batman v Superman seem positively believable.  In fact, the whole premise is so utterly ridiculous that even John McClane decides to up and quit his job with the LAPD and go back to New York for the next (much better) film."
    },
    {
      "rating": "7",
      "text": "Die Hard 2 loses the surprise effect and is worse than the first one, but does that make it a bad movie? Not at all.We have in our hands a very entertaining movie with a Bruce Willis who is still unleashed."
    },
    {
      "rating": "6",
      "text": "Bigger does not mean better. Although our compelling hero is back in action, \"Die Hard 2: Die Harder\" has quite a few absurd conveniences sprinkled in different places that really takes viewers out of the movie."
    },
    {
      "rating": "3",
      "text": "Die Hard 2 directed by Renny Harlin (Cliffhanger) and starring Bruce Willis and Bonnie Bedelia. This sequel to 1988's excellent original Die Hard also with Bruce Willis this time takes place at an airport.. Die Hard 2's violence is reduced, the action scenes are less interesting and the blood is reduced. The villains aren't that good as the original and are laughable as they take over an airport and cause mayhem. The action scenes are pretty poor and Bruce Willis as John McClane doesn't seem as convincing as the first. I wish I could of starred in Die Hard 2 to steal a plane and fly off so I never had to watch this piece of junk in the first place. A terrible sequel to a brilliant original."
    },
    {
      "rating": "10",
      "text": "Uma sequência esquisita,porém excelente,De volta em problemas graves para resolver McClane salva Los Angeles de atentados terroristas ao aeroporto em aviões em circulações. Também cheio de ação e com excelente atuação de Bruce Willis."
    },
    {
      "rating": "9",
      "text": "Die Hard 2 is crisply directed by Renny Harlin, he succeeds by thrilling audiences and does not suck . It's a kick ass summer sequel, Bruce Willis is back as John McClaine, he returns to the franchise that made him a solid action star. The villain is weak, I wish that Jeb Stuart and  Steven E. DeSouza would of made the villain more kick ass like Alan Rickman was in the first one. Grade B+"
    },
    {
      "rating": "3",
      "text": "Trimmed down to quarter the fun of the first film, this sequel to the iconic Die Hard is an overabundance of explosions set off by weak villains speaking horrible dialogue. Even John McClane can't save this disaster."
    },
    {
      "rating": "8",
      "text": "Underrated sequel. Actually superior to the original, I find little to complain about with this. Inventive action and endearingly bad dialogue make this an underappreciated gem."
    },
    {
      "rating": "5",
      "text": "This is the second film in \"Die Hard\" series, which runs around the character of Detective John McClane. In this film, he will face a terrorist group that takes control of an airport near Washington DC. Directed by Renny Harlin, the film has a screenplay by Doug Richardson and Steven E. de Souza. Bruce Willis takes the lead role.This is a sequel, and it's difficult for them to maintain the original movie's level. This was no exception, despite continuing to be a watchable film, that will appeal to the majority of the public looking for this genre of movie. It does not escape much to what are the action films of this time or change the formula used in the first film, with the exception of changing the setting for an airport in rush hour. This, ultimately, makes the film more boring than the first, because it doesn't bring anything new or different.Bruce Willis managed to remain at the level of expectations, with a very consistent and competent performance. The rest of the cast does not stand out, but also does not make blunders. The special, visual and sound effects were well done, the scenery is good and realistic. The script is the worst part of the film: with a very low quality, it has obvious plot holes and creates so fantastic situations that eventually become implausible."
    },
    {
      "rating": "8",
      "text": "Die Hard 2 is like the original tons of fun. The movie is funny and action packed."
    },
    {
      "rating": "8",
      "text": "Yippie kay yay MF!Entertaining sequel not as flawless as prequel!great music,amazing acting,Decent screenplay and story-line,great one liners like 1st one,actions were not that much but amazing,starting was slow the intro and whole airport situation felt fresh then as we move it felt little slow but the situations were engaging to watch,great arc to reporter the villain was not as great as last one although in this they were group,although the crashing and there plan felt amazing,the starting church and hijacking network was great start,the officer and the janitor were amazing specially the technician guy.3rd act was amazing as hell the twist was surprising although little predictable end but entertaining with the amazing yippi line.overall the feel like 1st one was missing but sure entertaining sequel!"
    },
    {
      "rating": "5",
      "text": "This is an average action sequel film - there are some semi-decent explosions and other special effects, when you take into consideration when it was made (1990). It doesn't have the same tension as the original film and I didn't feel as engrossed in it as I was in the original but its a reasonably entertaining watch regardless. There are some instances of witty dialogue but overall its an ok, average type watch, nothing more, so I wouldn't specifically recommend it, no."
    },
    {
      "rating": "8",
      "text": "I would say if you liked the first one, you also like the second one. More or less the same story in a different setting."
    },
    {
      "rating": "4",
      "text": "Good plot and script but the delivery seems very rushed and forced in most parts."
    },
    {
      "rating": "6",
      "text": "A downgrade from the first movie, it did things similarly, and did them worse, still enjoyable"
    },
    {
      "rating": "8",
      "text": "While a small step down from the first film, Die Hard 2 is still a great film. There's great tension and action, and Willis once again delivers as McClane. The film doesn't do much to separate itself from the 1st film, but it's still a good film on its own."
    },
    {
      "rating": "9",
      "text": "No tutaj już lepiej z tą oceną... Warto oglądać całą serię filmów.... Oooo."
    },
    {
      "rating": "7",
      "text": "Die Hard 2: the perfect family Christmas movie featuring... John McClane the elf! This movie is so adventurous and action-packed, I love all the explosions and shootings, which is what everyone wants. I love how Barnes stuck by McClane's side throughout the film while everyone else doubted him and kicked him out of the equation. They came around eventually, but Barnes reminds me so much of Powell in the prequel. This movie agreeable lacks the raw thrills possessed by the first movie, but nonetheless it is such an enjoyable one and is of course well worth watching."
    }
  ],
  "recommendations": [
    "live_free_or_die_hard",
    "die_hard_with_a_vengeance",
    "a_good_day_to_die_hard",
    "terminator_3_rise_of_the_machines",
    "die_hard",
    "mission_impossible_iii",
    "the_expendables_2",
    "the_expendables_3",
    "angel_has_fallen",
    "mechanic_resurrection",
    "skyscraper",
    "nobody",
    "predator_2",
    "iron_man_2",
    "mission_impossible_ii",
    "brick_mansions",
    "the_expendables",
    "the_transporter_refueled",
    "mission_impossible_ghost_protocol",
    "escape_plan",
    "the_losers",
    "the_a_team",
    "12_rounds",
    "venom_let_there_be_carnage",
    "mission_impossible_rogue_nation"
  ]
}