{
  "id": 3572,
  "title": "Die Another Day",
  "starring": [
    "Pierce Brosnan",
    "Halle Berry"
  ],
  "runtime": 133,
  "genre": [
    "Adventure",
    "Action",
    "Thriller"
  ],
  "description": "James Bond is sent to investigate the connection between a North Korean terrorist and a diamond mogul, who is funding the development of an international space weapon.",
  "releaseYear": "2002",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/bZmGqOhMhaLn8AoFMvFDct4tbrL.jpg",
  "categories": {
    "plot": 4.444444444444445,
    "acting": 4.666666666666667,
    "ending": 3.3333333333333335,
    "soundtrack": 6.6,
    "cinematography": 5.5,
    "familyFriendly": 4.714285714285714,
    "funny": 5.0,
    "action": 4.466666666666667
  },
  "reviews": [
    {
      "rating": "5",
      "text": "Brosnan's final outing as 007 sees a poor script and a short-lived descent towards the worst excesses of the Roger Moore era with silly gags and silly gadgets. Halle Berry thinks it's all about her (as she did in the press interviews), Madonna proves that she can't act (or provide a decent theme tune), and it all goes against the good work of \"Goldeneye\" and the so-so follow-ups. Brosnan wasn't to blame, but he was let go, much to his disappointment. On the plus side, the action sequences are good. On the downside, there's an invisible car. It all seems so dated. Next up would be the reboot with Daniel Craig in the excellent \"Casino Royale\". \"Die Another Day\" did well at the box office, but Bond fans were shaking their heads in disbelief. A major let down."
    },
    {
      "rating": "6",
      "text": "Pierce Brosnan is a decent Bond, and his take on the character is very studied, and thought out. Die Another Day will keep Bond fans' eye glued to the screen, and everyone else will think of how the special effects and CGI are crap."
    },
    {
      "rating": "4",
      "text": "Sadly this movie is all quips and no punch-line. The effects are bad, even for the time and the acting even worse. Probably Pierce Brosnan's worst Bond flick."
    },
    {
      "rating": "6",
      "text": "The movie starts fine and there are some funny references to older Bond films. But once at the ice palace it starts going wrong. Especially the scene where James Bond is gliding on the water has some of the worst CGI ever in a Bond movie. Even my kid laughed and said: \"This is so fake!\"\r Halle Berry and Rosamund Pike act totally childish in the movie with stupid one liners and even more stupid jealousy, but admittedly they both look very hot.\r Too bad this was the last Bond movie with Pierce Brosnan because then we got those boring depressive Bond movies with Daniel Craig."
    },
    {
      "rating": "2",
      "text": "Brosnan's final adventure(!), please make some room for the eligible ones and not those that are just easy on the eyes.Die Another DayTamahori is a fan. He can't hide it, at all. And over the year, some of the best films are given by fans like Kevin Feige, Rian Johnson, JJ Abrams. But with a fandom like such comes responsibility to own that title with some finesse in the work. Lee Tamahori unfortunately doesn't have that, what he has is a good, nay great, banner that pays well. With production budget spewing money like a thirteen year old teenager cursing with his or her mates, this time along with huge set pieces even the actors hired are incredibly magnanimous. They don't have enough range to flaunt their skills but that's a different thing. This revenge based plot singing blood for blood has a familiar lyric in the song.In fact, it is somehow similar to the original Sean Connery's chapter where after Brosnan's first act, things start up pretty much with 1-0-1 textbook mission ingredients. Another improvement has been the antagonist that they have been working on, from the previous chapter, not that they are linked but they are definitely appealing, in a sense that their perspective communicate with us, again not that we agree on it, NO, but they certainly do challenge our hero a lot.The Bond girls are frisky with Halle Berry getting much, much attention, I would rather lean towards Rosamund Pike in her obvious duality persona, which she still presents with quite an engaging presentation, in those big eyes you can see an Oscar worthy talent in there. A masked theme explored- no pun intended- almost seems like a total waste in here where they had the opportunity to fool the viewers that might be manipulating but at least entertaining. Gadgets are a whole new thing now, to a degree that they are a character themselves. And I think, that Pierce Brosnan has been blessed with them, the most. Relying a lot upon them, he barely works hard no matter how loud and deep he grunts he is acting- well, let's not go there and wrap it up with the title Die Another Day."
    },
    {
      "rating": "5",
      "text": "Bond is back, but this time he'd rather forget this outing as this is not a very good film. A generic spy movie without the allure of James Bond, XXX(Vin Diesel) could have easily replaced Brosnan here and would be right at home. This is a train wreck of an action film – a stupefying attempt by the filmmakers to force-feed James Bond into the mindless XXX mold and throw 40 years of cinematic history down the toilet in favor of bright flashes and loud bangs. Since XXX is a Bond wannabe, that makes Die Another Day a second-generation knock-off. What's missing from this movie? Any real sense that we're watching 007 rather than a generic spy in a tuxedo. The need for action, action, and more action has reduced the plot to a minor footnote. Ditto for the characters – even Bond lacks his usual charisma. There is a nice sword fight sequence but Other than that Die Another Day is an exercise in loud explosions and excruciatingly bad special effects.(One of the worse Bond outings)."
    },
    {
      "rating": "0",
      "text": "If you’re doing a Bond marathon, skip this one. It’s an absolute low point in the series. It’s pretty much a studio job with bad CGI and lame special effects compounded with pedestrian directing that is worse than the work of the most amateur YouTuber. The series definitely exhausted itself at this point and the only good thing this crap spawned was the superb Daniel Craig reboot. Just go on to Casino Royale. Everything about it is much better, from the action scenes, to the dialogue, to the acting, even Daniel Craig himself is much better at playing Bond the character rather than Bond the cardboard cutout who spouts low brow one liners."
    },
    {
      "rating": "4",
      "text": "Good story and good script but handled very bad resulting in a rushed and wooden film."
    },
    {
      "rating": "1",
      "text": "Starts of promising, but as the film goes on, you want it to end, the questionable special effects when bond is sufing, and hanging off a cliff are terrible, the bond villan is by far the worst villan ever, the last 1/3 of the film is the worst minutes of James Bond ever, just so bad, and I love James Bond, and have for many many years but most of this film is unforgivable, from having Madonna in it for her self promotion to all the dodgy special effects, to the worst Bond villan - just an unplesant experience!"
    },
    {
      "rating": "2",
      "text": "This has to be the absolutely WORST Bond film in all of its' 50 year franchise! Too much emphasis on stunts, gadgets, and overwhelmingly BAD CGI. That CGI tsunami surf scene made m cringe to the point of human tolerance. And ice palaces and invisible cars? UGH! It's a real... REAL shame the Piece Brosnan left the Bond series on this abomination of a movie! If it weren't for Daniel Craig saving the franchise from total oblivion four years later, I've would have left the series permanently! Since I'm a sad owner of the Blu-ray from the Bond 50 set, I'll try my best to ignore it. Message to all Bond fans: avoid this at ALL COSTS!"
    },
    {
      "rating": "3",
      "text": "Just pure rubbish. The director loves to give us over the top set pieces, action and characters, dodgy CGI and the story is forgotten and action becomes way too over the top for a Bond movie. It feels like a video game or over produced action movie. There's too much of what we don't want in a Bond movie. Entertaining but I really do and have always never had anything great to say except for Brosnan gives another grand performance and the regulars."
    },
    {
      "rating": "3",
      "text": "An awful, convoluted & ugly mess. It is very fun though, in a schlock kind of way."
    },
    {
      "rating": "3",
      "text": "It's the greatest Christmas movie of all time.  And it's worth watching just to hear Pierce Brosnan try to say \"mojito\" and for Halle Berry's ridiculous one liners (for example: \"Who sent you?\" \"Yo mamma. And she wanted me to tell you she's very disappointed!\") Other than that, it's a ridiculous movie with an absurd plot and more bad CGI than has a right to exist. But watch it on Christmas Eve, right before \"It's a Wonderful Life\"- it's a great tradition!"
    },
    {
      "rating": "2",
      "text": "The worst Bond film of them all. There really is no excuse for such a poor excuse of a film from such talented people with so much money to spend. An incoherent story, a script that seems to be comprised of nothing but bad sex puns that are too low brow for an Austin Powers movie and instead of the famous Bond stunts we get CGI that looked to have been done by the local High School AV club. Just check out Halle Berry's s CGI dive of a cliff, the most unintentionally funny thing Ive seen in a long time. A very, very poor movie."
    },
    {
      "rating": "4",
      "text": "Bond has lost his charm.\rLukewarm plot with boring, unrelateable characters makes this offering, in the long running Bond series one of the weakest to date. Pierce Brosnans performance, is the commical, classical Bond we've grown to love.\rI may have watched this movie for the first time 10 years after its release however, great movies will stand the test of time. This does not. The awful CGI make this, at times, unbareable to watch.... Oh and Madonnas in it. For Pierce Brosnan's Bond fans only."
    },
    {
      "rating": "10",
      "text": "Buena la película la mejor mucha acción sobre todo en ese aspecto y excelente el actor"
    },
    {
      "rating": "10",
      "text": "Better than Casino Royale and by far the best Bond film ever made. Could have been even more enjoyable if it was extended by half or one hour."
    },
    {
      "rating": "7",
      "text": "Loved the theme song, loved the gadgets, loved the setting, loved the stunts but did not love the cheesy plot. The main villain isn't always that villain at the beginning of the movie which makes the plot confusing. I wish this Bond movie is the first Bond movie to be turned to 3D."
    },
    {
      "rating": "7",
      "text": "I liked the movie very much - the actors are very interesting and their acting is flawless. The soundtrack greatly contributes to increase the tension. The action is very entertaining and though sometimes very exaggerated, still believable - well, a bit, but it's very much fun!"
    },
    {
      "rating": "7",
      "text": "The twentieth James Bond film and last for Pierce Brosnan as 007. It is also the only Bond directed by Lee Tamahori.James Bond is captured by the North Koreans trying to disrupt an illegal arms deal for outlawed South African \"conflict diamonds\", put together by Colonel Moon (Will Yun Lee) and his right hand man Zao (Rick Moon). But he is double-crossed by someone within MI6, and tortured by the North Koreans, but not before killing Moon. Fourteen months later 007 is released by his captures in exchange for Zao, who was recently captured by the west. \"M\" (Dame Judi Dench) and NSA agent Damian Falco (Michael Madsen) believe Bond must have talked during his captivity, and is sent to rot in a British prison facility in Hong Kong. 007 escapes by stopping his heart for a brief period of time, and busting out. He then tracks Zao to Cuba where he is receiving DNA replacement therapy, and meets the incredibly sexy Jinx (Halle Berry), a NSA agent working for Falco. After Zao escapes, Bond returns to London and his attention turns to environmental billionaire Gustov Graves (Tobey Stephens), who has created a satellite that deploys a heat ray that can turn the world's ice lands into lush green gardens. 007 then travels to Iceland and Graves' ice fortress \"The Ice Palace\", where he is invited to watch a demonstration of his satellite, which Bond believes is fueled by the \"conflict diamonds\". While there, 007 meets up again with Jinx, and learns that Graves is actually Colonel Moon, having had has his appearance altered by the DNA replacement therapy. Bond and Jinx must now stop Graves and MI6 traitor Miranda Frost (Rosamund Pike) before he uses the satellite to attack South Korea.This is the most absurd plot of any of the 007 films, and one of the reasons that the series went on hiatus for four years, and then the decision was made to reboot the franchise, and start all over again. Pierce Brosnan is great as usual, but starting to look a little old (he was 49 at the time), and Halle Berry is perfect as the strong-headed sexy Jinx. The theme song by Madonna is probably the worst of all the Bond themes, and the DNA Gene replacement therapy is completely ridiculous, as is 007's invisible Aston Martin.This film is entertaining, but way too far over the top."
    },
    {
      "rating": "7",
      "text": "It is a bit over the top, but it is also Bond.  The action pieces are epic and awesome and really get you involved, the acting in here is great (except for Halle Berry- she just feels out of place) and the music is awesome (along with the theme song- I really like Madonna's song, but not her cameo appearance).  This film is an over the top Bond, which is fine.  It is a pretty decent movie, and a good Bond film."
    },
    {
      "rating": "7",
      "text": "I am going to start with the strengths of this Bond entry. It is for me one of the better-looking Bonds, both the cinematography and locations are truly inspired, and I loved the Icelandic snow palace. The pacing is relentless and the direction is done with fluid style, while the incidental music is good enough. The script has some nice moments too apart from some cringe-worthy one liners, while the action is very intense. In terms of acting, Pierce Brosnan is on fine form as the betrayed and vengeful secret agent. Bond is still charming and witty in some ways, but also tough and angry, Brosnan portrays this excellently. Halle Berry is a nice addition, and Judi Dench and John Cleese are solid too as is Toby Stephens as villainous Graves and especially beautiful Rosamund Pike as chillingly frosty Miranda Frost. However, the plot is quite familiar and quite preposterous in a sense in the second half, and there is an overload of CGI and sadly it's awful. My two main problems though are both to do with Madonna. One is that her theme song is truly grating and one of the more forgettable theme songs. The other is that her cameo as a fencing instructor is truly dire. In conclusion, a mostly solid if slightly disappointing entry in the series. 7/10 Bethany Cox"
    },
    {
      "rating": "3",
      "text": "Directed by Lee Tamahori and produced by Barbara Broccoli and Michael G. Wilson, has script Robert Wade and is the twentieth film in the franchise. In this film, Pierce Brosnan plays 007 for the last time, next to Halle Berry, in the role of Jinkx, Rosamund Pike, in the role of Miranda Frost, Rick Yune, in the role of Zao, John Cleese, in the role of Q and Toby Stephens, in the role of Gustav Graves.In this film, James Bond returns to active after being captured and tortured in North Korea, where he remained abandoned by the country he served. He will try to pursue those responsible for his arrest, in particular the traitor who he suspects exist within MI6's ranks. For this, he will have to investigate a network of smuggling of blood diamonds and an eccentric millionaire who has a reputation for never sleeping.This is undoubtedly the worst film of Bond franchise, to date. If there is any Bond movie where everything went wrong, is this. Pierce Brosnan, who in this film says goodbye to 007, was never convincing as James Bond. He tried, did his best and that's positive, but he never truly fit in the role. And if his previous films had been saved by the excellent quality of the villains and other stuff like that, it doesn't happen in this movie. Toby Stephens works well as Graves, but his character proved to be an unlikely villain. The public simply don't believe in his character or the history around it. Rosamund Pike is a terrible choice for a Bond-girl, as her character tried to be, at some point. She is the antithesis of any bond-girl, but the script was able to make up for it in the end, when Miranda showed not be as friendly as she (ever) seemed. Finally, we have the worst participation of all: Hale Brest... ops, Berry! This actress simply has no talent. She has big breasts, only that. And if that is enough to be a good bond- girl, the world is lost. The script is another problem: despite giving focus to strong and relevant subjects such weapons and diamonds trafficking or the constant military tension in North Korea, the way the film deals with it is simply unacceptable, unlikely and far-fetched. We could accept that in the early films of the franchise, but now the public expects more and that was simply forgotten. Last but not least, the film continues to suffer from continuity errors, paradoxes and faults unworthy of cinema professionals, in addition to the massive advertising sponsors, showed in all sequences and almost every scene. Bond is a action character or a pretty face to sell things?! The opening theme of this film, sung by Madonna, was very trendy to be precisely Madonna's. But even that could have been better and more interesting."
    },
    {
      "rating": "10",
      "text": "Great film most underrated in the saga I believe better than some of the old ones you can’t beat James Bond"
    },
    {
      "rating": "7",
      "text": "Points taken off for the Madonna song. But it was great seeing Pierce Bronson with Halle Berry. And I actually liked John Cleese as Q. The invisible car was OK."
    },
    {
      "rating": "8",
      "text": "hihjjbjbhvdtfhhgqwertyuioplkjhgfdsazxcvbnmlkjhgfdsaopiuytreeqqzccvbbnmlkjhhffdsapoiuuyytrewsfbhkhgedjoputdjbdshh"
    },
    {
      "rating": "10",
      "text": "Wonderfull, I really enjoyed it! Entertainment weekly is so right!"
    },
    {
      "rating": "0",
      "text": "Ow! My eyes! I'm blind! This movie was so bad it blinded me!"
    },
    {
      "rating": "0",
      "text": "This was possibly the worst film I've ever seen!"
    },
    {
      "rating": "0",
      "text": "What were they thinking?"
    },
    {
      "rating": "0",
      "text": "This movie sucked balls! Bad acting, bad direction, bad special effects. The Batman & Robin of our time."
    },
    {
      "rating": "0",
      "text": "There is no excuse for a movie to be this bad!"
    },
    {
      "rating": "8",
      "text": "A good film, not up to the standard of some of the old classics but good enough, compare it to casino royale and it could be a 10. However, looking at this film compared to the films that were around when they made it, they made a few errors in the writing and designing of it. Firstly Halle Berry's acting in the film was bad, not terrible, but bad, secondly, they managed to make the first 30 mins of the film, almost the best I've seen in any bond film so compared to this, the rest of the movie jsut seems slightly toned down, through to the car chase scene at the end, some of the CG was also pretty cheesy but on the whole worked well. Overall though a thoroughly enjoyable film"
    },
    {
      "rating": "8",
      "text": "Better than Tomorrow Never Dies but, not as good as the World is not enough. I enjoy Brosnan's acting, and ability to make cheesy lines seem less cheesy. I didn't like the CGI interaction in one particular scene, it seems like a waste of money. I liked Halle Berry's character, although I didn't appreciate that fact that some of her dialogue seem to \"dumb her down\"....I was to busy enjoying the car...ahhhhhhhhhhhhh, what a car it is. Thank God the Astin Martin is back! I think that John Cleese was good as \"Q\", however I miss Douglass Llewellyn, and he will be sorely missed. (If you don't know, he died in a car accident after the opening weekend of the last movie.)"
    },
    {
      "rating": "3",
      "text": "I dont see anything good in this movie. Yes, the beginning was not bad and brutal with torture in North Korea. But other than that?The biggest problem of the movie is the ridiculous and unrealistic action, it is even worse than in some of the worst James Bond movies. And in addition some of them dont even look well, because there are so many bad CGI scenes. The plot is also ridiculous as some of the characters: Gustav Graves is annoying, Zao is as ridiculous as a comic villain. Halle Berry as Jinx didnt fit also, because this 50 kg girl surely has no chance in any fights. Judi Dench as M is ugly as always, Samantha Bond as Moneypenny looks ugly also.So in the end this movie is just \"entertainment\" for the brainless masses."
    },
    {
      "rating": "4",
      "text": "Out of 25 Bonds I saw, I place this one at 16/25.As I rate it the highest of Brosnan's Bonds, which were all utterly poor, I feel like giving him a bit of business now.Brosnan simply didn't act. He just more or less gawked at the camera with a wry smile that he believed expressed an air of confidence, but only expresses the feeling of watching a hair commercial with a pretty boy smiling. It's not like he is necessarily a completely incompetent actor, but he IS the worst Bond. Playing a character like James Bond is more difficult than you'd think because you're supposed to exude a sort of shameless, teenage virility, while killing and getting shot at all the time. It's a strange mix of manhood and teenagehood, of wit and mockery, and serious acts, of being a superman that just never dies and yet has to show that he's in danger.Brosnan was always doing the same face of a pretty boy with a wry smile. His movies were also the last \"true Bonds\", since Craig's era has many core style changes and completely revamps the franchise to the point that it's simply not Bond anymore.Brosnan was the last one to carry Bond's suit, and this is his last movie. So in being the man that finally, completely, in every possible way, buried James Bond, how does he fare in his last outing?Well, quite well actually. For Brosnan.Die Another Day is by no means a masterpiece of anything. But if you compare with action-packed, terribly written (insert all Brosnan and lots of Moore movies here), it is a movie with better wit, better plot, rather good directing, and interesting situations.From being actually taken prisoner, to hunting down his enemies, being treated like a traitor, searching alone, finding allies, and unravelling the villains main plot, there is a generally milquetoast but still alright plot.The villain feels like a determined and cunning foe. It's not a great villain, the wit from the old era is long gone, his style or charm are near zero. But it's neither an idiot, nor some angry manchild, nor anything stupid, he at least feels like a real foe.The plot and style may fly all over the place and go into the worst corners, but we're used to it with Bond.The action has a particular flair, and this is the Bond with one of the most memorable and realistic fights, a sword fight at that, in the series history.Overall, if you're ever curious about Brosnan's Bond, even after all I wrote, this is the least painful of his movies. It's his best acting (not saying much, I know), one of the more solid plots, good action, and Halle Berry may have not been a great actress but she is a pleasure to see nonetheless.Lastly, since I'm writing a review on every Bond movie, when I made a list of best to worst, I ranked some from the top, and some from the bottom. The bottom ones were the ones that I believed were just bad enough that they didn't deserve to even be seen. Out of the bottom ones, Die Another Day is the best. No Brosnan movies deserve to be seen IMO, but at least, this one is the least bad of the bad ones, and is the closest to deserve the moniker \"mediocre\" rather than bad."
    },
    {
      "rating": "6",
      "text": "The twentieth James Bond movie and last one in the Pierce Brosnan era. It is for many the worst in the franchise and while I agree that it has a lot of weaknesses it has also a bit of redeeming qualities. For clarification: I think it has some great ideas and concepts that are misused or don't life up to full potential. I often use following example: Can you retell the story in a way that it sounds awesome and people will be hyped to see the movie? The answer is yes but it did not live up to it. Lets start at the beginning. It was the twentieth movie in the franchise and they want to to something big. There are also countless homages to previous movies like a store room with gadgets, the Halle Berry scene in resemblance to Ursula Andress or the book with James Bond name patron (This is not made up. It was truly the inspiration for the name James Bond for Ian Fleming). The story starts when James Bond is send on an investigation to North Korea. There he should investigate Colonel Tan-Sun Moon who is involved in shady businesses. More than this set up I wont tell or spoil. They break here with a tradition of the James Bond movies and it is a hell of an intro sequence. It is positively shocking and unexpected. It got me hooked and James Bond is in some unfamiliar situation. Sadly it is a rocky ride from there. Some parts of the story are just awesome on paper but fail on the screen. I often heard and made also myself the statement that it got overblown. There are moments were you are taken out of the immersion immediately. There is for example a chase scene that is often mentioned as far to overblown even for a James Bond movie. Let this sink in while you remember what we accepted in the history of the franchise because it was awesome or they did it winkingly / with humor (Taking it not that seriously to make it look fake). For the acting I think we get a good performance. Pierce Brosnan can shine here in an unfamiliar James Bond situation. Halle Berry is a great actress and delivers. Toby Stephens is excellent and when you see behind his facade it is a magnificent idea. Sadly it is also overblown and if down better he would be a remarkable candidate for a top 10 list. There are other great performances and I will praise Will Yun Lee and Kenneth Tsang for their acting and representation. Finally we got John Cleese as Q. He does a good job of replacing Desmond Llewelyn who died even if no one can truly fill the shoes. Again Judi Dench as M is a highlight. Generally I say there are some missteps but it has a great cast. The action scenes work mostly well but like I already mentioned some are overblown. Sometimes a bit less works better (Proverb “Less is more” has sometimes its merits). The scenery and sets are really nice. While I am at it I find the soundtrack really good and Madonna did a great entry with an enjoyable music video that is also a homage to the franchise. Overall I see why other disliked this movie more than me. However it has great ideas and moments that work well. Worth watching once and maybe for some in the “So bad its good category”."
    },
    {
      "rating": "7",
      "text": "Die Another Day is great, but it's spoiled here and there by some CGI scenes, which just didn't have to be and are just to the detriment. The plot is good and the location quite the same. Unfortunately, the film no longer reaches the qualities of the previous ones and for me it is the weakest Bond with Brosnan. Despite all this, this is a good film for me, which I can recommend."
    },
    {
      "rating": "4",
      "text": "One of the worst Bond movies ever made, it's a shame Brosnan had to finish Bond here. Everything from the beginning up until we reach the ice palace actually worked really well. Unfortunately, the film goes downhill from there. There are things here that just don't belong in a Bond film, like:-Overuse of CGI (Windsurfing scene in particular)-Invisible Car-Korean guy changing into white dude by changing his DNA (Wtf?!)-White dude having a metal and futuristic suit in the climax-Horrible theme song by MadonnaThe Bond girl, Jinx, is one of the worst Bond girls, she's supposed to be tough but needs rescuing every 10 minutes or so. Overall, a really poor Bond film."
    },
    {
      "rating": "2",
      "text": "Despite a great opening, Die Another Day is so laughably absurd that it's not even fun to watch."
    },
    {
      "rating": "3",
      "text": "Even though this Pierce Brosnan Bond film is action, it is ultimately too goofy and gadget-wridden for its own good. Also, the performances and the villain are alright."
    },
    {
      "rating": "6",
      "text": "As 007, Brosnan has unquestionably found his job, and Judi Dench has never played M with more sass. Halle Berry appears lost as Jinx; her one-liners are NOT humorous and seem entirely misplaced. Rosamund Pike also does a fantastic job. As the diamond-faced henchman Zao, Rick Yune is a walking caricature, and Toby Stephens makes for a dull primary antagonist. Desmond Llewellyn's replacement, John Cleese, is a terrible choice since, despite his best efforts and gritted teeth, he is still John Cleese and not Q. Last but not least, including an invisible car is extremely insulting, and by doing so, they returned to the Roger Moore cartoon style."
    },
    {
      "rating": "1",
      "text": "Easily the worst of the Pierce Brosnan films, with only the super strong heroine in Halle Berry's Jinx going for it. The plot twists are quease-inducing, and the CGI is spectacularly bad even for 2002."
    }
  ],
  "recommendations": [
    "the_world_is_not_enough",
    "casino_royale",
    "spectre",
    "tomorrow_never_dies",
    "for_your_eyes_only",
    "the_incredible_hulk",
    "daredevil",
    "quantum_of_solace",
    "terminator_3_rise_of_the_machines",
    "the_spy_who_loved_me",
    "true_lies",
    "highlander",
    "elektra",
    "xxx",
    "fantastic_four_rise_of_the_silver_surfer",
    "creed_ii",
    "skyfall",
    "hulk",
    "iron_man",
    "fantastic_four",
    "no_time_to_die",
    "spider_man_far_from_home",
    "thor",
    "thunderball",
    "the_karate_kid_part_iii"
  ]
}