{
  "id": 383,
  "title": "Diego Maradona",
  "starring": [
    "Diego Maradona",
    "Pelé"
  ],
  "runtime": 130,
  "genre": [
    "Documentary"
  ],
  "description": "Constructed from over 500 hours of never-before-seen footage, this documentary centers on the personal life and career of the controversial football player Diego Maradona who played for SSC Napoli and Argentina in the 1980s.",
  "releaseYear": "2019",
  "mpaaRating": null,
  "imageUrl": "https://image.tmdb.org/t/p/w500/3eBZxi0xcXBnEYq4m4YTVf0eHWX.jpg",
  "categories": {
    "plot": 7.666666666666667,
    "acting": 7.0,
    "ending": 8.0,
    "soundtrack": 7.0,
    "cinematography": 5.0,
    "familyFriendly": 8.0,
    "funny": 5.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "7",
      "text": "Asif Kapadia makes good documentaries because he makes you being interested in his subjects, even if you're not a fan or aren't interested or documented about the subjects.It happened with Senna despite how little I'm interested in F1. It happened with Amy even though I wasn't a fan of her music and now the same thing happens with Maradona, since although I love football and I know he is one of the most legendary players in the sport, I dislike the guy but I still enjoyed the documentary, so in that regard, it was more than enough."
    },
    {
      "rating": "8",
      "text": "A fitting tribute to perhaps the greatest of all time - in all his genius, sagacity, hedonism, and excessIn his third feature-length documentary, director Asif Kapadia turns for the first time to a still-living subject; arguably the greatest footballer of all time, Diego Maradona. As famous for his on-field brilliance as his lavish lifestyle and volatility off the pitch, Maradona lived (and continues to live) his controversial life very much in the public eye. Depicted as uniquely and supremely talented, but unable to handle the fame, he became a victim of his own success, with his career imploding in the prime of his life. Although the film ends on an unnecessary downer, and although the focus on the period from 1984 to 1992 will disappoint those looking for a more conventional overview, the fact is that it's in those few years where the legend was born, where it reached its apotheosis, and where it self-destructed.The film looks at such events as his arrival at Napoli in 1984, when he was welcomed at the Stadio San Paolo by 85,000 fans; the 1986 World Cup, in which he scored the greatest goal of all time, leading a very average Argentinian squad to victory; the birth of his illegitimate son, Diego Sinagra; Napoli's first league title (1986-1987); his association with the Giuliano crime family and cocaine addiction; Napoli's second title (1988-1989) and first UEFA cup; the 1990 World Cup, in which he found himself lining out for Argentina against Italy at the San Paolo - a situation that wasn't helped when he said in an interview that Naples wasn't really Italy, and he expected the Napoli fans to cheer for Argentina; his vilification in the press after scoring a key penalty; the Napoli fans turning on him; his 15-month suspension for testing positive for cocaine; his low-key departure from Napoli in 1992.Unlike both Senna (2010) and Amy (2015), Diego Maradona includes both first name and surname in its title, and whilst this might seem like a superficial element, it's actually of huge thematic importance. The film's central conceit is that Diego Maradona was two personas; the quiet, unassuming street kid who just wanted to help his family and have fun (Diego), and the global superstar, with a different Rolex for every day of the week (Maradona). The film posits that Maradona was a construct built by Diego, but over time, Maradona began to take over from Diego, even away from the cameras, and as Diego receded further into the shadows, Maradona became increasingly unpleasant and self-absorbed.Kapadia doesn't focus on any one incident as breaking Maradona, but he does trace it back to the 1986 birth of Diego Sinagra. Looking at the media frenzy that resulted, Kapadia draws attention to the fact that his wife, Claudia Villafañel, was pregnant with a child of her own during the scandal. Kapadia also focuses on the 1990 Argentina-Italy game, and whilst he is unequivocal that the Napoli fans overreacted, he is also clear that Maradona's calamitous pre-game interview didn't help. In this sense, although Kapadia flirts with the image of Maradona as a man betrayed by an intrusive press and a fickle public, ultimately it presents him as neither hero nor villain, but as someone caught up in a hurricane partly of his own making.In terms of problems, perhaps the most obvious one is how narrowly focused the film is, with a good 90% set during his tenure at Napoli. For example, the film barely touches on the infamous brawl that Maradona instigated (albeit after he was incessantly provoked) in the 1984 Copa del Rey final contested by Barcelona and Athletic Bilbao. Some footage is shown, but there's no context. There's also only the briefest of mentions of the 1994 World Cup, when he failed another drug test and was sent home in disgrace, never to play for Argentina again. Likewise, there's nothing whatsoever on his coaching career. The film also ends on an unnecessarily downbeat note, with Maradona overweight and disillusioned, tearfully confessing his many transgressions on Argentinian TV. Such an ending was entirely avoidable given that the man is still alive and seems to be holding his demons at bay.This aside, however, Diego Maradona is an exceptional documentary. Mapping out the difference between the person and the cult of personality, Kapadia avoids hagiography, painting Maradona as far from perfect, but so too is it a fitting tribute. A man whose hubris and arrogance nearly destroyed him, nothing he did off the pitch will ever nullify his perfection on it. Kapadia translates his chaotic career into compelling drama, telling a story about an individual genius which speaks to the volatility and fickleness of fame."
    },
    {
      "rating": "9",
      "text": "Absorbing portrait of a legendary but tragic figure. You don’t have to love soccer to appreciate the arc of this man’s life. Another exceptional documentary from Asif Kapadia."
    },
    {
      "rating": "10",
      "text": "A sad documentary with impressive scenes. I feel sorry for him, how he was treated in Napoli at the end. But this documentary is not only about Maradona and football. It is also about cocaine and how it can destroy you. There are better drugs, that dont destroy your health and psyche so much. The documentary went very into detail, what happened in Napoli, but I miss more scenes from his life in Barcelona, Boca Juniors and after Napoli."
    },
    {
      "rating": "7",
      "text": "As an Argentinian and a football fanatic I know more about the subject of this documentary than what Kapadia shows during its length. It is understandable that he focuses on the part of Napoli which took Maradona to a Myth level, but the way he gives closure to the story feels very shallow, unlike Senna, Maradona is still alive, he has fallen and recovered many more times, and there are documentaries that are more complete and precise about this. That said, Kapadia´s mastery in documentaries especially with sports subjects shows here again, with many emotional moments adorned by engaging music."
    },
    {
      "rating": "9",
      "text": "Maradona - one of the greatest footballers ever. For me, who knew only bits and parts of his story, this was very interesting"
    },
    {
      "rating": "7",
      "text": "(Mauro Lanari)\"He\" cites \"The Untouchables\" (De Palma, 1987), Minà compares him to Masaniello, I thought about the importance of Huizinga's \"Homo ludens\" prefaced in the Italian edition by Eco and the conceptual abyss between \"Götzen-Dämmerung\" (Nietzsche, 1889) and \"Götterdämmerung\" (Wagner, 1848)."
    },
    {
      "rating": "9",
      "text": "Such a great and inspiring doco. Up there with Senna and Amy. What an incredible story."
    },
    {
      "rating": "9",
      "text": "Brilliant doco on the playing career and personal life of the legend Diego Maradona during his time at Napoli.Great footage, a compelling story, along with clever direction and storytelling makes this one of the best sports docos in recent years"
    }
  ]
}