{
  "id": 3253,
  "title": "Dinner for Schmucks",
  "starring": [
    "Steve Carell",
    "Paul Rudd"
  ],
  "runtime": 114,
  "genre": [
    "Comedy"
  ],
  "description": "Rising executive Tim Conrad works for a boss who hosts a monthly dinner in which the guest who brings the biggest buffoon gets a career-boost. Tim plans on not attending until he meets Barry, a man who builds dioramas using stuffed mice. Barry's blundering but good intentions send Tim's life into a downward spiral, threatening a major business deal and possibly scuttling Tim's engagement to his fiancee.",
  "releaseYear": "2010",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/djwkUFhkM81gIsI9ZZ7I6ajZAKY.jpg",
  "categories": {
    "plot": 7.1875,
    "acting": 6.3125,
    "ending": 8.25,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 5.5,
    "funny": 6.441860465116279,
    "action": 9.0
  },
  "reviews": [
    {
      "rating": "4",
      "text": "I was extremely dissapointed with this film. I really wanted to love it but it was too hard to do so. This isn't neither of Rudd's or Carrell's best work. Humour is extremely dry although the funniest moments take place with Zach Galfinakis. Your best to rent this one or wait untill it shows up on a cable movie channel.Sure it has a great moral about not judging a book by it's cover but it really lacks charm that these two comedic actors have. If you wanna see Paul Rudd and Steve Carrell work well together, watch the 40 year old Virgin or anchorman but not this."
    },
    {
      "rating": "3",
      "text": "It began quite entertaining. fell apart around the point when paul rudd's stalker came over. at around that point, the characters became increasingly unbelievable and implausible. the acting was mediocre. the writing was subpar. it got ok again when they went to the dinner, but then fell apart as chaos broke out. it just wasn't funny at all. steve carell's character was absurdly irritating. all in all, don't waste your money. or your time"
    },
    {
      "rating": "5",
      "text": "Look, i am not going to lie. I laughed a couple times, but that does not make this a good comedy. Sure, all being said Steve carell gives a above average performance and he really fit with that roll, but that again does not make a good movie. It could be a good movie but iit is held down by too many cliches that really took me out of the experience. That is really all that is to be said about this movie. Average."
    },
    {
      "rating": "4",
      "text": "Movie for schmucks...  Interestingly enough, I like Carelll, Rudd and Clement. I just hope I had watched them in a different movie; maybe a funny one.  This one cost around 50 million euro,  which is about 10 million per non-forced laugh if I'm generous."
    },
    {
      "rating": "10",
      "text": "I thought this film was hilarious. There were some neat inside homage jokes (Jeff Dunham doing a turn as Wayland Flowers and Madame) as well as jabbing at the art scene and the human condition in general.\rI think the original title of Dinner Game would have worked better intellectually"
    },
    {
      "rating": "10",
      "text": "One of the funniest movies of all time. Only a few movies can make me tear, and this is one of them."
    },
    {
      "rating": "10",
      "text": "This movie was really hilarious. I laughed quite hard several times. Highly recommend this to anybody looking for a really good laugh."
    },
    {
      "rating": "9",
      "text": "The funniest movie since the hangover. I could not stop laughing throughout the entire movie"
    },
    {
      "rating": "10",
      "text": "There was really none stop comedy. Steve was great!"
    },
    {
      "rating": "10",
      "text": "Best movie of the summerb y far."
    },
    {
      "rating": "9",
      "text": "Hilarious movie. Greatly exceed my expectations. I laughed throughout the entire movie."
    },
    {
      "rating": "6",
      "text": "The movie centered on a lot of odd characters that made you laugh but it wasn't completely hilarious. I wouldn't say the odd characters they describe where completely far-fetched I have met some people that are too hilarious to believe that they actually believe themselves to be talented. Overall, the movie wasn't worth renting but I rented because of the two main actors. It was somewhat disappointing."
    },
    {
      "rating": "8",
      "text": "This movie is **** funny, it is hilarious. Steve Carell's character is a **** idiot (until the end). The artist is hilarious. The sexual scenes are kinda gross but funny"
    },
    {
      "rating": "4",
      "text": "A Film Review by: Sam Fragoso\"Dinner For Schmucks\"**2010 has definitely not been a good year for comedies and \"Dinner For Schmucks\" does not help the genre. Like most comedies \"Dinner For Schmucks\" fails to stay humorous through out. The first twenty minutes are great fun but from that point on it goes on autopilot, till the long waited and anticipated dinner scene but by that point your overwhelmed with the movies awkwardness and predictability. Carell and Rudd are very talented and likable actors but even they can't save o so predictable plot and a very flat script. You'd be doing yourself a favor by skipping \"Dinner For Schmucks\"."
    },
    {
      "rating": "2",
      "text": "Every once in a while or sometimes too often you sit in a movie theaterand think to yourself who in his right mind came up with the idea forthis movie and even worse who in his right mind decided to fund thismovie. But I guess if you bring in a decent cast and enough hoopla formarketing you could sell ice to Eskimos. I set through the movie andother than a few laughters this movie is very boring and the mainreason for it is the plot. It doesn't make sense and overall just a badidea for a movie. Edan Aharony"
    },
    {
      "rating": "9",
      "text": "The film is quite different from many, is not a silly movie, and like all others, with very similar stories, is a different film, something that touches everyone, is a thrilling movie and at one point, talking about love, friendship and the sincerity and falsehood, Barry (Carrel) is a friend \"silly\" by Tim (PAUL RUDD) barry always tries to please tim, and attempt to be his best friend, always being honest, and always trying to help Since the tim has not always true, but in the end always comes clean .... Well, finally, the movie is different and touching and funny, one of the best comedy films have ever watched, I became a big fan of Steve Carell, and I hope great movies with him starring as this, I recommend ..."
    },
    {
      "rating": "10",
      "text": "this movie is so funny.The whole way through theres lol moments.its probly in my top 5 movie list.you also get attached to the character barrie in it because he is inocent and hes got no freinds so you feel bad for him the whole movie but he is the funniest character.if you havent wathced this movie yet I reccomend you watch it now"
    },
    {
      "rating": "10",
      "text": "it is a funny movie that expresses emotion in friendship, and love and the passable joy of two friends etc. overall the movie it self is funny and moving 10/10"
    },
    {
      "rating": "5",
      "text": "Steve Carell is always funny, but this time he's working with unusually bland and predictable script, even for mainstream comedies. There were a FEW laughs to be found, but overall it was quite forgettable in every way. The \"Artist\" in this movie is one of the most horrendously unfunny characters I have seen in a long time."
    },
    {
      "rating": "10",
      "text": "I notice bad review for that film.I don't care that movie made me laugh. It's rare that a movie could do that!!!"
    },
    {
      "rating": "8",
      "text": "To be honest, I find most movies in the \"stupid funny\" genre to just be stupid and a waste of time, but I like Paul Rudd and Zack Galifianakis so I gave it a shot, and I'm glad I did. It was definitely one of the funniest movies I've seen in a while."
    },
    {
      "rating": "9",
      "text": "Good film. Felt for Steve’s character. He and Paul Rudd did a good job in this movie."
    },
    {
      "rating": "9",
      "text": "Its a very funny movie, but everyone knows how the movie is going to turn out."
    },
    {
      "rating": "10",
      "text": "Friggin hilarious!! Steve and Paul are great!!"
    },
    {
      "rating": "10",
      "text": "Funniest movie Carrell has made. Non-stop laughter through out the movie, regardless of how predictable!"
    },
    {
      "rating": "8",
      "text": "Carell shines in what is a very funny movie that drags in a few points. The last half is a gut buster."
    },
    {
      "rating": "9",
      "text": "I found this movie to be entertaining and have a balanced mix of humor, tension and tender moments. I believe the best way to view this movie is to set yourself into a frame of mind where you want to laugh and don"
    },
    {
      "rating": "9",
      "text": "This is one of the top 10 comedy movies of all time. It is a shame that bad trailers and critics with a bias against remakes of foreign films will deter some people from going to see this. On its merits, this movie should make as much as The Hangover. Hopefully, good word of mouth will help."
    },
    {
      "rating": "7",
      "text": "A funny film that is both predictable and meandering at times. However, the cast is uniformly excellent and you never feel at any moment that any of the leads are putting on a performance. It is that earnest quality in Carrell especially that keeps the sappy slightly moving and keeps the laughs genuine instead of forced. It is this quality in Carrell and Rudd that makes them so much better than most of their counterparts. No matter how silly the character they play they are always real people (and I gotta tell you that I would never in a million years buy that some of the people in this movie exist). It is this ability to take the ridiculous and make it plausible that makes these movies so funny. I cannot say that this movie is in any may original and you will see the end coming before it begins but, as an entertaining evening with friends this is the one to see for now."
    },
    {
      "rating": "0",
      "text": "This movie was terrible, awkward, and stupid. You must be dumb if you liked this. The guy named Barry in this movie was just plain annoying. I hate this"
    },
    {
      "rating": "2",
      "text": "A very very poor remake of the original version."
    },
    {
      "rating": "10",
      "text": "I think this movie was a surprise, but in a good way. I didn't expected this by the trailer I've seen and I was suspicious if the rudd carell duo would work. And it did. Basically it was an awesome movie and I recommend to everyone except the critics."
    },
    {
      "rating": "4",
      "text": "I was honestly disappointed upon seeing this movie, especially after some hype due to its respectable metascore. I'm a fan of Steve Carrell and have enjoyed almost everything he's put out in recent years. However, I felt this movie was just too over the top at times, even for a comedy. Such scenes just took away from the film and left the audience with forced laughs. This movie did have sincere laughs in it and was still enjoyable. The most troubling fact is that the movie had the potential to be so much better had it invested more in down to Earth humor instead of the over the top fiasco the audience is led through for close to an hour."
    },
    {
      "rating": "4",
      "text": "The trailer was completely misleading as the majority of the movie had nothing to do with the dinner. The dinner, however, was the only really funny part of the movie. I really like Steve Carell, but he is really annoying in this one. Not a complete waste of time, but definitely a sub-par comedy that is worth no more than a rental. I'm just glad this was a matinee for us."
    },
    {
      "rating": "3",
      "text": "a few good laughs but not as tight as it needed to be to in its lunacy to take full advantage of these 2 funny actors...expected more somehow"
    },
    {
      "rating": "7",
      "text": "Like Murder by Death, and though the laughs come from a different source, not a bad film. A rental, though. Not necessary to see on a big screen."
    },
    {
      "rating": "0",
      "text": "Horrible, un-funny movie. Painful to watch. Left early and got my money back. I was very disappointed. I expected a lot more out of such an amazing group of comedians."
    },
    {
      "rating": "6",
      "text": "Nobody likes to see a good person being treated like a schmuck. In Nancy Savoca's \"Dogfight\", the waitress is the schmuck, a shy woman, treated so by a marine, a coffee shop customer she follows to a bar, where Rose(Lili Taylor) unwittingly enters an anti-beauty contest, a pageant no woman ever dreams of winning. The IRS agent is the schmuck; the IRS agent-cum-taxidermist in \"Dinner for Schmucks\", who gets invited to a schmuck-fight by an up-and-coming businessman; a schmuck-fight that should make the moviegoer cringe, but doesn't. While it would be wrong to equate mice with Chinese dissidents, the same ethical questions come into play surrounding Barry's artwork, the same questions that plague the people responsible for Bodies...The Exhibiition. Lost in the artistry of the taxidermist's furry installations is that little matter concerning taste: Is it in bad taste to engage the dead with an aesthetic eye? And are Barry's tableaus, murder tableaus? When Tim(Paul Rudd) first bumps, literally bumps into Barry(Steve Carrell), the automobilist interrupts the mouse artist's process of obtaining his next carcass; a found object, presumably, cause of death unknown. \"Dinner for Schmucks\" never answers the question as to how Barry collects his subjects. Imagine the same installations, but with kittens, or puppies, then you get the idea. Contrary to Francis Veber's \"Le diner de cons\", in which the French schmuck is wholly sympathetic(no animals are harmed; he works with matchsticks), and schmuck's friend, undoubtedly a lout, who preys on the social misfit, this American retelling blurs the protagonist/antagonist binary(Rudd plays Barry with a dose of humanity). If Barry's rodents perished via means of corporal punishment, maybe there's a self-awareness to the taxidermist's naivety, the hustled playing the hustler, which lends a considerable edge to the farcical misunderstandings that temporarily dismantles Tim's personal and business relations. After all, Barry is a taxman with the power to audit; he can destroy Tim's life on purpose. The mice are adorable, but like the bodies in the controversial art exhibit that continues to tour the world, the dead rodents and human beings respectively, are victims of degradation; post-mortally humiliated by aesthetes. \"Dinner for Schmucks\" is more ambiguous than most mainstream comedies, because its not abundantly clear who the real schmuck is. How good can a taxman be?"
    },
    {
      "rating": "1",
      "text": "Unbelievably painful. Awful. Almost as bad as \"Date Night.\""
    },
    {
      "rating": "9",
      "text": "Although people will point to the lack of story and the huge plot holes that plague this movie, the fact is, it is hilarious. Carrell and Galfianakis are outstanding, and Rudd shows up on a few occasions. Also, the scenarios set up in this movie are classic, and, to me, it doesnt really matter how they get there just that its funny once they're there. Overall, it is a comedy that does not have the strongest story ever written, but if you have a sense of humor you won't notice that at all."
    },
    {
      "rating": "10",
      "text": "Movie is hilarious. Laughed my rear end off."
    },
    {
      "rating": "0",
      "text": "Horrible movie. NOT funny! I laughed maybe twice. People were walking out of the theater. The only time I have ever wanted to. Can't even come close to The\rHangover."
    },
    {
      "rating": "3",
      "text": "Acaso el peor remake gringo entre los nueves que se han hecho de alguna cinta escrita y/o dirigida por el maestro de la vulgar comedia de boulevard Francis Veber. Para lo unico que sirve este bodrio es para recordar la grandeza misantropica de la cinta original, Un Tonto a Domicilio (Veber, 1998)."
    },
    {
      "rating": "9",
      "text": "The problem with people these days is that they think a movie where people take a benzodiazepine is the funniest thing ever.This movie was funny. I would put it up there with Hot Fuzz."
    },
    {
      "rating": "4",
      "text": "I haven't seen French movie it's based on, but Dinner for Schmucks was very disappointing.  The trailer continued at least half of the truly funny moments in the movie, of which there were precious few.  It starts off fairly strong, but loses almost all steam in the painful-to-watch scenes involving Rudd's character's \"stalker.\"  The first scene just sucked the life out of the movie, and it doesn't really regain its footing until near the end, and even then still can't capture the strength of the first 15-20 minutes.  I really like the cast, but unfortunately the jokes just weren't there, and instead we get a movie that can't decide if it wants to be funny or poignant and winds up neither."
    },
    {
      "rating": "5",
      "text": "steve corell has been on a downward spirel in his movies lately with every pretty much every thing being bad or mediocore . you can add this to the mediocore department . the jokes are eather not funny or are forced . the chemistry between corell and rudd is flat . even the last 15 minuites which you would think would be the funniest part was barely a few chuckles in it . i know corell is funny he was great on the daily show and in 40 year old virgin ."
    },
    {
      "rating": "8",
      "text": "Insanely funny. Even when things aren't as funny as the rest of the movie, Dinner for Schmucks never stops being entertaining. Recommend at least one viewing."
    },
    {
      "rating": "10",
      "text": "Good movie. Plot kept you interested. Steve Carrell's character is, as usual, way over  the top. But Carrell has a weird way of making those characters believable, somehow. Not the best movie in the universe, but it's worth your $10 to go see."
    },
    {
      "rating": "7",
      "text": "After viewing director Jay Roach's Dinner for Schmucks, The Movie Gal dubbed the comedy \"the most bipolar movie\" she'd ever seen, and that essentially sums it up - Schmucks is hilariously malicious, the kind of film that beats its characters to a pulp, then points its finger and laughs. You're supposed to be laughing too, but you may also find yourself shying away, averting your eyes while Schmucks continues to elbow you in the ribs, and laugh obnoxiously in your ear. More: http://cinewise.blogspot.com/2010/08/dinner-for-schmucks-2010.html"
    },
    {
      "rating": "7",
      "text": "As I was watching this movie i kept thinking this is really stupid. But then a hilarious parts would just keep coming up between stupid parts. I was happy by the end of it none the less."
    }
  ]
}