{"id": 630, "title": "Dinosaur", "starring": ["D.B. Sweeney", "Alfre Woodard"], "runtime": 82, "genre": ["Family", "Animation"], "description": "An orphaned dinosaur raised by lemurs joins an arduous trek to a sancturary after a meteorite shower destroys his family home.", "releaseYear": "2000", "mpaaRating": "PG", "imageUrl": "https://image.tmdb.org/t/p/w500/rSje3FS7ycJSglowlngjsvDt7vO.jpg", "categories": {"plot": 7.333333333333333, "acting": 7.75, "ending": 10.0, "soundtrack": 9.25, "cinematography": 8.0, "familyFriendly": 6.666666666666667, "funny": 5.0, "action": 8.25}, "reviews": [{"rating": "5", "text": "Dinosaur is a mixed bag. There are some amazing moments in the film where the visuals and score combine to provide an amazing experience. At other times the film can be bogged down by some cheesy dialogue, generic characters, and some noticeably fake CGI along with the Dinosaurs and environment not meshing well. Kids will love this film, like I did, while adults may not. I’m alright with it primarily because of nostalgia and the excellent score. Not much hear for an older audience but the moments where the film shows and doesn’t tell make it watchable."}, {"rating": "10", "text": "One of THE BEST Animated movies that released back then , unforgettable jaw dropping i really cannot say enough , It of course is not one of the toy story trilogy 10's but it is in its own League with a 10 ."}, {"rating": "9", "text": "a visually stunning film with a wonderful story. the best part of the film and i am not putting it down is the music. a truly magnificent soundtrack and score."}, {"rating": "6", "text": "It was a simple and overflowing movie , but the visual effects and plot, were well coordinated , the age of the dinosaurs was very captivating , but I would stay with Jurassic Park, that movie almost did not convince me , a little."}, {"rating": "6", "text": "Dinosaur is that one movie where its plot seems dull but the effects saved it for the rest. Watching this movie again depends on how lovable this movie should've been in the first place."}, {"rating": "6", "text": "Yea, Dinsoaur deserves to be on Disney productions and it's winner of some awards, but it has unremarkable characters, boring story-telling despite his great and creative plot. And it may have some mistakes on the characters and dinosaurs that appears, it doesn't work with the real dinosaur history."}, {"rating": "1", "text": "Extremely boring with next to no story or character development nice animation though."}, {"rating": "10", "text": "an unforgettable CGI movie from my childhood."}, {"rating": "5", "text": "I admit the CGI was extraordinary at the time for an animation. However, the story and characters were not."}, {"rating": "6", "text": "Well it is visually dazzling and can be heartwarming, but its thin story makes this a very boring and unentertaining film you wish you had never laid eyes on. I give this movie a 56% of a good movie."}, {"rating": "0", "text": "I thought the movie was bad. really suprised at the ratings, i only watched a minute of it and knew it would suck because of the airplane scene that was copied from jurassic park 3. Also the fake bigfoot, a cheap movie trying to convince people that it's real."}, {"rating": "9", "text": "A visually stunning film that is elevated by its enchanting score and story that can be enjoyed by all ages. It was a different kind of Disney movie that still stands up after all these years."}, {"rating": "8", "text": "A true Disney classic not as well known but still enjoyable, with likable characters."}, {"rating": "7", "text": "It's a passable film, the plot is pretty generic and doesn't offer alot to be desired but the CGI was extraordinary at the time for an animation.  Still, the screenplay can be dark and rather intense at times and I liked how they didn't shy away from the violence of animal nature"}, {"rating": "9", "text": "This movie was my first favorite dinosaur movie. Since then, I have been introduced to others that are just as thrilling. The animation is amazing, the emotional meaning is real, it's one of the many movies of Disney that I love!"}, {"rating": "8", "text": "While watching Disney's Dinosaur, with all of its incredibly rendered creatures and seamless blending of animated objects with real backgrounds, a question occurred to me: In movies like this, can the writing keep pace with the technology? Films like Toy Story and Toy Story 2 (released by Disney, but produced by Pixar) confirmed that dazzling computer animation does not have to overshadow the screenplay. Unfortunately, Dinosaur (done entirely in-house at Disney) argues the opposite. As stunning as this movie is from a visual point-of-view, it boasts little else of great interest. Like so many big summer extravaganzas, this is a classic example of the triumph of style over substance.\r Of course, since Dinosaur is a Disney animated effort and is geared primarily towards a younger audience, one has to make certain allowances. And kids will love the film. Although old and young alike will be awed by the spectacle of dinosaurs coming to life, the adventure, romance, and moralizing are all aimed squarely at the under-10 crowd. Children will enjoy Dinosaur as a fairly typical Disney-generated experience. Adults will appreciate it on another level, marveling at what cutting-edge special effects can accomplish while paying little or no attention to the rudimentary story and bland characterization.\r There's not much to the plot. It's essentially a prehistoric road movie with a little Tarzan thrown in for good measure (once again, Disney recycles themes and ideas). Aladar (voiced by D.B. Sweeney) is a dinosaur who has been raised by a family of pre-monkey mammals. His mother (voice of Alfre Woodard), grandfather (Ossie Davis), and siblings are all cute, furry creatures that make the Ewoks look like grotesque monsters. Disney couldn't possibly have further ratcheted up the cuteness level. At any rate, after a good portion of the surrounding terrain is devastated by a meteor strike (not the Big One, apparently, since there's no lasting nuclear winter), Aladar and his mammal friends join a herd of dinosaurs who are on their way to The Nesting Ground (dino-speak for Eden). The journey is arduous, with danger coming from climate changes (water is difficult to locate), roving predators, and in-fighting among the dinosaurs. In the end, it's up to Aladar to prove his mettle and be a hero.\r While the dinosaurs look great, their appearance is not necessarily an attempt to represent reality. The animators have taken liberties, making the creatures viewer friendly. The \"good dinosaurs\" seem clean-cut and streamlined. Their colors and overall look is pleasing to the eye. Only the \"bad dinosaurs\" appear ugly, with knobs, spikes, and bumps marring the smoothness of their hide. Comparisons to the BBC television series Walking With Dinosaurs are inevitable, since both that program and this movie employed the latest computer-generated animation to create life-like dinosaurs. While the work for Dinosaur is more vibrant and colorful, Walking With Dinosaurs gets the nod for realism. (It's also worth noting that the mini-stories told during the course of the TV series were in many ways more compelling than the plot of this movie.)\r Dinosaur contains two sequences of eye-popping majesty. The first is the ten-minute opening, which shows various facets of everyday dinosaur life: herbivores munching on plants and wading through water, small carnivores snapping at each other, and a Tyrannosaurus Rex bursting from its hiding place and finding prey. Subsequently, an egg is stolen from a nest, then makes a long journey by land, sea, and air to the island of the mammals, where it hatches. The flying scene, which depicts landscapes dotted with herds of dinosaurs, is especially impressive. The second sequence occurs when the planet is bombarded by hundreds of small meteors and one large one. Although images of destruction are sanitized to avoid traumatizing some viewers, younger children may become frightened.\r Co-directors Eric Leighton and Ralph Zondag have crafted a film that will be an unqualified success with their primary target group. Children, more interested in fast-moving action than in a story with characters, will adore every moment of Dinosaur's relatively short, 84-minute running time. Adults may be more restrained in their praise, but, even though the traditional aspects of cinema are lacking, it's hard not to be impressed by the package as a whole. Dinosaur is worth seeing. And seeing, as they say, is believing."}, {"rating": "8", "text": "I thought Dinosaur was a lovely film. The computer animation is beautiful, and I thought the music score was wonderfully dynamic. The vocal ensemble, lending their voices to a very likable bunch of characters, do a very commendable job, especially Samuel E.Wright, DB Sweeney, Joan Plowright and Haydn Pannettiere. My complaints with the movie are that the carnotaurs were very frightening, and some parts do drag in the story particularly in the middle. Still, it is redeemed by some beautiful animation, likable characters and very interesting parts in the script. In conclusion, compared to what it could have been, not that bad at all, though it never was supposed to surpass Pixar delights like Toy Story. 8/10 Bethany Cox."}, {"rating": "10", "text": "This movie has some of the best animation, music, and characters I have seen. I loved it as a child and I still love it to this day. I definitely recommend you watch this movie."}, {"rating": "8", "text": "\"Dinosaur\" is an eye-popping visual spectacle that serves up a vivid picture of what the planet might have looked like when reptiles ruled the Earth.\r To modern audiences for which technological achievements usually count for far more than artistic ones and special effects coolness very often reps the most valuable possible B.O. component, “Dinosaur” definitely has what it takes. The startling visions of the first few minutes alone  a ferocious toothsome attack and a flight over huge herds of dinosaurs inhabiting magnificent actual landscapes  are enough to thrill any viewer as well as to serve notice that there’s never been anything quite like this before.\r The visual splendors continue, to be sure, across the pacy 75 minutes of story time (seven minutes of credits follow). But it’s also the case that, somewhere around half-way through, you begin to get used to the film’s pictorial wondrousness to take it for granted, even and start to realize that the characters and story are exceedingly mundane, unsurprising and pre-programmed. Directors Ralph Zondag and Eric Leighton seem afraid to show anything that will be the least bit disturbing or upsetting to anybody. Sure, 5 year olds will be momentarily frightened by the sight and sound of giant lizards roaring at them, but this is a dinosaur picture that’s petrified of showing death, for God’s sake , that shies away from all the grand elements that could have given it true stature and resonance: Majesty, terror, grandeur, tragedy and savage instincts in their most primitive state. Pic’s sensibility is closer to a “Sesame Street” lesson in caring and cooperation than to any monster favorite one could think of , from the original “The Lost World” and “King Kong” to “Jurassic Park” and even Disney’s own “The Rite of Spring” episode in “Fantasia.”\r The great leap forward here lies in the incomparably “photorealistic” placement of computer generated creatures within real-world settings. Per the press materials, finished film includes more than 1,300 individual effects shots , and special attention was paid to such difficult-to-achieve illusions as detailed animal muscle movement, physical contact with water and dust, credible shadows and dinosaur p.o.v. shots. All the effort in these areas has paid off magnificently, to the extent that it’s safe to say that the bar has again been raised in this realm of CGI and effects-based pictures.\r Would that one-tenth as much time and energy gone into developing more musculature and a few additional wrinkles for the storyline. Having begun life in 1988 as a script by Walon Green for Paul Verhoeven to direct as a live-action feature with effects by Phil Tippett (one need only think of “Starship Troopers” to imagine what that might have been like), screenplay as ultimately worked out by John Harrison and Robert Nelson Jacobs feels cobbled together with elements from the likes of “Tarzan,” “The Lion King” and, of all things, “Red River.” Result is synthetic rather than elemental, and with a pre-digested taste.\r The various creatures are brilliantly rendered; they interact credibly with one another and are integrated seamlessly into the backdrops. But as realistic and expressive as they are, they don’t engage the emotions any more directly than have many more cartoonishly rendered animated characters in the past.\r In a film in which the foreground technological wonders will be so widely noted, the superlatively chosen backgrounds should be mentioned; fantastic locations in California, Australia, Hawaii, Florida, Venezuela and Western Samoa have been combined to fashion the world of the late Cretaceous Period. James Newton Howard’s orchestral score is unusually good, and the sound work is expert."}, {"rating": "10", "text": "One of THE BEST Animated movies that released back then , unforgettable jaw dropping i really cannot say enough , It of course is not one of the toy story trilogy 10's but it is in its own League with a 10"}, {"rating": "10", "text": "I love it. It is awesome at this Disney animation and live action CGI movie with a talking Dinosaur named Aladar raised by Lemurs. Still though, nice."}, {"rating": "7", "text": "Visual DelightThough the script is very so-so, The visuals (For 2000) are incredible."}, {"rating": "10", "text": "Dinosaur is one of disney's most underrated films, with a flawless soundtrack and technically beautiful animation."}, {"rating": "10", "text": "Best characters in dinosaur movie and awesome dinosaur villains love it great job this flim is masterpieces awesome performances characters and the soundtrack great intro flim end everything in movie  and visuals are stunning in this movie and the movie is better than Jurassic park 2 and 3 best dinosaur Disney movie"}, {"rating": "9", "text": "Love this movie. Grew up with this movie. Paid critics know nothing. Give it a watch. Watch with your kids. Nice animation and real world combo"}], "recommendations": ["kubo_and_the_two_strings", "isle_of_dogs", "luca", "wolfwalkers", "how_to_train_your_dragon", "how_to_train_your_dragon_2", "the_iron_giant", "paprika", "raya_and_the_last_dragon", "jurassic_park", "the_book_of_life", "the_call_of_the_wild", "your_name", "the_good_dinosaur", "ghost_in_the_shell", "the_boxtrolls", "atlantis_the_lost_empire", "the_incredibles", "mowgli_legend_of_the_jungle", "finding_nemo", "over_the_moon", "song_of_the_sea", "avatar", "treasure_planet", "how_to_train_your_dragon_the_hidden_world"]}