{
  "id": 1267,
  "title": "Dirty Grandpa",
  "starring": [
    "Zac Efron",
    "Robert De Niro"
  ],
  "runtime": 102,
  "genre": [
    "Comedy"
  ],
  "description": "Jason Kelly is one week away from marrying his boss's uber-controlling daughter, putting him on the fast track for a partnership at the law firm. However, when the straight-laced Jason is tricked into driving his foul-mouthed grandfather, Dick, to Daytona for spring break, his pending nuptials are suddenly in jeopardy. Between riotous frat parties, bar fights, and an epic night of karaoke, Dick is on a quest to live his life to the fullest and bring Jason along for the ride.",
  "releaseYear": "2016",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/qSJE2KloazcGrpGCCUVVX8ZKlsW.jpg",
  "categories": {
    "plot": 3.6153846153846154,
    "acting": 3.6341463414634148,
    "ending": 1.0,
    "soundtrack": 0.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 4.9753086419753085,
    "action": 6.285714285714286
  },
  "reviews": [
    {
      "rating": "3",
      "text": "The usual, nothing innovative about it!\r Everything I wrote was just my personal opinion, definitely not intended to offend anybody. This should have been one of the best comedies of the year, but now it belongs to one of the worst. I recommend 'Grandma' instead this which I felt a much better comedy.\r At this age, Robert De Niro was unbelievably awesome, though his character needed a good support from another and that's where as usual Zac failed to deliver his part. I would have preferred someone like Taylor Lautner who's desperate for a breakthrough than the Zac who ruins always.\r The screenplay was from the 'blacklist', knowing this they should have been more careful while casting for it. The story was okay, because it was not meant for one of the greatest films of all time. It was sort of a weekend getaway or the bachelor party theme, but the film gives its original reason and then those developed plots were too familiar if you have seen plenty of teen films, in the party theme.\r It's supposed to make us laugh, but there are lots of outdated humours tried in the unusual route to narrate them. The grandfather-grandson combo was an excellent idea, the main plot revolves around them and it should have remained that way, but the undetermined romance was an interruption. Or they should have developed a decent romance track for a better balance in the genre.\r At least it would have been all right if it was a teen film. Many of those who appeared in it were actually too old to represent the roles given to them. That's fine too, because films are fake, everything is make-up and performance, but none were at their best except De Niro and Aubrey Plaza. It is definitely a film to skip, that's my opinion, but they're a few who are defending it, so be careful that I'm not always right and they're not always wrong if you want to choose it.\r 3/10"
    },
    {
      "rating": "3",
      "text": "The biggest mistake 'Dirty Grandpa' makes is the thinking that vulgarity automatically equals hilarity. At the movies core it's a 'road trip' flick, with this one revolving around a young, overly career focused man (Zac Efron) and his recently widower grandfather (Robert De Niro) who wants to feel ''young again''. The movie does have moments of tenderness between the two main characters and for the most part Efron and DeNiro are rather convincing, however those short moments of character depth are completely drowned out by the constant flow of forced innuendo and vulgar dialog that completely misses the mark in delivering any humour. Having an old man facing the concept of mortality and his workoholic grandson who has forgotten how to enjoy life could have been rather interesting. An interesting dynamic that the movie only suddenly cares about showing in the third act, which is simply to little too late and falls flat. Not well written, not well directed and not really funny, unless you like dick jokes, and by ''dick jokes'' I mean people just saying ''dick'' a lot."
    },
    {
      "rating": "6",
      "text": "Gross, tactless, and offensive from beginning to end. Know that going in and you can have a fun time with Dirty Grandpa. The jokes are hit-and-miss, but the chemistry between the cast makes up for most of the fumbles."
    },
    {
      "rating": "3",
      "text": "This film was just... so... you know... bad....\rFirst i will start with the few bright spots of this movie. The bright spot is Robert De Niro. The film the story the jokes were terabille but he was good in this movie. I just can't understand why is he picking so many bad projects. The other one was Zac Efron he was good in this movie too and the chemistry between them were great. But the rest of this movie is just pure garbage. The directing was horrible scenes where constructed so poorly and transitions between them where so unbelievable horrible the tone was pure garbage too. The script was abhorrent. It is one of the worst script's ever. Characters are written awfuly. The story is non existent, motivations are a joke, the dialog is hideous it is honestly disgusting. The joke's where so bad they were so dreadful. I hated the jokes so much. because they went for shock value and they achieved it i was shoked i wasn't laughing tho i was disgusted.n this whole movie there is only one decent scene and that's after credits scene that i smiled And thats it this movie just wasn't funny at all."
    },
    {
      "rating": "2",
      "text": "Has a couple of funny moments. Felt like the film-makers thought that vulgarity equalled hilarity.\rScript wasn't the worst, however direction felt terrible.\r Acting was decent, nothing great.\r Would not recommend."
    },
    {
      "rating": "1",
      "text": "“Dirty Grandpa” es una película más de una pareja de polos opuestos en un viaje por carretera llena de clichés, pero tiene foco solo por las celebridades de portada.\rLa historia inicia con el funeral de la abuela de Jason (Zack Efron), donde él se presenta como un joven recto con grandes aspiraciones, a punto de casarse e iniciar su vida laboral en la firma de abogados de su padre. Todo cambia cuando aparece Dick (Robert De Niro), su abuelo, quien le pide que postergue su itinerario para acompañarlo en un pequeño viaje para hacer honor a la difunta.\rLas expectativas comienzan a caer en picada tras la siguiente escena, donde devela la corriente humorística que utilizará durante la siguiente hora. Escenas vulgares, hacer objeto de las mujeres, bromas fálicas y personajes estúpidos e incoherentes son las cartas que utiliza para entretener, y está bien si eso te divierte, pero comparándolo con otras comedias este film ni siquiera intenta hacer algo distinto o nuevo.\rEl elenco no sobresale, De Niro solo cumple con su rol y Efron como positivo tiene una escena donde canta. Los actores secundarios son olvidables, sus personajes carecen de profundidad o carisma, solo sirven para dar pista a los remates de los protagonistas.\rSi buscas reírte y pasar un buen tiempo evita “Dirty Grandpa”, es guion cutre que solo explota la popularidad de los actores principales."
    },
    {
      "rating": "0",
      "text": "Truly one of the worst movies I have ever seen! De Niro should be ashamed! I want my money back!    I brought my 79-year-old father to see this movie and I  was mortified! I was expecting a movie similar to The Intern but as a road trip \"feel good\"  type of movie. Boy, was I in for a big surprise."
    },
    {
      "rating": "6",
      "text": "What I laughed at In Dirty Grandpa was the wackiness ensues in this dumb entertaining fantasy, it's not perfect and through out it's a painful, offensive and uncomfortable dirty film that a times it is a torturous to even watch, also it's painfully predictable. Robert De-Niro makes another career-ruining decision, but Zac Efron is really good at these R-rated comedies (even if there crappy like Awkward Moment and this one), but it's outrageously funny with DeNiro's insolent one-liners, Efron attempts the straight man in a comedy,  we have ourselves a strange outrageously funny comedy. Zac Efron plays Jason, he's a lawyer who ditched his dreams of photography, to take a job at his father's (Dermot Mulroney) law firm, who's about to marry his nagging shrew fiance (Julianne  Hough). Robert DeNiro plays Grandpa Dick, after his wife's funeral Jason agrees to take Dick to his home in Florida. They pare up in Daytona Beach, all Grandpa Dick wants to do is have sex with women, because his dying wife's wish was he can get back out there again. Jason bumps into Shadia (Zoey Deutch) who's a photographer who used to be Jason's former photography class partner, Dick meets Lenore (played by Audrey Plaza) who's a college student also slut who is obsessed with having sex with ol' grandpa.  And their gay best friend Bradley (Jeffery Bower-Chapman) whom Dick seems to make fun of him because of his sexuality, are all heading to Daytona Beach, Florida, for spring break. DeNiro and Efron have good chemistry also DeNiro and Plaza have some funny decent chemistry as well, despite a crappy script by John M. Phillips also a crazy direction by director Dan Mazer, I laughed. 3 out of 5 stars"
    },
    {
      "rating": "6",
      "text": "It's amusing and sometimes outright funny.\r Efron and De Niro play off each other well (like a millennial odd couple) but the material doesn't really rise to either of the actor's performances. You'll see De Niro masturbate and a close up of his character's penis plus Efron's ass makes a couple of appearances if you're into that sort of thing.\r It's not terrible but it's not consistently funny either. Skip this one in the theater. It'll be a fine Netflix time-waster one of these days."
    },
    {
      "rating": "6",
      "text": "There's a lot of negativity surrounding this film and, while some is well deserved, quite a lot isn't. It's an 'exactly what it says on the tin' movie, so if you've seen the trailer and want to watch, you won't find anything beyond your own expectations.\r De Niro plays 'dirty' grandpa next to Efron's preppy lawyer, soon to be married, thumb up his own arse, grandson. At the after funeral party of his wife, De Niro insists that Efron drive him down to Florida for what would be his Grandpa's annual trip there.\rCue sex gags, lots of women in bikinis, drug taking, beer chugging and more uses of the 'F' word by De Niro since Goodfellas (and probably a whole lot more actually).\r The storyline itself isn't the main draw, it's the undeniable on-screen chemistry between De Niro and Efron, they look like they're both having fun playing against type, and it's De Niro's best comedy performance since Midnight Run.\rAction/comedy are the watchwords, but there are some genuinely amusing 'out of the blue' moments that I wasn't expecting.\rHowever, the rest of the film isn't brilliant. There are various stereotypical lesser characters: Efron's uptight, bossy fiance... The weird older brother... Indian(?) shop owner who sells narcotics... Bumbling muscly dudes from the Lacrosse team... Hot college girl who wants the 'sex trifecta' and actively goes after DeNiro....\rEven the romance between Efron and his high school sweetheart is overly forced, as we all know exactly how it will end, even if the ride getting there is a fairly fun one....\r Overall, it's not the abject disaster which everyone claims it to be. It's no 'Midnight Run' in terms of a De Niro comedy, but it's no 'Meet the Fockers' either (I so hate that film!!!)... It nicely sits in the middle, offering a decent slice of laughter, served with a sizeable portion of unoriginality."
    },
    {
      "rating": "4",
      "text": "I guess I'm really immature because I laughed a lot during Dirty Grandpa. The jokes are hit-and-miss but they hit really well. De Niro and Efron are really funny too. Not good but funny enough."
    },
    {
      "rating": "0",
      "text": "First of all understand this is a raunchy \"frat style\" movie filled with vulgar language and scenes from beginning to end - it is NOT a movie meant to be critiqued in quality of script or plot. Basically it boils down to an old widowed \"grandpa\" who just wants to do all the \"dirty\" stuff he could not do while he was faithfully married to grandma. If you sit back and do not take anything too seriously - as in plot line or script - it is very funny from beginning to end...in grandpa relives a frat party kinda way! 9 for acting - especially from Deniro, 7 for script and 5 for the predictable plot line...The movie is a great way to escape into 90 minutes of a ridiculously raunchy funny \"dirty grandpa\" leading his buttoned up grandson from one obscenely raunchy scene to another. What made it work for me was Deniro! He is a veteran genius actor who - no matter what movie he is in - can still carry any scene or movie he wants! Considering the plot line and script was predictable Efron and Deniro played well off each other as the movie jumped from one ridiculous scene to another.In the end it is a great movie to just sit back drink a beer or two and laugh without expecting much more other than funny acting from Deniro. 90 minutes of grandpa acting and talking like a dirty old man - while his grandson trys to understand what the heck is wrong with my grandpa! I laughed from beginning to end and at least in the past most raunchy frat style movies - ranging from Porky's to Bad Grandpa - made me laugh far less. If you laughed watching Meet the Fockers/Parents/Little Fockers, Neighbors, Caddyshack, Stripes, etc. then watch this and just sit back, chill out & enJoy!"
    },
    {
      "rating": "5",
      "text": "Look, if Robert De Niro rapping the n-word and making 100 penis jokes is your thing, then “Dirty Grandpa” is your \"Citizen Kane.\" If not, then this is a still relatively entertaining, albeit predictable as anything, comedy."
    },
    {
      "rating": "6",
      "text": "Dirty Grandpa gives you exactly what you would expect when you read the title. The film is raunchy as it gets. Robert De Niro is so funny as the most wild grandpa that anyone could ever have and he has surprisingly great chemistry with Zac Efron. Robert De Niro has been known to dip into comedy here and there but this is certainly as \"dirty\" as he has gotten and I would say that it is the funniest film I have seen him in a long time. Efron is also really good in this movie. I think that he's one of the more underrated actors in Hollywood right now. Sadly outside of the humor that I thought was fairly plentiful this movie does not have a whole lot more to offer. There are a few members of the supporting cast that are fairly good Aubrey Plaza could be as funny as I've ever seen her which is saying something. Zoey Deutch was great and I'm sure that her \"girl next door\" personality will get her roles in some more films soon. Dirty Grandpa is pretty predictable in the third act which brags it down and there are a few characters that take up a little too much of the screen time rather than focus on the character that we like. Its not a perfect movie but I can recommend it to people who love great laughs."
    },
    {
      "rating": "3",
      "text": "Well first to start off on my review of dirty grandpa I'm going to give three words that would describe this movie as whole: raunchy, predictable, and comical. The title pretty much gives the whole movie away, and you basically know what going to get which is a raunchy, predictable and funny grandpa. This movie other than the grandpa had little to storyline, and Zac Efron did decent for a role that didn't fit him well. I feel the actors did the best job they could of done, but this one is on the very bad storyline and directing, not the actors"
    },
    {
      "rating": "2",
      "text": "What can I say about this ****\rThe worst. Just awful. A bad, unfunny comedy that tries too hard to be \"witty\" and \"smart\" while it fails, really fails. Robert de Niro was a **** choice for the \"grandpa\" that is addicted to sex (creative, right? Because this totally didn't happen in \"Bad Grandpa\" another awful movie that's a 3/10) they just try too hard to make him funny with offensive jokes, that just end up being pointles, in one part we find the old **** masturbating, which is just **** wierd. They just tried to make a quick buck with familiar faces.\rFinal Verdict:\rTerrible, fans of the actors will hate it, actually, everyone will.\rAlso, it reached my list of the 10 worst movies, which I will now start to fill."
    },
    {
      "rating": "2",
      "text": "While Efron and De Niro aren't the worst, Dirty Grandpa suffers from trying to stuff way too many jokes, many of them being very unfunny, into a short runtime, creating a movie that drags for ages and comes off as offensive rather than comedy.  The plot is uninteresting, the side characters are awful, and Dirty Grandpa is simply a bad time at the theater."
    },
    {
      "rating": "3",
      "text": "Dirty Grandpa marks the lowest point of De Niro's career. The movie is disgusting throughout and the last 30 minutes are terribly unfunny. I will admit there was some laughs because of De Niro but this movie mostly a nasty, with cringe-worthy comedy that is lazy from start to finish."
    },
    {
      "rating": "3",
      "text": "Dirty Grandpa es una prueba más de que teniendo un excelente actor, en este caso DeNio, no significa que la película será algo bastante graciosa y bueno. Zac Efron sigue aún estancado en este tipo de películas.\r Lamentablemente DeNiro no pensó en hacer está película."
    },
    {
      "rating": "2",
      "text": "Robert DeNiro and Zac Effron - what were you thinking?\r Both DeNiro and Effron star in the new rude, crude, and obscene film 'Dirty Grandpa'. We are ‘treated' to seeing Robert DeNiro (as perverted frisky and unsexed Grandpa Dick Kelly - get it?) masturbate to an interracial pornography video the day after the funeral of his wife who he was with for 40 years. We also get to see Effron's (James Kelly) brother pouring beer over his dead grandmother’s coffin, Effron wearing a bee thong with his arse out in the open (several times), which at one point comes off causing him to expose himself to a little boy, while simulation with the assumption of oral sex between the two (I’m not kidding here) and an endless, and I mean endless, supply of cock jokes, and cocks (one scene has Effron and DeNiro sharing a bed together in which DeNiro sleeps naked, and the next moment there is a penis in his face supposedly to be Grandpa's). This is not to mention scenes of Effron in jail with a fellow cellmate feeling him up, the one gay character in the movie being made fun of because he is gay, two inept police officers who all but ignore the town’s drug dealer (Adam Pally) who happens to shoot guns in his tourist a/k/a drug shop, and an extremely horny young woman (Zoey Deutch) who has way too much sex talk with DeNiro. It all adds up to one dirty, and bad movie. The plot is this: after the death of his wife, Grandpa Kelly wants to head down to his condo in Florida, so he tricks grandson Jason into driving him down there, much to the dismay of Jason’s fiance Meredith (Julianne Hough), who’s he about to marry and with the wedding rehearsal just days away. On the way Grandpa and Grandson run into Grandson’s ex-schoolmate Lenore (Aubrey Plaza), with the aforementioned horny Shadia (Deutch) and the gay camp Tyrone (Brandon Mychal Smith) in tow. Shadia’s got the hot hots for Grandpa (to tick one of her ‘must do’ boxes) and Lenore will realize that she’s got the hots for Jason. It’s a road trip that ends in most of the character’s lives changed, as well as the audiences. You will walk out shaking your head and vow to never see a Zac Effron (and possibly a Robert DeNiro) film ever again. Thanks to Director Dan Mazer (The Dictator) and writer John Phillips for taking Effron and DeNiro to new lows in their careers."
    },
    {
      "rating": "0",
      "text": "Deniro didn't make a whole lotta bank back in the 70's and early 80's when he was creating immortal characters and building his career. For the last 15 years or so, he's just been cashing checks and trying to get some of that overdue A list money. Happy he's getting paid now and glad he took jobs like Raging Bull that paid peanuts--but for god's sake dude, this is some sad stuff right here. C'mon man--you're better than this."
    },
    {
      "rating": "1",
      "text": "Too dirty for everyone who's been dying to see it. Sadly, it was never a good movie anyways. This movie's just using your money so you can feel ashamed of watching this."
    },
    {
      "rating": "7",
      "text": "Okay, I know what you all may be thinking, Dirty Grandpa, the newest comedy featuring Robert “Refusing To Take A Pay-Cut” De Niro is just another sad excuse of a comedy featuring a world-class veteran actor whose acting days are numbered and career is slowly fading? Actually, the fact of the matter is, Dirty Grandpa is a very funny, very over-the-top, very rambunctious comedy with nothing but entertainment value, laughs and some good old-fashioned Hollywood fun at the movies, poking redeem fun at itself following the heavy and highly melodramatic Oscar burdened December month.\r I can think of so many other disappointing January films that I’ve seen in the past, that quickly make way onto my list of Worst Films of the year. Luckily for Dick Kelly (De Niro) and his lawyer loving grandson Jason Kelly (Zac Efron), the two won’t be making their way to that list. Filled with deadpan dirty talk, highly sexualize jokes, crude, rude and obnoxious taboo social references, Dirty Grandpa becomes one wild and dirty-minded fun filled trip to start off 2016.\r Not that the film should be a reflection of the film caliber of 2016, but Dirty Grandpa never becomes a film that falls and cannot get back up. Instead, the first comedy of 2016 tells the similar story to Pixar’s Up; but instead of the adorable Carl Fredricksen taking a wild trip on his hot-air balloon, Dick Kelly decides that, after a fifteen years abstinence, and with the loving approval of his dying wife, the secret ex-Military man decides to trick his favourite grandson along for a ride to Daytona Beach to find some horny and foul-mouth twenty somethings in a pink Mini Cooper. Kind of the same thing, right?\r What begins as a simple guys trip with golfing, dining and some male bonding, quickly turns into a wild weekend looking for answers for both men; sensory for Dick, and emotionally for Jason, who is unsure about his marriage to the all too perfect and tremendously overbearing Meredith Goldstein (Julianne Hough), who ultimately becomes the sexiest Bridezilla we have seen on film in a while.\r Luckily for our unlikely duo, answers quickly come, in the form of Lenore (Aubrey Plaza); a wild mouth lascivious college girl looking to bone a senior for the sake of completing a life long list of hers; and Shadia (Zoey Deutch), a free-spirited, organic loving, tree-hugging hipster who is the complete opposite of Jason’s Meredith. With the girls off to Daytona Beach, Dick begs his grandson Jason to pursue them, knowing that Dick is surely going to be able fulfill his dreams of sleeping with a college student. Luckily for the audience, the wildly uncalled for sexual banter between the doe-eyed Plaza and De Niro is what we look forward to the most, making their dialogue the highlight of the film overall. I mean, how funny is it hearing De Niro shout out things like, “Party ’till your pregnant!”, or “I got news for you. That’s the only thing that's going to be pulling out tonight.”(speaking about a pull-out couch).\r While the trip to Daytona Beach is anything but smooth, the duo encounter a slew of college obstacles that get in the way of their overall goals of bedding the girls of their dreams; from wild crack smoking Macarena drug-induced trips, to chugging contests, to “Flex-Offs” against dim-witted college jocks Cody and Brah (Jake Picking and Michael Hudson), acting as the duo’s main nemesis throughout the film, Dirty Grandpa is one downright messy, and we love it.\r Director Dan Mazer, the man behind writing comedy classic Borat and of course the highly bloated sequel-ish Brüno shortly after, does a decent job of delivering the laughs with a cast that could carry any movie and its comedic material any day of the week. Luckily for Mazer, Dirty Grandpa won’t be a critical hit by any means, but commercially, with a mere $11.5 million dollar budget, the film will likely make a decent marginal profit for the director.\r Its rude, its offensive and most of all, the social satire here is totally tasteless, although it is really funny seeing an elderly De Niro asking a group of black street thugs permission of using the derogatory ‘N’ word while singing Ice Cube’s “It Was A Good Day” in a Karaoke bar with his newly made ‘homies’.  Plus, when is a raunchy comedy not offensive? Obviously, if the film and its main sh*t disturbing protagonist isn’t raising a few eyebrows, something is wrong.\r De Niro is Hollywood royalty and can basically do whatever he wants with little to almost no repercussions at this point in his career. So if Robert De Niro, a man who notorious for his contributions to film, The Tribeca Film Festival, New York City culture (including trendy NYC restaurants and hot-spots) wants to do a film where he wears and shows off his prosthetic penis on-screen, hey, Mark Wahlberg did it, why not De Niro?"
    },
    {
      "rating": "0",
      "text": "They got one thing right \"Dirty\". Bobby DeNiro's talent is too good for a movie like this. Our audience became silent, we had to look back to see if they left."
    },
    {
      "rating": "0",
      "text": "How embarrassing this movie is. They must of payed Bobby D a boat load of money to act like a complete ass. Zac Erfron acts like a complete ass in this movie too."
    },
    {
      "rating": "1",
      "text": "DIRTY GRANDPA was a torturous, agonizing, painful, unfunny, neverending, piece of garbage. Did not even crack a smile one time.\r I despise this movie. Everything about is wrong, wrong, wrong. I'm not going into details because I want this wiped from my memory as soon as possible. No movie has made me physically ill before, but I felt like I needed to check into a hospital after viewing this vile scum."
    },
    {
      "rating": "4",
      "text": "This is a standard raunchy comedy that has some laughs.  It also has no coherent plot and has some moments that seem just mean spirited.  Efron and De Niro try their best but most of the time they fall short.  C-"
    },
    {
      "rating": "2",
      "text": "Such a s**t show. It actually started out kind of interesting, but it began to get tiresome hearing the grandpa say how much he needed to 'f**k a pu**y so bad' over and over and over and over and over again. Then towards the middle, all hell broke loose and the movie turned into an extremely terrible joke I wouldn't want played on my worst enemy. i exaggerate, but it was pretty bad from the middle to end. So bad I couldn't even spare a pity laugh. For a comedy, I spent more time cringing and confused than laughing and feeling happy."
    },
    {
      "rating": "3",
      "text": "To think Robert DiNero, one of the greatest actors of this generation agreed to do this film is truly telling. The acting from Efron, Duetch and Jason Mantzoukas, whom provides the most laughs in this movie is solid. Aubrey Plaza and Di Niro truly sleep walk through this movie as both truly don't seem like they want to be there. The movie fails the most in its vulgarity, its tasteless and most of the time has no reason. Vulgarity, when done right can be truly funny but when done like this can only spell doom."
    },
    {
      "rating": "1",
      "text": "I gave this film a 1 because I don't really believe in giving movies a zero. But Dirty Grandpa barely passes as a movie. While I understand that the title and previews are supposed to weed out certain viewers, I went into the theater with the appropriate mindset: it was going to be funny, and nothing else. I found it to be more awkward and stupid than hilarious. The writing is beyond awful, and the characters are so one-dimensional they might as well have put paper cutouts of Zac Efron and Robert Deniro on camera. The humor is just uncomfortable, and not because I find the topics in the movie to be inherently unfunny. It's because of the delivery and the aforementioned terrible writing. One of the worst movies I have seen in a long time."
    },
    {
      "rating": "0",
      "text": "this is the worst comedy ever, I prefer to watch any Adam Sandler movie over this bad excuse of a movie. I feel bad for all the respectable actors that take part in this thing."
    },
    {
      "rating": "1",
      "text": "I thought I would have laughed on this movie (based on trailer), but I'm totally disappointed right now. One of the most vulgar film, I've ever seen. Everybody in the cinema room felt so embarrassing and we just laugh in our anguish. I can't imagine how De Niro gave his face to this lame crap."
    },
    {
      "rating": "2",
      "text": "This movie was straight garbage thrown to your face. We don't really see anything new nor we get what we call 'Hilarious'. It's just De Niro throwing his d*ck around. We get the women being dirty whores. Should have been called Dirty Whores. Anyways, Zac Efron just doesn't fit as well as Neighbors.\r'"
    },
    {
      "rating": "1",
      "text": "Atrocious, if not, probably the worst movie ever released in 2016. The movie was very rude, offensive, nasty, and the \"jokes\" were overall stupid and not funny."
    },
    {
      "rating": "0",
      "text": "Dirty Grampa is yet another terrible comedy that seems to think shock humour and scaterlogical humour is automatically funny. it's not! i really have to wonder what Robert de Niro was on when agreeing to this and i think Zach Efron has sunk to a new low. and what the hell was wrong with the music pieces reminding me of high school musical is not a good idea."
    },
    {
      "rating": "0",
      "text": "Robert De Niro......what are you playing at pal?, it is quite shocking what passes for film these days, every time a film of this calibre gets released out of New Hollywood Stanley Kubrick sheds a tear, this is the truth. It's not the fact that Dirty Grandpa is a bad film, it's that it is actually a film and that the people that made it actually expect people to watch it, it really says a lot about the current society we are living in, it's almost an insult, like a sly jab at the dumbed down masses.\r Not for me at all, this movie is an insult to FILM and an insult to De Niro's stellar acting career."
    },
    {
      "rating": "3",
      "text": "Dirty Grandpa is sad because it should have been better with the cast and premise, but in the end it falls flat of every expectation. Know this isn’t just a dumb comedy that is still a funny film, this film is rarely ever funny. Bad Grandpa is racist, so dumb it’s amazing, and not very funny. The worst part of this film is seeing the great Robert De Niro, who is one of the all-time greats, in such a terrible film.\rThe script is so bad that it’s worth wondering what the screenwriter was going for. One of the biggest problems the film has is it’s racist and mean-spirited humor, which is instigated by De Niro’s character. On top of that their is no character development, so just about every character is a stereotype or a cliche, the worst of which is Aubrey Plaza’s character. It may seem odd to say, but the racism is just the tip of the iceberg with this film.\rThe element that is truly mind boggling is how dumb Dirty Grandpa is, it is so dumb that the screenwriter had to have some kind of a purpose, it’s just not clear what that is. There is one character in the film Pam, played by Jason Mantzoukas, who brings the film down like a smelly kid at the playground. Every gag involving the Pam character is just plain stupid, so stupid it can’t be taken serious, and drags the film down. It’s the flat supporting characters that make the film so dumb, and even condescending because they clearly show that the writers think the audience can’t figure out a simple joke.\rOn top of the sheer stupidity, and the racism Dirty Grandpa isn’t very funny, maybe except a 13 year old boy who is laughing more because he feels like he shouldn’t be watching the film than at the humor of the jokes. De Niro and Efron have little comedic chemistry, and they are the only characters to offer any genuine humor, the supporting characters just bumble around like idiots as the plotless film trucks along. From a story standpoint the film is bad in just about every aspect, except that it’s not too hard to follow.\rWhen you consider De Niro’s comedic talent, showcased in Meet the Parents and Analyze This, and Efron’s talent it’s a showcase of wasted talent. The film is plotless, racist, dumb, silly, poorly-acted, poorly-paced, cliched, and filled with flat characters. Dirty Grandpa’s biggest problem is most likely that it was lazily made, but watching it, it feels like the filmmakers had to know and went beyond not caring. If you wondering if you should see this in theaters, I wouldn’t if I were you."
    },
    {
      "rating": "8",
      "text": "Upon reading other reviews for this film, I've seen people say things like, \"has Robert De Niro lost his mind?\" and \"you know you're pretty desperate for work when you start ripping off Johnny Knoxville.\" It is for this reason, that people are staying away from this film, and they are making a big mistake, here's why. At 73, with over one hundred films under his belt, is it really that surprising that Robert De Niro is bored and looking to try something new? In reviewing his credits, he's never been in what one would call a raunchy comedy, and for it what it's worth, he was outstanding. De Niro plays a man who has just lost his wife of fifty year, and is looking to reconnect with his Grandson, and of course get laid. After tricking his Grandson into taking him to Florida, the two wind up at Spring Break in South Beach, where the hilarity begins. De Niro's grandson is played by Zac Efron, who took a while to lose the teen idol label and find his niche as the awkward, but lovable guy in these extreme comedies. Their two characters are so different, that just bringing the personalities together is enough to make things funny, but when you throw them into ridiculous situations together the laughter is off the charts. Personally, I am someone who has found some of the most classic comedies of all time to be a waste of time. Humor is something I enjoy, but not something that I understand easily, and I found Dirty Grandpa to be one of the funniest films, I've ever seen. You will not believe just how raunchy it gets or the lengths De Niro is prepared to go to in order to get some good laughs at his age. I too was thinking this film would be \"okay\" at best, but I was wrong, and so are my fellow critics. Dirty Grandpa is hysterical and those who are avoiding it due to bad reviews and similarities to other films, are really missing out."
    },
    {
      "rating": "5",
      "text": "Robert De Niro proves comedic talent, as well as a decent performance from Zac Effron. I think the greatest part of this movie was it's entire carpe diem motive, the fact that our protagonist has been conditioned for stationary demeaning work renders him as a blunt pencil, De Niro breathes some wanted life into him, and in himself (and possibly into Aubrey Plaza, but not in the metaphorical sense). However, a long string of jokes that deliver some truly funny hits, doesn't make up for the rushed exposition, probably one of the most rushed expositions I've ever seen from the movie. And when the jokes don't land, it's embarrassing for everyone, a ripple of awkwardness just hit's your soul, it's very unpleasant. Combine that with some unmoving and cliché story progressives and Dirty Grandpa is quite a disappointment. However, if it's a rainy sunday night, and you've got nothing else to do, Dirty Grandpa may be there to leave a humorous, old and raunchy hand at the ready."
    },
    {
      "rating": "0",
      "text": "This movie was not just bad, it was embarrassing bad! Robert DeNiro should be ashamed of this \"performance.\" Is this the same actor who appeared in classic roles in Taxi Driver, Raging Bull and The Good Fellas? The only excuse I can think of is that he must have made some bad investments and he really needed a pay day, so he sold himself out. It's a sad way to end a career. Skip this movie...for ANYTHING else...you'll be doing yourself a favor by missing it."
    },
    {
      "rating": "7",
      "text": "\"Right before his wedding, uptight lawyer Jason (Zac Efron) is tricked into driving his grandfather Dick (Robert De Niro), a perverted former Army general, to Florida for spring break.\" A movie with the title \"Dirty Grandpa\" can only be a certain type of movie, so you need to keep that in mind going into this. That being said, I can confidently say it's probably dirtier and raunchier than you would expect. I watched the red-band trailer before viewing it, and I was still surprised. I'll say right off the bat, I seem to have the unpopular opinion on this movie right now: I actually enjoyed it.\r Let me start with what I liked about the film. With maybe one or two exceptions, I thought the acting in this was fairly good. De Niro really embraces the title role, dropping f-bombs at a rate he hasn't reached since his last Scorsese movie. He's also been an actor that has been known to phone it in from time to time in recent years, and Dirty Grandpa seemed to be a project where he seemed to be having fun playing this over-the-top filthy character. Zac Efron essentially plays the straight man to De Niro, and he does it well. There's one scene where he gets to let loose and it's refreshing to see that he hasn't lost his comedic chops since Neighbors (which he was remarkable in and gets to revisit this year in the upcoming sequel). The standouts, however, are two characters played by Jason Mantzoukas (The League) and Adam Pally (Happy Endings), who are two fairly big names in the alternative comedy scene. I happen to be a big fan of both, and it's nice to see them pop up in more movies that the general public sees. Mantzoukas plays Pam, a drug dealer who owns a merch shop on Daytona Beach, and he's basically a less-gross version of Rafi from The League. Pam is in more of the movie than I expected, which would be annoying had I not liked the character so much. Adam Pally plays Nick, Jason's crazy stoner cousin, who steals every scene he's in. The first few big laughs of the movie come from Nick, and unfortunately he doesn't really pop back up until the third act (save for one small scene over Skype midway through). The writing had some laugh-out-loud jokes that hit really well (at one point, Jason is referred to as a \"Mitt Romney Terminator\" based on his actions). I won't give away too many of the jokes, because some of them come out of left field and are funnier when unexpected.\r However, the script is also where I start to get into what I didn't like. If you've seen pretty much any romantic comedy ever made, you know the storyline of this movie. As mentioned in the synopsis, Jason is about to get married to a very high-strung woman (played a bit flamboyantly by Julianne Hough). Very early on during their journey, Jason and Dick stop at a diner where a group of twentysomethings are sitting nearby. One of the group members is a girl that had a photography class with Jason in high school (you can probably already tell where it'll go from here). And what you think will happen indeed does happen, which is one of the movie's faults: it's very predictable. As soon as I saw the aforementioned diner scene unfold, I knew the roadmap for the rest of the movie. Also worth noting is that while most of the jokes worked for me some fell flat. Very flat. A few even teeter on being pretty offensive. And that's something you need to know going into this: if you are someone who is easily offended, dear god do NOT see this movie. It pulls no punches, and I can't help but feel it might have been better off it did pull a few.\r Dirty Grandpa was one of the lowest-brow, hardest-R comedies I've seen in a long time, and you know what? I laughed my ass off. This is a dumb comedy that knows exactly what it is and who its fans are. Now granted, this certainly isn't for everyone, nor is it even close to a perfect movie. However, I ended up having a fun time with this film and ultimately, isn't that the point of a comedy?"
    },
    {
      "rating": "8",
      "text": "I've seen my fair share of terrible comedies over the last couple of years - Hot Time Machine 2 comes to mind - but Dirty Grandpa is certainly not one of them.  Not even in the same zip code.  It's low-brow as hell, but it made me laugh hard a bunch of times. The cast is superb - Rafi from The League is superb, Plaza is over-the-top raunchy in a great way, and even DeNiro does an outstanding job with his part.  I'd like to give it a 9, but there were a couple of pacing problems.  Nothing major.  If you like to laugh and you giggle when you see dicks drawn with black marker on drunk people's faces, don't hesitate to check this out."
    },
    {
      "rating": "9",
      "text": "This is a solid comedy. After seeing the reviews I expected to be cringing throughout this film. Instead it turned out to be really funny. Yes - there are some cheesy parts, some offensive jokes, and some unfunny toilet humor. But those moments are few and far between. For the most part there are A LOT of laughs. Aubrey Plaza is hilarious. And Zac Efron is great for the role - I loved the jokes at his expense."
    },
    {
      "rating": "7",
      "text": "I must be an immature Grandpa myself because I laughed all the way through it. Its not Oscar material and its not PC. its just stupid funny! Left the show with a smile on my face."
    },
    {
      "rating": "4",
      "text": "Robert De Niro has slummed before, but this is the nadir of his career. He takes his rigid grandson (Zac Efron) on a trip full of substance abuse, sexual encounters and other hopefully-shocking stuff. The script tries desperately to be raunchy and outrageous, but most of it’s not funny. De Niro cusses shamelessly and acts offensively, while Efron lacks any comic fun in his straight-laced reactions (although he flashes his buffness several times). The plot (learning to relax and follow his true self) follows the most trite path ever. To its credit, some of the supporting characters are fun and the pace never lags, but the movie’s effort to be excessive is just embarrassing. If you must see an octogenarian out of control, see Johnny Knoxville as BAD GRANDPA. It’s genuinely hilarious and even a little sweet."
    },
    {
      "rating": "10",
      "text": "Sorry...forgot to press the rating button :D I can only repeat...if an honest laugh is what you want...then this is for you....granted...it is not everyone's cup of tea...but then neither is Star Wars. I think it's unfair to judge De Niro....he is nothing less than a brilliant actor...who after a long career...wants to experiment with different things...I love his comedy side...and I adore his character Jack Burns."
    },
    {
      "rating": "10",
      "text": "I actually don't care (and quite don't get it why it has so many negative reviews) if most of you guys have felt this way about the movie; I'll be honest, for me, it has served its purpose - it was intended to make us/ me laugh and it did (I went a week ago to see this movie and the cinema was full; I'm telling you, EVERYONE was laughing the cr*p out of themselves)"
    },
    {
      "rating": "10",
      "text": "I was not sure about this film when my friend told me about it. The title didn't seem appealing. As soon as I watched this movie I was laughing very hard. I really enjoyed this film and I am glad I didn't trust the reviews for being so poor. I promise you after 20 minutes of watching this film you will be crying and laughing so hard that will be warned to leave from the security. Enjoy and have fun with this film."
    },
    {
      "rating": "8",
      "text": "I bet if this was De Niro's first movie, and if it maybe it had a different title, critics would be saying this was a brilliant new actor. I don't care about Raging Bull and Godfather Part II, or what stuffy critics have to say, when I watch a comedy I want to laugh and be entertained. This movie did both for me."
    },
    {
      "rating": "2",
      "text": "What a pile of crap this movie is. As much as I love both De Niro and Effron, but Bad Grandpa is by far an atrocious and offensive party brouhaha of a movie. Skip it."
    }
  ]
}