{
  "id": 332,
  "title": "Dirty Dancing",
  "starring": [
    "Jennifer Grey",
    "Patrick Swayze"
  ],
  "runtime": 100,
  "genre": [
    "Drama",
    "Music",
    "Romance"
  ],
  "description": "Expecting the usual tedium that accompanies a summer in the Catskills with her family, 17-year-old Frances 'Baby' Houseman is surprised to find herself stepping into the shoes of a professional hoofer—and unexpectedly falling in love.",
  "releaseYear": "1987",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/9Jw6jys7q9gjzVX5zm1z0gC8gY9.jpg",
  "categories": {
    "plot": 4.6,
    "acting": 4.909090909090909,
    "ending": 7.0,
    "soundtrack": 4.5,
    "cinematography": 5.0,
    "familyFriendly": 6.0,
    "funny": 5.0,
    "action": 6.0
  },
  "reviews": [
    {
      "rating": "10",
      "text": "Damn, it's been 25 years since Dirty Dancing was released. Maybe I could really dance to Jennifer Grey's victory on Season 10 of Dancing With the Stars right about now. And I hope Patrick Swayze is sending big smiles in heaven and reunite with Grey one last time. I miss the 80's, what a great film."
    },
    {
      "rating": "10",
      "text": "\"Rammstein makes coollllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllll"
    },
    {
      "rating": "10",
      "text": "This is the best film ever."
    },
    {
      "rating": "0",
      "text": "It sucks. I did not enjoy this movie. I might've liked it, if i could find any redeeming features. worst. movie. ever."
    },
    {
      "rating": "5",
      "text": "Yeah, one of those films that everyone seems to find overwhelmingly nostalgic. This being the first time I'd seen it, I felt nothing like that apart from that iconic last scene which EVERYONE knows about. I found it funny in places where I don't think it was intended and everything just fell kind of flat for me."
    },
    {
      "rating": "1",
      "text": "Moué, à ses débuts le beau gosse Patrick Swayze tournait des trucs sacrément cons et enchaînait les rôles de bellâtre rebelle avec plus ou moins de réussite... On le sait très capable et le voir se ridiculiser ainsi est particulièrement affligeant. On est ici très loin de Point Break et de son rôle de gourou voyou (rebelle encore une fois bien sûr) dans ce Dirty Dancing et ses gesticulations contorsionnées plus ou moins connotées et clairement destiné au public adolescent avec un Flanby dans le ciboulot.Neuneu et cucul, on est effectivement en plein dedans (dans le Flanby), le tout sur la musique commerciale d'ascenseur des années 80 dont les morceaux choisis représentent certainement à merdeveille la soupe dégoulinante que les djeunzs de cette époque s'infusaient dans les esgourdes.Quant à Jennifer Beals, euh Grey pardon (on dirait des photocopies) je préférais la première dans le Flashdance parce qu'elle se bougeait bien plus le derrière et le reste (toujours très bien) et jactait beaucoup moins également, ce qui compensait la tronche légèrement trisomique de ces siamoises sur laquelle on était prêt à passer l'éponge. C'est décidément beaucoup plus difficile ici.En con-clusion, rien à sauver de cette danse sale, sinon que, comme le titre l'indique, ça sent pas bon."
    },
    {
      "rating": "3",
      "text": "Dirty Dancing is a 1987 musical drama/romance starring Patrick Swayze and Jennifer Grey... I'm not going to tell you the other actresses or actors names because it's irrelevant to this review as I don't need them to basically sum the whole movie up. To keep it sweet if there is any story at all or plot in Dirty Dancing it's lost in the music and all the cheesey dance scenes, some of which are good plus there's romance so this makes Dirty Dancing feel like there's no story, just a bunch of losers and hoodlums seducing each other, lusting after women, cheating on each other, having sex with a huge amount of romantic songs and music added. There's also the subject of trust in the movie and betrayal and Patrick Swayze as a dance instructor and some very nice sexy scenes between Penny (Cynthia Rhodes) and Jennifer Grey but usually this film only delivers naughty dance moves and music as an excuse to have sex and nudity in it then it feels like a family movie and looks like a family dance movie then all the sex happens and it feels all over the place. Very strange mixture and I don't personally like this movie as it's dull and lifeless to me but some may enjoy it."
    },
    {
      "rating": "10",
      "text": "This movie is such an 80's classic. Patrick Swayze and Jennifer Grey make such a cute little couple in this movie. I love the part where they were dancing at the end. My mom loves this movie also. The movie also featured the late Jerry Orbach who played Jake, Baby's father. This is a cute 80's movie."
    },
    {
      "rating": "10",
      "text": "Its a classic..and nothing less. The dancing and the chemistry are amazing. It will live on....and viewers will always catch themselves rewinding to view scenes another time."
    },
    {
      "rating": "10",
      "text": "I agree with Ciara - this is the best film ever! I can't help watching it when I have a chance. The cast is very nice and Patrick Swayze is a perfect man you can dream about."
    },
    {
      "rating": "7",
      "text": "There's a reason that Dirty Dancing is still referenced today--it's classic, filled with inspirational performances, dancing and joyous music. Dancing films were a-plenty in the 1980s, but few will be remembered alongside Dirty Dancing."
    },
    {
      "rating": "5",
      "text": "It is a good movie and I would say a 7-8/10 is fair. What ruins it is that woman like it far more than man who are forced to watch it again and again with their loved ones. With this in mind it is a slow conditioning to hate the movie the more you have to rewatch it. I repeat it is not a bad movie and might also be in the category of must see movies as you will be asked if you lived under a rock if you do not know this movie. The movie itself is a mixture of romance and drama with dancing and also signature role for both Jennifer Grey and Patrick Swayze. I must also point out the soundtrack with a lot of timeless classic I must praise even if those are not fully my cup of tea. The movie is said to be based writer Elanor Bergsteins childhood. Set in the 1960ties it follows Frances Houseman nicknamed “Baby” who is on a vacation in a resort with her family in the Catskill mountains. Out of curiosity she visits a party for the employees where she meets the dance instructor Johnny Castle. They have good chemistry but come from different worlds or better said social classes. When Johnnys dance partner Penny has a problem it is Frances chance to shine. I am more than a bit vague here to avoid spoilers. The story works well and was copied countless times over the years to recreate this experience. I also say it is not special in a way to be praised but also far away from being garbage. The characters deliver a good performance. Like I said it is the signature role for Patrick Swayze as Johnny and Jennifer Grey as Baby. For the rest I praise Cynthia Rhodes as Penny, Jane Bruckner and Jerry Orbach as Frances parents and Jack Weston as Max Kellerman. A good performance by the cast. The dance choreography is enjoyable good but take this with a grain of salt as I am far away from being an expert for this. Like I said the soundtrack is amazing with classics that are still played in radio today like “The Times of my Life”, “Hungry Eyes”, “She is like the Wind” and more. Overall I repeat my opening statement. A good movie but torture for most men. Because I was less tortured than others I can give a 5/10. Bonus knowledge: The lake scene training was actually a torture for the actors as it was really cold and both hated this as they had to redo it many times."
    },
    {
      "rating": "8",
      "text": "Dirty Dancing is an excellent movie. No, it isn't perfect, but it is solid entertainment for those into dancing. There are two flaws with the film. The script is not the best script in the world, to be honest, there are some clichés. Also, as much as Cynthia Rhodes puts a lot of energy into the dance routines, her acting isn't as good unfortunately.However, putting those minor discrepancies aside, the highlights are the jaw-dropping if rather erotic dance routines and the ever-popular soundtrack. The famous lift in the best dance of the film is very hard to do properly, and as far as I'm aware, it was very well-done. The soundtrack isn't like Charlie's Angels or anything similar to that, where the songs get too much. If anything, they capture the feel-good nature of the film perfectly.Now for the performances. I have already mentioned Cynthia Rhodes, but I thought that Patrick Swayze and Jennifer Grey gave the roles of their careers in Dirty Dancing. Their partnership was like Torvill and Dean on ice, unquestionably brilliant. Jerry Orbach gives a wonderful performance also as the earnest Jake Housemann.In conclusion, with a couple of minor flaws, Dirty Dancing is a treat, for those into dancing.8/10. Bethany Cox"
    },
    {
      "rating": "7",
      "text": "Dirty Dancing(1987)\rStarring: Jennifer Grey, Patrick Swayze, Jerry Orbach, Cynthia Rhodes, Jack Weston, Jane Brucker, Kelly Bishop, Loony Price, Max Cantor, Alvin Myerovich, and Paula Trueman\rDirected By: Emile Ardolino\rReview\rHAVE THE TIME OF YOUR LIFE\rHello Kiddies your pal the cupid critic here with one of the most pop cultural hits of the 80s, that I keep mistaking for Footloose which I have not seen.\rThe Summer of 2963... Innocent 17-year old Baby(Grey) vacation's with her parents at a Catskill's resort. ne evening she is drawn to the staff quarters by stirring music. There she meets Johnny, the hotel dance instructor, who is as experienced as Baby is naïve. Baby soon becomes Johnny's pupil in dance and love.\rEvery time I see anyone dancing in this picture I feel like their having sex or are about to have sex because they move like there body's are intertwined and are like \"Oh I want you\" but when I see Baby and Johnny dancing it's a lot of fun. The film does shine with its incredible choreography I especially love those scenes where Baby and Johnny are doing the mambo. The film does achieve its primary goal for an energetic love number of dance.\rDirty Dancing is a great film. I give it a 3 and a half out of five."
    },
    {
      "rating": "9",
      "text": "Romance At It’s FinestWith a great cast, memorable soundtrack (Hungry Eyes anyone?), and well executed romance, Dirty Dancing is a 1987 classic you shouldn’t miss out on."
    },
    {
      "rating": "9",
      "text": "Dirty Dancing. And I owe it all to you. Three awesome. Amazing drama, dance and music. And of course the famous final dance. I am sure this movie can be re-watched in 100 years and it will also be great."
    },
    {
      "rating": "10",
      "text": "The iconic movie of the 80's, if not of all time. The idiot critic that gave it 50/100 is out of touch and has no feelings obviously, watched it more than a dozen times and every time is brilliant"
    },
    {
      "rating": "5",
      "text": "but everybody's in love..Dirty DancingThere's way too much dance (contrary to Footloose) and it barely is about dance for your typical romantic genre with its usual limitations and properties barges in, to something that had the potential to draw something colossal out of it. Eleanor Bergstein's script never had enough crisp in the first place to make it on screen which makes Emile Ardolino's execution shallow despite of being convincingly good. Patrick Swayze is a good dancer but needs some work on delivering it in all aspects which goes same for Jennifer Grey. Dirty Dancing demands attention through its musical sequences that especially draws out younger audience and if mended appropriately with a verified supervisor, it would have made the final cut onto the major league."
    },
    {
      "rating": "6",
      "text": "Since ever the rich families sought to protect their children from marriages that could jeopardize their status and prestige. Baby Houseman is a girl whose parents expect a lot, but things go wrong when her family learns that she is in love with a dance instructor with humble origins and dubious life. Directed by Emile Ardolino and with a screenplay by Eleanor Bergstein, it has Patrick Swayze and Jennifer Grey in the lead roles.This is probably one of the most famous romantic movies of the eighties. Jennifer Grey was up to the challenge and did a good interpretation but, despite her talent and commitment, she ended up overshadowed by a huge Patrick Swayze. This film can be considered the best in the career of this actor that was, precisely, a dancer before beginning to play. It's undeniable that his taste for dancing and talent for gallant roles were essential to his performance, contributing a lot to make him a true \"male sex symbol\" at the time. The script itself doesn't bring anything new: rich girl meets poor boy and they fall in love, jealous people try to separate them, girl's family doesn't accept their love etc... We have seen this many times in film, theater or even in literature. Nevertheless, it's a story that works well and it's enriched by some interesting details that help to thicken the plot, as the situation around an illegal abortion that one of the characters has to do. In addition to the interpretation of Swayze, the most positive point of the film are the choreography's and an amazing and memorable soundtrack, marked by the songs \"She's Like the Wind\" and \"I've Had The Time Of My Life\". The latter can even be considered one of the most famous love songs of the eighties and won the Oscar and the Golden Globe for Best Original Song (1987).Despite the time that has passed since it's release in the cinema, and Swayze himself has passed away however, this film continues to mean a lot to many people and to be a landmark of romantic cinema. Love overcomes barriers, and a good love story is always timeless."
    },
    {
      "rating": "7",
      "text": "An enjoyable movie, Baby (Jennifer Grey) and Johnny (Patrick Swayze) have got some good chemistry when they're on set together during these scenes. Also, the movie has got an interesting story and it's got a decent soundtrack."
    },
    {
      "rating": "0",
      "text": "Dirty Dancing is a 1987 film starring Patrick Swayze, Jennifer Grey and Cynthia Rhodes... If there's a story in this film I've no idea what it is because it's all dancing, sexy dancing, music and adultery or affairs happening... I honestly don't see why this is a classic to many people, surely there are some great songs but there's also too much hate in the movie, too much sex, too much junk and is this a family movie or adult movie because it passed itself off as both. Patrick Swayze's acting is great but Jennifer Grey is annoying and so is everybody else involved. Awful film."
    },
    {
      "rating": "1",
      "text": "igor here igor mad cuz no dirtz ore no mud so y mooovie say dirty dancing malk no semse it dumb dumb moooovie in 2412 where moooovie malk no semse cuz peoaples hvae no brians"
    }
  ]
}