{
  "id": 1381,
  "title": "Disobedience",
  "starring": [
    "Rachel Weisz",
    "Rachel McAdams"
  ],
  "runtime": 114,
  "genre": [
    "Drama",
    "Romance"
  ],
  "description": "A woman learns about the death of her Orthodox Jewish father, a rabbi. She returns home and has romantic feelings rekindled for her best childhood friend, who is now married to her cousin.",
  "releaseYear": "2018",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/skPT4ffWhlmmDOMNEdxOiP6Emfz.jpg",
  "categories": {
    "plot": 5.8108108108108105,
    "acting": 6.923076923076923,
    "ending": 6.0,
    "soundtrack": 8.0,
    "cinematography": 5.5,
    "familyFriendly": 3.0,
    "funny": 8.333333333333334,
    "action": 8.0
  },
  "reviews": [
    {
      "rating": "9",
      "text": "What a beautiful film. Yes, it gets a little simplistic toward the third act, but the acting is stellar and carries it."
    },
    {
      "rating": "5",
      "text": "Disobedience portrays a world of secrets, lies, and very guarded people who live on a knife's edge of social consequences, but much like the main character played by Rachel Weisz, Disobedience struggles to find it's footing. While the main characters played by Weisz, Rachel McAdams, and Alessandro Nivola are well acted, a lot of their actions are difficult to comprehend. Even with the complications that they are all best friends who are in love with each other, and that the Orthodox Jewish culture they belong to will not accept who they all are, I often found myself wondering why a character did this, or why a character would act treat another character this way, and so on and so forth. The sex scene in the middle of the movie is very gratuitous and distracting, and does nothing to further the story or develop the characters, or even show the audience how much the character's love each other.Another big flaw Disobedience suffers from is pacing. I have watched slow movies. I have watched glacial movies. I have even enjoyed watching slow or glacial films. The pacing in Disobedience is nothing short of laborious, particularly in the second and third act. I constantly was checking my watch about an hour into the film, and two audience members got up and left halfway through the movie. This movie also DID NOT KNOW WHEN TO END. There were three scenes where it could have ended, but it just kept going. I could not leave the theater fast enough once it was over.In spite of this, there are moments that truly shine, such as Weisz and McAdams' tender confession in the house of Weisz's father, and Nivola's stirring monologue at the climax of the film. In spite of it's flaws, there are some okay moments in the film, and it is quite a faithful portrayal of Orthodox Judaism."
    },
    {
      "rating": "5",
      "text": "may you live a long life..DisobedienceThe suave mild tone is soothing that is apt for this simple thought-provoking tale which is boldly accurate and walks on concrete surface and still somehow manages to fumble down its way. The adaptation for the screen may be smart but it definitely required a better editing and supervision to breed the crisp out of it which unfortunately is piled upon measuring various character's perspective. Sebastian Lelio; the director, saves the script through his brilliant execution skills and a keen sense of awareness of the energy and the tension that is projected between the characters that doesn't fail to communicate with the audience. Rachel Weisz and Rachel McAdams are convincingly good on their parallel roles and so is Alessandro Nivola as a supporting cast. Disobedience is a character driven feature (hence it is inherently slow and that bides with the tone perfectly too) that surely is important and raises appropriate queries but the real question is whether it is intriguing enough to invest in it or not."
    },
    {
      "rating": "8",
      "text": "A tale of suppression, connection and liberation, Disobedience exudes respect in times of misunderstandings. Despite boiling with passion, Disobedience carries itself with stoic dignity through its measured scoring, direction and cinematography. The technical aspects of this film quietly maintain a traditional yet tense atmosphere as the cast is given room to express the depths of their skills. Rachel Weisz, Rachel McAdams, and Alessandro Nivola all show off their range and ability to build layers within their characters; filled with moments of true vulnerability, the performances in this cast are nothing short of valiant.Due to the restrained nature of Disobedience, there will be some who find the film lacking. This feeling could extend to the motivations of characters or the film’s muted style. However, it is precisely this reservation which gives Disobedience its real impact. Among other themes, this film’s message is about moving through conflict with honor and Disobedience leads by example. This movie may not fit everyone’s tastes but it holds universal wisdom that all could benefit from. Disobedience is mature film-making done with dignity.Writing: 8/10Direction: 8/10Cinematography: 8/10Acting: 10/10Editing: 7/10Sound: 8/10Score/Soundtrack: 8/10Production Design: 7/10Casting: 10/10Effects: 6/10Overall Score: 8.0/10Original Article: https://thefilmguys.blog/reviews/augusts-reviews/disobedience-2018/"
    },
    {
      "rating": "9",
      "text": "Disobedience is not a perfect movie, but the acting is so superb by all 3 leads (and also the small but pivotal role of the rav) that its failings are diminished. It is wonderful to see such naturalistic performances delivered. Unfortunate that the whole look of the film is so somber, but these actors shine very brightly.  Of course, the sex scene gets alot of attention in the media, but the quiet scenes are also quite poignant and powerful.  I venture to say that you could watch the entire movie with the mute on and it still would convey its truths. I truly feel that it was one of the best and most indelible movies I've seen this year and I've seen MANY."
    },
    {
      "rating": "10",
      "text": "Beautiful and Heartbreaking film. Disobedience is a movie that  everybody can identify with it, when you feel lonely, depressed and hopeless and the only thing you want is being happy or find your dream but sadly is impossible and you feel dead inside, Disobedience show this ..honest and real  . This production is totally deep and authentic that your heart is broken when you see it , everything is  perfect : the acting, direction, cinematography, music, screenplay. Deserves to be seen 10/10 . Hopes for a 2 Movie, Thank You to Rachel Weisz, Sebastian L, Rachel Mcadams and all involved on bring this Masterpiece on this World, it's totally necessary."
    },
    {
      "rating": "10",
      "text": "Disobedience its a great film, its a realistic and human history so  powerful and with great performances by the three main characters.The chemestry between both Rachels its so real. The movie its so diferent from regular movies its uses the face expresions to communicate and transmits feelings, the looks, the breathing, the nuances. Its a powerful history of love, to be free to love who you want to love. This movie deserves to be seen and also to get in the awards."
    },
    {
      "rating": "3",
      "text": "What a lost chance. The acting is great. The story is solid. The cinematography score for this film is minus 1000. London is a drab drab city yes. But still give us something to look at please. Film is a visual medium!"
    },
    {
      "rating": "9",
      "text": "You see, this is what the SJW camp doesn't understand: I am neither female, nor gay, nor Jewish, yet this movie HAD me completely.Here's how hard it had me: I take sleeping pills (Venezuelan refugee, please don't judge). Usually, if I stay up too late after taking my pills, the drowsiness will even affect my speech. Yet I started watching this after dinner and my pills and I couldn't freaking sleep! This movie would not let go of me until it was over. So gripping!So take THAT, SJWs. Even though this movie wasn't \"made for me\" like Brie Larson says, it hooked up til the very last second. I'm giving it a 9 because it has slight rhythmic problems, but this is the kind of movie that takes an unrelenting, yet unprejudiced look at religious zeal, that an SJW wouldn't even dream of making. Please keep this type of cinema coming! It is desperately needed!"
    },
    {
      "rating": "6",
      "text": "After many years, a New York photographer (Rachel Weisz) returns to London and the Orthodox Jewish world where she was raised. Turns out her best male friend has also married the only woman she ever cared for (Rachael McAdams). Naturally, their forbidden love is once again awakened. Since the story holds no surprises, it's all about watching the characters as they deal with their challenging situation. The performances are compelling…lots of furtive glances and strained interaction. However, the pace is slow and the emotions are generally restrained (it is England and a somewhat repressive community, after all). This might be appreciated by people who find the subject matter appealing or enjoy the subdued style ."
    },
    {
      "rating": "5",
      "text": "This is not a good movie. Making it politically correct does not improve its quality. At best it is mediocre. That can be said about the script and performance. Directing is, I am afraid, even worse than that. Cinematography is excellent though."
    },
    {
      "rating": "8",
      "text": "Watching \"Disobedience\" I remembered the report this morning about Pope Francis saying, among other things, \"God made you like this and loves you like this. The Pope loves you like this and you have to be happy with who you are.\" (See the link below*) It is a movie about many things but mainly how being gay and religion interlocks along with how religion is also freedom. It is about the Torah talking about angels and beasts.Ronit, the estranged daughter who left North London to live in New York returns home upon the death of her father, a rabbi who leads the Orthodox Jewish community while delivering the sermon about those angels and beasts.She arrives at the home of cousin Dovid who looks like he will probably take over her father's position. He was a childhood friend of hers just like Esti, now married to Dovid, who had a secret affair with Ronit, until the latter's father caught them in bed one night which lead to Ronit running to New York where she has become a successful photographer.Ronit has given up her Orthodox upbringing but can't give up being a Jew while Esti has married Dovid to be the good Jewish wife who wears a sheitel (wig) and teaches a class of Orthodox girls. Coming back home Ronit not only awakens the two women had for each other but it also brings up what they 'owe' religion and what religion 'owes' them if anything. In the middle is Dovid who loves his wife, wants to have the accepted Jewish family though his wife is having a problem with giving birth and feels protective of his cousin as the latter deals with rejection from most of the community except her fun-loving aunt (Bernice Stegers) who embraces her return even with her uncle (Alan Corduner) being remote.There are a lot of subjects touched upon in \"Disobedience\" including religion, love, duty, freedom, choice, loss of a parent, ostracism among others which would make you think this would be a 'talky' movie but the lead actors can do more with silence and looks than words can. Talking about the actors both Rachel Weisz as Ronit and Rachel McAdams as Esti give excellent, very believable performances covering some of the mishaps of the director, Sebastion Lelio and screenwriters Lelio and Rebecca Lenkiewicz. I was particularly surprised by the performance of Alessandro Nivola as Dovid as I don't remember ever hearing of or seeing him before. I just looked his credits up and he has done a lot of theatre, movies and television. He has instantly become an actor whose future movies I will definitely see.There are many Jewish rituals and words that many in the audience won't understand, including me, but none are necessary to the triangle we are watching and there are many different triangles between people, beliefs and thoughts. The film has an 'open ending' which has you thinking as you leave the theatre.\"Disobedience\" is a movie about family, love, religion and how each affects us as individuals. It takes some thought as a viewer and it did bring me to tears at one point (but then I have been known to cry at Minnie & Mickey Mouse movies) plus if you are not familiar with Alessandro Nivola that would be reason enough to see it.*    https://www.msn.com/en-nz/news/world/pope-francis-tells-gay-man-god-made-you-like-this/ar-AAxyXr3"
    },
    {
      "rating": "3",
      "text": "I have given this movie a three out of ten not because it is a bad movie, in fact it isn't. The acting is great. The story, although sad, is decent enough and the setting, although dominated by drab grey is okay, if not a little dull. You can say that while it isn't a master piece, it is an okay movie.So why the low score?This is because the movie infuriated me. Let me explain(spoilers ahead).Contrary to what you might think the central character in this story is not Rachel Weisz although the story is told from her perspective. In fact it is Rachel McAdams. She is married to Alessandro Nivola and they are part of a orthodox Jewish community. In fact he is a Rabbi. The three of them used to be friends until Weisz left one day for New York.  The movie kicks off when Weisz decides to return after hearing that her father has died.The center theme in this movie is duty versus freedom and this is expressed quite bluntly at some point when McAdams asks her husband to set her free and tells him that she is pregnant and does not want her child to grow up in a world that left her no choice. Another blunt moment is when Nivola makes a speech about duty near the end of the movie.The movie is quite blunt in other things too. For instance, Weisz finds out that almost nobody wanted her to come back and this is pointed out by a newspaper article that says that her father died childless and when she hears her father left her nothing in his will. Her existence is not merely denied: she doesn't exist.There is more. When she enters her father's house  together with McAdams the song Lovesong by The Cure is played and specifically these lines: Whenever I'm alone with you make me feel like I am home again. But even more! Prior to Weisz leaving New York we get an unloving short sex scene between her and a man that is contrasted against the drawn out sex scene between Weisz and McAdams later in the movie. In fact any sex that is mentioned with a man is made out to be obligatory and loveless.During the movie we get a few things revealed.The two women had a love relation, something that is and was unacceptable in the community.Nivola and McAdams married because he wanted to help her get over 'it' and she was told that she was not right in her head(this is literal from the movie). We also get told that McAdams was the one who informed Weisz about the death of her father and that she did it deliberately to get Weisz to come back.The two girls always were attracted to women, but they never did anything with it, not even Weisz who had broken with the shackles of her past. In fact we are told that she never met anyone and apparently engaged in quickies with men.Essentially the movie is because McAdams informed Weisz about her fathers death. This made the latter come over from the US and this is what McAdams wanted.  You would then expect that this would result in something but this is not what happens. In fact McAdams is almost unseen in the first part of the movie and the two girls hardly respond to each other. And then suddenly about a third in they hit it off which cumulates into a long sex scene about halfway in. Then the movie see-saws as McAdams cannot make up her mind and Weisz not doing much more than trying to flee. Eventually this leads to the moment where McAdams asks her freedom from Nivola. Which then is totally undone when Nivola makes a speech in the Synagogue that comes down to: duty is important. Weisz doesn't have any kind of character arc. She is the same as when the movie started and her trick is to flee. But fleeing has gained her nothing. She is a lonely figure who has quick sex with men whom she doesn't love and she has no family and probably dies a lonely death. She has become nothing.McAdams has a character arc of sorts but it is only to make her end up where she started. McAdams might not have found love but she had found her role in life: that of being the mother of her child and the wife of her husband. She has become something.What infuriates me is that the whole movie is aimed at rubbing this is by leaving no alternatives. The whole 'lesbian' affaire is there to contrast the two women and the whole story railroads them to an outcome. But what takes the cake is near the end. Weisz drives off in a taxi, but McAdams runs after her. They kiss passionately and then nothing happens. Yeah, they wanted to make sure you go the message."
    },
    {
      "rating": "8",
      "text": "Although “Disobedience” is a very quiet film, it is very powerful, full of deep feeling below the surface. Rachel Weisz plays a New York photographer named Ronit who returns to the closed religious community in London where she grew up, summoned back by Esti (Rachel McAdams) who tells her of her father's death. Esti and Ronit are deeply in love, but Ronit chose to leave while Esti stayed behind and married into the community. None of the performances are showy or hyper-emotional, but absolutely convincing and deeply moving (including the one by Alessandro Nivola who plays Esti’s husband), making the film more interesting and intense. If you are the kind of person who has the ability to sit through an emotionally intense human drama like this, you will be deeply rewarded by the experience."
    },
    {
      "rating": "7",
      "text": "It doesn't really bring a whole lot new to the table in terms of same sex/forbidden romance films, but it does still have plenty of touching and all around well acted moments throughout. Weisz and McAdams both give tender and honest performances, while even Alessandro Nivola delivers a worthwhile performance alongside them as well. Overall, it's told rather simply and feels a little been there, done that, but it's the performances that make it worthwhile in the end."
    },
    {
      "rating": "7",
      "text": "Where this alternative love story is concerned, the message is a valid one, but the execution is a bit off. Despite fine performances, the film gets tripped up somewhat on its pacing and direction, meandering too much for its own good. A less cluttered, more succinct approach would have made this one work better. Not bad, but not outstanding, either."
    },
    {
      "rating": "8",
      "text": "Chilean director filmed mostly in London his 1st English-language film. Some critics have said the ending is vague. True. Also there are no flashbacks. We know the 3 main characters were friends, the 2 girls had a sexual encounter and the Rachel Weisz character moved away. So the past is vague too. But the vague past and future contribute to the power of the film. It also helps, of course, that the 3 main performances are fine. An honest film you will probably want to talk about afterwards."
    },
    {
      "rating": "8",
      "text": "what a performance from duo Rachel! Talking about love, faith & freedom in a cold way."
    },
    {
      "rating": "6",
      "text": "A fairly good lesbian film, but once again I am tired of these... \"cheating\" films, and they only seem to exist in the lesbian subgenre."
    },
    {
      "rating": "9",
      "text": "I do not know the book on which the film was based, but what is most appreciated is that he knew how to recreate the moral dilemma of abiding by faith, based on strict rules, or following the instinct inspired by love; this without falling into the scandalous. One of those that is required to see with an open mind."
    },
    {
      "rating": "7",
      "text": "Excellent and solid performances by Rachel Weisz and Rachel McAdams, also with a great participation of Alessandro Nivola.Weisz continues to maintain her level and her good run since Fernando Meirelles' 360, excluding the failures of Dream House and Oz the Great and Powerful while McAdams offers her best performance since A Most Wanted Man and perhaps one of the best of her entire career.While the story never ends up running smoothly, the performances of these two actresses are worth the two hours you'll invest in this film."
    },
    {
      "rating": "7",
      "text": "Disobedience is very well made. The cinematography, dialogue, and acting is fantastic. The story, however, is rather simplistic. I think it was intentional as it's very clear what message this film is trying to get across, but it left me searching for more in the end."
    },
    {
      "rating": "8",
      "text": "We see films about the evils of religion. We see films that feel like religious propaganda. How often do we see films that just put these elements out at face value? Such is the nature of Disobedience, a small but intriguing study of the clash between religious devotion and personal discovery. In the end, we learn that “right” and “wrong” often do not have a place in an adult world.Disobedience has a simple premise that allows the performances of Weisz, McAdams, and Nivola to soar (though I will argue that Nivola is the shining star here). Three friends grew up in a traditional Jewish community in London, and one of those friends (Ronit, played by Weisz) rebelled and left to live in the United States, far from her religious affiliation. When Ronit’s father dies, she returns to London to pay her respects. Her trip leads us to meet Dovid, the most interesting character in the film, and McAdams’s Esti. The three characters have three different levels of religious devotion: Ronit has rebelled and is Jewish in background only, Dovid is an ambitious rabbi who conforms to all traditional Jewish rules, and Esti is somewhere in the middle. It may seem as if the character setup forces audience members to “side” with whichever character is closest to his or her personal level of faith, but the film has much more in store.Entertainment is not at the center of Disobedience. Dialogue takes a back seat as the camera and direction focus on facial expressions. Jewish customs are presented without exposition. Characters are sometimes unlikeable and at other times closed off. Most importantly, however, expectations are subverted. In many ways, Disobedience chooses to focus on the beauty of humanity rather than the terrible things that men do, and, while some audience members will leave unsatisfied with such optimism, many of us appreciated a film with real people for a change."
    },
    {
      "rating": "10",
      "text": "Remarcable performances by Rachel Weisz, Rachel Mcadams and Alexandro Nivola.This films its heartbreaking and  beutiful, the love history between the two Rachels its so touching you can feel the longing, the represion and everithing goes off with so much passion, the love scene its one of the best i have seen so far it shows eroticism without using nudity. Its a beatiful love history where people can get identify by, the final message its a good one,men or woman should be free to love who we really love and be who we really are. Its about freedom a choice. This movie its awards material."
    },
    {
      "rating": "7",
      "text": "A well-told love-story set against a background of religious orthodoxyDepicting the problems that can arise when deeply held spiritual beliefs clash with notions of personal freedom, Disobedience is the story of a forbidden love given a second chance. Based on Naomi Alderman's 2006 novel, written for the screen by Sebastián Lelio and Rebecca Lenkiewicz, and directed by Lelio, the film deals with a lesbian relationship within London's relatively insular Modern Orthodox Jewish community. Uninterested in presenting a binary story where faith is the Big Bad, although the film is certainly critical of the strictures that can result from a rigid application of Jewish religious law, the community itself is depicted respectfully.When Rav Kruschka (Anton Lesser) dies in the midst of a service, his estranged daughter Ronit (Rachel Weisz) returns home from New York, heading to the house of Dovid (a superb Alessandro Nivola), her childhood friend, and Kruska's protégé. Although the community isn't happy to see her, Dovid offers her a spare room. She accepts and is stunned to learn he is married to Esti (Rachel McAdams), another childhood friend. Over the next few days as the community prepare for Krushka's funeral, it becomes clear that Ronit and Esti were once more than friends, and the more time they spend in one another's company, the more their suppressed feelings come to the surface.Thematically, Disobedience is far more concerned with the clash of views that result from Ronit's return than it is with condemning the beliefs of the community per se. On paper, the story might lend itself to a condemnation of the kind of social suffocation and emotional repression that can result from fundamentalism. Instead, however, the film spends time building a respectful, if not idealised, picture of the community. A key part in this is Dovid himself. In a less nuanced film, he would be a fire-and-brimstone Roger Chillingworth-type, an obstacle to Ronit and Esti's happiness. Instead he is presented as someone who faces a difficult choice - that between his communal position and his faith on the one hand, and his genuine love of Esti and affection for Ronit on the other.However, for all that, the film never lets you forget that this is a community where married women must wear a sheitel wig in public and where the genders are strictly divided at religious services. As Ronit and Esti discuss their sexuality, Esti points out that she and Dovid have sex every Friday night, \"as is expected\", and that the reason she was married to him in the first place was that Krushka hoped \"marriage would cure\" her lesbian desire. In this sense, although respectful of the community, the film certainly challenges its myopic sexism.Obviously, a major theme is sexuality. There are actually two sex scenes in the film; one between Ronit and Esti, and the other between Esti and Dovid. And although they couldn't be more different, they also couldn't exist without one another, as the abandonment, lust, and sense of pressure being released when Esti is with Ronit contrasts sharply with the detached, formulaic, and passionless scene with Dovid. The scene between Ronit and Esti is the physical manifestation of the characters' long-repressed desire. It's a wholly justified narrative moment, and a necessary beat for the two characters. It's not an aside or a piece of voyeuristic male fantasy, it's the centre of the whole film. Together, the two scenes represent Esti's binary choice - an unbridled and sexually fulfilling, but unstable relationship with Ronit, or a dutiful and dull, but respectful and secure relationship with Dovid.If I had one major criticism, it would be that although Lelio's direction is subtle, some of his and Lenkiewicz's writing choices are spectacularly on the nose. The opening sermon is a good example - a religious diatribe whose subject is mankind's freedom to choose, the concomitant ability to disobey, and the notion that freedom is impossible without sacrifice, in a film about these very same issues. The worst example of this, however, is found when Ronit and Esti go to Krushka's house and Ronit turns on the radio, which just so happens to be playing The Cure's \"Lovesong\", a song which perfectly encapsulates their situation.These issues aside though, this is an excellently crafted film. Once again examining female desire, issues of patriarchal oppression, and profound self-doubt, Lelio delivers a mature and considered meditation on the conflict between faith and sexuality. Equal parts sensual and spiritual, the lethargic pace and absence of any narrative fireworks will probably alienate some, but for the rest of us, this is thoughtful and provocative cinema."
    },
    {
      "rating": "8",
      "text": "Sebastian Lelio es uno de los realizadores latinoamericanos más importantes de esta época. Se hizo notar el 2013 con Gloria, pero el año pasado sorprendió con \"Una mujer fantástica\", la historia de Marina, una mujer transgenero que debe sobreponerse a las limitaciones, después de la muerte de su pareja. El hecho de que un director halla decidido tocar una temática,algo polémico, sobre todo en esta parte del mundo, y abogar por una comunidad es importante, y mucho más si lo hace bien.Lo más destacable es el guión de Rebecca Lenkiewicz, que se encargó de adaptar Ida (2013) ahora adapta Desobediencia, también un libro escrito por Naomi Alderman. Este, que se encuentra lleno de metáforas, como las pelucas que usa Esti, que puede significar como oculta su verdaderos sentimientos. Lo que se debe y lo que se quiere; unos de los temas principales de la película, los sentimientos y los deseos reprimidos. Está escrito con humanidad y fuerte realismo, rosando en partes la perfección. Separa y equilibra los temas que se propone, no se limita a contar con los clichés de este tipo de historias, sino que explora diversos temas y genera tensión en ciertas escneas, trayendo así una historia hermosa, que habla sobre la libertad, la sumisión la sexualidad y la fe. Aparte del guión lo mas destacable de esta cinta son las estupendas actuaciones. Ambas actrices ofrecen una excelente y conmovedora presentación. Desobediencia pone a Sebastián Lelio como uno de los mejores realizadores de nuestra época."
    },
    {
      "rating": "9",
      "text": "My favorite film of 2018.  Perfectly executed.  You feel the oppression, the longing. The acting is outstanding.  Each scene reveals just enough.  Here's what I thing Rachel McAdams does better than anyone else: you see her character and think \"man, I want someone to love me like that.\"  I can't wait to watch it again."
    },
    {
      "rating": "8",
      "text": "This is quite a good film. Its one where its what isn't said that says it all. Its all about acceptance and conformity within a jewish family. The acting is good and its pretty thought provoking. I liked the soft music played in the background - not too over bearing. I thought it was quite poignant at times, with hushed dialogue, two people trying to maintain a relationship in obviously disapproving circumstances."
    },
    {
      "rating": "7",
      "text": "Es una película dramática; la trama es buena y las actuaciones de Rachel Weisz y Rachel McAdams son excelentes; es recomendable."
    },
    {
      "rating": "9",
      "text": "Ótimo filme, é meio lentinho mas a mensagem que passa é muito linda e importante."
    },
    {
      "rating": "9",
      "text": "amazing story, shows the reality of a lot of people around the globe, and show it in a very good way"
    }
  ]
}