{
  "id": 3822,
  "title": "Disturbia",
  "starring": [
    "Shia LaBeouf",
    "Sarah Roemer"
  ],
  "runtime": 105,
  "genre": [
    "Thriller",
    "Drama",
    "Mystery"
  ],
  "description": "Kale is a 17-year-old placed under house arrest after punching his teacher. He is confined to his house, and decides to use his free time spying on his neighbors. Things start to get weird when guests enter the Turner's house and don't come back out. Kale and his friends, Ronnie and Ashley, start to grow more and more interested in what is actually happening within the house of Robert Turner.",
  "releaseYear": "2007",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/bJNEBrDy6H4QMHj8GC9OHxPdwJm.jpg",
  "categories": {
    "plot": 6.666666666666667,
    "acting": 6.619047619047619,
    "ending": 6.555555555555555,
    "soundtrack": 5.0,
    "cinematography": 7.0,
    "familyFriendly": 6.0,
    "funny": 8.666666666666666,
    "action": 8.0
  },
  "reviews": [
    {
      "rating": "9",
      "text": "Disturbia is a remake of Alfred  classic, Rear Window. When there is 50+ years in-between the original and the re-make you know it's going to be so different, that they are hardly the same movie anymore. The only similarity in fact, is spying on a neighbor whom the lead suspects is a serial killer. Shia LaBeouf shines in what is his first major leading role. Right from the beginning you can see how likeable he is on film, destine for stardom. David Morse is also great as the neighbor. Morse is always very intense and makes every movie he is in that much better, he is an extremely underrated supporting actor. The story is strong, the cast is strong, and I can guarantee you will be on the edge of your seat, this is a good one!"
    },
    {
      "rating": "5",
      "text": "Somewhat promising at the outset but sadly it degenerated rapidly into a completely generic, implausible Hollywood thriller. Carrie Ann Moss as someone's mother? How the mighty are fallen."
    },
    {
      "rating": "7",
      "text": "Disturbia is a pretty good film; it features a solid performance from Shia LaBeouf before he wasn't famous anymore, and is very thrilling at times. The ending is a bit cliched, but the rest of the movie is worth it."
    },
    {
      "rating": "8",
      "text": "The acting was good, the movie was suspenseful and it was entertaining. It may be a little bit too predictable and cliché at times and it's clearly a movie made for the teenage audience but, it's still a good movie."
    },
    {
      "rating": "8",
      "text": "Uggugugugjjbjbjbjbguugugugugugugyffyyfyfugugutyfyffhffhhffhttdsdgjoomkknbcxvniiyewwdjikoomnvvghytesdfcghjkooiuyy"
    },
    {
      "rating": "8",
      "text": "A dazzling scare dance that's sure to keep you on your toes."
    },
    {
      "rating": "10",
      "text": "Brilliant film, but the tension could've been cranked up another couple of notches if it had been longer. Normally I'd give it an 8, but there's far too many people on here giving it ridiculously low scores, so I'll give it a high one."
    },
    {
      "rating": "9",
      "text": "I really didn't think I'd like it as much as I did. Apart from the really good script and all the suspense and \"oh crap, they're dead\" moments, something about this movie brought me back to when I was still in high-school..... minus the hot chick and the suspected serial killer neighbor. Disturbia is pretty funny when it wants to be, and pretty damn serious when it has to be."
    },
    {
      "rating": "8",
      "text": "A pleasant little romp. Only a little believable, but made well-enough to drew us in. Nice job of casting, and good performances."
    },
    {
      "rating": "9",
      "text": "The best thriller I've seen in weeks, it's really fun and creepy .Worth to watch."
    },
    {
      "rating": "9",
      "text": "Great film in years!! Suspense, romantic, and comedy together, that's great!!!!"
    },
    {
      "rating": "9",
      "text": "I liked this movie.  It was somewhat suspensful without being horrifying.  There were some unpredictable parts and dramatic irony.  Good acting and good story."
    },
    {
      "rating": "8",
      "text": "This movie was very refreshing as it was a tradition classic murder thriller similar to Rear Window but with even more action and suspense.  Although it's slow at times and there could have been a few twists put in, the build-up is great and the characterization is great.  Shia Labeouf does a great job as well as the (extremely) HOT girl lead.  One of the best thrillers in years."
    },
    {
      "rating": "7",
      "text": "A good start  for Shia LaBeouf. It has a relatively sow start but as the movie progresses on it gets to be way more chilling. And the ending, although the lighting is awful cause i couldn't see anything in that basement, was really well done. All in all, good movie. Not the best, but i enjoyed it."
    },
    {
      "rating": "7",
      "text": "It is predictable but solid acting and the film's ability to hold interest through out more then make up for it. I liked the film and I am suprised that so many people bash it."
    },
    {
      "rating": "9",
      "text": "Um suspense de terror incrível Shia LaBeoulf é extraodinário. David Morse faz um ótimo psicopata. Super Envolvente uma simples prisão domiciliar,acaba num pesadelo maior."
    },
    {
      "rating": "7",
      "text": "A very enjoyable little teen suspense thriller. It was hilarious, suspenseful, and incredibly entertaining. It's certainly one of Shia Lebeouf's best movies."
    },
    {
      "rating": "2",
      "text": "I can't believe this movie has gotten good reviews. It was terrible. The acting was laughable (not in a good way), the story could have been coughed up by a four-year-old, and there were only 10 minutes of actual excitement. Sarah Roemer was attractive, Shia LaBeouf was goofy, and David Morse was a good actor and creepy as hell. There's not much more to say."
    },
    {
      "rating": "0",
      "text": "A predictable mash-up of Rear Windows and Silence of the Lambs."
    },
    {
      "rating": "2",
      "text": "This is a TEEN MOVIE being sold as a Hitchock style thriller. The leads are teens, they do a lot of thinking about the opposite sex, and they joke around like teens! The story itself is rather perposterous and is driven by events that are very unbelievable. Be warned: this is a TEEN MOVIE---stay away if you are over 19 years!"
    },
    {
      "rating": "5",
      "text": "Very early impressions: Oy. Shia's brash approach to this character is already grating on me within the first five minutes. He's too brash, loud, and strongly NYr present...he even wears the toolish of all tool T-shirts, (\"Ramones\") ('Guideto Recongnizing...too omnipresent in his blood) in the first fishing scene. Craven plays it with twinkling Irish eyes...Shia's acting if he's got something to prove. Imagine Kal Penn's bravado faux toughness, caretaker vibe in 'H & Kumar.' Oh no, the accident...Let's pour our hearts out. Only his lost puppy dog-eyes bail him out of the early scenes where he must play weak. He's stuck on house-arrest, where's his porn collection? Even Mom is totally casual-cool, 'sorry you're a felon...' I grew up in the wrong household. Rest: A by-the-books story that nonetheless pleases when it indulges its cheap, sullied, low-rent thriller pulpy origins that are a Caruso specialty. Too bad it's hampered by its PG-13 rating, it should have been dirtier. Poor Morse, doomed to always play morally ambiguous creepazoids. (Even Von Trier could not resist.) However, its silly 'house-arrest' subplots and lack of honest emotional characterization made this an annoying downer for me."
    },
    {
      "rating": "6",
      "text": "This is sort-of Rear Window-ish if you kind-of close your eyes and don't know anything at all about the other movie. It's fun to watch but more gruesome than scary. There are glimpses of how clever it could have been but they wussed out."
    },
    {
      "rating": "10",
      "text": "Met my expectations and then some. Shia LaBeouf was very very good."
    },
    {
      "rating": "2",
      "text": "Possibly the worst movie I have seen this year, when you consider the studio and the resources. A total hack job - I don't know how it got decent reviews - it was god awful - please stay away."
    },
    {
      "rating": "3",
      "text": "Tries the trick of having a slow buildup to try to fool some critics into thinking this movie has characters. But in the end instead of going from stupid to more stupid like its genre neighbors it simply goes from boring to stupid."
    },
    {
      "rating": "2",
      "text": "The name of the movie is the best thing about it. But, there was nothing disturbing about this movie. Pretty boring, nothing happened. Fell asleep. The characters were cool, but was expecting a suspense thriller, not, an afternoon TV special."
    },
    {
      "rating": "5",
      "text": "Yikes. I guess smart suspense films are a thing of the past. Hitchcock would be supremely insulted to know this mindless muddle is being compared to his brilliant \"Rear Window\". Okay, there are a few neat little scares, and some nail-biting moments of suspense, but man, can't we get a plausible plot, too? Holes you could drive a Hummer through... And what's up with Sarah Roemer imitating a Playboy bunny rather than a kid? What a really creepy movie this could've been--with a bit more intellectualism, a bit less 16-24 demographic pandering, and a few coherent plot twists."
    },
    {
      "rating": "8",
      "text": "Pretty surprising, for a movie with one of the lamest titles ever. Not dumbed down, even though it's marketed towards teens. It doesn't break the suspense mold, but does little things here and there that are pretty clever. If you're dumb enough to expect Hitchcock from any movie other than a Hitchcock classic, you're not going to have a good time. But everyone else, it's not a bad way to spend a boring afternoon or night."
    },
    {
      "rating": "7",
      "text": "Definitley a worthwhile movie, but not quite as good as I hoped. The movie is very entertaining for the most part but the ending leaves you wanting more. I find that the ending was much to predictable and that it could have been much better, but overall it's still a \"Good\" movie that gets a: 7.3/10."
    },
    {
      "rating": "8",
      "text": "I really enjoyed this one. It's smart and funny and also builds tension and suspense very well indeed. Enjoyable performances and even some romance and family turmoil to add some emotional resonance make this film one I would strongly recommend."
    },
    {
      "rating": "5",
      "text": "This would have gotten a 7 if the ending hadn't been so bad; an 8 if it had kept up with what it had going at the beginning... Alas. Still, this Shia kid is fun to watch as was the babe up until they pull the rug out from you and turn what was a thriller into a slasher."
    },
    {
      "rating": "8",
      "text": "Great thriller! Had me on the edge of my seat. Absolutely unexpected shot at the start. Builds tension superbly and there is enough character development to make us actually care about the characters."
    },
    {
      "rating": "4",
      "text": "It is boring. David Morse is over the top. The movie tries to be suspensful but leaves you in your sit waiting for suspense. But Shia LaBeouf is the movie's saving grace. He is very good and plays the troubled teen well. But the film is over all not worth the time or money."
    },
    {
      "rating": "7",
      "text": "I liked this movie although the ending left me a little disappointed."
    },
    {
      "rating": "2",
      "text": "Loose, weak film relying on poor shock value alone."
    },
    {
      "rating": "3",
      "text": "I feel a little guilty giving this film such a low rating when the real failure took place in my brain. What possessed me to pick the dvd off the store shelf? The title ?? The box ??? ... Knowing that I don't enjoy certain types of films, such as \"chop-socky\", teen-slasher, and anything with Adam Sandler or Jim Carrey, I just don't watch them, and then I don't inflict my predictably low opinion of any given example of such \"stuff\". Let me just say that having missed the clues that should have warned me away from a rather typical teen-slasher-T-and-A-exercise, I did learn that not much has changed in this type of Hollywood product over 50 years, in the social attitudes depicted-- When this teen-hero reaches voting age he'll be reaching for the trusty old Republican lever. It's the picture of bland, mentally dead youngsters as PROTAGONISTS that entitles the movie to be called DISTURBIA."
    },
    {
      "rating": "1",
      "text": "Absolutely diabolical. I saw it for free and I still think I was ripped-off."
    },
    {
      "rating": "9",
      "text": "I went into the movie expecting an entertaining, but probably not very well made movie. I left the theater very impressed for multiple reasons. The acting was impressive all-around but Shia LaBeouf was the real stand out. Not once did I say, \"What are you doing!?!?\" The characters always reacted realistically, and the movie flowed smoothly the whole way. The entire movie felt that it had been polished. I am surprised that the movie's ratings are not higher overall. It seems that critics went to the movie expecting something they reviewed, and not the movie they saw. The only downside to this movie is that it is pretty predictable, which isn't always a bad thing, sometimes predictable means realistic. Overall, this movie is not completely original but radiates through the cast, the flowing script, and the refined feel of the movie."
    },
    {
      "rating": "7",
      "text": "It was good, but I liked it better the first time I saw it, when it was called Rear Window."
    },
    {
      "rating": "8",
      "text": "I personally think this was a pretty good film. There are a couple of different plots that come together in end which makes the twist that much better. Good first date movie."
    },
    {
      "rating": "10",
      "text": "It's not that scary movie that is dumb and has stupid things that are supposed to be scary and they aren't. It actually keeps you on the edge of your seat \"literally\" And somethings happen that you wouldn't expect even my dad liked it and he \"hates\" scary movies! It is the best scary movie I have ever seen"
    },
    {
      "rating": "9",
      "text": "Wow. Smarter than I would have expected. And definetely creepier than I expected too. All the actors played their parts well (especially Morse......creepy). The director also paced the movie incredibly well, building up dread, and then slamming you with tension and jolts of fear. The most fun i've had at the movies in a long time."
    },
    {
      "rating": "10",
      "text": "Awesome movie.. I wasnt expecting the movie to be that great. but i was wrong, the movie kept me wanting to know what was going to happen next..movie was well balanced, the plot was good and the actors were excellent. made me jump out of my seat a couple of times, and that does not happen to me very often. Do not judge a book by its cover, it might look like a bad movie, but the movie its the complete opposite, specially because you know who's doing what."
    },
    {
      "rating": "7",
      "text": "Like John Wayne Gacy, being discreet and ingratiating towards the neighbors(in this case, Kale's mom) afforded Mr. Turner(David Morse) the means to carry-on a long-term campaign of surreptitious murder. In the overblown final act, however, Turner operates like an amateur and nearly undoes the precarious \"Rear Window\" meets \"Ferris Bueller's Day-Off\" cross-generational balancing act that \"Disturbia\" pulls-off with more aplomb than other films which extrapolates classic Hollywood or old English Literature. The Hitchcock classic was really about vouyerism, about the relationship between spectator and spectacle, which on both counts, \"Disturbia preserves. But there's a difference: Jimmy Stewart didn't have a hand-held video camera; he was passive just like any moviegoer, then and now. Kale(Shia LaBeouf), on the other hand is pro-active; he shoots the action(itself a commentary on illegal taping in theaters) and crosses over into the diegesis(like Mia Farrow's character in \"The Purple Rose of Cairo\"). \"Disturbia\" makes explicit that it's a commentary on reality television, so the open windows, the differing panoramas(rather than the solitary building in \"Rear Window) represent the flipping of stations, not a silver screen like in the Hitchcock film. When Kale enters Mr. Turner's house, he's like the star of his own reality program."
    },
    {
      "rating": "6",
      "text": "A decent movie, don't expect anything earth shattering, but it's interesting and kept me entertained. Though I should point out, it's not a \"horror\" movie per say, but more like a drama/thriller. One quick thing to note is that if you don't like unrealistic movies, then don't watch this one, because this whole drama could have been avoided had the protagonist just called the police like any normal person."
    },
    {
      "rating": "8",
      "text": "The first half of the movie is the best - any movie that starts with fly fishing with the most blantent product placement and then turns into a genre blender is worth a see."
    },
    {
      "rating": "5",
      "text": "Our rich vocabulary allows a pithy description of the first hour: slow! However, moving into the latter third of the film we are enlightened. We discover that Hitchcock was a master of terror, as this remake of Rear Window pales in comparison."
    },
    {
      "rating": "10",
      "text": "This movie was sooo suspenseful! This is now my fave movie and I am only 11 years old! I would see this movie if i were you, you'd be surprise!"
    },
    {
      "rating": "4",
      "text": "Since Hitchcock is one of the greatest directors movies have ever had, and \"Rear Window\" was one of his greatest films, it's really not fair to condem this movie because it's not as good as \"Rear window\", as a lot of people seem to want to do. The fact is, on its own terms, this movie is a clumsy mess, with a script that was in need of a major rewrite."
    },
    {
      "rating": "4",
      "text": "This movie and it's premise have been made before. One of the movies that this movie rips off is called Fright Night. Oh, sorry, this ones a serial killer and the other one was a vampire that killed people. Are we really running out of ideas as a culture? How sad. Hey, I have an idea... how about a movie with teenagers getting killed in a cabin out in the woods? Later."
    }
  ]
}