{
  "id": 327,
  "title": "District 9",
  "starring": [
    "Sharlto Copley",
    "Jason Cope"
  ],
  "runtime": 112,
  "genre": [
    "Science Fiction"
  ],
  "description": "Thirty years ago, aliens arrive on Earth. Not to conquer or give aid, but to find refuge from their dying planet. Separated from humans in a South African area called District 9, the aliens are managed by Multi-National United, which is unconcerned with the aliens' welfare but will do anything to master their advanced technology. When a company field agent contracts a mysterious virus that begins to alter his DNA, there is only one place he can hide: District 9.",
  "releaseYear": "2009",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/tuGlQkqLxnodDSk6mp5c2wvxUEd.jpg",
  "categories": {
    "plot": 4.241379310344827,
    "acting": 4.333333333333333,
    "ending": 5.666666666666667,
    "soundtrack": 5.0,
    "cinematography": 2.0,
    "familyFriendly": 3.0,
    "funny": 1.5,
    "action": 3.6666666666666665
  },
  "reviews": [
    {
      "rating": "4",
      "text": "Interesting idea. Bad execution. Gratuitous yuck moments. Super big storyline holes. Hoping for a good sci-fi film and it wasn't even close."
    },
    {
      "rating": "9",
      "text": "Not only is this film an engaging science fiction film it is one of the only sci fi films where I have left the cinema viewing the humans as the real monsters. This is a must see summer blockbuster and probably one of the most important films of this year and maybye the decade."
    },
    {
      "rating": "9",
      "text": "This movie takes us from a tongue in cheek parallel of the apartheid era to the xenophobic actions following of people as a result of the vilification of people in public which gives one the \"right\" to just do what you want to them....it is gritty, very smart with acting, style and the expression of and accent from the home ground of the afrikaans speaking people, so remniscent of many myopic attitudes under the surface of most cultures."
    },
    {
      "rating": "9",
      "text": "I thought this movie was intelligently put together. Its not as deep as a heavy drama, but there's decent character development and an OK script. The technology/CGI for the movie was pretty well done and the storyline concept was unique and well thought out."
    },
    {
      "rating": "9",
      "text": "This isn't a cosy film. You can't just sit there and expect robots hitting each other whilst the good looking guy gets the good looking girl. The fact that it deals with aliens is largely irrelevant. Its NOT about apartheid, but it IS about displacement and reflects the sad treatment of powerless refugees across the world. This is a difficult story with no easy answers provided by the SFX guys. There IS a kind of resolution but its hard fought for and therefore more worthwhile when it arrives. An INTELLIGENT Sci-fi film for once. Well done."
    },
    {
      "rating": "9",
      "text": "It begrudges me to read the negative reviews of this movie. A lot of viewers have focused on the messages (of which are their personal opinions) that this film is portraying rather than judging it purely on entertainment. This movie was a breath of fresh air and is one that I can add to a short list of films I would watch multiple times."
    },
    {
      "rating": "9",
      "text": "As a South African I went to watch the movie expecting it to be worse than what the reviews said. I'm tired of all the racism stories and well I wasn't expecting anything good. Wow I was wrong. I loved it and will probably go watch it again. The only flaw for me is that it turns into too much of an action movie, though still a good one. All the so called plot holes can be reasoned away and I'm glad that we are not spoonfed everything. Awesome movie and well worth the watch!"
    },
    {
      "rating": "9",
      "text": "Stunning, amazing, I would definetly recommend."
    },
    {
      "rating": "9",
      "text": "Whats with all these 0's and people saying this film is bad...?!!?!?! Rigged boards? Dont talk rubbish.. Anyway..this film is geniuenly epic...and it really dos make you feel empathy for the aliens and sorry for Wikus...the main character. I loved it from start to finish....the special effects are top notch, it isnt my favorite film..but its definelty one of them! Seriously do yourself a favor and see it...its really really good!!"
    },
    {
      "rating": "9",
      "text": "I'm certain a sequel is being hashed out as I type this little review and the resulting \"District 10\" had better explain some things to me...like is there a biological basis for bigotry? My left lower claw is tapping out messages in wounded impatience but that's just me and my wild DNA...it gets a little funky with all that cat food in the system. All in all, I have to say this film was amazingly well done and embraced many themes about our humanity that were compelling and engaging. But I didn't feel it was \"deep\" enough. Don't get me wrong. It's a great little film. But the themes have just been scratched and I hope will be further explored. And yeah, I liked all that vomiting, public urination and relatively tidy body explosions!"
    },
    {
      "rating": "9",
      "text": "This movie proves it's not about money, it's all about the artist behind the camera. Well done Mr. Blomkamp and Mr. Jackson."
    },
    {
      "rating": "9",
      "text": "District 9 is subtle, subversive and its a Sci-Fi shot in Johannesburg?? What a treat watching a movie that does not bombard you with colour, special effects and the soulless Hollywood 'SHAZAM' factor. Instead we are given a real portrayal of squatter camp life, with beings suffering and oppressed to the point of revolt. We feel for them; we want them to be rescued and oh yes they are aliens!!! This Movies strength is its core is overflowing with subversive power and the fact that its a alien/chase/special effects fiasco just makes it a great ,great movie!!!!"
    },
    {
      "rating": "9",
      "text": "Dark, twisted, and wonderfully executed."
    },
    {
      "rating": "1",
      "text": "I could not wait for this to get over. I kept telling my wife maybe it will get better in a minute. She was about to loose her popcorn because of all the hand held camera scenes. After all the hype and the rave reviews we were very disappointed. I heard several people leaving the theater voicing the same."
    },
    {
      "rating": "4",
      "text": "I liked this movie while I watched it, but when I stepped out of the theater, I realized how stupid it is. Cat food being like a drug to the aliens? The fact that the aliens look like shrimp/lobster? Laughable! Let's not forget the fact that these shrimp (\"prawns\") communicate with humans easily - us humans know their language! Weird? Yeah. Ok the movie has a \"message\" but I don't think we needed a movie to tell us that racism/unequality is bad."
    },
    {
      "rating": "0",
      "text": "Yet another pathetic allegory for the New World Order salivating to put humans in giant concentration camps after they pull the big false flag trigger to the next world war. Eat me, Hollywood propaganda turd movies."
    },
    {
      "rating": "0",
      "text": "How in craps name did this get any good ratings...it is the worst movie i've ever seen. I'd rather get kicked in the nuts three times before seeing this thriller again..."
    },
    {
      "rating": "0",
      "text": "I don't usually bother to review movies, but this one was soooo bad I felt compelled to have my say. I went with my partner to see it, and after 5 minutes my partner actually said to me \"are you ready to leave yet\"?? I said, \"yes, but it got such good reviews maybe we should stick with it and see if it gets better\". Boy was I in the dog box. The so-called \"allegorical social commentary\" was so blatant and poorly done that a 3 year old could have got it. The acting appeared to be off-the-cuff, with f**k thrown in whenever the script faltered, the attempt at amateur doco film making was so bad that it was worse than most amateur docos (and left us both feeling nauseous with the jumping swaying camera angles). The humor was there, sure, but it wasn't worth more than a slight smile to think, for instance, of aliens being addicted to cat food (including the can). The humor was neither subtle nor very funny. The action scenes were typical of all action movies, and the special effects were not anything new in this age of digital special effects offerings. The plot was incohesive and pretty much pointless with zero character development. The movie brings nothing new to cinema, just a mismashed rehash of the same old same old with plenty of gore thrown in."
    },
    {
      "rating": "1",
      "text": "Worst. Movie. Ever. Seriously?!? From the first moment this movie was just LAME and beyond stupid! Oooh big lobsters arrive (why?!) and are put into a concentration camp that in reality should have been BOMBED from arrival. My husband (sci-fi, war movie superhero freak) said, and I quote \" I would have rather watched Barbie Princess than that shit!\" Luckily we didn't waste an entire 2 hours of our lives on this movie... we fast forwarded and then after turning it off read the entire plot online and realized we REALLY weren't missing anything! How did this movie ever gain any popularity? I want to vomit now."
    },
    {
      "rating": "0",
      "text": "If there was a lower score than ZERO, i owuld have gave it that. This might be the WORST movie I have ever seen, and I saw Battlefield Earth!! If I saw this in the Theatre, I would have walked out. The entire movie makes zero sense.......How did the lead learn how to understand crawfish language? The crawfish leaves by himself? .. Utterly stupid and I will never have those 2 hours back in my life."
    },
    {
      "rating": "2",
      "text": "This isn't a film, it's a social commentary. There are a lot of holes in the storyline because it loses all sense of plot by getting too wrapped up in portraying apartheid. For example, how can the two species understand each other so perfectly when neither one can speak the others language? How does the main human character know how to use alien technology that he hasn't seen before? Why is the alien fuel only found on Earth and if the aliens are so desperate to get home why is only one of them looking for it? All in all this is a fairly terrible film, I expected big things from Peter Jackson after Lord Of The Rings but after looking at some of his other work it seems like he can't make a decent film without guidelines from a book. Very disappointing."
    },
    {
      "rating": "1",
      "text": "This movie was actually painful to watch. It is a sci-fi slow moving, slow paced boring piece. Do not waste your time. Nothing to see or experience here, we almost shut it off several times, but thought, there must be something here. There is not."
    },
    {
      "rating": "3",
      "text": "The opening montage of talking head interviews was a waste of time, and a wasted opportunity. The inconsistency of the aliens' abilities, or lack thereof, was frustrating. The only character that was not a cardboard cut-out was the lead, and even he was border-line unsympathetic because he was such an obvious moron. The main mercenary was somehow unkillable, and therefore highly distracting as the film went to such pains to paint a \"real\" picture. And I agree that the film is not very original. Throughout D9 I could not stop thinking about how much better Cronenberg's The Fly and Spielberg's E.T. are, as narratives and cinema. Ultimately, this is another film, in an unfortunately growing number of films, that is not cinema, but rather feature length CGI exercise. The coolest thing about the movie was the spaceship looming over the city."
    },
    {
      "rating": "6",
      "text": "I've gone over this again and again in my head, because I was really upset about the disconnect between my experience at this movie and seemingly every other review I've read about it. I was really hyped up for this flick, because it felt like it was being made by really creative, really intellectual people who were going to present an allegory in a really new and fresh way. All the promotional material was top-notch, and I spent hours at the website exploring and learning about the premise and the back-story, and just kind of absorbing the whole thing. I showed up at the theatre expecting to be genuinely challenged mentally and maybe even morally, and instead, it was just a popcorn flick. If my expectations hadn't been jacked up so high, I probably could've enjoyed the movie, but it just wasn't what I was hoping for. District 9 was our last chance to rescue 2009 from a summer that included Transformers 2, G.I. Joe, and literally the most boring Harry Potter movie I've ever sat through, which is saying something. Instead, the characters were one-dimensional; the plot ended with the premise, and the ending was a WTF? moment for the ages. The violence wound up being pretty good, but in my head, I was screaming at the good guys, \"WHY AREN'T YOU KILLING THEM!?\" and at the bad guys, \"WHY AREN'T YOU RUNNING AWAY?!\" The special effects and the general presentation were superbly done and visually stunning, but unfortunately, that's where the creativity stopped. Also, I think that if you lived through the 80's, you pretty much got the Apartheid metaphor directly from the trailers. You can almost go into the movie and take it as given. Instead, you sit there and get hammered over the head with it for an hour and a half. It just made me cringe after awhile. And at the same time, it's the elephant in the room. At a certain point, I was waiting for someone, anyone to stand up and say, \"Hey! Remember that one time in South Africa when we used to pretend like blacks weren't real people? This is JUST LIKE THAT. 'Cept with aliens.\" I guess I just found the whole thing insulting, intellectually, which is the exact opposite of what I was expecting, which is why I was so disappointed. And I'm even more disappointed with moviegoers for not calling the moviemakers out on it. Instead, everybody's fawning all over it, hailing it as unique and original and smart, of all things. It just makes me sad."
    },
    {
      "rating": "3",
      "text": "If you want to see the trigger happy military jocks obliterated in blood explosions with the Laser Gun 9000 and a walking mech, this movie is for you.\r If you wanted an intelligent look at race relations or a new, more humanistic look at what alien contact might look like, well, you're better off just watching the short film (Alive in Joburg) and stopping there.\r As part of the second crowd, I was sorely disappointed to find that this film is essentially the premise of the short, which was well made, if not necessary enlightening, filled in with Hollywood nonsense to the point of incomprehension. The believable and intriguing sets of the original are discarded for the mind-numbing adrenaline fest of another cliche action movie.\r But judging by these reviews and the film's $35 million weekend start, I'm in the minority."
    },
    {
      "rating": "2",
      "text": "First and foremost why in the world would getting splashed in the face with there fuel source cause him to mutate into one of them. Even if i mutated him y would the mutation take their form. yes yes i know its alien but it is unfair to just try an explain everything a away with that simple fact. its like answering every question with by saying god did it. lets just chalk it up to bad writing. It Really did not make any since that the alien was looking for cans of their fuel on earth that means they had to have brought it with them when they left the ship and just discarded it y would they do this!!! Cause i think it would have been a lot easier to just look for it while they were on the ship. Second off there were many things in the movie that was not explained why could the understand each other so well but neither side could speak a single word of the others language. Third Why is there a super high tech ship with aliens that are dumber as dumb as a pack of wild dog and acted as such. even if they were just workers and they had a superior race then why would they give them a ship and deadly guns. Forth how did they become stranded when the only thing keeping the ship from leaving was the fact on one was on it. i mean why would he detach that control room from the bigger ship stranding them there. I just think this story line was just haphazardly thrown together for a quick buck after they canceled HALO and based on this movie im am elated Peter Jackson and the other guy did not make HALO they would have messed it up beyond belief Because when it does come out it will be about the prequel book by Eric Nylund like it always should have been."
    },
    {
      "rating": "4",
      "text": "This is one of the corniest sci fi movies I've ever seen. an advanced race of beings that live in a ghetto and eat cat food like it's crack...c'mon."
    },
    {
      "rating": "0",
      "text": "Nothing happens at the start, nothing happens at the end, and nothing worthwhile happens in between. The film was not intelligent, insightful, or interesting. The oh-so original message that the pseudo-intellectuals are harping about is the same one we've seen a thousand times: \"Humans are more monstrous than the monsters.\" Are you surprised? Can you wrap your head around that? How about if I repeat myself again... and again? Didn't Peter Jackson already make a movie about this? (King Kong) *Spoiler Alert* Lastly, nothing made sense. Why come to Earth? Why be addicted to cat food? Why be abused by humans if you have crazy-powerful alien weapons and super strength? Why do the humans and aliens understand each others' language? Why not converse in the same language? It takes an alien 20 years to radio the mothership directly overhead to beam him up? Once in the mothership, why fly away? To get help? You could have done that 20 years ago - ya know, instead of landing here and stranding your fellow aliens in a hell-hole. If someone is shooting you - with bullets - from a gun - and you're dying... why not shoot back!? I've saved the best for last: Why does a splash of alien fuel mutate a person into an alien? .Ask yourself that question one more time... then splash yourself with gasoline. These are not \"plot holes\" these are \"plot chasms.\" They are stupid. The movie is stupid. Before you start with the \"no, you're stupid!\", let me assure you. I saw the movie. I understood it. It was stupid. No, really, I get it. I got it. Yes, apartheid, yeah, segregation, yeah humanity is evil and the aliens are the good guys. Sure, social commentary, satire, etc. I said \"I get it!\" That doesn't make it clever or original, and it most certainly does not make it entertaining."
    },
    {
      "rating": "2",
      "text": "There is nothing here. Some of my favorite movies of all time include Children of Men, the Matrix, Terminator 2, Demolition Man, and any other sci-fi movies with originality. In fact, they don't even have to be original.. BUT this movie does not have a descent plot and it's originality is spoiled in the execution. Maybe my hopes were too high... I don't know."
    },
    {
      "rating": "0",
      "text": "After the first 5 minutes, all I kept wondering is when it would end. I would have made better use of my money to pay them to stop the movie. An absolute boring, mess. The theater was full at the beginning, but people left and didn't return. I should have followed."
    },
    {
      "rating": "10",
      "text": "This movie stomps so much ass that they had to import colons from other countries to keep up with the demand!"
    },
    {
      "rating": "10",
      "text": "Great movie. One of the best of the year. Original and excting. Makes you want more."
    },
    {
      "rating": "0",
      "text": "So sad, a shred and I do mean a shred of anything new in any film is seen as a great film. Shows how desperate people are for a film to break convention. We're all practically on our knees. Pretty standard fare,boring, not great at all. 1. Aliens come to earth. 2 People scared. 3. Aliens have feelings too. 4. Bang, Bang, Pow, Shoot, Shoot 5. Must understand/kill them. 6. Hero lives 7. End storyline with possibility for sequel."
    },
    {
      "rating": "2",
      "text": "Comicbook? Or Headshooter movie. This film is absolute political crap. Notice all the \"good\" reviews nothing about story, filming, acting, just \"it is great\", \"awesome\", \"best movie this year\" my question is WHY?"
    },
    {
      "rating": "2",
      "text": "Ok, lets be fair, this movie was crap. the alien special effects looked cheesy at the best of times and the main character's dialogue makes it sound as if someone had given him a vague idea of how to use the F word and left him to try it out. Also, the plot was a good idea but executed poorly. It could have been a real thought provoking film about the treatment of different looking creatures (mirroring real life events) and possibly even a cult classic...but thanks to bad execution, shocking main character dialogue, pretty bad action scenes towards the end and the fact that the african smuggler guys in the slum were portrayed as hysterical and crazy. come on, it was stereotyping african tribes as being almost bloodthirsty and superstitious! so...why a rating of 2? well, my mates and i pissed ourselves everytime somebody or something got shot and exploded. they even fired a cow at someone. also, the leader of the slum gang got an hilariously O.T.T death that made me almost cry at the stupidity of it. i actually thought it was a black comedy until i discovered otherwise."
    },
    {
      "rating": "1",
      "text": "The only reason this film got good critic ratings is the political message and unusual premise. Execution was a joke. Actors emoted, rather than acted. Dozens of holes, the fact that everyone could easily understand the alien's \"language\" only one of them, and the film suffered from the trendy \"shaky camera syndrome\" (please, learn to create real tension instead of using this tired trick). Don't waste your time with this movie unless you like grade B science fiction schlock, because that's all it is. When there is not even one big name actor in a movie, there is usually a reason."
    },
    {
      "rating": "1",
      "text": "Totally revolting ! used all the typical tricks, racial issues got annoying. Gory and unoriginal. Uncomfortable throughout, leaves you feeling ill."
    },
    {
      "rating": "1",
      "text": "I have never had the urge to leave a cinema quicker! Totally unbelievable cat food eating prawns who have forgotten how to operate their own guns and ship and all so we can have an annoying commentary on racism! For crying out loud why must we be bombarded with such low energy nonsense! There should be an apology made for the harmful impact this film makes on the consciousness of all humanity!"
    },
    {
      "rating": "4",
      "text": "We really need to discourage this insane bouncing camera crap... 5 people walked out of the movie, it was almost unwatchable... The most intense movie had to keep looking away from... Wait for this to come out on a small screen, or prepare to get vertigo. F- for cinematrography B+ for plot ripoff, and A for actual makeup and CGI."
    },
    {
      "rating": "4",
      "text": "Okay for teenagers, not so much for adults that did not grow up playing violent and graphic video games--too many body fluids featured (almost continuously) for my taste."
    },
    {
      "rating": "0",
      "text": "Some here have criticised those who didn't like District 9 on the basis that they didn't 'get' the film. So let's clarify what exactly there is to 'get' from this film. 1) Crazily good CGI 2) One good scene of things being blown to pieces, which is kind of just CGI, too. 3) Oh, and, it's a film about discrimination, yeah, like, set in South Africa, which is ironic, isn't it, because it's, like, a really discriminatory place, and stuff, and they're doing the same here only with aliens, which makes it a satire, apparently. nothing else. really. and that third point about its being a satire/allegory was sarcastic (the film goes about as far as to say \"look, the aliens are being discriminated against, like black people\", before then throwing in a bunch of wildly stereotypical, cocaine-addled black characters.) and..the second point was kind of the same as the first.. so essentially there was only one thing to 'get' in this film - that someone's really good with CGI, and should probably be using their talents to make better movies. This is the crux of my review, so you can stop reading here and go see the movie if you like, or alternatively save your money and your time and put them to better use. If you have nothing else to do, here are some more specific criticisms I wanted it to move in to something more farcical or darkly comic, as it gave hints that it might do, and it quickly became clear that it might be the only move that"
    },
    {
      "rating": "1",
      "text": "Wow, what were the critics watching when they gave this movie such high marks. I just walked out of this movie and received a refund, first time I have ever done that. This movie is a mess from beginning to end."
    },
    {
      "rating": "0",
      "text": "District 9 is an insult to the African empire. And should be banned from showing in any African country. We Africans need to stop the exploitation of our African heritage."
    },
    {
      "rating": "4",
      "text": "Only went to see this movie because of all the great reviews on Metacritic. For once they were wrong. Yes the main actor was good but the camera work was hopeless, the plot flawed and ultimately the movie finishes up confused and torn between a Hollywood sci-fi action flick and a politicial drama about racism and prejudice. This movie could have been so much better if they picked a direction and went with it. Another thing - Why did they need to use the F word so much? Were the writers really that lacking in skill that they had to plug large gaps in the script with all this swearing?"
    },
    {
      "rating": "0",
      "text": "This movie was so bad there's not even anything worth saying about it. I think all these 10s in these ratings shows that movie makers are padding these review sites. I've never entered a review before but had to do it for this movie. This was a putrid movie. I went with four people with pretty varied tastes and every one of us thought it was totally a waste of time and money."
    },
    {
      "rating": "4",
      "text": "Great Idea! Beaten to a pulp. The lead actor didn't carry his role anywhere, of course the script didn't give him anywhere to take it. I liked the South African setting and political backstory and the social commentary, but that got old pretty quickly, the special effects were stunning, but that cannot save it."
    },
    {
      "rating": "10",
      "text": "Simply amazing! There's no ham n cheese Hollywood here for the light hearted, so if that's you, stop reading. Just a brutally honest mauling of the human condition (the aliens aren't all love and flowers either). with some wonderful wonderful acting, i must admit, i hated the wikus character when i first watched this film, but when i watched it again i understood why. He's a selfish little man, who knows full well what he is being asked to do is move over a million 'prawns' to a concentration camp. He only does anything (until the very end) if its in his own self interest. This makes him like 99% of humans alive today, perhaps this was a little too close to home for some us used to Hollywood heroes? anyway, absolutely watch this film, it had me totally glued to the screen for the last 2/3rds of it."
    },
    {
      "rating": "0",
      "text": "Have you noticed how this movie's ratings are all 10 or 0? Shall I tell you why? Because the studio marketeers are rigging this board. I ams SICK of being tricked by the viral marketers! The next one upcoming is \"Paranormal Activity\", which I guarantee will be a complete POS. Same story with Cloverfield - great marketing, TERRIBLE film. PLEASE, PLEASE PLEASE DO NOT WASTE YOUR $$$ on a DVD rental. This movie is a joke, an insult. It is LITERALLY one of the worst flicks ever made. I made the mistake of going to the theatre to see this and - I swear to God - HALF the audience left. It is undiluted PIGSWILL from start to finish. Shame on the marketeers for their low cunning. It's tantamount to theft. But hey, we're all accustomed to being ripped off these days, huh? Sheesh. I despair."
    },
    {
      "rating": "2",
      "text": "Similar to Jackson`s pre-fame films - Bad Taste and Braindead. However, these were pretty much pure comedy and much more enjoyable because of this. This was neither funny or thought provoking."
    },
    {
      "rating": "4",
      "text": "Honestly. Do not believe the hype. A dull mish mash of a film with an irritating lead and zero suspense and emotion. Very, very disappointing. Grossly overrated. Very good special effects though."
    }
  ]
}