{"id": 593, "title": "Divergent", "starring": ["Shailene Woodley", "Theo James"], "runtime": 139, "genre": ["Action", "Adventure", "Science Fiction"], "description": "In a world divided into factions based on personality types, Tris learns that she's been classified as Divergent and won't fit in. When she discovers a plot to destroy Divergents, Tris and the mysterious Four must find out what makes Divergents dangerous before it's too late.", "releaseYear": "2014", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/aNh4Q3iuPKDMPi2SL7GgOpiLukX.jpg", "categories": {"plot": 4.076923076923077, "acting": 4.3090909090909095, "ending": 2.875, "soundtrack": 5.0, "cinematography": 2.5, "familyFriendly": 6.0, "funny": 1.5, "action": 4.388888888888889}, "reviews": [{"rating": "7", "text": "We are presented with yet another distopian society. The film tells the story of a young lady who doesn't quite fit in. The story is entertaining and I would watch it again. Here society is divided into groups and when a person is young they are encouraged to join the group that fits their temperament. This is more action less sci-fi than other films in this genre."}, {"rating": "7", "text": "Being a fan of the series, this movie, in all candor, was not really well put together. Yes, it was a decent movie, but they could have done much better. There are a lot of scenes that were left out and some scenes that were just really sloppy. The book is much better, but it's still worth a try, even if you've read the book or not. If I hadn't read the book, my score probably would have been higher, but since I did, this movie gets a 7/10 from me."}, {"rating": "10", "text": "Divergent is definitely a must see for all ages. I really enjoyed it, however compared to the book it was very different, but overall it was good. I think that they cut out a lot of the good parts of what was in the books. if you have already seen the movie and read the book you will know what I'm talking about."}, {"rating": "9", "text": "I just so happened to have the opportunity to go to a private screening of Divergent on Friday morning, and I absolutely loved it! They covered nearly all the vital events in the book, but skipped over a few (some they could have incorporated into the movie) including Tris' rivalry with Peter and her friendship with Al. That's honestly the only reason why I gave it a 9. The actors chosen fit the roles extremely well, the soundtrack is just magnificent, and the movie altogether had a perfect combination of intense moments and laid back ones. I suggest reading the book before watching the movie, but since only around 50 percent of the people who watched Divergent read the book, people have still enjoyed it despite not reading the book."}, {"rating": "5", "text": "Too similar to Harry Potter and especially to The Hunger Games saga. A teenager girl has been chosen to save the world in the future. This is what a teenager will be looking for when Katniss movies are over."}, {"rating": "8", "text": "I'm giving 8 to the movie because as a person that has read the book I felt that there were some details that shouldn't have been left behind, however Im giving 8 to the movie because even when you didn't read the book you'll understand it without trying too hard and they were kind of true to the book, they weren't mayor changes so yeah, I'm looking forward to Insurgent :)."}, {"rating": "8", "text": "I went into this movie with no pretext of intentions. Well, no, that's not actually true, I went in thinking it was going to suck...\r Comes out around the same time as the Hunger Game sequel, deals with similar stuff...yeah, ripoff, don't care whatever...\r Honestly? It wasn't that bad...\r Sure, there's a bit of a hunger games feel in certain spots, simply due to teens having to choose factions or whatnot... but, that's not how it plays out.\r It almost plays out like Equilibrium, except being from the kids point of view. It's not that they've denied emotion, just compartmentalized it.\r SPOILER: I did a bit of research, and it turns out Chicago is just a big eugenics experiment, which explains a lot.\r But even without that, it's not too hard to understand.\r My biggest complaint is actually the acting in the 2nd half. It's weird but it almost seems like the actors/ancestresses become less comfortable with their roles as the movie goes on, as if it had been filmed in reverse.\r It's not a total K.O. to the movie, but you can tell some of them are forcing their performances more than at the start."}, {"rating": "7", "text": "Another young-adult franchise with a really interesting discourse based on the film, creating an entertaining movie to watch. The performances are mostly nice, but the majority of the time they become inefficient to represent the real story and characters that the book wants to transmit. However, its a nice movie at the end, with several social and political messages that are expressed all over the film."}, {"rating": "8", "text": "I have never read the original book nor the trailer before watching the movie. I think the movie had too much expectation before it was released and personally I found it not bad. Story-line wise, it has too shallow depth about the background as well as thoughts within the protagonist: a divergent, what was she thinking when she decides which fraction to choose?\r The movie is actually quite long but I found it missing explanations or more details throughout the story, in other words, things happen too rapidly. Overall, I like the movie and am looking forwards to the sequel."}, {"rating": "8", "text": "just watched this movie...Good enough for me"}, {"rating": "5", "text": "Not a bad movie even though the movie is mostly lack of action or moments that makes the viewers like the movie. Also, many parts of the movie makes me bored."}, {"rating": "10", "text": "I read all the books to this series then watched the movies expecting more Hollywood to be in it then the book itself. However, when I watched the movie I was blown away. The movie was a lot like the book, but not entirely. Which is still good. The actors were perfect for their roles, they played them very well. I say 2 thumbs up to this movie!!!"}, {"rating": "8", "text": "I think people are being too hard on this movie expecting the next big franchise RE: Harry Potter or The Hunger Games. People need to take it for what the books are. Which in my eyes, the books are not in HP and THG's stratosphere, but rises well above the mediocre attempts at creating literary young adult novel franchises. The divergent series is just okay as is. And this movie was good enough. I feel like the studio succeeded because I got the same feeling from the film that I got while I was reading the book. That to me is a success enough to have made the price of admission worth it. Yes, it glossed over important plot points but really the omissions are not so critical that it ruins things. I went with two friends who didn't read the books, they understood the plot, the premise, and they're planning on seeing the all but certain sequel. Was it as good as Catching Fire? No. But I'd say it was right on par with the original hunger games\rAnd that to me qualifies as passable. More than passable. Shailene Woodley is a terrific choice as the lead and in my opinion she's one of the more underrated actresses in the business. Theo James did better than I expected, and I had my reservations about Miles Teller as the Peter character, but he played it just fine. His arrogance was 100 percent believable."}, {"rating": "6", "text": "Following suit of TWILIGHT SAGA and THE HUNGER GAMES, another young adult franchise embarks on its lucrative conquest, DIVERGENT, shares the same dystopia milieu in the future as THE HUNGER GAMES and a teenage female protagonist, Tris (Woodley), who fights to be fit in a world divided by five factions according to five virtues (erudite, dauntless, amity, abnegation and candour), but she is born to be a maverick who defies categorisation and is so-called a divergent. She joins the Dauntless and meets the mysterious Four (James), the trainer of the initiates, together their romance is budding through the training programs; then they discover Erudite leader Jeanne (Winslet) is scheming to annihilate and usurp the Abnegation faction (which is the present authority and where Tris’ parents belong) to be the ruling class,\rread the rest of my review at my blog, just google \"cinema omnivore\"."}, {"rating": "3", "text": "Long story short: too long, un-charismatic femme lead, and tired premise (you've seen it before). Limited demographic of interest: pre/early-teens, adults will yawn - repeatedly."}, {"rating": "7", "text": "The movie adaptation of Divergent benefits from a talented cast, a spot-on visual depiction of the factions, the Dauntless Pit, and the story's urban Chicago setting. The acting ensemble is as good as the cast of The Hunger Games and vastly superior to that of Twilight and the forgettable Vampire Academy and Mortal Instruments adaptations. While Woodley doesn't fit the canon description of Tris, she captures the character's mix of vulnerability and courage, her desire to be independent in a world that demands conformity. And although heartthrob Theo James is almost too manly looking for Woodley's doe-eyed ingenue, he definitely gets the job done as the intensely serious Four. But the movie doesn't live up to the hype or the potential of the written series. The Dauntless initiation process isn't as violent or emotional on the screen as it is on the page, and neither is the buildup of the Tris and Four romance or Tris' friendship with her fellow transfer initiates. Considering the two-and-a-half-hour runtime, there are parts that drag on and yet aspects of the book that seem surprisingly cut. The performances (Winslet is fabulous as the icy Erudite leader, and Zoe Kravitz, Maggie Q, and Jai Courtney are all true to the spirit of their characters) make up for some of the pacing and screenwriting issues, but overall this adaptation falls short of fan expectations. Still, tweens and teens who've read the books should absolutely see the movies and hope the second and third installments fare better."}, {"rating": "6", "text": "Score: 6.7\r It entertained me somewhat, but it wasn't that riveting or exciting. Divergent has many flaws that are kind of hard to ignore. The very structure of the world that exists in the Divergent movie and books is flawed and counter-productive. The world of Divergent society “makes no sense, except as a metaphor.” The movie and books are somewhat derivative and generic, and both make too many obvious attempts to make the main character relatable to its targeted female audience.\r There isn’t much character development in the film; too many things feel clichéd. Tris/Beatrice doesn’t fit in, doesn’t belong, doesn’t live up to society’s expectations—oh wait, she’s unique and different! Every teenage girl can relate to that! I feel Veronica Roth specifically made the Divergent novels (which I have read, by the way) to cash in on the YA book/movie adaptation buzz that started due to the Hunger Games. (I own and have read the Hunger Games trilogy. I also have the book Divergent, and have read the whole Divergent trilogy as well.)\r Trying to categorize an entire person's fluctuating and complex personality into one category based on one personality trait is stupid. Creating factions would promote rivalry and tension. Divergents are dangerous because…they can overcome their fears? Really? Most people do that eventually! The choosing ceremony could be more practical and sensible. Shailene Woodley’s acting scenes with fighting aren’t very convincing. I think more people should be able to remember that the simulation isn’t real, and therefore defy the tests and be…Divergents? Those darts they used (during that one game of Dauntless “Capture the Flag”) to simulate gunshot wounds/pain, couldn’t they use those and defeat armies non-lethally, therefore technically inventing an end to all wars?\r Some characters and their actions don’t have their motivations explained in the movie. Too many things from the books are left out in the adaptation. Most of the changes are pointless and “hinder the emotional impact certain characters' decisions would otherwise have on the viewer.”\r‘\rAs another reviewer said well, “This movie doesn’t do much to be better than the other mediocre attempts at creating literary young adult novel franchises.” Despite all this, however, I still liked it enough that I’ll be watching the 2015 sequel “Insurgent”. It simply bothers me that the premise of the Divergent novels and movies are so IMPLAUSIBLE.\r If you liked this review, please read my other ones on movies, TV shows, and videogames. I have reviewed 28 movies , including the 2014 films: The Expendables 3, Teenage Mutant Ninja Turtles, Guardians of the Galaxy, Sharknado 2, Dawn of the Planet of the Apes, Transformers: Age of Extinction, Edge of Tomorrow, X-Men Days of Future Past, Godzilla, Blended, The Amazing Spider-Man 2, Transcendence, Jack Ryan: Shadow Recruit, Blended, The Lego Movie, and more. I also review TV shows, such as: TNT’s The Last Ship, Fox's Sleepy Hollow, ABC's Marvel's Agents of SHIELD, CW's The 100, Fox's I Wanna Marry Harry, NBC's Crisis, Fox's Gang Related, and more."}, {"rating": "4", "text": "If I was rating this just as a standalone movie I would have given it a 6, but as a book adaptation it fell really short. The writers left out details from the book that made the story what is was and the character development was seriously lacking. One thing that Veronica Roth did so well in the book was showing the small acts of bravery (mentioned in the movie as the dauntless vision) that Tris performs but the movie left most of them out entirely, e.g., confronting Marcus, helping Edward when he is hurt. You find out very little about any character other than Tris and Four, which made their interactions feel disingenuous. Leaving these things out made the movie feel emotionally empty. Overall, the movie was disappointing as a book adaptation but decent if you have not read the books."}, {"rating": "3", "text": "Divergent arrives with a whimper in the crowded post - Harry Potter young adult franchises largely due to it's failure in generating thrills for most of the movie and it's overly derivative plot."}, {"rating": "8", "text": "From what I've watched, whether or not you've read the book or not, Divergent is simply a love it or hate it film.\r I thoroughly enjoyed the film, and it might just make me go and read the book."}, {"rating": "0", "text": "This movie is complete drivel.  It is made for people who thought Twilight was a great movie and the Hunger Games a masterpiece.  If this is you, you may like this movie.  For everyone else it just plain sucks."}, {"rating": "3", "text": "Divergent arrives with a whimper in the crowded post - Harry Potter young adult franchises largely due to it's failure in generating thrills for most of the movie and it's overly derivative plot."}, {"rating": "8", "text": "Usually, I write a short review of every movie I watch. But I had a lot of things to say about the movie so here goes.....\r Before I start, I would like to say, shame on the critics. Sure, it's may be just their opinions but some of the critics' reviews I have read said that they haven't read the book yet. Critics are journalists and they should do their research a little. Don't just sit there, watch the movie and judge it without some research. And also, are they really expecting Divergent to have the same epic feeling as The Hunger Games? Seriously? We all should know Divergent trilogy won't be brilliant as The Hunger Games trilogy.\r Some of the elements from the book have to be removed for the movie. It's pretty common these days. As a fan, I understand. But what ticks me a little is that two of the important elements have to be removed in the movie. I won't mention one of them because it's a huge spoiler but I will mention the other one. Two of the characters (as I can remember) are removed in this movie and those characters were Uriah and Edward. While I am disappointed about it, I can easily forgive this part unlike The Hunger Games where Maggie is completely cut off and she has some importance to the overall trilogy despite her small appearance. Okay, enough dropping THG references. :)))))\r What I like though is that they kept the final act of the movie justice to the final chapters of the book, except one part which I am not going to tell. But still, it's like what I imagined in the books.\r Most of the cast' performance are okay except Shailene Woodley and Theo James. Their performances were excellent! They are the highlight of the whole movie. I am glad they took their roles as Tris Prior and Four Eaton. If you're still complaining how Theo is quite older than Four, seriously get a life. And oh, let's not forget Kate Winslet! Her signature English accent is not noticeable there so she did her role well. And Theo as well, another English actor.\r And lastly, the pace and the plot of the movie. It's just entertaining enough with its action-packed scenes for non-readers so that's something despite some of the plot holes that some non-readers are going to question.\r I can't wait for Insurgent!!!! (And oh, non-readers, try to read the books. ;)"}, {"rating": "6", "text": "Harry Potter in dystopian times; saddening because YA novel-to-film adaptations in hollywood are now becoming an oversaturated market. It holds to be an adequate film on strong aesthetics as well as good (not her best) acting from Shailene Woodley and the secondary characters. It falters from blatant plot holes, a rushed and forced ending, as well as poor acting from the antagonist (yes, Kate Winslet's role is very superficial, and lacks any form of depth whatsoever). Already signed on to another sequel, here's to hoping that this series contains a learning curve structure. Insurgent now has high expectations."}, {"rating": "4", "text": "It is said that books are always better than than the movies, well in this case is true. Roth's effort in describing each character in the book is absolutely mismatched in the movie. They just scratched the surface when it comes to giving relevance to each character. If you loved the book, you will get a feeling of disappointment once you have finished watching it, knowing that it could have been a much better movie."}, {"rating": "9", "text": "Divergent is one the most intense films I have seen all year, I have never read the books but Shailene Woodley, Theo James, Miles Tiller, Kate Winslet (Basically everyone in this movie) did a great job, even with similarities it is enough with its own thing."}, {"rating": "5", "text": "When reading the book, I had concerns about how well it would translate to film. It's a book without much action and most of the narrative is internalized to the protagonist. Books like that tend to struggle to adapt well and Divergent is no different. The director tried to make changes to the story in order to try and make it work but I honestly think it was futile. It's just not a good story for a 2-hour interpretation. Even at that, I would rather have seen the story stay true and struggle to adapt than change and struggle. All in all, it was set up to fail from the beginning. Shailene Woodley and Theo James gave solid performances and the special effects and action sequences were done well but they made the film watchable and slightly enjoyable at best."}, {"rating": "5", "text": "Dystopian movies are all the rage with Hollywood, especially in the wake of the \"Hunger Games\" series.    After seeing \"Divergent\" I couldn't help but wondering if it shouldn't have been called \"Derivative\".\rNot that it's a terrible movie, or the cinematography is terrible - it just doesn't have much in the way of originality going for it, nor does it have the cast of \"Hunger Games\" caliber.    Face it - there's only one Jennifer Lawrence, and her charisma is far superior to any actor or actress in this film.    Not even Cate Blanchett can save this movie, coming across as oddly wooden rather than sinister.\rClasses of people divided into sectors?    \"Brave New World\".    Mind control?    The same.    Urban decay?    Tons of movies like \"Warriors\".\rWhat makes this an average film is its length, too damn long and a failure to allow audiences to really connect with the acting.    We get \"Ender's Game\" style training and the usual bottom to top struggle to fit into a group.\rAll in all \"Divergent\" has possibilities maybe for a sequel that could actually be good - the \"divergents\" coalescing somewhere and taking on the structured society of the post-war Chicago, where the reason for the war or the reason for the class structure are never explained.    Just shows how power the \"Hunger Games\" series ultimately is."}, {"rating": "3", "text": "Full disclosure: I haven't read the books, but as someone who has read all of Harry Potter and The Hunger Games, I can say that this movie suffers from all of the pitfalls of every young adult novel series that followed either of them, that it shamelessly copies the story beats and themes from those greater ones that came before. Divergent offers zero in the way of new or compelling ideas. The premise, that everyone in the future fits into one of exactly 5 psychological types (termed Factions by the film and book) is flimsy at best. The worst offenders are the 'Dauntless', the enforcers/protectors of all of Chicago. You might as well call that faction 'The Idiots' as all they seem to want to do is run around everywhere in dark clothing, climb everything in sight, and jump off of/onto moving trains (although perhaps in the future all trains don't have brakes in which case mea culpa). Why the heroine wants to be a part of that group is as big a mystery as why the Erudite faction (the scientist faction) wants to wipe out the Abegnation (the Amish, er, bureaucrat) faction.\rApart from the story, the actors chosen for the roles all looked like they were taken from The CW, and the art direction and set design looked decidedly 'B' movie, with not great special effects and set design that looks like it was ripped from a Canadian sci fi TV production house.\rAfter seeing this I have no interest in reading the book and hope that the studio doesn't waste it's time and resources with a sequel vs working on something worthwhile."}, {"rating": "2", "text": "\"Divergent\" is based on Veronica Roth's young adult series of the same name. The story she has created is very complex and makes readers think about their own \"self\" and others. Each character in the book are given their own spotlight and reader's get to learn more about their traits. My biggest issue of the movie is how they rushed the character development. Even though the movie is already running at 143mins, they could have at least done a more cohesive introduction. You really don't get to know the rest of the characters except for the main protagonist, Tris. What is worst about the movie is that the order of occurrences from the book to the movie are jumbled. It is completely out of order and some scenes they just added. The script could have been so much better and the book has so much potential to be made into a movie."}, {"rating": "0", "text": "Divergent was the first time I've walked out of a movie in nearly three decades of going to the cinema. The Hunger Games films, while far-fetched and cliched at times, have worked so far because they have featured strong scripts, great pacing, genuine dramatic tension, interesting characters, and good acting. The dystopian society presented in Divergent, with its personality-based caste system, is intriguing. Unfortunately, it is populated by one-dimensional characters who spout shallow, vapid dialogue and act in incomprehensibly stupid ways. Tris Pryor, the heroine, joins Gryff... er, sorry, Dauntless, the Faction we're told act as the police, protecting the citizens of post-apocalyptic Chicago. But instead the brave folk of Dauntless seem to be a pack of moronic adrenaline junkies who run around everywhere and climb everything in sight for no discernible reason. New recruits to Dauntless, straight out of the Faction-choosing ceremony, are expected to jump onto a moving train and then jump off of it onto a roof with no warning or training. Exactly what purpose does setting new recruits up for nasty injuries on their very first day serve? Then they're made to beat each other up Fight Club-style. They're warned that if they don't perform well, they'll be cast out to fend for themselves as Factionless on the cruel streets, but they don't seem to be given any form of structured combat training to help them become better fighters. Oh, and they all get tattoos at one point, because apparently having a tattoo means you're a BAMF and no one will mess with you. It's like something a twelve-year-old more concerned with coolness than any sort of internal logic dreamed up. So what if there's no reason for the police to engage in random acts of parkour like a bunch of Spider-man wannabes? It's cool! Did I also mention that the cardboard standees on display in the lobby of the theatre had more dimension than the actual characters in the film? Tris is a perfect Mary Sue and everyone else is a one-note stereotype. Christina, who was born into Huffle...er, Candor, the honest Faction, but chose Dauntless, always says whatever is on her mind. The boy who was born into Raven...er, Erudite, the scientific Faction, is a Spockian sort who randomly cites statistics during target practice. It's obvious from the first twenty minutes that Erudite are going to turn out to be the villains, and, frankly, I find the portrayal of scientists and intellectuals as cold, shrewd, and evil to be deeply offensive."}, {"rating": "1", "text": "Divergent a movie I thought was actually gonna be pretty good was just horrible. Okay first they spent more money on the sound track than actual character development. You don't even learn any of the characters names until the movie is almost over. Also there are many parts in the book that aren't in the movie. It made the book very good and gave more explanation. Also the whole feels like its on fast forward because 3 minutes into the movie your already at the test and then 20 minutes into the movie the characters are in initiation. In the book it took way more time and explained everything. Also Peter wasn't as sinister and evil and we didn't no his name until the end of the movie. Also they give no motive for Al's suicide and his character isn't talked about for the rest of the movie. We really didn't even know his name. The only good thing about this movie is the soundtrack which helps the movie's pacing. In conclusion this is one of the worst movies I've seen in a while and I would be surprised if it doesn't take home at least one Razzie Award."}, {"rating": "3", "text": "The movie suffered from obvious plot holes and there were things that just didn't make sense. There are 5 factions living in what appears to be post apocalyptic Chicago. The main character's faction is the one that runs the government. Yet we have a random woman who doesn't fit in any faction (or at least they don't tell us what faction she's in) that plots and conspires to kill everyone in the ruling faction. What doesn't make sense about that is the woman appears to be the leader of everyone. If she's the leader wouldn't she be part of the faction she's trying to destroy?\r That's just one out of many things that didn't make sense. Don't see this movie. You will be horribly disappointed."}, {"rating": "10", "text": "I could not have picked a better cast or director for this movie. Neil burger executed this pretty darn well, and the book to movie adaptation was amazing. I am a fan of the books, and I loved this movie. A must see for everyone, book readers and non book readers. Everyone in the theatre was having a good time, and that is the real reason of movies (to me)."}, {"rating": "3", "text": "\"Divergent\" has an outstanding cast but the director wastes them in a script that borrows heavily from Harry Potter, Twilight series and Hunger Games."}, {"rating": "10", "text": "I watched this movie with no expectations, and Wow... this is film is an eye pleaser! I very much enjoyed the story, can't wait to see the sequels Insurgent and Allegiant Parts 1 & 2! Neil Burger did a great job directing! Top notch action, drama, sci-fi film so far this year...!"}, {"rating": "6", "text": "This was an average movie.  The lead actress was too weak to captivate and the story just never drew you in.  This was certainly no Hunger Games, but perhaps still worth the watch."}, {"rating": "9", "text": "DIVERGENT is a thrilling action-adventure film set in a world where people are divided into distinct factions based on human virtues. Tris Prior (Shailene Woodley) is warned she is Divergent and will never fit into any one group. When she discovers a conspiracy by a faction leader (Kate Winslet) to destroy all Divergents, Tris must learn to trust in the mysterious Four (Theo James) and together they must find out what makes being Divergent so dangerous before it's too late"}, {"rating": "4", "text": "If you are teenager or you acting like that you are welcome to see that film.\rIf you have protest soul and don't have enough brain muscle in your head you are welcome to see that film\rEverything is trivial and understandable from first minute, o begging your pardon not from first, from 10s minute everything is understandable.\rA good pretty girl who will safe our world one more, o dear, why they thing ( I'm talking about directors) that in every movie main characters need to safe our world could you make movie where people don't safe the world but still doing something good, is it possible ?\rGood movie to see doing something as cleaning your house or playing some good game."}, {"rating": "6", "text": "I never read the book, but I saw the movie anyway and I thought that it was alright but nothing all that great. I will probably read the book eventually but not anytime soon. I just wasn't all that captivated at some points, but I do think that there was some pretty good action from time to time. I would probably only recommend this movie to fans of the book."}, {"rating": "10", "text": "Divergent is a fantastic movie in my opinion and I cannot wait for the next film Insurgent. I know that people have been saying that it is a Hunger Games rip off but they are wrong. It may have some similar themes to the Hunger Games they are different films.\rOn the subject of similarities between films most films that come out nowadays are complete rubbish and they are mostly copies of earlier films."}, {"rating": "8", "text": "Meh...\rIts pretty good...\rI watched the movie, then read the book, like a swag person, so keep that in mind...\rFrom a movie standpoint, its pretty good. The actors are not well known, but they are pretty good. Its well written and all, and everything is done well.\rBecause Metacritic doesn't have book reviews, well, this will serve as my review for the book as well.\rIts good. The story is quite interesting. Chicago is one of the last remnants of civilization. Some war happened, of which the book speaks very little, and the city has divided into 5 factions. There is the dauntless, the faction to which the book revolves around, who believed that the world ended due to cowardice, therefore, they serve as the army. Then there are the ones who believed stupidity was the cause, and they serve as the smart people. Then there is the ones who believe it was liars, who serve as the justice system. Then there is the Mormon farmers, who believed sadness was the cause, and then the people who think it was due to people not conforming, who serve as the Gov't. Anyway, the whole thing about the book is that people take a test to determine which faction they belong in. But then there are those who don't belong in any, and are called divergent. They are considered a threat to the system of gov't because they can think and break the simulation, and well, ya. The protagonist is one of the Divergent. She chooses the army people, and half of the book/movie is based around her training. Then 2nd half of the book/movie is based around how the smart people try to take over the gov't by using the army with brainwashing and lots of killing. Granted,i've spoiled a lot of stuff already, but there is some interesting plot twists and turns and all that stuffs. Anyway, its a pretty good book/movie, and well, is a lot like hunger games. If you liked hunger games, you will like this. Simple."}, {"rating": "9", "text": "Divergent is about a young girl named Tris who seems to be \"Divergent\". This is a great movie though the book is way better and has more detail unlike the movie which they changed."}, {"rating": "0", "text": "Wow this movie was as boring as predicted, the acting is not that bad....but not very interesting.  It looks like a cheap cash grab \"hunger games\" wanna be movie.  Stay away until it comes out on DVD for a buck."}, {"rating": "10", "text": "Definitely I love this movie very interesting and as a viewer I could understand what the movie is all about. To me I prefer this movie to Hunger games. I can recommend Divergent to anybody to watch."}, {"rating": "3", "text": "“Divergent” has filled many teenagers with misguided anticipation for months. Neil Burger, director of the films “The Illusionist” (2011) and “Limitless” (2011), has created this film based off of Veronica Roth’s novel. This film was supposed to combine gripping action and tender romance. These two factors were supposed to generate “…the next big thing (The Wire)”. But this film did not do enough to blow me off my seat. Shailene Woodley, the protagonist of this movie, plays Beatrice Prior. Her character is an awkward, daring, and combatant sixteen- year old who was born in a selfless faction called Abnegation. Despite her origins she chooses to live in Dauntless, a faction that does not know fear. There she consistently encounters and soon develops a relationship with Dauntless trainer Four, played by Theo James.  However, despite the “unexpected” fight scenes and the “star crossed” co-stars, this film was repetitive, dull, and deficient to say the least.\rThe first element of this movie that already disappointed me was the setting. As shown in the commercials, this movie takes place in a futuristic dystopian society. I am not sure if anyone else remembers, but there has been a recent movie with a similar atmosphere. If you cannot remember, I will be happy to let you know that it was the “Hunger Games”. I do not think Neil Burger or Veronica Roth would want to hear this, but this movie is like the demoted version of the “Hunger Games”. Manohla Dargis points out that the movie does offer the standard aspects for a teen flick, “…but the similarities\rbetween these young adult juggernauts are conspicuous in the extreme (The New York Times)”.  In previews, the leaders of this society are attempting to place people in factions according to their identity. So it is already evident that there has to be some kind of distortion to break this cycle. This is where Shailene Woodley comes to the rescue. Since it is not a secret that she is Divergent, it is automatically clear that she is going to be the rebel of this film. This makes it even easier to realize where the movie is going. And the next place it shall go would also cause me more dissatisfaction.\rOnce Beatrice “unexpectedly” arrives in the dauntless faction, she meets the withheld and painfully attractive transfer trainer Four. As the movie goes on, they magically realize that they are meant for each other. Now I love romance as much as the next person, but I think it is safe to say that the young audience needs a break from it. Just like ice cream, too much of it can make one sick. If you look back in all the recent teen love films, I think a lot of people would agree that the whole “Romeo and Juliet” trend needs to have a break for just a while. Los Angeles Film Critic, Kenneth Turan, supports this topic when he states that the movie “…really drags out the romantic uncertainty element… (LA Times)”.  But besides the cliché adoration, there is one more thing that really displeased me.\rSo far we have had numerous novel-based movies. And to name a few off the back we have had The Fault in Our Stars, Catching Fire, Hunger Games, The Host, and The Twilight Saga. Now that we have an addition of Divergent, I am beginning to question the passion behind these directors. When I see a consecutive line-up of novel-based films, I also see a lack of creativity. And the main thing that adds fuel to the fire is how agonizingly accurate this movie was to novel. If a director decides to make a movie that is based on a novel, they should go beyond the audiences’ expectations. This should really apply to adolescent films, which mostly consists of excitement and thrills. A movie should be so spectacular that a couple of glitches should not matter. Chicago Tribune Film Critic, Michael Phillips felt the same way when he said, “The movie version of ‘Divergent’ is no divergent. It goes along to get along. It’s tame, formulaic, and strictly by the book in every sense (Chicago Tribune)”. And I do not want to declare any director lazy if he or she creates a film from a work. But if you do go for it, go above and beyond the text. Because that will give some people the impression that you’re lethargic in originality.\rSurprisingly enough, there is one positive thing that I could take away from this movie. This is the second movie that has portrayed young women as being independent, strong, and superior. This exposure is diluting the “damsel in distress” trend that is often seen on television and in movies. And a lot of girls need to be reminded that they could also do a lot in society. Not going against an entire totalitarian system, per say, but in other things like in their community or in their careers. I am also aware there is suppose to be a second movie next year. I just hope that the director will be more daring the next time around. . Because their boldness might just be what the Divergent movies need to really become “…the next big thing (The Wire)”."}, {"rating": "6", "text": "\"Divergent\" 10 Scale Rating: 6.0 (Decent) ...\r The Good: It's not a bad concept and has potential. Shailene Woodley turns in a great performance. Theo James starts off sluggish, but turns it around and is solid as the male lead. The characters in the film are well written and pretty deep. The first half of the film is absolutely fantastic and you don't want it to end.\r The Bad: Unfortunately, the second act falls apart. Very VERY predictable and this shadowy and intricate plan that the villains unleash is simple and disappointing. The last quarter of the film is a boring shoot out with a very vanilla ending. It's a shame that they could not capitalize on such a great start."}, {"rating": "3", "text": "As a book reader, I have never been so disappointed in a book-to-movie conversion.  Not only did they leave extremely important details out, but many important events occur out of order.  Motivations for certain characters aren't even explained; even extremely important plot devices are not included.  Many of these changes serve no purpose and hinder the emotional impact certain characters' decisions would otherwise have on the viewer.  Book readers will generally be confused with the changes, and by the time the credits roll, most will be asking, \"Why?\""}, {"rating": "2", "text": "I wish I could write this independently of the novel, but I can't.  There are omissions and edits all over the place, which can be forgivable if there aren't major plot points or essential to character development, but this film fails to deliver any reason to attach to any character or the world around it.\r If you're thinking about seeing this movie, just buy the book; you can probably get through it in the same 2.5 hours you'd waste at this uninspired film bastardization."}, {"rating": "0", "text": "*WARNING SPOILERS*\rHoly cluster **** Let me first start by saying that this movie was one of the worse movie ever. The writers obviously didn't even pretend to make it realistic in anyway. The makers must just wanted to make money out of this and had no interest in making it a quality movie. This cliched , idiotic premise, and cheesy filled movie just kept crumbling down as the movie dragged along. The whole premise of creating five factions to promote peace is probably thee or the second dumbest idea I've ever heard. Creating fractions automatically creates tension. This is not even the tip of the iceberg.\r We get to the test to decide what fraction you should be in (rip off of Harry potter by the way). The person is told its a test and given a drug that enhances your dream world. Giving you a test to choice what to do. Any capable mental person would obviously know its not a dream. Maybe the drug gives the dreamer a huge sense of fear...can we explain this please.\r The word Divergent is for someone who has no fear, which in fact is totally unrealistic. This allows a different prospective ideas and ideals that span across each fraction. The thing that makes no sense is the fact that they allows people to jump to a different fraction. Isn't that almost like being divergent. Tell me I'm wrong please.\r The protectors was this rag tag group of people who jump out of trains while moving, that jump into them while moving, and do all this crazy stuff. The brilliant creators has this smart idea to put this out of control bunch of people in charge of the safety and security of the \"colony\".\r Talking about the fractions. Abnegations hold office and are the leaders of the society. The problem I have here is the fact that they really don't do much. It seems like they're not really in charge at all. The movie doesn't even explain anything about the process of making law. Do the abnegations make law, give it to Candors, and then the leaders signs it or something? Also the leaders live in one of the **** places in the whole society.\r Now lets jump back on track.\rThe Ceremony:\rYou have these young kids cut themselves (which could cause infection and what knows what) to decide what fraction to go into. What reason exactly? To make it look cool or something? Can anyone example the significance of it? It doesn't explain that at all. Why could you just thrown the **** or anything else?\r Now we get to the middle of the movie where it wasn't that bad. It started off shaky but turned to be a pretty good movie. It was at about a 3.5/5 at one point until of course it started to fall apart at a colossal rate.\r The movie does a great job showing this society that's eaten itself apart and it's moments away from falling apart. We see get this test to determine if you have what it takes to be in the fraction. I understand that most actors don't know how to fight and I get that. Though you would think that they would bring in trainers that can actually teach someone how to fight. Woodley looked like a ****ing idiot out there. She was punching like she was Parkinson's disease. It was as if she was trying to have a **** fight with a labradoodle. It was quite embarrassing. Then you have this weird hand position of the hands that would never ****ing work. Now I'm not an expert in fighting (though I do do karate). That hand position will not protect **** and will actually cause your hand to come back and pop you in the face. Okay yes the position of a person doesn't determine how bad a movie is. Stick with me.\r So then we go through test after test of getting to know someone. The tests were pretty awesome and seemed to be a highlight. Though you have Woodley; who basically fails at every test, all of a sudden gets this holly light in her. she didn't receive any major help. Tris moves up the ranks and makes the cut.\rYeepy!\rYou don't really see any of the outcasts though. They are just thrown out without an acknowledgement. Whatever at this point.\r One side note:\rThe movie was extremely sappy, but i should have know that coming in.\r The Ending:\r Then the ending starts to roll around and all hell of idiocy happens. We first learn about this \"army\" that four shows us. You know kids out there and few people of an apocalyptic outcome. When you see an army that's being made up and constructed; will you please tell someone besides your girlfriend. You would think that if there's a rumor of an overthrow; that some one would get a hold of it. They would then get this information and do something about it. You would also think that Abnegation would confront the issue. They're the leaders of the control for god's sake.\r Four then comes to the conclusion that they are building an army on the sole mariet of Erudite bringing in supplies in to Dauntlet's place. Maybe the leaders would have killed him for bringing up questions. I would tell you to go to other fractions. Another problem could have occurred.\rWhat if they stopped him?\rA. but then how did Tris get out so easily.\r Maybe they wouldn't have listened to him?\r I'm pretty sure when they hear this \"rumor\" of an overthrow; they would have listened. The fraction to go to would have been Abnegation. That's the exact fraction trying to get wiped out. Also why in god's name would the Dauntless be on the side of the erudite in the first place. What do they get out of this? Would they become military \"slaves\" of the erudites? Why get rid of a peaceful people like the abnegation? They seem to be hated throughout the movie with no explanation.\r So now the army that's created by this serum that makes their own people turn into \"zombie\". These zombies kill and don't ask questions. The premise is the fact that Divergents don't get affected by it. Why? No explanation is need I guess.\r Let's get the fan fact of why the movie was one of the worse movies I've seen. The decisions of the characters was like a five year old was making them. These decisions were dosed in cliches and lit with some bad acting.\r Let me combine both of them in my next paragraph. I'll just start off this section by examining the ending other. I'll be here all day if it was the whole movie. The audiences watch as the two main characters pretend to be zombies while Daughtless takes over the homes in Abnegation.\r First, they watch one of the people shot as they walk by them. You're a zombie! Please act like it. They then run in Triss's house while screaming their heads off for her parents. There are people outside killing other people. They can hear you and obviously you're not a zombie if you're screaming your head off.\r Later they get stoppped by the head guys of Daughtless. They have their cliched laugh of the warrior in Four looking like an mindless idiot. They then all of a sudden notice that he's Divergent. The cliched \"everyone has a gun and everyone is pointing at someone\" occurs. Stalemate right? Well it didn't have to be if the dumb **** would have just shot both of them in the head from point blank range. They get caught and another cliche appears. \"The main character gets away. The friend or family member gets caught\". A cliche comes yet again. The \"hero is saved from some random person out of nowhere\".\r Tris goes with her mom into the city to find the group. We get to a part where they are confronted and they kill the evil people. Cool. They come to the end of the alleyway, where the mom stops her and said \"cover me\". From what! The end of the alleyway was nothing but grass and open space.\r Cliche alert again:\r\"no I got this, cover me\" type **** comes from Triss. What the F? Why the hell do you need to be covered? A truck then comes around the corner and people start shooting. So did they hear that? If yes then why didn't you just ****ing wait in the alley and let the car go by? I don't get that concept at all. Let's just run into the middle of the field by yourself, so your mom has to save your ass and get killed (cliche by the way). The mom dies and she finds the group.\r\rThey then go stop the slaughter before it kills all of Abnegation. Tris finds guns on the people that she shot. Apparently \"nobody investigates shots getting fired\". There was a lot of compotion around the village. I do get that. Though the only gun battle was between those two. I'm also wondering \"what the hell happened to the people that were shooting at them from the truck\". Did they just not want to pursue the attackers or something? I'm just confused how she was able to get weapons from the people she just attacked? Whatever, lets move on.\r\rSo the group gets to the place where this program for the zombies are taking place. Which seems to be randomly in dauntless's place and not Erudite's. Why, I don't know?\r\rCliche alert.\r\rThe dad is responsible this time.\r\r\"I will distract then and kill them because were running out of time\".\r\rHe runs out and kills the guards by himself. What the flying **** You have three people with guns and there are only four guards. Just have one person shoot two of those ****ers. Lets run out and get killed while only killing two of them. It was like something from a parody. Tris looks towards the dad and said \"what are you doing dad?\" or \"Are you okay dad?\". I don't remember. It was one of the two\r\rWell the camera pans back to the dad with like seven bullet holes and blood flowing from his mouth. You know he was probably just resting from the hard day. *sigh*.\r\rTris tells everyone to stay there to protect his brother for some reason and goes on alone (cliched). Why? I don't know? She finds four who's staring in one direction like a zombie. She ask \"are you okay?\". Well he has a mindless stare and has ivies attached to him. He must be fine.\r\rCliche alert\r\r\"The person can snap out of anything for love type **** occurs and the both of them stop the killing of Abnegation. Okay, so now you have the leader of the bad guys in your hands...who did all this crazy **** and you don't off the **** Fine, morals. Ending her life could have solved everything. Let's say you didn't kill her. The threat is over. You can just kidnap her and give her up to the other fractions. Put her up for trial or something. Even if one of the fractions is still on her side. There's three against one. Kill off the two other fractions and you'll be fine. You don't need to leave for no good reason. Lets say that Dauntless has all the weapons. Well that was an idiotic premise in the first place.This stupid premise goes back to the idiotic premise of having five fractions. Just whatever on the whole premise right now.\r\rThis movie was just a cluster **** of utter proportions. Again this is a good portion of the cluster ****ness. I would be here all day trying to go through all of it.\r\rP.S. This is a rip off of Harry Potter and Hunger Games. Ask me if you want to know why.\rA solid 1/10. My lowest rating of a blockbuster movie ever.\r\rForgot a couple of things. If you're going to build a wall from an enemy. Please build it around your crops so people won't steal **** or burn them down. Also when those \"zombies\" became good again. You can use those people to fight off the rest. There's no point of leaving. Also to those who liked it. Pay attention more."}], "recommendations": ["the_hunger_games", "the_maze_runner", "the_hunger_games_mockingjay_part_1", "the_dark_tower", "contagion", "children_of_men", "maze_runner_the_scorch_trials", "the_adjustment_bureau", "chaos_walking", "the_darkest_minds", "artemis_fowl", "the_purge_anarchy", "source_code", "the_giver", "noah", "inferno", "x_men_apocalypse", "the_golden_compass", "code_8", "the_butterfly_effect", "city_of_ember", "ready_player_one", "what_happened_to_monday", "death_note_relight_1_visions_of_a_god", "unfriended_dark_web"]}