{"id": 841, "title": "Django Unchained", "starring": ["Jamie Foxx", "Christoph Waltz"], "runtime": 165, "genre": ["Drama", "Western"], "description": "With the help of a German bounty hunter, a freed slave sets out to rescue his wife from a brutal Mississippi plantation owner.", "releaseYear": "2012", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/7oWY8VDWW7thTzWh3OKYRkWUlD5.jpg", "categories": {"plot": 8.857142857142858, "acting": 8.867647058823529, "ending": 8.666666666666666, "soundtrack": 8.0, "cinematography": 7.5, "familyFriendly": 3.0, "funny": 8.173913043478262, "action": 8.272727272727273}, "reviews": [{"rating": "10", "text": "Excellent film. I love all of Quentin's movies but they keep getting smarter and more entertaining. While I'm scared to use the word \"realistic\" when talking about this movie, it definitely feels more real than some of his past titles (Kill Bill, Inglourious Basterds). The characters are, as always, extremely entertaining. Quentin always brings the best out of his actors, and maybe that's because he just writes such great characters for them. The theme for the film is vengeance, which is the usual for Tarantino. He follows the Tarantino style as you can expect, but he doesn't fail to throw in a few surprises. He also isn't afraid to stay true to the times with the word **** being thrown into every other line of dialogue. I'm glad he didn't shy away from this because, as someone familiar with history, it wouldn't have felt right. The dialogue is fantastic, the pacing is terrific, the action is spectacular, and overall it's a very entertaining movie. I can tell already that a few racist or ignorant people are leaving bad reviews because the film pokes fun at them, so be weary about bringing anyone like that to see the movie with you."}, {"rating": "2", "text": "Good acting by Leo DiCaprio & Samuel Jackson. In all other respects, this is Tarantino’s worst movie."}, {"rating": "10", "text": "Django is another movie beautifully directed by Quentin Tarantino. It is astonishing that QT is able to take a subject as sinister as the treatment of many African American slaves during the nineteenth century and turn it into a film not only honorable of the subject matter, but as great of a story as Django is. In the midst of much of the underlying torment in the context of the film, Tarantino is once again still able to deliver a movie that is both riveting and hilarious. The genius of this film is only further cemented by its exemplary cast. Leonardo DiCaprio plays an outstanding role as one of the wealthiest and cruel plantation owners in the South--so believable at times, it is scary. Jamie Fox also plays his role terrifically, giving the film the hero it deserves. Even the role played by Samuel L. Jackson is utilized very well. However, the role played by Christoph Waltz as Dr. King Schultz is simply sublime, and is a shining example of why he is becoming one of my favorite, if not my favorite, actors to date. Django is sure to become another Tarantino classic."}, {"rating": "4", "text": "I loved \"Inglourios Basterds\", but I have to say, this movie was so...predictable. This is the first Tarantino film where his formula becomes obvious, and unfortunately, it's not to his credit. There were very few surprises, the humor was weaker than usual, and yeah, the soundtrack was fun, but also kind of obnoxious. What was lacking was the sheer creativity I've come to expect from QT.\rAlso, it must be said, Jaimie Foxx just doesn't cut it -- his was the least interesting character in a movie named after him.\rBy no means was this awful -- the cinematography was gorgeous, the setting was intriguing, and the historical sweep was fun. But wtf is up with having to say the cinematography was good after a QT film! That's not why anyone is supposed to like this. Overall: weak sauce."}, {"rating": "1", "text": "If you like Kill Bill you will like this movie. That being said, I liken Taratino's filmmaking to a teacher preparing lesson plans for the slow reader group. This movie has the most base elements and is stock full of his trademark violence. Maybe, I'm the dim bulb but I just don't get this film. Angry black man taking his revenge on the tyrannical white establishment. Beyond that there isn't anything else in the film. It seems to be one long excuse to spew racial epithets, over and over and over and over. The film lacks any real depth and most of its appeal will be to the type of people that watch police chase videos or scan YouTube for someone getting kicked in the groin. If you have a couple of IQ points you can spare, then by all means burn some brain cells watching this entirely uninteresting flop. Enjoy!"}, {"rating": "1", "text": "The thrill is gone. Tarantino leapt to center stage of American film making with Reservoir Dogs and cemented his reputation with Pulp Fiction, but it's time to face facts; sometimes there's two flashes in the pan before it's over. Tarantino, like Coppola, Cameron and Lucas, has lost his creative edge. Viewing a Tarantino film, one must expect violence by the ton and language that would make David Mamet wince. But, unlike the grievously over-rated Mamet, one also expects Tarantino's wit. The only humor here is a rip on Blazing Saddles with the overused racial epithet. I'm not a fool. I'm not expecting this review will stop anyone from wasting their money on this thing. I'm not expecting anyone to wake up to Tarantino's failings because I point them out. The NYC film critics love him as do the majority of those posting on this site. But, personally, I think you should wait to rent this thing or, better yet, pass it up entirely."}, {"rating": "6", "text": "Inglourios was much better. Where to begin...parts of Django were good. Leonardo, Jamie, and without a doubt Christoph Waltz. Django was, toooo long. Easily could have done without 30 minutes of it and it would have been better. I found myself bored. I'd rent it so you can take a break midway :)"}, {"rating": "2", "text": "This a pornographic roll in the gutter full of blood and guts. You will be thrilled by the music, cinematography, acting and sets, but really it says more about the state of mind of a society that thinks a spray of viscera is entertaining. I got a few laughs but it really is a page torn from a comic and at times seems to play with the viewer as if to say, \"You, stupid viewer are a patsy.\" The characters are stereotypes x 10. Enjoy your Tarantino, I mean your battlefield porn."}, {"rating": "6", "text": "There were a lot of things about this movie that I liked. The things that I didn't like, bothered me.... 1) There are an uncomfortable amount of far-fetched moments, in which characters seem to act against their nature in order to serve the plot better. 2) Tarantino's cameo is extremely awkward  he may as we'll have been on screen wearing a beret and sitting in a director's chair. 3) I'll never agree with the use of modern music in period movies. Are electric guitars and hip-hop necessary in a cowboy movie?\rI think Quentin Tarantino is (maybe was) a great director. I just wish he'd stop making semi-serious, semi-goofball REVENGE flicks a la Kill Bill, Kill Bill Vol. II, Inglorious Basterds, and Django Unchained. That's four, and I believe he's threatened to make another Kill Bill! It's now a great number of years since Tarantino has shown any real range as a filmmaker. He obviously has the talent and imagination to make a serious movie for a change, and he really should."}, {"rating": "10", "text": "\"Quentin Tarantino has once again proved why he is one of the greatest and most authentic directors making films today, filled with gut-busting violence, Oscar worthy performances and some much comic relief. Django is one of 2012's best movies, by far.\"  A+"}, {"rating": "9", "text": "Another classic from the legend that is Quentin Tarantino. He simply doesn't deliver average films and 'Django Unchained' continues his wonderful work. Set in the Deep South and Old West, a freed slave (Jamie Foxx) embarks on a trail across America with a German bounty hunter (Christoph Waltz) to rescue his wife from a charismatic and cruel plantation owner (Leo DiCaprio.) The sequences are sensational from the very beginning but the key component in making this film so great is the two intriguing characters at the heart of it, Foxx and Waltz. Inglorious Basterds was a marvellous movie and I thought that Waltz was the shining light and once again he steals the show. He really is an actor on top of his game under the stewardship of Tarantino and he excels. Compared to other Tarantino outings the film is much more linear excluding less flashbacks. Some will complain about the elements of racism but it's part of what Tarantino is tackling with Django. Foxx proves to be a hit in the lead role and delivers a solid performance. It was a genius piece of casting having Leo DiCaprio as the villain. He is a supreme talent and possibly the finest actor of this generation and once more he is in flawless form as the villain of the movie. As usual Samuel L. Jackson makes an appearance and he, as always, is ever dependable. There's also cameo's from the Director himself, Tarantino and Jonah Hill. Django Unchained is without a doubt one of the best films you'll likely see all year round. It's a must see film and another masterstroke from Quentin Tarantino! It has everything you'd expect from one of his films. The laughs are their in abundance, the actions sequences are superb but there's also the serious issues of racism and slavery at the heart of the tale. And to top it off, there's a stellar cast as always delivering oustanding performances. It is a bit on the long side coming in at just under 3 hours but it's a journey you just have to take all the way through to it's grand stand finish! Make no mistake Django is another work of magic from the maestro that is Quentin Tarantino."}, {"rating": "6", "text": "This has much that is good in it, including acting, music and clever dialogue, but typically of Tarantino it is also overlong and totally without a moderating influence."}, {"rating": "6", "text": "This movie has moments but does not do it. I thought Waltz, Foxx, and Dicaprio did great work but the script was thin and the plot was not done correctly. To be honest the violence and Language is way to much. This film almost felt like a parody and with this type of talent it should not happen. I was expecting a Red Dead Redemption which I thought was extremely well done as a story.\r Okay movie"}, {"rating": "5", "text": "I went into this film really wanting to like it, and it does pain me to say it but I was slightly bored...and when I find myself having an internal debate about what I'm going to have for dinner that evening during a film, I have to admit that it wasn't a particularly captivating experience. The plot was good, but I didn't feel it really stood up to the challenge of providing something entertaining for a time slot that matches Lord of the Rings. The characters were great but I didn't come out of the film thinking 'oh my god that was amazing' by any stretch of the measure. It was alright. Considering what the film is actually about I personally felt compelled to like it, and not in a good way but in a 'well, if you don't like this film you clearly don't understand the concept' sort of way, which I never appreciate. Probably worth a watch so you're not too left out of any conversation regarding films but yeah, maybe bring a Sudoku along or something to pass time in the 'oh look, another shoot em up' scenes."}, {"rating": "9", "text": "A wild-bloody, live action cartoon with a homicidal vengeance, a reversal of roles, much like \"Inglorious Basterds\"; rewriting history if you will, they way Quinten Tarantino sees it, and the way we enjoy it. Quinten takes his blood-spattered historical tent show on the road, putting down stakes in Antebellum Dixieland. Not technically a \"Basterds\" prequel, \"Django\" stems from a similar impulse, to reframe and rewrite American history in boldly absurd strokes. \"Inglorious Basterds\" is an exceptional film, but \"Django Unchained\" surpasses its predecessor, and then some.\r The movie opens in 1858 Texas with the unorthodox purchase of a slave, Django (Jamie Foxx), by a dentist-turned-bounty hunter, Dr. King Schultz (Christopher Waltz). Since Schultz doesn't believe in slavery, he soon frees Django and the two become partners in Schultz's business. After a profitable winter, they head to Mississippi where their goal is to locate Django's wife, Broomhilda (Kerry Washington). When they succeed, they find an excuse to be invited to the plantation where she is being held. There, they are guests of the mansion's master, Calvin Candie (Leonardo DiCaprio), where their act bamboozles everyone except Candie's personal slave, Stephen (Samuel L. Jackson), who smells a rat the moment he sets eyes on Django.\r When Tarantino first introduces audiences to the two characters we'll come to embrace and respect, it's while Django (Foxx) is chained up to other slaves as they march slowly in the dark in the middle of nowhere. Dr. Schultz arrives playing the role of a dentist in a scene that's close to being as perfectly written and delivered as Waltz' farmhouse scene from “Basterds,” freeing Django and thus begins a reluctant partnership. What starts as an uneasy alliance in which one side holds all the power, transforms over the course of the movie into one in which the unlikely pair become partners and friends. Delivering this transformation along with character development, Tarantino is at his screenwriting best.\r There is not a single misstep by any of the “Unchained” cast. Led by Foxx as a slave-turned-bounty-hunter, and Waltz as a man with more layers than initially revealed, this ensemble is a perfectly cast with everyone at the top of their games. “Django” is an absolute must-see for Tarantino fans, but it's not necessary to be into either Tarantino or just Westerns to be fully entertained. There are many notable cameos: Don Johnson (small part), Jonah Hill, Amber Tamblyn, Bruce Dern, Tom Savini, Robert Carradine, and Franco Nero (who played the lead character in the unrelated 1966 film, Django).\r Tarantino is one of the few filmmakers that seamlessly and successfully merges style with substance. He is a creature of cinema, unashamedly standing on the shoulders of greats, forging new meaning out of the universal cultural experiences. That is why as far as I'm concerned “Django Unchained” is one of the best of 2012."}, {"rating": "10", "text": "Django Unchained being Quentin Tarantino's latest film is as usual very exciting and violent, but that goes without saying because its a Tarantino film. With the excellent casting he has managed to get together I don't think the film could have been much better. Dango Unchained is based in 1857 nearing the end of slavery. Django (Jamie Foxx) gives a very gentle character  at the beginning but throughout the film he gets very  determined character trying to get his wife back Brumhilda (Kerry Washington) who hasn't got a very big role, with help from Dr. King Shultz (Christof Waltz) who is a dentist but works with Django as a partnership being a bounty hunter, Dr King Shultz asks Django to point out who the Brittle brothers are and in reward he will help Django find his wife. Brumhilda (Django's wife) was found to be at Candy Land (a slave farm) owned by Calvin Candy (leonardo DiCaprio). Django and Dr. King Shultz have to try and shoot their way out of Candie land to survive and rescue Broomhilda. Samuel Jackson also appears in the second half of the film as stephan a black slave trader. This film is funny, violent, exciting and memorable for life."}, {"rating": "10", "text": "This is by far my favorite movie of 2012. I am a HUGE Tarantino fan and he definitely didn't disappoint me with this one. Christoph Waltz and Leonardo Dicaprio were incredible!"}, {"rating": "10", "text": "IN MY OPINION **MAY CONTAIN SPOIILERS** by CtheTav From the very beginning of the film an old style 50's spaghetti western is given off which in part is what this film is. However this film is so much more than homage to the westerns of old. Tarantino has truly outdone himself with this script (a rarity amongst action films these days) with period appropriate racism themes throughout as well as a story that keeps wondering whether the plan will work out in the end. The action in this film is amazingly over the top with blood splattering everywhere and heads exploding left and right. It is almost like Tarantino has used the violence to compliment the style of the film because it looks like good old fashioned special effects. The music in the film is great adding to the atmosphere when playing or purposely omitted. Finally the acting by everyone involved is some of the best performances I have seen from these people and encouraging feelings of hatred towards characters and being pleased to see them suffer. Rating 10 out of 10 The modern western full of style and substance"}, {"rating": "10", "text": "Simply put, this is Quentin Tarantino's best film. Throughout the movie, he breaks down the formula to a creative film and rewrites it completely. This is a film that starts with title cards, opening credits that aren't merely forgettable blips on the bottom of the action, a song named after the titular character, and all the other components of the typical spaghetti western. The revenge-fueled plot and the character archetypes also evoke images John Wayne and Clint Eastwood films.\r Strangely enough, however, rap music and sunglasses badassitude trickles into this \"Southern\". Tarantino, of course, writes in his own style. Excessive (almost cartoonish) violence befalls all characters, the dialogue-only scenes are abundant, and depictions of the pre-Civil War South are brilliant and ominous. Tarantino gives the film a unique atmosphere that I haven't seen since Kill Bill. Django Unchained pulls you into the screen and makes you feel like you are living in the cartoonish, wit-smitten world of the film. I truly felt for Django's quest and was intrigued by the story of his German liberator King Schultz.\r Speaking of, the characters in this film are outstanding. Tarantino has always been a character writer, but Django and Schultz may be the best film duo I've ever seen. Each character is interesting on their own level (the introduction of Schultz sparks one of most unexpected and entertaining opening scenes in history), but it's the interaction between Django and Schultz that's most memorable.\r Leonardo DiCaprio's villain Calvin Candie is especially potent, to the point that I hated the actor himself for a time after seeing the movie. A slaver with a excessively playboy demeanor, Candie is essentially a hilarious, despicable character that sets up the pieces to introduce the film's true antagonist: Stephen, the head house slave of Candie's plantation (played by Samuel L. Jackson). I can't say too much about this character without spoiling the movie, but it's definitely one of Jackson's scariest roles.\r The climax is one of Tarantino's best, I was never bored while watching the three-hour long movie, and I'm still thinking about the characters and the plot today. This is a movie that I will want to rewatch again and again. I have pre-ordered it from Amazon, and I rarely buy things from the Internet. I highly recommend this movie to all but the faintest of souls."}, {"rating": "10", "text": "I recommend Django Unchained. It's funny and brutally violent. Good acting, good story and setting, memorable characters (even the minor ones), memorable scenes, main character has an arc.\rIt holds nothing back. It has personality.\rI also recommend the original Django (1966)."}, {"rating": "10", "text": "Fantastic movie from start to finish\r - Brilliant screenplay\r- Excellent acting\r- Good choice of music\r- Great direction by Quentin Tarantino\rDjango unchained is the best move of 2012 and is the best movie Quentin Tarantino has made. It is absolutely terrific"}, {"rating": "9", "text": "Charismatic Acting by Waltz and DiCaprio, it effectively reverses the history of slavery with well thought of dark-comedy. Not the masterpiece of Pulp Fiction, but Tarantino stabilizes his position as a respected screenwriter and director"}, {"rating": "2", "text": "Yeeeeeah, pretty mediocre to be honest. Its more Tarantino drivel. I honestly cannot think of a scene memorable for any reason other than gratuitous violence.Its like the screenplay was just an excuse to see how many times Tarantino could use the \"N\" word in a movie script all with Samuel L Jackson's blessing. . .As per Inglorious Basterds the only redeeming feature is Christoph Waltz who absolutely shines.Other than that, its way too long recommended for only the most die-hard Tarantino fan boys"}, {"rating": "10", "text": "Absolutely FantasticDjango Unchained is one of my favorite Tarantino films with it’s great job of showing a different period in time."}, {"rating": "1", "text": "Cartoonish, simple-minded piece of pablum. WTF ya'll thinkin'? See Just Mercy for a real film."}, {"rating": "6", "text": "This is one of the worst Tarantino's movies. It starts well but the second half turns out to be quite bad and I really didn't like the ending with a soundtrack that really seems to be out of place."}, {"rating": "10", "text": "Excellent film.  My favorite Tarantino movie to date.  Like many Tarantino films, this movie makes you think, but it's a comedy.  Django Unchained invokes a wide variety of emotions.  One moment, you will be sickened.  Then you'll get angry.  And in the middle of those things, and before and after it all, you'll laugh.  Sometimes you'll wonder if you were supposed to laugh, but you'll laugh anyway.  And in the center of it all are interesting, genuine characters.  Christoph Waltz plays Dr. Shultz, a German bounty hunter who is incredibly educated.  Leonardo DiCaprio plays a Southern plantation owner, Calvin Candie, who is just plain sickening.  Samuel L. Jackson plays DiCaprio's slave whose family has served the Candies for generations.  And finally, there's Django, played by Jamie Foxx, a former slave who wishes to save his wife and exact vengeance on those who would keep slaves.  These characters are some of my favorite movie characters of all time.  The movie is worth watching just for them."}, {"rating": "10", "text": "This is the best film I've seen this year. Incredibly entertaining, hilarious and just satisfying to watch. All of the negative reviews seem to be from people who are offended by bad language and violence. Umm, don't go see a QT movie if you are so thin-skinned. For the rest of the adult audience, do not miss this one in the theaters. An amazing experience you will not soon forget."}, {"rating": "10", "text": "With any filmmaker, there are ups and down. This one is definitely up! Christop Waltz (in another winning performance) plays a dentist-turned-bounty-hunter who strikes a deal with a slave (Jamie Foxx in the title role): help him find his bounty and he'll free Django and help him find his wife. They outsmart all the villains until they finally land at the plantation run by Leonardo DiCaprio. Despite the cruel depiction of slavery, this is Tarantino's funniest film yet (the head bag scene is a classic). The violence leans toward comic book broadness with more blood splatter than guts or cuts"}, {"rating": "7", "text": "Quentin Tarantino has served up another politically incorrect, self indulgent, overlong and graphically violent  joy ride of a film as only he can do it.  Django Unchained will likely elicit a myriad of responses from viewers  but it's certainly not boring.  It's also relentlessly tense and manages to maintain that suspense for its entire running time making it an exhausting endeavor.  Now if Tarantino would just take all of his considerable talents and make a film that adds up to more than a mere mash up of his numerous geek inspirations."}, {"rating": "10", "text": "You either love Tarantino or you hate him. If you're an uptight, PC liberal prude who hates Tarantino, this film will do nothing to change your mind. But, if you like your films to be violent and witty, your dialogue brilliant and smart, your actors sublime and ridiculous, your cinematography sprawling and personal, your soundtrack eclectic and coherent, then \"Django Unchained\" will become, perhaps, not only one of your favorite Tarantino films, but one of your favorite films, period.\r \"Django\" is Quentin Tarantino in true form, at his best, and while it's a very long film, you will never once feel bored. Hilarious, enlightening, shocking, frightening, saddening, ambitious and greatly, greatly enjoyable, \"Django\" is hands-down one of the best films I've ever seen."}, {"rating": "7", "text": "While undoubtedly a good film, and not at all crappy holiday filler, I can't hope on the \"this is an incredible film\" train. I liked it, but found it to be not much more than a good way to spend a friday evening. Not bad at all, but not great. Christoph Waltz and Leonardo Dicaprio really shine, but that's really the only stand out incredible part of the film. Overall, just good, not great."}, {"rating": "6", "text": "Tarantino displayed little, if any restraint at all while filming this movie.   It is ridiculously long and at times it is way over done.  Some of the action scenes are overly obnoxious and some of the other scenes are of such a serious and delicate matter (brutal slave scenes) to tamper with.  The outstanding performances by Dicaprio and Cristoph Waltz help keep this movie so entertaining."}, {"rating": "9", "text": "What a great spectacle. This is what going to the movies should feel like. I already loved Inglorious Bastards but this one is even better because it is a little bit more focused. It is not a perfect film because 3 hours are a little too much. With 20 minutes less it would be perfect. But damn I so enjoyed it and the rest of the theatre seemed to enjoy it too. Jokes, amazing scenes, Tarantino´s typical take on things and especially... the performances WoW Everybody is perfect: Jamie Fox, Christoph Waltz and Samuel L. Jackson are so great... but the biggest thing is Leonardo Dicaprio. What a great and different role and villain for him. He´s perfection in here and steals the show: so creepy, funny and effeminate. It´s superb. Nobody would regret seeing this film, a great roller coaster."}, {"rating": "10", "text": "Quentin Tarantino best film. Some wonderful performances in this film from jamie foxx leo dicaprio   christoph waltz which is now one of my favorite actors is just wonderful in this film and  samuel l jackson one of his most memorable performance with quotes like \"who dis n***a on dat neigh\" and  dem MF aren't here to buy no mandingo\". Beautifully written and well directed 10/10."}, {"rating": "9", "text": "Django Unchained is Quentin Tarantino's homage to the spaghetti westerns of the 60's- with a hefty dollop of marinara on top, in true QT fashion. Jamie Foxx is the title character, a slave rescued from servitude by a German bounty hunter, Dr. King Schultz (Christopher Waltz). In exchange for helping him track down and kill various wanted men, Schulz agrees to help Django rescue his enslaved wife (Kerry Washington) from Candyland, a plantation owned by the sadistic Calvin Candie (Leonardo DiCaprio.) Tarantino has a knack for bringing out the best in actors, and DiCaprio in particular shines among a field of diamonds, playing Candie with marvelous antebellum gusto. Samuel L. Jackson said he wanted to play the most hated Negro in cinematic history, and he most certainly gets his wish here. Stephen, Calvin's racist house slave, is a truly despicable character, in a movie filled with them. This is an extremely violent film: fountains of blood erupt onto the screen during gunfights; a runaway slave is torn apart by a pack of dogs; eyes are poked out; skulls are bashed in. None of this should surprise anyone who has seen either of the Kill Bill movies. If gratuitous violence bothers you, do not watch this. I wasn't bothered, though. All the violence is directed towards slave owners and their enablers, and, frankly, they deserve to die. Even if you're an adamant pacifist, you can't deny Tarantino's virtuosity. His style of film making is just so fun to watch. The dialogue is a joy to listen to, as is the music. Even when an anachronistic rap song starts playing, you don't mind because, somehow, it fits right alongside the flamboyant guitar instrumentals and Johnny Cash's god-fearing country. Django Unchained, though simplistic and borderline cartoonish at times, is a supremely satisfying piece of film-making. Movie buffs rejoice: Tarantino is back, and he's not pulling any punches."}, {"rating": "10", "text": "Certainly an amazing accomplishment of a film. Django Unchained is best described as fun. It had excellent acting and was at all times enjoyable. While it does force you to confront thoughts you rarely acknowledge, it is hilarious much of the way through. The plot was extremely predictable in a very good way. You can see what's coming a mile away and you want it to arrive. Anyone criticizing the predictability as a bad thing is likely doing so simply to criticize. I would recommend this movie to anyone not disturbed by extreme violence and cruel behavior."}, {"rating": "8", "text": "This is not \"Pulp Fiction\" nor \"Inglorious Basterds\", but it is as insanely entertaining as you expect. Great performances, crisp and funny dialogue, violent shootouts, cool music, very good camera and cinematography. A spagetti western revenge epic with a modern look. It's the full Tarantino package, so enjoy!"}, {"rating": "9", "text": "The previews for Django Unchained are misleading because they do this masterpiece no justice. This movie is truly spectacular in nearly every aspect. The dialogue is fantastically written as its both very witty and humorous. Even though comedy isn't on the genre list, there's a lot of comedy, mainly dark, in this  - which becomes beneficial for comic relief purposes because the movie has many intense scenes and the movie is pretty long. The acting was superb. Almost everyone gave a strong performance. Samuel L Jackson played the old, bitter man to perfection. Jamie Foxx showcased that he could play a multidimensional character that expressed many different emotions. While I'm not fond of DiCaprio, I must admit his first performance as an antagonist was well-done and really blended into the the character he was portraying. And Christoph Waltz truly deserves an award for his performance. Everything about it was brilliant. The timing, mannerisms, facial expressions, body language, believably, you name it. The only performance I didn't care for was Kerry Washington's. Her performance was lacking emotional investment. In other words, I didn't fall in love with her character. But still, her character didn't overshadow the movie's brilliance or even stand out like a sore thumb. It was just mediocre. Like many Tarantino movies, this had a lot of blood, violence, gore, and all that good stuff. That said, the movie isn't for people who have a weak stomach, but it is indeed for anyone who's a sucker for realistic  blood and gore. In fact, it will make blood seekers go berserk. After all, let's just say it will make many of his films look peaceful in comparison. The plot and narrating  were both crafted well, too. They both keep you guessing what direction the movie is going. An the directing, of course, is just superb. The camera shots, the timing, the choice (plus timing) for the music, the envision of how scenes should look like....... everything was choreograph extremely well. Ultimately, Django Chain is a front runner for movie of the year and in my eyes has surpassed everything that's happened this year by a mile."}, {"rating": "10", "text": "Quentin Tarantino has given us the best Christmas present, another one of his \"Epic\" cinematic accomplishments. Not only one of the best but my favorite movie of the year. Underneath the bloody, revenge, slavery theme of Django Unchained is also a love story. Django's only priority in this story is rescuing his beloved wife from the \"evil\" hands of Calvin Candie (Dicaprio) and his loyal black land owner Stephen (Sam L. Jackson). The Western genre is one of my, if not the most, favorite genre of all movie genres. Spaghetti westerns are even superior, in my opinion. So I knew all the little homages Tarantino placed in this film. Including the original Django, Frank Nero, in the same scene with Jaime Fox's Django. These small features of the film just added more fun to my experience not to mention how well the comedy blended while in this portrayal of a dark horrific time in America. The songs used in this movie, MY GOD! Every song fitted so well into the scene it was introduced. The soundtrack is just another reason why Quentin is so unique when it come to film making. From Ennio Morricone to Rick Ross to Jim Croce everything was blended spectacularly to its southern setting.\rTo say the acting is great is a bit of an understatement. Jamie Foxx plays such a fantastic lead as his character develops from a shy slave to the fastest, ballsy, gunslinger in the south. Christoph Waltz, like in Inglourious Basterds, steals every scene he's in with his witty charm and his lovable character's way of escaping out of a tight spot very unexpected. Leonardo Dicaprio gives another great performances and probably one of his best. A very flamboyant evil character at that. Now Samuel L. Jackson just blows it out of the park by a long shot. He gives such an astonishing performance as great as on the level of Jules in Pulp Fiction. He steals the scenes from the scenes Christoph Waltz is in. He was by far the most evil and outrageously funny character in the entire movie. He deserves an Oscar nomination for this role. Kerry Washington is great but is not the usual strong female performance you usually get in a Tarantino film. Probably because of the plot and its setting in history. All the secondary characters were flawless as well, including Jonah Hill's comedic small role. I adored everything from the stylized beginning to the showdown in the end. Even the small little details to the actors Quentin uses in his movies like Charles Parks or himself. I honestly found more humor than any comedy I've seen this year. The heavy use of gore and buckets of blood is exactly my taste in movies. Does it drag on? Of course, in the second act it tends to drag on a bit which is probably the set up of Dicaprio's character development. As a fan I wouldn't mind it being five hours long but as a reviewer perspective it could have been trimmed just a tad bid. The death scenes were a spectacle to experience. I was in awe from every death scene. I have to give this masterpiece a 10/10"}, {"rating": "9", "text": "Aside from the obvious Tarantino dialogue, camerawork, and soundtrack, all of which are excellent, the film has an excellent meta-commentary on the blacksploitation genre by contrasting the idea of \"Mandingo fighting\" with the structure and outcome of the film itself. Characters, though not at snappily witty as in Tarantino's other films, are more complex, thought-out people than in Tarantino's other films. Samuel L. Jackson's character, who on a surface reading is a thin parody of the house slave stock character, becomes a much more rich and complex character when you look not only at his actions towards Django in the film, but consider his motivations and his general role at Candyland. I can't decide if he is ultimately a villain, is stealthily mitigating the abuses of the plantation, is simply spiteful, or if some of his more villainous-seeming actions are a poorly-executed attempt to aid Django, in his way."}, {"rating": "7", "text": "So. DJANGO UNCHAINED. It was, well, pretty good. Not \"Oh my GOD\" good. Great fun out of the gate; Christopher Waltz is tremendous, Jamie Foxx too (and as ever, great fun spotting all the terrific actors that Tarantino clearly reveres popping up in cameos throughout . And it continues being a blast for about... 2 hrs. Don't want to give anything away, but it all falls apart, and didn't need to be anywhere NEAR as long as it is. I mean, I'm willing to forego plot holes if I'm enjoying the ride (TAKEN, as well as any number of other movies, but that's the first that comes to mind), but the latter 1/3 of this thing just feels like Tarantino lost interest. It's sloppy. No where near what, in my humble estimation is still his masterpiece, the great KILL BILL, Vol. 1. Oh, and as an actor, Tarantino continues to have a bright future as a director."}, {"rating": "7", "text": "Pros of the film: performances by Waltz and DiCaprio, dialogue, and certain action sequences. Cons: length, overzealous use of gore and dramatic spectacle. \"Django Unchained\" seems catered to Tarantino's \"Kill Bill\" fans, which is unfortunate if you thought \"Inglorious Basterds\" displayed the director heading in a better direction."}, {"rating": "6", "text": "Q.T. has made a career of taking a genre and spoofing it by upping the volume and violence and placing tongue firmly in cheek. In this latest one the tongue is placed in a nether cheek. The older I get the less humor I find in his work and it is replaced more by \"ludicrous.\" So why go? Grand-sons must be catered too and I found he got the humor in the violence and badinage to carry on Q.T.'s reign as king of Pulp. I do wonder how this will play in the deep south and the inner city."}, {"rating": "8", "text": "Tarantino's take on the spaghetti western is a fun but uneven film that film fans will enjoy.  Great performance by both Waltz and DiCaprio, but a surprisingly disappointing turn by Jamie Foxx by the lead.  It too has pacing issues due to its length; Django starts of strongly but got significantly weaker  near the end.  However, despite its seemingly 'low' ambition as a blaxpotation / western hybrid flick, Django Unchained is the first film I have seen to address the issue of slavery in manner that is believable.  It's casual attitude towards maybe the first 'true' portrayal of this 'dark part' of American history.  This interesting perspective on this issue raise a lot of the audiences' interests in flipping (or browsing) the historical books, and maybe that's what Tarantino is aiming at.  Still one of the better films of this year."}, {"rating": "9", "text": "As a native of Mississippi, I have to say that this movie is...Fantastic. It really brings to light the absurdity of slavery and the rampant ignorance found across the country on such an issue. Whites, blacks, Asians, Latinos--ALL ethnicities sat in the theater together laughing and cringing collectively. It's over-the-top Tarantino at his best. In comparison to Inglourious Basterds, Django Unchained is much more balanced, maintaining sharp dialogue and awesome action that audiences have come to love. If this were a truly offensive flick, as critics seem to point out, Django would not have had such excellent actors play lead roles, and the NAACP Image Awards would not have recognized it with such acclaim. Note: Greenville, MS, doesn't look anything like that, but who really cares."}, {"rating": "7", "text": "Drags on. The plot comes to a clear finish, then drags on for another half an hour. Other than that fine. Not wonderful. Tarantino movies are starting to show their age. What would be \"edgy-silly\" --is more just silly. Django sorta teeters on being a kids movie."}, {"rating": "6", "text": "A Cool Western Spaghetti rather than saying classic western.Tarantino's trademark are much less except for the bloody mash.Even one could doubt if it is a tarantino flick(until you see his cameo somewhere at the end) .The Characters,especially the one played by christoph waltz tends to be intriguing but doesn't match up with the film.Leonardo DiCaprio occupies less space but a powerful one.No wonder if the title character doesn't get any award nominations.All i can say is the film is more lengthy and less creative.And yes..it is behind death proof.I can give Death proof 8 rating.As a fan i received some kind of disappointment."}, {"rating": "7", "text": "The movie started out strong on all fronts, but begins to descend into a long-winded story that never really grasped my attention. Still, the movie manages to bring plenty of comedic gore and drama which is unique."}, {"rating": "10", "text": "Probably the greatest movie ever created. Incredible while watching it, cinematography and everything. Great to reflect upon as well. Perfect. Quentin Tarantino."}], "recommendations": ["reservoir_dogs", "jackie_brown", "the_fifth_element", "casino", "fargo", "highlander", "snatch", "indiana_jones_and_the_temple_of_doom", "inglourious_basterds", "bone_tomahawk", "scarface", "the_untouchables", "last_action_hero", "true_grit", "the_suicide_squad", "goodfellas", "seven_psychopaths", "in_bruges", "dredd", "from_dusk_till_dawn", "conan_the_barbarian", "the_harder_they_fall", "kingsman_the_secret_service", "troy", "gangster_squad"]}