{
  "id": 1881,
  "title": "Doctor Sleep",
  "starring": [
    "Ewan McGregor",
    "Kyliegh Curran"
  ],
  "runtime": 152,
  "genre": [
    "Horror",
    "Thriller",
    "Fantasy"
  ],
  "description": "Still irrevocably scarred by the trauma he endured as a child at the Overlook, Dan Torrance has fought to find some semblance of peace. But that peace is shattered when he encounters Abra, a courageous teenager with her own powerful extrasensory gift, known as the 'shine'. Instinctively recognising that Dan shares her power, Abra has sought him out, desperate for his help against the merciless Rose the Hat and her followers.",
  "releaseYear": "2019",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/p69QzIBbN06aTYqRRiCOY1emNBh.jpg",
  "categories": {
    "plot": 7.470588235294118,
    "acting": 6.684210526315789,
    "ending": 8.071428571428571,
    "soundtrack": 8.0,
    "cinematography": 7.0,
    "familyFriendly": 3.0,
    "funny": 5.0,
    "action": 8.333333333333334
  },
  "reviews": [
    {
      "rating": "10",
      "text": "I love the movie!! Is the best movie of the year!! I’m all the time guessing what’s coming next!! The sound is really good and the imágenes too!! I just love it"
    },
    {
      "rating": "9",
      "text": "The scene where Danny and Abra are driving up to the Overlook hotel gave me feelings that I cannot describe. Pure excitement and terror at the same time."
    },
    {
      "rating": "10",
      "text": "I watched the 3 hour director cut, 30 min longer.  Flanagan has been on a run lately, Oculus was solid horror, Hill House was very popular (I found it boring) and this is a well photographed, nice looking movie.  Alex Essoe does a good impression of Shelly Duvall.  Ewan McGregor does a good job of never steering attention away from story or toward himself.  Snakebite is the most interesting character, besides Abra (Kyliegh Curran) she was great.  There are parts that remind me of The Dark Crystal, in a good way.  Well made, not much action but it never drags at all in 3 hours."
    },
    {
      "rating": "10",
      "text": "En verdad que no podria haber quedado mas satisfecho al ver esta pelicula , mis expectativas eran bajas pero esta peli me callo la boca de lo buena que es ."
    },
    {
      "rating": "10",
      "text": "Muy buena película. Muy buena adaptación si lo comparamos con el libro. El universo de King es uno de los mejores. Hay mucha gente que no lee el condenado libro ni sabe de que trata y son los que critican"
    },
    {
      "rating": "9",
      "text": "Doctor Sleep is my favorite horror movie of 2019, one of my favorite movies of 2019, one of my favorite horror movies of all time, and one of my favorite movies of all time. The writing and story were stupendous. The atmosphere of the movie was excellent, it was super cool and creepy. The acting was outstanding especially from Kyliegh Curran, Rebecca Ferguson, Ewan McGregor, Emily Alyn Lind, Jacob Tremblay, and Cliff Curtis. The visual effects were phenomenal and super creepy, scary, and cool. The makeup and hairstyling were superb especially on Rebecca Ferguson, Kyliegh Curran, Cliff Curtis, Ewan McGregor, Emily Alyn Lind, and Zahn McClarnon. This was a overall really good movie."
    },
    {
      "rating": "9",
      "text": "Uma trama excelente que te intriga do inicio ao fim com seus mistérios muito bem orquestrados pelo diretor, cujo nos alimenta bem o suficiente para não ficarmos cansados - afinal, é um filme de 3 horas. Stephen King não tem medo de surpreender e vai com tudo, o que deixa tudo mais tenso. Alguns personagens são interessantes o suficiente para que nos importemos com eles - o que é fundamental para o suspense, outros nem tanto. Apesar de não me incomodar, senti que as atuações de Rebecca Ferguson e Kyliegh Curran não estavam no ponto. Carl Lumbly também me soa estranho - se esse foi o objetivo, tudo bem."
    },
    {
      "rating": "10",
      "text": "F.... their criticism! The movie is just great! So awesome and terrifying at the same time! 10/10 Shining 2 really exists!!!"
    },
    {
      "rating": "9",
      "text": "Big fan of the original, and this is a sequel which is so much better than it should be. The sequel book is so different to the first one, and so the movies are different. But, it has a sustained tone of dread, a good story and takes you back to bits if the shining. Good! make it."
    },
    {
      "rating": "9",
      "text": "Wasn't expecting much from this film. But it kinda surpassed expectations. It is an amazing film. The climax brought tears to my eyes. I won't call it fan service that they go back to the Hotel. Because the story justified it and it wasn't cheesy at all. I wish I went to the theatre to watch it."
    },
    {
      "rating": "10",
      "text": "One of Stephen King's best adaptation, that movie really shows a lot of new stuff while trying to get together the piece of King's story that Kubrick put aside in his version of the shining, and yet there are many references to that movie and it doesn't at all slow down the pace of that story that is truly greatly told from the beginning to the very end of the movie."
    },
    {
      "rating": "9",
      "text": "Doctor Sleep is an enjoyable horror movie.  The plot kept me off my phone and the references to the original shining movie felt refreshing.  Wrapped up pretty well.  Nothing amazing, but certainly worth the watch for those that like the Shining."
    },
    {
      "rating": "10",
      "text": "Rebecca Ferguson as Rose the Hat literally takes my breath away... haha... get it... like the steam in the movie?"
    },
    {
      "rating": "10",
      "text": ""
    },
    {
      "rating": "6",
      "text": "Good performances and interesting cinematography help keep Doctor Sleep afloat. The ending is unfortunately a let down, and overall this sequel to The Shining just feels unnecessary and rushed. Ewan McGregor is fantastic in this movie. Overall, I felt Doctor Sleep was a little bit of a let down, but not a waste of time!"
    },
    {
      "rating": "10",
      "text": "Probably one of the best sequels I have ever seen.  Great story line and wonderful acting.  Newcomer Kyliegh Curran's performance was spectacular!  Not sure what some of the people who are giving bad reviews were expecting.  I liked that the story was a bit different.  Worth the time to go see."
    },
    {
      "rating": "9",
      "text": "2017's Gerald's Game was a huge surprise for a lot of people. The book it's based on is largely comprised of imaginary conversations taking place in the protagonist's head, and many thought it impossible for that to be translated to film. Mike Flanagan pulled it off though. Showing that he could bring Stephen King's more difficult to portray material to life onscreen with great effectiveness and creating one of the best adaptations of any of the author's work to date in the process.I'd argue he faced a greater challenge with Doctor Sleep however. Not only does a significant portion of the action once again take place inside the minds of the characters, but the story also serves as sequel to The Shining. This put Flanagan in the unenviable position of having to decide whether or not he actually wanted to make this a direct follow-up to the legendary Kubrick film, or forsake any such connections and try to make it as self-contained as possible. No matter what the director chose, The Shining would always be a part of the conversation due to the shared continuity of their source materials, but the latter option did at least come with the potential to avoid some of the harsher scrutiny that would likely arise from establishing this as a continuation of what some consider to be the single greatest piece of horror cinema ever created.Flanagan ultimately took the risk and went the sequel route. Tweaking a few things from the novel in the process so that it could tie in better with Kubrick's version of The Shining. A decision that might have actually been beneficial to the story as it allowed him to remain very faithful to the source material while giving him a means to cut out King's ridiculous surprise relative twist. The new ending also redeems the lack of fidelity inherent in the Kubrick film by managing to stay true to the heart and soul of both books at the same time.While the events that occurred in The Shining are significant in that they define who Danny is in this movie, outside of the final act that's a little too heavy on nostalgia-based scene recreations Doctor Sleep largely does its own thing and in its own way. Even to the point kind of moving away from straight horror in favor of something more akin to dark fantasy. For the majority of it's lengthy running-time it's decidedly not Kubrick which allows it to succeed on its own merits, of which there are many.This is one haunting piece of cinema with some truly horrific moments that will stick with you. It's a violent tale of mind-bending psychic warfare with a strong dramatic component centered around PTSD, regret, and the desire for redemption in a cruel, hungry world. All of which is backed by incredible performances across the board. Rebecca Ferguson's natural accent slips through once or twice making the weakest link, but her sexy yet terrifying villain is so memorable that it almost goes by unnoticed.I would really love to see Flanagan tackle more King in the future. The author has often experimented with more fantastical conceits of the mind and many directors have struggled making those ideas work onscreen. Flanagan however has pulled it off twice now with stunning results. Doctor Sleep is incredibly gripping. Pop-culture's obsession with the '80s throwback shows up here near the end and finds the director putting on an unnecessary Kubrick impression, but that's the single misstep in a movie that's otherwise confident enough to build upon and branch off from its predecessor in order to take a different path that cements it as a worthy successor and an excellent film in its own right.9.3/10"
    },
    {
      "rating": "10",
      "text": "Stands shoulder to shoulder with Kubrick's \"The Shining\". Performances all around are excellent."
    },
    {
      "rating": "10",
      "text": "This is a near-perfect adaptation of a great fantasy novel with one horribly disturbing scene, and a bit of an awkward ending."
    },
    {
      "rating": "4",
      "text": "Scary at times, but too far-fetched. unfortunately the film was a disappointment"
    },
    {
      "rating": "10",
      "text": "Tied into the original Shining so well and delivered even BETTER! KNOCKED IT OUT OF THE PARK!BEST MOVIE EXPERIENCE IVE HAD IN A MINUTE!(Cap locks international)"
    },
    {
      "rating": "10",
      "text": "Awesome! Just awesome! I saw yesterday and i leave the teather amazed by this movie! Perfect ending for the shinning!"
    },
    {
      "rating": "9",
      "text": "This is an awfully good story, awfully well told. I'm not a big fan of Kubrick's 'The Shining' one of the most overrated movies ever made. This one is much, much better."
    },
    {
      "rating": "10",
      "text": "Smart, gorgeous, creepy, and unnerving, but with a lot of heart and empathy for those dealing with additions and past trauma.  DOCTOR SLEEP is the impossible bridge between the novel and movie THE SHINING, yet is able to stand on its own.Director Mike Flannagan is not only a gifted director, but an intelligent storyteller.  The changes from the book worked perfectly for cinema.  His tributes to kubrick were also surprising and cool.I so strongly recommend seeing the movie in theatres.  Its a work of art with fantastic performances the ache and terrify equally and stands alongside Shawshank (as well as Stand by Me, Misery, Green Mile, and IT) as one of the best King adaptations that impacts beyond the horror genre.Fantastic"
    },
    {
      "rating": "9",
      "text": "Seriously this movie hits every note, and completely ties in perfectly to The Shining while still being its on film."
    },
    {
      "rating": "9",
      "text": "Film ben riuscito. Ottima interpretazione. Buone le musiche. Nel complesso merita una valutazione decisamente alta."
    },
    {
      "rating": "9",
      "text": "One example how sequels must be filmed. It's complete history of original and playing with your nostalgic feelings."
    },
    {
      "rating": "7",
      "text": "It's not necessary to know much backstory from Stephen King's THE SHINING, but it helps to know the basics for this sequel. Ewan McGregor plays the adult version of the little boy who was scarred by the events in the original movie. He's still coping with the ghosts (literally) from that time, when a teenager appears who also has extrasensory powers. They embark on a search to stop a truly merciless group who prey on the pain of children (the most brutal scene in the film). This story takes 2.5 hours to unfold and doesn't even get to the fateful hotel until the final 30 minutes. Through it all, there's a sense of dread, accompanied with some cool visual effects and ominous sound design. The pace never quickens and there aren't any big scares, but the compelling story and Mike Flanagan's engrossing direction create a continual level of tension."
    },
    {
      "rating": "7",
      "text": "I just read an article that said this film would have been better saved with the title \"The Shining 2\" and I agree...the title doesn't really capture the story that is told...beautifully made and acted, it has two great set pieces and an ongoing feeling of dread...as with several other horror films recently, it's longer and less scary than it should be, but a strong film"
    },
    {
      "rating": "8",
      "text": "I love the original movie by Stanley Kubrick and I also love both books by Steven King, I also love Mike Flanagan's latest work, so this movie came together very well with everything mixing to the film's benifit. The pacing is quite a lot faster than the book, yet still feels a bit long... The film is also not very scary, which I knew going in due to the book, it's definitely a different vibe from the first shining film. This film takes much more from the Stephen King side than the first film, so since of Kings kinda cornyness comes into the film too, I think it might have been nice to have more of the film set in the hotel, even though it's not in the book at all, also wish we had more time letting the ghosts get more screen time. Other than that, everything was great. Making the true knot scary and foreboding and not hokey and corny was really really well done. The Turing of the world to enter others minds was also visually stunning."
    },
    {
      "rating": "7",
      "text": "“Hi there”Hello there...Mike Flanagan has some of the biggest balls in the horror industry. I mean just look at his filmography so far.He took one of the worst horror movies in recent memory ‘Ouija’ and said: “yeah, I wanna make a sequel to that”, with ‘Ouija: Origin of Evil’ and somehow made it less terrible. How about ‘Haunting of Hill House’ where he’s going to direct every episode of a television series that has to weave two narratives together at once over ten episodes...and again he somehow made it work. And now this guy is gonna make a sequel to one of the most revered horror movies of all time with ‘Doctor Sleep’...the son of b**ch did it again!I think Flanagan deserves more credit as a director rather than people **** that his movies “ain't scary enough an-” blah blah blah shut the hell up.‘Doctor Sleep’ was a complete surprise for all the right reasons. At first I wasn’t sure if the movie would hook me, because it takes awhile for it to get going, but slowly I got invested in the story and the characters. There have been four Stephen King movie adaptions this year: ‘Pet Sematary’, ‘IT Chapter Two’, ‘In The Tall Grass’, and now this movie. This is by far the best out of them all.The runtime is 152 minutes long and I can safely say that the movie is 85% it’s own thing, because it doesn't just rely on nostalgia to tell their story and it’s only the last act where things start to play on nostalgia when the characters return to the Overlook Hotel. The nostalgia being the 80’s horror classic of course. It’s either that or 97 TV mini-series. Who’s got fond memories for that piece of sh*t? So with this being both a sequel to Kubrick's movie and King’s original novel; a clash of visions coming together with Flanagan trying to put this together, while also applying his own vision into the mix.Now that’s hard.The part that got me invested in the story was the scene between Danny and a elderly patient who’s on their death bed. Danny comforts them as their peacefully past away, without dying alone. It’s a beautiful and heartfelt scene that you would never expect to see in a supernatural horror movie.Ewan Mcgregor was fantastic as an alcoholic grown-up Danny Torrance. Nicholson's presence was felt through out the movie as adult Danny fears he might follow in his fathers footsteps. There’s a scene where Danny gives a talk at a rehab group and as doing so he reflects deeply on everything that happened to him in the past, while the camera is locked on Ewan’s face. Not only from his childhood, but everything afterwards and drowning out the trauma through drinking - something that us as the audience don’t see. I thought he was excellent. He absolutely “shines” as the character...and am not sorry for that pun.I loved how fleshed out the villains were, which surprised me the most about the movie. They are like vampires, but instead of feasting on blood, it’s “the shining” they crave for a expanded life. Casual and charming, and yet wickedly evil. There’s a particularly scene that was so difficult to watch and really got under my skin. However you do get to see them interreacting with each other in normal conversations as they casually go on with the day and work as a group. Rose the Hat sticks out from the rest as a sinister and endearing villian played marvelously by Rebecca Ferguson.Mike Flanagan dose a great job on balancing both Kubrick’s and King’s version respectfully, but also manages to put his visual spin in. The one thing that hasn’t been mention yet is how great he is with child actors as he always gets the best performance out of them, especially Jacob Tremblay and Kyliegh Curran who was so convincing in the roles it was scary.The movie looks stunning with the use of colors adding to the overall tone and helps creates the horror atmosphere. Same thing with the score that while it takes samples from Kubrick’s movie, but not to say it doesn’t have it’s own.For issues:There was a couple of callbacks that was a little on the noise, usually through references. As I said early the movie takes a while to find it’s footing and you couldn’t help but draw comparisons. There were a few questionable and almost silly lines that King himself would inject into his work for humor, but here, with tone in mind, just took the fear out of it.Overall rating: “Eat well and live long.”"
    },
    {
      "rating": "7",
      "text": "History has a weight, as heavy as that of expectations, maybe more so. Mass relates to velocity, &velocity &mass together mean momentum. How would one change the course of the Titanic if it continued it's course, eventually  barreling along at light speed? Solve that equation &one could be wealthy beyond all dreams of avarice. How could one follow up, The Shining?Mike Flanagan doesn't flinch from the gravity of this two body problem, but embraces it with DS, his adaptation of the best selling novel by SK - not only the sequel to one of the seminal horror novels of the 20th Century but a visually influential &a most recently gentrified motion picture adapted by Stanley Kubrick. Seems like unsolvable Calculus, right? A tough aldorithmic nut.  The director of Occulus, Gerald's Game &Hulu's The Haunting of Hill House rolls up his sleeves, grabs the chalk &heads to the chalkboard.Like King's other works such as IT &The Stand, the novel DS defies the feature length treatment. Unlike King's 1977 best seller The Shining, DS has many more points of view &locations, in addition to the added weight of literary &cinematic history. To complicate matters, Kubrick's The Shining wasn't embraced at the box office by Constant Watchers or Critics. Regardless, MF opts for the feature treatment rather than a limited run series.  Apparently, he's not one to shy from eating a historic literary elephant - so he does that, one bite at a time.MF does that deftly, spending a decent portion of the first act re-anchoring us in the 40 year old story - but never through exposition. Some of us are \"reintroduced\" to Danny Torrance, Wendy Torrance &Dick Halloran. For those Constant Readers &Constant Watchers, it's an unsentimental walk through memory lane that's not done for the sake of nostalgia or as some will posit with a contemporary slur, fan service. That's key - to play to those not versed in the vocabulary of The Overlook lore ¬ explain too much to the already initiated. Again, pretty sophisticated equation balancing.  Off the page, MF never visually imitates Kubrick's austere, antiseptic style as lightly emulates it. MF gives us small visual cues, in addition to a few subtle aural ones as well.Stage setting &character introduction done, we fast forward to the new &unfamiliar for the next three acts. In the vocabulary of Mid World, another King creation, the World of DS - specifically Danny's World - has moved on from that of The Shining's, by 40 years or so. Where these acts work best are developing adult Danny as a compelling character, which Constant Readers will recognize as a parallel to that of the struggling, tragically alcoholic Jack Torrance of the novel - not the mustachio twisting villain of Kubrick's film - &new faces Abra Stone, Billy Freeman, Crow Daddy, Snakebite Andi &Rose the Hat.MF does his best to balance the narrative, but King's story is rich with detail &viewpoint. Narratively, The Knot - the tight knit order of psychic vampires driving the plot - overshadow our protagonists Danny &Abra's respective plights. Of note, there are no glaring storytelling missteps along the way, but this film isn't The Green Mile, anchored to one location &a simple theme. There's a lot happening of import ⁢'s all over the literal geographic map. Like most road trips there are side jaunts &colorful road attractions. It is a long haul, sometimes with jeopardy, interesting scenery chewing &all. Some devotees of Kubrick's precursor will take umbrage at this. But, this is a different story. One with an unexpected twist.SK had issue with the liberties Kubrick took with the best selling novel. The novel was not problematic, it was virtually perfect ∈ no need of revision. The opposite is the case in 2019. King's novel DS is problematic. It lacks a satisfying conclusion. Fortunately, Kubrick's inadequate resolution gave MF an opportunity to make right the mistakes of Kubrick's film &King's sequel. The fourth &fifth acts are that long awaited payoff. Nostalgia driven fans of the film will be rewarded, though not in the way they anticipate. We revisit two skeletons in Danny's closet. We've seen it in the previews. The other is a delightful surprise. MF also gives us the resolution that Constant Readers expected in 1980. \"It creeps\" up on us.Does the calculus finally give us the Grand Unified Theory of King's Universe? No, it merely extends the framework &displays a fundamental understanding of the author which eluded Kubrick. That tasks was Herculean &thankless given expectations set by two novels &a previous film. There isn't a single mistake in DS, on the page or on the screen. The dialogue &the performances are spot on. But, it's the theory - the premise of the story ultimately hamstrings MF. Regardless, he took his duty seriously &studiously - DS is a polished, entertaining movie which stands on its own merits. MF is a mindful custodian of the King's universe."
    },
    {
      "rating": "8",
      "text": "First of all, the editing in this film is just weird in the first half of it. I get it the movie has to tell three different stories but it would jump to the next scene so awkwardly. There were some really cool shots in this film that I wish I could talk about but trust me when I saw there are some shots that are brilliant in how they look. Now, the acting in this film was good from everybody and there was really only one-person who slightly blew me away and that was Ewan McGregor. He took everybody on a journey with this character. From the beginning of the film to the end you always feel bad for Dan and just want the best for him. Kyliegh Curran, I can see her doing great work in the future. Rebecca Ferguson did an okay job as Rose the hat but she doesn’t really become a standout until the end of the movie. The pacing in this film is definitely slow in the beginning and picks up the pace towards the end. I have to applaud the set designers for what they did to the Overlook Hotel. The musical score, done by the Newton Brothers, may not be as iconic as the original movie but you can hear elements from that movie. In the end, this movie is a good sequel to The Shining but if you want to watch this movie, I would recommend not watching the trailer because, in my opinion, it gave away a lot of the good parts of this movie."
    },
    {
      "rating": "7",
      "text": "Es buena, entretenida, la historia muy bien contada, si peca de ser muy larga. Pero el peor pecado es el cast, nunca funciona traer a los personajes de la original, pq ni siquiera se parecen."
    },
    {
      "rating": "10",
      "text": "Buena película pero como secuela del resplandor queda bastante lejos de la obra maestra que fue"
    },
    {
      "rating": "8",
      "text": "Doctor Sleep is a very interesting and intriguing film that is more thriller and drama than it is horror. Rather or not it is a worthy sequel to Kubrick's The Shinning is up you, as I highly recommend seeing this film. It is a good enough movie on its own which is something that movie sequels should be."
    },
    {
      "rating": "9",
      "text": "This Review is in spanish:Esta película es una secuela del libro El Resplandor. Pero si ponen atención también usa escenas de la película de El resplandor que esta basada en el mismo libro on su mismo nombre. Si son fans de Steven King les va a gustar. En mi opinión esta película es una de las mejores películas de 2019."
    },
    {
      "rating": "8",
      "text": "It wasn't the Shining, but it was a thoroughly entertaining movie! Nice nods to the original without overdoing it. If you loved the Shining you'll enjoy this as well."
    },
    {
      "rating": "8",
      "text": "Thrilling, disturbing, and overall satisfying, Doctor Sleep is a faithful adaption of Stephen King’s novel with just enough Kubrick to please movie nerds (like myself). The first half of the film is incredibly strong - anchored by a fantastic Rebecca Ferguson as the main antagonist - but does admittedly stumble towards the second half due to strange pacing and the rushing through of major developments. Despite Doctor Sleep’s occasional moments of weakness (either in the script or in the performances) the cinematography is stunning, the reconstruction of the Overlook is impressive, and the way the film pays tribute to Kubrick - from the opening notes to the credit music - successfully contextualizes this thriller within The Shining’s cinematic legacy. Kubrick’s vision was one of a kind - and mere hints of his genius sprinkled throughout Doctor Sleep are enough to remind us of this fact."
    },
    {
      "rating": "8",
      "text": "Flanagan directed the **** out of this and hits the mark splendidly. It's a good sequel to The Shining"
    },
    {
      "rating": "8",
      "text": "Can be weird at times but is overall a good movie. Connexions with the original movie are not as good as I expected. Otherwise it's entertaining."
    },
    {
      "rating": "10",
      "text": "¡Es fascinante! No me importó lo larga que fue porque me encantó en todos los aspectos, buenísima historia, impecable dirección, grandes actuaciones y con varios momentos que en lo personal me parecieron realmente perturbadores."
    },
    {
      "rating": "8",
      "text": "Does not have the strength of the Kubrick original 1980 movie but it is still supported by a plot that doesn´t leave loose ends or potholes, and strives to capture the viewer's  interest, with assorted details linked of original Shining. Some better than It Chapter 2."
    },
    {
      "rating": "1",
      "text": "There are no words to describe how bad this film is. The plot is a god awful derivative mashup of The Stand and It, with horrible effects, dodgy acting (Rebecca Ferguson is utterly unconvincing and Ewan McGregor sleepwalks through with line after line of exposition). Hell, they even threw in a bad Jack Nicholson impersonator. Then, like sprinkling some gold leaf on a dog turd, they had the cheek to intercut bits of the The Shining! Everyone involved should be ashamed."
    },
    {
      "rating": "2",
      "text": "Doctor Sleep piggybacks off of the nostalgia of \"The Shining\". This movie doesn't need to exist. It doesn't add anything interesting to the story and it's not scary in the least. The acting is underwhelming, as is the script. It's also way too long. All in all this was not a pleasant viewing experience and I would not recommend to anyone."
    },
    {
      "rating": "8",
      "text": "Good SequelIt's NOWHERE near as good as the 1980 classic, But Doctor Sleep is still satisfying."
    },
    {
      "rating": "6",
      "text": "It is the old style filmmaking residing between the temperament that warms the tea and whistles the kettle. I'd like to have a cup of that.Doctor SleepMike Flanagan who directed and adapted this controversial novelization for the screen is an apt choice to voice the second swing by Stephen King on Dan's character and the supernatural element it possesses. Why controversial? It actually is like being in a tug of war game where you are the price. But I think Flanagan found a sweet spot, that gray area that any horror director would love to have in plenty. And that is why his procedure that takes its time properly, gets the job done. It couldn't be more book-ish. It reeks of old book and I love every aspect of that. Each character, every fabric of information that stacks and builds the final countdown brick by brick is simply novelizing.No regrets. If you have to host a news show as such, you have to stage it like this. No need to celebrate or electrify, just words floating around, so loud, so big that even performance and other characteristics gets overlapped by King's vision. In this sense it feels, I don't want to say anti-Kubrick but definitely pro-King. But you can only walk far away if you are expecting for the audience to read this story on screen rather than experience.Ergo, comes these stills and thrills that has the mind bending look that appears like Stanley Kubrick's dream. The swooshing and whooshing of the adrenaline rush that warps these characters to their self-created reality and the deafening snapping of reality that wakes them up. Another asset is of course Ewan McGregor as Dan with this time axe on HIS hands. McGregor's performance is magnificent, child like it seems to me, even though he tells it to be inspired from Jack Nicholson's madness. He cries when he is terrified and falls for the easiest motion that exists. All in all, Doctor Sleep is a functioning system. You don't see that nowadays."
    },
    {
      "rating": "3",
      "text": "This is supposed to be a horror movie but the villains were not scary because the protagonist is more powerful than them from the beginning. They are all dispatched with ease. Boring characters and bland acting, especially compared to the The Shining. No suspense and mostly predictable with a few cool spots here and there. A very disappointing sequel to one of the best horrors ever."
    },
    {
      "rating": "9",
      "text": "Flanagan has delivered a truly special film here. Doctor Sleep manages to be both entertaining and profound, otherworldly yet grounded. By imbuing the source material with a more meditative atmosphere, Flanagan elevates an already great novel to a higher tier."
    },
    {
      "rating": "0",
      "text": "Terrible movie. Did they got a rejected script for X-Man about a Mary sue girl and old man Dan Xavier beats evil. Very disappointing, predictable and rides on original The shinning movie nostalgia. Not horror at all."
    }
  ]
}