{"id": 2857, "title": "Doctor Strange in the Multiverse of Madness", "starring": ["Benedict Cumberbatch", "Elizabeth Olsen"], "runtime": 126, "genre": ["Fantasy", "Action", "Adventure"], "description": "Doctor Strange, with the help of mystical allies both old and new, traverses the mind-bending and dangerous alternate realities of the Multiverse to confront a mysterious new adversary.", "releaseYear": "2022", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/9Gtg2DzBhmYamXBS1hKAhiwbBKS.jpg", "categories": {"plot": 1.3846153846153846, "acting": 0.7368421052631579, "ending": 0.0, "soundtrack": 3.0, "cinematography": 0.0, "familyFriendly": 1.0, "funny": 2.0, "action": 3.0}, "reviews": [{"rating": "2", "text": "Sam Raimi made a remake of evil dead with more money but no ideas, Loki series go much deeper and better in the multivers area, this movie is forgottenable..."}, {"rating": "0", "text": "Honestly Marvel movies are so bland and crappy now I will just leave this formula here so you can make Marvel at home rather than go out for it:Step 1: Take a popular well loved character give them their own movie but make sure they play second fiddle to literally every other characterStep 2: Introduce characters like America Chavez which no one likes or wants and skip literally 100s of better Marvel characters with decades of back stories because we gotta get in the newer woker charactersStep 3: Blow the whole budget on bad CGI throw it all over the place until no one knows whats going on and make sure if you didn't watch the previous movies/series you're extra confused (FYI I watched almost all those still didn't make sense)Step 4: Either grab an obscure one off villain or hey to switch it up why not destroy an existing hero and give her totally wack motivations to an insane nonsensical level (Seriously I get Wanda wants her kids back but she was never this much of a psychopath before at least on purpose)Step 5: Introduce characters people actually like such as Mr. Fantastic and Professor X. Kill them immediately god forbid they might start mansplaining or something. (Also why does Mr. Fantastic state Dr. Strange is from Earth-616? That is the comic book continuity not the MCU which is Earth-199999. Seriously Marvel you can't keep that straight how do you expect fans to?)Step 6: have the crappy character defeat the main villain for our hero because she couldn't control her powers but Dr. Strange gave her a pep talk so shes good to go now! Also defeat is a strong word more like show her the error of her ways or some BS.Step 7: Profit???? At least until you've sucked every last drop out of the superhero teet and the audience stops coming because all the characters they love have been pasted over by the newer woker versions. Unfortunately with each passing title it feels less Marvel and you feel the Disney claws sinking in deeper."}, {"rating": "6", "text": "Multiverse of Madness is an entertaining movie, but at the same time disappointing, I think they did well in terms of developing the stories of Wanda and Strange but failed to close the arc of the villain, Sam Raimi as director is a good choice, the script is too chaotic, the cameos are good, the third act is weak because they wasted the Scarlet Witch with that ambiguous ending."}, {"rating": "1", "text": "Very unsuccessful and bad fiction! Not a serious movie... I don't want to watch marvel movies anymore."}, {"rating": "2", "text": "A hallow plot of a movie that completely ignores the arcs of beloved characters and histories. Marvel is entering a phase of nothing matters anymore."}, {"rating": "1", "text": "why should I feel bad for this random ass girl we just met as compared 2 scarlet with who've known 4 years and the whole movie just feeling like a disjointed mess of idea"}, {"rating": "4", "text": "why the trailer feels more suspenseful then the actual movie, it feels so anticlimactic missing too much background info. honest opinion"}, {"rating": "0", "text": "These movies are starting to get old and predictable. I did not enjoyed this enough like the past tons of films and they're way too overrated. The MCU needs a break and I need a break either."}, {"rating": "3", "text": "Cringey, campy and cheesy. It's a movie that is hard to take seriously. The dialogue and the way it's delivered especially when trying to take itself seriously is laughable. The visual effects can be cool but are usually over the top and something from a Percy Jackson movie. Maybe it's time the MCU takes a break to find some originality and get away from the campy cash grab."}, {"rating": "3", "text": "Not a good movie, in fact it was bad. The assassination of the character wanda was done really bad, especially coming from wandavision. The jokes in the movie were many times out of place, the action fight scenes were fast and non impressive, and some were down right cringe to watch, like the music one, so out of place that took me away from enjoying the movie."}, {"rating": "2", "text": "I don’t believe that no one noticed such a bad pace of the story, maybe the problem is that the focus group is scared at every moment of violence, they tried to drama but in superhero films it looks just ridiculous. a lot of unnecessary references that only work for the fans, because of which they will definitely jump for happiness, but for the plot the significance is zero."}, {"rating": "3", "text": "A mess of a script which is probably due to Feige reshooting 80% of the movie over a few weeks, to remove a lot of Raimi's influence.  What we got was moronic, with plot driven contrivances being the main plot device.  There is little, if any continuity within the movie.  I am sure if the original footage was not intentionally deleted, the Raimi cut will be far better than this garbage.  This is Rise of Skywalker level stupid."}, {"rating": "0", "text": "Good plot, cheap directing. Copying scenes from different classic horror movies not only ruined the present movie but also is an insult to the old ones."}, {"rating": "7", "text": "I thought it was better and less generic than a lot of Marvel movies. Sam Raimi adds some style to his films that's missing from a lot of today's superhero movies. I thought the multiverse NYC was dumb but otherwise this movie was entertaining and exciting. Top-notch SFX."}, {"rating": "9", "text": "Awesome!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!111!!!!!!!!!!!!!!!!!!"}, {"rating": "9", "text": "It is always a pleasure to watch a movie from a talented director you love, like Same Raimi. The level of creativity and new ideas is just astonishing here. The cast is also awesome and performing well as a team, especially Benedict Cumberbatch and Elisabeth Olsen. This film is must watch."}, {"rating": "7", "text": "Первый фильм о Стрендже мне даже понравился. Вот решил оставить отзыв о втором.Ну сам фильм в принципе ничего себе. Красивый...Сюжет странноват. Завязка, ну ваще никакая. Ванду/Красную ведьму, вдруг обуревает материнский инстинкт и она находит среди миллиардов миров саму себя, только в роли матери двух детей. И теперь она готова уничтожить все миры и неисчислимое количество людских жизней, что бы вселиться в себя-мамашу и самой растить этих детей! Ну маразм. Кругом мужиков миллиарды, нарожай себе детей скока хош и выращивай из них кого хош. Тем более ты ж ведьма, хош мальчика, хош девочку. Но, как видно, это не наш выбор, мы к простейшему через тернии!Ещё я так понимаю, мультивселенные крепко засели в творчестве Marvel, это уже второй фильм об этих самых мульти. Правда авторы как то не могут определиться с этими мирами. Про последнего паучка уже писал, а в этом фильме в одной вселенной взяли и смешали все комиксы. Как попали Люди Х, Фантастическая четвёрка и Мстители в (даже не знаю как сказать) одно повествование? Ведь никогда, ни в одном фильме не говорилось о совместном сосуществовании этих героев. Выглядит странно и глупо.Конечно фильм пронизан \"прогрессивными\" ценностями. Тут и однополая семейка Америки Чавез, а бывшая невеста Стренджа выходит замуж..... ну конечно за чернокожего. Капитан \"америка\" превратился в Капитана \"британию\" только женщину, а капитан Марвел...о нет не в яйценосца, она конечно осталась женщиной только, барабанная дробь!, стала негритянкой! При этом как то потеряла в силе. Если в Мстителях даже Танос для неё был, так слабачком не достойным внимания, то сейчас одна из мстительниц, Вдова, раскатала её в лепешку одной рукой. Чо же тогда с Таносом так не вышло?Ну и неполная семья Ванды из параллельного мира в довесок. Всё это вообще можно, честно говоря, вырезать и на фильм это ни как не повлияет. Как будто сняли всё это непотребство отдельно, а потом натыкали в разные части фильма. Чтоб было. Пошлятина!Но если забить на весь этот маразм, то фильм смотрится бодрячком. Очень понравилась актриса играющая Америку. Вообще актёры, главные актёры, отыгрывают на отлично.Если кому понравился первый фильм, советую и этот. В противном случае вы ничего не потеряете."}, {"rating": "8", "text": "Doctor Strange in the Multiverse of Madness is an absolute blast! it wont appeal to all fans, but will appeal to some."}, {"rating": "10", "text": "Una película increíble. Una explosión de acción. Llena de efectos especiales que te envuelven y enamoran, visualmente espectacular. En esta nueva entrega del Dr. Strange los personajes van más cargados de humanidad y sentimientos. Espero con ansias la próxima película."}, {"rating": "9", "text": "If some of you was waching: What if...? then this movie is really good and this movie is for you."}, {"rating": "6", "text": "On one hand, I loved it. But on the other hand, this could have been so much more groundbreaking but Disney instead played it safe instead of taking risks and letting Raimi do his thing."}, {"rating": "8", "text": "This movie, with the fanservice that no way home has, people will call this movie the best movie ever created without a doubt. This movie is 1000 times better than no way home."}, {"rating": "7", "text": "The writing is bad but Sam Raimi's directing and style saved this film from being truly bad in my opinion."}, {"rating": "4", "text": "This movie is poorly written it has no real story it's what I refer to as and then movie it is just bounce around"}, {"rating": "0", "text": "There are so many silly scenes, logic errors and SJW references that there is nothing good in the movie other than the visual effects."}, {"rating": "0", "text": "This movie is extremely bad. Waste of time. Biggest problem being 0 logic. Main villain is too powerful but forgets to use her powers because why not."}, {"rating": "2", "text": "I have been a HUGE fan of Marvel Movies over the years. I am critical, but fair.  This was such a huge dissapointment. I dont understand why they didnt just give this a title of \"Wandas First Movie, with special guest Dr. Strange\".  If you are going to do something like this, just be honest with yourself and with the fans. Its really sad to see a company feel that the only way to get people in to the movie theater to watch a character that isnt popular, is to say its about Dr Strange, but then to really actually make it a movie about Wanda and that \"Latin-X\" girl.  Why doesnt Disney have enough confidence in Wanda or LatinX? Thats really sad to see. I am very upset with Disney and they are doing the Marvel universe dirty. oH ya.  the one good thing...its got cool effects."}, {"rating": "0", "text": "should've let scott derrickson direct it, sam raimi is goated but not with dr strange"}, {"rating": "0", "text": "I understand now why iTunes removed the Multiverse  from the “Movies” page. I would actually give this a negative rating if it were possible.This film was absolute crap. I had to force myself to watch to the end in disbelief, hoping against all hope  that it will eventually get better, but being disappointed at every single turn.There are no words to effectively express how poorly this movie sucked ass. I was excited to see the sequel to Doctor Strange, but instead, I was force-fed  what has become all-too-familiar Disney crap. As others have said, this was not a movie about Doctor Strange, but instead two very poorly developed female  characters. And I’m OK with well-developed heroines. But at least be honest with your viewership. I feel violated - like I was bait and switched with this piece of dung movie.Wait, what? You mean you didn’t watch the Disney+ series about WandaVision ? Neither did I, which is why I was completely ****ing lost the first half of the movie.I feel sorry for the actors in this movie who had to deal  with such a poorly written script. Horrid. Flat. Predictable. Lame. Barf."}, {"rating": "0", "text": "WTF was this movie? such a downfall of MCU after Endgame, now they start promoting LGBTQ characters, and they promote all this feminism OP characters that no one actually cares, but I guess it doesn't matter if the money are good, when the MCU became soo soft, and soo full of snowflakes. It's sad that MCU has gotten this way, I remember watching the movie for 30 minutes, and after this I walked out the cinema because I couldn't take it anymore, it was boring, lame and very very cringe. Sam Raimi should stop making Marvel movies. Two more movies like this and MCU is gonna get his last nail in the coffin. The story was very very bad, not relatable and not accurate at all. MCU after endgame is getting predictable and very old. Some of the scenes are soo cringe and goofy. An insult for the MCU fans. Like I said MCU became soo snowflakes. It's really makes me sad."}, {"rating": "0", "text": "One of the worst marvel movies, lately marvel is losing a lot of quality and focusing on issues outside the art of producing film"}, {"rating": "3", "text": "Waste of time. Simple plot with bad cgi. Nothing special for marvel fans, bad movie for the rest of us"}, {"rating": "0", "text": "Don't waste your time. This is another movie touched by the degenearte woke marxist mind. The story was garbage and the diversity hire actors were horrible. They are literally making movies now only to push the \"diversity\" agenda and nothing else. It is so blantanly obvious. No more focus on writing a great and interesting story, no more character development, no more memorable score, cinematography is all garbage...I could keep going. They are producing dumbster fires to shove a leftist agenda down people's throats. That's their only focus."}, {"rating": "1", "text": "This movie lost me in the first 5 minutes. It is a plothole filled, contrived collection of win and fail videos. The most egregious aspect is the utter incompetence and stupidity all the characters show throughout the whole movie. What a f****g waste considering the great visuals and performances."}, {"rating": "1", "text": "this is madness... worst scenario iv ever seen. don waste ur time for this sht"}, {"rating": "2", "text": "Nothing to see here except sjw doctor and agenda. MCU ended with Avengers:Endgame. Period."}, {"rating": "3", "text": "why did I watch this? This movie is poorly written it has no real story. These movies are starting to get old and predictable. I did not enjoyed this enough like the past tons of films and they're way too overrated."}, {"rating": "1", "text": "My disappointment won't allow me to talk much...Blah"}, {"rating": "0", "text": "This is an empty film, there is nothing to cling to in it, Disney and Feige are snickering from the fact that everyone licks their ass and there is no normal criticism. I will not use the slag, which is the entire 4 phase of Marvel (except for Spider-Man)."}, {"rating": "0", "text": "Inflation in food and gas prices...but with Marvel we now also have inflation in shark jumping, dei ex machina and matryoshka scenarii."}, {"rating": "1", "text": "Bringing Sam Raimi back after a million years was a mistake. I'm usually an MCU fanboy but this movie sucks hard. Horrible writing, (they re-wrote it when Raimi came on apparently,) lame humour and brimming with predictable tropes. Should have been a fun view into the multiverse, but felt like watching an hour of the constant blundering in a bad horror movie. Instead of Doctor Strange doing clever things we get tediously predictable CGI fireball battles and boring dialogue. Really can't stress enough how bad the dialogue is, there's a lot of decision making that's just straight up brain-dead and then minutes of pointless squabbling that follows.Also who made the decision to bring in America Chavez AKA the Marvel Universe's least liked character, (maybe Sam Raimi?) And the actor they used for her was pretty bad- there's a certain fainting scene that was highschool play caliber. It's one of the least forgettable scenes in the movie because it actually made me groan, where the rest of it failed to elicit a reaction.Compared to \"Spiderman: No Way Home\" this movie is a joke."}, {"rating": "2", "text": "Just another bait and switch movie. Got very bored with it and struggled to even finish it."}, {"rating": "0", "text": "Trash. I wish Disney would go bankrupt and sell marvel and star wars to a real studio. The positive reviews are very suspect here. I wonder how many of them are paid."}, {"rating": "2", "text": "basically anytime doctor strange himself was not in the scenes it was TOO unbearable to watch"}, {"rating": "0", "text": "What is this horrible mess? I couldn’t wait for it to end.I couldn't care about the characters and the “new” superheroes were laughable. Raimi did a very bad job with this movie. Marvel should have really stopped at Endgame...they just want to milk that cow."}, {"rating": "0", "text": "This was a very disappointing movie. I recommend you spend two hours doing anything else other than watching this. I think Disney needs to get out of the marvel business and sell to someone who knows how to make a superhero movie. Save your money save your time save your sanity. Watch something else."}, {"rating": "3", "text": "Every possible opportunity to insert Woke political views was inserted into this movie.   Outside of that, the plot, some of the actors and pacing were pretty awful.   It’s on Disney+, so if you have that and want to kill time, okay.   But it’s painful to watch Disney manipulate every property they have into Woke propaganda.    I grew up a Marvel and Star Wars fan and Disney has just about managed to kill my interest in those franchises."}, {"rating": "0", "text": "This is another **** movie from Disney Marvel group. This is movie is for retarded people not regular people."}, {"rating": "0", "text": "It sucked, they made reed Richard not so smart while also making black bolt die so easily when he is one of the strongest characters in marvel. Not to mention some of the dialogs are dumb, like when Wanda held a village as hostages, and the military came asking her to stop and she responds\"I'm not the one pointing guns\""}, {"rating": "3", "text": "The story of the movie was nonsenseIt was bad at all, not at all like Doctor Strange, it was just a fight between womenIt would have been better if the name of the movie was about Wanda Vision rather than Doctor StrangeSorry for the dumbass Marvel"}], "recommendations": ["the_matrix_resurrections", "wonder_woman_1984", "shadow_in_the_cloud", "teenage_mutant_ninja_turtles", "suicide_squad", "the_new_mutants", "the_emoji_movie", "the_day_the_earth_stood_still", "transformers_revenge_of_the_fallen", "the_mummy_tomb_of_the_dragon_emperor", "battleship", "legion", "national_treasure_book_of_secrets", "transformers_the_last_knight", "the_twilight_saga_breaking_dawn_part_1", "independence_day_resurgence", "dragonball_evolution", "the_twilight_saga_eclipse", "indiana_jones_and_the_kingdom_of_the_crystal_skull", "the_old_guard", "the_tomorrow_war", "2012", "geostorm", "poseidon", "space_jam_a_new_legacy"]}